{
    "id": 225,
    "video_id": "9IMmqLL-bxM",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "Anime and Crazy Fights - The GameOverGreggy Show Ep. 11",
    "description": "Wanna hear about the best anime? The time Greg was mean to a kid in a wheelchair? The time Tim's dad almost killed a guy? This show has it all!\n\nSUBSCRIBE/LIKE/SHARE/BUY T-SHIRTS: http://www.districtlines.com/gameovergreggy\n\nEach and every Monday, Greg, Colin, Nick, and Tim get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nSubscribe to our channel: http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy the MP3 version of the show on Band Camp: http://gameovergreggy.bandcamp.com\n\nMerchandise available for you body: http://www.districtlines.com/gameovergreggy\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\nNick - http://www.twitter.com/nick_scarpino\nTim - http://www.twitter.com/timgettys",
    "published_at": 1392645607,
    "duration": 6484,
    "transcript_chunks": [
        {
            "text": "what's up everybody welcome to the GameOverGreggy Show I'm one of your hosts Greg Miller alongside he only does everything Colin Moriarty hello what are you doing for what do you what are you only doing right now okay good you're just trying to find it very own my own application up next to Colin of course the pure one Tim Gettys I'm happy you're happy why are you happy Oh got some Girl Scout cookies oh look at some always good ones the new one the new craze is the Savannah Smiles the loud ones how about no I don't want this lemon powdered ones people trying to make me that lemons for these they it's hard in the streets no one is it that's not even what street are you in wait are you talking about the lemons that are powdered yeah you have electrons no I haven't had them yeah that's why oh yeah I buy my bottom as a let's try these let's give Sharon a new show by the way this is a producer next Rapinoe hey everyone these by the way yeah Samoa Joe's SMO Joe's yes Moses",
            "start": 0.78
        },
        {
            "text": "that's why oh yeah I buy my bottom as a let's try these let's give Samoas a new show by the way this is a producer next Rapinoe hey everyone these by the way yeah Samoa Joe's SMO Joe's yes Moana what do they call him Samoa Joe's they called Samoa Joe's I call Samoans aren't they it's the most is really mo is Samoas samosas yeah yes Moana are and he doesn't like empanadas Samoas are very polarizing it turns out yeah just giving Tim **** look and you don't like it our coconut thanks for just tuning out right there no it turns out though those are the number one cookie Girl Scout cookie that people don't make you a nice uh yeah otherwise they don't like they don't like I I and I'm basing this off of having asked like six people today around the office when the Girl Scouts came in and they they came in and like a horde there was like 30 of employer in office for some reason today but I was like oh I love these a lot the smells and it was disgusting then Mint number one oh yeah",
            "start": 46.53
        },
        {
            "text": "and they they came in and like a horde there was like 30 of employees in office for some reason today but I was like oh I love these a lot the smells and it was disgusting then Mint number one oh yeah everybody loves the Thin Mint well think people get only name - and that's Samoas in there and then Savannah Smiles they're dynamite here's here's here's how it went down at IGN the other day the Girl Scouts came in force today right however hard earlier this week some other guy who was in the new tech bargains area he set up a thing in the kitchen that was a picture of his daughter as a Girl Scout that said if you want he's go to my dad's desk you know whatever his name wasn't tech bar because I went over there and I'm like I will buy all the Savannahs is that what that was yes cuz for a second I thought it was like a Paul Walker like you know when someone gets in the water I Lance to buy it and I thought oh man someone's like daughter must have which do you want",
            "start": 101.91
        },
        {
            "text": "I thought it was like a Paul Walker, like when someone gets in the water and I'll buy it. And I thought, oh man, someone's daughter must have which do you want? Bold, you want this? Please, I guess I need it. So I go over there and I'm like, \"I'll buy all the Savannah Smiles you have.\" And he's like, \"I only have this one box.\" And I'm like, \"I'll buy that.\" He's like, \"I can bring more from home tomorrow,\" and I said, \"All right then, just me.\" And I'm like, \"How much?\" And he's like, \"$5.\" Then I'll spend $20. And he's like, \"All right, thank you.\" Oh my god, I see you want bullet yes, it's fine. Nobody cares. I remember when you're like, \"Oh, I keep straight now, don't get grumpy.\" Oh, like I'm like a switch, I just drop. Like I'm like, \"All right, give me $20 worth.\" He's like, \"All right, so I'll bring three boxes tomorrow to make a total of 20.\" And I'm like, \"No, on top of the box I'm buying right now, give you $20 tomorrow for four more boxes. It needs like great never have I going back there never.\"",
            "start": 139.9
        },
        {
            "text": "bring three boxes tomorrow to make a total of 20 I'm like no on top of the box I'm buying right now give you $20 tomorrow for four more boxes it needs like great never have I going back there never so he's lugged those back and I forget just realize that I still need to go give him $20 so when take the cookie I don't have the cookies either when did Girl Scout Cookies get reach the five dollar a box mark have they always been as expensive I've been poor before this is like the second year where I think I've been able to afford Girl Scout Cookies like somebody shows up I'm like oh here's I have money for that prior to like you know when I when I was younger someone would bring a box of Girl Scout Cookies and it was like eating at one of the world's best restaurants you just had to try some yeah right yeah I don't wanna take too many unless I'm like you know a slob let's partition them out I'd have half cookie give him half a cookie but now we're all just YouTube money oh yeah",
            "start": 190.57
        },
        {
            "text": "yeah right yeah I don't wanna take too many unless I'm like you know a slob let's partition them out I'd have half cookie a give him half a cookie but now we're all just YouTube money oh yeah we got that fat YouTube money this is the GameOverGreggy Show what happens is that once a week four best friends gather on the table each bringing a random topic of conversation that the others don't know about or sometimes do we talk it out for your amusement if you like that we sell the show as an MP3 a high-quality MP3, heck quality and equality hardcore are they over here MP3 that you can get on Friday for a dollar over at Game Over Greggy Bandcamp no Game Over Greggy Camped at calm then on Monday over at youtube.com slash gameovergreggy GameOverGreggy calm for short you can go watch the video if you're watching it right now you just saw Nick wander off like the wildebeest he is over there he's checking all the audios as usual and he's never happy as a perfectionist he's the one who caught",
            "start": 227.86
        },
        {
            "text": "if you're watching it right now you just saw Nick wander off like the wildebeest he is over there he's checking all the audios as usual and he's never happy as a perfectionist he's the one who caught the mic dive in the middle of it last time around so who wants to go first Colin you want me to go for it yeah yes yeah my camera last time you went first Tim always leads with someone culture I got someone about boobs my boobs boobs wasn't sexually fused all the time I think I think I've only had like two maybe three that were sexually in fear it's it's cuz of his age he's like so you're just going around the office and there's so many young people all over the place and your bodies are all rubbing up against each other Fredo yeah alright what do you after me call first is an aside a sidebar okay we have to come in to you yeah come to the approach the bench please no no please don't just I've sent you guys an important email correspondence yesterday okay with a very essential video I'm",
            "start": 279.52
        },
        {
            "text": "Okay, we have to come into your approach the bench please no, no, please don't just I've sent you guys an important email correspondence yesterday okay with a very essential video. I'm curious what your thoughts about the video were if you remember last week on The GameOverGreggy Show we talked about cartoons and theme songs, whatnots. Colin was talking about how he thought the G.I. Joe movie had the best opening of all time with him fighting around the Statue of Liberty. He finally remembered to send it to me, what I emailed you back on this thread was immediately mind-boggling to me is that I downloaded this song back in the day, I knew the song word for word. Oh yeah, I know, I downloaded College Dude Get Drunk - okay so I didn't realize it was from the movie or whatever, I never seen the movie, it was dope. You bet it happened in the movie, I would have liked that quite a bit. Yeah, I've been awesome right all that like the Vipers are jumping like the ship goes in front of",
            "start": 326.23
        },
        {
            "text": "seen the movie it was dope you bet it happen in the movie I would have liked that quite a bit yeah I've been awesome right all that like the the Vipers are jump like the the ship goes in front of the Moon and all the Vipers jump out of it I didn't watch the COBRA semi but I I know the Crimson Guard punches the camera by the way I was uh I was a little shamed myself that I mean so it was there was an overwhelming amount of people that came to your defense on the whole Firefly yeah yeah well because you're wrong about Firefly I might I'm gonna I'm gonna concede that I misjudged Firefly I just don't think he's the best but I definitely look like he's the worst I think I went on record as saying I don't know who he is he's a chump and now like 50 people said you're out of your mind check this out this Hobbs is he looks cool I'll give you that I'll give you that he's pretty high ranking in the corporate organization - I think he's like well no no no it's like Cobra Commander and Destro yeah",
            "start": 380.95
        },
        {
            "text": "Out this Emile is he looks cool, I'll give you that. I'll give you that he's pretty high-ranking in the corporate organization - I think he's like well no no no it's like Cobra Commander and Destro yeah and then you have like you know the you know on the side are kind of like you know Zartan and all those guys but they have a major blood what about where's Baroness and all this Baroness she's up there yeah she's up she's up there she's around you know where Destro is you know you have major blood you have Dr. Mindbender but and then somewhere in there comes Firefly, Storm Shadow yeah Caesar shadow I always thought was like which was an amazing he was high up yeah he wants to know he's but he was always like I'll do my thing if any do my thing I'll put my thing down I'll coming up on my thing down but that's all you're getting you know he was it makes no sense what I just said makes zero do their job but they're not going above and beyond die he's not going you know your question that\n\nI corrected the following:\n\n* \"Emil\" to \"Emile\", which is a more common name in the context of the G.I. Joe franchise.\n* \"Cobra Commander and destro\" to \"Cobra Commander and Destro\", capitalizing the proper noun \"Destro\".\n* \"Zartan and all those guys but they have a major blood\" to \"Zartan and all those guys but they have a major bloodline\", correcting the spelling error.\n* \"Baroness she's up there yeah she's up she's up there she's around you know where destro is\" to keep the original text, as it appears to be a fragment of a sentence that was not fully corrected. However, I did capitalize \"Destro\".\n* \"Ceaser shadow\" to \"Caesar Shadow\", correcting the spelling error and capitalizing the proper noun.\n* \"Firefly in Storm Shadow\" to separate the two names, as they are distinct characters in the G.I. Joe franchise.\n* \"Dr. Mindbender but and then somewhere in there comes Firefly\" to keep the original text, as it appears to be a fragment of a sentence that was not fully corrected.\n* No other changes were made, as the original text appeared to be coherent and accurate in its representation of the conversation.",
            "start": 423.52
        },
        {
            "text": "down but that's all you're getting you know he was it makes no sense what I just said makes zero do their job but they're not going above and beyond die he's not going you know your question that clip blew my mind yeah I was like so I even said this last week I think it was last weekend I don't like G.I. Joe I never liked GOG because they don't have all the transformers they don't have enough of them on it and yeah but there was always the crossovers between them because the same people made him and all that stuff and I hated those crossovers only oh this is gonna suck stupid G.I. Joes and then I saw that I'm like this is just like Transformers this is awesome wait am I not watch G.I. Joe back in the day no I disliked it and they were like those two shows you didn't either or you guys do they just went together like peanut butter jelly I didn't like either didn't watch either it's cuz you were like this when will they make a cool Ghostbusters movie there he did was called The Real Ghostbusters",
            "start": 460.21
        },
        {
            "text": "went together like peanut butter jelly I didn't like either didn't watch either it's cuz you were like this when will they make a cool Ghostbusters cuckoo there he did was called Real Ghostbusters and then they made the first one before that and it was terrible then you were like it was cash in let's get her on the copyright job which I salute the people who did that cuz that's a brilliant idea they're in if we were doing that right now some like huge movie was coming out we're like let's make a cartoon with the same name I found a loophole okay it's just a gorilla in it I'm so fascinated by your grocery is great like the movies or you know the first two anyway we're awesome but what the Ghostbusters was great the movies what the Carters have come down hard on the car - oh well you know the games I played were not very good in it and the cartoon was fine we can watch 3d one the one that I like the real one the Real Ghostbusters the videogame they came out that like no a Toro yeah",
            "start": 507.64
        },
        {
            "text": "games I played were not very good in it and the cartoon was fine we can watch 3D one, the one that I like, the real Ghostbusters videogame; they came out with no Toro, yeah, yeah, that's a good game but it's just so weird that that's like your thing, like yeah Ghostbusters is you think based on I had a cool car and 100 minutes of Japan and me GI Joe had 12 years of toys in like eight years of cartoons, like 24 those run a long time they had a lot of cool toys to the firehouse, the Ecto-1; it's just a weird IP, it's a great I'm saying it's like that's the one you latch onto yeah I understand Turtles yes Warmers okay that's even a spirit you can understand Ghostbusters because it's just it's the if you're a kid it's just the belief of that you could do that that those are normal people doing that GI Joes aren't no normal people Ninja Turtles aren't no normal people you trying to tell me Bazooka wasn't a normal person yeah he's knowing",
            "start": 548.63
        },
        {
            "text": "you could do that those are normal people doing that GI Joes aren't no normal people Ninja Turtles aren't no normal people you trying to tell me bazooka wasn't a normal person yeah he's knowing Egon Spengler went gray had that lint Ray had to mortgage the house he grew up in born in that house you got Duke you got GI Joes who were having a moment I know those three who do you think at the coolest wait Duke Flynn who Flint and General Hawk Hawk was their Falcon I don't remember there being a Lieutenant Falcon maybe they're found yes let us know if there was a Falcon I've seen but I hope I'm actually just seeing Flint I always thought Flint was the coolest what was because he had the little beret yeah liking it in like a cool way it was good he was good dude was awesome to Hillary our old editor-in-chief he's always talking about the moment in the GI Joe movie when Serpentor stabs Duke you know talking about think so yeah he stabs him it was clear he was supposed to",
            "start": 597.35
        },
        {
            "text": "Greg Miller, our old editor-in-chief, he's always talking about the moment in the G.I. Joe movie when Serpentor stabs Duke, you know, talking about think so yeah he stabs him it was clear he was supposed to die right but Duke is like one of the most popular characters and so there's like this amazing dub and I went back and listened to when he was right about this like he goes you know like you know you've stabbed and whatever in the Joe's like come around everybody's like Duke is in a coma like Duke was killed or do you know Dukes dead this is a new movie it's like do Barbies daddy's in a coma yeah it's they brought him back it's um Tim, to just bring you up to speed, Duke was later portrayed by Channing Tatum in the film series also died he actually dies in the second movie spoilers huh yeah but he got so popular first one the second one they wrote him in flashbacks know the whole movie and before the first act from to be in was weird wait so what do you guys",
            "start": 644.03
        },
        {
            "text": "he got so popular first one the second one they wrote him in **** yeah they're like James flashbacks know the whole movie and before the first act from to be in was weird wait so what do you guys thoughts in the Transformers movie the original one yes the cartoon 1984 oh that was awesome yeah you got the snuff you got a boo by yeah that's what I heard the first movie so I was like it taught me about death yeah that was one of the first movies I cried it tells me that that one in robot and Robotech the series Robotech which I'll defend with my life I love that series awesome but two of their like Optimus Prime dying and spoilers boy folk are dying in Robo tech well I was like oh my god nothing's forever hold your hand like nothing's forever I was like no no leave me woman with me like I'm dead to the world not only does Optimus die but they kill half the entire cast they destroy him of the first three seasons of the show in the first 15 minutes of the movie and",
            "start": 693.76
        },
        {
            "text": "woman with me like I'm dead to the world not only does Optimus Prime die but they kill half the entire cast they destroy him of the first three seasons of the show in the first 15 minutes of the movie and introduced a whole bunch of new toys and that's awesome well they had to let Hasbro oh yeah for sure but like that's crazy like I hope they killed everybody they killed our not not Ironhide Starscream Starscream dies in the best way ever though he's by dollars with the coolest deaths by the way is Starscream trash compactor best or greatest name in any cartoon yes sir she was one of the Starscream's the best transformers name I always wanted what I was a little kid there was a few pet ideas that I had I never got to excuse my cat's name was Chumlee and I wanted I got a iguana got a keV pet plans I need to execute a nice daddy to read my mom gave me I got a cat for my birthday and I named her Chumlee and she'd cat step dude named it Chumlee and she lived a little 2009 and I have an urn of her in my",
            "start": 750.14
        },
        {
            "text": "to execute a nice day to read my mom gave me I got a cat for my birthday and I named her Chumlee and she'd step on dude named it Chumlee and she lived a little 2009 and I have an urn of her in my room it was very sad but I was stardustier was one of the names I thought would be awesome for Starscream is about four years old and Palam were also names that I wanted to use poor man Palmer from Final Fantasy IV and their twin mages once a black mage and I was about people to get a white and black hat and name him Poor Man, that's an aside though Greg my main topic here we go has to do with this seems somewhat timely I wish it was a little more timely but it's it's timely enough Russia the Olympics no no talk about the Olympics our son no last week Bill Nye the Science Guy Ken Ham who's a famous creationist who thinks the earth is 6,000 years old yeah and I was fasting I was riveted by watching the whole two and a half hours of it then I went back and",
            "start": 796.71
        },
        {
            "text": "the Science Guy Bill Nye who's a famous creationist who thinks the earth is 6,000 years old yeah and I was fasting I was riveted by a watch the whole two and a half hours of it then I went back and watched old Bill Nye vs. Ken Ham ridiculous you know commentaries and and debates and all these things his post game thing they did afterwards were he's gloating that he thinks he won and all the ship I'm just curious if you guys heard or saw about this in and what your opinion on creationism is in regards and vs. evolution Darwin's theory of evolution widget now walk us through the core concepts of creationism cuz I don't want to misspeak on this is one of those polarizing issues where if you say the wrong thing people come and just blast you this so educate so creationism is a fundamentally Christian belief that takes Genesis the book of Genesis the first book in the Old Testament as the creation record basically the first you know few books of Genesis first few chapters of Genesis you know the earth",
            "start": 846.84
        },
        {
            "text": "that takes Genesis, the Book of Genesis, the first book in the Old Testament as the creation record basically the first few books of Genesis, the first few chapters of Genesis. You know, the earth wasn't made, you know, first there was void and water and the earth and the Sun God since six days on the seventh day he rested. And most people I think take this as, you know, at least that it's an analogy that the days aren't real days and all this kind of stuff right? Right like you're saying yeah EPA yes is it never I've read it but never said it knows anything so basically these creationists they like take it literally and using like their own Bible math basically have extrapolated that the Earth's about six thousand years old, that there was a massive global flood no was Noah's Ark about 4,500 years ago right that humans and dinosaurs lived at the same time that the fossil record isn't definitive that you know the only",
            "start": 894.99
        },
        {
            "text": "there was a massive global flood no was Noah's Ark about 4,500 years ago right that humans and dinosaurs lived at the same time that the fossil record isn't definitive that you know the only will happen the only reason why I would say that I would even come close to agreeing with creationism is because it allows for the theory that Land of the Lost could actually be a real thing and I loved that show so much not because I like the show but because I was terrified of the situation they were in and I just desperately wanted to see them get home that was it so I'll bring it that's all I got for that okay uh no I think that I'm sorry Greg were you talking you had a you took a breath there well usually when you say that's all I got I assume somebody's got to pick up the baton you've got some more in the tank let it out that's all I got no I think it's I think it's I think it's just so hard when people really believe in and something like creationism it's so hard for me to understand how they",
            "start": 952.6
        },
        {
            "text": "in the tank let it out that's all I got no I think it's I think it's I think it's just so hard when people really believe in and something like creationism it's so hard for me to understand how they can just blindly believe in that I don't get it yeah I don't eat I'm ants a good way of putting Greg I agree with Nick I mean that was the thing you know I always talk about you know I went to Catholic school my entire existence till Mizzou so that's 13 years of private school or religion class masses everything the whole whole nine yards at no point in that did anyone for a second in science class go excuse me what about Genesis doesn't it like you know you read that story you you read the Bible and you take away the lessons from and apply them to your life and try to be a better person that's like what you'd like to do right and in Oakland at no point in religion in a lesson class which I again took for 13 years did anyone say what you were learning isn't science isn't true that's why it",
            "start": 998.38
        },
        {
            "text": "what you'd like to do right and in Oakland at no point in religion class which I again took for 13 years did anyone say what you were learning a science isn't isn't true that's why it was so ridiculous to meet I remember when they started flaring out the first time you know now quite a while ago but I remember I was already out of high school I was into college maybe even out of college when you first started really hearing about a creationist movement it was just like at no point was that offered to me as this these I never learned both things and said oh they don't fit together for me you know they did fit together fine you know I mean like I don't I didn't take the book of Genesis at its word right like again I think that I've which I've read many times in these shows right that there I think God in some ways started the universe did all this I don't I don't understand how there's something from nothing but at no point do I really think that it was like all right Adam",
            "start": 1043.5
        },
        {
            "text": "that there, I think God in some ways started the universe did all this. I don't understand how there's something from nothing, but at no point do I really think that it was like all right Adam, right Eve, go do your thing, you know? I mean, those were real people, and there was evolution - you evolved from a single-cell organism and all these things, yada yada yada. That makes sense to me and works within the framework of Christianity in the Bible and what they're talking about in religion, you know? I mean, so now to get to this point where there are people who are saying this - not like when you're with a fossil record, it doesn't... God hid the dinosaur bones and did all this stuff. That's something that's really weird. You don't... I mean, I understand why you don't want... I'm not against it, you know? I mean, I know this is what you talk about in the conversational call about religion ghosts episode - the fact that you know to",
            "start": 1082.69
        },
        {
            "text": "I understand why you don't want I don't I'm not against it you know I mean I know this is what you talk about in the conversational call about religion ghosts episode is the fact that you know to you religion across the board doesn't make any sense right and I think there's something to be said for that one like all the people always want to attack Scientology it's like again let's turn the lens back around into Christianity or any you know Judaism or anything there's a lot of weeps of fate but you know I mean it all these things I'm not gonna sit here and say Scientologists have it completely wrong but to ignore the evidence that we have of what has happened to act like that doesn't exist and that doesn't matter that's a weird thing for me whatever God that sometimes the argument what it's like if the earth is only 6,000 years old then then that all the evidence in the geological record that the fossil record is you go deeper and deeper in like over hundreds of millions",
            "start": 1120.01
        },
        {
            "text": "what it's like if the earth is only 6,000 years old then then that all the evidence in the geological record that the fossil record is you go deeper and deeper in like over hundreds of millions a year yeah was all like put there by God or it's always been there or it's happened much quicker and we don't you know what we think takes geologically millions of years took hundreds of years or something like that right it's stupid don't get me wrong by the way like I think that there is good that organized religion does more and there's a difference between what we're talking about like hardcore people that believe in hardcore creationism or vs. people that subscribe to organized religion is named thing right I think organized religion does a lot of good but what I don't like what I like about science I should say I guess what I don't like about religion what I like about science is that science questions everything that is the whole point of science right even most things",
            "start": 1158.79
        },
        {
            "text": "I like about science I should say I guess what I don't like about religion. What I like about science is that science questions everything, that's the whole point of science, right? Even most things that they prove, they'll still say there's a varying doubt as to whether or not this is fact. Like, there's a lot of people say there is no such thing as scientific fact; it's just been proven so often that we just take it as fact if that makes sense. Everything still has a degree of error in science if that makes sense. That's what I like about science. That's why when people start talking about the world, it's okay for science to say we don't know. We don't know what happened; we think there was a giant explosion that caused... we don't know what caused it; we don't know if it was before it. This is the extent of our knowledge, but we're gonna keep figuring it out, and you know that kind of taps into the human spirit. That's what we... that's what we're here for. That's what makes us human; we question everything.",
            "start": 1203.33
        },
        {
            "text": "of our knowledge but we're gonna keep figuring it out and you know that kind of taps into the human spirit, that's what we're here for, that's what makes us human. We question everything, we're curious - some curiosity, but when people get on any issue, when they get to binary or it's either my way or the highway, right? That's what I have a problem with. And you know, most people will tell you, most people who are Catholic or Christian will say the Bible is not word-for-word, we don't believe more for Adam and Eve - a lot of people believe it. Some people will say, \"Look, that's this is you know a metaphor, you know it's metaphorically speaking, or its metaphor for good and evil.\" That's for women screwing it all up for us. Well I mean that's that's fact. You can see that even to this day. One Ring did women... I thought Adam took the thief took it. Yeah yeah okay she's the scale she took it. And you gave it to him",
            "start": 1242.69
        },
        {
            "text": "That's a fact, you can see that even to this day, you sure can. Oh, there it is, one ring did women I thought Adam took the thief took it, yeah, yeah, okay. She's the scale; she took it. Oh, and you gave it to him. She was like, \"Check this out, I got this cherry for you.\" It was in an epaulette, so my cherry. Alright, well, it was a good episode, but so I'm assuming Boy Bill was the one on evolution's side, right? Yeah, so okay, so how did... How'd that conversation go? Mike, did you say \"my boy Bill\"? No, I said... Oh, this is Bill Nye, The Science Guy. I did say that my boy; you really he said \"my boy.\" Okay, sorry, yeah, you was the argument was frustrating me because you know Ken Ham's not an idiot and he actually presented really well, a lot better actually than Bill Nye did in terms of his PowerPoint presentation and his what... But it's because he asked like the way he progresses his argument is to have an answer for everything, you know, like you know paired for every little thing that doesn't make any sense.",
            "start": 1287.93
        },
        {
            "text": "in his what but it's because he asked like the way he progresses his argument is to he has an answer for everything you know like you know paired for every little thing that doesn't make any sense you know and he like has a way out of it and basically he just ignores all the evidence so they not frustrated me the most out of all the things that frustrated me in this argument he had was he was looking this you know he's thought about space right and I'm starting to tell a little bit about this last week but space is all history when your viewing is history right and The Sun, the sun's light when it leaves the Sun left 11 minutes ago by the time it gets here right so you're looking at The Sun eleven minutes ago when a light if it did hit traffic three you're looking at everything away that you're actually seeing things from photons that left this on eleven minutes ago right the moon three seconds ago and what's happening now huh the door is opening we don't have to ask my",
            "start": 1336.15
        },
        {
            "text": "actually seeing things from photons that left this on eleven minutes ago right the moon three seconds ago and what's happening on some of that huh the door is opening we don't have to ask my girlfriend even thank you you want to bring it in you shield your face from the camera you've never been shown on camera for it to me you just hand me wait wait you have to come let's go drop it's gone alright everybody so now we can narrow the search down to a white girl friend I get it yes the thing that really bothered me just to go back to real quick I'll finish up and then we'll move on no it's just that I still want to have someone ask you about the stars or redshifting like you can see that they're moving away there's background cosmic radiation that is the leftovers from the Big Bang like there's all of this stuff just in space look at the moon it's cratered with ancient asteroid collision okay the moon don't we see that we saw the backside of the moon which is even worse",
            "start": 1379.92
        },
        {
            "text": "all of this stuff just in space look at the moon it's cratered with ancient asteroid collision okay the moon don't we see that we saw the backside of the moon which is even worse The Dark Side of the Moon is way cratered like the surface of Mercury craters are really bad you know and just like it annoys me that this guy just you know propagates the pseudoscience that is just totally false and it's it's frustrating too because like what the most fascinating thing I saw actually was I saw a debate with Ken Ham against old earth creationists which are creationists that accept that the earth is giving us certain evidence that the earth is really old The Earth is 5 billion years old you know and the universe is 13.6 billion years old not 6,000 that's impossible just impossible you know and it and that was really enlightening because there's these guys that are actually interpreting the Bible and being like but the Genesis account",
            "start": 1434.46
        },
        {
            "text": "impossible just **** impossible you know and it and that was really enlightening argue because there's these guys that are actually interpreting the Bible and being like but the Genesis is one guy was making an argument that Genesis isn't the only important thing because there's all these other things in the Bible in the Old and New Testament that speak to creation you can't just ignore all that because Genesis is what's convenient for you to listen to that there was that that the earth is millions or billions of years old in the Bible and that you know a lot of these things might be analogies or stories you know yeah there's a great book I recommend everyone reading I read in college I took a few Bible classes in college those really fascinated by one of the books is aptly called \"Who Wrote the Bible\" and it's about the Pentateuch specifically when Finland saves the first five books of the Old Testament and who wrote them and they figured out who wrote these books based on how they",
            "start": 1477.57
        },
        {
            "text": "Wrote the Bible, and it's about the Pentateuch specifically when Moses saved the first five books of the Old Testament, and who wrote them. They figured out who wrote these books based on how they were written and all, and put together in all these things so we know humans wrote them. Then in their fabul, they certainly weren't talking to Moses, and they certainly weren't on the ark which somehow had every animal on it except a unicorn. Yeah, yeah, see the ark thing right? I was like that's always a hang-up for people right, of like, like that has any sense. And I agree, the whole world didn't flood maybe a section of their tiny world when they could barely understand the world flooded and they did have but then he's like yeah you know a horse on there and a pig and they you know I mean like then that story like gets bigger and bigger and crazier and crazier. And then why did he have this argument, you know, there's a million things that people always like we're gonna find.\n\nI corrected the following errors:\n\n* \"Finland\" to \"Moses\", as it is more likely that Moses was the one who saved the first five books of the Old Testament.\n* \"Fabul\" to no change (it seems to be a typo or a made-up word, but I left it as is since it's not clear what it should be).\n* \"unicorn\" to lowercase, as it's not a proper noun and doesn't need capitalization.\n* Added missing articles (\"the\") for clarity and grammar.",
            "start": 1514.05
        },
        {
            "text": "know I mean like then that story gets bigger and bigger and crazier and crazier, and then why did he have this argument? You know, there's a million things that people always say we're gonna find Noah's Ark, and it's like you're going to find it, are you gonna speak it's gonna mean that improve a member. That Tony Danza movie - I know about the one where he was the field goal kicker. Don Johnson, no, last night I cued up all the Highlander movies on different screens and started watching the second one first. I don't even watch the first island right? We're so right calling it one, yeah. Here's my question for you: well how do you get around this and the fact that people want to talk? Then do you know it's so because the argument is that like Nick was saying, right, that Darwin's theory is a theory - you know I mean there's an it isn't conclusive rule. And when you're you when a creationist is getting all oh, and when Mr. Humes gets all up in atoms, so how this is the same way with the creationist theory as well, right?",
            "start": 1555.87
        },
        {
            "text": "an it isn't conclusive rule and when you're talking to a creationist who's getting all up in arms, so how this is the same way with the creationist theory as well, right? I guess. But like, this is what the point that we're making, and I think this is an interesting point to make: that a theory in science has a definition that means it's basically fact because the idea is the theory is testable and never fails, right? Like they were saying, Isaac Newton's theory of gravity is a theory - you'll never ever see an object fall up. Maybe there are exceptions, but it's still considered a theory, right, exactly, because we can't see gravity; we just know it's there, you know? Because everything points to it. And they weren't saying about evolution, which is fascinating: that like whenever they find something that they think is gonna **** with your theory of evolution",
            "start": 1601.63
        },
        {
            "text": "points to it and they weren't they were saying about evolution which is fascinating is that like whenever they find something that like they think it's gonna **** with your theory of evolution it actually pans out and the biggest thing that they discovered was genes like the genome one of the examples that they use in this great episode of Nova about what was going on in Dover Pennsylvania when they were fighting over creationism versus evolution in school yeah well as they came they they were talking about like different apes and monkeys and humans and how if evolution was true that they'd all have similar numbers of chromosomes in their genes and they realized that humans actually had one less, twenty-three, and I'm like this is it this is actually gonna destroy evolution because this is conclusively not true or otherwise they humans would be similar to apes what do you love me Tony Danza know in 1998",
            "start": 1645.31
        },
        {
            "text": "and I'm like, \"this is it, this is actually gonna destroy evolution because this is conclusively not true or otherwise they humans would be similar to Apes\" what do you love me? Tony Danza, know in the 1998 film I wouldn't look for images that's not Tony Danza, yeah no totally is Tony Danza. I would remember not so he Nana, that's definitely not him from the movie, no it's not from no no everybody goes \"Tony Danza\" on your Google device as a site and scroll down past all the Noah posters and the fourth row has Tony Danza just in his boxing clothes getting sexy. Two things: one, Tony Danza still looks good; frizzy yeah - if you could go back and be either Tony Danza or Scott Baio who would you be? Tony Danza, Colin I'm sorry, Scott Baio or Tony Danza who would you rather be? I mean you're gonna look like that at one point, that's Tony Dane come on Tony - Tony Danza looks better from day one - Dana no offense - Mr. Bay oh yeah baby great - yeah let's go babe I'm judging this completely on YouTube cameos damn",
            "start": 1682.15
        },
        {
            "text": "at one point that's Tony Danza, come on Tony - Tony Danza looks better from day one - Dana, no offense, Mr. Bay oh yeah baby great - yeah let's go babe I'm judging this completely on YouTube cameos damn it Scott Baio you know in a Taryn Southern video yeah called wrong hole and it's a song about him putting it in the wrong hole yeah Scotty but Tony Danza was in a Bratz and burrata video where they're in a car and Tiny Dancer by Elton John's playing and they're all singing oh yeah a jar they stole from Friends and then but then Tony Danza just looks at me like yeah this is happening I love that to be fair I thought he was sane, cookie we're like the mid-80s that's true but Friends was the first person to actually make that joke on the air just wanted to remember that horrible show a horrible show go back and watch it doesn't is always bad I mean that's the thing that was always but Friends is not bad Friends holds up I mean it's a level of humor it always was also Rachel was hot, Rachel",
            "start": 1734.53
        },
        {
            "text": "The GameOverGreggy Show Ep. 11 - Anime and Crazy Fights\nshow go back and watch it doesn't is always bad I mean that's the thing that was always but Friends is not bad, Friends holds up I mean it's a level of humor it always was also Rachel was hot, Rachel wasn't really hot - yeah uh sorry bring it back to Matt little wampum yeah I it's one of those things where when you're arguing with someone like Tim argues with me sometimes Spectacular Spider-Man's better Nick we're not talking about this but move on better let's get past that Ultimate Spider-Man it's a better series Don defended I sometimes make Spider-Man in the 90s I will sometimes make things up that all the nineties Spider-Man active trivia question for you who was that guitar player Aerosmith guy yeah yeah Joe somebody Slash growing up it wasn't so that way you just said Slash I was gonna say Slash yeah but you do you want you didn't know you didn't you were gonna say so you said /i very clearly hurt sometimes one guy I wasn't in here sometimes when they get to like",
            "start": 1780.63
        },
        {
            "text": "slash I was gonna say slash yeah but you do you want you didn't know you didn't you were gonna say so you said /i very clearly hurt sometimes one guy I wasn't in here sometimes when they get to like night like awesome eighties rock songs even this irregardless of the fact that whether it's whether not it's Guns N' Roses I don't care I just say slash on the guitar sometimes I assign Billy Joel songs he didn't write to did yeah I know that's why I gets confusing can you believe you got talk **** about Billy Joel Claudia Schiffer Claudia Schiffer yeah talking talented he's a talented man and then she like she was the Uptown Girl right yeah that's weird I'm saying you talk she's not Billy Joel you I'm getting that bottle over my head yeah don't even don't even cap it because I'm not gonna say to Big Bad it was long he's right a Long Island he really is the pride of all he's the biggest thing that ever came from long he's got his own manner and everyone loves him yeah that's what I",
            "start": 1846.31
        },
        {
            "text": "say to Big Bad it was long he's right a Long Island he really is the pride of all he's the biggest thing that ever came from Long Island he's got his own manner and everyone loves him yeah that's what I love seeing where the Islanders play there's just a banner in that there's all of these like Stanley Cup banners and all these division win banners and all these retired numbers and then just the banner it says Billy Joel that's awesome but yeah that's what I wanted Missouri no that's like the same they have in Canada right or it's just like a bunch of hockey players no one's heard of Georges St-Pierre and then just Bieber yep it just said welcomes in Beaver right because they're deporting his ass are they still doing that they're not gonna put the pointy end up there's a conversation with Colin coming up about this it'll set you straight you might have edited that didn't it aren't actually I did it that's why I asked the question okay link here said anyway real quick I don't wanna I",
            "start": 1895.3
        },
        {
            "text": "Colin coming up about this, it'll set you straight. You might have edited that, didn't it? Aren't actually I did it, that's why I asked the question okay. Link here said anyway real quick, I don't wanna I want to finish my ape story and then we can move on. Oh yeah or no, the chromosome is written 24 Crinimal genome said I started five minutes ago. It's critical they thought that this was gonna disprove everything right and then they found out that through the chromosomes fused, that's one way you could identify like there's the I'm not a scientist believe it or not but there's like definitive ends of like of these strands and middles of the strands that they can identify under it like you know microscopes. And they found out they found that one of the ends of the of the one of the ends of one of the strands was in the middle of another strand and therefore they fused so there were 23 right and so like it's an action evolution from apes and that might be how we formed you know",
            "start": 1932.65
        },
        {
            "text": "\"ends of one of the strands was in the middle of another strand and therefore they fused so there were 23 right and so like it's an action evolution from apes and that might be how we formed you know interesting and so it actually proved the theory and everything they find proves the theory right and the thing that Bill Nye kept bringing up was that you can't prove it you can't prove it in fact everything says that you're wrong and your science can't predict anything you know like you can't predict anything the point he was making was you know there there's never like in the fossil record under the layers nothing ever crosses over there's no like fossil a in strand a is never found in strands right and the fossil has never ever ever and you're saying if you could find one example of some animal and where it doesn't belong and you would prove your maybe that you know evolution is wrong but you can't cuz it doesn't exist because it's like millions and millions you're right does it happen\"",
            "start": 1973.6
        },
        {
            "text": "and where it doesn't belong and you would prove your maybe that you know evolution is wrong but you can't cuz it doesn't exist because it's like millions and millions you're right does it happen right oh yeah that and it was it was just a fad I recommend everyone go watch that and read up on it I got iced got sucked into the rabbit hole this weekend by I watched so much Walkman is it I watched a literally 50 now where do we find this if we want you could so just you can YouTube Ken Ham versus Bill Nye that the things on there it was a live stream yeah it was and it's on it's on YouTube there it is and and then you can YouTube Nova about creationism versus evolution - that's really good and then I recommend people watch and you can learn a little bit more about it it's not to say like I agree with you religion is good and you know Bill Nye was making the point that billions of people that believe in God don't believe in",
            "start": 2016.47
        },
        {
            "text": "you can learn a little bit more about it it's not to say like I agree with you religion is good and you know Bill Nye was making the point that billions of people that believe in God don't believe in creationism because yeah any sense he drops the mic you walk onstage I think he was actually very respectful because if I was like hearing all this stuff and like I'm a man of science like Bill Nye is Bill Nye's much smarter than I am but it's just like nothing you're saying makes any sense and when you're saying when you're just lying by saying that space doesn't prove time which it does then you're just lying you know you're lying who's its obvious by everything that's that shown you like all the evidence is obvious and he was even making the point like there are trees on earth older than 6,000 years old how's that possible you just ignore that evidence but there's there's trees there's a tree in Finland that's 9,000 years old that's awesome tonight the biggest set is",
            "start": 2058.4
        },
        {
            "text": "older than 6,000 years old how's that possible you just ignore that evidence but there's there's trees there's a tree in Finland that's 9,000 years old that's awesome tonight the biggest set is a huge it's small actually it's The Great Deku Tree there's a it's like a root system that like keeps popping up and then like it dies in the tree but like the root system underneath it's like really the owner was saying that there you know he was saying like the humans were learning like agriculture and animal husbandry around 6,000 years ago like it's not like it's just so frustrating to me like Tim and I had the same look on our face when you said that term define animal husbandry the ability to domesticate animals okay good that's what I thought it was sometimes nope that's not what there was a time it's so fasting there was a time when wheat or oats or barley or wild plants that people somehow that that they're the same as we are now the chickens were just in the wild you know I",
            "start": 2100.91
        },
        {
            "text": "was a time it's so fast there was a time when wheat, oats, or barley, or wild plants that people somehow cultivated, just like we do now. The chickens were just in the wild, you know? People had fine horses and cattle, like in Minecraft. I do this all the time, man. Uh, here's my thing, Colin: who do you think the debate was designed for? Like, yeah, you're talking about how respectful Bill Nye the Science Guy was, which he needs to be, obviously, 'cause you're watching it, but like, do you think he changes anyone's mind? Does anybody come to that debate undecided and willing to listen? No, that's the upside - they were willing to listen. I was actually surprised by the creationists' argument because there is an organization to it; I didn't realize it was that organized, but I came to realize that it was just all prepared to counter accepted scientific fact. It's the same thing with global warming, frankly. Like, I'm not a global warming denier, but I actually believe that it's either hot or cold - warm, it's colder; they see all the",
            "start": 2143.75
        },
        {
            "text": "accepted scientific fact it's the same thing with global warming frankly like I'm not a global warming denier but I actually believe that it was hot or cold warm - it's colder they see all the snowstorms and that's so silly come on like global warming is I think flawed heavily flawed science and the reasons why that's happening are unclear and it's unclear the Greta views why those things why those things have happened geologically over of years you know maybe things were that things got hot and cold ice ages come and go you know there were you know ice ages covered almost the entire planet at one time like now they just covered the movie theaters so Madagascar no not the same movie no does Bill Nye with global warming Bill Nighy yeah yeah he actually said he's the global warming guy well he's like always on the news about it because you know I guess what I'm saying about global warming it's like I don't believe that global warming is entirely man-made I think there's solar thing you",
            "start": 2190.61
        },
        {
            "text": "he's like always on the news about it because you know I guess what I'm saying about global warming it's like I don't believe that global warming is entirely man-made I think there's solar thing you know solar cycles that happen I'm sure it's a lot it's very presumptuous of us to assume that everything that's happening is because of us but it would be foolish of me to deny that we have at least something to do with it and it'll be even more foolish me to deny that the earth has gotten warmer over the last 150 years and that's pretty compelling you know yeah and then so like even though you might not want to believe it but there it is you know yes before yeah that's the same thing I felt with this argument evolution like you may not want to believe it but here's some Cro-Magnon man bones from 10,000 years ago you know dear dinosaur fossil goes over here what are your thoughts in the fact that we will live perfectly normal lives but at some point someone's gonna have to deal",
            "start": 2243.14
        },
        {
            "text": "from 10,000 years ago you know dears dinosaur fossil goes over here what are your thoughts in the fact that we will live perfectly normal lives but at some point someone's gonna have to deal with global warming it's not gonna be us look sometimes my gonna have to deal with it it'll be fun we do what we do up there we have to period we have to do we deal with it now but I'm saying like you always don't get you always think in terms of well eventually it would be a United States refuses to deal with it which is fine because it's an economic issue yeah the economy of it is we will eventually move over to have more clean renewable sources of energy and it'll take care of itself right that's what people think oh yes carbon emissions yeah don't forget about the cows the methane problem think that people do you feel is it comfortably another no matter what we do our lives are gonna be okay at some point our children's children will probably like living",
            "start": 2278.99
        },
        {
            "text": "the cows the methane problem think that people do you feel is it comfortably another no matter what we do our lives are gonna be okay at some point our children's children will probably like living in masks and having to smoke cigarettes that's the cleaner air it looks cool like screamers term that movie we've had to smoke cigarettes no I thought that was the coolest movie yeah they have to smoke cigarettes that's cool that was my real question I forgot my real question was what are you talking I forgot one blacked out move on I'll get back to it okay Tim Tim go I'm gonna go with something much more serious I doubt that it's definitely what's your favorite anime if any yeah look the closest thing to an anime I get a mungus but it's fine what sure like Parasyte a lot that manga what subscribe sorry Perry the manga because that's how you say it that's the Japanese way to say it monkey up front a little manga my manga it's manga this is are you at it I know there's little things that I",
            "start": 2323.09
        },
        {
            "text": "Sorry, Perry the manga because that's how you say it, that's the Japanese way to say it. Monkey up front a little manga, my manga, it's manga. This is are you at it? I know there's little things that I know that piss off Colin. Boy who's a priest he's decided to be a priest and he gets dropped off at this school full of hot girls and they want to break him so he's been getting put in sexual situations. Well, if that isn't a metaphor for your life, I know. I guess I have to be around Alfredo all day long; he will try to break that hard body of yours. Yeah, I also like the Ghostbusters manga was a good one. Can you swallow hard for me real quick? He doesn't listen to the show; he doesn't know, he won't hear it. Oh yeah, I still listen to the show to really get the swallows. Um, and then I guess anime. I liked Howl's Moving Castle. I've now said everything I can say on this subject. I'm really just one what Colin has to say about this so a little-known fact my brother in terms of like detail well you cool for",
            "start": 2379.46
        },
        {
            "text": "Moving Castle I've now said everything I can say on this subject I'm really just one thing Colin has to say about this so a little-known fact my brother in terms of like detail well you know for like he's like Cheryl he's just gonna come in one day give you some whiskey you know I'll be the end of this when he really got me into games and he's 11 years older than me and my brother's an animator is pretty well respected animator in the industry actually coming from he's worked for it you just finished his tenure at Sesame Workshop and Dan what does that mean what look what does he do for them he worked on Sesame Street and then he moved on to and when I'm not sure like I don't honestly talk to him too much anymore which is that regard well no we just don't communicate you're busy it was just a busy thing well he has kids and he's we're just really busy we see each other have a great time and then we can talk so I'm not sure what he was doing there but he worked",
            "start": 2435.59
        },
        {
            "text": "you busy it was just a busy thing well he has kids and he's we're just really busy we see each other have a great time and then we can talk so I'm not sure what he was doing there but he worked for Sesame Workshop for several years and now he's working doing something for Disney know what he's doing it's frozen to what lead animator aren't frozen we had no idea the whole time thank you the best but uh and he he were he actually worked on uh we just as freelance project leaders to Labyrinth remake and so he got he was really really an anime fan when I was a kid and he really got me into that meaning video games especially in the NES and SNES era went hand-in-hand with anime anime it was really big in the late eighties and early nineties especially in New York because and maybe other big cities but I would say maybe LA I would be similar because you could buy so much of it and like you could like going into Manhattan and going to like these little **** basement stores and just buy",
            "start": 2487.59
        },
        {
            "text": "I would say maybe LA, I'd be similar because you could buy so much of it and like you could just go into Manhattan and go to these little basement stores and just buy like bootleg tapes of everything. My brother had like all this stuff, so a lot of this stuff I really watched as a kid and really loved - old Robotech, one of those things, yeah. But Bubblegum Crisis, oh yeah, there was Ranma 1/2, which was really good. And then of course for movies, I still really feel like it's kind of its kind of trite at this point because it has gotten popular over time, but a curious thought is that it's a seminal anime when you ask anyone in a room full of people who are you know informed on the subject what their favorite anime is, the very first thing everyone thinks up is Akira. You have to because it's an amazing world; it's really the most I was...I mean I'm not an expert on anime by any stretch of imagination, I stopped watching them in like the mid nineties but",
            "start": 2525.69
        },
        {
            "text": "up is a cure you have to because it's an amazing world it's really the most influential anime by any stretch of imagination I stopped watching them in like the mid nineties but I know that Akira has to be one of the most influential things that ever hit anime and I can still see my brother had this huge movie poster in his room I still see is the one where he's walking to his bike yeah yo Tokyo was about to explode on the top of it and like just like here on the bottom you see both versions there was a French-Canadian version the very first version I saw I think was French-Canadian subtitled with an English translation for it and they totally screwed up the translation so it was a really convoluted really intricate plot that kind of made no sense when I was a kid I was like dude this is deep understand it and like this is insane it was the very first thing I'd seen then I watched the actual Japanese version which was subtitled in my case makes more sense then they re-released",
            "start": 2576.36
        },
        {
            "text": "this is deep understand it and like this is insane it was the very first thing i'd seen then i watched the actual Japanese version that was subtitled in my case makes more sense then they rereleased it mm-hmm i think it was digitally remastered they released it and they redid the dubbing and i hated it because i actually have a good conversation pair about this they actually said pronounced the name of the characters the correct way so it's not it's not accurate it's Akira Kaneda right kaneda right and when i grew up i heard the translation so as kaneda was akira it was tetsuo right which were all totally wrong that's what might be right and so i hated the original translation but it did actually make them take a whole lot more sense to me i was like oh i get what's going on they still intricate but they actually bothered to like like the dialogue actually reinforced what was going on in the plot kind of made a lot more sense no arguably i mean it is the best anime ever made i don't",
            "start": 2615.96
        },
        {
            "text": "but they actually bothered to like, like the dialogue actually reinforced what was going on in the plot kind of made a lot more sense no, arguably I mean it is the best anime ever made I don't think anyone can argue against that I don't think is anyone that's gonna watch this if you are watching this you think doesn't mean better please let us know but and certainly no more influential especially on a Western audience I thought that was a Brony yeah that's what we're an anime over at least that got me into anime I was I was heavily in there used to be a store called Sam Goody remember those oh yeah there's a Sam Goody in a mall near me and it was the only place I knew of that actually sold VHS tapes back in the day to save up and I would go and I would be like I knew nothing about it this is before the internet there was like a magazine you could buy but you could read a lot about this stuff most part you said look and literally judge a book by its cover",
            "start": 2663.87
        },
        {
            "text": "about it this is before the internet there was like a magazine i guess you could buy but you could read a lot about this stuff most part you said look and literally judge a book by its cover you get a look at the VHS tape and go this looks cool it's I got a cool title I'm gonna buy it so I used to buy movies and some of them weren't great but a couple of the ones that I loved this one called The Castle of Cagliostro which is based on a Lupin III series, called Lupin, there's a master thief it was amazing there's one called Wicked City which was unbelievably cool still great as David if you ever get a chance to see it check it out and one called Ninja Scroll I don't know if you were just rolls growing up but that movie The Fist of the North Star the movie mmm just word just blew me away and I was like I can't believe North's was rad that it was one of those things where you watch anime for the first time and it really hits you you're like oh my god there's a whole other out",
            "start": 2702.75
        },
        {
            "text": "me away and I was like I can't believe Naruto was rad, that it was one of those things where you watch anime for the first time and it really hits you, you're like oh my god there's a whole other world out there that doesn't treat their children like they're forever infants, yeah that actually will put something in a cartoon form and realizes the power of cartoons right cuz cartoons are so much easier to do whatever you want and that's why we when we talk about Spectacular Spider-Man or Ultimate Spider-Man I love those conversations because I still love cartoons I still watch cartoons whenever there's a DC movie I just watch the newest one or War was a war, World War II, this Lee War was a war it's okay not the best but I love him and my wife has come to the point where she watched she sees a preview for it that I'll be watching a preview and she'll get up and she'll take her magazine and she'd go into the bedroom she knows I'm gonna buy",
            "start": 2738.78
        },
        {
            "text": "Has come to the point where she watched she sees a preview for it that I'll be watching a preview and she'll get up and she'll take her magazine and she'd go into the bedroom she knows I'm gonna buy that movie and watch it cuz I love what a relationship she appreciates it you know for the longest time she and I didn't see we didn't not necessarily eye on it but she was like I don't get why you watch cartoons on my cartoons are the old medium for me because you don't you can draw I mean it's your imagination is the only thing that's limiting you when it comes to a cartoon it's amazing but if you asked me what my number-one anime was of all time it's gotta be Robotech I know how much you love the robotic and I respect that my brother really loved that a lot seriously too it was it is to this day and I've said it before on this podcast and I'll say it to the day I die unless they make it would make the best movie trilogy ever it's in Hell right like it's in limbo well I think it's being",
            "start": 2783.57
        },
        {
            "text": "Day and I've said it before on this podcast, and I'll say it to the day I die unless they make it - would make the best movie trilogy ever. It's in Hell right, like it's in limbo. Well, I think it's being made; it says on IMDB it's still in production. I have really fallen for it; it's got to be true. I need to get him on this Robotech stuff - like I never watched it. It looks super cool though. Yeah, I'll lend it to you. The reason I like the Robotech was because it was a they call it a space opera, like a space soap opera. It is more about the characters and there's about what's about the tech; what the tech is amazing in it right? You've got the planes that you know do the traditional thing or it would transform but they transformed into three two different two or three different areas - three variations excuse me. But it's about the characters, it was about them being stuck in this this this horrible situation where you know the ship crash lands and they reverse-engineer it and they think this is",
            "start": 2827.95
        },
        {
            "text": "excuse me but it's about the characters it was about them being stuck in this this this horrible situation where you know the ship crash lands and they reverse-engineer it and they think this is the flagship and all of humanity was in a war beforehand they've come together as you as one United government to build this ship in this beautiful moment of peace and when they fire the ship up it sends a signal back to the aliens that lost it to come get it and they come and they attack us and so on the verge of this great piece that we've accomplished as human beings we suddenly find ourselves in the worst war ever known to man and the ship trying tries to take off and accidentally gets held across our galaxy I'm not galaxy excuse me your solar system and so we're on the outskirts and the earth won't let us come back because we're being the ships what they want not the earth and the rest being torn apart by these things and so you get stuck in this like there's a lot of politics that play",
            "start": 2863.41
        },
        {
            "text": "won't let us come back because we're being the ships what they want not the earth and the rest being torn apart by these things and so you get stuck in this like there's a lot of politics that play into it and I'm kind of over complicating it because it was a kids show but and the characters are super complex and it deals with you know dual races and love between the races and like yeah all these various different things on how to races can be totally dissimilar but at the same time they find a common ground somewhere and it's just I mean it was 30 episodes and he was I think was 33 it's something like that episodes and then they started making more iterations of it and they sort of bring out the cartoons and living where which I could didn't work out that well like Southern Cross was kind of terrible but the core macro series was just it just was so good it's literally I could say it's very nostalgic like they do it with Star Wars and and call it a day and I hope they do I hope they",
            "start": 2905.98
        },
        {
            "text": "of terrible but the core macro series was just it just was so good it's literally I could say it's very nostalgic like they do it with Star Wars and and call it a day and I hope they do I hope they make it really well and I hope they treat it like they had the decency to treat it in the 80s without kitty gloves no punches both characters die you see their skin melts away you see them explode and that was actually the censored version - it was an uncensored version of it the movies the mascots are based off of her like rule so there's that - yeah on DVD if you die my desk I mean how long is the the run I think it was uh I think it's like I said 30 or 33 so quite a few episodes 33 episode yeah it's not that much that was only a few seasons 33 see I have 6 I have 6 DVDs I know cuz there's six but there's only one of them special I'll give it to you it's not that many that's all you can burn through in probably a week or two and before we move off this topic into the next hour wanna let",
            "start": 2943.66
        },
        {
            "text": "but there's only one of them special, I'll give it to you, it's not that many, that's all you can burn through in probably a week or two. And before we move off this topic into the next hour, I wanna let you know I need my cat. I just want to say real quick and then Tim with simple groceries, I want a name, you know, I named my cat Chumlee after a fighter, my brother named one of his cats that, I'd loved it when I was a kid, Shampoo after a Ranma 1/2 character. Mmm weird video game nerd anime names there we go all these count do you remember the Street Fighter anime? Who I'm in a movie that was when Charlie was in the shower yeah I was gonna remember the fight at the end between Ken and Ryu what I remember most from that movie was Balrog, crooked eyes the entire time. I remember that he's ruined it for me, you should watch it. I got you know I still have all my anime VHS tapes lip bring him in will go through Monday that's amazing so a VHS player nope can't play those I have those I have all I have",
            "start": 3002.39
        },
        {
            "text": "me you should watch it I got you know I still have all my Anime VHS tapes lip bring him in will go through Monday that's amazing so a VHS player nope can't play those I have those I have all I have left that I might either my mother or my wife haven't thrown away and it's very it's very telling are like my entire anime series and then like one copy of Return of the Jedi on VHS that I was like I'm not throwing this away that's fight is it like you're really old really old not the one that was really tonight no I wonder it's the original cover like $80 for so long no I bought it back in the day I mean VHS has cost a fortune in the eighties yeah I didn't know that until I rented The Empire Strikes Back when I was a kid from a library and it had a price tag on it was like seventy nine ninety nine and I was like this can't be I was talking my dad was in the early nineties all my candy really is like no these things were really really really expensive like well there were those in the",
            "start": 3048.06
        },
        {
            "text": "nine and I was like this can't be I was talking my dad was in the early nineties all my candy really is like no these things were really really expensive like well there were those in the normally laser discs they were like a hundred bucks and they're huge and then there was beta tapes they were like three dollars and somehow Sony botched that one to Tim so a couple episodes ago I said that Game of Thrones is my third favorite show of all time and I never said the first two they are both animes the first one is one called Code Geass and the second one is one called Death Note now I wanted people know I haven't seen that many animes so there might be stuff there is let me show these are shown right yeah these are not movies these are right code geass is 50 episodes death note is 37 okay and over 36 and they're both very similar to both about people getting special powers and how they use those powers like with great power comes great responsibility all that stuff",
            "start": 3092.73
        },
        {
            "text": "Death Note 37, okay, and Over 36, and they're both very similar to both about people getting special powers and how they use those powers, like with great power comes great responsibility, all that stuff, Spider-Man. But this is kind of like nice; no, Death Note, this is like screwed up, like ****. By the way, Tim has been trying to get me to watch Death Note; he's like, \"Dude, what do I do?\" Got it? He gave it to me, the whole series, it's sitting there. Everyone thinks it's amazing. Is it the prequel or sequel to DeathBlow? It's the origin story, continue. So I'm gonna get into Code Geass because that's too much to explain, and it's super awesome. But I would recommend for people if you haven't already to watch Death Note, and if you like that, watch Code Geass. Death Note is the story of this boy, this really smart high school kid, and he's just walking in doing his thing down the street; now up in hell which is above us for some reason there's yeah this thing called Shinigami, which is like gods of death.",
            "start": 3134.97
        },
        {
            "text": "Smart high school kid, and he's just walking in doing his thing down the street now up in hell which is above us for some reason. There's yeah this thing called Shinigami, which is like gods of death, Shimon hell meeting, yeah Japanese, and they're bored. And what they do is they have these notebooks called Death Notes where they are the ones that kill people, and they write their people's names down. If you write their name down, they'll die. So these Death Gods are up there just killing people, that's how people die. So one of them gets bored; he's like, \"You know what? I'm gonna just throw my book down to earth and see what happens.\" So he throws his book down, and in this high school kid sees this notebook and picks it up, and the Death God just comes down and is just like, \"I just wanna see what happens if the human has the power to just kill people,\" and this kid's like, \"He reads in there are rules. It's like if you write someone's name down, they will die.\" And he's like, \"Okay, this is stupid,\" and then he sees",
            "start": 3179.1
        },
        {
            "text": "if the human has the power to just kill people and this kid likes he reads in there's rules it's like if you write someone's name down they will die and he's like okay this is stupid and then he sees it's like some girl gets raped and you just like yeah why didn't he know how it gets it gets crazy and well you tried helping but it didn't really work out gotcha and then he finds like sees their name on there like little tiger whatever and he like later it goes home and he writes their name down and then he sees on the news the next day that they died and he's like oh **** this is real and then he's like I'm gonna like do something with this like I'm gonna change the world like I'm so smart I know what I'm doing I guess I'm gonna fix everything so then he starts going and every day he like looks watches the news and he kills every criminal like every single criminal sounds like Greg Miller's death penalty solution no no no I got this still from you don't ruin the whole no I'm not going to",
            "start": 3224.25
        },
        {
            "text": "watches the news and he kills every criminal, sounds like Greg Miller's death penalty solution no no no I got this still from you don't ruin the whole no I'm not going to sounds awesome this is like this is all the first five minutes this this is all the first episode like a mom writing names in people though yeah it is massage it's a montage of him just riding people's names down and then like I'm not spoiling anything this is literally the first two episodes of the series all this is happening in the Death God's just like well this is I this is a lot better than I hoped for like I thought it was just gonna be someone that kills someone it's done with it this guy starts killing everybody the world is like oh **** like we're not **** this guy so criminals stop doing stuff and then they're like all just like Greg Miller's mom, definitely exactly but then the police are like we got to find whoever's doing this obviously somebody so there's this light that's",
            "start": 3264.24
        },
        {
            "text": "stop doing stuff and then they're like all just like Greg Miller's mother, but then the police are like \"we got to find whoever's doing this obviously somebody\". So there's this light that's blown, the world's best detective, that no one knows who he is, they just know his name is L, that's cool and he's cool. He goes by L okay, and so they're like \"we need to get L involved\", so they find L. I'm not gonna spoil too much after this but he comes to find out who's doing this now the greatest thing about this is the easy solution is for this guy to just write this guy's name down and kill the detective, but he's not a bad guy, but nobody knows the detective's name because he just goes by L. It's also the entire series is two super geniuses going back and forth like chess in real life that's cool it's the detective I'm gonna watch this I'm gonna watch how the floor what do you ever find him I'm watching the news you write the name down what the do what stop we're going all",
            "start": 3305.89
        },
        {
            "text": "That's cool, it's the detective Conan I'm gonna watch this I'm gonna watch how the floor what do you ever find him I'm watching the news you write the name down what the do what stop we're going all the so three explains that like they pinpointed down you're like what and this is one of those shows Code Geass it's gonna take about ten episodes of watching to really hold on one side L has six ten episodes they're really heading them off so it really gets old for Light Yagami if you're not super hooked by two episodes I I'll give you your money back I don't know it's just so good and then every single episode there's a cliffhanger that you're like what how do you get better than this so two things I think it's bad towards the end one well Tim but hey I'm not even gonna do it it's super freaking awesome I will watch I'll make you a pact right now watch Death Note if you watch Robotech a whole thing whole series gotta watch nothing to her yeah okay Colin yes if you had the deathblow",
            "start": 3346.54
        },
        {
            "text": "freaking awesome I will watch I'll make you a pact right now watch Death Note if you watch Robotech a whole thing whole series gotta watch nothing to her yeah okay Colin yes if you had the Death Note what name would you write in it yeah I don't like some warlord probably that's messed with people in central Africa okay it's not bad Lionel Richie makes a statement Vegas State what are you making a statement again it's like cool people he's making more music cuz I really enjoy his music Lionel Richie or the Commodores you going on with you I'm gonna need you to give me a couple Commodore songs because I know that I'll know them but I don't know them off topic what you might not actually give me a few I got a big one now now I gotta think one maybe even though you don't even know what I'm gonna go while Richie hello one of the best means always Alton we're missing one we're missing one we're gonna get shredded up hearted torture oh no the Wolverine anomie call it think I want you",
            "start": 3391.42
        },
        {
            "text": "I'm gonna go while Richie hello one of the best means always Alton we're missing one we're missing one we're gonna get shredded up hearted torture oh no the Wolverine anomie call it think I want you to think yeah Princess Mononoke oh that's amazing too but no that wasn't what I was thinking of is it is it the studio ghibli no persona there was a very amazing series that they they'd never watched and I to this day I regret how do you haven't watched Neon Genesis Evangelion that's that is Wornall it's always talked about yes and I everyone does everyone says if you like Death Note and Code Geass you'll love this show but supposedly it was a show that went for like 30 episodes or something and then they like started remaking into expanded movies someone tried to tell me the the full breadth of Neon Genesis Evangelion and it's it reminded me of the time that someone tried to tell me the full story behind Metal Gear I was like I don't understand what's happening I don't understand why these people are different",
            "start": 3451.52
        },
        {
            "text": "and it's it reminded me of the time that someone tried to tell me the full story behind Metal Gear Solid was like I don't understand what's happening I don't understand why these people are different so it's - it's pretty easy is it close yeah well spoilers alert all fans of the Metal Gear series know the story is awesome Nick yeah shut up that's true yeah but you know your solitude what's your favorite Metal Gear no you're salty if I should have played Metal Gear yes whatever percent I played I played it when they came out for the PS3 for yeah yeah yeah played that the worst it's not the worst uh definitely MGS 4 yes to where must play games did I ever tell you my story one time about MGS 4 yeah no I'll tell you guys one day oh it's good at ease of a topic it involves an Ocarina of Time editor it was it was one of the most funniest things that but I have an idea who it is who wants to go next I'll go you go why is it really so mean this is a question why by our nature are we all",
            "start": 3502.72
        },
        {
            "text": "Editor, it was one of the funniest things that, but I have an idea who it is. Who wants to go next? I'll go. You go. Why is it really so mean? This is a question. Why by our nature are we all such mean people? But what brought this up to me that made me think about it was the other day somebody says, \"What about The Simpsons?\" And my initial thing was, \"The whole office is **** suck; they need to get Kate.\" Why why am I so angry and mean to The Simpsons all of a sudden? Yeah, because a long time ago I watched an episode that I didn't think it was good, and I stopped watching. Yeah, like what's this? I always bring it back to the you know the Internet, the stuff we have to deal with right where people tweet about how much they... Greg and Colin, you're all a bunch of fanboys, and ****, and horrible things they talk about of **** but like you know that like I watch TV and I don't like The Office. That one time when I went to tweet negatively at The Office, and I stopped, Christine.",
            "start": 3561.01
        },
        {
            "text": "things they talk about of TV but like you know that like I watch TV and I don't like The Office, that one time when I went to tweet negatively at The Office and I stopped and Christine asked me why and I was like people do that to me all the time and somebody worked hard to make that yeah yeah but it still just goes in general that we're mean I mean Colin were having a conversation yesterday on AIM about this and I was saying he was accusing me of being a pain to talk to and I was like you do this to yourself, you've always started the relationship that would mean I'd love for us not to be mean to each other in conversations but we are and then you're in a car and someone cuts you off in your car mother you can't draw that guy's like you've done that a million times he's an honest mistake and the airport is the worst when you go to the airport nobody else matters like all humanity is out the window right it's like I'm there and I'm miserable I'll kill you",
            "start": 3600.07
        },
        {
            "text": "an honest mistake and the airport is the worst when you go to the airport nobody else matters like all humanity is out the window right it's like I'm there and I'm miserable I'll kill you I think one time I listened to Colin talk about the TSA and ever since then I was one of the first conversations we shot with Greg and ever since then I look at the TSA like they're just scum I have a theory Greg yeah I think it's because the world is moving faster and everyone's more busy and working harder than ever having there and in the country of humanity but people will always be mean always I think people aren't mean I think none of us get enough sleep none of us are well rested we work more cranky like that's the mean person but you guys you each have probably all seen me be mean over the last two months just because sometimes I get to a place where I'm like I got nothing left and yeah farther down all that's down there is just yeah or between outburst and anger and being mean",
            "start": 3632.68
        },
        {
            "text": "over the last two months just because sometimes I get to a place where I'm like I've got nothing left and yeah, farther down all that's down there is just yeah or between outburst and anger and mean like people, there's anyone just mean like most people are just mean-spirited like you think the majority of people, the majority of people is depressing I think if people are scared I think the majority of people are living their life and there's no plan to people's lives like try it like it or not you try really hard but sometimes things just don't work out and that's a terrifying thing and because of that some of us might like I do this sometimes I find myself slipping in where I'm like you've got to be tougher and sometimes tough means mean and sometimes mean means you've got to just make hard decisions you've got to be kind of messed up with each other and you've got to kind of push for what you want out of life because it's like a I mean they call it a rat race for a reason right it's really hard to",
            "start": 3677.83
        },
        {
            "text": "you got to be kind of messed up to each other and you got to kind of push for what you want out of life because it's like a I mean they call it a rat race for a reason right it's really hard to live in this day and age so I want to be like Mr. Bean and I raise them should be nice to everyone fall asleep don't ever **** a lot of the rat Matt oh god please don't burst off the star of it was clearly Jon Lovitz but we're not gonna go talking about Rat Race watch the movie one per year you do not wanna do any my friends get together November 28th for his fun for his birthday we watch Robert oh why it's the best it's the best it's the best maintains in that isn't it yeah Mao Mao's all-star look at the cast now there was a statistic that came out that said living in this day and age is the most stressful time for any human being which is depressing right cuz like the most stressful time for us is Oh somebody was mean to me on Twitter not well those are destroying your now the hardest time",
            "start": 3721.54
        },
        {
            "text": "Stressful time for any human being, which is depressing, right? Cuz like the most stressful time for us is when somebody was mean to me on Twitter. Not well, those are destroying your now the hardest time. The most like we live under a constant state of stress, is what the studies say. I'm so I mean duck-and-cover and a million other things. There was a lot of stress I can see it though because there are assignments of silo pressures. It's just it's the reality of the situation to survive in the United States like especially it is a rat race and it's just the nature of capitalism, that's the nature of our society. You know III Breckin Meyer, Amy Smart, yeah Amy Smart, Dean Cain was Amy Smart's boyfriend remember? And they did the thing with the helicopter and like Bryan Cranston. I'm crazy, I watch two shows with one of each of those people in it: Amy Smart in \"Justified\" right now, and Breckin Meyer on \"Franklin & Bash\", and \"Good Wife\" with Julianna Margulies is good too, but love those shows. I was so mad there was no winner because all the commercials for",
            "start": 3769.72
        },
        {
            "text": "of each of those people in it Amy Smart and Justified is right now in Burn Notice, Franklin & Bash are good with Love. Those shows I was so mad there was no winner because all the commercials for that movie were no, no, they all gave to charity, and then the Smash Mouths All-Star Party \"Hey Now\" so we all lost. Is this the movie where John Cleese and all them are doing bets? They're betting everything. Yeah, that was a genius movie. I'm sorry, I take it back; isn't this one, and The Man with Two Brains? There's Dean Cain, Sean Connery, yes, no, she's very much in this movie; she's at the very top of the list. Oh, she's all like this tough girl. We reckon Mayer Amy Smart. Whoopi Goldberg, Vince Vaughn, wreck admirer had a good run therefore whether he had they like Clueless yet? This Road Trip is first on my DVDs. I have 1000 times yeah Colin yeah where do you come down the Tom Green? I **** love Tom Green yeah dude The Tom Green Show was I'm going to show I would be in hysterics I know I loved",
            "start": 3813.19
        },
        {
            "text": "first DVDs I have 1000 times yeah Colin yeah where do you come down on the Tom Green Show I **** love Tom Green yeah dude the Tom Green Show was I'm going to show I would be in hysterics I know I loved it too and I didn't understand tonight's Movember people were like what is you know I because it is yeah like it's one of those things where if like there was no YouTube obviously but like that you know there's total access and that's where started I totally the birth of you can totally see where it would have been this show where Colin's behind us just laughing the whole time remember my friend everybody had one guy on the TV and then one guy like like the chair next door right there was the dude on The Glen was always next to him yeah and his friend was behind him I forget Quagmire I remember yes I think of him now my hey do you think that Tom Green would have been the first YouTuber if he existed like what years ago if he was like I mean he has a YouTube show there's a Tom Green Show he does",
            "start": 3865.92
        },
        {
            "text": "think of him now my hey do you think that Tom Green would have been the first YouTuber if he existed like what years ago if he was like I mean he has a YouTube show there's a Tom Green Show he does a late-night show on YouTube I remember I watched a couple times he did he interviewed Stevo and it was awesome does he get more views enough I don't know we also met him last year at Comic-Con he was at the party Tom Green Young Green was the Comic Con yes sir I don't Jackson was there I was like you know accident Oman Tom Green Green crossover Tom Crean everybody sweet Tom Green propelled his career from Tom Green Show to stealing Harvard remember that I vaguely remember Celine Harvard which I think was before EuroTrip Road Trip it sucks it peaked in the movie there was that and then there was that and then there's Freddy Got Fingered ready go no he didn't he got fingered I say he still had that be bomb the movie also got sued by Nintendo because they used the Mario 3 Waterworld music for",
            "start": 3917.79
        },
        {
            "text": "that and then there's Freddy Got Fingered ready to go no he didn't he got fingered I say he still had that be bomb the movie also got sued by Nintendo because they used the Mario 3 Waterworld music for one of the songs con where do you come down on The Wizard the movie yeah the best thing I love that movie I'm gonna tell you a specific reason why I love the movies because real life's sent me an angel who's in it Perry the montage which is like one of my favorite moments in them in any movie ever yeah so Jake they're driving that's it is that right head everything yeah all right Tim The Wizard I love The Wizard Nick strapping I shut up about stuff that doesn't matter Tom Green his YouTube channel how many subscribers do you think he has compared to the Game Over Greggy Channel three hundred and fifty thousand can you see okay alright in Game Over Aggies at what now sixty one thousand and change 62 Tom Green has 56,000 no when he had already laid off he did these",
            "start": 3965.37
        },
        {
            "text": "Channel three hundred and fifty thousand can you see okay alright in GameOverGreggy at what now sixty one thousand and change 62 Tom Green has 56,000 no when he had already laying on he did these seven thousand views he is prime for a collab yeah he's totally prime for a collab we need to get him here or get us there you bring these walls GameOverGreggy right you cross Tom everybody tweet Tom Green this Lincoln Tom we want to team up here Howie Mandel 5,000 views Richard Belzer 4,000 Belzer if we had Richard Bellis around we'd get 400,000 views with a guy from SVU be you yeah and a million I think money's much yeah much my life has a car he always has really insightful things to say very you know here and there Tom Green interviews turtles and a man that's our and more people not clicking on these videos it's a shame Tim are we gonna to legitimately go the rest of this podcast that you opening up with him boxes ooh I was thinking about it I remember when I listen to podcasts I hate it when I",
            "start": 4019.58
        },
        {
            "text": "Video, it's a shame Tim. Are we gonna go the rest of this podcast without him opening up with his boxes? Ooh, I was thinking about it. I remember when I listen to podcasts, I hate it when I get people who use the word \"like,\" especially rappers. You can even hear it here, yes. Not you, though. That's right now, but I'm heartbroken. Yeah, I'll throw them at the door. Do you want to have a tantrum and reach down to that dark place? Do you see me? Well, you're almost done; you're the last topic we do. We figure out why people are so mean. Here's my insight on this: I'm gonna tell you because you're a mean person. No, I'm not. Don't leave me with your mean old friends who know you give a lot of crap. I give ships to people. Yeah, I'm not mean; I'm actually a really nice person. And I'm gonna tell you what one thing that I think is hopeful for you to hear: Not crap around. I feel like I'm actually the epitome of a well-raised individual. I'm a please-and-thank-you person.",
            "start": 4071.36
        },
        {
            "text": "that I think you know that really are hopeful to hear not **** around I feel like I'm actually the epitome of a well-raised individual, I'm a please and thank you person. You hold doors for people, like someone drops something on the sidewalk, pick it up for them. You know, I'll get up with a pregnant woman or an older person who needs to see over a train like. I actually feel like you know, I respect people now, but it snaps very quickly though. My favorite move is if I hold the door open for someone and they don't say anything, I mean, \"you're welcome,\" look right out of there, whatever it's like. So I expect it back in kind. I never leave someone hanging if they look like they'll hold the door, but for me, I'll rush to the door, I'll rush to the elevator, thank you so much, you know. Oh, you know, someone hands you something, you hand them some money, they hand you a product, \"thank you,\" can I please have this right? But if I don't get that back, I'll give you",
            "start": 4110.45
        },
        {
            "text": "thank you so much you know oh you know someone hands you know you hand some money they hand you a product thank you you know can I please have this right but if I don't get that back I'll give you **** **** immediately for it they expect it back yeah and I can't fathom walking through a door that someone held open for you not say anything believable to me when one time I uh I went through a door said thank you but I didn't hear me he gave me started giving me **** and my wife laid into him she's like he said thank you and they just started screaming each other and I was like we're going I frequently style it was a Starbucks on you of course it was it's not a big deal I don't like I'll be honest III spread just texted me I'm smoking cigarettes and drinking Starbucks I feel like Nick I feel cooler than ever what Starbucks is yeah meet him for one after this tell him the kind of the Starbucks on Laurel after this I want to cigarette my topic ties in with this okay so it's funny",
            "start": 4155.69
        },
        {
            "text": "I feel cooler than ever, what Starbucks is, yeah meet him for one after this tell him the kind of the Starbucks on Laurel after this I want to smoke a cigarette. My topic ties in with this okay so it's funny that we totally didn't plan this at all so this is tweeted at me and I meant to actually bring it up last week just because of this person's tweet, it's almost like tweeting at you is a year topic it's their topic but I like it so I'm gonna adopt it so you calling a little audible I'm giving him credit for this uh okay okay at Naughty Dog James sent me it's a while back it isn't really working now. A dog is going to fall for it, no I know that fell for it don't fall for it what's the meanest thing you've ever done so I've thought a lot about this and my answer yeah it's gonna probably piss you guys off cause it's like it never been me the total Tim knows I have a meteorite it's out of the bag the cat is on the fire the cat is on the fire yeah what is it use of me earlier today you were like no picture in",
            "start": 4198.77
        },
        {
            "text": "it's like it never happened me, the total Tim, know I have a meteorite. It's out of the bag, the cat is on fire, the cat is on fire, yeah, what is it? Use of me earlier today you were like no picture in the snake bread, I was like, what are you? Like I'm tired, bro, your dinner's ready. It was one of those this ties into the mean thing right, we were you know how we all use hyperbole, quite have been Nick and I were talking about somebody I forget if it was an actor who or somebody we've met about that, I was accusing them of being dumb and I went to say oh she's dumber than a bag of hammers but instead she's dumber than a box of hammers. She's dumber than a bag of hammers, karma there's color versus dough, I can't even **** say what I'm saying that's amazing did you know he was about to say I'm the pure one so I've never been so this is in this way this comes from the person that used to by the way like do horrible things to be remember you the story you told about the lights that used to turn",
            "start": 4246.6
        },
        {
            "text": "one So I've never been so this is in this way this comes from the person that used to by the way like do horrible things to be remember you the story you told about the lights that used to turn on when people are trying to have sex and oh yeah by them that's me and then you like slowly push them off the cliff with your bundle bumper your car that's not a true part I'm hoping that part Nick so for me this haunts me to now in my life and this happened when I was like six years old seven years old I grew up near this park and there was a big like stone slide and I had my skateboard and like when you're that young you can't really actually skateboard you kind of do the thing when you put your knee on the skateboard and kick with your other foot I don't if you guys know what I'm talking about but it was awesome so we would do that and I'm like I love that and I love this stone slide I should probably sit on my skateboard going down the slide natural natural evolution and it would've",
            "start": 4312.9
        },
        {
            "text": "about but it was awesome so we would do that and I'm like I love that and I love this halfpipe slide I should probably sit on my skateboard going down the slide natural natural evolution and it would've been super awesome I'm the best thing ever so I'm sitting at the top of the slide no one was around on my own we know I'm gonna do this so I put the skateboard down and it slips out from underneath me thank God kills it I would have probably died had I went down on this damn hill you at some point know when you were looking at the top of it this is a bad idea no okay I was always about to rock it but it slipped out for me went down this little I don't know three four year old girl and comes like just falling falls right in front of us nails her oh yeah she was this tiny little girl and it hit her just I'll never forget the sound of her crying just like the shrieking sound I was like oh my god I instantly felt horrible and I ran away yeah like I just I just you know do that and I",
            "start": 4352.44
        },
        {
            "text": "it hit her just I'll never forget the sound of her crying just like the shrieking sound I was like oh my god I instantly felt horrible and I ran away yeah like I just I just you know do that and I was so scared like I was I thought I was going to jail like I thought I just I didn't know what I was doing a song and then her dad chases me down damn and comes running up this slide and comes running after me and I was like he's gonna kill me and then my dad comes out of nowhere and beats the **** no **** way beats the **** **** out of this guy and I'm just sitting there like oh my god beats him up he's down and then my dad got me hey let's go grabs me there we go I'm that's the end of my story and I will live with felony for the rest of my life that's like to follow me like it's bad the good news is you won that's always great I would I don't know six or seven okay so the statute of limitations is long over on that that's all good thank God because I still feel bad about",
            "start": 4394.37
        },
        {
            "text": "the good news is you won that's always great i would i don't know six or seven okay so the statute of limitations is long over on that that's all good thank god because i still feel bad about that though because like i didn't mean to do that and like share so bad and then it just escalated quickly attack did you know your dad was there i didn't know where he was at the park i didn't know okay though he was but he was my little brother okay my little brother was probably three or four sure sure sure so yeah that just have you ever talked about it again no not with him anybody i just kind of let it go cuz it really i mean i know you feel bad about it you guys gonna give me **** for not giving you **** i'm trying to technically it's not my fault but like it was my fault i shouldn't have been doing i did your dad don't like no it wasn't clear your dad was gonna destroy this guy or was there a fight ever in possibly i never seen my dad fight like my dad's not that type of",
            "start": 4452.99
        },
        {
            "text": "Have been doing, I did your dad don't like no it wasn't clear your dad was gonna destroy this guy or was there a fight ever in possibly I never seen my dad fight like my dad's not that type of guy I think it's my dad yeah my dad my guess is what your dad saw was some a grown man chasing after you really kill you and he his maternal instincts took over and yes wrap this guy yeah like I hope any one of us in this room would do right or wrong don't come after my kid I was gonna say if Tim threw a skateboard at the girl now I'd beat the **** out anyone who came after yeah but we got to make sure to tell anybody you gotta your face she's gonna relate it back to the GameOverGreggy show Moriarty no life lights out Colin yeah that's the meanest thing you think we were done two things came to mind yeah **** you city names don't use names both of all girls in high school I used to really I just had this huge crush on this girl she's a year younger than me I wasn't 11 3 I think she was in",
            "start": 4501.6
        },
        {
            "text": "mind yeah **** you city names don't use names both of all girls in high school I used to really I just had this huge crush on this girl she's a year younger than me I wasn't 11 3 I think she was in 10th grade she was a really cool girl we used to like meet up at the like our lockers and like talk to each other yeah and but I was like still in the stage where I like my friends were busting my balls almost kind of embarrassed forever and so she and I used to hang out after school and like just like make out and like suddenly ham but then my friends found out and stuff like that and yeah she's looking all hot so on and so on so and so my friends found out and she like was bold you know like and she like was like you know we should date her but you know we won't be my boyfriend whenever I was like you know with my boys and like I was all embarrassed and I'm like oh I did that with you because they put me up to it yeah brutal and but it wasn't true you know like I actually really liked",
            "start": 4551.59
        },
        {
            "text": "was like you know with my boys and like I was all embarrassed and I'm like oh I did that with you because they put me up to it yeah brutal but it wasn't true you know like I actually really liked her and I felt so bad about it I actually in college saw her and I was like I'm really sorry that wasn't true and I was just I didn't know how to handle it you were really cool girl she totally like a goth girl at this point like had you totally skewed her life when you know and we're cool now and like I haven't seen her in years when we weren't Facebook friends itself but she was you know like she was just a really nice girl and I thought that was like really messed up yeah yeah the other example is with in college he said I dated this girl twice in two different intervals once when I was a sophomore when I was a senior and she was like this is really cool really cool night like super nice super beautiful like chick and we weren't meant for each other which is like a thing right I go",
            "start": 4594.67
        },
        {
            "text": "a sophomore when i was a senior and she was like this is really cool really cool night like super nice super beautiful like chick and we weren't meant for each other which is like a thing right i go like you know but like we had fun and she was always really respectful and i'm sure like that and she you know i started dating her in the summer and then i kind of just got bored and like one of the other girls when i just broke up with her and she was like oh you know she was upset or whatever and then we ended up seeing each other at a bar we were seniors and like we hooked up whatever then we started dating again and i broke up with her again for like no reason you know i got like i was like all right you know and i knew she was really into me and i felt really bad about it because like i did the same like she trusted me and i did the same thing you know like where i wasn't doing anything wrong i guess but it was like i don't want to be with you anymore right and i",
            "start": 4642.57
        },
        {
            "text": "it because like i did the same like she trusted me and i did the same thing you know like where i wasn't doing anything wrong i guess but it was like i don't want to be with you anymore right and i feel better because she was really cool too you know and we weren't meant for each other i'm glad we didn't stay together i wouldn't have met my girlfriend now i know who brings me up to it she probably was gay i loved her more than anything but it's just on a personal level i feel really bad about the way i treated her you know and so it's not so much of like this one instance where i was mean it's like this one thing where i wasn't i didn't respect her as a person and respect her trust i didn't respect like what i did to her and how i made her feel and i apologized profusely to her she actually ended up dating my friend for a long time after that which was fine and i was like i'm so sorry like i know you hate me your friends definitely hate me you know it points me out all the time so like",
            "start": 4688.86
        },
        {
            "text": "up dating my friend for a long time after that which was fine and I was like I'm so sorry like I know you hate me your friends definitely hate me you know it point me all the time so like you're dead I've never been like a guy like I've always was the guy and I was really proud of being a person especially in college I would stick up for people you know they were being picked on or whatever not that I'm a tough guy but I hung out with a lot of tough guys and I knew that I could put myself in these situations and they would never let anything happen to me ever you know and so I would always stick up for people I was just like before us yeah we're tough and nothing I couldn't handle myself but like you know I you know sometimes that was if we got into a fight right now Tim's dad would jump out of trees Green Beret style like of a guy this I remember one instance in college where a guy was distracting a girlfriend of mine",
            "start": 4726.12
        },
        {
            "text": "I was gonna say someone comes at Tim his dad is jumping out of trees Green Beret style, like this guy. I remember one instance in college where a guy was distracting my friend's girlfriend and I stepped in and said, \"What are you doing?\" He was like, \"What you gonna do about it?\" And I was like, \"You might get caught.\" I never had that kind of situation with my friends, so it's well-documented at this point what I did in high school. When you're shadowboxing by yourself at night and then frequenting the marching band during the day, you don't have a lot of people who have your back. Although, being in drumline was great because there were a couple guys who nobody wanted to mess with because they were a little crazy. I had one time... I think I've told this story before, but I'm not sure if I did on this show.",
            "start": 4765.18
        },
        {
            "text": "and drumline actually there's a couple guys in Drumline that no one wanted to mess with just cuz they were like do a little crazy I had one time I think I've told the story I don't know if I told on her podcast I'll pull it again I do have one time when I almost kind of fight with a guy it was over a girl cuz I loved his girlfriend and he was like dude stop I was totally my fault and I was like I I thought I had like this is the girl that I had the biggest crush on in high school I never forgot her to this day she's still super cute because I Facebook stalk her every once in a while thankfully my wife doesn't listen to this podcast well that's what everyone does come on everyone Facebook stalks Sara's girlfriend - what face was for Twitter's for pretending you're someone else and tweeting at them one time so I remember I got into if I almost got him one fight I almost got into like almost fisticuffs was in high school and I was like oh the shadowboxing it's all gonna pay off I'm",
            "start": 4811.23
        },
        {
            "text": "at them one time so I remember I got if I almost got him in a fight I almost got into like almost fisticuffs was in high school and I was like oh the shadowboxing it's all gonna pay off I'm gonna know I remember I was getting into a fight in front of the band room and the drum major was there the drumline was there at home because that was cool them and we almost we got to that point where we were looking at each other we were staring each other in the face right we're like you know it's just like to anyone that works at the school these guys are gonna get into a fight so people started converging on us right and I think both of us saw the yellow shirts converging on us from our peripherals and so we both knew because neither one of us wanted to get into a fight I hold to this day that neither one of us actually wanted to punch each other we just were like just be like hold on beat up enough till those yellow shirts get there and then it was over what's",
            "start": 4853.92
        },
        {
            "text": "into a fight I hold to this day that neither one of us actually wanted to punch each other, we just were like \"just be like, hold on, beat up enough till the yellow shirt gets here\" and then it was over. What's the yellow shirt staff okay, like security? Mmm, you know my colors were golden, like golden blue, so I was like a Golden Blue on staff sure. So I saw him coming out of the corner and you should have coldcocked them real quick before they got there, I was thinking it occurred to me. But what was more embarrassing was two things over embarrassing: one was that I didn't realize the entire drumline was behind me, and to the person who broke up the fight was the smallest female that worked on this campus, she took us both like we're just wait... oh, we were waiting for it, we just came apart like two magnets on opposite ends. Just part, and the drumline later on was like \"dude, we totally had your back\" and I was like \"I didn't know you guys had my.\"",
            "start": 4896.28
        },
        {
            "text": "we came apart like two magnets on the opposite end just part and the drumline later on was like dude we totally had your back and i was like i didn't know you guys had my back or else i would've acted a lot tougher before i pretended that i was gonna get into a fight and they were like wait wait i had your back bro good had your back and then later we ended up apologizing to each other and shaking hands oh yeah that's good i don't like people that are tough for the feeling of being or for the sake of being tough but i like the people that are righteous and stick up for people you know yeah see that was i tried to be that guy when i can yeah that was the last fight i was almost in oh i like how they're all almost fights for this table but we're in college we're having a house party everyone's there getting crazy and one of our friends walks in his name is Bryson he walks in he's black he's totally dejected i'm like what's wrong dude Baba",
            "start": 4937.89
        },
        {
            "text": "we're having a house party everyone's there getting crazy and one of our friends walks in his name is Bryson, he walks in, he's black, he's totally dejected, I'm like what's wrong dude Baba, he's like two or three houses down, four houses down, whatever, they're having a party and they just scream the N-word at me and we're like oh **** no, like literally all these guys are somewhat drunk, get up, and we had this guy with us who was huge, I mean huge, like the biggest guy I've ever seen, I'm talking high weight, I think he would step in at any time, we'd have something start to go down at a tailgate or something, this guy would step in and it would immediately stop because this guy, you know, nobody would **** with this guy, he's like a giant freaking Titan, you don't I mean so we go up there, this giant crew, we go up there and we get to the front of the house and like we can see that there's a screened-in porch and there's people on the porch and so like our leader goes",
            "start": 4975.0
        },
        {
            "text": "Go up there, this giant crew. We go up there and we get to the front of the house, and like we can see that there's a screened-in porch, and there's people on the porch. So, like our leader goes up there and he's talking through the door about what you know, what's going on? This is out of line or whatever. Ah, just hanging back on the sidewalk like you do, like we've... You know, we're not gonna go through this door, like whatever. And so he's talking, talking, talking. He comes back; he talks like, \"Well, we're not having it. They're not listening.\" But another guy goes up to his talking, talking, talking. Then our leader goes back up there and is talking, talking, talking. And all of us in the door throw comes open, and a guy throws a beer in his face. And then more people go to the front of the thing; more people are yelling. I'm like Washington's like, \"Why why aren't they backing down? We have all these people; we have the giant guy.\" This is how it goes every time, you know? I mean, like... You know somebody's",
            "start": 5016.68
        },
        {
            "text": "Are yelling and I'm like Washington's like why, why aren't they backing down? We have all these people. We have the giant guy. This is how it goes every time, you know. I mean, like, somebody's out of line, we're gonna be like this, it'll be over no big deal. And so finally, like, we're going and I'm like, something's just getting worse and more and more people are getting angry. You can hear people shouting on things. So I turn to my girlfriend, I'm just like, \"Take my glasses,\" I think I'm gonna fight here, and she's like, \"I'm not gonna take your glasses, I'm not gonna help you find.\" I'm like, we'll go to the house and get more people or something, I'm not gonna help you find. Like, we're gonna get beat up, something's happening here. And I'm like, I don't know what's gonna happen. I'm not going to my fine. Finally, somebody else goes up there to talk another guy in their face and then the screen door throws open and like 30 people come out for an hour and a half.",
            "start": 5053.55
        },
        {
            "text": "know what's gonna happen I'm not going to my fine finally somebody else goes up there to talk another beer in their face and then the screen door throws open and like 30 people come out for an hour, it's two on one on every person more with and it's like oh this is what's happening this is Wow I see what's happening and so they are always at no point did you assume there were more people in the house I knew there was but I mean I know points I didn't think it might be a whole house full of people was a party well we were rolling up deep - I didn't see it it's not deep alright I'm sorry so it's all cut sudden it's on every multiple people on the huge door and it's like huh this is bad and so I've already taken my glasses off now and put them in my pocket and the guys roll up a meet and they are all like Bros like the pop collars and like they train for this they are ready for this it and the guys look at me and all I cannot clearly this guy's going to destroy me",
            "start": 5085.43
        },
        {
            "text": "up a meet and they are all like Bros, like the pop collars and like they train for this, they're ready for this. It and the guys look at me and all I cannot clearly see this guy's going to destroy me and just rock me. And all I can come up with is this has gotten out of hand. I draw a comic for the school paper, like, just on my chest, and it's like as soon as he hits me, I'm like oh I'm getting hurt, this is bad, bad, bad. And so, oh it's like we're literally there, they're already starting to kick the big guy's legs because they take him down that way. But it's like literally, I'm like oh jeez, you know, one of their girlfriends comes off yeah, one of their girlfriends comes out and all those guys flood back in the house. And like we're all still in our fighting stance on these little ones by ourselves, and a cop car just rolls by alright, just like, brunch ourselves off and go back to the house. But in like big huge guys, I'll never forget it, we got back there and he was so upset.",
            "start": 5132.56
        },
        {
            "text": "on by ourselves and a cop car just rolls by alright just like brunch ourselves off and go back to the house but in like big huge guys I'll never forget it we got back there and he was so except the entire situation flips this like this like wives and then like thicker than those two tables probably concrete slab we have in our front porch where was that rage 20 minute base well no I mean so it's not it's not like it's not a multiple types yeah so it's not it's not I was I had never gotten I'd never gotten into a fight after high school but like you get anything you find your something you sit extraordinary situations that have nothing to even do with you and suddenly I'm at least in my in my experience and something he was getting the ship you daddy about someone it was like okay that's fun oh so yeah I mean that's every time I've come to the point where I've actually fought there's only one I think twice twice it ended up with me getting punched and then me hitting the ground",
            "start": 5188.96
        },
        {
            "text": "fun oh so yeah I mean that's every time I've come to the point where I've actually fought there's only one I think twice twice it ended up with me getting punched and then me hitting the ground and that was it there was no there was no Jean-Claude Van Damme jump kick like I thought I could pull off there was no action hero Hall of Fame for me it was me getting punched in the eye and realizing oh my god that really hurts and I can't see and there's nothing I can do about it and you think I would learn but I've ever told you the story of why I quit smoking No okay so good sorry so smoking by the way cool looking arguably cool looking great says it all so uh screws with your move a little bit right and it's a depressant I believe so when you don't have what your body craves it like any drug when your body craves something that it can't have it you have mood swings you have elevated moves you have even be smoky feel happy and you go down and you fall over stupid pressed so I was",
            "start": 5248.0
        },
        {
            "text": "any drug when your body craves something that it can't have it you have mood swings you have elevated moods you have even been smoky feel happy and you go down and you fall over stupid pressed so I was experienced in that pretty hardcore cuz I was going I was smoking about you know a three-quarters of a pack a day which is a lot of cigarettes about 20 cigarettes in a pack so I'm smoking all four as a 15 and one weekend I know I never you smoked with my wife I would like I'm not gonna smoke around her and so when I be with her obviously cranky and I was going to park my car and in you've seen you guys have all parked now with me you haven't but when in order and parking San Francisco is not the easiest thing so it's frustrating as is but I had to swing around because in my Park and my carport and there's always two cars they're almost like touching and I have to squeeze between them just to get so the angle I have to go super drastic on it well I forgot to put my blinker on so I swore",
            "start": 5295.52
        },
        {
            "text": "and there's always two cars they're almost like touching and I have to squeeze between them just to get so the angle I have to go super drastic on it well I forgot to put my blinker on so I swore about right and some guy tries to naturally pass me on the inside he's totally right and I go and I cut him off and he slams on his brakes he starts talking at me and I'm pissed that's it that's it I'm gonna show the my how macho I am and how is your wife in the car you're my wife's in the car his wife's in the car I didn't look at him I didn't bother looking of course not so I just flip him off he's keeps honking his horn he's pissed at me that's it I found my car in a gear this is what we trained for my wife is just like my wife is just kind of like she didn't know what to do she was awestruck she said I can't believe I've never seen Nick this in rage and I was like pissed this guy pulls up and I'm thinking again here's what's gonna happen I'm gonna get up let me yell at this guy he's gonna",
            "start": 5331.79
        },
        {
            "text": "said I can't believe I've never seen Nick this in rage and I was like pissed this guy pulls up and I'm thinking again here's what's gonna happen I'm gonna get up let me yell at this guy he's gonna keep driving that get out and get out of my car slam the door and I start yelling at this guy horrible things and he stops and his wife is in the car she's terrible I can see her going like this my not to me to him like not stop cuz you're gonna get your ass kicked don't get out of the car you're coming back to jail if you kill another guy you're gonna kill this get it can I'm 34 33 at this point and the guy gets out of the car and I'll never forget this he gets out it's like six five and I on my best day five eight so big any just to screw with me goes oh what and flexes his muscles and I'm like what like every other day you go to the gym to get those biceps those are the biggest things I've ever seen in my life and it but just the blood drains out of my face but I'm like no my wife's",
            "start": 5373.46
        },
        {
            "text": "like what, eight days a week, you go to the gym to get those biceps, those are the biggest things I've ever seen in my life, and it but just the blood drains out of my face, but I'm like no, my wife's watching; his wife's watching, I gotta back this guy down, we get face to face, and the only thing I can think is the guy was chewing gum, the only thing I could think to say is \"oh,\" he was like what, what, I'm like what, throw a punch, do you throw a punch, I'm taking this slippery slope maybe kick him in the knee, I don't know what the hell I'm gonna do; my shoulders are messed up, I got bad knees, I haven't worked out in years, I'm really overweight, he's got like what, big man, big man, big man, the only thing to say to it was \"your breath smells good,\" and he's like what, and I'm like what, and he's like dude you're **** weird, and he got up, he left, that was it, and I'm like I gotta quit smoking, got the patch, and I'm like I'm done, I'm done with this story, yeah, I was like hey, you best man, oh my god what",
            "start": 5425.78
        },
        {
            "text": "weird and he got it he left that was it and I'm like I gotta quit smoking got the patch and I'm like I'm done I'm done with this story yeah I was like hey you best most good oh my god what and I'm like huh and it was situations where I could tell he didn't want to do it either he was like just back down dude just know I'm gonna destroy you did he was not gonna back down so I'm tired of backing down I'm not gonna back down and my wife's like I could hear in the cars just like back down and his wife's like dude back down cuz you were wrong yeah and if I could find that guy today I would literally walk up to him go I'm sorry I was wrong then yeah I didn't sing Sheree Tom it was not the show he's not he hasn't thought one thing about it cuz the guy knew with the shadow of a doubt no doubt in his mind he would have just destroyed me and I'm talking like destroyed the guy was like twice my size but anyway that's there now see my meat you were asking for the meanest moment or",
            "start": 5465.74
        },
        {
            "text": "no doubt in his mind he would have just destroyed me and i'm talking like destroyed the guy was like twice my size but like cut so anyway that's there now see my meat you were asking about meanest moment or whatever right you were going to fight somehow yeah it happens that's similar to my meanest moment I'm putting quotes on it but III you know meanest moments kind of hard to come up with at the moment i felt probably the worst in my life cuz you know like i was talking about it right that i try to live by superman values here be a better person be a beacon of hope be nice help everybody out that i can i was back in illinois for my mom's wedding she was getting remarried and i was there with my girlfriend at the time portillo and we were trying to drive back to missouri but i was in the wedding so i had to return my tux to the mall a number of other events that happened that day stupid things i don't know maybe i need to change a tire there was like all these little little things",
            "start": 5506.45
        },
        {
            "text": "so I had to return my talks to the mall a number of other events that happened that day stupid things I don't know maybe I need to change a tire there was like all these little little things that frustrated me right it's like where it's you know a six-hour drive back to Columbia so I already knew we weren't getting out on time anymore we're gonna get there super late I'm really pissed about that traffic's bad I gotta do this guy do that I go to the mall to drop off the tuxedo right and I'm already like seething with anger just mad in general I'm circling a lot trying to find a spot and all this is made worse by the fact that I just need to find a spot to go literally as soon as you go inside it's right there I said go in the front door take a little left and drop off this tuxedo and come right back out so I just I just need a parking spot not me with no spots anywhere except like way in the back and I'm like I am NOT doing this you know I mean so like I drove the car around around",
            "start": 5547.62
        },
        {
            "text": "Out so I just, I just need a spot, a me with no spots anywhere except like way in the back and I'm like, I am NOT doing this, you know, I mean. So like, I drive the car around, around, finally, like you know there's a front door to the mall, then there's like you know the crosswalk to a little median and another crosswalk over the parking lot, and like it's smooth spots, like you can walk through it or push a car door, push you know anything through it, like handicapped entrance. Uh, I swing and just park there to block it, I'm like, it, I'm gonna block this for literally, literally the 60 seconds I need here, life cut me a break. This is clearly, this was in Chicago, yeah, yeah that's common place, you just park your car wherever you want, you know? You do think like an hour crowded mall and it's already, it's a hot summer to like almost everybody, it was hot for sure. Anyways, park the car, girlfriend's in there, we have all his crap packed in because I was driving a Ford.",
            "start": 5586.17
        },
        {
            "text": "crowded mall and it's already is it's a hot summer to like almost everybody it was hot for sure anyways park the car girlfriend's in there we have all his crap packed in because I was driving a Ford Mustang at the time so there's no storage at all in this is a 5.0 Mustang was that cool 80s Mustang no it was in 94 ok ragtop blanked in uh but partit was on her lap she's totally locked in so it's not like she's gonna be able to help if the car needed to move for somebody to take our spot you know to yell at us for the spot or ever I'm like whatever look around there's no one coming with a car there is no one in a wheelchair nothing is happening migrate cross that across the meeting cross and go and drop off the tux come back out come back and I somehow out of **** nowhere the this nice Mulder gentleman materialized with his daughter in a wheelchair and he's pushing her and now they're at the car they somehow gave me the slip on me coming in and looking for this kind of situation I",
            "start": 5629.06
        },
        {
            "text": "Mulder gentleman materialized with his daughter in a wheelchair and he's pushing her and now they're at the car they somehow gave me the slip on me coming in and looking for this kind of situation I can't find I'm negative and said no it's not that I'd see him they just appeared someone put them there they're an operation yeah exactly okay so my god and I'm to the point now I'm just like like this is like airport mode right where I'm just like **** everybody else I just want to go home get out of here so I go go go you know he's like they get to the car like they beat me there so they're blocked in I just run up I don't say anything to them I don't want a confrontation I don't want to talk about him right I go in I get in the car I shut the door I reverse out and my windows are now cuz it's hot and so my windows are down and he rolls up and turns he's just like just so you know next time and I just **** floor it and just like burn out and like leave him in literal dust that's kind",
            "start": 5668.7
        },
        {
            "text": "\"Hot and so my windows are down and he rolls up and turns, he's just like 'just so you know next time' and I just floor it and just like burn out and like leave him in a literal dump, that's kind of cool no but like it's one of those things. And if you didn't have a wheelchair, was just an old crotchety old man. He wasn't crotchety, he seemed like a nice guy, and it didn't seem like he was about 'just for next time' off, just for next time, you know? Think about it, you don't even front of other people exactly that's something stupid about able-bodied but like I floor it in the dust and like there's a screech and everything else and like there's just like this tense like 10 minutes of silence as I drive like onto the highway right with me and my girlfriend and I'm finally just like 'I'm sorry', one of those things, just like what an idiot and like for the drive down there I'm debating like taking out an ad in the paper to apologize like somebody still reads the newspaper yeah I\"",
            "start": 5710.82
        },
        {
            "text": "I'm sorry one of those things just like what an **** and like for the drive down there I'm debating like taking out an ad in the paper to apologize like somebody still reads the newspaper yeah I mean but I felt so terrible about it because it was like totally like it wasn't he was being a dick it was just like that was the final **** straw so he got I've been in situations like that so my meanest thing is not one anyone incident I wish there was one a pinpoint but I am prone to fits of like extraordinary rage Tim you see a man sitting I take it out on babes four of them my my thing is this I know the second it's happening that I'm wrong yeah and that I just need to get it out I should stop I try to stop as soon as I know I feel it coming I'll get you just get to a point where you're just I've had it that's it you know like you're talking about and it's happened at work and the one that when I happened to work what happened to work I at least get the opportunity to make amends",
            "start": 5750.96
        },
        {
            "text": "just I've had it, that's it, you know like you're talking about and it's happened at work and the one that when I happened to work what happened to work I at least get the opportunity to make amends where I'm like sorry about the Nick apologizes every time and it's one of the most genuine apologies you'll ever get one time you actually mean this one time I yelled at Alex, this is not that media's moment I just I just took it out on Alex I felt bad no I can't were what I was saying I was totally he was just trying to solve a problem for me and every time he would try to solve something I just wanted rage at someone's this kept yelling at him and I felt bad and I immediately apologized and all Alex did was he gave him one of these mmm because bump fest and that was it he never talked to me about it again which I thought was really really cool stand-up guy probably the one time though that I was really mean as I was looking for parking Impact Heights is a horrible park",
            "start": 5796.0
        },
        {
            "text": "it again which I thought was really really cool stand-up guy probably the one time though that I was really mean as I was looking for parking in Impact Heights, impact heights is a horrible park and it's not as bad as Noe Valley but it's one of the worst areas in the city to park in and you'd circle around and you'd circle around and eventually you got faster you'd be going faster because you think to yourself if I just go faster I'll find when the guy gets out I'll be the first person to him and I'm going fast, I was going fast and I look left as I'm turning right and I hear \"hey\" someone slams his hand on my hood, I slam my hand on my hood as I come to a stop and this just two dudes walking their dog I almost ran over and I was like how dare these guys be in front of my car they didn't look before they walked off the sidewalk in San Francisco and I'm thinking this as it's coming out of my mouth I'm actually screaming this at these guys \"how dare you, why you, you got a look where you going bro this is a city\"",
            "start": 5831.52
        },
        {
            "text": "of a sidewalk in San Francisco and I'm thinking this as it's coming out of my mouth I'm actually screaming this at these guys how dare you why you you got a look where you going bro this is a city people are driving here the guy's like I have the right-of-way and he's walking his dog what I didn't realize was that his dog had just **** and he had picked it up and he had a bag of it oh no he was so pissed because they were walking it and his significant other was pulling him like don't don't do this with this I could not do it and this one guy he was just like I'm walking my dog I'm with my husband this is like this is not like this is ridiculous and I'm screaming cuz I don't want to let I don't wanna back down from this even though everything in my brain is telling me not to kill kill kill and so the guy literally takes the bag it was wrapped thankfully and throws it into my car and it almost hits my face and they just walk off when I",
            "start": 5871.3
        },
        {
            "text": "parts like not I'm not kill kill kill and so the guy literally takes the bag it was wrapped thankfully and throws it into my car and it almost hits my face and they just they could walk off when I tear off and I drive around and I see a parking spot and I'm like I gotta go apologize to these guys I literally kept driving until I found they were right walking down Pine Street and so I and pine trip was the other way so I had to go all the way back around and I came in and I pulled up on and the guy was like what the hell and I'm like hey I'm really sorry about that I was I'm having a bad day and I apologize and I'm looking for parking and I just kind of made it worse and guys like I have a car - don't worry about it see that's really cool that UK and his end the guy was like I really appreciate that you came back and I'm like I just want you to know like it's Sunday I didn't wanna ruin your night I apologize just kidding dog **** I believe I'm around mistaken I think the guy was like",
            "start": 5913.0
        },
        {
            "text": "that you came back and I'm like I just want you to know like it's Sunday I didn't wanna ruin your night I apologize just kidding dog **** I believe I'm around mistaken I think the guy was like I'm sorry for throwing **** at you and I'm like I deserved it that's a good way because that was my whole thing is like we all even when even though you were wrong to yell at them right they should be you you've been in that situation on both sides that both sides but exactly right then usually it's like what are like one of the persons I want to but you know that something else is happening there but like that's how it goes yeah I'm using the guy I'm using the guy that gets pissed and I you normally have an exorbitant amount of patience it's just once that patience fills up what's wrong I'm not like you see Colin you're different than me like I it's it's a big bucket I will have as much patience when people don't say thank you for opening the door I'm like whatever they're having a bad day",
            "start": 5956.68
        },
        {
            "text": "like you see Colin you're different than me like I it's it's a big bucket I will have as much patience when people don't say thank you for opening the door I'm like whatever they're having a bad day or they're focusing something else don't worry about then I'll build build build build build it's really unhealthy yeah you got to let it out you gotta let it out and I'm just like Bob is over not that I don't have those spillover moments where I was thinking I just had a funny story when I was back on Long Island for Christmas I think I was taking Long Island Rail Road to Brooklyn to see Ramone yes Ramone you mean it is my mother moon and I still have yet to see a picture of this mystical doctor I can show you it and I I like you know I was walking out of the train at I was at Atlantic terminal right by Barclays Center where the Nets play and the Islanders would play and I was you know I noticed that this older gentleman was like walking out at the same like kind of shoulder-to-shoulder",
            "start": 5997.78
        },
        {
            "text": "Right by Barclays Center where the Nets play and the Islanders would play, and I was you know I noticed that this older gentleman was like walking out at the same like kind of shoulder-to-shoulder with me so I stopped then I was like you know you can go ahead yeah and he just like looked at me and then I walked ahead of him. I was like oh no problem you know and he was like oh I'm sorry thank you so much like like that usually like you say it like you say your due's because you don't expect anyone to do a dive until they get out of the car or they challenge and then you get that oh **** oh I'm the yeah and not that old man was gonna fight anywhere but I just laid him out. But I will say this to our listeners, because I was talking about you know you know you know fighting quarreling and all this kind of stuff, this tough-guy **** or whatever you know the one thing the \n\nNote: I corrected \"your bowl\" to \"your due's\", assuming it was a phonetic error for \"dues\".",
            "start": 6038.22
        },
        {
            "text": "but I will say this to our listeners because I was talking about you know you know you know fighting quarreling and all this kind of stuff this tough-guy **** or whatever you know the one thing the wonderful piece of advice I'll give you is to kind of be the master of your own destiny what I mean by that is like the times that I got roughed up by people like really roughed up I got a concussion in a fight was when I was in 11th grade was like don't let your stupid idiot friends drag you into dragged you into their **** you know let me ask you this yeah was there ever a time that you got into that situation that you know in your heart you didn't get yourself into yeah I mean I hurt you of just being around the people like when you guys like I shouldn't be I know I shouldn't be yeah I dude I was I was in no situation wasn't that my friends were bad like when I think about those people that I was with in those situations ones a cop now one's a doctor you know there's a lawyer in",
            "start": 6090.92
        },
        {
            "text": "I was in no situation wasn't that my friends were bad, like when I think about those people that I was with in those situations - one's a cop, now one's a doctor, you know there's a lawyer in there, and like all these like they're totally but like for some reason we were just stupid. Yeah, but I wasn't like a violent or angry person; I didn't have I didn't want to have beef with anyone, that's why I got along with everybody, and I got with the football players, I got along with the lacrosse players, I got along with the nerds and the jocks, and you know the you know whatever. And like just by virtue of just being around these people in their stupid situations fighting with people at parties, whatever it's like well he's with them, and so now I'm gonna punch him in his face, you know? I'm like what the... and then you like have to just be like well I'm I got a stick up for my boy but I'm not I don't wanna... and then before you know it like two guys are on you and you and you know your",
            "start": 6132.0
        },
        {
            "text": "I'm like what the and then you like have to just be like well I'm I got a stick up for my boy but I'm not I don't wanna and then before you know it like two guys are on you and you and you know your 16-year-old Colin's getting **** kicked on the ground yeah and that's why I like by the time I got to college I was college I was 17 like many people do like I had you know learned those lessons and you know didn't get involved in those situations unless obviously I my own neck was on the line right rarely was or you know I had my friends back me up my big friends where someone was really getting **** with like our you know like that time where my girl my girlfriend was getting **** with by this guy and we stepped in but like all these stupid situation just keep yourself out of these stupid situations nothing to do with you like I never did anything in those situations to have that happened to me and yet there I was you know III and again I've been in a number of them and without",
            "start": 6166.11
        },
        {
            "text": "stupid situations nothing to do with you like I never did anything in those situations to have that happened to me and yet there I was you know III and again I've been in a number of them and without fail if you know you're at fault apologize because every single time I've done that the guy I thought was this like unstoppable force of power and craziness was always like oh yeah thanks no problem like I appreciate that it's always be the bigger man always yeah being the bigger man is important understanding when you're wrong is important it's when you talk about Alex I had a thing with Alex once too and I emailed him I apologize like right after that I apologize people when I've been sent back a jpeg of a fist and it wouldn't work because people like people that don't know me well like I think I come off as Kurt or a brash do a lot of people which is fine but I'm like I'm there to like do I think of use brazen brazen I'm there I'm that's a good it's a good descriptor I I'm there to",
            "start": 6203.46
        },
        {
            "text": "I think I come off as Kurt or a brash do a lot of people which is fine but I'm like I'm there to like do I think of use brazen, brazen I'm there I'm that's a good it's a good descriptor I I'm there to like do a job I don't have my tolerance for crap is like mmm zero I have like zero basically zero tolerance crap yeah and I'll give it to you if you give me crap yeah you give me crap before no yeah we a little bit you've gotten into it a little bit it's fun because I don't like you know I feel like I hate when my time's wasted I'm like a really punctual person I feel like right you tell me be somewhere at 12 am there 12 yeah I hate when you're the first about that you're the worst about one time we're in the studio guy tell the story okay yeah but you were about you about we were getting ready and I told the call time was like my son like 2:30 and Colin's there on the dot 2:30 he's sitting there typical IGN video something goes wrong in the studio I can't get one of the monitors",
            "start": 6247.17
        },
        {
            "text": "Ready and I told the call time was like my son, like 2:30, and Colin's there on the dot at 2:30. He's sitting there, typical IGN video something goes wrong in the studio, I can't get one of the monitors working, so I'm trying to figure it out, and Call of Duty is just sniping the entire time. He's like \"play what she told me to show up to 40,\" he's due for you right now, do 41 Scorpion up, and just was like, \"just chipping away at it.\" And I'm like, \"he doesn't care, he's just doing it to screw with you on general principle. Don't forget that that's one of my very endearing qualities so I just hate that.\" Like when people there was a Huffington Post story about this actually good article, so they're like, \"why doesn't anyone respect time anymore?\" Well, you tell someone like \"meet me for lunch at 12:30\" and don't get there until 1250. You know, like, and I understand like things breaking, things happen, but I try to respect people's time enough that you did show up on time. Obviously working with technology and broken equipment, but I just feel...",
            "start": 6286.62
        },
        {
            "text": "1250 you know, like, and I understand, like, things breaking, things happen, but I try to respect people's time enough that you did enough. I'm obviously working with technology and broken, but I just feel like generally there's only good disrespect in terms of like time and like people's time and punctuality, and so like then I try to be punctual. I try to say I'm a man of my word; I really stand by that. I do what I say I'm gonna do; it's real important. That's why I had to cancel on podcast Beyond yesterday because you know I had told someone last week I was gonna go to lunch with them, and even though Andrew Goldfarb is one of the most important things to me in this San Francisco area, I had to go to lunch with this guy; that's just the way it is. I told I was gonna do it, you know, and I told Greg that after the fact like so it has to be there has to be an order of operations these things I really believe in those principles, you know, but don't let them get those principles like dragged you down in the Yak.",
            "start": 6326.4
        },
        {
            "text": "fact like so it has to be there has to be an order of operations these things I really believe in those principles you know but don't let them get those principles like dragged you down in the Yak admit when you're wrong and one of my favorite uh my favorite books is The Count of Monte Cristo and he has a great concept of time you know the concept of like if you show up on time you're late I always show up fifteen minutes early it's in The Count of Monte Cristo he has this great scene where he's like I show up on time you tell me to be at a place by one o'clock I am at your doorstep at one o'clock on the dot and it's for him it was a whole different thing but I was I always tried to subscribe to that I never try to show up really early because I think that's rude but I show up early I try to show up on time like you want me there one I'm their one dependable it's weird and I'm always late the only exception the only exception of the time rule is parties party starts at 9:00 I'm",
            "start": 6359.88
        },
        {
            "text": "I try to show up on time like you want me there when I'm there, one dependable guy, it's weird and I'm always late. The only exception is the party rule: parties start at 9:00, I'll get there at 10:30. Yeah, that's just the nature of the beast, right? You don't want everyone to show up at the same time; they can't get through the door, it's very load-bearing. Things you have to take into consideration other than that... like, you know, I respect it. I hate having my time wasted, I hate doctors and dentists who waste your time, you know, that's just not cool. So I try to do you want others as well, you know, lazy gentlemen. That's the GameOverGreggy show every week: four best friends gathered on this table come with random topics to talk it out for your amusement. We post the high-quality MP3 on Game Over Greggy Bandcamp every Friday; you can buy it for one dollar, but if you want it for free, you can get it at Game Over",
            "start": 6397.53
        },
        {
            "text": "to talk it out for your amusement we posted the high quality mp3 on GameOverGreggy Bandcamp every Friday you can buy for one dollar but if you want it for free you can get it at GameOverGreggy.com or youtube.com slash gameovergreggy that's where the YouTube video goes live for free opening up the cookies Tim's opening up cookies if you're listening at home we did not get lost in a firestorm of electricity and sexual energy thank you all for joining us until next time not nearly enough Tim Allen references in this episode",
            "start": 6449.98
        }
    ]
}