{
    "id": 283,
    "video_id": "QV4IM0gG3tk",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Why Star Wars Is Dead To Me - The GameOverGreggy Show Ep. 22 (Pt. 2)",
    "description": "Full Episode Friday! Get it EARLY here! http://gameovergreggy.bandcamp.com\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nNick's Harry Potter video!\nhttp://www.youtube.com/watch?v=2WhhS2maFEs\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1399359602,
    "duration": 1237,
    "transcript_chunks": [
        {
            "text": "Colin, yes, what's your topic first of all? I want to read this real quick. This tag from Eagle Rare, oh please do, I'm drinking Eagle Rare, it's great bourbon, it's a little expensive but you should drink it, it's good. It says \"Leader Rare: Life, Courage, Leadership, Survival, Heroism, Devotion, Character.\" I'd like to live by that character. To throw that character out the window, so I'm going to need a drink for this one. Colin, what before we start? What would be the five or four words that just describe you? Heroism definitely would heroism be in there? Would do those all apply? Let me read those again. Let's go on the table here: Courage, yeah; oh, yeah; Leadership, sure; Survival, oh, yeah; why is survival that one that stands out to you? That's when you want to survive, you drink whiskey, whiskey because that's the one thing you need out in the wild to survive. All right, sorry Colin, no it's okay. What is your topic? So I want to talk about uh real quick and and I'm just going to come out and say it um decision.",
            "start": 1.1
        },
        {
            "text": "the one thing you need out in the wild to survive all right sorry Colin no it's okay what is your topic so I want to talk to uh real quick and and I'm just going to come out and say it um decision was made the last few days that really disgruntled me and made me state that Star Wars is officially dead to me officially dead dead to me how could Star Wars be dead to you because they went ahead Disney went ahead and took the expanded universe and said that it's all not canon anymore but hasn't it always been that though no no it certainly hasn't a lot a lot of people have been trying to say that that they've been saying this but that's **** it's always been part of the cannon oh most of it not all of it some of it hasn't been and they've tried to work it in or whatever but this is officially stating that anything that happened in the expanded universe mostly in between Empire and Jedi and then after Jedi um is no longer part of the story and this frees up the writers of course of JJ",
            "start": 50.56
        },
        {
            "text": "stating that anything that happened in the Expanded Universe, mostly in between Empire and Jedi, and then after Jedi, um, is no longer part of the story, and this frees up the writers of course of JJ Abrams' Trilogy to write what they want, but it bothers me not in the sense that they can't do this; they can do whatever they want, you know. A lot of people were like, \"You sound awful entitled,\" and I'm like, no, no, no, because I'm not saying that they can't do this if they want to do that - that's fine. I'm just saying I'm not giving you another cent of my money ever, ever, and that the hundreds of dollars I spent on that EU stuff when I was a kid, and all the time I read it and studied, and all that stuff, wasting my time. You got a higher education than that, didn't you? You're a it's useless; I basically had a bachelor's degree in Star Wars Expanded Universe as a kid, self-taught, in addition to my degree from Northeastern, and I only have one degree, and it's from Northeastern, because this other",
            "start": 92.16
        },
        {
            "text": "basically had a Bachelor's degree in Star Wars expanded universe as a kid self-taught in addition to my degree from Norwich University, and I only have one degree and it's from Norwich because this other thing ended up being you're literally half a man right now. I ended up going to a vocational Technical Institute, you know? Here's my thing on that one though - don't you feel like that's a little bit of a relief though because now they can go forward with Lawrence Kasdan as a writer and write something good; they don't have to adhere to the metacanon. Well, I guess they actually still do - Lucas wrote that and that is canon, and so is Jar Jar Binks. Yes, Jar Jar Binks is canon. Prince Shaak Ti is not canon, Dantooine is not canon, Mara Jade is not canon, Grand Admiral Thrawn is not canon. Jar Jar Binks and those racist Asian Trade Federation people are canon. Let me ask you - let me ask you a question: so like Flash Forward to like 7 months from now right, and everyone's like when you're",
            "start": 132.72
        },
        {
            "text": "and those racist Asian Trade Federation people Canon N Gun let me ask you, let me ask you a question, so, so like Flash Forward to like 7 months from now, right, and everyone's like when you're sitting in the theater watching it, no, you get into work and everyone goes like, \"everyone goes, dude, you haven't seen it yet,\" oh, you got to come see it, this what always happens at work, everyone's like, \"dude, you haven't\" and they act like the thing came out 18 months ago and you're just now catching up, you're the one that does this, the trailer just so literally, so literally, you walk in and Colin someone goes, \"Colin, you got to come see it,\" this is the first Star Wars episode 7 teaser trailer, right, and it gets no, it doesn't do do that, right, whatever it's going to be the Disney house with the thing, it gets so it's a really cool Lucasfilm then, right, cuz that's still available, thing, um, no, so then it starts, right, it's like and you hear some cool sort of voice and it's like",
            "start": 174.16
        },
        {
            "text": "house with the thing it gets so it's a really cool Lucasfilm then right cuz that's still available thing um no so then it starts right it's like and you hear some cool sort of voice and it's like the Empire's wake and then the next thing you see is Jar Jar Binks what do you do I kill myself and everyone around me like it's a me I'm a you're Miss it'll start with some something alluding to it's I never thought I'd see you again Skywalker and then like it'll start with the crawl of the story no he's talking about the trailer trailer the crawl the we have 60 seconds to make an impression here's text that would be more interesting at least it's the story so we can see where all I don't think they're going to start I don't think they're going to show they'll show like one or two that'll be later in the trailer they'll show H that'll be the end yeah oh yeah and the end it'll be like the door opens and it's all three of them there sucking look at all old and this is",
            "start": 212.92
        },
        {
            "text": "that'll be later in the trailer they'll show H, that'll be the end, yeah, oh yeah, and the end it'll be like the the door opens and it's all three of them there sucking. Look at all old and **** this is the other thing sucking the guts guys were the Star Wars sucking the guts guys were the Jedi, oh Leia. God bless God I love Carrie Fisher, God bless her in this movie it's gonna be amazing because so but that's not my problem I'm glad they got Luke and Leia and Han (corrected from \"hanack\") they're in the expanded universe right like and all these things have happened in the expanded universe what really bothers me is that not all these stories are good I haven't read them all and even the ones that I've read weren't good but there's some really really good ones so good that George Lucas **** stole from them like Coruscant (corrected from \"corus\"), the Imperial capital was created by Timothy Zahn in a book what if he what if he now steals what if they steal good **** from it and like make something new that is the good part yeah but it's",
            "start": 261.6
        },
        {
            "text": "Coruscant, the Imperial capital, was created by Timothy Zahn in a book. What if he what if he now steals what if they steal good stuff from it and like make something new that is the good part yeah but it's kind of messed up right because if you're going to take source material that source should be canon right like it's it's kind of it's kind of messed up if I wrote like the Timothy on books were amazing awesome the Empire there was a huge uh you know backlash when they said they wouldn't be doing those right like I remember Greg Rucka was like I think he was pretty pissed off about that cuz that's what everyone thought they would do they would go to the Mara Jade story they would do the the the Ahsoka Tano which is badass right are you familiar with these um but you know if you're going to develop those cool characters you got to give a little credit to the author that's doing it and I think to me that credit is you make a canon like it has to be canon like if the character was originated in a",
            "start": 298.96
        },
        {
            "text": "those cool characters you got to give a little credit to the author that's doing it and I think to me that credit is you make a Canon like it has to be Canon like if the character was originated in a work that's not canon it's kind of it gets murky you know that's my thought it's all **** up what do you the best part is that there's no redeeming Boba Fett storylines anymore so I don't have to put up with **** that this guy was an interesting character just a **** **** I know but he was a **** in the movies you don't know he died and then you always called in these **** little asides that happened in the backwater **** I don't even know where oh he did this thing no he's just an idiot with a jetpack That Couldn't fly he couldn't catch any he had the Mandalorian armor and he's so dead he probably could have survived clone wars and he's dead he could have survived I think like in in I think it's Tales From Jabba's Palace which was released in the mid-90s they tell Boba Fett",
            "start": 335.64
        },
        {
            "text": "the so dead he probably could have survived clone and he's dead he could have survived I think like in in I think it's Tales From Jabba's Palace which was released in the mid-90s they tell Boba Fett story I think about how he gets out of the Sarlacc pit so like how he blows it up or something he might commit suicide in it I don't I don't think so though I think that's he like gets out of it I probably would have uh taken a thermal nuclear detonator out and just nuked myself because I don't want to be slowly you know digested in the Sarlacc pit for the next thousand years did you guys see the uh the Robot Chicken Star Wars specials yeah yes I I love them I love them how they deal with Boba I think it's just great they're not Canon either damn it no but the big so the biggest thing to me is that like it's the EU stuff like post Jedi is disappointing that that's not like a lot of that's not canon but actually this brings Shadows of the Empire into in trouble and Shadows of the Empire is",
            "start": 374.12
        },
        {
            "text": "Is that like it's the EU stuff, like post-Jedi is disappointing, that that's not like a lot of that's not canon, but actually this brings Shadows of the Empire into trouble too. And Shadows of the Empire is awesome, really, really good. I thought he officially said like no, this is canon. Did he never do that? They said that everything that is not from Clone Wars or one other show, Rebels, or the six movies are not canon anymore; they're not canon too bad. So like, so for people who don't know, Shadows of the Empire was released in '96 or '97, and it's the story between Empire and Jedi, and it's awesome, really, really good. It introduces a bunch of new characters and explains things like how Leia becomes a bounty hunter in Jabba's Palace and stuff like that. Yeah, like that's all explained in the book Prince Xizor and in Dash Rendar; um, Das was like a little bit of a poor man's Han Solo, yeah he was a poor man's Han Solo but he had that cool ship, what was it called?",
            "start": 412.92
        },
        {
            "text": "all explained in the book Prince Xeris and in Dash Rendar, who was like a little bit of a poor man's Han Solo. Yeah, he was a poor man's Han Solo, but he had that cool ship. Um, what was it called? Remember what it was called? Yeah, I can see it in my head; it looks cool. Name... yeah, it looks kind of like an X-wing. Hey, look it up right there. That's what you got. The one with the... yeah, the thing. The X-wing was the one with the... like the one it kind of looked like that. I always thought that the expanded universe stuff, like, wasn't canon; that it was expanded. I could have also sworn that it was always like the only thing that was canon was the movies and the TV shows. That was it. No, so... and this is the debate that comes about. I looked this up. Um, what Dash Rendar's X-wing plane didn't bring me anything. Sorry, Nick. I can't help you with your **** ****. That do something other than play a video game for once in your life. True story. I used to work with Mike Sephy at IGN; Colin and he used to use the gamer tags",
            "start": 452.2
        },
        {
            "text": "Help you with your **** **** that do something other than play a video game for once in your life, true story. I Mike a Sephiroth used to work with us at IGN; Colin and he used to use the gamer tags and stuff of Dash Reindeer, whatever, and I thought for I thought for the longest I thought it was Reindeer that he liked – I was like, \"Is that like short for Dasher?\" Yeah, Dasher the Reindeer. But it was some stupid made-up guy who doesn't even exist anymore; whose existence is I don't think he ever now, now he never really existed. No, I'm almost positive that like they went to lengths to explain that expanded universe wasn't canon – that it was just these movies and stuff, and that it was an expanded universe similar to... this is Wikipedia... on April 28th, or April, in European dating, I don't like it very much; April here, again, April 20th, 2014. Following the acquisition of Star Wars licensed by Disney, which was announced on April 14th, 2012 – not 2014 – that all previously released expanded universe material would no longer be considered part of the official canon.",
            "start": 495.84
        },
        {
            "text": "European dating and I don't like it very much. April here in April again, April 20th, 2014. Following the acquisition of Star Wars by Disney, it was announced that all previously released expanded universe content would henceforth be considered an alternate universe referred to as Legends. A Lucasfilm story group moving forward will ensure that all new comics, books, games, and other media are considered Canon and valid to the story being told in the films. So I think there were people who worked at Lucasfilm whose whole job was to keep the expanded universe not even conflicting with itself and then the movies. So they would if it wasn't considered Canon, they wouldn't have given a **** about what's the big uh... They have some sort of big anthology something library, some big thing they keep the records in - what that thing is called? It's a holocron. The holocron. Yeah, isn't that a cool thing? And there are people who are... is that a cool thing?",
            "start": 539.12
        },
        {
            "text": "Something like a library, some big thing they keep the records in - what's that? What's that thing called? It's a holocron. The holocron. Yeah, isn't that a cool thing? And there are people who are... The Keeper of the Holocron, and there are people there who just keep that straight so it doesn't conflict with the movies or what George Lucas wants - even though that never stopped George Lucas with the Boba Fett story for instance in Episode II. But we saw shades of them doing this in Episode II because they ruined the backstory of Boba Fett in that movie, and the Stormtroopers. I thought there were some theories that the Boba Fett in the original three movies was a different Boba Fett than the one we saw in the latter three movies - no, that was just a bunch of hurt fanboys coming up with stories to try to salvage a character that was never cool and try to give him a",
            "start": 579.0
        },
        {
            "text": "Three movies was a different Boba Fett than the one we saw there, no, that was a bunch of hurt Fanboys coming up with stories to try to salvage a character that was never cool and try to give him a shot to be cool again. Two things great, hey I've got this, hey I've got there's a gun in this jetpack and I got this guy, oh I'm dead **** **** have you have you ever tried to use a jetpack? They're exceedingly hot. The Rocketeer did it pretty well, well not at first, remember when he pokes through the plane, he's like I'm here. So you're saying that was Boba Fett's first outing, I mean maybe he just didn't brush it off, I mean he's traveling in space can't use a jet there, space uh it's the Outrider what's his ship's name, the out rder right I had it I bought it badass name they they sold it. Here's my and I'll be serious for changing this topic this is where I think it hurts you not being a comic book fan cuz the comic book universes are all shattered I've read so many Superman stories that don't",
            "start": 614.96
        },
        {
            "text": "and I'll be serious for changing this topic, this is where I think it hurts you not being a comic book fan because the comic book universes are all shattered, I've read so many Superman stories that don't connect at all and aren't in the official DC canon, especially not now in the New 52 canon. But you enjoy the experience and what you had with it, great stuff, great stories, you still had great stories with old Kal-El running around fighting old robots, whatever robot I'm thinking of, call him Deimos, he was a devious robot, Daimos was a bad dude, I think that I think that the Droid is that everyone would call your ship, the Droid. No, it's the Droid, not Droid Droid, like B, yeah, like a droid, like a robot, the Droid, he's R2-D2, his friend, that's a badass name for a **** right, my think I'm with Colin on this one here's why you want to be part of the power of Star Wars is the vastness of the universe, right, it's all the crazy things and the possibilities that can happen and to",
            "start": 654.52
        },
        {
            "text": "I'm with Colin on this one. Here's why: you want to talk about the power of Star Wars is the vastness of the universe, right? It's all the crazy things and the possibilities that can happen, and to take 90% of those things and just immediately take them off the table - it's kind of a letdown. Door to some of it being real, yeah. They said they might take some of them back, exactly, which I think is good - it's like, let's take the right parts, not the dumb stuff, yeah. But the problem is, the right parts are already there. I mean, the wrong parts are already there, right? And the thing that they should take back is the original three movies, like that well, yeah, but that's not going to happen - or one, two, and three rather than the original three. The original things are amazing; um, the first three, but that's the problem: like those are the things that everyone has a problem with when other people were allowed to come in and rewrite or write stories about Star Wars they were ****",
            "start": 703.48
        },
        {
            "text": "first three but that's the problem like those are the things that everyone has a problem with when other people were allowed to come in and rewrite or write stories about Star Wars they were **** awesome cuz it wasn't Lucas it was people that were like I care about this still they are but but they didn't happen they're not meaning meaningful I mean that's what I'm saying like it's like Comics but it's not because you know obviously every comic book you know every comic book has its origin and stuff like that but like really the events of A New Hope, Empire, and Jedi are like you can't do that over and over again like that is the event right like the Death Star Luke finding Obi-Wan all that kind of stuff Luke's father with like you can't you like you can't retell that over and over again that is it like that's what Star Wars all revolves around the like the stories of those for you know Hoth and Endor and all that kind of stuff and I don't know to me it's just like these are this is one",
            "start": 742.44
        },
        {
            "text": "Is it like, that's what Star Wars all revolves around, the likes of those for you know Hoth and Endor and all that kind of stuff. And I don't know, to me it's just like these are this is one of the few things I really care about in a huge nerdy way. And I was really disappointed when I read that because they can do what they want, they own it, and if they want to do that, that's fine. But I am not going to give them any more money; I gave that up. I used to be obsessed with the Expanded Universe when I was a kid, because that's all we had. And a lot of people forget about that - like before the Special Editions came out in '97 and then obviously '99, we liked the Expanded Universe is what kept Star Wars alive and it's what kept Star Wars relevant to people, and people like me, the ones who bought the books were the ones that were keeping Star Wars alive before the films came out. You know, and suddenly you're just like, \"We don't... we don't care about any of that stuff\" you bought or",
            "start": 779.84
        },
        {
            "text": "the books were the ones that were keeping Star Wars alive before the films came out you know and suddenly you're just like ah you don't we don't care about any of that stuff you bought or read or anything like that and all the toys you bought and this that the other thing it doesn't matter because none of it obviously none of it ever happened none of it's real but it's like saying like I it's me damn it's fanfiction now now it's just **** fanfiction it's not like we it used to be cool because it seemed like it was endorsed it was endorsed you know yeah like Lucasfilm endorsed these books and said like these are canon and this is the way things went down and we even borrowed certain things from the books again like the like Coruscant is a huge setting in one two and three and that's from a Timothy Zahn book you know like he didn't Lucas didn't make that up you know that's one of the only cool things from the prequels ironically real quick question is Steven Zaillian related to Timothy",
            "start": 813.96
        },
        {
            "text": "From a Timothy Zahn book you know like he didn't Lucas didn't make that up you know that's one of the only cool things from the prequels ironically real quick question is Steven Zahn related to Timothy? No, Timothy Zahn yeah who's Timothé? Steven Zan no, that sounds familiar Saving Silver he's one of the actors in that I'll also in that thing you do oh look it up thank you that's a better reference there you go so that's it I just wanted to kind of you know I just had to kind of talk about that so I'm not spending a dollar on on Star Wars ever again and uh I I will not be seeing the movies in the theater if it's on TV wait one day you know in the future and it's on no might be I'll watch it but I'm not I'm gonna go out of my way to not see it and that's just my he's not going to go to the theater he won't go to the theater see it he doesn't go to he he talked forever about Red Dawn remake and we never even made it out to the theater to see that he ain't going",
            "start": 849.04
        },
        {
            "text": "not going to go to the theater he won't go to the theater see it he doesn't go to he he talked forever about Red Dawn remake and we never even made it out to the theater to see that he ain't going to go see any of this that's a slightly different this new it excites me actually like I like the fact that now they they are officially saying everything henceforth is Canon so it's like okay cool now this is a cool jumping in point to like get into all these things and whatever it's no longer expanded I mean I guess it is still the expanded universe like from now on Comics books all these things are going to be telling the same story and that's cool I like that cuz like before it's it wasn't like that it was like there was all these different little things going on it was like I don't know which the **** Dark Horse Comics or the these other **** like should I read these do these even have anything to do with the characters I give a yeah but I didn't I didn't I I didn't have that that",
            "start": 894.36
        },
        {
            "text": "the Dark Horse Comics or these other ones like should I read these do these even have anything to do with the characters I give a yeah but I didn't I didn't I I didn't have that luxury right like I read them all I bought those books and I don't know it's just disappointing me especially because they had the choice of saying like like God go back and redo one two and three like go back to what's wrong like everyone hates those movies everyone hates those movies you're not going to find people that hate A New Hope or Shadows of the Empire people would like those books you know like Shadows was amazing it was a really good book really good book yeah it's excellent I read it in one day I remember I think I read yeah I think it was one of those books it was like seventh or eighth grade when devoured in like two days it was awesome like Goosebumps I hear what you're saying and you're right like it's cool now that like Yeah from this point",
            "start": 931.88
        },
        {
            "text": "books it was like seventh or eighth grade when devoured in like two days it was awesome like Goosebumps I hear what you're saying and you're right like it's cool now that like Yeah from this point forward everything we write and everything we put out is Star Wars cannon but you know for OG fans that they're saying yeah that's what they said like to make or is it really just the movies that they're putting in no they're saying like everything henceforth will be made canon years they'll blank it out of existence and you'll be like I warned you when they came for my Boba Fett and Beskar armor no one stood up I don't know I think it's I think it's stupid and and a lot the good thing I know is that my my instinct when I read that I was like that's BS you know I'm like that really makes me mad and I looked it up and everyone's mad so it's not so it's not like I'm I'm the I'm the only one that's mad you're not the only Star Wars nerd who's mad all the Star Wars nerds are mad not all of them I'm sure",
            "start": 972.36
        },
        {
            "text": "It's up and everyone's mad, so it's not. So it's not like I'm I'm the only one that's mad. You're not the only Star Wars nerd who's mad; all the Star Wars nerds are mad. Not all of them, I'm sure a lot of Star Wars fans are happy about that too, but I think older Star Wars fans who really were into the lore of the series before the special editions came out - so in the early to mid-90s, before they started altering things out of the actual movies. Right? Exactly, \"Gito\" shoots first. See, I don't understand though: like with with the old expanded universe, how could that have been canon when there was so much of it? Like the video games - all like not all made sense on top of each other. Yeah, more I mean like Dark Forces does you know like \"Cotour\" would make sense, like like the good ones, the good games: X-Wing versus TIE Fighter. I get it; I mean like like the game Dark Forces has like a real story, you know? Like those kinds of games - they did make sense. Obviously, there were like weird ass games.",
            "start": 1008.0
        },
        {
            "text": "games X-Wing versus high fighter I get I mean like like the game Dark Forces has like real story you know like those kinds of games they they did make sense obviously there was like weird ass games like Yoda stories remember that that weird it was like a procedurally generated garbage game obviously had no yeah it's just I don't know it's just it's just disappointing because I was really into those books and into those stories I felt like I knew the characters like even though like you see IG-88 for 5 seconds in the movie but there's like a lot of story about IG-88 but now like and that makes it interesting in his relationship to Boba Fett and all that kind of stuff or Zuckuss' relation to Jabba the Hutt you know and all that kind I like that kind of stuff I thought it was interesting I like reading books so you know it's disappointing they're saying like nah like you just wasted all your time I could have been reading other cooler **** that you know but you enjoyed your time and for years he had",
            "start": 1045.96
        },
        {
            "text": "so you know it's disappointed they're saying like nah like you just wasted all your time I could have been reading other cooler **** that you know but you enjoyed your time and for years he had something to talk about now I don't now it all doesn't matter well you all you turned on him you hated A before this so that's true yeah so it's like they saw what you were doing and like I did but like this is this was the turning point for me where I was like that the prequels are terrible man like they were so bad and you know they hurt me like on a personal level and I think they hurt a lot of Star Wars fans on a personal level where they're like man this is bad bad you know like this is bad bad bad **** um but like they could have rectified that situation somehow instead they're saying like \"metal chorian\" that's the real **** man how awesome is it going to be just stick with me how awesome is it going to be to have Luke Skywalker mention Meta Llama 3 and have Hayden Christensen like",
            "start": 1080.0
        },
        {
            "text": "like Metal Gear Solid that's the real **** man how awesome is it going to be just stick with me how awesome is it going to be to have Luke Skywalker mention MetaCritic now and have Hayden Christensen like that's real **** now my God that's that's actually how the trailer is going to open m it's been a long time Sky Walker what's up hold on I got to check my MetaCritic bot Rider take this I I I I really I'm interested to see like if the new movie if people think the new movies are good I think it'll have the same arc as episode one where everyone thought everyone if you remember correctly 1999 everyone thought episode one was good for a few days I don't know if you guys remember that like it came out maybe a few weeks especially because we didn't have this internet like this hyper internet culture where I like I remember going to see him like I like that and then I saw it again and I'm like I don't know if I like that I don't know about this and then I went and saw it again and I was like",
            "start": 1116.0
        },
        {
            "text": "where I like, I remember going to see him, like I like that and then I saw it again and I'm like, I don't know if I like that, I don't know about this and then I went and saw it again and I was like oh, oh no he's talking into a Gillette lady's razor and then and then and then as the years went on I was like oh man this is really bad and then episode two came out, no one had any expectations, episode three was like no one had any expectations there were some people that were like this is going to be great yeah I enjoyed three was good well I I like as a guy who never read any of these goddamn stupid fanfictions I thought it was fine I only knew the movies and I had I thought finally shit's happening in three stupid **** I have the high high ground I lop off every limb except one but whatever robots so that's where I say I'm I'm done if you guys don't have any anything else to put into this particular I have to chime in that Steve Jobs was born in San Francisco, California, the son of two University of Wisconsin graduate students",
            "start": 1155.56
        },
        {
            "text": "so that's where I say I'm I'm done if you guys don't have any anything else to put into this particular I have to chime in that Steven Zahn was born in Marshall, Minnesota the son of Zelda who worked for the YMCA and Carlton Edward Zahn a retired Missouri Lutheran Pastor related to whatever his face was Timothy is Timothy Zahn still alive probably probably just super pissed off right now you think he is he probably is he probably is he so much money oh no Disney Abrams all right good topic",
            "start": 1192.48
        }
    ]
}