{
  "id": 131,
  "video_id": "thI5hu8QPlA",
  "show_name": "Gregway",
  "hosts": ["Greg Miller"],
  "title": "Gregway Episode 12 Live (9.20.13)",
  "description": "What do you want to talk to Greg about? Do it live Friday, September 20th at 6 a.m. PT (9 a.m. ET).\n\nSUBSCRIBE/LIKE/SHARE\n\nLeave your questions for Greg as a video response and check back every Wednesday and Friday to see what he's saying.\n\nThe Vlog playlist: http://www.youtube.com/playlist?list=PLOlEpGVXWUVv1g9oZi6O95CwRHQd0ulT6\n\nSubscribe to Greg: http://www.youtube.com/GameOverGreggy\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy",
  "published_at": 1379686373,
  "duration": 1907,
  "transcript_chunks": [
    {
      "text": "What's up everybody? Hey, welcome to another Gregway. Okay. [Music] H God, why am I so bad at this YouTube stuff? I just realized I haven't talked in a while. There was no there was no audio on that, was there? I tell you what, I'm getting better as I was saying with everyone. That's why it's Kinda Funny because when when it wasn't when there's no sound and you couldn't hear me. It was just me going I was saying that I'm getting better with YouTube stuff like you know the the camera is better because it's it's still yellow but it's it's filling up the whole screen. But you see there on this Wirecast I made a second it's a long story. Let's I can fix it later. I'm just going to go now missing my little GameOverGreggy bug but whatever. Um every Wednesday and Friday I answer a question here on Great Way. This is wonderful. Sometimes I ask a question like, \"Hey, you're pretty stupid. Like, why don't you put audio on your things?\" And you have to go, \"Well, you know what, man ? I don't",
      "start": 50.0
    },
    {
      "text": "on Great Way. This is wonderful. Sometimes I ask a question like, \"Hey, you're pretty stupid. Like, why don't you put audio on your things?\" And you have to go, \"Well, you know what, man? I don't know. I don't know how to use this internet stuff.\" So, usually how this works is you send me a question. You either leave it in the YouTube comments or send it to me on Twitter or I like to send video responses, but they phased out video responses. So, now you have to make your own video, then tweet it at me at GameOverGreggy, which I would put up right here, but that would the the stream so far that we're doing. So, let's uh let's see what we got going on for questions here. the comments here on the YouTube thing. They're going, \"How do you make them go up automatically, though?\" That's what I want to know. Do this. Give me a little refresh. That had to get real questions going. It does. There we go. Yeah, I know the sound is back on everybody. I screwed that up. My bad everybody . I don't",
      "start": 145.44
    },
    {
      "text": "want to know. Do this. Give me a little refresh. That had to get real questions going. It does. There we go. Yeah, I know the sound is back on everybody. I screwed that up. My bad everybody. I don't know how to use YouTube. That's the best part of this thing, right? Is like I'm stupid. You get to you get to be with me on YouTube as we do stuff. Uh Uh Jorge says a he tries his hardest and it doesn't work out. A I know I'm no good. It's not never it sounds bad is what sound never went away. Really just me screwing it up. I text pretty quick. I'm pretty at least I noticed, right? It sucks too because I done like seriously I was getting this ready last night and just did not click the audio sync on this thing over here. That's pretty annoying. Would have been nice to have that. All right. Oh, here we go. Dan tweets at Game Over. He says, \"How can I get that GameOverGreggy shirt? You've been wearing so much.\" We will be selling the GameOverGreggy shirts. We getting We are getting a",
      "start": 180.8
    },
    {
      "text": "Oh, here we go. Dan tweets at Game Over. He says, \"How can I get that GameOverGreggy shirt? You've been wearing so much.\" We will be selling the GameOverGreggy shirts. We getting We are getting a marketplace off the ground. GameOverGreggy. So, go ahead and get ready to buy shirts with my stuff on it and conversation with Colin stuff on it and all sorts of junk like that. Make sure you're putting questions for me in our comments. Whatever you want me to talk to you about in the comments here on the YouTube thing . Liam says, \"How you doing, mate?\" I'm doing better now, Liam. I'm kind of embarrassed that the sound was off when I started this thing. I thought I had this one by the balls. Thought I knew what I was doing. I come out and I screwed up pretty much immediately. But like at least I know the opening has audio. Then when we came back from the little I'll get over it. It'll be fine. Uh Hudsy Dee, he says, \"Well, what phone do you rock? I rock an iPhone 5.\" And I'm not I'll",
      "start": 230.48
    },
    {
      "text": "least I know the opening has audio. Then when we came back from the little I'll get over it. It'll be fine. Uh Hudsy Dee, he says, \"Well, what phone do you rock? I rock an iPhone 5.\" And I'm not I'll tell you what. I'm not going to buy one of these new iPhones. People, you get the iPhone C and the iPhone S and whatever and that. No, no, thank you. I don't need the color. I don't need the color one, not the cheap one. And then I don't like the gold one. And on top of that, like really like here's something you you may not know. You know how this camera looks crappy, right? It's running off my laptop. It's got the yellow haze to it, which is really weird. Sorry about that . Again, eventually I'll buy a real webcam. When I'm making Great Ways, I'm filming off my iPhone 5. It's just my iPhone 5 on a tripod doing at me. It's the best webcam I have in the house right now. And the thing about that would make me upgrade to an iPhone S, right, is if it was better. for some reason the iPhone S",
      "start": 269.76
    },
    {
      "text": "5 on a tripod doing at me. It's the best webcam I have in the house right now. And the thing about that would make me upgrade to an iPhone S, right, is if it was better . for some reason the iPhone S was rem had a better camera that was like way way more advanced with megapixels and yada yada yada but it doesn't so or it doesn't even it might be better but it's like amazing you know you know let's see we got here Jester Lamps any respon any relation to the Simpsons I don't know what that means Adam Smith Greg how much sleep do you get on average Adam Smith not enough I am extremely tired this then you see the problem is that I moved to this Oh, let's wake the videos already. I mean, the the videos here on youtube.com/ gamer. They're already posting at 6:00 a.m. Here's something else I'm going to do. I'm always about this, too, when I do these things. I'm going to drop the brightness. Oh, that's I hate computers so much. Going to drop the brightness here on my computer so you don't have",
      "start": 308.32
    },
    {
      "text": "to do. I'm always about this, too, when I do these things. I'm going to drop the brightness. Oh, that's I hate computers so much. Going to drop the brightness here on my computer so you don't have as much lens glare. See, every time I do this, I learn something rocket back and forth. This is fun. Hey, you're here. You wanted a live Gregway. A lot of people would ask me for a laugh right away. Here it is. Never said it was going to be pretty. Here we go. Nearly though. And I said, \"How much sleep do I get?\" Not enough. Very tired. You know, I moved to doing these uh waking up at 6:00, answering everybody's comments, but I still try to play games and stuff and see friends and my girlfriend before I go to bed, which means I'm just not getting to bed early enough to make this all work out. But my body's adjusting to it. I'm adjusting to having enough sleep. I just don't feel like an old man when I the weekends roll around. I like that. You go to bed. I can't sleep in. I still wake up",
      "start": 356.08
    },
    {
      "text": "But my body's adjusting to it. I'm adjusting to having enough sleep. I just don't feel like an old man when I the weekends roll around. I like that. You go to bed. I can't sleep in. I still wake up early on the weekend. I just go to bed. I just sleep. Go to bed. More GTA. Sleep soon. Um, Fisto pain five. Have you ever grown out a beard? Yeah, this is an old I story. Uh , I didn't have a good beard, but uh Ryan Gennis had this photo on his desk, right, of him with a beard and he was sitting there with his wife and he looked terrible. He looked god off like he just got out of a P camp. And I asked him how long that took to grow and he said, you know, two weeks or whatever. And I said, I want and then there was a Gamecube challenge for me to do it and see if I would look better. And I did. It looked terrible. In fact, if you Google uh or I'm sorry, YouTube, Greg Miller H itting on Hose, which was the original title for Knocking Boots, but I knew it was a bad idea from the start and we",
      "start": 397.92
    },
    {
      "text": "It looked terrible. In fact, if you Google uh or I'm sorry, YouTube, Greg Miller Hitting on Hose, which was the original title for Knocking Boots, but I knew it was a bad idea from the start and we changed it Boots. So, we were all inclusive and not weird. Uh, somebody took an image of me with that beard and put it up and like kind of the beard looks terrible. I can't grow a beard. Well, but I think I could do it better now because it was one of those where I let it grow for two weeks and I shaved and it started coming in more full. And so now it's one of those things where when I don't shave for like two days, I have a lot of stubble. I was like, well, what if I have a beard, but then I'm like I don't want to I don't want to commit to learning. I don't want to commit to that finding out if I would actually have a good beard or not because that seems kind of ridiculous. Going up at noon, have this half nice beard, something else people can make fun of me for. No thank you, sir. I'm",
      "start": 440.24
    },
    {
      "text": "if I would actually have a good beard or not because that seems kind of ridiculous. Going up at noon, have this half nice beard, something else people can make fun of me for. No thank you, sir. I'm not going to be set up to feel that way. Let's see what's going on [Music] here. This the question doesn't make 100% sense. Oh, here. No. Daniel says, \"Why do you think Uncharted 4 PS4 was listed on the GameStop website?\" Well, I think it's a form of conclusion that there's prop. We already know Naughty Dog's working on a PlayStation 4 title. Smart money is an Uncharted 4. I'm sure somebody put it's kind of like IGN, right? If you ever look at IGN, IGN has all these objects for these games, right? So, when you click on a story about Middle Gear 5, you can click on the videos to see all Middleear Saw five videos. Well, there's a game like, let's say, Madden . There's going to be Madden next year, so there's probably already an object for Madden next year. So, if you were to Google it, you think, \"Oh",
      "start": 474.96
    },
    {
      "text": "videos. Well, there's a game like, let's say, Madden. There's going to be Madden next year, so there's probably already an object for Madden next year. So, if you were to Google it, you think, \"Oh man, maybe IGN has information about Madden.\" No, we don't have any information about it, but we write a story about Madden for next year or a future a Madden story that encompasses all of Madden. We want to attach it to as many things as possible. Like I'm sure I don't know what we call it. It's not Uncharted 4, but there is like, you know, Naughty Dog's next-gen project object out there. So like when we're doing the videos about like we saw this in the background, what is what does this pirate mean? You know, or like we make a video hypothesizing about Uncharted 4, we attach it to something so it doesn't just go off and die in darkness. Daniel Muso says, \"Will we ever come to Australia?\" Daniel, I'd love to come to Australia. No current plans. Um I'd probably go for work, right? Like then we",
      "start": 518.92
    },
    {
      "text": "doesn't just go off and die in darkness. Daniel Muso says, \"Will we ever come to Australia?\" Daniel, I'd love to come to Australia. No current plans. Um I'd probably go for work, right? Like then we have IGN Australia down there already. You already got the IGN Australia people down there. So when will I go? I have no idea. I I I don't take vacations. So I don't think I'll be going anywhere for fun anytime soon. So I'm not until work sends me there until you got to make PAX Australia big, I guess, and then I can just jump to that. Maybe the best way, I guess. Oh, Jester says Simpsons because you're yellow. LOL. No, good call. I do need to get a better webcam. But in a pinch, I just need to talk to you. Here I am. You got to deal with it. Suck it up. This is why we're a fun little channel, right? You want the polish stuff, you go to IGN. You want to hang out and talk about wings. Chili. Nick can edit says, \"What does your girlfriend think about you not wanting kids?\" She doesn't",
      "start": 557.12
    },
    {
      "text": "right? You want the polish stuff, you go to IGN. You want to hang out and talk about wings. Chili. Nick can edit says, \"What does your girlfriend think about you not wanting kids?\" She doesn't want kids either. This is why we get along. Oh, come on, Chuck Rose. What game are you playing now? Come on, bro. Slash lady, I don't know what Chuck Sh name is. I'm playing GTA V and I am in love with it. And that's the, you know, like it took a while for me to get like super not like into GTA V. Like I'm I'm a GTA fanboy, right? Like GTA 3 like I like the old GTA. GTA 3 was like one of those turning points. I've been on board ever since. I like GTA 4 when Hillary reviewed it. Uh, Roert is a second opinion on a front chain, but like I was I was one of the people who played it with both him and Robert. I was here to say, yeah, I thought it would be tight. I still think it's, you know, I still think it's a 10. I still think it's one of those games that makes sense for what it is, right? A",
      "start": 606.16
    },
    {
      "text": "Robert. I was here to say, yeah, I thought it would be tight. I still think it's, you know, I still think it's a 10. I still think it's one of those games that makes sense for what it is, right? A masterpiece. But that's beside the point right now. GTA V is fantastic. Having a great time. It's I keep describing it like me and Alfredo did that commentary the other day where we ran around trying to get five stars and then of course we did the live stream and I keep describing it the way of I keep when I play the game with other people it's like it's like Hook. It's like when you know Robin Williams is Peter Pan but he doesn't remember that he's Peter Pam. Like I play GTA home and I play it very much like a real game. Like okay what are the mission ? Where am I going? What am I doing? Okay, I'm doing this. I'm motivated. Blah blah blah. And then you get I get these people who bring me out and they're like, \"No, no, no. Let's just run around. Let's just steal a place. Let's just walk",
      "start": 653.44
    },
    {
      "text": "I'm doing this. I'm motivated. Blah blah blah. And then you get I get these people who bring me out and they're like, \"No, no, no. Let's just run around. Let's just steal a place. Let's just walk across the island.\" It's like, \"Holy crap.\" Like, \"I forgot how much fun it is to move around.\" Oh, I forgot how much fun it is to stretch, too. Stretch at 6 a.m. This is fun though, huh? The first ever live stream. Like I said, some problems. Doesn't look that good. Didn't have sound for a brief second. We're getting there, though. I didn't like my hair. I was throwing water on my hair in the bathroom before I went live. Looks pretty good now. So, let's see what Oh, 222 Cameron says, \"What made you choose Mizzou?\" Of course, ladies and gentlemen, I went to the University of Missouri, the greatest journalism school in the land, and that's what did journalism. Uh, you know, I had known early on that I wanted to write about video games and that I was going to go I thought to EGM or to, you",
      "start": 695.76
    },
    {
      "text": "journalism school in the land, and that's what did journalism. Uh, you know, I had known early on that I wanted to write about video games and that I was going to go I thought to EGM or to, you know, I thought I'd go back to EGM when I went to Mizzou because EGM of course was in the suburbs of Chicago. That's where I was. I thought I'd go to Mizzou, get my journalism degree , turn around, go back to EGM right there at Dan Shoe forever. Um, so Mizzou was just the best journalism school and I saw it being the path to if I go I always thought of it like I'd be bringing a nuclear bomb to a gunfight, right? Like this is early , remember? It wasn't like how it is now where this is like, oh, everybody wants to be writing about video games. No big deal. Like I thought I'd go there and I'd get this journalism degree and then I would go to apply to wherever and they'd be like, holy crap, you got a journalism degree. No problem. We only got Craig Harris. He doesn't know anything like it. And uh",
      "start": 739.84
    },
    {
      "text": "journalism degree and then I would go to apply to wherever and they'd be like, holy crap, you got a journalism degree. No problem. We only got Craig Harris. He doesn't know anything like it. And uh you know, obviously it worked out for me, but now it's one of those things where everyone's doing that. So it's not like as unheard of as it was I think when I started trying to do it. So, still the way I would do it if I was on the outside now, but a lot more to worry about. Uh, young Leno J says, \"Hey, Greg, do you know what happened to Cara or was that honestly just a tech demo by Quantic Dream?\" It was honestly just a tech demo for Qu antic Dream. They never they were very clear when they showed that that that wasn't a game that that was just them experimenting with the new hardware at GDC or they showed it at GDC. them experimenting with what they could do. Try to show what they can do with a nextgen storytelling kind of thing. So, that's exciting. Whatever. I don't know why you'd waste",
      "start": 781.04
    },
    {
      "text": "they showed it at GDC. them experimenting with what they could do. Try to show what they can do with a nextgen storytelling kind of thing. So, that's exciting. Whatever. I don't know why you'd waste your time on it. It was cool. I mean, I liked Cara a lot, right? But that's honestly, you're watching like, hm, maybe they should just do this. Why don't they just make, you know, little mini movies, little mini shorts? Instead, now we're waiting for Beyond Two Souls. We'll see how that one comes out. Let's see what else we got. Remember ladies and gentlemen, every Gregway, Wednesday and Friday, I answer your questions. Usually just a question per video, but today I'm feeling frisky doing this live stream, taking some of your comments down, taking them down one by one. Uh, leave them here on the YouTube video or make your own YouTube video responses and just email me the link since they have destroyed video responses as soon as I started the show pretty much. Sean Pit says, \"Are you",
      "start": 825.76
    },
    {
      "text": "on the YouTube video or make your own YouTube video responses and just email me the link since they have destroyed video responses as soon as I started the show pretty much. Sean Pit says, \"Are you enjoying GTA 5 more than The Last of Us?\" That's that's a loaded question, Sean Pit . Right. Um, I don't know. I think they're really different experiences, right? Like Last of Us was what for me 14 hours? What did I say when it first happened? 13 14 hours of just like this super intense story. And like that's the other thing. Are you enjoying it? Like last time was it was good, right? Like no one's like that was like such a fun experience though. It was like something different and changed it and now you felt like it's fingerprint on your soul kind of thing. more. It's like GTA is like done with that mission. Let's see if I can flip this car off a wall or whatever. You know what I mean? Let's drive around. What happens if I drive around with no wheels? I think they're different",
      "start": 864.72
    },
    {
      "text": "done with that mission. Let's see if I can flip this car off a wall or whatever. You know what I mean? Let's drive around. What happens if I drive around with no wheels? I think they're different experiences. Am I like is the enjoyment more though? Probably, but I don't think that like that doesn't I still think Last of Us is a better game. Last of Us is still what I would vote for for game of the year right now. I think those you know, you have to talk about experiences overall, right? like Last of Us took us places and had performance capture and you know visuals and all the stuff that like were so incredible, right? Not the GTA doesn't have that or GTA isn't up to that caliber, but like it's a different experience for sure. So, I don't know. It's a good question. I guess I mean I enjoyed them both profoundly, but in different ways. I enjoyed them in different ways. Right now, I'm having more fun, I think, with GTA, right? It's bright. It's colorful. It's funny. I laugh. I put cars.",
      "start": 912.96
    },
    {
      "text": "them both profoundly, but in different ways. I enjoyed them in different ways. Right now, I'm having more fun, I think, with GTA, right? It's bright. It's colorful. It's funny. I laugh. I put cars. I shoot people for no reason. Whereas Last of Us I was like super into it'be like saying, you know, was Avengers more fun than the road? Yeah, Avengers are more fun than the road. But I think, you know, whatever. Radioactive Cornflake says, \"Greg, what do you think the story will be in Superman versus Batman?\" Good question. Good question. Radioactive Cornflake. Um, I think they will tie into everything that happened in Man of Steel. So, spoilers if you haven't seen Man of Steel. uh that you know Batman does show up and he's like what the why is the city destroyed? Why would you let this happen? You don't know how to be a hero . You're you're a weapon. You're more you know you he he's going to show up I think trying to judge if Clark is a danger or a threat, right? Like he doesn't know much",
      "start": 956.76
    },
    {
      "text": "You don't know how to be a hero. You're you're a weapon. You're more you know you he he's going to show up I think trying to judge if Clark is a danger or a threat, right? Like he doesn't know much about him. So you need to get like an up close personal view of who is this guy? He you know he just took him and his you know his cousin or whatever just took out the entirety of a a major metropolitan city. Do I have to be afraid of him? How would I take him down? Is he a good guy? And then, you know, throughout this, he'll there'll be adversaries in the beginning, then Batman will grow to love him. It turns out Superman's awesome. They'll take down Lex Luthor, who I hope is teamed up with Brainiac or something like that. But we'll see. See that kind of cough. That's what I usually cut out of Gregs when I'm doing those cuts that people don't even know if they like or not. Remember, leave a comment if you want to be here right now. Oh, Monty Matt 12 says, \"Good morning.\" Good morning,",
      "start": 1000.88
    },
    {
      "text": "of Gregs when I'm doing those cuts that people don't even know if they like or not. Remember, leave a comment if you want to be here right now. Oh, Monty Matt 12 says, \"Good morning.\" Good morning, Monty Matt. Pleasure to have you here. Thanks so much for watching this experiment with the live way. So far, it's going so good, right? I think we're doing pretty well. Every's having fun here, chatting it up, reading your comments, answering them. Right now, we're going to go for 30 minutes, I think. So, we got another 15. Now , why 30? Why not an hour or whatever? Well, first off, I'm tired. I can already tell you it's it's hard to keep up with, you know, live stream like only. And number two, like YouTube videos that are usually like most of I think most of the Greg Ways people don't watch are over 10 minutes. So, we're already going way too far. Uh, would you help me get work? Oh, this is I'm sorry. Veum, would you help me get work experience for a college module starting in 20 14? I",
      "start": 1044.32
    },
    {
      "text": "are over 10 minutes. So, we're already going way too far. Uh, would you help me get work? Oh, this is I'm sorry. Veum, would you help me get work experience for a college module starting in 2014? I don't sure like doesn't do internships, so I can't help you there, but I can help you some other way. Sure, whatever. Uh, 123 Tims IM says, \"How many hours do you work in a week?\" Good question. You know, um, uh, it's hard to say. I usually get into IGN at like try to be there at 8:30. Um, at at the latest. I like to be there around like 8:15, but 8:30 is more realistic. And then I'm out every day at 5:3 0. like last time six 15 somewhere in there. I don't know. There's no hours. It's salary. So, whatever. I just complicated with you. But like we always talk about this, right? Like the thing that especially when we're interviewing people, the thing they need to know is that the video game industry in IGN isn't like it isn't like when I was in the newspaper, right? I'd be in at whatever 9",
      "start": 1090.16
    },
    {
      "text": "that especially when we're interviewing people, the thing they need to know is that the video game industry in IGN isn't like it isn't like when I was in the newspaper, right? I'd be in at whatever 9 five I don't or 9 or 8, I don't even remember what it was, but then I was out at 5. And when I was out, I was out, you know? I came home and my day was my own. come home, barbecue, go out with friends, watch movies, play video games. I had all like from, you know, five till I got home at 5:30 until I went to bed at midnight or whatever. That was my time. I could do whatever I want with. Whereas with IGN, it's very much like I was, you know, like Ghostbusters or firemen where you're on call or doctors, you're on call all the time. If you check your phone and there's a news story or somebody like people email about work all night long, like we're a 24-hour news organization, right? And so that means some something is always breaking and something is always happening. And so with the",
      "start": 1149.04
    },
    {
      "text": "like people email about work all night long, like we're a 24-hour news organization , right? And so that means some something is always breaking and something is always happening. And so with the inclusion of like IGN Australia and IG UK like they cover news and stuff to a degree that you know we didn't back in the day like when I was like you know working with Dunham and stuff you'd be going non-stop and only maybe you but now you have people out there who are helping you people who are you know making it so it's not just on us or whatever like with PlayStation stuff but you see with Colin all the time right like Colin will wake up to go to the bathroom at 3 :00 a.m. And then he'll check Twitter while he's doing that and he'll see that this leader game got announced in Japan. He'll wake up and write that like that. He doesn't have to. No one's asking him to do that. But he sees that and he feels like that's his responsibility. This is a job you can't turn off. You can't you can't like",
      "start": 1185.92
    },
    {
      "text": "and write that like that. He doesn't have to. No one's asking him to do that. But he sees that and he feels like that's his responsibility. This is a job you can't turn off. You can't you can't like go okay I'm going to ignore this. Especially when no with all due respect there's there's folks like you want to talk to us about it, right? Like that's what I always say about you know the whole where jack of all trades master of none is the fact that you know even if I I haven't played the you know uh I'm blanking I want to say sword but that's not right. Legend of Zelda the cell shaded one that just came out that I really loved on Gamecube. God was such a fan of Wind Waker. God that's embarrassing. I haven't played Wind Waker HD but you will tweet me about that or want to talk to me about that. So I have to watch you know like Jose's playing it or whatever. I'll go to his desk and I'll watch it and I read the review and I'm like, \"Okay.\" And like I I have carry a conversation about",
      "start": 1226.8
    },
    {
      "text": "that. So I have to watch you know like Jose's playing it or whatever. I'll go to his desk and I'll watch it and I read the review and I'm like, \"Okay.\" And like I I have carry a conversation about that. We have to know a little bit about everything because even when I get like interviewed on a podcast, right? Like I I did I did a couple podcast this week and I want to talk about PlayStation 4, but then we take a right turn and talk about something Xbox One. Like I can't just only know one thing. Like, you know, we want to know everything. We want to be able to talk about everything intelligently. So, it's hard to ever turn it off. So, how many hours do I work? I work all the time. Even when I'm doing these Gregways, right, and I'm talking about how to make chicken wings. I usually mention IGN there somewhere. You know, it is what it is. It's given me everything I've ever wanted, so I might as well give everything I can do to it. Okay. Raphael says, \"Why do you call Destin the pride of",
      "start": 1266.48
    },
    {
      "text": "IGN there somewhere. You know, it is what it is. It's given me everything I've ever wanted, so I might as well give everything I can do to it. Okay. Raphael says, \"Why do you call Destin the pride of the sunset?\" Well, I call Colin the pride of Long Island. And I gave everyone a little nickname. And so I don't know where Dustin's originally from. Camden, Minnesota , Wisconsin, something like that. But I know he lives now in the sunset district of San Francisco. San Francisco has many different districts. There's the marina, there's the sunset, there's so much lives in sunset. And I was I talked to him for the first time on camera. I said, \"You know what? You're proud of sunset.\" And he said, \"Please don't call me that.\" And I said, \"Too late.\" The flat man says, \"Have you ever eaten chicken wings for breakfast?\" Flat man, of course I've eat chicken wings for breakfast. What kind of question is that? You're offending me almost as much as the other guy did. Dean Ashley says, \"Do you",
      "start": 1298.8
    },
    {
      "text": "wings for breakfast?\" Flat man, of course I've eat chicken wings for breakfast. What kind of question is that? You're offending me almost as much as the other guy did. Dean Ashley says, \"Do you agree with Damon who has said judging reviewing games is all about how fun it is?\" No. No. I don't think that's all there is to it. And I think you might be taking Damon's quote a bit out of context. That like that's the baseline of any review, right? Is this game fun? And and oh, I see what we're coming back to. Like am I having more fun with Last of Us or GTA? Is it enjoyable to play would be a better way to put it. Are you having fun playing this ? Are you enjoying your time with the game is what I think is more of what Damon's angle is on that. And again, that's the baseline. That's what he's reading a review to find out if it's enjoyable to play this game. Um, I don't there's more to it, but I think that's what he's saying is the most important thing. So, I don't agree I don't I don't think",
      "start": 1343.6
    },
    {
      "text": "a review to find out if it's enjoyable to play this game. Um, I don't there's more to it, but I think that's what he's saying is the most important thing. So, I don't agree I don't I don't think there's anything to agree with. I think that's a good point when Damon says that. I nod my head in agreement when he says that, but there's more to a review than that, right? You have to talk about mechanics, how it looks, sound, etc. So on. I'm going to have to run Wi-Fi, too. Gosh darn it. That's not for good. So far so good. See the video over there. Looks all right. I'm not going to screw that up yet. Dry Bones says he's working on the Super Boy jacket for you after Monday's upon. Okay, I like that. Big fan of that, actually. Reading through these comments trying to find one. Got five minutes left. Better better find a good one. The assassin 642 says, \"What is the best dream you ever had?\" I like this question. Best dream I ever had. Huh? One time I went, you know, you probably knows about",
      "start": 1392.96
    },
    {
      "text": "Better better find a good one. The Assassin 642 says, \"What is the best dream you ever had?\" I like this question. Best dream I ever had. Huh ? One time I went, you know, you probably know about me. I went to private school growing up. So I went to, you know, parochial school where I was in like Catholic school where I was in uniforms, ties and stuff like that. And one time I dreamed when we were when I was in like grade school, junior high time. I dreamt that uh we were in church being talked to by one of the priests and I realized it was a dream. Like I like in the dream I was like this is a dream. So I stood up and I punched the priest and then I flew away. Like I was like that one moment of like I know this is a dream and I know I'm going to control it. I'm going to do what I want . I did it and that was a damn good one. Um Money Matt 12 again says, \"Is that Twilight in the background?\" Yes. Not my books, believe it or not. My book collection incredibly small, but yes. That's what",
      "start": 1449.92
    },
    {
      "text": "did it and that was a damn good one. Um Money Matt 12 again says, \"Is that Twilight in the background?\" Yes. Not my books, believe it or not. My book collection incredibly small, but yes. That's what it is back there. Not lying. Even though I've seen the movies, that last one was good. It had a good fight scene. Nobody ever talked about it. It was It turned out, you know, it got blinked out of existence kind of thing. But it was a good fight scene. You didn't know at the time. People's heads getting ripped off kicking the wolves to death. It was fun. Uh this Sloan 12 says, \"What nickname do people have for you at work?\" I don't have one. The Sloan 12. Um, I give people nicknames as I'm sure you've seen in all the videos. Pride of the sunset, my Italian meatball, pride of Long Island, stuff like that. Like I don't since I since I'm the one introducing it, usually I don't ever give a nickname. I can only imagine what they would say. Oh. Uh, Vongola PT said, \"What did you felt? What did",
      "start": 1496.56
    },
    {
      "text": "like that. Like I don't since I since I'm the one introducing it, usually I don't ever give a nickname. I can only imagine what they would say. Oh. Uh, Vongola PT said, \"What did you felt? What did you feel when you found out you had cancer?\" Um, I wasn't happy about it, but uh, like when I wrote in the blog, right, announcing that I had cancer last year, I wrote a blog saying, you know, like basically I have cancer and you're taking this harder than I am. No offense. And that was because like for me, you figure I imagine like it's like jumping into a pool or slowly waiting into a pool, right? Like I had slowly gone in and like gone step by step like we knew things were wrong and something was going to happen here. So I was ready for the news when I got it. Whereas for you guys , it was like everything was fine and then a blog post later it was like what the hell's going on? I don't understand what's happening for me. Yeah. Like I don't know like I was never I I was talking about this",
      "start": 1552.32
    },
    {
      "text": "everything was fine and then a blog post later it was like what the hell's going on? I don't understand what's happening for me. Yeah. Like I don't know like I was never I I was talking about this I did Aisha Tyler's podcast while I was in LA, Girl on Guy. It'll be up soon and we talked about it there a little bit and it was like I never thought I was going to die. You know what I mean? like you when I found out I'd have to go with Hodgkins lymphoma that it was this that you like you know they start leading you down what they think diagnosis is going to be and you go to Wikipedia and it's like well 86% of people or 89% or whatever to survive this like oh I'll be fine the people who are dying are like you know old people or whatever they don't even know what's going on I'll be all right I I get this and so pretty much from the getgo I was like I got this I'm not too worried about like this getting me in the end so that was nice um you know how did I feel when I was diagnosed I wasn't",
      "start": 1599.76
    },
    {
      "text": "I get this and so pretty much from the getgo I was like I got this I'm not too worried about like this getting me in the end so that was nice um you know how did I feel when I was diagnosed I wasn't thrilled about it, but in the same breath, I didn't know how hard it was going to be. I didn't know how bad chemo would be. Like, I didn't really know what I was getting into. So, you know, I was naive and didn't I thought I it would be no problem. And in the end, it wasn't. So, there you go. Here I am. Oh my gosh. Two minutes left. Oh, Kyle says he truly admires my work. Thank you, Kyle. Everybody always says that, you know, oh, Greg, you don't have to wake up for these comments. Oh, Greg, you don't have to make these videos. I know all that , but you know, I want to give something to you guys. I like talking to you. The whole point of Gregway is that I get, well, first off, you know, I get you guys ask a lot of questions on Twitter and you ask a lot of questions YouTube video and even",
      "start": 1637.04
    },
    {
      "text": "I like talking to you. The whole point of Gregway is that I get, well, first off, you know, I get you guys ask a lot of questions on Twitter and you ask a lot of questions YouTube video and even when I respond to some of those questions, you don't see, you know, somebody else asks a question later on. Like, I want to talk to you. I talk about all the time how humbled I am that you guys want to hear me talk about anything, whether it be video games or going. So, I want to make sure that you understand how this relationship works and that I'm here for you and that I want to make sure that you know how much it means to me that you come to watch these videos, that you share them with your friends, that you like them. I apologize. I beg you to do in every video. But, you know, the least I can do is talk to you, respond to your comments at 6 a.m. like I do every if if you're if you're new, every time I post a video, I post it at 6 a.m. Pacific Standard Time, and then I sit there in the",
      "start": 1681.6
    },
    {
      "text": "can do is talk to you , respond to your comments at 6 a.m. like I do every if if you're if you're new, every time I post a video, I post it at 6 a.m. Pacific Standard Time, and then I sit there in the comments for an hour answering the comments. So that's important to me to make sure you guys understand how much you mean to me, how much your support means to me because obviously like people always do that too. Like I've been getting a lot of emails in the recent the recent past recent timeline. I'm very tired. This is why I don't usually stream at 6 a.m. but I'm awake saying you know thanking me for like oh man you really got me through this. You got me through that. Like you guys got me through cancer. You guys got me through everything. You guys get you guys literally get me a paycheck. You know what I mean? Like if you stopped coming to IGN I would not have a job anymore. If you stopped watching my videos at IGN I would not have a job anymore. So, least I can do is make videos like",
      "start": 1714.8
    },
    {
      "text": "You know what I mean? Like if you stopped coming to IGN I would not have a job anymore. If you stopped watching my videos at IGN I would not have a job anymore. So, least I can do is make videos like this where I talk to you and I'm enjoying this. We I'll promote it a little bit more next time. I wasn't sure what we were getting into. Um, on that sappy note, our our our 30 minutes are up. I want to thank you so much for coming, ladies and gentlemen. It's been a pleasure. Um, still didn't have a good Gregway outro. Still working on that. I think the Epic Meal Time, guys. Had a few ones like have a have a great day. That was a mirror. That's pretty good. You already know the title of the show, right? You already know I want you to subscribe. You already know because I watch YouTube follow me on Twitter. So, I guess I don't have to really pimple that stuff as much. But have a great day. There's a bunch of good ones here. Let me open up. Actually, hold on. Just give me one second. One",
      "start": 1750.32
    },
    {
      "text": "me on Twitter. So, I guess I don't have to really pimple that stuff as much. But have a great day. There's a bunch of good ones here. Let me open up. Actually, hold on. Just give me one second. One second. Um, while I do this, I'll sing a song [Music] per singing. That was just that was the greatest that was the theme song for Greatest American Hero with me then just putting things about my dog. Here I'm opening up comments because a bunch of people had actually really good ones about uh how to sign off. Control F right away on this one. I'm on the Epic Meal Time if you want to know. Oh, it's shaking. I'm sorry. Sorry everybody. We'll pick one. Oh, here we go. Okay, here's how we're going to sign off this one. All right, ladies and gentlemen, and then I'm going to switch it over. I'm Whatever. All right, everybody ready? Here's here's the sign off we're going to use this time. I don't know if we use it everyone. It was sub submitted by Matt Matt Straa. Sturba. Sturba is Matt Sturba.",
      "start": 1786.32
    },
    {
      "text": "All right, everybody ready? Here's here's the sign off we're going to use this time. I don't know if we use it everyone. It was sub submitted by Matt Matt Straa. Sturba. Sturba is Matt Sturba. Said all the other stuff. Remember me? 6 a .m. Remember to join me every Wednesday and Friday to start your day with a Gregway. Sounds good. I like that. Good job, man. That's not bad. I like that. I must write that on a noteard and keep it on the computer so I remember that. So, I'll see you Wednesday, everybody. Right. Cuz today's Friday, this week's flown by. Might have some special guests. Might have some special guests next week. I'll definitely be filming from a special location. So ladies and gentlemen, remember to join me every Wednesday and Friday to start your day with a Gregway. [Music]",
      "start": 1844.16
    }
  ]
}
