{
  "id": 134,
  "video_id": "y_emly9xkgA",
  "show_name": "A Conversation With Colin",
  "hosts": ["Greg Miller", "Colin Moriarty"],
  "title": "Lesser Known Presidents (Polk Was 'Kinda Neat'): A Conversation with Colin",
  "description": "Everyone loves JFK and Lincoln, but what about the presidents who aren't on money? Colin brings you up to speed and talks crap about a few ex-Commander and Chiefs.\n\nToday's topics were submitted by @ZGAMER. Leave your suggestions for future conversations in the comments below.\n\nSUBSCRIBE/LIKE/SHARE\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Tim for filming.",
  "published_at": 1380200410,
  "duration": 446,
  "transcript_chunks": [
    {
      "text": "I like Richard Nixon. What's up everybody? Welcome to A Conversation With Colin. I'm Greg and this is my roommate, Colin. Now sometimes Colin says crazy stuff , so every Tuesday and Thursday I reach to my random topic pile, pull one out, toss it at him, and we talk it out for your amusement. If you like that, like the video, subscribe to us on YouTube, share us with your friends. Colin, are you ready? Yes. Today's topic of conversation is which lesser-known president should get more recognition? This comes from @ZGAMER, which lesser-known president, which president? Yeah, yeah, everybody's always talking about this Abraham Lincoln fellow, Washington, Bush, Bush. What's the one who we don't talk about enough that he did something cool? The coolest, I guess, the coolest of the cool. I always like James Polk, a perfect one. Um, I might not even be able to identify him as the president. The reason you're nailing it already. The real reason I like James Polk is because Paul Kai album, right exactly. He went to, yeah, he went to",
      "start": 0.08
    },
    {
      "text": "um, I might not even be able to identify him as the president. The reason you're nailing it already. The real reason I like James Polk is because Paul Kai album, right exactly. He went to, yeah, he went to polka. Uh, he's a great football player there. Yeah. Um, you know, James Polk made a one-term pledge before he ran, yeah, and stuck to it. He could have gotten reelected and he didn't. I was really, really, why did he only want to run? Why do you only want to be? It was supposed to be like, like, you know, we've had a bunch of two-term presidents. Keep in mind that the first seven presidents of the United States, six of them were two-term presidents. Only one of them, um, well, actually that's not true. Yeah, no, two of them out of the first seven are one-term president, so it would be Adams and John Quincy Adams. Okay, but Washington, Jefferson, Madison, Monroe , and Jackson were all two-term presidents. Um, I think it was more of an ode, like, I'm here, I have a plan, I want to do something and I'm going to get the hell out of here.",
      "start": 41.92
    },
    {
      "text": "Jefferson, Madison, Monroe, and Jackson were all two-term presidents. Um, I think it was more of an ode, like, I'm here, I have a plan, I want to do something and I'm going to get the hell out of here. You know, and he stuck to that, which I thought was kind of neat, you know, when you read about him , um, that he wasn't there to be realized in Polk kind of neat. Yeah, there you go. Why do you think it's cool? Like he wasn't there to be like a career politician and he could have easily gotten re-elected. I think he actually would have died in the second term. Um, he did die, I think a few years after his, his, uh, his term was up, but, um, yeah, I think he was an interesting person. I think they're, I think the more lesser-known presidents that were terrible are more interesting than or lesser-known prisoners that we're good. A lot of people don't know about some of the terrible presents. Uh, Z Gamer, it's Polk. Congratulations. Now GameOverGreggy wants to know about a terrible president. Uh, how about James Buchanan? What",
      "start": 78.56
    },
    {
      "text": "a lot of people don't know about some of the terrible presents. Uh, Z Gamer, it's Polk. Congratulations. Now GameOverGreggy wants to know about a terrible president. Uh, how about James Buchanan? What a bastard. James Buchanan was a terrible president. What do you do? The state started to secede when James Buchanan was president. A lot of people don't think about that or whatever, but when it was Lincoln getting, um, elected that caused the South to leave because I knew what he was all about, but, um, James Buchanan in South Carolina and then a few other states started to leave the union under James. We can and his whole thing was like , I don't know what you want me to do about it. Like I can't do, like you can't. He didn't feel like there was a constitutional way for him to stop them from, from leaving. Of course, Lincoln felt the exact opposite, but he was just like a mess. Um, him and Franklin Pierce, who was the president before him, were both just, Franklin Pierce was considered, um, a dough face, they called him.",
      "start": 112.08
    },
    {
      "text": "Lincoln felt the exact opposite, but he was just like a mess. Um, him and Franklin Pierce, who was the president before him, were both just, Franklin Pierce was considered, um, a dough face, they called him. Like dough face. I got a dough face. Um, what that meant was, no, no, what that, what that meant was that he, um, he had, was a northerner from New Hampshire with southern sympathies. So a lot of this stuff was, a lot of this stuff was, um, put off, like a lot of this action in the 1850s was, was basically like a, a prelude to, to the Civil War itself. So we had some pretty bad presidents leading up to Lincoln that a lot of people don't talk about and a lot of bad presidents leading up to Hoover, uh, are just like do nothing Republican presidents in the 1920s, Calvin Coolidge and Warren Harding that didn't do a lot of things that people don't talk about. We remember the great presidents for a reason, you know, such as Richard Nixon remembers him for good things or I like Richard Nixon. Sure you would. Um, cheating bastard.",
      "start": 154.24
    },
    {
      "text": "that people don't talk about. We remember the great presidents for a reason, you know, such as Richard Nixon remembers him for good things or I like Richard Nixon. Sure you would. Um, cheating bastard. Retreat makes a good president anymore. That's the thing. You get up there, you got all these, you got all these lobby groups plugging up Congress and everything else, the Senate and whatnot. You can't give me past the House Representatives all screwed up. Nothing works. That's caution doesn't work. It's kind of the idea that the, the, I like that the executive is like, like for instance, Obama's just like done, like no one cares about Obama anymore. Like that, like he's just a lame duck, like no one gives a **** what he has to say about anything. Like that's kind of the way the founders envisioned it. Yeah, like the, the House and the Senate are where the power is and I feel like that is like going back to the way it was intended as opposed to like a more imperial presidency as they call it, you know . Um, Obama",
      "start": 198.48
    },
    {
      "text": "the, the House and the Senate are where the power is and I feel like that is like going back to the way it was intended as opposed to like a more imperial presidency as they call it, you know. Um, Obama like has no res, like the House doesn't respect Obama at all. They do not care like about like what he has to say and the Senate who is in control by Obama's party also doesn't seem to care too much about what he has to say. Whatever he just is there to sign bills and set, you know, be kind of like a figurehead in the sense that like he sets, um, you know, like the agenda and stuff like that or tries to get things passed and tries to use the bully pulpit, um, and the power and procedure of his position to, to get the things he wants, but like if you know you can tell that like he has no respect in Washington, you know, he's like the Rodney Danger. Yeah, he doesn't get no respect. Yeah. Uh, but you could tell like someone like, you know, I think Bush had a lot more respect than Obama. Which one Bush? George who?",
      "start": 235.36
    },
    {
      "text": "you know, he's like the Rodney Danger. Yeah, he doesn't get no respect. Yeah. Uh, but you could tell like someone like, you know, I think Bush had a lot more respect than Obama. Which one Bush? George who? Dubs? Yeah, Dubs. Um, and, uh, you know, especially in the first term. Well, yeah, okay, the first term was riding on 911 still, like he was like the defender of everything. Yeah, second term was like, wait a second. But a great example is Clinton. Uh, yeah, Clinton worked, uh, with a Republican house, uh, or, you know, to get things passed, like they met in the middle or whatever. I think I think the sign of a good president is compromise or a person who understands that he's not, you know, oh, but the reason Obama's so unpopular, um, is because he's like super political, um, and, uh, you know, doesn't compromise as much as he probably should. A lot of people think he compromises too much. I don't agree. Um, so I think that, you know, a good president, you know, a lot of good presidents come from a lot of different molds. Um , I just don't",
      "start": 273.52
    },
    {
      "text": "should. A lot of people think he compromises too much. I don't agree. Um, so I think that, you know, a good president, you know, a lot of good presidents come from a lot of different molds. Um, I just don't think that we've seen one in the long, you know, Clinton was a good president. I just don't think we've seen like an amazing president. The next question is, you think Hillary Clinton will be the amazing president? I think she'll run for president. Well, she's going to win . We already know that. I don't know about that. Who's going to beat her? Chris Christie, Rand Paul, um, Marco Rubio. I mean, there's a few Republicans that can that could beat Hillary Clinton. It's just a matter of like how it's positioned. I think Hillary Clinton has definitely got a great chance of being president. Yeah, I think she kind of got robbed in 2008. I think I think there's a lot of like buyer's remorse with Obama. Yeah, yeah. Um, I think a lot of people wish that they they just went with Clinton, um, and it seemed like it was inevitable. I",
      "start": 317.04
    },
    {
      "text": "in 2008. I think I think there's a lot of like buyer's remorse with Obama. Yeah, yeah. Um, I think a lot of people wish that they they just went with Clinton, um, and it seemed like it was inevitable. I remember in 2007 it seemed like it was me, Clinton and Giuliani. Yeah, like inevitably that's true. Um, and that kind of fell apart. So it ended up being Obama and McCain such. I like Giuliani. I'm in a good race, but yeah, he's done. And, uh, yeah, I think it'll be, if I was my prediction, I think it'll be Hillary Clinton and Chris Christie and I think Chris Christie can beat Hillary Clinton. That's actually that'll be a fun election to watch. I'll enjoy that one. Yeah, they're both live. I was like, I don't remember Romney. He has no chance, not a shot in hell. I thought he did. I was chance. Remember after that first debate when he just destroyed Obama and everyone's like, oh my god and I was like, it doesn't matter. Colin, you like, oh, it matters and then I got my free pizza. Yeah, that's true because I bet on the right",
      "start": 350.64
    },
    {
      "text": "when he just destroyed Obama and everyone's like, oh my god and I was like, it doesn't matter. Colin, you like, oh, it matters and then I got my free pizza. Yeah, that's true because I bet on the right horse. So there you go, Z Gamer, a whole bunch of presidential knowledge just dropped on you. You got carpet bombed asking for one with no recognition. Somehow president's carpet bombing, so it makes sense . You watch the Newsroom? Yeah. Oh, doctor, do I like that? Yeah, it's a good show. Colin, thank you so much for your time. Sure. Ladies and gentlemen, thank you for your time. Uh, if you like this show, make sure you like the video, show it to your friends, then subscribe to us, then leave your questions, comments, concerns in the comments below so we can make more episodes that appeal to your diverse interests. Until then, have a conversational day. We went to a Filipino transvestite karaoke bar right called South San Francisco called Edna's Ichiban Library. Edna's Ichiban Library. We got the best karaoke.",
      "start": 390.32
    }
  ]
}
