{
    "id": 141,
    "video_id": "mSUrx8iYKuc",
    "show_name": "Gregway",
    "hosts": [
        "Greg Miller",
        "IJustine"
    ],
    "title": "Why iJustine and Greg Miller YouTube - Gregway Episode 17",
    "description": "Why does Greg get up at 6 a.m. every day to post goofy YouTube videos and why does iJustine do whatever it is she does on YouTube? Find out!\n\nSUBSCRIBE/LIKE/SHARE\n\nLeave your questions for Greg in the comments and check back every Wednesday and Friday to see what he's saying.\n\nSubscribe to Greg's channel: http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nOur Merch Store is live: http://www.districtlines.com/gameovergreggy\n\nThe Vlog playlist: http://www.youtube.com/playlist?list=PLOlEpGVXWUVv1g9oZi6O95CwRHQd0ulT6\n\nSubscribe: http://www.youtube.com/user/GameOverGreggy\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy",
    "published_at": 1381323790,
    "duration": 366,
    "transcript_chunks": [
        {
            "text": "What's up everybody Welcome to Gregway and then it cuts away okay there, a little black thing is it's magical yeah I'm learning I'm not as good as you are do you not edit your own things no I do okay good it's always a constant learning thing for me I'm still young YouTube channel of course I'm Greg Miller this is iJustine hello hi you know we're from this YouTube business you're you're a big deal out there you know I don't know I'm not sure well we're about to talk about what a big deal every Wednesday and Friday here on GameOverGreggy I answer one of your questions you either tweet me or leave your comments below and we read it this one comes from Darren McNally hi Darren he says",
            "start": 0.12
        },
        {
            "text": "Maybe people didn't click on them, but sure was for me to get a video response question. It was easier or you leave your comments below, and we read it. This one comes from Darren McNally. Hi Darren, he says hello. I just no, he says hey Greg. He didn't know you're going to be on that's okay. Um, I have a question for a future episode YouTube: Why are you making these videos, and what do you hope to achieve from them? You can already engage with people on Twitter, so what does YouTube offer that makes it compelling? I can't imagine the money right now is much to write home about, damn Darren. He's cutting deep right to the bone. Why the **** are you making these videos and wasting my time? Uh, for me, iJustine, it was a creative outlet. Uh, I had come to this point where I wanted to do something for myself to create things that weren't just for IGN, like you know I love IGN, I'm happy to work there but it gets to be a much a bit much coming home and still working for the thing I was already doing. Yeah, it's true.",
            "start": 38.44
        },
        {
            "text": "Things that weren't just for IGN, like you know I love IGN, I'm happy to work there, but it gets to be a bit much coming home and still working for the thing I was already doing. Yeah, it's true. I mean, it's so different working for somebody else. I mean, I've even had random offers to go and work for these other companies and do things. And I'm like, \"But wait, but you're going to take away my YouTube channel? Why would I do that?\" Yeah, but yeah, mine isn't mine isn't about money for sure. God knows I'm not making anything off of this channel, but it's more about just the creative freedom to have... oh, this is what I want to make, horribly wrong comic book origin and go film it, and now it's live. Know no one gets in my way that's the point you do what you want. Yeah, I think that's like everyone's kind of goal in life. How did you get started on this stuff? Um, You've been doing it for a while, a really long time. Yeah, I feel like geez, I made my first website when I was in sixth grade.",
            "start": 80.56
        },
        {
            "text": "like everyone's kind of goal in life how did you get started on this stuff um You've been doing it for a while a really long time yeah I feel like geez I made my first website I was in sixth grade um I was a long time ago that was more than half my life at this point wow what but yeah I just really always loved technology and I just started wanting to learn to edit and I mean I was still editing I went to school to be a graphic designer Oh yay yay which is good because now I can do most of my own design stuff and you have good is good yeah Greg the screen we cut to not very impressive that's okay but that's what what YouTube is all about you can do it yourself you can do anything it's about the the conversation between us she gets it she gets it yeah that's the whole point like you know he's asking why we do why I do this for me when I engage with people on Twitter sure but Twitter's 140 characters which is one of the reasons I love it because you can get to the point you need to ask",
            "start": 117.16
        },
        {
            "text": "asking why we do why iJustine does this for me when I engage with people on Twitter, sure. But Twitter's 140 characters, which is one of the reasons I love it because you can get to the point you need to ask me and I can get to an answer super quick. But sometimes I do want to rant and rave and explain for way too long about why Ben Affleck is going to be in The Batman and that's why it's here, and then I get to have that conversation with you which means so much to me. And Twitter is text, YouTube is video - I mean you can't really compare the two. So who asked this question? Uh, Darren. Darren, just think about that. It's not some weird motive of me to line my pockets with anything because that ain't happening. I'm just here to talk to you as whenever I post the videos at 6 a.m. they go live, I'm in the comments at 6 a.m. for an hour - wow, chatting with everybody 'cause I can still do that. I'm sure you get too many comments to... I mean I'll just do it throughout the day when I'm bored, I'm like",
            "start": 164.92
        },
        {
            "text": "in the comments at 6 a.m. for an hour wow chatting with everybody cuz I can still do that I'm sure you get too many comments to I mean I'll just do it throughout the day when I'm bored I'm like as you probably have noticed I'm always on my phone yeah here's the thing about iJustine that's interesting she's always charging her phone and she claims that she's not always charging her phone but she's always charging it not charging it right now because using it you over there with the little cord coming out because I need to be at 100% always that's bad for your battery you want to wear it leave my battery would you leave my battery Ling I'm so sick of your I'm just saying you're probably new to the iPhone you don't understand how it works I wanted to let you know exactly how bad it works listen once it gets anywhere near 20% like once it gets like 70 I'm like it's going to be at 20 very soon and then after 20 it does get red yeah yeah I know I don't like it I like running it down",
            "start": 202.28
        },
        {
            "text": "once it gets anywhere near 20% like once it gets like 70 I'm like it's going to be at 20 very soon and then after 20 it does get red yeah yeah I know I don't like it I like running it down like Short Circuit two like Remember When Johnny 5 was bleeding out and and he's like going circuit two yeah remember this Johnny no there is nothing after short circuit one no there was this awesome movie don't tell me this short circuit 2 where stole some gems he tricked Johnny 5 Johnny 5 I'm alive exactly he Tri he tricks Johnny into thinking he's a good guy and helps him break in to steal some gems and jewels and then but then Johnny 5 catches him but he's bleeding he's going to die and he dies there and they start shocking him back to life and he comes back to life they make a goldplated version and he becomes the first the first robot citizen of the United States this really this really happened you know but I love short circuit how did I never even know about wait wait what was the other",
            "start": 241.36
        },
        {
            "text": "and he becomes the first the first robot citizen of the United States this really this really happened you know but I love Short Circuit how did I never even know about wait wait what was the other movie hold on hold on Bam no no there's a toast there's a toaster they would charge themselves in the toaster no no Ghostbusters' not included batteries not included I never saw that one what oh my God okay what were we talking about originally we're done now it's over oh ladies and gentlemen every Wednesday and Friday I post one of these Gregways answering your comments so make sure you leave them every day I post a video I'm in the comments at 6 a.m. so make sure you show up and talk iJustine thank you so much for what time do you wake up like 5:55 it's like lit roll out of bed and then I'm right to the computer and then like 6 like this was a mistake I started but once I started saying it now I can't get out of it you can you do whatever you want well you can tell them you can",
            "start": 284.88
        },
        {
            "text": "I'm right to the computer and then like 6, this was a mistake, I started but once I started saying it now I can't get out of it. You can do whatever you want, well, you can tell them, you can, you know, maybe like on the weekends they get it. You should respond on the weekends, but it's it's all it's all about at the time the video, I mean, I post a video every day. I want people that are talking to me, I want people, I'm out there, I'm not judging, I'm just saying, I'm just, I'm just trying, I'm just trying to understand you, Greg, I'm just trying to understand you, understand me more than most.",
            "start": 327.68
        }
    ]
}