{
    "id": 147,
    "video_id": "tPyleUAjKGw",
    "show_name": "Gregway",
    "hosts": [
        "Greg Miller"
    ],
    "title": "Where Do Babies Come From? - Gregway Episode 19",
    "description": "Jeremy Miller wants to know how babies are made, and boy, did he come to wrong guy.\n\nSUBSCRIBE/LIKE/SHARE\n\nLeave your questions for Greg in the comments and check back every Wednesday and Friday to see what he's saying.\n\nSubscribe to Greg's channel: http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nOur Merch Store is live: http://www.districtlines.com/gameovergreggy\n\nThe Vlog playlist: http://www.youtube.com/playlist?list=PLOlEpGVXWUVv1g9oZi6O95CwRHQd0ulT6\n\nSubscribe: http://www.youtube.com/user/GameOverGreggy\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy",
    "published_at": 1382533205,
    "duration": 241,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to Game Over Greggy. Every Wednesday and Friday, I take one of your questions from the comments on these here YouTube videos and turn it into YouTube gold for you in the form of another video. It's like a pyramid scheme except uh it's like just it's like a line. It's a column. Uh anyways, today's question comes from Jeremy Miller. He says, \"How are babies made? Do it. We need to know.\" It's an interesting question, Jeremy. Because of course that's a dumb question. That's what you ask. But then I started thinking about it and I'm like, could I do it? Could I explain procreation? Like this is like, you know, I like health class, biology. Obviously, I know about it. I try to avoid it, but could I explain the ins and outs of it? So, you got this penis and it's going to get erect. Blood rushes to it and it gets engorged. I remember that was a big thing in health class saying engorged a lot. Penis gets engorged. stands up. Then the woman",
            "start": 0.08
        },
        {
            "text": "It's going to get erect. Blood rushes to it and it gets engorged. I remember that was a big thing of health class saying engorged a lot. Penis gets engorged, stands up. Then the male has the one with the erect penis. The woman has a vagina, which contrary to popular belief, the whole thing isn't called the vagina. Just part of it is - can't I don't know which part. I think the opening. And so once you get in there, it's like a house of mirrors. There's like all this stuff going on. You got there's a runway. There's like the canal. It's the B. It's eventually it'll be the birthing canal, but right now it's just you got a vulva in there, too. But I'm not familiar with where he's going. But you got the canal going straight at you or well into the woman. It's where the penis goes. It's where the - like that. All right. That's what I'm talking about. The birthing canal in here. Now",
            "start": 46.44
        },
        {
            "text": "Going straight at you or well in India into the woman. It's where the penis goes. It's where the it's like that. All right. That's what I'm we're talking about. The birthing canal in here. Now, this happens for a while, then the penis ejaculates, puts out some sperm, semen they call it. Now that gets all past the canal there's like a big old hollow space. Okay, see this is where okay, so like there's also up in the sides imagine like the University of Texas logo, the longhorns. It's like that and the the horns though are the fallopian tubes in there. They make eggs and then when ovulation happens, the eggs come down the horns into the big old hollow area attached to the sides. Now I'm going into look who's talking. I remember Look Who's Talking explaining this. The eggs get stuck there and then now you got semen in there. The semen, you know, the sperm inside the semen, they all 3D up to the egg and they start like pushing on the egg. I want to say eating, but they don't have",
            "start": 92.32
        },
        {
            "text": "and then now you got semen in there. The semen, you know, the sperm inside the semen, they all 3D up to the egg and they start like pushing on the egg. I want to say eating, but they don't have muscles. They're just pushing, I think. And it's a race for only one of them to get there. And then that inseminates the egg. And that makes the baby, the fetus. And then that starts growing in that hollow area. And that becomes the baby. And then like nine months later down the birthing canal out umbilical cords there. That's connected. You got to disconnect that. You cut it. Some people eat it later on. I would not recommend that, but to each their own. So Jeremy Miller, good last name by the way. That in a nutshell is how babies are made. You got the insertion, you got the canals, fallopian tubes. Pow! Miracle of life. They should call it the big bang. They don't, but you know, it's kind, you know, the big bang happened and created the universe, right? So like in a way, maybe this this is",
            "start": 145.12
        },
        {
            "text": "Pow! Miracle of life. They should call it the Big Bang. They don't, but you know, it's kind, you know, the Big Bang happened and created the universe, right? So like in a way, maybe this this is getting heady now. Maybe in a way that's what's happening here. Each time a new life's created. Do you ever think of that, Jeremy Miller? Ladies and gentlemen, what do you want to see me discuss? Leave it in the comments here. It'll be in the future Gregway, which I post every Wednesday and Friday. Until then, have a good day. I'm just kind of starting from weird angles every time. I don't give a **** about your mom. Cool.\n\nI corrected the following:\n\n- \"Greg Way\" to \"Gregway\", matching the show name\n- No other significant changes were made, as the text was mostly clear and grammatically correct",
            "start": 194.88
        }
    ]
}