{
    "id": 680,
    "video_id": "39q806szOZU",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Best Convention Stories - The GameOverGreggy Show Ep. 66 (Pt. 3)",
    "description": "Get everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get you PC here www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1426057201,
    "duration": 707,
    "transcript_chunks": [
        {
            "text": "All right, I'll do my topic then GDC's right now Pax is at the end of this week we're already talking about what we're doing at E3 Comic-Con's coming up we're going into the Screw Attack game thing we're going to Momocon I want to know TwitchCon that's that's coming up We won't for San Diego Comic-Con conventions we don't work that hard um I want to know everyone at the table their best convention memory and worst convention memory I can't even get into mine oh you need to bring somebody on mine's the whole whole Rigma Roll the R so you guys continue I I think that this I think this E3 coming up will be my 10th and I think that the the first one I went to was 2004 and that was just a great memory for me because I felt like I had made it in some respect when I finally had gone and it was a that was when they were showing World of Warcraft for the first time, Resident Evil 4 was there for the first time which was like really awesome Doom 3 was there so it was like there was just a lot of good games",
            "start": 2.85
        },
        {
            "text": "was when they were showing World of Warcraft for the first time, Resident Evil 4 was there for the first time, which was like really awesome. Doom 3 was there, so it was like there was just a lot of good games. But I just remember that moment of walking in and we at an IGN booth; I was an intern at the time; we had exhibitor badges, so we were able to go in early. And I remember just walking the floor being like this is so surreal and incredible, especially because this was pre-YouTube, you know what I mean? Like, there was video in 2004, but you didn't have YouTube, and like no one was really watching game trailers; you weren't like downloading E3 gameplay videos or anything. So I never really had an idea of what it was like right, and so that was just really memorable to me because I've been to scores of shows now, I mean, all over the world. But that first show, regardless of what was being shown there, was just a really surreal moment",
            "start": 57.48
        },
        {
            "text": "was just really memorable to me because I've been to scores of shows now, I mean like all over the world but that first show regardless of what was being shown there was just a really surreal moment of like feeling like I I had accomplished something finally um with like my my attempt to get into the industry as a a kid and uh so that will always stick out to me and I remember that I remember that E3 better than any of the other e3s I've been to um so I would just say that based on on Nostalgia it's pretty funny because my first 3 was my worst convention experience, it was when I was I was like the third or fourth person on the video team at the time this is when going back to what you're talking about the same era where to get a video live was like building a building it was so hard it took so long to compress the video and then publish and and always something wrong with it and we used to have to go and uh for basically the first two or three days Fran our our former boss over at AAN is",
            "start": 92.6
        },
        {
            "text": "so long to compress the video and then publish and always something wrong with it and we used to have to go and uh for basically the first two or three days Fran our former boss over at [Origin PC] is now I think vice president of video uh didn't sleep and I didn't know this no one prepared me for this so I was like hey it's like 2 in the morning like could we rap are we going to go to sleep and he's like well yeah you can go to sleep if you want but I generally don't sleep for the first two to three days of E3 and I'm like it's only three days long when so I literally remember and I felt bad cuz I was like this is my first convention and i've only been around for like six months I'm like I don't want to be the guy that like goes to sleep first at the party so I snuck back into the hallways you guys know the hallways you can kind of like circumvent the rows and there were rows of chairs and I climbed over one like like a little lizard and hid myself in the second row so I could sleep for",
            "start": 133.72
        },
        {
            "text": "guys know the hallways you can kind of like circumvent the roots and there were rows of chairs and I climbed over one like like a little lizard and hid myself in the second row so I could sleep for like a half hour and and I heard someone come out and be like is Nick here I don't know where he is he must be gone I was like just stay quiet he'll never find you and it was terrible and subsequently it got better every year after that to the point where like the last year we did it was awesome because it was like live shows and this and that we're streaming all the time and like we have a whole crew for people um but that first year was was just terrible terrible uh the one that stands out for me is a really good one was our PlayStation experience oh yeah that's a great one last one we just did that was the last show we did yeah and that was our last show I'm Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nNote: I corrected \"Igan\" to \"I'm\", assuming it was a typo or an error in the auto-generated transcript.",
            "start": 169.56
        },
        {
            "text": "That was the last show we did, yeah. And that was our last show is Igan guys, and that was the place one, so it was like the culmination of our careers there. So to walk around and like when we went to the when we were going to the press conference in the morning, and you said I was looking like a broke-ass politician shaking hands with everybody because we... You should have seen the giant line of PlayStation fans, and every other one was like \"beon bye\" taking pictures. I appreciate you were waving and saying \"Beyond\" back; we appreciate that support obviously. Beyond was huge, you know, when we did it for years, and we're so honored by that support. But I was trying to like get where we needed to go, but Greg, Greg trying to like rally votes like he's in a primary is literally doing the two-step. I have never seen anything like it, like from anyone who's not running for office; Greg is literally walking down the line, doing the two-step and grabbing hands. It was the ****, it was so funny, and I'm like, \"Dude...\"",
            "start": 204.76
        },
        {
            "text": "never seen anything like it from anyone who's not running for office Greg is literally walking down the aisle and grabbing hands it was the **** it was so funny and I'm like dude and then it got even better when we went into the conference at PSX Greg had a receiving line like I just sat down you know I'm people know me for years like at shows and stuff I'm just a little more shy and I like to kind of let Greg have the limelight that's totally fine I'm fine you know being you know we all know who has the biggest yeah penis yeah we we yeah I was going to say I think we all do know the answer to that uh but uh but Greg like so I just sat down people would walk up to me every minute or so and be like hey I'm you know I stand up and and shake hands but Greg was literally standing in an aisle like he's like the like Queen Elizabeth with like people with people like like a line like a a quarter of a mile long line of people like trying to shake his hand I'm",
            "start": 239.92
        },
        {
            "text": "standing in an aisle like he's like the like Queen Elizabeth with like people with people like like a line like a a quarter of a mile long line of people like trying to shake his hand I'm like this is it was that because we are such PlayStation voices specifically or have been known to be PlayStation voices that show is really Surreal for us I think because those are our people like when we when we did Beyond and usually we do Beyond or something live we're like who has a Vita and like a few people hold it up and because we're obsessed with PSV as everyone out there knows when we did it like it was L half the room I was like holy **** these really are our people and some people like oh mine's in my car and like there's more there more every PSV that has ever been sold yeah not only that but you guys were the voice of a the PlayStation generation when PlayStation was at its darkest time right like there wasn't they weren't doing when they were at the brink we were there for them",
            "start": 282.12
        },
        {
            "text": "that but you guys were the voice of a the PlayStation generation when PlayStation was at its darkest time right like there wasn't they weren't doing well when they were at the brink we were there for them you were and you guys are the ones that were like no no it's still going it's still going hold the faith hold the faith and then finally you were vindicated when the PS4 came out and actually started doing well and they had that great press conference at E3 where they're like well Microsoft wants to do this guess what we're not going to do that and everyone's like I love that but then they jumped in and they were like us too us too now we were not going to do it all Al yeah Microsoft's like JK guys we would never do that that would be a terrible idea that would be dumb um Harley what's your what's your uh best and worst convention stories uh Comic-Con 2011 we did an Epic Meal Time live show and a girl showed up and she's like \"dick\" no I'm kidding uh and at the end of the show she came",
            "start": 319.44
        },
        {
            "text": "what's your uh best and worst convention stories uh Comic-Con 2011 we did an Epic Meal Time live show and a girl showed up and she's like dick no I'm kidding uh and at the end of the show she came I'm waiting to find out if this is the best or the worst she was like huge fan oh no this is a good memory uh well weird one she was like oh my God a huge fan like can I hug you like yeah she hugged and then she was like these are for you and she started breaking off her fake nails and she broke them all off and put them in her hands and she like she's like these are for you hang on to them forever and I was like thank you thank you so much I brought them back to Canada I still have those nails do you really yeah I still have those that's yeah they're at my mom's house you just drop them in a drawer with some batteries and buttons my my battery drawer yeah exactly my battery drawer in my old room like the nails are in there in like a paper towel are you are you worried that one day she's going",
            "start": 351.04
        },
        {
            "text": "with some batteries and buttons my my battery drawer yeah exactly my battery drawer in my old room like the nails are in there in like a paper towel are you are you worried that one day she's going to come back with some sort of wraith and be like where are my nails and you're like here they're here I I held them for you the whole time he's going to be like where are my nails I'm going to suck your dick be like yeah it's going to be like Dan Aykroyd Ghostbusters where he gets ghostbusted his eyes go crossed which like I only got 12 years after the movie the first time I saw it yeah I like watch her I'm like oh like why is she pancing him yeah I don't understand I was I don't understand what she's doing to my mom's like you're a **** idiot kid mom said yeah mom's a wisecracker idiot well it reminds me of those embarrassing questions you had I think I've said this before but The Silence of the Lambs when he she first walks in and and another great Muppet movie by the way oh oh right",
            "start": 392.72
        },
        {
            "text": "well it reminds me of those embarrassing questions you had i think i've said this before but The Silence of the Lambs when she first walks in and another great Muppet movie by the way oh oh right exactly and i and there's that pretty disgusting thing that happens where someone throws something at or whatever and i remember being my mom i'm like what the hell like what was that yeah my mom's like Oh he spit on her i was like oh and then it wasn't until like i was like in college when i like watched it like you lied to me but you couldn't actually tell me the truth yeah but how would you have interpreted that when you were a child oh i mean that's the thing is like my mom must have been horrified yeah that i was even asking that question she was like i love that you were watching that movie though oh i used to see i used to watch scary movies when i was a kid or whatever but like there's a difference i think between violence and and that kind of stuff and then",
            "start": 431.72
        },
        {
            "text": "were watching that movie though oh i used to see i used to watch scary movies when i was a kid or whatever but like theres a difference i think between violence and and that kind of stuff and then sex for at least my parents there was like in terms of like they didnt really care if i was watching scary movies they cared if i was watching like more sexualized movies sure anyway i okay thats just a i remember speaking of sexualized movies when i was younger i used to uh there was action figures for this thing called Toxic Avenger oh yeah so i had like in Canada you just had they had Toxie toys like you get like Toxie and all the different characters and there was like a cartoon and then i remember being in like the movie rental place and there was this movie Toxic Avenger that came out like six years before and i was like oh my God all those Toxie Avenger toys that i just aimlessly buy cuz i've seen the cartoon theres a real movie that existed no way so we got the movie and if youve",
            "start": 463.52
        },
        {
            "text": "Six years before, and I was like, \"Oh my God, all those Toxic Avenger toys that I just aimlessly buy because I've seen the cartoon.\" There's a real movie that existed. No way? So we got the movie, and if you've seen that movie, which I'm sure everyone here has seen, it's like super messed up. There's like sex, tits, weird bullying - it's like super messed up. And I was like, Saturday morning watching that movie, and my mom wakes up and she's like, \"What the...?\" I'm like, \"It's Toxic Avenger.\" I have the toys, and that was before they made the law that like R-rated movies can't have toys - and for that exact reason. Like, I live that. I was like, \"I was like the T...\" This is weird to me. My mom wrote a letter to them, and they ended up sending us like 15 toys being like super sorry about that. Here's all these toys. Please don't sue us. Here's the topless woman toy that we hold. And now, so if you want to know why like the new RoboCop movie comes out, it's not rated R - it's because my mom.",
            "start": 501.08
        },
        {
            "text": "about that here's all these toys please don't sue us here's the topless woman toy that we hold and now so if you want to know why like the new RoboCop movie comes out it's not rated R it's cuz my mom wrote a strongly worded letter in 1992 merchandise that makes sense that makes sense yeah what's what's happening oh what what you it's so hot why do we keep closing the door Patreon oh man oh yeah bought a bottle of Jack Shar it no what are you doing what's wrong with you who raised you is this cuz of Toxie oh man thank you thank you so much thank you so much for letting us film and record and be around here too you got double XL for the big boys there should be okay no but this is it's actually for Greg I want this shirt that he's wearing you want my team fat shirt you're welcome to take it aware of how like awful it smells no well it's I know a while ago the door opened and there was a breeze and Tim I swear on my life it smells worse now it smells worse someone brought it in it's one",
            "start": 544.88
        },
        {
            "text": "aware of how like awful it smells no well it's I know a while ago the door opened and there was a breeze and Tim I swear on my life it smells worse now it smells worse someone brought it in it's one of you brought it in let me smell all of you well thank you of course for Patreon for letting us for letting us use their office space and for it's because of Patreon and all the support out there that we're able to do what we do it's not you good I smell it just smells like like a boy's locker room remember in junior high I used to like why does no one shower it's cuz none of us wanted the people the teachers to see our penises oh Patreon cocaine Shades uh oh true story about Patreon they do tremendous I didn't get cocaine glasses oh here oh thanks con keep passing out the goodies thank you anybody have a really bad a bad convention story other than that mine I got sick at Comic-Con the last day with Hillary one year where I almost passed out on the show floor that's",
            "start": 597.72
        },
        {
            "text": "You anybody have a really bad convention story other than that mine I got sick at Comic-Con the last day with Hillary one year where I almost passed out on the show floor. That sounds terrible, and then I came home my throat closed up and that was the first time I ever missed work at IGN because I was sick. How smelly was Comic-Con? Oh, Comic-Con gets a bad rap; it smells no, I went to Comic-Con and I was like, \"It smells like crap in here,\" like ComiCon, but it stinks. I was shocked at how much it actually smells like unkempt skin. Yeah, but it smells like you should go to... uh, you should go to Gamescom one day. Oh my God, Gamescom is a nightmare; Gamescom is like Comic-Con, it's about 10 times bigger with 10 times more people and they're all German. Sounds tight. Yo, thanks for the Jack diagonals and the T-shirt, I'm taking this with me.",
            "start": 652.24
        }
    ]
}