{
    "id": 656,
    "video_id": "LuyTlTV0lQs",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Nick Scarpino"
    ],
    "title": "Let's Play Persona 4 - Teaching Tuesdays",
    "description": "Greg attempts to teach Nick everything in Persona 4.\n\n\nWe quit our jobs, please support us here: http://www.patreon.com/kindafunnygames\n\nSubscribe! https://www.youtube.com/user/kindafun...\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nNick - http://www.twitter.com/Nick_Scarpino",
    "published_at": 1425412801,
    "duration": 1149,
    "transcript_chunks": [
        {
            "text": "what's up everybody welcome to another teaching Tuesday here on Kinda Funny Games I'm Greg Miller and this is the producer SL Seducer Nick Scarpino hi Greg hey how are you good now Nick of course we started teaching Tuesday with Colin teaching us all how to play Mega Man and then we've moved on now to the education of Nick Scarpino you are a key member of the Kinda Funny team I'm like the sniper on the SWAT team you're like the guy that goes to the door like bust to the door Colin's like the guy that plans everything goes yeah mhm yeah he's got like the blueprint in the cup of coffee on the the hood of the SWAT car Tim Gettys is the guy that comes in like a little hung over Tim the guy who blows it he's the one who runs and gets shot immediately uh but we're running you through some video games that are important to us and showing you what they mean of course Colin gave you a taste of Castlevania: Symphony of the Night I thought I'd go a different direction and start with",
            "start": 0.12
        },
        {
            "text": "some video games that are important to us and showing you what they mean of course Colin gave you a taste of Castlevania: Symphony of the Night, the night I thought I'd go a different direction and start with something a little more current that we talk about all the time on Kinda Funny, Persona 4 Golden of course this seminal PlayStation Vita game now the one knock of course that Persona 4 Golden gets a lot is that it takes a while to get going you start the game right and you it takes a little bit of you know what's going to happen where's it going go I've jumped you about 70 hours into the game right now, 70, 70, 70, 70 but I believe the save on this one was 72 to be exact so we've jumped in we're running around our what did you do for the other 72 hours of this game I romance CH this is my girlfriend CH over here she just chills there in her booth yeah seems like an inappropriate outfit for the winter time it's clearly winter time well I don't think those I mean she's got pants on I don't think",
            "start": 37.0
        },
        {
            "text": "CH over here, she just chills there in her booth, yeah, seems like an inappropriate outfit for winter time. It's clearly winter time. Well, I don't think those... I mean, she's got pants on. I don't think those are... She has pants on. Okay, but a big part of Persona is managing all these relationships right and then going into the TV world to do battle with evil things okay so I'm going to see if we can do it on New Year's year no no my greetings all take priority so I'm going to run around see this is the whole thing is that we got to run around and talk to everybody right all these people that have mattered to us forever right uh and that's the whole point make this guy matters a lot he's a Martian from space, he's Teddy all right he is Teddy he's very",
            "start": 75.72
        },
        {
            "text": "everybody right all these people that have mattered to us forever right uh and that's the whole point make this guy matters a lot he's a Martian from space he's Teddie all right he is Teddie he's very important to everybody I'm Teddie have some sort of allergic reaction to a like a bee sting or some peanut butter you what's going on with say you didn't say you're going well first off he's clearly in a bear suit okay all right I don't know how how how clear how it's clear as day that he's not really a bear right there okay he's just the man dressing up like a bear it's Japan after all there's a long story here that we don't need to go through right now is that your girlfriend cuz she's cute no I that's you Chie and I didn't take her I I took Chie this is why you take Chie Chie is amazing Rei is cute too I know they're all cute that's the it's a it's a it's a JRPG how cute is she let's go talk to her I want to see what she looks like I already talked to her now she's gone oh that's it yeah I've",
            "start": 109.4
        },
        {
            "text": "too I know they're all cute, that's the it's a it's a it's a JRPG how cute is she let's go talk to her I want to see what she looks like I already talked to her now she's gone oh that's it yeah I've got to say it's my New Year's greeting I got to greet all my New Year's friends here like I said I've jumped you just save long time well I don't think you'd have the same success as Senpai here well it's cuz his pants are really high and tight I don't know if that's why he's having such a good is that him no that's that's no I am Senpai you're Senpai yeah the head be confused with kohai which is from Rising Sun, starring Wesley Snipes great film skipping through everything I don't want to spoil anything for you but I'm you know we're I'm giving you a tour of Persona 4 here okay this is the big point you know what I mean I don't know if you understand no I'm looking at it I'm seeing riveting gameplay right now now see the whole point is getting to know people and doing things though like I said is that so",
            "start": 148.64
        },
        {
            "text": "what I mean I don't know if you understand no I'm looking at it I'm seeing riveting gameplay right now now see the whole point is getting to know people and doing things though like I said is that so that's what this game is all about you just kind of relax into it yeah well the whole it's a it's a story driven game right like I I got to talk to a fox here clearly there's a lot going on so basically this game is just a metaphor for hardcore drug use no what you talking about look how happy the foxes are to see is yeah that fox like if I saw that in real life I'd be like what did I just eat I got to throw up immediately and ride this one out everyone great soundtrack though oh my God but like see we're talking about it like in so you can come down here and like you have to build these Social Links with people okay and so that's the whole thing here you can see like I've gone through I've maxed out these things which then make my Persona stronger so that when we go into battle I can do more",
            "start": 187.92
        },
        {
            "text": "with people okay and so that's the whole thing here you can see like I've gone through I've maxed out these things which then make my Persona stronger so that when we go into battle I can do more damage I can do different things it's a big deal to talk to people I don't think you're grasping how important I'm not it's talking to people in most games are the thing that I like doing least oh okay so it's the one thing where I'm like God can we just get through this stupid thing the stupid uh I think when you see how cute everybody is here and how how great the story is it'd be a different story well I mean it's it looks cool it looks like this is something you want to kind of get out there and explore especially since this is a V game right yeah exactly it's with you all the time so you're kind of just kind of hanging on on the train you're like well I'll see what's happening not in the real world which is clearly not as fun as this world What's this called Inaba",
            "start": 226.44
        },
        {
            "text": "Let's Play Persona 4 - Teaching Tuesdays. Greg attempts to teach Nick everything in Persona 4. We quit our jobs, please support us here: http://www.patreon.com/kindafunnygames Subscribe! https://www.youtube.com/user/kindafun... This video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com Follow us on Twitter! Greg - http://www.twitter.com/GameOverGreggy Nick - http://www.twitter.com/Nick_Scarpino\n\nkind of just kind of hanging on the train you're like well I'll see what's happening not in the real world which is clearly not as fun as this world What's this called Inaba, you newb, just chill for a second just let it wash over you no I'm I'm like literally being lulled into it I think this is one of those things that like there was a while when I didn't I was out I I wasn't really into anime anymore you know and then eventually Tim Gettys was like you got to go watch Death Note I'm like I don't know if I want to get back into that feeling that you know that these kinds of uh this this art form sort of evokes yeah um then you watch it, you're like okay I get it but it is a different it is an adaptation so for me I would have to sit down with this game for probably a couple hours before I was like I get it, I'm feeling this I'm addicted to it if I go to the Velvet Room and talk to Igor and Margaret of course I mean Margaret's got it going on I'm not going",
            "start": 259.44
        },
        {
            "text": "Let's Play Persona 4 - Teaching Tuesdays\nGreg attempts to teach Nick everything in Persona 4.\nWe quit our jobs, please support us here: http://www.patreon.com/kindafunnygames\nSubscribe! https://www.youtube.com/user/kindafun...\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nNick - http://www.twitter.com/Nick_Scarpino\n\nhours before I was like I get it 72 you know I'm feeling this I'm addicted to it if I go to the Velvet room and talk to Yosuke and Marie of course I mean Marie's got it going on I'm not going to be angry with her that's all it is that's all it is these girls have as long as they have it going on you'll sit through it I'm a man of very simple talents Greg there greeted everybody return to my home yes I might have to skip you through some cut scenes maybe you'll get one of the anime cut scenes here I forget what you get at New Game+ but then you'll see it and then we'll go we'll get to go battle hopefully at the end this is where you live is that your father no he's my uncle what happened to your dad did he die no they dropped me off here for the for the school year I go to school here okay so you're a kid what's the story of this game you come here yeah you're you got to go to school here okay it's a small town you're a big city boy okay you start making friends okay they're great folks",
            "start": 301.8
        },
        {
            "text": "You're a kid, what's the story of this game? You come here, yeah. You're you got to go to school here okay, it's a small town. You're a big city boy okay. You start making friends okay, they're great folks like Yosuke there's Teddy outside of his bear suit, Teddy, what up? He looks so much better when he's not in that thing. Okay, well again, it wasn't... he didn't have that thing. He was just chilling. Fast forwarding through this, yeah. I don't want to spoil everything for you, I don't want to spoil the story for you. You want to get to action, I'm trying to get why are they sitting underneath the giant s'mores? Cuz no, that's not of course in traditional Japan culture, you sit under that okay. Tatsuya, I think is... did it throw up on itself? No, that's the winter one. I didn't know they had winter ones either. You learn things, you learn things about the culture as you play this game. Amazing, it cleans your jeans, the top of your jeans. It doesn't clean your jeans at all. It's like a jean car.",
            "start": 340.24
        },
        {
            "text": "winter ones either you learn things you learn things about the culture as you play this game amazing it cleans your jeans the top of your jeans it doesn't clean your jeans at all it's like a jean car wash no it is just a car wash for your jeans all it no I I understood what a Genie Car Wash was when you said it Greg is a Jean Car Wash it's not Greg it's not it's not that it's a shammy for your jeans I got keep resting here hold on so you've come to this town yeah you've met all these nice people sorry you come here you you make a group of friends that you keep up your Social Links but then there's a serial killer on the loose and it turns out you and your friends discover Eikichi Mishina gives you the power is you know helping you have the power to defeat him what this dude's doing is tossing people in the TV then they die in there unless you go in and save them you see them on the Midnight Channel which gives you a premonition of that they're in trouble then you and your friends have to",
            "start": 376.76
        },
        {
            "text": "people in the TV then they die in there unless you go in and save them you see them on the Midnight Channel which gives you a premonition of that they're in trouble then you and your friends have to go in there and battle so he's kind of like a Freddy Krueger where he's like tossed him into like a Dream TV World kind nothing like that I mean I he's not killing them in the real world right he's doing he's using some sort of power to put them in TV world you have to go in after them Where did you get this TV power how how are you able to that's a big part of the story that I'm not I'm not I'm not Liberty discuss Right Now spoiler yeah okay yeah I'm going to guess Pirates Pirates gave you the Close Ninjas I was going to say Ninjas but is that racist no now it wasn't weird till you said it right there you made it weird when you said it right there Samurai Samurai Samurai Samurai is how you're saying it Our last Let's Play Hi Colin I think I think we might be able to battle soon here all",
            "start": 417.96
        },
        {
            "text": "there you made it weird when you said it right there Samurai Warriors is how you're saying it our last let's play hi Colin I think I think we might be able to battle soon here all right cool I dropped you into like I said I I maybe throwing you this far ahead wasn't but like letting play playing the beginning first you know hour to get to something wasn't an option either so by what by your standard what level of RPG would this be JRPG that's a whole other different standard yeah I don't I don't know what you mean like this is pretty hardcore like it's is like oh yeah I mean look you got to go to class you got to take quizzes you learn about Japanese culture now here's the thing about the quizzes right is that you do this and you're going to see in a second I like oh you're not I got it right because I knew the answer I'm like your knowledge has gone up and then like you take all this stuff though and then there are finals and midterms that all the questions you've",
            "start": 457.4
        },
        {
            "text": "Not I got it right because I knew the answer. I'm like your knowledge has gone up and then like you take all this stuff though, and then there are finals and midterms that all the questions you've asked through the year - you then apply to that okay so like there's there's a lot of stuff here we go so it's just here we go finally. I'm now I can finally show you the exactly well it's High School except you're fighting people, you're fighting shadows in the TV World okay so we're going to go do that now for you to finally show you the battle system. I apologize it took me that long. This is one of the knocks against Persona but it's also one of the greatest things about Persona is that we get to go fight these monsters and there's this amazing story. You're back at the television station, we're about no we're at we're at the Mall food court here - that's Teddie again. That is T what did you clearly I think it's Teddie. I don't think we can get how am I supposed to know if it's Teddie or not maybe it's",
            "start": 501.6
        },
        {
            "text": "No, we're at the Mall food court here. That's Teddie again. What did you clearly think it's Teddie? I don't think we can get how am I supposed to know if it's Teddie or not? Maybe it's someone else in a Teddie suit. If you see, we have the Fox there too. The Fox is chilling there to help us out, and no one is terrified that this Fox is just there waiting for them. They think it's a dog; they don't know. Nobody would be terrified if they saw Porygon, but the thing would scare you, bu If he, if I, if he was everywhere that I was, I'd be starting to get a little suspicious of him. And there's all these murders happening. Why is that Fox always around here? It's crazy man! But this little weiner dog keeps showing up with a knife and stuff. What do you think he meant by that? We're going to go now; we're going to go battle some stuff. So, you jump in the TV world then you T yeah then you get to assemble your party. Oh so we get to bring our friends into this nightmarish world with us.\n\nNote: I corrected phonetic mistakes and spelling errors, capitalized proper nouns like names (Teddie, Fox), games (Porygon), and show titles (none in this chunk). I also cleaned up the text for grammar and punctuation.",
            "start": 533.2
        },
        {
            "text": "To go now, we're going to go battle some stuff. So you jump in the TV world, then you assemble your party. Oh, so we get to bring our friends into this nightmarish world with us. Yeah, exactly. That's how any good friend would do well. That's how you all get well. I want to bring her, actually. I don't like her, but I like her as a character. I want her to be my girlfriend, but I don't enjoy her battling Kanji looks like a badass. Kanji is a badass. You know who voiced him? Troy Baker. He looks like Troy Baker - tall, good-looking, blonde, yeah, an air of confidence. Now, I took you to the strip club. Oh, so that's the one she's trying to find common ground with, right? Uh, uh... World okay, that you had to go battle when we had to go save her. So here you go. I see you all right. So now we're in the Persona world. Yeah, we're in the TV world. We've got our track suits on - it's weird to play with a controller. We're running... What? That I'm not going to fight him; he's a...",
            "start": 570.32
        },
        {
            "text": "so now we're in the Persona world yeah we're we're in the TV World we've got our track suits on it's weird to play with a controller we're running what that I'm not going to fight him he's a he's a basically a fortune teller he's not a real Shadow I don't want to fight him okay I want to I want to show you real shadows and Shadows are what we fight in this game yeah in this weird sex TV World exactly it's getting better I'll be honest with you because of the sex TV World portion that's not it's not it's not points against it what is happening so this is the battle system now this is the turn-based JRPG Battle we talk about jump way too much happening on one well you jump in now and you look at each one of your enemies and you try to figure out what they're weak to and what they're not right so like I'm using Yosuke right now whose main power is wind as you can see this guy oh no he's strong against wind I don't want to that you see the little the little strong and wind I would have thought",
            "start": 610.04
        },
        {
            "text": "like I'm using Yosuke right now whose main power is wind as you can see this guy oh no he's strong against wind I don't want to that you see the little the little strong and wind I would have thought feathers yeah I know this would this would have come to you over time don't worry he's weak to five though so we'll remember that we have some fire people coming up okay cool now this guy with the the belly hole man he only only physicals can hurt him only physical damage can hurt him okay so people have to go up and punch him exactly preferably not in the belly cuz that would do you nothing right so I'm still going to use a skill one of my Persona skills which is Brave Blade here now what this does is it actually takes away my health it's going to knock down my HP a bit but I'm going to be able to give him devastating attacks okay look at that you were asking for a gag out that's a gag out look at that just crushed him wow now these dudes weak to fire good thing Yosuke over here",
            "start": 642.52
        },
        {
            "text": "able to give him devastating attacks okay look at that you were asking for a gag out that's a Gag Out, look at that just crushed him wow now these dudes weak to fire good thing yo over here her guess what she's powerful with a bikini no fire fire all right I went up for the fist bump before I realized you weren't going to say fire so that's on me you know I'm not going to say fire on someone the bikini now again you put her in that outfit right yeah you wanted to see the outfits you wanted to see everybody's in a goofy outfit she's in the Bikini uh blame that on me Yosuke is in his uh Gag outfit forget I think uh Kanji is in his Power Rangers outfit for Tim oh that's cool here you can see everybody Power Rangers outfit yeah you can put everybody in there I have a whole Power Ranger outfit for everybody let's can we do that now yes well hold on yeah I'm trying to open this chest I'm having a hard time poting at it well it's cuz you got a sword that's twice the size of your body well do",
            "start": 678.24
        },
        {
            "text": "for everybody let's can we do that now yes well hold on yeah I'm trying to open this chest I'm having a hard time poting at it well it's cuz you got a sword that's twice the size of your body well do you want me to win the battles or do you want me I'm riveted by this I can see how this would be fun you know who's a huge fan of this Colin Moriarty loves Persona so I don't think you should be knocking it until you try it cuz you and him are both a bunch of Meat Heads you'd both love it we do we go to the gym climbing climbing Community Partners don't make fun of the climbing I'm making fun of the climbing Community CU you're making fun of Person Kevin is a member of CLS like a small bear forging for lemon that a small bear could just knock down a lemon tree he wouldn't have to climb the tree lemon trees are like the lemon tree is robust it's big and thick okay so anyways you run around doing this so now you're Power Rangers yeah game got",
            "start": 715.24
        },
        {
            "text": "a lemon tree he wouldn't have to climb the tree Lemon Trees are like the Lemon Tree is robust it's big and thick okay so anyways you run around doing this so now you're Power Rangers yeah game got better now yeah now we're just as the Power Well everybody's way behind me for some reason but anyway maybe they got they stopped off to see some of the sights in the Velvet Room can you kill that thing yeah we're going to kill that thing what do you think this game's all about look at these look at these idiots these guys all right Dino DNA so you see they're this weak to electricity physical wind we got a whole bunch nothing okay so what is the minus wind mean what do you mean it's it just didn't have anything for wind oh that means that they're just it does normal they're not strong or weak they're just like it's going to do damage but again these guys are so low all my attacks should probably clean clocks cool you get cool little things like that then you get the XP you get the money",
            "start": 754.76
        },
        {
            "text": "they're just like it's going to do damage but again these guys are so low all my attacks should probably clean clocks cool you get cool little things like that then you get the XP you get the money experience money exactly great that so then you just do this now for 75 80 hours cool while talking to people like we were doing before and building relationships that sounds great so what happens at the end of it when you realize you've spent 90 hours doing this well it depends you can if you don't make certain choices you don't even get a good ending really yeah oh yeah you can get terrible endings in this game that's horrible you have to start over no I mean you if you're doing it right which you should be you're you're not stupid you have a million save files out there oh I see so you're like oh well I I'm going to go back to cuz like right before a key decision be like hey do you want to save a game but like the thing is like you don't even know like the first time I got a a good",
            "start": 793.24
        },
        {
            "text": "like oh well I'm going to go back to cuz like right before a key decision be like hey do you want to save the game but like the thing is like you don't even know like the first time I got a good ending I was like oh that's the ending of the game okay cool and then I like oh no no no there's a true ending to the game and you didn't get it because you didn't do this and you didn't go see this that's what it tells you no no it didn't tell me that I had to find out via the Internet wow yeah that's some messed up stuff hey man they want you to play that's what I mean you're getting bang for your buck here that's what you want isn't it I in the Social Link Palace yeah I mean it would be nice I mean do you do JRPGs do anything for you usually ever have you ever played one have you ever tried one no um very superficially just for Game Capture back in the day I go and try to do some stuff but I mean they just they confuse me because they take so long to get into that you're just well they ease",
            "start": 830.88
        },
        {
            "text": "No, um, very superficially just for game capture back in the day I'd go and try to do some stuff but I mean they just confuse me because they take so long to get into that you're just well they ease you into it though that's the whole thing is like right now I'm running you again through 70 hours of gameplay it's a bit different than what you would see in your real life, see. I think I think my I think I have a predisposition to not liking JRPGs just because back in the day when you know the early Final Fantasies my friends would play them and I'd like, I don't understand you have this cool thing that would roam around and when you go to fight people it's on one side of the screen and then the thing's on the other side of the screen and it would just be sort of like stats damage it. I guess the reason I don't like them is because it doesn't really necessarily revolve around skill, more strategy sure and I'm kind of a let's get going let's fight you want to get in there I want to feel like",
            "start": 869.52
        },
        {
            "text": "the reason I don't like him is because it doesn't really necessarily revolve around skill more strategy sure and I'm kind of a let's get going let's fight you want get in there I want to feel like because of my specific skills I was able to beat the game not because a mathematical equation said so even though there is a lot of skill that goes into those obviously you're research managing and you're you're going in and you're checking and making sure that your characters are level up enough to fight these guys there's strategy to it um I guess I just like the the sort of uh nness of like first person shooters things like that versus this which you know just instant gratification yeah I like the instant gratification I like the fact that it revolves around my specific like okay you know someone's down my sight if I pull the trigger at the right time they're dead Go versus this where like you know do you really need to be running around this this thing this long well I mean I'm well yeah I",
            "start": 907.4
        },
        {
            "text": "down my sight if I pull the trigger at the right time they're dead Go versus this where like you know do you really need to be running around this thing for so long well I mean I'm well yeah I mean like you know it comes and goes there's just moments where you get totally immersed in it lost in it right you know what I mean then there's other moments where like a like I'll pop in after having been gone for a long time and just be like what was I doing what do I need to do now you know what I mean but like if you stick with it for 70 80 hours like that's the thing with our friends who have fallen down the Persona hole right your Mitch Dyer is you're Alex Stedman what they do is they do they like basically lock themselves up for a weekend with it right and then come out and they're like it's amazing change my life see I feel like the other the other key aspect of this that I'm just not getting is the story is the fact that I'm not immersed in the characters or in the fact that these",
            "start": 947.32
        },
        {
            "text": "\"Change my life, see. I feel like the other key aspect of this that I'm just not getting is the story - the fact that I'm not immersed in the characters, or in the fact that these characters have dynamics that are happening between their relationships. Cuz really all I've seen so far is you've walked up to four girls, which admirably, so good for you, Kudos. That's the thing it's high school, they're all cute together and they they all have feelings and stuff - not what happened to me in high school. Well that's why you get to live this power fantasy that's pretty fun of being Sae Ni and being you basically a superhero leading the team against bad guys, power level having a cute little sister yeah yeah I guess they just always kind of become grindy to me oh well that's a huge part of it let's not lie the game is grinding I just don't like any game that makes you grind unless it's like you know GTA grinding for a purpose. We did it well this is Persona 4 Golden, it's one of\"",
            "start": 981.2
        },
        {
            "text": "of it let's not lie the game is grinding I just don't like any game that makes you grind unless it's like you know GTA grinding for a purpose we did it well this is Persona 4 Golden it's one of the most celebrated JRPGs if not the most celebrated looks cool I'm giving it a lot I'm giving you a lot of crap for it obviously I can see you should we're we're joking around about it obviously um I can I I now understand I have a base for it I will I ever play it no well again this is just the education of Nick Scarpino where I'm trying to teach you about a JRPG about this Persona thing of course Persona 5 that trailer came out everybody flipped out it looked amazing I flipped out Colin flipped out how much better does it look than this oh that was the whole thing yeah it's I couldn't believe how much better this looks than this and that was one of the things I talked about with the Persona 5 trailer is the fact that after having played Persona 4 for so long I didn't even stop to",
            "start": 1019.84
        },
        {
            "text": "how much better this than it looked than this and that was one of the things I talked about with the Persona 4 trailer is the fact that after having played Persona 5 for so long I didn't even stop to think about what it was going to look like on a current gen platform you know what I mean like what they were going to do with camera angles and character models and all these different things cuz I'm so used to seeing this stuff right which Grant is you know bit an upres PS2 game you know what I mean that they've gone through and made it look beautiful for the so good stuff come certainly colorful oh there's that guy yeah yeah and since like if originally we'd fight him we wouldn't know what he's all about right right but now we're like oh physical attacks **** his world up so guess what we're going to do he's got a gun and a chain this is tough take him I get one more turn and just do the same thing clean clocks done gratifying yeah cool thank you Greg no problem now you know something",
            "start": 1064.16
        },
        {
            "text": "going to do he's got a gun and a chain this is tough take him I get one more turn and just do the same thing clean clocks done gratifying yeah cool thank you Greg no problem now you know something about jrpgs other than just capturing I can't imagine someone setting you loose on Final Fantasy like oh we need video review stuff go mostly just for the cut scenes just going for the cut scenes and we them well ladies and gentlemen that of course is Persona 4 Golden have you played it how long did it take it do you Platinum it all that stuff let us know in the comments and of course let us know other games we need to show Nick to continue his video game education thank you for hitting that Milestone over on patreon.com kindafunnygames for everything about cool video games in Daily Let's Plays keep it right here on Kinda Funny Games",
            "start": 1097.44
        }
    ]
}