{
    "id": 661,
    "video_id": "yOMAFTWbkZQ",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Why Devs Don't Care About Game Length - Kinda Funny Gamescast Ep. 09 (Pt. 3)",
    "description": "Game length doesn't matter to game devs, here's why.\n-\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1425456001,
    "duration": 784,
    "transcript_chunks": [
        {
            "text": "You all right, um next one I want to do is a little bit of a twofer. We mentioned this a second ago, this next topic right? You talked about game length. Metal Gear Solid is this again a big thing right now with The Order: 1886. I don't know if you've heard of this game. I've heard of it, okay go. It looks it looks beautiful, it's very beautiful not incredibly long, not the shortest um we're saying if you want to speed run it and do it blah blah blah when you're making a game as a developer is that what you're thinking? You know where does your head space that in terms of the end experience how long is going to be our use making a story making gameplay what are you doing yeah that's what the hell you went over there. Awesome question, I've never heard like yeah this kind of come up in the press or like in on podcasts like that is how developers gauge play time yeah that's a really good one. I you should ask smarter people than me and with whom I'll have more experience but from my from your perspective",
            "start": 0.0
        },
        {
            "text": "in on podcasts like that is how developers gauge play time yeah that's a really good one I you should ask smarter people than me and with whom i'll have more experience but from my from you know the past you know few games that I've shipped you kind of have this general sense you kind of like this really rough target and you think oh yeah you know you know for Halo 4 for example I think we're talking about like 10 missions I don't know how many they shipped with maybe eight I want to say that sounds about right anything remember that and because you figure you factor like okay like an hour per mission and it's about you know it's a little bit over 10 hours we should be fine it's just really rough math yeah put on the back of the neck was it there's no way to there's no way to say that what Colin this expert gamer was grown up a Mega Man knows all the stuff how long he's going to play getting every collectible versus someone who's just picking it up and playing on the weekend every so often and I",
            "start": 46.63
        },
        {
            "text": "this expert gamer was grown up on Mega Man, knows all the stuff how long he's going to play getting every collectible versus someone who's just picking it up and playing on the weekend every single time I even wear versus the guy who wants to be the first one and it's just steamrolling right like I don't get it's always a weird question it is and so for one of the things I've learned and I think a lot of developers would agree is that and this isn't necessarily a bad thing but games actually take a lot longer for people to play than I think developers first expect and I've always found that to be the case like you think all these players are gonna be able to finish this in two hours, you put it in front of somebody average time's three hours and a half or three and a half hours or something like that so that was one thing that I've really learned so maybe even let the order guys were like oh man we were shipping like a three hour game",
            "start": 83.83
        },
        {
            "text": "Three and a half hours or something like that, so that was one thing I've really learned. Maybe even let the order guys were like, \"Oh man, we were shipping like a three-hour game.\" And 06 alright, bad oh yeah, the other weird thing this gets to the more publisher side of things, I think. But the unfortunate thing about Alien: Isolation for example, where it seems like they might have had at it too long right because they're worried about black box value and sometimes stuck too much is a bad thing right? So when I was concerned with The Order, right, leave way when leading up to when they were talking about not making it longer than people are saying it is but we jump around a lot. We want you to feel different right, we want every gun to feel different, whatever scenario to be different every time you pick it up. We want you to be doing something different so there isn't repetition right and then it was like well now there's no flow to the game, there's no pacing to the game.",
            "start": 121.15
        },
        {
            "text": "Every time you pick it up, we want you to be doing something different so there isn't repetition right? And then it was like, well, now there's no flow to the game, there's no pacing to the game. And what does that matter when Alien: Isolation, yeah, is just like the first eight hours are great and then there's more. Why are we still going into this? Right? Or true or false: if the order was just an amazing, incredible, unbelievable six hours, seven hours, we wouldn't be having this conversation. We would have been people would be saying, \"Oh, this is how a game should be.\" I like yeah, like a six- or seven-hour really, really top-notch triple-A experience. But maybe that's not what the game is right? No, I mean not to me. I mean, I was thinking... I've been talking about when we played The Order and you know all these things started breaking. We couldn't talk about it. And one of the things I was frustrating us was like, \"I don't think the\"",
            "start": 157.85
        },
        {
            "text": "know all these things started we had the order early and so like a lot of these things started breaking we couldn't talk about it and one of the things I was frustrating us was like I don't think the game's good at all I just think that like the the length is not the problem, back the length if the game was longer I might have been worse and I think that that was the thing that that people were ignoring was like what is this you know subjective notion of value and what does that mean and I wrote it you know I still write a piece for a week for IGN just op-eds whatever and the topic I picked up this week was you know why game like this this argument game like it's weird because you know Journey's not one of my fear games of all time, A Journey was the most resonant emotional game I'd ever played and I beat it in 90 minutes and I was crying at the end and I have no idea why and I told Greg ah come on Greg I'm airplane I came again i deleted off my hard drives I'm like that 90 minutes was",
            "start": 192.8
        },
        {
            "text": "and I beat it in 90 minutes and I was crying at the end and I have no idea why and I told Greg, \"Come on, Greg, I'm Airplane!\" I came again; I deleted it off my hard drives. I'm like that 90 minutes was precious. I would pay hundreds of dollars to get 90 minutes like that again out of a game. Yeah, and so that is my suggested equation for value: what is the game do and what does it deliver? Unfinished Swan is another really good example of that. Like these games that are short but awesome as opposed to you know people forget when they're like \"Well, Final Fantasy 6 took 60 hours or seven hours to be an I'm like yeah but Final Fantasy 6 is able to take advantage can advantage of the conventions of the JRPG genre which no other genre does which is they can just pad it however they want. Here's another engine; well, it's not even dungeons as much as its grinding. Like you can type via reticle. You should be able to blaze through a game like Final Fantasy 6 in six and ten hours if you want to.",
            "start": 226.1
        },
        {
            "text": "another engine yeah well it's not even dungeons as much as its grinding like you can you type via reticle you should be able to blaze through a game like found at six and ten hours if you want to except for the fact that you have to level your characters I'll be thoughtful and you know persistent in leveling your characters I'm making them stronger so like that that is how they make a 10-hour game a 70-hour game so people are ignoring all these tricks of the trade as it were that are fine I mean that's what an RPG is that's why I like them but you know so this argument about the order was weird to me in the sense that you're right like if it was six really excellent hours like Uncharted 2 and 3 especially I think are 10-12 hours and they're **** awesome and they don't need to be longer and I hope that they aren't shorter and and that's good but not every game needs to be that long and I think people need to like shake this notion of sixty dollars 10 hours six hours 20 hour 60",
            "start": 266.17
        },
        {
            "text": "and I hope that they aren't shorter and and that's good, but not every game needs to be that long. And I think people need to like shake this notion of sixty dollars for 10 hours, six hours, twenty hour games - it's like why can't a $55 or $60 game give you five powerful hours for sixty dollars? So I think that people are losing sight of that. You know, yeah, again I think it was an awesome game, I think people would put this thing up on a pedestal as maybe the future of games, yeah right, yeah. I mean it's maybe the game should have been forty dollars, I don't know. Maybe that's more of a question of whether the game was developed for a long time at a triple-A studio, or if it's a publisher not wanting to explore this middle ground that could exist even for retail products, but Jim Sterling actually said he did a piece on",
            "start": 303.16
        },
        {
            "text": "of a publisher and not wanting to explore this middle ground that could exist for even retail products but Jim Sterling actually said he did a piece on Jim Sterling, saying publishers are afraid of exploring this middle ground because they're afraid of being tagged as a budget game. Yep, no and that's right, yeah, and that has like a bad or a mystique about it - it's just not no bueno, they don't want yeah, um so I don't know, I bet they've run the numbers to like oh yeah what happens you know, focus groups if we sell the game for nineteen ninety nine less people buy it looks is there's a procedure of her annoying yeah, I bet there's something to that, yeah, it's interesting, it's this this particular argument just gets me in the same way that the indie downloadable space kind of argument gets me where it's like games that aren't sixty dollars on have value and games that aren't 20 hours are not valuing I'm like what",
            "start": 339.46
        },
        {
            "text": "me in the same way that the Indian downloadable space kind of argument gets me, where it's like games that aren't sixty dollars on have value and games that aren't 20 hours are not valuable. I'm like, \"what, why do you have such a narrow view?\" And you get to spend more time on the app store, then you get into this weird, really dark space where you'll never win. It's you know, you make a game that's, I have a friend who put out a pretty good game out there for $1.99, yeah, and people are bitching and moaning it's two hours long, and like \"we can't believe your charging for this\", it's just two hours, like what do you want it for free? And then you start doing the whole \"it's less than half the price of a cup of coffee\" thing, or the comparison to République when I came in at $4.99, yeah people complain like crazy, yeah it was a",
            "start": 378.1
        },
        {
            "text": "You know you've lost because there's no logic will prevail. It's a really dark place out there. I forget what was République when I came in 499. Yeah, people complain like crazy. Yeah, it was an hour and a half to our first episode. You know, I think that's pretty good. Yeah, it's all just labeling and all that stuff. Yeah, it's weird like the whole argument also just segues out of the specific argument of game length or how long is but like this whole argument also just values outside of length about we talked about a little bit before about and we have some great viewers who were saying like that they would prefer to buy our game as opposed to getting a code from you, we were giving them away in Colony. Great, why? Because some people... it is great because there are people we don't say we're educating people cuz it's up to them whether or not they know they know intrinsically that it's true but these things cost money to make and they're gonna cost money to play",
            "start": 418.88
        },
        {
            "text": "we don't say we're educating people cuz it's up to them whether or not they know they know intrinsically that it's true but these things cost money to make and they're gonna cost money to play and if you cut out if you just start I really feel like some of it is developers' fault for undercutting each other on the App Store, like that's a disaster and they all did it to themselves because they felt like they had to and what really needed to happen was that the guys who run those stores, whether it's Google Play or the App Store, could have done a better job of holding back some of this free-to-play phenomenon from taking over because I think what we end up having now is just a bunch of crap and a bunch of manipulation that goes on now sure you have to build all this manipulation to kind of trick people or make them feel guilty or do whatever to get money out of",
            "start": 452.99
        },
        {
            "text": "Is just a bunch of crap and a bunch of manipulation that goes on now, sure you have to build all this manipulation to kind of trick people or make them feel guilty or do whatever to get money out of them. It's a really bad way to interact with consumers to the limited degree you even have interaction with on the app store, which isn't a whole other problem but we still embrace it. I actually have really good feelings about the long-term viability of our game on the app store because there are 1 billion iOS devices out there. Getting the game in front of even like a small percentage of that is a great opportunity. Yeah, it's interesting to talk to different developers who have experience on the iOS store and Sean Vanaman, an Android developer, just in the sense of how their games succeeded or didn't and how people are talking about DrinkBox actually going to Vita with 14 million of them, whatever there are.",
            "start": 490.7
        },
        {
            "text": "store and Sean Iowa an Android just in the sense of how their games succeeded or did and how people are talking about drinking a beer, actually just going to Vita with 14 million of them, whatever there are out there because they're like it's just easier, you know. Um, yeah, I think the free-to-play thing is all interesting. I mean we talk about Plants vs. Zombies 2, which I was really excited about. I was less than I ever played a game on my iPad; I usually just used to read and they gave it to me, you know. They gave it for free, and then it's just like it constantly nickels and dimes you in the app, and I'm like, \"Dudes, like I would have given you twenty dollars if you'd just left me alone.\" And now since you're bothering me, I'm gonna be **** yeah, like that's that's the whole thing. That's all I'm not even gonna play your game, ya know? Like, it's like, \"Yeah, grind this out or pay us two dollars,\" and I'm just gonna grind it out because I resent you asking me for this one dollar. I would have just given it to you up front.",
            "start": 530.51
        },
        {
            "text": "ya like, I was like, it's like, yeah, grind this out or pay us, you know, two dollars. I'm just gonna grind it out because I resent you asking me for this one. I would have just given it to you upfront and you'd just not talk to me or give me the option and just leave me alone. Button, yeah, this money is just really unfortunate, yeah. With the way that, yeah, I think consumers been trained, and the consumers that will pay six figures into some of these iOS games if you let them, they will, yeah. And well, that's the same thing with Patreon right? Like it's like you have these people who will support you and try to give this developer more money, right? And then but then they get in this way and they screw it up and the people who will get nickel and dimed, get addicted maybe, go the wrong way with money, right. And then you have things where if you have a way like the people in the Twitch chat today who like why I",
            "start": 563.61
        },
        {
            "text": "you get nickel and dime, but you get addicted maybe you go the wrong way with money right, and then you have things where if you have a way like the people in the Twitch chat today who are saying why I got a code, I still want to buy it for a gift on Steam, I want to make sure they're saying we're not so yeah that's like that's where you hope the Goodwins out right yeah and we actually see a positive sign I think it's because of our kind of cult console pedigree and the audience that buys our game on at least on iOS is we have a season pass just like the Telltale games have a season pass in iOS which is fifteen dollars, it pre-purchases all their future episodes at a discount and what we actually found was that there's more people that have purchased the season pass and who have finished episode one hmm that's strange right and what are we talking to he'll tell guys they basically say this is that doesn't surprise him that a lot of people you know want to support your game or",
            "start": 597.96
        },
        {
            "text": "Episode one, hmm, that's strange right? And what are we talking to? He'll tell guys they basically say this is that doesn't surprise him that a lot of people you know want to support your game or they're buying it in advance 'cause then they want to wait until episode 5 comes out but that just shows a lot of goodwill at least for us like you know and more people way more people this shouldn't surprise you but the guys who buy the game at premium if they buy it at $49 or more likely to buy the season pass then are the ones that get the game for free if they get it. Oh sure, that obviously makes a lot of sense but it's because these people we want it, that's our target target audience is that we want to cater to the people that are willing to pay for quality and a very smart person way smarter than me I told me he's in a consulting firm told me Ryan you have to you can't think of all consumers as the same you have to focus on and who your consumers you have to have your target consumer and I was",
            "start": 632.34
        },
        {
            "text": "I told him he's in a consulting firm, told me Ryan, you have to you can't think of all consumers as the same, you have to focus on and who your target consumer is, and I was like yeah, I'm an idiot, like of course, yeah that's right, and he's like, \"Your target consumer is not the ones that are you know trying to get you know 99 cent cheeseburgers they want to down at a restaurant and eat like a you know a ten dollar cheeseburger,\" well, and that's fine, they go after those guys, yeah, yeah, that's a good point, that's a great point, yeah, that's why it's gonna be successful on Steam. I should have said steak because all developers want their games to be like steak filet mignon, yeah, I think this game, I mean the reaction was going to be huge, we showed on E3, I think again, that this will be big on Steam, I think what I got was the console will be back there for it speaks to the console hardcore gamer, you started doing that but it's funny because you started",
            "start": 669.87
        },
        {
            "text": "Why devs don't care about game length - Kinda Funny Gamescast Ep. 09 (Pt. 3) doesn't matter to game devs, here's why. \n\nagain that this will be big on Steven I think what I got was the console will be back there to it speaks to the console the hardcore gamer you started doing that but it's funny because you started at a place you thought you should be and probably needed to be in the iOS market but the place that was most unintuitive for a developer to be like you to be and I so but I think that that what's that what's so cool about that is now I don't say the hard work's over X the hard work is never over for a studio here is you guys are still working on the game's up but maybe that the trials and tribulations are over like if you get something so if you go to Xbox One for instance there's there's gotta be some confidence that you're like well you know these emails more yeah these people will get it yeah in shipping this huge game with all the memory constraints and all the things we're learning about iOS and pushing iOS in areas that they never been pushed before outside maybe Infinity Blade and a",
            "start": 705.84
        },
        {
            "text": "in shipping this huge game with all the memory constraints and all the things we're learning about iOS and pushing iOS in areas that they never been pushed before outside maybe Infinity Blade and a couple other things so you're right yeah we took the hard path and I that's kind of like what I want to do with my life anyway so hopefully i'll pay off you want to be challenged I want to be on the Dark Souls path of life I'm not I'm not you know playing some you know you know game that's like constantly throwing achievements at me I want to earn those babies in right I like that get Any 40 ok um Republic Remastered out right now if I right here in this go get it PC and Mac Humble Store GOG that's not in Game Over Greg no sock Game Over Greg and Steam so thank you so much for PlayStation seen it no no problem our pleasure",
            "start": 737.79
        }
    ]
}