{
    "id": 324,
    "video_id": "p5bPTohgc3Q",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Earth is Officially Getting Renamed?!?! - The GameOverGreggy Show Ep. 29 (Pt. 1)",
    "description": "Full Episode Friday! Get it EARLY here! http://gameovergreggy.bandcamp.com\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1403420401,
    "duration": 1257,
    "transcript_chunks": [
        {
            "text": "[Music] What's up everybody? Welcome to the Game Over Gregy show. I'm one of your hosts, Greg Miller, alongside the producer/seducer, Nick Scarpino. Hey everyone, I'm back. Yeah, everybody missed you. A lot of people are like, \"Oh, Aisha Tyler's cool, but she's no producer session.\" No, let's be 100% honest. She's way cooler than me on any thousand times better than any day. Producer way sexier when I was doing the way taller. Like I stood next to her. What are you like a five solid 57? I'm a good 5'8. Thank you. When the sun's shining and you're reaching for the sun yoga, you know, and pilatees, the fine art of patees, the pure one Tim Gettys. Let him host. Let's host indeed. Uh, Pride Long Island call. Hello. Hey, how are you? Go Islanders. I'm good. They're not. No, that's over now. They don't have to worry about it. Are you already getting ready for gearing up? I can't wait for hockey to start again. The great thing about hockey is that it goes on for [ __ ] ever. So, it's got to",
            "start": 1.1
        },
        {
            "text": "don't have to worry about it. Are you already getting ready for gearing up? I can't wait for hockey to start again. The great thing about hockey is that it goes on for [ __ ] ever. So, it's got to be starting up in a month. It does not go on longer than World Cup as it turns out. World Cup certainly goes on for like 19 months straight. Yeah, you'll have like two birthdays by the time World Cup gets started to finish. And like and then the United States still doesn't win. Where does Canada why is Canada never in the World Cup? Do we even have a team? I don't know. I was surprised someone was like team suck. America's in contention. Like we might do something and I was like I don't I'll believe what I see. They did win. I mean I was at the bar and watched that game. It was very interesting. Well, they beat Ghana but let's not go into this. Sorry. Continue your job. And the final one, a fifth guest. A fifth guest. The only one who sounds like a professional talker cuz he talks into mics",
            "start": 45.68
        },
        {
            "text": "Well, they beat Ghana but let's not go into this. Sorry. Continue your job. And the final one, a fifth guest. A fifth guest. The only one who sounds like a professional talker cuz he talks into mics all the time. Your dog in your lap. No, not my dog. Damen Clark, everybody. That's a hot me. If you're not familiar, handsome Jack in Borderlands. Mhm. Uh, you're in Dragon Ball Z, but who watches that? I was, I think, would be the right word. Is that not going on? I don't know. Okay. This is amazing. No. Watch as we go through his resume. It's amazing. Okay. Amazing. So excited for this. He actually stars in your life as you when you're not around. I'm sure he's much better looking than me. So much. You seen his hair? Look at his hair for Christ sake. Great hair. It's amazing. Good looking hair. This is why we bring you. That's what the whole show is about. The whole show is about that. Yeah, we can tell you about the pantsless section when everyone has to take their pants off. It's going",
            "start": 83.04
        },
        {
            "text": "This is why we bring you. That's what the whole show is about. The whole show is about that. Yeah, we can tell you about the pantsless section when everyone has to take their pants off. It's going to turn into a weird episode of a in here, which I'm not I'm okay with. Listen. Listen. That's the weird crazy. You're drinking Coke over. Anything can happen. Let's be honest. Can I have a old fashioned? It would be closer to oranges than black than Oz though. No problem. You want one too? Start with him, Colin. Start with him. Bartender. You want bourbon or rye? Bourbon. Okay, good choice. You're not Greg. I'm not too right now. What is Aisha? Tyler said the same thing. You're making fun of fashion. I'm kind of a daffodil. It's because rye tastes It tastes like Can you do Manhattan or do we No. You know what? No. Oldfashioned. [ __ ] it. Okay. No. Yeah. Let's do it. All right. Let's do it. Um, so the more I drink, the better this smoother this is going to go. You've been on 24. 24? Yeah.",
            "start": 124.72
        },
        {
            "text": "You know what? No. Oldfashioned. [ __ ] it. Okay. No. Yeah. Let's do it. All right. Let's do it. Um, so the more I drink, the better this smoother this is going to go. You've been on 24. 24? Yeah. Prison Break. Uh, Prison Prison Break. Yeah. Then this Supernatural. Uh, working on um Why did you go to Smallville? You should have been on Smallville. Yeah, I'd love to do Small Well, over you guys had Michael Rosenbomb. We did. He sat in that very chair. He's He's a stud. He's a cool dude. Do you know him? Uh, never met him, but I'm I'm a bit of a fan. Um, you like him, though. He He You're not allowed to say that, Nick. So, we've had to cut all of that out. I appreciate that. Michael Rosen Bomb's a great dude. I heard Michael's an awesome man. Yeah, he does. The parties man, he loves it. Ladies and gentlemen, if you didn't know, the Game Over Greg Show is a weekly show where four, sometimes five best friends gather around this table, each bringing a random topic of conversation to enjoy",
            "start": 164.72
        },
        {
            "text": "and gentlemen, if you didn't know, the Game Over Greg Show is a weekly show where four, sometimes five best friends gather around this table, each bringing a random topic of conversation to enjoy with you and each other. If you like that, there's a whole bunch of ways to get it. Every Friday, we post the full MP3 on gameovergy.bandamp.com bandamp.com for $1. If you say, \"Uh-uh, you aren't worth the dollar.\" We agree and understand. I don't want that dollar. You do want the dollar. That's what you're saying. You need that dollar. You definitely need that dollar. Yeah. You know, we need it. You've seen If anyone needs the dollar, you you've seen the facilities we have here. Need the dollar. That pizza didn't come free. 14 of those dollars. Uh, and then of course, if you don't want to pay for us, that's fine. Go over to youtube.com/gameovery. We put up every topic, one by one, as videos until the whole show is posted on Friday for free. Hooray. And there's also fun videos over there. I",
            "start": 209.44
        },
        {
            "text": "us, that's fine. Go over to youtube.com/gameovery. We put up every topic, one by one, as videos until the whole show is posted on Friday for free. Hooray. And there's also fun videos over there. I feel really privileged to be one of the best friends now, guys. You made it. It's You want to know how it's going to pan out for me, but I'm really jazzed. Would you like to know a true story, Damen Clark? Depends on if it's a good story or not. It's a good It It's going to start in a bad place, but get to a good place. I'm in. All right. So, uh, you're going to come on the show. I'm very excited about it. I'm like, \"Great.\" Blah, blah. I mentioned this to another friend in the industry at E3 and he goes I've heard that guy's a dick in real life. Are you [ __ ] serious? I'm dead serious. And I'm like And I'm like, \"What? No.\" Like, \"No, that's going to it's possible. I've said some [ __ ] to some people.\" That can't be true. Like he's And I'm like, \"Wow, I hope oh man, wait. I made a mistake",
            "start": 249.44
        },
        {
            "text": "like And I'm like, \"What? No.\" Like, \"No, that's going to it's possible. I've said some [ __ ] to some people.\" That can't be true. Like he's And I'm like, \"Wow, I hope oh man, wait. I made a mistake and blah blah.\" And then I was like, then I got all defensive. But I'm like, \"Wait, no, no, because when I booked him, he's the only guest who has ever called me. Like your your your manager, right? I talked to him about you coming on the show and then your manager gave your my number to you and you called me and you were straight up like hey what's up man good to talk to you and I was like wait there's no way this guy is a bad guy and then you and then since then you've been awesome on Twitter I was like no I'm best friends with this guy so I'm never talking to another guy in the industry he doesn't know anything [ __ ] him spreading lies can we put that guy on blast right now no we cannot can we put him on blast cuz if we do that you know we're just going to bleep it as always can we",
            "start": 289.6
        },
        {
            "text": "he doesn't know anything [ __ ] him spreading lies can we put that guy on blast right now no we cannot can we put him on blast cuz if we do that you know we're just going to bleep it as always can we secondhand information now we get to report back and we get to end this. This is a smear campaign. Well, even Megan at your office is like, I heard he's a real handful. Which, you know, I mean, granted, that's a good thing. I have been a [ __ ] nightmare at this today. But, I mean, hopefully in in a entertaining way. Yeah. In a fun, endearing nightmarish way, like just fun stuff. So, you have nightmares and they're good. True. I don't know. Do you know you do that actually? Uh, also one more plug. Go to districts.com/gameover. Buy all our cool shirts. A lot of you have been doing that lately. Thank you so much. Yeah, the Tim shirt is actually almost up at the Yeah, the Hella shirt. I like that shirt. You should buy and look cool, too. Do I get a Game over Greggy shirt? Sure, we'll mail",
            "start": 321.2
        },
        {
            "text": "Thank you so much. Yeah, the Tim shirt is actually almost up at the Yeah, the Hella shirt. I like that shirt. You should buy and look cool, too. Do I get a Game over Greggy shirt? Sure, we'll mail you one. I want You got to give me a dress. We don't We This is the big The people always think we have them in the house. We don't have the house. You've seen House. Yeah. districtclients.com/gameovery. They They print them. It's awesome. We don't do any faces on that site. You can You don't like that? For those of you who have never seen photo of us that exists as a as a unit, I think so. Well, it's not even a real photo of us. It's just different photos. Four really bad photos are bad together. And it's not it's not the Photoshop job. It's that it's we just look like dingleberries. Oh yeah. In every single photo. A dingleberry. Oh yeah. I think it looks fine. No one wants to look like a dingleberry. I'm wearing an SEC shirt for some reason. Of course you are. Go. Go. Um the old Missou.",
            "start": 364.4
        },
        {
            "text": "In every single photo. A dingleberry. Oh yeah. I think it looks fine. No one wants to look like a dingleberry. I'm wearing an SEC shirt for some reason. Of course you are. Go. Go. Um the old Missou. What are they again? Is it That's right. Okay. Yeah. There you go. Hit my hand. We have to do a video of us making these two. People ask for the recipe. The recipe is in the first time we ever debuted the oldfashioned recipe. I know. We'll put it in the description. The thing is I don't think anyone could do it quite as perfectly as Colin does it. This is what he was science to this. He is stirring it like a like a 16-year-old debut like brushes your hair, you know, like 100 times to the right. 100 times to the right. He goes around so much that it starts to become a syrup. He like Yeah, exactly. You got to mix it. I learned that you it's so at this place hard water that I go to I think we talked about this right with the ice and I I wanted to start doing that cuz I think it's a a more",
            "start": 402.64
        },
        {
            "text": "You got to mix it. I learned that you it's so at this place hard water that I go to I think we talked about this right with the ice and I I wanted to start doing that cuz I think it's a a more thorough way to do it. I'm going there with Eric Castro on Friday. Eric Castro shout out everybody go to Plight Provision San Diego. We will be doing we are we doing that at Comic- Con? Yeah. Hell yeah. We're doing that. We got a night like we do like Thursday night when nothing's going on. Whatever. We'll do whatever we do. I like that. All right. Is it all right? No, dude. It's delicious. I love the fancy ice cube. We have a lot of people to go through. A lot of topics to do. A lot of topics to talk about. Let's start with Nick. Nick, we usually put you towards the end cuz usually you're a train wreck. Let's put you towards the front. I think it's it's smarter to put me toward the front now. Just give him my my last track record so we can just bleep the entire segment out and then Was that",
            "start": 448.0
        },
        {
            "text": "wreck. Let's put you towards the front. I think it's it's smarter to put me toward the front now. Just give him my my last track record so we can just bleep the entire segment out and then Was that your last Was that the last time you did? No, it wasn't the last one. I think there was one before that, but that was And that wasn't even your topic. It was just that you were so quick to start drawing on it. Sometimes the old brain doesn't hit the old filter before it comes out. Damian knows what I'm talking about. like like earlier in the show when you slandered Michael Rosenbomb for no reason. I did not slander Michael Rosabomb. I love Michael Rosebomb. He's a badass. Uh so my topic actually comes from Twitter. Remember guys, if you have cool topics like this and you guys are doing amazingly, please follow me on Twitter, Nick Scarpino. And for the love of God, leave the other Nick Scarpino alone. No, no, no. They're just they're literally including him in the conversation now. They're",
            "start": 481.68
        },
        {
            "text": "please follow me on Twitter, Nick Scarpino. And for the love of God, leave the other Nick Scarpino alone. No, no, no. They're just they're literally including him in the conversation now. They're like, \"Nicks, what do you think of this?\" Does he ever tweet back? He does. He was like, he actually responds. He's a nice guy. Does he watch the show? You think? Has he ever watched one of the show? I guarantee he's watched at least like a minute of one of the shows before. Everybody tweet this. Please don't scar. Not Nick Scarpino cuz that's him. The baby's yours. Don't Don't tweet at him. He's a really nice guy. Please leave him out of this madness. Conor, you going to drink something? Dude, you need a drink before we I'll have a little one. You want an old fashioned? Uh, yeah, sure. Drink. I mean, you're just like this all the time. I thought you were completely hammered. Oh, no. I'm hammered already. Producer, I woke up this morning and just threw the day away. Here's something I was",
            "start": 514.64
        },
        {
            "text": "I mean, you're just like this all the time. I thought you were completely hammered. Oh, no. I'm hammered already. Producer, I woke up this morning and just threw the day away. Here's something I was thinking the other day. Yeah. A lot of people on the the the feather. No, I thought you were coming for my face. No, I'm not coming. A lot of people on the YouTube money. You know, they they they call their fans and their viewers and their watchers stuff. What if we start trying to get scumbags to take off? No. Game over. Gy wants to be called a scumbag. You're really hardcore. I love scumbags. I think we should be calling them scumbags. We need to call our fans something cool like Nighthawks or like the Wolverines. Alfredo got the goats. That's what he got going on. Goats is greatest of all the greatest of all time. You got the goat herd. Join the herd. That's really good. See my scumbags could be like that. No. No one wants to be called scumbags. A scumbag. I'm a scumbag. Would you wear",
            "start": 557.04
        },
        {
            "text": "greatest of all time. You got the goat herd. Join the herd. That's really good. See my scumbags could be like that. No. No one wants to be called scumbags. A scumbag. I'm a scumbag. Would you wear a shirt that says you know the definition of a scumbag? No. I have no idea what a scumbag is. What's the definition of a scumbag? The original scumbag was a term for a used prophylactic prophylact condom. Used condom. Couldn't get that word out. That didn't last very long. So, on to my topic tonight, which came from Twitter. No, not scumbags. From uh Maverick Dark-haven says, that's Nick. What would you rename the Earth if we made first contact with aliens and they said the name was already taken? So, is this like an AOL thing where it's like you try to sign in to get the screen name and they're just like, \"No.\" Would you like Earth 295? To put it in terms that I can understand, the Vulcans come to Earth. They we've hit warp capacity. And they're like, \"The human beings, we need to go say",
            "start": 597.44
        },
        {
            "text": "just like, \"No.\" Would you like Earth 295? To put it in terms that I can understand, the Vulcans come to Earth. They we've hit warp capacity. And they're like, \"The human beings, we need to go say what's up to these guys and give them some tech.\" And they come, they're like, \"Thank you so much for having us to your planet. What's it called?\" And we say, \"Well, it's called Planet Earth.\" And they're like, \"Yeah, I know that. You guys have to be one. The Intergalactic Federation of Planets already has an Earth. Already has an Earth and we want you to join and you'll get all this cool tech and stuff. You guys need Are they holding like a laser gun to your head saying you got 30 seconds to figure out what because right now that's what you're asking us to do is come up with a a longterm our planet. I I need months to figure this out. Maybe write down It's like coming up with a baby name. Jasper. Jasper. We're going to call it Jasper. We're going to call it Kevin. Planet Jasper. Planet",
            "start": 644.72
        },
        {
            "text": "planet. I I need months to figure this out. Maybe write down It's like coming up with a baby name. Jasper. Jasper. We're going to call it Jasper. We're going to call it Kevin. Planet Jasper. Planet Jasper. It totally represents everything we're about. The whole land sea ratio thing. Why does Jasper What the [ __ ] does that mean? I actually don't hate it. Oh, it works. I actually don't hate it. How does it represent land? I'm just going with Kevin. Jasper planet Kevin. Jasper doesn't sound that bad. This reminds me of a story I heard today at lunch about a certain voice actor's hometown being the most unimaginative name for hometown I'd ever heard of. Name ever. Where do where did you grow up? In a in a heavily wooded area. Well, I'm going to give you the clues and you come up with the name. I already know the answer. So, everybody else know the answer. Okay. So, I'm I grew up in a land that is heavily wooded. Woodland. Yeah. Yeah. T an S on the end of it. Yeah. You're right. Now that",
            "start": 683.08
        },
        {
            "text": "I already know the answer. So, everybody else know the answer. Okay. So, I'm I grew up in a land that is heavily wooded. Woodland. Yeah. Yeah. T an S on the end of it. Yeah. You're right. Now that And so, so Greg guess what their job was there. Oh, that's a good one, too. Yeah. Lumber lumberjacks. Yep. No [ __ ] That's awesome. Well, I'm into that. I'm not saying they're the most creative people in the world, but you know what? It made sense and they went with it and that's where I grew up. So, you know what? So, I grew up in a place maybe your hometown is Glenn Allen. Well, his is you can't even pronounce his. It's like it sounds like when you're trying to say something real when you're drunk and and Glenn Glenn, Illinois. Thank you, Colin. Uh my town, my hometown, truth, truth be told, it's called Riverside and there is no river. God damn. And it's on the side of anything. That's so upsetting. There's a lot of orange groves though, so you think they would call it something like",
            "start": 731.28
        },
        {
            "text": "it's called Riverside and there is no river. God damn. And it's on the side of anything. That's so upsetting. There's a lot of orange groves though, so you think they would call it something like orange orange side or orange county or something like that? No, it's Riverside. A lot of that shit's already taken up though. Yeah, but I think we're alien deal here. They Someone came like what are you going to call some guy's like Riverside? Why? I don't know. They just popped into my head. You're safe with Jasper though. No one's going to Jasper Jasper. Congratulations. Um I think you guys are missing an amazing opportunity. Like when you know when you find a star, you get to name the star after someone. Um, I would definitely push for Planet Nick. Planet Nick cuz how hardcore would that be if it's like that was a thing on Nickelodeon in the 90s. Now cheers everybody. Yeah, it was one of those. Sweet. Thanks for coming. Thanks for coming out everybody. Either or like Planet Bre and Meyer",
            "start": 776.64
        },
        {
            "text": "it's like that was a thing on Nickelodeon in the 90s. Now cheers everybody. Yeah, it was one of those. Sweet. Thanks for coming. Thanks for coming out everybody. Either or like Planet Bre and Meyer cuz that guy has not gotten enough recognition for his career. That should have been your top guy from Road Trip. Has Breer gotten enough recognition for his career? Franklin after him. That's That's generous. Yeah. Greg, one name. I mean, again, and the aliens are not holding a laser to your head. They're like, \"We'll come back in a month. You guys can figure it out.\" Just spitball around some ideas right now. Give us your top five ideas. We already blue marble [Laughter] DBM. That's not bad. It's a good acronym. It's not terrible. Why did you have an evil laugh every Cuz I like that everybody would sit there real quick and like, \"Okay, good. Let us think.\" And then I just blurt that out and I ruin it for everybody on the planet. Big white duck and they just And then they just nuke nuke",
            "start": 816.08
        },
        {
            "text": "would sit there real quick and like, \"Okay, good. Let us think.\" And then I just blurt that out and I ruin it for everybody on the planet. Big white duck and they just And then they just nuke nuke the planet. You're just looking at things right now and just table. You you have some ideas. I just No, I mean besides Nick, I would just be Nick. It would be Nick. That's it. 100%. Or Scarpino. How are other planets? Is it Colin? I assume you have some insight into this. Are planets named after some [ __ ] Roman and Greek gods. Okay. Yeah. But what happened when they ran out? Jasper a god. They didn't run out. No, they were all named Jasper's the name of a Labradoodle. Mercury. Mercury was the messenger of the gods. So he he's fast and Mercury goes around the sun quickly. So they named it Mercury because it had a quick orbit. So was the the god of war and it's red and that's what they saw without So do we need to do we need to go through the rolodex of Roman mythology? Sure, we could do",
            "start": 863.36
        },
        {
            "text": "because it had a quick orbit. So was the the god of war and it's red and that's what they saw without So do we need to do we need to go through the rolodex of Roman mythology? Sure, we could do that. I don't know. Wonder Woman, planet Wonder Woman. You guys are missing the obvious answers which is like which is you can name it Gaia or Terra which are like the other old names of Earth and antiquity. Yeah, but I don't want to like Earth like okay Gaia. Name it Gaia or Terra. Okay. You know like that. I like Terara. I dated a girl named Terra. What about Nightwing? Terra. Yeah, let's call it Nightwing. Nightwing. Planet Nightwing. Cindy. Sydney. I dated a Cindy. We call it Yeah. Who's she? Was it a while? Yeah. Usually it started off with like a ladies and gentlemen, please welcome to the stage. You could call it you could call the planet that. What do we have to throw we have to throw one the planet every time it comes around us? Do we really believe that the planet is going to like",
            "start": 903.04
        },
        {
            "text": "stage. You could call it you could call the planet that. What do we have to throw we have to throw one the planet every time it comes around us? Do we really believe that the planet is going to like nursing school? Long name is what planet you live on again? It's really a long name. Super long. The other answer is we could just say we're the planet's name is Earth. If you don't like it, we have no interest in being part of your organization. You're not negotiating this cuz Colin, I love you. You will mess this up. But you're like, \"No, I we're not going to we will not negotiate away. Destroy the orbit and fly us into the sun if I negotiate with them.\" Yeah, that's bad. They'll death star the [ __ ] out. I would say I would say Tara or Gaia. That would be my answer. Sure. Oh my god. What is this guy doing? I think the Russian just Can you hear that? Did you hear that thing? This isn't Can the viewing audience hear that? I don't I heard it but I guess these aren't [ __ ] velociraptor",
            "start": 945.92
        },
        {
            "text": "is this guy doing? I think the Russian just Can you hear that? Did you hear that thing? This isn't Can the viewing audience hear that? I don't I heard it but I guess these aren't [ __ ] velociraptor eating a lamb or something. Our old roommate Mike used to have this room and he used to talk about that all the time is that he would try to play video games or watch a movie or have a girl over and just beain explain what it is. No, we like a No, he's asking can you explain to the audience what it is? It's a hawking noise. The guy's like clearing his throat down there. There's a bathroom like there it is 2 in away from where we're doing Yeah. The game studios, by the way, are not exactly the It's not exactly NBC. It's not 30 Rock up here. No, it's our spare bedroom. He's got like TV or something. It's like a black lung thing going on. I'm not sure what's So, I like that we invite guests, real jobs, actors and this guy's dying in the basement. Seriously, should we call somebody? Do you",
            "start": 987.04
        },
        {
            "text": "It's like a black lung thing going on. I'm not sure what's So, I like that we invite guests, real jobs, actors and this guy's dying in the basement. Seriously, should we call somebody? Do you think he's okay? This is part for the course. He's fine. He's fine. I'm going to do the right thing here by him. Anyway, you walk over there soon. I got the mic. You okay? So, what if he bought the show? Discovered it this way. Jasper. Yeah. Teranova or Terra. Teranova. Terara. Was Terra or Mana? No. Gia. Gia. Cindy. Now, ladies and gentlemen, just welcome to the stage. Cindy. Cindy. She's working hard for you guys. Show her you love her. Don't forget. She's working for tips and tips alone. Guys, we have an allar buffet every day here at noon to one. have a steak and Cindy and Greg the big white duck. No, the great blue marble. I think Colin wins this one. No way. Jasper is a way better name. Jasper. Jasper wins. I want I want it to be Jasper only if we specifically say planet Jasper. When you",
            "start": 1028.8
        },
        {
            "text": "No, the great blue marble. I think Colin wins this one. No way. Jasper is a way better name. Jasper. Jasper wins. I want I want it to be Jasper only if we specifically say planet Jasper. When you say Jasper, does anybody else Well, I think of like unassuming a hillbilly. Like an old wiry hillbilly man who's just in blue je the blue jeans, the bib jeans. That's what I'm thinking of. Uh overalls. No, no shirt. He's got the big white beard. He's got the corn cob pipe, little straw hat. He's our He's the mascot of our planet. That's Jethro, dude. Yeah, that's Jethro or Jed. Jasper is like a designer dog name of some kind. You're hung up on a teacup Yorkie. So that way when they invade our planet, they'll be like, \"Jasper, please. We could totally kick these guys' ass. This is going be a cakewalk.\" These aliens are up to date on what we name our dogs. Oh, they know about the planet name in general. If we name it Jasper, it's not it's not like I don't know mega death ray. There you go.",
            "start": 1079.84
        },
        {
            "text": "These aliens are up to date on what we name our dogs. Oh, they know about the planet name in general. If we name it Jasper, it's not it's not like I don't know mega death ray. There you go. That's mega death planet. Mega death star. [ __ ] it. Let's just go death star. Death star. Yeah. What about what about just something really ambiguous like like MLG, you know, 148.2 or something like that. And then they don't have any idea what they're getting into. They see it on the star map and it's around, you know, our sun and they're like, \"What is this planet? This these inhabitants are we don't All the other ones in the solar system are Greek gods. This one's not suspicious.\" Was was Nike Greek or Roman? Roman, I think. So, I think we should go with Nike cuz then at least What about money? Yeah, they make a ton of money. Verify that. Let's verify that real quick. Uh Jasper. Jasper's the winner. I don't know. How is that the winner to you? Cuz it's a great game. It's fun. It's enjoyable.",
            "start": 1131.12
        },
        {
            "text": "they make a ton of money. Verify that. Let's verify that real quick. Uh Jasper. Jasper's the winner. I don't know. How is that the winner to you? Cuz it's a great game. It's fun. It's enjoyable. Yeah, he wins. Good job. Tim, you got trying to clap. I just punch everything off. The dogs got me sitting far away. Damian Greek. Oh, so we can't use it then. Don't want to throw off everything. No, you can't. I mean, if we're going to call it something odd, call it MLG 26.1. What if we just made up? Quite. Can we just call it 96.5? Koi T O. Name it after a radio station. Striker. That's a good planet. Planet Striker. Striker with a Y. That's the problem with this Y. I love And the aliens be like, I'm not [ __ ] with that planet. I have no idea what's going on with those people and I don't want any piece of that. The mega death star Jaspers. Leave these alone. We can name the moon Jasper. Yes. And the planet can be Planet Striker. No, the moon's Kevin. Kevin. Jasper. Jasper. I get to name the",
            "start": 1174.48
        },
        {
            "text": "piece of that. The mega death star Jaspers. Leave these alone. We can name the moon Jasper. Yes. And the planet can be Planet Striker. No, the moon's Kevin. Kevin. Jasper. Jasper. I get to name the moon if he gets to name the planet. Kevin's perfect name for the moon. Okay. You both win. You're both my favorite sons. There we go. Perfect. [Music]",
            "start": 1228.4
        }
    ]
}