{
  "id": 56,
  "video_id": "aO6zw2LeJ3c",
  "show_name": "Oreo Oration",
  "hosts": ["Greg Miller"],
  "title": "Oreo Oration FAQ, Video Response Compilation, Thank You Video",
  "description": "We've been reviewing Oreo cookies for quite some time. Now, Oreo Oration answers your burning questions, shows you the best video responses so far, and gives you a great big \"thanks.\"\n\nSUBSCRIBE / LIKE / SHARE\n\nWhile you were living your life, Nabisco went crazy and made an army of Oreo cookies. Every Wednesday and Friday, Greg Miller tears open a new package and reviews a new version of Milk's Favorite Cookie. \n\nSubscribe so you don't miss a review. \n\nLeave your Oreo review as a video response.\n\nLet us know what Oreo we should review next in the comments.\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy\n\nLike Greg on Facebook: http://facebook.com/gameovergreggy\n\nOur theme is \"Game-A-Tron\" off of Daemon Hatfield's album Colorbeam. Buy it on iTunes: https://itunes.apple.com/us/album/colorbeam/id426986325\n\nThanks to Nick and Tim for filming.\n\nMega-Thanks to Matt Gravish for making the Oreo Oration logo and intro.\n\nToday's special episode featured the following Video Responses. Go watch them!\n\nArmyGuns89: http://www.youtube.com/watch?v=GiYyhL3mKkQ\n\naltoman107: http://www.youtube.com/watch?v=wYuhyMU4TCg\n\nBlaire Byhower: http://www.youtube.com/watch?v=W9gHadM-s1I\n\nCptOppositional: http://www.youtube.com/watch?v=Ok0_3tjXk34\n\ngrambofirstblood: http://www.youtube.com/watch?v=j2HBXW_8ueg\n\nMrRepzion: http://www.youtube.com/watch?v=eXvEFKJXoc0\n\nNIcklaus West: http://www.youtube.com/watch?v=-0S9aQtOSaY\n\nreallygraceful: http://www.youtube.com/watch?v=hdKkabURHxU\n\nSam Scaife: http://www.youtube.com/watch?v=a0_e9YWGwo0\n\nTaner Durusu: http://www.youtube.com/watch?v=Fdn6Yzz-qF4\n\ntheknapkins: http://www.youtube.com/watch?v=N6RhH__FKDU\n\nWhatthetechchannel: http://www.youtube.com/watch?v=05ia-tQxJ8g",
  "published_at": 1360591286,
  "duration": 620,
  "transcript_chunks": [
    {
      "text": "[ Music] what's up everybody Welcome to a very special non-episode of Oreo Oration. I'm Greg Miller and of course this is Oreo Oration , a show where I review every different type of Oreo here in these United States. I wanted to do a quick Monday video for you. Not, don't worry , you're still getting your Wednesday and Friday episode of Oration, but I just wanted to drop your line and say thank you so much for supporting the show . Uh, obviously we are up into the teens now of episodes. We still have a lot of more Oreos to come, a lot more, a lot more Oreos are coming. Uh, your support has been overwhelming. I want to thank you for all the views, all the comments, all the video responses. I'm going to link to a bunch of them here at the end and show some clips from them. Thank you so much for putting those in. But I wanted to drop a line, you know, we're we're getting ready to film the second giant bunch. I get the same questions every time we come up on Oreo Orations though, so I wanted to tackle some of those.",
      "start": 0.58
    },
    {
      "text": "but I wanted to drop a line, you know, we're we're getting ready to film the second giant bunch. I get the same questions every time we come up on Oreo Orations though, so I wanted to tackle some of those, tackle some of this. Thank you of course though, I wanted to thank the good people over at Oreo. Uh, back in December they sent me a care package including this cookie jar, cup, uh, plate, a whole bunch of other cookies and a bunch of goodies. I wanted to thank them so much for their support in that one instance because question number one on the Oreo FAQ, it's submitted by Bill Nolan, are you sponsored by Oreo? No, everybody, a lot of, a lot of questions about this, I guess understandably so. I do this all in my free time. Uh, I buy the cookies and I make the video for you then I put it up. Uh, Oreo does, I'm not an Oreo hat. If they want me real quick, Oreo's watching, you want me to sell out? Done. You want me to, if you want to pay me to review your Oreos, I'm hands down, but no, no money is exchanged hands here.",
      "start": 38.36
    },
    {
      "text": "an Oreo hat if they want me real quick, Oreo's watching, you want me to sell out? Done . You want me to, if you want to pay me to review your Oreos, I'm hands down, but no, no money is exchanged hands here between me and Oreo, so don't worry about that. These are unbiased Oreo reviews. Question number two that's frequently asked, this comes from, uh, Game Plays Gus Gamer, why cookie review? That's a good, that's a good point. Why? So if I'm not sponsored by Oreo, why do I review cookies? Uh, a lot of you know me, I, I work at a website called IGN.com Monday through Friday . I want to do something in my spare time to be creative. I searched for an outlet for a long long time and I went to this, uh, thing called VidCon, YouTuber conference and, uh, I was there to, you know, learn more about YouTube in general, but also promote Up At Noon show over on YouTube, IGN youtube.com/, go go there, watch it every Monday, me and Brian Elano and, uh, it was one of those things I left there so inspired I wanted to start creating my own",
      "start": 76.12
    },
    {
      "text": "Up At Noon show over on YouTube, IGN youtube.com/, go go there, watch it every Monday , me and Brian Elano and, uh, it was one of those things I left there so inspired I wanted to start creating my own content and I have this idea for a show that I wasn't ready to create yet. I didn't have the skills, the edit capacity, I didn't know what I'd be doing, making the video, doing all that stuff. So I did a conversation with Colin then I started Oreo try to get my chops up and do something, you know, just for me that I can create, try to create content, share it with people like yourself. Another question I get a lot, not another question I get a lot there in the comments this time it's from Brean 2. He says reduced fat, he's referring to me reviewing the reduced fat Oreos. No, I will not do that. That is not an Oreo cookie, that is a joke someone is playing on everyone . So no, I will never review the reduced fat Oreo, stop asking for it. Another question, Jared he writes and he says why does Greg always use the Palm",
      "start": 118.04
    },
    {
      "text": "cookie that is a joke someone is playing on everyone. So no, I will never review the reduced fat Oreo, stop asking for it. Another question, Jared he writes and he says why does Greg always use the Palm card? He's talking about these obviously note cards. If you look back, uh, the first round of Oreo Oration I have to read off them all all the time and I'm going to get serious for a second. Many of you know I, I was fighting cancer back in the day there when I was fighting they talked about this when I first got cancer somebody warned me about if I was going to keep working they'd get this thing called chemo brain, right, where you wouldn't be able to think straight sometimes you would be able to put it all together . There's way too much information in the intro of the Oreo Oration for me at the time to be able to remember it all and then there's so much stuff in the outro that I still use it. We just filmed a whole bunch of Oreo Orations today. You'll see the intros for the upcoming episodes. I don't",
      "start": 160.24
    },
    {
      "text": "be able to remember it all and then there's so much stuff in the outro that I still use it. We just filmed a whole bunch of Oreo Orations today. You'll see the intros for the upcoming episodes. I don't need the card and then the outro I use the card just to make sure I'm not missing anything cuz I got to remind you to like the video, share the video, do all that then I got to ask for your video response then I got to do this. It's there's so many steps I want to make sure I get it all for you plus I like a show that's polished, right? I want it to be similar experience with the different cookie being the star of it, right? You understand what you're going to get. There's a joke in the front about what what you've been doing while Oreo is working on it . There's all this other jazz that's it basically I wanted to Conformity and I was too sick to remember so now you feel like an ass Jared he another question I got a lot what happens to the leftovers only child 86 that's a two-part question there Oreo",
      "start": 196.48
    },
    {
      "text": "wanted to Conformity and I was too sick to remember so now you feel like an ass Jared he another question I got a lot what happens to the leftovers only child 86 that's a two-part question there Oreo only child 86 uh the leftover cookies that like when I you see them on the plate there at the end of the episode they get piled up I think I have a b-roll of it right now yes I do uh you see they just get piled up and left there to die they just sit there and then they get thrown away like that the leftover Oreos that I have in the Box they get picked through my my crew goes through and makes goodie bags for themselves and their loved ones where they just find the Oreos they want to use the most they take them then put them into their little goodby I take them home and then the super then from there I keep the ones I like the most and then from there I take the Oreos to work and let everyone I toss them on the floor and tell no one to tweet about what flavors they're eating so as not to",
      "start": 228.56
    },
    {
      "text": "there I keep the ones I like the most and then from there I take the Oreos to work and let everyone I toss them on the floor and tell no one to tweet about what flavors they're eating so as not to ruin the shows that are coming up and people steal them right there so that's good stuff. Uh, Greg you never tell us what kind of milk you use. I cannot pronounce your username but it's on the screen so whatever. Uh, 2% milk, regular old fat milk. I don't care. I got nothing to lose, right? I mean I'm eating Oreos. I think the least of my concern is what I'm dunking in. Some have said that the milks would make them taste different, you know, the in the patented milk test there, the milk pairing part of the show. I don't think we have to worry about that and I don't think you should worry about it either. And then the most asked question at Oreo Oration, who writes the sidebar? I give it to Bazooka here. As I said everyone asked this question though. Uh,",
      "start": 272.32
    },
    {
      "text": "the most asked question at Oreo Oration, who writes the sidebar? I give it to Bazooka here. As I said everyone asked this question though. Uh, the answer is I will never tell you who writes the sidebar. Uh, you all like to guess a lot. It's one of those things when I made Oreo Oration, when I started this show, I didn't think that would be the running question that everyone would want to know is who is making the sidebar and it's mocking me all the time, who is writing that those comments? I didn't think that would come up and so it's interesting now that it's become such a hot debate. I will maybe on the final Oration, maybe when I, that's the thing, you never know when the final Oreo Oration is going to come around, right? Oreo is always going to put out some crazy Oreo eventually so I never want to just say this is the end of it but when we get to a point where I feel like we've done God's work and we're done, maybe I will tell you but until then I'd like you to just keep guessing and I mean a",
      "start": 308.0
    },
    {
      "text": "just say this is the end of it but when we get to a point where I feel like we've done God's work and we're done, maybe I will tell you but until then I'd like you to just keep guessing and I mean a lot of people have guessed the right one so I don't think there's much controversy if you're smart you can usually figure it out br br um those are the questions I get a lot about Oration again thank you so much for watching means the world to me uh but mainly to a lot of you thank you so much for being part of the conversation if that makes sense I I know I'm dipping into conversation with Colin rhetoric but you know the comments I I don't get a chance to talk to you as much in the comments because obviously I have a day job keeps me from being in the comments as much as I want to be but then at the end of the day I get to talk to there I talked to you on Twitter GameOverGreggy and then of course video responses these are video reviews you can do like this isn't hard obviously right I'm",
      "start": 350.52
    },
    {
      "text": "at the end of the day I get to talk to there I talked to you on Twitter GameOverGreggy and then of course video responses these are video reviews you can do like this isn't hard obviously right I'm just I mean I have fancy cameras you can just use an iPhone you can just use whatever you whatever you can get your hands on your webcam make a little video response you put it there you send it to me I approve it it goes right up in the thing you're a YouTube Star along with me we we're having a conversation about cookies which is fantastic we've had a bunch of good ones so far I thought I'd leave you with some of my favorite moments from them I'll put a giant box around it so feel free to click on them to go see the entire video at that time um until then keep on dunking okay Maxine you've tried the berry blast Oreos can you give a review on [Music] them wa that's so sweet I'm going to be honest I've never had a dessert as good as this delicious delicious and is that's that's Berry that",
      "start": 387.6
    },
    {
      "text": "the berry blast Oreos can you give a review on [Music] them wa that's so sweet I'm going to be honest I've never had a dessert as good as this delicious delicious and is that's that's Berry that is a berry blast of some wo W it's just this weird they've tried to incorporate this weird frosting with with these they're not even good tasting sprinkles to be honest I don't know going be hundreds and thousand the milk pairing now you got saturated three dunks it's all about the saturation so saturation is you're so ew it's your hand the Elise you got serious problems going to edit that out look at my pinky oh my god look how weird my pinky is when it goes out oh my God BR so fancy only I knew how to feel about this Greg reviews Oreos and he's really intense about it and I thought wow I can do that welcome to Oreo mation on this show I review the Oreos that Greg Miller fails to review also I'd like to raise you a Nabisco cam y'all like my nails I feel like they're really festive like this",
      "start": 426.72
    },
    {
      "text": "that welcome to Oreo m ation on this show I review the Oreos that Greg Miller fails to review also I'd like to raise you a Nabisco cam y'all like my nails I feel like they're really festive like this Oreo but then we have the accent nail which says I'm here to party next the [Music] bouquet yep Greg if you happen to be watching this video I would like you to review Oreo blizzard cream cookies in his review Greg awarded these distinguished cookies a 4.5 out of a Poss possible 10 I consider this to be his most egregiously low score since Uncharted three seriously a 4.5 for these now I don't have any milk I don't know why my parents apparently don't really like milk I feel like this packaging is quite phallic this looks like a candy cane penis with Oreo ball Greg was right this is a fantastic cookie it explodes in your mouth this is a lot of flavor this this is like too much if it was Flavor country this is like the Soviet Union a final review of original [Music] Oreos 10 out of 10 can you",
      "start": 501.92
    },
    {
      "text": "it explodes in your mouth this is a lot of flavor this this is like too much if it was Flavor country this is like the Soviet Union a final review of original [Music] Oreos 10 out of 10 can you give a review can you rate it on the IGN scale uh right teeth look good nothing teeth ate a piece of pizza to cleanse the palette over s over a little bit to your right right okay we're ready are ready what's up everybody what's up everybody Welcome to an or",
      "start": 566.44
    }
  ]
}
