{
    "id": 53,
    "video_id": "fFqSoc2y29g",
    "show_name": "A Conversation With Colin",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "Portillo the Wiener Dog: A Conversation with Colin",
    "description": "Portillo the Wiener Dog is the cutest thing on this planet. What does Colin think of him? Well...\n\nToday's topic was submitted by @JohnPMcGrath. Leave your suggestions for future conversations in the comments below.\n\nSUBSCRIBE/LIKE/SHARE\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Tim for filming.",
    "published_at": 1360072814,
    "duration": 537,
    "transcript_chunks": [
        {
            "text": "he's like a mentally disabled like half blind wiener dog. What's up everybody, welcome to A Conversation With Colin. I'm Greg and this is my roommate Colin. Sometimes Colin says crazy stuff, so every Tuesday and Thursday I reach into the random topic pile, pick one, throw it at him, we talk it out for your enjoyment. If you like that, like the video, subscribe to us on YouTube, then leave your suggestion for future topics in the comments below. Colin, are you ready? Yes. Today's topic of conversation is Portillo the dog, submitted by @John P McGrath. This of course is Portillo the dog, here he is. What do you ever say about babies on my kitchen table? All of that. Well I love that people know you don't care about germs. You got bigger depending on the order that you put these up in. Yes. Yeah, well make sure I do that right now. Umm, net Portillo , he's a dog. Yeah, he lives, most adorable dog you ever met. Yeah, he's very cute with a cookie. He's, he's a lot of things that he's a lot of extremes. Portillo is very, very",
            "start": 0.06
        },
        {
            "text": "that right now. Umm, net Portillo, he's a dog. Yeah, he lives, most adorable dog you ever met. Yeah, he's very cute with a cookie. He's, he's a lot of things that he's a lot of extremes. Portillo is very, very cute. Yeah, he's very profoundly stupid, okay. Umm, useless really, doesn't serve a purpose at all. I'm like, I'm not arguing stupidity of Portillo, clearly he has problems. I'm sure he will bark throughout this entire episode. Why is there's no purpose? That's every dog unless you're seeing eye dog on a guard dog. No, no, no, we're not be, I'm not trying to be literal where like the dog is doing cooking your **** dinner. Can we train him anything to do it anyway? They can't train him to do anything. So a little guy , little man, uh, no. So Portillo, so like I've lived with dogs, you know, they're like companions, you, you know, you have a good time with them, you know, they listen to you, they're like a party or family. Like this, he's like you're, you're supremely touched cousin but that like you can't get rid of it just lives",
            "start": 43.8
        },
        {
            "text": "you have a good time with them, you know, they listen to you, they're like a party or family. Like this, he's like you're, you're supremely touched cousin but that like you can't get rid of it just lives in your house. Are you sure? Portillo for me, he's my little Rob, but he's my son. He's always there. He's her son. Yeah, he's, he's, I always describe Port illo as my constant. Mmm, lost. You remember this used to watch Lost up through the constant part is that you know, as radical as my life may shift whether I'm living in Missouri or if I'm a married or I'm divorced or I'm living with you or I'm over here, Portillo is always the one constant. He's always there, you know. I mean like it's the other thing, people always ask me how you can deal with like people mean media on the internet, the same mean thing is he on Twitter, it's whatever. It's like you don't get caught up in because I might win it. Like when I'm stressed out at work even right, the one thing no matter what, like the one thing I have to do is",
            "start": 91.77
        },
        {
            "text": "he on Twitter, it's whatever. It's like you don't get caught up in because I might win it. Like when I'm stressed out at work even right, the one thing no matter what, like the one thing I have to do is get home and walk the dog or take care go. That's my one responsibility really, you know. I mean like the one thing I have to have to do. Yeah, Polly serves a purpose for me. He might be your the, you know, your **** cousin her ever, he's something. Uh, yeah, no, Portillo is fiving part. Like I, I'm final Portello. I like making fun of him cuz he is like all the dogs I've ever met and lived with his, I did live with a dog particular in college, I was awesome. He is the stupidest animal I've ever met. But and it's funny because we have we have an example with Chloe the cat living here. Chloe is like a **** infinitely smarter than Portillo and you could just tell like like just a much smarter animal than Portillo is like much more you know keenly aware of things and and yeah, what are you basing that Allie? I've",
            "start": 131.89
        },
        {
            "text": "smarter than Portillo and you could just tell like like just a much smarter animal than Portillo is like much more you know keenly aware of things and and yeah, what are you basing that Allie? I've seen her open the door to the unearthing that's great and I hear scratch for 45 minutes on a door that she goes inside shits on top of litter box and bounces is usually not like leagues ahead look she's like writing a book right she's just the cat but but no I mean it's just we have this these two examples of these two animals on that one is one knows like what to do like Chloe like knows how to get what she wants right and or because she's learned things over time that like this is acceptable this is how she is she she said she doesn't make a proxy Meow's every once in a while but she she just hangs out she is like a net neutral on this house yeah you know Portillo will not shut up he's FFN the house if but he doesn't learn anything see this is the thing he's not learning anything how many",
            "start": 172.6
        },
        {
            "text": "hangs out she is like a net neutral on this house yeah you know Portillo will not shut up he's FFN the house if but he doesn't learn anything see this is the thing he's not learning anything how many times you have to tell him to not bark to like go to bed go to bed Portola he was good but uh that's like that the but we should take a video when they me tell him to go to bed and watch him a little sad saunter down there d udu is late Incredible Hulk as he walks down the road good uh but he he just like he doesn't learn it's like it's like Groundhog's Day with Portillo it's like okay eat your food like actually eat it out of the bowl don't like take it out of the bowl put it on the ground and wait but every day this happens it's like don't bark Portillo nothing's happening I'm signing out the bark every time someone comes to deliver a piece which like four times a day at this house he's barking you know he's barking because you have the laundry dropped up like five the morning for some",
            "start": 215.77
        },
        {
            "text": "bark every time someone comes to deliver a piece which like four times a day at this house he's barking you know he's barking because you have the laundry dropped up like five the morning for some reason he's barking at that point he's barking when he hears a horn right honking right it's like a non-stop alarm here's here's where I'll throw the my challenge flag I'll give you that yes I wish I could train him to understand that no one is here and hurt us that yes you've barking to scare people away or whatever to you know yes clearly he's almost eight years old this year you know I mean like he's aware acutely aware that he's never been no burglars ever broke into the house and tried to kill us that's fine but you're talking about like how Chloe knows how to get which Portillo knows how to get what he wants I mean he knows his stand on my chest if he wants to go outside he the way he eats food is because he knows he gets rewarded for that he gets told good boy when he hit the window so",
            "start": 257.59
        },
        {
            "text": "get what he wants I mean he knows his stand on my chest if he wants to go outside he the way he eats food is because he knows he gets rewarded for that he gets told good boy when he hit the window so Tommy's bad but I like it I Sportello bad see he doesn't like waste all these bad you don't like specially knows he's gonna do anything that's why doesn't listen to you at all anymore he knows he's just full of **** he doesn't listen to me real any more now that I just talked to like Tommy's bad all the time uh no he's fine he means why he's a good dog we're tell is a good dog he's a nice dog he's a nice dog which is cool like you know he's but like why why though why was it yeah like the good news is that you said he's eight years old so we were getting to the point now wherever that's right every seven this summer it's already kids I hope he's eight because then we're getting all closer to him being gone and then we can go with a joke I would say right is that even oh it's too late to",
            "start": 295.48
        },
        {
            "text": "every seven this summer it's already kids I hope he's eight because then we're getting all closer to him being gone and then we can go with a joke I would say right is that even oh it's too late to fix him like it's still whatever I he barks all-time that sucks I'll let him just live out his life now how he wants and then the next wiener dog that's the one I'll learn from my mistakes and not have him run to me to eat food and do all these other things all these I like she that's something my Portola everything he does is weird and not right like as unique everything he does is unique he's got character hmm you know like we walk about we walk him on the street you know I I told you basically refused to walk your dog anymore because I accept no problem doing it but like we had a conversation so he'll like I told you I'm like I'm not gonna be responsible for what happens to your dog outside you know because he like you walked by another dog like a huge dog and he like goes at it like",
            "start": 335.08
        },
        {
            "text": "so he'll like I told you I'm like I'm not gonna be responsible for what happens to your dog outside you know because he like you walked by another dog like a huge dog and he like goes at it like he's gonna get I'm like you were just gonna be destroyed by a dog that's not every dog that he does this to is actually trained and who knows that to like know it does that's what I go back at him but like he will just be snapped in half by one of these dogs am i exactly my fault anymore like that happened so never blame you for that I'm well aware of his or barking at people and all these things it's like do it like that's why I told you I think the funniest thing here barks at people at night cause he's bad eyes so he doesn't know what that was happiest barrel hisses everything about him is just not right he's like a mentally disabled like half blind wiener dog okay those are just books I won't i won't arguments he doesn't he's not a bad doggy means well he's fine but like and I love him",
            "start": 369.01
        },
        {
            "text": "not right he's like a mentally disabled like half blind wiener dog okay those are just books I won't I won't arguments he doesn't he's not a bad doggy means well he's fine but like and I love him yeah I know if something were tragically happen to you I would take care of your dog thank you for you thank you but I would also bring him to you know Cesar Millan and have them and have them trained up because you know that's the way it's got to be wolf it will sense these are this video and see if we can get him in here to figure out how to make a do it but I'm often told you that I think the funniest cuz you TV is barking because you think something Bad's gonna happen and like he laughs be able to do anything but he won't be **** punt ed through the uprights but like but like it's like a a an intruder why they come into this house I don't think Portillo's gonna sneeze do it anything but he doesn't realize that but I always thought would be the funniest thing I told you so like wear a ski",
            "start": 402.75
        },
        {
            "text": "intruder why they come into this house I don't think Portillo's gonna sneeze do it anything but he doesn't realize that but I always thought would be the funniest thing I told you so like wear a ski mask like all by who do you still be able to smell me which probably won't work and you just bust into this house just bust into this house and **** attack you and see like what he does like what is he got you totally got ya ever did that yeah he would know so like I want like wear gloves I just all black black ski mask seems like a good YouTube episode or something and just cut just **** kick the door down and just see what happens yeah that would be and I won't see what Portillo was really made of yeah he he'd go after he he'd give his life for us he would I mean because he's clearly going to die if anyone try to screw this yeah well that's what you think a particular dog yeah thank you for your question John P McGrath it was a good one if you have a topic of conversation you want to",
            "start": 441.63
        },
        {
            "text": "to die if anyone try to screw this yeah well that's what you think a particular dog yeah thank you for your question John P McGrath it was a good one if you have a topic of conversation you want to see Collin address here on the show please leave it in the comments below or tweet it at us until then like the video share it with your friends so everybody can see how Collin is and then subscribe to the channel we'll be back every Tuesday and Thursday until then have a conversational day so like most cats like a rare you know they figured out very early there's my digs a little bit cats but like she just shits run top of the litter and then dispenses the best like whatever you say is damn you just look up poor you bad words don't mean anything you anywhere for me today no just no he's just tearing me down anything",
            "start": 480.42
        }
    ]
}