{
    "id": 66,
    "video_id": "v4L6j2Brtxk",
    "show_name": "A Conversation With Colin",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "Adam Sandler Doesn't Suck: A Conversation with Colin",
    "description": "Have you turned your back on Adam Sandler? Colin hasn't; let him explain why.\n\nToday's topic was submitted by Josh8272. Leave your suggestions for future conversations in the comments below.\n\nSUBSCRIBE/LIKE/SHARE\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Tim for filming.",
    "published_at": 1361887212,
    "duration": 388,
    "transcript_chunks": [
        {
            "text": "Grand ma's Boy is like the quintessential stupid **** movie and it's so so good. What's up everybody? Welcome to A Conversation With Colin. I'm Greg and this is my roommate Colin. Now sometimes Colin says crazy stuff. So every Tuesday and Thursday we sit them down grab a random topic out of the conversation pop throw it at them and discuss it for your amusement. If you like that like this video subscribe to us on YouTube and then tell your friends so they come watch and they share conversations they'd like to see. Colin are you ready? Yes. Today's topic of conversation is Adam Sandler. This is from Josh 827. Thank you for your submission. Adam Sandler. What the **** happened to him? I love Adam Sandler. I I used to He used to be awesome. He's still awesome. No whatever. Jack and Jill and all these other He I haven't seen a lot of these newer movies. Of course cuz they are awful. They are terrible looking. We know from the trailer they are bad and we don't have to. That's my",
            "start": 0.08
        },
        {
            "text": "jail and all these other He I haven't seen a lot of these newer movies. Of course cuz they are awful. They are terrible looking. We know from the trailer they are bad and we don't have to. That's my boy looked pretty good. I got to be honest with you. That's my boy looked pretty good. Why didn't we ever watch it then? Cuz you didn't want to watch it. You watched some terrible Don't you remember that night you watch your friends were here? wanted to watch some terrible **** musical. I'm not making that up. We watched Rock Rock of Ages. Yeah you I was like \"Let's watch Let's watch That's My Boy.\" At least one funny clip in there from the from the trailer. You were like \"No let's watch.\" I was Rock of **** Ages. I think there was a vote to be had. I was like \"All right I'm out.\" With my scepter decreeing what we were going to watch. Yeah. Adam Sandler was awesome. One of the funny one of the funny we were listening the other day to what the hell happened to me and it was",
            "start": 43.68
        },
        {
            "text": "With my scepter decreeing what we were going to watch. Yeah. Adam Sandler was awesome. One of the funny one of the funny we were listening the other day to what the hell happened to me and it was awesome and I remember that and the goat and everything else and I wanted to lick him old man balls and but I I had forgotten that Adam Sandler in a way you know what I mean cuz now you see him and he's just this fat guy doing bad movies all the time. Yeah. I mean that happens. I mean I think a similar trajectory was taken by Jim Carrey even where like you know Jim Carrey was like the man and then around the same time and then and then around the same time they had fallen off. But I think Adam Sandler is like just a funny dude. What I like about Adam Sandler the most is that he has this group of guys that are just his friends that are like in every one of his movies they are writing these movies together and creating these these ideas together and I think that's really cool. They're even in",
            "start": 73.52
        },
        {
            "text": "guys that are just his friends that are like in every one of his movies they are writing these movies together and creating these these ideas together and I think that's really cool. They're even in his old records from his Saturday Night Live days. Um and I I don't know. I I think you know obviously Billy Madison and Happy Gilmore are like the two the two movies everyone looks at. Um that and I think those are great movies too. I also think Big Daddy is like really really funny. I think Mr. Deeds is like really really funny. Um so I don't think it's it's like just relegated to this mid 90s era Billy Madison Happy Gilmore kind of thing. I think that like it kind of stretches a little further than people would like to admit but he's a dude where even that movie about the firemen right? I Now Pronounce You Chuck and Larry. I like that movie as well. Yeah. Wow. Oh that movie was funny. Okay. There was like funny stuff in that movie because they're dumb. They're they're not I here's",
            "start": 107.28
        },
        {
            "text": "I Now Pronounce You Chuck and Larry. I like that movie as well. Yeah. Wow. Oh that movie was funny. Okay. There was like funny stuff in that movie because they're dumb. They're they're not I here's maybe is this maybe you think more akin to everybody loved Billy Madison and Happy Gilmore and then you think the people who loved those movies started to grow up maybe and like he kept making those kind of movies and maybe we just look at Mr. Deeds or a Chuck and Larry and we're like that looks like garbage and it's really as garbagey as Billy Madison would have been. Yeah perhaps. I mean I haven't watched Billy Madison in a while. I watch Happy Gilmore. I think Happy Gilmore is a better movie um every so often when it's on TV or whatever. Um I don't know. I I think that what I like about his movies is that they all have the same tone. Like it's stupid. It's just stupid. Like all the movie like it's not like trying to be high brow comedy. It's not like trying to tell you a serious story",
            "start": 143.2
        },
        {
            "text": "movies is that they all have the same tone. Like it's stupid. It's just stupid. Like all the movie like it's not like trying to be high brow comedy. It's not like trying to tell you a serious story with the exception of like there's like a series like Click I guess was serious right? In some other movies. No Click was not serious. Wasn't Wasn't that the serious movie he made? No. No. You're Drunk Love. Okay. That's the one. Click is Christopher Walkin and them fast forwarding through sex and **** Okay. No I knew it was after I knew it was after Mr. would before Chuck and Larry. He made that real serious movie click. Yeah. Okay. I was wrong about that. I know. It's funny. I didn't see any of those movies. Um and I only saw the Chuck and Larry movies. It was on TV so I probably It's got firefighters in it like your dad. Yeah exactly. Uh but not not his dad wasn't in the movie. Dad explain it to them. I know. You know. Oh okay. You're well aware your dad wasn't in Chuck and",
            "start": 180.8
        },
        {
            "text": "got firefighters in it like your dad. Yeah exactly. Uh but not not his dad wasn't in the movie. Dad explain it to them. I know. You know. Oh okay. You're well aware your dad wasn't in Chuck and Larry. I just think so. I think that it's like a unique kind of comedy that a lot of people you know don't necessarily do like that. Like a lot of comedy has a cadence. a lot of comedy has a meaning or a purpose. Like I think that their movies are just dumb. I mean think about a movie that he wasn't in but that he had something to do with in terms of his production company and the people that created like Grandma's Boy. Like Grandma's Boy is like the quintessential stupid **** movie. And it's so so good. Um and that's the kind of that's like that's that kind of humor I think personified for me. And and I I think Adam Sandler's awesome. Um I think he's always going to be awesome. I don't care like how many movies he does at a bomb or are different or whatever. he's always going to be",
            "start": 217.44
        },
        {
            "text": "me. And and I I think Adam Sandler's awesome. Um I think he's always going to be awesome. I don't care like how many movies he does at a bomb or are different or whatever. he's always going to be that same goofy ass dude um that plays like basically the same character um and is just dumb and funny . Um and maybe it's because we were we were young and in our formidable years he was like our dude um and maybe people don't relate to him like they used to. But I would love to see him come out with something that was like huge that people really loved again. Yeah that'd be awesome . But I don't know. I don't think I think like Jim Carrey I don't think he gives two shits. Well it's it all goes back to you know we're always talking about how we are ready to sell out at the drop of a hat. And do you think that he's like is that what we're kind of damning him for? You know if somebody kept coming to us like you make Conversation With Colin movies and like all right yeah we just did that.",
            "start": 256.24
        },
        {
            "text": "you think that he's like is that what we're kind of damning him for? You know if somebody kept coming to us like you make Conversation With Colin movies and like all right yeah we just did that. Yeah. I mean more power to I mean he's getting paid. We will sell out. You know he's getting paid. Like I'm not going to blame anyone for being like you know when what's a good example? Like when um uh wasn't there like a Deuce Bigalow sequel and everyone was like uh I think I think it was like a prequel right? Or like but there was another one. Like why are you doing another one of these? It's like what the **** do you think they're doing it for? Money maybe. Like it's easy to judge you know from our our three-bedroom apartment in San Francisco what people are doing for money. But the fact of the matter is like people do things for money because there's a market for them and they want to get paid. And I don't blame those people because I want to get paid. So you know good for",
            "start": 293.44
        },
        {
            "text": "fact of the matter is like people do things for money because there's a market for them and they want to get paid. And I don't blame those people because I want to get paid. So you know good for them good on Adam Sailor good for Jim Carrey good for all these guys that we think you know fell off or suck or whatever. Like they're laughing all the way to the bank. They make more money than anyone uh you know that make makes fun of them is making. So who really has the last laugh in that situation? There you go. Good topic. Josh 827. Someone in the future suggest Mike Myers because I'd like to know what happened to him. I haven't Wikipedia him in a long time. It's another one of the same things probably. Yeah probably. Uh ladies and gentlemen if you want to be part of the conversation leave your topic suggestion in the comments below then like the video subscribe to us share us with your friends so they can be part of the conversation. Colin thank you for your time.",
            "start": 327.68
        },
        {
            "text": "leave your topic suggestion in the comments below then like the video subscribe to us share us with your friends so they can be part of the conversation. Colin thank you for your time. Thank you. Ladies and gentlemen have a conversational day. And how he seems to just be there all the time. Yeah. and he lives next door to the Matthews family and he teaches them middle school and then he teaches them in high school and then they go to college and **** voila there's Mr. Feeny.",
            "start": 359.76
        }
    ]
}