{
    "id": 64,
    "video_id": "VPNUia9gSGE",
    "show_name": "Oreo Oration",
    "hosts": [
        "Greg Miller"
    ],
    "title": "Mega Stuf Oreo Cookie Review: Oreo Oration",
    "description": "OREO HAS GONE MAD! Meet the fattest cookie ever -- Mega Stuf Oreo.\n\nSUBSCRIBE / LIKE / SHARE\n\nWhile you were living your life, Nabisco went crazy and made an army of Oreo cookies. Every Wednesday and Friday, Greg Miller tears open a new package and reviews a new version of Milk's Favorite Cookie. \n\nSubscribe so you don't miss a review. \n\nLeave your review of today's cookie as a video response.\n\nLet us know what Oreo we should review next in the comments.\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy\n\nLike Greg on Facebook: http://facebook.com/gameovergreggy\n\nCheck out the Oreo Oration FAQ: http://www.youtube.com/watch?v=aO6zw2LeJ3c&list=PLOlEpGVXWUVseSo6bQHB1ad2cN_qV3aXs&index=1\n\nOur theme is \"Game-A-Tron\" off of Daemon Hatfield's album Colorbeam. Buy it on iTunes: https://itunes.apple.com/us/album/colorbeam/id426986325\n\nThanks to Nick and Tim for filming.\n\nMega-Thanks to Matt Gravish for making the Oreo Oration logo and intro.",
    "published_at": 1361368864,
    "duration": 398,
    "transcript_chunks": [
        {
            "text": "[ Music] what's up everybody? Welcome to Oreo Oration. I'm Greg Miller, and while you were out there buying fancy teas, you think look so goddamn cute, the fine people at Oreo are making endless variation of Milk's Favorite Cookie. So every Wednesday and Friday, I tear open a new package and give you a tasty review without any calories. If you like that, like this video, subscribe to my channel, and share it with your friends, please. Uh, today we are reviewing Oreo Mega Stuf, Mega Stuf Oreos. Uh, they're limited edition, apparently. They're marked with the cookie cream Super Bowl ad campaign. I'm sure you all saw with The Whis pers and stuff. I've always preferred the cream part of an Oreo. That's crazy. The cookie is the best part. Cream, cookie, cream. And I'll tell you right now, you Oreo Oration, the fan base is small, but it is vocal. It is incredibly vocal. And all the tweets I got about Mega Stuf Oreos, thank you very much. That is the kind. I love that there's just like, in case of new Oreo, break glass, Greg.",
            "start": 0.58
        },
        {
            "text": "is small, but it is vocal. It is incredibly vocal. And all the tweets I got about Mega Stuf Oreos, thank you very much. That is the kind. I love that there's just like, in case of new Oreo, break glass, Greg. Siren that everyone hit when they saw this in the stores means a lot to me. Uh, Mega Stuf, I don't know much about it, and it doesn't say anything here on the back about what I'm getting. So we're going to jump in. We're going to have to do some tests to figure out how much cream we're getting out of this, but basically it's bigger than a Double Stuf is all we know. Uh, every Oreo Oration begins with the patented First Look. Oh, nice. Look at how well they laid out like that. They look all good. They're in the hard plastic shell casing. I like that a lot. They got tough sides. They they re they basically, uh, I can't think of the word I'm trying to say. They restructured the box to make it stronger, reinforced. I went to college, believe it or not, reinforced the box to make it stronger. Uh, first look , they are looking",
            "start": 51.12
        },
        {
            "text": "think of the word I'm trying to say. They restructured the box to make it stronger, reinforced. I went to college, believe it or not, reinforced the box to make it stronger. Uh, first look, they are looking good, and holy crap, that is a lot of cream. I'm going to pull one out here for a first look to continue. There it is. It yeah, jeez, geez Louise. All right, let's break out. So this is the Mega Stuf in my left hand here. Now I'm going to go to my right hand, and this is a broke just a broke down Double Stuf that we made. All right, I'm sorry, this is quadruple stuff. I take it back. I take it back. This is a Double Stuf then. So it's not so this is the Mega Stuf, not a quadruple stuff Oreo. All right , now let me reach over here, get me one of these. So now this is just a regular Double Stuf Oreo. It's a little off center. You can see it's bigger than a Double Stuf, but it's not a quadruple stuff. So we're probably getting TR stuff, getting an old TR stuff, a three way. There it is. Make a stuff. Let's jump right to",
            "start": 94.52
        },
        {
            "text": "Center. You can see it's bigger than a Double Stuf, but it's not a quadruple stuff. So we're probably getting TR stuff, getting an old TR stuff, a three way . There it is. Make a stuff. Let's jump right to taste. I mean, it's a she of cream in my mouth right now. It's good though. Mhm. Okay. I'm right sign off in it being very good. Um, the the cream much more pronounced than just a regular Double Stuffed Oreo. Um, but as I'm always talking about in this show, you got the cookie textures there. It's all there. So you're getting the normal Oreo cookie snappiness. You're getting the normal Oreo cookie taste, but then the cream just just washes over you. It's there's a lot of cream going on here. It's like the end of Ghostbusters, but in my mouth. Remember because of marshmallow? Okay, it's good. It's good. I like it. Definitely a different taste for an Oreo, but it is delicious. Let's see how it pairs with milk. One, two, three. It's sloppy, sloppy, and creamy. Yeah, yeah, I can see kicking back with these tough day at the office.",
            "start": 143.16
        },
        {
            "text": "a different taste for an Oreo, but it is delicious. Let's see how it pairs with milk. One, two, three . It's sloppy, sloppy, and creamy. Yeah, yeah, I can see kicking back with these tough day at the office. Let it all wash away. Let's see how they twist here. Here we go. Perfect. I can't imagine these things having in trouble. Now here we we're about to go six P none the richer with this. Come on. There you go. And then what happens when you put two tries together? Jeez Louise, that is a lot of cream. Wow. Oreo just not afraid. Say whatever you want about us, this is what we're going to do. They're like, I can respect that. Final score, I mean, they're they're they're 9.0. They're great. They're amazing. I mean, they're definitely amazing, right? These are like you can find them in a sideshow freak show. What the hell's going on? Uh, it's one of those things, you know, people do like Oreos for a certain reason, right? You like that taste, that consistency, the chocolate, the cream mixing together. This is a whole new ball game. This is",
            "start": 226.96
        },
        {
            "text": "uh, it's one of those things, you know, people do like Oreos for a certain reason, right? You like that taste, that consistency, the chocolate, the cream mixing together. This is a whole new ball game. This is all cream and then just a hint of chocolate, which might not work for some cookies. I I know I've I've I've knocked some cookies here on the show for similar things, but it works here. The cream very pronounced, but not super sweet like when we get into some of those flavored creams, you know, like we've worked with before. That's when it gets to be a little bit, okay, this is this is way too much. But here it's that classic cream and it's creamier than I think the normal Oreo cream you get even in a Double Stuf. That's the way the cookie crumbles for Mega Stuf Oreos. But what do you think? Leave a video response below. Just grab your iPhone, film yourself talking about him, eat one, do all the do all the steps, do some twisting, do some milk. Let me know if I if I'm wrong or if I'm right on the track. Uh,",
            "start": 310.76
        },
        {
            "text": "response below. Just grab your iPhone, film yourself talking about him, eat one, do all the do all the steps, do some twisting, do some milk. Let me know if I if I'm wrong or if I'm right on the track. Uh, but then also I'd like you to like this video , subscribe to my channel, share it with your friends so everyone knows there are some idiot on the internet reviewing every Oreo available in the United States. Um, then let me know what cookies I am missing. I'm sure I'm missing a few over here, right? Just in the comments below, tell me the cookie name, where you're from, where I can get them, and then check back every Wednesday and Friday for a brand new review. Until then, keep on dunking.",
            "start": 349.68
        }
    ]
}