{
    "id": 65,
    "video_id": "WZqI0fUK33s",
    "show_name": "A Conversation With Colin",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "The Sandwich: Best Food Ever? A Conversation with Colin",
    "description": "Is the sandwich the best food of all time? One viewer asks, Colin answers! \n\nToday's topic was submitted by Daximunlove. Leave your suggestions for future conversations in the comments below.\n\nSUBSCRIBE/LIKE/SHARE\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Tim for filming.",
    "published_at": 1361455236,
    "duration": 439,
    "transcript_chunks": [
        {
            "text": "they the the cold cuts are pre-cut, who the **** buys pre-cut cold cuts? First of all, that's horrifying, that's weird. And then they cut them like a, like so thick, like these thick slabs of like turkey. It's like, who wants to eat it like that? What's up everybody? Welcome to A Conversation With Colin. I'm Greg and this is my roommate, Colin. Now sometimes Colin says crazy stuff. So every Tuesday and Thursday, I reach into my random topic pile, pull one out, read it aloud. Colin and I talk about it. You have a great time on the other side of the screen. If you like the idea of this show, like the video , subscribe to us on YouTube, share us with your friends. Colin, are you ready? Yes. Topic of conversation is the sandwich, Colin, the best food of all time? Question mark. This was submitted by Daximunlove . Weird names. Is the sandwich the best food of all time? No, I mean, it depends on how you define the sandwich because I think, I think, you know, the sandwich obviously is two pieces of bread with meat in between.",
            "start": 0.12
        },
        {
            "text": "names is the sandwich the best food of all time? No, I mean , it depends on how you define the sandwich because I think, I think, you know, the sandwich obviously is two pieces of bread with meat in between it. So if you were to count the cheeseburger as a sandwich, the cheeseburger, then the cheeseburger is the best food of all time. So the answer is no . Cheeseburger is the best food of all time. Yes. Wow. Yeah, that's a, it's pizza clearly is the answer. Oh, pizza's up there. Yeah, cuz it's so, it's so many different things too. That's the other thing you got to go with . You cheeseburgers be so many different things. Not really. Yeah, yeah. Oh yeah. You got different toppings. You got my, my cousin Carl used to come over to our house on Long Island. Let me tell you a story. I'm, I'm, I'm ready to go on the journey back on Long Island. This place I'm from, we would have barbecues cuz people like to be outside onl. Sure, it's beautiful. And um, you're out there, you hear the the fairies going by the fair, you got the Long",
            "start": 44.48
        },
        {
            "text": "on Long Island. This place I'm from, we would have barbecues cuz people like to be outside onl. Sure, it's beautiful. And um, you're out there, you hear the the fairies going by the fair, you got the Long Expressway, you talk about how he, you got the bab, uh , that's how we talk. Yeah, so my cousin Carl would come over and he would make these great cheeseburgers that were, um, that were like all spiced and stuff. So they were like meatballs basically and you would make patties, you just dab some of American cheese, put them on. So that's like one kind of cheeseburger, almost like a, almost like a, you can have like almost a meatloaf, like a thick, thick cheeseburger. Uh, you can have just a standard patty. You can, there's, and then you have the toppings. You can have mushrooms and sauteed onions, you have lettuce and tomato, you have avocado, different kinds of cheeses, you can put mayo on it, you can put ketchup on it. You never put mustard on the cheeseburger ever. That's, that's ****. Um, D for me, the perfect",
            "start": 79.76
        },
        {
            "text": "and tomato, you have avocado, different kinds of cheeses, you can put mayo on it, you can put ketchup on it. You never put mustard on the cheeseburger ever. That's, that's ****. Um, D for me, the perfect cheeseburger is the, you know, I like, I like Burger Joint here in San Francisco . I know what I'm getting into that. Like, you know, I always talk about have to be in a mood for a burger. I'm not just ready. I don't, I'm not one of these guys who just orders burgers from everywhere, but I like The Burger Joint cuz I know what I'm getting every time. I feel like it's a, it's a good standard Burg. But then what I do is I take the, I ask for extra pickles, no onions, put pickles on one side, ketchup and mustard dust on one side, patty on the other. And then you put the pickles back over here, ketchup and mustard and you put all together, maybe some a little bit of lettuce. I don't put all the lettuce on there that they do. It's tomato. I like the tomato too. Yeah, I mean, the perfect cheeseburger for me at a place like",
            "start": 126.04
        },
        {
            "text": "you put all together, maybe some a little bit of lettuce. I don't put all the lettuce on there that they do. It's tomato. I like the tomato too. Yeah, I mean, the perfect cheeseburger for me at a place like that is just the American cheese, mayonnaise, ketchup, and onion. Okay . And that's it. Yeah, yeah, yeah. Um, a good Bermuda onion man goes a long way on a cheeseburger. You got that, that kick on the cheeseburger. I'm going to give a shout out real quick to a great cheeseburger place in San Francisco, um, called Bulls Head that you and I have been to before. Portillo, don't even, he's given a shout out for it. Uh, and Bulls Head is at Yoa and West Portal in San Francisco, um, right off the L line maybe. Yeah, there's like a mun terminal there, much py. And uh, Portilla, Portilla, I'm linking to the Portilla conversation right now. And uh, so that's a great place if you guys want a great cheeseburger in San Francisco. Um, but uh, but otherwise, yeah, the sandwich is good, but see the thing about sandwiches in San Francisco is",
            "start": 158.56
        },
        {
            "text": "now and uh, so that's a great place if you guys want a great cheeseburger in San Francisco. Um, but uh, but otherwise, yeah, the sandwich is good, but see the thing about sandwiches in San Francisco is that they're not very good. And so we have to, we have to have, it's the same thing with bagels. Had we had these conversations exactly. You've mentioned before in New York, you go to any Deli, right? There's their Deli on the corner and they all make great sandwiches. There's, there's standouts, right ? Like IES, IES makes a really good sandwich, like that's their whole thing. They put the mozzarella sticks in. I mean, it's a crazy sandwiches. It's not the sandwich that I like kind of grew up knowing. L people like that kind of sandwich. Good. Darby Dan was really good out in South City. Uh, um, we have Jimmy John's now, which is pretty good, uh, up there Market. But to me, a sandwich has to have a, a very certain, a very specific thing. It has to have Boar's Head meat on it. Okay. Boar's Head meat is very rare here for some reason.",
            "start": 201.8
        },
        {
            "text": "which is pretty good, uh, up there Market. But to me, a sandwich has to have a, a very certain, a very specific thing. It has to have Boar's Head meat on it. Okay. Boar's Head meat is very rare here for some reason. And the thing that really bothers me when I go to Safeway for instance and try to get cold cuts is that they the cold cuts are pre-cut. Who the **** buys pre-cut cold cuts? First of all, that's horrifying, that's weird. And then they cut them like a, like so thick, like these thick slabs of like turkey. It's like, who wants to eat it like that? No, I, I totally, I mean, I, I grew up on, you know, like whatever, I don't, I, I don't remember ever going to a Deli and having it be like a big deal if it was slic or not slice. I don't remember that kind of stuff. So I'm not horrified by that. I understand wanting it thin. The fact that they do the dinner roast at Safeway turkey where they cut thick, it's like it's right off the breast of the turkey that I like and and then outside of that I can go either way.",
            "start": 236.76
        },
        {
            "text": "it thin. The fact that they do the dinner roast at Safeway turkey where they cut thick, it's like it's right off the breast of the turkey that I like and and then outside of that I can go either way. Andronico, you should go to Andronico's, get your meat that and I know it's a, I pay like $17 for a pound of tur we go. Yes, it's expensive when they cut it in front of you, you're getting the service you. Well, well, safe way I make them cut it, okay? And sometimes they, I'm like, I'm like, can I get a, you know, can I get a pound of yellow American? And they go to reach for the like the gross inch thick slabs of yellow American. I'm like, no, no, no, no, no, no. Sorry guy. And and one new guy because I deal with the same and they know like I think CU I'm, I'm sure not the only person from the east or from a place where we get cold cuts that are good to be like, we don't want cold cuts that have been sitting in this thing for that are cut disgustingly thick. We don't want that. Um, so I don't think I'm the only person that",
            "start": 277.84
        },
        {
            "text": "get cold cuts that are good to be like, we don't want cold cuts that have been sitting in this thing for that are cut disgustingly thick. We don't want that. Um, so I don't think I'm the only person that that does that. But one not too long ago, one new guy was like, uh, that I've never seen before. He's like, oh, this is this is the only we doing. I'm like, no, no, no, I don't think so. And he's like, I'm like, I'll talk to your manager. You can, you can cut the cheese and and he any and he he cut the cheese for. Did he giggle up the cut the cheese line? Yeah, of course. All right, you're pretty cool. Uh, and then I go to to Luca up there on 20th, yeah, uh, and get they have Boar's Head there. Um, and I get pepper turkey because Boar's Head pepper turkey with that orange Hue, man, that's the best. You put that on on a sandwich, lettuce, lots of mayonnaise, thinly sliced onion, just one thinly sliced piece of onion, American cheese on, let's say , I don't know, I can go for like just toasted white bread, I can go for Dutch crunch. I",
            "start": 316.04
        },
        {
            "text": "lettuce, lots of mayonnaise, thinly sliced onion, just one thinly sliced piece of onion, American cheese on, let's say, I don't know, I can go for like just toasted white bread, I can go for Dutch crunch. I mean, I it really depends on I don't like the bre the Dutch crunch is this new phenomenon which I enjoy, but sometimes way too hard. You get that like you feel like your teeth are pulling on like I don't want yeah, I understand that. I mean, ideally, um, you would get it, you know, straight out, you know, even a Kaiser roll that seems to be a rarity out here. Like I don't you're right and that that is a damn shame or an onion roll is another good another good uh a good thing to do. So is the sandwich A Fine Food, Greg? Yes, the sandwich is one of the great foods. Does it affect me because I have celiac disease and I'm not supposed to eat bread? Yes. Do I ignore the fact that I have celiac disease every day like a pro ? Um, am I going to regret it almost definitely and uh that's the end of that story. Yeah, all",
            "start": 350.0
        },
        {
            "text": "and I'm not supposed to eat bread? Yes. Do I ignore the fact that I have celiac disease every day like a pro? Um, am I going to regret it almost definitely and uh that's the end of that story. Yeah, all right, cool. So Daximunlove, no, sandwich not the greatest food, but it is a Fine Food. Uh, ladies and gentlemen, what do you think? What what's your favorite food? Let us know in the comments below. Then also suggest future topics of conversation until then like this video, subscribe, share it with your friends please cuz we are ready to sell out as soon as possible. I tell you what, Colin, thank you so much for your time. Thank you ladies and gentlemen, have a conversational day. What a, I'm going to be, I'm going to be honest with you, I like Olive Garden.",
            "start": 395.64
        }
    ]
}