{
    "id": 50,
    "video_id": "q8gRuttUEqA",
    "show_name": "Oreo Oration",
    "hosts": [
        "Greg Miller"
    ],
    "title": "Football Oreo Cookie Review: Oreo Oration",
    "description": "Just in time for the Super Bowl, it's the Football Oreo. Is it a star QB or a bench warmer? Find out in the Oreo Oration review!\n\nSUBSCRIBE / LIKE / SHARE\n\nWhile you were living your life, Nabisco went crazy and made an army of Oreo cookies. Every Wednesday and Friday, Greg Miller tears open a new package and reviews a new version of Milk's Favorite Cookie. \n\nSubscribe so you don't miss a review. \n\nLeave your review of today's cookie as a video response.\n\nLet us know what Oreo we should review next in the comments.\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy\n\nLike Greg on Facebook: http://facebook.com/gameovergreggy\n\nOur theme is \"Game-A-Tron\" off of Daemon Hatfield's album Colorbeam. Buy it on iTunes: https://itunes.apple.com/us/album/colorbeam/id426986325\n\nThanks to Nick and Tim for filming.\n\nMega-Thanks to Matt Gravish for making the Oreo Oration logo and intro.",
    "published_at": 1359554446,
    "duration": 292,
    "transcript_chunks": [
        {
            "text": "[ Music] what's up everybody, welcome to Oreo Oration. I'm Greg Miller, and while you weren't calling your mother, let me tell you the fine people at Oreo were making endless variations to Milk's favorite cookie. So every Wednesday and Friday, I tear open a new package and give you a tasty review without any calories. If you like that, like this video, then subscribe to my channel. Today we're reviewing football Oreos. That's right, ladies and gentlemen, they actually made these. These are the official cookie of the NCAA. That's nice to know. I'm glad Penn State has a cookie. Um, here's the thing, they're obviously just traditional Oreos, but will that affect the taste? The fact there's a different cream, there's all sorts of stuff we're about to find out. As you know, every Oreo Oration begins with the patented first look. Oh, well these don't look that great. Like you got, you got they're lumpy here in the line. You got some brakes over here. You're not a fan of the brakes up here too. I don't know. Let's get a",
            "start": 0.55
        },
        {
            "text": "first look. Oh, well these don't look that great. Like you got, you got they're lumpy here in the line. You got some brakes over here. You're not a fan of the brakes up here too. I don't know. Let's get a smell. It's got the, it's got the Oreo smell. I mean, again, this is just the more your average Oreo is. That's what they want you to think. Let's pull it out, take a look. There you go. You got the one side there looks like that. Then we're going to flip it over here. What do we got? This lick the competition Oreo, huh? What do they think of next, putting little messages on Oreos? I tell you what, then back to football. Um, that's First Look. Obviously from a first look standpoint, these are adorable. Yeah, you're having a Super Bowl party, you're having an NCAA party, you're watching your Missouri Tigers over there, you know, your friends bring over pasta salad, somebody brings a case of beer, you're, you're like, hey guess what everybody, limited edition Nabisco treats made up to look like Oreos. Let's see how they taste.",
            "start": 44.44
        },
        {
            "text": "know your friends bring over pasta salad, somebody brings a case of beer, you're, you're like, hey guess what everybody, limited edition Nabisco treats made up to look like Oreos. Let's see how they taste. Mhm . Okay, there's, I know it's going to sound crazy, but I eat a lot of Oreos. The taste itself is off from just about a bit of a regular Oreo because it is a different texture on top, right? You're not getting that normal chocolate cookie taste. You're not getting the indentations, little designs. It's a flat cookie. It actually is changing the taste of this normal Oreo. Still really good though. I like the taste. I would definitely eat these again at every one of my football parties. Let's see how they pair with milk. Obviously the biggest part of an Oreos, they say there you go. We'll use our patented Oreo Oration three dunk technique. Give me one of these, one, two, three. Oh, interesting too. This one says touchdown. They say different things. They're not all the same presentation going up there. First look.",
            "start": 85.8
        },
        {
            "text": "oration three dunk technique. Give me one of these, one, two, three. Oh, interesting too. This one says touchdown. They say different things. They're not all the same presentation going up there. First look. Dynamite. Let's see here, chocolate cookies. We all know sucking in that moisture of the milk, keeping it there, being a bit soggier. I contend that they are a bit thicker just by a bit than your normal Oreo. So there's actually, there's still a little bit of stiffness in there when you bite down. Still delicious, still recommended. Let's get to twisting. This is going to be interesting. We got a weird thing here, twisting an Oreo, big part. Ah, see that's what you get split. You we're not getting the perfect circumference. We give, give it another test here. Oh, this one's got a guy throwing it. Well just adorable these cookies are. Oh my goodness, twist it again. See we get, ah, I got a good break. This is the first ever Oreo Oration going to best of three here. Game three, will it twist fine? No, split again, but pretty",
            "start": 138.68
        },
        {
            "text": "cookies are. Oh my goodness, twist it again. See we get, ah, I got a good break. This is the first ever Oreo Oration going to best of three here. Game three, will it twist fine? No, split again, but pretty good. I'm not going to deduct too many points. That's a pretty good split ratio for making your own uh double decker football cookie there. Not too bad. So now it's time to review. Let's go over. I mean, the tastes good, good taste, good milk, not great milk, but good milk uh absorption. Uh, I think the presentation of them saying different things are adorable. The fact that their little footballs is adorable. You're going to a football party, you clearly want them. These I, I, I'm my gut kneejerk reaction right is a 9.0. Another another amazing cookies, but I've given out a few nines to these these fudge cremes over the weeks here. Are they better than a fudge creme? They are better than a fudge crem. They more going for him. A lot of this is personality presentation. We're going to go 95 for football Oreos tying Berry",
            "start": 191.2
        },
        {
            "text": "weeks here. Are they better than a fudge creme? They are better than a fudge crem. They more going for him. A lot of this is personality presentation. We're going to go 95 for football Oreos tying Berry burst ice cream Oreos for the number one spot at Oreo Orentation. That's big news ladies and gentlemen. I want you to let that sink in, but more importantly, I want to know what you think of how the cookie crumbled for football Oreos. Please leave your video review as a video response to this video, then share it with your friends, subscribe to my YouTube channel. Here's the big question though, are there other Oreos out there I'm missing oror is Oreos, that's how I call them sometimes. Are there other Oreos out there that I'm missing? Let me know in the comments below so I can get them on the show. I'll be back every Wednesday and Friday until I run out of cookies to review, but until then keep on dunking [Music]",
            "start": 234.84
        }
    ]
}