{
    "id": 301,
    "video_id": "mv7fKhKjCag",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Should We Go To Space? - The GameOverGreggy Show Ep. 26 (Pt. 5)",
    "description": "Full Episode Friday! Get it EARLY here! http://gameovergreggy.bandcamp.com\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1402038001,
    "duration": 1812,
    "transcript_chunks": [
        {
            "text": "Colin at Theory's dog is sick of these vulgar topics and these topics about fictional things so I'm going to go back to my wheelhouse for a minute, because I haven't been there in a while. It's a dangerous place. I was watching Mad Men; I'm not going to spoil it for anyone, the last episode of Mad Men took place concurrent to the moon landing – spoilers and uh 1969 made it; the nuke didn't go off, no they made it there was no Soviet base on the Dark Side of the Moon either like we thought there was going to be. That was more fascinating; I didn't know that story. And so I was thinking about you know there were two interesting themes in that show that again are not spoilers but I'm sorry you know maybe you want to tune out if you're really worried about it one was like the wonder at that time in 1969 people everyone gathering around in the United States and around the world to watch Neil Armstrong and Company.",
            "start": 1.1
        },
        {
            "text": "Out if you're really worried about it, one was like the \"Wonder\" at that time in 1969 people Everyone gathering around in the United States and around the world to watch Neil Armstrong and Company, you know Buzz Aldrin go on the like walk on the moon. It's an extraordinary thing when you think about it. Yeah, cuz like to real quick to bring it up, I guess this is maybe what you're going to talk about too, but I it's something I always take for granted. I remember my mom explaining to me especially now in this day and age where you send Rovers and you're getting all this imagery back people didn't know what they were going to really find right that was the thing they didn't know what the surface of the Moon really was. Yeah, there was risk of them thinking they were going to sink into the surface when Neil steps off right he talks about like you know there's like a few inches of dust and very fine powder yeah yeah it's really cool so was thinking about that but then one of",
            "start": 46.52
        },
        {
            "text": "the surface when Neil Armstrong steps off right he talks back about like you know there's like a few inches of dust and very fine powder yeah yeah it's really cool so was thinking about that but then one of the characters in in the in the show just brings up briefly like this costs an enormous amount of money and it's a waste of time and a waste of money and there's problems here on Earth and I feel like we've kind of succumbed to that mentality recently in the last especially the last 20 years we don't have the space shuttle anymore we we pay the Russians to bring our astronauts into space with the exception of New Horizons and a few probes and satellites we don't really do any exploration anymore in the 60s we anticipated that we would have been on Mars by now have bases on the moon and Mars all those kinds of things and if we kept going at that trajectory at that pace we would um so I guess what I'm saying is do you feel like space travel and I'm not talking about Intergalactic travel and light",
            "start": 81.44
        },
        {
            "text": "Should We Go To Space? - The GameOverGreggy Show Ep. 26 (Pt. 5)\n\nkinds of things and if we kept going at that trajectory at that pace we would um so I guess what I'm saying is do you feel like space travel and I'm not talking about intergalactic travel and light speed travel these things are not possible yet and we don't know how to do them but just exploring the UN or the the solar system the known galaxy and going to the moon going to Mars sending probes to Venus maybe going under the cloud cover there um going to asteroids trying to you know find life on some of the moons of Jupiter and Saturn etc is this valuable and you know it costs an enormous amount of money we have to understand and they say in the show it costs 25 billion in 1969 to go to the moon it's an extraordinary amount of money today um how much is that today that's what are we looking at almost half a trillion dollars probably Jesus trillion it was worth it though so that's the thing it's like here's the positive to me there was a a whole generation of people that were that were",
            "start": 114.16
        },
        {
            "text": "at almost half a trillion dollars, probably Jesus, trillion, it was worth it though. So that's the thing. It's like here's the positive to me: there was a whole generation of people who were into math and science and rockets and space exploration and science fiction. They had it as the Last Frontier, as they say in Star Trek. It was like the only place we hadn't gone yet. We were going to go to the Moon; we were going to do all these crazy things; we were going to risk everything for the biscuit. Is it worth it? And should we still be doing things like this even though we have real problems here on Earth, and it would cost us hundreds of billions of dollars to really go to Mars, realistically? Like, to build the craft, train everyone...",
            "start": 157.2
        },
        {
            "text": "to Mars realistically, like to really go, like to we're going to build the craft, we're going to train everyone, we're costing hundreds and hundreds of billions of dollars. Let me put it in terms that I think that everyone can appreciate right there a little movie that was made not too long ago called Armageddon. In that movie, we use all the tech, all of our technological might to save our species. They say they have a great line in it that I'm going to slaughter and paraphrase: \"For the first time in the existence of anything, any life on earth, a species has the ability to save itself from extinction.\" That's because of that moon landing. That's because we had a competition a while back that gave us the technology that allowed us to save our lives. So if we don't keep... if we do not keep on that path, we might be causing ourselves just utter... see, that's the bigger thing to me is like the way we sit here and talk about it right, like the prospect of a probe on Venus or uh investigating an asteroid.",
            "start": 194.08
        },
        {
            "text": "we might be causing ourselves just utter see that's the bigger thing to me is like the way we sit here and talk about it right like the the prospect of a probe on Venus or uh investigating an asteroid I have some data plus don't you want to see Europa up close oh yeah what's your data what cost $29 billion in 1969 is $182 billion today oh so not quite as bad not quite half sounds like a lot it is a lot of money the problem is like all the little there's all we're taking for granted all the little steps all the little missions that not in little in quotes Gemini and we want to jump to can we go to Mars all right cool can we go to he you know what I mean like we want people to go places so you lose sight of can we find the mass relay at Pluto exactly that was why I remember when uh if you remember geez I don't remember how many years ago you probably might maybe that when we sent when the first Mars Lander landed on July 4th I remember watching that being so stoked cuz it was so cool to see",
            "start": 238.16
        },
        {
            "text": "Geez, I don't remember how many years ago you probably might maybe that when we sent the first Mars Lander landed on July 4th. I remember watching that being so stoked cuz it was so cool to see that, you know what I mean like that. But I remember it was also a big deal to me because I remember it took how many years - four or two something like that, uh probably like 18 months or okay. I remember them making a big deal about when they launch the planet, the planets align and you launch everything, and then they're far apart, you don't know. It's also I mean like I just wonder if you know we complain about money spent. I do, I mean I'm definitely a conservative and like I I don't want money to be wasted but when people really aim at NASA or they aim at the National Endowment for the Arts or they aim at PBS or they aim at all these things it's like come on, like government shouldn't necessarily have to fund culture and art and science. But it should, yeah, and that's not where the money is wasted.",
            "start": 287.4
        },
        {
            "text": "at PBS or they aim at all these things it's like come on like government shouldn't be necessarily having to fund culture and art and science but it should yeah and that's not where the money is wasted the money is wasted in entitlements and all that garbage Social Security Medicare and the military war still fighting and if like you just took half of the military budget and put it in the science and funded you know things down here a agricultural research and Robotics and space travel and all these kinds of things like it makes people wonder and makes people engaged and excited like people used to be like we're stupid today because we have nothing to Aspire to you know and and I was watching that show and really thinking like that must have been an amazing time because people wanted to get into astronomy they wanted to get into astrophysics they wanted to get into engineering this was like what they aspired to do they were reading Ray Bradbury books one minute",
            "start": 323.6
        },
        {
            "text": "wanted to get into astronomy they wanted to get into astrophysics they wanted to get into engineering this was like what they aspired to do they were reading Ray Bradbury books one minute and they were looking at the TV and we're on the moon you know and like we don't do and we don't do stuff like that anymore see I think I think it's valuable to want to know what's in space and to do all that stuff I don't think it's worth it with because of the money and stuff like we have so much problems here you're right like why don't we why don't we just use that money to fix the stuff going on here and like I feel like the competition is just different like before everyone wanted to be an astronaut now everyone wants to be I don't know makes like TV makes it seem like people want to be coders and all this stuff that's what's cool now everybody wants to make money yeah which now I don't think that was I mean like for what he's talking about I think there was a while",
            "start": 366.76
        },
        {
            "text": "to be coder coders and all this stuff that's what's cool now everybody wants to make money yeah which now I don't think that was I mean like for what he's talking about I think there was a a while there where people were like I want to be a scientist I want to go to space and I want to I mean I don't think people were in that for the money yeah but I think there's a lot of people now like a lot of people that aren't necessarily in it for the money they're in it for the like yeah money is a byproduct of it but it's like I want to create something like I want to be the next Steve Jobs yeah like I feel like there's that drive to to be that like maybe that's not just about money but that is that in the same way want the guy going we haven't really been funding space exploration right like yeah we we only spend like 15 billion dollars a year on it like it's barely enough to do anything and everything's PR right everything's like yeah Steve Jobs everyone aspires to be him well because he was",
            "start": 397.4
        },
        {
            "text": "we only spend like $15 billion a year on it, like it's barely enough to do anything and everything's PR right, everything's like yeah Steve Jobs - everyone aspires to be him well because he was such an iconic figure, everyone wants to be that iconic figure doesn't every want to be famous I guess they want to be famous, they want to have a company that's the best company in the world and they want to be a billionaire if you're not uh Neil Armstrong and Buzz Aldrin or the crew of Apollo 11 or the teacher who died in the Challenger like who what space What Spacemen what astronauts are they really they're like famous, you know what I mean yeah I mean I it was just something interesting I was thinking about just in the sense that we don't Aspire as a people like that took real sacrifice we sent people to the Moon in air in in spacecraft that had the processing power of a TI-82 calculator you know we did it aw can you imagine like what we could do with Apple",
            "start": 433.68
        },
        {
            "text": "Should we go to space? Sacrifice, we sent people to the Moon in air in spacecraft that had the processing power of a TI-82 calculator. You know, we did it. Can you imagine what we could do with Apple technology, what we can do with all the things we make on Earth for practical purposes if we just said, \"We're going to spend the money to do this, and it might not be practical.\" Maybe we get some minerals and some rocks, and we learn a little bit more about space. But maybe it brings a whole another generation into things that they really should be studying. I was talking to my friend Sarah recently, who's a teacher, about how I'm really frustrated that no one said to me, \"I'm so happy you majored in American history.\" You know, I went to school, and all that kind of stuff. But no one ever said to me, \"This is great that you want to do this,\" or \"This is fantastic, but historians are necessary, people.\"",
            "start": 471.88
        },
        {
            "text": "School I went to and all that kind of stuff, but no one ever said to me like, \"You know what? This is great that you want to do this,\" and it's fantastic. But historians are necessary, and people must know this information. But maybe you want to study math, maybe you want to study engineering or be a scientist or a physicist or a biologist or a chemist. You know we need those kinds of people, and we don't have them to the point where we actually have to get immigrants to come here to fill in our high-tech jobs because no one's studying that stuff. Because everyone says it's okay, go study you know medieval English literature and get a degree in that, and that's fantastic, and you're educated, but is it practical and is it useful? And like I feel like we just don't have anyone like we did in the 50s and 60s with Gemini and all these things in Apollo where it was \"this is what you want to do\" and here's the result of what you want to",
            "start": 511.56
        },
        {
            "text": "like we just don't have anyone like we did in the 50s and 60s with Gemini and all these things in Apollo where it was you know this is what you want to do and here's the result of what you want to do and look how cool this is yeah but what what's so cool about it I just I mean I get that it's cool but like what's so cool about it no it's it is super cool but like I don't understand like what's so practical about that like great we went to the damn Moon well a lot of stuff might be that sounds a little crazy like it's that's super that sounds like a young person that doesn't get it I don't get it I don't get a lot of things but like I you don't think it's mind blowing we left this planet that's cool what did we get the moon what did we get from it we got moon rocks see I think great we got moon rocks I think that just the feet like like let's say let's say I was able to you know run this entire Block in a half second Flack what did we get from it nothing but it's amazing that I",
            "start": 546.72
        },
        {
            "text": "we got moon rocks, I think that's just the feet, like let's say, let's say I was able to run this entire block in half a second. What did we get from it? Nothing, but it's amazing that I did that, it's incredible that I did that, so amazing. But who cares? Like why do we need to change what we're studying and stuff so that we can do cool things because I think it's the sense of wonderment right, like Colin was saying, like the iconic line from Star Trek is \"Space: The Final Frontier\" - there is an a vast just infinity out there of unknown possibilities that has a sense of and carries with it a sense of wonderment that we should be encouraging in people who are growing up and in each other right. What Colin's talking about is like for one second because of the indulgence in that sense of wonderment, the entire world watched the same thing - like there was probably not one person unless you didn't have a TV which I'm sure there were plenty of people but if you had a TV and",
            "start": 585.88
        },
        {
            "text": "Sense of wonderment, the entire world watched the same thing, like there was probably not one person in unless you didn't have a TV, which I'm sure there were plenty of people. But if you had a TV and you could get that signal, you were watching that event as it happened right. And there are very few things other than huge catastrophes that we look at that we actually join us as a global community like that's what I was thinking about. I was trying to remember, like again in Mad Men, and this isn't a spoiler, the next day Peggy makes a presentation and she talks about it right away. Like I know you all watched that. I was thinking I was trying to think about it like what is the last positive event that we all were like \"the next\" I maybe like I guess like Obama getting elected wasn't the Olympics because I didn't even know those were happening until like Obama got elected, that was a big deal right, the first black president. That was something we all but I don't think the whole world watched it like that you know what.",
            "start": 631.24
        },
        {
            "text": "Were happening until like Obama getting elected, that was a big deal, right? The first black president - that was something we all but I don't think the whole world watched it like that. You know what I mean? Like they did actually; some people did actually. I-I-I don't know. I hear what Tim is saying in the like: We got a lot of practical science from the space program, and a lot of things that you use every day come from NASA. But you know, like a lot of stuff - plenty of stuff. But like so, we don't know it's the proof in having to use it in those extraordinary circumstances. But to me, I've been reading a lot, and I have been recently about there's a lot of declassified documents from the government, and all just a lot of talk about what we thought we were going to do. And I was telling Greg that one of the things that like we thought we would have moon bases in the 50s; the government wrote all this stuff up anticipating that we'd have moon bases and not",
            "start": 669.68
        },
        {
            "text": "to do and I was telling Greg that one of the things that like we thought we would have moon bases in the 50s the government wrote all this stuff up anticipating that we'd have moon bases and not only we would have moon bases about that we would be fighting the Soviets on the moon yeah but see that's that's what was going to say we don't have an enemy anymore because the enemy is the competition that breeds excellence of us getting to the Moon right the reason we went to the moon was because we wanted to get there first so we can get a strategic advantage over the Russians right yeah well we wanted to just prove the superiority of our science and we were behind the entire time I mean they they sent the first man into space first woman in space first animal in space they sent the first rover to or the first probe to Mars or to the Moon they went to Venus like you know they sent you know their probes to Venus landed on Venus the crushing pressure destroyed those crafts but like we",
            "start": 706.84
        },
        {
            "text": "Rover or the first probe to Mars or to the Moon they went to Venus, like you know, they sent their probes to Venus. Landed on Venus, the crushing pressure destroyed those crafts. But like, we, you know, the moon landing was so extraordinary. The Soviets would always tell us, \"You guys are full of it,\" your stuff sucks, all that kind of stuff. They never disputed that we went to the Moon; they knew we went to the Moon. Like, they were and they were impressed by it, and like it humbled them, you know. And it took a lot of brain power and a lot of minds – that was a smart generation, I guess. What I'm saying is I want us to get back to that point. I want us to start, you know, I want us to squabble about the money that our government spends. We have an enormous debt, but I want us to look where we're spending the money and what we're spending the money on – our entitlement programs are huge and outrageous; our military programs are huge and outrageous; we have all these departments.",
            "start": 736.32
        },
        {
            "text": "we're spending the money and what we're spending the money on our entitlement programs are **huge** and outrageous our military programs are huge and out of control we have all these **unnecessary** departments that we don't need to be paying for a bureaucracy we can take that money and give it to brilliant scientists and Inspire a generation of kids and do what our forefathers in science thought we were going to do already which was go to **Mars**, you know, go to Mercury, go to Venus, go to Europa and IO and Titan Go, you know, like one of the great things that I think's happening a lot of people don't pay attention to is in 2005 we launched a probe called New Horizons that's going to Pluto and it gets there next year we've never seen Pluto we don't know what Pluto looks like we only have these like four five six pixel images cuz it's so **far** away you know and we're eventually going to go within 5-10,000 miles of it and see it you know and that's extraordinary we don't have the",
            "start": 771.72
        },
        {
            "text": "like four five six pixel images cuz it's so **** far away you know and we're going eventually going to go within 5 10,000 miles of it and see it you know and that's extraordinary we don't have the technology to do that we Hubble can't see it you know what I mean like that's amazing so like I think that there is though a a Resurgence of that right I think I can really thank Cosmos for it because there was a time I don't think I've ever talked uh astrophysics with anyone in my entire life before but there was like a weak period there where all us were like no no no dude a black hole is this no this is what a quasar is this is a pulsar like this is this that's really really cool we just I think maybe that's one step into it right is having more television that's like that that really is well produced kind of like Star Trek because there was a time also where Star Trek and Star Generation all those shows would help kind of fuel that a little bit at least for me like I'm still watching",
            "start": 808.48
        },
        {
            "text": "Should We Go To Space? - The GameOverGreggy Show Ep. 26 (Pt. 5)\n\nproduced kind of like Star Trek because there was a time also where Star Trek and Star Trek: The Next Generation all those shows would help kind of fuel that a little bit at least for me like I'm still watching Voyager which again I don't know if it's better than Deep Space Nine please tell me if you think I think most people think Voyager is better than DS9, is it which one has Scott Bakula that was Enterprise which I actually really liked but no one else did sadly was not it was not the best of the Star Trek shows but like that's we still we still have those but you're right I don't know what it would take I don't know what it would take to get people back on that track like it's just like Tim's talking about it's just not a priority it's I don't know how to get the Youth of America to see it as a priority it's a shame right cuz we were so close like we set foot on the moon but close to what I we're still going to it what we were so close to this Arc of being like of Enlightenment where we were like we're",
            "start": 850.36
        },
        {
            "text": "a shame right cuz we were so close like we set foot on the moon but close to what I we're still going to it what we were so close to this arc of being like of enlightenment where we were like we're going we're **** going we're in space what's the ultimate goal here like to spend a **** ton of money to then go up to this cheese rock well we could be on Mars we can go to Mars we can figure out we can figure out there's extraordinary things we could do oil on one of these planets Tim it's not even about it's not there's obviously not oil cuz oil fossil fuels the the there might be well that would dude there's so many there's so many reasons gold there might be gold first of all there's no way there's no way that we're the only life in the universe it would be it would be stupid if we were all right so that's one thing the other thing is that stupid life if we were the only life un that makes no sense that's so dumb it's mathematically impossible stupidly dumb the other thing is",
            "start": 885.32
        },
        {
            "text": "All right, so that's one thing. The other thing is that stupid life if we were the only life in that makes no sense, that's so dumb. It's mathematically impossible, stupidly dumb. The other thing is that any you know any scientist, any expert will tell you that there's no way we can keep up our lifestyle on planet Earth the way it is right now unless people everyone decides to agree to stop having babies. There's no way we can keep this up. Thanks, Justin. We really do have to like figure something out, like whatever the new Christopher Nolan movie is, Interstellar, like that's a real thing. Like we may have to move one day. What if we put that money into figuring out the problem with what we've got? Like because I don't think that we can figure the problem out. I think the problem has to go to space. No, it's systemic. Well, I mean there's a lot of you know there like in in you know early NASA days we assumed that we would go to Mars, that we would try to terraform it, that like you know we would we would we would figure",
            "start": 925.72
        },
        {
            "text": "I mean there's a lot of you know there like in in you know early NASA days we assumed that we would go to Mars that we would try to terraform it that like you know we would we would we would figure these amazing things out do these amazing things that we can do create things called Dyson spheres which are like you put around the Sun to harness its power it's like an infinite amount of power we often think that we might not be able to see the stars that uh intelligent life you know their planet revolves around because they build Dyson Spheres around their around their Suns which would block all the light out and it and it yeah and that it like create it grabs all of the energy out of the sun like there's these extraordinary these extraordinary mind experiments but that are practical and we can do them the only thing we can't do is travel faster than light but we can probably figure that out to we got to figure that out there's two things and here's why that's cool because you get to see",
            "start": 966.16
        },
        {
            "text": "do them the only thing we can't do is travel faster than light but we can probably figure that out to we got to figure that out there's two things and here's why that's cool because you get to see something do that cool Star Trek thing where it goes see that's worth thing like why doesn't even matter is cuz you can't we can't make the big jump to you know leaving our galaxy and doing something else until we make all those small steps I totally get why it's valuable I think it's not worth it is the only thing I think there's so much find another life out there it would unify the entire planet we'd end all wars no see that's the thing be a lot of **** no like you can't say that it's so many said said can we get playback Bo there's so many risks there's the risk that there's nothing there's the risk that they're **** **** and I'm going to bet they're **** that is the one thing is they're probably going to kill us they're going to kill us yeah there's a lot of theories on that we",
            "start": 1001.8
        },
        {
            "text": "the risk that they're **** **** and I'm going to bet they're **** that is the one thing is they're probably going to kill us they're going to kill us yeah there's a lot of theories on that we' we've talked I'm just saying there's two things that are going to strike people really hard in the next 10 or 15 years that are going to make people wonder why we just gave up on this one that the Chinese are going to the moon and they're going to **** land there and you bet and they have a lunar program and they're going to go and we're going to **** see them walking up there we're going to be like **** you know they they beat us to it and now they're way ahead of us and they're going to keep going you know yeah they're not going to stop the mo go to Mars and they're going to be the ones that P God bless them because they're doing great science that I'm sure they'll share with everyone but like like it's it's it's a national pride thing like we went we went to the moon yeah you know",
            "start": 1041.96
        },
        {
            "text": "that P God bless them because they're doing great science that I'm sure they'll share with everyone but like like it's it's a national pride thing like we went we went to the moon yeah you know the Canadians didn't go to the moon the Europeans didn't go to the Moon we went to the moon can't do **** ever the Chinese are going to send astronauts to the Moon that is something they're going to do and you know and they're going to walk there and they're going to have this great modern technology and all of us as the world are going to watch them and it's going to be like that's **** cool and we're going to go back to playing with our iPads and our next gen **** that's actually going to fix things well the Chinese are up on the moon chilling are iPads are going to fix things yes the next jet of that whatever it's all for me how I can read comic books EAS the other thing that's going to happen is that private Enterprises like SpaceX and all these other companies are going to be the ones",
            "start": 1074.04
        },
        {
            "text": "of that whatever it's all for me how I can read comic books EASily. The other thing that's going to happen is that private Enterprises like SpaceX and all these other companies are going to be the ones that go into space and it will be for profit, and we're going to wonder why that's how aliens is like when company men they go out there to like mine stuff - that's exactly right and like we and that's fine and that's great, I mean that's that's practical. We need to mine asteroids and all those things and that's super practical, that's great. Aliens, but like this, the Canadians are going to wonder why we let go of the altruism of going to space and doing it ourselves and doing it as a people instead of letting companies with lots of money invested interest do it. And that's going to happen too. You know, like we have a Space Shuttle right now - aren't they building them though? They're building a new generation. Yeah, we retired the Space Shuttle; we'll just pay the",
            "start": 1104.4
        },
        {
            "text": "going to happen too you know like we have a **Space Shuttle** right now aren't they building them though they're building a new generation yeah we retired the Space Shuttle we'll just pay the Russians to go to the space station well we all due respect our they were exploding so we needed to get them off the market that's fine but you think that we would have had the foresight to be like you know maybe we should build these concurrent to fixing the space when are they going to make a spaceship that looks like the Starship Enterprise that shut up Nick they have to build that orbit wouldn't they yeah that'd be but you know what I mean like what are they going to make one that looks like a spaceship should look I don't know I don't know if that looks practical to be honeste yeah like that one the the current spaceship is no offense to spaceships out there it does look like it put on a couple pounds but here I'll end it with this right I think that part of government part of our society",
            "start": 1136.28
        },
        {
            "text": "the current spaceship is no offense to spaceships out there it does look like it put on a couple pounds but here I'll end it with this right I think that part of government part of our society is not only the things that we say but the things that we do and it's important to fund art and it's important to fund history and historical sciences and archaeology and all these kinds of things because really it's change at the end of the day compared to medicare or medicaid or the Army's budget and all these kinds of things and it's important for us to focus on science it's really really important you know like really really important to focus on science and engineering and mathematics yeah and a private company like Apple is not inspiring that a private company like Apple inspires you to sit with your iPad and play with it and wait for them to release the next iPad yeah going to space and seeing with your eyes what these amazing people do and these amazing scientists",
            "start": 1170.96
        },
        {
            "text": "you to sit with your iPad and play with it and wait for them to release the next iPad yeah going to space and seeing with your eyes what these amazing people do and these amazing scientists build these brave astronauts that go to space with no guarantee Apollo was looked at as many people as a suicide mission you know the fact that they came back is amazing they went through the Van Allen belt and all these things bombarded with radiation you know like we have people on this planet that really walked there and I think that inspires a new generation to do cool stuff and we are stagnant as a people our technology as Ray Kurzweil always talks about is the exponential growth of Technology right the singularity we're getting there but we're getting there in weird ways we're not getting there in cool ways you know what I mean and like I don't agree with this at all we have so much cool stuff I want cooler stuff but I don't think",
            "start": 1216.48
        },
        {
            "text": "getting there in weird ways we're not getting there in cool ways you know what I mean and like I don't agree with this at all we have so much cool **** I want cooler **** but I don't think like what's cool I mean we have a computer and then a computer and a computer and a computer and a tablet and an iPhone and an iPhone and a tablet and a computer but like what do we use them for cool things for Snapchat we use them to take pictures and tweet with each other we're not using them to figure out amazing answers to science that can contribute to the historic knowledge that started with the Ancients you know and and go forward to I know it sounded like you were interrupting to say something important you're like and then just like nope got nothing really dry it's really dry just wanted to bring that up and kind of rant about that I'm with Colin I want there to be Star Trek I want to get to Star Trek I want to be able to think that one day we'll have Star Trek then they'll come",
            "start": 1258.92
        },
        {
            "text": "to bring that up and kind of rant about that I'm with Colin I want there to be Star Trek I want to get to Star Trek I want to be able to think that one day we'll have Star Trek then they'll come back in time for some reason what do you want about Star Trek Nick to explore universes and beam places I want them to go explore the woods but that's the thing that there is nothing left to see I want to find aliens deep in space there's yeah we can go into some of the trenches they always say that there's plenty of undiscovered life and that's fantastic what's really out there during the Age of Discovery in the 14, 15, 16, 1700s you know when Columbus was going around exploring all the you know Marco Polo everyone was traveling around that was a Time of Wonder in the old world that was a time when people would read the accounts of their journals and wait for them to come back everyone was wondering what would they see what would they do did they",
            "start": 1298.88
        },
        {
            "text": "a time when people would read the entries out of their journals and wait for them to come back everyone was wondering when Neil Armstrong would come back what would he see what would he do did he really go around the world we don't have anything like that anymore going out into space is the next thing here why here's why I love the concept of like if we could fire that back up a lot of our technology came from that too a lot of our current technology came from that so if they were to be able to figure out a means of travel that was faster than light that would come down to earth at some point and we could go to China tomorrow if we wanted to see I get that so why that happened because there was a fight right competition that things had to start let's have a fight here let's let's some of that stuff came out of World War II which is not very good either but that's what I'm saying that's what I'm saying is we don't we don't inspire people to have",
            "start": 1335.64
        },
        {
            "text": "let's have a fight here let's let's some of that stuff came out of World War II which is not very good either but that's what I'm saying that's what saying is we don't we don't inspire people to have that sort of competitive uh uh competitive nature toward space travel because there's no profit in it and often times our society right now is Led by profit if you can't make a profit and something people just don't do it nowadays which kind of sucks you know back back in the day we did it for national pride we hemorrhaged money to be the first to say in the in the species of human beings that we we did this and we can yeah they made it to space first but we got to the Moon which for whatever it's worth is awesome to draw a line from inventing the wheel to going to the Moon is mind blowingly awesome yeah and and not yeah I mean that's so where does my iPhone fit into this your iPhone came from probably a lot of computer technology it was an iteration of the C-64 calculator",
            "start": 1368.96
        },
        {
            "text": "Moon is mind-blowingly awesome, yeah, and and not yeah, I mean that's so where does my iPhone fit into this? Your iPhone probably came from a lot of computer technology, an iteration of the C6 calculator, which came from the shuttle that went to the Moon, yeah, I mean it's I can't I don't I don't know if that's a direct correlation or not but yeah, I mean it wasn't just competition but competition does breed that sort of spirit right? The Space Race sped up technological advancement because we basically poured tons of money into figuring out how to achieve this one thing that yes in and of itself uh didn't do much for us we didn't come back with space power that was worth billions of dollars, right? But we did feel the effects of it and we were still feeling the effects of it. The thing is I microwave huh Boom the microwave is that what came from I don't know there are 1300 pieces of technology that came from NASA okay I I get what Tim's saying that you know is it worth",
            "start": 1407.2
        },
        {
            "text": "it the thing is I microwave huh Boom the microwave is that what came from I don't know there are 1300 pieces of technology that came from NASA okay I I get what Tim Gettys' saying that you know is it worth it I don't it's hard to put a value on it but the problem is that even if you miss you redirected that fund to something else on earth like it's not they it wouldn't be like a simple fix right you're never going to have enough money to fix everything it's not like we move that money somewhere else that fixes these problems people are still arguing about people getting married that's the you know I mean let's let's distract them let's distract them with awesome space stuff yeah people get to the moon the gays can just declare it and they whatever they want married it's aspirational and inspirational yeah you know like take 10% of the military's budget give it to NASA and we can do amazing things you know any stupid **** Wars Close Our World War II era bases in Europe do all these things",
            "start": 1455.84
        },
        {
            "text": "yeah you know like take 10% of the military's budget give it to NASA and we can do amazing things you know any stupid wars Close Our World War II era bases in Europe do all these things and give the money to the brilliant people that can do good things you know and we can get more amazing technology I'm telling you man like Society can radically change and and and Greg's right I mean there are practical reasons the Earth has only got a few hundred years left in it in terms of it being habitable you know and like I hate to say it but that's true and like like the Earth's going to be here for 5 10 billion more years right like it's but it's going to be a dead orb rotating revolving around a sun or revolving around a star because we're killing it just by the nature of our species we outwitted Evolution we're the first species on on the earth to ever do it we are self-aware we know awesome that we're that smart but we're like too smart for our own good so",
            "start": 1496.32
        },
        {
            "text": "Should We Go To Space? - The GameOverGreggy Show Ep. 26 (Pt. 5)\n\nnature of our species we outwitted Evolution we're the first species on earth to ever do it we are self-aware we know awesome that we're that smart but we're like too smart for our own good so that's why that's why Einstein and other you know Sean would would would say like we might extinguish ourselves and that's in the um in the formula in the I think what it the um the formula that says how much intelligent life there is in universe think of it what the name it's not Fermi Paradox but something else uh the Drake equation where one of the things is like the the likelihood of a of a species getting to a point where it extinguishes itself right because it becomes too smart and if you can cross that boundary from not extinguishing yourself with nuclear power or pollution and all these kinds of things then you you're good to go you know like in perpetuity I that's what they say like you're you're transcended I mean you're good to go if you can get past that point then you're",
            "start": 1532.92
        },
        {
            "text": "all these kinds of things then you're good to go, you know, like in perpetuity - that's what they say, like you're you're transcended. I mean, you're good to go if you can get past that point, then you're good to go. Then you start building Dyson spheres around stars, then you start going to asteroids and mining them, then you start doing amazing things like yeah, and then it all trickles down. I just think of every single sci-fi movie that I've ever loved or wanted to be in that universe - that's what we did. We did where there were wars and everyone was dying, and there were lasers shooting people, and like Star Trek - like Star Trek was amazing because it was because of that sort of thing they hit that level and they went beyond it, where they had technology that was given to them by you know the Vulcans and other alien races, and they were able to achieve a piece that they'd never known before. Like the world on Star Trek is for all intents and purposes like very very",
            "start": 1576.32
        },
        {
            "text": "you know the Vulcans and other alien races and they were able to uh achieve a piece that they've never known like the world the Earth on Star Trek is for all intents and purposes very very peaceful it's one person, it's one Federation I think it's a federation it's not one person one people rather I don't think I don't think they go what have I done I don't think there's a lot of governments there's just one government but that's that's the thing it's like it's this utopian society where we we're not even run by currency anymore there's no currency we just yeah in Star Trek you just kind of go and you explore like you have a job and yous but the whole concept is you're supposed to like you know you're propelled in life by you know ambition or like wanting to achieve something better and that's that's the concept of it right so you just go gallivant around the universe and explore new people and if you're Captain Kirk have sex with them it's pretty cool the real reason we need a",
            "start": 1611.16
        },
        {
            "text": "and that's the concept of it right so you just go gallivant around the universe and explore new worlds and if you're Captain Kirk have sex with them it's pretty cool the real reason we need a space program is so that we can stop an asteroid when it comes towards us right now we'd be screwed over you said a whole bunch of you guys also I watch I was like you to go smile also I watched Alien last weekend and that movie totally is still awesome that's that's count against that's that's an argument for Tim we should probably stay away from space we discover that thing we're bring back back I'm just saying that movie is really really good totally beautiful when you think about it all right ladies and gentlemen that's the GameOverGreggy Show every week four sometimes five best friends gather around a table each bringing a random topic of conversation and they hash it out for your amusement if you like that make sure you get the full mp3 version of the show every Friday over",
            "start": 1652.32
        },
        {
            "text": "around a table each bringing a random topic of conversation and they hash it out for your amusement if you like that make sure you get the full mp3 version of the show every Friday over at GameOverGreggy.bandcamp.com it's $1 it's totally worth it but if you say nuh-uh it isn't worth **** no big deal we understand it goes up for free topic by topic every day as videos over on youtube.com/GameOverGreggy you can enjoy them there Friday the entire show goes live I was doing that earlier Wolverine Claus yeah I do that with everything great minds think alike just keep those markers away from my brand new awesome shirt that I'm wearing today oh this new lifesize Patrick Star shirt that's limited edition limited to 35 t-shirts you can get that one this one and a whole bunch of other ones including Sean Finnigan likes hiking over at districtlines.com GameOverGreggy Damon thank you so much for coming by thanks for having me you were great usually like",
            "start": 1700.48
        },
        {
            "text": "one and a whole bunch of other ones including Sean Finnigan likes hiking over at districtlines.com GameOverGreggy Damon thank you so much for coming by thanks for having me you were great usually like on you're great where can people get you they can get you on IGN.com oh yeah I've heard of it you got the Games Scoop that's so good Games Scoop yeah if people want to check out Damon a huge fan of y'all show knock the Knockin Boots super knock thing yeah yeah which we'll be recording another episode soon yeah all right well guys as normal you know thank you for coming by I guess yeah whatever problem the guy that hates space travel the guy that just wants to stay at home and not do anything what it what if it was a spaceship where all the iPads the future are built into it you iPads this is about me not want like I ladies and gentlemen it's been a pleasure serving you this evening we'll see you next week",
            "start": 1743.44
        }
    ]
}