{
    "id": 1456,
    "video_id": "8nofnvSniBo",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "The Best Games of 2015  - Kinda Funny Gamescast Ep. 50",
    "description": "We take a look at the best games of 2015. (Released on Patreon on 12.25.15)\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1451656800,
    "duration": 7035,
    "transcript_chunks": [
        {
            "text": "what's up guys welcome to the first ever get this episode 50 oh wow of the Kinda Funny Gamescast I can't believe we made it this far did we get a cake we don't get a cake but we did from iTunes themselves yeah we won their best of 2015 podcast thing which is really cool in Canada from what I understand Canada voted for us so we got Canada's vote it's it's iTunes so we're there overall we're there overall is this publicized anywhere yes they gave us a whole thing there was like we get badges we can put on our artwork and stuff so it's pretty cool let's do it right now Kevin put the badge on there I don't want Canada's Awards Kevin bringing no I think he's saying it counts yeah but I just don't want Kevin bring up the badge right now put the badge over my face Kevin yeah yeah that's how that feels my God we're coming up the end of the year here now we're winning Awards finally it's all happening I'm really excited about that it's been a long not even",
            "start": 0.33
        },
        {
            "text": "yeah yeah that's how that feels my God we're coming up the end of the year here now we're winning Awards finally it's all happening I'm really excited about that it's been a long not even a year for us here we are at the top of the mountain so that means we have we have a couple episodes left in this year and because of the way we distribute the show there is going to be some overlap I think next week's is the one that kind of is going to go into the next year oh I see you're saying yeah so it counts early on Friday early people getting 2015 late people get it on 2016 if you want to get things early patreon.com/KindaFunnyGames you can get all things I can't hear anything right now very well why why got water in your no I just feel like a little congested see I'm very sick and I can't hear anything oh you're very sick good it's good that you're here with us yeah I had he was sick at the Holiday party too so now he's no longer contagious but that night super contagious yeah so I'm when you",
            "start": 54.44
        },
        {
            "text": "oh you're very sick good it's good that you're here with us yeah I had he was sick at the Holiday party too so now he's no longer contagious but that night super contagious yeah so I'm when you were sharing drinks with them Colin idea done I think we Shar drinks but it'll be okay it going to be okay get me the zinc and the vitamin C Kevin bring me a Paar and a side of Nutella I went don't bring me those things I went to uhad hand me that belt I went to Walgreens like a couple weeks ago to get eonia and they had no idea what I was talking about I have no idea what you're talking about I don't know if that is either EA is like an herbal supplement that's really good for your your uh your immune system it's quite popular hadn't shown this off yet yeah that's great of course when I beat you in the Nintendo World Champion or the Kinda Funny Nintendo World Championship on Mario Tennis we said there needed to be a traveling championship belt and then our good friends at Toast",
            "start": 97.96
        },
        {
            "text": "I beat you in the Nintendo World Championships or the Kinda Funny Nintendo World Championship on Mario Tennis. We said there needed to be a traveling championship belt, and then our good friends at Toasty Stickers Flaming Toast made it for us. They made it happen; that will be mine, Greg. I hope you know what do you want? I'm the Champion, so you can... let's play. Do you want to take me on in next with it? Any Nintendo... let's play. You're that confident about Mario Golf: Toad Strol Tour. Get it? So okay, what we're doing here guys is a little different than our normal shows. This is the beginning of our year-end wrap-up Extravaganza. What we're going to do is this episode is going to be a look back at all of the video games that came out this year and we're going to review all the ones that we played in quick little synopsis, eyes. It's going to be fun. Twenty-point scale. Colin has to number everything; Colin loves numbered video game reviews.",
            "start": 138.52
        },
        {
            "text": "Out this year and we're going to review all the ones that we played in quick little synopsis, eyes it's going to be fun. 20-point scale. Colin has to number everything; Colin loves numbered video game reviews the most. So what we're going to do is topic one is going to be kind of the multiplatform games - so your Fallout 4, your Metal Gear Solid 5, and whatnot. Topic two is going to be PlayStation, so we're going to review all the PlayStation exclusive games, both Vita and PS, and just kind of review PlayStation's year overall. Then Nintendo, then Xbox with a couple of PC and mobile stuff will add all in that into one little thing just because all the **** we don't care about not as knowledgeable about that subsection of the the Tomb Raider. Hi Dar I'm getting ahead of myself, trust me. I know some out there buddy but then what we're going to do next week - so this is kind of looking back at this year; next week just a little hint at the future here we're gonna predict 2016 so",
            "start": 183.8
        },
        {
            "text": "trust I know some out there buddy but then what we're going to do next week so this is kind of looking back at this year next week just a little hint at the future here we're gonna predict 2016 so it's going to be the same idea first one's going to be looking at the big games of 2016 then it's going to be predicting PlayStation, predicting Nintendo, predicting Xbox I like this show's idea and I like that show's idea and I like them so much I say when we do it next week we wear the same clothes okay I like that it's almost as if we're going to record that episode right after this episode but that would be weird the episode we're not going to record today because we're going to wait until the new year so we can think and ponder on this it's our Game of the Year episode Py is going crazy that's how he's going to get really We Got Game of the Year coming up so just so people are asking when it's coming it's going to come in 2016 and it's going to come hard what we're going to do then it's",
            "start": 227.76
        },
        {
            "text": "\"How he's going to get really We Got Game of the Year coming up, so just so people are asking when it's coming, it's going to come in 2016 and it's going to come hard. What we're going to do then is going to be four topics - you're familiar with the format of the show. Topic one: it's going to be my 10 favorite games from 2015. Topic two: Colin Moriarty, one of the coolest dudes in video games, this will be the intro right here, uh, favorite games of 2015, then the other half - the coolest dudes in video games, Greg Miller's 10 favorite games. Then the final topic is going to be the Kinda Funny Game of the Year discussion. So we got some good things, the next couple a lot of good shows, a lot of solid shows that are worth the dollar, they're all worth the dollar. What you gonna do with that Greg? I'm throwing it on my shoulder now. Oh okay, through all the championship belt poses just so you remember who beat you. Oh I remember and who is the Kinda Funny Nintendo World Champion. Look at Mario with his\"",
            "start": 268.8
        },
        {
            "text": "throw it on my shoulder now oh okay through all the championship belt poses just so you remember who beat you oh I remember and who is the Kinda Funny Nintendo World Champion look at Mario with his little Kinda Funny face on who knows what's up Greg, you ever think you'd be this close to a champion the trending gamer the number one voted Canada podcast of iTunes we have so many awards it's just raining the awards not only the ones we make up the ones we're actually awarded in foreign countries in foreign countries let's get right into this let's get right into this so let's start off with the big one Fallout 4 okay you guys have had some time you platinumed it I did Platinum it another trophy from my collection you just man they're just raining down on you I know what are the thoughts couple weeks past the Platinum oh one of my thoughts past past the Platinum um it was fun it was good it was more it was what we wanted a long time you know coming into it you we had this",
            "start": 308.76
        },
        {
            "text": "thoughts couple weeks past the Platinum one of my thoughts past past the Platinum um it was fun it was good it was more it was what we wanted a long time you know coming into it you we had this conversation right of like you were talking to me and Colin about it and what we wanted out of it and I was like uh my expectation is that it will be Fallout 3 on PS4 but my hope is there'll be something there'll blow me away and I didn't expect that that didn't happen Fallout 4 is Fallout 3 for me souped up it dropped a lot of the mechanics and things I didn't like about it it it's my favorite Fallout of all time but it wasn't revolutionary you know what I mean it didn't catch us off catch me off like Fallout 3 did you know what I mean that was like a huge huge huge event for us Fallout 4 was a lot of fun loved it but I was just talking about the other day on another podcast looking back at it I really only have a few handful of like wow and then there was this moment that happened",
            "start": 352.8
        },
        {
            "text": "4 was a lot of fun, loved it. But I was just talking about the other day on another podcast looking back at it. I really only have a few handfuls of like \"wow\" moments. And then there was this moment that happened... you know what I mean? Like I think of it and I think of going there and getting things, picking locks... do you know what I mean? Not mundane activities; they were fun. I enjoyed leveling up and building my character, and you know, D&D. But for me, Fallout 4 is about me and this one companion I chose, and then fell in love with, and then... you know what I mean? Like that's the story of Fallout 4. Whereas like Fallout 3, you go down, meet this robot who thinks he's Thomas Jefferson... the first time you run into a Super Mutant or Behemoth... those are like standout moments: \"Oh my God, that was crazy.\" In Fallout 4, I do feel it hit the spot, loved it. Played it; don't regret it.",
            "start": 392.0
        },
        {
            "text": "M or super be Behemoth or whatever, D like those are like stand-out games. Oh my God, that was crazy in Fallout 4. I do feel was more like it was what I expected; it hit the spot, loved it, played it - don't regret it. You know, I'm super excited for DLC for it, but I'm not sitting here at all considering it for my overall game of the year. Col uh, I played for like 25 hours, went out to breakfast with a friend of mine yesterday, um, and we were talking about the game; he's playing it as we speak, and we both kind of agreed it's just not Fallout 3 - and that's a shame because it is it's a good, it's a great game, I think it's a fantastic game actually, but it's the bar was set so high by its predecessors that I I think that's why I just fell out of it. I just didn't feel like playing it anymore; I've really barely touched it since it came out, actually. We had the game very early - we had it in October, so I mean we got it then when I was really cruising through it late October, early November, um, it's a",
            "start": 431.96
        },
        {
            "text": "I've really barely touched it since it came out actually we had the game very early, we had it in October so I mean we - that's when I was really cruising through it late October early November um it's a it's a great game I just think that it in hindsight um things have happened in in the way Western role play games are made since Fallout 3 came out that makes this seem a little bit rehashed in a way um and I'm not I don't want to say I'm disappointed it because I don't know if that's necessarily the right word it's just that it's it's not quite what I wanted it to be I was way more excited to play it than I was after 10 hours of playing it or after 20 hours of playing it and that's why I just this year for me as people I think have noticed I was going through my my trophies to see games I played I've not beaten many games this year because my my whole Mantra now is like I'm just going to play until I just don't feel like playing anymore and uh that's kind of where I got with Fallout 4",
            "start": 473.96
        },
        {
            "text": "played I've not beaten many games this year because my whole Mantra now is like I'm just going to play until I just don't feel like playing anymore and uh that's kind of where I got with Fallout I think I'll go back to it eventually for sure but um it's a game that I in 25 hours I think I've seen everything that there is to see in the game in terms of like what you could do so you have a sense of what it is yeah story of course not um but yeah it's it's just not it doesn't I remember Fallout 3 like I was obsessed with it and I don't feel that way with Fallout 4 so it's it's certainly not it it hasn't it hasn't lived up to my lofty expectations do you think it's just at the detriment of you know having Fallout 3 already Fallout 3 was such a game changer right we talk about all the time like that was like out not out of the blue because we you know there's preview tours and y y y but it changed everything right so then to now jump into Fallout 4 and it's not changing everything",
            "start": 512.64
        },
        {
            "text": "time like that was like out not out of the blue because we you know there's preview tours and y y y but it changed everything right so then to now jump into Fallout 4 and it's not changing everything it's just building on what Fallout 3 does I feel like that's where some of it's coming through of like it's great but I'm not like why everybody you know why haven't you played it D mhm yeah it's it's definitely I mean it's very popular second best selling game in November and it's doing extremely well and I'm sure that they're very proud of it and they should be I just think that there are developers in with Western role playing games specifically maybe even The Witcher that um show what's possible in those kinds of Worlds that I think that um that Bethesda can learn a thing or two from that said the game's fun it's got a hook it's it's definitely one of those games where you go in any direction to do whatever you want and you're never Tethered to anything and and I appreciate",
            "start": 548.48
        },
        {
            "text": "that said the game's fun it's got a hook it's it's definitely one of those games where you go in any direction to do whatever you want and you're never Tethered to anything and and I appreciate and respect the amount of Freedom that the game gives you but I really am more intrigued now with Bethesda Game Studios' ability to take the next step and I don't I don't I don't know that they did with Fallout from it, I mean from the 25 hours I played of it which I think is plenty of time to realize to have played a game and know a few things, 25 hours is more than than you would spend with 95% of the games you ever play so um you know I think I've seen enough to kind of have a feeling that yeah and and in hindsight people tweeted me like are you disappointed and I again I don't know if that's the right word I just it's it doesn't have its hooks in me at all, yeah it had it hook hooks in me but like what he's saying like they didn't do anything new like right the new thing they did was settlements",
            "start": 584.76
        },
        {
            "text": "Word, I just, it's, it doesn't have its hooks in me at all, yeah, it had it hook, hooks in me, but like, what he's saying, like they didn't do anything new, like right, the new thing they did was settlements and I hate them, you know what I mean, like I don't want to build a town and do this, it's it's clunky, it's not fun, you know, I only did it for the trophy and that was like such a pain cuz it was like yeah let's manipulate the system and put down 15 clinics and then maybe rugs work maybe statues work everyone on the internet saying different things so I'll just throw the everything everywhere you know what I mean like rugs everywhere rugs everywhere like I yeah it's this weird thing of like I don't want to make it sound like yeah I'm I'm it's I'm not disappointed loved it it's just not like whoa you know my hair is blown back and I can't believe what I just experienced you know what I mean it's to like you what when we talked about it leading into it like what do I think it's going",
            "start": 618.28
        },
        {
            "text": "like whoa you know my hair is blown back and I can't believe what I just experienced you know what I mean it's to like you what when we talked about it leading into it like what do I think it's going to be like this is what I thought it was which is great again totally stoked for the DLC and I'll get all that but yeah you know so the next game we're going to talk about The Witcher 3 which kind of has a different uh scenario going into it than that where with Fallout you played Fallout 3 and loved it so you expected something in four whereas The Witcher you guys didn't play one or two went fresh into three what are the thoughts on three now The Witcher 3 uh is it it's still it's this weird thing with The Witcher 3 I feel like right where it's that like that song \"The One You Love\" You know what I mean I was this whole year I was so stoked for Metal Gear Solid open world in quotes uh Fallout big open world you know even Batman to extent you know what I mean where it was like I want to get lost in some",
            "start": 651.44
        },
        {
            "text": "I was this whole year I was so stoked for Metal Gear Solid: Open World in quotes uh Fallout big open world you know even Batman to the extent you know what I mean where it was like I want to get lost in some worlds I want to go in and you know have progress bars and stats and this that and the other and build my character out the way I want to build it out and so which are three the more you heard about it the more we saw of it the more we played it it was like I'm not a fantasy game guy you know what I mean it's really not the world I like to exist in but I'm so I'm ready to dive back in I'm so thirsty right now you know what I mean so when it got there yeah I jumped in and put what like 35 hours in I'd have to go look at the save file right but then when Batman: Arkham Knight came it was like lights out you know what I mean like and like now I sit there and soften I'm like maybe I'll get back to that one day but it's going to have to be that I'm thirsty again and there The Witcher 3 is an amazing",
            "start": 690.44
        },
        {
            "text": "what I mean like and like now I sit there and soften I'm like maybe I'll get back to that one day but it's going to have to be that I'm thirsty again and there it is like I The Witcher 3 is an amazing game I feel uh I love the fan Community that's around it and how passionate they all are about it but yeah it was totally one of the things I was visiting you know what I mean so it's like I had a good time playing it and I enjoyed myself and I totally understand why it's winning Game of the Year already even though Greg already said it wouldn't happen uh but yeah like for me it was like cool this was what I need right now and now I don't so now I'm on to something else yeah The Witcher was the game I spent the most time with I think I spent 50 60 70 hours with I mean I played the hell out of that game I didn't beat it um because there's no beating it apparently um it beats you but uh I think that the game got really long in the tooth and I just didn't want to play it anymore but the the",
            "start": 730.48
        },
        {
            "text": "game I didn't beat it um because there's no beating it apparently um it beats you but uh I think that the game got really long in the tooth and I just didn't want to play it anymore but the the uh the there's something about it uh and I've said many times now CD Projekt RED very much did themselves very proud um definitely like appeared on the scene with this game um and really when you put it next to Fallout 4 like you know you can see where some people are upset with Fallout 4 and why you get it I mean Fallout 4 is not a good-looking game it's um it's it's got a style but it's you know when you put it next to The Witcher 3 which is you know vibrantly colored and beautifully kind of rendered not that maybe the Wasteland should be colorful but um but the vistas and all these different things there's just something about the you know the characters and the the the the writing and and it just seemed like it was alive I didn't seem like I was doing **** just to do it and uh there was",
            "start": 770.04
        },
        {
            "text": "there's just something about the you know the characters and the the the the writing and and it just seemed like it was alive I didn't seem like I was doing **** just to do it and uh there was just a lot of **** to do I think The Witcher 3 is an example of a game that's way too dense um but uh it's a special game I think I think that I understand why people love it and unlike Fallout which I think um didn't meet my expectations The Witcher 3 like wildly exceeded my expectations yeah I'd go that was the thing too is I remember coming into The Witcher three and Geralt who was you know was so into it she went back and played one and two again to get ready and super into it was telling me like yeah like you're not it's not going to click for you it's not going to work and even like sure I don't like the fantasy setting but like Geralt and Triss and you know like I liked these characters and Ciri and stuff and watching them play off each other I was interested from that",
            "start": 813.56
        },
        {
            "text": "Sure, I don't like the Final Fantasy setting, but like Geralt and Triss and you know, like I liked these characters and Ciri and stuff, and watching them play off each other, I was interested from that angle even though it wasn't necessarily the setting. I really dug you know what I mean? Like I was into that world, and like that's what I'm talking about with Fallout right now - for me and Fallout, I think back right now and I think of my companion in one specific mission where I was like, \"Oh, that was really cool because it wasn't what I was expecting.\" Right? Whereas like The Witcher 3, it seemed like every not every quest but most quests had some twist or element to it - like, \"Oh my God, this guy buried his aborted fetus out in the front yard and now it's out there terrorizing the town. That's messed up,\" and I didn't expect that, and then you have to make a choice, and like you make a choice and it plays out badly, and then you go on the internet or talk to Christine who's a human Wikipedia for the game.",
            "start": 849.36
        },
        {
            "text": "up and I didn't expect that and then you have to make a choice and like you make a choice and it plays out badly and then you go on the Internet or talk to Christine who's a human Wikipedia for the game and she tells you no the other it adds really badly over there it's like that's really cool you know what I mean like what Colin's saying is like the world is alive and like you do you interact on what you think are just little side quests but they're fully fleshed out and they're fully **** up and that's awesome mhm yeah I think it's like an example of a a studio didn't remain stagnant um and really pushed it it's really it it's really surprising how good The Witcher is um you know in in many different ways I was I was definitely shocked by by it in that respect Metal Gear Solid V oh yeah so I haven't played it for a while because I I put it on hold when Uncharted: The Nathan Drake Collection came out a couple lot of things and I've been playing those and then a couple days ago I was like",
            "start": 886.24
        },
        {
            "text": "yeah so I haven't played it for a while because I I put it put it on hold when Uncharted: The Nathan Drake Collection came out a couple of things and I've been playing those and then a couple days ago I was like oh I'm just going to get play one one more episode episode chapter chapter whatever the hell it's called and um I was just my God how did I put episode you're right it's so good and I I love it and I love that it's every time I play it I'm like this is **** fun yeah like I just have fun playing it and it's not the Metal Gear Solid that I I wanted we've talked about Metal Gear Solid so much at this point but U I liked that even after putting it away for a while and then coming back to it I still get that same Rush of **** I love this yep yeah for me that's the thing it's my game of the year uh and that you know yeah what I put in initially on launch 12 something or no it was 110 hours I remember and then I started manipulating the clock and trying to get all these things da da da and again put it",
            "start": 919.72
        },
        {
            "text": "you know, yeah, what I put in initially on launch day was 12 something or no, it was 110 hours, I remember. And then I started manipulating the clock and trying to get all these things done, da da da, and again put it down forever. And then at Extra Life picked it up with the intention of platinuming it, even though everyone online is like you're not going to be able to do it. I'm like, I'll be able to do it. And like, granted that broke me because it did, but it broke me in the fact that I was playing for 12 hours straight and making no real progress, you know what I mean? Like checking off one box rather than the 15 I needed to get to the Platinum. But playing that game was like, man, this is fun. This game's so much fun, you know what I mean? It's... and I was afraid of taking a break, like, taking a month or two off coming back and getting into it would it hook me again, would it do this and right back into how good it felt. I mean the best thing about the game to me is the reward system where just",
            "start": 961.88
        },
        {
            "text": "or two off coming back and getting into it would it hook me again would it do this and right back into how good it felt I mean the best thing about the game to me is the reward system where just constantly you just feel like you're learning something new and there's some new mechanic that they teach you and you want to use it and I want to get this weapon I want to be able to shoot my arm and do all this weird **** and then even when I step away from it I come back and I'm there's already just one mission I played there's like new **** that I'm doing like **** yes there's I don't I played a lot of stuff this year and there's a lot of people who really get gameplay right you know we'll talk about him throughout this I'm sure but like I don't think there's a better gameplay Loop than Metal Gear Solid 5 you know what I mean in terms of like yeah you come back from a mission and now okay while you were gone these biological resources you know processed this way if you're into FOBS",
            "start": 996.08
        },
        {
            "text": "Metal Gear Solid 5, you know what I mean in terms of like yeah you come back from a mission and now okay while you were gone these biological resources you know processed this way if you're into FOBS this is happening now this development is done so you get to take this gun out and do that you know I mean like it's like **** this is amazing let alone going through and trying to check everything off the maps and boxes and side ops right like I'm playing Assassin's Creed Syndicate right now which I'm late on enjoying it but it's not as it's not as the loop isn't there in the same way you know what I mean like I'm like I want to clear this entire map and I look at I'm like well that thing's all the way over there and my train's all the way over there like how do I get over there easy yeah well I'll go look at what you know unlock this side of the other it's well it's not unlocking the way I want to or this and like I why why even buy that weapon if I keep upgrading this you know what I",
            "start": 1030.32
        },
        {
            "text": "I'll go look at what you know unlock this side of the other it's well it's not unlocking the way I want to or this and like I why why even buy that weapon if I keep upgrading this you know what I mean like whereas Metal Gear Solid was so clearly spelled out like here's what's happening and how it's happening and you were I felt like for a long time you have an abundance of resources right and then by the time you have to start making those tough decisions You' kind of taste tested everything so you know where you want to go do you see yourself platinuming it ever I do I'm going to platinum Metal Gear Solid The Phantom Pain uh it is going to be I'm not going to do it the way I thought I was going to do with Extra Life which was I'm going to sit down and beat it all no it's like cool tonight let's try to srank this Mission and get the task done and then put it aside and come back to it it's it's going to be a long play for me and do you think you're going to beat Syndicate I do think I'll beat",
            "start": 1064.48
        },
        {
            "text": "try to rank this Mission and get the task done and then put it aside and come back to it, it's going to be a long play for me. And do you think you're going to beat Syndicate? I do think I'll beat Syndicate. Syndicate is one of those two where it's like that's one I toy around with uh platinuming because it's one of those where I like this they don't have any multiplayer garbage in there and I like the collections, you know what I mean? Like I do like that and that's what I'm in the mood for right now. So like coming into a holiday break with it seems really good. The only thing that might stop me is that I want to go back and get all the uh DLC trophies for Batman which is like you know doing the challenge runs again in the Batmobiles with the different things like that. So that's GNA, that's what that'll be competing for time. And then it's also like well I want to play Life is Strange and I want to do this and I want to do that but when I just want to **** put on a podcast and",
            "start": 1098.48
        },
        {
            "text": "what that'll be what's competing for time and then it's also like well I want to play Life is Strange and I want to do this and I want to do that but when I just want to **** put on a podcast and chill out and go sync points and get treasure chest and check things off the map you know just like Rise of the Tomb Raider Assassin's Creed Syndicate's great at that and I really like the characters in that when I beat Syndicate which will be into the new year we should come back and have our own topic because I'm really really enjoying the game works for me have you played any more Metal Gear than just the opening mission no no comment on middle GE okay um Call of Duty Black Ops 3 you did a let's play did you ever get any further no I never got I never touched it that's that's always going to be like a holiday game for me um Ty uh liked what I played so far but I mean you know I don't have any any real comment on it other than to say that uh the game uh murdered at retail mhm",
            "start": 1130.12
        },
        {
            "text": "to be like a holiday game for me um Tim liked what I played so far but I mean you know I don't have any any real comment on it other than to say that uh the game uh murdered at retail mhm uh best-selling video game I think since 2013 I think I read damn that's crazy that's surprising right we were talking about when is the drop off when is the drop off uh Dying Light oo I still say dying light's like the best experience I had this year um and it's one of those games where I never beat it and you know I'd like to but I don't I again I saw the loop and I understand it it's a really it's it it reminds me of The Witcher and that it comes from a you know a team techland that never showed that they can make a game like this and um really appeared on the scene and frankly it's another game that makes Fallout not look very good um in its open world uh I like the setting it's like a Mediterranean kind of like Turkish kind of thing like you don't really see that uh in a lot of games",
            "start": 1161.64
        },
        {
            "text": "game that makes Fallout not look very good um in its open world uh I like the setting it's like a Mediterranean kind of like Turkish kind of thing like you don't really see that uh in a lot of games the parkour is really great it makes sense I remember I remember when I first played the game I was complaining about how you couldn't map and um buttons and then I realiz like wow the the you can't map the buttons cuz what I want to do doesn't even make any sense in in in the grand scheme of things it's a cleverly made game and I didn't know that they had it in them um and uh Dying Light benefited from when it was released because I think it would have been buried if it wasn't released then um but the zombie thing is kind of like tired and I get that and I'm **** over it too and like they're boring and all that kind of stuff and we I want new things for sure that that's true but you know it's it's a fun game you're crafting you're you're exploring you're doing side quests the characters",
            "start": 1208.64
        },
        {
            "text": "Boring and all that kind of stuff, and we. I want new things for sure, that's true, but you know it's it's a fun game, you're crafting, you're you're exploring, you're doing side quests, the characters are like zany and weird, the story is like a cool idea, there's like a real feeling of like imminent danger in the game too when you're out at night. Jesus, the game's like really the day-night cycle is scary, like you can get caught out in the in like way far away from where you need to be and like you can't do anything about it, yeah, like you just start running because the game gets impossibly hard at night. Um, great, yeah, so I think I think Dying Light's a fantastic game and it was definitely like the game that I love the most this year, um, for me it was a Fallout like what his was with Fallout where yeah I put I don't know 15 20 hours into it will say or whatever and it was like I get this and I really I'm so I can't believe that they did it either like especially being a Dead Island fan right.",
            "start": 1246.6
        },
        {
            "text": "yeah I put I don't know 15 20 hours into it will say or whatever and it was like I get this and I really I'm so I can't believe that they did it either like especially being a Dead Island fan right watching that series progress and whatever that this is so good not you know Mirror's Edge I thought the parkour really put me off it just wasn't fluid whereas this is totally not that you feel empowered you're running around having a great time and it was that thing though a while and it's like well I can play this another 20 hours and keep going but I understand what it is and I like what it is and I'm good Star Wars Battlefront I have to say one of the most fun games I've played I just keep wanting to play just little chunks of have you played more since we like when we were all into why have you not called me why don't you text me to play I don't know why don't you like me I don't understand I I don't like people dude I don't like the whole having to deal with people thing Kevin and I",
            "start": 1284.76
        },
        {
            "text": "not called me why don't you text me to play I don't know why don't you like me I don't understand I I don't like people dude I don't like the whole having to deal with people thing Kevin and I were playing a whole week together we did a whole week of the game it was great you could have there you invited me one time then I couldn't figure out how to do **** with it so I was like I'm done I'm just I'm just gonna keep playing by myself what you got to say k is Tim playing online are you no were you doing the single player Mission you haven't onl Battlefront took me totally by surprise I'm not not like let's let's go down the list of why I shouldn't care about this game not a huge Star Wars fan I like it enough but a great example of this is we're recording this the week Star Wars comes out and yesterday Christine and I were talking about we needed to buy for dinner this week and she goes well is there anything that's going to take us away from dinner this week and I go no I don't think",
            "start": 1322.24
        },
        {
            "text": "and yesterday Christine and I were talking about we needed to buy for dinner this week and she goes well is there anything that's going to take us away from dinner this week and I go no I don't think so let me look at the calendar I'm like no no oh Thursday we're going to see Star Wars: The Force Awakens like totally forgotten I you so not a huge Star Wars fan don't like competitive multiplayer usual don't play multiplayer to begin with really right and I don't even play first-person shooters all that often but when it you know the more and more we saw of this game and then when I watched uh Colin Moriarty's let's play and they were having such a great time with it I was like all right and then yeah sure enough got in there and it's the first time I've ever used party chat on PlayStation 4 me and Kevin running around having a great time being idiots calling each other debating what we he got the jetpack I'm like what's it like you know what I mean like all these different things it's like we talk about it a",
            "start": 1353.52
        },
        {
            "text": "having a great time being idiots calling each other debating what we he got the jetpack I'm like what's it like you know what I mean like all these different things it's like we talk about it a lot on I think Colin and Greg live the most of you know well it's it's casual right it's not aimed at Alfredo it's not aimed at that and like how's that going to play out and da D for me it plays out great of like it's the kind of first-person shooter where I've put it down and haven't played it uh since like right before Thanksgiving right but I feel like if you were gonna say we're playing tonight I'd jump back in I'd totally be in there the casual thing that's so right like for me I'm very casual when it comes to video games overall but specifically first-person shooters like that's just not my thing like I loved Halo back in the day and I loved that stuff but like once things once Call of Duty kind of took over and like there's all the perk systems and the leveling up and all that stuff I",
            "start": 1386.48
        },
        {
            "text": "thing like I loved Halo back in the day and I loved that stuff but like once things once Call of Duty kind of took over and like there's all the perk systems and the leveling up and all that stuff I don't even know that like I don't even understand how that all works so this with Battlefront it's kind of a cool way for me to play where it's like it's like you know you always talk about Pokémon being like baby's first RPG I feel like battle a lot of ways is just like it's hey here's an easy way to introduce you to what modern first shooters look like and I'm like oh **** I actually like this I like playing and leveling up and all that stuff whereas being an outsider of it before I was like oh that sounds like a grind that doesn't sound fun at all but it's like it's not intrusive and it's cool and you do feel a sense of progression and uh even you don't need to be good that's the thing is you just have fun even when you die it's like it's not like you're out of the action forever like",
            "start": 1418.72
        },
        {
            "text": "cool and you do feel a sense of progression and uh even you don't need to be good that's the thing is you just have fun even when you die it's like it's not like you're out of the action forever like exactly you're right back in and that's the thing is like it can go I guess spawn to spawn you know one spawn you come out and just get your teeth kicked in and then another time you can actually post up at a good location or something you figure out this great like place where everybody's going to choke and you're going you know what I mean like I always felt like I was in it even when my team's getting decimated I'm just happy to try to work my way towards the middle or top of the pack right I'm like right there it's like awesome historically Kevin and I are the worst people every time on our team but when we're not we're like oh man good that was great and that's I love that and it's you know so many people hate it because like oh is it worth $60 or whatever and it's like I",
            "start": 1454.8
        },
        {
            "text": "Time on our team but when we're not, we're like, \"Oh man, that was great.\" And that's I love that. And it's you know so many people hate it because like, \"Is it worth $60 or whatever?\" And it's like, I can't even comment on that; I don't know. Is it probably not? But like, I'm having a lot of fun when I do play it. And it doesn't need a million modes for me to have fun with the modes that I'm playing. Um, so it's great and I love that during every match, like the the music will kick in, like when it's like the final like 20 kills or 50 or whatever it is, like when it's close to the end, like Star Wars music starts playing, and you're just like, \"Yeah!\" This is so... Star Wars. You get 10 kills and no deaths; I'm like, \"Wadd's up?\" Greg, this is probably just for you, Destiny: The Taken King. Oh yeah, I had fun. You know what I mean? I had been playing Destiny originally comes out last year; I play it at launch for a good number of hours, get up to 22 or whatever, which is at the time...",
            "start": 1486.28
        },
        {
            "text": "King, oh yeah, I had fun, you know what I mean. I had been playing Destiny originally comes out last year, I play it at launch for a good number of hours, get up to 22 or whatever, which is at the time getting close to the ceiling or whatever, and then yeah took the weekend off, everybody got amazing started raining and I came back and I couldn't, you know, I was like well whatever fell off, everybody got it continues to be crazy about it, and then Taken King came out, it was like it's a story and it's this and it's that, and I'm like all right cool, and like jump back in, I only played it again for like a week, you know what I mean, still haven't raided, I'm just running around doing all that stuff, and it was like totally this is fun, it's more game than it was before, and it's it is that thing of in a different reality where I have a normal job, I'm playing Destiny nightly, and I'm going on raids, and I'm having a great time, you know what I mean, like I enjoy that kind of gameplay, I enjoy you know that.",
            "start": 1526.6
        },
        {
            "text": "reality where I have a normal job I'm playing Destiny nightly and I'm going on raids and I'm having a great time you know what I mean like I enjoy that kind of gameplay I enjoy you know that that was my big thing with Halo which we'll talk about when we get to Xbox right but when I was playing Halo with Stimer on Co-op I was like yeah this is all right but like why don't we just play Destiny you know what I mean like I'm invested in my character and my gear and my Exotics and all you know what I mean like I'd rather if I'm going to play that kind of game I'd rather play that game I'd rather play that and T King does a great job of spicing stuff up and putting things in making it more approachable you know what I mean like I keep trying to push my friend Po to buy a PS4 and if he does then I'm G to get him take a king and then we would just go off and do that because he can just jump to pretty much right where I am we can go Just Cause 3 just JC you played any more",
            "start": 1564.4
        },
        {
            "text": "if he does then I'm G to get Gettys take a king and then we would just go off and do that because he can just jump to pretty much right where I am we can go Just Cause 3 just C you played any more than just the Let's Plays I played like I installed it I deleted it B I did a bunch yeah I did a bunch of I mean a handful of the early missions I played maybe an hour and a half of I like it more than like Just Cause 2 Just Cause 2 came out I remember and Colin was like this game's awesome I was like yeah and I took it home and I was just like I don't like the movement system and it all this is is blowing stuff up and I'm like whatever there's no personality to this but I get why people dig it don't get me wrong not my kind of thing and so the more we saw for Just Cause 3 of course I hosted a panel at PAX and we actually showed the destruction I oh okay this looks like it's more of Just Cause 2 but when you pop it in like it opens with that like B it's like this cinematic like they're",
            "start": 1602.36
        },
        {
            "text": "a panel at PAX and we actually showed the destruction I oh okay this looks like it's more of Just Cause 2 but when you pop it in like it opens with that like intro it's like this cinematic like they're introducing goofy characters and this and it's fun like okay good now it feels like they've taken the crazy ass gameplay and combined it with a crazy ass story and it's like okay now I'm in Just Cause 3 reminds me of what I remember Grand Theft Auto III being when I first played it I'm just like you could do anything and it's crazy and blah blah blah but it's like really in GTA III now modern times you look back and it's like oh you're pretty limited on what you can do but this you really can do any of dumb ideas you had and anything could explode and I **** love that yeah and that's the thing I don't think I'm going to pick it back up you know what I mean I played a couple maybe an hour I don't even know and and it's same thing of like I like how they took the story and they merged it",
            "start": 1644.32
        },
        {
            "text": "I don't think I'm going to pick it back up, you know what I mean? I played a couple maybe an hour, I don't even know, and and it's same thing of like I like how they took the story and they merged it with this crazy gameplay but it's like for me like I I for me for a collectathon open world I want to do something like Assassin's Creed where I'm clearing this off and doing that and oh hey I know I'm talking to Charles Dickens and Charles Dickens is telling me things neat you know what I mean, shout out to Charles Dickens yeah definitely always Colin yeah Lego Dimensions just playing Greg yeah Lego Dimension like a **** nerd I just I just popped it in a couple days ago to finish off my Doctor Who DLC trophies and stuff also to try out the Superman they gave me, shout out to John No it's awesome I mean it's Superman you know what I mean like that so that's the thing about Lego Dimensions dial it all the way back to the beginning of the year when they put out the teaser trailer for it",
            "start": 1681.88
        },
        {
            "text": "Awesome, I mean it's Superman, you know what I mean, like that so that's the thing about LEGO Dimensions dial it all the way back to the beginning of the year when they put out the teaser trailer for it remember and we were on Colin and Greg live and I was like Colin's like what do you think of this I'm like there's a million toys of life games I don't know I need to see more if they put Superman or Ghostbusters in I'm in and then the chat was like they teased them at the end of that trailer I'm like well I mean **** and then it was at ComiCon where I sat down and actually got a demo from Arthur and saw the game and the Doctor Who people were there and I'm watching I'm like oh it's the LEGO game gameplay with this toy like I don't know what I was expecting what I was thinking but I I was thinking more along the lines of like that LEGO uh not MMO uh Builder Minecraft thing that's on PC or whatever which isn't like the LEGO game you know you know what I mean whereas this was the LEGO",
            "start": 1718.16
        },
        {
            "text": "thinking more along the lines of like that Lego uh m not MMO uh Builder Minecraft thing that's on PC or whatever which isn't like the Lego game you know you know what I mean whereas this was the Lego game I knew but it was all the different Lego games shoved together you know what I mean and I keep going back to like at the Comic-Con thing I'm watching they're putting characters on and like their Huds are changing and they look like the ones pulled from Lego Batman or Lego Jurassic World or whatever I'm like that's rad that's really cool and then when they came through and did the thing here and showed Back to the Future and I'm just nerding out over and over again because it's like you're driving around Hill Valley and it's like they're playing Power of Love on repeat and then you know you in the open world that isn't even connected to or the Hub world that isn't even connected to the story you can go between you know 85 the future and the past and and I'm like this is",
            "start": 1750.36
        },
        {
            "text": "know you in the open world that isn't even connected to or the Hub world that isn't even connected to the story you can go between you know 85 the future and the past and and I'm like this is and I eventually you know the developer turns to me he's like yes it's as if we care and it's like right you guys do you know what I mean and so that was when it was like fever pitch height for me of just like if they treat every franchise this way then like that's **** incredible and then you get I got the game and played it and they did you know what I mean and for me it was even this weird thing of like I don't like Scooby-Doo particularly I don't hate him or anything you know what I mean I'm a big Scrappy-Doo fan but like Scooby-Doo is not my cup of tea but like even his level was fun and like it was weird to see it work in Reverse too which you know we always talk about when we talk about games bringing people to different things where I've never watched a Doctor Who",
            "start": 1785.0
        },
        {
            "text": "We was fun and like it was weird to see it work in reverse too, which you know we always talk about when we talk about games bringing people to different things. Where I've never watched Doctor Who before, but Doctor Who is involved in the story of Lego Dimensions, even if you just have the base pack with the three guys or whatever right. And so when we went to his world and fooled around with him, I finished off and I was like, \"Huh.\" Tweeted about like what Doctor Who episode could I should I watch and got recommendations, and watched Doctor Who on Netflix, you know what I mean? Like then I was motivated to buy the level pack. And it's this weird thing of like it's this great mix of the gameplay I love of Lego games, which you know, you have the humor of Lego games, and then a reason now to play with Legos if that makes sense. Cuz you're like, \"I bought you know I have the Lego Ghostbuster car over there, the Ecto one,\" you know what I mean? I've never put it together cuz where the **** am I going to put",
            "start": 1820.92
        },
        {
            "text": "if that makes sense cuz you're like i bought you know i have the Lego Ghostbusters car over there the Ecto one you know what i mean i've never put it together cuz where the **** am i going to put in our apartment you know what i mean but one day i will when i have my own place and i'm going to buy the firehouse and never unpack it and have it ready to go but this is the perfect thing of like playing that game and okay you start and in the first 10 minutes of it it's like okay stop playing our game the directions are on screen let's build your portal and you sit there and you build and you you get that the you know putting the blocks onto a base and it's like i haven't done this in years and this is so much fun you know what i mean it's so goofy and fun and then going through and every car has its like three different variants it's like when i'm changing i need i want the the time machine to be a hover car the directions pop back on screen of how to rebuild it you don't have to but i",
            "start": 1855.44
        },
        {
            "text": "Has its like three different variants it's like when I'm changing I need I want the the time machine to be a hover car the directions pop back on screen of how to rebuild it you don't have to but I do it every time because it's just fun to play with Legos you know what I mean like it's this awesome mix that I'm like it's for me I've played Infinite I like not you know extensively I've played enough Infinity here and there uh and then I've played Skylanders in the same respect and this is for me more active but it really just comes down to having the franchises I love you know what I mean a big fan of Lego to good is Harry Potter ever going to be a thing? Not confirmed, there's a there's this I'll give you a link to the website I can't remember off top of my head but there was a Lego Dimensions fan site that I was on their podcast and uh he had a leaked thing of what like this like coded thing looks like Harry Potter's in wave or next wave or whatever season but yeah of",
            "start": 1888.8
        },
        {
            "text": "a Lego Dimensions fan site that I was on their podcast and uh he had a leaked thing of what like this like coded thing looks like Harry Potter's in wave or next wave or whatever season but yeah of course of course Harry Potter is going to be in good then we got Tony Hawk's Pro Skater five Tim how you feeling on that b boy biggest disappointment of 2015 period wow yeah it's so sad we knew it was not going to be good I didn't know it was going to be that bad you didn't know it be that bad that's always the worst when you're like this will't work out but and it's they patched it and I tried going back and the patch didn't really fix too much um it it it definitely improved the game but it just brought that up from like horrible to like little bit less horrible um it added Ninja Turtles so that is a plus I'm a big fan of Ninja Turtles um glad there's a silver lining to yeah I don't know it's just like it's It's upsetting because like it did you know I try to be optimistic about stuff and",
            "start": 1926.0
        },
        {
            "text": "Is a plus I'm a big fan of Teenage Mutant Ninja Turtles. Um, glad there's a silver lining to yeah, I don't know. It's just like it's It's upsetting because like it did you know I try to be optimistic about stuff and even that game there was stuff I liked about it. It was fun playing with Tony Hawk again and like having the music play. It felt like a Tony Hawk game - like just in tone and and look and all that stuff. It's just just wasn't good, and um, I wish I wish it was better because that that I think ruined the Tony Hawk franchise from ever having a chance of being good again. I think that this would have been its one shot at redemption after the Skate peripheral games full of Technology. Tony Hawk, real quick, sorry. Brickinquirer.com - brick inquirer. I didn't know it's one of those things you know that the kids who run that site were listening like no say the name it uh and then Transformers Devastation which did not disappoint me when I thought it could have so that was uh those both those games came out like",
            "start": 1969.6
        },
        {
            "text": "run that site we're listening, like no one says the name, it uh and then Transformers: Devastation which did not disappoint me when I thought it could have so that was uh those both those games came out like the same week and uh it was hard for me because I was like I was wrong about both uh but with Transformers it was it was fun it was very short which I like I wanted to just that quick experience I think was full price no okay no no and um it it was really cool and I never thought we'd play a Transformers game that nailed the Transformers cartoon that much like it was really you kept describing it like it was like you'd be how you would play with it on the carpet it was like ramming raming toys together and it's again it's how you remember the Transformers cartoon even though even the battles in that show were not that good yeah um but it's like they nailed the aesthetic they had all the voices and they nailed the the stupid plot of the game where it's like Megatron's taking over the",
            "start": 2014.16
        },
        {
            "text": "in that show were not that good yeah um but it's like they nailed the aesthetic they had all the voices and they nailed the the stupid plot of the game where it's like Megatron's taking over the world it's just like it it was just throughout the whole thing it was good there was like a lot of nice little hints and teases at potentially a sequel but is going in a direction that I totally would like um so that's good and I also think that it's it opens the door for things like a Ninja Turtles game being made by Platinum in that style nice that looks like the 80s cartoon in the same way that Telltale Games you were saying a couple episodes ago can kind of tackle games from a different perspective and make it more story based instead of like action like you can finally get a Batman game that's about Batman yeah um I feel like this kind of opens up a the licensed arcade games from the 90s to kind of make a return in a more modern format gotcha um where we actually get a Turtles 80s cartoon game",
            "start": 2058.16
        },
        {
            "text": "Batman yeah um I feel like this kind of opens up a the licensed arcade games from the 90s to kind of make a return in a more modern format gotcha um where we actually get a Teenage Mutant Ninja Turtles 80s cartoon game so I like that a lot then we got the music games Rock Band 4 and Guitar Hero Live yeah both of them I've had ups and downs with sure both of them when work I enjoy when Guitar Hero Live works and I can get it to sync I actually love that game I think it's really fun and I like how frustrated I get with it because I'm not good at it and I want to get better then you play the songs and I loved that it reminded me of the old games where I didn't know a lot of the music and then I heard it I'm like I like this there's the discovery aspect Rock Band did not have that Rock Band was very much like I've done this before and it was fun doing it again for about an hour and then you're like all right I'm done like I don't I don't need to do this and whether it's the drum s or the guitar or whatever um",
            "start": 2100.04
        },
        {
            "text": "done this before and it was fun doing it again for about an hour and then you're like all right I'm done like I don't I don't need to do this and whether it's the drums or the guitar or whatever um it was my friend's birthday we kind of like all got around and had the the band together doing the thing and it was fun and then we busted out Guitar Hero and we had more fun with that really that's interesting yeah cuz it was new and it was fresh sure and that that's the thing for us I feel like you know we were Colin and I in particular were stoked for Rockman 4 when we knew it was coming and it got here and we set it up and it was immediately like our DLC is not working for some reason even though it's supposed to the song The set list packed in sucks and this is like the exact same tour mode and rewards and story beats and it's just like this feels just like Rock Band which I was over a couple years ago and I'm not ready to jump back into and we put it down and never picked it up again",
            "start": 2150.0
        },
        {
            "text": "and rewards and story beats and it's just like this feels just like Rock Band which I was over a couple years ago and I'm not ready to jump back into and we put it down and never picked it up again gave it away yeah and then Guitar Hero came and yeah I unboxed it one night when I was in between games I like to play and I jumped in and yeah I played it and I was like oh this is fun like I like the guitar TV I thought was poorly explained you know leading into it or stuff so when you sat down and did GH:TV I was like oh this is cool and then yeah like the set list I remember reading on Colin's and GG Live and Colin saying well that's like marginally better than Rock Band but then when you got into GH:TV you can go and like play songs that aren't on the set list you know the set list quote unquote but are there for you to jump in and spend your credits on that you are earning in the game I never had to give any real money even though I'm sure if you play for years or something you'd have",
            "start": 2186.28
        },
        {
            "text": "but are there for you to jump in and spend your credits on that you are earning in the game I never had to give any real money even though I'm sure if you play for years or something you'd have to but like yeah I was like oh this is cool and this is fun but it was another thing and it was that I liked the challenge that all of a sudden it was something completely different I had to focus on getting you know these six buttons down or whatever but same thing of like put it down and I was like okay and I've never picked it back up yeah had a good weekend with it yeah I mean I think it's one of those things where I will randomly pick up every once in a while when I'm just like at home and I look over at the guitar I'm like yeah it's time to rock out but it I I did enjoy Guitar Hero here I think overall Rock Band I'm like eh I don't know if I'll ever even play that again but I will play Guitar Hero again and that's I enjoyed Guitar Hero way more than Batman Arkham Knight ah Batman",
            "start": 2221.24
        },
        {
            "text": "Overall, Rock Band. I'm like, eh, I don't know if I'll ever even play that again, but I will play Guitar Hero again and that's I enjoy Guitar Hero way more than. Yeah, um, Batman: Arkham Knight. Ah, Batman: Arkham Knight thoughts - I enjoyed Batman: Arkham Knight, another Platinum this year for me. Um, yeah, I mean looking back on it, I feel like I talk not more negatively but I think the things that I immediately jump to are my cons with it. Right? I mean, the pros are it's beautiful, it's more Batman, it's a system of combat that if you've played before obviously and if you love it, you're still going to love it here, and I loved so much about it. But then when I talk about it, I always come down to I hated the Bat-tank parts - the tank parts only they kill 36 things strafing back and forth like this is stupid, this isn't Batman. Whereas driving the Batmobile, ramming cars off the road using it to get a location, totally down with. I enjoyed that part of it, but just the force tank parts that felt like...",
            "start": 2252.32
        },
        {
            "text": "Isn't Batman whereas driving the Batmobile ramming cars off the road using it to get a location, location totally down with. I enjoyed that part of it, but just the force tank parts that felt like or every other mission I was getting forced to **** take out 36 guys or whatever it was, and then the story for me is still not - it's not that I'm hung up on it; it's just that it was presented all wrong for Batman hardcore fans. I feel you know what I mean. I'm not going to spoil it as I I will not spoil it or whatever, but like they telegraphed way too early, you know what I mean - like they build up to this reveal of what's happening and I knew it; I mean it's hard to tell how long that game was, I knew it 7 hours before 6 hours before, like you know what I mean, like literally upon this character's introduction I was like uh oh **** that sucks cuz you said it wasn't going to be like that but there it was like that, but the whole problem is if they would have said from the beginning it's this",
            "start": 2298.24
        },
        {
            "text": "introduction I was like uh oh **** that sucks cuz you said it wasn't going to be like that but there it was like that but the whole problem is if they would have said from the beginning it's this I would have been like oh cool and then my expectations would have been set correctly waiting for a twist exactly rather than waiting for the twist and they do some amazing stuff in there I feel with like **** with perspectives again not spoiling things and screwing with your mind and like awes there's like so much great there but I'm hung up on these two parts that I just like loved the game uh yeah loved the game Platinum it it's the first Arkham I've ever platinumed before I've tried like no I'm going to go get the 230 Riddler trophies in Arkham City and played it for two seconds like this sucks I'm not doing that whereas in Arkham Knight I enjoyed going around getting them granted granted I did after the fact you know after my before my new game plus playthrough or whatever",
            "start": 2337.72
        },
        {
            "text": "I'm not doing that whereas in Batman: Arkham Knight I enjoyed going around getting them. Grant-ed, I did after the fact, you know, after my New Game Plus playthrough with it or whatever. Uh, enjoyed that and then like I know this is always a sticky situation. I enjoy the DLC still, you know what I mean? Like I bought the season pass, I enjoyed the back girl content, uh, I got all the trophies in that and then you know these character interstitials are short which I expected based on how these DLC bonuses have always worked when they're like you know get play a Harley Quinn map or whatever you know what I mean. But what I didn't expect is that when they get me back in to do those missions for the 15, 20, 30 minutes or whatever it takes, it's then I look at that and now there's a Batman v Superman Batmobile and there's a silver trophy attached for getting the Stars yeah I'll do that or now there's a new skin for Robin in his 60s thing yeah I'll go do his.",
            "start": 2372.36
        },
        {
            "text": "now there's a Batman v Superman Batmobile **** and there's a silver trophy attached for getting the Stars yeah I'll do that or now there's a new skin for Robin in his 60s thing yeah I'll go do his challenge rims and sure then I'll play it trying to get the 31 like there's this weird gameplay Loop that I didn't expect in that let alone the fact that now the one thing I can't comment on hopefully it's out by now because it's supposed to be out by the end of the month is season of infamy which is the five Super Villains which is supposed to be a metropolis pack but I don't really know what I'm getting into that but I'm surprised that I've come back and done so much with it because even with Arkham City it was like they're going to give you a new challenge I'm like **** that don't care and then it was like here's the Harley Quinn DLC story explanation okay cool played that and I never went back you know what I mean it's interesting uh I think uh I think Batman: Arkham Knight is overrated",
            "start": 2410.92
        },
        {
            "text": "It was like, here's the Harley Quinn you know DLC story explanation okay cool played that and I never went back you know what I mean. It's interesting uh I think uh I think Arkham Knight is overrated um it was one of the few games that I beat this year. I think that it's got unparalleled storytelling. I think its presentation is unparalleled. I think its gameplay is boring um and I I I just had a hard time making parallel its brilliant storytelling and its character development and all this kind of stuff that I really wanted to like and enjoyed to like the just mash buttons kind of gameplay that I think is boring and old now and um I just don't feel like it's skill-based. And I know that a lot of people disagree and that's totally fine but I just think and everyone's like well look at all the things that were added after this and I'm like that doesn't necessarily make it good or imaginative cuz it's really not like there there's all this tech in the game and all this.",
            "start": 2441.88
        },
        {
            "text": "look at all the things that were bottled after this and I'm like that doesn't necessarily make it good or imaginative cuz it's really not like there there's all this tech in the game and all this these things you get they don't really need to use you run into the guy with the the the gatling gun you deal with him the same exact way every time you run into the guy with the shield you deal with him the same exact way every time it's like I'm just like ah like you you look around and there's like six guys four of them have guns so you use your thing to disable their guns that's taking care of that guy with the shield you know you have to do the certain button combination to get his shield off of him then you punch him in the face and you knock him out it's like I just don't feel feel like there was I don't feel like the gameplay loop is parallel in quality to everything else in the game and that's really disappointing to me because I really feel like they made an exceptional game it's",
            "start": 2487.76
        },
        {
            "text": "there was I don't feel like the gameplay Loop is parallel in quality to everything else in the game and that's really disappointing to me because I really feel like they made an exceptional game it's just not fun like I I really like I I just didn't find it like to be to be fun I do think that Batman: Arkham Knight's side quest system especially is brilliant I love the idea of um organically running into things you have to wait and be patient you don't really know how to like I I especially like the Firefly ones with the with like when the the firehouses are on fire and you have to like you just see it in the distance you know he's there and you have to chase him around or um you know the ones with the murders where you like hear the music the opera music and you have to like go and investigate them and stuff like I think there's a lot of really clever stuff in there but like every time I had a fight I was like Jesus like I I just I'm like this isn't there's got to be it's something better",
            "start": 2516.72
        },
        {
            "text": "them and stuff like I think there's a lot of really clever stuff in there but like every time I had a fight I was like Jesus like I I just I'm like this isn't there's got to be it's something better than this that I I really feel is more skill-based I know a lot of people like Visceral disagree with me out there but I just don't feel like it's that clever anymore you know and and uh this game suffered for the same reason Fallout 4 suffered like this isn't new anymore m you know like uh Arkham Asylum and when lesser at Arkham City were really really resonated with me because they were so different and now I want to see them do something again and like the bat tank stuff like all these things that tried to differentiate the game from the previous two games or three I didn't play Origins but um I was like this is a waste like I found the tanks to be tedious I found the AR missions to suck I like so there was like all this cool stuff in there I love the bank like the stuff with the bank",
            "start": 2554.68
        },
        {
            "text": "was like this is a waste like I found the tanks to be tedious I found the AR missions to suck I like so there was like all this cool stuff in there I love the bank like the stuff with the bank heists and and yeah two-face and I love like the the man-bat thing where you had to like chase him down and like inject him with I was like this is so cool like I would rather just watch this mhm you know like then then have to do the same fights over and over and over again I just I just the lack of boss fights in the game especially I think was I know that some people didn't really like the boss fights I know some people found them tedious I think in Arkham City specifically if I remember correctly um right maybe it was even Arkham Asylum I can't even remember anymore the B the boss fight I'm thinking like Mr. Freeze was Arkham City yeah like so I know that some people didn't like that kind of stuff but I think it like adds a little bit of imagination to the game and a little",
            "start": 2596.32
        },
        {
            "text": "like Mr. Freeze, I think was in Arkham City, yeah, like so I know that some people didn't like that kind of stuff, but I think it like adds a little bit of imagination to the game and a little bit of like some difference in some nuance, um, that I don't think was there, so Arkham Knight I think is like a game that just exists, and and and I know that Rocksteady can do better than that, you know, that's I mean that's that's my opinion, I know it's not a popular opinion, so you know calm down out there, but that's how I feel about it, so moving on to your game of the forever Mad Max, Mad Max, you want to talk about the game that does that does have great gameplay like and this is and this is the this is the brilliance of Mad Max and why I want more people to enjoy I know people out there have played it is that there's it's really dynamic because it has that like button mashy blah blah blah Batman stuff that's like really not very fun, um, but I think the car combat's actually like",
            "start": 2636.12
        },
        {
            "text": "have played it is that there's it's really dynamic because it has that like button mashy blah blah blah Batman stuff that's like really not very fun um but I think the car combat's actually like what's really cool about it uh the idea of like chasing down Caravans and using all these weapons that your disposal like the spikes on your wheels and like your your your grappling hooks and all sorts of **** it like really does capture the essence of like Mad Max car combat um it's a collectathon and a clearon it's an Ubisoft game even though it's not a Ubisoft game so it's like so it's it's it's like very Far Cryer Assassin's Creed huge map territories you like Whittle them down get rid of these towers find these guys kill these guys kill this trade route take over this compound it's very Far Cry um but I think that it's just there's something really cool about that world and I will say again with the exception of maybe Journey uh I don't think a desert has ever looked better in a video",
            "start": 2669.8
        },
        {
            "text": "Far Cry, but I think that it's just there's something really cool about that world and I will say again with the exception of maybe Horizon uh I don't think a desert has ever looked better in a video game ever than it looked in Mad Max I just feel like that that world and its desolation um its destruction its hopelessness I think it was captured beautifully in that game I think Avalanche deserves a lot of credit I think Avalanche is getting a lot of **** maybe for Just Cause from some people people are forgetting that Avalanche also made Mad Max and I think um I think it's a pretty special game we we we play it up or I play it up as being like this fantastic over the top game I think it's just a really rock solid game and um if you're into just checking boxes and that's like why a lot of us play games I think that's why people play Assassin's Creed we were talking about that before that's why I play Far Cry and I **** love Far Cry I can't wait for Far Cry Primal one I think uh the",
            "start": 2707.52
        },
        {
            "text": "us play games I think that's why people play Assassin's Creed we were talking about that before that's why I play Far Cry and I **** love Far Cry I can't wait for Far Cry Primal one I think uh the the idea of just seeing progress Beyond just the storyline is really quite satisfying so to have all these things in Mad Max that you can do or not do in addition to the storyline the side quest finding caches of of goods and Diaries and looking at the world before it was destroyed and learning a little bit about about Max himself um I think Mad Max is one of those games that really I think surprised some people that really went into it with an open mind I and and I don't want to say a lot of people didn't go into it with open mind I think a lot of people just didn't go into it at all and that was one of the things that I think was really disappointing because I think that that's really one of the better games of the year that was yeah for historical sake that was the one that came out on",
            "start": 2746.32
        },
        {
            "text": "Was one of the things that I think was really disappointing because I think that that's really one of the better games of the year that was yeah for historical sake that was the one that came out on the same day as Middle-earth: Shadow of Mordor, yeah and so it was like a lot of people went the other way, yeah Rise of the Tomb Raider had the same issue. Mhm, uh Life is Strange did any of you play it? I played episode one, enjoyed it, thought it was interesting and was looking forward to the rest but they all kept coming and I was like got to that Colin point of view where I was like I'm just going to wait so now I've heard amazing things. Christine loved it, Alexa loves it, like I'm stoked this break that by the time you see this maybe I've already done it like to go through and play all of them I wanted to it looks awesome it looks right on my it's definitely an awesome story from that one episode like where they set it up you're like oh man Tales from the Borderlands, one of my biggest surprises probably my biggest surprise of",
            "start": 2782.16
        },
        {
            "text": "on my it's definitely an awesome story from that one episode like where they set it up you're like oh **** Tales from the Borderlands one of my biggest surprise probably my biggest surprise of the year like I you know coming oh not I guess no not 100% but like one of my biggest surprises of the year and the fact of like it got announced and I remember going what the **** you know I mean what a weird pick like I play all the I've played all the Borderlands right and I've never been like this is such a rich world I can't wait to have a story told in it and you're **** shooting psychos in the head and running around and like how how's Telltale going to put a game the whole thing is collecting guns and shooting why would this be interesting and then downloaded it ignored it for two or 3 weeks and then it was like I was having not not a I we had like a rough day at work and I was really **** shot and I sat down nothing I had I actually wanted to play like it wasn't hitting the spot",
            "start": 2817.6
        },
        {
            "text": "weeks and then it was like I was having not a good day at work, I was really burnt out, and I sat down thinking nothing of it. I had actually wanted to play something else, but it wasn't hitting the spot, and I saw that I'd give this a shot. Two hours later, I laughed out loud a bunch during that episode. I loved the characters, the performance, the stories - everything was interesting. And every time an episode came on, something like that happened. There are just so many moments in that game, as far as dialogue and storytelling, that I'll never forget - like Loader Bot. To be honest, it's a mixed bag; some of it is the funniest stuff ever, and then there's Gordis and all this other different stuff. It was like, man, talk about out of left field - you know what I mean? Like, I had zero interest in that game for real, and then it was like okay, well I'll try it, and here we are. Yeah, Evolve happened this year... um, what's Combat X? You're just going to skip over Evolve? Do you have anything more to say about it?",
            "start": 2851.92
        },
        {
            "text": "for real and then it was like okay well I'll try it and here we are yeah Evolve happened this year um what Combat X you're just going to skip over you do Evolve dirty I do you have anything more to add a sad a sad story for Evolve that I don't I think was predictable you know what I mean we played it at events I had great time every every time I sat down was the Monster and I was playing my friends in one room I was like this is awesome and I'm like I'll never do this when it comes out like no you know what I mean like because there's way too much like it's the antithesis in terms of like casual to hardcore that Star Wars is right you guys could call me at any point be like I'm want play Star Wars I'm like oh maybe I will maybe I won't depending on my day but Evolve it's like I'm not I'm really good at being a Trapper but you've never played before so I need a heal you know what I mean it's like it's like I'm getting to like MMO range where I want a really good squad to go",
            "start": 2892.04
        },
        {
            "text": "not I'm really good at being a Trapper but you've never played before so I need a heal you know what I mean it's like it's like I'm getting to like MMO range where I want a really good squad to go out and roll not to mention it just doesn't work like the reason Left 4 Dead worked so well I felt was the fact that hey you guys want to jump on line and just shoot **** zombies tonight like you don't even have to pick up whatever gun you want don't worry about it have fun whereas this one is all about communication and collaboration and how we're going to make this work and da da da and it's a new IP and it's this weird thing and it's it came out and it just didn't do anything yeah uh Mortal Kombat X did you guys play at all no no we did let we did a let's play or two on it and I played a couple times just outside of that but Mortal Kombat has never really been my thing but people like it big fans like it h 100 pants big fan of of Mortal Kombat X I'm glad people like it um",
            "start": 2936.12
        },
        {
            "text": "a couple times just outside of that but Mortal Kombat has never really been my thing but people like it big fans like it huge fan of of Mortal Kombat X I'm glad people like it um Mega Man Legacy Collection got to give a shout out to that yeah I mean in terms of games released in terms of gameplay no game came out this year that has better gameplay than the games on that collection but we've we've uh not even close but we've uh you know we've seen these games many times so there's nothing really new to say about them I mean it was a great collection it's cheap the the challenges are good it's funny watching people just get eviscerated by that game they they just they like they just they just don't know Kevin you know I mean they don't understand they don't know they don't know what it is for a game to really challenge you like really challenge you you have to be patient and uh play the game the way it's meant to be played uh I think the challenges were a nice little",
            "start": 2970.0
        },
        {
            "text": "know what it is for a game to really challenge you, like really challenge you. You have to be patient and uh play the game the way it's meant to be played. Uh, I think the challenges were a nice little addition - they're **** hard, some of them are extremely hard. It's cool that you can watch the replays um of the people that are on the top on the leaderboard so you can try to replicate what they're doing um and kind of get new strategies and new skills whatever um. And I'll give myself a shout out because my Mor AR's test will be in the 3DS version of the game, yay! You know, expanding the vast library exactly. Oh, it's needed. Final game Rainbow Six Siege - I've been hearing really bad things about it. I don't know, it's just it's super anecdotal because I don't I've only talked to a few people about it but everyone I've talked to or like heard anecdotal stuff like \"don't like it\" like I I don't I don't know. Surprising me because we played it when we were at GameSpot, yeah and uh I don't",
            "start": 3008.6
        },
        {
            "text": "about it but everyone I've talked to or like heard anecdotal stuff like don't like it like I I don't I don't know surprising me because I we played it when we were at GameSpot yeah and uh I don't play multiplayer games I definitely don't play team team based games but but um I thought it was fun yeah like I I don't I don't see what could have been wrong with it other than maybe like technical problems that we were having like matchmaking and stuff like that which I assume has cleaned up so I don't know what you guys have heard about it but I haven't heard the most positive things about it my whole thing is that I've heard nothing about it it feels like you could tell me that the beta was released I'm like oh that makes sense I've seen Alfredo tweet about it but that's it I've seen Alfredo tweet about it like there doesn't seem to be this giant presence to it of like Rainbow Six Siege is out cuz people love Rainbow Six you know what I mean we all those days of playing rainbow Rainbow Six",
            "start": 3045.64
        },
        {
            "text": "\"Tweet about it like there doesn't seem to be this giant presence to it of like Rainbow Six Siege is out cuz people love Rainbow Six, you know what I mean? We all those days of playing Rainbow, Rainbow Six, Rainbow 6: Vegas was my yeah as I've said many times I **love** that game, you know, like love it. It was my most played Xbox original Xbox game and the game that I used to that I like introduced me to Xbox Live, this is 2003 I guess 2004, um fantastic game, fantastic, fantastic, impeccable game, um but it's just not so much for me anymore yeah but even with Siege though I remember when we were at IGN like that was the talk of E3 when it was first announced and uh yeah cuz you get excited for it and becomes this thing I think it won Game of the Show E3 did it that year, think so, I think it did, I don't know, I said it like that like I can't believe it then I because I remember I Remember The Witcher kept winning the game never came out um all right moving on I'm moving on to\"",
            "start": 3078.64
        },
        {
            "text": "Did I don't know, I said it like that, like I can't believe it then I because I remember I Remember The Witcher kept winning the game never came out um all right moving on I'm moving on to PlayStation yeah you guys might have a thing or two to say about this we're kind of reviewing the year of PlayStation exclusives exclusives yes let's start with the Vita all right okay the only two games I have on the list that I could find are Danganronpa Another Episode: Ultra Despair Girls and Persona 4 Dancing All Night ah yes did I miss anything I mean I have some games on my list but nothing major here no nothing major uh yeah there weren't there weren't I mean there were many more many games yeah or games were on PS3 as well well the big thing is PC games that finally made their way over or whatever that's where it gets sticky you know what I mean but you're talking about like straight up PlayStation or just whatever it meant to you guys this year like what did you",
            "start": 3117.92
        },
        {
            "text": "Way over or whatever, that's where it gets sticky. You know what I mean? But you're talking about like straight up PlayStation or just whatever it meant to you guys this year - like, what did you play on it? Meant to me, oh okay, that's a different question. Uh, dang RPG... uh, I played it for 10 hours or so; it's still in my VA. Um, I mess with it every so often because I'm trying to get everything in the game because I want to Platinum it. It's weird; it's a weird game. I'm not quite sure what they were thinking with this game. Um, I mean we know what Kadokawa and those guys were thinking - they wanted to do... they wanted a stepping stone, a dang RPG 3, and I don't think they were ready for it yet, so they made a weird quirky third-person shooter. It's bizarre; it's a bizarre game. It's for dang RPG fans very strictly - if you haven't played Danganronpa one and two, you will not enjoy this game; you won't even understand it, especially the first one. But it's weird...",
            "start": 3161.64
        },
        {
            "text": "game it's for Dangan Ronpa fans very strictly if you've not played Danganronpa one and two you will not enjoy this game you won't even understand it um especially the first one um but it's weird it's definitely a **** weird Grisly it's the thing about the game that really stood out to me is it's **** really violent compared and that's saying something because Dangan Ronpa is a violent game it's a very violent game it's about kids killing kids and it's very Lord of the Flies or or Battle Royale kind of Hunger Games kind of thing I mean it's like that's what it's about so um this game is like over the top um in in kind of the gore but the gore is like the blood's pink and stuff it's not like you know scary in anyway um so I enjoyed it um but I have not seen enough to really like render a final verdict on it I think people were a little lukewarm on it it's just cuz it's not Dangan Ronpa and we'll get more of that you know this coming year the Bear's back Monokuma Monokuma's Revenge",
            "start": 3197.04
        },
        {
            "text": "\"Verdict on it, I think people were a little lukewarm on it. It's just 'cause it's not Danganronpa and RPA, and we'll get more of that you know this coming year. The Vita's back, man. Monokuma, Monaz, Zuma's Revenge... You talking about like, you know I'm looking through my trophies, and like you want to talk about this was the year Vita fully did move into being the indie station, you know what I mean? That was a joke thrown around forever about it, but yeah, Persona was like the big tent pole event. Still waiting on Volume, but is in Indie, you know what I mean? But like looking through like the things I played that stand out 'cause there was tons of stuff I played we Traveled so much this year right. But I'm looking at it like Titan Souls that stood out for me, that was a lot of fun, that was a great run and you know exciting to play. There's Super Meat Boy finally came out, I was playing Rocket League for longer than I should have, but it's like whatever, you know what I mean? Like it's just a fun thing. 34s Home was...\"",
            "start": 3236.64
        },
        {
            "text": "You know, exciting to play there Super Meat Boy finally came out. I was playing Rocketeer for longer than I should have, but it's like, whatever, you know what I mean? Like, it's just a fun thing. 34 seconds home was... I played it on Vita when I actually sat down and did it with headphones, had a great time. Farming Simulator came out, Super Time Force Ultra - uh, you know the one? I want to give a shout-out to that; I don't think we talked about it, but actual sunlight is one of those games where... I'm not sure 100% if it's story and I should probably look it up because I talk about it ever so often. We talk about Vita, but before this trip to Chicago, I went on the store on my Vita and I was looking for something - oh, you did talk about it; I missed whatever, and it's this game where... yeah, you play as a suicidal person or whatever, and like from their perspective, and it's like basically all text over a very 16-bit-looking you know out or whatever layout.",
            "start": 3272.04
        },
        {
            "text": "game where yeah you play as a suicidal person or whatever and like from their perspective and it's like basically all text over like a very you know 16 bit looking you know out or whatever layout of the game or whatever and that was something that touched me you know what I mean because it was just something interesting it was it's that what can you do with games and how what kind of stories can you tell and how can you speak to your audience in a very direct way and that's what happened and so like that was awesome and like I think Vita you know it's this jrpg machine that has all these different things you know I'm playing what uh uh Chrono Trigger on it right now you know there's all these different things of like this is the year where I used my Vita very very differently you know what I mean leading up to this I feel like I I would download a PS one classic to have it or whatever do this or blah blah blah get the Indies there but I was like Freedom Wars",
            "start": 3304.56
        },
        {
            "text": "you know what I mean leading up to this I feel like I I would download a PS one classic to have it or whatever do this or blah blah blah get the Indies there but I was like Freedom Wars this is what I want to play or I was this next big vita game that was supposed to be like the savior of Vita whereas this year yeah it was for me it was Persona Dancing All Night which I got and was cool to have but you know I I maybe I'll Platinum it but it's like kind of repetitive for me right now and I don't know if I'll get back to it where it's like there's all these other little things I keep popping into and doing and I'm you know more stoked I mean like what I'm super super stoked about and I'm keep putting it off is finally playing Bastion on Vita because that's where I'm going to be I'm going to platinum Bastion because I love Bastion loved it when I reviewed it back on 360 you know when it was an Xbox Live game now that it's finally here it's been on PS4 forever and I",
            "start": 3339.28
        },
        {
            "text": "to be I'm going to platinum Bastion because I love Bastion. Loved it when I reviewed it back on 360, you know, when it was an Xbox Live game. Now that it's finally here, it's been on PS4 forever and I jumped on and played it that first night and I was like \"this is it\" and it's Bastion, it's great. I want to play it on Vita because with headphones on a plane, and like there's so much content to that game, and jumping around, and you know making the missions tougher on yourself to get this to do that... like I'm super super excited to get lost in that. But similar to how Colin's always talking about Persona 4 Golden and like letting that sit there and always be there for him on his Vita, right? That's what I'm going to do with Bastion, like I don't want to rush it. I could go you know tonight while Christine watches YouTube videos, I could sit next to her and play Bastion but I'm not going to if that makes sense yeah uh I I mean I have a few games written on here I want to definitely give a shout out to Three4 I think",
            "start": 3372.76
        },
        {
            "text": "videos I could sit next to her and play Bastion but I'm not going to if that makes sense yeah uh I I mean I have a few games written on here I want to definitely give a shout out to Three Four, I think that's actually one of the best games I played this year. That game was extraordinarily emotional and really resonated with me um on a storytelling level it's really about uh a girl that loses touch with her family and it's it's it's really sad it was just a really sad game I just sat in my bed one night and played it very similar journey in that respect where I'm not going to play it again. And I thought Three Four was really awesome, it's definitely one of my favorite games of the year and it's on Vita and it's perfect on Vita. I played a game called Heroes of Loot on Vita, lot. It's actually a mobile game um and uh I played it on uh Vita and it's just a very simple Dungeon Crawler and I actually had a lot of fun with it uh it's just like you die and you start in the beginning",
            "start": 3407.4
        },
        {
            "text": "actually a mobile game um and uh I played it on uh Vita and it's just a very simple Dungeon Crawler and I actually had a lot of fun with it uh it's just like you die and you start in the beginning you die you start in the beginning it just had a weird uh kind of loop in the you already brought up Titan Souls which I thought was really fun the final game that on Vita that I played a lot this year that a lot of people didn't touch is Zero Escape: The Danganronpa Zone Drifter um from Renegade kid which is a a Metroidvania game but it's like a really small Metroidvania you can beat it in like two hours um it's just like you're on different planets and you like jump from planet to planet find things you need and go back to the planets and very simple aesthetic and very simple gameplay but uh really fun game one of the more enjoyable games I actually played this year I think um so I like that a lot Zero Escape: The Danganronpa Zone Drifter on PS4 I think as well you can play it on 3DS I think it's on Wii U um it's on PC uh so you can play in",
            "start": 3441.2
        },
        {
            "text": "Enjoyable games I actually played this year, I think. Um, so I liked that a lot, Zero Escape: Virtue's Last Reward on PS4, I think, as well. You can play it on 3DS, I think it's on Wii U, um, it's on PC, uh, so you can play in a lot of different places, but I played on Vita and I thought it was, I thought it was a lot of fun, so yeah. Oh, when Shovel Knight, of course, came to Vita this year, yeah, which was that was my video game of the year. Show my God, I'm I'm happy I waited to play Shovel Knight cuz when it first came out on just the Wii U, it just for some reason felt wrong to me. I didn't I didn't want that, I wanted to play that game portably and uh you can't really do that with the the Wii U. You kind of can, you play on 3DS came out to no, I know but the 3DS I don't like the the buttons are too small has same problem with Vita like it was the whole thing but then I was like I want the the screen I have the OLED like I want I'm very particular when it comes to this stuff so I was very happy I played it on Vita and it",
            "start": 3476.88
        },
        {
            "text": "vita like it was the whole thing but then I was like I want the screen I have the OLED like I want I'm very particular when it comes to this stuff so I was very happy I played it on Vita and it definitely made my Vita worth buying like I loved the out of that game so Colin was right uh PS4 moving the big leagues bloodborne bloodborne was hot I mean I I played bloodborne for 20 plus hours um I didn't beat it I didn't get very far in it um I really enjoyed it I I wish that we didn't have to travel around when it came out because I was really into it I was really into it I I used to sit in the couch like every night for like four hours after everyone went to bed just played it over and over again I was like I finally get the hook it's a little quicker it's a little more arcadey just a little bit uh than Dark Souls or Demon Souls um and that's what I needed uh cuz I think Dark Souls and Demon Souls are just so stiff and boring like I just I'm not into",
            "start": 3513.0
        },
        {
            "text": "a little more arcadey just a little bit uh than Dark Souls or Demon Souls um and that's what I needed uh cuz I think Dark Souls and Demon Souls are just so stiff and boring like I just I'm not into those games at all um and I tried I mean I took a whole week off to play Dark Souls last year um just to see if I can get back into it I'm like I just I just don't like it you know um Bloodborne struck me the same way for about five hours but I just stuck with it because it has the essence of something I really want to understand I want to understand what what it is about these games everyone's like you love Dark Souls you love Demon Souls and you know because I like hard games and I like old games and this game's definitely got us this the soul of an old game uh Parton the pun but uh but I just didn't get it I just was like I just why like it's it's hard because it doesn't control well it's hard because it's like not fair sometimes like that's not fun to me like the essence of the games",
            "start": 3557.04
        },
        {
            "text": "didn't get it I just was like I just why like it's it's hard because it doesn't control well it's hard because it's like not fair sometimes like that's not fun to me like the essence of the games that I like that were hard were hard but they were Fair Mega Man's fair Castlevania's fair Ninja Gaiden's Fair these are fair games if you're bad at them it's your fault and learn to get better yeah and I think that I think that sometimes a lot of times in Dark Souls for instance it's it is your fault in Bloodborne it is your fault sometimes it isn't sometimes it's totally unreasonable for you to expect that you should have known that this Dragon was going to fly over this bridge and **** kill you out of nowhere like just un **** to be fair Mega Man is like that too it's a trial and error then you know the dragon comes yeah but but they're they're different this I think in that respect the spe the design is a little different whatever but I I understand why people love those games I just",
            "start": 3594.04
        },
        {
            "text": "you know the dragonborn comes yeah but but they're they're different this I think in that respect the design is a little different whatever but I I understand why people love those games I just wanted to understand more of it and Bloodborne was the game where I was really like yeah I get it um it's one of those games in my mind where I'd love to get back to but who knows if I ever will the DLC came out I you know and it's supposed to be excellent um I'm proud that Sony understood this was a message to the fan base because I I know that they understood that they **** up with Demon's Souls and that they could have locked this entire series down Dark Souls would have never happened um if they knew what they had and they just didn't know and this was them saying like we have to fix this for our for our fans because it was PlayStation fans that made Dark Souls a thing with Demon's Souls without them that would Dark Souls would have never been a thing so I think this was that was a business",
            "start": 3631.48
        },
        {
            "text": "our for our fans because it was PlayStation fans that made Dark Souls a thing with Demon's Souls, without them, Dark Souls would have never been a thing, so I think this was a business blunder on their part. I think Bloodborne was a step up and I don't think we've seen the last of Bloodborne, uh, because I think it sold some PS4s, people liked it, it did well, respectively, and I think that it gives a lot of credibility to the console. Mhm, there was also The Order: 1886, well yeah, I was surprised when it went on sale this uh past Thanksgiving break when it was $10 or whatever, the number of people who bought it were like \"this wasn't what I expected\", think it's totally worth yeah exactly and that was the thing I'm like well you're understanding the proposition here and the differences and also it's expectations you know what I mean when people were building it up to be this big AAA game that it was going to be this you know",
            "start": 3663.52
        },
        {
            "text": "understanding the proposition here and the differences and also it's expectations you know what I mean when people were building it up to be this big AAA game that it was going to be this you know PlayStation 4 exclusive this is like what this is what it can do kind of thing it had different expectations whereas then everybody shed on it for an entire year and then it came out for 10 bucks and we like this isn't bad mhm Rocket League, Rocket League's hot man Rocket League's arguably the best game of the year pound-for-pound um we saw that coming a mile away I mean it was so it was so obvious that game was going to be big when people finally started getting in their hands I think they it was a stroke of Genius for them to release it for free and I think that um it's so think like eight million players or something like that it's like it's like an insane success for a company that small I mean they're they're rolling in it now so um it's just a great it's just a great game just a really",
            "start": 3698.96
        },
        {
            "text": "players or something like that it's like it's like an insane success for a company that small I mean they're they're rolling in it now so um it's just a great it's just a great game just a really good game yeah I think out of all the games this year it's the one that I wish that I spent more time with sure cuz I I did the let's play and that was it like I I never really played it outside of that but I feel like I'd like that a lot no you still could and that's the thing I was talking to with people just like you know it was similar for us it's the travel schedule we talked about Rocket League forever when it finally got there we had like three days and then we went to some event and I came back and I was just getting **** bludgeoned to death in matches you know what I mean like well this my time but then I was talking to kids you were talking about playing at local or you know playing with their friends it's like okay like there is still life to it even if you're terrible like me or",
            "start": 3737.92
        },
        {
            "text": "my time but then i was talking to kids you were talking about playing at local or you know playing with their friends it's like okay like there is still life to it even if you're terrible like me or if you want to go be amazing like Freddy Wong and try to go pro and all this different stuff is is he really dude he loves he's addicted to Rocket League he loves rocket league and that's the thing is like that was what was crazy for us you know what I mean like Colin coming back that first time after seeing at PSX last year was that right and telling me like you know Dunham's game is actually really good and I'm like oh right what is it again he's like oh your car is playing soccer I'm like that sounds not good at all and then you play it you're like oh **** this is good and then just watch it slowly build and build and build to where it is this phenomenon everyone is talking about it like yeah congratulations to you psyonix yeah that's great yeah i'm proud of them i'm really proud of",
            "start": 3770.36
        },
        {
            "text": "it slowly builds and builds and builds to where it is this phenomenon everyone is talking about, it like yeah congratulations to you, Psyonix, yeah that's great, yeah I'm proud of them, I'm really proud of them, Until Dawn, another unexpected jam, awesome, big fan, awesome, God Lord such a big F, I'll never, you were like Tim, you need to play this game and you were right, God no, I knew you, I knew you would love so good, I I just I enjoyed it and you know you say so much about like it's what Telltale should be and like I and quick too, I get that it's like you play it and it's just like this is It's a story you're not really playing a game like you could watch a YouTube video of that game and it's the same exact experience but it isn't but I mean you're not getting like the like the don't move you know I mean make the choice real quick and like there's so much to it, I understand what you're saying, yes, I'm just saying I don't think there's enough of that like that's the equivalent of like uh",
            "start": 3802.72
        },
        {
            "text": "know I mean make the choice real quick and like there's so much to it I understand what you're saying yes I'm just saying I don't think there's enough of that like that's the equivalent of like uh a 3D movie where it's just like there's a little extra **** yeah you miss that but like really you're going to get the story out of it but not the experience yeah and it's like to me it's the equivalent of if the videos were annotated and you can like click through chose your but that's not a knock on it it's fun it was great and like it you know it doesn't need to be a you know game like there doesn't need to be like you lose or whatever like I like that it was exactly well that was what so you know fun to sit down with you like I you know I sat down with Christine and streamed it and we beat it in one go and she's already played it but she wanted to watch me play it again and see different like that's cool like I you know I hate watching games I've beaten again usually or even playing",
            "start": 3840.36
        },
        {
            "text": "it in one go and she's already played it but she wanted to watch me play it again and see different like that's cool like I, you know I hate watching games I've beaten again usually or even playing games I've beaten but then when you and GameOverGreggy were playing it on Extra Life like it was awesome to sit and you and like I knew you guys were making choices that were different than mine I'm like **** I can't wait to see what happens you know what I mean like there is that thing to it of like oh what are they going to do when this part happens are they going to know to move FAS here and like take the safe route and I do like that the changes affect it pretty substantially like it's not one of those like stupid like oh well this thing happens a little differently it's like looking at all the different things that could happen and then when you go online and look it's like oh **** like things could be really different yeah so I'm excited",
            "start": 3875.4
        },
        {
            "text": "like once you beat it you want to know what are the different things that could happen and then when you go online and look it's like oh **** like things could be really different yeah so I'm excited I really hope that we get like a proper sequel um you will with like a different cast of characters new characters new setting think you will I I think Sony's smart enough to know what they have with Until Dawn I don't think that they knew maybe before they released it I was really shocked that didn't have a bigger push and and um I think that they were they were trepidatious about it I don't think that they they quite understood what they had that game was in development for a long time and I think that they had spent a lot of money on it I think they were scared and I think they I think there might have been a feeling that they were just trying to get it out I don't think that they understood that it was one of the best games of the year and and maybe the strongest in",
            "start": 3904.64
        },
        {
            "text": "I think there might have been a feeling that they were just trying to get it out I don't think that they understood that it was one of the best games of the year and and maybe the strongest in in its own way the strongest PS4 exclusive of the year um so I I don't think you've seen the last of Supermassive working on that series I mean I think that you know when we first saw it at PSX like that was I don't know if that was the first time it was ever shown but that that demo of it like you could tell watching it and I wasn't in the room but like I can only imagine that that that was powerful you know it's like oh **** like they were freaking out saying go right last because I do remember when you first saw it and you see Hayden Panettiere exactly The Panetta you see this you get this instant feeling of GH like oh this is the game this is going to be like it's like a lens thing of just like let's put actors in this and you know",
            "start": 3936.52
        },
        {
            "text": "exactly The Order: 1886 you see this you get this instant feeling of GH like oh this is the game this is going to be like it's like a lens thing of just like let's put actors in this and you know you there's no way this is actually going to be good and then you see that demo and it's like all right was that just cool cuz there's a crowd of people saying you like do this do this whatever and it ended in the perfect way and just it got people hype and it's like all right I didn't believe it was actually going to be good so it wasn't until you were like it's good I was like oh **** like **** yeah it was definitely an experience I remember we got it early I sat down and played it I beat it in like a day and a half I was like this is awesome um exactly what I need it's Unique and and and like I said it it out Telltale's Telltale but it really out Quantic Dreams Quantic Dream which is a going to resonate a lot more for PlayStation fans because I think that Quantic if they can you know",
            "start": 3973.04
        },
        {
            "text": "like I said it's out, Telltale's but really out Quantic Dreams, which is going to resonate a lot more for PlayStation fans because I think that Quantic can probably learn a thing or two about how to make a game by watching Until Dawn, um especially after Beyond: Two Souls, which was not very good. The Uncharted collection is awesome, oh my God, my first two and three, and holy ****, I mean like I couldn't give that game of the year because it's you know cheating in a collection but it would be like my God such great games so good and I cannot wait for four, I think they're putting this out, it's we all knew it would happen but I'm happy it did because there's so many people playing it for the first time they're just like holy **** my friend Curan never played an Uncharted game because he didn't have a PS3 and now he has a PS4 he's playing through them and he's just like how did I not **** play these",
            "start": 4010.16
        },
        {
            "text": "just like holy **** my friend curan never played an Uncharted game because he didn't have a PS3 and now he has a PS4 he's playing through them and he's just like how did I not **** play these yeah and I'm like I know they're so good and I'm happy that I waited for the collection because it's it's beautiful man and it's like you play it and they don't look dated like they look good it's like yeah they're not as beautiful as new games but it's like you you play them you're like this is great you know it doesn't take you out of the experience right and um I'm happy that they did that me too yeah yeah I platinumed one and two again I platinumed Uncharted 1 and 2 on PS3 as well um really good reminder of just how Stellar Uncharted is Uncharted is so far ahead of so so many of its contemporaries it's not even funny you know and it's they still are and they still hold up this characters are still fantastic and the stories are a little weird but they're fun it's it's it's I don't know it's a nice reminder",
            "start": 4055.04
        },
        {
            "text": "Funny, you know, and it's they still are and they still hold up this characters are still fantastic and the stories are a little weird but they're fun. It's it's it's I don't know, it's a nice reminder what we're going to get with Uncharted 4, I think definitely. Um, Vanishing of Ethan Carter, I wouldn't really count that as a PS4 game that came out last year on PC, I think, but yeah, but PS4 gamers got it this year. I played it for a couple hours; it's obtuse, um, but I don't have much more to say about it than that. I, I, it was a game I was really excited about. We got Journey remaster this year; I didn't, I didn't play, I never played Journey again. Axion Verge got a little more than halfway through it; Nick really loved it. I, I stopped playing because I thought it was going to be on Vita and we're still waiting; it's like a little ridiculous now, um, that the game's not available on Vita yet; it's like a little obnoxious in its own way, um, but you know things.",
            "start": 4095.28
        },
        {
            "text": "\"Waiting, it's like a little bit ridiculous now, um, that the game's not available on PSV yet, it's like a little obnoxious in its own way, um, but you know things happen and complications happen or whatever, um. But I do get a little annoyed, truth be told, when a game is promised for PS4 and Vita and you just sit there for months and months and months and months just waiting, you know? Like it's a little disappointing. On my list, is like I've been talking about this with people, I'm like I fully believe that Volume could be one of the best games of the year, I'm just waiting for it on Vita. I tried playing remote play on Vita and that didn't work, so I was like no, no, I'll wait. It's just I don't mean to be a snob about it, but that's where I want to play that game, where I want to have that experience because I need stuff on the Vita when I'm on the go, you know what I mean? Yeah, I just wish that people wouldn't... Tom's a\"",
            "start": 4136.48
        },
        {
            "text": "play that game where I want to have that experience because I need stuff on the Vita when I'm on the go you know what I mean yeah I just wish that people wouldn't you know comp things happen Tim's a friend of ours so I'm not I'm not trying to sh I'm not trying to **** on anyone in particular it's just like don't promise a game for a platform and then not release it you know like that I I guess that's kind of like you know we were excited about that game for for Vita I mean that's just real and that's the other thing too is if it had been like a surprise later on that it's coming to Vita maybe I would have played on PlayStation 4 and been able to you know adequately talk about it but like when it sounded like it all these games were coming out at the same time like oh great no big deal same thing with Bastion but I had played Bastion five years ago so it didn't really matter I can sit here and tell you Bastion's awesome that said that said I just want to say thanks to The Verge for what I",
            "start": 4176.4
        },
        {
            "text": "same thing with Bastion but I had played Bastion five years ago so it didn't really matter I can sit here and tell you Bastion's awesome that said that said I just want to say thanks to the Verge for what I played is excellent that's what makes it so disappointing that it's not on Vita because that's really where it belongs I think you know it's where it belongs Final Fantasy VII Remaster just came out I've been playing it for a few years a few years a few hours early build for a few years and a couple episodes ago we were talking about like what's the definitive way to play Final Fantasy and I think this is it might be the fact that you can speed up the yeah that's a little obnoxious but you don't have to you don't have to do it so I mean if you want to cheat you can cheat well no the cheating I don't like the the so if you hit R3 I think it is it automatically heals all your stuff and gives you full limit breaks I don't know about that so you're talking about just using",
            "start": 4208.2
        },
        {
            "text": "no the cheating I don't like the the so if you hit R3 I think it is it automatically heals all your **** and gives you full limit breaks I don't know about that so you're talking about just using the left stick to move around you have use circle plus oh oh speak no I don't want to do that either you all three it just speeds the game up that I know too I mean these things are there in case in case you um want to use them I think the one cool addition is um just using left analog to move is the same as dash plus Circle which is nice um for fast movement um like real time fast movement uh it's fun I mean it's very nostalgic I I was going back and I'm like man I remember I remember when I got this you know I like getting Final Fantasy VII was such an extremely seminal moment in my in my life CU it got me I got my PS1 I I sold like my almost my whole SNES collection to get it which was a huge mistake um so there's like all these conflicting feelings about Final Fantasy but going",
            "start": 4243.48
        },
        {
            "text": "life CU it got me I got my PS1 I I sold like my almost my whole SNES collection to get it which was a huge mistake um so there's like all these conflicting feelings about Final Fantasy VII um but going back and hearing the music and the characters Cloud being so assertive as a as a protagonist which is quite unusual um in some Final Fantasy games and then just a lot of RPGs generally generally post Final Fantasy VII yeah exactly um Barrett you know being introduced to Barret and Tifa and and Avalanche going on that bombing Run for the first time like the the boss fights the music like it it doesn't the we were talking about it will the game stand up even in pre- renders the game looks like **** like all of it but the fact is is that so even like the pre-rendered backgrounds the CG like it's all looks bad but it's it's so no the answer is no but it didn't it didn't hold up at all obviously the polygonal characters were not going to hold up but who cares like it's it's a product of its time",
            "start": 4285.08
        },
        {
            "text": "looks bad but it's it's so no the answer is no but it didn't it didn't hold up at all obviously the polygonal characters were not going to hold up but who cares like it's it's a product of its time and I remember how blown away I was by that game when when I saw it uh for the first time I played it for the first time and it just again it brings back a lot of memories for me about um about what it was to be a PlayStation owner like early on I remember buying Final Fantasy VII and not even realizing you needed a memory card and like why couldn't like why couldn't the game save on the CD like this was a huge like I was like why not like hell is this and I remember having to like go to Toys R Us and I bought like one of those bootleg cheap memory cards my memory card had a basketball on the end of it yeah I had the blue EA Sports One good Lord so it's just there's just a lot tied that's a loaded game because there's a lot tied to it and I I don't think I'm the only one I think that people have",
            "start": 4327.92
        },
        {
            "text": "It yeah, I had the blue EA Sports One good Lord, so it's just there's just a lot tied to it. That's a loaded game because there's a lot tied to it, and I I don't think I'm the only one. I think that people have said before, and they're right. Final Fantasy VII made PlayStation, and um, before Final Fantasy VII PS1 was out in the states for almost two years actually a little over two years, and it came out with Battle Arena Toshinden, and there was a bunch of games like that were fine. Wild Arms is one of the great games on PS1, and that was before Final Fantasy VII but Final Fantasy VII made it a household name and made and got that system into people's homes and got and made the RPG genre crossover into the mainstream. And even though Final Fantasy VII is in no way shape or form a hardcore role-playing game nor is it a difficult role-playing game, it is a role-playing game, and it introduced many people to what it was all about. And and we should be so happy about that. I mean we owe it's so funny how I",
            "start": 4366.2
        },
        {
            "text": "Nor is it a difficult role-playing game. It is a role-playing game, and it introduced many people to what it was all about. And we should be so happy about that. I mean, we owe it to ourselves how I vacillated on Final Fantasy VII as a gaming fan and as a critic so much because I really felt like it was so vastly overrated, and I was so mad especially with like how much attention it got compared to IX, which I think is a way better game. Um, but the fact is it's important; it's just an important game, and it's a game that people should play, you know? I think it's an important game for people to understand. And then you look at Final Fantasy XV, and you see where they're coming from. When you fuse them together, then you get that Cyberconnect kind of remake; you get to see exactly where they're coming from. So looking back at PlayStation as a whole, is there anything we want to",
            "start": 4404.12
        },
        {
            "text": "and when you fuse them together, then you get that CyberConnect kind of remake. You get to see exactly where they're coming from. So looking back at PlayStation as a whole, is there anything we want to talk about reviewing 2015? Cuz I got to say the press conference E3... oh getting away from games because there's a few games I want to add go for can Everybody's Gone to the Rapture. We didn't talk yeah Everybody's Gone to the Rapture forever for them uh I it's one of those games I was who was I talking to? I think I was talking to Shawn Layden, actually the head of Sony Santa Monica that game was developed by The Chinese Room but Santa Monica was the production team on it um and it was one of those games where I was like I I played almost more than halfway through and I'm like this is awesome what a **** Eerie ass game that is and then I went away and then I came back and tried to jump back in I'm like I have no idea what's going on what I explored already and I",
            "start": 4444.16
        },
        {
            "text": "I'm like this is awesome what an eerie ass game that is and then I went away and then I came back and tried to jump back in I'm like I have no idea what's going on what I explored already and I didn't want to start it again I was like damn like that's a weird game and uh there's a we we've talked about I think on the show or definitely on PS I love you and definitely on Colin and Greg like the there's a sorted kind of story about that game in terms of how it was made it doesn't seem like it was a good time making that game it doesn't seem like The Chinese Room and Sony necessarily got along with each other very well so there's a lot of and we're just reading into that based on a letter written by one of the co-founders about why she's leaving the studio or taking a sabbatical or whatever it is um so people can go read about that because it's really all conjecture but there's so much tucked into that game when you know you know like that it was probably a challenge for him to",
            "start": 4478.88
        },
        {
            "text": "whatever it is um so people can go read about that because it's really all conjecture but there's so much tucked into that game when you know you know like that it was probably a challenge for him to make it sure um I want to give a shout out to Hell Divers which we didn't talk about oh yeah um that was a huge surprise to a lot of people um I remember playing that game at Gamescom in 2013 maybe and came back and I was like this is **** awesome there's there's and I said why con you go cuz it's really hard I was like **** that then and I came out I was like oh this is great it's it's like it's ridiculous it's like it's Destiny from a different point of view this is rad and then it ate my save twice and I was like **** yeah the game AR the game was a little broken I think in the beginning but it that is the the hallmark of the game it's **** hard and it's not hard in a way of like I got to kill these two enemies and make this jump whatever it's hard of like it's just it's",
            "start": 4515.2
        },
        {
            "text": "beginning but it that is the the hallmark of the game it's **** hard and it's not hard in a way of like i got to kill these two enemies and make this jump whatever it's hard of like it's just it's comical how hard it is and i think that that's what's kind of fun about it you call down reinforcements to help you that can crush you you you like you set up a a turret shoot you in the back if you walk in front of it i'm like this is awesome you know this is there's no friendly fire there you know there's there's it's like it's like you throw a grenade and run into it it's going to **** kill you throw a grenade in your friend it's going to kill your friend you you like i'm like this is awesome this is so it's so ruthless right yeah arrowhead games I didn't spend a lot of time with but I want to give a shout out for our PlayStation fans out there, The Swapper (TS) AERIA I played for a few hours and there's something wrong with it in my mind and I just don't want to go back to it",
            "start": 4553.72
        },
        {
            "text": "but I want to give a shout out for our PlayStation fans out there. I played The Order: 1886 (TS Aeria) for a few hours and there's something wrong with it in my mind, and I just don't want to go back to it. And it's funny because I was reading a lot of NeoGAF threads - uh, or just a specific thread about how a lot of people agree that it just doesn't feel right. Doesn't feel right. There's something about it, and so I just didn't want it. It didn't grab me like Exile did, grab me, and Exile 2, where I was like, \"I can't put this game down.\" There's just having played it for just a little while, I'm like, \"I don't quite like the combat,\" I don't like the world. It's huge, but it feels empty. And so, one of the games I want to give a shout out because I know a lot of people care about that game, but uh, I didn't play nearly enough to have any sort of meaningful verdict on it. But I will say that my first blush reaction to the game is like, \"No, I don't want to play it.\" Um, Dragon Quest Heroes came out; I played that for maybe",
            "start": 4596.12
        },
        {
            "text": "to have any sort of meaningful verdict on it but I will say that my first blush reaction to the game is like no I don't want to play it um Dragon Quest Heroes uh came out I played that for maybe 10 or 15 hours uh I really want to give Amnesia a chance I think we've **** on these games a lot I certainly have and and and I know Greg has as well these Omega Force techmo hacking slash mindless games and I was like if if I'm going to get into one of these games it's going to be with uh an IP I really care about and there's few IPs I care about more than I care about Dragon Quest um it's the same way people felt about when they did Dynasty Warriors for Zelda Ocarina of Time um and what I realized was like yeah this is fun you know like I I was like I get it a little bit more now so I want to give a shout out to all my my my muso fans out there because it's not a game I'll necessarily ever go back to but I get it a little bit more now because it's just you have to care so if you're in so for Dynasty Warriors if if",
            "start": 4631.92
        },
        {
            "text": "my my music fans out there because it's not a game I'll necessarily ever go back to but I get it a little bit more now because it's just you have to care so if you're in Dynasty Warriors if if you care about you know East Asian history then maybe you do care about Dynasty Warriors the way I care about um Dragon Quest you know I don't know uh the final game that I want to bring up that came out this year that I forgot about until I was looking at my trophies was a Super Stardust Delta came out or Ultra rather came out this year for PS4 more Stardust how can you go wrong uh can't really go wrong with that but uh really fun it was one of the first games I played this year and uh and I really enjoyed that so I wanted to give that a shout out as well if you're into that again that that twin stick kind of gameplay Loop not for everybody for sure but um and if",
            "start": 4673.6
        },
        {
            "text": "this year and uh and I really enjoyed that so I wanted to give that a shout out as well if you're into that again that that twin stick kind of gameplay Loop not for everybody for sure but um and if you played Stardust once you played it a million times exactly but I'll play it a million times for me so do you have any games Greg no I think we've covered a lot of them okay cool so outside of games then like just overall PlayStation just quickly killed it you think they killed it they absolutely murdered I mean they're trending they're doing so well with PlayStation 4 that they're benchmarking against PlayStation 2 that's that's an insane assertion to make publicly and um can blow up in their faces if it doesn't work out very well but that shows a very bullish uh situation over at Sony with PlayStation they're benchmarking against the bestselling console of all time we talk about this all the time too I mean the numbers right now at the end of the year but going into the year right we were",
            "start": 4711.8
        },
        {
            "text": "they're benchmarking against the best-selling console of all time we talk about this all the time too i mean the numbers right now at the end of the year but going into the year right we were so concerned that there weren't exclusives remember and you were all like there's got to be something in the fall we don't know about that they're going to surprise us with and there was wasn't there and it didn't matter it didn't matter you know what i mean they've done such a good job of pairing themselves with Destiny with Star Wars with these things where it's like this will move the unit and also make you think of us in that way it's crazy to see these numbers keep coming in and them keep winning you know NPD numbers off this yeah they're doing they're doing a fantastic job um and yeah we were wrong i mean I was wrong I want to speak for anyone else but you know I really assumed they would suffer more from a lack of first-party content than they did and the crazy thing about PS4 is that",
            "start": 4750.92
        },
        {
            "text": "I mean I was wrong, I want to speak for anyone else but you know I really assumed they would suffer more from a lack of first-party content than they did. And and the crazy thing about PS4 is that it there's a dichotomy drawn between the lack of really meaningful exclusives in the sales of the console - there's just not that many exclusives that you have to play on the console. There's not I mean I think Killzone's a fun game, a lot of people don't like it obviously Knack is forgettable, I think Second Son was a little disappointing although its DLC I think was really great. Um Bloodborne and Until Dawn I think are really meaningful exclusives that people should play. The Uncharted collection is fun but when you really think back to PS3 and how poorly PS3 did out the gate yet it had MotorStorm and it had Resistance and it had Heavenly Sword and it had you know a bunch of games, folklore like there were games early on in the first 18 months that were pretty good. And um it didn't matter so it",
            "start": 4783.4
        },
        {
            "text": "and it had Resistance and it had Heavenly Sword and it had you know a bunch of games like Folklore, which was one of the early games in the first 18 months that were pretty good, and um it didn't matter so it really goes to show and I wonder what kind of information they're garnering at Sony about like do we even need to invest this heavily in exclusive games because we haven't so far we've sold well over 30 million units now in two years with a dir of exclusives and now the exclusives are going to start to come out so we're going to see with Uncharted especially which is going to be one of the biggest users on the console ever um and then we'll see you know later in the year with Horizon which I think is going to be a big strong new IP for them if this helps become something additive on that on that vend diagram of of where the games fit because they're making third party games exclusive to them and they've made smart Partnerships that that make a lot of sense when I saw",
            "start": 4816.88
        },
        {
            "text": "that on that Vendetta diagram of where the games fit because they're murdering making third-party games exclusive to them and they've made smart partnerships that make a lot of sense when I saw Xbox get together with Fallout, I was like that's a really shrewd move; um, Tomb Raider didn't work out so well for them; um, Call of Duty was obviously kind of stolen by Sony but um you know so to speak uh but the game still sold best on Xbox One according to MPD not counting bundles but Battlefront ended up being ingenious for them to get Destiny when it's been a long play for them they've been from the beginning with that I mean the leaked Activision documents yeah and PS4 they were at the PS4 reveal right uh so it's like they were there from the very beginning and I don't I don't know that I would have made the same bet in that same position and been like you know that we're doing this MMO shooter from the guys that made Halo or they're not with Halo anymore",
            "start": 4860.76
        },
        {
            "text": "don't I don't know that I would have made the same bet in that same position and been like you know that we're doing this MMO shooter from the guys that made Halo or they're not with Bungie anymore and you know they're with Activision but Activision who knows how much attention they're going to give to them because they have Call of Duty and all this stuff and are they afraid of kind of cannibalizing themselves and that was probably the shrewdest move I've ever seen that they've made so far this year is to just be with them to make Destiny a PS4 exclusive even though the sales aren't necessarily dramatically better it's just looked at as a console that plays Destiny so I think that they've certainly learned a lot of lessons and I I wonder if they're going to be able to keep the momentum going I mean they're definitely killing their competition but you know the game is certainly not over yet yeah and we'll see what this PlayStation VR does yeah I think all the conferences this",
            "start": 4907.68
        },
        {
            "text": "momentum going I mean they're definitely killing their competition but you know the game certainly isn't over yet yeah and we'll see what this PlayStation VR does yeah I think all the conferences this year I think anytime there was any you know position for Sony to have a press conference and announce things they killed it I think they did great and even if some of them weren't like you know people are probably going to **** about uh Playstation experience but then even then like that's just a press conference that the other guys didn't have so all that's just extra but whenever it was like everyone's doing their **** Sony **** killed it man like they came out and Came Out Swinging Shenmue Final Fantasy VII like that press Last Guardian like that press conference is unfuck with The ability yeah yeah yeah E3 was great PSX not so much moving on Nintendo so we're looking into this we're going to start off with the 3DS now I'm going to be honest there's a vast library not at its best",
            "start": 4941.52
        },
        {
            "text": "yeah yeah yeah E3 was great PSX not so much moving on Nintendo so we're looking into this we're going to start off with the 3DS now I'm going to be honest there's a the vast library not at its best this year um I look because I look at this list of games we got Yo-Kai Watch we got Zelda Triforce Heroes Majora's Mask 3D Xenoblade Chronicles 3D Code Name: S.T.E.A.M. none of those screamed me Cate te was Year yo yoai watch I believe you I'm just I might be wrong about that I was surp like Yo-kai Watch out of that I was like they have something huge with Yokai Watch and it just apparently didn't pan out very well for them in the west I was I haven't seen any numbers but I was reading some anecdotal stuff saying like the game was kind of soft and that really shocked me because I remember identifying that game a couple years ago based on uh media create numbers in Japan I was like this game's going to be huge in Japan it is huge if you look at it it's it's just ridiculous but yeah I mean I",
            "start": 4976.64
        },
        {
            "text": "that game a couple years ago based on uh Media Create numbers in Japan I was like this game's going to be huge in Japan it is huge if you look at it it's just ridiculous but yeah I mean I play it's not translated I played a bit of it and it's I mean it's not for me for sure it is you know I I always talk about the fact that I love Pokémon so much but if I were to play Pokémon for the first time now as an adult I'm not sure if I would but then with Yo-kai Watch it's like I am having that experience I'm like this is not for me but it is also way more dumbed down than Pokémon is so I don't think that's a fair assessment but it's an even more kiddy Pokémon game and that's not what I want I want a more adult Pokémon game uh but I'm sure there's people out there that do love it but like I I wonder I wonder if it's that same cuz Pokémon's still kicking it's not like that just went away you know the cartoons and all like the little kids love Pokémon still they're doing they're going",
            "start": 5022.96
        },
        {
            "text": "I wonder if it's that same cuz Pokémon's still kicking, it's not like that just went away, you know. The cartoons and all, like, the little kids love Pokémon still; they're doing something with Pokémon, they have something up their sleeves with that game or that franchise, I don't know what it is. Yeah, 3DS is in a weird space – I mean, it's a really fantastic handheld, and in its own right, it has a fantastic library. I just think it's lost a little something along the way, and there's this weird space between two systems; the handouts are a little weak, um, and the games that are coming on it might not be resonating with the audience the way that the DS resonated with people for a very long time, um. But it suffers from the same problem that the Wii U suffers from – it's just they have to do this kind of token support of it until they're ready to show the NX, which I think will replace both of these, and I know that they",
            "start": 5061.04
        },
        {
            "text": "\"Problem that the Wii U suffers from, it's just they just have to do this kind of token support for it until they're ready to show the NX, which I think will replace both of these. And I know that they say that they'll live next to each other - they've said this before with GBA GameCube and DS. I mean, that was a huge thing for them, and that didn't really pan out. So, especially for GBA... um, so you know, I feel it's sad to see the 3DS die or dying, but it had to happen. I mean, the same thing's happening to Vita in a much more pronounced way. The 3DS came out, you know, almost five years ago, so it's had a good run and it does have a vast library of amazing games. But like I look at this, and yeah, Majora's Mask - obviously it's a classic. And I'm happy that it came out on the 3DS; I was surprised at its announcement. Like everyone, it's one of those things where every time there's a Nintendo Direct you go on\"",
            "start": 5100.84
        },
        {
            "text": "a classic you know and I'm happy I'm happy that it came out on 3DS I I was surprised at its announcement like everyone it's one of those things where every time there's a Nintendo Direct you go on neogaf and everyone's like but Xenoblade is coming to 3DS like this I'm predicting it it's like you never really think it was going to be announced and it was and it's like that's that's cool that it's there yeah it was great new generation you know Xenoblade Chronicles like supposedly people love that game I never really got into it a lot of people have been busting balls about you know about about Xenoblade like why aren't you playing Xenoblade why aren't you playing Xenoblade I'm like well I don't really want to play the Wii U and you know people like this game's right up your **** alley and I'm like I'm sure it is uh but it's just not what I want that's not the direction I want to go in right now I just it's to Greg's point I kind of feel like you got the point we've made not this time",
            "start": 5143.56
        },
        {
            "text": "I'm like, I'm sure it is uh but it's just not what I want that's not the direction I want to go in right now. I just, it's to Greg's point, I kind of feel like you got the point we've made, not this time, but you know, you want your trophies or you want to just enjoy an ecosystem or you want to do whatever you want to do and I'm like, I just don't want to like stop everything for this 150 hour RPG game. You know what I mean? Like it's just a momentum killer. But I've watched and really been reading a lot about Xenoblade and people really love it. They have something that Monolith Soft makes, that game right, they have something really cool with that. I think that they have to treat it with a little more care and make sure that they segue it over to the NX to make sure that people are really seeing it in a very noticeable way because it's certainly not pushing hardware and so the so the people that the very limited amount of people that have a New Nintendo 3DS and more pronounced Wii U uh might not.",
            "start": 5176.68
        },
        {
            "text": "seeing it in a very noticeable way because it's certainly not pushing hardware and so the so the people that the very limited amount of people that have 3DS and more pronounced Wii U uh might not be enjoying it well the I mean the biggest problem with the 3DS is you need the new 3DS to play it so it's like even more splintered you know yeah um so I could even play it if I wanted to I still have the original 3DS myself the little tiny one that's ridiculous so yeah yeah you you dust it off once every two years to play something the last time I played a game in any length well actually I I I DED off to play some Virtual Console games year I really want to play I wanted to play Metroid for some reason I haven't played in a long time so I dusted off to play that and that was fun but Link Between Worlds uh Link Between Worlds was the last like native game I like really really like falls into yeah well I mean after that you know just off the top of my head there wasn't too many like big",
            "start": 5212.84
        },
        {
            "text": "Worlds uh Link Between Worlds was the last like native game I like really really like falls into yeah well I mean after that you know just off the top of my head there wasn't too many like big games you need to play like there was Pokémon uh the Ruby Sapphire remakes and like there's a handful of things here and there Bra and I think Bravely Second is going to be awesome um that comes out next year I think March so there's a few yeah the 3DS I I personally think had a a pretty soft year but the Wii U I mean it had a lot of games not all of them the the highest quality but like I'm surprised to look at this list and be like oh **** you know we didn't get uh too many that I loved though but like Splatoon like yeah people really really enjoy it I had fun with it for what I played um it didn't capture me in that same way of like this is my **** game of the year but um it's fun and it's cool and I love that we got a new Nintendo IP that people genuinely care about um the fact",
            "start": 5249.8
        },
        {
            "text": "\"Um, it didn't capture me in that same way of like this is my **** Game of the Year, but um it's fun and it's cool and I love that we got a new Nintendo IP that people genuinely care about. Um, the fact that you know we see the Smash ballot and people talking about who they want and Smash and Nintendo characters, the Inklings are up there for what people want, and that's I think a good sign. Like, new Nintendo IP is a good thing overall. I I agree especially they're not churning out meaningful IP to the degree that they were a long time ago. So to see something like Splatoon really hit you know and inspire people to buy the system which they did not in huge numbers but even my brother you know calling me when Splatoon came out, I was like 'I finally picked up a Wii U' and Splatoon is awesome and and I was like 'Pick it up, yeah, oh wow,' and I was like 'You know that's cool, you know that's great.' It's again not a game for me. I think the game's really clever um but it's not a game I would want to play.\"",
            "start": 5291.84
        },
        {
            "text": "like Pi up yeah oh wow and I was like you know that's cool you know that's great it's again not a game for me I think the game's really clever um but it's not a game I would want to play you think you'd like it based on your Mario Sunshine Ridiculousness yeah but then I have to play with other people and whole whole yeah no I get that I get that um but yeah it's cool seeing like Game Awards like seeing it win best shooter it's like weird thing and I'm sure there's some weird politics involved in that but like it's cool I like that at least it's you know it's awarding something different I'm sure the politics are that like half of the or not half I guess but you know what I mean a majority voted for this another majority voted for this and then there was enough people who voted for Splatoon that those two that canceled out each other well good for good for Splatoon yeah no that's how democracy works right Colin yeah I guess Fast Racing Neo just came out like last week on the the eShop and",
            "start": 5332.48
        },
        {
            "text": "that those two that canceled each other well good for good for split yeah no that's how democracy works right Colin yeah I guess Fast Racing Neo just came out like last week on the the eShop and it's awesome it's it's F-Zero but it's not F-Zero but it's it's Wipeout but it's not Wipeout and it's fun it's really really fast you don't like the name I love the name cuz it is what that game is it is just here was just a generic fast racing game yeah but if we could have sat down for 20 minutes we can come up with 10 better names than Fast Racing Neo for Fast Racing AX maybe Neo goes fast Neo goes that's even a better name Neo goes fast put your pair in the slot I like the name I officially like the name Neo goes fast parent put your pair in a slot not so I don't know what that means but I don't know if I wanted um Kirby and the Rainbow Curse just came and went there was a lot of games like this year in the Wii U Yoshi's Woolly World which took 10,000 years to come out and it finally",
            "start": 5370.68
        },
        {
            "text": "I don't know if I wanted um Kirby and the Rainbow Curse just came and went there was a lot of games like this year in the Wii U Yoshi's Woolly World which took 10,000 years to come out and it finally did and it's it was one of those things where if that came if that game came out in March I think I would have liked it a lot more sure than it coming out yeah it's just too much going on when it came out that I couldn't enjoy it the way I wanted to um I love Yoshi games are my favorite but it this it's not 10 out of 10 it is very seven out of 10ish so that was disappointing but we did get a lot of that stuff just consistently throughout the year we got okay Nintendo games uh Mario Tennis Mario Tennis another example okay Nintendo games yeah I was going to say I mean based on like the way people feel about that Animal Crossing game and and Mario Tennis like I wouldn't even say they were okay it seems like people think those games are bad and that was and that was what really surprised me",
            "start": 5417.0
        },
        {
            "text": "Feel about that Animal Crossing game and Mario Tennis like I wouldn't even say they were okay. It seems like people think those games are bad, and that was what really surprised me because you don't really see bad Nintendo games. And that's the thing - it's like this year I think we saw a new level of... you were saying they're preparing for the NX, so it was kind of there was a lot more than I remembered but that's just because a lot of it was subpar to okay. So like the Yoshi and Kirby are the okay ones, and then Mario Tennis and Animal Crossing - whatever the hell it's called, the board game Amiibo Festival... it's like they just did that. They just put that out, that's not a real Animal Crossing game, you know? No, definitely not. And then there was other things like that too, with the uh Mario Party 10 which could have been awesome - you know, the Mario Party with the GamePad and being able to do all this cool stuff... and then oh you can't.",
            "start": 5460.2
        },
        {
            "text": "other things like that too they with the uh with Mario Party 10 which could have been awesome you know the Mario Party with the GamePad and being able to do all this cool stuff and then oh you can't none of that is a thing like you can use it as Bowser in really really really bad mini games it's like damn like they could have got it right with Mario Party they could have made it a kind of greatest hits of all the Mario party stuff and really kind of won people back and it been the 10th one like that that's event but it it wasn't yeah I don't know their names on all these games and this is this is unusual year to watch for me um Fatal Frame made into blackwater finally coming over here uh I didn't I didn't play that one um you're missing that you're missing that um the big one I'm waiting for the Big's com okay Devil's Third oh then there was Devil's third another terrible game um my so my thing is apparently I didn't play it the Wii U for me is completely two things two of them are",
            "start": 5498.32
        },
        {
            "text": "for the Big's com okay Devil May Cry third oh then there was Devil May Cry another terrible game um my so my thing is apparently I didn't play it the Wii U for me is completely three things two of them are DLC Mario Kart DLC which was awesome and how you should do DLC give us nice substantial thing like the DLC offered for Mario Kart was essentially like each one of them combined would be half of what Mario Kart had total for super cheap and it gives you cool things it finally made Mario Kart what it should be which is just Smash Bros here's link stuff here's F-Zero stuff here's uh Animal Crossing sh just and baby park yes yes yes um so I loved that and I loved that it was just like kind of like we got the first bit last year but it end this year and then Smash Bros which is just the damn gift that keeps on giving I love that it's still not over as of recording this we're two days away from the final direct announcing the last batch of DLC and that excites me man that means there's just",
            "start": 5541.0
        },
        {
            "text": "that keeps on giving I love that it's still not over as of recording this we're two days away from the final direct announcing the last batch of DLC and that excites me man that means there's just more to come and like I wouldn't have thought that when they had the the last smash direct before the game came out and announced Mewtwo I was like ooh this is a good sign that we know there's DLC but it's a bad sign that we're only getting one character shown like I was like I wish that it was more like there's this many more to come cuz I thought that meant maybe we'll get one after that and then call it a day but we've seen consistent like characters you know and levels and I love that they're they're really using Smash Bros as a way to promote their other games like when Mario Maker came out there was the Mario Maker level added and stuff like that and it's cool that they're consistently doing this and then Mario Maker is the Nintendo Game of the Year and they're also doing the",
            "start": 5592.36
        },
        {
            "text": "there was the Super Mario Maker level added and stuff like that and it's cool that they're consistently doing this and then Super Mario Maker is the Nintendo Game of the Year and they're also doing the strategy with the DLC of just like kind of like consistently adding to the game and putting all these things out there's the Mercedes-Benz event that they added I don't know if you guys saw that but I love that they can do that I love that it's just like there's now these platforms for them to go on and I hope that this is experimenting for the NX, going to give us you um no Super Mario Maker I mean that was one of the things that was amazing is like oh you guys want checkpoints sure we'll gave you that in like a month a month and a half here you go like okay cool and I mean Super Mario Maker alone has reminded me why I love video games and shown the capabilities of video games and seeing what like Dan Acker and uh Patrick do it's awesome and it's hilarious and to see the level of Challenge and like to",
            "start": 5637.24
        },
        {
            "text": "me why I love video games and show the capabilities of video games and seeing what like Dan Auerbach and uh Patrick do it's awesome and it's hilarious and to see the level of Challenge and like to see someone try to outwit it it's awesome and it's just this like it just keeps getting better to me and that game just keeps giving and there keeps being more challenging things or more interesting things and my favorite thing is that it makes me think about Mario differently and it teaches me things about how the gameplay works that I would have never thought about like the way that you can use turtle shells and the way that you can throw items in the air and catch them and do specific things I'm like that's built into the gameplay and people are now using those as challenges that Nintendo would never do sure because that's too complex of a a mechanic but when people are doing that knowing that you know how to do that it's really cool I wish you'd play it more Colin no like it like it a lot",
            "start": 5678.36
        },
        {
            "text": "never do sure because that's too complex of a mechanic but when people are doing that knowing that you know how to do that it's really cool I wish you'd play it more Colin no like it like it a lot when it comes to NX Conell play yeah um but yeah overall I mean you know reviewing Nintendo it was a very year filled with a couple Shining Moments sure and I think that overall it is the transition year and that's really the nicest thing I can say about it there was a lot of stuff but the good stuff is good and I think it leads in a good direction like I said for them to give it to you next year they're gonna give it to me they're gonna give it to me hard you better hope so I'm hoping I really am everything rides on this everything rides on it and we all know it and I I think Smash Bros is going to be a really important thing with the Switch like they've invested so much in this Wii U Smash Bros that like it needs to somehow be compatible with the next one and I think that they know that and I",
            "start": 5717.4
        },
        {
            "text": "to be a really important thing with the fact that they've invested so much in this Wii U Smash Bros, that like it needs to somehow be compatible with the next one. I think that they know that and I think that they're going to continue, like I'm speaking early because I don't know what they're doing at this Nintendo Direct, but like I hope that there's at least some messaging about something. I'm pretty sure we're gonna get uh information about NX, no not about NX, but just in terms of like Smash is and done, you know, like we might not be getting more characters or whatever, but like this is it's a big deal because it's Sakurai doing it and like for forever it's always oh this is going to be his last smash, this is going to be his last Smash, and this potentially is his last message to the people about this game. I'm just interested in the wording and how they phrase it, they're not going to talk about the NX but um it's going to be interesting to see what Smash Bros means to him",
            "start": 5766.16
        },
        {
            "text": "and I'm just interested in the wording and how they they kind of phrase it they're not going to talk about the NX but um it's going to be interesting to see just what Smash Bros means to him and like where he stands with it sure if he's going to say like he's done and that's it or if he's going to be like I'm not done yeah you ain't done yeah which would be awesome yeah we'll see I mean this is going to be uh cards on the table time for them it's gonna be fun to see what they have planned between their mobile initiatives and and of course uh the NX but I I you know the rumors are circulating and we're learning more about the NX so um you know with patents and with uh stuff coming out of Nintendo and they and how many they want to sell and when they're going to start manufacturing and stuff it all indicates a fall 2016 release date but I don't I don't know if they were going to be ready that quickly it will be Final Fantasy Versus XIII going down the games Halo 5 just",
            "start": 5803.36
        },
        {
            "text": "and stuff it all indicates a fall 2016 release date, but I don't know if they were going to be ready that quickly. It will be our final topic for Xbox in 2015, going down the games: Halo 5 - just that's it. I totally like it; it's just like... and it's... and I'm not... it's just playing it was like right this is Halo, and this is why I'm not a Halo fan. Like, I just felt it was... I'm playing co-op with Christine, you know what I mean? We got halfway through the game in one night; thought it was sterile, forgettable. MH - I understand why people love it. I played multiplayer for a couple hours; I was like, \"All right, yeah, cool,\" but it's just... like, it's time to admit that I'm just not a Halo fan, you know what I mean? Like, I'm on the other side of that completely. Where it's like... I played a bit of the single-player, and it's just like this is why I like Halo - that's great. I'm glad you like it; you know what I mean. But um, yeah, I mean there was a couple things that it's not Halo. I've talked about this before, but the the",
            "start": 5846.04
        },
        {
            "text": "just like this is why I like Halo that's great I'm glad you like it you know what I mean but um yeah I mean it there was a couple things that it's not Halo I've talked about this before but the the lack of the couch Co-op I'm like well **** that took away my halo experience and um so I was upset about that I'm not so much an online guy so like multiplayer doesn't mean anything to me yeah um and yeah the single player overall not the best story so it was a forgettable Halo game but not I wouldn't say just for me just the Greg Miller not as a Critic just as Greg Miller playing games over there wanting to play Destiny instead of this yeah because Destiny is more fun and Progressive Progressive Gears Remastered or Ultimate Edition, whatever you call it played it at for Let's Plays with Alfredo I was like oh cool never went back to it I was never I mean I I'm one of the guys who appreciates what gears does I I play I think I've played every gears like I mean we did the Gears 3 thing at",
            "start": 5889.2
        },
        {
            "text": "I was like, \"Oh cool, never went back to it.\" I was never, I mean, I'm one of the guys who appreciates what Gears does. I've played I think I've played every Gears game - I mean we did the Gears 3 thing at IGN, I definitely played Gears 2, Gears One I didn't have at home but I played it at a friend's house so I'm like, \"Yeah, more Gears cool.\" And it was like, but it's not like something that drew me back where I felt like I needed to go play it. Yeah, the only Gears game I played I beat One back in the day yeah and then seeing this was like, \"Oh, **** it looks way better\" yeah yeah yeah. Did you play it at all? Not remastered no no um but that this another one kind of seemed like it came and went but I guess that's just with all the remas... yeah remaster it's just like it's going to speak to an audience right and then we'll see what happens um Rise of the Tomb Raider, wo Rise of the Tomb Raider, that was a game Tim - a game that everyone should play. MH you can't CU it's not in every console and it didn't really",
            "start": 5932.36
        },
        {
            "text": "then we'll see what happens um Rise of the Tomb Raider, wo Rise of the Tomb Raider, that was a game Tim, a game that everyone should play. MH you can't CU it's not in every console and it didn't really sell well because it's fall late its lunch but yeah great game man, that's another we're talking about it earlier in this show like the gameplay Loops right like that game has a great gameplay Loop of like I've got to a new area and the mission is on the other side of the area but **** I see a coin chest over there and I'm going to take this side mission and that just unlocked all these new things and all crap I'm close to a and like two hours later you've 100% of the area and you're like now let's go do the story Quest and go let's move on there beautiful fun uh it's a game that I feel like at the end kind of does the video game thing I hate where it's like let's give you some of the most annoying parts to remember us by and it's like and like the thing of course would is that if I was",
            "start": 5969.04
        },
        {
            "text": "at the end kind of does the video game thing I hate where it's like let's give you some of the most annoying parts to remember us by and it's like and like the thing of course would is that if I was into achievements and wanted 1,000% that game or thousand point it I would would then have gone back and replayed the stuff I missed to the caves and whatnot and it wouldn't be my last my last impression of the game wouldn't have been these three corridors of let's fight every enemy even though fighting is not the fun part of this game uh so I wouldn't have that but for me right now as somebody who's like well I'm done now let's finish this experience that's where it ends for me but can't say enough nice things about that game great game really fun it's it's the original Tomb Raider: Underworld so if you didn't like I thought the story was really forgettable on the original Tomb Raider I fight a ghost witch or something at the end if I remember correctly this one in 3 years will be",
            "start": 6009.28
        },
        {
            "text": "So if you didn't like, I thought the story was really forgettable on the original Tomb Raider. I fight a ghost witch or something at the end, if I remember correctly. This one in 3 years will be the same way - of like, I remember there was this guy and these people and they wanted that, and then at the end they were totally setting up for a third, so that's what they did, you know? Mhm. Rare Replay, I want to give a shout out to that just as being one of the best compilation games I've ever played - it made me care about games I don't care about. And you know we we did a a let's play series where we kind of played through all of them even a lot of the really early really shitty games, but it it was fun that they presented it in a way that made me want to try them out and want to appreciate them for what they are. I loved the whole theater look of it and I loved the all the modes that they added - the challenge modes and the the um I forgot what they were called, but like maybe they were replay modes.",
            "start": 6042.8
        },
        {
            "text": "they are um I loved the whole theater look of it and I loved the all the modes that they added the challenge modes and the the um I forgot what they were called but like maybe they were replay the ones where you go in and like it just gives you the here's what you should play this game for like Battletoads you play it and they gave you that Speeder bike part like just right away and got you straight into it um yeah I really wish that other compilations would have have that level of love and care put into them yeah I was really impressed by him I was glad to hear that it sold better than they thought uh beat their projections and yeah there was a lot of there was a lot of respect put in into into uh into that collection and and and did bring back some obscure games a lot of obscure games and and definitely educated people on who Rare is and celebrated a history that I think is kind of lost to the ages now um maybe Microsoft's you know tip of the hat that that Rare is not really alive",
            "start": 6082.64
        },
        {
            "text": "and definitely educated people on who Rare is and celebrated a history that I think is kind of lost to the ages now um maybe Microsoft's you know tip of the hat that that Rare is not really alive anymore um at least that was my that was kind of what I walked away from it like here's what Rare was and what they've evolved into what they're going to be and they really haven't been Rare in a long time anyway so um yeah I thought it was really cool a lot of definitely a lot of respect put in a lot of love I agree and and uh happy to see some of those old games shine again yeah idarb Ocarina of Time is great Icarus was fantastic really that was a really fun time when we were all playing that yeah it's one of those I feel like there's a lot of multiplayer games like that with that kind of aesthetic you know like uh TowerFall and Super Smash Bros. Melee and um Brawl Halla just things like that they're just like hey just pick up and play it's a 2D side-scrolling game but they're fun and like I think idarb specifically added that that",
            "start": 6122.28
        },
        {
            "text": "TowerFall and sure and um Battletoads just things like that they're just like hey just pick up and play it's a 2D side-scrolling game but they're fun and like I think idarb specifically added that that just Insanity level yeah exactly why crazy ass announcer the hashtags going over you one of us figures out how to dash before the rest of us and then you're trying to figure out yeah and it's just like again it's why we play games it's fun yeah so I we should we should bust that one out yeah totally at some point do a do a second let's play of it or third let's play We yeah we did a bunch actually um or in the Blind Forest oh very pretty very very very very very pretty game very awesome game I'm happy there's a definitive version coming out and all that um I I like that that Xbox had that because I feel like forever Xbox was kind of missing that level game you know there you think Xbox you definitely think Forza and Halo and gears and stuff you wanted that artisanal platformer",
            "start": 6162.28
        },
        {
            "text": "because I feel like forever Xbox was kind of missing that level game you know there you think Xbox you definitely think Forza and Halo and Gears and stuff you wanted that artisanal platformer and they already gave it to you, gave it to me good yeah gave it to did you play a lot not I didn't I still haven't beat it but they do the thing that I hate where it's like I got far into it but not far enough to once they announced like the definitive edition where I was like oh I should just probably wait and um but yeah it's I love it and I love I love that it felt different than games like that like it's a it's a Metroidvania kind of game but it doesn't feel that way it's not so much just like the physics of it are weird where you jump and you have to kind of go slingshotting type stuff that you have to do with the jumps yeah um it's I like when when I'm playing a game and it's kind of like Guitar Hero where I'm playing I'm like I don't I'm not familiar with this this",
            "start": 6202.68
        },
        {
            "text": "type stuff that you have to do with the jumps, yeah um it's I like when when I'm playing a game and it's kind of like Guitar Hero where I'm playing I'm like I don't I'm not familiar with this this feels different I'm not good at it oh I'm getting better at it oh now I can do this know I can just kind of zip through the thing sure um and yeah I mean you know just the first 15 minutes of that game is emotional as **** it's like a Pixar movie and it's like anything that I can relate to a Pixar movie I'm into so big fan of A Boy and His Blob uh and then Forza Motorsport happened which wouldn't matter to any of us except for the fact that there was the Fast and Furious DLC and that **** was awesome like man like that they really nailed that like it felt like Fast and Furious they added a whole bunch of dumb **** and just vo and like stupid songs over like just play it on repeat and like they took a game and made me care about it like that's good and it yeah it was it was really fun it",
            "start": 6246.16
        },
        {
            "text": "bunch of dumb **** and just vo and like stupid songs over like just play it on repeat and like they took a game and made me care about it like that's good and it yeah it was it was really fun it was like it's a fun two hours that you just you know in and out and it made me realize how much I want a Fast and Furious Telltale Game oh and uh one day one day you got to pitch it to him next time we're on stage yeah um so I mean that's it kind of for the Xbox game State of Decay: Year One Survival Edition come on son that was great that guy you know State of Decay on Xbox 360 PC back in the day Moriarty and I did a bunch of Let's Plays leading into it I was super into it and it was that thing yeah I came out at E3 and came back exhausted and tried to play and and never it just two ships in the night so when it finally came here man that was it like that's the most I've played my Xbox One you know what I mean cuz and I mean like in a condensed period of like there was a week where I",
            "start": 6292.16
        },
        {
            "text": "in the night so when it finally came here man that was it like that's the most I've played my Xbox One you know what I mean cuz and I mean like in a condensed period of like there was a week where I shut down that's all I played and as soon as I was done with something it was back out there to fill my Ruckus sacks and clear off the map and go get this got to do it you know you don't understand man I got to make my settlement big you've got to got to so that was a great great one I'm really excited to see what Undead Labs does next so what are your thoughts on Xbox overall in terms of like conferences and announcements and just their year they had really good conferences they had really good announcements I mean we go back to the fact you know at E3 Colin has said it before I think I agree with him the biggest announcement was the backwards compatibility right like they're there like it's what I love about Xbox right now is that you it's it's weird right because we're PlayStation fans",
            "start": 6328.72
        },
        {
            "text": "with him the biggest announcement was the backwards compatibility right like they're there like it's what I love about Xbox right now is that you it's it's weird right because we're PlayStation fans obviously that's where our history lives that's where our coverage lies we've covered that beat for so long but you cheer for Xbox cuz they are The Underdogs now and they keep making the right moves they keep coming out and saying the right things they keep making business decisions that are based on is this good for games you know I mean that's what Phil Spencer has been all about when Aaron Greenberg was here with you guys listen to that podcast you know what I mean like they're cognizant of what were their missteps were and how they need to fix them and go forward and it seems like it's Everest and are they are they going to be able to get up that mountain because PlayStation continues now to dominate out there and it's one of those things where I think in the old days it was so easy",
            "start": 6363.04
        },
        {
            "text": "and are they going to be able to get up that mountain because PlayStation continues now to dominate out there and it's one of those things where I think in the old days it was so easy in in the console war to sit around and pick a side and be like **** those other guys da D and now everybody is has these spokes people these voices these faces that you connect with it's like I want I want Phil Spencer to win I want him to have a you know I want him to be as successful as Shu Hayabusa I want these things to be out there and have it where like Rise of the Tomb Raider comes out and is an amazing game and sells really well you know what I mean because it sucks when it doesn't because then people aren't playing in this that and will Crystal Dynamics ever recover from you like all these different things it's like it's just everybody's human now and that's awesome that's what I love about it you know what I mean like everyone is human now so you sit there and it's",
            "start": 6399.64
        },
        {
            "text": "you like all these different things it's like it's just everybody's human now and that's awesome that's what I love about it you know what I mean like everyone is human now so you sit there and it's like man Nintendo's year wasn't great but but we know people over there that are all great Cory and Reggie and all these different it's like you know I want them to do well mhm same thing here I think Xbox made all the right calls all the right decisions and it didn't pay off in the Monumental they're back on top and now it's this race where they're going to you know trade the lead back and forth back and forth I don't know what it looks like next year now the next year is like if they stick to their messaging of games games games games games and Sony does this PlayStation VR thing where and that does let's say that doesn't work out what does that do to Xbox yeah definitely interesting so so just uh kind of adding into this topic we also got PC games and mobile games hold on shit's going",
            "start": 6431.84
        },
        {
            "text": "that does let's say that doesn't work out what does that do to Xbox yeah definitely interesting so so just uh kind of adding into this topic we also got PC games and mobile games hold on shit's going crazy right now shit's going crazy on your mobile device yeah it is wake me when all your mobile device games come to V in four years so uh for PC we had at least on my list there's Her Story and Emily is away a whole bunch of yes yes yes her story and uh I like Her was a great movie with The Walking Dead that I really dug yeah so I didn't play have you seen that yet Colin that is a movie you need to see it's about AI technology Future No this is one of the ones where I'm doing the stress thing to tell you you have to watch it good haircut by the way so did you play Her Story no so it was just you yeah it was Nick andai right I it wasn't you then it was Nick andai yes yes yes and I think one of the only Let's Plays we've ever taken down and then didn't put back up the audio got all **** up",
            "start": 6467.12
        },
        {
            "text": "yeah it was Nick Shady right I it wasn't you then it was Nick Shady yes yes yes and I think one of the only Let's Plays we've ever taken down and then didn't put back up the audio got all **** up in whatever great game really amazing performances and it was another one if you don't know her story which is possible don't it's like Gone Home don't know anything about it just jump in and play cuz that's what we did everyone was talking about it we sat down and they started up and you're at a computer terminal yeah in first person I like what the **** is this and you start piecing it together and those like wait search this holy **** oh my god do this da da da like it's awesome like I want I hope that game I mean obviously for selfish reasons I hope it gets ported to consoles so you could do it it won't because it's keyboards and everything else so everyone should just go play it on PC it was that much fun I was shocked to see it win so big at the Game Awards I think that's a good",
            "start": 6510.52
        },
        {
            "text": "do it, it won't because it's keyboards and everything else so everyone should just go play it on PC, it was that much fun. I was shocked to see it win so big at the Game Awards; I think that's a good sign for it, because you know there's certain games that you know we have a lot of friends in the industry, so when something happens, you know about it pretty instantly because everyone's tweeting like you got to play Gone Home. This was one of those things, you got to play this; oh I'm loving this right now, whatever but it's like there's that weekend and if you miss that weekend, you never hear about it again, because people are on to the next thing, and to see this game, like I haven't heard about it since you know everyone's talking about it, you're like we got to do a let's play, let's do this then. It kind of went silent; yeah didn't hear anything about it, and all of a sudden it, it's winning **** I'm like that's great for that; like same thing with Gone Home where it's like I feel like it did",
            "start": 6547.8
        },
        {
            "text": "it kind of went silent yeah didn't hear anything about it and all of a sudden it it's winning **** I'm like that's great for that like same thing with Gone Home where it's like I feel like it did have that moment of conversation and then it dropped off but then eventually got to the mainstream because of the awards and stuff so no yeah Her Story was great I highly highly recommend it yeah and then Emily is Away my God you want to talk about like I did a I'm doing a piece for Game Informer and for Giant Bomb of my top 10 games and where Emily is Away lands on it and I'm sure it'll be in the same spot when we do our video next or two weeks from now two week from now like totally man I could not believe how high that rank because it is one of those things where yeah it's a short game you know we our let's play is 50 minutes you know what I mean and that's with us Heming and haing and being idiots it's all realistic of us Heming and haing and like such a trip it got emotion out of us",
            "start": 6581.96
        },
        {
            "text": "know we our Let's Play is 50 minutes, you know what I mean, and that's with us Greg and Colin being idiots, it's all realistic of us Greg and Colin and like such a trip it got emotion out of us what I kept talking about and when I was talk when I talked to people about Emily as away is the fact that it's like you have to understand sitting there and playing that game in my spare bedroom for Kinda Funny with Tim next to me or whatever  that like in my head I am at my desk freshman year of college at MUM with my huge Toshiba looking out at this like it's all right there cuz this was life this was it where you're you leave these people and you then start talking to them through AIM messaging and like picking the right buddy icon and then picking the right response and all stuff and like the way you and I sat back like what are we saying what do we do well what's funny is like you you say that like you're not in this room you're by yourself whatever to me it's not even by yourself",
            "start": 6619.44
        },
        {
            "text": "the way you and I sat back like what are we saying what do we do well what's funny is like you you say that like you're not in this room you're by yourself whatever to me it's not even by yourself like those memories are having someone next to you it's like what should I say what should I say and you overthink it and like talk it over and like rewrite it 10 times like oh that game, Final Fantasy Versus XIII, did something man I'm so happy that I I recently looked at the the numbers for it like the let's play is over 50,000 views which puts it in the upper echelon of our our Let's Plays that's awesome cuz it didn't when it first came out it wasn't moving numbers and I was like guys like you I'm going talking about our performance like you need to see this game if you're playing this game and I love that I love that it's like it is it's I want Kinda Funny Games to be known for that type of stuff it's for those those moments of it's like we genuinely enjoy this you know it reminds me of your Batman v Superman reaction",
            "start": 6660.72
        },
        {
            "text": "like it is it's I want Kinda Funny to be known for that type of stuff it's for those those moments of it's like we genuinely enjoy this you know it reminds me of your Batman v Superman reaction like who gives a **** what everyone else thinks like you genuinely love this thing and I I just it it's great Emily is away highly recommend it do it definitely check that **** out uh is there any other PC games I'm sure there's a bazillion but I'm talking about that we really care about we connect with cuz it's out of our normal wheelhouse what was the one where we jacked the car off oh DriveClub or no that was that was Burnout Paradise find the jack it it was just jacking a car off it not uh **** there was one that I had a momentary glance at jacking the car off is what I said and that made me think of something else remember the game Party Hard I enjoyed Party Hard that's finally out or whatever or Greenlight or whatever oh yeah yeah yeah there was one I don't think it's out",
            "start": 6694.68
        },
        {
            "text": "that made me think of something else remember the game Party Hard I enjoyed Party Hard that's finally out or whatever or Greenlight or whatever oh yeah yeah yeah there was one I don't think it's out yet but we played the early version of it that uh it was like a very sterile white white stuff and super hot super hot super hot super hot awesome awesome concept really cool game I I love the you know the Steam Greenlight stuff brings a lot of bad **** it's like mobile games like there's like so much bad but then it does allow the like really cool random thing to come through so I was a big fan of that do you have any no no no I don't think I played much I play Civilization 5 that's pretty much the only PC game I play um and then for mobile I do got to give a couple shout outs because I have put so much hour like Pagel blast I talked about it all year it came out the tail end of last year but I didn't start playing until this year sure and uh they there's a lot of problems with",
            "start": 6740.56
        },
        {
            "text": "I have put so much time like Pagel Blast I talked about it all year it came out the tail end of last year but I didn't start playing until this year sure and uh they there's a lot of problems with it just in terms of microtransactions and this and that you've heard it all before you could hard boot your phone to get around it yeah but there's there's there was a new update they put out recently that gives a lot more lives and gives you some stuff and man I'm telling you Pagel Blast is the best Pagel game that ever happened like when you don't have to deal with the stuff like like you know it's not too hard to get around it but I mean you saw me anytime we were on a trip I was going through that stuff and it's like if you could Platinum this game I would Platinum this game it is just so much fun there's so much to do and you know Pagel's always been cool because it is just a simple brick breaking game but then with the powers and stuff and just the stupid ass music that plays",
            "start": 6781.88
        },
        {
            "text": "so much fun there's so much to do and you know Pong's always been cool because it is just a simple brick breaking game but then with the powers and stuff and just the stupid ass music that plays and like it's just you know know adds a fresh twist to it and Pong Blast I think is ideal because it's on a mobile phone where you play vertically instead of the the horizontal version that you normally do with Pong it gives you so much more real estate it just changed the game up enough and I'm like **** I'm **** addicted to this there was no game I was more addicted to than Pong Blast um Luftrausers go oh yeah very fun very cool I liked that it um felt like a more fully featured game even though it was on mobile um my biggest problem was that it it's a tease it's such a tease at what could have been a really fun challenging difficult puzzle game it ended up just being kind of a puzzle game where you play it and you're like I know exactly what I need to do yeah you always said this it",
            "start": 6820.84
        },
        {
            "text": "Have been a really fun, challenging difficult puzzle game. It ended up just being kind of a puzzle game where you play it and you're like, \"I know exactly what I need to do.\" Yeah, you always said this; it was never hard enough, right? Yeah, you see the room, you have all the things, you look at them, and you're like, \"All right, I need to move this thing there.\" So then it just kind of becomes about going through the motions of doing it, but it's still fun to do, and it's still cool to see. And I love the art style of it; I love the music, and just the visuals are really engaging. It's a fun Lara Croft game, like it reminded me a lot of the old Tomb Raider games. You know, we saw the... we had them on the panel in Prime, yeah, and they're talking about how this is what we remember Tomb Raider being, and it's like that; really, it's much better than the original games, yeah, yeah. There are many of them jumping around. Pac-Man 256 did you",
            "start": 6864.84
        },
        {
            "text": "made a game that was what we remember Tomb Raider being and it's like that really is this it's much better than the original games yeah yeah there is many of them jumping around um Pac-Man 256 did you play this no I heard good things awesome I mean it's it's the same thing with which is kind of like it's just Pac-Man but back in the day Pac-Man 256 level when you got there there was like a glitch where everything would start glitching and they're like let's make a game out of that and it kind of just became this thing where it's an endless scrolling Pac-Man game where you just kind of keep having to go up as the bottom the screen kind of just rises with like glitches and stuff and uh it's just a score attack thing and like it's randomly generated and it's just it's fun Pac-Man just like techno music just blaring and stuff it's a definitely planning game for me um I enjoy that and the one that doesn't get talked about enough is Horizon Chase you like Cruisin' USA and I don't",
            "start": 6904.0
        },
        {
            "text": "like techno music just blaring and **** it's a definitely a planning game for me um I enjoy that and the one that doesn't get talked about enough is Horizon Chase, you like Cruisin' USA and I don't know why you wouldn't this is the game for you it's just takes that that stupid arcadey racing from the 90s thing where it's just like you just go and you perfectly drift around everything without having any skill at all really just you just hold it you just go and then you just it's left and right and it just kind of like Auto does it but it's addicting and it's fun and there's the stupid like dancing girls at the end and stuff and it's just it's exactly now we know why Tim likes it oh yeah I'm all I'm all ended yeah the soundtracks are great and everything it's just it's very 90s it's very Tim I'm a big fan of that those are those are my mobile games um Tim's mobile game, yeah gotta give him the shout outs I'm glad you did yeah ladies and gentlemen that was 2015 whoa Whoa man hey man",
            "start": 6944.92
        },
        {
            "text": "I'm a big fan of those - those are my mobile games, um Tim's mobile game, sha yeah gotta give him the shout outs. I'm glad you did, yeah. Ladies and gentlemen, that was 2015. Whoa, whoa man, hey man, thank you aren't them Nuggets man, you got them dank Yum Nugs. What are your favorite games of 2015? Let us know in the comments below, and make sure you come back next week where we will be predicting 2016 - it's going to be a wild ride, it's going to be a lot of fun. One day I predict that I'm going to get that NBA Championship, never, I'm never letting it go. It's Toad Stool Tour is the next one, so start practicing you, yep. Thank you so much for everything till next time, I love you.",
            "start": 6984.84
        }
    ]
}