{
    "id": 1503,
    "video_id": "bLd8TjpFHUM",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller"
    ],
    "title": "Greg Miller in LEGO Marvel's Avengers - Kinda Funny Plays",
    "description": "Greg Miller is Aldrich Killian in LEGO Marvel's Avengers, some come watch him play with himself!\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1453795200,
    "duration": 1339,
    "transcript_chunks": [
        {
            "text": "What's up everybody, it's me Greg Miller. Welcome to YouTube.com/KindaFunnyGames today we're doing a let's play of LEGO Marvel Avengers. You can see it here and it's special because we're going to show you the part that I'm in. Uh, if you didn't know, I get to be in my first video game here, LEGO Marvel's Avengers. I am Aldrich Killian - you might remember him as the bad guy Guy Pearce from Iron Man 3. So we're joining the level Ready Aim Fire already in progress. You can see I'm playing as that dumb kid; remember that dumb kid? He had a Tony Stark here, and there's that dumb kid Harley Keener. There you go! Join us - Harley has a potato gun, you can shoot out potatoes. I've already done a lot of the work here, and Tony's running through the streets here. Um, what's interesting about this is that basically the way LEGO Marvel's Avengers works is that you're playing through both Avengers movies; then when you beat Avengers one, it unlocks a bunch of side levels - I'm calling them",
            "start": 0.12
        },
        {
            "text": "Is that basically the way LEGO Marvel's Avengers works is that you're playing through both Avengers movies, then with when you beat Avengers one it unlocks a bunch of side levels I'm calling them side character levels like Iron Man 3, like Thor: The Dark World, uh, Captain America: The Winter Soldier. Where you go play there and if you're familiar with the LEGO games how they usually do DLC where you get like the ant not it's not like the CG cut scenes in between every level break you get instead like a comical page that explains the story that's what you get here so I'm already into this is the end of part two cuz you remember every level has three parts if you didn't most levels LEGO have three parts broken into them so right now we're finishing up the part two which then gets you to part three which is me as Aldrich Killian and not the whole way don't get don't worry I'm not all over but at the end you get to fight me, right now we do just woman she go is this the",
            "start": 37.72
        },
        {
            "text": "is me as Aldrich Killian, not all the way through, don't get it, don't worry I'm not noob in this thing, I'm not all over, but at the end you get to fight me right now we do just woman she goes is this the opening going to hit her with a potato gun maybe I'm going to hit Tony too uh but so far I'd say I think my game clock has me at 17 hours into LEGO Marvel's Avengers having a great time going to platinum it well on my way over 50% of the trophies now you can already see that I have the stud multiplayer going crazy over there what is it, 1920 just disappear of course I want to talk about it uh but that's you know you go through the level you if you ever played a LEGO game you're a crazy human being you use of a microwave Tony defeated the remaining Extremis agents and headed off to take down the Mandarin then things got complicated very quickly the Mandarin turned out to be a washed up British actor called Trevor Slade and the real villain was actually someone familiar, not an ex-neighbor but a nerd",
            "start": 78.4
        },
        {
            "text": "then things got complicated very quickly the Mandarin turned out to be a washed up British actor called Trevor and the real villain was actually someone familiar not an ex-neighbor but a nerd turned superhuman called Aldrich Killian I've got to admit he was looking much more suave these days Killian only went and took me hostage exposing me to Extremis he also kidnapped the President too and planned to serve him up like a roast turkey Tony turned up to save the day this time with Iron Patriot by his side and his entire back catalog of Iron Man suits the 10-year-old with the potato gun would have come too but he had to tidy his room so again if you've never played Lego DLC that's usually how they do the DLC so you have these levels at the end like I said the character pieces Lego Avengers levels right have the whole they take a scene from the movie use the dialogue from the movie and then cut him and you know do funny things so it looks all fun Quicksilver doesn't get shot to death",
            "start": 124.48
        },
        {
            "text": "levels right have the whole they take a scene from the movie use the dialogue from the movie and then cut him and you know do funny things so it looks all fun Quicksilver doesn't get shot to death spoilers for Avengers: Age of Ultron uh instead he like gets you know covered in ice takes it off it's like cute stuff so anyways now we're at a real Lego level I like I was saying before you can see as you play when you play through right now we're playing in story mode of Lego right if you're a Lego fan you know what you play through the story when you beat a Lego level though you get to go back in free play with different characters that then you can go through switch whoever you want to get to all the things you couldn't get to before like right now none of our guys can break this glass we would need Hawkeye for you know one of his Sonic arrows to break the glass uh but right now you're just running through playing as Pat playing as Man beating the hell out of everybody and so when",
            "start": 168.64
        },
        {
            "text": "Greg Miller would need Hawkeye for one of his Sonic arrows to break the glass, uh, but right now you're just running through playing as Pat, playing as Iron Man, beating the hell out of everybody. And so when you play the free play and you go through the free play, you know, find the collector in these Free Play Levels, and he wants an item; give him the item, and then you can go buy the red bricks, and so I've been buying the red bricks, which augment the game, uh. And like right now, I have, you know, I don't have them all - this is one of the things I'm still working on. I got it for this level already, but I'm attracting studs, and then I'm multiplying my studs like nobody's business. So that's why you can see I'm, you know, I'm currently so far in just these this this one level; I've gotten 214 million studs. And so in the beginning, it's a hard it's you know, you're building up to that - it's not like you're just out there doing it. But now, now, now, you come in, you get to feel like goddamn Jesus over here.",
            "start": 204.92
        },
        {
            "text": "and so in the beginning it's a hard it's you know you're building up to that it's not like you're just out there doing it but now now now you come in you get to feel like Goddamn Jesus over here, a stud's Jesus, they I think they call him, there blow that up and I don't need to do this this I think would have been a mini-kit on my first play through mini-kits on like comic book these comic book covers now and stuff rather than just building out item right there I need a Thor if I had Thor Thor get smacked out or Hulk you know somebody super strong not pun pun Iron Man here we go keep working what up tire fire never good not you know not as bad as a garbage truck on fire we all know how those go I can already tell you I can already tell you as if I haven't played this level once or twice whoa um but yeah you know it's I've gone on record everybody knows it I'm a big DC fan as you know um having a great time though with the the Lego not not just cuz I'm in it cuz again I'm in it for like 2",
            "start": 241.28
        },
        {
            "text": "\"um but yeah you know it's I've gone on record everybody knows it I'm a big DC fan as you know um having a great time though with the the Lego not not just cuz I'm in it cuz again I'm in it for like 2 seconds don't worry about it I you can play as me we'll do that after here you'll get to see that I I have a few more on liners there as I burn people to death but again not really to death just break into their little Lego bits uh having a great time though that's what I'm saying uh I think LEGO Batman 3 if memory serves took me like 60 hours I would say I'm on track for that too uh with no 30 sorry that's ridiculous 30 hours uh with the figure that I'm like I think like I said 15 or 16 hours in a little halfway through right now and now it's just to clean up fun stuff of going through finding gold bricks in the open world and such show you some of that here in a little bit like uh these new finishing moves now here's a new team up move right so it's Iron Man and Iron Patriot where he\"",
            "start": 287.56
        },
        {
            "text": "gold bricks in the open world and such show you some of that here in a little bit like uh these new finishing moves now here's a new team up move right so it's Iron Man and Iron Patriot where he just gives you the boost some lots of them are like that where it's just like all right cool you toss me up in the air some of them are super super cool where it's like you know like Thor slamming his hammer down on Cap's Shield uh there's one I want to show with but Scarlet Witch has a great one I want to say with Cap where he throws her up in the air but then she like spins around and just like blasts everybody on the floor and stuff neat little things but then you always have these not always you the yeah I'm not going to fall I can fly they didn't expect that when they hit Iron Man huh him this guy there that's complete spinning get on there there we go guys I practiced for years Those runs are based them all on Tim the Toolman Taylor that's right this stuff",
            "start": 331.16
        },
        {
            "text": "Greg Miller in LEGO Marvel's Avengers - Kinda Funny Plays\nF Iron Man, huh? Him, him, this guy there, that complete spinning. Get on there, there we go, guys! I practiced for years. Those runs are based them all on Tim Gettys the Tool Time table, that up right. This stuff there you go, drop that down here, throw this build this guy here do that got to move this obstruction you see? So I'm going to build a big magnet as you do Build It Up charge it up do this in back that good go fight Aldrich Killian remember level here oh no that's not I want to start level here ready aim fire. So when you unlock that one and you want to live your life, the dreams of beating me to death, you wanted the Mandarin Tony well here I am I am the Mandarin that's when I said I was the Mandarin and everybody get really mad because everybody hated that remember that I did not understand it I like I liked it fine I thought the Mandarin I thought Ben Kingsley was cool with the Mandarin even if he wasn't a bad guy it was a nice swerve I liked Iron Man 3 Iron Man 3 doesn't get enough",
            "start": 370.92
        },
        {
            "text": "it I like I liked it fine I thought the Mandarin I thought Ben's King Loki was cool with the Mandarin even if he wasn't a bad guy it was a nice swerve I liked Iron Man 3 Iron Man 3 doesn't get enough credit tell you that right now I like the characterization of Tony Stark I like that for once there were like ramifications to everything that happened you know what I'm saying Greg I agree no huge I'm not but let's talk about Iron Man 3 not not why I agree with you a thing in Marvel dorks from DC dork I need your help I don't understand yeah why at the beginning of Avengers: Age of Ultron Tony had suits and was flying around as Iron Man and doing all this stuff you just can't win you know that don't you I'm very very angry I need to tell you you should buy the game obviously and play me and hear my lines the beginning ah oh God you're only delaying the inevitable Tony perhaps this will teach you to be nicer to people you randomly meet at parties see that was my favorite one of the lines they",
            "start": 458.84
        },
        {
            "text": "\"Hey, my lines begin. Ah, oh God, you're only delaying the inevitable, Tony. Perhaps this will teach you to be nicer to people you randomly meet at parties. See that was my favorite one of the lines I got to record. Now granted, I say I said I talk about hot peppers and Beyond and Kinda Funny lines as well, but I thought that was just a clever line in general, just like remember this whole thing stems from Tony Stark being mean to him at a party once. I'm not afraid to tell you to get over yourself. I'll just turn it off. Oh God, no big finale. Everybody get ready. You take a minute if I can get into the animation. I think there's no version of this where you come out on top, man. Than this and this, you see that suit was just like you, a failure. Do me a favor and blow up Mark 42. No, even after being cooked in an Iron Man suit, Killian was still up for another round. Luckily for Tony, I was in no mood for any more nonsense. Combining my terrifically toasty powers and an Iron Man suit.\"",
            "start": 505.2
        },
        {
            "text": "no even after being cooked in an Iron Man suit Killian was still up for another round luckily for Tony I was in no mood for any more nonsense combining my terrifically toasty powers and an Iron Man Repulsor I flame grilled the big geek with that maniac out of the way Tony celebrated by blowing up all his suits promising to spend the holidays with me rather than with a screwdriver and an Arc Reactor with the President now safe and sound Tony promised to use his Super Genius to find a cure for the Extremis enhancements straight after we'd had a festive dinner oh and after he'd had his shrapnel removed oh and don't forget he is Iron Man so there you go that was my big boss battle or whatever now I'll play as I'll play through a little bit here and a little bit of free play let me see now that's also you can see that I have two billion studs right now again they call me Stud Jesus get it Tred uh so yeah that was but again I'm just saying like I just don't I'm with you like well I don't",
            "start": 650.36
        },
        {
            "text": "also you can see that I have two billion studs right now again they call me stud Jesus get it Trend uh so yeah that was but again I'm just saying like I just don't I'm with you like well I don't understand where the breakdown was of why we didn't get that why why the you know conviction of Iron Man 3 didn't carry over and day Iron Man or no Avengers Age of Ultron not that we expected it to but I expect there be a reference to it there's no reference so here we are out in free roam Manhattan uh you see there's Al um we'll go screw some guys up over here you'll hear me talk a little bit more you hear me grunt again feel the burn like a habanero pepper inside your head see habanero pepper cuz I'm known for doing that Lego Batman uh hot pepper gaming makes sense they're on top over by Guy I should have gone to a better place so now we're out in the open world of course if you didn't know there's hub worlds uh happening being underestimated I just have to say that I never thought you'd be able to",
            "start": 698.48
        },
        {
            "text": "\"Have a better place so now we're out in the open world of course if you didn't know there's hub worlds uh happening being underestimated I just have to say that I never thought you'd be able to do that a million years I'm just kidding great work uh right now I have one with my gold brick on that uh shows me where all I'm sorry got my red brick on that shows where all the gold bricks are so that's why of course the world is filled with yellow arrows right now that be there just for you if they jump try to find somebody else to fight here here we got a shield thing going on over here out of perfect there we go is it a deep burn you're feeling exothermic manipulation is truly fascinating and I think those are all the ones they use for these attacks so you you can see that's not many lines in the game right and granted it shouldn't be I'm not a professional voice actor I was just in there because you guys care enough about me and I've talked about Lego games for a long long time\"",
            "start": 750.24
        },
        {
            "text": "lines in the game right and granted it shouldn't be I'm not a professional voice actor I was just in there because you guys care enough about me and I've talked about Lego games for a long long time so I think they were like all right put this Chugglehead in there um but what it was fun cuz it took I remember when I went to do the vo session right and got to go to the Warner Bros Studio lot with the whole water tower up there and I took a photo and sent it to Rob Paulsen of course from Animaniacs but what I remember I remember going there I'm like ah this is going to be like 5 minutes cuz this is going to be like maybe 10 minutes of just reading down this page and the line reads they they had me do a bunch of takes or whatever Liam O'Brien good dude voice director cuz he knew I had no God dang idea what I was doing so he walked me through it on everything on that but those the lines like that you saw in the cut scene or whatever in in the fight those weren't you know two or three",
            "start": 817.16
        },
        {
            "text": "Greg Miller is Aldrich Killian in LEGO Marvel's Avengers, some come watch him play with himself! He walked me through it on everything on that but those the lines like that you saw in the cut scene or whatever in in the fight those weren't you know two or three takes each right and then it was all right turn now we're going to go to this other page and it was just a giant page of Grunts and groans and stuff because it's like sure there's like these little jumps here but like they need to be ready for like if I walk over to something I can't interact with and I hit it and I'm like and then it's like if I if I fall off of like or jump off of something like that right or versus jumping off a giant building and falling to my death or whatever there was all the these little things I never had to think about that they were like all right well now you're it walk me through like okay um now we now you're going to fall off a giant building so like you know you're falling for a longer period of time let's go find out let's go find a building here we'll",
            "start": 851.96
        },
        {
            "text": "It walks me through, like okay, um, now we know you're going to fall off a giant building, so like you know you're falling for a longer period of time. Let's go find out. Let's go find a building here; we'll jump off Stark Tower or Avengers Tower, I guess. Now building, I still remember you know what I mean. I'm OG Kevin as they say, but this is the Hub world for Manhattan, uh, the biggest Hub World they have IMO. There's also like going to the farm from uh Age of Ultron; you can go to uh Asgard; you can go to uh The Shield base and stuff like that. There's a bunch of different places to go to. Oh, of course, uh up I don't know what shot I almost screamed that I thought I was going to oh God Kevin, I'm trying to fly up into the ceiling, uh, anyways above Manhattan at all points is The Shield helic carrier; you can go up to that's where you buy your your red bricks and such. All right, Tony, what I want you to do is go over here, go over here, cut him, cut him, all right, there we go. Now I'll put back on Al, see if he makes a...",
            "start": 884.68
        },
        {
            "text": "up to that's where you buy your your red bricks and such all right Tony what I want you to is go over here go over here cut him cut him all right there we go now I'll put back on Al see if he makes a noise as he falls Hulkbuster armor hell yeah uh you can see I'm working my way through unlocking everybody getting there is going to take time this is I mean that's why Lego games they take time nice to not even using the scream TT games I gave you a scream he said if I fell from a very high thing that wasn't high enough for you come on I don't even know you you jump from the hel no I guess that maybe that's part of it too is that I jumped I don't know I want to show you this before I go yeah hey there it is I was like a squirrel girl should be right there right so Squirrel Girl's here she's awesome she's amazing uh she can throw squirrels you're like hell yeah she can charge up this squirrel rage attack Squirrel Rush shot but then I didn't expect it when I hit it the first time to",
            "start": 935.36
        },
        {
            "text": "She's awesome, she's amazing, uh, she can throw squirrels. You're like, \"Hell yeah,\" she can charge up this squirrel rage attack, Squirrel Rush shot. But then I didn't expect it when I hit it the first time to switch her; she can call in her own uh Hulkbuster armor that's Squirrel armor so she's kind of like the best character ever now Stan Lee has his own one of these two, that's like Stain Buster armor that I remember. Uh, I got to, I was lucky enough to do the San Diego ComiCon panel last year for this and uh they debuted the Stain Buster there but still now I'm just in a Squirrel Girl armor being a badass fly around New York. You got to like that Kevin, I love it, you do all right, good so a helicopter car you've seen before uh de close out here we' I mean the hel you know was in the last Lego Marvel game you jump off the thing run out there and do it you can get to the collector's uh little room there but what is interesting is this one you can go to space. This is going to give you an idea of",
            "start": 993.56
        },
        {
            "text": "Greg Miller in LEGO Marvel's Avengers - Kinda Funny Plays\ngame you jump off the thing run out there and do it you can get to the collector's uh little room there but what I is interesting is this one you can go to space this is going to give you an idea of how big the world is how many levels there are and stuff and this is based on the basically you'll see it's every level that would then tie into the Avengers movies then the one-offs like I was talking about so like but then also like anytime you see a flag like this like that's a hub world so I could just go there and run around it like Manhattan they're not as big as Manhattan mind you but they're there but then you get to see like these are actually like levels that you would have done this is this is one of the ones that unlocked which is the you know uh Thor two thing and then these are Avenger levels Avenger level fly over here a lot of this happens in America I'm not sure if you know you got one you got one Korea level over here hooray then you get back here Malibu is a hub world uh",
            "start": 1044.52
        },
        {
            "text": "levels Avenger level fly over here a lot of this happens in America I'm not sure if you know you got one you got one Korea level over here hooray then you get back here Malibu is a hub world uh like I said Shield go up here you got this got Bart Farm Barton Farm's fun we'll go there and we'll go there and see unless I've done uh no I haven't done everything so I I'll do some stuff here for you we'll try to get something try to unlock something do something cool but see there you go you're all fine I got two I got two banners puny banners out of the situation but like I'm saying having a great time now you know Lego games I always have a great time with sure but I'm usually picky and choosy about the platinums usually only going crazy for the DC ones uh having I'm super into this one I'm going to eventually double back cuz I never did all the way through I played Lego Marvel when it first came to PlayStation 4 of course one of the launch titles so many times that I was oh no I I don't",
            "start": 1080.36
        },
        {
            "text": "to eventually double back cuz I never did all the way through I played LEGO Marvel when it first came to PlayStation 4 of course one of the launch titles so many times that I was oh no I I don't want to repeat um that I was like you know whatever here uh Quicks now he's one he's probably the coolest person to play in the game I I usually pick a flying character cuz you have to navigate so much but a lot of the races they'll have you do uh you can run around as Quicks and then here we go we'll go do one over here I haven't done this one yet yeah I haven't done this one yet signified because the red truck's still there you can put on that extra juice there hold down Circle run even faster this is just fun Kevin I don't care who you are turn off the Jets there for a sec see they want you to use cars they're not expecting you to use really fast guys who have accents there you go boom done now I've unlocked",
            "start": 1123.92
        },
        {
            "text": "turn off the Jets there for a sec see they want you to use cars they're not expecting you to use really fast guys who have accents there you go boom done now I've unlocked that now I got to go buy the pickup truck spend my studs on it thankfully I have a few billion so I'm I'm I'm in pretty good shape when it comes down to the studs there something else I thought I saw of course the gold bricks located there I've unlocked that got this do that I mean it's like I'd like to show everybody I don't know what to do I want to show Lady Thor Jane Foster Thor come in here see that's I need electricity there so charge up call it down over here shoot into this thing like the this is you know the next 15 hours of my life just sitting here running around activating things stuff over there I want to go get the fact that wonder why now see this is this is it cuz he's like I'll just do one more thing well now I'll just do one more thing well now I'll just do one more there",
            "start": 1185.0
        },
        {
            "text": "over there I want to go get the fact that wonder why now see this is this is it cuz he's like I'll just do one more thing well now I'll just do one more thing well now I'll just do one more there you go do that St fires only Captain America can put out fires not 100% sure don't bust my balls in comments I know this guy these are on that get this Farm running again wa it was meant to be so ladies and Gent this is Lego Marvel's Avengers I'm in it even if I wasn't i' would tell you it's a fun game I have a lot of fun with it it's very cute I don't think you can look at these characters say they aren't cute Kevin are they cute very cute thank you very much Kevin that's all I I needed from you you know who else I like being here I like being Miss Marvel now I've seen Kamala Miss Marvel in here or whatever haven't unlocked her yet I've worked with her but now I'm just flying around super speed being super cool so ladies and gentlemen thank you for watching this let's thanks for your",
            "start": 1249.36
        },
        {
            "text": "in here or whatever haven't unlocked her yet I've worked with her but now I'm just flying around super speed being super cool so ladies and gentlemen thank you for watching this let's thanks for your support of course the only reason I'm in this game is because you guys for some reason like my idiocy so thank you for everything you've given me thank you for watching this let's play and until next time been my pleasure to serve you",
            "start": 1305.44
        }
    ]
}