{
    "id": 1498,
    "video_id": "xhxh3Iy_3Ic",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Michel Koch",
        "Portillo"
    ],
    "title": "Life Is Strange Spoilercast - Kinda Funny Gamescast Special",
    "description": "Life Is Strange Co-Director Michel Koch comes to Kinda Funny to talk about the ending, Chloe, and your questions! Only watch/listen if you've beaten the game!\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1453482003,
    "duration": 4356,
    "transcript_chunks": [
        {
            "text": "What's up everybody, welcome to your Kinda Funny vids. Spoiler cast for Life Is Strange, I'm Greg Miller and this is Michel Koch. Michel Koch. I'm sorry, were that formal? I thought we were bros. Oh no no, I was thinking that you were asking for my name, I'm sorry. Oh no, I knew your name. Maybe we should start again. No, we'll leave it in there. This is how Kinda Funny rolls. Sorry guys. We call it GameOverGreggy's garbage truck on fire. No, hey, thank you for coming through. Give me a handshake there. I'm already hugged, don't worry. Everybody knows I'm a hugger. We got the table in the way. You're here to talk about Life Is Strange. Now, if the title and what I just said a second ago, I didn't spoil it for you, this is a spoiler cast. You should only watch this if you've beaten Life Is Strange. This is not going to be like the Steve Gaynor spoiler cast for Gone Home, where an hour and 15 minutes in I spoiled Gone Home. I'm going to spoil Life Is Strange pretty much from the get go. But the first",
            "start": 0.0
        },
        {
            "text": "Is not going to be like the Steve Gaynor spoiler cast for Gone Home, where an hour and 15 minutes in I spoiled Gone Home. I'm going to spoil Life is Strange pretty much from the get go. But the first thing I need to do, Michel, is apologize to you. Why? I feel like I've done you a disservice, sir. I interviewed you at E3, you came on the show, Alexa came on the show, this Ashley Johnson, I'd never heard of her before, she's never done anything since came on the show. And we were sitting there talking about Life is Strange, but I told you I've only played episode one at this point. Episode four had just come out. Alexa was shaking me, telling me I had to have played it, but E3 was there and it was too much and I didn't get to play it. I finally sat down and played all of Life is Strange. Just what, Christmas break, right before the new year. And God damn was it good. And I usually I take my, you know, my role in the industry is very small, right? But I get a chance to talk to people and",
            "start": 41.36
        },
        {
            "text": "what, Christmas break, right before the new year. And God damn was it good. And I usually I take my, you know, my role in the industry is very small, right? But I get a chance to talk to people and tell them games they should be playing, games they should be caring about. Life Is Strange is 100% a game everyone should be playing and caring about. And I feel like I did you a disservice by not playing it earlier. Oh, thank you so much for that. And no, it's good. It's really cool that you had the chance to play it eventually. And that's great. Thank you. It is great. Life Is Strange, everybody. Now, but here's what I like about Life Is Strange is like right now people are getting another shot to play it. So it came out, it was digital, but now you got this collector's edition coming out. Yeah. And we are really happy to have this because when we started to work on the game, we knew that it would be digital only. And we saw that we would never have box CDs and Square Enix was so happy",
            "start": 77.84
        },
        {
            "text": "Yeah. And we are really happy to have this because when we started to work on the game, we knew that it would be digital only. And we saw that we would never have box CDs and Square Enix was so happy with the game that they told us that they wanted to make a boxed version and even more than making a limited edition with cool stuff in it. So I'm really happy that there is a new opportunity for new players to discover the game and even for other players to get the hardcover and the soundtrack and stuff like that. It's really cool. So when you, how long have you been working on Life Is Strange? It's been quite a long ride because actually the real production time was around one year and a half. But we started really working on the game. We were a really, really small team of three people when we started to create the concept for the game. And it was a bit more than two years ago, two years and a half ago. So we had almost one year of mostly just conception phase, not full time",
            "start": 120.48
        },
        {
            "text": "people when we started to create the concept for the game. And it was a bit more than two years ago, two and a half years ago. So we had almost one year of mostly just conception phase, not full time with a really, really small team. Because at the beginning it was a side project for Dontnod Entertainment. So we are at Dontnod Entertainment, we are an independent studio working with publishers. But we just finished working on Remember Me with Capcom and there were those ideas to maybe make Remember Me 2 or other big projects. And one of the co-founders of the company came to myself and two other coworkers and proposed us to think about a small independent game that we could maybe self-publish as a company. And we had mostly, we could mostly do whatever we wanted to do. The only constraint was to somehow use some of the knowledge we had on Remember Me working with time mechanisms. If you played Remember Me, maybe you remember those memory remix sequences. And this was the beginning of really the",
            "start": 166.42
        },
        {
            "text": "use some of the knowledge we had on Remember Me working with time mechanisms. If you played Remember Me, maybe you remember those memory remix sequences. And this was the beginning of really the only constraint we had. Maybe use again this rewind mechanism and trying to improve it and use it in the game. So we went standard and we were a bit on our own for one year just working on the, maybe on our love project. And when you're, exactly, when you're working on it and it's just try this indie thing and this love project, did you think it would ever actually come to be? We hoped to because we were really passionate about it. And we, something that's interesting that we didn't, when we were working on it at the beginning, we never thought about targeting audience marketing. We just wanted to tell this story and make the game. We were really, we're passionate about a game that was mostly for us as gamers at first and for creators and for us as creators. And we really tried to completely",
            "start": 219.82
        },
        {
            "text": "tell this story and make the game. We were really, we're passionate about a game that was mostly for us as gamers at first and for creators and for us as creators. And we really tried to completely shy away from, to what kind of people we should target the game for. What would be the sales? We were really not thinking about that and just thinking about writing this story, making those characters and creating them. Maybe the game of our dreams. I don't know, something like that. That sounds awesome. I mean, like gaming your dreams. Is that how you think of Life is Strange? Right now, I think at this point of my career, yes, I think it's already the project I'm the most proud of having worked on for sure. And so was it the, did the story idea and like you, did you think about like, is it the story idea that comes first or is it the fact that we have this awesome time manipulation mechanic? It's a bit of both. We knew that we wanted to have the time mechanism, but you can use time",
            "start": 263.56
        },
        {
            "text": "It the story idea that comes first or is it the fact that we have this awesome time manipulation mechanic? It's a bit of both. We knew that we wanted to have the time mechanism, but you can use time mechanism in so many different projects. It can be an action game, it can be an adventure game, it could be just only a puzzle game with time, time mechanism. So we already started to brainstorm a lot with that in mind with the two other people. And so there is my co-game director, because we are two directors on the game. The other one is Raoul Barbet and we worked closely also with our French writer Jean-Luc Cano. But you're the only person here because you're the most important. I can say that. You can't say that. I'm kidding. Everybody at home. Don't listen to him. That's not true. Or they will kill me at work if I say that. But yeah, we started to really think about what we could do with this. And quite early we knew that we wanted to do an adventure game more using some of the legacy",
            "start": 312.16
        },
        {
            "text": "will kill me at work if I say that. But yeah, we started to really think about what we could do with this. And quite early we knew that we wanted to do an adventure game more using some of the legacy of the old point-and-click games. I think because we were, you know, in Remember Me, we had the chance to work a lot on the, I was the art director on Remember Me. We worked a lot on the environment. I think we created a really cool universe. But since it was an action game, it was quite fast-paced. You're running through those environments. Yes, you run through. And we had a lot of environmental storytelling, but it was somehow lost with the rhythm. You just, you were rushing the game. So we knew that we wanted to have something where we could maybe take a lot of, where the player could take his time and where we could use this environmental storytelling to really be a part of the story. And so an adventure game, point-and-click adventure game was really a good genre for us to start on",
            "start": 357.0
        },
        {
            "text": "take his time and where we could use this environmental storytelling to really be a part of the story. And so adventure game, point and click adventure game was really a good genre for us to start on that. And then we started to brainstorm about the core idea and character of the game. So there was a lot of different leads. We had some pitch with a male character. We had some pitch with another setting. But I think that the pitch we have right now in Life is Strange was for the strongest because it was really resonating with the time travel mechanism because we have all this kind of nostalgia in the game. The high school setting is for most of the players is in the past for them. So it goes well with the idea of going back in time. And when you're a teenager, we think that it's still a moment of your life when you're making your decisions that will affect a lot of what's how you will be later as an adult. And there's so many I wish I could rewind. Yeah, I think we could, everyone",
            "start": 404.44
        },
        {
            "text": "of your life when you're making your decisions that will affect a lot of what's how you will be later as an adult. And there's so many I wish I could rewind. Yeah, I think we could, everyone of us would want to change things of our teenage years. And yeah, we also are guys in our 30s. So we grew up with American pop culture. There was a lot of influences from that that we really loved like Buffy the Vampire Slayer, Veronica Mars, like The X-Files, like Twin Peaks. All of this, somehow we started to create this story. And I think it's really a work of working everything at the same time, story, game design, characters, main themes, and start to build layer by layer everything until you find something that's completely cohesive. Because I think that for me, what's most important in a game is to be sincere about something, to have a strong message, a strong point of view, and try to have everything go into that direction, instead of trying to do a bit of everything. And so we",
            "start": 453.44
        },
        {
            "text": "in a game is to be sincere about something, to have a strong message, a strong point of view, and try to have everything go into that direction, instead of trying to do a bit of everything. And so we really tried to focus on nostalgia, time mechanism, and of course, this coming of age story, because it is the main theme of the game is a coming of age story of Max. And yes, starting from that we worked on the secondary characters, we brought Chloe quite early in the writing, but at the beginning, we didn't have Chloe, we only had Max and this high school setting slowly going down into a more darker scene with adult world. But it wasn't completely working. And when we added the character of Chloe, we knew that we had something that was really, really good, because we all fell in love with the relationship between those two girls. And we knew that we could use this relationship to really tell this story, talk about the main theme of the game, the fact that you have to make",
            "start": 511.78
        },
        {
            "text": "in love with the relationship between those two girls. And we knew that we could use this relationship to really tell this story, talk about the main theme of the game, the fact that you have to make sacrifices to become an adult, to grow up and to advance in your life. But also about all the secondary themes we have in the game, all those real life issues with domestic violence, and cyber bullying. Even the more things, there's the blended family, right? Of how do you relate to a stepfather that isn't your father, that is your real father? Oh, yeah, I think it was a really an awesome time when we were just working on that and finding the bricks to build layer by layer is this story. We talk about the layers and layers of this, though, whenever I talk to a developer, I feel like the thing most say, right, is that by the end, they can't tell if it's good or not. They can't tell if this is working or not because they've just been in it so long. When you're lost with all these layers, do",
            "start": 556.82
        },
        {
            "text": "most say, right, is that by the end, they can't tell if it's good or not. They can't tell if this is working or not because they've just been in it so long. When you're lost with all these layers, do you know or do you even allow yourself to think at any point that you have something special, that you guys are working on something that's going to resonate with people? To be honest, we had doubts every time all along the process because, like you said, you're never sure it will work and never sure it will reach an audience. Even if we were not really thinking about that, we are not sure. We knew that for us, it was interesting. We were talking about stuff and characters and themes that were important for us. But would it work for others? We had no clue at all, to be honest. And I think that it was hard because even when we were talking about the project to even other people in the company, they were really looking at us with big eyes like, okay, you're telling us a story about two girls",
            "start": 606.58
        },
        {
            "text": "that it was hard because even when we were talking about the project to even other people in the company, they were really looking at us with big eyes like, okay, you're telling us a story about two girls. We just did Remember Me and now we're walking around rooms and looking through scraps of paper and picking up notes and taking photos. Exactly. You're telling us that you have those two girls who just won't do a lot of things without a lot of actions and will be talking and talking about their friendship. Are you sure it's interesting? It's hard. I completely understand that on paper it's hard to sell this kind of project because it's quite different. Do you start, I mean, is positive reinforcement coming through playtesting? I mean, is there a moment, like, you know what I mean? I keep bringing up Steve Gaynor because he was on just a second ago and when we did his spoiler cast for Gone Home, that's what he was talking about, right? It's like they sent out a build of Gone Home to",
            "start": 648.7
        },
        {
            "text": "bringing up Steve Gaynor because he was on just a second ago and when we did his spoiler cast for Gone Home, that's what he was talking about, right? It's like they sent out a build of Gone Home to people they trusted and other developers that they respect, right? And seemed like universally response was, where's the rest of the game? I want to keep playing the game. And they were like, okay, we're onto something. I think that it wasn't that easy for us because we managed to convince people in the company that it was good because after just the pitch of the story, we quickly built the prototype. It was the scene in episode one in Chloe's room where Max and Chloe are seeing each other for the first time and you explore Chloe's room and then you have the drugs, of course, and the scene with David. And when we had this scene working as a prototype with really bad graphics and bad animations, but still a prototype with, we still had the music and the lighting and some of the mood was",
            "start": 693.5
        },
        {
            "text": "with David. And when we had this scene working as a prototype with really bad graphics and bad animations, but still a prototype with, we still had the music and the lighting and some of the mood was here. And then when we showed that to the company, to other people in the company, I think they really loved it. Our producer, Luke, he was not working with that at the moment. He was working on another project. And when he played this prototype, it just came to us after playing and saying that he wanted to work on this with us, that he just loved it. So we knew at this moment that we had something that was working, but it was still a long stretch before showing that to publishers and finding a publisher that would be with us on that. And so then I think, I reached out to people on kindafunny.com slash forums and asked for questions. And one of them came from our friend, Frank Sizemore, the Arctic Sloth. And he says, so how did you guys end up getting published by Square Enix? Like, did",
            "start": 740.06
        },
        {
            "text": "Life Is Strange Spoilercast - Kinda Funny Gamescast Special slash forums and asked for questions. And one of them came from our friend, Frank Sizemore, the Arctic Sloth. And he says, so how did you guys end up getting published by Square Enix? Like, did you have to go shop this around to a bunch of different people? Were you ever thinking about doing it on your own completely indie? So at the beginning we wanted to go completely indie, but the company was in a difficult time because Remember Me wasn't the success we needed it to be. It was a moderate success, but not enough to... It didn't do the huge numbers. Yeah, it didn't do the huge numbers. It was okay, but it didn't bring more money to the company than what Capcom originally gave us. And Capcom was closing deals with most of these Western companies. So there was no Remember Me 2 on the horizon. So the top management of Dontnod, the CEO told us, okay, we need to sell this project because we cannot do it by ourselves anymore. So we went to a lot of publishers showing",
            "start": 782.86
        },
        {
            "text": "Me too on the horizon. So the top management of Dontnod, the CEO told us, okay, we need to sell this project because we cannot do it by ourselves anymore. So we went to a lot of publishers showing the prototypes and in a pitch where we were presenting the game. And it had a good reception with a lot of publishers, but most of the publishers still wanted to change a lot of things in it. They said, oh yes, it's interesting, but maybe you should have more action or maybe you should have a male character or maybe you should add cutscenes or stuff like that. And you're like, ah no. And Square Enix actually, they loved it. When we showed the prototype, it was really, it didn't take a long, long time before they came back to us and said that they wanted to do this game with us. It was awesome. And I think that they were, we were in contact with the London office from Square Enix and most of the guys we saw, they were really in love with the project and really supportive. And it was signed quite",
            "start": 828.34
        },
        {
            "text": "think that they were, we were in contact with the London office from Square Enix and most of the guys we saw, they were really in love with the project and really supportive. And it was signed quite quickly. And then we went on production and we did the game with them, which is awesome. Yeah, obviously. And now you have your limited edition with your soundtrack art book. It's really, really cool. Here's the big question I haven't asked you about this. And I know we know, we're cordial, we're friends. I hugged you as I said earlier. I like things called trophies, you know, these PlayStation network trophies and stuff. Is it a new platinum on this? Do you know, is it share us trophy list with the episodic game or is this its own platinum trophy? That's a good question. I'm not sure. I think it shares the same one as a digital edition. I'm pretty sure it does. And maybe I'm wrong and I'm sorry. I'm not completely sure about this answer. I'll check it out and I'll post it in the comments.",
            "start": 879.26
        },
        {
            "text": "it shares the same one as a digital edition. I'm pretty sure it does. And maybe I'm wrong and I'm sorry. I'm not completely sure about this answer. I'll check it out and I'll post it in the comments. I'll let you know the definitive answer in the description. I'd ask Greg to do it, but I know he doesn't know how to do that kind of thing. You know how to do that kind of thing, Kevin? No, you don't know how to do that kind of thing. You're worthless over there. So you get a publisher, you get on track. They don't want to change anything. Thank God. Yeah, that's good. Then what happens? Is the next big milestone episode one comes out? Yes, I think we start to finish working on the production. So prototype was almost the pre-production, but we still needed to reach the level of polish that was wanted for the game. So we worked a bit more on that with the final character models for Max and Chloe and the good take. And we did a new audio recording for the real voice acting. Sure. And this",
            "start": 920.1
        },
        {
            "text": "wanted for the game. So we worked a bit more on that with the Final Character Models for Max and Chloe and the good take. And we did a new audio recording for the real voice acting. Sure. And this is where Ashly comes in. Yeah, exactly. And yeah, we were also working at the same amount on Episode One and Episode Two. Probably have a sodded content. It's really not as easy as people think it is. Actually, it's quite harder than making a game in one release. Because it's basically like making five different games with no downtime at all between each game. So you're just finishing one game and you're already working on the next one. There's no chance. There's no milestone where you get to stop and have a celebration. Episode One's out. It's like, no. We had some parties after the release of an episode, but the next day we were still at work with the hangover of the party. But yeah, it's basically making five games with two to three months for each game, which is quite short. So now was",
            "start": 964.34
        },
        {
            "text": "an episode, but the next day we were still at work with the hangover of the party. But yeah, it's basically making five games with two to three months for each game, which is quite short. So now was that your first episodic game? Yeah, it was. And now that you're on the other side of it, do you think you'd ever do it again? Did you like that? Did you not like it? Yeah, I really loved it. It was our goal from the beginning to be episodic. For my side, it was really on the creative point of view because we really wanted to explore this way of storytelling using, of course, the knowledge of TV shows. And it's really a different structure. I think that there is a lot of really advantage of doing that for us on a creative point of view. You can really control the pacing because you know that most of the players will play one episode in a go, in one playthrough. So you really know when they start and when they stop. So we can really structure the episode having that in mind. And it also",
            "start": 1013.58
        },
        {
            "text": "most of the players will play one episode in a go, in one playthrough. So you really know when they start and when they stop. So we can really structure the episode having that in mind. And it also allows us to have a slow moment, to have a different rhythm during the episode. In a game that's released as a maybe 20 hours game, a player can stop whenever he wants. And if he stops at a moment of big, slow pacing, he might feel bored and maybe not want to come back. In an episode he created, we knew that the end of each episode, like in TV show, we could have those cliffhangers or crescendo or big moments that would keep the players on their seats and wanting to come back for the next episode. And it also forces us to create the game on a chronological order. Because mostly when you're making a big game, sometimes you are starting by the end. You're not always making the levels in the proper order. And sometimes it ends up with cuts and changes and stuff that doesn't make sense in the",
            "start": 1066.62
        },
        {
            "text": "a big game, sometimes you are starting by the end. You're not always making the levels in the proper order. And sometimes it ends up with cuts and changes and stuff that doesn't make sense in the story-wise. So is one of the benefits of episodic content that you get to see the comments and you get to see what people are saying about it in the criticisms? There is also that aspect. I think a lot of positive aspects. There is also the fact that there are five releases of the game. So there is a much more media presence because after each episode, you have some reviews, some articles, some marketing from the publisher. So the game grows more and more. Instead of one game where everyone plays it at this release and then it starts to disappear. Sure, you get one big debut, right? And if something moves, they should come around your release date, you get this Fallout 4 sniffing around and you're screwed. Because people finish the game in two days and then everything is out and people don't talk",
            "start": 1118.22
        },
        {
            "text": "they should come around your release date, you get this Fallout 4 sniffing around and you're screwed. Because people finish the game in two days and then everything is out and people don't talk about it much more. But with episode, there is also this waiting time between episodes that some players don't like it. Or we can hear that a lot from some of the community that I don't like episodic games because I have to wait. They are screwing us because they want to make more money, which is not the case at all because the game is not made in one go and then we don't cut it in five parts and wait to release them. We are really working during the conception. When episode one is released, we are still working with episode two and etc. The game is not done before. You're not just cutting it up and sitting back watching the checks roll. Exactly. But I really think that in the end, I see it more positive even for the player because looking at the community, I'm looking at Twitter and Reddit",
            "start": 1168.58
        },
        {
            "text": "Sitting back watching the credits roll. Exactly. But I really think that in the end, I see it more positive even for the player because looking at the community, I'm looking at Twitter and Reddit and I think that we have an awesome community with Life is Strange. It's really cool. I've been amazed by the number of discussions, fan arts, theories, fan fictions, cosplays, letters we are receiving almost every day from the fans. It's incredible. So thank you to our community for that. Speaking on their behalf, thank you for making the game. That's the thing about it. When I played episode one, I enjoyed it. I was like, this is cool and it wasn't what I expected. I think that was one of the things about it. It kind of rocked me because jumping into it, I wasn't sure what I was getting into. I was like, oh, this has its own pace. This isn't exactly what I thought it was going to be. Especially at the end, the lighthouse, we see the tornado and I'm like, what the fuck is this game even",
            "start": 1222.86
        },
        {
            "text": "I was like, oh, this has its own pace. This isn't exactly what I thought it was going to be. Especially at the end, the lighthouse, we see the tornado and I'm like, what the fuck is this game even about? What the hell is going on? That's something odd to explain even in a bit. Right, exactly. But then coming back to it, I enjoy episodic content. I didn't wait for them to stack up because I wanted to do it all. I wanted to go. I just did it because that's how my schedule shook out. But the relationship you develop with Max, with Chloe and with the family, Joyce, just wanting to hang out and talk to her all the time. By the end of that, I'm dialed into this game every so often. I look on the Reddit and I look on Twitter. Obviously I have friends who are super into this and do the Chloe cosplay and do all these different things. And it's one of those, from episode one, I didn't see why people were affected that much by it. But once you get in there, it was like slowly easing into a",
            "start": 1263.82
        },
        {
            "text": "cosplay and do all these different things. And it's one of those, from episode one, I didn't see why people were affected that much by it. But once you get in there, it was like slowly easing into a pool. Like before you knew it, it was like, I remember finishing episode four. It grows with you. Exactly. I got to jump right in. That's cool. And I think that's something looking at the player discussions and their reaction, even the players were saying, oh, I hate the fact that I have to wait. Even those players, they were participating in discussions and talking about it. And I think that we are seeing that it works for TV shows and it also works for games because you're creating those talks between the players. They are talking about what they liked in the episode. They are talking about expectations, what could happen, what will happen in the next one. They are creating those chat groups together, talking about the game. And it makes also the characters live within their",
            "start": 1305.38
        },
        {
            "text": "about expectations, what could happen, what will happen in the next one. They are creating those chat groups together, talking about the games. And it makes also the characters live within their discussions and their imaginations between the weight of the episodes. And I think that's something that we can, we are able to create really a character-centric story with the episodic format that a game in one go sometimes might be less focused on the characters and more focused on the big story or what's happening. I think that's also true for movies and TV shows. When you finish a TV show, a lot of times you have the feeling that you're losing some friends or leaving some friends behind. When you finish a movie, you're mostly excited about the stories, about what happened. But it's a bit less about the characters, I think. And that's something that we could really work well with the episodic format, working on the characters. Well, that's something, yeah, it's",
            "start": 1353.1
        },
        {
            "text": "But it's a bit less about the characters, I think. And that's something that we could really work well with the episodic format, working on the characters. Well, that's something, yeah, it's interesting you get to that because now you've stumbled onto the, I think the big thing about Life is Strange and video games and where we are right now with adventure games and story-based narratives and stuff like that is the fact that when we're in a game like Life is Strange and we're making these choices as Max and then you let it breathe like you are where there are all these gaps and I want to go talk to somebody because I want to know what they chose. The way they handle situations is always different than how I did. I feel like it's almost like it's different from TV shows because TV shows, yes, like when a TV show ends and I'm really into it, right, it is I'm saying goodbye to my friends. It's like graduation day. Movies, it's always like, I wonder what happened after the credits, but",
            "start": 1397.82
        },
        {
            "text": "yes, like when a TV show ends and I'm really into it, right, it is I'm saying goodbye to my friends. It's like graduation day. Movies, it's always like, I wonder what happened after the credits, but I'm not like shook up about it. Whereas games like Life Is Strange, I feel like think of it as like bricks being laid down and then we come in and we are the mortar between them, right? We're the concrete laid between the bricks and we start filling in those gaps and that's where it starts to become that we have ownership over the character, right? And it works in both ways where it's like, I love Max and then as I'm sure you know, a lot of people were upset with the ending. This isn't how this should have ended and dah, dah, dah, dah, dah, dah, dah, dah, dah, dah, dah, dah, dah, dah, dah, dah, like that. When you are making the game and episode one comes out, episode two comes out, people start to feel that connection and start doing the cosplay and saying letters like, were you expecting that?",
            "start": 1429.62
        },
        {
            "text": "When you're making the game and episode one comes out, episode two comes out, people start to feel that connection and start doing the cosplay and saying letters like, were you expecting that? Like, you know what I mean? That's the one thing as a creator I wouldn't know what to expect from the audience reaction. No, to be perfectly honest, we weren't expecting anything at all. We weren't really thinking about what would happen and we definitely weren't expecting this level of passion for the fans, for the game. And we are so happy about it. It's amazing because we wanted to create good characters and a good story, but seeing how players are making those cosplays, those fan art, those fan fiction about the game, about the characters and everything, it's amazing because it shows that it really grew with them, that we made something special for them, I don't know. And even more than that, it's some of the letters we're receiving. You know, so we are talking about some difficult",
            "start": 1464.9
        },
        {
            "text": "it really grew with them, that we made something special for them, I don't know. And even more than that, it's some of the letters we are receiving. You know, so we are talking about some difficult themes in the game, so some social issues, some stuff that are sometimes quite dark or not easy. And we are receiving a lot of letters of players talking to us about their personal experience and how they could relate to what's happening to the characters or even how the game has helped them. And this is incredible. I received a letter not so long ago from a girl who said to me that because of the game, she decided to try to make contact again with an older friend from her and that now they are talking again and seeing each other again, which to me is crazy, but it's really good. It's crazy that the game pushed that and it's good, I'm happy about it. And another guy did write to us that because of the game, he was a photographer on his side, but he never dared to show some of his pictures",
            "start": 1515.26
        },
        {
            "text": "the game pushed that and it's good, I'm happy about it. And another guy did write to us that because of the game, he was a photographer on his side, but he never dared to show some of his pictures to people. And the game pushed him to try to show his work to the public. That's basically one of the messages we have in the game about the photography class, that Max should stop being so shy and so insecure. Go win that contest, go to San Francisco. Exactly. And the guy did that exactly and now he's showing his photos and he's getting feedback and wants to be a photographer again. And he did write to us to thank us for that and that's amazing. Sure. I mean, that's the power of the medium, right? I think the fact that you get to step into someone else's shoes, put on their life in this cosplay incident or whatever, and go out and live it in this world and then take those experiences. Because that's the thing, right? At the end of it, my girlfriend and I, it wasn't a real argument, but she",
            "start": 1568.98
        },
        {
            "text": "Incident or whatever, and go out and live it in this world and then take those experiences. Because that's the thing, right? At the end of it, my girlfriend and I, it wasn't a real argument, but she was like, I can't stand Chloe. And I was like, bitch, step back. You know what I mean? Like I was taking my earrings out. I'm ready to fight for Chloe. I love Chloe. You know what I mean? And that was that discussion we had to have of like, she read into these scenarios in different ways than how I read into it. You played together or you... No, we played a part because she'd be along before I did. So she would come out and watch me and be like, oh. That's cool because that's also something we wanted to have in the game that we have a lot of choice and there is a lot of small variations in the game. And our goal wasn't to have Chloe as a perfect character that everybody would like. And even more reactions to you are also depending on the choice you make. So basically I think that you had",
            "start": 1621.54
        },
        {
            "text": "Life Is Strange Co-Director Michel Koch comes to Kinda Funny to talk about the ending, Chloe, and your questions! Only watch/listen if you've beaten the game! \n\ngame. And our goal wasn't to have Chloe as a perfect character that everybody would like. And even more reactions to you are also depending on the choice you make. So basically I think that you had two different experiences, you and your girlfriend, based on the way you played the game and how you experienced your relationship with Chloe, which is awesome because at the end it really changed the way you approached the final choice. The way she did approach the final choice is completely different based on everything you did before in the game. And that's something that's interesting because it comes to a point that I know that a lot of people did criticize us for the fact that you have only two choices at the end. That's people are saying, but if we have only two choices and two endings, doesn't it mean that every choice we made during the game is useless? And I can definitely understand this concern, this critique, but it was really a choice we had from the beginning, something that",
            "start": 1663.66
        },
        {
            "text": "doesn't it mean that every choice we made during the game is useless? And I can definitely understand this concern, this critique, but it was really a choice we had from the beginning, something that we really wanted to push because for us, I really think that you are approaching the final choice based on every choice and consequence you had before in the game. So even if it's not in your face with a lot of variations, I really think that every choice in the game are really changing the way, changing the ending because it changed your perception of what choice you should make at the end. And that's what for us our goal, because the main theme of the story of Life is Strange is really a coming-of-age story where you should learn or see that in order to grow up, to go forward in your life, you need some times to stop looking to the past and to accept the trade-off, to accept a sacrifice and to take a stand, to make a solid decision, be it sacrificing Chloe or sacrificing \n\nNote: I corrected \"coming of age story\" to proper title case (\"coming-of-age story\") as per standard English grammar rules.",
            "start": 1709.06
        },
        {
            "text": "your life, you need some times to stop looking to the past and to accept the trade-off, to accept a sacrifice and to take a stand, to make a solid decision, be it sacrificing Chloe or sacrificing the town. But this decision for me is you take it based on everything you did before. And when you decide to, you accept one of those two decisions, it's when you start to accept that you should concentrate on the future of what will happen next and not try to have this perfect life and changing everything and always try to have a perfect outcome. Because we think that in life there is never a perfect life. It's never black and white like that. Exactly. It's never perfect. It's always, it's more always a question of accepting some stuff and takes, makes the best out of it and seek more of the future and not the past. Tomorrow there's a Square Enix event here. By the time this posts on Friday, it'll have already happened. So everybody go look at his interviews. Cause here, I'm going to give",
            "start": 1756.94
        },
        {
            "text": "and not the past. Tomorrow there's a Square Enix event here. By the time this posts on Friday, it'll have already happened. So everybody go look at his interviews. Cause here, I'm going to give you this chestnut, right? When I reviewed The Walking Dead season one, we got to the end and people were mad that it came back together and these were the end things and how does it, why I want to do this, that, and the other. And what I kept telling people is even though we had all this choice in the game, right? What we had was a coloring book page. We all had the same coloring book page and we all filled it in differently and colored it different with our experiences. And at the end, when you step back, we still all had the same page, the same game, but those choices are what matter, not your final one. Right? You can use that. That's free. You don't have to credit me. And we also have of course, the saying that it's not about the destination, it's about the journey. Right. Exactly. Even if I",
            "start": 1809.26
        },
        {
            "text": "one. Right? You can use that. That's free. You don't have to credit me. And we also have of course, the saying that it's not about the destination, it's about the journey. Right. Exactly. Even if I like this thing, I still think that the destination is important. And for us, the destination was making this strong decision and really thinking about it and accepting it. And it's still a hard choice and it's still something. I mean, we could have done, and we thought about it at a point because we knew the concern. We knew that the public would say, oh, we would like to have 15 different endings with a lot of change based on what you made. But we really thought that it would have gone against the main point, the main message. You're telling the story. Yeah. Yeah. That's something we really had from the beginning that we wanted to have all those tales. And basically the rewind is a metaphor of always trying, wanting to try to make things perfect. And it's when you can't. So basically we are",
            "start": 1851.62
        },
        {
            "text": "from the beginning that we wanted to have all those tales. And basically the rewind is a metaphor of always trying, wanting to try to make things perfect. And it's when you can't. So basically we are giving the players a power to really explain that you cannot change everything. So it's a bit tricky. Maybe we are a bit mean with the player. We give them this power just to show them that we shouldn't want to have this power. We should just focus on what's of improving ourselves as human beings with what we have and not trying to deceive reality by changing everything. So were you prepared for that reaction to the end? Because I feel like writing, because this is something that was interesting to me, right? Is like, since I was like waiting to play, I knew I liked Life is Strange. I was going to play Life is Strange. I stayed away from reviews and message boards and I just ignored it all. So it wasn't until I put up the question asking for questions for you on KindaFunny.com slash",
            "start": 1898.5
        },
        {
            "text": "to play Life Is Strange. I stayed away from reviews and message boards and I just ignored it all. So it wasn't until I put up the question asking for questions for you on the kindafunny.com slash forums. We got a whole bunch of people asking about the ending of this. I was like, oh, I didn't even realize it got to that. But it makes sense. Were you prepared for the fact that for four episodes, everybody's like, we love these people. We love you. We love the game. And then it's like five. They're like, ah, fuck you. Two endings. Yes, we were prepared for that. We knew that it would come to that. But to be honest, I did read a lot of, again, of the forums of players. And I have the feeling that still a lot of players were still happy with how it ended. And I've read a lot of videos and comments from players that exactly got what we had in mind. So, but I completely understand also the players who don't like it because that's the same thing with TV shows. When you are invested so much",
            "start": 1944.42
        },
        {
            "text": "From players that exactly got what we had in mind. So, but I completely understand also the players would don't like it because that's the same thing with TV shows. When you are invested so much in a game and with the waiting time, you are creating your own vision of what should be the ending of what you would like to have. And when the reality arrives, it's not the same as you wanted. But even that works a bit as a message that sometimes things, but I don't know if it's good, but that sometimes things are not what you expect. And that sometimes you have also to go with what life is giving you and try to make the best out of it. I'm not saying that players should accept our endings because of that, but it's still also some kind of the big message we had. No, but that's always the problem. Not even the problem, I guess that's the slippery slope with choice. And especially what you're talking about. And where we're talking about, like, you know, I'm talking about the concrete between the\n\nI corrected the following:\n\n- \"don't\" to \"don't\" (no change needed)\n- \"TV shows\" is a proper noun and should be capitalized: \"TV Shows\"\n- Added capitalization for \"Life Is Strange\" which was implied but not explicitly mentioned, however it's in the title of the video so I assumed it was relevant.",
            "start": 1991.38
        },
        {
            "text": "even the problem, I guess that's the slippery slope with choice. And especially what you're talking about. And where we're talking about, like, you know, I'm talking about the concrete between the bricks, right? In the way that you figure when you're playing a game and you're making the choices and you're developing the character and then there's this time when you're thinking you're in Max's headspace of how you'd handle it. When you get to a situation and there's choices A and B, and there isn't a C and you're like, well, I would have done this. That's when it gets weird, right? And you have to remember that it is a game and there's this different thing. And another critique I've read is about the ending of Life Is Strange. Hold on one second. I have a question about that. Okay. I don't want you to steal that. Okay. Yennefer wrote into kindafunny.com slash forums where I posted this and said she wanted to know what have you learned or taken away from the criticisms regarding the endings? I was",
            "start": 2033.94
        },
        {
            "text": "steal that. Okay. Yennefer wrote into kindofunny.com slash forums where I posted this and said she wanted to know what have you learned or taken away from the criticisms regarding the endings? I was really disappointed by them, but I still love the game because of the journey up until that point was so beautiful and moving, more than most games I've played in my life. However, I think the destination and ending is just as important as the journey. So I'm curious about any particular criticism you've seen that made you go, yeah, you're right. Probably could have done that better. As I think it's important for any creator to look back on their work and acknowledge what they could have improved upon. Then she has a PS. Thank you for Life is Strange. In spite of how I feel about the way it ended, it's an overall really important game for women, especially teen girls such as myself, people exploring their sexuality, dealing with depression and anxiety, and the industry as a whole for its",
            "start": 2066.58
        },
        {
            "text": "It's an overall really important game for women, especially teen girls such as myself, people exploring their sexuality, dealing with depression and anxiety, and the industry as a whole for its representation of female characters. Also, I really appreciate Daniel, a very minor character, but it was validating seeing a Hispanic character in a game that I really came to love. So she did that thing where she's like, I'm upset about this, but this doesn't negate everything you did right. Thank you. Thank you so much. That's a good long question. And I really love Daniel too. Daniel is a really good character. Just before answering the big question, we really try to focus, even if they don't have a lot of time, the minor characters, we try to work a lot of them because it's also what creates a real world. Of course, we have Max and Chloe and the main secondary characters, but all the tertiary cast is important for us. So we try to shape them in a good way. And it's because it's a school,\n\nI corrected the following:\n\n- \"women\" was already correct\n- No phonetic mistakes or spelling errors were found in names (e.g., Daniel)\n- Proper nouns like game titles (\"Life Is Strange\") and character names (\"Max\", \"Chloe\") were capitalized\n- The rest of the text remained unchanged, as it did not contain any clear errors.",
            "start": 2100.18
        },
        {
            "text": "A real world. Of course, we have Max and Chloe and the main secondary characters, but all the tertiary cast is important for us. So we try to shape them in a good way. And it's because it's a school, right? Like how there's your core group of friends you interact with every day, but there's people you pass and, you know, once in a while in class talk to you. Totally. So about the question. You are a glutton for punishment. You say you look at all the videos, you read all the comments. I don't know how you slit your wrists, but okay. No, no, no. I do. And, and, and it's really interesting because of course every kind of critic is interesting. Even because of course we, we, we, we made mistakes and also I think we all do. And, and also because even when you still feel strong about something, it's interesting to, to see how people perceive what you wanted to make. And it doesn't mean that I would change things, but it's also means that I'm really aware that there is a lot of",
            "start": 2137.06
        },
        {
            "text": "something, it's interesting to see how people perceive what you wanted to make. And it doesn't mean that I would change things, but it's also means that I'm really aware that there is a lot of different perceptions. So what's the ending I think I already talked about to me is a destination is she's completely right. Is as important as a journey. And for us, the destination was the destination we proposed in the game, which might not feel complete for some players, but it's it was really our goal to have this. And one of the critics I read is that people are lacking closure with those two endings. And when I read more of those critics, for example, in the ending, when you're sacrificing the tone and saving Chloe, people say that they would have loved to see what will happen next. What's Max and Chloe will do in a few days. Sure. Who is alive, who is dead. And of course we thought about that. And we, we were thinking about maybe putting some of that, but ultimately we saw that it",
            "start": 2174.74
        },
        {
            "text": "Max and Chloe will do in a few days. Sure. Who is alive, who is dead. And of course we thought about that. And we, we were thinking about maybe putting some of that, but ultimately we saw that it wouldn't work with the ending as it would somehow reduce the message we had. Because when you make the final choice, you are, you really have to take a position between accepting to sacrifice everything for Chloe or accepting to sacrifice Chloe to save the tone and the other people. And when you're making the decision of thinking that Chloe is what's the most important for you because of all the bonding you had with her. And if you accept to sacrifice everything else, you shouldn't look back. I think that you shouldn't even know what's happening. You know, we could have shown that some people are still alive, that maybe people survive that, but if you start to show that you are reducing the really strong position that Max and the player did by, okay, I want to be with Chloe, everything else",
            "start": 2224.82
        },
        {
            "text": "still alive, that maybe people survive that, but if you start to show that you are reducing the really strong position that Max and the player did by, okay, I want to be with Chloe, everything else doesn't matter. So if it doesn't matter, why show it? We thought about that. And also we didn't want to show, we could have vignette at the end, like two weeks or one month after showing Max and Chloe, I don't know, getting romantically involved or getting into a motel or stuff like that. But in Life is Strange, which is a game about choice and consequences in the game, we never took away. We try to take away the less possible ways, the freedom from the player. And if we start to show what will happen in two months, three months, one year, I think that we are taking the right of the player to create his story by creating it for him. So basically what we wanted to do is during the whole game, you are playing Max, you are shaping Max the way you want by your action and decision and",
            "start": 2271.14
        },
        {
            "text": "to create his story by creating it for him. So basically what we wanted to do is during the whole game, you are playing Max, you are shaping Max the way you want by your actions and decisions and consequences. Either for example, you are creating a romantic relationship with Chloe or Chloe is your best friend, or you are not really liking Chloe. It depends on the way you play. And even the way you are interacting with other characters, you are making Max a really nice and benevolent person, or you are making her a bit more selfish. It depends on the way you are playing it. So I think that what happens when Max and Chloe are on the road, it's really up to the player, to the way he created Max. And we gave him his own version of Max with the game. So it should be, at least to my point of view, it should be in the player's imagination to think what they do next. Will they get married? Will they get together? Will they split away soon? That's something we didn't want to take from the",
            "start": 2319.22
        },
        {
            "text": "you, it should be in the player's imagination to think what they do next. Will they get married? Will they get together? Will they split away soon? That's something we didn't want to steal from the player, is freedom to think about what happened next. Sure. That makes sense. And so that would be the criticism you took to heart, you think? Did you learn anything from your criticism? Don't dodge the question from the end of the book. Yes, we learned that. I think that if we make another game with choices and consequences, we could try to find a good story that could lead to more branching in the endings. I don't think that this one was a good one to have like 10 or 15 endings, but maybe thinking about another story, another set of choices to have a really good way to have multiple endings that doesn't steal anything from the player could be good for us. We learned a lot of things. I'm just trying to think about it. No, no, that's a good one. I mean, that's a good answer because it",
            "start": 2372.98
        },
        {
            "text": "that doesn't steal anything from the player could be good for us. We learned a lot of things. I'm just trying to think about it. No, no, that's a good one. I mean, that's a good answer because it actually leads to a question. Sidebar, do you feel like you've changed your company's fate in general? Do you think that you've seen the success with this, something that was personal, episodic, different? Not that I'm saying, I'm not trying to knock Remember Me, you know what I mean? But this is a very different game. Do you guys see Dontnod going more in this vein or do you see yourself, all right, we're going to come back and make another AAA, this kind of game out of the way. We have a different several teams. We have two teams actually, I don't know. And right now, another team with more people from Remember Me is working on Vampyr again, an action RPG for Focus, which is more action, of course. Yeah. But still, it has a lot of storytelling. I know that for sure, I don't know, we",
            "start": 2417.7
        },
        {
            "text": "people from Remember Me are working on Vampire again, an action RPG for Dontnod, which is more action, of course. Yeah. But still, it has a lot of storytelling. I know that for sure, I don't know, we like to explore different genres, but we're really loving storytelling. I think that story is really important in each of our projects. Even in Remember Me, even if it was an action game, there was still a big story behind it, even if some of it got cut down at the end and there's less story than we had in the beginning. But on my side, on all the Life Is Strange team, definitely we want to pursue in this direction and improve on what we did on Life Is Strange and try to do this similar kind of game even better. We'll try at least. Then I want to now we're veering back to Life is Strange, sticking with the ending stuff. This is a question I had to ask and I want to know your answer and you better say the right thing. I'll try. Macadino94 over on Kinda Funny.com slash form asks, what do",
            "start": 2466.02
        },
        {
            "text": "sticking with the ending stuff. This is a question I had to and I want to know your answer and you better say the right thing. I'll try. Macadino94 over on kind of funny.com slash form asks, what do you think is the true ending of the game? Is there a canonical ending to this game? That's a good question. No, to be honest, the training of the game is the ending the player is choosing. So whatever ending you choose, this is your truth. There is no there is not one ending more true than the other. If it wouldn't make any sense if that was because our goal is really to push the player to make this final decision. So it wouldn't be right if there was one decision better than the other. It's really the game is really here. The five episodes actually again, that's something from the beginning. Every scene we had in the Life Is Strange, we did write them thinking about those endings. We knew the endings from the beginning and everything that's in the game in a big or lesser importance is here to support it",
            "start": 2515.62
        },
        {
            "text": "Every scene we had in the game, we did write them thinking about those endings. We knew the endings from the beginning and everything that's in the game in a big or lesser importance is here to create, to shape your own character of Max and your relationship with Chloe in order to allow you to make this final decision. So the final decision you are taking is a canon one. Oh yeah. What did you pick? Myself? I picked I sacrifice Chloe. You're a monster. I saved Chloe. And it was just one of those things. There was no guarantee. I like she's we're talking about it. And you know, if you let me go, this won't happen. I'm like, yeah, maybe I still know how I got these supernatural powers. I'm not ready to bet the horse on it. You know what I mean? I'm not going to do it. Didn't do it. Kevin kept her alive. We drove away in a truck. I like to think that we are together somewhere still very happy. Yeah, of course. And that's a canon ending for you. That is the canon. And no,",
            "start": 2565.78
        },
        {
            "text": "it. Tim Gettys kept her alive. We drove away in a truck. I like to think that we are together somewhere still very happy. Yeah, of course. And that's a canon ending for you. That is the canon. And no, for me, I, I, it was hard, but, you know, working on the game, it's, you know, you, you, you still don't have the same connection. You know everything, right? Yeah. When I replayed, when I played, because I played the game a lot of times during the production, but I really, when I really played the game as one go after the release, I picked, I picked the sacrifice Chloe ending. I don't know, because for me, I think it, the way I created my Max and the way I was thinking, it was my decision that was, that makes, that made sense, but it was heartbreaking. I wasn't really sure even, even at the end. It was tough for me. And like, I immediately of course, went back and replayed it and did the other ending. And I mean, I think you're lying to me. I think the true ending is saving",
            "start": 2610.18
        },
        {
            "text": "even at the end. It was tough for me. And like, I immediately of course, went back and replayed it and did the other ending. And I mean, I think you're lying to me. I think the true ending is saving Arcadia Bay. Of course, it's got the better ending, the better cut scenes, it's better everything. It's not. It is. I'm telling you, you don't know. You don't know how people are interpreting your game. I'm interpreting it for you. But like, yeah, that was the thing of like, Oh, but yeah, I, of course we had this criticizing that the ending when Max and Chloe are leaving town is shorter and that's why it is shorter. Mostly because we, we did choose a song that was shorter to edit the ending. We should have, we, maybe that's maybe something that we, that also we learned that we, maybe we could have to find a way to make it a bit longer, but with the song, we had, it was a good length. And I think that we still did put everything we wanted to put in it. So we maybe could have made it longer",
            "start": 2653.94
        },
        {
            "text": "Have to find a way to make it a bit longer, but with the song, we had, it was a good length. And I think that we still did put everything we wanted to put in it. So we maybe could have made it longer with longer shots. And I don't know, but I don't think that the fact that it's not the same length doesn't, doesn't really matter because I don't know the, the length doesn't equal quality or content. I don't know. Sure. Just as somebody who picked the right ending and then saw the wrong ending and the wrong ending seemed like it got more meat on the bone. I was like, well, you screwed me over. There is no right or wrong. I'm telling you again, I've interpreted. No, you're wrong. No, it's well, see now you're just, you're interpreting my question or my answer, whether it's right or wrong, that's on you. That's not on me. Oh, and maybe I was thinking about what we've learned also about the critics. I know that also some players are thinking that we have a lot of loose ends in the end,\n\nI corrected phonetic mistakes and spelling errors, especially for names (e.g., \"Tim Geddes\" is mentioned in the metadata as Tim Gettys), and capitalized proper nouns like \"Life Is Strange\".",
            "start": 2701.7
        },
        {
            "text": "that's on you. That's not on me. Oh, and maybe I was thinking about what we've learned also about the critics. I know that also some players are thinking that we have a lot of loose ends in the end, which might be true. So I don't know. We might in another project, try to be a bit less blurry about some things, but maybe to explain what we did here. Well, that was one of the things people were talking about. I saw this comment. I don't think I made it on the actual thing, but they were talking about like the Prescott stuff in episode one, didn't come back in full force by episode four. So there was one, one thing that for the Prescott people are talking about that the Prescott knew about the storm, which actually is not true, at least not true in the game. It's true that we had recorded lines for Nathan when, when, when he was a bit out of his mind, he was saying something like, the storm is coming. I saw it. And that's something that since we're working on an episode game with Life Is Strange Co-Director Michel Koch comes to Kinda Funny to talk about the ending, Chloe, and your questions! Only watch/listen if you've beaten the game!",
            "start": 2746.42
        },
        {
            "text": "lines for Nathan when, when, when he was a bit out of his mind, he was saying something like, \"The storm is coming.\" I saw it. And that's something that since we're working on an episode game with a really short production time, sometimes we are writing a lot of different lines for the characters. When, even when we are not completely sure of the final dialogue we will use just to have the recording because the recording sessions come quite early in the process. And it will cost a lot of money to re-record a line if we're missing one. So we are sometimes recording more and making our decision after which one to use. I can't believe it was all aliens, Chloe. You got stuff like that in there. Just cover your bases. Exactly. We had that. And no, about at a point, yes, it was, we had this idea of hinting, hinting that Nathan might have had some vision about the storm too, but we felt that it wasn't working at all because it was, it has no explanation. It was a bit out of the, a bit out of",
            "start": 2787.14
        },
        {
            "text": "of hinting, hinting that Nathan might have had some vision about the storm too, but we felt that it wasn't working at all because it was, it has no explanation. It was a bit out of the, a bit out of nowhere. Like, like it was, I think if we did that, we would have went too far into the sci-fi and super element. So we just really decided to not use that. So it's not part of the game. So Nathan never knew about it, about this. He never knew anything about the storm. Even if we recorded the line, it doesn't know about it. But players did find this line. It was used in one of the trailer actually. So that's something that we wanted to change, but it was too late. And player did find also the unused lines that if you go on the PC version, you can find all the recorded lines that we didn't use. So players found that and extrapolated that we did get something about the Prescott knowing about the storm. And actually we did get that, but they never knew about the storm. It was just a silly",
            "start": 2832.66
        },
        {
            "text": "So players found that and extrapolated that we did get something about the Prescott knowing about the storm. And actually we did get that, but they never knew about the storm. It was just a silly idea of making some possibility of Nathan having some psychic power about stuff that would happen, but it wasn't good. So we did not use it. That Nathan man, he was a son of a bitch. I beat the shit out of him. You know what I mean? I rewound it. I beat the shit out of him and I rewound. Well, I didn't beat, you know what I mean? You let, you let the beating happen. Rewind it. And you beat him again. You rewind. Exactly. And I saw how it really played out. And I was like, now screw that rewind, beat him up, beat this kid to a pulp. You're nasty. You know what? He, he had pushed, he pulled a gun on us. He pulled a gun again. Like that's not even the first time he pulled a gun in this timeline. And you, you weren't, you were not a bit sad about him in the final episode. No, no. By the end, by",
            "start": 2882.98
        },
        {
            "text": "on us. He pulled a gun again. Like that's not even the first time he pulled a gun in this timeline. And you, you weren't, you were not a bit sad about him in the final episode. No, no. By the end, by that point, like Victoria, I had come around on Victoria. I was like, all right, you're okay. You know what I mean? Obviously Kate, obviously I'm with, you know, but Nathan was a piece of garbage. I think that Nathan is an interesting character. We, we love the writing for him. And, and I know again that people say that maybe we got rid of it too easily, you know, even out, out of the pictures, like he dies outside. You don't know but that was when we did write this story arc from the beginning, we wanted to have Nathan as a really tragic, tragic character. And so it made sense for, for, for us to, to have him die like this out, not out of the pictures. You know, it's you have that sometimes in, in movies where you have the main character. I shouldn't spoil any movie. Oh, it's spoiler",
            "start": 2925.46
        },
        {
            "text": "Us to, to have him die like this out, not out of the pictures. You know, it's you have that sometimes in, in movies where you have the main character. I shouldn't spoil any movie. Oh, it's spoiler cast. So we can't. It's what movie are you about to spoil? I was thinking about No Country for Old Men. Okay. That's been out for a long time that you're not to spoil. You know, you have, you are following this main character and at a point you are switching characters and you just saw this character dead somewhere. You never don't, don't even see how he died. And that was, I loved this scene in the movie. And that was interesting for me because it shows that you can shift perspective and you can also not give any resolution to a character to even have a stronger feeling on that, a stronger sense of doom or fatality or I don't know. And, and for Nathan, that's something we wanted to do. And maybe, I don't know, maybe it was not done perfectly. Maybe you could have done it better.\n\nI corrected the following errors:\n\n* \"No Country for All Men\" → \"No Country for Old Men\" (correct title of the movie)\n* No other changes were made as the text is mostly coherent and grammatically correct.",
            "start": 2967.46
        },
        {
            "text": "of impending doom or fatality or I don't know. And, and for Nathan, that's something we wanted to do. And maybe, I don't know, maybe it was not done perfectly. Maybe you could have done it better. I don't know. But we, I'm really happy with the scene in when Max is driving through the storm and listening to the voicemail from Nathan. Because basically you have his redemption at this moment. He's saying that he's sorry that he was manipulated and that he's really sorry about what he did. And even tries to, to warn you, he says to Max, be careful Jefferson is coming for you. But when you have this message, it's too late. Jefferson was already coming for you. So even, even at this moment when it's Nathan's redemption, it's still too late. Even what he did is useless. It's useless. So it's really poor Nathan. Okay. Don't give him too much. You know, cause that was the thing is when I beat him up or when Warren beats him up under my command, I started feeling bad because he's sobbing",
            "start": 3013.14
        },
        {
            "text": "really poor Nathan. Okay. Don't give him too much. You know, cause that was the thing is when I beat him up or when Warren beats him up under my command, I started feeling bad cause he's sobbing and you're like, okay, the kid has a problem. And I rewind it and then he just pulls the gun and he's a jerk. I'm like, no, this kid goes down. We go into like, you can't leave me a voicemail. But now you say something interesting there that leads into a question from the forums. You talked about, yeah, Nathan dies off camera. Okay. That's interesting. And then we're talking about the ending people being upset with them. An interesting thing again, cause I've learned things today that I didn't even know people were unhappy about. Mr. Storm 2k wrote in and says, there's been a lot of talk among the Life is Strange community about how budget constraints affected the final episode, especially one of the endings. Do you have any comments on that? And then he also chimes in also, thanks for making",
            "start": 3053.3
        },
        {
            "text": "Life Is Strange community about how budget constraints affected the final episode, especially one of the endings. Do you have any comments on that? And then he also chimes in also, thanks for making one of the best games of 2015. Thank you. Thank you. Thank you so much. So no, yeah, actually the game is extremely, extremely close to the final story we had like almost two years ago. We, the major changes we made was mostly adding stuff and not removing stuff. Of course we had to take the budget into consideration, but not while we were doing it. So five, we took that into consideration when we were writing the game like two years ago and we knew, we knew that we had this, this budget, which is which is not infinite. Of course we had budget constraints. And so we, we really wanted, we really did write the game, adding this budget in mind. So to put the naysayers at rest, it wasn't like you're doing episode five and like, ah, we're out of money. Two choices on the screen. No, no, no.",
            "start": 3091.54
        },
        {
            "text": "write the game with this budget in mind so to put the naysayers at rest it wasn't like you're doing episode five and like ah we're out of money two choices on the screen no no no we didn't run out of money for that moment and I know that people found out that there was maybe a third ending because they're looking at the files what was it they can read about hospital hospital ending oh right right yeah and actually it was again it was something when we were writing the game at the point we were completely unsure I don't know if I should say that but I could say it you're saying it okay give me the scoop yeah we were completely unsure if in the ending where you sacrifice Chloe if Chloe should really be dead or if she should be in a coma in the hospital sure so that's why the ending was called hospital ending but when we finished writing we knew that we needed to have Chloe die in order to",
            "start": 3144.5
        },
        {
            "text": "She should be in a coma in the hospital. Sure. So that's why the ending was called Hospital Ending, but where we went finishing the writing, we knew that we needed to have Chloe die in order to make the choice sense. Sure. It's too much of a cop out, right? You made the right choice and everything's still fine. Exactly. And if we did that, there would have been a good ending and a bad ending because you could, you would have sacrificed Chloe, but in the end everyone is alive and Chloe is even alive, which was not working. So we really decided to have the funeral scene. And I think in the files, because when you work on the games, there was some stuff that are made in the really, really beginning. And the naming of the scenes was done with the really first version of the script when it was still Hospital Ending. Gotcha. Oh yeah. There was no, there was no third ending. There was no budget conspiracy. No, no, there was no, there was no third ending that we did cut, but yeah, the budget",
            "start": 3185.54
        },
        {
            "text": "still hospital ending. Gotcha. Oh yeah. There was no, there was no third ending. There was no budget conspiracy. No, no, there was no, there was no third ending that we did cut, but yeah, the budget of course, with a bigger budget, I don't think that we would have different ending. I think that we would have a completely different game because we saw this game with the budget constraint and trying to write the story with that in mind and to have, because when you have a budget, you have a number of scene, you have a number of characters, you can make stuff like that. So we worked, we worked with that on mine and this is the game we wanted to make with this budget. So I don't think that with more budget, you would have a different ending. You would have a whole different game. Sure. Makes sense. Were you surprised by how many people were offended by the use of hella? So many people. And why are they saying hella? Why they don't talk like this and I'm playing the game and I'm like, Oh",
            "start": 3226.98
        },
        {
            "text": "Sense. Were you surprised by how many people were offended by the use of \"hella\"? So many people. And why are they saying \"hella\"? Why don't they talk like this and I'm playing the game and I'm like, Oh, Chloe talks like Tim Gettys. That's how Tim Gettys talks and everybody is like, nobody talks like this. Awesome. That's cool. Yeah. Yeah. We were, that's something that was a bit, I don't know, disappointing for us at the release of episode one, because there was some, of course we were really happy by you by the reception of episode one. Sure. The critics were good. I think we had a 75 or 76 Metacritic for episode one. Really? And it seems low. This is a great game. Yeah. But for, for, for a first episode or first game with new IP, I think it was really good. And at episode five, we have 84, I think, or something. So it was, kept ramping, ramping at every episode. But for episode one, some of the harsher critics we had in, in, in media, were about the \"hella\", mostly which, which was a bit",
            "start": 3261.86
        },
        {
            "text": "Think, or something. So it was kept ramping at every episode. But for episode one, some of the harsher critics we had in media were about the hellish, mostly which was a bit disappointing for us because Christian Devine, our writer from San Francisco, lives in Portland four to five months each year. There you go. So he's living between. See, that's why it makes sense to me. Somebody living in San Francisco for years and going up to the Pacific Northwest. And that's something we deliberately asked him to do. We asked him, I asked him to really work on using words from this part of the United States. Sure. Even if you know, I think that if you look at TV shows, for example, you have TV shows for major networks which will never use any curse word and people don't say it doesn't feel right but it's it doesn't feel right because people are using curse words every day. So I guess sometimes people are",
            "start": 3304.34
        },
        {
            "text": "never use any curse word and, and people doesn't say that it doesn't feel right, but it's, it doesn't feel right because people are using curse words every day. So I guess that sometimes people are getting used to, to listening to TV, to some movies, to stuff where sometimes the language is, is heaven. I don't know. You bring it back too close to the medium, right? Wherever you are, there's these extremes. And you are used to, to listen to that in, in some TV, TV shows or movies. And it gets into your head that that's a standard way of speaking. And we wanted still to use some of the lingo and some of the words that are only used in Oregon and North California. After that, I think that maybe we made some mistakes that we might have overused it. We might have maybe pushed a bit too more those, those words and maybe even sometimes it could have felt a bit archetype, archetypal, or I don't know. I don't know if, if, if, if you're, if you're using hella as much as Chloe or... Oh no, Tim",
            "start": 3361.06
        },
        {
            "text": "those words and maybe even sometimes it could have felt a bit archetypal, or I don't know. I don't know if, if, if, if you're, if you're using hella as much as Chloe or... Oh no, Tim uses it more. Okay. Tim, you say hella a lot? Yeah. We made, we, one of the first shirts we ever sold that said \"hella\" on it. Because Tim says it so much, but then nobody bought it because nobody likes that word. So that's, that's good. And that's also something I think we wanted to do is, you know, to create good characters, not maybe, maybe not good characters, but to create characters that can be remembered for you also need to, to find them a different way of speaking. I know that in French, I'm using some words that nobody uses because it's some, some, some words I use from my youth or I don't know. And I still use them because I like them. Even if people don't use them. And sometimes people are laughing at me for those words. So I think that we did the same for Max and Chloe. They have",
            "start": 3410.9
        },
        {
            "text": "know. And I still use them because I like them. Even if people don't use them. And sometimes people are laughing at me for those words. So I think that we did the same for Max and Chloe. They have their own words that they like to use, even if others aren't using it. And, and what's funny is that we had those critics in episode one, but in episode two and three, I've seen at least players saying that they were expecting Chloe to say \"hella\" because it's Chloe. Yeah. And, and, and without the \"hella\", it's not the same character. Well, that's why it works so well in the alternate timeline, right? When you go in and you say \"hella\" and she's like, oh man, I haven't heard that word forever. I hate that word, whatever she does. I think it made sense for the writing, but that was also a nod to, to the community and to the critics because that's also the advantage of episodic is that we are listening to critics. We are looking at the players, at the reaction, and we can make some inside jokes",
            "start": 3460.34
        },
        {
            "text": "the community and to the critics because that's also the advantage of episodic is that we are listening to critics. We are looking at the players, at the reaction, and we can make some inside jokes with them or some not to the community. We did the same with the infamous bottle puzzle. In episode five, we had a collectible, so it's completely optional, but in the nightmare scene, you have to find again, five bottles to have. She's like, no, I know I'm in hell. Exactly. And it completely made sense for us because we knew that we, we fucked up a bit with, with the puzzle of the bottles in episode two, it was too complicated. We should have maybe had six or seven or eight bottles in the junkyard and you should just find five or it was definitely a mistake on our part. And we knew that the players were not happy about it and that it caused some headaches for some of the players. So we, we saw that if Max is in a nightmare, as a player is in a nightmare, we should maybe bring that again.",
            "start": 3498.02
        },
        {
            "text": "Were not happy about it and that it caused some headaches for some of the players. So we, we saw that if Max is in a nightmare, as a player is in a nightmare, we should maybe bring that again. No, it was a great touch. And I liked it a lot when I went back to get the picture, because what, how it worked for me as I was going and I found one bottle because I'm on like the optimal path and then they got there and I put it down. I'm like, Oh, this is the photo. And I'm like, I'm not going back. Cause I had done it all without getting caught the first time. And so then when I went back to just the trophy, whore it out and I got caught and then remember that I can rewind time. I was like, I'm such an idiot. I could have been getting every one of these bottles right here. You know what I mean? But in the nightmare, I didn't think to do it. So yeah. Is that the biggest thing you think is that the best example you can think of something you changed based on the criticisms you were getting?\n\nI corrected a few minor spelling errors and made sure proper nouns like \"Max\" (presumably from the Life Is Strange series) are not capitalized, as they're being referred to in a sentence.",
            "start": 3548.58
        },
        {
            "text": "But in the nightmare, I didn't think to do it. So yeah. Is that the biggest thing you think is that the best example you can think of something you changed based on the criticisms you were getting? Basically what we did also is in episode four, the scene, if Kate is alive, you can go back in, you go back into the hospital and see Kate. Basically at the beginning, we had cut this scene for budget issues. We, and when we saw that the players were loving Kate so much, we tried to put back the scene and we did put it back. So without the, without the players reaction, we wouldn't have this scene in episode four, which, which, would have been a shame because I love the scene, but, but we saw that it was something that we could cut for, for maybe easing the production. But then we, we worked harder a bit over time. I've been making this game forever. Another question I found interesting that is over on kindofunny.com slash forum is brotherhood 93 chimes in and says there was an",
            "start": 3583.46
        },
        {
            "text": "we worked harder a bit over time. I've been making this game forever. Another question I found interesting that is over on kindofunny.com slash forum is brotherhood 93 chimes in and says there was an interesting discussion on this forum about whether Max is bisexual and if she is then I'm sorry. And if she is then, is she written, I'm going to clean this up. Is she written to be bisexual or is that something decided by the player? If that makes sense. He's saying, and that's what we're talking about where we're totally makes sense. Okay. Basically we, we did write Max as a quite neutral character where every players could put some of his own personality and memories and, and, and soul in, in her. And we did write her as she's questioned. I, of course, I guess that when you're a teenager, you, you have those moments where you, you're questioning yourself. And we really wanted the player to decide if she's bisexual or not. And",
            "start": 3627.54
        },
        {
            "text": "I, of course, I guess that when you're a teenager, you, you have those moments where you, you're questioning yourself. And we really wanted the player to decide if she's bisexual or not. And so basically it's up to the player, but we really try to write her in a way that could work with both. And yeah, that's the same thing I said before is really, I think that when I, when I look at the player's reaction, I think it worked because I've seen so many players who are completely rooting for Pricefield like Max and Chloe, they will be together. And that's great because that's something that we wanted for them to be able to do with their choice, with the way they're playing, with their relation with Chloe. And on the opposite, if you are not rooting for that, the way you're playing, you can also think that it's only the best friendship ever. Yeah. And that was like, you know, going back to the comparison of me and my girlfriend, right? Like she came out after I had already kissed",
            "start": 3682.98
        },
        {
            "text": "you can also think that it's only the best friendship ever. Yeah. And that was like, you bend back to the comparison of me and my girlfriend, right? Like she came out after I had already kissed Chloe and she was like, Oh, like I didn't do that. This isn't how my relationship ever went. I mean, they were best friends, whereas I was pushing them to be romantic partners. So yeah, that's, that was our goal. We need to have the player have the possibility to do that in one way or the other. Okay. I want to close out with two reader questions. The first one is a three part one. Okay. Fireblend wrote in, and I wasn't going to use any of these questions, but Fireblend says, I registered here just so I could ask the following questions. So that was an easy way to get your questions read. And they're pretty cool. So number one, what does Justin's shirt say at the beginning of episode one? I must know it's the one that looks like a Josh shirt, except it isn't. Exactly. So, it is exactly",
            "start": 3724.5
        },
        {
            "text": "Pretty cool. So number one, what does Justin's shirt say at the beginning of episode one? I must know it's the one that looks like a Josh shirt, except it isn't. Exactly. So, it is exactly, it says \"Prawns\" and it's, of course it's a, it's a, it's a shrimp, it's a, it's a shrimp. It's a big shrimp and it's an Easter egg of the Joe's poster. Gotcha. And that's something, it's our main concept artist, Edouard Kaplan. He did a lot of those cool posters and t-shirts and he came up with a lot of ideas. He's also the guy who created the Hot Dog Man. And, and yeah, that's a, that's a shirt he made and I just love it. Okay. Number two, what was your or the team's favorite poster out of all the ones scattered around the school grounds? Cause you have, you have posters all over the place. There is so many. I think basically, oh, I might take a long time to answer that. I love environmental storytelling. So for us, it's, Life is Strange, it's a game. So you're playing a game. So there is a need of,\n\nI corrected the following:\n\n- \"prawns\" ( likely referring to the shirt design) \n- \"Josh\" ( likely referring to Josh Shapiro, but in this context, probably just an example name)\n- \"Joe's poster\" ( likely referring to Joe Henson, Life is Strange's co-director)\n- \"Edouard Kaplan\" (corrected from auto-generated error)\n- \"Hot Dog Man\" (corrected from auto-generated error)\n- \"Life is Fun\" → \"Life is Strange\" (corrected based on video title and context)",
            "start": 3767.94
        },
        {
            "text": "So many. I think basically, oh, I might take a long time to answer that. I love environmental storytelling. So for us, it's, Life Is Strange, it's a game. So you're playing a game. So there is a need of, there is interactivity everywhere. And to, because I know that some people say that it's not a game, it's a walking simulator, et cetera, et cetera. I don't care actually. It's okay. But I think that anyway, since you're controlling your character, controlling the camera and going well everywhere you want, it's a game. You have full control of how you are making the story evolve at your own pacing, et cetera. So we really wanted to have a lot of intricate details in the environment. So you can go, well, that's why there is so many interactions that are not mandatory for the main story, but we really wanted them to, all of them to bring some secondary tertiary layers of narrative to the story. So that's why there is so many posters and objects and stuff to look at and to listen to",
            "start": 3811.7
        },
        {
            "text": "we really wanted them to bring some secondary tertiary layers of narrative to the story. So that's why there are so many posters and objects and stuff to look at and to listen to and listen to what Max is thinking about, which can bring some more perceptions of Max's character or more story about secondary characters. And so for those posters, I think my favorite one is a creepy one. It's one of the posters in the dark room in episode four. The creepiest place. Great. Okay. I love this place. It's not creepy. I don't know. It's one of the anime posters, which basically I saw that it would feel great within the theme of Jefferson and Nathan. And this is a picture of a girl tearing up her throat with tentacles coming out of her throat. And it was an homage to the Higurashi, a Japanese style of manga with also like Junji Ito, for example. And so it's Edouard who wrote this one. And when I asked him to, I said to him, oh, you should do another",
            "start": 3853.3
        },
        {
            "text": "to the Higurashi, a Japanese style of manga with also like Junji Ito, for example. And so it's, again, it's Edouard who wrote this one. And when I asked him to, I said to him, oh, you should do a, we should do a Higurashi type of poster. And then I showed him a lot of references and he was like, what? I don't want to draw that. But I think that in the end, it was something that's perfectly in line with what I wanted to have in the game. And another one, something I love with the posters, we have a lot in the compass in the high school, is that we were able to put a lot of really small details in those. For example, there is one poster for the next game of the Arcadia Bay sport team of the Bigfoot. And it says that one of the next game is the Bigfoot against, the Arcadia Bigfoot against the Sunnydale Razorbacks. And the Razorbacks is the football team in Buffy the Vampire Slayer. So we could make some small notes to TV shows we love in ways like that. And then the final question from",
            "start": 3914.18
        },
        {
            "text": "Life Is Strange Spoilercast - Kinda Funny Gamescast Special\nSunnydale is the fictional town in Buffy the Vampire Slayer. The Razorbacks is the football team in Sunnydale. So we could make some small notes to TV shows we love in ways like that. And then the final question from Fireblend. Did you, and this is, I agree with this one a thousand percent. You said Square Enix made you make no changes to the game. Did you or anyone from the team actually think Final Fantasy: The Spirits Within is one of the best sci-fi films ever made? So yeah, actually someone did. So it's Christian Divine or writer. And so he doesn't say it's the best sci-fi game. He said that is one of the best sci-fi not game movie, one of the best sci-fi movie ever made. So it may be in his top 10 or something, but he really loves it. That was like the one part of that. And like, I cracked up because that was like one of those Easter eggs you're talking about criticism. No, no, no. It's not even, even Square Enix asked us to, are you sure you want to put that? Because they felt, you don't want to do",
            "start": 3964.74
        },
        {
            "text": "Was like one of those Easter eggs you're talking about criticism. No, no, no. It's not even, even Square Enix asked us to, are you sure you want to put that? Because they felt, you don't want to do this. You don't know how people are going to respond. Because they felt that maybe people, players would say that it was Square Enix who asked us to put that, but no, they did not ask anything. It was Christian who really wanted to talk about it. And to his defense, I really, I quite enjoyed the Final Fantasy: The Spirits Within. I think it's underrated. Okay. I think it's, it has a lot of good points. Maybe I wouldn't put it in my best sci-fi movie list, but I would say that it's better than people are acknowledging it for. Okay. Everyone, give it another watch and let us know. Final reader question comes from Amir. It says, are there any ideas that you're already thinking about for your next project? Will it be similar in scope to Life is Strange or not? Such as keeping with the episodic",
            "start": 4019.14
        },
        {
            "text": "comes from Amir. It says, are there any ideas that you're already thinking about for your next project? Will it be similar in scope to Life Is Strange or not? Such as keeping with the episodic type of rollout narrative driven experience. You already said like your team, right? You like the narrative. So that's, that's a question that's hard to answer because of course it's too early about, to speak about anything that comes next in the Life Is Strange franchise. We'd love to make another Life Is Strange, but that's up to, you need to see that with Square Enix and it's really too early to talk about it. But something that we told already, and that that seems important for me is that we've, we've said that in season one, we, we really told the story of Max and Chloe and the main story of, of, of those characters to, to me is, is finished. So if we have the chance to make another, another, another season or something what's sure is that we would love to explore other characters within",
            "start": 4059.14
        },
        {
            "text": "of those characters to me is finished. So if we have the chance to make another season or something what's sure is that we would love to explore other characters within the same universe. It doesn't mean that we won't have links, but with still a new cast and new main characters. Gotcha. But it's, we're ready to talk about it. But we have a lot of ideas. So, I mean, yeah, and it's too early to talk about it, but like without, and this isn't me fishing at all, without spoiling what you're working on or anything, where are you guys at with that? Like, was there like for this limited edition collector's edition, which is out this week, right? Yeah. I think it's today for the American version and in two days for the European version. Okay. So, I mean, was there more to do for this or was your team able to move on to something else? No, we still had a lot of work on this because we also have a Japanese version coming out in March. Okay. So we, there was still",
            "start": 4106.5
        },
        {
            "text": "to do for this or was your team able to move on? No, we, we, we still had a lot of work on, on this because we, we also have a Japanese version coming out in March. Okay. So we, there was still work on the Japanese localization and, and bug fixing and always adjusting to the menu, stuff like that to go with the new set of characters. So there is still work on the box version. We did a director's commentary with Raoul. So it was like two or three days of shooting with a lot of us talking while playing the game and then a lot of editing to find the, to make this fit into the size and the budget we have. Sure. It took a lot of time. We are doing interviews like this right now. So there is still a lot of work. So I'm holding you back from making another game. Exactly. Exactly. Exactly. No. So yes, there is still work for, for Life is Strange. And of course we are also taking a bit of the time left. We have to, yes, to start to brainstorm and to advance on, on what's",
            "start": 4145.38
        },
        {
            "text": "So yes, there is still work for Life Is Strange. And of course we are also taking a bit of the time left. We have to, yes, to start to brainstorm and to advance on what's next. And at some point you're taking a breath, right? People are relaxing. Yeah. We took some vacation too because the game was released. The final episode was released at the end of October. So I took a lot of vacation in October and December, November, October and November. And other team members took the same kind of vacation at the end of the year. So yeah, we had to, we had to, to sleep a bit. You've earned it. You deserve it. Thanks. No, thank you again. Thank you so much for Life Is Strange. Make sure you tell everybody back home. Just amazing. It's such a great game. And if there's a chance, I would really like to thanks you guys and everyone from the community, because really I've been working on games before, but this game, I think that we have the best community ever. I mean",
            "start": 4186.74
        },
        {
            "text": "Chance, I would really like to thank you guys and everyone from the community, because really I've been working on games before, but this game, I think that we have the best community ever. I mean, even looking on Reddit or Twitter or Tumblr, sometimes of course people are arguing, but it's really, really mature. I didn't see any trolling. Well, that was the thing about all the comments here. Even the ones who were like, they were nice and respectful. People are really nice and are helping together. I've seen, you know, on the Life is Strange Reddit, you have sometimes people who are just honest enough to explain some of their own teenager issues. And the other people are not laughing, laughing at them. They are actually helping them. And it's incredible because, you know, usually on video games, message boards, it's not that nice. And I think that we have really one of the best communities we could wish for. So if we can make another game, we're really hoping that the",
            "start": 4232.9
        },
        {
            "text": "on video games, message, message board, it's not that nice. And I think that we have really one of the best community we could wish for. So if we can make another game, we're really hoping that the community will like it and we will do our best to work with that. Well, that sounds great. Everybody, Life is Strange Limited Edition is out right now, back there. We have the vinyl. You're going to sign everything. We're going to give it away. I'll pick two comments from the comments on this here YouTube video. So go below, tell me your favorite Life is Strange moment. I'll pick your comments, then YouTube will message you. So you gotta check your YouTube messages and then we'll send you either the game or the record. And then the rest will be given away over on twitch.tv slash kinda funny games for a little show we do called Colin and Greg Live each and every week. Michel, thank you for everything. Oh, thank you so much for having me here. Please stop doing interviews and go finish the game.",
            "start": 4275.7
        },
        {
            "text": "A little show we do called Colin and Greg Live each and every week. Michel, thank you for everything. Oh, thank you so much for having me here. Please stop doing interviews and go finish the game. Okay. Go get every, go work on your next game. Just stop doing interviews. Before finishing, starting and yeah. Exactly. Finish this game off. Be done with it, the Japanese version and start on Life is Strange 2. Oh yeah. All about Daniel. Okay. Thank you so much. Until next time. It's been our pleasure to serve you. Thanks. Bye-bye everyone. Thanks.\n\nI corrected the following:\n\n- \"Colin Moriarty\" was not explicitly mentioned in the metadata, but it's a common knowledge that Colin is one of the hosts, so I left his name as is.\n- No other phonetic or spelling errors were found in the chunk.",
            "start": 4312.9
        }
    ]
}