{
    "id": 1473,
    "video_id": "xMXudbMM2LY",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "The Most Popular Kinda Funny Videos of 2015 - The GameOverGreggy Show Ep. 110 (Pt. 1)",
    "description": "We get super drunk and record the longest, most ridiculous episode of all-time.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1452499200,
    "duration": 3844,
    "transcript_chunks": [
        {
            "text": "This episode is brought to you by Loot Crate, the monthly subscription box for geeks, gamers, and pop culture nerds. We want to believe, with the revival of the X-Files that we've all been waiting for, there has never been a better time for an invasion. An alien invasion, that is. Packed with the thrill of an extraterrestrial encounter, this month's Loot Crate features exclusive items from the X-Files, Alien, The Fifth Element, and Space Invaders, plus some classic sci-fi goodies. We can tell you this, the loot is out there. See what they did there, Kevin? The loot is out there. Not like the truth. Yeah, yeah. You only have until the 19th at 9pm Pacific to subscribe and receive that month's crate, and when it happens, that's it Jack. It's over. So go to lootcrate.com slash kinda funny and enter the offer code KINDAFUNNY to save $3 on your new subscription today. What's up everybody? Welcome to the Game Over Greggy Show. I am one of your hosts, Greg Miller, alongside the producer",
            "start": 0.0
        },
        {
            "text": "and enter the offer code KINDAFUNNY to save $3 on your new subscription today. What's up everybody? Welcome to The GameOverGreggy Show. I am one of your hosts, Greg Miller, alongside the producer slash seducer, Nick Scarpino. I always get a little depressed with myself when I have Taco Bell and Pachi's Pizza on the same day. What if he had some chicken wings I made, and then also a Taco Bell burrito that I deep fried and baked? Well that would bring me right back. Good. I'm glad that's what happened today. Over there, the pride of Long Island, Colin Moriarty. Go Islanders, it's good to be here with you today. It's good to be here. Go Islanders with you too today. Go over there. The pure one, Tim Gettys. I see. I keep saying that I already know this is going to be a good one. Yeah, you know why we're all on point. Oh, we're all on point and also right now what's happening? Explain it. Go. We're making our way down. Well, I wanted to introduce everybody here first before we explain",
            "start": 40.16
        },
        {
            "text": "We're all on point and also right now what's happening? Explain it. Go. We're making our way down. Well, I wanted to introduce everybody here first before we explain what's happening. Is that okay? I'm allowed to do that for the first time ever on The Game Over Greggy Show with a mic in front of his face. Kevin Koala. I'm sweaty. I'm sweating hard. You don't think I'm going to be able to do that? I'm sweating hard. You don't think I'm going to be sweating? Yeah, it's true. Kevin, it's well, thank you. Thank you for coming and joining us. Thank you for having me. Thank you for bringing your notebook too. I love that you still have to take notes on the show. You have to edit. I didn't think that through when we did this. Yeah, no, don't worry about it. I thought about it. I also thought maybe I should be wearing headphones. Does he have a cord long enough to reach that? Oh yeah. I mean, honestly, no, you don't. No, I know. Don't worry about it. It's",
            "start": 95.24
        },
        {
            "text": "thought about it. I also thought maybe I should be wearing headphones. Does he have a cord long enough to reach that? Oh yeah. I mean, honestly, no, you don't. No, I know. Don't worry about it. It's fine. I hope the audio is fine. Right now, Alex O'Neill will tell us in the Twitch chat if something's wrong, but it doesn't matter. Thanks for having me.",
            "start": 127.4
        },
        {
            "text": "Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me.",
            "start": 139.72
        },
        {
            "text": "Thanks for having me. Thanks for having me.",
            "start": 139.72
        },
        {
            "text": "Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. Thanks for having me. There was one more. I don't know. I'm sorry. There was one more. Oh, the shots that we're pouring right now. Into, if I may say before we all forget, into four shot glasses that Amy Gill sent us and one shot glass from Hot Mess Moves. Ooh, Hot Mess Moves. And Amy Gill. So I propose, I mean, we could do the two shots in sequence, but I don't think that's going to be, I mean. No, I think we should space them out. Yeah. So I was going to say, I feel like, I mean, you know, we can just do one halfway through",
            "start": 232.72
        },
        {
            "text": "shots in sequence, but I don't think that's going to be, I mean. No, I think we should space them out. Yeah. So I was going to say, I feel like, I mean, you know, we can just do one halfway through the show as well. Yeah. So I poured, we're going to, do you have anything to say? And I was going to say, we're drinking Matty Kerr's whiskey that he brought over from Montana. Yeah, so Matty Kerr brought us awesome, this is straight rye whiskey, early release. Only aged two years, somewhat low proof, it's only 90 proof, 45% by alcohol, alcohol by volume, bottled, distilled and barreled in Montana. Oh, he's not in Montana. Of Matty Kerr. Because I believe he's from Missoula, if I remember correctly. Yes. So, let's start handing these down, Kevin, start handing these down. Now, I'm busting out some glasses, thank you, pass them on down, that Nick and I will assemble real quick. Because, as you know, I know not everyone here drinks like the fishes, Colin and I are. Yeah, no they certainly",
            "start": 272.72
        },
        {
            "text": "some glasses, thank you, pass them on down, that Nick and I will assemble real quick. Because, as you know, I know not everyone here drinks like the fishes, Colin and I are. Yeah, no they certainly don't. And so sometimes when you're doing a shot of something, you want to chase her. It's rye though, it's not going to be rye. So I reached in to the Kinda Funny refrigerator and found this bottle of Dom Perignon given to us by one Elon Musk the first time he ever came back to the United States after we started Kinda Funny and he said open this on a special occasion. And I think our one year anniversary is quite that special occasion. We will do the shots first and then we will open this and do that. Did you measure the Amy Gill's Guinness glasses? That is, did you see the mixologist Colin over here? That was like some fucking amazing things. What's that guy from Shovel Knight? Is it Plague Knight? That's one of them. Yeah, yeah, that's one of them. Yeah, you were fucking Plague Knight",
            "start": 315.24
        },
        {
            "text": "Colin over here? That was like some fucking amazing things. What's that guy from Shovel Knight? Is it Plague Knight? That's one of them. Yeah, yeah, that's one of them. Yeah, you were fucking Plague Knighting it up right there, just like perfectly pouring shit back and forth. Well, I was eyeballing it. These, because it gets bigger at the top, this is about a shot and a half. This might be good for like car bombs and stuff like that, but these clearly weren't, you should never do car bombs. Those are huge. But yeah, these are not pure shots. So I poured a real shot first and then wanted to measure it so that two people didn't get the short shrift because, you know, but still we're only drinking something that's like, you know, 90 proof. So it's not terrible. Sure. We can drink like the stag up there that's like 140 proof. That would be good. Do you want a shot of that Tim? What's up? You want a shot of the stag? I'm down for whatever. That stag is barrel strength. I am",
            "start": 362.3
        },
        {
            "text": "Stag up there that's like 140 proof. That would be good. Do you want a shot of that Tim? What's up? You want a shot of the stag? I'm down for whatever. That stag is barrel, is barrel strength. I am ready. You're not ready. I've been drinking long before you guys ever started. Yeah, I know. It's exactly as it came out of the barrel. It's fine. It's fine. It's a deep, it's thick. It's fine. It's fine. Stack Jr is fine. Don't worry about it. Kevin's going to drive home. No he's not. Nope. He's on the H. All right. Shall we? All right. Cheers. To year one, huh? To year one. To us and to all of the best friends. Yeah, to all of you. This is all equally your moment as well. Nicholas. There it is. Oh, that is good. That is smooth. I was going to say the same thing. It's really smooth. It's a smooth operator. Bottle 1412. I'm going to chase that down with a nice vintage Diet Coke. When you showed the Pappy to Nick, he made a joke about drinking with Diet Coke, like mixing it. I know. If you",
            "start": 399.5
        },
        {
            "text": "operator. Bottle 1412. I'm going to chase that down with a nice vintage Diet Coke. When you showed the Pappy to Nick, he made a joke about drinking with Diet Coke, like mixing it. I know. If you put that Coke anywhere near the Pappy, because I, so I paid $200 for that Pappy. Yeah. There were only like, I think between five and 6,000 bottles made this year at all. Okay. Of any kind of all five years. Do you want me to open up that bottle? Does it look like I need your help right now? Did I cook you a bunch of shit rings? But we're celebrating, right? Did I make you a burrito? It's a big day. It is a big day. Well, are we going to drink that Pappy or is this a, that was really smooth. Jesus. That was good. That was really good. The Pappy's not coming out, right? No. I'm paranoid to open it. Don't open it. Jesus Christ. That was going to go right in my eyeball. It didn't. Good job not losing it. I'm part of you. I'm a pro. Yeah. We're screwed for two weeks. Get another camera. It's kind",
            "start": 449.26
        },
        {
            "text": "Don't open it. Jesus Christ. That was going to go right in my eyeball. It didn't. Good job not losing it. I'm part of you. I'm a pro. Yeah. We're screwed for two weeks. Get another camera. It's kind of like we're on the set of Batman v Superman. And Clark Kent's outside and he's like, who's that? And the guy's like, he must be new to Gotham. We're not there yet. You guys jumped ahead. He didn't watch the trailer enough. When he gets out of the car. Fake fans. I'm Bruce Wayne. I'm very obvious in my acting, but I'm super rich and famous. Thank you. The bubbly. What are you going to do when it wins best picture, Nick? That's really what I want to know. The day that Batman v Superman wins a Best Picture, an Academy Award for Best Picture. I will never make another digital thing ever again. I will go back to writing books the way the monks used to have to buy a hand. I'm papyrus. I'm papyrus and the ink of virgins. Appreciate that Catholicism. One more cheers. One more cheers. Cheers.",
            "start": 490.98
        },
        {
            "text": "I will go back to writing books the way the monks used to have to buy a hand. I'm papyrus. I'm papyrus and the ink of virgins. Appreciate that Catholicism. One more cheers. One more cheers. Cheers. You're one everybody. Love you guys so much. Thank you for doing this with me. To everyone that made this possible. All the best friends. Including you. Yeah, do the Leonardo DiCaprio. Yeah. I missed it. I didn't refer to Long Island at all today and I just want to remind you the great Gatsby took place on Long Island. Thank you for. Did you? He did. There was a moment where he said that he's from Long Island and he'll remind us every day. Yeah, so I wrote, so people should go to the KindaFunny.com redesign page that James helped us out with and read about me because I wrote them and it's just making fun of us, including me and I talk about how, you know, if I didn't tell you yet that I'm from Long Island, I certainly will before the day is up. Yeah. I got to commend you, Colin. Those bios",
            "start": 535.46
        },
        {
            "text": "making fun of us, including me and I talk about how, you know, if I didn't tell you yet that I'm from Long Island, I certainly will before the day is up. Yeah. I got to commend you, Colin. Those bios were hilarious. Thank you. I'm good at, I'm not good at much, but when I really put my mind to something, well, sometimes I succeed. You know, they have the saying, jack of all trades, master of none. You are a master of a lot of trades. Thank you. I appreciate that. And jacking it slowly. Oh my God. The slow jerk. Remember, three and a half, four beats a minute. I want that thing to be almost flaccid in your hand because that's the epitome and the essence of the slow jerk. Sometimes it feels better when it's more flaccid. Like, I don't know why. I get more like tinglies going on. There's all sorts. That was too fast. It's too fast. But I feel like even when you're enacting the slow jerk, you have to speed it up because the slow jerk is too slow to be caught on camera otherwise. Very",
            "start": 572.1
        },
        {
            "text": "All sorts. That was too fast. It's too fast. But I feel like even when you're enacting the slow jerk, you have to speed it up because the slow jerk is too slow to be caught on camera otherwise. Very true. Otherwise it's like, why is GameOverGreggy had his hand up the whole time? And then you go back and it turns out it's been, it's like one of those like really slow things. It's like when you're observing from a planetarium, a faraway gas giant, let's say Neptune. Of course. It's so far away that you really have to stare at it for years to see any movement. You know, I'm not talking about rotation. I'm talking about revolution. So it's very simple to think about it that way. It makes a lot of sense that way. Tim. Yes. For this episode of The Game Over Greggy Show, you told me, don't worry about topics. This is our first 2016 episode. It's our one year anniversary. I got this. I got this. So what is topic number one? So topic number one, I want to, I knew that we were going to kind of talk for a",
            "start": 623.14
        },
        {
            "text": "This is our first 2016 episode. It's our one year anniversary. I got this. I got this. So what is topic number one? So topic number one, I want to, I knew that we were going to kind of talk for a bit and do the whole anniversary intro. Sure. What we just did. Yes. You knew that was going to happen. So I want to, it's a lighter topic. To make room for topic two, which is going to be a little bit more lengthy because I want to share the space there. Yes. So we need to do more dumb bullshit in the front. We can. No, no, no. I just thought this was, it was interesting to look at. Now that we're reflecting on the year of Kinda Funny, Kinda Funny Year One as it will forever now be known. I wanted to look at what the most popular Kinda Funny and Kinda Funny Games videos of 2015 were. All right. So you're disqualifying the Fast and Furious live stream. I want to discuss those things too. Now the reason I want to do this obviously is we're talking about the year. We're not talking",
            "start": 663.02
        },
        {
            "text": "All right. So you're disqualifying the Fast and Furious live stream. I want to discuss those things too. Now the reason I want to do this obviously is we're talking about the year. We're not talking about all the pre stuff. Right. Um, but also Kinda Funny Games only existed since a year ago today. Right. Right. So everything on Kinda Funny Games is fair game. Gotcha. Kinda Funny. There was a, you know, a couple of years beforehand where we're still figuring things out. Oh, you mean the golden years when we were Game Over, right? Exactly. There was that. And then there was, you know, that's the brief stint of Kinda Funny getting its legs the first couple of months. Or when we had it, we in a pre-Kevin world, he knew you. We really beefed up on him and then he's washed up. He's over things, man. I'm not sure. Yeah. You're such an Insomniac fan boy. He's he's your friend. How often do you text him? How often do you text him? Text him. I don't text him. How can",
            "start": 707.98
        },
        {
            "text": "up. He's over things, man. I'm not sure. Yeah. You're such a huge Penny fan boy. He's he's your friend. How often do you text him? How often do you text him? Text him. I don't text him. How can you call him when before he moved, we were hanging out like, I don't know once every two weeks, once a week. Thank you. Now listen to the question. How often do I, what, how often do you call him? How often do you hang out? You're never, I don't think I've ever called him. So you're telling me how many times have I called you? Not for like letting me, why was the assumption that he's going to be a criminal? I said a criminal attorney. Oh, you're telling me that you hang out with Penny. Why? Why? I forgot what you said because it doesn't matter. But you're telling me you just randomly, you're running into him and stuff. There's no communication, no text. No, he's dropping you an email. Okay. Alexis. I hit her up all the time. Alexis, I text. Maybe slow down on the",
            "start": 745.98
        },
        {
            "text": "you're running into coffee beans and stuff. There's no communication, no text. No, he's dropping you an email. Okay. Alexis. I hit her up all the time. Alexis, I text. Maybe slow down on the champagne. Greg, I'll tell you when I had enough. Let him go. I mean, I know. I mean, I have gotten trashed so many times together. That's why I saw, I saw the trajectory when he was making his wings. I tried to warn everyone. You're drunk. No, not even yet. Oh Jesus Christ. You will be soon. Oh yeah. We're doing shots and shit. There's no shame in it. Sometimes. We drink a lot. Sometimes we drink a little. Well, first off, you know, I only got one speed - drunk, but I'm telling you, I'm telling you, you, you let me in terms of we go to hard water. Yeah. Oh yeah. With old fashions. Old fashions hits like candy. Yeah. Because I was, I went there last weekend and I was saying that, you know, when you and I go there, it's a fucking disaster. It's a complete fucking disaster. We spent hundreds of",
            "start": 789.22
        },
        {
            "text": "like candy. Yeah. Because I was, I went there last weekend and I was saying that, you know, when you and I go there, it's a fucking disaster. It's a complete fucking disaster. We spent hundreds of dollars at that place. We leave the place and get in the fight with the guys who want to be Uber drivers, but aren't Uber drivers. That was when we were with Ramone. But, you know, I'll drink like four old fashions. You'll be on like six. Yeah. You know, because you just keep going. I'm like, well, taste the old fashioned. You've never said that. That's never been a, you never judge me when I drink fashions quick. I don't judge you. No, we don't judge you. We've drunk. We've, we've, we've had drinks so many times together. So many, many times. We know each other, how each other, the one thing I respect about you more than anything is that you can drink. Thank you more than anything. But that's my point. Literally more than anything else. That's my point. I drink to me all the time. You",
            "start": 839.66
        },
        {
            "text": "I respect about you more than anything is that you can drink. Thank you more than anything. But that's my point. Literally more than anything else. That's my point. I drink to me all the time. You understand when I'm amplified, I'm on camera. I've been streaming all day. I'm tired for sure, tired and when I'm drunk, I can do it. I'm the fact that I'm not slurring that I'll remember all this tomorrow, but I mean I was, you know, I'm giving my pal Kevin here some trouble yeah, because he just he's never actually met hundred pence. I bet honestly, if I was to go down to Mayor Ed Lee's office right now, there'd be a restraining order from a one hundred pence against Kevin who's in say, low Koala. That's not my middle name. What is your middle name? Andre Andre who's in say, low. This is the name. He meant Consuelo. Well, I was even more ridiculous. I think that's what he meant. What did you say? I don't know, guys. I reached into the black hole. I pulled something out. That's how it goes.",
            "start": 874.28
        },
        {
            "text": "He meant Consuelo. Well, I was even more ridiculous. I think that's what he meant. What did you say? I don't know, guys. I reached into the black hole. I pulled something out. That's how it goes. Is this what it's like? We can't edit things out to listen to me talk on a daily basis. No, I know. Yeah. Saying, it's Matt. Greg mildly, moderately drunk is like Nick. No way. No way. No way. I mean, it's got the underlying racist tones. I'll be honest with you. Okay. It's in every way. It's a good way. Earlier this entire stream, by the way, if you're watching the Game Over Greggy show, sure. Listing later, we are. So we're streaming this right now on Twitch TV, such Kinda Funny game. The earlier what was what's the meat? What's the spice Peruvian meat? Carne Asada. There you go. See, don't even. I fucking told you. So funny. Do you remember what it actually is? Carne Asada. Yeah. What's the first part? Carne Asada. It's not carne. You know, it's not carne. We told you like Pollo a la Saltata.",
            "start": 921.82
        },
        {
            "text": "I fucking told you. So funny. Do you remember what it actually is? Carne Salada. Yeah. What's the first part? Carne Salada. It's not carne. You know, it's not carne. We told you like Pollo Saltata. That means chicken. And you know, Carnitas. Carnitas. Oh, okay. Carnitas. No, that's pork, right? Carnitas con suelos. Carnitas Salada. I'm not even being suspicious, right? What is it? Lomo Lomo. What does that mean? Lomo is made up. It means beef. I thought Carne Asada was beef. Yeah, but this is different places. You're talking about different places. I'm not even trying to be facetious, but it's the same language. Right? Carne Asada means like cooked meat. Okay. Yeah. Cooked beef. I'm not even being facetious. Do you speak Peruvian Spanish? Mm-hmm. And so they also speak Quechua. Quechua. Is that the... The native language. The Incan language. The Incan. Yeah. Yeah. Okay. Cool. That's interesting. So the top video. Oh, yeah. Back to this. Okay. So before we get into that, yes, there",
            "start": 967.1
        },
        {
            "text": "Is that the... The Quechua language. The Incan language. The Incan. Yeah. Yeah. Okay. Cool. That's interesting. So the top video. Oh, yeah. Back to this. Okay. So before we get into that, yes, there is the Fast and Furious live stream that reigns as the number one most viewed. Are we a million yet on that? On that? Yeah. Oh, yeah. That's at like 1.2 million. At 1.2 million, rounding out everything, it's the Fast and Furious live stream part one. Yeah. Now somewhere else in what would be the top 10 is the Fast and Furious live stream part two. Right. Which is at, I think, like 400,000 views, which is just insane. They were wise to our game. Yeah. So we're not counting those. Other top hit videos of our past include the video we did with Gavin Free. Oh, yeah. When we went down to Rooster Teeth for the first time. How to be a cool guy. How to be a super cool dude with Gavin Free. How to draw dicks with Barbara Dunkelman. Barbara Dunkleman. Also makes sense. B-Dunks. B-Dunks. Oh, my God.",
            "start": 1016.18
        },
        {
            "text": "for the first time. How to be a cool guy. How to be a super cool dude with Gavin Free. How to draw dicks with Barbara Dunkleman. Barbara Dunkleman. Also makes sense. B-Dunks. B-Dunks. Oh, my God. That's great. That needs to be a thing. It's not a thing. I don't think it is. B-Dunks isn't a thing. I hope it is. Everybody tweet Barbara and say, you are now B-Dunks. Please change your Twitter handle to B-Dunks. Yeah. It'll be great. Awesome. But yeah, so. A lot of good work done today. Guys, take a second. We fucking crushed today. We always give a lot of credit to the people out there that support us. And that credit is due there. Absolutely. That's great credit. Put that out there. Give credit what credit's due. But you guys all worked really, really hard. None of us worked as hard as Kevin, but that's fun because we make fun of him when he fucks up. Yeah. Even though he works really, really hard. Nailed it. Just wanted to throw it out there. We did a great job today. Thank you. Love",
            "start": 1060.74
        },
        {
            "text": "but that's fun because we make fun of him when he fucks up. Yeah. Even though he works really, really hard. Nailed it. Just wanted to throw it out there. We did a great job today. Thank you. Love you guys. Thank you. Thank you. We worked really hard. Thank you. And I'm enjoying this topic. Yeah. Come on. Let him finish. Let him finish. I'm just having fun with you now. It's become clear to me that there's a glaring omission. Yeah. And I'd like to blame Tim Gettys for it. All right. Go for it. If you didn't know, this is the Game Over Greggy Show. Each and every week, four, sometimes five best friends gather on this table. Each bring a random topic of discussion for your amusement. If you like that, head over to Patreon.com slash Kinda Funny, where you can toss us a few bucks and get each and every episode early. And support Kinda Funny, the animated series. If you got no bucks to toss, no big deal. Head over to YouTube.com slash GameOverGreggy, where we post the entire show topic by topic, daily",
            "start": 1099.54
        },
        {
            "text": "The Most Popular Kinda Funny Videos of 2015 - The GameOverGreggy Show Ep. 110 (Pt. 1) episode early. And support Kinda Funny, the animated series. If you got no bucks to toss, no big deal. Head over to YouTube.com slash Kinda Funny, where we post the entire show topic by topic, day by day, until we put the entire thing up for free on iTunes and YouTube. I'm sorry, Tim Gettys. Back to you. No, that was great. Wait a minute. I'm sorry, Tim Gettys. Go call him. Nick's telling me it's not worth it. I think we're on the same page here. I thought we decided 15 minutes ago that we weren't going to go through the whole... You said we have a bunch of stuff to put at the beginning. And I thought that's what you were referring to. I thought we were just fucking rolling right into it. No. 90 miles an hour. No, people want that stuff. I've done that before at a live show where I forgot to do this table. People get mad. I don't want to screw them out of it. This table's important. It is to the ladies. I was getting mad. Not this table, though. No, this table. This is similar to the old table.",
            "start": 1142.02
        },
        {
            "text": "People get mad. I don't want to screw them out of it. This table's important. It is to the ladies. I was getting mad. Not this table, though. No, this table. This is similar to the old table. No, this was... Yeah, the old table was Mike Mitchell's table. Right. Yeah. We never did a show at this table. No. Until right this moment. The table, of course, in the other room, the IKEA table, my idea long ago is when we get our first space, we will retire that table. Right. We will sign it and put it on a wall. Right. And I want to get a plaque that just says \"This Table\". Yeah. Yeah. I think it's... Oh, God. It's going to be beautiful. It's going to be awesome. Yeah. It's awesome. It'll be in the Smithsonian one day, but I'm always going to be seeing him. It's true. Yeah. This is not the table we shot the first couple episodes of Game Over Greggy Show. That table is now gone, but on the Kinda Funny channel, there is a video of us saying goodbye to that table. Right. That was amazing.",
            "start": 1175.02
        },
        {
            "text": "We shot the first couple episodes of Game Over Greggy Show. That table is now gone, but on the Kinda Funny channel, there is a video of us saying goodbye to that table. Right. That was amazing. Yeah. God, we do such dumb things. Was that a standalone video or is that part of one of the... That was a standalone video. That's awesome. And that was number four with 1.1 million views. I'm going to go on a limb and say, I like how you say we do such dumb stuff. That's all we do. That is all we do. Every day we walk to Starbucks, we think about how ridiculous our lives are, that we just do stupid ass videos and people actually enjoy watching them. We're blessed. Blessed. Thank you. Blessed. It's great. It's so awesome. And it's like, so I did a lot of research for this show tonight and I'm like... Eventually, we'll let you talk about it. Looking through all this stuff, I'm just like... Life's starting now. We're insane. That's really all this comes down to. We're insane in general, but",
            "start": 1211.02
        },
        {
            "text": "like... Eventually, we'll let you talk about it. Looking through all this stuff, I'm just like... Life's starting now. We're insane. That's really all this comes down to. We're insane in general, but this past year, we really pushed that into like, I don't know if this is a good thing or not. I think it is at the end of the day, but my Lord. We're just ridiculous. The vastness in which we make a video about hot dogs and a video about real video game stuff, as real as video games can be, and then we make Table Flip. Let's do a goodbye video. I forgot about the Table Flip video. That's a good video. But getting it is, I want to start with Kinda Funny Games. Sure. Because I think that there's a lot of interesting stuff there that I think is surprising when you would think of what are the most popular videos are Kinda Funny Games, right? Metal Gear Solid. There's a lot of Metal Gear Solid. There is. Number one, at a staggering 934,000 views. The good one. Guitar Hero Live. The Guitar Hero",
            "start": 1250.26
        },
        {
            "text": "The most popular videos are Kinda Funny Games, right? Metal Gear Solid. There's a lot of Metal Gear Solid. There is. Number one, at a staggering 934,000 views. The good one. Guitar Hero Live. The Guitar Hero Live. I jumped early on that one. That is insane. How far between both the channels, the most views on any video we've made this year? I mean, it's one of the things I talk about all the time when I talk to PR people about what we are and what we do. And I'm always talking about the fact that I think honestly, we are only a few months ahead of the curve or whatever. And Guitar Hero Live was definitely one of them where they reached out with that opportunity of like, hey, do you guys want to come do this preview op? And we were like, yeah. And so same thing with that Nintendo thing we went and did, right? And maybe didn't yield the views that Guitar Hero did. But we went there and we were like, hey, cool. Yeah, we'd love to come to this preview event. Can we capture and do Let's Plays?",
            "start": 1295.02
        },
        {
            "text": "did, right? And maybe didn't yield the views that Guitar Hero did. But we went there and we were like, hey, cool. Yeah, we'd love to come to this preview event. Can we capture and do Let's Plays? And can we do Let's Plays? Can we not capture and do walkthrough videos, not capture and do video previews? Can we do Let's Plays? And they were like, I don't know. And then they came back like a day later like, yeah, you totally can. And I got there and we did it for both Guitar Hero and for Nintendo Wii. We did them. We wrapped up our stuff and then I was like, by the way, did anybody else do that? And they're like, no. I was like, all right. And now, I mean, it's getting to be the point where you see more and more people do it. I still feel like we go to events all the time at Microsoft's E3 loft where we walk in and we're like, we're going to do a Let's Play. And other people are capturing footage, but we're the only idiots being like, what's up, everybody? Ah! So it's funny you need to bring up",
            "start": 1338.06
        },
        {
            "text": "We walk in and we're like, we're going to do a Let's Play. And other people are capturing footage, but we're the only idiots being like, what's up, everybody? Ah! So it's funny you need to bring up the Nintendo thing. At number seven is Let's Play Mario Maker at 172,000. Damn. So like that, it did surprisingly well even then. So we're seeing something here. You know, obviously, I was playing games before they're out. Like that's kind of a no brainer. Cheating, yeah. But I think that it's the Let's Play aspect that really kind of is interesting to me because Let's Plays typically are the lower performing videos. For us. Yeah, yeah. Yes. And when I look at this list, it's one, two, three, four, five, six, seven. Seven of them. Seven out of ten Let's Plays. I'm glad we're dialing this back in 2016. I think that it's smart that we're focusing on the right ones. It's going to be good. No, I know. Fucking around. Moving on to number two, Let's Play Metal Gear Solid V. Part one. The first",
            "start": 1370.0
        },
        {
            "text": "in 2016. I think that it's smart that we're focusing on the right ones. It's going to be good. No, I know. Fucking around. Moving on to number two, Let's Play Metal Gear Solid V. Part one. The first Let's Play you did, which no big deal, exclusive to Kinda Funny Games. Greg Miller. Oh, the internet hated that. Making things happen. Oh, the internet hated that. It might have hated it, but it got us 378,000 views. Just for everyone to put this in perspective, we don't get those type of views. Like this sounds crazy because it is. Like our normal views for Let's Plays, I'd say are 20 to 30,000. Yeah, and top out around 30. And I'm talking at the end of the year. Like, you know, we worked our way up, but that's still pretty damn impressive. Metal Gear is all over this thing. Also coming in at number three, the Metal Gear Solid V review at 265,000. That's the one where you talk for 30 minutes. 30 minutes. Spoiler free. And that's the thing that I love about our audience and also love",
            "start": 1414.52
        },
        {
            "text": "in at number three, the Metal Gear Solid V review at 265,000. That's the one where you talk for 30 minutes. 30 minutes. Spoiler free. And that's the thing that I love about our audience and also love about the internet right now is that at IGN, when we were working there a year and a half ago now, you'd get the, that wouldn't work. We would need B-roll. We would need this, dah, dah, dah, dah. Let's have a script and that, and then, and I don't mean to jump ahead, but like Batman v Superman. That was another huge hit for us this year and Kinda Funny. That was again, let's go in there and act like assholes and talk about like what we feel about this. And I think that that's, you're right. That's key to Kinda Funny. So it's kind of being passionate about anything that we're passionate about and like sharing that with people. Cause if we're passionate, they are too, you know, moving on from there. Number four at 259,000, the announcement of us leaving to form a Kinda Funny, oh",
            "start": 1457.72
        },
        {
            "text": "about and like sharing that with people. Cause if we're passionate, they are too, you know, moving on from there. Number four at 259,000, the announcement of us leaving to form a Kinda Funny, oh, that's awesome. Yeah. That's on our YouTube reviews and that's on the Games channel. Yeah. There's an, another video on that Kinda Funny channel that's equivalent. Then at numbers five and six, we got, let's play Metal Gear Solid V: Mission One and let's play Metal Gear Solid V: Mission Three. Now remember mission one we released later cause you didn't want to spoil too much. Oh, Oh wow. It's that part. Oh wow. Okay. Yeah. And that's at 216,000. Damn. That that's mind boggling. Yeah. If I'm looking at this right there, I think you mean mind boggling Greg, when your thoughts are all bottled up? No, I don't mean that. To be clear, I think it might've been called the first mission, Metal Gear Solid Prologue or something like that or walkthrough or whatever. I'm just letting you",
            "start": 1494.44
        },
        {
            "text": "Bottled up? No, I don't mean that. To be clear, I think it might've been called the first mission, Metal Gear Solid: Prologue or something like that or walkthrough or whatever. I'm just letting you know because I remember that coming out late and it was like me and Robert talking about it after the fact. No, I'm awesome. And I'm, you know, I'm glad I did those things. Exactly. Exactly. Really, really cool. Next up there was mission three, which is at 176,000. So that's great. Then the one I was talking about earlier, Mario Maker at 172 then PS, I Love You: Episode One, making its way number eight at 165,000. Damn. Now it's cool because a lot of these are, they're, they're pretty close in view. So it is a nice little competition between them. Like there's, they're all solid, you know, it's top 10. That's very just like dense. Yeah. I would say. Number nine GameSpot Sony E3 press conference reactions. Oh yeah, of course. Yeah. Final Fantasy VII reboot finally shown and that's just kind of",
            "start": 1542.2
        },
        {
            "text": "top 10. That's very just like dense. Yeah. I would say. Number nine GamesCast Sony E3 press conference reactions. Oh yeah, of course. Yeah. Final Fantasy VII reboot finally shown and that's just kind of in our thing. That's pre-PS. I love you. The PlayStation motherfuckers reacting. That was one. I mean that was the one that on top of it doing so well on YouTube destroyed on Twitch. Oh yeah. Remember that was like, I want to say, yeah, yeah. That was insane. Yeah. Yeah. Thank you for hearing about that. Then this is the one most shocking to me besides Guitar Hero rounding it out at number 10 and this was this, I made this list the last time we recorded shows. So that must've been three weeks ago or something. Yeah. I made this list. Then last night I made sure I went in and updated it. This jumped like five spots to knock shit out. Let's Play Just Cause 3. No way. Really? That means Colin went to go do it again ahead of time, again ahead of time. A hundred and thirty-one thousand. It's really fun",
            "start": 1582.48
        },
        {
            "text": "jumped like five spots to knock shit out. Let's play Just Cause 3. No way. Really? That means Colin went to go do it again ahead of time again ahead of time. A hundred and thirty-one thousand. It's really fun to shoot. That was a fun one. Yeah. And it's cool too because I was looking at the like to dislike ratio on a lot of these and some of the Metal Gear ones that we're getting, you know, a little bit of dislikes, but even then it wasn't that bad. Like it was still 90 something percent. Turn off the night vision Greg. I played with night vision. I don't care. No, should you? Yeah. So that's the top 10. I mean like what do you, what do you take from this Colin? I don't know. Some obvious things. I think pre-release stuff's obviously huge. We should probably chase more of that kind of stuff. The Metal Gear stuff was obviously a huge get for Greg. It took him and Nick out of the game for a while, but I think it was worth it. And I don't know. I feel like this really contributes back to the point I",
            "start": 1630.3
        },
        {
            "text": "gear stuff was obviously a huge get for Greg Miller. It took him and Nick Scarpino out of the game for a while, but I think it was worth it. And I don't know. I feel like this really contributes back to the point I think you were making. We made, I think earlier on the stream, which was that we should just do fewer Let's Plays and make sure that they're more thoughtful. Do the right Let's Plays. Yeah. We used to, I do think there's going to be times when we want to do more than one in a week and we should do that. But I think like the quota of one a week is good and like something that you focus on something that's maybe longer, maybe an hour or whatever, maybe even longer if you really want to sit there. Because we, I feel like with Let's Plays, it was a volume game for us for a while. And I remember kind of going through the numbers in the first few months and being like, well, this isn't really worth it. This is filler, which is not bad. I don't even mean the word filler in a bad way. It's like",
            "start": 1677.9
        },
        {
            "text": "kind of going through the numbers in the first few months and being like, well, this isn't really worth it. This is filler, which is not bad. I don't even mean the word filler in a bad way. It's like this is the stuff you go to your YouTube subscriptions every day and you see these few videos pop up. But is there anything wrong with this one video popping up instead of two and one that you probably don't maybe even really want to watch that badly because we're just trying to find something to play. I think the thing about Let's Plays, though, and we don't really often talk about this publicly, but it's the we want to have something where we're playing games, you know, like that's where we're gamers at the end of the day. And it's like having that type of content does impress the developers and allows us to be like, hey, look at this thing we did. We want to do that at this event. So it's kind of like the proof is in the pudding type thing. Excuse me, got a little burp there. Something",
            "start": 1711.54
        },
        {
            "text": "and allows us to be like, hey, look at this thing we did. We want to do that at this event. So it's kind of like the proof is in the pudding type thing. Excuse me, got a little burp there. Something we talked about early on, right? And not the early, but I mean, when we finally stopped to talk about what we were doing was the fact that, hey, we're doing Let's Plays to do Let's Plays and that's showing through. We're doing Let's Plays where not everyone's into them, but we're forcing each other to play. And this isn't where the Borderlands one stands out, right? Where I was like, oh, it's split screen and I have a character that's level 23 and three of you are going to play with me. And Nick wasn't inverted and it was all over the place. And I was just like, yeah, I'm just running around. And I was like, that's a, we took it down because it was like, well, that's not the kind of content we're going for, right? Like we want, maybe you didn't see when we perfected it with my",
            "start": 1742.58
        },
        {
            "text": "around. And I was like, that's a, we took it down because it was like, well, that's not the kind of content we're going for, right? Like we want, maybe you didn't see when we perfected it with my Xenoblade Chronicles X. But again, well, we have a great angle. Nick Scarpino has graduated. His video game education is ready to review Xenoblade Chronicles X. Thank you everyone. You're amazing. Grimecraft bought the game based on you playing it. He did. He text me pictures of it every hour of him playing it. He says, lit. So it's lit. Like every time he got to a chapter, he was like, this is going to be lit as hell. But anyways, just doing stuff we believe in, right? And that's what we're talking about with the one Let's Plays. You know, you and I have already had the conversation of what we want to do next week of like, well, there's this game coming out that I'm in. You're like, well, I got one too. I'm like, all right, well, you know, I mean like, there you go. So there you go too then?",
            "start": 1779.34
        },
        {
            "text": "to do next week on the show, well, there's this game coming out that I'm in. You're like, well, I got one too. I'm like, all right, well, you know, I mean like, there you go. So there you go too then? No, I refuse. What? I'm kidding. Oh, tradition. Sorry. Now going over to Kinda Funny. Kinda Funny is a little more varied. Just a little bit, I'd say. Number one, how to have sex for the first time. Love and Sex stuff with the craziest view count. Seven hundred and sixty seven thousand views. Nice. And climbing. How long has that video been up? Not long. I think a month and a half maybe. And what's crazy about that is that it has an average of getting like at least twelve thousand views a day. So this will outpace the Fast and Furious live stream in a couple months. Now Love and Sex stuff is interesting because it kind of dominates the Kinda Funny top ten. But that show also fluctuates. There's a bunch of episodes that only get like 20k or whatever. The ones that hit, they hit hard. I want",
            "start": 1814.94
        },
        {
            "text": "because it kind of dominates the Kinda Funny top ten. But that show also fluctuates. There's a bunch of episodes that only get like 20k or whatever. The ones that hit, they hit hard. I want to bring special attention to the fact that that episode, one of the few episodes shot by one, Kevin A. Nailed it. Yeah. Sorry, Sean Finnegan. In your face. This guy gets number one. Honestly, shooting that show is one of the most difficult things ever. Because A, I'm really insecure about my shooting skills because I think... You're terrible. Yeah, I mean... You shouldn't be insecure about it. Tim is... You're just absolutely terrible. Tim has taught me how to... So have the confidence to know that no matter what you do, it's going to be bad. Tim walked me through it once two and a half years ago. He said go. Yeah. Like this is what you do. It's cool. And it's just really difficult. And props to Sean Finnegan for doing such a great job always. The man is really talented. It's fun though. You had a nice",
            "start": 1864.18
        },
        {
            "text": "Yeah. Like this is what you do. It's cool. And it's just really difficult. And props to Sean Finnegan for doing such a great job always. The man is really talented. It's fun though. You had a nice touch to it though. I like it. It's funny because that's not the only... That's a nice thing to say. Thank you. Not the only episode by you that's in the top 10. Come on. At number four. At number four, How to Make Your Own Porno. Also my idea. Oh, but that's such a great idea. Yeah, yeah, yeah. But seriously, How to Make Your Own Porno, which is the one we shot during the last live stream for Extra Life. That's in Colin's bed, right? Yeah. So the story behind this, well that got... That's number four at 346,000 views. Damn. Kind of like killing it. It's crazy. Number four. But what's crazy about it is we were at Starbucks months ago and this app came out that made your camera look like a VHS, like an old school camcorder. And I was like, oh, this is awesome. And I was showing Kevin, he's",
            "start": 1911.02
        },
        {
            "text": "It is we were at Starbucks months ago and this app came out that made your camera look like a VHS, like an old school camcorder. And I was like, oh, this is awesome. And I was showing Kevin, he's like, dude, we should shoot love and sex stuff, or How to Make Your Own Porno episode, whatever. So I looked through questions and I found someone that asked that. And then we did it then and it's like, that was such a good idea. It's obviously performing really well. Number two, why we quit Game Over Greggy. Okay. Sorry. Sorry. Why we quit the Game Over Greggy show episode 57. That was the topic one of that show, which is us when we first... I guess that was the January 5th episode. Right. Where we explained everything and why we're doing it and all that. It's crazy. How many views was that? That has 371,000 views over the year. And number three, super awesome Super Bowl commercial featuring Veronica Belmont. That was fun. Do you remember doing that? Yeah, I totally do. Veronica was a champ.",
            "start": 1954.62
        },
        {
            "text": "has 371,000 views over the year. And number three, super awesome Super Bowl commercial featuring Veronica Belmont. That was fun. Do you remember doing that? Yeah, I totally do. Veronica was a champ. I'll never forget that. It sounds like it feels like so long. It does because it was. I wasn't here for that. Think about it. We were coming up on the next Super Bowl and that was the thing, but we shot it right here, right over there where the camera is in that thing. I don't know. There was such a moment. There was such a monumental shift and I talk about all the time and I've talked about it. I know I had not seen before. Not as much as I tell my normal stories, I guess, but like when I left the 100 pence shoot at Alfredo's house with Alexis and that first time where I left, I texted you both and I was just like, this is insane. Like this is a real thing and you're doing a real thing and like we're not just me here talking about Oreos anymore. And that was another reaffirming",
            "start": 1997.26
        },
        {
            "text": "you both and I was just like, this is insane. Like this is a real thing and you're doing a real thing and like we're not just me here talking about Oreos anymore. And that was another reaffirming moment of like we had the red camera here, you know, Brendan and all those guys were here. Veronica was here and we sat here and shot this commercial. I remember shooting it and being like, I feel like my performance isn't that great. And I don't know. And then you watched it and you're like, Oh, that actually came together. You know what I mean? Like when they went and filmed Colin in the living or I'm sorry, Colin in the park out there in the ref's uniform. And it was the day Felicia Day came to do the podcast and like he was in the ref's uniform. It's like such a weird thing. And like to see it all come together, it was another one of those. It's another one of those, just like today is for me with the pilot going out in the animated series where I look at both of you and I'm just like",
            "start": 2040.06
        },
        {
            "text": "It all comes together, it was another one of those. It's another one of those, just like today is for me with the pilot going out in the animated series where I look at both of you and I'm just like, Jesus, you're in a different class than what Colin and I are. You know what I mean? It's just different. Yeah. I wouldn't use it with class. No, I mean like, you know, you're low class and Colin and I are high class. Well, Colin is from Long Island. That's true. Go Islanders. The Great Gatsby took place there. True. West egg and east egg, south egg and north egg. Hey Colin. Yes. Just cardinal directions and egg. That's all you need to know. Is Long Island a town or what would you call it? It's an island. The island. It's it is the island. Yeah. How many other islands in the United States called Nassau? What is that supposed to mean? Rhode Island? Probably kind of a couple. I thought some Nazis landed in the Ipswich, Long Island. You guys caught him, right? So I'll ask the",
            "start": 2079.62
        },
        {
            "text": "called Nazis? What is that supposed to mean? Rhode Island? Probably kind of a couple. I thought some Nazis. The Nazis landed in Long Island. You guys caught him, right? So I'll ask the question, how many other islands in the United States caught Nazis? Oh, I don't know. Probably none. Exactly. I was backing you up. I was on your side there. I see. Cause I was expecting you to insult me. No, I'm backing you up. It's when it's you and me one on one, I'm going to insult you. Okay. When it's one of these chuckleheads insulting you, I'm going to back you up. Oh, I appreciate that. We get a first down Nick. It's the anniversary. It just feels right. You gave some walking earlier. It's been a while. Yeah, I did. I hadn't gone walking in a while, but we'll go for a stroll later. Yeah. Maybe bring out the goat. Oh, fuck you, Jesus. I wonder what the goat's up to. That was really good. Who's fucking the goat? It's Emmanuel fucking the goat. Where is the goat? Yeah, what happened to",
            "start": 2125.74
        },
        {
            "text": "Maybe bring out the Goat. Oh, fuck you, Jesus. I wonder what the Goat's up to. That was really good. Who's fucking the Goat? It's Emmanuel fucking the Goat. Where is the Goat? Yeah, what happened to him? What the fuck is happening to the Goat? We threw the Goat away. Did we really? I think so, yeah. Why would we do that? Then he's deflated up in the closet somewhere. I think he's deflated somewhere. No, I've been in that closet. He's probably like Portillo. He deflated. Chemical op-ed in that closet. I spent hours. We're almost dying today trying to find the championship out. If you're listening to this, look up our P.O. box number and please send us into the sex Goat. Please don't. Send us a life-sized sex Goat, though, so we can put it in the corner over there. Because now it's just you two. How big do you think a Goat is? Have you ever seen a Goat? Goats can get pretty big. They can, but they can also be the same size as the sex Goat we had. Really? They're that small? Yeah. That",
            "start": 2171.04
        },
        {
            "text": "two. How big do you think a goat is? Have you ever seen a goat? Goats can get pretty big. They can, but they can also be the same size as the sex goat we had. Really? They're that small? Yeah. That thing was like a little tiny thing. It was a pig. It was like the size of Portillo. I was going to say. Look at him. I like him. He's a pig. He's a pig. He's a pig. He has little pig noises. He is risen. He just has the same look every time. Fake it. Just vapid. Like what's happening? I don't care. Eat, poop, sleep. NumberForm. This is another really surprising one just based on the time that it's been out. But not surprising in the content. Star Wars: The Force Awakens. Full spoiler review. Damn. 344,000 views. That's awesome. I'm so angry with that. And do you remember when Nick Scarpino was like, can't you guys wait another day? And we're like, no. Now I think there's something to learn from this. Bros before hell. And this is hard. It's hard to do just based on how we",
            "start": 2199.52
        },
        {
            "text": "Nick Scarpino was like, can't you guys wait another day? And we're like, no. Now I think there's something to learn from this. Bros before hells. And this is hard. It's hard to do just based on how we work and stuff and just life. But there's something to say about we should watch a movie and do a review directly after it. You know, like that Thursday night to get it out so that Friday people are watching. Honestly, when it comes to movies, we do those reviews. As we're driving or as we're walking away from the movie. Yeah, I mean we do it anyway. Yeah, that's what I'm saying. It's a lot of fun. I will say. Being here, we were here until like 1am. Oh yeah, sure. But that was a lot of fun too. That was one of those E3 moments where we're all sitting here working. But what I'm saying is I would like to do that for every movie. And that could be ridiculous. But it could be worth it because you see it there and that's what we want to do. At the end of the day, all we want to do is sit here",
            "start": 2252.58
        },
        {
            "text": "like to do that for every movie. And that could be ridiculous. But it could be worth it because you see it there and that's what we want to do. At the end of the day, all we want to do is sit here and talk about what movies we like. And there's so many of them coming out. Yeah, I agree. We would have liked to have seen The Hateful Eight with all of you guys and then come back afterwards and talk about it. That would have been great. We should have seen it probably earlier in the day because the movie is like 18 hours long. How long is it really? We saw it at normal time. It's like 3 hours. The road shows 3 hours and some change. But it's because it has an intermission and an overture. I think when they release it, they'll cut it down. They'll cut the intermission out and the overture and I think it'll be like 2 hours. When you go see it, can you contact me before? I want to go see it again. I was thinking about it tomorrow since I have the day off apparently. Are we taking the day",
            "start": 2293.34
        },
        {
            "text": "I think it'll be like 2 hours. When you go see it, can you contact me before? I want to go see it again. I was thinking about it tomorrow since I have the day off apparently. Are we taking the day off? We haven't fully discussed that. We're not doing any time off. We're not doing any time off. I know. I mean, if we need to break up editing, that's fine. Let's break up editing and I'll stay home and break up. No, I can handle that. No, you can't. Are we trying to get everything done? You're coming on Thursday all the time. And Steve Gaynor is going to come up. He's like, hey! Oh, Jesus, we got that interview. Yeah. Yeah. Not even an interview. He's going to be here all day. I mean, no matter what, I have to reset this whole entire place tomorrow. But you could come super late and do it. Or you could come late. Oh, about this. Stick with me. Shit. No, stick with me. Is Paula coming, you said? I mean, I have to. Her schedule is really messed up. Stick with me. You guys come over tomorrow",
            "start": 2326.1
        },
        {
            "text": "you could come late. Oh, about this. Stick with me. Shit. No, stick with me. Is Paula coming, you said? I mean, I have to. Her schedule is really messed up. Stick with me. You guys come over tomorrow in the afternoon. You break this down. I cook firehouse chicken. Oh, I'll cook something vegetarian for her. I'll cook some vegetarian for her. Then we go see the movie together. I like that plan. I'll bring it up to her. It's 11:31, so she's definitely asleep. Text her. Use your phone. Call and text her. Hey Google! Text Paula. Google! It's over! I hate all of you guys. Did any of it go there? No! When you shout 10 million things at my watch, nothing works. One day we're going to look back on this and we're going to think, oh, it's a surprise Kevin killed himself. Jesus. Jesus. Never mind. My life's awesome. With Lomo Salpados. As much shit as you guys give me. Did he nail it? Yeah, he did. He nailed it. He knows what it is. I was going to say, as much shit as you guys give me. Like, I",
            "start": 2365.3
        },
        {
            "text": "My life's awesome. With Lomami Salsano. As much shit as you guys give me. Did he nail it? Yeah, he did. He nailed it. He knows what it is. I was going to say, as much shit as you guys give me. Like, I live the fucking dream. I come and work with my best friends. It's hilarious. I have so much fun. I've been doing it for a year and some change. I do. It's true. It really is the dream. Yeah, it's really the dream. So thank you guys for making that all possible. Thank you guys watching the stream and watching this video. I will say this, Kevin. One day I hope to have that too. We appreciate you, Kevin. So the reason why we're streaming right now, in case you for some reason just decided to skip to the middle of this podcast. All right, are they done talking about their dinner plans for the 8th? To be fair, if you don't want to listen to us talk about our dinner plans for the 8th, you're listening to the wrong podcast. That's all we talk about here. But we did the pilot episode and a lot",
            "start": 2416.1
        },
        {
            "text": "To be fair, if you don't want to listen to us talk about our dinner plans for the 8th, you're listening to the wrong podcast. That's all we talk about here. But we did the pilot episode and a lot of nice comments about Kevin's acting ability. And that was the first time you'd ever done anything like that. And it didn't take that long. We did a few takes of it. I did some editing magic, spliced the good parts of part A and part B together and voila. But you're getting the hang of it. You're getting the hang of it, Kevin. It's been a lot of fun. Thank you for including me on that. Getting better on camera, getting the hang of it, getting your confidence. And I have to tell you, I have to break you now. I have to break that because I can't have you coming up. No worries. Because you're like the younger version of me. No. Look at you. You got a potty mouth, you're mildly racist, you watch way too much porn. You're me.",
            "start": 2456.06
        },
        {
            "text": "you coming up. No worries. Because you're like the younger version of me. No. Look at you. You got a potty mouth, you're mildly racist, you watch way too much porn. You're me. No, I was going to say, you're talking about yourself. True. Number six. All right, we're still on this. Hot a kiss. Love and sex stuff, 286,000 views. I did not shoot that one. You did not. That was a Sean Finnegan special. Another very, very, very recent one though. Yeah. So within the last month, 286,000 views. People like getting instructions from you. It's great. It's great. Well, yeah, you stumbled upon the fact of how to make the thumbnail for love and sex stuff to a guy and a girl. It needs to be a guy and a girl embraced. Yeah. But I remember the day you stumbled upon it because Colin was like, did somebody not tell me, did we pay for ads in this video? I was like, what? And he's like, are we airing this? I'm like, no, we're not. And he's like, what? How's this happening? We found the secret and it's",
            "start": 2490.38
        },
        {
            "text": "not tell me, did we pay for ads in this video? I was like, what? And he's like, are we airing this? I'm like, no, we're not. And he's like, what? How's this happening? We found the secret and it's fun. It's great. Number seven, very proud of this one. GameOverGreggy's crazy Batman v Superman trailer reaction. Another very recent one. It's shocking to me. How many of these videos, how many of those videos are, I'm listening to you, I'm just typing in the sense, how many of these videos are in the last two months? I mean that for me, that's a huge feather in our cap of like, it's working, right? You know what I mean? And the audience is growing and like, for me, it's always that thing, you know, you look at it and you go, what the hell spilled all over? No, that is not, I won't. I picked up a glass and it had a little bit in there. What I talk about is the fact that, you know, like colonize this reputation for PlayStation, right? And that shines through in what you're talking about with like the",
            "start": 2535.46
        },
        {
            "text": "It had a little bit in there. What I talk about is the fact that, you know, like colonize this reputation for PlayStation, right? And that shines through in what you're talking about with like the reaction video for GameCast, right? People want to hear our opinions about PlayStation. And I love the fact that now we're not breaking out of that mold because that's who we are. But for, you know, for Batman v Superman, people want to know what I fucking think of that. Like, you know, Nick and I did a Daredevil reaction video, right? And it did fine, but it didn't do crazy numbers, right? But people fucking know Superman, me, you know what I mean? Mega Man, Colin. Statute? No, I don't know. You can say statutory rape. No, no. Who would say that about you? Jesus. Is that what you think? I think that's also a testament though, Greg, to the, we did that literally right after the trailer happened. That's another thing. Right. You know, like the timing, we just, that was another E3 moment",
            "start": 2579.66
        },
        {
            "text": "Think that's also a testament though, Greg, to the, we did that literally right after the trailer happened. That's another thing. Right. You know, like the timing, we just, that was another E3 moment where we're sitting here. We're like, should we do? Yeah, let's do it. Fuck it. No, no, it's not though. Cause you remember that was totally premeditated. Cause I went out and I went cause I was drunk when we did it. I went to a Skybound meet up or whatever, where I went and met up with PR and met some other people and said hi to them and then came back cause I knew I had to do it. But like we came back and we're going to do that. And again, it was because we knew it was our thing. Really? I just, I grazed it. You got a lot of cups here. I'm just going to move this over. Now I want to say one thing. Greg Miller has 10 cups in front of him. We messed up there. We should have either recorded you watching it or Twitch streamed it. My God, that was amazing. Now my most famous like",
            "start": 2622.14
        },
        {
            "text": "to say one thing. Greg Miller has 10 cups in front of him. We messed up there. We should have either recorded you watching it or Twitch streamed it. My God, that was amazing. Now my most famous like fucked up tweet was because I could not look away from you and it just, that was a glorious moment. We have to think about that, but we didn't understand again. No it wasn't even the tipsy. Like I don't get it. It helped for sure. Yeah, but a thousand percent. I did not expect that trailer. They're showing a new Batman Superman trailer and Jimmy Kimmel. Awesome. Yeah, I'm totally in. They're going to show fucking Doomsday. Are you out of your goddamn mind? You know what I mean? Yeah. Are you fucking kidding me? Are you kidding me? Which one was Doomsday? Was he the Ninja? Can you please stop? Can you please stop? You know that's not what a Ninja Turtle is. Leonardo DiCaprio, is that where you're going? I was going to say statutory rape. We've probably seen him talk about that. Number eight.",
            "start": 2660.98
        },
        {
            "text": "You please stop? You know that's not what a Ninja Turtle is. Leonardo DiCaprio, is that where you're going? I was going to say statutory rape. We've probably seen him talk about that. Number eight. Not a funny thing to joke about. Am I having sex with too many people? This was our first breakout hit, Love and Sex Stuff. It is at 238,000. So that was the first time we hit over 100k. We were teetering around it with a couple episodes that are at like 90, but that was the first big one. Number nine, the thing I'm most proud of all of these, Kinda Funny Live. The video at 174,000 views. Now I'm so happy about that because I remember making that video to this day is probably that video is like my most prideful moment. You put a lot of work into it. You actually blew me away with that because I was like, I was not expecting you to reach out to the community and get all that footage. The B roll had to. It was awesome. It was awesome. We need to have more cameras next year. If you want a",
            "start": 2715.94
        },
        {
            "text": "I was like, I was not expecting you to reach out to the community and get all that footage. The B-roll had to be awesome. It was awesome. We need to have more cameras next year. If you want a sappy, like Greg Miller moment of how emotional and stupid I am or whatever. This morning when I was building the Patreon pages and it was like, it was like totally like swordfish except I wasn't getting a blow job while I was working at the computer really fast. We can fix that. I went and put on Kinda Funny Live because in my head I was doing the, it started with an S. You know what I mean? Because Dave Filoni is fucking awesome. I just wanted to listen to that beginning. So encapsulates what we were and are, but let alone the fact that like now it was our anniversary. You know what I mean? It's so cool man. It did all start with an N. But I remember making that video and putting it out and when we, you know, it started getting a lot of views, especially in relation to how many views our",
            "start": 2760.74
        },
        {
            "text": "so cool man. It did all start with an N. But I remember making that video and putting it out and when we, you know, it started getting a lot of views, especially in relation to how many views our content normally got back in May. And I remember it rising was like 20,000, 25 then 30 and whatever. And like this is over the, like maybe two or three weeks. And I remember like hanging out with Kevin, like dude, like do you think it'll hit 100? I wanted to hit 100 so bad. Like that'd be so fucking cool because this represents what I want us to be. You know, not just what we're doing, but like what I want us to be doing. And now it's like I look at this and there's so much things that I'm like, this is what I want to do. You look at the animated show today and it's like, it's already at 40,000. Doing so well. Thank you so much for sharing. If you're just hearing about the animated show, please go and watch it and share it. And that's the one thing I think people lose sight of all the time",
            "start": 2803.38
        },
        {
            "text": "Doing so well. Thank you so much for sharing. If you're just hearing about the animated show, please go and watch it and share it. And that's the one thing I think people lose sight of all the time is like, oh, well I'm not going to share it. I only have 800 followers to Greg's whatever. You know what I mean? Like that's not what it's about because you followers, I don't have. So get it out to other people to watch. Please annotate right there. Ooh, you can do that cause you're making your own work. Yeah. Put it put, here's what I want. Now put, put Colin's animated version of Colin over Colin. Thank you. Colin's animated. Why do you have to make just, just the cut out, just to cut out. You made Anthony Carbone look like a dead Jedi. My greatest video editing moment of all time. You did. It was very impressive. That was really good. By the way, I just had like an epiphany. I'm not going to say what it is cause I don't want to spoil anything. We're Kinda Funny live too. If something",
            "start": 2837.42
        },
        {
            "text": "It was very impressive. That was really good. By the way, I just had like an epiphany. I'm not going to say what it is cause I don't want to spoil anything. We're Kinda Funny live too. If something I want to do that with Tim, I just had, I just had a, I just, you know, remind we could do, we could, we could, I'm, please write it down. Cause I, yeah, I mean, show it to us. Well, cause I'm building the list for Kinda Funny live too. I'm building the list. Yeah. Are we going back to the Station reference? Totally. People want that. Let me see it. Oh yeah. Oh yeah. Oh yeah. Oh yeah. Yeah. Yeah. That'd be fun. So running this out. Number nine. Remember when this is gonna be a short topic? Hey, hey, this is what, this is why I did this and not the other thing. I see. I'm smart. I knew what I'm doing. It's topic two is like a real, this is what I wanted. We love you. Don't worry. You're awesome. Ask you as a question. Yes, please do. When you were kids, you burned corks and then",
            "start": 2881.7
        },
        {
            "text": "what I'm doing. It's topic two is like a real, this is what I wanted. We love you. Don't worry. You're awesome. Ask you as a question. Yes, please do. When you were kids, you'd burn corks and then put them on your face like a military guy. That sounds like something Matt would do. You never did that? No. If you burn the corks, you go like this and it'll put the black stick on your face. I kind of wish I knew that. That would have been useful when I was playing Red Dawn. Does it wash off all right? Yeah. Hey, I just want to remind us like we do have two hours and 40 minutes max on the card. At some point someone's going to have to check how much time we have on the phone. We're fine. We're fine. We're fine. I just want to be sure. I'm sorry. Number nine, how to get better at sex. Whoa, really? You made the list yesterday. That just came out. I guess that's right. Yeah, that came out like two weeks ago. 152K. You're not inspiring confidence. Sorry. I'm just shocked. This is like",
            "start": 2926.34
        },
        {
            "text": "really? You made the list yesterday. That just came out. I guess that's right. Yeah, that came out like two weeks ago. 152K. You're not inspiring confidence. Sorry. I'm just shocked. This is like yesterday when Colin's like, how much money do I have in the bank of Greg, which is the money I owe him based on utilities. And I was like, 192 bucks. He's like, that's a lot of money. Thanks. And I was like, 10 minutes later, I'm like, all right, turns out you have $390. I did some math wrong. Sorry. That was after you took money out that I owed you. It was the best. Yeah. Wow. Three weeks ago. You're onto something with this. Now here's the thing, and I'm really happy that this is rounding out this list at number 10. The final thing. Troy Baker does impressions. Yes. At 130K. I feel like the one thing we haven't done enough of today is thank Troy Baker. Troy did a principal walk in in the animated series today. We were like, we don't know what we're doing. We can't pay you and he's like,\n\nCorrected changes:\n- \"Collin\" → \"Colin\" (correcting host name)",
            "start": 2969.82
        },
        {
            "text": "one thing we haven't done enough of today is thank Troy Baker. Troy did a principal voice in the animated series today. We were like, we don't know what we're doing. We can't pay you and he's like, it's no big deal. I'll totally do this for you and he did. He did an awesome voice over like he does, and so thank you, Troy Baker. If you're watching, you know not that you're watching this story, but everybody else please tweet your thanks to Troy Baker for doing that. You threw us off call. He was a second and then he went into like a hockey club. I told you that my friend Kevin's wedding an entire. Hold on. You just turn it off in it. Yeah. Why would you open it? Why? I put it on the media card. Hold on. Just hold on a sec. You can't open it mid. All right, stop. We'll see. Wait, no. Stop the recording on the audio. Hey Twitch guys, you might've just seen half of a show that'll never go live. Anyway. Sorry. I just, I got scared. All right. We need to sync. This is why they stopped doing",
            "start": 3018.1
        },
        {
            "text": "recording on the audio. Hey Twitch guys, you might've just seen half of a show that'll never go live. Anyway. Sorry. I just, I got scared. All right. We need to sync. This is why they stopped doing drunk shows. Tim Gettys. What I was saying was that the story about Kevin who played hockey with us on NHL 94. Oh yeah. Let's play. He's the, what is the fucking champion he is? Jack. No, Juke Mania 2015. And Juke Mania. Can't take this Juke Mania. He, uh, he had a tape. I was at his wedding and he had over, he had a table of like some of our old friends from Northeastern who every time they introduced someone in the wedding party just agreed to all go dog show, which I thought was like the funniest, stupidest thing. Are we eating? No. Give me, I want some of the pizza. Please give it the pursuit. Look at Porty. Look at the party's never been more into a Game Over Greg Show because again, I'm super paranoid. Are you sure that the board is running like",
            "start": 3063.26
        },
        {
            "text": "of the pizza. Please give it the pursuit. Look at Porty. Look at the party's never been more into a GameOverGreggy show because again, I'm super paranoid. Are you sure that the board is running like rolling? I'm just saying, are you sure? Take it all. Just go and take grabbing a slice for you. You don't want to touch. Can I wipe some of your arm's sweat on it? Tim's like, I want the light topic for number one to get through quicker. Good call. One hour in. Well, it would be two hours if you want to talk to give me the arugula. Now, Nick, did you wipe card too? All right. Thank you, Nick. Thank you. Remember how mad I was when I thought that we didn't have any. Oh, I got those golden paper towels. Roll paper towels as well. Thank you. That wasn't my fault. What do you mean you knocked over a little bit of champagne? It's not. It's okay to have an accident. No one is blaming you. Nick, I don't need more. Thank you very much. Except for me. No Nick. Yeah. Underneath",
            "start": 3113.26
        },
        {
            "text": "you knocked over a little bit of champagne? It's not. It's okay to have an accident. No one is blaming you. Nick, I don't need more. Thank you very much. Except for me. No Nick. Yeah. Underneath the sink on the right side. We got some dental shoes for Pratila. Bring me one of those as well. I'm sorry. Is that a dog or what's happening? No, he moved on to the game's catch. Look at how excited that dog gets. You're giving him a treat? Yeah, he's great. It's like midnight. He's not a gremlin. He'll be all right. He has 14 minutes. How's that sound, boy Nicky? Great, everyone. Are we still going? Give it to him. Bring it up. Bring it up. There you go. Look at how much he loves that shit. He doesn't even have a dog. He's a dog. He's a dog. He's a dog. He's a dog. He's a dog. He doesn't even know it's cleaning his teeth. What an idiot. Remember when you had to get his teeth cleaned? It somehow took it two months to get an appointment? Like this was like, what is this? The fucking dog",
            "start": 3175.26
        },
        {
            "text": "know it's cleaning his teeth. What an idiot. Remember when you had to get Tim Gettys' teeth cleaned? It somehow took it two months to get an appointment? Like this was like, what is this? The fucking dog dentist of the stars or something like that? How did it take you so long? Let me put some arugula in my mouth. Because he's not a jalopy. They need to play and shit and fucking do things. Where do you rank arugula on the scale of leafy greens? It's got like a bitterness to it, which I like. Yeah, arugula has a nice little bite. Oh. I like kale more. Here's what I want to do. Can I be stupid and just ask you to give me a shotgun? So kale, spinach, arugula. Romaine. Broccoli Rob. Hook me up with some of that. Can I ask you an insulting question? Because I would say no. How dare you, sir? So if Broccoli Rob is not... Not a leafy green. Because I want to get to where broccoli is. What's broccoli? Broccoli is fucking whack. But if that's what you're in... Are you fucking kidding me? I don't know.",
            "start": 3224.26
        },
        {
            "text": "rob is not... Not a leafy green. Because I want to get to where Broccoli is. What's Broccoli? Broccoli is fucking whack. But if that's what you're in... Are you fucking kidding me? I don't know. It's not a leafy green. It's not a leafy green. Is it whack really? You want to say it's whack? It's a stalk. So it's a little whack. But here's... Broccoli is whack. Broccoli is fine. I don't mind Broccoli. It's just that... Why? You know what I mean? It's delicious. It's awesome. You have all these other options. I'm not really dissing on Broccoli because I would eat it. I think Broccoli is totally fine. Raw, cooked, whatever. But when you have other options... Why? It's delicious. It's the best conduit for sauces or cheeses. Right. There you go. There you go. Which is really the only vegetable. It's very true. I'll make you some stir fry tomorrow, Colin. I'll blow your hair back. You'll love some Broccoli. I'm a big fan of the Broccolini as well. Oh yeah. The classier Broccoli. Yeah. The",
            "start": 3277.26
        },
        {
            "text": "It's very true. I'll make you some stir fry tomorrow, Colin. I'll blow your hair back. You'll love some broccoli. I'm a big fan of the broccolini as well. Oh yeah. The classier broccoli. Yeah. The leafy green of broccoli. Broccolini is so good. And I feel like broccolini is a total fucking racket because... It's younger broccoli. There's copious amounts of it probably. And they're charging you like two, two and a half times more for that than they are... Doesn't make any sense. Worth it. Thanks Obama. What is it like veal? Come on. It probably is Obama's fault. As Colin just fucking shovels the arugula. I don't need arugula. This has been a great show. Yeah it has. Ladies and gentlemen, thank you so much for joining us. Oh we're still on topic one. That was topic one, yes. Oh we're done with topic one. Cheers to Kinda Funny year one. No, that was just the most popular videos. This is We Do This. Give me a sync clap. Good? Yeah. Oh that was even better. Oh definitely better. Tim,",
            "start": 3320.26
        },
        {
            "text": "We Do This. Give me a sync clap. Good? Yeah. Oh that was even better. Oh definitely better. Tim, the penguinator just asked me why I don't do walk-in anymore. And here's the answer for you. It's because I got Troy Baker to do walk-in, principal walk-in in the first episode of Kinda Funny the animated series. If you go to patreon.com forward slash kind of funny right now, you too can help support this thriving series now. The problem is once I heard his reads on it and how quickly and easily they came out, it just demoralized me. It's like sometimes you think you're talented, right? You think you enrich people's lives and then you hear Troy Baker talk. Oh. And you're wrong. It's true. He's way more talented than I ever will be. And he's got such amazing scarves. Yeah. There we go. How many people have gotten this? Remember those people that get added to the Kevin ringtone, right? They",
            "start": 3360.26
        },
        {
            "text": "We get super drunk and record the longest, most ridiculous episode of all-time. Get everything early here: http://www.patreon.com/kindafunny Subscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy This video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com Buy our shirts! http://www.districtlines.com/gameovergreggy Each and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes. Follow us on Twitter! Greg - http://www.twitter.com/GameOverGreggy Colin - http://www.twitter.com/NoTaxation Nick - http://www.twitter.com/Nick_Scarpino Tim - http://www.twitter.com/TimGettys way more talented than I ever will be. And he's got such amazing scarves. Yeah. There we go. How many people have gotten this? Remember those people that get added to the Kevin ringtone, right? They also get Kevin gets Nick's. Nick doesn't get Kevin's. Jump on in. I'm a pony. Ten people. Kids ride me. Don't like it. But I'm a pony. Small saddle. Walking around in a van with kids. All right. Which means it's time to go. The party's over, kids. Get out of the fucking pool. Get out of the pool. You get a little bit of fun with Colin and then eventually you have a dad. Dad comes out. I always have a lot of fun with Colin. I'm a fun young man to hang out with. As you go back to doing your books. It's not your fault. I'm preparing my resolutions. I know what you're doing. I know what you're doing. It's fine. You can move the couch forward. That way if you wanted to. Just leave the bars up the entire time and say subscribe on Patreon. Support the animated series. Suck a dick. Are you in",
            "start": 3416.26
        },
        {
            "text": "It's fine, you can move the couch forward that way if you wanted to just leave the bars up the entire time and say subscribe on Patreon support the animated series suck a dick are you in a relationship be true to your partner are you going to school be true to your school just like you would be a girl or guy a little Beach Boys reference people saying do you have pledge rewards yes go to Patreon.com slash Kinda Funny along the right side they're all over there there you go there you go now watch there is also some pairs in there like the bananas what are you doing people want the crane impression hey Spider-Man you need help fighting that guy hey everybody I know it's three in the morning but swing your gun you go Spider-Man you mess with one of us you mess with all of us kick the P take the shots damn JD Bona you old school you've been with us for the long haul with the kick the P reference oh yeah kick the P then kick the P that's a good one.",
            "start": 3476.26
        },
        {
            "text": "with all of us. Kick the P, take the shots. Damn. JD Bona. You old school. You've been with us for the long haul. With the kick the P reference. Oh yeah. Kick the P then kick the P. That's a good one. That's a good one. Go to the next one. That's a good one. That's a good one. That's a good one. That's a good one. Kick the P and suck the D. Sucking that D. Hey El Jefe. I love you guys. You know that. And you all do amazing work. But you went through all that framing thing and then you left the one surround sound speaker dead in front of Nick. We've gone too far. I mean there's one off to the side on him but Nick's is like there's no hiding. Those things are so damn annoying, you can't move them because they constantly. There's not a lot of cord. There's not a lot of cord. Yeah exactly that's the problem. But they're really good for something. They look really nice though. I like them a lot. I like them a lot. Alright we're rolling? Yep. We are. Get your game face on. Fucking focus up. Get",
            "start": 3533.26
        },
        {
            "text": "The Most Popular Kinda Funny Videos of 2015 - The GameOverGreggy Show Ep. 110 (Pt. 1)\nWe get super drunk and record the longest, most ridiculous episode of all-time.\nGet everything early here: http://www.patreon.com/kindafunny\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\nBuy our shirts! http://www.districtlines.com/gameovergreggy\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys\n\nthe problem. But they're really good for something. They look really nice though. I like them a lot. I like them a lot. Alright we're rolling? Yep. We are. Get your game hat on. Fucking focus up. Get your game hat on. Let me know Kevin when we're broadcasting the Twitch kids because I'm sick of talking to them but it's whatever. What? So again Twitch kids keep supporting us patreon.com slash kind of funny. You're keeping an eye on all the pages and what we're doing and shit. I mean we're not going to hit the stuff. Oh cool then we're done. We are failing. I mean unless you guys get us to 60k which I would be very. What are we at now? We are currently right now at fifty two thousand seven hundred and ninety seven. Throw seven if you're out there. I need an eight thousand dollar tip. Because yeah the next next is sixty sixty. Sixty will get us nine episodes of the show. I promise you though if you keep getting things up",
            "start": 3593.26
        },
        {
            "text": "yeah the next episode is sixty six. Sixty-six will get us nine episodes of the show. I promise you though if you keep getting things up on my stream, I'll give you guys something you want in the next stream for each thousand. I promise it'll be worth it. OK. What do I hear? Welcome to The GameOverGreggy Show. I'm one of your hosts Greg Miller alongside the producer Nick Scarpino. You're so far away. I don't like it at all. Touch me. There it is. Thank you. Your tips were backwards. Yeah we're in the wrong order. Yeah, the orders all fucked up. Oh how does that make you feel? Really upset. Well these two guys... We should say the problem. You know what we can't record this episode. I really don't want to show up like this. I mean I also because I'm so insecure I want to go check the board make sure it's rolling. It's fine. I know that it is. We can't record like this.",
            "start": 3636.26
        },
        {
            "text": "what we can't record this. I really shows happen. I mean I also because I'm so insecure I want to go check the board make sure it's rolling. It's fine. I know that it is. We can't record like this. OK. We can go check the boards. Greg. No. You guys switch while you're switching. Just look and make sure that there's a little red light on. I really don't want that much pressure on that. Can you check. I mean you know I just switched the two people and you go listen and do it. And then the quick sound. He's next working. He's had enough. I'm not I'm fine. It's just sometimes Greg. He's more of a real hard his brain stopped working arguably about two to three hours ago. We're rolling. We're rolling. I believe you can over there and check them on the mics because they're now going to change. Good point. All of your point. Sorry we just can't. No we can't. That's right. I mean you. This is the anniversary stream game of a great show. Changing the rules. Come on. Can you. Hey what's up",
            "start": 3688.26
        },
        {
            "text": "Good point. All of your points. Sorry, we just can't. No, we can't. That's right. I mean you. This is the anniversary stream game of a great show. Changing the rules. Come on. Can you. Hey what's up everybody. It's me Greg Miller talking to you right now. Did you know Banana Republic puts elves inside of boots? What did they throw the boots over the ocean. This one's going to be real damn fun. And one two three is gone. Colin, Greg live right here on TV. Oh motherfucker that was stupid. All right. Let's hear your resolutions. Thank you. Can I have my beer and water, beer. Thank you. Water. Thank you. Jump on it. I don't stay out of town. Right him. Great. He's a doggy. Bow bow. I already love this episode. Nothing's happened yet. Oh this is a good one. I'm going to go. I'm going to go. I'm going to go. I'm going to go. I'm going to go. I'm going to go. Oh, this is a blooper. Great. This isn't a blooper. You'll never put this up. You don't have the balls unless we showed up. If I'm not next",
            "start": 3736.94
        },
        {
            "text": "I'm going to go. I'm going to go. I'm going to go. Oh, this is a blooper. Great. This isn't a blooper. You'll never put this up. You don't have the balls unless we showed up. If I'm not next to Tim Gettys, it's not right. Yeah, I got it. This does feel better. It does feel good. It does feel good. I don't want to. I'm too close. Well, it's not like when we were introducing him, I looked at him like, why am I next to Nick Scarpino? Yeah. I love Nick. I want to be next to Nick all the time, but it's not right. We can't even. Nick, we can't do the heart. We can't. Nobody cares. We haven't done that in a long time, so it doesn't matter. We'll do it today. What? Hey, Google. Text Paula. It's over. Send. Can we appreciate the mics? I'm short. Should I be Belmonted right now? Maybe. You should be Belmonted a thousand percent probably. That's too far. I like it. I like it too. I'm going to go.",
            "start": 3785.98
        },
        {
            "text": "I like it too. I'm going to go. I'm going to go. I'm going to go. I'm going to go. I'm going to go. I'm going to go. I'm going to go. I'm going to go. I'm going to go. I'm going to go. I'm going to go.",
            "start": 3830.78
        }
    ]
}