{
    "id": 144,
    "video_id": "PINu8l_BK7w",
    "show_name": "A Conversation With Colin",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "WTF Keyboard? - A Conversation with Colin",
    "description": "What's the deal with that keyboard that's always behind Greg and Colin? Find out!\n\nToday's topics were submitted by @GPIANOPS. Leave your suggestions for future conversations in the comments below.\n\nSUBSCRIBE/LIKE/SHARE\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nSubscribe to our channel: http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Tim for filming.",
    "published_at": 1381842003,
    "duration": 216,
    "transcript_chunks": [
        {
            "text": "yeah that's wait how [Music] was what's up everybody Welcome to A Conversation With Colin I'm Greg this is my roommate Colin and sometimes this beautiful bastard says crazy stuff so every Tuesday and Thursday I reach into my random conversation pile pulling out toss it at him and we talk it out for your amusement if you like that like the video subscribe to us here and share it with your friends Colin are you ready can you crease my face again are you ready yeah now I'm ready anything today's topic of conversation is that keyboard that's always in the background from GPianoPS. This is a long running Conversation With Colin thing that we got this damn piano back here yeah all this garbage back here who whose guitars are the guitars we start guar the base is mine the acoustic guitar I have an acoustic but that's not mine this is this is Mike's yeah uh and then the keyboard is Mike's now how many times have you seen Mike play it uh the keyboard when Mike first moved in Mike would play the",
            "start": 0.28
        },
        {
            "text": "acoustic but that's not mine this is this is Mike's yeah uh and then the keyboard is Mike's now how many times have you seen Mike play it uh the keyboard when Mike first moved in Mike would play the same song on this over and over oh doctor and uh what are we going to plug are we going to plug it in yeah what song would Mike play um I don't even know Mike are you here Beverly Hills it was the Beverly Hills thing that's all you **** knew how to play well that was that was home drunk like shut up the the Axel F song yeah yeah I don't even remember how you hold on everybody I don't remember how to play it you can see by the layer of dust how much this gets played I'm trying to remember if I can I'm trying to remember if I can remember that I think I think this is God I don't remember how to play [Music] it yeah that's wait how was I like how it's quiet as you think about it yeah it's something like that right [Music] all right so that's that's that's the story of the keyboard it's",
            "start": 47.84
        },
        {
            "text": "to play [Music] it yeah that's wait how was I like how it's quiet as you think about it yeah it's something like that right [Music] all right so that's that's that's the story of the keyboard it's been here we've lived here for two years almost no no more than two years no **** really yeah we moved in you moved here in August of 2011 it's wow September you'll be seeing this in October of 2013 wow yeah we've lived here a long time and the keyboard has been played in my presence maybe five times and that was in the first month of living here and then I got shoved in the corner yeah it's a it's a it's one of Mike's you know relics yeah we we went and gave it to Goodwill how long before he noticed he would never know oh you going do the Saints oh when the Saints Go March it in uh can you play Crocodile Rock because I like that song a lot I don't know how to all right let's up this one all right ladies and gentlemen thank you GPianoPS that was a good conversation now you all know and",
            "start": 96.44
        },
        {
            "text": "play Crocodile Rock because I like that song a lot I don't know how to all right let's up this one all right ladies and gentlemen thank you GPianoPS that was a good conversation now you all know and can stop asking why there's a piano in the background that doesn't get played cuz it's just there we're lazy and don't throw things away Colin thanks as always for your time ladies and gentlemen if you want to be part of the Conversation With Colin leave your topic suggestion in the comments below like subscribe share and then make sure you come back every Tuesday and Thursday until then have a conversational day give me something damn it I mean think about like the BS right the B's are **** awesome",
            "start": 164.12
        }
    ]
}