{
    "id": 146,
    "video_id": "YhcauXSdtTU",
    "show_name": "A Conversation With Colin",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "How Time Travel Can Actually Work - A Converation with Colin",
    "description": "If we can ever time travel -- and Colin Moriarty thinks we're going to be able to -- where would you go?\n\nToday's topics were submitted by @HowieC30. Leave your suggestions for future conversations in the comments below.\n\nSUBSCRIBE/LIKE/SHARE\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nSubscribe to our channel: http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Tim for filming.",
    "published_at": 1382446819,
    "duration": 549,
    "transcript_chunks": [
        {
            "text": "Yeah , so I don't know. I think that we will be able to time travel. What's up, everybody? Welcome to A Conversation With Colin. I'm Greg and this is Colin. Now sometimes Colin says crazy stuff. So every Tuesday and Thursday, I reach into my random topic pile, pull one out, toss it at him, and we talk it out for your amusement. If you like that, like the video, share it with your friends, and subscribe to our channel. Colin, are you ready? Just took a dive there. He's going to get this toy squeaking again. Today's topic of conversation is if you could go to any point in history and wi it what would it be and why from Howie C30, the American Revolution. Now here's the question I have that we need to immediately address. Are we there in ghost form? Are we there like are can I just move? Well, you have to be there in ghost form. You're going to create grandfather exactly. I don't want paradoxes and I don't want to get shot or anything like that. Now this is what always confused me about grandfather paradoxes stick with",
            "start": 0.28
        },
        {
            "text": "form. You're going to create grandfather exactly. I don't want paradoxes and I don't want to get shot or anything like that. Now this is what always confused me about grandfather paradoxes. Stick with me for just a moment with you. If the the grandfather Paradox suggests that if you go back in time and kill your own grandfather that would erase you from the present, right? Right, because you wouldn't be able to be born, right? But space and time are intertwined with each other. Time is the fourth dimension, space are the other three dimensions and they go at the speed of light, right? Mhm. Like space like you know space expands at the speed of light. Sure, based on the explosion of the Big Bang. So if you went back in time then that time would go at the speed of light and never catch up with the present. Sure. So like why how like it would just be a separate timeline like how would it I see. I think that's where I go with it. I go much more in the Back to the Future way of that there'd be a separate",
            "start": 44.6
        },
        {
            "text": "sure. So like why how like it would just be a separate timeline like how would it? I see. I think that's where I go with it. I go much more in the Back to the Future way of that there'd be a separate alternate type timeline not that you do immediately erase, you know what I mean? Because that's the whole thing even Back to the Future toys around with that they slowly start fading away, right? Rather than just be gone or whatever. And then you know when they go back to the alternate 1984 where Biff had the almanac or whatever it's evil but they still get to go there and be there even though they never really explained why you don't see the other well Doc oh they do explain that. Well, this is why this is why time travel is tricky. See this is why Port relax you'll get the dragon or I'm going to punt you this dog on the next **** City Block, right? Okay, okay. So here's here's the thing this is why they don't think time travel going back is possible, right? Not only because of the paradoxes it inherently",
            "start": 79.2
        },
        {
            "text": "this dog on the next **** City Block, right? Okay, okay. So here's here's the thing this is why they don't think time travel going back is possible, right? Not only because of the paradoxes it inherently creates, sure, but that like it just how would you do it? Traveling to the future is very easy theoretically. Okay, you have to go faster than the speed of light. See like you create time dilation when you travel in space even, right? Right. P shut the light the lights all right. We got just give him the toy. I'll deal with the squeaking. Look at look at Chloe by the way she is not happy that the cat house is being attacked. She's like in a tower. Hey, I'm auding here. We're going to include the fact that time travel was submitted okay by CJ Ben CJ Bennett 777. No, I can't deal with this. Just throw him in the bedroom. I'll I'll kill Tom or I'll just stare at the camera awkwardly. Can I shut the door? Can I shut the door? That dog is a **** nuisance and a tyrant. Okay, you're back good. CJ Bennett 777 time",
            "start": 112.96
        },
        {
            "text": "the bedroom. I'll I'll kill Tom or I'll just stare at the camera awkwardly. Can I shut the door? Can I shut the door? That dog is a **** nuisance and a tyrant. Okay, you're back good. CJ Bennett 777 time travel in there. So now we're playing two cards in the same one time travel. If you go to history where would you go witness? So we'we've agreed we're back in ghost form. Okay, next question I have for you is how are we in ghost form? Is it like Scrooge ? Can I can I am I in charge of it? Can I ping around? Do I have different like cams that I can go to kind of thing? Well, this is this is this is the trouble, right? Well, it's a conversation we're answering it we're answering this go well I mean this is the trouble with traveling back in time. Mhm. Like you being you being in the in the past as yourself even in ghost form removes you from the present. Sure. So I'm still aging back there as long as I choose to say I don't know. I mean this is like this is why like the inherent Paradox the paradoxes in in",
            "start": 154.04
        },
        {
            "text": "in ghost form removes you from the present. Sure. So I'm still aging back there as long as I choose to say I don't know. I mean this is like this is why like the inherent Paradox the paradoxes in in time travel yeah are are problematic . This is like why when you if you travel in space and approach the nothing no matter can go the speed of light or faster than the speed of light that we know of, right? Uh only a photon can travel the speed of light at the speed of light you're tra like you start to you you you become like you time slows down I guess is what I'm saying like the faster you get so that when you come back to normal like if you if you were to travel and then come back to earth all this time would have passed but for you no time would have passed you know and so like everything is relative or whatever so time travel is interesting. I believe that you can travel forward in time but like it's a trick it's not like you're really traveling forward in time you're tricking the system in",
            "start": 209.88
        },
        {
            "text": "or whatever so time travel is interesting. I believe that you can travel forward in time but like it's a trick it's not like you're really traveling forward in time you're tricking the system in traveling forward in time. Got the way you travel forward in time is to leave and come back you know even if you like it's it's very minute but even astronauts are somewhat younger than than they should be in terms of Earth time because they travel to space. Gotcha. Okay, so traveling back in time would love to go to the revolution. I don't believe you can actually go back in time. Okay, but that's I would love to have taken part in the revolution but but that would create all sorts of paradox that would be yeah you're out there like an AK you're just like R his stuff from the back get off my land Red Coats. So are you going back and your head when if you could go back to the American Revolution you're jumping around right you're not just going to one specific battle and watching it un no I would love",
            "start": 254.88
        },
        {
            "text": "so are you going back and your head when if you could go back to the American Revolution you're jumping around right you're not just going to one specific battle and watching it un no I would love to go back to say 17 like to battle of Lexington conquered shot her around the world and start from there and go with them through time as as it was as it happened yeah oh wow like so like because you could observe things that you know are going to have like you're just an observer like I could figure out who shot the shot around the world was it the British was it was it was it a a minute man right and then we can travel and we know what's going to happen as long as we don't interfere the second you interfere they know you're there break that's why like I used to think one of the things I'm looking forward to when I go to heaven is that I'll be able to go back and see the stuff is Ghost Greg and I can bounce around to different things and see it from all the different angles like a DVD",
            "start": 297.2
        },
        {
            "text": "looking forward to when I go to heaven is that I'll be able to go back and see the stuff is Ghost Greg and I can bounce around to different things and see it from all the different angles like a DVD commentary or whatever like you know what I mean I choose the angle I'm looking at all this events from yeah yeah so I don't know I think that we will be able to time travel **** like us not us I mean human race how long we got on that one I don't think as long as you think I mean think think about about the exponential growth in technology right right it was only 50 years ago that we had mainframe computers not even 40 years ago we were still using mainframe computers right these gigantic tapeo tape **** computers that like would compute huge numbers it would take forever to do and they were there to like help scientists and mathematicians and government agencies and stuff in the in the mid 70s with the Xerox Alto and then like the Apple 1 and Apple 2 and the Mac and the",
            "start": 335.6
        },
        {
            "text": "do and they were there to like help scientists and mathematicians and government agencies and stuff in the in the mid 70s with the Xerox Alto and then like the Apple 1 and Apple 2 and the Mac and the IBM PC and all these things that was like a computer on your table right and that really proliferated in the late 80s or in the early 80s rather by the late 80s we had GUI and all these kinds of things and then the internet worldwide web was invented uh by CERN in 1993 and Al Gore invented the internet and like now we have iPads and iPhones and wireless internet and all of these CRA I mean like we have you have no idea how quickly this could happen you know like because everything is snowballing and becoming quicker and quicker and quicker and quicker yeah that you know so the singularity is near it's a it's a um actually a um a book that you should read about how game we should play too right uh well the the um the uh Quantic Dream demo for Kara yeah is based on the singularities okay",
            "start": 376.2
        },
        {
            "text": "near it's a it's a um actually a um a book that you should read about how game we should play too right uh well the the um the uh Quantic Dream demo for Kara yeah is based on the singularities okay okay and that's about how human like it's moving so fast and humans are actually going to merge with technology yeah like effect yeah somewhat yeah um so yeah with like the um what were Tes like the robots that they made you know what I'm talking about gu right um so so I think that like this is like it's theoretically possible like it could happen like we know how to do it yeah it's just a matter of like making it happen we don't know how to travel back in time okay you know so maybe wormholes or something like that and will we ever be able to travel the speed of light because that is impossible like right now maybe I don't know I think I think it's going to happen in more clever ways and uh we'll be able to move go to the Future and what happens when we go to the future I don't know I",
            "start": 416.2
        },
        {
            "text": "like right now maybe I don't know I think I think it's going to happen in more clever ways and uh we'll be able to move go to the Future and what happens when we go to the future I don't know I really think it's going to be like you're not I really think it's going to be like a system trick I don't think it's be like you're in the future you can go back I think like once you're in the future you don't go back you're stay there I think it's going to be like you left Earth in 2020 and you went a certain speed and a certain distance and came back and 10 years passed for you and 2,000 years passed for the Earth it's going to be like that you know what I mean yeah that'd be cool I mean it'be terrible obviously you come back that's the way it happens I mean that is that is the way we know that you could do it so like I think that is the way it will happen all right American Revolution time travel right that's a good thing sounds like a sounds like a **** novel that someone might you know",
            "start": 463.68
        },
        {
            "text": "you could do it so like I think that is the way it will happen all right American Revolution time travel right that's a good thing sounds like a sounds like a **** novel that someone might you know about the time travel you should work on it you should work how's your novel coming along on that novel yeah I am got a beginning it's got a beginning protagonist all right Stewie well that wraps up this conversation thank you for your time ladies and gentlemen especially CJ Bennett 777 and Howie C30 thank you so much for your questions if you want to have a conversation with Colin submit your topic in the comments below then like the video share it with your friends subscribe to us on YouTube we're back every Tuesday and Thursday but until then have a conversational day okay like so we could say yeah what if the British won then they would have had colonies in the new world I mean isn't that a fascinating story they subscribe subscribe and share um",
            "start": 497.88
        }
    ]
}