{
    "id": 14218,
    "video_id": "2fCFODV9OmM",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Andy Cortez",
        "Blessing Adeoye Jr."
    ],
    "title": "Summer Game Fest 2025 Predictions - Kinda Funny Gamescast",
    "description": "Go to http://kindafunny.com/XREAL to grab yours now!\n\nTime Stamps:\n00:00:00 - Start\n00:03:16 - Housekeeping\n00:07:21 - SGF Showcase Predictions!\n00:16:38 - Round 1\n00:33:00 - Round 2\n00:46:29 - Round 3\n00:55:49 - Round 4\n01:02:14 - Round 5\n01:09:05 - SuperChats\n\nWe’re here to talk about video game news!\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1748894746,
    "duration": 5170,
    "transcript_chunks": [
        {
            "text": "[Music] What's up and welcome back to the kind of funny games cast for Monday, June 2nd, 2025. Of course, I am your host Tim Gettys. I'm joined today by Greg Miller. Everybody mark your calendars. It's only 28 days to Tim's birthday. Blessing Eddie Ooey Jr. Good day, Tim and Andy Cortez. Good day, Tim. Good day to you all as well. Good week to you all. We are kicking off. Are we sitting in the wrong spot? We are. We wanted to see if we can figure it out. I sat down. So funny. Yeah. I was like, that's um weird. I'm over here. And then Andy sat down. He said, \"Greg's usually next to me.\" And then I was like, \"Well, it's Barrett's fault.\" And then Barrett tried to pass the buck to me. I'm like, \"You're in charge.\" You are in charge. It's your laptop. Just letting you know you're the director. If you're not directing people, what are you doing in there? You want me to move your laptop? I mean, if you want me to go over there, it's whatever. I don't know. You throw bless off his game. Look",
            "start": 6.26
        },
        {
            "text": "If you're not directing people, what are you doing in there? You want me to move your laptop? I mean, if you want me to go over there, it's whatever. I don't know. You throw bless off his game. Look at him. The thing the thing that tipped me off was the fact that I said I said good day to him as like the second thing and I was like, that's not right. That's not right. That's not how to all of this. And here comes the director to do his job. I think people might be switching seats. We'll see. Anything could happen here. Kind of funny. It's wild. It's how the magic happens. And oh my god, the emails have been hijacked. Are we switching or not? Damn. Barrett booked it. I liked that. No. No switch. No switch. Everyone remains. Everyone remains. We're turning over a new leaf. Remain calm. Andy, we're going to need you to redo the intro. Ah, thanks. Uh, this is a big week. Summer GameFest is upon us, as is the Nintendo Switch to launch. Of course, you're going to want to stay tuned to",
            "start": 52.48
        },
        {
            "text": "Andy, we're going to need you to redo the intro. Ah, thanks. Uh, this is a big week. Summer GameFest is upon us, as is the Nintendo Switch to launch. Of course, you're going to want to stay tuned to Twitch and YouTube all week here at Kind of Funny. Uh, today we're kicking off with our predictions to Summer GameFest. Tomorrow's Games Cast will be our Xbox predictions. Wednesday night, we're kicking off our 24-hour long Switch 2 launch party, uh where all night long, Mike and Rod are going to be playing um some of that Switch 2 and uh going straight into Thursday, starting games daily at 10. So, ideally, we're live from Wednesday night all the way through Thursday's content, which is pretty wild. Exciting times for everybody. Then, of course, Friday live reacting to Summer Gamefest. Saturday, taking a little break. Sunday, we'll be back reacting to the Xbox showcase. But, we're not talking about Xbox today. talking about Jeff Keley's show. We're talking about what he has up his sleeves",
            "start": 87.92
        },
        {
            "text": "taking a little break. Sunday, we'll be back reacting to the Xbox showcase. But, we're not talking about Xbox today. talking about Jeff Keley's show. We're talking about what he has up his sleeves and before we even went live, I was questioning what if he comes out on stage without sleeves and bless didn't like it. But Bless No, I liked it. I liked it too much. He did like it. He was saying he couldn't say what he was thinking because it was hot and bothered. I got it. I got it. But just can you imagine if Jeff came out without sleeves? I love it. It would just be such a such a like shock. You know what I mean? Summer. It's relaxing, you know? Yeah. Gamefest look. Yeah. Sunglasses, just a Hawaiian shirt, no shirt on underneath it. See, my reaction turns into should we find him help? Like, is there something wrong with Jeff? Like, is this a midlife crisis sort of thing if he didn't have sleeves? Yeah. On the Summer Game Fest stage. Yeah. Bear agrees with me. I mean, it's been real hot",
            "start": 130.08
        },
        {
            "text": "is there something wrong with Jeff? Like, is this a midlife crisis sort of thing if he didn't have sleeves? Yeah. On the Summer Game Fest stage. Yeah. Bear agrees with me. I mean, it's been real hot recently. What if it is he's wearing like a suit, but the sleeves are just cut off? Like, it's not like he's wearing That would be amazing. It's not like he's wearing a tank top. He just cut the sleeves off. Yeah. I don't know. Well, I'm not predicting that, but maybe somebody else will because this is our predictions episode of the Kind of Funny Games cast. And this is the Kind of Funny Games cast. Each and every weekday, we get together to talk about the biggest reviews, previews, and topics in video games live on YouTube, Twitch, and podcast services around the globe. If you love what we do, please support us with the Kind Funny membership. There's never been a better time to get it. Summer GameFest week is always full of super exciting stuff and a whole bunch of great content. If you",
            "start": 168.96
        },
        {
            "text": "please support us with the Kind Funny membership. There's never been a better time to get it. Summer GameFest week is always full of super exciting stuff and a whole bunch of great content. If you want to get that content ad free in an exclusive daily Gregway, you got to go to Patreon, YouTube, Spotify, or Apple Podcast to get the membership for a chance to be part of this show though. Submit your thoughts, opinions, and whatever else as YouTube super chats as we go. Today, I'm looking for your Summer GameFest Key Showcase predictions. Uh, let us know what you think will or won't be there, and we will let you know what we think about your prediction. Little housekeeping for you. Like I was saying, we're throwing a Switch 2 launch party on Wednesday going into Thursday morning. Uh tune in as we pick up, unbox, and play our Switch Twos for the very first time. We don't know exactly when this is starting yet, but assume around 7 or 8:00 p.m. uh Pacific time, right? 100%. Yeah, it's",
            "start": 205.12
        },
        {
            "text": "in as we pick up, unbox, and play our Switch Twos for the very first time. We don't know exactly when this is starting yet, but assume around 7 or 8:00 p.m. uh Pacific time, right? 100%. Yeah, it's either going to be right probably before 8:00 or right before 9:00. Yeah. Shout out to Roger who like probably watch a tutorial to get this look and like put it on every one of the aspects of the graphic. You want to do something a little different. You know what I mean? Like, let's just get out there. Let's like stand out, dude. Show up, show out. Uh, you had Games Daily already. After this Games Cast is going to be a banger episode of the KF podcast. Then after that is going to be a solo Andy stream playing a little Elden Ring Night Raid. Unless people join him. Who knows? Looking at him right now. Oh, me. Come on. I got to go to court. I got things to do. If you're a kind of funny member, Snowike might go big with this month's Patreon exclusive poster made by the incredible Panda Musk.",
            "start": 244.16
        },
        {
            "text": "now. Oh, me. Come on. I got to go to court. I got things to do. If you're a kind of funny member, Snowike might go big with this month's Patreon exclusive poster made by the incredible Panda Musk. Of course, it is a new month, which means it is a new exclusive Panda Musk poster. This is awesome. Uh, posing this question to Tim and Andy. Do you know what this like art style and vibe is pulling from? Do we know? No, but I like it. It's very different. I don't I love it. I love this art style from Patam Musk, man. Truly a chameleon. Yeah. M you know the the the Nitro Rifle poster was all Cowboys Bbop90s anime looking vibes. This is I I don't know what it reminds me of but it does it reminds me of maybe um the Cartoon Network show the little kid. He's got a little pointy hat. Um Adventure Time. Wizards of W. No Wizards. Wizards of Wy Place. Uh no no no. It's a It's a recent show that everybody lo everybody loves. It's like one of those Over the Garden Wall. Yeah. I [ __ ] love it. That's",
            "start": 287.76
        },
        {
            "text": "Wizards of W. No Wizards. Wizards of Wy Place. Uh no no no. It's a It's a recent show that everybody lo everybody loves. It's like one of those Over the Garden Wall. Yeah. I [ __ ] love it. That's the one. It kind of just he looks like a I don't know. Maybe I don't know the art style from that show as much as I thought I did. I said thank goodness you're here the video game. Ah, okay. People are saying Rocket Power. Yeah, I could see Rocket Power. I don't know if I see Rocket Power. Extreme exports, baby. I guess Rocket Power possibly. God. Rocket Power Reboot. I want to see what Otto's up to as an old man. He's doing good. Yeah, he's in jail. How many drugs has Twister done? Someone in chat asked, \"No mic on the stream.\" No. Shocker. He went to Florida and got sick. Oh, we got I was going to ask, but like the fact that nobody brought up his name in the last like 30 minutes of me being here, I thought something went wrong. I was like, you got to assume the worst. Homie, you got to you",
            "start": 337.52
        },
        {
            "text": "to ask, but like the fact that nobody brought up his name in the last like 30 minutes of me being here, I thought something went wrong. I was like, you got to assume the worst. Homie, you got to you got to mask up on a 5 and a half hour flight to Florida. Like that's a bad recipe for a lot of you when you go to Disney World 5 days in a row. I'm shocked he got sick. Today's Greg Way is Greg's 20-minute review so far of Fantasy Life. I, the girl who steals time. You What's so funny about 800,000 copies sold dominating the right face? Is this the one with the $2.50 upgrade? It is the one to Yeah, it is. I just freaking love you sometimes, Greg. Thank you to our Patreon producers, Carl J. Yeah. Is that really love everyone? Uh, Carl Jacobs, Omega Buster, and Delaney Twining. Thank you so very very much. Today we're brought to you by XRE. We'll tell you about that later. Let's start with the topic of the show. Summer GameFest predictions. We will be going around this table you are watching",
            "start": 384.24
        },
        {
            "text": "very much. Today we're brought to you by XRE. We'll tell you about that later. Let's start with the topic of the show. Summer GameFest predictions. We will be going around this table you are watching right now one by one each predicting one of five predictions that we are bringing to discuss today to see who is the most accurate who is the most brazen who wants to have some fun and who's just here to try to [ __ ] get some [ __ ] wins. They love winning. I'm looking at you. Bless me. I don't know the last time I won if I'm being real. Chad, let me know. Here's the thing. Before we get into our predictions, how are we even feeling about this? How are we feeling about Summer GameFest and predictions? There's too many things happening right now for me to really feel anything. Yeah. Like too much chocolate. I, you know, you all I can think about right now is Elder Ring Night Rain. And it doesn't even feel like it's happening at the end of this week with it doesn't feel like summer gamef",
            "start": 433.44
        },
        {
            "text": "much chocolate. I, you know, you all I can think about right now is Elder Ring Night Rain. And it doesn't even feel like it's happening at the end of this week with it doesn't feel like summer gamef is like that close in addition to the Switch 2 launch. There's just like I think you know what you know what it is. I bet you I'd feel that way if we were all going to SGF where I'd be like, \"Oh, I have a flight in the future.\" Yeah. And like that's that's always at the forefront of my mind. But I don't know. It just doesn't even feel like it's happening this week. And maybe that's like a little bit less hype on the showcase. Do you think it's the fact that we haven't heard anything about a PlayStation thing happening? Possibly. Usually we would have had a PlayStation state of play by now. Yeah. Yeah. Or at least no one's happening. Like that's the thing is this year it's like by this point literally the first week of June we would know when Nintendo is doing its thing when PlayStation's",
            "start": 484.48
        },
        {
            "text": "Yeah. Or at least no one's happening. Like that's the thing is this year it's like by this point literally the first week of June we would know when Nintendo is doing its thing when PlayStation's doing its thing when Ubisoft is doing its thing and now we know Ubisoft's not. Nintendo probably is not. They don't really need to even because they just had the April event and still rumors of PlayStation thing. I believe that's going to happen but like that would have happened last week in any other year. So, I think it's kind of weird that they're they pushed it seemingly. Embarrassing for you guys to overlook the breaking news from 20 minutes ago that IO Interactive to host IIO showcase featuring Hitman 007 First Light and Mind's Eye on June 6th. Mind's Eye. That's the night at that. It's going to be after Jeff Steel. Friday, June 6th at 6 p.m. They're getting their own their own little showcase in Iowa. Minds Eye, aren't they? Apparently. What's up with that game? What's going on with",
            "start": 526.08
        },
        {
            "text": "to be after Jeff Steel. Friday, June 6th at 6 p.m. They're getting their own their own little showcase in Iowa. Minds Eye, aren't they? Apparently. What's up with that game? What's going on with that? What the [ __ ] going on with that? Somebody figure it out. still part of Everywhere, which is but now it sound and Everywhere just being like uh kind of grown up Roblox in terms of what it's being pitched as essentially. But now they're like the broadcast will feature trailers, announcements, gameplay demos, and a live Q&A with figures from II Interact IO Interactive, build a rocket boy who makes minds and more alongside announcements pertaining to IO Interactive games lineup. Uh the studio also share a look at its proprietary game engine, Glacier. Uh, this event celebrates our 25-y year history with the Hitman franchise and shares an in-depth look at the diverse future of our studio, commented the CEO. We've prepared some truly exciting surprises. The II showcase presentation will",
            "start": 568.96
        },
        {
            "text": "history with the Hitman franchise and shares an in-depth look at the diverse future of our studio, commented the CEO. We've prepared some truly exciting surprises. The II showcase presentation will include new details for the following titles: Hitman World of Assassination with the Hitman franchise set to celebrate its 25th anniversary this year. Announcements regarding upcoming content for Hitman World of Assassination and collaborations around the Hitman franchise will be shared. Mind's Eye developed by Build a Rocket Boy and published by IOI Partners. Mind's Eye is a narrative-driven action adventure thriller and will be an everexpanding player experience. Doesn't that come out this year or this week with Oh, let me get there. With new studio created premium content delivered monthly, Mind's Eye will launch on June 10th, 2025. Oh, and James Burke's birthday 007 First Light developed by IO Interactive. 007 First Light. And isn't 007 like in his handles? one of those James Burke his",
            "start": 612.32
        },
        {
            "text": "Mind's Eye will launch on June 10th, 2025. Oh, and James Burke's birthday 007 First Light developed by IO Interactive. 007 First Light. And isn't 007 like in his handles? one of those James Burke his email or something. Oh yeah. Uh is the is the title of this highly anticipated James Bentric Week. I want you all to know that for the longest time until we bullied him into getting an adult email. James Burke's professional email was straight kill a dude 007. That's so good. Oh man, he's a a champion coach right there. Champion baseball coach. That's it. That's it. Yeah. So, it does say that changes 7 First Light set to be revealed this week. It ends at the end of its thing, which I think is interesting cuz that to me sounds like they're going to still do something before at Summer Game Fest. Absolutely. We got a trailer. We're going to [ __ ] predict spoilers. That's [ __ ] baby stuff. That's baby stuff. But I will say it's hard to predict this year because there is so much going on",
            "start": 652.32
        },
        {
            "text": "Absolutely. We got a trailer. We're going to [ __ ] predict spoilers. That's [ __ ] baby stuff. That's baby stuff. But I will say it's hard to predict this year because there is so much going on that I feel like we we have a lot of answers. I think because of Grand Theft Auto's delay, a lot of other people already kind of like threw things out there and now shifting around. I feel like we have the year fairly kind of set. Like we always go into this like what are the questions? What games need release dates? And there are a handful, but then there's all right cool what teams could possibly announce something. I don't think there's that many options for a Jeff level event, a summer gamefest level event. We've seen him level up in the past and last year I'd say that his game awards was the best showcase he's ever had in terms of announcements, but like with where right now it's like I I'm looking at my ideas for predictions here and I'm not feeling like this is going to be the biggest",
            "start": 704.64
        },
        {
            "text": "best showcase he's ever had in terms of announcements, but like with where right now it's like I I'm looking at my ideas for predictions here and I'm not feeling like this is going to be the biggest craziest one. So, I'm hoping y'all prove me wrong. Well, that's why we need everybody to click like on the video right now because this video will likely be a disappointment for everybody. Just click like to help us out is what I'm saying. Oh, throw us a bone. Yeah, throw a little bone. I've heard rumblings. Oh, through the through the grape vine about how it doesn't feel like there's a lot of people showing up at Summer GameFest like the event. Um like which one? The play days or like play days type of thing, right? Like I've had friends that are like you know looking around that are in the industry that are like yeah it seems like a lot of people are just doing their own thing. Like I I've talked about going to LA every week in the month of May and that feels like a result of people",
            "start": 749.76
        },
        {
            "text": "industry that are like yeah it seems like a lot of people are just doing their own thing. Like I I've talked about going to LA every week in the month of May and that feels like a result of people being like, \"Oh, let's do our own thing in May as opposed to going in like we don't want to pay Jeff to be part of his show or his summer play days. So yeah, we'll do this.\" Like I one of my friends called it um Maydays for what people are doing this month. Yeah. When we were talking about this earlier last week, I think when you mentioned this and were telling me just over the computers, I was like, \"Oh yeah, it's funny. I'd ever thought about the fact that everything we're sending bless every week to go see in LA is basically what judges week used to be, which is what Jeff used to run before we'd all go to E3. So, it's interesting that no one stepped up to do a judges week before SGF. Yeah. Yeah. Maybe we could do it, too. It could be awesome. We have a lot of free time, so we could",
            "start": 791.68
        },
        {
            "text": "we'd all go to E3. So, it's interesting that no one stepped up to do a judges week before SGF. Yeah. Yeah. Maybe we could do it, too. It could be awesome. We have a lot of free time, so we could totally tackle that. Get everybody together to see these DA games. So, I want Now, here's where I want to start, cuz you were I said you you asked me a great question. You asked me a great question. It was a good question. God, Nick, you know what I mean? Look at how many times did Gia grab your neck like this? Their tiny little hands. I am at a disadvantage before we even start. Okay. A disadvantage for these production. You know what? Same here. I know where you're going. I'm with you though. I'm with you. I was going to say because I'm go I'm going like I'm going to SGF play days for kind of funny while you all stay back to play Switch and and get ready for that and then react to Xbox and do all the amazing stuff we're doing. It sounded like you were framing that as well while you all get",
            "start": 826.08
        },
        {
            "text": "while you all stay back to play Switch and and get ready for that and then react to Xbox and do all the amazing stuff we're doing. It sounded like you were framing that as well while you all get to sit back and have fun. I got to go do the work. It's just the fact that I've been booking the appointments and taking the calls. So, I know so much I feel about SGF already where it's like this IO thing I just read like I've known about that for weeks. So, when we were doing it on the show and you were like, I wonder where they're going to reveal it. I went I emailed I was like, oh, this is in fact embargoed [ __ ] I can't say anything about this. So, it's like a weird one of what's out there and what isn't. So, I feel like my I feel like more than ever my predictions are going to be like or totally [ __ ] weird over the moon shitty. And for me, it's a similar thing. Not the same thing cuz I've not been booking events, but like for a weird reason, this is the summer. This is like the summer",
            "start": 866.16
        },
        {
            "text": "[ __ ] weird over the moon shitty. And for me, it's a similar thing. Not the same thing cuz I've not been booking events, but like for a weird reason, this is the summer. This is like the summer season that I people have told me the most announce. The streets have their mouths been wide open. Yes. They've been telling me everything. I don't know a damn thing. I'm pretty pumped. How do you feel? Do you know a lot about it? I mean, I've heard a lot of things, but I not necessarily that are going to be part of Jeff's show. So, or even things that aren't going to be part of Jeff's show, which I think is always the more interesting thing is like what's not there, you know? Um, but yeah, overall it's kind of just like like I was saying, I feel this is just a kind of whatever year because there's so many more exciting things going on for me personally where it's like, all right, cool. Yeah, Summer Gamefest is happening. The [ __ ] Mario Kart's coming out, you know? Like, I can't imagine",
            "start": 899.84
        },
        {
            "text": "so many more exciting things going on for me personally where it's like, all right, cool. Yeah, Summer Gamefest is happening. The [ __ ] Mario Kart's coming out, you know? Like, I can't imagine being Andy and also have an Elden Ring. Like, that I wouldn't be able to handle that. There's just too much stuff. It's amazing. It's a good time. Yeah. Yeah. Like I sw I I swear you you blink and suddenly it's 152 and you're like, \"Damn, 1:52 a.m. already. That's crazy.\" When we were playing it on Friday and I looked at the time and I saw that we played for 4 and a half hours, I was like, \"Where did that [ __ ] go?\" Well, it's cuz every damn run is 49 minutes. Yeah. We lost like three runs in a row last tough. It's so tough. Maybe you should go tell some of those reviewers who are [ __ ] sandbagging this thing in 80 right now. your support because you only have 10 points. What the [ __ ] The fact you did. You all did. I know. It was a choice. First round pick. Elden Ring. It's got the name.",
            "start": 938.96
        },
        {
            "text": "this thing in 80 right now. your support because you only have 10 points. What the [ __ ] The fact you did. You all did. I know. It was a choice. First round pick. Elden Ring. It's got the name. It's got the juice. I want to get into our predictions. And I want to start with Andy Cortez. Oh [ __ ] Well, let me get to the Let me get to the prediction that I feel like all of us are going to have a variation of cuz it was already talked about on Games Daily today. IO Interactive, James Bond, Jimmy Bond, he's a child now. It's a prequel. So, Chibi platformer. We obviously they're going to show off the gameplay blah blah blah. But actor walks out on stage and the variation I'm hoping everybody has is like, let's all have an actor of who it's going to be. I think it's going to be Nicholas Hol. No way. Lex Luthor. Yeah. I think Nicholas Holt is going to be the You don't cover up the face unless it's like a name of some or Robert Pansson, but the head pick one. You got to pick one. The head",
            "start": 976.32
        },
        {
            "text": "No way. Lex Luthor. Yeah. I think Nicholas Holt is going to be the You don't cover up the face unless it's like a name of some or Robert Pansson, but the head pick one. You got to pick one. The head shape didn't look like Robert Padson, so I'm going to go with Nicholas Holt. I've looked at Robert Panson's head a lot. Yeah. Yeah. Yeah. And Expedition 33. Yeah. Absolutely. Yeah. So, he walks out there. Obviously, they show it off and it's a big deal and and then everybody celebrates me for getting it right. Nicholas Hol. Yeah, I I don't see it. I like where your head's at. He's just been so in the running. It's like if there's another actor that has been talked about close to Idris Elba for who should be James Bond, it is always Nicholas Hol. No, but Erin Taylor is I'm not saying it's him. He was Craven, you know, uns kickass. So that's my prediction. Okay, go down. I think we should all just go down who the actor is going to be. Everybody has an actor. Here's the thing. Barrett, can",
            "start": 1030.4
        },
        {
            "text": "He was Craven, you know, uns kickass. So that's my prediction. Okay, go down. I think we should all just go down who the actor is going to be. Everybody has an actor. Here's the thing. Barrett, can you bring up the picture of James Bond himself? Barrett's convinced it's Josh. Joshua Peek, which I love, but I don't I'm not serious about that. I have a very unserious answer, but it I think it still might be my answer. It It doesn't make sense, but I'm going to say Tom Holland. How does that make sense? He's just too He's too famous. He's too expensive. You know what I mean? But like I I it's the beginning though. It's all it's brand new. A Christopher Nolan movie in the 10,000 Avengers movies the next two years. But here's my thing, right? I say Tom Holland because in my brain I'm thinking of a Tom Holland like actor. I need somebody who's young, somebody who's in their 20s, somebody who's popping. You know what I mean? Like somebody who's British. Timothy Shalom. And Timothy Shalom was",
            "start": 1085.12
        },
        {
            "text": "a Tom Holland like actor. I need somebody who's young, somebody who's in their 20s, somebody who's popping. You know what I mean? Like somebody who's British. Timothy Shalom. And Timothy Shalom was the other option. I was like it's not Timothy. This head is too long vertically. Yeah. But I don't I don't know. Lots of good theories about that. Charlie Cox voices Robert Patson in in Expedition 33. It doesn't mean that they uh it's like exactly their scan or whatever, right? But they're hiding the face, but you're Yeah, you're hiding. I think it can be anybody. And that's my thing, too, because we can't hear an image. Anybody can wear That's my other thing, too, is like I think if it's Tom Holland, I don't think necessarily that he's the voice actor. I think he's just the face. Oh my god, that sucks. Timothy suck. But like I don't know. I So here's the thing, right? Cuz there's somebody in chat that was like, \"He's too young.\" And that is the point of this James Bond. This is a younger",
            "start": 1132.32
        },
        {
            "text": "sucks. Timothy suck. But like I don't know. I So here's the thing, right? Cuz there's somebody in chat that was like, \"He's too young.\" And that is the point of this James Bond. This is a younger James Bond. This is sort of a James Bond origin story. So I'm like trying to lean younger for who the actor could be. And Tom Holland is the first person that comes to mind. I'm sure it is. Bless. It always is. It is. I made my prediction on James Daily. I'm sticking with it. Rahul Kohley. That's who this James Bond is. Uh I like the argument we had out there. Of course looking at this many like come on now. The the silhouette and I was like well it's golden light so maybe the person isn't a Caucasian. And then also there was this conversation that Barrett brought up that I thought was brilliant of maybe that's the bad guy. Maybe they're really turning it on its head and giving you something. You know, this is all they're doing is giving us this to get excited about and get off to the races.",
            "start": 1170.0
        },
        {
            "text": "of maybe that's the bad guy. Maybe they're really turning it on its head and giving you something. You know, this is all they're doing is giving us this to get excited about and get off to the races. I love that idea. Or the other brilliant idea, face scan you face. That was a bad We said that was a bad idea. Face scan your face and your underground [ __ ] Damn. Or maybe maybe it's Dan Stevens. Do you know Dan Stevens? Of course. The head shape. But I also see that head shape and I think of Jim Halpert. Sure. Krinski, if you bring up that image again, Barrett, it looks like Jim Halpert. It does. The ears shape, the ear the the length of the My prediction is it looks like Jack Ryan when he plays Jack Ryan. You know, Reacher, who does he play? He plays Jack Ryan. Yeah. Jim Halpert. Yeah. Yeah. The bomb is in play. That was a Ben Affleck movie, but it's the same thing. It wasn't the Russians. I will say we're talking about a lot of like bigger actors. I do wonder if there's like a weird",
            "start": 1206.4
        },
        {
            "text": "The bomb is in play. That was a Ben Affleck movie, but it's the same thing. It wasn't the Russians. I will say we're talking about a lot of like bigger actors. I do wonder if there's like a weird trepidation maybe Hollywood actors have about playing James Bond in a video game like almost like they're like kind of like getting around like going through the official channel being cast in like a movie or something like that. So I wonder if they did keep it to more of a bigger video game actor like we were saying earlier on Games Daily. Yeah. I I predict that it's somebody that we don't know. Like even if it was like a video game voice actor that we know, I don't think it's one of them. It's the name we're gonna be like, \"Oh, we're learning that name for the first time.\" Jack kind of cooking with Andrew Garfield. Always a guy in anything. Jack Quaid. That was Dan Stevens skull. You can't. Or Jim Halpert. Jack Quaid is inspired. Yeah. And he could and would do it. Is he doing a British",
            "start": 1251.2
        },
        {
            "text": "with Andrew Garfield. Always a guy in anything. Jack Quaid. That was Dan Stevens skull. You can't. Or Jim Halpert. Jack Quaid is inspired. Yeah. And he could and would do it. Is he doing a British accent? You'd have to. I'm sure he'd nail it. What if it what if his parents were British? He's just like, \"But he lived in America.\" Yeah. Yeah. It's a new origin story. Yeah. Yeah. Yeah. Is is James Bond is like always the same character, right? Like between the different actors, it's the same guy. So, I do like the idea he has an American accent and then just somewhere along the way he was like, \"Fuck it. I'm stop I'm stop talking normal.\" There's fun theories about that though of like 007 just being the title and like J like that it is that Shan Connory is James Bond did die cuz what I'm not the James Bond guy but it's what uh Q like has been the same until they died like they those people cycle out title so it's just a title. I like that a lot. I think that's cool. Yeah. In the most",
            "start": 1293.12
        },
        {
            "text": "not the James Bond guy but it's what uh Q like has been the same until they died like they those people cycle out title so it's just a title. I like that a lot. I think that's cool. Yeah. In the most recent one, no spoilers but they're like you know they got the 006 up and they take the mantle or whatever. Yeah. And uh um freaking Well, no spoilers. We know it's James Bond, though, right? We know it's James Bond. Okay. Yeah, actually I think we know it's You get renamed as James Bond. It's like when the Pope gets a new pope name. I mean, it's the same thing. Yeah. Uh let's move on. It's blessing. Oh, for an actual prediction prediction. Yes. I mean, my prediction is actually Rahul, so don't worry about that. That's one. Count it. All right. Where do I want to start? Where do I want to start? Do I want to start big? I'll start big. You're going to get a big PlayStation thing. Oh, PlayStation always shows up at Jeff's events. Sometimes with big old new games, sometimes the smaller ones,",
            "start": 1339.6
        },
        {
            "text": "Do I want to start big? I'll start big. You're going to get a big PlayStation thing. Oh, PlayStation always shows up at Jeff's events. Sometimes with big old new games, sometimes the smaller ones, right? Sometimes some sometimes you might get a Last of Us remaster. Sometimes you might get a Horizon Lego game. For the game that they're going to announce at SGF, it's going to be the God of War Greek game. It gets announced here. It is a prequel that is set in Greece. And I would compare it to something like the Assassin's Creed Chronicle games. Uh you're getting a 2D action platformer. Maybe something akin to Prince of Persia: The Lost Crown. Get me my points. Get me my Fantasy Critic points. Please let this be real. I mean, is it going to come out this year? And you pitch the 2D thing. It's like you'll be like people can get real mad. Big mad. I mean, you lead off with it, right? Like for me, it's the similar thing of a Horizon getting a Lego game. Yeah. Just don't hide it. Don't act",
            "start": 1385.84
        },
        {
            "text": "like you'll be like people can get real mad. Big mad. I mean, you lead off with it, right? Like for me, it's the similar thing of a Horizon getting a Lego game. Yeah. Just don't hide it. Don't act like you're getting a God of War thing and then reveal. Yeah. like you know if you jump on it it's like um Cory Barlo being like oh we're working on a new 2D God of War game and then like then reveal it like for impressions what the [ __ ] was that we're working on a new 2D classic my brain and then like cuz that's the type of game that feels when it's being showed off that you're like oh this can't be real and then it zooms out and it's a TV screen of Nathan Drake playing a God of War video game. Like it I just don't I I'm kind of with Tim. I feel like people would be so mad if like the new God of War entry, which isn't the new God of War entry, but to have it be a 2D Satirl, it would be fascinating. I still come back to the thing of I think you need more games to come out. It's",
            "start": 1432.64
        },
        {
            "text": "the new God of War entry, which isn't the new God of War entry, but to have it be a 2D Satirl, it would be fascinating. I still come back to the thing of I think you need more games to come out. It's PlayStation, right? Like video the big entries in these franchises take so long to make and six minimum. Yeah, like six years minimum to make, right? And I think you want something in those in between spaces. Do you want to add something juicy to this prediction? Cuz Andy has a good point of like if you announce this new God of War title, what have you, people are going to be kind of weird about it. People who are in the know aren't going to be, but a lot of normies out there, right? Going to be weird about it. Do they launch it for free as DLC with God of War Ragnarok just like they did Valhalla? No. No. Cuz it's too different of a game, right? Like I feel like that would be weird to do it as a DLC kind of thing. I think it's standalone. It probably costs less, right? Maybe like 20 to",
            "start": 1483.36
        },
        {
            "text": "No. No. Cuz it's too different of a game, right? Like I feel like that would be weird to do it as a DLC kind of thing. I think it's standalone. It probably costs less, right? Maybe like 20 to $30 depending on what this looks like, right? It could be a really good ass 2D thing that maybe you're charging $40 to $50 for it, but I think it's standalone for sure. Maybe it's free with PS+. So crazy that Valhalla was free. That's Yeah. What a good chunk of video game. It's weird with the Bless I'm with you that PlayStation shows up, but like with the rumors of a state of play that does complicate this a bit, but I feel like PlayStation years in a row. Yeah. Yeah. Yeah. So, I don't I think the God of War thing, even if it is a 2D thing, which I'd be stoked for, is too big for this type of of thing. Have you said that game of year game game awards 10 year anniversary they did have intergalactic like they pulled that off and like year before that they announced the Valhalla at the game awards",
            "start": 1522.96
        },
        {
            "text": "Have you said that game of year game game awards 10 year anniversary they did have intergalactic like they pulled that off and like year before that they announced the Valhalla at the game awards thing. Yeah. You want I can jump off that if you want. Don't for a notch. You want something more PlayStationy since they'll be there. They're confirmed. They're on the My whole thing's based on parters. Exactly. Exactly. PlayStation will show up and what they'll do is say, \"Here's a new Astrobot World releasing right now and it'll be summer themed.\" Love that. Oh, cute. Yeah. Just like they did that holiday one they did. Yeah. Go out to the beach, have, you know, jump on the lawn chairs and all that jazz. Oh, the Final Fantasy characters finally in it. No, too big. Too big. That's too big. They wouldn't do that. Yeah, I think they will be. Okay, I do. Maybe it'll be the Persona 4 folks in their outfit from the beach. Bear nose. I think they're already in there, but in their beach outfit is",
            "start": 1566.96
        },
        {
            "text": "wouldn't do that. Yeah, I think they will be. Okay, I do. Maybe it'll be the Persona 4 folks in their outfit from the beach. Bear nose. I think they're already in there, but in their beach outfit is Oh, but you want the Astrobots in the beach outfits. I mean, they're the Astrobot Persona 4. I feel like that's just tough to do, you know? Oh, no. Are you acceptive things? Are you accepting Tim's tack on like add-on thing of Final Fantasy characters being there? Cuz if you do accept that in the official rule book, that is extra two points if it is true. No, I'm rejecting it. I don't want that. Are you So you're saying for sure that's not going to happen? Yeah. So if you're saying if you're wrong about that, you don't get any points. Um well, I guess I'm going to start with the big crazy one because we are talking about Final Fantas. Will Final Fantasy 7 remake 3 be announced here? Probably not, right? But you start to look back at some dates and it starts to paint a little picture here,",
            "start": 1608.24
        },
        {
            "text": "because we are talking about Final Fantas. Will Final Fantasy 7 remake 3 be announced here? Probably not, right? But you start to look back at some dates and it starts to paint a little picture here, boys. Let me take you on a journey. Oh [ __ ] I thought he had like I thought he was going to have like a video package prepared or something. Remake came out on April 10th, 2020. And then a year later in June, Remake Ingrade came out. All right. The like DLC, the expanded like nextg version and all that stuff, right? One year after that, we got the announcement of Rebirth. All right. Yeah, I'm with you still. So, where we're at now, since we know we're not getting DLC for Rebirth and everything that the director has said is that we are closer to three than two was to one, this June would be, if following the pattern, an acceptable time to announce this thing. He's they have been at all of the Jeff Keley shows in recent years, multiple times, coming back with Rebirth, right? It's not out",
            "start": 1655.2
        },
        {
            "text": "if following the pattern, an acceptable time to announce this thing. He's they have been at all of the Jeff Keley shows in recent years, multiple times, coming back with Rebirth, right? It's not out of the realm of possibility. What is more likely than actually finally announcing it's coming to Xbox and uh you know we already know that it's coming to to remake at least is coming to Switch 2. They have said that the series is coming to Switch 2. We do not have a date. So I do think that there is a possibility in the prediction that I'm going to put down because [ __ ] it, I'm feeling spicy. we get the date for remake on Switch and um I think that we will get the announcement of the the name of whatever the third one is. Maybe a tease or whatever, but the name is the thing that I think will be announced. I Damn, that's really good cuz I think the way that you sort of play it out, the way you structure this reveal Yeah. is you do you show Final Fantasy first and you get everybody go, \"Oh",
            "start": 1704.96
        },
        {
            "text": "be announced. I Damn, that's really good cuz I think the way that you sort of play it out, the way you structure this reveal Yeah. is you do you show Final Fantasy first and you get everybody go, \"Oh [ __ ] they're showing off the third one.\" And then it's like, oh, it's just this is just them announcing it's coming to the other platforms. God dang it. Okay, we got our hopes a little too high. Pivot [ __ ] you know, 180 360 no scope and then they go, but also you you get like a little piano playing or whatever the [ __ ] Oh man, that would be so cool, too. And Andy, I don't know if you remember the last time they did that, but it was when they announced Rebirth and they it was their remake of Crisis Core and then it was like but also and then it was Rebirth. So, uh, I I think that it it we're on the earliest end of this being possible, but it is entirely in the realm of possibility of being announced at this event. And I think that Final Fantasy 7 remake part 3 is less sacred of an",
            "start": 1754.72
        },
        {
            "text": "we're on the earliest end of this being possible, but it is entirely in the realm of possibility of being announced at this event. And I think that Final Fantasy 7 remake part 3 is less sacred of an announcement than the other two. I think that we are we're we're here. You know what I mean? Like, we know it's happening. We believe it's going to come out in a timely fashion because they've now proven that over the last couple years. And we've heard plenty of reports that over the last year or so, not even just reports, just straight up from the dez being like we are on such we are in such a rhythm right now. Like we have Unreal 4 working at like the the best it can be right now. All of us are just in a rhythm right now and they're just kind of like cooking exactly what the end of this game is. Now, right here, I want you to do this. Mhm. Give We've done a bunch of these guesses before. Final Fantasy 7 colon blank. What's it gonna be? So re make had its final song when you face Sephro",
            "start": 1799.76
        },
        {
            "text": "is. Now, right here, I want you to do this. Mhm. Give We've done a bunch of these guesses before. Final Fantasy 7 colon blank. What's it gonna be? So re make had its final song when you face Sephro was called one-winged angel rebirth, right? Okay. Rebirth was then called Rebirth. Rebirth's big song ended with there was two which makes it complicated. One winged angel reborn. Oh [ __ ] M and Aerys theme return to the planet. It's return. Return is what I think is most likely. I like Reborn though. Rebirth. Reborn. Yeah. Good point. Good point. Good point. Good point. It would have been I mean they just earned it. They really [ __ ] wasted reunion on crisis. I know. It just was such an unforced error. I feel like after the fact, six months after the game came out, they're like, \"Damn it, we I was right. We should listen to Yeah. it it and reunion has been like a core thing in Final Fantasy 7 lore forever. Like that's the entirety of uh Advent Children. So yeah, it is weird they used it",
            "start": 1841.92
        },
        {
            "text": "I was right. We should listen to Yeah. it it and reunion has been like a core thing in Final Fantasy 7 lore forever. Like that's the entirety of uh Advent Children. So yeah, it is weird they used it up and I don't think they'll use it again. Um other ones people have talked about are uh reclaim um or resurrect which would if they called it Final Fantasy 7 resurrect. People would go insane like absolutely the theories would break people you know but I don't think that they have the balls cuz I don't think that they resurrect say would be some weird [ __ ] you know. Barrett, where you at with it? Uh, Resurrect would drive people insane, especially my personal roller coaster with Rebirth and what Rebirth did and what it chose to do and not do and that whole connotation of the first two games of what it wants to do differently and what it wants to do the same and being stuck in the weird middle. If they called it Resurrect, Jesus [ __ ] Christ, man. No. Please, no. I'd be [ __ ] hyped.",
            "start": 1904.08
        },
        {
            "text": "of what it wants to do differently and what it wants to do the same and being stuck in the weird middle. If they called it Resurrect, Jesus [ __ ] Christ, man. No. Please, no. I'd be [ __ ] hyped. You have any thoughts? No, it sucks they don't have they can't do reborn or rebirth. Reborn. Reburn. Reburn. Reburn. Reburn. Your speakers are not malfunctioning right now. Andy Cortez. What's your next one? Oh gosh. I mean, you know, so many. You know, there's a lot of obvious ones, but I want to get a little want to get just a tiny bit horny. Not like too crazy. Um, Yach Club's going to be there. Yeah. And everybody assumes Mina the Hollower will be there. I think we get a look at Shovel Knight 64 or whatever this 3D thing is going to be. We've for the past couple years they had already put up looking for 3D artists uh on, you know, job searches on LinkedIn and all that uh sort of stuff. I think we finally get the first look at it. It's going to be me and the hollow first with the release",
            "start": 1952.24
        },
        {
            "text": "looking for 3D artists uh on, you know, job searches on LinkedIn and all that uh sort of stuff. I think we finally get the first look at it. It's going to be me and the hollow first with the release date, you know, and oh [ __ ] finally this game's coming out. We know when it when it's coming out, and then you get the glimpse uh at that little cute boy in that freaking blue suit, Mega Man. Uh yeah, I think it happens. I think we finally get a look at it. Is it called Shovel Knight 64? I don't know. That's like we've just kind of internally been calling that's like our code name obviously around the industry. Us '8s Chad. Well, it's just like, you know, no, it's just when you hear that they are making a 3D game or you assume they are making a 3D game and I think they even kind of confirmed that on their little showcase whenever they had the uh showing off kind of a the road map of everything. It was like a 10 year anniversary sort of thing or whatever. Um, yeah. I I think it happens",
            "start": 2012.48
        },
        {
            "text": "that on their little showcase whenever they had the uh showing off kind of a the road map of everything. It was like a 10 year anniversary sort of thing or whatever. Um, yeah. I I think it happens here and it will not be in Yuka Replay or whatever this Yeah. Replay. Yeah. I uh I don't know that we ever see that the the Shovel Knight 3D game. Like I don't think that that actually makes as much sense as us playing the game be like, \"Oh, yeah. Imagine.\" I just feel like their skill set is so for Shovel Knight specifically in that 2D world. I think that we would sooner get a Shovel Knight too, like full on actual just sequel. um just because I I feel like there's higher potential for it to sell and like be good as well. Like the the space of the 3D platformer I think is uh has leveled up so much in the last 10 years of like it better be [ __ ] Astrobot if you're putting something out out there or else I just feel like it's not going to have that same level of like oh [ __ ] But also Y",
            "start": 2057.2
        },
        {
            "text": "much in the last 10 years of like it better be [ __ ] Astrobot if you're putting something out out there or else I just feel like it's not going to have that same level of like oh [ __ ] But also Y Club have done incredibly impossible things. So but I do think Me of the Hollow was there with a date. Yeah. This year. Yes. Cuz I need that. This critic needs it, baby. Yeah. What do you think, Bless? Do you think we're seeing Shovel Knight 64? I don't know. I don't have much of an opinion on Shovel Knight. I'm weirdly like I've never gotten around to like really experiencing Shovel Knight like that. Um, which is funny because it would be my type of [ __ ] but like I think it'd be cool, right? Like I think as far as would a Shovel Knight 64 excite me like for sure as somebody who's way more into like a 3D platformer type experience. So like I'd want it to happen, but yeah, I don't know. I don't have any big opinion on it. I think also uh Mean of the Holler, I would expect to see more from",
            "start": 2106.8
        },
        {
            "text": "like a 3D platformer type experience. So like I'd want it to happen, but yeah, I don't know. I don't have any big opinion on it. I think also uh Mean of the Holler, I would expect to see more from that than we see before we see like a big brand new game. Yeah, I'd be hyped to see a 3D platformer for sure. Oh, yeah. I just I I think it's uh unlikely. I just like who are they hiring? Wh why were they looking for 3D artists? That's I can't get my mind away. Counted hours. Bless. Yes. Persona 4 rerun is happening. It gets announced. It gets a year. It's coming out in 2026. It features all of the English uh cast. All right. So, you have the return of Yuri Loenthal. You have the return of They said they weren't going to be there. They did. They said they weren't going to be part or returning for the Persona 4 remake. And that's because Rerun isn't a remake. Rerun is way more of a large almost like a retool re-imagining, right? I would rebirth a reunion. A rebirth, a reunion. No, they're",
            "start": 2146.8
        },
        {
            "text": "for the Persona 4 remake. And that's because Rerun isn't a remake. Rerun is way more of a large almost like a retool re-imagining, right? I would rebirth a reunion. A rebirth, a reunion. No, they're going in and like I would say there this is a golden/ um royal style. Like we're going in and like being additive to this game and also retooling uh quite a bit of this game to modernize and stuff similar to what they did with Persona 3 Reload. But then also at the same time, I think they're going to go in and add new story beats slashedit certain story beats like heavily edit certain story beats. They need to because they need to because as much as I love Persona 4 Golden, it's like a top 15 game of all time for me. that game also has certain character arcs that are very homophobic and very problematic. And so I think this is their chance to go in and make that stuff right. And also like I think treat this as a bigger thing as far as like it not just being a remake, it being another step",
            "start": 2191.2
        },
        {
            "text": "And so I think this is their chance to go in and make that stuff right. And also like I think treat this as a bigger thing as far as like it not just being a remake, it being another step forward for the Persona 4 story, which gets hype because when you look at the voice cast, right, like we saw the tweets from uh Yuri Loenthal and Aaron Fitzgerald, but then you look at like who's played by, I believe, Matt Mercer, right? originally and then Matt Mercer picked up for the animation and then uh Persona 4 Arena I think. Yes. And so like I think a remake of Persona 4, at least on the English side, has a lot of potential to like really lean on the voice cast to like hype this up and make this a big release. And have you noticed uh I think it was Mike Manady uh who had this pointed out to him and he posted that the order in which the actors have posted is the order in which you get those party members uh in the game which yeah it feels like this is a very weird marketing ploy uh somehow um",
            "start": 2238.4
        },
        {
            "text": "he posted that the order in which the actors have posted is the order in which you get those party members uh in the game which yeah it feels like this is a very weird marketing ploy uh somehow um it is unfortunate though cuz you completely lost that point. Plus this was the wrong show to make that prediction for. You think it's happening at Xbox 100% because that's where Persona 3 Reload was announced. I mean, that's fair. Yeah, I thought about the thing against that for me and I I I'm still my money's on Xbox. The Xbox showcase can only have so much. Like that's the problem is like now that they own so much like having partner things I think is going to be like they need to put them somewhere else. So that's my only thought process on maybe we see it at Jeff's show. But yeah, I can see I mean I can see it happening at um either, right? Like I understand the leaning towards Xbox because of the Persona announcements we got last year. I think for me I'm like all right how ongoing is",
            "start": 2283.84
        },
        {
            "text": "I mean I can see it happening at um either, right? Like I understand the leaning towards Xbox because of the Persona announcements we got last year. I think for me I'm like all right how ongoing is that agreement partnership is that a thing that it's like all right as Xbox we want to really lean into Persona for the years to come or if was it just that moment of the thing no matter what like this is a prediction for the next week but I guess yeah SGF is the SGF prediction show it's going to happen yes Gregory can I just uh get in real quick um at the end of the Yach club game presents from June 14th, 2024, almost a year ago now, says uh all the they said that they are working on a new brand a brand new shovel night adventure that takes the game to a new dimension. Another dimension dimension. There you go. Maybe you're right. Third one. 40 shaking. The Nintendo Switch 2 arrives this week, one day before SGF. While we have been excited for Nintendo's latest foray into console",
            "start": 2328.16
        },
        {
            "text": "dimension. There you go. Maybe you're right. Third one. 40 shaking. The Nintendo Switch 2 arrives this week, one day before SGF. While we have been excited for Nintendo's latest foray into console and/handheld gaming, what is this? What's he doing? We have all saw the camera. We have all said over and over and over again, where is it? Where is it? Where is it? No, this will be the show where Nintendo announce that Animal Crossing is in fact getting its little free update for the Switch. Why not? And let's have some fun out there. Nintendo Switch 2's on there. Give him something big. Give Jeff something big. Give him something big. Give him a big thing. Let him have his big thing. Jeff, do you want a big thing? Give him something big, man. Don't wear short sleeves. Don't wear long sleeves. Wear no sleeves. This is my pie in the sky dream. I know it won't happen. I know the new New Horizons will not get it switched to announcement there, but I'd like to dream. I thought you were going",
            "start": 2378.8
        },
        {
            "text": "Wear no sleeves. This is my pie in the sky dream. I know it won't happen. I know the new New Horizons will not get it switched to announcement there, but I'd like to dream. I thought you were going to bring a hollow of of Silk Song. Yeah, I thought you were going to say Silk Song as well. No, no, no. I don't care about cuz you kept saying like we keep on wondering where it's at. I'm like me and Joey keep on wondering where it's at. Why are all these other games getting enhanced Switch 2 editions? We're getting free updates for little ones. And you just preface it like as if you know the whole industry is clamoring. They are. It's me and Joey. That's 20% of the company. What else do you want from us? You say no. What What is your reasoning here? We're just not going to get anything because we're a year, two years away from a new Animal Crossing. My reasoning is I think that the small handful of games that are the most obvious important Switch games that don't have the enhancements yet",
            "start": 2435.68
        },
        {
            "text": "we're a year, two years away from a new Animal Crossing. My reasoning is I think that the small handful of games that are the most obvious important Switch games that don't have the enhancements yet are going to get Switch 2 editions with more content. Smash Brothers, Animal Crossing, like this is a good thing, I think, cuz it's not just going to be it runs a little bit better. I I don't know. I mean, I feel like I would not be surprised if the next the next direct like that's the next real direct like not a partnership or whatever. I I imagine that they they'll do that because this year's just already packed with like the game releases and they're treating the Switch 2 editions as if they're new titles. So, so far like almost every month has one with Kirby and Mario Party and the two Zeldas. So, there are some open months that I do think would be very nice for a Animal Crossing New Horizons plus [ __ ] Yoshi's World. You know what I mean? Some something like that. Um, all right. I'm",
            "start": 2474.4
        },
        {
            "text": "So, there are some open months that I do think would be very nice for a Animal Crossing New Horizons plus [ __ ] Yoshi's World. You know what I mean? Some something like that. Um, all right. I'm going to stick with my kind of like uh unlikely predictions, but I want to believe and I I think it is time and I think it's inevitably going to show up somewhere within the next year. So, why not here? Mobile versus Capcom's been gone a while. New games, but it did come back recently and everyone's all stoked. The brand is not dead. However, I unfortunately think it kind of is. I think we get a Capcom fighting game. Oh, but I don't think Marvel is involved. Interesting. But I think it is in the style of a Marvel vs. Capcom. Huh. You don't think it's Capcom versus another brand? I think it's just a Capcom versus game. I think they have enough IP and enough brand and it's been a long enough time that we haven't seen all those characters fight. And it's not necessarily the most exciting thing",
            "start": 2515.44
        },
        {
            "text": "a Capcom versus game. I think they have enough IP and enough brand and it's been a long enough time that we haven't seen all those characters fight. And it's not necessarily the most exciting thing cuz I think that a lot of people want that Marvel. But I think that this is kind of a step towards proving, hey, we can do the fun crossover thing and make it actually work again. And then the next step would be bringing back the Marvel side of it. Bring back the Marvel side in order to kind of prove themselves. Prove themselves with the Capcom fighting game that they they still got it outside of Street Fighter. And you know what I mean? This in terms of the crossover type fighter and then the next game being a Marvel vs. Capcom, maybe even like straight up calling it a Marvel vs. Capcom 4. I'm going way bigger with it. I I think that they are including uh the MCU and the rest of Disney. Oh, wow. Wow. Versus Disney. Yeah. Disney's so on board with fighting games. Yeah. Um 3D style or",
            "start": 2569.76
        },
        {
            "text": "4. I'm going way bigger with it. I I think that they are including uh the MCU and the rest of Disney. Oh, wow. Wow. Versus Disney. Yeah. Disney's so on board with fighting games. Yeah. Um 3D style or unfortunately. Yeah. You know, I I vastly prefer the old school pix pixel art. I don't think that we'll ever see that again. And I think that we're lucky that we got the uh ports of the the classics as well. So, I'll be happy with that. You mentioned they got a bunch of IP. Now, what who would who would you really pop off for to see in this trailer where they're fighting Ryu? I don't know. But I feel like get Monster Hunter involved. Get like just get like more like modern when we think of Resident Evil. Just they look like the remake versions. Like things like that, you know? I just feel like we're due for like what is the state of Capcom at this point? We've loved Capcom the last 10 years and I feel like that wasn't the case really going into Marvel vs. Capcom Infinite and Oni Musha. I",
            "start": 2611.44
        },
        {
            "text": "we're due for like what is the state of Capcom at this point? We've loved Capcom the last 10 years and I feel like that wasn't the case really going into Marvel vs. Capcom Infinite and Oni Musha. I Yeah, exactly. Right. Yeah. So, lot a lot of potential there. Um, I don't know that now is the time, but also, why the [ __ ] not? Why the [ __ ] not? Everybody, can we have some [ __ ] fun? Why not? All right, Andy, I want to get to your predictions, but I want to do that after a word from our sponsors. This episode's brought to you by XRE. Y'all know that a few months ago, my life changed forever when I brought a pair of XRE1 AR glasses on a long flight to New York. I legit could not believe how easy it is to use and high quality my experience was playing games, watching movies, TV shows on the plane without just too much extra stuff around me or especially not a giant goofy headset around my head. No joke, this is my favorite new tech product in years and it has earned a permanent spot",
            "start": 2653.44
        },
        {
            "text": "the plane without just too much extra stuff around me or especially not a giant goofy headset around my head. No joke, this is my favorite new tech product in years and it has earned a permanent spot in my travel bag. It is only hard to believe that it works as well as I'm saying until you try XR1 AR glasses for yourself and then you will see that the future is now. The tech is here. Connect XR1 glasses to wherever you are playing. Whether it's a handheld console, a PC, phone, home console. You just get a massive 150in virtual screen anywhere, anytime for any game. Gaming on the go like a long haul flight? You need the XR1. Next, starting to hurt from staring down at your handheld, we've all been there. You need an XR 1. A screen as big as your wall. Instant plugandplay with all of your devices via USBC. Built-in audio with sound by Bose anchoring your screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full HD. These are what make XR1 a musthave. And we hear",
            "start": 2703.76
        },
        {
            "text": "via USBC. Built-in audio with sound by Bose anchoring your screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full HD. These are what make XR1 a musthave. And we hear XR1 Pro is coming soon with an even bigger virtual screen. Hit our link below to get your XR glasses today. There's nothing better than when a sponsor of Kind of funny is something that we are legitimately obsessed with, and that is exactly the case here with XR. So, you're going to hear me talk about these forever. Go to xreal.com for more. And we're back to go through our SGF predictions for what's happening at Friday Showcase. But remember, ladies, gentlemen, in NBS, we need yours as YouTube super chats. If you're watching live right now, you can go to youtube.com/kindfunname, super chat your predictions. And Blessing will say, \"Hey, that's good.\" And Andy will say, \"Hey, that's not good.\" And then me and Tim will decide if it was good or not good. Andy Cortez, what's your next prediction? My",
            "start": 2751.52
        },
        {
            "text": "And Blessing will say, \"Hey, that's good.\" And Andy will say, \"Hey, that's not good.\" And then me and Tim will decide if it was good or not good. Andy Cortez, what's your next prediction? My next predict I don't know where I want to take this. Couldn't even get through the sense where he freaked out about I don't know where I want to take it cuz I just I'm worried about you you all stealing them. You know what? I'm going to go with the obvious ones because I feel like it's an easy point. I've already done a couple of, you know, random ones. Um, we know that uh freaking Neoiz is going to be there and I think we see the Lies of P DLC with the final uh release date. Uh, and the release date will be now it's out today. I was going to go I think September cuz that technically still feels like summer 2025, right? Like the fall starts in October I believe. Last I checked, last time I had a conversation about this, it went, \"Hey, it went bad.\" You know how so? I love what just happened right",
            "start": 2804.48
        },
        {
            "text": "summer 2025, right? Like the fall starts in October I believe. Last I checked, last time I had a conversation about this, it went, \"Hey, it went bad.\" You know how so? I love what just happened right there is Andy was like trying to poke a bear, but he wasn't sure which bear he was poking. And he looks at Bless. I saw Bless have a crisis of just like he's like, \"I know I thought about this, but I don't remember what side I was on.\" That was just No, cuz it was a thing where like I believe I try to imply that August was kind of like fall. Oh, yeah. I got real mad with you. Like if we're talking about releases, like the fall releases, August is kind of late. It's a little bit in there. No, October is when it starts. If you told me like, \"Oh man, we got big plans for the fall and it happens in August.\" I'm not mad. Okay. I'm not mad. Okay. All right. Yeah. I think that I I think August or uh September is likely when this thing comes out. I think they want to be further looking away to",
            "start": 2854.8
        },
        {
            "text": "in August.\" I'm not mad. Okay. I'm not mad. Okay. All right. Yeah. I think that I I think August or uh September is likely when this thing comes out. I think they want to be further looking away to just like how the rest of the scheduling looks. Metal Gear Solid 3 coming out at the end of of August. Um, I think Lost Soul Aside, not that they're worried about that, but that's just another type of one of these games that could take away from them. I think possibly early September, midepptember is when we see the Lies of P release date. But we finally freaking get it. I think it's the school year that [ __ ] me up. You know what I mean? Like cuz that's Mike's argument. Mike's argument is like ah slabby school starts back up at late August semester and like the semester starts in but that's because most of the semester is in fall not because it starts and I understand that right but then let's call it the [ __ ] summer then going into fall [ __ ] semester it's too wordy yeah it's too it's",
            "start": 2895.36
        },
        {
            "text": "most of the semester is in fall not because it starts and I understand that right but then let's call it the [ __ ] summer then going into fall [ __ ] semester it's too wordy yeah it's too it's not catch I'm just saying you know I so I just had to go with a quick little safe one that's my quick little safe I like that I like that a safe bet I'll do an unsafe one but it's not like it's nothing crazy except for probably me you know what I Like I think Magic the Gathering shows up. I think they announced another video game collaboration. And that collaboration, ladies and gentlemen, in MBS is from Software. Oh my. We're getting eldering cards. We're getting Dark Souls cards. Dark Souls 2. Not Bloodborne. Not Bloodborne. No, Sony. Cuz it's Sony. Yeah, maybe even Armored Core, but who knows? Probably not Armored Core, but Armored Core though. Armored Core cards would be [ __ ] sick. But that's a different set. That's a different set. I would I mean I would be at that same excitement level",
            "start": 2938.24
        },
        {
            "text": "not Armored Core, but Armored Core though. Armored Core cards would be [ __ ] sick. But that's a different set. That's a different set. I would I mean I would be at that same excitement level as Tim is for the for the Final Fantasy cards. I mean that I that's a good prediction cuz I feel like it's like not it's not impossible. It's not impossible. It's not like likely but it's you're thinking about this. Well that's things together that could happen. I like that thing is like it's I say unlikely because I'm not going off of any reports. I'm not going off of any like speculation or whatever. I'm just speaking from the heart or a thing that I want to speak into existence. It's the next logical thing. That's the thing that people always go when is this next thing going to happen and that yeah perfect thing I was going through the video game IP that makes sense to collaborate right with Magic the Gathering and I think something that's fantasy something that kind of like has a very",
            "start": 2981.76
        },
        {
            "text": "yeah perfect thing I was going through the video game IP that makes sense to collaborate right with Magic the Gathering and I think something that's fantasy something that kind of like has a very dedicated fan base also what can hit on the level of something like a Final Fantasy and I think an Elder Ring like a Dark Souls kind of thing makes a ton of sense and would get people hella hyped when I especially when you think about like all of the from software bosses that would be individual cards like brother. Like, I'm getting excited just thinking about it. They also did Spongebob, though, which is like, yeah, they're willing to go anywhere. Do anything, man. I was really unhappy with the art on those cards. Yeah. Very uninspired. I I They are original art though. Like they they were just taken from scenes, but they had to redo all that [ __ ] So, like you can see more things in the background of certain scenes and [ __ ] I really I really wanted them to look Yeah. You know when in an",
            "start": 3018.72
        },
        {
            "text": "taken from scenes, but they had to redo all that [ __ ] So, like you can see more things in the background of certain scenes and [ __ ] I really I really wanted them to look Yeah. You know when in an episode of Ren and Stimpy when they really want to show how gross somebody's face is and it's like so w weirdly ultradetailed. I was hoping for like that level of fidelity. You could have also just used the example of Spongebob which also just does that. Yeah, but Ren is Tippy's way. Yeah. Yeah. Okay. Fair. Greg, this is a boring one, but I think it'll get me the point and I'm excited about it. Monster Hunter Wilds comes out and debuts the first trailer for their next title update, title update two. We know it's coming this summer. Uh they've obviously were on the other side now of the collaboration. When you look at the Monster Hunter Wild's road map for what was coming, uh they had the one before Title Update 2 was in fact the Capcom crossover, which we of course now know to be Street",
            "start": 3058.8
        },
        {
            "text": "When you look at the Monster Hunter Wild's road map for what was coming, uh they had the one before Title Update 2 was in fact the Capcom crossover, which we of course now know to be Street Fighter, and then you know various patches, fixes. So, we're on the doorstep here of what will happen in Title Update 2. And I think it's a great time to come out and remind everybody, hey, we're halfway through the year. This was you a lot of you really liked this in the beginning of the year. Here's the next big monster, the next big area, the next big whatever we're doing to get you into it. Waffle on the Run says switch two release for Monster Hunter. Great question. I This one I I I temper my expectations still because I feel like we don't I we don't know how things are. You guys kind of do because you played with Cyberpunk. What is it actually going to look like? How is it actually going to run? What how much of an improvement is this going to feel like as we play something on Switch 2? And",
            "start": 3102.56
        },
        {
            "text": "you played with Cyberpunk. What is it actually going to look like? How is it actually going to run? What how much of an improvement is this going to feel like as we play something on Switch 2? And I'm a little hazy on that. I think the big thing is there was I forget the source of this, but uh the the ridiculous tweet that went out that was just like the three phases of the Switch 2's games this year and it was just like Nintendo stuff, the third parties that are there and then there's going to be a wave of third parties that got dev kits later. I imagine this is probably an example of that. Having said that, clearly Capcom did have access cuz Kenagami Yep. um is Path the Goddess. I I think that's a it feels like a very sure bet that it will be on Switch 2. You think so? Yeah. Yeah. But like then announcing that here. Yeah. Yeah, I think so. Wow. Yeah. Especially with how uh with Cyberpunk looking as good as it does, but still running at 30. Like they they will cap it at 30 still and",
            "start": 3141.28
        },
        {
            "text": "then announcing that here. Yeah. Yeah, I think so. Wow. Yeah. Especially with how uh with Cyberpunk looking as good as it does, but still running at 30. Like they they will cap it at 30 still and you'll have it at 1080p, maybe up res to 1440 or something like that. I think it's definitely possible. We'll see. Uh my next one sticking with uh this is more for me than anybody but Tony Hash Pro Skater 3 and four will be there. Uh this group of Activision always partners with Jeff and Jeff always treats them well and gives them a lot of stage time. Whether it's Crash Bandicoot coming out for God knows what reasons, he's always there. Uh and I am questioning what they could possibly show that's exciting. I also know full full well they could just show something that's not exciting. And that's probably the more likely thing is just, hey, here's a reminder this game's coming out uh in a in a couple weeks. Game pass blah blah blah. that stuff. I do think though they're going to want to tie it",
            "start": 3181.76
        },
        {
            "text": "the more likely thing is just, hey, here's a reminder this game's coming out uh in a in a couple weeks. Game pass blah blah blah. that stuff. I do think though they're going to want to tie it with something that is exciting. They're running out of those things. They already announced that Bam's coming back as a secret skater. Tony Hawk one and two didn't really have uh secret skaters, which was a a big bummer because the Tony franchise known for the Darth Mauls and Iron Man and Spider-Man and blah blah blah. Um I feel like there's more hope here because the DLC is coming with Doom stuff, characters, and music. My dream and hope for one was that Crash Bandicoot was going to be in it. I think they're gonna make it happen now. I think Crash Bandicoot will uh be a secret skater in Tony Hawk and they'll announce that. And if not Crash, a secret My prediction is a secret skater that's not just a skater will be announced for Tony Hawk 3 and four. A dude in a crash suit. A mascot of some",
            "start": 3228.96
        },
        {
            "text": "and they'll announce that. And if not Crash, a secret My prediction is a secret skater that's not just a skater will be announced for Tony Hawk 3 and four. A dude in a crash suit. A mascot of some sort. I would love that. Just a dude in a crash suit. I would love if it was the dude in the crash suit. Oh yeah, that that's that's what I had in my head. Um, but yeah, I I think that we'll get a some secret skater that is more in line with the Doom stuff they're doing as opposed to the Andy Anderson or Ben Marggera that we already know about. I like it. Spongebob, I like it. I mean, yeah, Spongebob is in the secret level thing, but yeah, and it's weird. It would honest I would personally think it'd be weird, Tim, if we get that and that's all we get of a Spongebob collaboration. It's such a weird choice. I know. Really weird. We also are not even talking about the possibility of these IPs going, you know, becoming just costumes and things that you wear. Like you could just have a Spongebob",
            "start": 3271.12
        },
        {
            "text": "choice. I know. Really weird. We also are not even talking about the possibility of these IPs going, you know, becoming just costumes and things that you wear. Like you could just have a Spongebob shirt or the Crash Bandicoot suit you could put on any skater, you know? I mean, they're doing that with like Taco Bell. Yeah. Like there's Taco Bell outfits in the game cuz there's That's awesome. Anytime you grind by a Taco Bell in one of the levels, it does the the gong sound. That's fun. Uh, Andy, that's a great activation. Um, we get a big uh [ __ ] logo hits from software. That's not even that exciting of a reveal, but it's uh Night Rain DLC or not every DLC, but just updates to to Night Rain. I think that we uh get shown two new Nightfares that you will be playing as. Um Barrett, do me a favor. Can you Google right now? Um, I'm looking for looking for his name real quick. We're going to get two night fairs. One of them will be a spellcaster, which is a lot more conventional compared",
            "start": 3315.36
        },
        {
            "text": "favor. Can you Google right now? Um, I'm looking for looking for his name real quick. We're going to get two night fairs. One of them will be a spellcaster, which is a lot more conventional compared to the recluse that we have in the game right now because that character can be a little bit more difficult to get the hang of. And then, uh, Bear, can you Google Ingward, the guardian of the seal, please? Thank you. I N G W A R D. say to me we just don't really have a we don't have a character in like a red costume and I expect to see a character in like a cool red costume maybe you know I look at Ingward and he looks just he looks so cool as an NPC in Dark Souls I think we get a dude in a with a red sort of looking vibe to him this dude was in Dark Souls 1 Dark Souls 1. Yeah, really. And then I think that we see some more glimpses at returning Dark Souls bosses for mini mini bosses. um little glimpses of them. In the same that we saw Nameless King from Dark Souls III pop up in that sort",
            "start": 3371.12
        },
        {
            "text": "I think that we see some more glimpses at returning Dark Souls bosses for mini mini bosses. um little glimpses of them. In the same that we saw Nameless King from Dark Souls III pop up in that sort of first trailer and we all freaked out. I think we'll get like Orinstein and SMO or some of the more known amongst the the Souls community is like, \"Oh [ __ ] those dudes are popping up. Hear me out. You get one of the guardian apes. Both of the guardian. I don't think they do. I don't think we ever see any sacro shit.\" But yeah, that's that's my If I saw the guardian ape, I think I would cry a little I think I'll turn off the game. Yeah. Like, [ __ ] you. Yeah. Demon of hatred. Bless. Is this the final prediction? No. Yes. Oh, really? All right. I'm Yeah, let's do it. Um, Bloom House. Oh, Bloom House shows up and on stage is Sam Barlo. He's revealing his next game and that is Project C. Of course, that is already announced to be published by uh Bloomhouse. Uh and they announced that is it",
            "start": 3416.96
        },
        {
            "text": "House shows up and on stage is Sam Barlo. He's revealing his next game and that is Project C. Of course, that is already announced to be published by uh Bloomhouse. Uh and they announced that is it is coming. I want to say later this year, but I don't have it in me. So, I'm going to say 2026 is when it's coming. Um but it does star a bigname actor. And I don't have any specific guesses of a bigname actor, but I'll just throw out Lil Dicky. No, cuz it's going to be horror. You know, I mean, here's the thing. A little Dicky horror would be [ __ ] fantastic. Josh Peek. I was gonna say Isabella Merced or like that that kind of actor like I wrote down Jenna Ortega but like that's similar to my Tom Holland thing of like ah too big too big now too big but like somewhere in that tier of actor you know what I mean Isabella's on the come up right now Isabella is on the come up Last of Us Hawk girl that's my prediction I like it Greg I really like that one um I think uh Jeff's going to once",
            "start": 3472.32
        },
        {
            "text": "you know what I mean Isabella's on the come up right now Isabella is on the come up Last of Us Hawk girl that's my prediction I like it Greg I really like that one um I think uh Jeff's going to once again get a big get in quotes I mean you know if you think it's a big get from Microsoft as a way to promote their show. I think uh similar to how the Game Awards revealed the Xbox Series X way way back in the day. I think this is where we get a glimpse at the Microsoft Asus Rag Ally 2, whatever they're calling it. I said it to assets, the thing that, you know, leaked forever ago. I think you do a pan over here. Uh you know, some sexy little thing. I think the screen shows this rumored Xbox Microsoft OS for it. Uh and I think then it's basically like more details on Sunday. I like that. Well, it's even interesting you say that. I like it being here because it doesn't feel like an Xbox showcase type announcement. They don't really focus on hardware and OSS and all that stuff traditionally",
            "start": 3518.24
        },
        {
            "text": "it's even interesting you say that. I like it being here because it doesn't feel like an Xbox showcase type announcement. They don't really focus on hardware and OSS and all that stuff traditionally in their summer showcase. So, I think yeah, having that moment be here is good. You think it's deeper than mine, though? You think they're actually going to go into it more? Is it I mean, I don't think they need to. I think it's kind of self-explanatory. I feel like Yeah, like you announce it, you show it, you make people that understand exactly what it is, and if they don't, they're like, \"Oh, is that an Xbox handheld?\" They look in the press release, watch the videos on their own time, and that's where their answers come. Um, but I do like that. I do think that we we see that this weekend. I think it'll be a Jeff's thing. Uh, I'm jumping off yours with more Xbox. They're touching hands right now for the audio listeners. I think that uh at the Jeff show we will get Xbox game announcements",
            "start": 3566.24
        },
        {
            "text": "think it'll be a Jeff's thing. Uh, I'm jumping off yours with more Xbox. They're touching hands right now for the audio listeners. I think that uh at the Jeff show we will get Xbox game announcements coming to PS5 and the Switch. I think that that'll be the focus for those. I like that. Again, going back to Xbox showcase, they got too much Starfield. This is where Starfield happens. Starfield PS5. um and a couple announcements of games coming to uh Switch as well. Maybe that includes Halo Master Chief Collection um and some of the other ones. But yeah, I think that we we will get my prediction to like not just have this be the most obvious thing in the world. I think that we will get um Starfield on PS5 specifically and at least one other title that is coming to to Switch too as well. and like just those announcements, whether it's the ports or just portza was on PS5, now it's also coming to Switch or some of their their games getting more answers there because I I do think that we're",
            "start": 3597.12
        },
        {
            "text": "like just those announcements, whether it's the ports or just portza was on PS5, now it's also coming to Switch or some of their their games getting more answers there because I I do think that we're going to hear them talk about PlayStation and Switch during their showcase, but I still think that um we're in the end of that period of just kind of like tying the bows on some things of just where we're at currently. Is there any mention of a Halo in this? I mean, I think Halo Master Chief Collection is not unlikely. And if they announce it, I think it's the announcement is it's Switch and PS5. The only thing that one of those where were you moments, you know? I know. I know. The only thing that's uh throwing me off on that is the Gears Collection or whatever it was, just the remake of the the first one. What is it a collection or just a remake of one? Remake of one. That's where you start. Um, and them throwing all those things out so close together, I don't know if that's the best",
            "start": 3645.2
        },
        {
            "text": "the first one. What is it a collection or just a remake of one? Remake of one. That's where you start. Um, and them throwing all those things out so close together, I don't know if that's the best move. Having said that, they keep doing that. So, more of a remake. Uh, I feel like they keep throwing a lot of announcements, a lot of games just back to back to back to back because that's just how much [ __ ] they have right now. Um, but yeah, I expect some fun Xbox announcements that are for the other systems. It's better to hide behind 40 atrocities in just one, you know? Were you watching Andor or like what's going on there? Yeah, I was just thinking about that. I was just thinking like there's so many news coming at us. Sounds like a joke. Like an anti Xbox fan would say. What's What's your final prediction? Final prediction for me. Um Oh, he's got a lot to pick from over there. A lot to pick from. Uh, I think that we get House Mark's Sorrowos's gameplay shown with Rahul Kohley",
            "start": 3690.24
        },
        {
            "text": "your final prediction? Final prediction for me. Um Oh, he's got a lot to pick from over there. A lot to pick from. Uh, I think that we get House Mark's Sorrowos's gameplay shown with Rahul Kohley introducing it on stage. It just kind of makes sense to me. Um, and again, I'm predicting this cuz I don't know anything about it. This isn't, you know, that's a we have a very we have very very, you know, strict rules here. You know something, you don't say it. Exactly. See something, say something. I think that we get this game play and it looks just it's just the sickest looking Returnal successor that we could have possibly wanted. No, a window. Do we have a window yet? Did they say 2026 or anything? They Let me look at the trailer. I thought they said 2026, but I thought they did too, but maybe a seasonal window where Bless questions. Is August fall though? Yeah, exactly. I'm like, so does that include August? Yeah, was saying the biggest thing for that is Jeff likes celebrity and Jeff",
            "start": 3731.12
        },
        {
            "text": "a seasonal window where Bless questions. Is August fall though? Yeah, exactly. I'm like, so does that include August? Yeah, was saying the biggest thing for that is Jeff likes celebrity and Jeff likes big games and Jeff likes PlayStation. So, yes, Jeff would want that and Raul's there as far as I know. I think he's in LA at this point. So, it's like that is possible, but I do believe the rumors of a state of play. And if there is a state of play, that's where that is. Yeah. And the Resident Evil 9 announcement 2026. It was in the trailer. I just I I do think that whatever gets shown here will be you you'd get extra snippets of it in the state of play. It just make it just feels like this is right. I don't know why. It feels I like the idea of having someone on stage and debuting the gameplay and like having that moment like that adds value I think to the Summer GameFest stage show. Bless. What's your last one between three small ones? Like none of them are like really stand out. I was",
            "start": 3792.56
        },
        {
            "text": "and like having that moment like that adds value I think to the Summer GameFest stage show. Bless. What's your last one between three small ones? Like none of them are like really stand out. I was thinking about doing a three. This Okay, this is what I'm going to do. It's a triple threat. Oh, all right. All or nothing. All right. My time back. I want the full point or no point. All of these three things happen. All right. First thing, mixtape. Big parlay. It gets a fall release and gets me a lot of open critic points. Have that. Borderlands 4 shows us a story trailer that makes us all laugh. Oh [ __ ] We all have to laugh. Okay. Yes. And then lastly, Directive 8020 convinces us all that it's really good looking. The game that's the Super Massive. Yeah, the super massive game is coming up. The Dark Pictures anthology. It shows us the trailer and we're all like, \"Damn, that looks pretty good.\" And then the game comes out and we're all like, \"All right, cool. It's like a seven.\" Yeah, I",
            "start": 3842.4
        },
        {
            "text": "The Dark Pictures anthology. It shows us the trailer and we're all like, \"Damn, that looks pretty good.\" And then the game comes out and we're all like, \"All right, cool. It's like a seven.\" Yeah, I like that a lot. I like combo wombo there, too. Are you going to combo wombo me, Greg? [ __ ] no. I'm not going to do that. What are you going to do? I'm going to piggyback off of this. Yeah, the Borderlands 4 is there and I think they uh do something uh crazy and I think they come out and they announce that they're, you know, every so worried about this $80 version and it was so much problem or whatever. I think they announced a $60 version of the game at $59.99. Whoa. No way. I think they go the opposite. That'd be so good. I think it'd be I think it'd be a fun one is everybody's worried about that. They come out and do the opposite 2K and they're just like we're It's like obviously the no frrills whatever. But it's like here's a $60 version of the game and then there is the normal 70",
            "start": 3887.92
        },
        {
            "text": "that. They come out and do the opposite 2K and they're just like we're It's like obviously the no frrills whatever. But it's like here's a $60 version of the game and then there is the normal 70 then there is the deluxe 180 whatever it's going to be. What would be what would be in the $60 version? Just enough to [ __ ] play. No extra outfits, golden keys, any of that. There's no menu. I I honestly think that that is one of the craziest predictions any of us has ever made. Yeah. Like it out of all the properties and all the publishers, 2K and Borderlands 4. No way, man. They make they make enough money on virtual currency in 2K. They're going to put out GTA 6 for like I I agree that it's not going to happen. I just think it was a fun one as I went through and I think like the fun part about it would be to play with it and it'd be the usual upsell of always, right? Of like here and I I even thought about them make like this is where it gets like now you're being mean of like they make a",
            "start": 3923.28
        },
        {
            "text": "it would be to play with it and it'd be the usual upsell of always, right? Of like here and I I even thought about them make like this is where it gets like now you're being mean of like they make a 199 version of the game that's like one level you install the entire thing and you can't do anything but this one thing like that's the kind of stupid stuff they I the jokes that they would do but I think Clap Trap is introducing too hard. Yeah. Yeah. Wow. Spectre says the $60 not a real fan edition. Yeah, exactly. That's good. That's good. Oh, that's good. All right, where do I want to go? Yeah, we're at the point that there's just some [ __ ] obvious ones. You know what I mean? Like, am I really going to sit here and be like, I predict that Sonic Racing Crossworlds is going to get a release date? No [ __ ] It's going to Okay, guaranteed. Shadow drop. That's the other one. Predict a new Sonic game. That's the other one. What you saying, B? Is it predict a new Sonic game? Sonic Mania 2. I",
            "start": 3966.88
        },
        {
            "text": "date? No [ __ ] It's going to Okay, guaranteed. Shadow drop. That's the other one. Predict a new Sonic game. That's the other one. What you saying, B? Is it predict a new Sonic game? Sonic Mania 2. I don't think it's Oh my god. Don't do that to me, man. We Oh my god. Tim, you would have you would have loved this moment that me and Bless experienced at the Liza P DLC event. We're sitting with Tam and Tam looks at me. Oh, and is we're talking about SGF. I don't know if you can say this actually cuz he Tam then there was a later moment where Tam told me that it was actually true. No. No. Yeah, we can talk about that afterwards. But yeah, I get like secrets. that Tam like told me a thing of like a like a franchise I care about of like oh this thing's happening and like he kept like going with the bit and I was like you're [ __ ] with me and he was like then he convinced me and I was like yo that's crazy and Tam was like I'm totally [ __ ] with you. Next day I get a message from Greg. He's",
            "start": 4008.48
        },
        {
            "text": "the bit and I was like you're [ __ ] with me and he was like then he convinced me and I was like yo that's crazy and Tam was like I'm totally [ __ ] with you. Next day I get a message from Greg. He's like yo you want to check out this thing and I was like wait I looked at Tam and I was like he was like yeah I [ __ ] with you again. It's it's true. He's too much of a triple double cross. Yeah he's crazy. Well never mind then. Holy [ __ ] Well, all right. I I want to I want to throw one out there that I think is gonna happen and I want I want the fun. Like, what the hell? That that seems random as [ __ ] So, I'm gonna say it. Ace Combat 8. All right. Wow. Okay. Yeah. Celebrities. 2019, we got Ace Combat 7: Sky is Unknown. Oh, [ __ ] I'm like, that's a cool name. I've never played these games, but 2019 seems like it's been a while. You know, I was looking at the I was trying to find a franchise and I'm like, what's what's like overdue and I was like, Ace Combat sounds right? I haven't",
            "start": 4055.84
        },
        {
            "text": "but 2019 seems like it's been a while. You know, I was looking at the I was trying to find a franchise and I'm like, what's what's like overdue and I was like, Ace Combat sounds right? I haven't heard Ace Combat in a while, right? I mean, not since PS4. Yeah. Said that [ __ ] was hype. And so, hey, if Ace Combat 7 Skies Unknown in 2019 hit hard, I want to know what Ace Combat 8 has up its sleeves. If Jeff's not going to wear them, maybe they will. Ace Combat also just feels like a game that a style of game that could be gone forever. Yeah. It's either coming out with a new sequel or we will never see a version of that game ever again. I think we saw the last one in 2019. It's combat. I'm telling you opposite. It'll be there. It'll be there, everyone. All right. I want to do We got a lot of super chats. So, um I know we're running a little long, but I want to get through all of these things. So, I'm going to run through these super chats and let's have a quick discussion on the",
            "start": 4098.4
        },
        {
            "text": "a lot of super chats. So, um I know we're running a little long, but I want to get through all of these things. So, I'm going to run through these super chats and let's have a quick discussion on the likelihood of the predictions. All right, you got it. Um, Nathan Maloney says, \"Kingdom Hearts or Mike gets taken by Canada. Kingdom Hearts is very unlikely to be there, but possible. We did just get some screenshots of Kingdom Hearts 4.\" I think because we got those, then that means no. We're not going to get it. Yeah, I'm with you, too. Uncharted Wolf says, \"It's got to be time to see Toys for Bob. I'm so ready to see the Spyro game they've been working on. If we see Toys for Bob, I think it'll be Xbox.\" Yeah, that'll be a nice little variety in whatever is going to be on that show. We're doing our Xbox predictions tomorrow. Yeah. Yeah. Guitar Hero Arrow says, \"If Red Dead Redemption 2 PS5 is real, please God. Is Summer GameFest the place for it? Or is that a random Rockstar blue ski on",
            "start": 4142.32
        },
        {
            "text": "our Xbox predictions tomorrow. Yeah. Yeah. Guitar Hero Arrow says, \"If Red Dead Redemption 2 PS5 is real, please God. Is Summer GameFest the place for it? Or is that a random Rockstar blue ski on a random Monday?\" Ski ski. I think that's a tweet from Rockstar 100%. Oh, Jurassic Park survive in the Oh, yeah. Locketed, right? Yeah. Got to see that new art. What was the Ark game? Ark Survival the sequel with Vin Dies Dies Dies Dies Dies Dies Dies Dies Dies Diesel. With Vin Diesel. Yeah. Oh [ __ ] Ar. Random performance going to be I feel like summer gamefest always has a random music performance when there's no Ubisoft thing. I wonder if there's like a just I wonder I wonder if just dance when there's no room left in hell. Just dance or walk. Was Ubisoft on the logos page? They probably weren't. I feel like they never show up to this. But also, even when they were doing their own thing, the last Mike was always the one to point out the last couple of years they weren't doing the Just",
            "start": 4188.88
        },
        {
            "text": "I feel like they never show up to this. But also, even when they were doing their own thing, the last Mike was always the one to point out the last couple of years they weren't doing the Just Dance intro. Yeah. Which is [ __ ] Ubisoft wasn't on this partners program and but the this does say round one. So until they did bring back the Just Dance intro in the worst presentation they ever did at the holiday in I think I was the one that pointed out last time where there was no Just Dance announced at the Ubisoft event and then like it was at the next Nintendo Switch uh or Nintendo Direct where they announced the Just Dance. I don't know. I'm going to say there's no performance, but I feel like I maybe I'm wrong, but I feel like there always is. Even if it's just uh celebrating something because there was that one really pretty cell-shaded game and then they did a song from that. You know what I'm talking about? A lot of orange in it. They're in the desert. Um Oh, yes. Yes. Is it the one",
            "start": 4231.84
        },
        {
            "text": "there was that one really pretty cell-shaded game and then they did a song from that. You know what I'm talking about? A lot of orange in it. They're in the desert. Um Oh, yes. Yes. Is it the one about the Oh, Sable. That's the one. That's what it is. That's what it is. Oh, last year. We get Expedition 33 songs. See, did Tim, you saw what I saw in chat? No. Oh, never mind. I was going to say Carolyn Pich. There's somebody in chat that mentioned Cojima's going to be there. DS2 is coming up. We know that she's she's made the title song. Oh, that's the Tastemaker. That's good. You know, I I I was making that face cuz Andy got behind. Yeah. Expedition 33. Please just do it. Yeah. I don't even give a [ __ ] if Don't announce anything. Who cares? Or announce it's coming to Switch 2. That'd be even better. I I too early. I mean, there was a lot of Expedition 33 in that Keley trailer cut. it. I think there's a good chance that we just get some sort of performance. That'd be sick, dude. I love",
            "start": 4269.2
        },
        {
            "text": "better. I I too early. I mean, there was a lot of Expedition 33 in that Keley trailer cut. it. I think there's a good chance that we just get some sort of performance. That'd be sick, dude. I love that. Uh Aaron Lime, man, that [ __ ] song was crazy, man. Aaron Lime says, \"No way Jeff shows off the final Middle Gear Solid trailer, but could he show off a release date for Silent Hill F. It was rated in South Korea a while back.\" Um, yeah, definitely. But also, I I I feel like he could show the final trailer. I don't think that there needs to be a final trailer, though. That game seems kind of like wrapped up marketing wise. Silent Hill F. Is that the the one in the P like way back? I I'm I don't know. This is This is the new big deal one though. That's is that like I think it's a period piece, right? I'm pretty sure. I don't remember that. I don't think it's a modern one. What's the F stand for? There was just a lot of like different Silent Hills being announced that one day and I get",
            "start": 4311.84
        },
        {
            "text": "right? I'm pretty sure. I don't remember that. I don't think it's a modern one. What's the F stand for? There was just a lot of like different Silent Hills being announced that one day and I get them all confused. It's like Assassin's Creed [ __ ] Jade or whatever. Yeah. I forget. It's the Japan one set in the past. Okay. Got you. Got you. The Cyborg. Cyborg. Tundra Boy says Tomb Raider, Wolf Among Us 2, and Play Dead's next game. Oh, Play Dead's next. Where the [ __ ] is Tomb Raider? I mean, that's the big question, right? Like, I feel like if it's alive, it'll probably be here. Okay. Right. Cuz look, look, if it's not announced here, it's not being announced next year. That game's dead. We have Sansa playing her in a movie or in a show, whatever they're doing. It's getting ripped. You seen her? Crazy apps. Like I think it makes sense to try to, you know, coordinate those releases. Yeah. I mean that that's probably not happening for a while. Doing the little fingers speaks outside.",
            "start": 4357.84
        },
        {
            "text": "seen her? Crazy apps. Like I think it makes sense to try to, you know, coordinate those releases. Yeah. I mean that that's probably not happening for a while. Doing the little fingers speaks outside. Thank you. Wolf Among Us 2. I mean I think that's a 50-50 shot right at a Jeff thing. There's always I don't think it's for Eddie. And then Play Dead's next game. Been a while. It has been a while. Yeah. I What's up with that team? They're just everywhere making other things. I was going to say I feel like every single time I hear from Play Dead is from another studio. We're like, \"Ah, we left and made Cocoon. Uh, we left and made um Somerville.\" Somerville. We always blank on the name of that [ __ ] Brave Lord Neto says, \"Andy, can I get a world premiere for a project?\" World premiere. World premiere. Couple different ones. Rahul doing it as 007. O Andy, world premiere. Good. Thank you. Mircat says, \"I predict Pedro Pascal showing up with Fantastic 4 coming out next month.\" I wish, but",
            "start": 4401.92
        },
        {
            "text": "premiere. Couple different ones. Rahul doing it as 007. O Andy, world premiere. Good. Thank you. Mircat says, \"I predict Pedro Pascal showing up with Fantastic 4 coming out next month.\" I wish, but no chance. Not think so. That's a Game Awards thing, which they've already done. I know, but that's a game. Icy Weiner says, \"Tim, last week you said uh that James' email was baseball guy 2010 or something. I demand you properly doc your friend.\" You are incorrect. It was baseball king 2010. Okay, that's his professional email. No, no, no. He had that, but he also he had straight killer dude 007. uh his baseball king was when that was his solution to be professional after we told him 007 is too much. I love seeing Kevin set up the Xbox last week when Greg was going to play something looking through all the gamer tags and going who the [ __ ] is freak nasty 22 that's Mike's other account it's his other gamer tag. Uh Mike Kelly says are we thinking Resident Evil 9? Yes, but not at Summer",
            "start": 4451.88
        },
        {
            "text": "through all the gamer tags and going who the [ __ ] is freak nasty 22 that's Mike's other account it's his other gamer tag. Uh Mike Kelly says are we thinking Resident Evil 9? Yes, but not at Summer GameFest. I think I think that's a PlayStation thing. Yeah, PlayStation showcase. Um, Ultimate Josh says it will be Final Fantasy 7 return. Mark my words. If not, I'll send another $5. Thank you. I love your Sir Chadwin says Anthony Mackey will be there to announce Twisted Metal season 2 trailer is my most out there prediction. Oh, that's that's possible because yes, we we now know the date. I think it's in August and uh we we got a clip from it. It wasn't really so much a trailer. So, I do think we're due for a trailer on that one. What next story arcs do you think they're exploring? and Twisted Metal. [ __ ] stupid show. Why does it exist? Like I don't I don't Why does it exist? You asked that, but there's so many shows that should be getting this treatment. No, I think Tim was talking.",
            "start": 4500.56
        },
        {
            "text": "Metal. [ __ ] stupid show. Why does it exist? Like I don't I don't Why does it exist? You asked that, but there's so many shows that should be getting this treatment. No, I think Tim was talking. We were having about It's awesome. And the story for two is about to be great. They're doing the game. They're finally doing the tournament. It's about to be awesome. Andy Axel is in it. The guy that holds on to the giant two wheels. How is he not going to die? If a bullet hits him, he's going to die. Nobody knows who that is. Axel. I feel like that's one of the more popular ones. Yeah. Come on, man. Get educated. Like he sees it. Yeah. Well, you know, Peacock saw it. They saw those dollar signs. All right. Eyes are on Twisted Metal. It's insane to me. Steven Marshall says, \"Rebirth 2 Reborn.\" Uh, Steve McGovern says, \"My wife's thirsting for a Legend of Baboo date.\" Legend of Baboo? What's that? No idea. Is that the monkey one? I mean, that just sounds like you've heard of Legend of Baboo or",
            "start": 4546.64
        },
        {
            "text": "Steve McGovern says, \"My wife's thirsting for a Legend of Baboo date.\" Legend of Baboo? What's that? No idea. Is that the monkey one? I mean, that just sounds like you've heard of Legend of Baboo or Boo. Oh, it's a dog. I remember there was some animal there's some [ __ ] animal attached to this one. Embark on an action adventure story driven journey and explore a vast magical world caught in the battle between light and dark. Uh say something about your game and say nothing. Okay. But also like you don't need to say much when this is your key art. I don't remember this. This chunky boy. Yeah. I don't remember this. It's the mega evolution of Moose. I know. This feels like an alternate like universe game. I remember this like an what was they call in Rick and Morty inter interdimensional cable kind of thing. It's like interdimensional console. Broia says, \"Do we get a new Need for Speed announcement?\" I don't think so. Yeah. They don't announce those at press conferences anymore. They",
            "start": 4591.68
        },
        {
            "text": "kind of thing. It's like interdimensional console. Broia says, \"Do we get a new Need for Speed announcement?\" I don't think so. Yeah. They don't announce those at press conferences anymore. They keep them secret. Literally just drop them. They drop them like they announce it like a week week before they come out. Like they're ashamed of them. Yeah. They're like we don't we don't need to let anybody know about this. Diego review says the first official DCU games revealed and it's Superman. I've fallen for this too many times. I'm not getting excited for this. I was wondering if you wore that shirt for a reason. It's It's brand new and it's We're in the season, baby. This means we're one month removed from Superman in 10 days, but I'll take it. I guess technically nine days. That's the day that uh Fantastic 4 comes out, right? I mean, I'm excited for that, too. And James Gun said I don't have to fight about it, so I'm not going to fight about it. Andy, you're not going to bait me into",
            "start": 4634.72
        },
        {
            "text": "that uh Fantastic 4 comes out, right? I mean, I'm excited for that, too. And James Gun said I don't have to fight about it, so I'm not going to fight about it. Andy, you're not going to bait me into this. All right. Jeff Kraock says, \"Most unlikely prediction, Beyond Good and Evil 2 production update. Is this the year?\" I don't think it's the year. I also don't think this is the time or place to talk about that. What is Jeff Keley comes up stage? Beyond Good and Evil 2 is [ __ ] dead. We killed it. What was the celebrity they tied to it for the create Joseph Gordon Le was like, \"Hey, give me your art and we won't pay you.\" But you guys want to make your music for the game exposure. What do you think Joseph Gordon Levit thinks about it right now? Nothing. He doesn't think a goddamn thing about it. He's like, \"Remember that one time I was on stage to talk about Beyond Evil 2?\" Did you dream that? I wonder if that happened. Uh, whatever it was called with Ubisoft's cryptic social media",
            "start": 4673.12
        },
        {
            "text": "about it. He's like, \"Remember that one time I was on stage to talk about Beyond Evil 2?\" Did you dream that? I wonder if that happened. Uh, whatever it was called with Ubisoft's cryptic social media post the other day showing a still of Sam Fischer. Do you think we'll get a gameplay or trailer update of the Splinter Cell remake? That is a chance. They have been talking about it and it has been weird. There's been buzz of Splinter Cell, but I feel like every time we start getting into the Summer Game Fest, summer game season, like the rumors start and like anytime anything happens, it's like could it be? So, I don't think it's likely, but it's possible. Anything's possible. Yeah. Uh Dean Brown says, \"Ken Lavine turns up to show off a new Judith gameplay trailer announced that finally releases this November. It's about time. Surely, right?\" Maybe. It doesn't feel like it's this year. When was it that like Lucy went and saw that? That was like a year ago. Yeah, that was early or mid to",
            "start": 4716.0
        },
        {
            "text": "this November. It's about time. Surely, right?\" Maybe. It doesn't feel like it's this year. When was it that like Lucy went and saw that? That was like a year ago. Yeah, that was early or mid to early last year. I remember even then they were very not like they were framing this as like this isn't even a preview. This is like a like like it's not even close, bro. Sounding like it's alpha. You know, I will say that Judas is a game that I put in the exact same class of conversations we've had that include Wonder Woman and Black Panther. So, take you know, take what you will do what you will. We've seen much more of Judas than we have of Wonder Woman. I know. But still, I'm just saying in terms of like when we are prepping the predictions for these shows, like when we don't do it the everyone bring five, when we do it the way of just like here's a list of all the things, those games were always next to each other. Just saying like those other games like it could be there, but it also",
            "start": 4756.8
        },
        {
            "text": "bring five, when we do it the way of just like here's a list of all the things, those games were always next to each other. Just saying like those other games like it could be there, but it also could be dead. I think for me the thing with Judas that gives you a bit more faith in it is that like I understand at least I've heard the vision from them, right? Like I when they had uh the Friends per Second podcast and Ryan McAffrey and I think it was Jeff come through and play and talk about it. When I listened to all those podcasts, I was like, \"Okay, this is a real game.\" Like, \"This sounds like you were trying to do something here.\" They're essentially trying to make like a rogike type experience, right? But out of a Bioshock mold. Um, and hearing them talk about I'm like, \"Okay, I I kind of I believe that this exists.\" I think now it's just the thing of I'm just waiting to see it one more time before I really believe that it's going to come out. Do you think he played uh Dead Loop and",
            "start": 4799.2
        },
        {
            "text": "I believe that this exists.\" I think now it's just the thing of I'm just waiting to see it one more time before I really believe that it's going to come out. Do you think he played uh Dead Loop and was like, \"Fuck, all these we had all these ideas. God damn it. Got to go back to the drawing board.\" Apples dude says James Gun comes out to announce the first DC Studios game amid all the bad WB game news. What you think Greg? No, I like I mean I you know I'd [ __ ] die of course but no that's not going to happen. Don't worry about that. CJ splits on says Rocket Knight. I don't think so. The Rocket League sequel like the Shovel Knight Super Nintendo little like Yeah. Little rat wiener dog rat. Yeah. What was he? What animal? What the [ __ ] was Can you look at Rocket Knight? It felt like I love that CJ splits on super chats Rocket Knight question mark and then underneath it Super Chats immediately Splinter Cell as if it's almost like he made a typo like he wanted to write splitter wrote I",
            "start": 4835.32
        },
        {
            "text": "that CJ splits on super chats Rocket Knight question mark and then underneath it Super Chats immediately Splinter Cell as if it's almost like he made a typo like he wanted to write splitter wrote I always loved Rocket Knight's look so cool looking this is not what I was thinking about. Yeah. Yeah. Yeah. But I I love Who were you thinking about? I don't know. I was just making up games man. Hell yeah man. Shout out to Rocket Knight. People in chat bringing up uh Carl Urban for Mortal Kombat trailer. That could make a lot of sense. That would that'd be sick. That's like sounds like time cuz the movie is coming out in October, I think. So, yeah, getting a trailer. Yeah. Uh, then Danny in the middle says, \"Where's Wolf Among Us season 2?\" Never happened. Don't worry about it. Anthony Adams says, \"I'm late to the party. Did you guys predict Halfife 3 in any capacity? The rumor is announcement is imminent.\" That's another one like the Splinter Cell, but I think there's a lot more smoke with",
            "start": 4880.88
        },
        {
            "text": "\"I'm late to the party. Did you guys predict Halfife 3 in any capacity? The rumor is announcement is imminent.\" That's another one like the Splinter Cell, but I think there's a lot more smoke with this. Like predicting HalfLife 3 at an event is the dumbest, silliest thing you could possibly do. But Alex was a thing that existed. The Steam Deck is finding success. Steam is in a very different place. I think it's inevitable that we get Halfife 3. And I think it's time, baby. Holy [ __ ] I think it's time to show it's going to be at this event. I say Summer Game Fest, even though I know Jeff, you know, has had gigantic announcements at this thing and like he paints it as one of his main events, for some reason, Summer Gamefest doesn't feel big enough for Halfife 3. I mean, I I agree totally, but I also don't know what is big enough for Halfife 3. I mean, are you guys with me though that like Halfife 3 feels more real than ever right now? Yeah, 100%. I think that Do we think that could be",
            "start": 4923.68
        },
        {
            "text": "but I also don't know what is big enough for Halfife 3. I mean, are you guys with me though that like Halfife 3 feels more real than ever right now? Yeah, 100%. I think that Do we think that could be one that they just post on their own? 100%. Yeah, cuz like what what was the Mike's game of the year last year that wasn't even officially announced by Steam, Andy? Um, Deadlocked. Deadlocked. Yeah. like they didn't even have to [ __ ] like post like even officially announce that game and that game's [ __ ] huge or was at you put that on the front page of every Steam uh like as soon as you open up Steam it's like the the big splash, right? Like I feel like you as Valve you you create a showcase announce. My my only thing against that though is I feel like uh while there are exceptions to like how they do things Steam and Valve have shown that they like partnering up with people and like at least playing nice and being on stage like even remembering back uh at the PlayStation E3 press",
            "start": 4959.84
        },
        {
            "text": "like how they do things Steam and Valve have shown that they like partnering up with people and like at least playing nice and being on stage like even remembering back uh at the PlayStation E3 press conference and I think 2010 when game came out and announced like Portal 2 was coming to the PlayStation 5. like obviously very different time, but I I would imagine Steam wants to position themselves with everyone else as opposed to against everyone else. So, I wouldn't be surprised if they play nice with Jeff on purpose to like kind of use that stage and kind of like get Steam to be even more of a household name than it already is cuz like they're in such a great place right now. Do they get Gabe New Gabe New off the couch for HalfLife? Probably. Right. That's the thing. That's the Jeff and him, they have a relationship. They do. I do not think it's impossible that Gabe comes out on this day. On November 21st, 2019, at 10:01 a.m., Valve announced HalfLife Alex on Twitter. They just",
            "start": 5002.88
        },
        {
            "text": "and him, they have a relationship. They do. I do not think it's impossible that Gabe comes out on this day. On November 21st, 2019, at 10:01 a.m., Valve announced HalfLife Alex on Twitter. They just said, \"Return to Halfife in March 2020. Pre- purchase now on Steam.\" Yeah, but that's a V. Like that's a like But like that was like that was still the first HalfLife game new in decades at the or a decade and a half or something, right? But like it's still not Halflife 3. I know the game was amazing. I know everybody that loved it or that played it loved it. But to me, this is them knowing we are we cannot show off or reveal this game at a big ass showcase because people are going to go [ __ ] VR. What? This isn't what we want. So like this makes sense for this sort of announcement. The way Bless talked about God of War, the Greece game. Yeah. I think I think it I think for three it I don't know if it's just a press release or an email. I think it's a big big deal. And then the final one",
            "start": 5048.16
        },
        {
            "text": "talked about God of War, the Greece game. Yeah. I think I think it I think for three it I don't know if it's just a press release or an email. I think it's a big big deal. And then the final one here, CJ Spisson says, \"Jet radio or Sega games.\" I think that's a lock. I think Jetet Radio and Crazy Tax. I think I think I think we see him. You got a good one with that neck. You know what I'm talking about. Nick, you give me some crazy tax. We have some fun over here. That's all true. Everybody, thank you for hanging out with us today for this predictions episode for Summer GameFest. Tomorrow we will be predicting the Xbox showcase and who the [ __ ] knows a PlayStation event might get announced. We'll predict that too at some point somewhere. I like the way you're looking at me. Crazy text, man. That get going. You kidding me right now? We're about to do the kind of funny podcast. Clearly Greg has an energy to him. So stay tuned. Watch us live on Twitch or YouTube. If you're on YouTube,",
            "start": 5100.56
        },
        {
            "text": "man. That get going. You kidding me right now? We're about to do the kind of funny podcast. Clearly Greg has an energy to him. So stay tuned. Watch us live on Twitch or YouTube. If you're on YouTube, make the jump over to the different link. If you're on Twitch, stay right where your ass is. Till next time. Love y'all. Goodbye. You can drink Coke. Not yet.",
            "start": 5144.24
        }
    ]
}