{
    "id": 14248,
    "video_id": "8a1qmTa7mAc",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Blessing Adeoye Jr.",
        "Jerica Hannah"
    ],
    "title": "Xbox VR Headset Being Announced This Week?! - Kinda Funny Games Daily 06.23.25",
    "description": "Download Cash App Today: https://capl.onelink.me/vFut/7u0sm0fp #CashAppPod Sign up with our exclusive referral code KINDAFUNNY in your profile. Send $5 to a friend within 14 days, and you’ll get $10 dropped right into your account. Terms apply.\n\n*Referral Reward Disclaimer: As a Cash App partner, I may earn a commission when you sign up for a Cash App account.* #sponsored\n\nGo to https://mood.com and use code KINDAFUNNY to get 20% off your first order.\n\nMeta is reportedly about to announce an Xbox headset, Mindseye’s developer is seemingly in big trouble, and Sonic is finally crossing over with Spongebob.\n\n00:00:00 - Start\n00:04:25 - Housekeeping\nThe Roper Report   -\n00:06:30 - Meta To Announce An Xbox Quest 3S This Week, It’s Claimed - Mike Straw @ Insider Gaming\n00:14:15 - Microsoft adds Steam games to its Xbox PC app on Windows - Tom Warren @ The Verge\n00:20:12 - MindsEye Developer Build a Rocket Boy Begins Layoff Process Amid Disastrous Launch, Studio Sources Say - Wesley Yin-Poole @ IGN\n00:29:35 -Sega accidentally revealed sales numbers for Sonic, Like A Dragon, Persona, and more - Andy Robinson @ VGC\n00:34:39 - Persona 4 Revival and STRANGER THAN HEAVEN due out after April 1, 2026 - Sal Romano @ Gematsu\n00:37:50 - Peak has sold a million copies - Twitter\n00:40:45 - Sonic Racing: CrossWorlds Reveals Nickelodeon Collaboration That Adds SpongeBob SquarePants, Avatar, and Teenage Mutant Ninja Turtles Guest Characters - Wesley Yin-Poole @ IGN\n00:45:10 - A Duke Nukem TV series may be coming from the producer of the Devil May Cry and Castlevania animated shows on Netflix - Andy Chalk @ PC Gamer\n00:50:30 - Wee News!\n00:54:50 - SuperChats & You‘re Wrong\n\n\nKFGD was about Meta and Xbox teaming up for a headset!\nAfter This…\nAfter this is the Kinda Funny podcast featuring Danny Jolles!\nThen after is the stream which is Dune Awakening with Mike and Nick\nIf you’re a Kinda Funny Member:\nToday’s Gregway is Mike and Roger buying a treadmill.\nThank you to our Patreon Producers: Karl Jacobs, OmegaBuster, & Delaney Twining\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1750702583,
    "duration": 3456,
    "transcript_chunks": [
        {
            "text": "Today's stories include Meta is reportedly about to announce an Xbox headset, Mind's Eyes developer is seemingly in big trouble, and Sonic is finally crossing over with Spongebob. We have all this and more because this is Kind of funny games daily. Yo, what's up? Welcome to Kind of Funny Games Daily for Monday, June 23rd, 2025. I'm one of your hosts, Blessing Addio Jr. joining me is JK Games's Jerica. Howdy, Jerica. Welcome back to the show. I'm here. I'm ready to do this. I can't wait for later, but I am excited to talk about games with you this morning. Now, why can't you wait for later? Oh my god. Are we going to talk about Death Stranding like the rest of the world's talking about? Definitely going to talk about Death Stranding, too. So, of course, that's that's the reason we have you in town. We flew you out so that we could have you on our Death Stranding 2 review as one of the main reviewers because you're a huge fan of Death Stranding one. Yes. Loved it. Great, great journey.",
            "start": 7.52
        },
        {
            "text": "in town. We flew you out so that we could have you on our Death Stranding 2 review as one of the main reviewers because you're a huge fan of Death Stranding one. Yes. Loved it. Great, great journey. Um, I was one of the sickos that enjoyed walking around beautiful environments and I didn't get too bored with it. So, I can't wait to talk about what I think about this one, the new I'm really excited to talk to you about it cuz I it's funny one came out. It was 2019, right? It was like November. I was coming off of playing Pokemon Sword. Um, and I like I remember putting in probably around 20 hours into it and I just fell off cuz my brain just didn't click. And then the Steam deck came out and I believe it is the director's cut that's available on Steam. Yeah. And the director's cut, I think, just fixed any issue that I had with Death Stranding because like that is when I fell in love with it and like that's where my excitement for Death Stranding 2 when that got announced just",
            "start": 58.88
        },
        {
            "text": "I think, just fixed any issue that I had with Death Stranding because like that is when I fell in love with it and like that's where my excitement for Death Stranding 2 when that got announced just skyrocketed where I'm like, \"Oh [ __ ] I can't get I can't wait to get back in and just [ __ ] walk all around the country and this time Australia.\" It's It's definitely one of those games that I don't just recommend to all my gamer friends, Destiny One specifically, because of those nuance things, but you know, I do have one friend and literally because of the the Steam Deck, she ended up completing it and doesn't play games like that at all. So, like it speaks to some people and I love that more people now get to experience the first one even though the second one's out and then people are going to be like, \"Let me see what the first one's about.\" They got a lot of ways to do it now. And it is improved with the director's cut. Exactly. Uh now I introduce you as from JK Games. Yes. Jerica,",
            "start": 97.36
        },
        {
            "text": "to be like, \"Let me see what the first one's about.\" They got a lot of ways to do it now. And it is improved with the director's cut. Exactly. Uh now I introduce you as from JK Games. Yes. Jerica, for those who may not know, do you want to talk about yourself a little bit? What is JK Games? And also tell me about more of the things that you're doing. Oh yeah. Uh so yeah, I'm Jerica. I'm from JK Games podcast where me and Kayla dissect video game news every week. We've been on a little bit of hiatus because we've been working on our other show which is on the same channel, Clickerbait, reviewing and talking through uh uh the season two of The Last of Us. that just finished on HBO and we're since we're getting back into doing games stuff with JK Games, we're excited to try something new. So, you'll have to tune in to see exactly what that's going to be for us. But so far, we're excited and there I'll just say this. We're about to play Tears of the Kingdom for like a whole month. That",
            "start": 137.2
        },
        {
            "text": "So, you'll have to tune in to see exactly what that's going to be for us. But so far, we're excited and there I'll just say this. We're about to play Tears of the Kingdom for like a whole month. That would be my little Hell yeah. Super exciting. Peak behind the curtain finally on my Switch 2. That's how I wanted to beat it. I mean, honestly, I'm jealous cuz I'm one of those people. I mean, like many of us out here who played it on the Switch one, and I kind of wish, not that I wish I waited for the Switch 2, cuz I'm glad I played it at release cuz of course you want to be part of that hype cycle, but when I see people who are picking up Tears of the Kingdom for the first time on Switch 2, I'm like, \"Ah, [ __ ] man. I know. It looks so [ __ ] [ __ ] I booted up just to take a peek.\" And I was like, \"Yeah, I'm so glad I waited.\" But I'm also one of those people like, \"How could you not wait to beat this game?\" But I knew it. I could smell a new console on the horizon. So, I just like,",
            "start": 177.52
        },
        {
            "text": "was like, \"Yeah, I'm so glad I waited.\" But I'm also one of those people like, \"How could you not wait to beat this game?\" But I knew it. I could smell a new console on the horizon. So, I just like, \"No, I'll go on to something else. I'll come back.\" Hell yeah. Uh, so go check out JK Games. Go check out what was it? Clicker. Clickerbait. Clickerbait. Yes. If you want to go back and listen to more Last of Us 2 impressions. You are obsessed with The Last of Us. You should definitely check out our clickerbait episodes for sure. Hell yeah. Remember this is kind of funny games daily. Each and every weekday we run you through the nerdy news you need to know about live on YouTube, Twitch, and on podcast services around the globe. If you love what we do, support us with the kind of funny membership on Patreon, YouTube, and now on Spotify and Apple Podcast to get all of our shows ad free. Watch us record them live and get a daily exclusive show. For a chance to be a part of the show, some of",
            "start": 215.36
        },
        {
            "text": "on Patreon, YouTube, and now on Spotify and Apple Podcast to get all of our shows ad free. Watch us record them live and get a daily exclusive show. For a chance to be a part of the show, some of your thoughts and opinions as YouTube super chats as we go. Housekeeping for you. It's a big week. Mike and Roger are freaking it again. That's right. On Friday, June 27th, Mike will go step for step on a treadmill with Norman Reus in another literal marathon stream for the launch of Death Stranding 2. But this time, they have a few surprises. Get ready to go the distance because they will stream as long as you support. Can they make it past KFD on Monday? How high will Mike's heart rate be? How much chilies will they order? Find out Friday, June 27th, exclusively on Twitch. And then Saturday, we got a lot happening this weekend. Greg is throwing his own kind of funny game showdown championship parade in San Francisco. Meet in front of the Ferry Building at 10:00 a.m. and then walk the",
            "start": 253.12
        },
        {
            "text": "we got a lot happening this weekend. Greg is throwing his own kind of funny game showdown championship parade in San Francisco. Meet in front of the Ferry Building at 10:00 a.m. and then walk the Embaradero to Square Pie guys. All while celebrating the man who did the impossible and led team blue to its third consecutive championship, Greg Miller. Bring signs. Greg. God damn it. [ __ ] riding this [ __ ] Bring signs and prepare for the weirdest walking meet and greet of all time. Um, that is very exciting. I do have plans to be there as well if everything goes right. I'm gonna be there on the parade just to hang out, just have a good time and maybe get some square pie guys. So, come through to that if you're in the area. If you want to come out to the area for a two-hour parade. Uh, remember we're in 11 business all about live talk show. So, today after KFGD, you're going to get Games cast, which is our Death Stranding 2 on the beach review. And then after Games Cast is a kind of",
            "start": 301.04
        },
        {
            "text": "we're in 11 business all about live talk show. So, today after KFGD, you're going to get Games cast, which is our Death Stranding 2 on the beach review. And then after Games Cast is a kind of funny podcast with a special guest. And then after that is the stream which is Dune Awakening with Mike and Nick. If you're a kind of funny member, Gregway for today is 36 minutes of Roger and Mike attempting to buy a treadmill. Uh Roger describes it as absolute mustwatch content. Thank you to our Patreon producers Carl Jacobs, Omega Buster, and Delaney Twining. Today brought to you by Cash App and Mood, but we'll tell you about that later. For now, let's begin with what is and forever will be the Report. It's time for some news. We have nine stories today. Starting with our number one, Meta to announce an Xbox Quest 3S this week, it is claimed. I'm pulling from Mike Straw at Insider Gaming. Meta and Xbox appear set to expand up their relationship with a new hardware announcement. According to a",
            "start": 341.28
        },
        {
            "text": "an Xbox Quest 3S this week, it is claimed. I'm pulling from Mike Straw at Insider Gaming. Meta and Xbox appear set to expand up their relationship with a new hardware announcement. According to a new report, Meta will be announcing an Xbox branded version of their MetaQuest 3S virtual reality headset. Per Kevin Lopez of Game Sandwich, the Xbox Quest S3 or sorry, 3S uh will be announced on Tuesday, June 24th. The device will reportedly cost $3.99, $399, and include an Xbox themed black and green headset with matching accessories such as an Xbox wireless controller and an Elite Strap. It'll also include 3 months of Xbox Game Pass Ultimate. Like the original MetaQuest 3S, it'll have the same 128 GB of storage. Despite the recent reliability of uh the source of the information, it should still be taken with a grain of salt until officially announced or independently verified. Lopez, however, did have information regarding Deadpool VR's announcement at Summer GameFest and the release date",
            "start": 399.04
        },
        {
            "text": "be taken with a grain of salt until officially announced or independently verified. Lopez, however, did have information regarding Deadpool VR's announcement at Summer GameFest and the release date of Tony Hawk's Pros Skater 3 Plus 4. Jerica, an Xbox VR headset from Meta. What does that do for you? Uh, I'm going to be honest, not much, but I I will say this cuz like I'm a mainly PlayStation gal, so like I have my VR 2, and I was uh I was hesitant to see what other I'm a let me take a step back. I only play Beat Saber. That's the only thing I go to VR title. Understandable. That's it. So, like, and I was a little bit bummed to hear that Beat Saber was getting like no more updates for PlayStation, which sucks because we've bought all this these these tracks and things and we're not going to be able to get the new stuff. So, now what I do with my library that I have here. Um, but for me, like it doesn't do much. If anything, like I think it's a positive thing cuz like it just gives more",
            "start": 455.12
        },
        {
            "text": "be able to get the new stuff. So, now what I do with my library that I have here. Um, but for me, like it doesn't do much. If anything, like I think it's a positive thing cuz like it just gives more gives more access to Xbox titles in new ways and it sort of it's not surprising since the ally the rag ally is something that's already getting the Xbox treatment already. Yeah, I think for me it's a I come out with a similar similar takeaway, right? As far as like this being another step into what the new Xbox is like all the walls coming down, Xbox being like, yo, our ecosystem is one that we want people to come through and partner with and like in the way that ROG, the ROG Xbox ally is going to be a way for you to have the Xbox experience on the go. I this makes sense, but I wouldn't have predicted it, right? Of like, oh yeah, I guess a MetaQuest Xbox version is doing the exact same thing that ROG is doing with the Ally X, but just in a different way. I find it fascinating because I",
            "start": 506.08
        },
        {
            "text": "predicted it, right? Of like, oh yeah, I guess a MetaQuest Xbox version is doing the exact same thing that ROG is doing with the Ally X, but just in a different way. I find it fascinating because I don't I don't expect any VR software output from Xbox first party. So like really like what they're doing here is just another they're I think they're viewing it as just another screen, right, of hey like Xbox Game Pass like you can play you you know you can play your flat screen games in VR as well as your VR games this massive display right so like it makes that that does make sense and that's in a way like now that you say it like does excite me to like know maybe that would be a selling point for me like instead of having to play on my tiny monitor like let me put on on this massive 100 inch screen in this virtual space and play this game this way. Yeah, that be I'd be cool to see if those games that I'm already playing on my Xbox I could see in a headset. See what that could be like.",
            "start": 554.32
        },
        {
            "text": "screen in this virtual space and play this game this way. Yeah, that be I'd be cool to see if those games that I'm already playing on my Xbox I could see in a headset. See what that could be like. Yeah, it's funny cuz going back I remember there being interviews with Xbox um higherups talking about would Xbox ever do a VR headset? Like is this in the cards in the same way that PlayStation has done the VR stuff? And I remember the interviews Xbox being like, \"No, we don't really see like, you know, that as a future for us in terms of like the viability of us leaning all the way into that market.\" This is one of those cases of being able to have your cake and eat it too where, hey, we don't have to dedicate a big portion of our hardware support and a big portion of what would be expected as software support and like having to develop games for this thing and doing all this stuff to VR. If we just look at people who are already doing VR in the case of Meta and go, \"Oh yeah, just put the",
            "start": 602.96
        },
        {
            "text": "software support and like having to develop games for this thing and doing all this stuff to VR. If we just look at people who are already doing VR in the case of Meta and go, \"Oh yeah, just put the Xbox logo on it. Put it you put the Xbox logo on it. Sell it with months of Game Pass and also um bundle in an Xbox controller. Call it a day.\" It's smart. Like it's super smart. It's something that I think even on the PlayStation side. I wouldn't be surprised the bet with PSVR 2 and I think somewhere along the way they probably knew that the bet wasn't going to pan out in the way that they wanted it to, right? Like I feel like the lack of first party support for VR 2 past like that first month even, right? Like already says volumes in terms of how early PlayStation was like, \"Fuck, this is not the investment that we wanted to make here.\" But hey, we're already here. So put out the VR2 hardware, let it be a thing. It'll connect to PC later on. like we'll figure this all out kind of thing.",
            "start": 646.4
        },
        {
            "text": "the investment that we wanted to make here.\" But hey, we're already here. So put out the VR2 hardware, let it be a thing. It'll connect to PC later on. like we'll figure this all out kind of thing. I this feels like a way more feasible and a way more I think tenable way of doing this for everybody involved where I think even on the meta side, right? Like you're looking for more reasons for people to want to pick up a Quest. You're looking for more reasons for people to be interested in the hardware. I think being able to again slap an Xbox logo on it and like have this Xbox collaboration thing happen with it makes sense for opening this up to another audience to maybe have interest in this device. I agree. So this isn't this isn't a thing that you think you're going to ever pick up? It depends. I don't know. Like like I said like I really hadn't until you brought it up of like maybe I do want another way to experience games and if I can have my cuz this basically what you know",
            "start": 691.12
        },
        {
            "text": "It depends. I don't know. Like like I said like I really hadn't until you brought it up of like maybe I do want another way to experience games and if I can have my cuz this basically what you know integration with my Xbox like game pass like library that could be just another place I can play it. Yeah. Um I'm not taking a VR headset with me when I travel or anything that's for my handheld but you know if I want to change it up in my space and play a game somewhere else I think that's pretty pretty dope. Yeah. Yeah. I It's funny because I was talking to Greg about this right before the show. And this actually kind of feeds into story number two a bit. Yeah. Talking about um how I have my ROG uh Ally at home that I never use cuz I'm always just using my my Steam Deck instead. Um and it's funny cuz like I'm ROG Ally powerful device, right? Like I can probably get more out of that than the Steam Deck, but I just I can't but I just don't use it, right? Like it is about the ecosystem at",
            "start": 739.36
        },
        {
            "text": "funny cuz like I'm ROG Ally powerful device, right? Like I can probably get more out of that than the Steam Deck, but I just I can't but I just don't use it, right? Like it is about the ecosystem at the end of the day for me where I'm like I just like that it boots into and I know I can change this, right? I just like that it boots into steam Steam OS and it automatically is is seamless. My emulated games are there and my Steam library is right there and then I put it down and I go to my computer and I play more games uh there that way, right? I was talking to Greg about it in the context of me um wanting to start playing the Altters cuz I have the PS5 version. I was like, I want to play the PC version. Um and so I'm getting the PC version of Alter so I can try it out um mainly so I can play it on my Steam Deck. But I brought it up in the sense of uh Greg was then like, \"Well, it is on Xbox Game Pass.\" And I paused for a second. I was like, \"Can I make that work in the same way?\"",
            "start": 783.44
        },
        {
            "text": "play it on my Steam Deck. But I brought it up in the sense of uh Greg was then like, \"Well, it is on Xbox Game Pass.\" And I paused for a second. I was like, \"Can I make that work in the same way?\" Theoretically, yes. But I I I'm still in that place where there's just like enough hoops that I have to jump through where I'm like, I'd rather just get on Steam because I already I'm already in this ecosystem. No, I align with you there. Like I I don't need an extra uh barrier to prevent me from just play hitting start. Like I I get it. I want to bring story number two into this. Right. So, story number two, Microsoft adds Steam games to its Xbox PC app on Windows. This is from Tom Warren at The Verge. And the reason why I bring it up is because this could solve all my issues. Yep. Uh Microsoft is starting to test its new aggregated gaming library in its Xbox PC app on Windows. Xbox insiders will now be able to see their Steam and Battleet games all within the Xbox app this week, making it",
            "start": 824.48
        },
        {
            "text": "is starting to test its new aggregated gaming library in its Xbox PC app on Windows. Xbox insiders will now be able to see their Steam and Battleet games all within the Xbox app this week, making it a single launcher for most installed PC games. This new consolidated library will roll out to the Xbox app later this year, as well as new devices like the ROG Xbox Ally handhelds. It's part of Microsoft's efforts to make the Xbox app on Windows the home of PC gaming and compete with Steam and Steam OS by combining Windows and Xbox. quote, \"When a player installs a game from a supported PC storefront, it will automatically appear in my library within Xbox PC app as well as the most recent uh list of titles in the sidebar, making it easier than ever to jump back into your games,\" explains Misha Oza, a product manager of the Xbox platform. Microsoft says support for additional PC storefronts will roll out over time. This this is the biggest threat to my Steam Deck right now, just so you",
            "start": 866.56
        },
        {
            "text": "Oza, a product manager of the Xbox platform. Microsoft says support for additional PC storefronts will roll out over time. This this is the biggest threat to my Steam Deck right now, just so you know. like when the Xbox Ally comes out next uh uh later this year and if it really is a thing of I'm booting up to the Xbox app or whatever it is, right? And I can just see all of my games including my Steam games and all that [ __ ] That's a game changer for me. Yeah, this whole integration would be just the biggest selling point for just playing Xbox literally anywhere now. and then be able to have this like to your point just all my games in one spot versus having to open another launcher cuz like I you like I I actually sold my Steam Deck and got the ally instead because I wanted that flexibility with other libraries that I had. Yeah. Um but to your point it's a little extra. I mean it's running Windows like it's just like I got a PC on in my hand. I'm like when I booted cuz uh we got",
            "start": 916.88
        },
        {
            "text": "with other libraries that I had. Yeah. Um but to your point it's a little extra. I mean it's running Windows like it's just like I got a PC on in my hand. I'm like when I booted cuz uh we got really lucky, right? Um where like years ago, Greg had had like asked for ROG Allies for coverage and I think they just either never got back to him or they just got go back to him really late or he didn't see the email. Something happened to where we didn't get them until fairly recently and when I got my ROG Ally I I booted it up and it booted up directly into Windows and I felt disgusted. It's it's like do you want a copy of Office while you're here? You know, like I'm like I'm like brother I have a laptop. I wanted to use my laptop. Um, but I but like for people who who want that experience like and yeah, and I've bought games on other in other places, so like I want to be able to also play them here if I can. So, but yeah, to your point like I would love to see a consolidated library on all",
            "start": 962.88
        },
        {
            "text": "and yeah, and I've bought games on other in other places, so like I want to be able to also play them here if I can. So, but yeah, to your point like I would love to see a consolidated library on all the PC things in my life. So, including like even at my computer, like having seeing all my games in one spot, that solves a problem. I don't have to open up something else to get to this game. Um, so when we're talking about the Xbox app just in general and like the future of Xbox, the direction of Xbox, I know you mentioned that you're primarily a PlayStation person in ter in terms of the way that you play. Does what Xbox uh what with what they're doing, does it intrigue you at all? Is it something that you pay attention to and go interesting all the time? just because like there are titles that come out and I think that is the appeal of Game Pass and that's where I literally have, you know, I'm part of all these ecosystems now for different reasons, but they all have their teeth in me.",
            "start": 1005.2
        },
        {
            "text": "that come out and I think that is the appeal of Game Pass and that's where I literally have, you know, I'm part of all these ecosystems now for different reasons, but they all have their teeth in me. Yeah. Like um but I do love the fact that like if I'm subscribed to Game Pass, I can try out these games and have some time with them and not have to commit to a $70 price tag, $80 price tag on certain titles. Um, but yeah, like just being able I'm always paying attention and I want that whole experience to be better if I'm subscribing to it every month. Like I want to be able to play where I am. Um, and they're just giving giving everyone a means to pick up a game on Game Pass, like making it easier. Yeah. I was talking about this uh recently with folks that like as time goes, especially this year, I think ever since the Steam Deck really, but it's compounded more and more where I'm just straight up a PC gamer, where I'm straight up like, you know, I'm play it's like my third party uh",
            "start": 1049.28
        },
        {
            "text": "year, I think ever since the Steam Deck really, but it's compounded more and more where I'm just straight up a PC gamer, where I'm straight up like, you know, I'm play it's like my third party uh game time is now like solidly split between PlayStation and PC. And I think PC has just taken over um because of like having a 4080 at home and then also my Steam Deck where it's like, well, this is just nice to have. I prefer this over trophies. I'm sorry. Um, but yeah, one of the big big hurdles with me is just yeah, how spread out everything is. I got my I got Steam, I got Epic, I got Xbox, but then also I have like two Epic accounts for some reason. I think I made one for Fortnite, made a separate one. Like, oh yeah, I forgot about like the Epic Store, too. Like I have some things on there that I've bought and like, you know, and that's where and I just forget that I own them. So, Xbox is making it easier. I think the collaboration with Steam is perfect. I think being able to do",
            "start": 1095.92
        },
        {
            "text": "there that I've bought and like, you know, and that's where and I just forget that I own them. So, Xbox is making it easier. I think the collaboration with Steam is perfect. I think being able to do everything like that in one place so I don't forget that I've already bought this somewhere else. Yeah, it's great. Uh I want to bring in some super chats for you. Um Samson L writes in and says for Jerica from your friends at Grow Up at Grow Up Levelup. What is Grow Up Level Up? An amazing other show you should also check out. They've had me on twice. I even had a hot dog costume on the first time. They wanted to interview me. I'm like why? I'm not Why? I mean, I wasn't your p your personality, Jerichica. I guess. Yeah, the hot dog costume definitely helped with that. Speaking of, Zeke speak writes in and says, \"The way I screamed when I saw Jerica here. Hell yeah, bro. We need that ye-haw energy at K.\" I know. Are you known for Ye-haw energy? I mean, yeah. Where are you flying in from?",
            "start": 1140.72
        },
        {
            "text": "writes in and says, \"The way I screamed when I saw Jerica here. Hell yeah, bro. We need that ye-haw energy at K.\" I know. Are you known for Ye-haw energy? I mean, yeah. Where are you flying in from? Oh, I'm from Alabama. Oh, hell yeah. Yeah. Yippi Kaya. You know what I'm saying? Let's go. Uh, and then we got one more from Cogn Cognitive Clips who says, \"Can we call this pairing blessa?\" I'm gonna That rolls off the tongue more so than like most other pairings. Like when I'm with Gary Widow, people just [ __ ] struggle. Yeah. I'm not even going to try it. Yeah. Um Jerica, we're going to move on to story number three. Mind's Eye developer Build a Rocket Boy begins layoff process amid disastrous launch, studio sources say. Uh this is Wesley Yinpool at IGN. Build a Rocket Boy has told staff a redundancy process has begun amid the disastrous launch of Minds Eye the cuts could affect over 100 employees. S studio sources have told IGN. One person who asked to remain anonymous in order to",
            "start": 1182.96
        },
        {
            "text": "a redundancy process has begun amid the disastrous launch of Minds Eye the cuts could affect over 100 employees. S studio sources have told IGN. One person who asked to remain anonymous in order to protect their career told IGN there's no word yet on exactly how many staff are affected. But the standard 45day consultation process starts today, June 23rd, which according to UK law is triggered when an employer proposes 100 or more redundancies within a 90-day period. IGN understands Build a Rocket Boy currently has around 300 UK employees with around 200 abroad. IGN has asked Build a Rocket Boy for comment. Um, Jericho, have you been keeping up with the Mind's Eye situation? Listen, I remember the trailer. I got caught up with it this morning and I was like, \"Oh, this game didn't do so well. This sort of makes sense now.\" Yeah. Okay. But yeah, I had no idea like the studio itself was like being led by, you know, a former um Yeah. Yeah. Rockstar um creative lead. Like I don't know what",
            "start": 1228.4
        },
        {
            "text": "This sort of makes sense now.\" Yeah. Okay. But yeah, I had no idea like the studio itself was like being led by, you know, a former um Yeah. Yeah. Rockstar um creative lead. Like I don't know what he did before. Uh, so it is surprising like, you know, it seems like there was a lot of promise here. Um, I haven't had any time with the game, but I've read reviews and I was like, yeah, that sucks. The trailer was cool, though. I do remember the trailer and I was like, this looks promising. It's just a brand new IP from a brand new studio, which I feel like sometimes is mostly misses, especially if it the gameplay can't back up what it is. Mhm. Um, yeah, this once again this this news it sucks. It sucks. Yeah, it it sucks because you hate to see people lose their jobs and you hate to see I think any studio close, right? Build Rocka Boy is a very interesting one. So to double back, right, Leslie Benzes is the lead of it. He was the former president of Rockstar North, right? Which is really",
            "start": 1279.44
        },
        {
            "text": "any studio close, right? Build Rocka Boy is a very interesting one. So to double back, right, Leslie Benzes is the lead of it. He was the former president of Rockstar North, right? Which is really important. Okay, subscri Games overall, right? But like he had a high position at Rockstar there and then went and built his own thing. Um, the fascinating thing that remains for me, because I I'm with you as far as the original trailer for Mind's Eye was very intriguing. Yeah. Um, what was even more intriguing for me was it being announced coming off of Everywhere. Now, do you remember Everywhere? No, it's a platform that I still don't think has released, right? But like it was Build Rocket Boys like coming out like, \"Hey, this is what we're doing. This is what we're proposing.\" Right? It felt like a platform, like a almost like a Roblox or a like dreams but like a bit more realistic and AAA. Okay. Was sort of the presentation of it. And then um Mind's Eye was announced as something coming",
            "start": 1332.16
        },
        {
            "text": "like a platform, like a almost like a Roblox or a like dreams but like a bit more realistic and AAA. Okay. Was sort of the presentation of it. And then um Mind's Eye was announced as something coming out of Everywhere, right? Like kind of a creation within it. But toward like as we got closer and closer to Mind's Eye, I feel like there's been more and more of a separation of Mind's Eye and like its origins in Everywhere. But all of that is under Build a Rocket Boy. Okay. And so I always had the question of what is the relation like what is the deal with everywhere and like what the [ __ ] is up with how you're marketing Mind's Eye? It feels like you're sending it out to die. Uh uh sort of thing. Yeah. I had no idea and did not gather that from the initial trailer that I saw. So yeah, I mean to I listen I have the Wikipedia pulled up for Everywhere so I can break it down for you. Right. So, Everywhere is an upcoming massive multiplayer online game and game platform with an integrated",
            "start": 1377.92
        },
        {
            "text": "to I listen I have the Wikipedia pulled up for Everywhere so I can break it down for you. Right. So, Everywhere is an upcoming massive multiplayer online game and game platform with an integrated game creation system developed by Builder Rocket Boy. The players start in the city of Utropia where they access different experiences such as biomes surrounding the city, different game modes, userenerated environments called arcs or the game Mind's Eye. Each of these experiences can I don't know if that part is still true. Each of these experiences can be accessed via portals in Utopia City or the everywhere menu. Everywhere is set in an open world made up of you made up of Utopia Utopia City and four biomes while Utopia is a safe zone safe zone. The biomes have PvP and PV PvE elements. It then goes on to talk about how like each district has like or no there yeah each district is like its own game mode. So, it has like racing, um, like an art gallery, a combat district, and like more",
            "start": 1423.76
        },
        {
            "text": "then goes on to talk about how like each district has like or no there yeah each district is like its own game mode. So, it has like racing, um, like an art gallery, a combat district, and like more [ __ ] going on. Um, all this [ __ ] is cooked. Yeah, all this [ __ ] is absolutely [ __ ] cooked when you're talking about you're laying off a hundred people at least from your studio. Um, which sucks, breaks my heart. You see, you hate to see creative ideas like this get shut down, but like from the get-go, this seemed like a very lofty thing that they're going after. It did. And like just you like recapping like I had no I you know obviously this might be a sign of like just me not being invested in it but like I had no idea this even was a thing. I guess they were trying to do like a like a Grand Theft Auto Online sort of like build your own situation with like on like but just so I guess you can do literally whatever you want. I don't know if like what your assets are what you could",
            "start": 1472.48
        },
        {
            "text": "a Grand Theft Auto Online sort of like build your own situation with like on like but just so I guess you can do literally whatever you want. I don't know if like what your assets are what you could build with but yeah that's a tough uh project. That's a tough I mean yeah tough is bringing it light whole like dedicated game pulling from that I wouldn't want to do that. That doesn't sound like a great idea. Here's my thing is I look at this right as as we read the story and as we talk about this and I think about how [ __ ] good Dreams is and like how I think Dreams is never going to be appreciated for how [ __ ] good good it is as far as it being the creation thing, it being filled with with userenerated content. A lot of that userenerated content is really good and really special. And then they I mean Media Molecule did the thing where they had original campaigns in there. They had um uh was it called Arts Dream I believe which is like the original campaign that they uh made in there",
            "start": 1517.52
        },
        {
            "text": "they I mean Media Molecule did the thing where they had original campaigns in there. They had um uh was it called Arts Dream I believe which is like the original campaign that they uh made in there but then also Trend which is a really cool little toy uh train puzzle game. Like there were a lot of really cool creative things happening in Dreams and Dreams feels somewhat comparable to like what they were trying to go for here, but Dreams did it with I think a lot more grace, but also not great marketing slash like not just a tough thing to sell to people. It is. And that's it's a the concept itself seems from for anybody just seems a little overbearing like to hop in and like oh am I making a game or am I playing these other games? Yeah. Um, but yeah, uh, I'm I'm interested to to see what comes of this. And yeah, it it it stinks, but it just seemed very lofty to your point. And yeah, Jerica, we're going to talk about Sega accidentally revealing sales numbers for a bunch of their games.",
            "start": 1562.64
        },
        {
            "text": "of this. And yeah, it it it stinks, but it just seemed very lofty to your point. And yeah, Jerica, we're going to talk about Sega accidentally revealing sales numbers for a bunch of their games. But before we do, I want to tell you about patreon.comindafoney and youtube.com/confunname, where you can go and get the kind of funny membership, which allows you to get shows adfree. Speaking of ads, let us tell you about our sponsors. This episode's brought to you by Cash App. We've all had those moments getting meals out with people that always end in some kind of awkward experience of having to figure out the least complicated way to just get it done or even after figuring it out. Have you used an app and ended up having to wait days for your money to finally show up? What if we could solve all of that easily? Cash App is a completely different experience. fast, easy, and safe, and a great way to receive and transfer money to family and friends. It's incredibly easy to set up. You just",
            "start": 1607.04
        },
        {
            "text": "all of that easily? Cash App is a completely different experience. fast, easy, and safe, and a great way to receive and transfer money to family and friends. It's incredibly easy to set up. You just enter your phone or email and some other basic information. No bank account needed, and then there's no waiting around for days. It's your money. You shouldn't have to wait. We love using Cash App because it's fast, it's safe, and it just makes life way less stressful. For a limited time only, new Cash App users can use our exclusive code to earn some additional cash. For real, there's no catch. Just download Cash App and sign up. Use our exclusive referral code kind of funny in your profile. Send $5 to a friend within 14 days and you'll get $10 dropped right into your account. Terms apply. That's money. That's Cash App. This episode is brought to you by Mood. Let me tell you about the online cannabis company that's revolutionizing how we deal with life's challenges. From sleepless nights",
            "start": 1654.8
        },
        {
            "text": "money. That's Cash App. This episode is brought to you by Mood. Let me tell you about the online cannabis company that's revolutionizing how we deal with life's challenges. From sleepless nights to stressfilled days, Mood.com has created an entire line of functional gummies that target specific health concerns with 100% federally legal THC blends. They'll deliver them discreetly right to your doorstep. And you can get 20% off your first order at mood.com with promo code kind of funny. I've been having a great time trying out all their different gummies, and I'm loving how each one feels. Their sleepy time gummies will knock you out in about 15 minutes flat. No hangovers, no groggginess, and their epic euphoria gummies are perfect for those days when nothing's going right. And best of all, not only does Mood stand behind everything with an industry-leading 100-day satisfaction guarantee, but as I mentioned, listeners get 20% off their first order with code kind of funny. So, head to",
            "start": 1699.52
        },
        {
            "text": "not only does Mood stand behind everything with an industry-leading 100-day satisfaction guarantee, but as I mentioned, listeners get 20% off their first order with code kind of funny. So, head to mood.com, browse their amazing selection of functional gummies, and find the perfect gummy for whatever you are dealing with. And remember to use promo code kind of funny at checkout to save 20% on your first order. And we're back with story number four. Sega accidentally revealed sales numbers for Sonic Like a Dragon, Persona, and more. This is Andy Robinson at Video Games Chronicle. Sega has accidentally revealed the the sales numbers of many of his recent major releases, including games in the Like a Dragon, Sonic, and Persona series. The sales numbers were included in a recent presentation document uploaded to Sega Sammy's investor relations website. A table of sales numbers was found to have been hidden in one of the of the present one slide of the presentation. The document has since",
            "start": 1744.0
        },
        {
            "text": "document uploaded to Sega Sammy's investor relations website. A table of sales numbers was found to have been hidden in one of the of the present one slide of the presentation. The document has since been removed by Sega Sammy, but not before Reset Era archived the sales numbers in full. According to the document, Persona 5 Royal has sold over 7 million units. Sonic Frontiers has sold some 4.5 million copies and recent Yakuza titles, Infinite Wealth and Like a Dragon have shifted 1.66 million and 2.86 million. I have a list here, Jericho. I'm just going to go ahead and read the list. So, Like a Dragon, Infinite Wealth, 1.66 million units. And you can holler if any of these are like super shocking to you. Okay. Like a Dragon, the man who erased their name, has sold 96 million units. So, like just under a million. Persona 3 Reload 2.07 07 million. Sonic Superstars 2.43 million. Sonic Frontiers 4.57 million. Very surprising. Wowza. Like high or low for you? Uh higher. Like I mean I'm not",
            "start": 1791.12
        },
        {
            "text": "just under a million. Persona 3 Reload 2.07 07 million. Sonic Superstars 2.43 million. Sonic Frontiers 4.57 million. Very surprising. Wowza. Like high or low for you? Uh higher. Like I mean I'm not trying to throw shade. What you trying to say about Sonic? I'm not cuz I love Sonic, but I was just like okay. The the want for Sonic is still there. It's Yeah, it's cool. It's It's funny because I I was talking about this over the weekend. I was streaming and there was somebody in chat that was that was like why why hasn't there been like a great great Sonic game since Sonic Mania and I was like all right first of all you watch your mouth all right Sonic Frontiers is good almost great and then also like Sonic Superstars like Sonic Cross Shadow but I digress right I kind of understand the sentiment a little bit but it doubles back on like brother these I say brother a lot lately um it's the Alabama and you know infecting me um but it's the fact that I think Sonic has the Pokemon problem not",
            "start": 1835.6
        },
        {
            "text": "a little bit but it doubles back on like brother these I say brother a lot lately um it's the Alabama and you know infecting me um but it's the fact that I think Sonic has the Pokemon problem not extrapolated to like the amount that Pokemon has it, right? Cuz Pokemon biggest IP in the world. It is there are so many parts of the ship that you have to maintain whether it be the anime, big movies, cards, uh Pokemon Go, like so many moving parts are involved in Pokemon that the video games have to suffer because Pokemon Company and Nintendo look at it and go, \"Ah, [ __ ] we got to have a Pokemon game come out every year, the year and a half, because we have to keep the generations going because that is how that's how we maintain this business. You know what I mean? That's how we push this this thing forward. And so sometimes we get Pokemon games that [ __ ] run janky as [ __ ] Yeah. And that's how that happens. Sega with Sonic, similar thing, not extrapolated to the amount of Pokemon",
            "start": 1880.64
        },
        {
            "text": "this thing forward. And so sometimes we get Pokemon games that [ __ ] run janky as [ __ ] Yeah. And that's how that happens. Sega with Sonic, similar thing, not extrapolated to the amount of Pokemon where with Sonic, you have Sonic movies, you have Sonic merchandise, you have Sonic popups in San Diego that I go to to buy chili dog, right? Like Sonic is very big outside of just the video games. And so I think Sega looks at Sonic and kind of dep prioritizes like the amount of polish of video Sonic video game needs to have. U as long as we're getting a Sonic game every year. And like it's not mainline, of course. This year it's going to be Sonic Racing. Last year it was a re it was a remaster. Year before that it was 2D. Year before that it was Sonic Frontiers. Um but like this shit's coming out every year regardless. So, you're not going to get a Sonic game delayed out of November to the next year. Yeah, cuz that's how it's a machine. They have to look at it like a machine, which is",
            "start": 1928.16
        },
        {
            "text": "out every year regardless. So, you're not going to get a Sonic game delayed out of November to the next year. Yeah, cuz that's how it's a machine. They have to look at it like a machine, which is sad, but also, listen, I if you're a Sonic fan, you know, to expect seven out of 10, seven out of 10 greatness. You know what I mean? Uh, going down the list even further, you got Total War Warhammer 3, which uh sold 2.34 million units. Shimagami Tensei 5, including Vengeance, sold 2.11 million. Yakuza Like a Dragon, 2.86 86 million. Persona 5 Royal, including the remastered version, 7.25 million units. Uh Team Sonic Racing hit 3.5 million. And finally, Total War Three Kingdoms um has 3.21 million units sold. I I love looking at numbers because I think they're fascinating and really help orient how we talk about these things and how we view these things. Persona 5 Royal selling 7.25 25 million units is not surprising to me. But then it makes me wonder like if you if you bundle in core or like",
            "start": 1975.36
        },
        {
            "text": "we talk about these things and how we view these things. Persona 5 Royal selling 7.25 25 million units is not surprising to me. But then it makes me wonder like if you if you bundle in core or like base Persona 5. Yeah. How much more are we talk are we talking about a 15 million unit seller or like a 13 million unit seller? Either way, really good. Like shout out to Persona for being such a hit franchise for Sega. Agreed. Let's move on. Actually, before we move on, let me take one more peek at super chats. uh where T t Yippy7 writes in and says, \"Shout out to Sikasfrick on YouTube, who has been doing a Death Training 2 daily counter for over 100 days now. They have they have less than 1K subs, so want to send some KFBF love. Hell yeah. Good for sick as freick for being such a Death Stranding fan that they're like, we're counting down 100 days till this game. You got to love it.\" All right, let's talk about uh story number five. Speaking of Sega, Persona 4 Revival and Stranger Than",
            "start": 2023.44
        },
        {
            "text": "fan that they're like, we're counting down 100 days till this game. You got to love it.\" All right, let's talk about uh story number five. Speaking of Sega, Persona 4 Revival and Stranger Than Heaven are due out after April 1st, 2026. This is Sal Romano at Gamatsu. Atlas's Persona 4 Revival and Ryu Ga Goku Studios Stranger Than Heaven will launch in or after fiscal year 2027, which runs between April 1st, 2026 on uh or to March 31st, 2027. According to a Sega Sammy management meeting, 2025 presentation published on June 18th. Persona 4 Revival was announced for PS5, Xbox, and PC earlier this month with a teaser trailer showcasing early development content. Stranger Than Heaven was first announced at the Game Awards 2024, but was officially titled with a new trailer earlier this month. Platforms have yet to be announced. So, you're waiting until at least April of next year before you're seeing out of these games, but probably a lot lot longer than that, I'd imagine. Which I'm fine",
            "start": 2075.44
        },
        {
            "text": "Platforms have yet to be announced. So, you're waiting until at least April of next year before you're seeing out of these games, but probably a lot lot longer than that, I'd imagine. Which I'm fine with. Um, I will say like this Stranger Heaven does like I've always wanted to get into the Yakuza series like but it's just so overwhelming. Like I don't know where to start and then like am I going to enjoy my time because I don't know any of these characters. But Stranger Than Heaven looks like something I definitely want to pick up because it is its own thing. Yeah. So, I'm excited to play this. It's like it looks like something right up my alley being a detective going through different time periods. I'm like that's that's my thing. So, I like weird stuff like that. I'm 10,000% the same way where I know if I asked the Yakuza audience where to start with Yakuza. Like there's multiple great places to start. Pick up Yakuza Zero, pick up Like a Dragon, which I did, right? I I think for me",
            "start": 2125.76
        },
        {
            "text": "where I know if I asked the Yakuza audience where to start with Yakuza. Like there's multiple great places to start. Pick up Yakuza Zero, pick up Like a Dragon, which I did, right? I I think for me it's also the start and stop thing I have with Yakuza where I almost get intimidated where I I get 10 hours into Infinite Wealth and then I'm like, \"All right, I got probably 30 more hours of this game and then an entire franchise of like games that I'd want to get into.\" Um I think my my most successful attempt into getting into RGG Studios games was playing playing Judgment 2 cuz one it felt more manageable, then also it felt I I I liked the detective thing. I like how unique and different that story felt and like I think for me I look at Stranger Than Heaven and have that similar feeling as you of oh yeah like you're doing something interesting here as far as putting you in a different time period and like yeah like it seems like a detective like cool thing and then also I look at combat",
            "start": 2166.0
        },
        {
            "text": "of oh yeah like you're doing something interesting here as far as putting you in a different time period and like yeah like it seems like a detective like cool thing and then also I look at combat for the game and I'm like the combat looks fun as well, right? Like it looks like the action combat that we get in earlier like a dragon games mixed with like something a bit more slower paced and deliberate and I'm all about that. You know, I I I like a good story that's going to be surprising in ways. We'll talk more about that later. I like a weird story. Um but yeah, I'm curious to see like what ends up being like the story maybe a little bit more grounded, maybe not as like robust and sort of out of left field. Yeah. Um I only know based on the like gameplay I've seen of like other games um from the studio, but yeah, I'm excited to play it. Uh I don't need it right away. It's okay. It can take its time. Yeah. Also, I think it's nice to um see RGG take their time a bit and like not have",
            "start": 2211.12
        },
        {
            "text": "from the studio, but yeah, I'm excited to play it. Uh I don't need it right away. It's okay. It can take its time. Yeah. Also, I think it's nice to um see RGG take their time a bit and like not have a game release like every 6 months. That said, I wouldn't be surprised if they announced another Yakuza game to come out in January. I definitely wouldn't write that off. That that can definitely happen. Story number six, Peak has sold a million copies. I'm pulling directly from Noble on Twitter, uh who tweets, Peak has sold over 1 million copies in its first 6 days after release. Um, and you pulled a um some art there that I assume is from the Peak development team. Um, celebrating a million copies sold. Are you familiar with Peak? Watch the trailer and I'm instantly sold. It looks so cool, right? It looks like the concept is so looks so much fun. Like I texted Kayla and I was like, \"Hey, we we got to stream this game. We got to play it.\" Like it what a good what a cool co-op experience.",
            "start": 2251.52
        },
        {
            "text": "It looks like the concept is so looks so much fun. Like I texted Kayla and I was like, \"Hey, we we got to stream this game. We got to play it.\" Like it what a good what a cool co-op experience. And yeah, 1 million copies, six days. Wild. I so I was going to save this for Wii news, but then I thought about it more and decided it deserved to be a a full news story mainly because it comes off of Did you listen to KD a few weeks ago? must have been at this point. That was from um there was a news story about Agro Crab and they put up a blog post basically saying that um they had shelved work on um going under two um which is going to be their that was going to be their next big game after putting out another Crabs Treasure um and they were just burnt out. I think funding fell through as well and so they were like all right we're we're going to take a break from this. Let's do a game jam and create a couple of side projects. And Peak was one of those side projects. And for that to hit a",
            "start": 2296.72
        },
        {
            "text": "and so they were like all right we're we're going to take a break from this. Let's do a game jam and create a couple of side projects. And Peak was one of those side projects. And for that to hit a million copies, like I looked up, I mean, I'm going to look it up again, right? Another Crabs Treasure sold, and this is from Game World Observer that I'm pulling from, right? But this new story says Another Crab's Treasure sells 500,000 copies across all platforms in just under three months. So like, you're talking about their last big game selling 500K in just under in just over three months. And in six days, this like side project they made has caught such steam and has sold a million copies in six days. It's that's [ __ ] awesome. Truly a a beauty in like letting developers like, yeah, I love when that's such a cool story that it came from just like a side brain project like just like, hey, let me just let's see what we can play with and get something out the door and it ends up being",
            "start": 2343.76
        },
        {
            "text": "when that's such a cool story that it came from just like a side brain project like just like, hey, let me just let's see what we can play with and get something out the door and it ends up being one of the most successful things they're able to put out there. Like that's cool. Yeah. Yeah. And like this is a game uh if you're interested in Peak, right? Like if you and if you don't know what Peak is, if you're an audio listener, not seeing the video, right? Like it's a it's a climbing game uh that has like some fun art style there, fun personality, but you're also playing at co-op with friends. And so you're talking to them as you're climbing and doing all this stuff, carrying them around if they get knocked out. Like like that's that's great. And it's only $5 on Steam. Yeah. You can't beat it, which is huge for it, right? I know aggro another crab treasure was I think $25 to $30. So, you know, lower price, but I think still a million in the first 6 days. I imagine you're going to sell",
            "start": 2389.12
        },
        {
            "text": "it, which is huge for it, right? I know aggro another crab treasure was I think $25 to $30. So, you know, lower price, but I think still a million in the first 6 days. I imagine you're going to sell a lot more in the weeks to come. Like that money is going to, I think, stack up for them. And, you know, I hope that success leads into um the future for them because that's really cool. That's really cool to see. It's a win. It's awesome. Story number seven, Sonic Racing Crossworlds reveals Nickelodeon collaboration. I'm pulling from Wesley Yinpool at IGN. Earlier this month, Sega confirmed Sonic Racing Crossworlds guest characters such as Hatsune Miku, Ichiban, Kasuga, Joker, and even Joker from Persona 5, not the clown, and even Steve, Alex, and Creeper from Minecraft. But the guest characters do not stop there. Sega has announced a Nickelodeon collaboration that brings Spongebob Squarepants to the track and teased Avatar and Teenage Mutant Ninja Turtle uh characters down the line. The",
            "start": 2423.36
        },
        {
            "text": "do not stop there. Sega has announced a Nickelodeon collaboration that brings Spongebob Squarepants to the track and teased Avatar and Teenage Mutant Ninja Turtle uh characters down the line. The trailer shows off Spongebob Squarepants and Patrick Star racing the Patty Wagon. Do you remember the Patty Wagon? No. No. It's a a vehicle shaped like a Krabby Patty from the Spongebob Squarepants series. Um, and they're racing that across a bikini bottom track. Let's [ __ ] go. We're so back. We've won, Jerica. Yeah, it looks It appears anytime you're right around a a Krabby Patty, I think you have. That's cute. Uh, I love how you know. Did you get Have you been able to play this at all? No, but I've seen previews and it seems like people are liking it a lot. Yeah, I I have I I haven't played either, but yeah, based on what I've what I'm hearing, like it's a it's a good time. And you know, like that's always the biggest win, like wish for me with like when it comes to like Mario Kart, like I",
            "start": 2472.4
        },
        {
            "text": "but yeah, based on what I've what I'm hearing, like it's a it's a good time. And you know, like that's always the biggest win, like wish for me with like when it comes to like Mario Kart, like I always love to see more characters introduced. And like I think the wackier the better for party like Kart games is a is obviously a a fuel for what brings people back to these games. if they introduce more characters like I might hop back in like and I just wonder how far they're going to go into the future like adding additional characters and stuff. Yeah, I I want to address the comment because there's a comment in chat that says um shout out to uh Spongebob for getting his license. And I need you to remember you don't need a license to drive a Krabby Patty. Oh, that was explicitly said. Okay. Yeah. In the Spongebob series. I believe it was a Spongebob movie. Oh wow. Yeah. You're fine. Yeah. Spongebob does not need his license to drive a Krabby Patty. Good to know. Um, I [ __ ] love this.",
            "start": 2516.24
        },
        {
            "text": "Yeah. In the Spongebob series. I believe it was a Spongebob movie. Oh wow. Yeah. You're fine. Yeah. Spongebob does not need his license to drive a Krabby Patty. Good to know. Um, I [ __ ] love this. And talking about future collaborations, right? The fact that you're getting Avatar and you're getting TMNT, I think is dope. And I think I think they're building this up as something that's really fun and really cool and really special, I think. Right. It's funny coming off of Mario Kart World and this game coming out in the same year as Mario Kart World probably might do it a little bit of a disservice, but I think Sega has made really great cart racers in the past. I've heard a lot of great [ __ ] about uh Sega Allstar Racers Transformed and I played a little bit of that game and that game was fun. That game is a really fun game from what I played, but people swear by it. Um the Sonic the Team Sonic racing game that came out a few years ago on Switch, I don't think was as great as those",
            "start": 2559.84
        },
        {
            "text": "fun. That game is a really fun game from what I played, but people swear by it. Um the Sonic the Team Sonic racing game that came out a few years ago on Switch, I don't think was as great as those games, but the previews are making this one seem like a return to form for Sega, which is super exciting. But I think really what's going to what's what's going to pull it together is the the IP of it, right? Cuz like I I think Sega could have easily done done this as a Sega uh crossover thing. Yeah. Like they done with Racing Transform and had had it be all right, Ichibon, Joker, not the clown, uh Crazy Taxi, um you know, Jetet Radio and like they could have continued down that path. I think it's way smarter to go after um Nickelodeon characters and have it be a thing of Spongebob and you know, have a Minecraft character Minecraft characters in in there and getting TMNT. I think there's a bit more brand synergy there than Sega might have within their own franchises. You know what I mean?",
            "start": 2601.92
        },
        {
            "text": "have a Minecraft character Minecraft characters in in there and getting TMNT. I think there's a bit more brand synergy there than Sega might have within their own franchises. You know what I mean? Yeah, it's a it's IP that people can like, oh, I want to play that game if I see uh Donatella like riding in a cart. Like that's it's everyone's in this game. I think I think it's also very smart. Yeah. And like I think kids I mean kids I think are going to identify more with Spongebob and Sonic and uh Donatello more so than they might with no offense to Ichabon because I love that Ichabon video. Yeah, that's cool. I don't think the isbot speaks to the kids in that way. No. Um, and also I think they're that's also them using the Paramount like connections they have with the Sonic movie and then also Paramount owning Nickelodeon and all that stuff, right? Like a lot of this makes sense and really speaks to my own like inner child heart cuz I if you're my age like you grew up with Spongebob.",
            "start": 2648.8
        },
        {
            "text": "also Paramount owning Nickelodeon and all that stuff, right? Like a lot of this makes sense and really speaks to my own like inner child heart cuz I if you're my age like you grew up with Spongebob. Spongebob is very important to you, right? And like same thing with Sonic. And so seeing [ __ ] Sonic collab with Spongebob, I don't know. It makes my inner child happy. So, I can't I can't wait for this. Let's talk about story number eight. A Duke Nukem TV series may be coming from the producer of the Devil May Cry and Castlevania animated shows on Netflix. This is Andy Chalk at PC Gamer. Have you ever thought to yourself, \"Boy, I sure would like a Duke Nukem TV series.\" Well, you might be getting one anyway. As Audi Shankar, producer of the Devil May Cry and Castlevania shows on Netflix, said in an interview with Esquire that he's acquired the rights to make one. Quote, I got video games in production. Obviously, more Devil May Cry, Shankar said. Quote, I'm being approached with",
            "start": 2690.24
        },
        {
            "text": "said in an interview with Esquire that he's acquired the rights to make one. Quote, I got video games in production. Obviously, more Devil May Cry, Shankar said. Quote, I'm being approached with different IPs and companies that want to work with me. I bought the rights to Duke Nukem, not the gaming rights, but I bought it from Gearbox. End quote. His vision for Duke Nukem, he continued, is quote, a middle finger to everybody. When Duke Nukem blew up, a bunch of people sat around trying to turn it into a brand when it's just a middle finger. Duke Nukem can't be made by a corporation because the moment a corporation makes Duke Nukem, it's no longer Duke Nukem. I don't intend on having anyone tell me what to do on this one. End quote. Okay, Jericho, what does that do for you? I mean, I'm going to fall in that category. like, yeah, I wouldn't have ever thought I needed a Duke Nukem TV show or another way to I've never played the games. I know of it. It's, you know, but it's it's",
            "start": 2735.68
        },
        {
            "text": "I'm going to fall in that category. like, yeah, I wouldn't have ever thought I needed a Duke Nukem TV show or another way to I've never played the games. I know of it. It's, you know, but it's it's surprising. I don't know if this will land with everybody or I don't know is is this a smart decision? I I mean, if you're asking me, yeah, I don't think it's a smart decision, but I think it's an Audi Shankar decision. It lines up with with Audi Shankar. I think he had if anybody can make a Duke Nukem show that is true to Duke Nukem, it's probably Audi. Um, especially coming off of the Castlevania and and Devil May Cry shows, which are really good. I think that's a track record that might actually lend itself to all right, you have you have the talent to make it happen. And then also, you have the attitude and probably also the divisiveness to make a Duke Nukem thing feel authentic to it. I don't think I don't think anyone, and this is one of the few times where I'm going to make a very",
            "start": 2780.32
        },
        {
            "text": "the attitude and probably also the divisiveness to make a Duke Nukem thing feel authentic to it. I don't think I don't think anyone, and this is one of the few times where I'm going to make a very blanket statement, I don't think anyone asked for a Duke Duke Nukem cartoon. Um, except for Audi Audi Shankar. He like they probably asked for one, right? But like for the most part, I don't know if there's an inherently built-in audience for a Duke Nukem animation, but I think Audi could maybe create one. You're you're right. Maybe you can make a small one. Listen, I'm always down for more. You know, I think we're in a new age of seeing more unique animation and seeing especially like having more games being told versus I think animation is a smart move for a lot of games versus live action. So like the more games that we're seeing animated like in different forms is like I'm a fan of. Yeah. So like I'll be here to see what it is. I'll show up day one with my middle finger. I don't mind.",
            "start": 2834.72
        },
        {
            "text": "So like the more games that we're seeing animated like in different forms is like I'm a fan of. Yeah. So like I'll be here to see what it is. I'll show up day one with my middle finger. I don't mind. For me it strikes me as like I I think there are such low expectations. Yeah. Um slash no expectations for what you do with Duke Nukem cuz I've played a couple of Duke Nukem games in my life, right? like one of the classic or OG Duke Nukems I remember playing I never I never beat them, don't get me wrong, but like I picked them up or whatever. And then like Duke Nukem Forever, I played the demo on PS3, okay? And like as soon as I threw as soon as I picked put my hand in a toilet and threw [ __ ] in the game, I was like, I don't know if this is for me. I don't know if this is speaking to me. But I think the expectations are so not there for a Duke Nukem thing that really I I imagine that Audi Shankar is going to go in and basically paint this however he wants within like paint paint the",
            "start": 2884.0
        },
        {
            "text": "But I think the expectations are so not there for a Duke Nukem thing that really I I imagine that Audi Shankar is going to go in and basically paint this however he wants within like paint paint the story, paint the character, paint the world however he wants. I think this is like a free sandbox and playground for Audi to just like I don't know be make it relevant, expressive, be like, you know, divisive, be crazy in it and you know do your thing I guess. I guess. Yeah, it's a good IP to be able to do that with. I agree, Jerica. Yeah, I'm very curious on if a Duke Nukem TV series could be big. Could it? But if I wanted something smaller, say the tiniest news I needed to know about, where would I go? The Wii News Channel where we cover all the small news items you need to know about. Story number nine is Wii News. Uh Carolyn Pichek on the beach is out now. Of course, it's been a long saga of getting here of Ro me and Roger going to Cojima Productions, Roger Hanning Cojima, a Carolyn",
            "start": 2927.28
        },
        {
            "text": "number nine is Wii News. Uh Carolyn Pichek on the beach is out now. Of course, it's been a long saga of getting here of Ro me and Roger going to Cojima Productions, Roger Hanning Cojima, a Carolyn Pich album, Kojima listening to it and falling in love with Carolyn Pichek's music, getting Carolyn Pich to make music for Death Stranding and make like the title track for it, right? And so if you want to listen to the song, the song is out now. Of course, Death Stranding 2 is not that far away if you want to like go into the game and experience it unspoiled. What up? Were you close enough to Kojima where you could smell him? Not in a creepy way, but I want I want to know his sense. You're not the first person to ask. He wears something great. You know, you're not the first person to ask. I'm so glad. Thank God. I even when I'm like I don't know like not like a far distance from somebody. I'm never getting in like heavy enough whiffs to smell people. Like it's rare that I smell somebody. I",
            "start": 2976.08
        },
        {
            "text": "glad. Thank God. I even when I'm like I don't know like not like a far distance from somebody. I'm never getting in like heavy enough whiffs to smell people. Like it's rare that I smell somebody. I mean it's there might not be wearing something that that strong, you know. And I don't think he was wearing Yeah, I don't think he was wearing it. Might just be no scent. I think he just Yeah, I don't think he had a scent. No scent. Dang it. Like usually if I'm spelling somebody that means I'm at I'm at a fighting game event. Like oh yeah like Oh yeah. You don't you can't miss that scent. Yeah. I'm at a convention or like or they have something on. Yeah. But if you have nothing on I I'm maybe it's my deviated septum. I don't know. I don't really smell people like that. Yeah. Well um I'll find out one day. Yeah. So sadly. But yeah, maybe one day you'll hang out with I'm sure he's fine with me taking a sniff. See what that's about. So here's the thing, right? Finally, now that the Death",
            "start": 3019.84
        },
        {
            "text": "out one day. Yeah. So sadly. But yeah, maybe one day you'll hang out with I'm sure he's fine with me taking a sniff. See what that's about. So here's the thing, right? Finally, now that the Death Stranding 2 review embargo is up and this song is officially out, I can talk about it with no restraint cuz I've had to play it very safe. Cuz if y'all didn't know the when we first got confirmation that Carolyn Polichek's on the beach is in Desk Training 2. I'm pretty sure that was a breaking embargo situation where somebody had written a thing that they weren't supposed to write. And so me playing it careful, I couldn't actually talk about like when I experienced this in the game. And again, I'm not going to experience I'm not going to ruin the moment for people who want to get there cuz the game's so close. But I will say when I was at Kojima Productions and I was doing the 30-our preview thing, right? I I hit the song, I immediately like I'm like, \"Oh, oh shit.\" Like I had like a moment",
            "start": 3061.52
        },
        {
            "text": "so close. But I will say when I was at Kojima Productions and I was doing the 30-our preview thing, right? I I hit the song, I immediately like I'm like, \"Oh, oh shit.\" Like I had like a moment I'm like, \"Oh fuck.\" Like Carolyn Pchek is in the game. I immediately take off my headphones like in a cold sweat. And I take out my headphones, pause the game, and I look at my I like pick up my phone or I walk away cuz we couldn't have our phones at the stations. I walk away and I start texting Greg. I was like, \"Greg, Carolyn Polich has a song in the game. Like, how do we surprise Roger with this?\" And then he ended up not being surprised cuz they reported about it. I wanted him to like experience this in the game. Um, but we were never going to get there. Like too there are too many like things that would have spoiled this for him. But that happened. Um, and like literally like as I'm walking away, Jeff Keley was also at the event. I didn't mention that part, but Jeff Keley was there and",
            "start": 3103.44
        },
        {
            "text": "that would have spoiled this for him. But that happened. Um, and like literally like as I'm walking away, Jeff Keley was also at the event. I didn't mention that part, but Jeff Keley was there and like Jeff Keley looks at me and he's like, \"You hit the you hit the song yet?\" And I was like, \"Jeff, I just I just did it. I'm still I'm still reeling.\" Um, yeah. Like it was a really really cool moment to have that have that experience in real time of like seeing Carolyn Pchek on the beach pop up in the game. [ __ ] mind-blowing. Um, but then this is how you this is how like you know I'm so [ __ ] bad at lying and keeping secrets where I get back here, right? And like I do I do KFD. I do my preview or whatever and then like I come out of one of the shows and I see Roger and like Roger Roger like starts catching up with me and he's like all I did was Carolyn in the game and I looked at Roger and I was like ah ah you know you know we'll see. I wish man I wish I wish she was in the game.",
            "start": 3145.44
        },
        {
            "text": "like starts catching up with me and he's like all I did was Carolyn in the game and I looked at Roger and I was like ah ah you know you know we'll see. I wish man I wish I wish she was in the game. That'd be cool, right? That'd be cool. I don't know how to lie. It was so [ __ ] obvious that she was. And thank God that somebody had leaked that she was in the game because I couldn't have I couldn't have held that much longer. Anyway, more Wii news for you. Uh Nintendo has fixed its London Underground ad which claimed Metroid Prime 4 was out now. Dune Awakening sales surpassed 1 million copies. Uh, Cyberpunk 2077 update 2.3 has been delayed to an unspecified date. Midnight Murder Club launches August 14th on PS5 and PC. THQ Nordic Showcase is set for August 1st at 12:00 p.m. Pacific time. Xbox will be at Gamescom this year. Arc System Works Showcase is set for June 27th at 6 p.m. Pacific time. Uh, 1047 Games, who developed Splitgate 2, has laid off a small number of staff. And then",
            "start": 3192.16
        },
        {
            "text": "Xbox will be at Gamescom this year. Arc System Works Showcase is set for June 27th at 6 p.m. Pacific time. Uh, 1047 Games, who developed Splitgate 2, has laid off a small number of staff. And then finally, this is from VGC. A fan-made Mario Kart 64 PC port has released with a track editor and ultra wide support. And Kevin, if you can pull up one of these videos. This is what I'm talking about right here. That's awesome. You know what I mean? I know I know we're breaking the Nintendo rules or whatever. And like listen, I've not done this. Nintendo, don't come after me. I'm just showing what the internet's showing off. This is [ __ ] awesome. If you're an audio listener, they're playing Mario Kart on ultra wide and it looks incredible. Anyway, I love this and that's it. for we news. Thank you for bringing that up, Kevin. Uh before we hop into you're wrong, let me take one last peek at super chats. Uh Blaster Goblin writes in and says, \"Please give us more KF shows with my best friend",
            "start": 3242.72
        },
        {
            "text": "you for bringing that up, Kevin. Uh before we hop into you're wrong, let me take one last peek at super chats. Uh Blaster Goblin writes in and says, \"Please give us more KF shows with my best friend Jericho, who has apparently ignored my constant ramblings uh about Minds Eye. Keep it keep killing it, homie.\" Oh, yeah. How much support you have in the kind of funny community. Listen, I I I think it's cool. I love it. I But yeah, Blaster Goblin. Me and him go way back now. Mr. Goblin. Mr. Goblin. Yes. Yes. Very apparently really good at Tony Hawk's Pro Skater. That's what he streams a lot of. Wow. Might hold a record. That's what I've been told. I'm like, \"Oh, I didn't even know that about you.\" My bad. Like a combo record or like a score record, something. That's cool. One of those things. I have not touched a Tony Hawk, but you know, touchdowns and skateboarding, I guess. I don't know. Hell yeah. Uh, Kab writes in and says, \"I think Crossworlds has a niche because Mario Kart has moved",
            "start": 3289.6
        },
        {
            "text": "I have not touched a Tony Hawk, but you know, touchdowns and skateboarding, I guess. I don't know. Hell yeah. Uh, Kab writes in and says, \"I think Crossworlds has a niche because Mario Kart has moved away from the threelap circuits. A lot of folks are itching for a traditional cart racer.\" I could see it, right? Like I think there could be something there as far as something that is, yeah, a bit more focused, a bit more like separate from Mario Kart. That said, you can have the threelap races in Mario Kart Worlds. You just have to click the track. Just don't click the path through the track. If you're playing online and you're voting, you got to hit the plus button and then hit the specific track. few extra buttons. But yeah, um Jerica, that is it for super chats. Let's hop into kind of funny.com/you wrong where you write in. Let us know what we got wrong as we got it wrong so we can correct it for those watching later on YouTube and listening later on podcast services around the",
            "start": 3332.96
        },
        {
            "text": "of funny.com/you wrong where you write in. Let us know what we got wrong as we got it wrong so we can correct it for those watching later on YouTube and listening later on podcast services around the globe. And Jerica, I'm happy to report we are zero your wrongs in here. The only one I'm seeing is from um Friday's show talking about Wooa, but aside from that, this thing's empty. Someone's probably not trying hard enough. I know, you know, ke back today. Um, Jerica, that brings us to the end of kind of funny games daily. Thank you so much for joining me on this episode. Been been a pleasure. Thanks for having me. We're going to talk a lot more. Yeah. About death stranding too. Yeah. Right after this. Of course. This has been kind of funny games daily. Each and every weekday, we run you through the nerdy news you need to know about live on YouTube, Twitch, and on podcast services around the globe. If you love what we do, support us through the kind of funny membership on Patreon or",
            "start": 3372.72
        },
        {
            "text": "through the nerdy news you need to know about live on YouTube, Twitch, and on podcast services around the globe. If you love what we do, support us through the kind of funny membership on Patreon or YouTube to get all of our shows ad free. Watch us record them live and get a daily exclusive show. Enjoy the games cast next and the stream after. But until next time, game daily. I can't see.",
            "start": 3414.0
        }
    ]
}