{
    "id": 14189,
    "video_id": "anJ-qQUZQOM",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Tim Gettys",
        "Blessing Adeoye Jr."
    ],
    "title": "Outer Worlds 2 is $80, Halo Remaster Teased - Kinda Funny Games Daily 06.09.25",
    "description": "Go to http://kindafunny.com/XREAL to grab yours now!\n\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\nThe Outer Worlds 2 is $80, Halo Remastered was teased by Phil Spencer, and Hollow Knight Silksong’s developer clears up the confusion.\n\nToday after, KFGD, you’ll get:\n- GAMESCAST - Greg played a bunch of games at SGF\n- After Gamescast is Kinda Funny Podcast\n- Then the STREAM is Mario Kart World Open World Collect-a-thon\nIf you’re a Kinda Funny Member:\n- Today’s Gregway is Greg’s 17-minute review of the Xbox’s Games Showcase 2025.\n\nTime Stamps:\n00:00:00 - Start\n00:03:28 - Housekeeping\n         -  The Roper Report   -\n00:07:09 - The Outer Worlds 2 Targets Fall Release And $79.99 Price Point\n00:21:20 - Xbox Boss Phil Spencer Teases Return of Halo in 2026 — and It’s Reportedly a Halo: Combat Evolved Remaster\n00:30:05 - Hollow Knight: Silksong Developer Responds to Release Date Confusion, Promises Launch 'Before Holiday,' Not Tied to Xbox Handheld Arrival\n00:35:33 - Konami is having a showcase\n00:39:50 - Skybound Reveals First In-House Game Development Studio, Quarter Up\n00:45:21 - The coke Walmart sent with the Switch 2 preorders saved this person life\n00:47:24 - Wee News! \n00:52:58 - SuperChats & You‘re Wrong\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1749494137,
    "duration": 4153,
    "transcript_chunks": [
        {
            "text": "Today's stories include The Outer Worlds 2 is $80, Halo Remastered was teased by Phil Spencer, and Hollow Knight Silk Song's developer clears up the confusion. We have all this and more because this is kind of funny games daily. [Music] Yo, what's up? Welcome to Count of Funny Games Daily for Monday, June 9th, 2025. I'm one of your hosts, Blessing Addio Jr. Joining me is Lacroy Poppy Tim Muggin yetis. What a day. So many things to talk about. Yesterday we reacted to the Xbox showcase. That was a a fun little weekend delight. Little little surprise, little delight. Surprise and delight. Yeah, I feel like we've already taken it too far, but I don't think there's any end in sight. Oh, no. I think we're about to be using this [ __ ] like every day this year. I don't know where the the phrase surprise and delight first originated. There's no way they invented it. I feel like I've heard it before Nintendo. Well, they've but they've been using it like for the last for the end of the Switch",
            "start": 7.2
        },
        {
            "text": "surprise and delight first originated. There's no way they invented it. I feel like I've heard it before Nintendo. Well, they've but they've been using it like for the last for the end of the Switch generation. They keep saying it, but they I feel like it was us at the tour of the Nintendo store. Oh, yes. Where they used it where they used it every 10 seconds. And that's what got into all of our heads. I feel like that's some Walt Disney [ __ ] I feel like Walt Disney might have invented it. I think Well, yes, but I mean that they are and now here we are doing it. I need y'all to look up and maybe this year you're wrong. Look up the origin of surprise and delight. Those words said said in that order. Yeah, cuz like it describes everything so perfectly, especially this week. You know what I mean? It's been a surprising and delightful week. Totally. Tim, how you feeling? We just did a lot of content. Excited. We did. Yeah. I'm tired. I'm also tired. I'm feeling good though. It's that",
            "start": 62.24
        },
        {
            "text": "I mean? It's been a surprising and delightful week. Totally. Tim, how you feeling? We just did a lot of content. Excited. We did. Yeah. I'm tired. I'm also tired. I'm feeling good though. It's that good tired. It's not exhausted. It's more just like my voice is a little gone. I'm definitely feeling a little slow. I don't know if y'all have noticed it on content or not. I might have played it off. Out of worse. Uh but no, but it's fun. Good vibes. I I think that we saw a lot of really cool games the last couple days. We're playing a lot of really cool games. Like this is kind of like what dreams are made of when it comes to covering this industry. A console launch. Uh a whole bunch of like great showcases. Like Yeah. Good stuff. Yeah. For me, it's a it's a too many slices situation where I love pizza, but you put you put too much pizza in front of me and all of a sudden I'm like, I can't eat all this pizza. And that's what I'm struggling with is like, you know, too much pizza. It's too",
            "start": 103.84
        },
        {
            "text": "love pizza, but you put you put too much pizza in front of me and all of a sudden I'm like, I can't eat all this pizza. And that's what I'm struggling with is like, you know, too much pizza. It's too much pizza. We're reviewing Death Training, too. I got we got the Nintendo Switch, too, right? Like, we've been playing Mario Kart. Uh Delta I've barely touched Delta Rune. Barely touched my dinner. I've barely touched Welcome Tour. I have touched it, though. Really? I I finally decided that I'm just not I'm just going to skip it. Yeah. Now, what what it was was the IGN review. Yeah, I saw Tom Marks went in. Tom Marks went in. I was like, \"Cool, I don't need to play this.\" He did. Yeah. I I We'll talk more about it when we do our Nintendo Switch 2 review. I I'm still playing more of it, but uh it will not be something I'm completing. I'll tell you that. Oh, wow. It was uh the It's cuz you don't have all the accessories. Uh I do actually, but uh uh it was uh more about just It wasn't",
            "start": 143.04
        },
        {
            "text": "but uh it will not be something I'm completing. I'll tell you that. Oh, wow. It was uh the It's cuz you don't have all the accessories. Uh I do actually, but uh uh it was uh more about just It wasn't really surprising or delightful. Wow. Yeah. Wow. When are we doing the Nintendo Switch 2 review? I think it's Thursday and the Mario Karts Friday or the other way. That's the that original way is correct. There we go. There you go. There you go. So stay tuned. Later this week, we'll be talking all about our Nintendo Switch 2 thoughts. But for now, remember this is kind of funny games daily. Each and every weekday we run you through the nerdy news you need to know about live on YouTube, Twitch, and on podcast services around the globe. If you love what we do, support us with the kind of funny membership on Patreon, YouTube, and now Spotify and Apple Podcast to get all of our shows ad free. Watch us record them live and get a daily exclusive show. For a chance to be a part of the show, some",
            "start": 178.24
        },
        {
            "text": "on Patreon, YouTube, and now Spotify and Apple Podcast to get all of our shows ad free. Watch us record them live and get a daily exclusive show. For a chance to be a part of the show, some of your thoughts and opinions as YouTube super chats as we go. Housekeeping for you. We're in 11 business all about live talk show. So today after KHD, you're going to get Games Cast, which is Greg talking about how he played a bunch of games at SGF, including the Xbox ROG Ally X. I messed that up. ROG Xbox Ally X. Yes. Yes. Exactly. That's going to take some remembering. Here's the thing. the way it's easy to remember. Easy. The way I'm trying to remember, and I'm still gonna mess it up every time, but it's an ally to the Xbox. And Aloy drinks Sprite. Jesus Christ. Jesus Lord. It's not an Xbox alley. Uh, you know what? It's been a long week. Okay, listen. I've been caught in those Xbox alleys before. You don't want to be there. You don't want me there. You don't want to be there. After Games Cast",
            "start": 218.32
        },
        {
            "text": "Uh, you know what? It's been a long week. Okay, listen. I've been caught in those Xbox alleys before. You don't want to be there. You don't want me there. You don't want to be there. After Games Cast is the kind of funny podcast. Then the stream is Mario Kart World. And I believe it's Mike just hanging out in the open world doing the the PB blocks. We'll see how long that lasts. Uh and then if you're a kind of funny member, today's Greg Way is Greg's 17minute review of Xbox's Games Showcase 2025. Thank you to our Patreon producers Carl Jacobs, Omega Buster, and Delaney Twining. Today brought to you by XRel and Factor. But we'll tell you about that later. For now, let's begin with what is and forever will be the Roper Report. D. It's time for some news. We have seven stories today does it. I was reading one of Jean Park's [ __ ] articles on Washington Post. Yeah. And I have now gotten an email at least one a day from Washington Post for the last week. That's how it goes. And I get it.",
            "start": 266.72
        },
        {
            "text": "I was reading one of Jean Park's [ __ ] articles on Washington Post. Yeah. And I have now gotten an email at least one a day from Washington Post for the last week. That's how it goes. And I get it. I totally get it. We're struggling out here. But like yo, y'all need to be a little cooler than you're being. Let me tell you about this website called The Verge cuz I wanted to read one of was it Tom Warren? Yeah, I wanted to read one of Tom Warren's like blogs or whatever and I signed up for it like just once because there was a news story that was in there and now I just get constant emails. It's funny. It's funny because like this happens I think once every two days somebody in some way shape or form whether it's in a community place like a Reddit or something or straight up like email us or or uh social media us in some way they get so upset that all of our videos on our YouTube channel are behind a membership. Yeah. And it's because of how YouTube has any video we do live, which is",
            "start": 316.8
        },
        {
            "text": "or or uh social media us in some way they get so upset that all of our videos on our YouTube channel are behind a membership. Yeah. And it's because of how YouTube has any video we do live, which is everything that we do on the live tab instead of videos, which is infuriating and something we can't change and something that I've talked to YouTube and begged them to fix, but they're just like, \"Sorry, sorry. Sorry.\" Uh, sad face. So, it's like I understand the frustration. I know what they're feeling cuz it's what I'm feeling getting these Washington Post emails. Mhm. Did you just open one? What sparked this? I just got Yeah, I literally right now got a notification. They're not even trying. Like, they're not enticing me at all with this [ __ ] Washington Post. I don't know, man. Try harder, dude. Shout out to their podcast, The Seven, that I listen listen to every morning. It's the seven news stories uh in like 10 minutes, 10-minute podcasts. Very convenient, but also nowadays very",
            "start": 355.36
        },
        {
            "text": "dude. Shout out to their podcast, The Seven, that I listen listen to every morning. It's the seven news stories uh in like 10 minutes, 10-minute podcasts. Very convenient, but also nowadays very depressing. Yeah, I had I had to take a break this these last few weeks cuz everything, let me tell you, this Donald Trump guy up to no good. Up to no good. This Elon Musk guy up to no good. Threatening a civil war and then threatening that he's the only one with the spaceships. I don't like that at all. Oh, I missed that part. Oh, yeah. Was that a recent one? That was yesterday. Oh, yeah. See, I didn't listen to I haven't listened to my my news podcast cuz I've been getting so sad. Um, but guess what? We got happy news here. Well, god, we got news, man. Story number one, the world. What you just said, we're that for these people. They have to listen to us talk about bad game news every day. Story number one, Outer Worlds 2 targets fall release. Yay. And it has a 79.99 price point. Damn. Uh,",
            "start": 394.88
        },
        {
            "text": "said, we're that for these people. They have to listen to us talk about bad game news every day. Story number one, Outer Worlds 2 targets fall release. Yay. And it has a 79.99 price point. Damn. Uh, this is from Matt Miller at Game Informer. Today's Xbox game showcase, of course, is from yesterday. opened with an in-depth trailer featuring The Outer Worlds 2. Obsidian's big sequel is looking quite strong in the new video, which features several new tools and twists we haven't seen yet. We were also treated to a release date. The Outer Worlds 2 releases on PlayStation 5, Xbox Series X/S, and PC on October 29th. Over the course of the trailer, we see the colony of Arcadia is undergoing an invasion, and it appears that the story will jump ahead from the beginning of that war to a point nearly 3 years in. voiceover from villainous CEO Auntie Cleo leans hard into the dark satirical elements that the first game established around the nature of capitalism. The gameplay that follows shows off",
            "start": 432.24
        },
        {
            "text": "3 years in. voiceover from villainous CEO Auntie Cleo leans hard into the dark satirical elements that the first game established around the nature of capitalism. The gameplay that follows shows off uh some of what made the first game in the series entertaining but seemingly amped up to a significant degree from the use of freezing effects and shrink rays to all sorts of over-the-top explosions. After the showcase, The Autoorlds 2 saw an update to its Steam page that confirmed that the game is set to release at a $79.99 price point. Tim, so I have a question that I can't find the answer to. Mhm. I seem to remember Outer Worlds one being a relative budget title. Was it not $40 or $50? I don't remember that. I feel like it was $60, but kind of funny.com/you wrong. I'm trying to I I can't find any info. It's hard to tell cuz everyone's talking about this um this price. But yeah, if you could look into that, y'all, I would appreciate that cuz that I also think is extra fuel to the fire",
            "start": 475.52
        },
        {
            "text": "find any info. It's hard to tell cuz everyone's talking about this um this price. But yeah, if you could look into that, y'all, I would appreciate that cuz that I also think is extra fuel to the fire here of like, oh damn. And look, sequels can be that much bigger and require that much more. And like that's has happened before and like it's not necessarily a bad thing. Obviously, this $80 conversation we're having with games right now is frustrating at the least and not fun because it feels like we're going to be stuck in this conversation ad nauseium about every single title that comes out and having to debate why this and not this and all of that. Xbox has said in the last couple months that it's pushing its games up to 80. So, this isn't a surprise. It's just I think unfortunate that this title is the first one that they're that they're doing that with. Yeah. Um, on the Nintendo side, like so far the only game officially priced, not collector's edition or anything at $80 has been",
            "start": 529.6
        },
        {
            "text": "this title is the first one that they're that they're doing that with. Yeah. Um, on the Nintendo side, like so far the only game officially priced, not collector's edition or anything at $80 has been Mario Kart World. And I've been playing the hell out of that game. We'll do a review later in the week, but like definitively it's [ __ ] That game is $80. Like, I am loving it. I'm enjoying the hell out of it. I'm putting many hours into it. I think I'm 20 hours in at this point, and I'm going to put many more, like double that, I think, in the next couple weeks. Uh but $80 for what we're given doesn't feel right to me. And so looking at uh this, it's like this does look bigger and more substantial than even Outer Worlds one. But $80 just is it's not great no matter what way you shake it. But it does feel like this is about to be the standard. And I think that Outer Worlds is just unfortunately the first one out the door. Yeah. I mean, yeah, this is going to be a standardized thing,",
            "start": 576.72
        },
        {
            "text": "But it does feel like this is about to be the standard. And I think that Outer Worlds is just unfortunately the first one out the door. Yeah. I mean, yeah, this is going to be a standardized thing, right? like Xbox is going to do it in the same way that we saw all the games companies push up their games to $70. Like it is now becoming a rapid thing of okay cool like the dams have been broken with 80. We're all going to go up to 80. I'm I don't know what kind of Mandela effect thing is going on in chat right now because nobody can figure out how much Outer Worlds one was at launch because I've seen 60. I've seen 40. I've seen 50 and people keep going back and forth. Either way though I mean none of those prices are full price that like I feel like I mean 60 was full price or one 2019. Yeah. I guess you're right. Yeah. Oh, yeah. Because now we're talking about 80. There was a 70 option. This should still 70 wasn't until Yeah. Like, you know, this generation kingom. Yeah. Yeah. Um I I I",
            "start": 623.76
        },
        {
            "text": "I guess you're right. Yeah. Oh, yeah. Because now we're talking about 80. There was a 70 option. This should still 70 wasn't until Yeah. Like, you know, this generation kingom. Yeah. Yeah. Um I I I get into like a circular thing with this like the the talk of $80 and where I come down with it because I think on there there's going to be multiple hands here, right? On one hand, um, video games over the years, over the decades, have be have gotten a lot more technically complex. They've gotten a lot bigger. They've gotten a lot deeper. And the prices have stayed the same through the decades. And so, when you look at a video game today versus what we got in 2008, naturally, I do think prices of video games probably should increase. Now, that is also the part of me that wants that money to go to the labor that's being put into making these video games and the people that are actually doing that. In reality, that's not who this is going to, right? Like the money is going to shareholders.",
            "start": 664.56
        },
        {
            "text": "to the labor that's being put into making these video games and the people that are actually doing that. In reality, that's not who this is going to, right? Like the money is going to shareholders. The money is going into I think also the technical budgets of like what it like the amount of time it takes to make these things and pay people for five to six years of making a game as opposed to three years of doing it, right? And the amount of people that are required to make the games. We're not talking about tiny teams. And even when we are talking about tiny teams, there's the reality of the freelancers and just like kind of third party uh services that need to be hired and paid for and all of that adds up to a lot of money. So then I hop into the consumer side and the consumer frustration that the audiences have about this, right? And I think there is I think the frustration comes from two places. I think it comes from both. Oh man, prices of video games are rapidly increasing and",
            "start": 714.32
        },
        {
            "text": "that the audiences have about this, right? And I think there is I think the frustration comes from two places. I think it comes from both. Oh man, prices of video games are rapidly increasing and that [ __ ] sucks for me because I look at my wallets and I go, I don't have the amount of money to afford this. And I think that frustration has been pointed a lot to the video games and to the video game companies. I think part of that is warranted and is valid. But I also think it's the fact that people aren't making as much money overall as they should be, right? The economy overall is in a very bad place. And so we're focused in on video games because that is our job. We're here to talk about video games, but overall, I feel like a lot of luxury items are just going through this as far as, oh man, I want to enjoy life. I want to do this thing that I'm that gives me joy, that I'm passionate about. I just can't afford it anymore because guess what? Capitalism has [ __ ] rained down. I",
            "start": 749.84
        },
        {
            "text": "oh man, I want to enjoy life. I want to do this thing that I'm that gives me joy, that I'm passionate about. I just can't afford it anymore because guess what? Capitalism has [ __ ] rained down. I know. Yeah. And to your point, that's true across every single form of these of entertainment. Movie prices, book prices, like any media at all is going up. Subscription prices for things. And yeah, there are ways to offshoot this like things like Game Pass where yeah, you compare buying $80 for Outer Worlds 2 or you subscribe to Game Pass, you don't own it, but you get access to play Outer Worlds 2 and every other game that Xbox is putting out, which at this point when they own half the [ __ ] world, it's going to be a lot of games, but that is still something that even that the price is going up and up and up, and there's no end in sight to that. There never will be. Barrett. Uh yeah, not just the sweet treats uh uh of capitalism are going up in price, but cost of living has constantly",
            "start": 788.72
        },
        {
            "text": "up and up and up, and there's no end in sight to that. There never will be. Barrett. Uh yeah, not just the sweet treats uh uh of capitalism are going up in price, but cost of living has constantly been going up as well and wage growth has stagnated. So that's like the that's the big uh kind of uh choke or not chokeold but like the the strain people are feeling because the percentage of what they need to use for their um their paychecks is going more and more and more to uh being able to feed themselves and their families and being able to live where they need to live uh to make money, right? And so less of that percentage like the percentage of being able to buy your sweet treats is going less and less and less and making people a bit more frustrated. Um, and yes, we should have that energy in to in terms of the prices going up for entertainment stuff, but I think I think there's a disproportionate anger towards that specifically and not seeing the the whole pie. Um, and so just just",
            "start": 831.28
        },
        {
            "text": "in to in terms of the prices going up for entertainment stuff, but I think I think there's a disproportionate anger towards that specifically and not seeing the the whole pie. Um, and so just just a reminder of that stuff. Yeah. And to bring it back to the game pass thing, right? I think right now for where we're at in the world economically and where video games are at in terms of what we've been talking about a lot in the last couple years as far as the stagnation stagnation of the video games business, right? And how you're seeing a lot of money, a lot of shareholder money being pulled away as things start to level out and video games aren't like ballooning ballooning ballooning as far as how much money is coming in, right? Like things change and shift and there are going to have to be strategies put in place by people like Xbox, right? to go, [ __ ] how do we get our games into more people's hands, right? And that's where Xbox Game Pass um comes in. And also, that's where Xbox",
            "start": 878.64
        },
        {
            "text": "be strategies put in place by people like Xbox, right? to go, [ __ ] how do we get our games into more people's hands, right? And that's where Xbox Game Pass um comes in. And also, that's where Xbox Game Pass finds a lot of its value. This Out of Worlds 2 going to $80 in price makes Xbox Game Pass a more valuable proposition. And that is kind of like the double-edged sword of it of like how Xbox has to [ __ ] balance, and how we have to look at it, right? But like, and it's going to sell great on PS5 at $80. Do you think so? Yeah. I wonder. See, that's the thing that I think about is what does every all these video games going up in price do for the sales of video games? Because I think for me when I think about I'm and we're all here in a very blessed place as far as getting codes and like I don't have to think as much about like buying every single video game, right? Because the big ones oftentimes we might get a copy unless you're Nintendo. Um, but I look at Outer Worlds 2 and I",
            "start": 923.44
        },
        {
            "text": "like I don't have to think as much about like buying every single video game, right? Because the big ones oftentimes we might get a copy unless you're Nintendo. Um, but I look at Outer Worlds 2 and I think back to where I was at in 2019 before I worked here, right? $60. Oh yeah, I could buy Out of Worlds too because I got Best Buy Gamers Club U unlimited. So like really I'm getting it at $45, $50 as opposed to $60. I can swing that. Once I start to look at it and go, uh $80 for Outer Worlds for an Outer Worlds game. I don't know, man. I feel like that's a I understand people that are like, I can't do that. Like I'm not I got to pick and choose now. There are more and more options though to be able to play games like whether it's Game Pass or GeForce Now and all these other things. It's like they're Well, that's different from buying it on PlayStation, you know? It totally is. That's what I'm That's what I'm wor or not worried but wondering about. Yeah, exactly. But I I think the",
            "start": 965.52
        },
        {
            "text": "like they're Well, that's different from buying it on PlayStation, you know? It totally is. That's what I'm That's what I'm wor or not worried but wondering about. Yeah, exactly. But I I think the people that have bought the place people there's a a group there are many groups of people that have made up their mind and are committed to something and they're going to stay with that to the end. And I think that the amount of people that bought a PS5 that do have enough money and still have enough money to be able to buy games at $80 are going to continue to do that. I think that those numbers do make up for the people that aren't going to and that sucks for the people that can't and don't want to because they will get priced out and they will not be thought of like they if you are not willing to spend the money unless you find a way to get give the big companies money in a different way. The companies do not care about you and they're not incentivized to. So I yeah I don't see this",
            "start": 1008.08
        },
        {
            "text": "to spend the money unless you find a way to get give the big companies money in a different way. The companies do not care about you and they're not incentivized to. So I yeah I don't see this ending well and I I don't see this ending with like a reset point of oh we're bringing all the prices down. It's not gonna happen. Like $80 is gonna become the new normal and we're just gonna have to deal with it. Uh I want to bring in some super chats because people have a lot to say here. Um I Casper 87 writes in and says, \"Surprised Microsoft waited long to do this to force uh to force Game Pass.\" How do you feel about that? Say it again. Uh they're surprised Microsoft waited long to do this to force Game Pass. I think they're looking at it from the perspective of like, oh, us raising our prices of our games is going to drive more people into the Game Pass thing. I Yeah, I think that that's a happy accident to to put it in Yeah. some words like Yeah. I don't think that that was the plan. No,",
            "start": 1047.2
        },
        {
            "text": "of our games is going to drive more people into the Game Pass thing. I Yeah, I think that that's a happy accident to to put it in Yeah. some words like Yeah. I don't think that that was the plan. No, but I also do think that I think honestly Game Pass is all maybe more of a contingency of like, hey, games are going to this shit's going to get more expensive. People aren't going to be able to afford all these things that we're doing. What are deals that we can put in place to try and get more people in on like just a a player numbers perspective? Yeah. Um, Dear Sixlet writes in and says, \"I wonder if the cost of games is going to radicalize a population of gamers.\" It's terrifying. I hope not. And I also don't think so. That's radicalized, but in a different way. Yeah. I mean, it's not Here's the thing, right? It's, and this goes back to the top of this conversation, it's not just video games. People are going to get radicalized to this [ __ ] but like video games are are a facet of",
            "start": 1091.84
        },
        {
            "text": "the thing, right? It's, and this goes back to the top of this conversation, it's not just video games. People are going to get radicalized to this [ __ ] but like video games are are a facet of it, right? Because this goes back to, hey, people deserve to be able to afford um things that are for their entertainment, things that are for their relaxation, right? Just because something isn't food or water doesn't mean that, oh, you know, people don't need this [ __ ] right? As long as you can afford food and water, you're good. It's like, no, if people can't afford their entertainment, also that's going to drive people to the wall. Like, that's going to do a lot as far as like, yeah, the radicalization of people. I think it's way way beyond video games as far as I'm concerned. We're getting into a weird it's a wild conversation now. Um, Dolphin Corn writes in and says, um, Elder Ring Night Rain and Expedition 33 were $50 and I put 60 plus hours in them. Yeah, they those are games that had",
            "start": 1135.84
        },
        {
            "text": "a weird it's a wild conversation now. Um, Dolphin Corn writes in and says, um, Elder Ring Night Rain and Expedition 33 were $50 and I put 60 plus hours in them. Yeah, they those are games that had the luxury and luck to be able to do that though in different ways. Like I that is not going to be the the norm and expedition 33 is on Game Pass. Mhm. Yeah. I I mean I think I'm of the mind that indie titles like th those premium indie titles that we see the Expeditions of the world, the um Hades of the world, Hollow Night Silk Sun coming up. I know some of these are on Game Pass, but I think those games are going to be very important as far as kind of like leading the charge for what video games what video game success looks like going into the future when you're not beholdened by like big corporation and like having to like, you know, have money to give to shareholders and like be beholden to these things, right? I a Balders Gate 3 is another one I I throw into that as far as oh, we have",
            "start": 1178.4
        },
        {
            "text": "and like having to like, you know, have money to give to shareholders and like be beholden to these things, right? I a Balders Gate 3 is another one I I throw into that as far as oh, we have the freedom to kind of do what we want here and price things where we want and we might not make as much as a [ __ ] Call of Duty, but a lot of people Those are games are going to end up being popular because they're accessible to people. I think that's how a lot of this is going to go. Uh Chris Smith says, \"Outer Worlds 2 is four months of Game Pass. Nobrainer again.\" Yeah, Game Pass Paris Lilly will tell you tell you himself is the best deal in gaming. And it it only continues to be more and more true. Yeah. Like they just at this point they have so much that Yeah. It is the best value in gaming. Yeah. But I I yeah you know that's all I'm going say. Moving on to story number two. Xbox boss Phil Spencer teases return of Halo in 2026 and it's reportedly a Halo Combat Evolved remaster. Uh this is",
            "start": 1227.52
        },
        {
            "text": "But I I yeah you know that's all I'm going say. Moving on to story number two. Xbox boss Phil Spencer teases return of Halo in 2026 and it's reportedly a Halo Combat Evolved remaster. Uh this is from Wesley Yinpool at IGN. Microsoft is reportedly set to release a Halo Combat Evolved remaster in 2026. During the Xbox Game Showcase 2025, Microsoft gaming boss Phil Spencer teased a number of new games coming out next year, including the new Fable, The Next Forza, Gears of War Eday, and quote, \"The return of a classic that's been with us since the beginning.\" While that's an obvious tease for Halo, The Verge reporter Mark Mark Warren or Tom Warren, I'm going to say Tom Yeah, Tom Warren. Tom Warren, uh, has said it Yeah. Who's Mark has said it specifically relates to a Halo Combat Evolved remaster. Warren had reported on the existence of this game before which is apparently under consideration for release on rival platforms including PlayStation 5. Uh Tim, we talked about this on our",
            "start": 1272.4
        },
        {
            "text": "remaster. Warren had reported on the existence of this game before which is apparently under consideration for release on rival platforms including PlayStation 5. Uh Tim, we talked about this on our reactions yesterday. Um how do you feel about the reports? Love it. I mean I think it's the right move. I think it's inevitable and next year makes so much sense. Uh with it being the 25th anniversary of Xbox and Halo Combat Evolved. I think them being able to have a year that does have Halo Gears for that's special. That is Xbox. And you know, Gears and Forza haven't been around for 25 years, but close to it. And uh I guess Forza has um Wait, no, that was probably Gotham. Wait, you said been around for 25 years? Yeah, Gears hasn't. Well, Gears came out on 360. Oh, you said you were saying it. Okay, I see what you're saying. Yeah, I thought you meant like they haven't had entries in 25 years. I'm like, I thought Gears came out like totally. I mean, it's the the 25th anniversary of Xbox and",
            "start": 1323.76
        },
        {
            "text": "Okay, I see what you're saying. Yeah, I thought you meant like they haven't had entries in 25 years. I'm like, I thought Gears came out like totally. I mean, it's the the 25th anniversary of Xbox and Halo. It's not the 25th anniversary of Gears and Forza. I feel you. Forza is it though? When was the first Forza? I remember there was Forza and Project Racing and something happened at Project. Forza Motorsport One came out in 2005. Okay, cool. So, yeah, a little bit later, but that you know closer to that 360. So, either way, when we think of Xbox, those are the franchises that we we name. So, um the big dogs and having a year with all of them, I think is killer and it's going to going to be great for them. They'll be able to celebrate in a big way. 25th anniversary is a quarter of a [ __ ] century, you know? Let's go. Let's go. So, I love that. And also, I I firmly believe a remake of Halo 1 is the best step, the best next step for Halo. Yeah, I was going to say like or I was going to",
            "start": 1372.64
        },
        {
            "text": "century, you know? Let's go. Let's go. So, I love that. And also, I I firmly believe a remake of Halo 1 is the best step, the best next step for Halo. Yeah, I was going to say like or I was going to ask you actually, what does this do for Halo as a franchise? It's been a rocky decade. It's been a rocky time, right? Halo Infinite, I still stand by like I'm a Halo Infinite truther. That game [ __ ] rocks. But yeah, we all agree that the post-launch wasn't as engaging as it should have been. Does Halo Combat Evolved come out next year? And is that the the does it end up being the spark that Halo needs as far as getting people back on board? I don't know that we can have this conversation again. You know what I mean? Oh, be another year of this conversation. I know. I know. And it's it's inevitable to just go on and go on. I think that we've kind of proven that the the glory days of what Halo used to be, we're not going to be back there. I I just don't think uh it would take something so",
            "start": 1412.08
        },
        {
            "text": "to just go on and go on. I think that we've kind of proven that the the glory days of what Halo used to be, we're not going to be back there. I I just don't think uh it would take something so radical and god such a broken record here, but really it would require a God of War 2018 Breath of the Wild style reinvention of the entire thing that people buy into. And we can't even fathom what that looks like because I feel like there's such a uh a tall order of things they need to figure out in order for that to be the case in a world where we're talking about a first-person shooter. Mhm. And like first-p person shooters have been revolutionized how many goddamn times at this point? Like I don't think it's easy and it might not even be possible. So taking all that out of it, what's the best you can do to maximize what you have? And it doesn't need to be the number one biggest thing of all time, like people's top 10 favorite game ever, but just a really damn good time and uh bringing back",
            "start": 1459.6
        },
        {
            "text": "can do to maximize what you have? And it doesn't need to be the number one biggest thing of all time, like people's top 10 favorite game ever, but just a really damn good time and uh bringing back some classic feelings and, you know, allowing people to just be positive about it instead of like it being this negative conversation of it not being good enough or at this or that or whatever. Just believing in what it is. Mhm. Um, and I I think that step one to that is a Halo one remake that is on all consoles. That's crazy. Like it's crazy to think about a Halo one coming to PlayStation, coming to Switch. I know. And I feel it's inevitable. Like that's what's going to happen. I mean, the fact that Gears is doing it later this year, right, makes it an inevitable. Yeah. Still Nintendo. We'll get on Nintendo. Oh, you Yeah. Well, Reload was going it's going to come to Nintendo. I mean, I I was very sure a week ago that we were going to know a lot more about Switch 2 third party ports than we",
            "start": 1502.16
        },
        {
            "text": "on Nintendo. Oh, you Yeah. Well, Reload was going it's going to come to Nintendo. I mean, I I was very sure a week ago that we were going to know a lot more about Switch 2 third party ports than we do now. So, I'm backing off just a little bit of of how steadfast I am about some of this stuff. What do you want out of a Halo Combat Evolved remaster? Do you expect it to look like a 2025 video game? Cuz like we got Master Chief Collection last last gen. Yeah. Last generation. And that had a remake one. remaster. How do you step that forward? How do you make this something worthwhile for you? I mean, Unreal 5, I think, will go a long way. But really, it's I think there are certain games that can just be remade every couple generations because they are that important and iconic and people care and technology grows and it's fun to see things in new ways. I don't think every game needs that. I understand people are going to be like, I want new IP. I want new IP. You're getting new IP. We're",
            "start": 1544.0
        },
        {
            "text": "and technology grows and it's fun to see things in new ways. I don't think every game needs that. I understand people are going to be like, I want new IP. I want new IP. You're getting new IP. We're also going to get a lot of sequels. You're also going to get a lot of remakes and reboots. And I feel like Halo is an example of a game that is worthy of that. And I think that is the right step. And we're going to get the next one after that. Hell yeah. Tim, we got a lot more to talk about on the show. But before we do, I want to tell you about patreon.com/kindfunn and youtube.com/confunname where you can go and get the kind of funny membership which allows you to get shows adfree. And speaking of ads, let us tell you about our sponsors. This episode's brought to you by XRE. Y'all know that a few months ago, my life changed forever when I brought a pair of X-Real 1 AR glasses on a long flight to New York. I legit could not believe how easy it is to use and high quality my experience was",
            "start": 1591.52
        },
        {
            "text": "a few months ago, my life changed forever when I brought a pair of X-Real 1 AR glasses on a long flight to New York. I legit could not believe how easy it is to use and high quality my experience was playing games, watching movies, TV shows on the plane without just too much extra stuff around me or especially not a giant goofy headset around my head. No joke, this is my favorite new tech product in years and it has earned a permanent spot in my travel bag. It is only hard to believe that it works as well as I'm saying until you try XR1 AR glasses for yourself. And then you will see that the future is now. The tech is here. Connect XR1 glasses to wherever you are playing. Whether it's a handheld console, a PC, phone, home console. You just get a massive 150in virtual screen anywhere, anytime for any game. Gaming on the go like a long haul flight, you need the XR1. neck. Starting to hurt from staring down at your handheld? We've all been there. You need a next real one. A screen as big",
            "start": 1633.12
        },
        {
            "text": "for any game. Gaming on the go like a long haul flight, you need the XR1. neck. Starting to hurt from staring down at your handheld? We've all been there. You need a next real one. A screen as big as your wall. Instant plugandplay with all of your devices via USBC. Built-in audio with sound by Bose anchoring your screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full HD. These are what make XR1 a musthave. And we hear XR1 Pro is coming soon with an even bigger virtual screen. Hit our link below to get your XR glasses today. There's nothing better than when a sponsor of Kind of funny is something that we are legitimately obsessed with. And that is exactly the case here with XRE. You're going to hear me talk about these forever. Go to kind offunny.com/xreal. That's kind of funny.com/xre. I promise you, you are going to love these things. This episode's brought to you by Factor. Summer GameFest is here. The Switch 2 is here. The sun is here. So many summer",
            "start": 1683.68
        },
        {
            "text": "kind of funny.com/xre. I promise you, you are going to love these things. This episode's brought to you by Factor. Summer GameFest is here. The Switch 2 is here. The sun is here. So many summer things are here and the number one thing you don't want to be doing all summer, spending hours cooking inside. That's where Factor comes in. Factor chef crafted dietitionian approved meals are ready in just 2 minutes. Taking the hassle out of eating well. We love Factor here at Kind of Funny and Greg's often making and enjoying meals quick in between shows here in the studio. I just had a roasted garlic chicken m and I'm telling you, you would have loved it. Factor meals arrive fresh and ready to eat. Perfect for any active lifestyle over summer and beyond. With 45 weekly menu options, you can pick gourmet meals that fit your summer gains and goals. Choose from options like calorie smart, protein plus, keto, and more. Get started at factormeals.com/kindfunny50 off and use code kind of funny 50",
            "start": 1732.84
        },
        {
            "text": "gourmet meals that fit your summer gains and goals. Choose from options like calorie smart, protein plus, keto, and more. Get started at factormeals.com/kindfunny50 off and use code kind of funny 50 off to get 50% off plus free shipping on your first box. That's kind of funny off at factormeals.com/kindfunny50 off for 50% off plus free shipping. backtomails.com/kindfunn 50 off and we're back with story number three. Hollow night silk song developer responds to release date confusion promises launched before holiday not tied to Xbox handheld arrival. This is Tom Phillips at IGN. The developer of Hollow Night Silkong has addressed the game's brief appearance yesterday at Microsoft's Xbox Game Showcase 2025 when it popped up alongside the new ROG Ally X handheld. During the show, Xbox President Sarah Bond stated that Silkong would be quote available at launch and in Game Pass when Ally releases later this year. End quote. leading many fans to believe the game was being lined up to arrive",
            "start": 1775.68
        },
        {
            "text": "Sarah Bond stated that Silkong would be quote available at launch and in Game Pass when Ally releases later this year. End quote. leading many fans to believe the game was being lined up to arrive specifically as a launch title for the new hardware, which has a holiday 2025 launch window. But this isn't the case. Silkong developer Team Cherry has now said uh or yeah, this isn't the case. Uh, Team Cherry has now said uh, writing on the game's official Discord in messages seen by IGN, Team Cherry marketing manager Matthew Leth Griffin stated that Silkong was not sat waiting for the ROG Ally X to launch and that the game would arrive before the holidays. Quote, I confirmed before holiday, Griffin wrote, adding, quote, we are not tied to a console release. End quote. And just in case of confusion, when asked which holiday he was referring to, Griffin added, quote, Christmas. Yes. end quote. I love that clarification. Great for us. Can I tell you? Yes. These Silk Song fans, there's some",
            "start": 1830.64
        },
        {
            "text": "when asked which holiday he was referring to, Griffin added, quote, Christmas. Yes. end quote. I love that clarification. Great for us. Can I tell you? Yes. These Silk Song fans, there's some freaks. They are some freaks. And I get it. I have We all have games that we're freaky about. Mhm. We all have games that we're freaks for. But the Silk Song freaks have been going through it cuz didn't didn't we already know this game was coming out in 2025? I mean, in the Nintendo Direct, wasn't there like the montage and they said Silk Song, it's 2025. The thing is, until there's an actual date on the thing, all of those things just feel like good news as opposed to promises in my opinion. And even with a date, a promise, what does that mean these days? But I feel like reiterating different forms of 2025 before Christmas. We're now 6 days earlier. Bless freaky behavior. Yeah, I get it. Freaky behavior. certain games after they're being waited for and shown off as often as these games have or",
            "start": 1877.12
        },
        {
            "text": "of 2025 before Christmas. We're now 6 days earlier. Bless freaky behavior. Yeah, I get it. Freaky behavior. certain games after they're being waited for and shown off as often as these games have or not often as they have but for as long as they have in places of prominent positioning. Hollow Knight was positioned as a big deal years ago. So that's why I think it's getting the conversation and it's a great game, but you only see this level of fervor around like Elden Ring, Kingdom Hearts, and Hollow Knight, you know? Yeah. Can you name other games that are in that level of no matter what showcase it is, even if it doesn't make any sense, the entire chat's just going to be like Sonic Revolution? Well, Sonic Revolution. Sonic Revolution. Um, I started playing I don't know if I've talked about this. I must have talked about this on content. I started playing Hollow Knight a couple weeks ago on my Steam Deck. It's a good game. Good damn game. Yeah, you're you're Metroid Vania Poppy. I am.",
            "start": 1925.92
        },
        {
            "text": "this. I must have talked about this on content. I started playing Hollow Knight a couple weeks ago on my Steam Deck. It's a good game. Good damn game. Yeah, you're you're Metroid Vania Poppy. I am. I am. There's something about Hollow. I love Hollow Knight is the game that every single thing about it is made for me. The visuals are the most my style thing. It's a beautiful video game. Everything about I love the character design. Like I love it. There's just something about how open it is and that like it is that there's something very telling to me that all the soul sickos this is their Metroid Vania. You know, I like difficult Metroid vanias, but there's some in Hollow Night. I've tried it tried starting it like four or five times and it just I give up on it at a certain point and I don't know why that is. I mean it is it's a me problem. I don't but I don't know what the problem with me. But I do feel you as far as the openness of the map cuz I have it all the time and this is one",
            "start": 1976.0
        },
        {
            "text": "know why that is. I mean it is it's a me problem. I don't but I don't know what the problem with me. But I do feel you as far as the openness of the map cuz I have it all the time and this is one of the reasons why Metroid vanias aren't I like Metroid vanias. They aren't like my genre as far as like what I run to what I flock to. And it is that feeling of all right I just got done with this major goal. A [ __ ] where do I go now? I hit all these paths. All right I'm going to go to all these dead ends. Ah, I'm missing it. Oh, turns out it was just this one turn that I just I forgot to make. Right. And that's a skill issue. That's definitely a me issue, right? But like it's not I don't necessarily love that experience when I'm having it, right? Like I I and I I think Hollow Knight for me, it's telling how good of a game it is where I push I push past that anyway. But I do I also at the same time think it's one of the worst offenders for me in that cuz it is so open. Like I'm three, four",
            "start": 2018.4
        },
        {
            "text": "telling how good of a game it is where I push I push past that anyway. But I do I also at the same time think it's one of the worst offenders for me in that cuz it is so open. Like I'm three, four areas in now and I have so many different ways to go and I'm like scared to go any of those directions cuz like I don't want to forget about another direction. My wish, my request for every Metroid Vania and I think Prince of Persia Lost Time or The Lost Crown did this. Let me scribble on the map. Let me take notes on the map. Let me like put a stamp like a manual stamp. Like don't automate it for me. Let me just put like a note for myself being like, \"All right, hey, I can't go this direction because owl man is blocking this.\" Always the owl. I can't jump high enough. I probably need to need a dash over here. Let me scribble on the thing. That's my one request for every every metro vania. Yeah. Yeah. Holiday and animal well are the two for me that I'm like, there's something in me that's",
            "start": 2057.6
        },
        {
            "text": "a dash over here. Let me scribble on the thing. That's my one request for every every metro vania. Yeah. Yeah. Holiday and animal well are the two for me that I'm like, there's something in me that's broken. Animal should be my [ __ ] Yeah. I'm surprised Animal Well didn't didn't hit for you. I know. Story number four. Konami is having a showcase. This comes directly from a press release. Tune in live for the official Konami press start live stream event featuring game updates and appearances from Konami Digital Entertainment developers and producers. The showcase will feature extended looks at Metal Solid Delta Snake Eater and Silent Hill F and more. Thursday, June 12th, 2025 at 6 a.m. Pacific time. The broadcast is planned to be approximately 37 minutes. Tim, Konami is back in the game. They're back. They're back in the showcase game. Yeah. You know, um, God, Konami, some of the most iconic showcases, some of the best showcases of all time, like 2010s, uh, God, when they got Mega 64",
            "start": 2098.08
        },
        {
            "text": "They're back. They're back in the showcase game. Yeah. You know, um, God, Konami, some of the most iconic showcases, some of the best showcases of all time, like 2010s, uh, God, when they got Mega 64 involved, transferring, never forget. Come on. Um, but this is interesting. Greg and I were slacking back and forth trying to figure out like, should we react to this? Like, even not at 6 a.m., but like should we do a Games like should this be a Games Cast episode? Exactly. And I don't think so cuz like the You know what this is going to be? It's like gameplay deep dives on Snake Eater which like we don't really need you know and then Silent Hill F like if someone here was like interested it'd be a little different but I don't think anyone's like I need more of that game that's Raj Porny Rasia right there but I is it though I don't know I don't think so like Silent Hill 2 but he's he's looking forward to F. Yeah, but I don't think he's like I don't think he's a freak about F. Yeah. Yeah.",
            "start": 2148.24
        },
        {
            "text": "right there but I is it though I don't know I don't think so like Silent Hill 2 but he's he's looking forward to F. Yeah, but I don't think he's like I don't think he's a freak about F. Yeah. Yeah. And then All right. There might be more they're saying. So it's like what do you think that more could be? I don't know cuz like the what I feel like we're at a place with Konami that like didn't they announce that octopus game? Did I make that up? There was like a 2D You are right. That was pretty cool. Yeah. I don't know. I don't know if it was 2D but yeah, there was like a Yeah, that's them. Yeah. Metal Gear Solid uh volume 2 for the Master Collection. That's the thing. But like I don't know if now's the time to talk about that if you're pushing Delta. Yeah. But like do I mean Yeah. I guess that has been your solid 4. I feel like that's a major enough announcement that you would try to separate it out from Delta's marketing window. Yeah. I mean, when you think of Konami, there's also",
            "start": 2188.4
        },
        {
            "text": "that has been your solid 4. I feel like that's a major enough announcement that you would try to separate it out from Delta's marketing window. Yeah. I mean, when you think of Konami, there's also like Yu-Gi-Oh and and stuff. And like for a Konami showcase, I could see it. I could see like some weird Yu-Gi-Oh dual links update or some [ __ ] Uh, from the publishing list here from giant bomb.com, you got Survival Kids. Oh, yeah. They are. Didn't that come out? Did that come out? Uh, June 5th. Oh, that might have just come out. Uh, you got a Switch two thing. Yeah. Eden Zero. Uh, Gradius Origins. Gradius. Gradius. Gradius. Uh, and then the other two. So, Sergio says there's a rumored Castlevania project. There's always a rumored Castlevania project. Yeah. And at some point it has to happen. Crossed over with Dead Cells. That was crazy. That was really cool. I would bet you money it would never happen in a Konami showcase. Yeah. that happens at a PlayStation State to play or a",
            "start": 2227.68
        },
        {
            "text": "to happen. Crossed over with Dead Cells. That was crazy. That was really cool. I would bet you money it would never happen in a Konami showcase. Yeah. that happens at a PlayStation State to play or a PlayStation showcase or like a summer game fest or something. Yeah, like Konami showcases have never been bangers. Am I wrong in saying that? I mean, yeah. No, you're not wrong. There were times where there were more exciting things being talked about, but that was a different era. Yeah. And showcases were just different then. Anyways, but yeah. No, in recent times, no, no, no. I want to find I think Noble had a tweet that was pulled from somewhere of like a shot of this showcase like the marketing material for it and them having like Mel your Solid Delta Silent Hill F and then like a box next to those. Um, this isn't it. Maybe scroll down. Is there a second tweet to this? Yeah, that's what I'm thinking of now. Now, I don't know where he pulled this from, but the fact that it's Miller,",
            "start": 2274.8
        },
        {
            "text": "to those. Um, this isn't it. Maybe scroll down. Is there a second tweet to this? Yeah, that's what I'm thinking of now. Now, I don't know where he pulled this from, but the fact that it's Miller, Miller, Delta, Silent Hill F, and question mark and then Anne Moore. Yeah, that question mark box seems like it's going to be a a game as big as those two games. Yeah. And also, it seems like it's setting us up for disappointment. Big disappointment. Yeah. We'll cover this on Games Daily unless something changes. But, um, fair enough. I'm excited. You know, I I want at this point in time when we don't know what that question mark is, I'm excited that Konami is doing a conference cuz that means that we might get volume two of the uh collection. Without it, we wouldn't. Do I expect it? Not really, but like it could be there. I like that. Save like I We just need to free Metal Gear Solid 4. It's just trapped with that cell technology. Cell processor, messed up. Store number five, Skybound",
            "start": 2323.12
        },
        {
            "text": "but like it could be there. I like that. Save like I We just need to free Metal Gear Solid 4. It's just trapped with that cell technology. Cell processor, messed up. Store number five, Skybound reveals first in-house game development studio QuarterUp. Uh, this comes from a press release. Skybound Entertainment, the multiplatform company behind global franchises like Invincible, The Walking Dead, Impact Winter, and hundreds of additional IP, today announced the creation of QuarterUp, the first in-house game development studio at Skybound Entertainment, led by former key members of the Double Helix Games uh Killer Instinct uh development team. This is the the 2013 Killer Instinct from the Xbox One launch. QuarterUp will debut its brutal superhero 3v3 tag fighting game, Invincible Versus, in 2026. Quote, \"Quarterup is the result of a collective passion and desire to create something new, something that gets people out of their seats.\" Uh, said Mike Wlette, executive producer of",
            "start": 2371.68
        },
        {
            "text": "in 2026. Quote, \"Quarterup is the result of a collective passion and desire to create something new, something that gets people out of their seats.\" Uh, said Mike Wlette, executive producer of Invincible Versus/quarterup. We're an instinct-based team that follows our feelings. We're always playing and always testing to create experiences that fans love just as much as we do. End quote. The studio's debut title, Invincible Versus, is the first major game set in the Invincible Universe based on the acclaimed comic book series by Robert Kirkman, Cory Walker, and Ryan Oughtley. Tim, Skybound creating a game studio. They're in their own in-house development studio, and their first game is a fighting game from former Killer Instinct devs. Yeah, I mean, you know, the Skybound's had studios before and has put out a lot of games that are pretty damn good and sometimes not so good. So, like they they've been trying. If anything, I always appreciate Skybound for what they are, which is a group",
            "start": 2420.48
        },
        {
            "text": "and has put out a lot of games that are pretty damn good and sometimes not so good. So, like they they've been trying. If anything, I always appreciate Skybound for what they are, which is a group of people that really care about art across many media. And I I feel like them jumping into games and taking it seriously, like trying to do the the Marvel games thing of like, hey, let's actually give our important IP to developers that can tackle this correctly and like, let's set this up from the the ground up of like, let's just not just put out shovelware. Yeah. You know, like let's actually try to make sure that these games are good. Like we got that Invincible um like story based game, the Adam Eve one. Oh, yeah. And like that was pretty good. But like they there was thought behind that, right? Like let's take a comic book and turn it into a comic book style game like storytelling. Cool. A fighting game. It makes sense. I was talking about this yesterday when uh they announced this",
            "start": 2464.88
        },
        {
            "text": "right? Like let's take a comic book and turn it into a comic book style game like storytelling. Cool. A fighting game. It makes sense. I was talking about this yesterday when uh they announced this that uh was it yesterday? It was yesterday. Yeah. At the Xbox thing. um that it I don't know that this is necessarily the right move for this IP because of what people care about with the characters and turning it into a 3v3 fighting game is like I don't know a tall order. Yeah, it looks good though, but it also gives me Power Rangers Battle for the Grid vibes in a way where I'm like, we need a Power Rangers fighting game. Like it it actually those that's the exact analog. And even watching the gameplay, it kind of looks like that where yes, this looks a bit like Tatsunoku versus Capcom on the Wii fighting style-wise, but it also has a semi-cheepness to it in the gameplay. I think the the cut scene and the the frames per second looks sick. Once you get in the gameplay, it does look a little",
            "start": 2510.96
        },
        {
            "text": "fighting style-wise, but it also has a semi-cheepness to it in the gameplay. I think the the cut scene and the the frames per second looks sick. Once you get in the gameplay, it does look a little lesser then. And you add all that up and I'm like, I don't know that you can put this game out in a way that it's going going to succeed when we did just get the PlayStation backed Marvel project showing up. Yeah. Again, that's the toughest thing. And uh 2x 2x KO. Yeah. Like that's the thing is you are announcing this game at a really tough uh season of these games coming out. I mean, this goes back to what we've been saying this generation as far as fighting games. This is like one of the best fighting game generations I would say right between Street Fighter 6, uh Tekken 8, 2X KO coming out, right? Um you know, Mortal Kombat 1, uh and like so many other exciting games, right? The Marvel Tokon Fighting Souls. I think I nailed that. Um we're there's never been a better time to be a fan of",
            "start": 2554.32
        },
        {
            "text": "right? Um you know, Mortal Kombat 1, uh and like so many other exciting games, right? The Marvel Tokon Fighting Souls. I think I nailed that. Um we're there's never been a better time to be a fan of fighting games and competitive fighting games. There's never been a better time's get into the fighting game community. A better time. Um, but because of that, yeah, that means that we have a glut of options when it comes to specifically tag fighters. Uh, and having this being announced after the Marvel one, you know, that's tough cuz I think everybody looks at the Marvel one as being the, \"Oh man, this looks fun. Oh, this is from Arxis. Oh, the art style is [ __ ] dope. Oh, these characters are the characters that I love.\" Right? That is such a perfect storm of hype. And I I think for me when I look at the story, I do like that Skybound like is launching the studio uh in-house, right? I want uh I want the studio to be successful. I think having an original studio could be really cool as",
            "start": 2596.4
        },
        {
            "text": "I look at the story, I do like that Skybound like is launching the studio uh in-house, right? I want uh I want the studio to be successful. I think having an original studio could be really cool as far as what that allows you to do with your IP, especially for Skybound. Now, a fighting game studio is interesting because I hear what you're talking about as far as Invincible and what that is as an IP and what the fan base might want out of it. I look at the rest of um Skybound's IPs and I'm like, is there anything else here that would make sense for fighting game stuff, right? Like Walking Dead isn't a fighting game. Um, and also I don't even know how many Skybound IPs I can list that are that top. Yeah, the thing about Skybound is they they they're so well connected and they could always use someone else's IP. Like it's not I don't think this is actually like through Skybound, but like Robert Kirkman is heading up like Transformers comics, like a series of Transformers comics now. And",
            "start": 2645.12
        },
        {
            "text": "someone else's IP. Like it's not I don't think this is actually like through Skybound, but like Robert Kirkman is heading up like Transformers comics, like a series of Transformers comics now. And it's like things like that. I'm like I feel like we can get other IP into a fighting game that would make sense if this is successful, you know? Yeah. Um and yeah, I I don't want to come off as too big a hater on this cuz like it does look it doesn't look bad. It's just I have concerns about the viability of it given the state of the industry currently. I I totally hear that. Story number six. The Coke Walmart sent with the Switch Tube pre-orders saved this person's life. This is a random one that I think was it you or Roger. Yeah. Put it in the KHD uh Slack. And it's actually a pretty heartwarming story. Like it's a very It's real. It's from Reddit, but you know what? Let's have some joy in our lives. Let's add Let's have some joy in our life. Uh, this comes from the Switch Reddit. Um, this",
            "start": 2687.36
        },
        {
            "text": "story. Like it's a very It's real. It's from Reddit, but you know what? Let's have some joy in our lives. Let's add Let's have some joy in our life. Uh, this comes from the Switch Reddit. Um, this person posted, \"Purchasing a Switch 2 saved my life.\" This is from user impressive durian 404. Just as the title says, \"Purchasing a Switch 2 saved my life this morning.\" For some context, I'm a type 1 diabetic. This morning, I went to take my long acting insulin and must have hit a blood vessel or vein or something because my long acting uh began to work instantly. My blood sugar dropped from 130 to 45 in eight minutes. I had no sugary liquid. Uh liquid works the fastest and I knew at this rate I I was dropping or at the rate I was dropping, I had no time to waste. Um so I had no liquid on hand. Um as it was uh grocery shopping day. Luckily, I remembered Walmart sent a Coke with my purchase yesterday. That Coke literally saved my life this morning because I can almost guarantee without it,",
            "start": 2735.04
        },
        {
            "text": "Um as it was uh grocery shopping day. Luckily, I remembered Walmart sent a Coke with my purchase yesterday. That Coke literally saved my life this morning because I can almost guarantee without it, I wouldn't be here riding this. Life is weird, but I'm so grateful for my decision to purchase the Switch. I'm loving it, by the way. And Walmart's decision to send some snacks with their purchases. I'm so happy for them. That's so That's if this is true, that's so [ __ ] cool. Yeah, if that's true, it is cool. Yeah. You know what's not cool? What's that? That I didn't get [ __ ] Yeah. What's up with that? I finally got my Walmart Switch. No Pringles, no Coke to save my life. Just a [ __ ] paper cut from the box. It's [ __ ] up. I know. It's [ __ ] What day did you get your Switch? Did you get it on launch day or was it like post? No. No, that was late. Oh, mine was late. Yeah. Wow. Two days late. Wow. I know. That's upsetting. It is. That's upsetting. But you finally got it and that's big.",
            "start": 2777.6
        },
        {
            "text": "on launch day or was it like post? No. No, that was late. Oh, mine was late. Yeah. Wow. Two days late. Wow. I know. That's upsetting. It is. That's upsetting. But you finally got it and that's big. The fact that you have a Switch 2 in your hand. Yeah. But if I wanted something smaller, say the tiniest news I needed to know about, Tim, where would I go? Switch Light or the Wii News Channel where you cover all the new small items that you need to know about. All the new small items you need to know about with story number seven. It's Wii News via Deadline. The liveaction Mass Effect series is moving forward at Prime Video. Uh Doug Jung uh of Mine Hunter has been hired as showrunner. Mind Hunter. Mine Hunter. Did you ever watch Mine Hunter? No. I watched the first episode and there was a scene with a shotgun that blew my mind. Blew my mind. You You should watch the rest of that show with us. Yeah. It's [ __ ] incredible and it's a it's tragic that we're never going to get more of it.",
            "start": 2817.68
        },
        {
            "text": "scene with a shotgun that blew my mind. Blew my mind. You You should watch the rest of that show with us. Yeah. It's [ __ ] incredible and it's a it's tragic that we're never going to get more of it. Does it end on like a cliffhanger or anything or will I be satisfied when I There are thing there are threads that are being set up for like another season at least. Okay. It's tough. I might check it out. Still worth a watch. The Legend of Zelda liveaction movie has been delayed by a few weeks to May 7th, 2027. Very interesting. When I saw I saw the headline live action Zelda delayed. Yeah. And it was like 2 months. I'm like what? But that's just Hollywood. Two week. It's like a few weeks. Unless Unless this has it wrong. Yeah, it was like it was March to May. So Oh, okay. Then yeah, couple. Um yeah, whatever. I don't think that this is a good sign, bad side, anything. I think this is just like studios, Sony, internal Sony calendar looking at it being like, \"Oh, we want to release",
            "start": 2860.16
        },
        {
            "text": "Um yeah, whatever. I don't think that this is a good sign, bad side, anything. I think this is just like studios, Sony, internal Sony calendar looking at it being like, \"Oh, we want to release something else maybe around that time.\" Yeah. Men in Black Cross 22 Jump Street. Finally, finally make it happen. Uh, this next one is from Stealth 40k on Twitter. Shagirro Miiamoto is not in the credits of Mario Kart World. Not even as a special. Thanks. Yeah, it's interesting. I was looking into this. Apparently, he wasn't in Mario Kart Tour either. Um, but this is the first core Mario Kart that he's uh not in the credits of at all. I think this is going to become more and more common as we uh get in further into the the generation of Switch one and Switch 2 now. Yeah. Of um yeah, some of the OGs not being involved at all in the games. Damn, he's getting older. He's working on theme parks, too. The busy man, movies, all of it. Yeah, it I I don't know how how a lot of this [ __ ] works, right?",
            "start": 2906.0
        },
        {
            "text": "not being involved at all in the games. Damn, he's getting older. He's working on theme parks, too. The busy man, movies, all of it. Yeah, it I I don't know how how a lot of this [ __ ] works, right? But like Shigaru Miiamoto being the creator of like Mario and all that stuff, wouldn't his name always be in the credits because he created the like it's based on his original I mean look, there are a lot of rules with unions and stuff of what credits need to include and don't need to include. But then a lot of it is just kind of the choice of how people want to want to or don't want to credit. And we're talking about Nintendo here. So yeah, if anything, I love I love the equal opportunity. We're not going to credit you. Even if you're whether you're somebody who worked on the original thing that we remastered or if you're [ __ ] Miiamoto, we're not crediting. You ain't getting [ __ ] Nintendo doesn't give a [ __ ] Mm-m. Uh, from IGN 007 First Light uh isn't part of the James Bond film",
            "start": 2950.72
        },
        {
            "text": "that we remastered or if you're [ __ ] Miiamoto, we're not crediting. You ain't getting [ __ ] Nintendo doesn't give a [ __ ] Mm-m. Uh, from IGN 007 First Light uh isn't part of the James Bond film cannon. It's crazy. That is one of the dumbest things I've ever heard. From which way? Just like no [ __ ] You don't You wouldn't want it to be part of the cannon. But what cannon? I don't know. Like that's all that's what I This is not a man. This is not a James Bond we've seen in a movie. I mean, but like, you know, I I thought it was a prequel to the Daniel Craig movies. I'm going to be honest. I was really confused about that. But did you watch the first Daniel Craig movie? Yeah. Well, he becomes 007. I thought this was, you know, like uh you know, explain this to me. Very confusing to me as somebody who's experienced James Bond mostly through video games. Um, and what was the Skyfall? So, here's the thing, B. Is Daniel Craig not the same James Bond as Pierce Broen? No, like this is not",
            "start": 2993.76
        },
        {
            "text": "somebody who's experienced James Bond mostly through video games. Um, and what was the Skyfall? So, here's the thing, B. Is Daniel Craig not the same James Bond as Pierce Broen? No, like this is not a a onetoone statement factually 100% but I think just for giving you an understanding the James Bond franchise is kind of like Final Fantasy but imagine if the the Sid is James Bond. Okay. Okay. Okay. All right. I [ __ ] with it. Yeah. I mean now D I assume Daniel Craig in Skyfall is the same Daniel Craig in whatever the last one was. Daniel the actors are all the same. The actors get their their so it's Spider-Man. It's like not Spider-Man. Okay. It's more like Spider-Man with the Final Fantasy analogy. I was like, \"So, what's the Kingdom Hearts of 007?\" Well, let me tell you about See, I was I was going to say The Golden Eye game for the Wii. Um, The Road Prince of Persia 1.0 launches in August. Get hyped. Wheelworld will release July 23rd on Xbox as part of Game Pass, PS5, and PC. The",
            "start": 3039.36
        },
        {
            "text": "I was going to say The Golden Eye game for the Wii. Um, The Road Prince of Persia 1.0 launches in August. Get hyped. Wheelworld will release July 23rd on Xbox as part of Game Pass, PS5, and PC. The Hayabusa helmet uh returns to Halo Infinite as a celebration of Ninja Gaiden 4 releasing later this year. And then finally, so cool. It looks hella cool. Uh do you remember this when it like first happened? No. I mean, this was a goddamn moment in time. You needed this this helmet in Halo or else you weren't [ __ ] Which Halo was it? Three. Okay. Oh, okay. Cuz that's why cuz like I didn't really like grow up with I do remember also in two. There's two and three. Okay. Yeah, cuz I remember this helmet, but I didn't really know Ninja Guiden back then. Saying three. Maybe it's just three. And finally, Morbid Metal launches August 20th on PC early access. And that is it for Wii News. That was a clean little music end. Listen, that's what I do, Tim. I'm on this show. Let's credit you, not",
            "start": 3092.0
        },
        {
            "text": "finally, Morbid Metal launches August 20th on PC early access. And that is it for Wii News. That was a clean little music end. Listen, that's what I do, Tim. I'm on this show. Let's credit you, not Barrett. That's what I do, Tim. You know what I mean? We both do cuz I I also purposely cut it right there. Oh, yeah. See, me and Barry, we got we're telepathic, you We got a connection. Should we have connected though? Who knows? Should we have connected? That is the question. Y'all want to go to the beach? Mike Kurser uh writes in with the super chat and says, \"Uh, let's see some non Greg KFGA showdown merch. #support bless. Mike Kerser, I appreciate it.\" Yeah, I appreciate it because it's [ __ ] up what Greg has done to Game Showdown merch. But also go to kind offunny.com/store to pick up Game Showdown merch. Yeah, cuz we're having a parade. And so if you want to celebrate the parade with Greg, go over kind of funny.com/merch or kind of funny.shop uh and pick up one of the many Game",
            "start": 3143.36
        },
        {
            "text": "Game Showdown merch. Yeah, cuz we're having a parade. And so if you want to celebrate the parade with Greg, go over kind of funny.com/merch or kind of funny.shop uh and pick up one of the many Game Showdown Greg Miller shirts that exist. Technically, there's a Tim Gettys shirt, you know, cuz that's Tim Getty's shirt. That is true. Yeah, it is Tim Getty's name on it though, you know. Yeah, but I had nothing to do with this. I didn't design this. I didn't ask for it to be designed. In fact, I didn't want it to exist, but here it is now. We got another super chat from Foxy Steve who says, \"Just my birthday tax. Letting you all know I love and appreciate all that you do. KF and the best friends really have changed my life for the better.\" Happy birthday, Foxy Steve. Happy birthday. And what a nice message. What a really nice message. Thank you. Have a great one. Be great to each other. CD Split says, \"Despite the great gaming events, do you feel the lack of megaton announcements,",
            "start": 3188.84
        },
        {
            "text": "what a nice message. What a really nice message. Thank you. Have a great one. Be great to each other. CD Split says, \"Despite the great gaming events, do you feel the lack of megaton announcements, especially from first party studios?\" I I don't want to come off like salty about this at all. Mhm. But let the salt flow through you. Oh, no. Like, no, no, no, no. Cuz again, see, me and you, we go way back. You've earned the right to be salty, Tim. It's just like I I think that this perspective is whack. Like, that's all that might have been too much salt. Listen, are we going too far? What was this? CA Splitson. Yes. We love CJ Spitson. You can't call his perspective whack, [ __ ] Bless. You can't call his perspective whack. Well, okay. [ __ ] you know? No, but like real talk, it's just like I I I always think it's very funny. I was just telling Roger this a couple days ago, like one of those things that I really need to just get over and not let get under my skin, but I don't think I'm",
            "start": 3232.56
        },
        {
            "text": "I I I always think it's very funny. I was just telling Roger this a couple days ago, like one of those things that I really need to just get over and not let get under my skin, but I don't think I'm capable of it are the people that insist that they miss E3 and they miss how E3 showcases used to be compared to what's going on now. The wacky E3 showcases year after year. It It's so wild. as somebody that professionally now watches all of these showcases and back then unprofessionally watched all of the showcases but my world revolved around that stuff. There was nothing I looked forward to more. There's no world in which you can do a onetoone comparison of Summer GameFest and E3 and try to act like E3 was demonstrabably better or more curated or higher like all the stuff. It's like, dude, we're getting more of everything now. That also includes more [ __ ] we don't care about and more showcases and everything feeling diluted and not as special. It was more special then when we're only",
            "start": 3282.24
        },
        {
            "text": "we're getting more of everything now. That also includes more [ __ ] we don't care about and more showcases and everything feeling diluted and not as special. It was more special then when we're only getting game announcements that week. I'll give it that. But like the reality is those conferences were filled with pie charts and graphs. Oh yeah. And talking and awkward celebrities and awkward just actors talking about stuff and so much garbage. And every once in a while, magic would happen. Yeah. And you'd get a string of back-to-back games that are like, I can't believe these things are happening. But then it'd be surrounded with a bunch of weird nonsense. And you could like that weird nonsense. I personally love that stuff. I I have there's nothing I'm more nostalgic of in my life than me and Alfredo sitting watching E3 conferences. Love that stuff. But the reality is these days it's like we're lucky that we get as tight showcases as we do with the amount of announcements and all",
            "start": 3333.12
        },
        {
            "text": "me and Alfredo sitting watching E3 conferences. Love that stuff. But the reality is these days it's like we're lucky that we get as tight showcases as we do with the amount of announcements and all that stuff. Sometimes it's not great. Often times it's not great. But Megaton announcements, we got Resident Evil 9 announced. Like that's big. Yeah. It wasn't a great showcase, but that's a big reveal. Yeah. Yeah. And so it's like especially from first party studios, it's like I I I think that we all just need to be real about how games are made and how they release. And like we get so many first party games always. And it's like you can't get announcements of every single big thing at every single showcase. That's just not how this works. Or else everything's Call of Duty. I mean, do you think it's this is all a response to the stretch of years that did feel like they were peak for video game showcases when we look at PlayStation E3 201 what 16 through 2018 or whatever it was where it was",
            "start": 3377.52
        },
        {
            "text": "it's this is all a response to the stretch of years that did feel like they were peak for video game showcases when we look at PlayStation E3 201 what 16 through 2018 or whatever it was where it was God of War, Spider-Man, Days Gone, Horizon, Detroit Become Human, like back to back to back the orchestra in the background, [ __ ] Kratos comes out from the dark. We're all [ __ ] losing our minds. Do you think this is all like our response to how I would say average or things have like averaged out a bit as far as like the game showcase and announcement all that stuff? Dude, I mean, well, you you just me you just were talking about what I would consider some of the greatest game showcases of all time. Yes. I would also add last year's Xbox showcase to that list, too, though. Like I feel like if we were to really look at just alltime showcases, I I don't think there are that many from the E3 era that make that list obviously. I think it's just there was a couple amazing PlayStation ones.",
            "start": 3425.92
        },
        {
            "text": "if we were to really look at just alltime showcases, I I don't think there are that many from the E3 era that make that list obviously. I think it's just there was a couple amazing PlayStation ones. Yeah. Like that's it. And even like the 2018 one, like that's where we started see that was like the weird like let's move everybody to The Last of Us Part Two weird [ __ ] thing. Like I might be thinking more 2015 to 2016 or something like those people are thinking about the highs but not of the same lows of like the Square Annex let's show off Kingdom Hearts 3 and like none of it has sound effects or and like it's only random voice acting and [ __ ] People coming out on stage to do demos the controllers not connecting and like that would happen for Miiamoto coming out on stage to play Skyward Sword. Yeah. I mean, I forget who played Uncharted 4 the year where like Nathan Drake just wasn't moving for a good minute and then they're like, \"Fuck it. Can this we're doing our pre um",
            "start": 3472.96
        },
        {
            "text": "Skyward Sword. Yeah. I mean, I forget who played Uncharted 4 the year where like Nathan Drake just wasn't moving for a good minute and then they're like, \"Fuck it. Can this we're doing our pre um pre-recorded thing here and then the very next year they [ __ ] died and clipped through the world in Uncharted 4 in in the E3 showcase.\" Yeah. Again, I I feel like we just are to look at this positively blessed to be in such a time that we have more games than ever at the AAA scale, at the indie scale. We have more good games than we've ever had. Yeah. more good games being announced, more good games coming out, more 10 out of 10 reviews, more game of the year contenders. Like, we have more of all of that. We also have more of the opposite of everything I just said. More trash, more platforms, more places to play games, more places to announce games, more places to announce release dates, more places to not announce release dates, and be Hollow Night Silk Song. Like, it's just there's just",
            "start": 3519.36
        },
        {
            "text": "more places to play games, more places to announce games, more places to announce release dates, more places to not announce release dates, and be Hollow Night Silk Song. Like, it's just there's just more. Yeah. And I I to give CJ Splitson some bail here, right? cuz he's not casino splits and I don't think is talking about like any of that, right? Like I think they're just talking about the first party megaton. Uh yeah. Do you feel a lack of Yeah. Megaton announcements especially from first party studios? And to that like I guess I feel it a little bit, right? Like it's not like we had it was this is Mike's complaint yesterday was that like Xbox first party just didn't feel as present outside of things like Clockwork uh and Clockwork Revolution and like a couple other things, right? But like there was that list of where's Fable, where is Eday, where's this, where's that? And I go to PlayStation, similar thing. and I go to I guess Nintendo wasn't here this year, right? But like that's",
            "start": 3562.96
        },
        {
            "text": "there was that list of where's Fable, where is Eday, where's this, where's that? And I go to PlayStation, similar thing. and I go to I guess Nintendo wasn't here this year, right? But like that's also to your point just the state of where we're at with everything, right? Like you can't have all these games show up at every single year because people got to actually work on these games and games take a long time to make. And I would argue that it's not the most exciting thing, but Bortza and Gears and a tease of Halo were there yesterday. They're just 2026, but they were talked about as being 2026. Yeah, we didn't need to see a like a picture of their logo with the date. You just said it. And again, not that exciting, but like we're coming off of a year that we've had what the if we're talking just Xbox first parties, four, five of them have already come out this year. Mhm. And we have more later this year. It's like we know what this year is. Yeah. It's also like I'm not hungry for",
            "start": 3603.6
        },
        {
            "text": "just Xbox first parties, four, five of them have already come out this year. Mhm. And we have more later this year. It's like we know what this year is. Yeah. It's also like I'm not hungry for like all of those like huge uh big hitter first-p partyy titles from Xbox and PlayStation which like even though we had a lack of those this year, I'm not like left wanting because so much is happening this year. Like GTA 6 being delayed out of this year, like a part of my brain is like [ __ ] thank god, man. There are too many video games right now. Yeah. Um, yeah. I've I I was talking about this uh last night on stream yesterday where I've like leveled out in a weird place where I don't think I can ever be that salty at any of these showcases because at the end of the day like there's rarely a showcase where I'm not leaving with some games that I'm excited for. And that's all I'm really in here for. Like I think the place where I might I might differ from you Tim is like I come out of this I'm",
            "start": 3647.68
        },
        {
            "text": "where I'm not leaving with some games that I'm excited for. And that's all I'm really in here for. Like I think the place where I might I might differ from you Tim is like I come out of this I'm going into this with the idea of like all right I'm sitting here to just watch marketing material. Like I'm sitting here to watch a bunch of trailers being shown to me because these guys are trying to sell me on these games and sell me on their console or whatever. And so I don't really have the like expectation or I guess the entitlement to oh this thing better blow me away. It's like I am choosing to watch this 2-hour long showcase. I'm choosing to sit down and watch an hour of like trailers being shown to me and I can't bring it I can't bring myself to be upset with walking out of my own decision to watch an hour of trailers and being like damn that wasn't up to my expectations. It's like brother I just decided to watch a bunch of marketing material. That's how I decided to spend my day. I",
            "start": 3694.2
        },
        {
            "text": "to watch an hour of trailers and being like damn that wasn't up to my expectations. It's like brother I just decided to watch a bunch of marketing material. That's how I decided to spend my day. I I I guess where we differ is like I feel like the marketing material is presented as content. It is and it's clearly they put money in and they produce and they get Ben Schwarz and they do all this stuff. So it's like I I feel like I am choosing to use my time that way and they are choosing to present this stuff and so it's like the level of criticism of the production I will always care about that stuff and like they're not commercials being put together are not all created equal. So I I think that uh if they do a very bad job like Ubisoft has done in the past like that [ __ ] pisses me off. But I'm also with you of like we just don't watch a lot of the showcases that we know are not going to be good anymore because there are too many. Like you need to be one of the big dogs because the big",
            "start": 3739.6
        },
        {
            "text": "I'm also with you of like we just don't watch a lot of the showcases that we know are not going to be good anymore because there are too many. Like you need to be one of the big dogs because the big dogs have proven that even if we don't love it and even there's things about it that we're like uh I don't love just this blend of just these anime games that are clearly just paid ads uh in the Jeff Show. But we also understand those are necessary for the show to exist at all and we can not like that. We can talk about that. But those are the facts there. And the facts are that Summer GameFest breaks records every single year. Game Awards breaks records every single year. People want their games there because they're going to be seen by the most people at any of these events. Uh Zeke Speak writes in and says, \"I think what people miss is not E3, but the freedom and innocence of childhood gaming. It's never going to be comparable to those golden years when a demographic was on summer break",
            "start": 3777.2
        },
        {
            "text": "in and says, \"I think what people miss is not E3, but the freedom and innocence of childhood gaming. It's never going to be comparable to those golden years when a demographic was on summer break hungry for games.\" That's my other thing is I think so much of it is driven by nostalgia, too, right? Like I'm I as we were talking about the old E3 press conferences, I started to be I started to feel the thing of like, man, I kind of miss when the controllers wouldn't work. I kind of miss like those stage presentations and I know what we have now is better. Like what we have now is higher quality and like less room for error and all that [ __ ] right? Like I'm never going to argue that, but I totally feel like I I definitely feel the old man feelings that are coming from from chat as far or from like some of this the opinions out there as far as oh man, I miss how things used to be. Listen, I get it too. I miss when I was 21 years old. I miss when I was younger. Absolutely. I I miss, you",
            "start": 3822.44
        },
        {
            "text": "like some of this the opinions out there as far as oh man, I miss how things used to be. Listen, I get it too. I miss when I was 21 years old. I miss when I was younger. Absolutely. I I miss, you know, not having the weight of the world feeling like it's on my shoulders at all time. Uh, a quick two two more for you. Nightlife writes in and says, \"Tim is right. Perfect example. Mike's review of Xbox.\" I'm I'm not trying to like I I don't want to dog on Mike and his opinion review of Xbox at all because I think that he not only is it entirely valid because it's his opinion. I think he backed it up in a way that like I don't agree with what he's saying. Uh but I get where he's coming from as a fan of Xbox that is looking for certain things. He didn't get those things. As a fan of Nintendo, I am so familiar with that where I've been at places where I feel like there there are people that are less in the system than I am. And they'll be they'll see a Nintendo thing, like oh that was pretty",
            "start": 3859.2
        },
        {
            "text": "am so familiar with that where I've been at places where I feel like there there are people that are less in the system than I am. And they'll be they'll see a Nintendo thing, like oh that was pretty cool. And I'm like, yeah, but like what it was missing is the core stuff. Yeah. And like to everyone to each their own. everyone's just expecting and needing different things. Um because there's different levels of investment in all of these things and like the realities of so many games that we see that we saw on the last 10 days look awesome. How many of them can you play? Oh dude, you know. Yeah. I I went and I watched the day of the dev showcase and I wish listed like seven games off of it and I'm like I'm not going to play all these games. I'm not going to have the time to play all these games. But but like you're you're interested in them and I think that that's what the showcases are for is interest. Yes. Uh, and then one more from Pedro Vinegas who writes in and says, \"Uh,",
            "start": 3900.64
        },
        {
            "text": "these games. But but like you're you're interested in them and I think that that's what the showcases are for is interest. Yes. Uh, and then one more from Pedro Vinegas who writes in and says, \"Uh, birthday tax.\" Thank you guys. Happy birthday, Pedro. That brings us to kind of funny.com/you. You're wrong. Where you write in, let us know what we got wrong as we got it wrong so we can correct it for those watching later on YouTube and listening later on podcast services around the globe. Uh, excuse me. Peter Rob writes in. It says, \"Out worlds one launched at $60 retail price.\" Um, let's see. Let's see. Let's see. Let's see. Xavier writes in and says, \"Robert Kirkman is writing Void Rivals, not going not the ongoing Transformers comic. Daniel Warren Johnson is the one penning Transformers.\" Use the word penning. That's a writer right there. Um, Coxifer writes in and says, \"You guys need to watch some of the IO interactive showcase. It is the bad old E3 nonsense.\" I just want to be",
            "start": 3942.72
        },
        {
            "text": "Use the word penning. That's a writer right there. Um, Coxifer writes in and says, \"You guys need to watch some of the IO interactive showcase. It is the bad old E3 nonsense.\" I just want to be clear. There are Transformers and void rivals. Robert Kirkman is riding Transformers characters, which is the point I was making is like them using other I like characters from IP with Mads Mickelson and Agent 47's actor being insanely awkward. Might I might check that out. What's up with this eye actor showcase? And then Hex Prof says those Nintendo and Monster Hunter sets at E3 were actually mind-blowing though. You can't deny that, Tim. I want everyone to be clear. You will not find a bigger fan of E3 than me. Like I worked at IGN for years. I've been I was at 10 E3s. 10 [ __ ] E3s. And I was one of the only people in my circle that wasn't jaded as [ __ ] and bitching about being there. I love this stuff and I love what it's turned into. I love gaming showcases. I love gaming marketing. It's",
            "start": 3991.88
        },
        {
            "text": "of the only people in my circle that wasn't jaded as [ __ ] and bitching about being there. I love this stuff and I love what it's turned into. I love gaming showcases. I love gaming marketing. It's one of my favorite things. So, I will not take any of that [ __ ] I don't know, man. All the the streets are saying you're E3 hater, man. The streets are saying it. I was there. It all It hurts my heart that I'll never be in an E3. I've never been to it. I got so close and then the pandemic happened. Yeah. And now there's no more E3s anymore. Yeah, it was different. Bless. It was different. You will never experience something like it. I mean, I do like SGF though. I know. Oh, I love it. And again, I I've experienced 10 E3s. I've experienced three Summer Game Fest playdays. Summer Gamefest Plays from every part of our job is better. Every single one. It's not E3 though. E3. E3 had a waste. E3 had a smell, baby. Oh, it did. You know? Yeah, dude. The like energy of like you trying to get onto",
            "start": 4042.64
        },
        {
            "text": "from every part of our job is better. Every single one. It's not E3 though. E3. E3 had a waste. E3 had a smell, baby. Oh, it did. You know? Yeah, dude. The like energy of like you trying to get onto the show floor to like get like start up your shift and they're about to open the doors for the general public and you're like, \"Ah, [ __ ] I got to get in there.\" There's an energy, man. It was crazy. I hope they bring it back one day. I know it'll be a shell of its former self, but like I'll go to that shell. I'm going be all up in that shell being like, \"Look, look where I'm at, Mom. I'm at E3. Finally, I made it.\" Tim, this has been kind of funny games daily. Each and every weekday, we run you through the nerdy news you need to know about live on YouTube, Twitch, and all podcast services around the globe. If you love what we do, support us with the kind of funny membership on Patreon or YouTube to get all of our shows ad free. Watch them live and get a daily exclusive show. Enjoy the",
            "start": 4087.2
        },
        {
            "text": "around the globe. If you love what we do, support us with the kind of funny membership on Patreon or YouTube to get all of our shows ad free. Watch them live and get a daily exclusive show. Enjoy the games cast next, the KFP after, and the stream after that. But until next time, game daily.",
            "start": 4127.52
        }
    ]
}