{
    "id": 14331,
    "video_id": "bpPzHSVW4Fo",
    "show_name": "Gameplay",
    "hosts": [
        "Nick Scarpino",
        "Andy Cortez",
        "Mike Howard"
    ],
    "title": "Nick Teased Mike Till He Moved His Base In Dune: Awakening",
    "description": "Download Cash App Today: https://capl.onelink.me/vFut/7u0sm0fp #CashAppPod Sign up with our exclusive referral code KINDAFUNNY in your profile. Send $5 to a friend within 14 days, and you’ll get $10 dropped right into your account. Terms apply.\n\n*Referral Reward Disclaimer: As a Cash App partner, I may earn a commission when you sign up for a Cash App account.* #sponsored\n\nGo to https://mood.com and use code KINDAFUNNY to get 20% off your first order.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1750890682,
    "duration": 9158,
    "transcript_chunks": [
        {
            "text": "[Music] Yo, what the heck is going on? Kind of funny best friends. It's your boys, the Jabroni boys, Mike and Andy. Our third will be here in just a little bit. But Mike and Andy are ready to rock and roll for your kind of funny games afternoon stream for Wednesday. And Andy, guess what?\n What a big\n This will be the final afternoon stream before the big Death Stranding walk-athon marathon stream on Friday afternoon because we will be preparing and prepping tomorrow. So, there will be no afternoon stream for all of you best friends out there that enjoy the gameplay streams with me, Andy, Nick, and the crew here at Kind of Funny. Just a heads up for you on that one, Andy.\n Good to know. Good to know. Just a just to let people know out there. So, you can expect us to be back Friday afternoon with the Big Death Stranding stream. So, today is your final Dune Awakening stream for right now. Uh Andy, how are we feeling right now?\n Look how cool I look, Big D.",
            "start": 1.71
        },
        {
            "text": "Look how cool I look, Big D.\n You feeling good? Oh, you do look cool with the open coat. Yeah, it does.\n I like that. I like that. Um, last night, let's talk about it.\n I stayed on a little bit longer last night.\n I saw you two stay on. Yeah. Yeah. Stayed on and I flew to the Harkining place and I flew to Ericen.\n What do you mean?\n Where the at trades are.\n Oh, so you finally went up to Let's Make a Deal.\n No.\n A great opportunities await.\n Oh, no, no, no, no. Oh, okay.\n Went to the Anvil,\n talked to the lady who flies you places.\n Ah, you decided to take a little flight. Okay, cool.\n And Mike, that's where you find your freaking like trainer, your class trainer.\n Yes. Okay. Yep.\n And so I found the person there and they gave me a mission. So I'm like, okay, now I finally know how to progress this stupid thing that's been telling me find your menntat trainer.\n You're getting you're getting those extra levels now. Yeah, I like that. Okay.",
            "start": 54.16
        },
        {
            "text": "You're getting you're getting those extra levels now. Yeah, I like that. Okay.\n Um I mean I I still haven't done the mission, but now I I know that that's what you got to do.\n Oh, that's what we that's what we all got to do.\n That's Well, I mean, where is it? Um,\n is it maybe\n you go talk to the\n right here?\n No, you fly somewhere. It's its own separate. It's not on this map.\n No [ __ ] Really? Not like uh the dune wall. No. Yeah, you are flying to you fly to your own like little area.\n Really?\n And then uh\n and you can also fly to the hearkening spot if you were sort of siding with them. I went over there and they were like, \"We're not [ __ ] playing with, you know, uh a tradey scum or whatever cuz you know, I already sided with tradies, you know,\n so we got let's we can do that.\"",
            "start": 103.44
        },
        {
            "text": "so we got let's we can do that.\"\n Okay. Well, I'm building a I'm building a thopter. So, like that's my goal right now. I like that. I've stopped I've started organizing myself for the thopter build. Uh Bobby Bios uh we need to run station 197 in order to level up our planettology. I I already did that, but you haven't done that yet, Mike.\n Uh, okay.\n We could do station one. Uh, 97. Remember that one spot where Nick was like, \"This dude has a flamethrower.\"\n Okay. Okay.\n And we had never seen that before.\n Yeah.\n Um, did you just go down? What happened there?\n Uh, I'm just fighting people. Just fighting right now. Uh, okay.\n Help me. I'm just uh yeah, I mean I've put my mind now to the grindstone of getting a thopter, but like I'm down to ride wherever y'all want to go. But yeah, I've uh I'm just building it out now. I'm building it out. That's my goal.\n Um I also was able to over there in the different settlements, I was able to buy some new lighting and some new\n Okay.",
            "start": 147.2
        },
        {
            "text": "Um I also was able to over there in the different settlements, I was able to buy some new lighting and some new\n Okay.\n things. Oh, I also got the Twitch Prime thing, Mike.\n That's great. Yeah, you got the cool suit.\n No, not the suit. It's a uh um check this [ __ ] out. Mike,\n what'd you get? Tell me all about it. It's not the suit. It's a uh different like it's a wall piece and a ceiling piece.\n Oh, yes. We've seen those. Uh-huh. Yeah. Yeah, that's fun. Okay.\n Um along with a floor piece.\n Okay.\n Uh where is this one? Is it on roofs? I thought it was on roofs. Oh, wait.\n Yeah, it's this one. And you put this [ __ ] down.\n Yeah.\n And it has like a light above it.\n Oh, that's hot. That's kind of hot. Okay.\n Look at you, bro.\n Yeah. I mean, those are just the Twitch Prime ones.\n Okay. Take advantage of like that.\n Yeah. Whenever Nick gets back, I think we should, you know, try to go to the to Eric Keen or whatever where the atrades are chilling at.",
            "start": 204.88
        },
        {
            "text": "Okay. Take advantage of like that.\n Yeah. Whenever Nick gets back, I think we should, you know, try to go to the to Eric Keen or whatever where the atrades are chilling at.\n Okay. so that we could actually progress these stupid trainer quests that have been\n the reason why we open up our menu. We're like, why do we have 90 skills that we just can't push up? Also, Mike, your skills, what are you happy with them?\n Uh, yeah. I'm using the uh sisterhood. Why?\n Well, like cuz you can switch all that [ __ ] out, you know?\n Oh, yeah. I mean, I added the cool grapple hook. Have you been messing with the grapple hook at all?\n No, I that's out of my skill tree. Uh, the grapple hook is under The grapple hook is under the tactical tech. That's on the far left side, the trooper skill. And I've No, tactical tech is on the right hand side. Is that bottom one? Yeah, you can unlock that\n right there.\n That's the uh grapple hook.\n Yeah,\n it looks like a dash.",
            "start": 267.84
        },
        {
            "text": "right there.\n That's the uh grapple hook.\n Yeah,\n it looks like a dash.\n Okay. Yeah. Yeah. So, I've gone I've done a lot of the gunnery stuff um just because that's opened. I haven't opened up any of the mentate stuff. Uh planettology I've opened up the Sisterhood I am and then the swordmaster I haven't opened up at all yet.\n Okay. Because I got to meet people.\n Yeah. Yeah. Yeah.\n So I'll be messing around with some stuff.\n Why don't I\n But yeah, you miss You should be mix massing skills all the time to just try new things. For sure. Cool. I'm going to get that grapple hook.\n Yeah, try that grapple hook. I'll see how you like it. But yeah, I'm excited for all that. A lot of people are talking about Iron Heart and uh they're also talking about, of course, Fantastic 4 with a new trailer. See any of that stuff?",
            "start": 321.04
        },
        {
            "text": "Uh yeah, they got I think this is the final trailer. You know how they do about seven trailers before the movie comes out? This is probably titled the final trailer, you know. Grab rocks. Grapple rocks. You can you can really Yeah. marry those to marry that with the belt. There you go. That's sick as hell. Put that on one of your uh side mouse buttons and you'd be cooking, big dog. Yeah. Yeah.\n So, yeah. There you go. Hell yeah. Yeah. I'll put that on my on cuz I always save the one mouse button for my melee. But is there a melee button in this game? No, there's not.\n Okay. You say you just use a sword, right?\n Yeah.\n Pop that sword. Call it good. I think I'm good to start building out my vehicle. Uh, peace now. Yep. There we go. Oh, I need two more. Two more iron for me. Oh, two episodes into Iron Hart. Not bad. I'm liking it. Scoop ball says. Okay. Damn. I didn't even know that came out. I saw Robert Downey Jr. was uh talking with the lead actress over there.\n Yeah.",
            "start": 371.68
        },
        {
            "text": "Yeah.\n Congratulating her. That's pretty fun. That's cool. Yeah, I heard it. I heard I heard it was pretty good. Um\n Okay. I know some people aren't into it. Um, but yeah, I've heard some decent things. I just don't even have time to watch the stuff that I really really want to watch cuz I've just been gaming.\n Yeah,\n just g just gaming is taking off.\n Just gaming, y'all. He's having too much fun.\n Oh, also check this out. I uh at the uh the Araken place.\n Okay.\n I got a an Atrady skin for my gun or for my my bike different colors. Yeah. Yeah, that's nice. Like it changes the whole shape of everything. It's pretty lit.\n There you go.\n We got to go over there.\n Yeah. Yeah. Bring We'll bring Nick once he's ready to rock and roll.\n All right. Lit.\n I'm excited. I'm building this doctor out, bro. That's the goal. Build it out. And then I get some steel going. I need some more steel. Give me that.",
            "start": 440.8
        },
        {
            "text": "All right. Lit.\n I'm excited. I'm building this doctor out, bro. That's the goal. Build it out. And then I get some steel going. I need some more steel. Give me that.\n But the remember the thopter takes like aluminum. Well, I got to build You got to build the thing to build the thopter is where I'm at. You got the vehicle.\n Yeah, cuz I have the vehicle fabricator.\n Yeah, that's what I'm That's what I'm building now.\n You know,\n like I said, I'm just getting myself in position to get there. That's Yeah, we're not even close to aluminum or diamond D. I mean, I'm sure we're close, but\n yeah,\n even in that northern area, it's hard to even get the [ __ ] to make cobalt paste, you know?\n I love it. Got to just start cooking it up. It's dropping on the ground.",
            "start": 483.84
        },
        {
            "text": "yeah,\n even in that northern area, it's hard to even get the [ __ ] to make cobalt paste, you know?\n I love it. Got to just start cooking it up. It's dropping on the ground.\n Yeah, I'm with you. Not the lizender. There's just there's a lot of stuff to consume and I've just been so bit like I I keep getting asked a million times if I've if I've played Death Straining 2 yet and it's like I would have had I not been into a lot of other games, you know? Okay.\n Holy [ __ ] man. This thing is awesome. I want I want new stuff to be able to make my next sniper rifle, but that requires aluminum as well. Cobalt paste takes those pink crystals that are kind of harder to find. Aithite and also just think about it like man bless really [ __ ] us, you know.\n Whole day behind\n just a whole day behind.\n A lot of people say whole day behind\n man. Bless really [ __ ]",
            "start": 517.52
        },
        {
            "text": "Whole day behind\n just a whole day behind.\n A lot of people say whole day behind\n man. Bless really [ __ ]\n Don't don't want to blame anybody but a whole day behind. Had a had a game plan. I was moving places. Whole day behind. There we go. Time to build people. Time to build. All right. Aluminum and cobalt paste. Look how cool this is going to be. Okay. Oh, can I like grapple hook a person? Oh my god. I can stun him with the grapple hook. Oh yeah, he can do all that.\n Holy [ __ ] That's going, bro. Get buried, you idiot. Yeah, I left I left Nick a nice little uh grab bag. I'm very excited for him to see it. Yeah, we felt bad after he died. You know that could that that very much could have been the very end. You know what I mean? Like, oh, this is going to be the end of it right here. A\n rough turn of events. We\n give it all up right here.",
            "start": 568.56
        },
        {
            "text": "rough turn of events. We\n give it all up right here.\n For sure. I still need to watch season two of Andor. Me, too. I watched the first three episodes like, man, this is the best television ever. And then I just never got back to it because video games. And it's also like here's the thing with me, chat, is like, you know, a lot of people go, \"Man, why do you have to like stream everything? Can't you just play a game and enjoy it, you know, on your own?\" Actually, a lot of people don't even say that, but like, you know, some people have said that in the past, but for me, it's like I don't want to experience it without the chat. That that's a lot of my perspective. It's not like\n your life has become I want to share my entire life with everyone.",
            "start": 641.28
        },
        {
            "text": "your life has become I want to share my entire life with everyone.\n I want to I want to experience this game with people that maybe aren't playing it, you know? I I love those communal moments. I love those awesome moments of everybody being shocked by a story beat or whatever. And it isn't like why why do you have to stream it? Why do you have to make money? and like go home and you know it's like I just don't want to I don't want other people to miss out on this you know I I want it to be\n catalog you're doing it for others I want I want it to be cataloged like for you know for people who may miss out on that moment and so that's why there's a lot of game you know that's why I could probably play a lot more games during the day like during the workday and then watch [ __ ] at night but I use my night time to play games and stream he wants me to share these moments with you",
            "start": 682.88
        },
        {
            "text": "and I I best friends out there. I love that. twitch.tv/andandycortez. It's like don't, you know, I don't want to. It's, you know, it's like whenever you're watching a movie with somebody and they're like, \"Oh, you don't have to pause it.\" And it's like, \"No, I'm going to pause it cuz I want you to watch this shit.\" Like, this [ __ ] rocks. Also, for Cobalt Pace, there's a huge crevice in the northeastern portion of the map that has the ore to make it northeastern. Yeah, that's the uh it's aer I I found a lot of aerithite around hereish. Whoa. Why is this all covered in sand? We've been there before. Um I found some athite around some of these missions. I'm just pumped to do some of these more main missions. Wash wants to do Imperial testing station 197. I think we can wait for Nick to get here to do that. Well, Nick already did it. You haven't yet, Mike. Yeah, I'm in build mode. So, like, well, we can wait for Nick to go do uh the main missions and stuff, but uh I'm in fullon build",
            "start": 730.0
        },
        {
            "text": "here to do that. Well, Nick already did it. You haven't yet, Mike. Yeah, I'm in build mode. So, like, well, we can wait for Nick to go do uh the main missions and stuff, but uh I'm in fullon build mode here.",
            "start": 785.68
        },
        {
            "text": "I also don't fully understand the mechanic of the little robot that you put out there to make your to make your plot larger.\n Okay.\n I don't understand how that mechanic works.\n I have not seen that or done that, so I can't\n Yeah, there's a uh like in the survival the survival machine.\n Okay.\n Because you know there's a weapons builder, the specific things. The survival one, there's a little machine that you can buy that\n it's a little kind of droid thing that goes and adds more size to your plot.\n Okay.\n You could build out or you could build up. That's how that dude has that massive tower. I don't really understand how the robot works. Yeah, I'm just trying to catch up with all of you with the nice base.\n Rebecca Khan becoming a kind of funny member on YouTube. Thank you, Rebecca Khan. Appreciate you. Look at that.\n You place those down and it will show you the added area will show up.",
            "start": 796.96
        },
        {
            "text": "Rebecca Khan becoming a kind of funny member on YouTube. Thank you, Rebecca Khan. Appreciate you. Look at that.\n You place those down and it will show you the added area will show up.\n I guess I anytime I try to place it down, it'd be like has to be flat land or like do I just have to put a I wonder if uh I still have it. I'm going to go look for it. And I'm so close to making this larger ore refiner.\n Okay. the the the upgraded version of it. That's one I really really want.",
            "start": 851.76
        },
        {
            "text": "Okay. the the the upgraded version of it. That's one I really really want.\n Love that. What's the point of this game? It's a survival game. You build uh your little house and you go out and you do missions and it's a third person shooter. You kill enemies, you take out slavers, you take out gangs, you go to the the the central hub where all the trading happens and then a side quest will pop up where a random person's like, \"Hey, there's a guy doing drugs. I need you to go, you know, hunt him down for me or whatever.\" Um, and then you report back to him and he gives you XP and then you build more and you make more and you get stronger and better and cooler and you get sick ass jackets like this. You got a sick ass jacket, y'all. Show them that jacket. Now, what is that jacket got? Still suits in it.\n This is a still suit. Yeah.\n Well, I ended up making So, this the way the reason this jacket looks this way cuz this is a transmog mic. Okay.",
            "start": 897.6
        },
        {
            "text": "This is a still suit. Yeah.\n Well, I ended up making So, this the way the reason this jacket looks this way cuz this is a transmog mic. Okay.\n Cuz like I I'm wearing this purple still suit, the one with the cape kind of thing.\n Yeah. But if I click into it, the jacket is one of the transmog items that I can put on.\n Ah, very cool. Very sick. And it just looks rad. Oh, so there's actual mission. All I've seen is a lot of chaos when the worms pop up. Yeah. Oh, yeah. There's there's it it's not just a sort of Minecraft missionless game, survival type game. Not that there's anything wrong with that. I love that [ __ ] too. But um yeah, this is a this operates a lot more like a more narratively focused. If World of Warcraft was a narrative focused third person shooter,\n okay, World of Warcraft has a lot of narrative, but you know what I mean? Like whenever you walk up to somebody, it feels more personal. Feels more RPG-ish.\n It feels very RPG,",
            "start": 948.24
        },
        {
            "text": "okay, World of Warcraft has a lot of narrative, but you know what I mean? Like whenever you walk up to somebody, it feels more personal. Feels more RPG-ish.\n It feels very RPG,\n like Fallout 76 kind of, you know? Now, what is it that Where is that little stupid robot? I have it somewhere here. Oh, here it is. Okay. It's called the stocking unit. Okay.\n And what I'm Anytime I try to put it down, it said I need more land or I need to be on flat land, rather. So, I'm going to try to I'm trying to amass land. I'm trying to cultivate land mass. Chat, can I put this sucker down on this little area? I'm going all out with the build.\n No. Invalid position. Invalid position. Invalid position. Too close to another sub thief. Too close to another sub thief. Invalid position. Not outside. Too. This this sub thief over here really ruined my life.\n Who?\n The one to my the right of me.\n Whoever that is. Yeah.",
            "start": 1009.84
        },
        {
            "text": "Who?\n The one to my the right of me.\n Whoever that is. Yeah.\n Whatever that is. Yeah. Yeah. Too close to another sub thief, invalid position, uneven ground. Every warning possible I'm getting.\n It's a It's interesting that Yeah, you would think there'd be more bumping into other players and their bases like uh we saw in Once Human, so it's kind of nice that like Yeah, it's not as crazy packed as that game was. Can other players destroy their base? Uh theoretically if we were on a PvP server, I don't know. I I don't think it's like rushed in that way, but I\n in the deep desert you can destroy other people's bases.\n Gotcha. Okay. Where is incredibly crowded by uh this is Washurn says some dude just yelling at me for building too close to them. Nice. That's sick. Yeah, you just got to establish dominance. You got to you got to lay down your land and just tell people back up is right\n also says so basically we got to go raid the eastern most region. We need a buggy. Yeah. Time.",
            "start": 1102.0
        },
        {
            "text": "also says so basically we got to go raid the eastern most region. We need a buggy. Yeah. Time.\n We need a buggy with a minor turret attachment in order to farm resources fast so that we could build ornithopters.\n Time to get that buggy is right. Oh yeah.\n I think you got to put it outside the suff but but close to it. Yeah, I know the vertical one is inside. Oh, so the back works but not here. Well, I don't want that. Oh, I think too far out there. I'm dehydrated. What the [ __ ] Got to reset everything, bro. You've been out there cooking, man, in the sun.\n You're right. Yeah,\n you're cooking in the sun.\n Oh, Washi's house is in the way. Oh,\n [ __ ] Washi.\n [ __ ]",
            "start": 1157.92
        },
        {
            "text": "You're right. Yeah,\n you're cooking in the sun.\n Oh, Washi's house is in the way. Oh,\n [ __ ] Washi.\n [ __ ]\n Who was it? It's washy. That's why I can't go this way. I'll be real with you. The reason why I wanted to build out here, chat, is because I always end up driving through this area and I wanted to uh build a ramp to make it easier for me to drive. Steal his cable. I'm steal his Wi-Fi. It was Andy that was yelling at Was for building too close. No, this is the house that I also hate to my far right. This is the house that I'm mad at. I will give you permissions to build what in my territory when I get back there. [ __ ] wash rocks. Yeah, you just need a little teamwork. That's all.\n Yeah,\n I just needed [ __ ] Washburn to build that base and then he backed out last second. I remember that Washburn.\n He was so mad at you.\n I remember that Washburn. so mad.\n You suck. I was like, man, he's going to block he's going to block Wash's number now. Washurn,",
            "start": 1210.96
        },
        {
            "text": "He was so mad at you.\n I remember that Washburn. so mad.\n You suck. I was like, man, he's going to block he's going to block Wash's number now. Washurn,\n he was so mad at you. I don't like that you're building way far out there.\n I'm not. I'm close.\n What do you mean?\n I'm only here. I'm literally right here. I'm two steps away from my spot.\n Oh, you're not building way far northwest anymore?\n No, I stopped that. Well, I mean, I still have that, but yeah, I stopped that for right now.\n Oh, good. Good. I wasn't that.\n Why? You gota You got to start expanding.\n Yeah, but like I don't know. You were\n cuz we're going to be these kids with multi-million dollar plots in level two.\n You were doing that level in a dickish way though way.\n You were take you were going about it in a way like, you know, I'm going to [ __ ] build my house over here. [ __ ] these guys. like you know it's just I didn't like\n eventually we all have to merge and we create one mega\n no I don't want I don't\n why not",
            "start": 1272.48
        },
        {
            "text": "eventually we all have to merge and we create one mega\n no I don't want I don't\n why not\n I don't ever want that\n we got\n because it takes away the ownership from me the owners like I'll build a little house next to whatever that\n we're spending four times the resources but I just don't like it you know I I don't like joining up in a big mega base this is a renters's culture right here okay you know I can't afford a [ __ ] San Francisco homey all right\n it really is And every once in a while I get like, you know, I'm on that um\n got that Zillow email and all\n Zillow, but it's another one. Red Fin,\n okay,\n is the other one. And you know, a lot of them will be like, \"Oh, here's a a twobedroom or a onebedroom for, you know, 3,100 a month or 3500 a month or 2,800 or 2500, whatever.\"",
            "start": 1330.64
        },
        {
            "text": "okay,\n is the other one. And you know, a lot of them will be like, \"Oh, here's a a twobedroom or a onebedroom for, you know, 3,100 a month or 3500 a month or 2,800 or 2500, whatever.\"\n And then it'll be like or or buy this [ __ ] condo for 5.2 mil. Like it is what? That's how they were able That's how Grub was able to buy a giant bomb because [ __ ] it. Cuz you could buy a house for, you know, $7,000 in Cleveland. It's crazy, bro. Rent an apartment for 200 a month. Creed says, \"I love that Mike's base is all foundations.\"\n [ __ ] yeah, bro. You got to start somewhere. You got to start somewhere. Creed. Also, I'm building on like a wicked [ __ ] wild hill right now.\n Nick's got to have this [ __ ] call. Like, what's he doing?\n Nick's the one who brings us together. If Nick's not here, we can't do much.\n He knows that it's doom time.",
            "start": 1365.36
        },
        {
            "text": "Nick's got to have this [ __ ] call. Like, what's he doing?\n Nick's the one who brings us together. If Nick's not here, we can't do much.\n He knows that it's doom time.\n Exactly. I I have to wait for him cuz if not, it'll be like every other [ __ ] day. What mission are you on? Oh, it says to drop off some [ __ ] That's not what the mission says,\n man. Where's the mission?\n Where's the compass? And you know he ain't looking at the [ __ ]\n I I felt you about to burst yesterday as you're telling him like okay well we got to be better about reading that [ __ ]\n cuz I know his\n I know I know\n I got him. He's like we got to get blessing all the way back. I'm like I just did this with you. I can't do another one. Do it. My body hurts from doing this.",
            "start": 1418.32
        },
        {
            "text": "cuz I know his\n I know I know\n I got him. He's like we got to get blessing all the way back. I'm like I just did this with you. I can't do another one. Do it. My body hurts from doing this.\n I felt it man. I [ __ ] Nick trying to kill me watching that was painful. I felt it bro. I felt Mike about like in that moment being like well yeah I mean if you you know the little pen icon shows you that it's above you it's 94 m that way so we you got to be better about reading that. It really felt like a dad just trying to be like come on son we got to be you know got to be smart about this\n the [ __ ] best worst at the same time. Oh my god. So funny. The best is when Nick guesses what the Dude, there was so many moments last night of I I'm assuming it's here, but it's like, but it tells you. No, Chris, don't try to tear this apart. Okay.",
            "start": 1449.6
        },
        {
            "text": "Yeah, it's our turn to dunk on Nick since he's not here. Everybody knows the rules. You're not in the room, we dunk on you. That's how it goes. Chris is trying to do the, you know, it's been 40 hours.\n Oh, you guys are having a miserable time like, you know, you guys are being bad friends to each other. Chris, we're we're all having fun. You're trying to divide this so that we I go back to Marvel Rivals.\n Yeah, he he's really missing you, man. He's been texting me non-stop.\n Yeah, I miss Marvel Rivals as well.\n And he's playing dumb games,\n but I'm in Arachus right now. I don't know how Chris isn't in this game. I'll be real with you. Talk about that. He's so committed to Marvel Rivals. It's crazy. Sometimes the game just catches you at the right time.\n Yeah. Yeah. Yeah. They got this whole lord status and I think he got addicted to be calling a lord. Like I think he uses it as big timing other players in the game where they jump in and if they don't have",
            "start": 1506.48
        },
        {
            "text": "Oh, you're not a lord. Why are you playing that game?\n He's like, \"Well, I'm Lord status. Get the [ __ ] off the character.\" And I think that really went to his head. Bounty Hunter, 13 months of support. Thank you, bounty hunter. Appreciate you very, very much. Steve Darrow 37 months.\n Steve using your Prime on me. Did you know that if you have Amazon Prime? You have Twitch Prime.\n Give me that. Give me that. You have Twitch Prime. You have Twitch Prime. You have Twitch Prime. You have Twitch Prime.\n Okay, do that again. Ready?\n You have Twitch Prime.\n Not bad. Not bad. We're cooking. We're doing stuff. If we're having fun, where the [ __ ] is Nick? We can't can't do any of these missions without Nick. Mike's building a second a third base for no reason.\n A third base for no reason. These are all things that can be blamed on Nick.\n Nick, dude, the worst though, chat. When Nick dies last night, Mike goes, \"Fucking Andy.\" I had to do it. I had",
            "start": 1555.12
        },
        {
            "text": "A third base for no reason. These are all things that can be blamed on Nick.\n Nick, dude, the worst though, chat. When Nick dies last night, Mike goes, \"Fucking Andy.\" I had to do it. I had\n And I was wondering why you did that. And now I and then it makes a lot more sense cuz you were\n done. Yeah. I caused all of that. Right. Yeah.\n Yeah. What a disaster.\n Cuz the best line is you just see it all happening. I'm doing it and then you guys come up and you're like, \"How is the worm so close, dude? It popped up immediately, man.\n I called forth the worm.\" I turn I I exit the Discord call and raise the volume on the stream like Chad, that was my fault. You're all good. You're a [ __ ] [ __ ]\n Oh, man. And he had all of his good [ __ ] That was like the one where it's like, all right, we can't be [ __ ] around no more.\n After 30 hours, you can't really [ __ ] around anymore. Had all of his good [ __ ] man.",
            "start": 1608.24
        },
        {
            "text": "After 30 hours, you can't really [ __ ] around anymore. Had all of his good [ __ ] man.\n I'm about to [ __ ] build a mega base over here, dude. I'm going to let people know. I'm going let I'mma let people know.\n What? Like, what? Like,\n fart in a bag's going to see this base and say, \"Oh [ __ ] Mike's here.\" I mean, like that kind of Where is Fart in a bag right now?\n Uh, you know what? Let me take Let me take a look at my chest. I have to\n take a look at my chat logs. I'm sure he's messaging me.\n Why did you add him as a friend? Like, I don't get it.\n If I I can't talk while I look up your number, so I could never give him your real numbers cuz I was going to have him add you. I just tried really hard. I just wanted him to add you. What do we How does this wall look? Oh, that's cool. Yeah. Yeah. Yeah. My favorite was watch just listening to us explain the same thing to Nick 12 times and then just hearing the Discord call go.",
            "start": 1662.4
        },
        {
            "text": "Yeah, I just quit. Yeah, that's my favorite. Watching just leaves us as I'm trying my best to make this [ __ ] happen for everybody. Yeah, [ __ ] you. Don't think I didn't notice that either. Right, Andy, great call on that one. We're all there playing together while she just leaves and says, \"Yeah, I'm good on that.\"\n No, thank you. I'm not helping.\n Oh, my brother resubscribed. Hell yeah.\n 39 months of Prime Gaming. Remember, if you have Amazon Prime, you have Twitch Prime. And if you don't use that, it's going to go away. It goes away forever. They don't want you using it. They want to They want to keep it from you. Don't let them. You have to prime. I think I heard a door close. Maybe it's Maybe he's ready.\n Oh, I don't think so. I can hear I can You know, you can hear him through the walls, right? Oh, no.\n Did you know that you can hear them through the walls? I hear them all the time.",
            "start": 1719.6
        },
        {
            "text": "Oh, I don't think so. I can hear I can You know, you can hear him through the walls, right? Oh, no.\n Did you know that you can hear them through the walls? I hear them all the time.\n Mike Oh, watch says go to the fourth trial. He says go to the tall rock and go to the fourth trial. Where? Where?\n Well, when I'm [ __ ] ready, I will.\n He's building a house.\n When I'm ready, I will. All right. I since nothing's happening right now and uh poor Alexi was just like give me something to switch to. I got nothing to switch to right now. Y'all are doing jack [ __ ] I'm going to go uh let's see. Let's see what I'm going to go do.\n Oh, you know what I'll do?\n Check this [ __ ] out. Check this [ __ ] out. It's at the tippy top of the big ass rock right next to us. The real tall one. The Oh, Mike. It's up here.\n The fourth trial. The one that we're right on.",
            "start": 1771.92
        },
        {
            "text": "The fourth trial. The one that we're right on.\n Where? this one. Why is she saying that it's up to you? Yeah, he's saying the big ass rock right next to us. Okay, you [ __ ] get there. Show it to me then. That's great.\n Well, I was going to fly to Eric Keen.\n Oh, okay. But shoot, I might just do this then. Yes. Uh, Alexio's here helping us out cuz Bear got sunburned. You can't be saying that, bro. He's going to come back real pissed off, bro. He's going to get mad. He's going to get mad at me of all people.\n I thought he was going to approach me about it yesterday cuz I had to shave his head. I had to shave his head and he was like, \"Um, how did the shows go?\" Uh, that was so close to being like, \"Oh, I talk so much [ __ ] about you.\"\n Yeah. Oh, it unlocks the third ability. Sick. Okay, cool. I had to bring it up. I'm the I'm I'll I'll be the brave one. You know,",
            "start": 1821.12
        },
        {
            "text": "Yeah. Oh, it unlocks the third ability. Sick. Okay, cool. I had to bring it up. I'm the I'm I'll I'll be the brave one. You know,\n I appreciate you being the brave one cuz I we all saw it and everybody had their own thing to say about it, but nobody said it said it, you know. So,\n I'm going to miss\n We appreciate that\n cuz of sunburn. I did like here's the thing though. When I gave him a haircut,\n I was his face looked fine.\n I mean, it's got, you know, some kind of but it's it's and then I looked down and he was like, \"Yeah, it's my leg.\" And I looked at his legs and dude it looks so bad. How do you get that sunburnt?\n He pass out in the in the sun. Like how how do you actively get that sunburn on the legs of all people?\n I don't know. I don't know.\n You got to be You got to be yams out.\n He was doing I mean like full yams out and like not paying any attention.",
            "start": 1870.4
        },
        {
            "text": "I don't know. I don't know.\n You got to be You got to be yams out.\n He was doing I mean like full yams out and like not paying any attention.\n Yeah, he he was yams out. I believe he was yams out. Y jams out bear. The man who barely ever wears shorts. He wears shorts once a year. Well, I think we learned he's not wearing shorts. He's not wearing any shirts anytime soon. Yep, that sounds right. Oh yeah, look at this big ass rock. Oh no, this isn't even the rock. Holy [ __ ] That's crazy. That is not the rock. It's that one. Oh my god. I never even looked at this [ __ ]\n Yeah, you were hovering over that one. I was like, that's going to be a big climb. Good thing you got that suspension built and jump right up there.\n Zipline.\n Now, chat, you guys said when I break things down, I get refunded on the mats, right? Meaning that I can just essentially take those mats and then use them somewhere else.\n Yeah,",
            "start": 1920.24
        },
        {
            "text": "Zipline.\n Now, chat, you guys said when I break things down, I get refunded on the mats, right? Meaning that I can just essentially take those mats and then use them somewhere else.\n Yeah,\n that's great. Good to know. I love uh I love breaking down purple weapons, you know?\n Purple weapons. Oh, okay. Like if I know it's a weapon that I'm not going to use, I break that [ __ ] down and I guess the spice infused steel or whatever, dude. This zipline is rocks.\n Yeah, right. It's pretty cool.\n Holy [ __ ] We are zooming up here, man. This is awesome. I wish the sun was out. Be a lot cooler looking. the lighting. Damn, there's just some dead bodies out here. Take their money.\n Just a tri, bro. Make sure take their blood, bro. Take their blood.\n Oh, yeah. You're right. You're right. Nick is on the way. I felt so bad yesterday. Yeah. And then even though it was your fault. Um, but I did give him a lot of stuff.",
            "start": 1969.92
        },
        {
            "text": "Oh, yeah. You're right. You're right. Nick is on the way. I felt so bad yesterday. Yeah. And then even though it was your fault. Um, but I did give him a lot of stuff.\n I mean, the best part is he doesn't really know that. You know what I mean? He still thinks it's your fault. So, all in all, I won on that one. You know, I feel good about myself on that one.\n Yeah, it's usually how it goes.\n He still thinks it's your fault. So, it's going to be great.\n You You win when you lose though. Anyway, so like the Stu Gats are kind of funny. When I'm wrong, people like it. So, it's\n Did you message him yet?\n Who? Stu Gots and their team\n because you know he's coming out for the dead. I told you to message him. Get him in the studio.\n Oh,\n how do we make that happen?\n No, I didn't do that. I I\n Think about it. Think about it. I did hit them all up asking them uh about Super Bowl stuff.\n Okay. February. I like that.\n Yeah. Just kind of like offering up the studio without anybody's permission",
            "start": 2032.24
        },
        {
            "text": "Okay. February. I like that.\n Yeah. Just kind of like offering up the studio without anybody's permission\n because it's here. Yeah. It's a great call. Yeah. Yeah. It was Joey's call. She was like, \"Should hit them up cuz like Pablo Tory follows me and we, you know, I'll DM every once in a while and he'll DM back.\" And I I was going to say we DM every once in a while, but that's not true. It's really just me being like, \"Hey, that episode rocked and he'd be like, \"Thanks, dude. Appreciate it.\"\n Prayer was of our own making.\n It seems since any siege has gifted us with a\n Yeah, I think that would be really sick.\n Devotion.\n Damn, here it is. trial pilgrims these days, but we here stayed true to our history. You're\n our faith,\n though the Where are you? Oh, we're not we're not so it here. Let me let me add you.\n Show me the map. Oh, yeah. Add me to your thing.\n Love grows even\n tippy top of that rock. Alexio says, \"Okay,\n not even the tippy top. It's like right below the big block.\"",
            "start": 2093.84
        },
        {
            "text": "Show me the map. Oh, yeah. Add me to your thing.\n Love grows even\n tippy top of that rock. Alexio says, \"Okay,\n not even the tippy top. It's like right below the big block.\"\n Proudly answer the seven mystic questions. Okay. So you're like right there\n with joy in our heart.\n Yeah. It's like right before the big rock kind of becomes the big rock.\n Wow. Okay. You think anybody's built up there? I bet you somebody's up there.\n Inhale the spice. We're inhaling the spice.",
            "start": 2140.96
        },
        {
            "text": "Inhale the spice. We're inhaling the spice.\n Oh [ __ ] Fourth trial. What's it going to have him do? We'll find out. Why is your coat so cool? Um I built a new still suit. Oh man, I'm getting so jugged up. M let the spice speak to you, bro. Mad in the YouTube chat. Sugot seems like the guy who feels random DMs. Yeah, for deals and free stuff. Yeah, for sure. Uhoh. What's this new one about? Josh toe for 53 months. Thank you, Josh. Josh, what up, dude? Dang, it's such a pretty game. How do we honor the creator? Our enemies are as blades of grass moan down. Do you understand? [Music] I do. I do understand. So, watch it. This is where we get the third skill. We unlock it. Get buried, [ __ ] [Music] Do I just keep walking? Oh, [ __ ] scared the hell out of me. God damn. Oh, I heard that. I heard that. Something about this mouse. Mike, remember the one game we were playing where whenever I held down too hard on the left mouse, it brought up like the the wheel? Yeah.",
            "start": 2166.56
        },
        {
            "text": "Look at this. It does it here, too. I wonder what that is. Just jamming up all the buttons.\n Got to get a new mouse. Oh, [ __ ] Never forget [ __ ] Hi. Fighting the guy, dude.\n Yeah, that's interesting. And I'm definitely taking way too long cuz like the cut scene stopped. Oh [ __ ] Oh, I was supposed to die. Scripted, Mike.\n Well, yeah. He wants you to die to the worm, too. He spoke He speaks to you when you die to the\n Oh, is this where I go? Like, is this Do I get the burst power?\n Oh, [ __ ] Thine enemies shall fall. Awaken precience. Oh [ __ ] Mike. Dude, I have like an ultimate power.\n There you go. Oh yeah, you've unlocked it. There you go. Yeah. What does it do though? Oh, whoa, look at that [ __ ] Mike. Hold on. Oh, check this [ __ ] out. Hold on. Hold on. Let me Let me wait for it to re to reset.\n I'm watching. I'm watching.\n Check this [ __ ] out. Hold on. Hold on. Crazy.\n Hey, now.",
            "start": 2298.24
        },
        {
            "text": "I'm watching. I'm watching.\n Check this [ __ ] out. Hold on. Hold on. Crazy.\n Hey, now.\n Whoa. Didn't know we were doing tricks like that, bro. Pretty cool. It's a pretty good video game.\n Just kne a dude in the head. Weren't you already kneeing people in the head?\n No, that was Nick.\n Oh, Nick's with the flag knee. It was wild.\n I think whenever you have this this power set, you have like a an ultimate bar.\n Okay, Nester, not Netor. Thank you for the $2 super chat and the kind words. Hey homie, welcome in everybody. It's a nice just chill Wednesday. You're halfway through the work week. We're having fun playing more Dune. The team is just addicted to Dune. We have a problem. We have a big problem with Dune. It's lit. That's cool.\n I'm just out here chopping rock. How do we honor the creator?\n We fight. What do I got here? Wait. Oh, you consume spice products for the alt bar. That rules now.\n Oh, now you can eat that stuff. Yep, yep, yep, yep.\n Eat the little meatballs or whatever.",
            "start": 2422.56
        },
        {
            "text": "We fight. What do I got here? Wait. Oh, you consume spice products for the alt bar. That rules now.\n Oh, now you can eat that stuff. Yep, yep, yep, yep.\n Eat the little meatballs or whatever.\n Yeah, all those meatballs. That explains the spiced coffee mug that I can unlock. Why do I need a spiced coffee mug?\n I could go for some spaghetti right now.\n I can't eat until meal. That's good.\n Fight.\n At about 11:45, I decided to just go ham on these tortilla chips.\n Okay. Yeah. Yeah.\n And I was like, \"Oh, man. I'm just pushing back my my timer for tomorrow. So you just fast for 12 hours a day?\n 16 16 hours a day you fast for Okay. 8 hour period to eat which in where you consume what your daily allowed\n um uh\n calories or just as much as you can shove in your mouth.\n No, I don't even like I don't eat everything I can in the eight hours. It's not like a, you know, I'll just like I'll eat a meal and then like a, you know, a couple snacks or whatever. I don't know.\n Okay.",
            "start": 2483.92
        },
        {
            "text": "Okay.\n There's also OMAD. You ever hear OMAD?\n No.\n One meal a day.\n One meal a day.\n Yeah.\n Okay.\n Like that. You just go hard on one big ass meal.\n That's what my buddy JD does.\n Oh, really? Like RJD?\n Yeah.\n He just like I think JD like Why'd you say my buddy JD? You know what my buddy JD does?\n Talk to him a lot. Oh, Chris doing the same thing, too. Yeah, it's a um I'm I feel like it's like regulating my body better and [ __ ] Maybe it's just all in my head. But dude, that was sick. That That was a cool little trial. It makes me wonder what the hell the trial was about with the eyeball. Like that hasn't really been applicable to anything we've done yet. Is that just like",
            "start": 2552.56
        },
        {
            "text": "that wasn't teaching about stealth and Yeah, I thought it was like stealth. I felt like we haven't been stealthing in this game. I feel like you shoot one thing and people just know where you're at. Dude, look at the lighting in this area. What a [ __ ] gorgeous area this is. Zoom. So pretty. Yeah. Showing you how the shadows work. Yeah. Hiding from the sun. You can equip. Oh, yeah. The three abilities. Here we go. Let's equip this third ability. This rocks. I got the that thing. That bad boy. What's on my mouse? Five. Oh my dodge. That's right. Dodge is so important on a mouse button. Don't leave home without it, chat. Um Let's try Let's try out the uh the decoy. That could be cool. I think we're playing Peak next week. How did it go last time, Mike?\n Good. Uh we had a tough one on mission two, day number two, but it seems like a fun time. I wrote you guys down. I said play for at least an hour. I think you get a good hour of laughter and then it's like one of those moments of",
            "start": 2609.92
        },
        {
            "text": "Well, what do you mean you guys? Are you not going to join us?\n Well, no, I'm off because of Death Stranding.\n Oh,\n yeah. Yeah. This So, like this is probably going to be a Blessing Greg, uh, Andy and Nick stream is what I'm hoping for that. Yeah.\n Oh, you're going to love Peak, bro. Peak. [ __ ] yeah, bro. You should play Peak with me tonight. You'd like Peak. Good little fun laughter game. I'm just too into this.\n I know. I just want to play this for 12 hours.\n I just Yeah, I really just want to do this. It's crazy.\n It's crazy.\n It's crazy how good it is. Like this game would legitimately be perfect if it wasn't the Dune universe\n only because you'd be fighting monsters that are like,\n you know, there would be boss fights with like larger beasts and stuff and the strategy that could be in there would be amazing.\n I love the Dun.",
            "start": 2718.24
        },
        {
            "text": "you know, there would be boss fights with like larger beasts and stuff and the strategy that could be in there would be amazing.\n I love the Dun.\n But like I just assume we're going to be fighting a bunch of humans. Oh, here's the thopter. Oh, and a little treasure. Dog, this game [ __ ] rocks. I love this game. I don't think I need to mine the thofter, but I will. Oh, it's just salvage metal. Andy's character Andy's character looks like Annie when he tries to put on too many coats. It's a cool looking coat. And it has the still suit functionality still.\n Yes. Yeah.\n Oh, that's a win. Yeah. Yeah.\n It's the upgraded still suit. It's like the third level upgrade still suit, but uh using transmog for the coat cuz this coat I think is originally Yeah, I'm using Minnol's steel suit garment cuz Yeah, check it out, Mike. This purple steel suit is 156 armor value.",
            "start": 2764.8
        },
        {
            "text": "Okay. And the one that I had crafted to get this visual transmog thing I think is the the slaver still suit and I think that one's uh it's weaker weaker armor-wise. Wizard you gifted out.\n We got some people gifting subs taking advantage of the Twitch drops as well. If you gift out two subs, Twitch will give you some in-game rewards for Dune as well. All right, we're just burning out here. I appreciate the people who just have the small bases. You got to wonder like did they give up on the game? Did they move and just not destroy that base? Like what's up with some of these smaller boxes that we see? Where are those people?\n Just getting the getting the goddamn shade a little bit. Just cutting it down.",
            "start": 2853.12
        },
        {
            "text": "Just getting the getting the goddamn shade a little bit. Just cutting it down.\n Drink some awa. Thank you, Wizard Dude. Thank you, metal baby Mario, for getting out two as well. And the potato slug. Oo, potato slug. Maybe it's slugger, but the R is missing. Thanks for subscribing with Prime, a first time subscriber. and the homie Maddock gifted out two subs. Also, resubscribe for 64 months with Prime and says, \"This game seems like a Chris Anka game. Am I right?\"\n Really does, man.\n How much? How do we get them in? You know what I mean? Chris, like, you want me to buy it for you right now? Buy it for you right now.\n You download it.\n You could just listen to all the same stuff Mike's been telling three players for the past week what to do. Uh, well, Chris Anker is the one who gives the task list. I'm just a task master. Okay. He gives a list. I kick it out. Oh,\n you know, like helping out.\n We don't do that, Chris. You know what? Don't Don't come.",
            "start": 2910.24
        },
        {
            "text": "you know, like helping out.\n We don't do that, Chris. You know what? Don't Don't come.\n Holy [ __ ] Look how Look at this bike. This is crazy. You got the tippity top.\n Yeah,\n tippity top. Damn. Oh, do I have my car? Did I suck my car back up? I was about to just jump down without my car. Don't you have the hover waistband? Um, but I wanted to fly to the anvil. Oh, look at the shyude way over there. That's crazy. I think my car is back at my base. I think I just ran over here. Sandstorm due in a minute.\n Alert.\n Nick's got to hurry up. Manny Bagel Boy Sanchez gets it on fire. Manny Bagel Boy Sanchez.\n How's the kiddo, dude? How's life?\n Still one of my favorite podcasts. how I was recommending Manny Bagel Boy Sanchez surprise his family about them having a baby.\n Okay. What happened?\n I don't remember, but it was funny as [ __ ] He's got a bagel shop, you know.",
            "start": 2965.12
        },
        {
            "text": "Okay. What happened?\n I don't remember, but it was funny as [ __ ] He's got a bagel shop, you know.\n Okay. And I was forgot what the bagel shop is called, but I was recommending invite the parents to the store to the restaurant, but change the name bagel on the sign to baby. It was something like that. There was another genius. Of course, probably super funny. You know me, you know.\n You're too talented and funny. You know that",
            "start": 3027.68
        },
        {
            "text": "You're too talented and funny. You know that\n funny as [ __ ] Grub soldier, thank you for two months. Wow, look at this dive. This is wild. [ __ ] [ __ ] Sector weather alert. A large sandtorm is approaching. No, a large sandstorm. I'm going hard in the paint, dude. Look at the sandstorm coming in. Holy [ __ ] That's not good. Oh my god. I think I'm I think I'm safe here. I am. I'm sheltered here. Whoa. [ __ ] sandstorm. Oh, your boy stomach. Mike face. [ __ ] insane, man. What the [ __ ] Cooper says, \"Mike is just not watching his feet.\" A storm is super close. Mike asked Mike, \"How come you're not?\" Or Jose asked, \"Mike, how come you're not playing?\" Mike's playing.\n Oh, homie. He's playing right next to me.",
            "start": 3055.76
        },
        {
            "text": "Oh, homie. He's playing right next to me.\n Yeah, it's I just have to rebuild a base. It's time. It's time for me to have a new base. So, your boy's getting after right now. It's one of those you hit a point where you see all the Tik Toks of the kid with the ultimate base with 20 generators and you're like, \"Oh, that's going to be me.\" And I'm hitting that point of like, I need more space. I need a lot of work. I need things to do. So, I'm building. Dude, I have so many generators. Look at my [ __ ] I have three in here. M Mike.\n Okay. And then and then [ __ ] underground. Got two more underneath the\n I'm telling you, dude. You got to have that, bro. You got to have this [ __ ]",
            "start": 3125.04
        },
        {
            "text": "Okay. And then and then [ __ ] underground. Got two more underneath the\n I'm telling you, dude. You got to have that, bro. You got to have this [ __ ]\n Anytime I would like put up a new fabrication thing and my power, the whole house shuts down. God, I [ __ ] love this game. It's a problem. There we go. Oh, how did you get up there? Excuse me. What is that? I got to put some lighting here. Can't have it just looking like this. All right, time to put on a roof.\n Maybe I'll put a little art piece up here, chat. Look at this. Wow, look at that. You step in immediately greeted with some ornate art. Beautiful. See, I'm like, I know this isn't the end, but I'm going to put the roof up now just cuz I I got to say this is where you stop, Mike. You put this now. You got to get the insides. The foundation is done. Now it's time for the insides.\n Oh, really?",
            "start": 3160.08
        },
        {
            "text": "Oh, really?\n And then I'll pop the top on this and go even higher when I'm ready. Cuz if not, I'm going to build all day and we won't be able to do any story missions and stuff. So, I got to eventually you got to say no.\n Look at this. I got I also got the trades lighting mic.\n Okay. And good look.\n Yeah, these just look a little bit Yeah, they're like they're modeled bit different. Also, check out this little art piece I just put up on my wall when I walk in.\n Oh, yeah. That's cool. That's\n And you get those from from Eric Keen. So, we got to go get this [ __ ] [ __ ] Nick. You\n don't put that on me. It's Nick, bro. Where's Nick at? We got a little two box. Nice. Okay. Yeah, we gave up on Nick. Oh, sometimes that happens here where you you think you're going to start off strong with three and then we lose one. You know, it's like, all right, we're on the move.\n Ruining this.",
            "start": 3236.88
        },
        {
            "text": "Ruining this.\n We're on the move. Let's keep it moving. Six. Give me that special. Let's What is this one? How crazy you got to be? Oh, yeah. You got to be crazy on that. Beautiful. Nick is done with doing waking. Oh, he's pumped, but he's in a meeting right now. He's on a call.\n Nick is the one who loves it the most.\n Pissing me off. I don't know what Tim's thinking cuz like Nick can only hurt the possibilities of like a sales call. You know what I mean? Like his plus minus on the floor\n not helping.\n It would not be great. I I wouldn't think. I don't even know if it's a sales call. I don't think it is. Spice Milange coffee. He's cooking that. Okay. need more regular building materials. Nick made himself a nice little home. He figured it out at the end of the day. It's one of those like I didn't know if he had it, but like it turns out he does. And after seeing what he built for Bless yesterday, it's like, \"Oh, Nick's got it.\" You know what I mean? Nick's got Nick's got game on it.",
            "start": 3283.52
        },
        {
            "text": "You mean just visually or?\n Yeah. And just building the house like space-wise. He did a good job on this last one. Oh,\n yeah. This kid, man, he got you. He built a monstrosity in front of your old house. I'm tell you, dude. You see why I left? Like,\n he said, \"Get out of my way.\"\n You think I left because of like your little No, I left because of that, dude.\n That kid built a base. Ugly ass. This thing is massive.\n Ugly.\n Look at this. It started off as just one box here and then he grew all the way up. Made a flight deck up here. a [ __ ] 5-year-old just like\n putting Legos together. You know what I mean?\n That's why I said we got to go to area three or four.\n Dad, I made the tower built bigger. It's like Yeah, it looks like [ __ ] Johnny. Like,\n I told you we got to get away from Johnny, bro.",
            "start": 3403.36
        },
        {
            "text": "That's why I said we got to go to area three or four.\n Dad, I made the tower built bigger. It's like Yeah, it looks like [ __ ] Johnny. Like,\n I told you we got to get away from Johnny, bro.\n God damn, man. Just no sense of of of aesthetics out here. We want to have our light want to have the lighting all, you know, mathematically correct. It's a science. I love you got the lighting down. What's the lighting cost? What are you putting in for the lighting?\n Oh, not required. Just salvage metal.\n Oh, really? Just salvage metal? Okay.\n I think uh as you try to get more complex lighting, it costs more.\n Okay,\n that's about it. You got to finish this [ __ ] house so we could have something to do on this stream. What you talking about? This is what I've been doing. Dude, sometimes you got to build, dude. People know that. Sometimes you got to build. Are you building? You got stuff in your place you got to finish up? N man,",
            "start": 3442.8
        },
        {
            "text": "you're you're set. You're dialed. Like I'm set until we move to the next spot. Like it's it all has to do right now with the things that I need to build are not things that I can get yet.\n Okay. So, you got the vehicle building thing and all that jazz. Damn.\n Yeah. Yeah. Yeah.\n Okay.\n Oh, yeah. Got a medium blood bag for Nick. You know what? I'm going to show you the little gift that I made Nick.\n Yeah. Show everybody what you got him.\n Let me Let me go show you the the gift that I made Nick. and a little care package. You know, sometimes you go to an event and on the hotel bed they'll leave a little little goodie bag for you.\n Oh man, you're going to some cool events. No, no, I haven't got that yet. That's sick, though.\n Well, it's only been like two. I mean, when I say goodie bag, I don't think it's like the Oscars. They give you three iPads or whatever. It's, you know,\n they giving out iPads there. That's lit.",
            "start": 3525.6
        },
        {
            "text": "Well, it's only been like two. I mean, when I say goodie bag, I don't think it's like the Oscars. They give you three iPads or whatever. It's, you know,\n they giving out iPads there. That's lit.\n No, it's a [ __ ] like, you know, here's a chocolate bar or something. Um, but I kind of, you know, I did that for him. Just a little surprise. I hope that he didn't think it's doesn't think it's a prank and he's going to walk in. It's going to be bad.\n I don't think he'll see it.\n That's a [ __ ] I mean, that's probably the\n Here's the catch. I don't think he's going to see it.\n Damn. I don't think you've ever been more right about anything. I got a good feeling like your boy's not seeing this.\n I don't think he can miss it. It's in I put it in the middle of it.\n Well, Andy's missed a lot.\n You're right. Yeah,\n he's missed a lot in front of us.\n The the texting on screen saying something off",
            "start": 3563.44
        },
        {
            "text": "Well, Andy's missed a lot.\n You're right. Yeah,\n he's missed a lot in front of us.\n The the texting on screen saying something off\n the is like where's the slave camp? I I don't know, Nick. Where is it? Where the [ __ ] is it, Nick? And then we finally broke down. Just show us your screen.\n Show us goddamn\n so I can see what the hell's going on in your life. Well, there's a big area here. It's like, well, you're not in the area. You can see you're not in the area. Wait, it's gone.\n Of course, if you drop [ __ ] does it just disappear?\n I would not be dropping [ __ ] No. No,\n even in a house.\n No, you got to be putting that [ __ ] in the chest. I think if you drop that [ __ ] that means it's going. Yeah, I think you got to put that in the chest, bro. Bro,\n it's gone. Mike,\n you just decided you thought I'm going to leave a care package on the ground and just leave it laying on the ground. A bold choice.\n I didn't think it would disappear. This is what I did. I like said, \"Here it is.\"",
            "start": 3600.32
        },
        {
            "text": "I didn't think it would disappear. This is what I did. I like said, \"Here it is.\"\n I, you know, I dropped like multiple things and and it was all in one of these things.\n Yeah. I bet you that's got a cool down time of about 5 minutes maximum.\n Oh my. It's maybe less than that.\n It's all gone. Well, what was all what's all of it? Like kind of everything you need to get like, you know, it it was plastic seal [ __ ] things. It was my old set of armor, which is upgraded. It was the purple sword. Well, you know,\n it was pretty much like over 30 of everything. Here's a care package to get you back on your feet. Oh, well, I guess we can uh we could say now that like, you know,\n you can build it back.\n I'll tell you why I didn't I'll tell you why I didn't put it in the chest. cuz I didn't think he would see it. Six.",
            "start": 3664.48
        },
        {
            "text": "you can build it back.\n I'll tell you why I didn't I'll tell you why I didn't put it in the chest. cuz I didn't think he would see it. Six.\n I gave him a lot of iron though. It's all gone. That dish is tragic, dude. Oh yeah, there it is. You get all that back. You're so right, chat. Oh my god. It's a bloody megalodon.\n Yeah, I get Andy just gave a donation to the desert. Is a great\n I gave back to the desert, but not even in the desert.\n Yeah, you live, you learn. You live and you learn. Well, the cool part is you got time to make him a new one. You got time to make him a new one. Why don't you make him a little new one? Cuz now I'm playing the game where I got to move all the stuff that I just finished from my base into the new base. I'm so heartbroken. I'm going to take his aerithide crystals. Don't tell him anything.\n Take. You take.\n This transaction just turned into me taking. You take. You'll be all right.",
            "start": 3718.08
        },
        {
            "text": "Take. You take.\n This transaction just turned into me taking. You take. You'll be all right.\n Oh, he's got these things. That's cool. Oh, I am I am so bummed out. That [ __ ] sucks. Don't tell them about the Yeah, don't tell him about Don't forget to pay your base taxes. I don't even know where to do that or how to do that.\n I thought they said it's over at that home base that you went to. I'm going to have the IRS come after me. Yeah. I mean, they they've been chasing Maddock down since day one of this video game. Somehow Maddock hasn't been allowed to be in his home without getting somebody out.\n No, that's like they that's a UFO. Or not the UFO, but the flyby dudes. I'm so heartbroken right now. It's nice to see Gary Gary logging on a rematch.\n He's into it\n because it it I no longer have to see Gary Wood is now playing Hell Divers 2.",
            "start": 3773.36
        },
        {
            "text": "He's into it\n because it it I no longer have to see Gary Wood is now playing Hell Divers 2.\n Hell Divers 2. Holy [ __ ] every day. He loved Hell Divers. He loved that game. All right. Oh my god, I'm just so hurt right now. I had so much stuff that I ended up just stealing from him. Like, look what I've become. What have I even become? Cobalt Pace. Let's [ __ ] go. All right, let's see what's what. Okay, what's the play? The play is the play is we go to the wreck of the palace to get plastic seal [ __ ] from for Nick.\n Okay. Okay,\n that's the play. That's your move right now. I like that. Well, I would love to go do this Imperial testing station. If you hurry up and build\n [ __ ] You tell Nick to get in here, bro, cuz then we're going to do it without him. He's going to get all up tight.\n No, he already did this. Okay,",
            "start": 3829.84
        },
        {
            "text": "he did. This was the thing he accidentally did when we He went to the wrong place, man. I'm I'm hurt. It hurts, Jet. I don't even want Nick to walk in the room. I hope Paul stays forever. This is going to be like when I called the Pokemon stream that one time. Hey, how's everything going, Nick? Oh, things are going great, dude. We leveled this and that up. Um, you know, that boss, you know, that trainer was easy. Geodude died. Uh, what was that last part? Well, which part? The boss that we all [ __ ] It is what it is, chat. What are you going to do? The desert taketh and give it. That chest piece is so bulky. I think it's sick as hell, dude. Look at me, man. I look awesome. Okay, I gotta put some [ __ ] away. I can make him a medium. I have I can give him my medium blood sack. That's what I was going to go do and then I was just really taken aback by what happened. Really hurt by that. these stupid pants. No, Nick, he's on a call right now. He said he'd be done in 20 minutes, and",
            "start": 3903.92
        },
        {
            "text": "what I was going to go do and then I was just really taken aback by what happened. Really hurt by that. these stupid pants. No, Nick, he's on a call right now. He said he'd be done in 20 minutes, and that was a lie. June down. You don't understand loss. Tell him he's ruining my birthday to get on here. Happy birthday, Dill Snoopfus. Happy birthday, Dills. He's ruining my birthday. [ __ ] Nick.",
            "start": 3996.56
        },
        {
            "text": "Mike, have you been looking at menus for this weekend? Got to get prepared. Oh, Death Stranding. Uh, dude, I've been looking at a menu. Okay. And you'll see it on Friday. I had to read food menus.\n Oh, I' I've been reading owner's guides is what I meant. You know what I mean? I got an owner's guide I got to read through.\n Okay.\n I got I got a I got something in my life right now that you got to really understand. You know,\n that means nothing to me.\n I'm excited to show you all. That means nothing to me. And he says, \"Don't worry. You're going to be getting up on it.\n You'll be on it. I don't want to know. You cannot threaten somebody. Don't worry, you're going to be getting up on it. I don't know.\n Getting up on it, he says.",
            "start": 4053.76
        },
        {
            "text": "You'll be on it. I don't want to know. You cannot threaten somebody. Don't worry, you're going to be getting up on it. I don't know.\n Getting up on it, he says.\n That's what you said. What do you mean he says it would be awesome if Chili's sponsor the stream, but they don't want success. Yeah. They don't want Roger's love. Yeah. Yeah, you do. You pay taxes in this game, Chad. You got to build a house and you pay taxes to like the at trades. Look at what I've created.\n Wow, look at that. My\n is that not better or what? That's so much more space than that over there. Come on now.\n That's beautiful. That's the space that I need.\n It looks like a similar to the building we saw yesterday. It looks like a community college.\n Oh, okay. Nice. Yeah. Yeah. Thank you. Thank you.\n The layout of it. That sounds like an insult, but it's not. It looks like it looks good. It looks built in world, you know, like that was already there.",
            "start": 4085.36
        },
        {
            "text": "The layout of it. That sounds like an insult, but it's not. It looks like it looks good. It looks built in world, you know, like that was already there.\n That's great. And he's about to become a Republican over these taxes. I'm going become a libertarian. Stop taxing me. God damn it. Don't tread on me. Shy Halude, please do not ruin my life. Dog, my bike is hella fast. Don't even got the foot. Yeah,\n I got like level three treads, a level three engine, a level three something else. Battery, I think. Holy [ __ ] Oh, dude. I can use my ultimate to just go full psycho freak on him. Can't wait for this to launch on console. Dude, Tide Drums. This is Everybody's been talking about it.\n This is some of the most fun I've had in a long time in gaming. Yes, we're getting we're getting stuff for Nick. We're building back better. Oh, okay. May not be perfect.",
            "start": 4142.72
        },
        {
            "text": "This is some of the most fun I've had in a long time in gaming. Yes, we're getting we're getting stuff for Nick. We're building back better. Oh, okay. May not be perfect.\n Any way to help him out, though? I was like, dude, this old piece of armor that I have that's much better than even the one that he had that he lost going to be such a huge boost for him. Shalloo took it. Did he get eaten again? Who? Nick. Uh, are you talking about a Well, yes, he did. Chris, I don't know if you were watching last night. You got to unhide that VOD mic. Just take one copyright strike, you know.\n Dude, [ __ ] yeah, bro.\n I mean, it's\n cuz that part needs to be clipped out. I really regret not going live on YouTube just for the archive, but you\n should be going live at all times, bro.",
            "start": 4221.76
        },
        {
            "text": "Dude, [ __ ] yeah, bro.\n I mean, it's\n cuz that part needs to be clipped out. I really regret not going live on YouTube just for the archive, but you\n should be going live at all times, bro.\n Nick getting killed last night was the funniest thing ever. and then making the big all of the all of the leadup to being like, \"Oh my god, I got to go get back and get my stuff. It's going to be scary, dude. Can't believe that happened.\" But here's all this buildup buildup buildup. Arrive there only grass. This is heartbreaking.\n That was pretty [ __ ] awesome. That was pretty [ __ ] awesome, man.\n It was so damn funny. All the enemies have probably just got killed here. Nobody's been here. Mike, since D2 takes place in Australia, are there any local Aussie food vendors in SF you could get food from for the stream?",
            "start": 4289.52
        },
        {
            "text": "It's a great question. I would say tune in to find out. Yeah, we got a good feeling about it. We got a good feeling. We know just enough, but also not enough. So, I feel like Roger's going to impress you. Roger went above and beyond on this one.\n We've got a feeling. And as many people in this office will tell you, when Roger gets going, you just stand back and let him work cuz he's got something fun going on. Just dropping off all this [ __ ] I'm excited for you to have fun. I'm excited to just, you know, we'll call you. Yeah. I'm, you know, silent society. You know, someone called my cell phone. I lost it in my closet. I don't know where it is. Oh, it's on silent. If I lose this phone, you can't find it. It It makes no vibrations, no noise. I don't know how to access and find my iPhone. This phone leaves, it's gone forever. You just give up on it. Like but so much of it again under your control.\n You know you don't need to. You know what I mean?",
            "start": 4356.0
        },
        {
            "text": "You know you don't need to. You know what I mean?\n These are all things that are easily avoidable.\n A lot of people say you got to break free from technology from\n break free from the phone.\n It's everywhere in our bunks, in our child.\n Like you're using technology to block Roger. That one felt good. That one felt good though.\n This [ __ ] him for a week.\n And then last night he'd be like, \"Why the [ __ ] did you block him? He He taken Blessing out to eat to lunch instead of me. I always ask him to go out to lunch. He never says yes. Goes out with blessing. [ __ ] you, Roger. What would you do if Roger uh canvased in your neighborhood and knocked on your door? I'd knock him the [ __ ] out. That was a good clip. Don't clip that one out.",
            "start": 4420.56
        },
        {
            "text": "That was a good clip. Oh man, where do I get this goddamn key? This dagum key. Gamma, thank you for gifting out two subscriptions here to kind of funny. You all help keep the lights and the mics on. We appreciate y'all supporting us here. It's your prime subs. It's your view time. It's your tier one subs or your Kind of funny memberships. All that stuff helps keep us employed and hopefully bringing laughs and smiles to your life. So, thank you everybody for your support. He's unhinged, Daniel Z. like he just he it's just psychotic.\n A lot of people say he's having fun. He's having a good time. Uh okay, I've cleared all that out. Yeah, we got to get a bigger bodysuit, bigger backpack. What's up with that?\n I got to assume.\n Where's that at?",
            "start": 4462.48
        },
        {
            "text": "I got to assume.\n Where's that at?\n Yeah, I got to assume that that just kind of comes with a better suit cuz you're not carrying a backpack on your person. I also wish I didn't give that motorcycle to Nick because now I need a motorcycle. It would help me a lot with this running back and forth.\n Dude, I left that for him, too.\n You left him a second motorcycle?\n Yeah, I left them like my my tier 2 pieces now that I replace him with tier three pieces. Uh oh. Tommy says, \"Bad news for y'all. It never gets bigger.\"\n Oh man.\n Isn't that unfortunate? It sounds like me at age 16 just being like, \"Damn, really? That's the size?\" Never going to get bigger. Oh [ __ ] That's It's maxed out. Really?",
            "start": 4516.56
        },
        {
            "text": "Oh man.\n Isn't that unfortunate? It sounds like me at age 16 just being like, \"Damn, really? That's the size?\" Never going to get bigger. Oh [ __ ] That's It's maxed out. Really?\n All right. These are all things I got to put in chest, so I'll grab those. We got to start breaking [ __ ] down. Saving my sub for a hype train this weekend. Dark uh death 2 just pre-ordered because of freaking it one. Freaking it. Yeah, we got a lot of excitement going on with the with this. It's going to be a fun time. Upgrading pouches for more space is some of the best dopamine in video games. I I agree. Hard to agree there. I mean, really just upgrading anything. It's number get bigger, smile get bigger. Where the freak is this stupid bracelet, man?\n Choice. Losing my damn mind here. All the bad guys are going to spawn. We've been here a million times. Why can't I find it?\n Somebody says, \"You saw the key earlier, but you didn't unlock.\" Oh, son of a [ __ ] Oh, damn, Cooper.",
            "start": 4551.36
        },
        {
            "text": "Somebody says, \"You saw the key earlier, but you didn't unlock.\" Oh, son of a [ __ ] Oh, damn, Cooper.\n And it's crazy that that area is PvP, and we have not yet bumped into anybody to do PvP.\n This area is PvP. Yeah, they say all the crash sites are PvP. Yeah, except for the first first one, but that one right there is PvP essentially.\n Really?\n But we've never bumped into anybody to\n start shooting like that.\n That's surprising as hell to me. I had no idea. It's on the upper deck. Oh, is it? Oh, I thought this was an audio [ __ ] I thought this was an audio tape. Whenever I see green, I just think it's a little uh voice memo. All right, sick. Red Hudson asked, \"Mike, did you swipe the car in a big boy treadmill?\" Find out Friday.",
            "start": 4622.8
        },
        {
            "text": "Find out. Find out Friday. Find out. There's also, if you're a kind of funny member, a Greg way up, a 45minute vlog of me and Roger looking for the perfect treadmill up right now that you could go watch, laugh, and enjoy with. Great social content. Did you see that up on Instagram?\n Lot of great engagement, a lot of funny comments.\n Oh, really?\n Yeah. A lot of people love my tracksuit. Yeah, it's really loud. They say, \"Great tracksuit.\" Uh, let's see. fabricators. Oh, refineries. It It is like h you know Lulu Barrett and Alyssa's dog having the bell on her neck.\n Okay. You got Oh, she got a little bell on her",
            "start": 4688.24
        },
        {
            "text": "Okay. You got Oh, she got a little bell on her\n neck. It's you with a tracksuit. We always know where you are. Yeah. It's funny. It's like Greg when Greg brings in the dog. There's like a bell, but you don't see the dog cuz it's so small. I'm like, is this man wearing a bell right now? Like what the [ __ ] is happening? It's like, oh no, his dog is here. Yeah. Yeah. It's just so small. Manny Bagel Boy Sanchez $10 super chat says Maxi is good Mike. He's getting into soccer and he's pretty good at it and also really into Mario and Banjo Kazouie.\n Wow. I was showing that podcast Andy when you helped Bless announce him. Thank you. Glad he's doing great. I'm going to destroy this house. It's going to be awesome, y'all. It's going to be really cool when this house is fully destroyed. Like like I'm tearing it down to the studs, Andy.\n Oh, the old one.\n Yeah. Mhm. Gone. You could just destroy the sub thief. And Oh, I guess you want to get all your [ __ ] back though.",
            "start": 4727.68
        },
        {
            "text": "Oh, the old one.\n Yeah. Mhm. Gone. You could just destroy the sub thief. And Oh, I guess you want to get all your [ __ ] back though.\n Yeah. I got to get all this equipment first. Pretty cool that everybody here was dead already. That's awesome. Getting a lot of pieces for Nick, though. Not as much as last time. He's going to be like, \"Why were you hyping up this care package? It's only like a couple of these little pieces.\"\n I can promise you he's already forgot about that. He has no idea that you got him a care package when he walks in here. He He appreciates the love and the support yesterday. Now I bet she walks in here. He's so frazzled from the meeting. No idea. No idea.\n And I loved uh while Bless is talking rematch, Nick checked his phone about 17 times.\n Oh yeah. Nick Nick doesn't like being on podcast where he doesn't have anything.",
            "start": 4780.8
        },
        {
            "text": "And I loved uh while Bless is talking rematch, Nick checked his phone about 17 times.\n Oh yeah. Nick Nick doesn't like being on podcast where he doesn't have anything.\n It's insane. That that probably should have been a meeting of like why don't we just come in when he's done talking Nick is not going to be listening to this. Just so you're aware. He's not going to care. I saw like the Starbucks menu. I saw\n you got to look up the Starbucks menu, man. Laptop. I saw I think Amazon a couple times and then I saw an image of an eagle soaring at Google Maps. Google images.\n Yeah, dude. [ __ ] yeah. He's just always He's ready to buy, ready to purchase. He has the most like undiagnosed adult ADHD. I mean, we see it every single day whenever we play this game with him. We are watching it live.",
            "start": 4832.24
        },
        {
            "text": "No. Yeah. But like it's it's when other people are talking that I see the eyes wander and look elsewhere. Check the phone. Put it down. Look over to the left. Check the phone. Put it down. Whoa. Let's go.\n Let's get you set up. You know,\n jamming. All right. This is for that, this, and that. Boom. This is going to be all right. I'm going to ride back. Riding dirty. A portion of the rematch review. Nick was just looking at the lights. Creed. You didn't see it, but when the when the shot was on Tim and\n I saw Tim look at you shoot you the look. I was in the middle\n when the shot was on Tim and Bless. Uh Nick does this. He had to get a photo, bro. We had to let him know.\n He's taking a picture of the lights up there. God, he's got to get in here. Where the [ __ ] is he? Not happy about this. Here he comes.\n Here he is. Finally.\n Sing the song. He loves pizza right now. You couldn't have eaten during your call.\n It's rude to eat during a call.",
            "start": 4889.04
        },
        {
            "text": "Here he is. Finally.\n Sing the song. He loves pizza right now. You couldn't have eaten during your call.\n It's rude to eat during a call.\n It's rude to eat during a call. The shy hallude wakes.\n God eats. Finally. Get off of that call.\n Why is my dude [ __ ] naked again?\n Oh no. God damn it. Am I dead?\n No. Remember I was naked that one time I told you I was scared and I ended up not being naked. Oh no. [ __ ] [ __ ] this shy halude. Move to a different dune.\n Yeah, for real, man.\n Hollude. A curse to the Hude family. What you guys doing?\n Um,\n waiting on you actually.\n I'll tell you what. You know, we're having fun, Nick. Okay.\n Excited for you to build back. You know,\n I'm excited to see this gift you gave me. I hope it's a Porsche.\n Oh [ __ ]\n Oh [ __ ] Did you take it already? Did you take the gift back? What happened?\n The desert took it back. The desert.\n What desert? I was here. I I [ __ ] up.",
            "start": 4960.08
        },
        {
            "text": "Oh [ __ ]\n Oh [ __ ] Did you take it already? Did you take the gift back? What happened?\n The desert took it back. The desert.\n What desert? I was here. I I [ __ ] up.\n What? I Here's the thing. I didn't think you would find it. So, I just dropped it all in your living room.\n Let me go look. I'll look right now.\n It's I already checked. It's gone. It's not here.\n It's not there anymore. Why didn't you put it in my storage box? Because I didn't think you'd see it.\n I would have You just told me the storage box. Yeah, but I wanted you to walk in and be like, \"Oh, what what is this?\"\n Don't even tell me what it was. I don't even want to know what it was.\n It It I mean, was it sick? It was my It was the purple sword. It was my backup steel suit. Um, it was pieces for the level two bike.\n Man, that's a really great gift. And it was a lot of like plastic steel and all that [ __ ] Huh.\n Yeah. But I just got a lot of plastic steel for you right now.",
            "start": 5011.68
        },
        {
            "text": "Man, that's a really great gift. And it was a lot of like plastic steel and all that [ __ ] Huh.\n Yeah. But I just got a lot of plastic steel for you right now.\n Okay. Cuz I I was assuming you were going to be on that call a little bit longer, so I came to that little this little wreck to help out.\n Thanks, buddy. I'm not. Yeah, I'm really It was a very heartbreaking moment, Nick.\n Was it as heartbreaking as getting eaten by a worm for the second time in one day?\n Was it as heartbreaking as you driving up to your what you thought was loot and seeing five or 200 just scratching? It was It was about that. Me walking into your room being like, \"It's not here. What? Where the [ __ ] is this?\" It was\n gh It's a bummer.\n Tough. That is tough. Mike, let me into your damn house, Nick. I don't that house, dude. That's going. Did you abandon it? Just abandoned it. I'm about to abandon it. We'll do it now.\n Abandon it. I'm walking over there right now.",
            "start": 5064.32
        },
        {
            "text": "Abandon it. I'm walking over there right now.\n No, you can do it remotely. No, I'm going I'm You have to come see my new house now.\n I'm not going to your new house.\n No, he didn't build it far away. His new house is like in the same neighborhood, but\n I'm close.\n Uh they built a new culde-sac out there.\n Oh, yeah. By by where the Wendy's is newac [Music] Yeah, schools are good. It has a walking rating of 8 out of 10.\n Oh, that's really on on Zillow. Yeah.\n Welcome back home. Welcome back, Nick. We miss you, though. Hey guys, thanks for waiting for me. My call went well. I'm very excited. Glad it was a call with In-N-Out. That would be nuts\n to get me In and Out. I'm kidding. No,\n that'd be amazing. Thought you were getting like a sponsorship.\n No, [ __ ] no. That'd be sick. Mike would die.\n I would eat it so much. I'm already eating it daily.\n Like, not die of excitement, die of cholesterol.\n No, I mean, his heart would just stop and he would go,",
            "start": 5114.96
        },
        {
            "text": "I would eat it so much. I'm already eating it daily.\n Like, not die of excitement, die of cholesterol.\n No, I mean, his heart would just stop and he would go,\n \"Yeah. That's how I felt last time laughing at you last night dying. I thought I was going to die.\n Chad, I don't know if you were watching so I was laughing so hard at her.\n Mike said, and I quote, \"I'm laughing so hard I'm going to be sick again.\" Again, is what he said. Oh my god, I want to [ __ ] I told Andy, don't make me laugh.\n I want to die. All right, so I got to go. I still have this [ __ ] in my Luckily uh the mission stuff from uh from that last mission we did is still in my inventory.\n Okay,\n so I need to go take that to the anvil. So, let me do that real quick. But Mike, let me in your damn house.\n I need to go to the anvil as well.\n Give me permission.\n What we really need to do uh Well, I just did I did the fourth main mission. It's right next to us.\n Oh, you did the fourth trial.",
            "start": 5156.08
        },
        {
            "text": "I need to go to the anvil as well.\n Give me permission.\n What we really need to do uh Well, I just did I did the fourth main mission. It's right next to us.\n Oh, you did the fourth trial.\n Help me out. It's right next to us.\n Where's that?\n Oh, that's a good one. It's on our island. Okay.\n And you unlock your third skill. It rocks. It's legitimately like you have to climb here. You have to climb this big ass thing. Not the very top, just like kind of midway into that big ass thing.\n Yeah. Do that now.\n I'm dropping some stuff for you right now. Yeah, let's get him on that. That's a good idea. I'm going to rip to the anvil real quick just to uh Oh, that's Andy's car. Are you in my house?\n Yeah, I'm dropping some [ __ ] for you. I feel so bad, dude. I'm so pissed off cuz I played for like an hour and a half extra doing all this [ __ ] to have a cool surprise and it just did not pay off. This is just the game, man.\n Desert takes.\n Desert receives",
            "start": 5203.52
        },
        {
            "text": "Desert takes.\n Desert receives\n gives and takes. I'll give you my sandbag booster.\n Oh, thank you.\n It's I mean it it's not perfect, but\n it doesn't matter. The last one blew up on me. I was getting eaten by a [ __ ] worm. Oh, I need some of those. You have those micros. Can I have all those?\n Yeah. Yeah.\n Thank you.\n Thank you.\n That's all I need and I'll be able to make myself a dope suit. Thank you.\n Damn. Bless is playing rematch right now. Bless really [ __ ] us yesterday. You know,\n he's truthfully not.\n We can all talk about it.\n Yeah. It was like, \"You want to come play with us today?\" He said, \"No.\"\n No. Said no.\n Go a POS.\n We're not coming back to Dune ever again. Really? [ __ ] this. Are you with Do you have the Kiraab still suit, Andy?\n That's the one that I dropped for you.\n Oh, no. Yeah, the middle one.\n This one right here.\n Yeah, cuz I the one I'm wearing right now.\n Not the scavenger soul suit. Right.",
            "start": 5256.56
        },
        {
            "text": "That's the one that I dropped for you.\n Oh, no. Yeah, the middle one.\n This one right here.\n Yeah, cuz I the one I'm wearing right now.\n Not the scavenger soul suit. Right.\n Right. I have I have a I'm wearing the purple one that's like up here, maybe. No, it's not here. Uh, you may not have found the blueprint, but I have a purple one that's like up here.\n I don't have it up. And then I have\n I have the boots. And then I have the the the slaver parts for the other rest of them.\n Do you have to have the full set or will any still suit work? Because I have these cool boots, but I don't.\n It has to be a still suit thing. It doesn't have to be the full set. It just has\n So, will these holar still suit boots work if I craft them? Yeah. All right. You I mean, one thing you do have, you should have a decent amount of iron. I did drop a decent amount of iron last night and like was just letting it just cook in the in the\n cook overnight. Yeah. Oh, I have a medium blood bag if you want one.",
            "start": 5303.84
        },
        {
            "text": "cook overnight. Yeah. Oh, I have a medium blood bag if you want one.\n Oh, yeah, please. Those are way those are really nice. Here, I'll drop it in this thing. Do you have a um level two cutter by any chance?\n Um\n if not, I might be able to make one now. Uh dude, that that was also in the care package.\n Damn. Tough\n [ __ ]\n Tough one. That was legitimately in the care package. I have a uh level three welding torch, but it's one that I just found.\n I'll take that. I'll take that if you have it.\n It's kind of like half broken.\n It's okay. I can fix it.\n What' you do, Mike? It's gone.\n Oh, your old house is gone. Tell him to say goodbye.\n Bye. Goodbye. No more. Now, Nick, you have a lot of space.\n Oh, thanks, Mike.\n Take a look at that. You got space now, big dog.\n Yeah, I'm going to definitely use it, too. But you're not next to him anymore, which really\n I'm okay with it, honestly. Mike and I had our time.\n I was blocking his way anyways. I was holding him back. Now he can go.",
            "start": 5375.76
        },
        {
            "text": "I'm okay with it, honestly. Mike and I had our time.\n I was blocking his way anyways. I was holding him back. Now he can go.\n It was such a It was such a thin area to drive through.\n So thin. So thin.\n It's funny cuz like the goal was just to drive through my garage, but then it got so tight in my building. I just had to keep packing stuff in. It's like, \"All right, well, nobody's driving through any of this.\"\n You had to build a a San Francisco building.\n I didn't know it was going to be.\n You need to build an SF house that's like just narrow and deep. And instead you just went full wide anyway. But\n now I know.\n Oh man, I need a new power pack, too. Chad, do you know uh can someone come and grief and destroy things you build? Uh June, no. Uh if you pick a PVE server, no. Nobody can just come ruin your [ __ ] Um\n they can if you give them access to it.",
            "start": 5437.04
        },
        {
            "text": "they can if you give them access to it.\n Yeah, but that would have to be a you giving access to a stranger. But no, you could just build stuff. Yeah, only in the deep desert that can happen. Um, you got a badass costume on right now, Andy.\n [ __ ] yeah, I do. All right. I dropped you I think I dropped you a lot of stuff. Thanks, dude.\n Oh, here I have a Oh, where's that?\n I have a schematic of of I can drop you that purple schematic. Oh, what's it for? Uh, pistol.\n Oh, a pistol. That's awesome. Yeah, I'll take that. Thank you.\n Thank you.\n Thank you. You have a lot of [ __ ] you can break down. Also,\n I don't know how to do it. The recycler.\n But what do you do? What does it make?\n Uh, it makes like backup pieces of little capacitor server the hell.\n What do I need to break down? Just like anything that you can anything you can that you're not using mechanical parts like those old armor those green armor pieces. No, I got to keep the armor pieces.\n The green ones.",
            "start": 5481.84
        },
        {
            "text": "The green ones.\n Anything that's I can put on my body. I'm just keeping\n in case you die\n just in case. Fair enough.\n Are we running with cash in pocket or with cash behind?\n Cash stays in uh cash stays in the bin cuz that [ __ ] doesn't stay with you.\n Okay. Uh, I I'm running with cash in pocket because like it looks like 50 G's is the max you can carry, but then like it makes a new pocket so it's fine. But like yeah, how much cash in pocket are we carrying, boys?",
            "start": 5554.72
        },
        {
            "text": "Also, one thing that happened recently, this area, this little rock that I would always drive by was always iron and now it's just normal rock. So that shit's kind of changing as well. like they're kind of like alternating and randomizing little things that uh kind of grow around the world. Um Oh, this is dope. The Corololis storm changes node spots. Oh, weekly reset changes the resource nodes. That's kind of cool. So you things don't like stagnate and you don't get too dependent on things that are popping up near your house. Andy lost 50k cash to a worm. Yeah, it sucked, dude. Cuz then when I drove like I was like, man, where did my cash go? And then I drove by the worm's house and he [ __ ] had a new pool outside.",
            "start": 5585.84
        },
        {
            "text": "He had a Porsche. You're like, what man? Is that a lease? That better be a [ __ ] lease. Yeah, I see you out there, Shy Halude. Say hi to your mother for me. Whiskey Samurai Prime Gaming for 31 months. And Savvy Boy, 13 months of Prime Gaming. Just having a rough week. Glad you guys are always here. Sab boy, thanks for being here. Thanks, Aber boy. Hope things turn around for you. How'd you say it like that?\n I don't know. How' I say it?\n Hope things turn around for you.\n Oh, I think I just enunciated a little walking.\n Been talking a lot today.\n I get it. Okay. Hope things turn around for you. By the time the Nick got back, I was done with the base. So, I'm ready to rock.\n How do I I need to make a level two cutter real quick. Uh I don't really need one. I guess I don't really need one.\n Um let me see if I can make one for you.\n Or a level three if you have one. No, level three. I cannot do that. I've only been able to find",
            "start": 5647.2
        },
        {
            "text": "Um let me see if I can make one for you.\n Or a level three if you have one. No, level three. I cannot do that. I've only been able to find\n Yeah, I've only found the blueprints for wine. Cuz that's the only way you can cut carbon, right? Um\n I think level three is cut carbon. Could be wrong. I'm going to go to anvil. Yeah. Wish me luck. Sh. Hello.\n No, Le level two is carbon.\n Is it?\n Yeah. Yeah. Huh?\n Yeah. Yeah. Um,\n oh, then I can probably just do that.\n Yeah, you could definitely cut carbon level.\n I thought I'd try, but maybe I only have one, but I'm pretty Yeah, double verify that before I waste energy on this.\n Uh, yeah, you can cut carbon and athite.\n Uh, I want Olaf's cutter. That thing is sick.\n What do you need to make the cutter, too?\n Uh, EMF generators.\n Oh, see, you could probably break down some [ __ ] that you have.\n How the [ __ ] do I do it, though?\n Um,\n do I need to take it out of my [ __ ] or do I go just over to the recycler and just do that [ __ ] Um,",
            "start": 5699.52
        },
        {
            "text": "How the [ __ ] do I do it, though?\n Um,\n do I need to take it out of my [ __ ] or do I go just over to the recycler and just do that [ __ ] Um,\n all right. Yeah, cuz all I have, all it tells is the recyclable items that I have are these. So, I have they have to be in my inventory.\n Uh, it has to be in your inventory. Yeah.\n Okay.\n Oh, you can do storage, too. There. I didn't see that.\n Where did you see that? But I don't have anything in storage. So, it's like this is what I keep.\n Um,\n I tried this before and I'm like, I don't understand how this works. Let me try to Let me just try to grab these cuz I feel like these space parts and these gun parts should be recyclable, right? But I don't want to get a [ __ ] ton of cra scrap metal that I don't need.\n Oh yeah, look at that.\n Yeah.\n See what happens.\n It just gives meal. What's the difference?\n Like if you hover over click on that and then em like\n but these are just metal. This just gives me metal.",
            "start": 5754.56
        },
        {
            "text": "Yeah.\n See what happens.\n It just gives meal. What's the difference?\n Like if you hover over click on that and then em like\n but these are just metal. This just gives me metal.\n Yeah. Yeah. Yeah. But there's a lot of times that I'll find a cool weapon out in the wild that I know I'm not going to use and I'll break that [ __ ] down. Let's see. Can I make Yeah, I didn't really need to do that. But uh I'll I'm making a cut rate too for you.\n Thanks.\n You can come to my base if you want it. Thank you. Why is that just",
            "start": 5793.36
        },
        {
            "text": "Thanks.\n You can come to my base if you want it. Thank you. Why is that just\n Coop says, \"How do I get upgraded building pieces with lights?\" uh you put down lights. So, the thing is when you're building, it's not it's it's easy to miss, but when you hit the R button with the building tool out, the construction tool, you have different sets of things you can make. So, like there's, you know, all these like decorative things. Oh, I have I have carpet. Put down a little piece of carpet. Oh, that's a big ass carpet. Holy [ __ ] I just feel like the recyclable thing is dumb. It's not. It gets me so many of those little like\n I know, but it's all these gun parts and blade parts is just getting it's just giving me scrap metal. Yeah, but you have a lot of [ __ ] in your storage that you can\n I don't need. Yeah. Like a lot of like unused or old armor pieces that you can break down\n and it'll just give me those.\n Whenever I find [ __ ] that I know I'm not going to use.",
            "start": 5830.8
        },
        {
            "text": "I don't need. Yeah. Like a lot of like unused or old armor pieces that you can break down\n and it'll just give me those.\n Whenever I find [ __ ] that I know I'm not going to use.\n Yeah. I end up uh breaking that down and I'll get those little like micro sandwich whatever the hell.\n Okay.\n I'll put a little plant down. Look at this beautiful.\n Where's your uh Where is your house, Andy? I don't even know where you live.\n Um I'm uh\n cuz you moved, right? Yeah. Uh open up the map. I'm uh next to\n next to I'm like right here.\n Okay. Don't know what to say. Don't know what to say. Send Mike an angel. Send Mike an angel right now. [Music] Oh man. Did I get it? Yes, I did. Where are you getting the cobalt paste from?\n I think refinery. There it is. Parasite crystal. That's why I just got to refine it. Oh, boo. Oh, uh, Nick needs to join our party. I don't even think I've joined your party.\n Yeah, I think you did.",
            "start": 5880.48
        },
        {
            "text": "I think refinery. There it is. Parasite crystal. That's why I just got to refine it. Oh, boo. Oh, uh, Nick needs to join our party. I don't even think I've joined your party.\n Yeah, I think you did.\n Oh, yeah. Um, there we go. Oh, okay. There's those crystals. Yep. Yeah, we've had some adventures out here on this dune.\n Yeah, we have, man. Yeah, we [ __ ] have. Is that yours up there, Andy? Did you make that little What's yours look like? Yeah, that's me. That's you. Yeah.\n Wow. different kind of design.\n Pretty pretty sick.\n This is exciting for me. I'm going over to Annie's house for the first time.\n Get in here, dog. Whoa, look at the stairwork.\n Pretty cool, right?\n Holy [ __ ] man. I can't get in.\n Here you go. I Thank you.\n Oh. Oh, I dropped it out here.\n Oh, before the desert takes it back quick.\n Before the desert takes back. Thank you. Perfect. That is great. Perfect. All right, I'm going to Anvil. Let's drop off that [ __ ] I\n think it's right here.",
            "start": 5948.48
        },
        {
            "text": "Before the desert takes back. Thank you. Perfect. That is great. Perfect. All right, I'm going to Anvil. Let's drop off that [ __ ] I\n think it's right here.\n Oh, and then we could we could fly to Araen if you want. Oh, I've done I did that once by accident. So,\n cost me five grand. If you run all the way through Ericen, like you you see a bunch of different vendors that send that sell like uh cosmetic type stuff for the for your base.\n Okay.\n I bought a a sort of different 3D model looking thing for my buggy from the tradies.\n Oh, cool.\n Um and that's also where you find your menntat trainer.\n Uh what is that to get for you? Uh that it that lets you level up. You know how like a lot of your skills will be like level up,\n talk to your Menad trainer, you can't go past level one.\n Oh yeah. Oh,\n that's where you and they give you a mission there.",
            "start": 6012.64
        },
        {
            "text": "talk to your Menad trainer, you can't go past level one.\n Oh yeah. Oh,\n that's where you and they give you a mission there.\n Oh, cool. Okay. I was wondering how you do that cuz I'm like I'm just level one on everything. Yeah. Sector weather alert. A large sandtorm is approaching. I'm not going to\n Andy is where you pay taxes. This certain area isn't easy to find, but yeah. Okay. Good to know. Good to know. I'm [ __ ] back.\n He's [ __ ] back.\n I had to build a bike.\n Why?\n What happened? I never had a bike. Remember? I lost my bike to the quicksand and then Nick gave me his cuz he's so generous and kind and loving.\n Then I asked for a bag.\n And then he said, \"Give me that back.\n I need that back, big dog.\" He said, \"Give me the give me the [ __ ] that bag.\" All right. That was funny as [ __ ] man. A damn it. Where do you park your bike? Oh, that's cool. Sorry. I'm just getting\n just getting out of the sandtorm for a second.\n Big dog.\n I mean, we're all just kind of getting back. Yeah,",
            "start": 6075.12
        },
        {
            "text": "just getting out of the sandtorm for a second.\n Big dog.\n I mean, we're all just kind of getting back. Yeah,\n Andy. I like the layout of this place.\n Thanks, dog. Oh, you got the improvised blood purifier. You're so cool.\n That's upgraded one. Oh, let's see if I can make Show me your flat screen, bro. Where's your flat screen? Did you see the little art piece I put up over here?\n I want to look at it. Look at that's a great use of this corner. The vehicles fabricator.\n Oh, but also here, look, look at my buggy. This is the uh the Atrades one. The Atrades like sort of skinned down here. Oh, that's nasty. Did you buy that?\n Uh, yeah. You bought you buy the skin and it just sort of like replace it. Oh, you could also buy the Atrades color scheme so you can make your [ __ ] like dark green.\n Oh, so this Oh, that's cool. That's like polygonal like their armor.\n Yeah. Really cool looking, man. This sandstorm never hit us. Like like a like a a dad waiting for a storm to hit.",
            "start": 6182.16
        },
        {
            "text": "Oh, so this Oh, that's cool. That's like polygonal like their armor.\n Yeah. Really cool looking, man. This sandstorm never hit us. Like like a like a a dad waiting for a storm to hit.\n Where's this storm at? You know, where's this rain at? I'll be right back.\n The plants could really use it.\n Yeah. What the hell?\n Oh, wow. You have all your stuff back here. That's interesting. How do you How do you feed uh\n And also underground. I have two more of those.\n Underground?\n Yeah. Like underneath the There's a wall piece that There's no way to access it. I have to like remove the floor. But if you if you remove the floor piece.\n So, wait, how do you put power cells in them?\n Um you just put it in one.\n Oh, and it just works.\n Yeah, it works for all of them. spreads. I thought I I have like full up or both. I'm climbing on you right now and I don't like this.\n I don't know. I got to get out of this.\n Hit control. Thank you.",
            "start": 6229.92
        },
        {
            "text": "I don't know. I got to get out of this.\n Hit control. Thank you.\n Thank you. That's so cool. Look at that on the map. I see Augustine. Yeah, we gota Let's get We'll have you go do that\n mission. Just cancel the We don't need the meeting, right?\n At 3:30. Yeah, we don't need that.\n It's fine. I think it's fine. Cancel it. Okay, we got an hour.\n This company runs itself at this point. I'm not sure how half the things happen. What am I trying to do? Oh, it's there. Seven. Send me an angel. Send me an angel. right now. This is a much nicer place to live. Mike's still in here. Uh he he stepped out real quick because I think he was going to either get food or go to the restroom or something.\n Got it. Yeah. See, look like this old like this leap suspenser belt I found.\n Yeah.\n I recycle that [ __ ] It gives you particle capacitors and holds.\n Oh, I have like 30 of those.\n Yeah, there's a lot of [ __ ] that I find that I could just recycle. Oh, okay. So, that's smart. That is smart.",
            "start": 6285.84
        },
        {
            "text": "Oh, I have like 30 of those.\n Yeah, there's a lot of [ __ ] that I find that I could just recycle. Oh, okay. So, that's smart. That is smart.\n Or again, a a purple piece of something that I know I'm not going to use, I'll get spice steel from it or spice whatever the hell, you know. Right. Right. All right, purple stuff.\n You got to you got to do that next mission, dude.\n Which one is it?\n Or you should also Oh, do you have the grappling hook?\n No, there's a grappling hook.\n Get the grappling hook. That [ __ ] changed everything for me.\n Did it now?\n So, hit the uh hit the S button or or uh sorry, inventory and then go to skills.\n I didn't know it was a grapp that's a grappling hook.\n That's a grappling hook.\n It looks like a forward dash or something, right?\n Um but\n what? Go to hit the S button.",
            "start": 6377.92
        },
        {
            "text": "I didn't know it was a grapp that's a grappling hook.\n That's a grappling hook.\n It looks like a forward dash or something, right?\n Um but\n what? Go to hit the S button.\n Yeah. and set it to like I put it on my mouse button because you can aim and then when you tie when you team it up with your floating thing, you just shoot up hella far. How do you [ __ ] shoot it?\n It was set to C.\n Yeah, I know. But Oh,\n and then if you time if you time it perfectly, you just like float.\n That's so sick.\n Um, and so that's how I did that for the the fourth trial. It has to turn white. It has to be white. Yeah, look at that [ __ ] That's crazy. [Music] Killer Dragons with a $5 super chat says, \"Off work today, so I had to tune in to a June Dune and goon stream.\" Welcome in Killer Dragons. Hope you're doing great. Having a lovely day. Having a great day off.\n We're having a good time.\n I'm always having fun.\n Mike rebuilt his house. We all built back better. Um,\n Andy gave me a present.",
            "start": 6412.32
        },
        {
            "text": "We're having a good time.\n I'm always having fun.\n Mike rebuilt his house. We all built back better. Um,\n Andy gave me a present.\n Do this and lit it on fire in front of me.\n It was real tough. Uh, we need you to do this. We all need to do this these missions.\n Yeah, I got to get Well, I'm going to deliver this [ __ ] first to get out of my thing. God, it's so far. I get so scared now of the desert. I'm just so scared. Mike,\n you got Nick needs, bro. Nick's doing things. Oh [ __ ] he's coming. Are you paying attention to where you're driving?\n Yeah, I think so.\n Like quicksand?\n I just keep get I Well, there's no quicksand in this area. I don't think I just keep seeing stuff and I'm freaking out now. I'm triggered by it. chat. Do do the Coriola storms reset weather the quicksand does the quicksand then turn to jump sand every once does that [ __ ] rotate?\n I don't I think quicksand's just quicksand. I think the only thing I've seen move is the flower sand.",
            "start": 6473.36
        },
        {
            "text": "I don't I think quicksand's just quicksand. I think the only thing I've seen move is the flower sand.\n Oh, you just need com. Chat says no. Okay.\n Yeah, I think quicksand's always quicksand and it's a different It's like uh zebra striped.\n It looks like kind of wet.\n Yeah, it does look a little wet. I don't like how you said that, but But you understood it.\n Well, it's explicit.\n Yeah. Send me an angel. I like to park my sandbags by everyone else's sandbags. Those are area specific. Can we see Nick's screen? Uh, yes. Let me switch for you.\n Think you got it. Do it up. Okay, I think I'm good. Done. I got to go kill a dude. Interrogate a [ __ ] Investigate the runaway base. Sick. Where's this fourth trial? Should I go back and do that real quick or is that dumb? Uh, no. You should do it.\n Okay, that's on our base, right?\n Yeah. Andy says it's somewhere near our base.\n Yeah, it's like a\n Where is it again? Just",
            "start": 6542.4
        },
        {
            "text": "Okay, that's on our base, right?\n Yeah. Andy says it's somewhere near our base.\n Yeah, it's like a\n Where is it again? Just\n you just like you just start climbing this like if you zoom in all the way you if you just start climbing this [ __ ] Okay.\n You'll see within it like you'll see an opening and you kind of start walking inside all of it.\n All right. Here I go. Jump sand is in the middle vermilion areas. Quicksand is north of that. Yeah. Yeah. Okay. No problem, Guardian. Yeah, our uh the uh producers had to step out to get their lunch. I just need like a rich uncle or aunt to die in this game and leave me a couple ornithopters. Is that a possibility? Mike,\n you're getting close. We're almost there.\n I don't think we are. I think we're so close.\n Said we have to go real far east to\n to get them to get like the diamond spice [ __ ] or whatever. the party. Why? Why?\n Oh, I didn't accept. I'm sorry.\n Uh to get aluminum.",
            "start": 6612.16
        },
        {
            "text": "Said we have to go real far east to\n to get them to get like the diamond spice [ __ ] or whatever. the party. Why? Why?\n Oh, I didn't accept. I'm sorry.\n Uh to get aluminum.\n Uh can you do me one more? Oh, yeah. Uh yeah, we need aluminum. That's like our next roadblock. All right. Where the [ __ ] am I going here? So, I got to climb this big ass thing.\n Yeah. And use a grapple with the boost or whatever. Get out of the car and like just suck up your [ __ ]\n I'm going to Oh, I don't have that tool anymore.\n Pink crystals in the faries for cobalt paste. Yeah, I was getting some of those last night. Yeah, you're in the right area. Did you go across this little bridge to get there or am I crazy?\n Uh, look around. Uh, h get off. Oh, so no, it's on the other side of that, huh?\n Yeah, it is. Suck up the gun. Suck up your car. Suck up.\n I don't think I have it. I don't have that thing.\n Oh [ __ ]\n Oh, I do. Let me suck the car up. [ __ ] flying. I'm just going to walk.",
            "start": 6695.44
        },
        {
            "text": "Yeah, it is. Suck up the gun. Suck up your car. Suck up.\n I don't think I have it. I don't have that thing.\n Oh [ __ ]\n Oh, I do. Let me suck the car up. [ __ ] flying. I'm just going to walk.\n Are you going to do it too? You're doing it too, Mike? You told me to climb up this rock, right?\n Uh, yeah. Yeah. Yeah. Is\n there a side to it that I should be looking for? Uh, no. Like, as you're climbing up that main sort of base.\n It's the one with the hammer on it, right? Like hammer.\n You will eventually see an entrance in like there's walkways and stuff kind of built into the sides of the big wall. All right, here we go. Starting to climb. Oh, somebody is trying to farm like the uh that sand out there in the\n We got to do that.\n Shoot's not happy.\n Well, the Shyolude can and I don't want I don't want to speak out of turn here. It can go stuff it.\n I mean, I think we all agree with you by this point. We've seen what it could do. see how effective its ways are.",
            "start": 6782.08
        },
        {
            "text": "I mean, I think we all agree with you by this point. We've seen what it could do. see how effective its ways are.\n I just think like we've all been living under the thumb of the shyude for a while\n and to put it into contemporary terms, it's very much like Sylvester Stallone and Tulsa King.\n Yep.\n Where it's like they were fine in Tulsa. They didn't need the mob. Where's the chassis? How do I remove the chassis? It's insane. Just verifying before I start this climb. Andy, is this Am I in the right spot here? Mike's on it with me.\n Yeah. Yeah. Like look up. I don't know where the\n the hammerhead's like right above.\n Do your [ __ ] grapple and the float.\n Oh yeah. Hold on. You can keep on holding\n Yeah, I [ __ ] up",
            "start": 6838.32
        },
        {
            "text": "Yeah. Yeah. Like look up. I don't know where the\n the hammerhead's like right above.\n Do your [ __ ] grapple and the float.\n Oh yeah. Hold on. You can keep on holding\n Yeah, I [ __ ] up\n the space bar to jump up. Unless you have the falling slow thing and not the I don't remember. It's got to be white where whenever you hold the C button it's Yeah. The cursor has got to be white. That's cool. Traditionally grappling hooks in games at me have not agreed, but this is a pretty cool thing. I'm going to fall. I don't know why I can't attach this chassis. Do I got to be like in my home base to do it? No. You\n No, you got to find like flat land for it. Oh, where am I? Okay, Mike, where you at? D, let's climb this [ __ ] together,\n dude. I'm up now. I found it.\n You found it.\n It's on the southern side.\n Yeah, you you'll see like walkways in built into the mountain as you're going up.\n Okay, I kind of\n southern side. You'll see lights.",
            "start": 6884.88
        },
        {
            "text": "You found it.\n It's on the southern side.\n Yeah, you you'll see like walkways in built into the mountain as you're going up.\n Okay, I kind of\n southern side. You'll see lights.\n I think I'm kind of there, but if only Mike would just wait for me.\n Yeah, you were like,\n is it this entrance?\n This looks like it. This looks like something. Yeah. Okay. This is the sacred like the symbol. Maybe\n the scadina class today.\n [ __ ] man.\n What a marvel that even in her advanced years can still leth are you dude? Get away from me. I don't like you. I don't know you kid.\n My pity is\n I don't know you kid.\n Flag was of our own making. It see dude this grappling hook rocks moving. He just changed my life. Yeah, we saw we saw somebody have it last night and I was like, \"Whoa.\" And Mike was like, \"Oh, yeah, that thing's cool.\" I was like, \"Wait, what? You have one?\"\n Yeah. Mike doesn't share the right things with us.\n Say, \"Hey, I want this.\" And I said, \"This is how it is.\"",
            "start": 6965.6
        },
        {
            "text": "Yeah. Mike doesn't share the right things with us.\n Say, \"Hey, I want this.\" And I said, \"This is how it is.\"\n No, I'm not saying that. I just mean like I just just\n I need you to be like, \"Dude, have you checked out this thing?\" You know,\n I've sh I've shared it all. Chris, Chris, I go and tell him I shared it all already. I've shared it all. You shared it all. Shared it all.\n You just mean you're at your limit of of talking. That's what you need, right?\n I for the past three days, I've done the sharing. [ __ ] I just sailed.\n Dude, I cannot hover over my chassis. I'm so annoyed. Oh, hello. I will take your blood. Oh, I don't have a blood bag. I didn't take it from Andy. Shoot. You did.\n Did I?\n Yeah, you picked it up. Uh I don't think I did.\n You picked it up from the ground. Remember when I was like\n before the\n I don't have it on me. I'll just make a quick one.\n I don't really need it, but\n Well, [ __ ] I hope you dropped it somewhere safe.",
            "start": 7024.16
        },
        {
            "text": "before the\n I don't have it on me. I'll just make a quick one.\n I don't really need it, but\n Well, [ __ ] I hope you dropped it somewhere safe.\n It's probably gone if I'm being real. These guys are dead. Right to the [ __ ] [ __ ] it.\n Oh, break the bike down to add a different Okay. Okay. Dude, this homie sat down. This guy just sat down. He like meditated. It was cool. Oh, is it like in World of Warcraft where you could put like forward slash sit?\n I think so. I think he did it. I think he sat. This guy just did some crazy [ __ ] He's my best friend now. This guy's my fart and Martin or whatever the guy's name is.\n Fart in a bag. The Sadina and I made the long climb to hang a new\n Letho. You're my guy.\n Oh, it's an emote. The marvel that even in her advanced years the\n You ran into somebody on the climb.\n Yeah, dude. This is my homie. I'm getting streams sniped, but in a good way.",
            "start": 7082.48
        },
        {
            "text": "Oh, it's an emote. The marvel that even in her advanced years the\n You ran into somebody on the climb.\n Yeah, dude. This is my homie. I'm getting streams sniped, but in a good way.\n The only pity is the prayer flag was of our own making. It seems an You're both going to go up there. It's It's like you're doing a uh like you're both doing you're both on a quest together, you know?\n Yeah, dude. We're doing peyote together. Yeah,\n we're going to get nasty and have some fun memories come back and be like, we did what? What do we do? Is it legal to knock off a licorice in Nevada? I'm on the spice journey, Mike. There you go. The spice journey.\n I'm in it. I'm in it. You're in it, too? Yep. Oh, it's one of these stupid things. I don't like this.\n No, but this is a combat one. Oh, I got to kill some guys.\n It's just like a lot of parrying and stuff. and you'll see why it is.\n Okay. That cool sword. [Music] [Music] Just gave that guy the flying knee. Yeah,",
            "start": 7150.64
        },
        {
            "text": "It's just like a lot of parrying and stuff. and you'll see why it is.\n Okay. That cool sword. [Music] [Music] Just gave that guy the flying knee. Yeah,\n you're cool. I do. I really understand, lady. Oh, the Chris knife. Shut up. Do I get to keep this thing? Just you wait big time. I got to kill all these dudes. And I don't even care who's next. You have to do this for a while. Like it it took longer than I thought, but also cuz I was doing really badly.\n Uh I'm not doing great, but I'm spiced out right now, man.\n Yeah,\n I feel great. Two on one. Threeon one. Come at me. You doing it too, Mike? Yeah.\n I'm just wasting spice time. There we go. You should have a few worm teeth, Nick, since you got eaten by the shy hallude. Can make them make those knives.\n Yeah, I know. Okay. I don't have a few.\n That's awesome. I keep",
            "start": 7206.32
        },
        {
            "text": "Yeah, I know. Okay. I don't have a few.\n That's awesome. I keep\n I did have two. I think I I think I missed I just didn't understand what I was supposed to do with them, so I destroyed one of them. But should have about 13 of them by this point.\n Okay, I should have three. Can't believe Mike used the drum sand. Love that drum stand. It's my favorite part. It's one of my favorites. Can't believe Mike got you Eden and then he immediately blamed me. It makes a lot more sense why he blamed me. [ __ ] Blame. Okay. Locate the fifth trial. Got it. I'm leaving. Oh, what the fudge, dude. Oh, they're killing me. Andy cutting me up. Look, check it out. Mount over thy heart.\n They mount over my heart.\n God set a light. Thine enemies shall fall. I've awoken the presence. Give me the sp Oh man, I'm spiced out. So spicy, dude. I'm spicy.",
            "start": 7305.68
        },
        {
            "text": "They mount over my heart.\n God set a light. Thine enemies shall fall. I've awoken the presence. Give me the sp Oh man, I'm spiced out. So spicy, dude. I'm spicy.\n Now look at your move set down there. CX and C. You just got spiced. Spice to meet you. Oh my god, I'm so sick. Spice flow, boy. Let it flow, Nick. You got it. Okay, I can't. Well, these can't stay on this. So, we were being helped out by Cooper who said that's why you get to that's why you drink and eat s uh spice stuff so that you build up that meter. Oh,\n it's like your ultimate form.\n Okay. Wow. I'm cool.",
            "start": 7379.36
        },
        {
            "text": "it's like your ultimate form.\n Okay. Wow. I'm cool.\n Yeah, it's pretty cool. just double kicked people in the face. I don't love that it's X, Z, and Q. Yeah, but I mean some of that maybe. Yeah, when you're ever It's just like when you're in that form, you got to You can change that whenever you want. No big deal. This is sick. Oh, I beat it. I'm the greatest Shy Hulude there ever was. The quiz had rat. Cool. This was actually cool. Yeah, that was a cool one. Stop talking, lady. Got to be like\n Kyifa gods.\n Oh, I can't use my jump cuz I'm in hearkening terri territory. Okay, I knocked that one out. I got to go back to Anvil. Uh, and then I'll be moving around.\n What did you knock out? Did you get the fifth trial?\n Yeah. Well, no. I just did the trial with you, Nick. Oh, cool.\n Yeah, you and I, we waited for you.\n Oh, thanks, buddy. Do you think Andy's going to do one of those things where he gets a secret pizza and doesn't tell us and then sneaks away to eat it?",
            "start": 7455.36
        },
        {
            "text": "Yeah, you and I, we waited for you.\n Oh, thanks, buddy. Do you think Andy's going to do one of those things where he gets a secret pizza and doesn't tell us and then sneaks away to eat it?\n If No, I kind of [ __ ] me up yesterday.\n Oh, okay. They say it'd be cool if we ordered a secret pizza and we just stayed here all night together.\n I'm just saying [ __ ] this meeting, Mike. You know, we don't need to do it.\n Let's just go to 5:00. Let's Let's Let's just stay here. What if, you know? I mean, put it on pause. We do the meeting and we say, \"Yeah, we get it. Games cast 9 hours.\n Please, let's talk about rematch for another four hours while Mike stares off into the goddamn void.\" Mike didn't move once during that entire discussion.\n Well, we were making fun of you. I was like, I you know, Mike Nick looked was looked up at the lights, looked to the left, checked his phone six times in about a 3 minute span, looked back up.\n To be fair, it was solving a lighting issue.",
            "start": 7542.72
        },
        {
            "text": "To be fair, it was solving a lighting issue.\n You're solving a lighting issue.\n And then I was looking at Reddit for the new AI for autofocus on Sony cameras. Oh, that's what that was. I was wondering with that one.\n Oh, man. He's always working. He's always doing something. I'm always doing something. Dude, don't think I'm not. What do I have to have for Z? What?\n Oh.\n Oh. To like char to\n Oh, I charge it\n to start it up. Yeah. To go into your ultimate form. But only if you're eating that spice.\n Ah, okay. So, can I stop eating the spice? Can you stop eating the spice? How do I Okay, I hit Z, but now I don't want to be eating the spice anymore. Uh, I think it's just your bar. I think it's a\n Oh, I see. Okay.\n It's a bar that needs to get replenished. Yeah. Sure. It goes away after a bit. Thanks, dude. Thanks, Letho. Oh, blood bag. You put it in there for me. Thanks, dude. This guy's like twice the friend that Andy is.\n He's giving you stuff.",
            "start": 7589.28
        },
        {
            "text": "He's giving you stuff.\n No, it's I mean, yeah, I think he's like giving me stuff.\n It's like Yeah. a guy like awkwardly like standing out at the end of that one. He's trying to take credit for the mission.\n Like you come out of it and you're like, \"Oh my god, is this guy like an NPC? Like he's the guy.\" And it's like, \"No, he's just a dude just off.\"\n Yeah. This is my guy Letho, dude. He pops he pops up with a voice.\n I think he's trying to take [ __ ] credit for something voice. He's like, \"Now you have awaken.\"\n Exactly, Andy. That's how it feels. You're not a real [ __ ] That was great.\n [ __ ] out of here, bro.\n But it sounds like this cuz it's like through the com.\n Yeah.\n It's like through his his shitty mic. All right, dude.\n Welcome to Iraqis. It's like, shut up, dude.\n You're like, what are you from? Jersey. Welcome to Iraqus. I'm Emperor Shadam Hussein. Is that from something? Remember the emperor in part two was uh Christopher Walkin and I was like that was great casting.",
            "start": 7656.64
        },
        {
            "text": "Oh he\n Paul at trades m he's the mad keep the shield wald up running. I don't know\n I'm going to die. How the [ __ ] do I get off this thing? Like did you just jump it?\n Yeah I just jumped cuz I had the hover. Also you you can what? You're going to take one knee and then selfres. So it's no big deal. It gives me the itchies when I do that though. I love that feeling of you dropping. You're like, \"Oh my god.\" Yep. Kevin Tetris.\n Definitely should have read that.\n He does get that in Tetris. It's crazy. Oh, I got to interrogate an officer over here. This was a huge mistake. I'm heading out to Anvil and then I'll go to uh a Raken or whatever.\n Yeah, go find your dude.\n Why not? And then I'm going to end this by probably going north. Just so you guys know, I'm going to go to greatness awaits us\n with the slavers. Fine. I'm through with this street. You're going to do that before we get an ornith. Well,\n it's not that far. I'll give you this one right there. Yeah, but\n technical station.",
            "start": 7717.44
        },
        {
            "text": "with the slavers. Fine. I'm through with this street. You're going to do that before we get an ornith. Well,\n it's not that far. I'll give you this one right there. Yeah, but\n technical station.\n I feel like that's pushing forward into something we like. I'm too scared to know, you know. What mission are you doing right now? Well, I'm I have that as well, but it it just feels like it's\n propelling us into Well, have you done then over on the east side? Have you done deep extraction yet?\n No, I need that as well.",
            "start": 7778.8
        },
        {
            "text": "propelling us into Well, have you done then over on the east side? Have you done deep extraction yet?\n No, I need that as well.\n Okay. I mean, we should probably make sure Nick has those, too. It's what we've been doing. Or are we going to that testing station? Uh, let me look at what I got. I got uh Oh, I got a crafting thing now. What am I crafting over here? Oh, I can craft a crystal knife now. Cool. Holy [ __ ] the damage per hits 191. Dude, I really need uh I need aluminum so badly so I can get a new freaking sniper. My sniper's showing its age, you know. Not loving it anymore. Pinnacle Station is the key to build the Ornithopter. That area has resources for it. Ah, yeah. So, Mike is right up the top left. Great opportunities await.\n Great opportunities await when you guys are ready. You know what happens when you go north? It's danger.\n Damn. Scary out there. Damn, I should have kept that other worm tooth. I could have given you guys all Chris knives. Oh,",
            "start": 7804.08
        },
        {
            "text": "Damn. Scary out there. Damn, I should have kept that other worm tooth. I could have given you guys all Chris knives. Oh,\n somebody in chat said it's a one time use. if you have the tooth. But like the if the tooth's a one time use, it just feels like\n the tooth's a one time use, but all you have to do is drop your [ __ ] off and go get swallowed again.\n Oh, I thought the knife was a one time use.\n No, I think the knife's on your basic crafting menu now. So, it's right here. At least it was. It's like right up here. Oh, it might be cuz it's purple. No, it just says insufficient resources. Usually, if it says insufficient permits, it means you have to go find another map for it.\n Yeah. or another thing for it.\n Blueprint. I'm about to [ __ ] people up with this knife. All right. What are we doing, boys? What is What's Mike up to?",
            "start": 7869.36
        },
        {
            "text": "Yeah. or another thing for it.\n Blueprint. I'm about to [ __ ] people up with this knife. All right. What are we doing, boys? What is What's Mike up to?\n I'm just waiting on the call from you guys. I really Nick, it's really you cuz me and Andy are trying to help you catch up to us. So, well, I got the fifth trial and investigate the runaway base.\n Do you have that runway base?\n Anything else up there, Nick?\n Um, apologies. I still have Pinnacle Station.\n Yeah,\n check in at the Pinnacle Station, which I can do.\n And then monster slaying I'm still doing, which is put out this I got to go do those observation posts.\n We need to do monster slaying with him to catch him up to where we're at.\n I'm still not done with finding Shimo either.\n Yeah, that's the one we're\n Oh, that's the runway base. Okay.\n Yeah.\n So, what do you want to do? You want to do monster slaying?\n I would love Yeah, I would love to do a mall.\n So freaking far, though.",
            "start": 7907.44
        },
        {
            "text": "Oh, that's the runway base. Okay.\n Yeah.\n So, what do you want to do? You want to do monster slaying?\n I would love Yeah, I would love to do a mall.\n So freaking far, though.\n Where is it? It's like Oh no. Where the [ __ ] is it? It's like up here.\n It's called something else. It's I think Put out the eyes.\n I think that's it. Yeah.\n Yeah. But that's like by the danger zone where I died that one time. So I don't have any inclin I'm never doing that mission. Just going to be real with you.\n You are. No, I'm not doing it ever again.\n Never done that mission.\n So if we do paper trail, we could do we could knock out all these. I could do a test of cunning where I have to surreptistically interrogate Lenov. Do you guys have that? Have you accepted that from the um the trades guy?\n Yes.\n Okay.\n Yeah, I I've already\n You did it already?\n I've done a I'm a couple steps into that.\n Okay, I'm gonna go over there and do that one then, Mike.\n Okay.",
            "start": 7953.92
        },
        {
            "text": "Yes.\n Okay.\n Yeah, I I've already\n You did it already?\n I've done a I'm a couple steps into that.\n Okay, I'm gonna go over there and do that one then, Mike.\n Okay.\n Unless you want to do the paper trail one with me.\n I've now gone to Araken, so I'm kind of lost. Oh, do Yeah.\n Yeah, go do that. Go have fun. Go with him. Go to the anvil and do that to go to Raken.\n Yeah, cuz that's where you find the your your class like trainer or whatever.\n Oh, my menntate. Yeah, you're Oh, that's a fun idea. Okay, I'll go to the anvil and go do that. You got to go to a uh the lady, right? I need money for that.\n You need money. If you don't have any",
            "start": 7994.64
        },
        {
            "text": "Oh, my menntate. Yeah, you're Oh, that's a fun idea. Okay, I'll go to the anvil and go do that. You got to go to a uh the lady, right? I need money for that.\n You need money. If you don't have any\n I have money. Man, if the Chris Knight if really is one and done, I'm going to put that thing away. I'm not even going to use it. Where's my chat chat? Is it You could only make one Chris Knife the entire time. I thought I was going to be trapped in Araen last night when I flew over there cuz I bought a bunch of [ __ ] I was like, \"Oh my god, I don't know if I have money for the return trip.\"\n Oh no. tax collector guy.\n I don't think you I don't think they charge you for that, do they? For the return trip. Uh oh, yeah, maybe you're right.\n I think I think you could just always get back. I'm simply begging you all to have the pink crystals. Send me an angel. I left money in the bank enough to take a trip home. Ah, nice. Okay. [Music] Are you buying [ __ ] Mike?\n No, I paid my taxes off.",
            "start": 8019.68
        },
        {
            "text": "No, I paid my taxes off.\n Oh, I got to do that.\n Walk up to the guy. He pays you for every little uh subfill that you have.\n Oh my god. I just\n You got to pay for those.\n That was so scary.\n What' you do?\n I just launched this thing off of the highest plane possible. I was like, I'm pretty sure there's no fall damage. Let's put that to the test. Who started singing that? Why is that? That was me. And I'm so sorry.\n God damn it.\n Well, are the trainers up on the second story? How much you take with you? Are the trainers up in the same Unfortunately, they they like don't reveal themselves unless you go into the area.\n Uh, it was in the club and they had like a light above their head, but I'm a I'm the menat or mentate or whatever. I don't know what you are, but I assume that your person is probably out there as well.\n I think it's happening in Duncan's dojo.\n Yeah, I saw that [ __ ] too. [ __ ] Duncan, Idaho out there.\n I need to get in there. Mojo dojo house.",
            "start": 8140.96
        },
        {
            "text": "I think it's happening in Duncan's dojo.\n Yeah, I saw that [ __ ] too. [ __ ] Duncan, Idaho out there.\n I need to get in there. Mojo dojo house.\n Our mojo dojo kasa a trades vendor. This is just a giant hub dude.\n That token that trades official deems you worthy.\n I wasn't ready for this sir. Yeah, that I think that dude you just spoke to sells you. You strike me as someone name. I'd ask it. Not as such. The buggy skin or the car bike skin that I got. So yeah, if you run all the way back over where you were and you walk through all of those hallways, you should see somebody with a white light floating above them.\n Okay. And it looked really unique. And then I talked to him and it was like there was also some other like drunk lady in a bar who was like, I'm the combat train or whatever.\n I'm the combat trainer.\n Yeah, I've seen some [ __ ] And",
            "start": 8208.16
        },
        {
            "text": "I'm the combat trainer.\n Yeah, I've seen some [ __ ] And\n I was like, are you kidding me? You're all like drugged up. I think she was on that drug and she was like I don't know. She was giving me some tough love. Oh wow. Just really kind of laid it out for you. How much money do I need to get over there, Andy? Is 15k enough? Remember? Yeah, that should be good. He's not in the dojo.\n No, definitely not in the dojo. Definitely one was in the club. That's a spot that you can't get to yet. It's like a story beat that\n the club. Yeah, there's a there's a big ass club in that area. It's\n into like one of these walkways. Yeah, it's got to be here. That's a bartender. Yeah, probably. Greetings. What are these rangefinders for?\n I don't know. I think uh the snipers use them. Whoop our asses with them.\n Your trusted voice in the tumultuous sands of\n I only trade with those who have the favor of the lance by politics.\n What are they telling you?",
            "start": 8286.16
        },
        {
            "text": "Your trusted voice in the tumultuous sands of\n I only trade with those who have the favor of the lance by politics.\n What are they telling you?\n Uh, they won't trade with me unless I have a special guild permission.\n I'm not with their group.\n You looking to staff tactical or fanatical? We have the tools to suit your every murder need, my friend. Is that cuz you've done too many missions with the Hearkinin?\n No.\n Oh, okay.\n Lrad,\n um,\n you make friends with them yet?\n I'm good. I'm going to get out of here. I'd rather just do a mission than walk around. So, I'm going to go back.\n Are you coming back?\n You're right here. It's It's It's somewhere in there. Like, it's it's not far.\n Well, I'm looking for the sisterhood. Oh, cuz you're uh Yeah, like who's that? Talk to that person.\n Who Who are you?\n He's the menac guy.\n Okay. And then Okay. So, you're looking for the Benzes. Mhm.\n All right. Oh, let's just look up Ben and Jesuit trainer or whatever. Let me look it up.",
            "start": 8368.0
        },
        {
            "text": "Who Who are you?\n He's the menac guy.\n Okay. And then Okay. So, you're looking for the Benzes. Mhm.\n All right. Oh, let's just look up Ben and Jesuit trainer or whatever. Let me look it up.\n Should I head to Anvil, though? Only if you want to come out here and do this.\n Which one?\n If not, we have 20 minutes. We might as well just do a mission really quick.\n Okay. Well, then which one do you want to do? You want to do the paper trail?\n Yeah, paper trail. Let's meet up.\n I'll head over there. These are just bartenders up here. She's in the Harkco Village. Oh, yeah. Very super north. I don't even think they're over there.\n Hark Village is a different a different spot.\n Yeah. All right.\n Oh, it's a different place to fly to. Interesting. Okay, I'm leaving. Coming back. I'll meet y'all at Paper Trail. I'm heading to Paper Trail. I'm going to be island hopping for this one.\n Oh yeah,\n I am. Well, I'm definitely not\n ripping.",
            "start": 8422.32
        },
        {
            "text": "Oh yeah,\n I am. Well, I'm definitely not\n ripping.\n I'm not ripping this across the dry desert, man. I'm not raw dogging this [ __ ] anymore. Raw dogging it.\n You got to be island hopping. Yeah,\n dude. I've been burned one too many times by the devil.\n Send it right across, dude. Don't be afraid. Just send it.\n [ __ ] you, Mike, cuz you're going to be on the other side sending it again, thumping around.\n Holding the word.\n We'll make you a new one. Don't worry about it. Such a piece of [ __ ] No, I got a Chris knife now. I'm not dying ever again. Help me. Help me. Let me just keep driving when I bring up the map. I hate that it stops me. Or bring up a little mini map or something on the side. I'm right next to it. Yeah, give me something. Hey, I just lose all my driving momentum. Sending it. Did you just bother EOS to Santo? Is that what you did? No, I'm just driving as fast as possible. Just letting it know that's like the Oh, [ __ ] He's right there. I heard him on my left.",
            "start": 8496.56
        },
        {
            "text": "Oh, yeah.\n Mhm. I just called him.\n Yeah. Thanks, Mike. I mean, I'm first to go. Of course, he's going to call him. It's how it goes. I just can't be playing this game while Mike's in the game anymore. It's triggering to me. I don't like that Mike's an agent of chaos out there calling.\n I'm not I mean you you're calling him regardless if you drive. You were specifically doing donuts in the drum sand.\n Okay. Well, that was last night. Now it's tonight. You know what I mean? Now it's Now it's different. My goal is to get your ass eating today. Now, now it's different. Now it's different. I'm almost there. I'm uh making my way over there. I'm making my way. Oh, this is a mover. What's a mover?\n This one's going to have us moving to\n from place to place.\n Yeah, place to place.\n Do we have time for that today or should I just go back to my [ __ ]\n We got 15 minutes. Time to drive there and back.",
            "start": 8617.2
        },
        {
            "text": "from place to place.\n Yeah, place to place.\n Do we have time for that today or should I just go back to my [ __ ]\n We got 15 minutes. Time to drive there and back.\n Well, you know, I mean, I can't read the map that way on how long this will take, but uh it's going to be uh probably not.\n Okay, I'm going to say then I might call it then. I don't want to be rushed to get back. I don't want the shy coming at me again. All right, fine. I'll go back.\n What do you think? Unless we pause, do the meeting, and come back. But no, it's fine.\n I'm here. Let's just\n All right, [ __ ] it.\n Just take out like do the first part of it or whatever.\n Well, I did.\n I'm not even close to you. Yeah, you literally just walk up to a piece of paper and then it says, \"All right, go to the next area.\" Oh, okay.",
            "start": 8689.28
        },
        {
            "text": "Well, I did.\n I'm not even close to you. Yeah, you literally just walk up to a piece of paper and then it says, \"All right, go to the next area.\" Oh, okay.\n So, yeah. I mean, yeah, you'll see it when you get to it. Oh god, those stupid anti-gra grenades. I ate them. That's got base. Yeah, right. Get paired right here. Oh, [ __ ] you. All right. Piece of paper. Oh, yeah. The ledgerless ma candidate. Simo sorting code. Aldac something. Holy [ __ ] Where the [ __ ] am I? I am not where you guys are. What the [ __ ] is this pace? Impossible. It's impossible.\n No, it's not. I just I thought I'd do a shortcut and I am not where you are. This is some sort of hearkening base. I'm terrified right now. It's cool, though.\n That's so sick, though.\n I'm going to send it. I'm going to send it.\n Let's see where he's at on the map. Ch.\n So far, you are all your [ __ ]\n I'm not going to lose my [ __ ] Don't worry about it.",
            "start": 8723.52
        },
        {
            "text": "That's so sick, though.\n I'm going to send it. I'm going to send it.\n Let's see where he's at on the map. Ch.\n So far, you are all your [ __ ]\n I'm not going to lose my [ __ ] Don't worry about it.\n You're not going to lose [ __ ] bro. They don't even attack you, bro. That's just where you go ask for drugs over there with those guys.\n But you're like not\n not even close to the mission though somehow.\n Oh [ __ ] I mean here's the mission way.\n I'm leaving, bro. I'm going the wrong way. I went the wrong way. I went the wrong way. I went wrong way. I got my test. The word close to the\n That's not me. That's on me.\n It's cuz you can't put a I'm out. I'm going to go back.\n Yeah. Go. Let's go back and we'll do a reset. Going home. From now on, we got to drive which is up here. I kind of want to do this though. I got to I got to sneak into that place.\n I did I was adventuring in that spot last night and I got one shot by like a sniper.",
            "start": 8812.32
        },
        {
            "text": "I did I was adventuring in that spot last night and I got one shot by like a sniper.\n Yeah, I'm not What is this? Oh, it's a rift rift watch.\n Yeah, it's the base.\n It's the big base.\n Damn, that's terrifying.\n Like they don't do anything, but like they you know they're like, \"Oh, you're a trades uh little bitch.\" You know?\n Damn. They don't call me that, do they?\n Little [ __ ]\n When you when you walk up to the big base, they will talk to you.\n They give me some [ __ ]\n Yeah. But if you try dealing with them, they're like, \"Nah, dog. You already picked a side.\"\n But they're not,\n you know, aggro or anything.\n I mean, the hearkenins get a bad name.\n Bad rap.\n Bad rap. Really drove out there. That's insane. Gone. [Laughter] I sent it. Oh, [ __ ]\n I mean, the blue icon is so different from that giant red icon.\n No, no, no. I There's a I have a blue icon there, too. to his contract out there.\n Everyone, I I got lost in the sauce.",
            "start": 8860.72
        },
        {
            "text": "I mean, the blue icon is so different from that giant red icon.\n No, no, no. I There's a I have a blue icon there, too. to his contract out there.\n Everyone, I I got lost in the sauce.\n We got a lot of icons. That's why we got to eliminate those tonight.\n We got to knock these out, Mike. We're just not putting the time in, Mike.\n I mean, that's the problem is you and Andy won't stay here till 9:00 at night with me. Like, I want, you know,\n I played till last night with you till 9:00 at night. I was so tired. I made a mistake and I lost so much [ __ ]\n We had so much I made midnight.\n Talking about\n We started at 9:00.\n Washington, the literal compass on top. What the literal compass? We don't look at that. You know, we don't look at that.\n Well, no. I just\n You go off of vibes.\n It's cuz you can't highlight the [ __ ] mission you're on. And so there's just everything there. I wish I could just select that mission and the compass would be a different color. [ __ ] died out here.",
            "start": 8903.68
        },
        {
            "text": "I'm going home. [ __ ] you guys. [ __ ] you guys. I'm going home.\n Screw you guys. Okay. Well, I'm happy to report that I uh you know what? I broke down my base. I moved. I am all set. That's great.\n I'm glad to hear it, Mike.\n The stupid cops came to get me.\n Paid off my taxes. It's a This a good solid day from for Big Mike right here. I had to put in the work.\n You put in the work.\n It wasn't pretty, but like this is the work that you got to put in.\n This is the job, guys. Yeah.\n So, if you want to exist in the desert, you got to put the time and effort into.\n This is the [ __ ] that you got to do. You got to do it. I think I gave that lady money out in [ __ ] a rack for a booster pack. She didn't give it to me. Yeah. Also bought a schematic that I already knew. So I was like, \"What are we doing here? What are we doing here?\n Give it to me.\"\n I just used it.\n You can only use them once.\n Yeah. Well,",
            "start": 8953.04
        },
        {
            "text": "Give it to me.\"\n I just used it.\n You can only use them once.\n Yeah. Well,\n so it's good to have schematics over and over again because What is this? Where's my building tool? It sounds like you were blaming me for going out there like it.\n No, no. I Dude, I had to go out there. You said go out there and I picked Guess what it was. Well, now we know your lady's out there in a different\n Yeah. Oh, yeah. Yeah. Yeah. Yeah.\n But Nick's menat is definitely out there cuz we have\n Yeah, that's not my spot is right and that's fine.\n You're in wherever place.\n What is this? I just can't stand that my house is on the wrong side of this hill. I got to move it.\n Is Nick's map inverted? [ __ ] you. Whoever said that,\n Rammer. [Laughter] [Music] You know what, Mike? [ __ ] you, Phil. It's a giant [ __ ] base.\n [ __ ] you. I mean, dude, I second I saw it, I was like, god damn it.\n God damn it. I went the wrong way again.",
            "start": 9013.84
        },
        {
            "text": "[ __ ] you. I mean, dude, I second I saw it, I was like, god damn it.\n God damn it. I went the wrong way again.\n Amazing [ __ ] bro. We have so much fun with this game. We have so much more fun coming up. Of course, today is Wednesday. We will be off for your kind of funny games afternoon stream tomorrow to prep for Friday's big marathon walk-athon stream. Don't forget that will be Twitch exclusive. Me and Roger will be playing all the way through Death Stranding 2 for as long as you want it while I walk and Roger plays. So, don't miss out on the fun. Of course, plenty more Dune, I'm sure, in our days. Maybe we'll get to Rematch. Maybe we'll check out uh Peak. There's so many games. So much fun to be had here on the afternoon streams. Thank you for watching. The Jabroni boys playing Dune as Andy and Nick slowly make their drive back home safely and soundly.\n No, I I died where we were.\n Oh well,\n I got the UFO caught me.",
            "start": 9070.72
        },
        {
            "text": "No, I I died where we were.\n Oh well,\n I got the UFO caught me.\n Oh yes. Yes. And slows you down. Then they drop out and shoot you.\n And these guys were real strong. They were\n Oh yeah. But thank you all so much for the love. We'll catch you back here on the next one. Goodbye everybody.\n Bye. Hey, hey, hey. [Music]",
            "start": 9121.52
        }
    ]
}