{
    "id": 14271,
    "video_id": "bRsJ6WKM8I8",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Tim Gettys",
        "Blessing Adeoye Jr."
    ],
    "title": "PlayStation & Xbox Bosses Speak On Next-Gen - Kinda Funny Games Daily 06.13.25",
    "description": "Go to http://kindafunny.com/XREAL to grab yours now!\n\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\nPlayStation speaks on the future of the business, Xbox speaks on the future of their hardware, and PlayStation displays confidence in Marathon.\n\n- Next Friday after Games Daily, Barrett will be premiering his new video titled “I Replayed Every Naughty Dog Game”\n   - And with that, we’re doing a whole Naughty Dog week of gameplay streams leading up to it!\nToday after, KFGD, you’ll get:\n - GAMESCAST - Mario Kart World Review\n - Then the STREAM is Dune Awakening\nIf you’re a Kinda Funny Member:\n - Today’s Gregway\n\nTime Stamps:\n00:00:00 - Start & Riftbound Card Reveals!\n00:10:01 - Housekeeping\n           -  The Roper Report   -\n00:14:33 - Sony says future platforms ‘top of mind’, exploring ‘new and enhanced’ ways to play\n00:27:09 - PlayStation Studios boss confident Marathon won't repeat the mistakes of Concord\n00:35:39 - SuperChats\n00:44:11 - SuperChats\n00:49:45 - Xbox Handheld Device \"Essentially Canceled\"\n00:55:53 - PlayStation is being ‘really thoughtful’ about picking which games to port to PC, says studios boss\n01:02:56 - Wee News! \n01:04:02 - SuperChats & You‘re Wrong\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1749838956,
    "duration": 4358,
    "transcript_chunks": [
        {
            "text": "Today's stories include PlayStation speaks on the future of the business, Xbox speaks on the future of their hardware, and PlayStation displays confidence in marathon. We have all this and more because this is kind of funny games daily. [Music] Yo, what's up? Welcome to Count of Funny Games Daily for Friday, June 13th, 2025. One of your hosts 13th, Friday the 13th. Spooky day everybody. A spooky news day for you indeed. I'm one of your hosts, Blessing Addie OA Jr. Joining me is Lroy Poppy Tim Mo yetis. I'm feeling real good today. Yesterday I had a headache all day. I was off my game. I was on the longest piece of content of my life. Superman in review. Uh incredible stuff. Greg Miller. I've never I've known him a very long time. I've made a lot of content with him talking about things that he likes, things that he hates, things that he loves. I've never seen him unlocked this way. Oh, the amount of knowledge this man has about Superman the movie 1978, it would surprise you. And I know",
            "start": 4.24
        },
        {
            "text": "he likes, things that he hates, things that he loves. I've never seen him unlocked this way. Oh, the amount of knowledge this man has about Superman the movie 1978, it would surprise you. And I know you're like, I don't No, I expect that. No. The depth to which he knows this movie, it's terrifying. How long is that podcast? It was like three and a half hours. Jesus. No. Was it? I don't It was 27 257 according to bear coordinate. God dang. The movie is 223 and that's way too long. Yeah. So, is that the one? Which is the Superman movie where he flies around the Earth and reverses time. So, this is my first time watching any of these movies. It turns out it is this one. Oh, is that one? Okay. Yeah, I've seen that one then. Oh, it's a good movie. It's a great movie. Great movie. You definitely check out the interview and strap in. Strap in, everybody. Uh, you should also strap in for some Riftbound card reviews because reveals because last week, Tim Riot hit us up. They're like, \"Yo, we",
            "start": 58.72
        },
        {
            "text": "check out the interview and strap in. Strap in, everybody. Uh, you should also strap in for some Riftbound card reviews because reveals because last week, Tim Riot hit us up. They're like, \"Yo, we got these Riftbound cards.\" Of course, that's their new League of Legends um card game that they're pushing currently. I got to go to the Riftbound Summit, the pre-release summit for Riftbound. Yeah. I've never been to a summit. Card game influencer now. Bless. I know. I it's it's so funny cuz I when I saw the trailer they did before they they were even calling it Riftbound. I saw it and I was like I I I need to know more about this. It looked like Magic the Gathering but like with some flare to it. And the thing me and Mike have been trying to figure out is how we make more card game content. And nothing exciting more than getting on the ground floor of a new one of a new one that's going to be big, right? Especially now that I've gotten my chance my hands on and gotten a chance to play it.",
            "start": 100.64
        },
        {
            "text": "nothing exciting more than getting on the ground floor of a new one of a new one that's going to be big, right? Especially now that I've gotten my chance my hands on and gotten a chance to play it. It's [ __ ] good. Like it was a really really fun time going down. And I talked about it a little bit in a previous piece of content, but I couldn't like go into detail. I'm not going to go into super detail, but like when I when they sat us all down, it was me and a bunch of media people and then also a bunch of Riot people as well in a room. They did a slideshow. They talked to us all about their plans for like release the they're doing like a staggered thing where it comes out in China first and then later on it comes out in English speaking territories. I believe they're aiming for about around like November, December time to bust bring everything out. Um, they then allowed us to like pair up with people and play matches and it's like they designed it around multiplayer. So, they want",
            "start": 142.0
        },
        {
            "text": "like November, December time to bust bring everything out. Um, they then allowed us to like pair up with people and play matches and it's like they designed it around multiplayer. So, they want people to like play with like four people essentially like magic commander kind of thing. Um, but I got to play quite a few. This is a very very very ignorant question. There's no solo magic play, right? Oh. Oh, no. Like single player? No, no, no, no. I think when they say multiplayer, they mean like four more than two essentially. Yeah. Um, but yeah, got to do that. um saw some like recognizable people from like the board game community and got to like play with them which is cool. I met um this person named Voxy who's been on Tallarian Community College. You wouldn't know about that too. I don't know about that you know all about it. Um and then they let us leave with um some trial decks. I've been very excited to play with these with my friends who are into card games to like learn and all",
            "start": 176.08
        },
        {
            "text": "know about that you know all about it. Um and then they let us leave with um some trial decks. I've been very excited to play with these with my friends who are into card games to like learn and all that stuff because I do appreciate the fact that it is it's if if you're not familiar with like TCGs, it's similar to Magic as far as like you're you're tapping mana to them play cards and you're going up against other people. But it's very unique in the sense that like it's more movement based and so you have battlefields in the middle and like you can move your cards to the battlefield. I mean, dude, they were really excited. I I got excited from how excited they were talking about this game because they're like, \"Yeah, we got different formats and like this ain't official yet, but we want to do a 5v5 format that's essentially like League of Legends where you have like two 2v2s happening and then a 1v one in the middle, which I think is a jungle thing. I don't play League of Legends.",
            "start": 218.16
        },
        {
            "text": "to do a 5v5 format that's essentially like League of Legends where you have like two 2v2s happening and then a 1v one in the middle, which I think is a jungle thing. I don't play League of Legends. Somebody get Mike out here. Mike would be able to explain this stuff better than me. But Mike, to to boil it all down, I'm super duper excited for Riftbound after playing it. And also for me as somebody who's trying to get into like 2x KO and also like somebody I liked Arcane as well and now I'm finding more avenues into League of Legends which without actually having to play League of Legends which is great for me. Um so yeah, I'm very excited about Riftbound and yeah, they gave us the opportunity to reveal uh two cards. And this ain't a sponsorship. This is just a this is a thing they do with creators in the TC TCG space. They're like big Mike coming in. Big Mike coming in. They're like, \"Hey, we got cards to reveal. Do you want to reveal some?\" And like for me, I'm like, \"Oh, that's",
            "start": 257.84
        },
        {
            "text": "with creators in the TC TCG space. They're like big Mike coming in. Big Mike coming in. They're like, \"Hey, we got cards to reveal. Do you want to reveal some?\" And like for me, I'm like, \"Oh, that's exciting.\" Yeah, Greg, let's do it. And so I want you here because we're about to reveal two new Riftbound cards and you're the League of Legends guy. What an honor. What What an awesome honor you get to be blessed. This is sick. Yeah. Barrett, if you can bring them up. So this first one, Mike, can you tell us about Sona? Oh, Sona. Uh, actually, this is my support character. Uh, it's funny enough, you showed me uh in or you showed me some of the heroes and there's Leona and then there's Sona. Uh, I rock Sona a lot. I think it's a great intro beginner character to bot lane if you want to be a support character. Sona is known for her heals, her abilities to buff up the team whenever needed and then also a big-time stun ability on the opposite team. And so that's what I would be looking for",
            "start": 297.68
        },
        {
            "text": "support character. Sona is known for her heals, her abilities to buff up the team whenever needed and then also a big-time stun ability on the opposite team. And so that's what I would be looking for out of the four things that she does her abilities what she would have on her card. So what does this card do bless? I mean this is a a champion unit. Let's see. While I'm at the battlefield ready for friendly runes at the ready at the end of your turn. So essentially like you're untapping mana to put it into like our our terms, right? Once you get into a battlefield, like I mentioned earlier, it's like more location based. So you put your cards on the battlefield to face off against the other players cards. And if you're dominating the battlefield, that's how you score points in the game. And so that's pretty cool. Um, now Barrett, if you can bring us the next card, Shen. Are you familiar with Shen? Oh, yeah. Yeah, yeah, yeah, yeah. The assassin is right. There's a there's a couple",
            "start": 338.8
        },
        {
            "text": "And so that's pretty cool. Um, now Barrett, if you can bring us the next card, Shen. Are you familiar with Shen? Oh, yeah. Yeah, yeah, yeah, yeah. The assassin is right. There's a there's a couple characters very similar to Sen who could uh really mess up your day inside of the mobile battle space. So yeah, and that's a fun character. It's really cool, Bless, when you showed me these cards and you named off some of the heroes that we went through or the champions in League of Legends style. Uh it made me smile because there's a lot of old school ones. Remember, there's 150 plus. So, you know, Tim, we're pretty deep into the lore of League of Legends and the whole world of Rune Terra. Uh and so, yeah, it is awesome to see a lot of older collections get mentioned in here because that's where I'm at of like that 2013 to 18 era is my heavy League of Legends world. So, a lot of these characters made me smile. But what does this card do bless that I should know about? Let's see. Reaction.",
            "start": 373.68
        },
        {
            "text": "I'm at of like that 2013 to 18 era is my heavy League of Legends world. So, a lot of these characters made me smile. But what does this card do bless that I should know about? Let's see. Reaction. Play anytime. Oh, so this is Well, reaction, I believe, is kind of like an instant kind of thing. Play anytime, but even before spells, yada yada yada. Uh, shield two while I'm at while I'm a defender. Tank, I must be assigned combat damage first. This is one of those ones where I'll need the rule book. I need the rule book to break it down for me. I need an expert. But there you go. You have two new riftbound cards revealed for you right there. Thank you so much, Riot, for the opportunity to do that. Oh, yeah. All right. You got any questions? No. I have so many questions, B. We'll talk about this at another day. I want to know about this battlefield that you bring up, how that's laid out, how it looks. I want to bust open all these cards with you. Go through all of the We'll make some time",
            "start": 414.16
        },
        {
            "text": "at another day. I want to know about this battlefield that you bring up, how that's laid out, how it looks. I want to bust open all these cards with you. Go through all of the We'll make some time on a stream or something and we'll play. Yeah, let's do that. Uh Tim, yes. Before we get into the show proper, you have a link here. I do. Just a little something dropped this morning that I just needed to remind people about cuz it's been too long since I've thought about this little guy and I need everybody to remember. He's still coming. The threat is looming. 266 days away until Pixar's Hoppers is in theaters. Uh we will be doing a group outing. It'll be mandatory for our entire company to go watch this movie overnight. Um we have I need to I need to watch more of our content cuz I have no idea what's happening. What is hoppers? You don't know about hoppers? Look at them. They're humans that turn into beavers. They're humans. Well, we're we assume one of them is a human and I think",
            "start": 450.24
        },
        {
            "text": "no idea what's happening. What is hoppers? You don't know about hoppers? Look at them. They're humans that turn into beavers. They're humans. Well, we're we assume one of them is a human and I think that's an actual beaver. The one with the crown. It's a little confusing, I know, but we'll don't worry, we'll find out. Last year, uh Tim live reacted to all of the news dropping out of uh Comic-Con, specifically the Marvel stuff. And I believe Joey and I joined him and we were just finding all these links, images, all this stuff. Uh you know, that was the reveal of RDJ coming back as Dr. Doom and all this [ __ ] But then also we were getting reveals of like Pixar stuff and the first image of this uh movie bless Tim was just like like obsessed and smitten by. Uh so yeah he just he loves this beaver. I love the beaver dude. I don't know what to tell you. Man's a big beaver fan. I'm way more interested in the second picture in this tweet because this is directly from at Pixar where they're",
            "start": 492.0
        },
        {
            "text": "beaver. I love the beaver dude. I don't know what to tell you. Man's a big beaver fan. I'm way more interested in the second picture in this tweet because this is directly from at Pixar where they're saying check out these all new looks at Hoppers and Toy Story 5. This Toy Story 5 this isn't like as direct image for the movie, right? No, this is a concept art. Okay. I was about to say this art style we got. Yeah. No, no, no. All right, cool. I mean, I'm excited for Toy Story 5. Hold on real quick, Barrett. I do want to show the image that uh they decided to show in Hall H multiple times. Uh I'm going to slack this to assets right now. Can't believe we're taking a hoppers break right now. It's important, dude. Everybody needs to know about this, okay? because uh we are again 266 days away from this. Everybody needs to prepare. They just kept showing this and in action. He's just running towards the camera. I think it's a she actually. Anyway, we'll learn together. Don't worry about",
            "start": 537.92
        },
        {
            "text": "from this. Everybody needs to prepare. They just kept showing this and in action. He's just running towards the camera. I think it's a she actually. Anyway, we'll learn together. Don't worry about this. It's not too late. We have some time. All right. Well, what's up with the news? That was an eventful start to KFG this morning. But let's get into it. Remember, uh this is kind of funny games daily. Each and every weekday, we run you through the nerdy news you need to know about live on YouTube, Twitch, and on podcast services around the globe. If you love what we do, support us with the kind of funny membership on Patreon, YouTube, and now on Spotify and Apple Podcasts to get all of our shows ad free. Watch us to watch us record them live and get a daily exclusive show. For a chance to be a part of the show, some of your thoughts and opinions as YouTube super chats as we go. Housekeeping for you. One of the projects we announced at the beginning of the year to celebrate 10 years of",
            "start": 582.56
        },
        {
            "text": "be a part of the show, some of your thoughts and opinions as YouTube super chats as we go. Housekeeping for you. One of the projects we announced at the beginning of the year to celebrate 10 years of kind of funny was another big video essay from Barrett, and he's finally ready to reveal when y'all can watch it. Barrett, roll the clip. Apologies to audio listeners. Video focus. He is at a crossroads to stay a punk. These movies about losing limbs and space embaros. Right now we're watching a TV. What's up everybody? Welcome to The Legend of Zelda in review. This is playing all Barrett's old video start with the be list. This is review model. and see where the lightning goes next. With Ragnarok coming soon, representing the end of the Norse era, Star Wars Jedi Fall in Order kicked so much ass to bump Breath of the Wild down to number four. I knew I was being brought back into a genre that helped me get into video games in the first place. This is This is hype. It's hype. It's hype.",
            "start": 619.04
        },
        {
            "text": "ass to bump Breath of the Wild down to number four. I knew I was being brought back into a genre that helped me get into video games in the first place. This is This is hype. It's hype. It's hype. It's red. It's going to be Nintendo in review, guys. Every Nintendo ever. All right, let's do this. Naughty Dog in review. Let's go, baby. It's 11:00 a.m. Friday, June 20th, right here on youtube.com/kind of funny games. That's right. Next Friday after Games Daily, Barrett will be premiering his new video titled I Replayed Every Naughty Dog Game. And with that, we're doing a whole Naughty Dog week of gameplay streams leading up to it. On Monday, Barrett and Tim will play some Crash Bandicoot games. On Tuesday, Barrett will guide me through my first time ever playing Jack and Daxter. On Wednesday, Barrett and Greg will play Uncharted 2 and talk about Greg's history with the series. Thursday, Barrett is playing Hookie to catch a Cleveland Guardians game. So, Mike and Nick will be playing Last",
            "start": 668.0
        },
        {
            "text": "Barrett and Greg will play Uncharted 2 and talk about Greg's history with the series. Thursday, Barrett is playing Hookie to catch a Cleveland Guardians game. So, Mike and Nick will be playing Last Part Two on its fifth anniversary, which all leads to Friday with the YouTube exclusive premiere taking the place of your regularly scheduled Games Cast. Barrett, how hyped are you for that? Uh, I'm I'm very excited. I've been working on this a lot for the last 6 months. Um, yeah, uh, you know, we announced this, uh, Naughty Dog video at the beginning of the year, and I'm excited to finally have it come out. Uh, it's not an in review. I just wanted that expectation for for the audience there. I won't be ranking these games. This is going to be a bit more about the the journey of replaying, uh, and going back throughout Naughty Dog's history. Um, and for those wondering about the like kind of vibes and aesthetics here. Yeah. Uh, Tim mentioned my old series, the Belist, which I started making",
            "start": 739.92
        },
        {
            "text": "going back throughout Naughty Dog's history. Um, and for those wondering about the like kind of vibes and aesthetics here. Yeah. Uh, Tim mentioned my old series, the Belist, which I started making video essays before I even started at IGN. And with this being the 10 year of kind of funny and you know, one of the things we're doing was me doing another video essay. I got nostalgic for where I started. So yeah, this TV that I use here and the uh intro music that you heard were uh things that I used for my original video essay series back in the day. So, um, yeah, just got a little nostalgic and a little, uh, fun tidbit for y'all there. And I'm very excited. It's going to be a kind of different vibe and I'm excited for y'all to check it out. Very excited. He's been working really hard in this. And the little things I've seen, I'm like, \"Oh yeah, this Oh, yeah. boy's cooking. He's cooking for real.\" Remember, we're an 11 person business all about live talk shows. Today, after KFD, you're",
            "start": 784.48
        },
        {
            "text": "And the little things I've seen, I'm like, \"Oh yeah, this Oh, yeah. boy's cooking. He's cooking for real.\" Remember, we're an 11 person business all about live talk shows. Today, after KFD, you're going to get Games Cast, which is our Mario Kart World review. Then the stream is going to be some of that Dune Awakening. If you're a kind of funny member, today's Greg Way is a guest spot from the one, the only Rebecca Valentine telling you about the best places in Kansas City. Why? Because one of you asked. That's hilarious. Yeah, I love that. Uh, thank you to our Patreon producers, Carl Jacobs, Omega Buster, and Delaney Twining. Today, brought to you by Exreal and Factor, but we'll tell you about that later. For now, let's begin with what is and forever will be the Roper Report. It's time for some news. We have five stories today. Starting with our number one. Sony says future platforms are top of mind exploring new and enhanced ways to play. This is from Andy Robinson at Video Games",
            "start": 827.36
        },
        {
            "text": "for some news. We have five stories today. Starting with our number one. Sony says future platforms are top of mind exploring new and enhanced ways to play. This is from Andy Robinson at Video Games Chronicle. And here's what I'll say. It's a beefy news day. A lot of beefy news stories here. All right, so sit back, relax, and just let me read to you a little bit. PlayStation has discussed its future console strategy and said it's committed to exploring a quote exploring a new and enhanced way for players to engage with games and that the future of the platform is top of mind. Sony Interactive Entertainment's new president and CEO Hiyaki Nishino was asked during a business segment meeting about the future of PlayStation console hardware and whether it could be superseded by cloud gaming. Nishino emphasized that PlayStation now has multiple generations of experience providing players with cloud-based gameplay and stated that while he views it as a viable option for players, he believes",
            "start": 868.32
        },
        {
            "text": "emphasized that PlayStation now has multiple generations of experience providing players with cloud-based gameplay and stated that while he views it as a viable option for players, he believes overall demand remains for the local execution of games. Quote, \"Cloud streaming is progressing well from a technical standpoint as we have demonstrated with our offerings, but end-to-end network stability is not in our control,\" Nishino said. He continues, quote, \"And the higher cost per play time compared to the traditional console model remains a challenge. Cloud gaming is increasingly providing an additional option for players to access content. But our belief is that the majority of players continue to want to experience gaming through local execution without dependency on network conditions, and PS5 and PS5 Pro have validated this thesis, I believe.\" End quote. The CEO went on to reference how Sony's console business has evolved into a multiaceted platform with a significant portion of its",
            "start": 919.68
        },
        {
            "text": "PS5 and PS5 Pro have validated this thesis, I believe.\" End quote. The CEO went on to reference how Sony's console business has evolved into a multiaceted platform with a significant portion of its 124 million monthly active users still playing on PlayStation 4. Quote, \"We now have a large ecosystem of highly engaged players across both the PS5 and the PS4 generations. So naturally, therefore, there's a huge interest in our next generation console strategy.\" He said, quote, \"While while we cannot share further details at this stage, the future of the platform is top of mind. We are committed to exploring a new and enhanced way for players to engage with our content and services.\" End quote. Azar again emphasized the point that Sony's players are now engaged across multiple platforms including PS4, PS5, and PC, and noted that the vast majority of his revenue now comes from subscriptions in microtransactions, which should provide protection during any future platform migration. Quote,",
            "start": 964.72
        },
        {
            "text": "PS4, PS5, and PC, and noted that the vast majority of his revenue now comes from subscriptions in microtransactions, which should provide protection during any future platform migration. Quote, so we've reduced traditional cyclicality. Is that the word? I knew it. Cyclicality as you describe it. by establishing a large ecosystem of players across both the PS5 and PS4 generations which provides recurring revenues. So this has driven overall high and stable level of spend on content and services which by the way now constitute over twothirds of our revenue providing a consistent predictable and profitable base of our revenue. End quote. He added, quote, \"PS5 represents our most engaged players with the highest spend per player versus prior generations. Our PS4 players as well are still active in spending.\" Well, end quote. That was a lot. It is of marketing, a lot of It's a lot of nothing when you really think about it. It's essentially like, \"All right, cool. We're thinking about what",
            "start": 1013.12
        },
        {
            "text": "in spending.\" Well, end quote. That was a lot. It is of marketing, a lot of It's a lot of nothing when you really think about it. It's essentially like, \"All right, cool. We're thinking about what the next system is going to be. Duh. Of course they're thinking about it.\" Uh, I don't think this means it's any time closer than we thought it was yesterday, right? like this this isn't there's no news here necessarily the way they're talking about all this of like caring about local executable support and all that that's great and that's awesome and something that we love to hear because I do not want that function to go away having said that I do think it is pretty funny that they talk about it that way and then get to the end of this and be like but the money's in subscriptions like cool we have the PS4s and there are still a hefty percentage of 120 plus million uh players engag engaged players using a PlayStation 4. That's great. But they clearly are like, \"Where's the revenue coming",
            "start": 1066.08
        },
        {
            "text": "have the PS4s and there are still a hefty percentage of 120 plus million uh players engag engaged players using a PlayStation 4. That's great. But they clearly are like, \"Where's the revenue coming from though?\" It is coming from the engaged PS5 players. And that's with what the PS5 offers now, including cloud support and things like that. When we're a couple years later and Xbox has a even further like hold on services and subscriptions and all of that, I wonder what PlayStation tune is going to be at that point. But I still think we are a fair ways away from that becoming the sole reality. Um, but yeah, it's funny cuz like nothing about this gets me excited necessarily. I think this all orients how we think about PlayStation, how they approach their their business versus how other people might approach their business, right? Like a lot of buzz terms here, but I think a lot of it is valuable as far as why they're doing live service. We've been talking about this for years and years",
            "start": 1106.72
        },
        {
            "text": "might approach their business, right? Like a lot of buzz terms here, but I think a lot of it is valuable as far as why they're doing live service. We've been talking about this for years and years about and especially in the last I think couple years right when they did their uh one of their business calls talking about how they want to shift a lot of their budget into live service because that's where a lot of revenue is is going to come from and looking at this that is where the bulk of revenue is coming from is from those subscriptions from those uh microtransactions and I'm sure for PlayStation it is making that bit of percentage off of Fortnite's microtransactions and all these other games microtransactions I'm sure that very much informs PlayStation going okay but what if we just made 100% off of microtransactions by being able to own that, being able to have our own thing that is our own Fortnite or our own um Call of Duty or whatever our own live service, our own Destiny,",
            "start": 1157.52
        },
        {
            "text": "made 100% off of microtransactions by being able to own that, being able to have our own thing that is our own Fortnite or our own um Call of Duty or whatever our own live service, our own Destiny, right? Let's literally buy Bungie kind of thing. Um so that makes sense. I think coupling that with uh how they're talking about it seems like PS5 now is where the core player base of PlayStation is, right? Or at least I would say where the majority of player base of PlayStation is. And in addition to that, the core place of console gamers. Yeah. Like that's that is the a very important thing is the PlayStation 5 is the core main way that general gamers are playing third party games and and obviously PlayStation exclusives, but those represent a large percentage of console games, period. So if this all makes me wonder, and it's kind of to what you're saying as well, right? Like wonder about what the feature is. It's not necessarily an exciting thing uh or an this isn't exciting framing for",
            "start": 1194.8
        },
        {
            "text": "this all makes me wonder, and it's kind of to what you're saying as well, right? Like wonder about what the feature is. It's not necessarily an exciting thing uh or an this isn't exciting framing for it, but it is I think informative as far as like all right the train is still going to keep going. I think for me this signals we're still going to keep trying the live service thing and we're going to do it until something sticks, right? And I think for them it's going to be a learning process of all right, Concord didn't work. All right, Marathon's up next. Let's see if Marathon works. Oh, it didn't. All right, let's see if Fair Games works. And I think I think it's going to be moving and shifting. I think they're probably going to see it's probably gonna be a lot of experimentation. I think you're going to see uh the Arc System Works Marvel fighting game probably be a big in a big factor into oh wait we don't have to have a Destiny if we have like five or 10 of these, right? If you can",
            "start": 1242.48
        },
        {
            "text": "you're going to see uh the Arc System Works Marvel fighting game probably be a big in a big factor into oh wait we don't have to have a Destiny if we have like five or 10 of these, right? If you can figure out the creative ways to enter the live service realm without having it having to be like a Bungie launched a new firsterson shooter that has 50 million players kind of thing. I think that might help to define it, but again, I don't they're obviously chasing the money. Yeah, man. It's God, there's a lot of a lot of conversations here that very interested in having. I want to stick on the Marvel thing for a second because you're making a very good point that if they just find a bunch of smaller wins, that can add up to being more important than unreliable unreliable big bets. Yeah. But the fact is fighting games are still, all things considered, a fairly niche thing. You're now making this on an exclusive, right? So, it's it's PlayStation. Is it coming to PC? I believe it's coming to",
            "start": 1282.48
        },
        {
            "text": "fact is fighting games are still, all things considered, a fairly niche thing. You're now making this on an exclusive, right? So, it's it's PlayStation. Is it coming to PC? I believe it's coming to PC. Either way, you're very much limiting of player base, which we've seen before. Not the best actually actively bad for fighting games, right? Yeah. On top of that, there's not 10 million people buying this game, right? 10 million. Yeah. There won't be over time. I mean, it depends on I don't know. I mean, like, think about that. Like, like how many fighting games have crossed 10 million? I mean there have been I mean it's I would say like uh Tekken well previous Tekken crossed 10 million maybe Street Fighter 5 but maybe not but I don't think so I want to look into this but like not that many is my point and so so what I'm saying is it's like you're you're already limiting the amount of people that are going to buy this thing but then on top of that supported in the live area cuz like",
            "start": 1327.92
        },
        {
            "text": "is my point and so so what I'm saying is it's like you're you're already limiting the amount of people that are going to buy this thing but then on top of that supported in the live area cuz like buying it that's old school traditional revenue they're talking about subscription revenue. So my point is you're only able to get a limited amount from the player base and not the entire player base is going to buy the subscription. So you need to set the expectations there. Like if PlayStation were to do that, they need to know they're only going to get X amount of whales or X amount of people that are committing to whatever the subscription service, the Fighter Pass or whatever the hell they want to call it for for the thing. Because you even look at more modern traditional fighting games that do have like the DLC packs and I mean I would love to see the numbers on those. I guarantee it is just a downward slope of people that are actually still buying or playing or whatever with those. I I",
            "start": 1371.76
        },
        {
            "text": "do have like the DLC packs and I mean I would love to see the numbers on those. I guarantee it is just a downward slope of people that are actually still buying or playing or whatever with those. I I think to that it's going to be balanced. So to fact check here, right? Um Street Fighter 5 uh by well I can't find when this is by but this is from a Eurogamer article that uh it's sitting at 7.8 8 million uh units and I think this is from like quite a few years ago. Tekken 7 as of December 2022 uh sold 10 million and like I'm if memory serves serves me correct Mortal Kombat um Mortal Kombat the biggest one. Yeah, I feel like that typically will hit like 15 million or something like that. Right. So, and that that is to your point of that balance of what is the success you're looking for as PlayStation and like what is the potential for these games that you're launching to hit that success and I think it will I think it's a fascinating talk because I don't think that Marvel alone is going",
            "start": 1415.52
        },
        {
            "text": "and like what is the potential for these games that you're launching to hit that success and I think it will I think it's a fascinating talk because I don't think that Marvel alone is going to do that but I think Marvel is going to do a few things. Marvel is going to be big for your audience. I think both PlayStation audience, gaming audience, and then also like fighting game audience is going to love Marvel and it's going to be a that's going to count as a W. And I think in some cases, as long as the money is there as well, a W is a big deal, especially if you can sustain it and have it be a thing that lives for even if it's not 10 years, if it lives for 5 years, and if it's able to get that money over time. If you pair that with a handful of other ones, right? Like I don't know why Project Gummy Bears comes to mind, but like say we're say Project Gummy Bears is more exciting than we're making it out to be cuz like from the reports and stuff it seems like internally that tested",
            "start": 1460.56
        },
        {
            "text": "Project Gummy Bears comes to mind, but like say we're say Project Gummy Bears is more exciting than we're making it out to be cuz like from the reports and stuff it seems like internally that tested pretty well. It seemed like a creat. We didn't see that last week by the way. Oh yeah, we didn't see that last week. That's kind of weird. Yeah. I And maybe that's game that game is not as far along as maybe we would think it is. But there were like some rumors that like really backed up that we were going to see it. I think it was I just predicted it. I don't I don't know if there were rumors or anything that made it seem like it was around the corner. I was just hoping to see it. But that's that's I mean they they called it a frog type game and I'm like what do you tell us that much? I want to see what this game is. But like I if they have a that if they have MLB doing it thing, if they have Gran Turisma doing his thing, if they have like a handful of titles that can count as that live",
            "start": 1498.48
        },
        {
            "text": "to see what this game is. But like I if they have a that if they have MLB doing it thing, if they have Gran Turisma doing his thing, if they have like a handful of titles that can count as that live service thing, that doesn't have to be the big bet of an extraction thing. I think my thing with the PlayStation's live service approach is finding the lanes that actually make sense and actually are don't have as much competition. You look at Concord and there's too much competition. So, but what a problem with what you're saying here though is the games that you just mentioned, they're not nickel and dimming people with microtransactions, right? Like Gran Turismo as a live service game. The live service, correct me if I'm wrong, it's not making them revenue like that, right? I mean, that's a question for the audience that's playing. Yeah. Like for for MLB and for Gran Turismo, are like there are there active ways that because every game has ways you not every most games have ways you can",
            "start": 1532.4
        },
        {
            "text": "question for the audience that's playing. Yeah. Like for for MLB and for Gran Turismo, are like there are there active ways that because every game has ways you not every most games have ways you can make money from them, but you're not going to call them a live service game. Well, for so in your mind, live service has to be nickel and and dimeming people. I think it kind of does, right? Or there has to be a very just clear obvious, oh, this is how they're making money, you know? It doesn't need to be nickel and diamond, but just there has to be like the clear like, oh, that's how this is working and people are actually doing it. Yeah. I I would yeah ask for people to either you're wrong or super chat in and let us know what your experience is with like microtransactions in those games cuz I think for MLB I got to imagine MLB has packs of cards. Okay. It has the the same the normal thing you'd expect from like FIFA Ultimate Team and all that. Yeah. I think you know what? I'm going to",
            "start": 1580.96
        },
        {
            "text": "I think for MLB I got to imagine MLB has packs of cards. Okay. It has the the same the normal thing you'd expect from like FIFA Ultimate Team and all that. Yeah. I think you know what? I'm going to remix the new stories here. Cuz story number three actually fits in with the conversation that we're having right here. So I'm going to hop into story number three and let's talk more about uh PlayStation's live service. Because in story number three, PlayStation Studios boss is confident that Marathon won't repeat the mistakes of Concord. I'm pulling from Chris K at Game Developer. PlayStation Studios boss Herman Hol has insisted that Bungie's upcoming live service shooter Marathon won't make the same mistakes as Concord. Discussing the company's live service ambitions during a fireside chat aimed at investors, Hol said that the market remains quote a great opportunity for PlayStation despite the company having a decidedly patchy record when it comes to live service offerings. Last year,",
            "start": 1611.92
        },
        {
            "text": "aimed at investors, Hol said that the market remains quote a great opportunity for PlayStation despite the company having a decidedly patchy record when it comes to live service offerings. Last year, the company launched and swiftly scrapped live service hero shooter Concord after it failed to hit the ground running. It shuttered developer Firewalk weeks later after conceding the title did not hit quote did not hit our targets. Sony scrapped two more live service titles in development at internal studios Bluepoint Games and Ben Studios in January this year. Earlier this week, it conf it confirmed an undisclosed number of workers at Bend had been laid off as the studio transitions to its next project. Hol said the company had learned hard lessons from those failures and believes Marathon is well positioned to succeed as a result. Quote, \"There are some unique challenges associated with live service titles. We've had some early success as with Hell Divers 2. We've also faced some",
            "start": 1653.68
        },
        {
            "text": "is well positioned to succeed as a result. Quote, \"There are some unique challenges associated with live service titles. We've had some early success as with Hell Divers 2. We've also faced some challenges as with the release of Concord, said Hol. Quote, I think some really good work went into that title, some really big efforts, but ultimately that title entered into a hyperco competitive segment of the market. I think it was insufficiently differentiated to be able to resonate with players. So we have reviewed our processes in light of this in light of this to deeply understand how and why that title failed to meet expectations and to ensure that we are not going to make the same mistakes again. End quote. Tim, do you believe him in regards to marathon? I mean what gets complicated about this is that I do believe they're not going to make the same mistakes, but I think they're going to make different mistakes. I think I like that's just what it is and that sucks. But like, yeah,",
            "start": 1698.64
        },
        {
            "text": "this is that I do believe they're not going to make the same mistakes, but I think they're going to make different mistakes. I think I like that's just what it is and that sucks. But like, yeah, again, this is just kind of just words. This is just a lot of of saying things that like doesn't really mean anything cuz we're in the reality we are, which is Marathon is not likely to be a hit. There is a chance that it pulls it off, but it's not likely. Like, if you were a betting person, you'd bet against it. Yeah. So, what what Herman's saying here, I don't believe it. I don't believe it changes anything. I don't think he knows anything we don't. Yeah. You get what I'm saying? He knows a lot that we don't, but he doesn't know anything that's going to like actually affect the reception of Marathon at this point. And like even some of the things they're saying about um like comparing it to Concord, it's like again, a lot of people here played Concord and liked it a lot. It's not that the",
            "start": 1746.16
        },
        {
            "text": "at this point. And like even some of the things they're saying about um like comparing it to Concord, it's like again, a lot of people here played Concord and liked it a lot. It's not that the game was horrible. It's not the game was this like disaster abysmal mess. It's just people didn't want it. Yeah. I think it's that it it was in a hyper competitive space. Like why would I play Concord when I could play Overwatch or I could play Marvel Rivals? And then also you're putting out at $40 in a space where doing a premium priced uh title is becoming tougher and tougher as even the games like Overwatch and Marvel Rivals are free to play, right? Like that is becoming more and more of the thing. So it was just positioned um in a in the wrong way. And I think when I think of the lessons that you can learn from Concord to uh better uh launch Marathon, I think of those things. I think of pricing which correct me if I'm wrong. Marathon is coming out at $40. Unless I'm misremembering that.",
            "start": 1784.16
        },
        {
            "text": "you can learn from Concord to uh better uh launch Marathon, I think of those things. I think of pricing which correct me if I'm wrong. Marathon is coming out at $40. Unless I'm misremembering that. That's another kind of funny.com slash you're wrong for chat if I'm wrong about that. Um but like so did Concord, right? Yeah. So then Concord. So that's not the lesson being learned. Is it a thing of getting the game into people's hands earlier? They have been doing that with Marathon to their credit and I think that's a good thing. But like how much can you really move the ship and turn this into something that people are going to love? I think there's the Bungie factor that people you have a built-in audience already. You have people that love Bungie and that want to see that game, want to see that game win because they want to see Bungie win, but I think that's only going to buy you so much time and cache with your audience. Uh, so we don't actually have a price for Marathon yet. It's",
            "start": 1827.68
        },
        {
            "text": "see that game win because they want to see Bungie win, but I think that's only going to buy you so much time and cache with your audience. Uh, so we don't actually have a price for Marathon yet. It's Bungie confirmed. It's a premium paid for game on PS5, but it won't be $70. Gotcha. So, I mean, and that's still to the point of premium paid game. All right, cool. Like, it's an extraction shooter. So like then I think a lot most extraction shooters are paid but at the same time I still think for the live service aspect of it you just have a lot working against it for the kind of game that it is. It does and it's not even bringing up the controversies of art theft. Yeah. Yeah. So Tim if you're putting your CEO cap on Yeah. you're you're PlayStation's new president. You're trying to you're trying to figure out how to navigate the ship. like what are the big moves you're doing if you're trying to learn from Concord and figure out what live service looks like for the future. I the problem",
            "start": 1866.0
        },
        {
            "text": "to figure out how to navigate the ship. like what are the big moves you're doing if you're trying to learn from Concord and figure out what live service looks like for the future. I the problem with marathon is that it's here. Like it's not like we can be like, \"All right, we're just like pump the brakes. Let's figure out strategy.\" It's like they need to do something with this game. And the longer they take to figure out out what that is, the more money is being spent on the game instead of money being made from the game, right? Yeah. I my gut says free to play is the answer. You put this thing out, give it the best chance to possibly work with an audience and get people. Again, if the game is good and it's free, people will play it. Will enough people play it to keep it going? That's a different question. But I mean, I feel like a damn lot more than people having to pay for this thing, right? And then on top of that, like them, the story number one, they're talking about",
            "start": 1910.24
        },
        {
            "text": "That's a different question. But I mean, I feel like a damn lot more than people having to pay for this thing, right? And then on top of that, like them, the story number one, they're talking about microtransactions and all this being a substantial part of where the money's made. I feel like they need to look at it and be like, \"All right, there's certain games that we're betting on making money from the sales of the game.\" They have so many of those. PlayStation. Yeah. Then there's the other side of like the goal is microtransaction money from this and I feel like marathon that is what I would bet on cuz otherwise I think you're just you're trying too much. You're trying too hard to like get this up front and then get more later. I think that that's just going to result in a failure across the board. And I'm not saying that freeto play is going to work. But I do think with what I understand and know it has a higher chance of resonating more with more players and at the end of the day",
            "start": 1949.92
        },
        {
            "text": "the board. And I'm not saying that freeto play is going to work. But I do think with what I understand and know it has a higher chance of resonating more with more players and at the end of the day making more money for PlayStation. Yeah, I mean I think leveraging the platform that you have, right? Like even if it's not free to play, I think putting it on PS+ like figuring out the avenues for Yeah. for your audience to get in there and want to experience it and have fun and want to party up with friends, right? And like make it easy for their friends to get in. That's what these games are all about. And then you want to have them hooked in for however many months, however many years to then make that spend afterwards, right? Like that should be the strategy with this thing. I'm so fascinated to see beyond the marathon and and fair games because I think those are the two two looming like threats on the horizon essentially, right? Like I don't know how those two games are going to do,",
            "start": 1989.2
        },
        {
            "text": "to see beyond the marathon and and fair games because I think those are the two two looming like threats on the horizon essentially, right? Like I don't know how those two games are going to do, but I think beyond that like I think they're at a place now where they can be a a bit reactionary and I assume they already have been reactionary internally as far as all right, what have we learned about the audience response? What have we learned about Concord's launch and failure? What have we learned about what we can do in this space and what we can't do in this space? And I think we see some of those things announced in the next two years. I don't think I don't think there's any world in which they're done with the live service push, but I think for I think there is a world where we see more of these games get announced and we go, \"Oh, interesting. I'm I might be into that.\" I think you might have a bit more of those uh things announced. I think you couple that with looking at what you",
            "start": 2028.4
        },
        {
            "text": "of these games get announced and we go, \"Oh, interesting. I'm I might be into that.\" I think you might have a bit more of those uh things announced. I think you couple that with looking at what you already have and instead of and this is me speaking way out of turn not knowing the numbers and how all this all this [ __ ] works. I would think that looking at what you have on your platform, the third parties, the Fortnites, the Genchins, the Call of Duties, all that stuff, and figuring out how to foster the best environment for those games to make money on your platform and put more effort into like, all right, how do we make PlayStation the best place for Genjin to thrive? That way we can make that percentage off of their microtransactions. I would think that like that is what you do and I'm sure they do that anyway. But like I I I think trying to launch your own Fortnite is impossible. Yes. Like and and hard stop. It's impossible. Yeah. Tim, before we move on to ads, I want to bring",
            "start": 2071.44
        },
        {
            "text": "I'm sure they do that anyway. But like I I I think trying to launch your own Fortnite is impossible. Yes. Like and and hard stop. It's impossible. Yeah. Tim, before we move on to ads, I want to bring in maybe one or two super chats for you. Kobe AR writes in and says, \"Marathon comes out in three months and we haven't heard anything about it since the controversy. This is the first time we are hearing about it since. What do you think is happening at this point? It's a good question. It's a great question, man. Like, I just don't know. I don't know where we're at with this. Like, it wasn't at their state of play and it's so close any of the summer things. Yeah. And but it's at a point that we know like people have played it now like the community has played it like the the the sentiment is out there like we there's not much we need to know actively until a decision is made. We know the date. So until that date is delayed, right? Mhm. Which at this point it has to be at this. But",
            "start": 2108.08
        },
        {
            "text": "is out there like we there's not much we need to know actively until a decision is made. We know the date. So until that date is delayed, right? Mhm. Which at this point it has to be at this. But that's the thing is it doesn't like I expect it's going to be, but like we have we already have our questions answered. Isn't there fundamentally like a [ __ ] ton of uh art assets that are just kind of stolen in that game? I mean, I don't know that that stops them from releasing it, though. I don't know. I mean I I that the thing with that is like depends on how the conversations go around with all of that [ __ ] internally and with you know the people they stole. Yeah. It's not first off I don't think that they win that lawsuit like I think just the sheer money involved. They should they [ __ ] should but like I I just I don't think all the people that like might come after PlayStation over their is it have they officially announced like Yeah. And that's the thing is I don't think we even",
            "start": 2157.84
        },
        {
            "text": "should but like I I just I don't think all the people that like might come after PlayStation over their is it have they officially announced like Yeah. And that's the thing is I don't think we even get there period. Yeah. I Yeah. I think depending on how they resolve it, cuz I could see them going to the artist and being like, \"Yo, we will just throw we'll throw you out a [ __ ] ton of money.\" I don't think that stuff gets in the way of the the release date. I think it's more are they happy with the strategy for the game? Yeah, cuz if the answer is no, listening to Herman here, reading between the lines, things can change. But my point is, while I think it is going to get delayed, we still do have 3 months until this release date hits. So, all it takes is a random Tuesday blog post of like, \"Hey, here's the launch trailer and we're like, \"All right, it's coming.\" All right, cool. It's It's happening. I don't understand why does PlayStation not have an early access program? I don't",
            "start": 2203.28
        },
        {
            "text": "like, \"Hey, here's the launch trailer and we're like, \"All right, it's coming.\" All right, cool. It's It's happening. I don't understand why does PlayStation not have an early access program? I don't remember any game coming out in early access. This might be a chat question as well, right? Like, I feel like Marathon coming out in early access this fall makes way more sense than a full launch just based off of the impressions that I've seen online about Marathon so far. bas and listen to audience feedback and see what the game is like out in the wild and then make those fixes and then have a big 1.0 late next year. Yeah. Like I don't know why that's not the case. Um Path of Exile is I assume POE is Path of Exile too. They lucid dream in chat says that's early access. Some people in chat are saying no it doesn't. Fortnite was early access for years, says kebab. So I think you're kebabs. I think you're talking about Fortnite Battle Royale. Street says PlayStation just started a beta",
            "start": 2241.76
        },
        {
            "text": "are saying no it doesn't. Fortnite was early access for years, says kebab. So I think you're kebabs. I think you're talking about Fortnite Battle Royale. Street says PlayStation just started a beta program, Marathon could be used for it. Pal World Early Access. That's a good point. So yeah, I I mean I I feel like if I'm PlayStation in conversation with Bungie, I understand, hey, you're PlayStation. Everything's prestige here. You know, you want you want things to launch from first party out and finish and all that stuff. just make it early access and just have this be like the trial period of figuring out like what does the audience really want from this game and how do we make the best game over the next year. I I mean man I I don't know that you can do that with a marathon. Like Marathon is not like a oh an IP that's going to draw people in, but it is one of Bungie's IPs. And I feel like essentially being like, hey, admittedly, we don't know what to do with this is not a good look",
            "start": 2294.96
        },
        {
            "text": "is not like a oh an IP that's going to draw people in, but it is one of Bungie's IPs. And I feel like essentially being like, hey, admittedly, we don't know what to do with this is not a good look for a IP that they have. Yeah. But this is them re bringing it back. Like there needs to be a level of confidence and they need to be able to stand on it and and it needs to be able to stand up to that level of confidence. But I think we're at the place now with early access where we're past it being a thing of you don't have you don't have confidence. I think for these types of games, early access seems to be more and more standardized. Like the fact that Power World came out in early access and it's one of the most successful games of the last 16 months. Another game that stole a bunch of things. Maybe it'll work. I mean, yeah. I mean, maybe I Yeah, like [ __ ] it. Throw it out there early access and you know what can the courts do? The game's not out yet. We're not We're going to replace",
            "start": 2335.68
        },
        {
            "text": "Maybe it'll work. I mean, yeah. I mean, maybe I Yeah, like [ __ ] it. Throw it out there early access and you know what can the courts do? The game's not out yet. We're not We're going to replace all this [ __ ] I don't know. Um, and then I'll bring in one more super chat. Uh, from Spubby Jubby. This is off um off topic, but I like it. Any luck getting the Final Fantasy MTG cards? Got some yesterday from local game stores. Uh, funny story about that. We got them delivered uh directly from Magic Wizard of the Coast to us yesterday, me and Mike. So cool. It was so cool. And I was panicking like for weeks because I was like, \"Oh man, I'm not able to get them. I'm like, I'm looking everywhere and like like the prices are so high. And then after we got them yesterday, I came home and then I got a notification on my phone from Amazon and they were like, \"We've shipped your uh Final Fantasy starter kit that you ordered in February.\" I totally just forgot. I love it. So, I came into a fun",
            "start": 2379.36
        },
        {
            "text": "got a notification on my phone from Amazon and they were like, \"We've shipped your uh Final Fantasy starter kit that you ordered in February.\" I totally just forgot. I love it. So, I came into a fun surprise at my desk. Bless his other one. Hell yeah. Yep. I came in this morning and placed the starter kit that I got on Tim's desk. And now we we're all just just hanging out. We're all going to be playing some magic. You going to learn some? Uh we'll see. We'll see. Well, if me and Mike do a stream, like schedule a stream. Yeah. Would Would you come through? Would you like I'd like to. Yes. Okay. I'll talk to Mike about that. Um, but yeah, I also got the What's the name of the Final Fantasy 10 protagonist? Tetus. I got the Tetus commander. Hell yeah. I'm really excited to bust it open. I'm playing some board games tomorrow with some friends. Very proud. Be a good time. Hell yeah. You know what else is a good time? going to patreon.com/conindfoney and youtube.com/confunny games where you",
            "start": 2421.84
        },
        {
            "text": "some board games tomorrow with some friends. Very proud. Be a good time. Hell yeah. You know what else is a good time? going to patreon.com/conindfoney and youtube.com/confunny games where you can get the kind of funny membership which allows you to get shows adfree. And speaking of ads, let us tell you about our sponsors. This episode's brought to you by XRE. Y'all know that a few months ago, my life changed forever when I brought a pair of XRE1 AR glasses on a long flight to New York. I legit could not believe how easy it is to use and high quality my experience was playing games, watching movies, TV shows on the plane without just too much extra stuff around me or especially not a giant goofy headset around my head. No joke, this is my favorite new tech product in years and it has earned a permanent spot in my travel bag. It is only hard to believe that it works as well as I'm saying until you try XR1 AR glasses for yourself and then you will see that the future is now. The tech is",
            "start": 2460.08
        },
        {
            "text": "a permanent spot in my travel bag. It is only hard to believe that it works as well as I'm saying until you try XR1 AR glasses for yourself and then you will see that the future is now. The tech is here. Connect XReal 1 glasses to wherever you are playing. Whether it's a handheld console, a PC, phone, home console. You just get a massive 150in virtual screen anywhere, anytime for any game. Gaming on the go like a long haul flight, you need the XR1. Next, starting to hurt from staring down at your handheld, we've all been there. You need an XR 1. A screen as big as your wall. Instant plugandplay with all of your devices via USBC. Built-in audio with sound by Bose. Anchoring your screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full HD. These are what make XR1 a musthave. And we hear XR1 Pro is coming soon with an even bigger virtual screen. Hit our link below to get your XR glasses today. There's nothing better than when a sponsor of Kind of Funny is",
            "start": 2504.24
        },
        {
            "text": "XR1 a musthave. And we hear XR1 Pro is coming soon with an even bigger virtual screen. Hit our link below to get your XR glasses today. There's nothing better than when a sponsor of Kind of Funny is something that we are legitimately obsessed with, and that is exactly the case here with XRE. You're going to hear me talking about these forever. Go to kind offunny.com/xreal. That's kind of funny.com/xr. I promise you, you are going to love these things. This episode's brought to you by Factor. Summer Gamefest is here. The Switch 2 is here. The sun is here. So many summer things are here. And the number one thing you don't want to be doing all summer, spending hours cooking inside. That's where Factor comes in. Factor chef crafted dietitian approved meals are ready in just 2 minutes. taking the hassle out of eating. Well, we love Factor here at Kind of Funny and Greg's often making and enjoying meals quick in between shows here in the studio. I just had a roasted garlic chicken and I'm",
            "start": 2556.0
        },
        {
            "text": "the hassle out of eating. Well, we love Factor here at Kind of Funny and Greg's often making and enjoying meals quick in between shows here in the studio. I just had a roasted garlic chicken and I'm telling you, you would have loved it. Factory meals arrive fresh and ready to eat, perfect for any active lifestyle over summer and beyond. With 45 weekly menu options, you can pick gourmet meals that fit your summer gains and goals. Choose from options like calorie smart, protein plus, keto, and more. Get started at factormeals.com/kindfunn5050 off and use code kind offunny50 off to get 50% off plus free shipping on your first box. That's kind of funny off at factormeals.com/kindfunny50 off for 50% off plus free shipping. Factomeals.com/kindfunn 50 off. And we're back. We got a lot of super chats that came in. Uh starting with Matt Sanders who says, \"Great review of Superman. Let Greg know I blame Eminem for misleading a generation to think it's Christopher Reeves and not Reev. I am 1000%",
            "start": 2603.6
        },
        {
            "text": "that came in. Uh starting with Matt Sanders who says, \"Great review of Superman. Let Greg know I blame Eminem for misleading a generation to think it's Christopher Reeves and not Reev. I am 1000% one of those people. Yeah, I'm also one of those people. We were talking about the the name yesterday on uh in review and yeah, I didn't bring up the Eminem thing, but uh cuz I didn't want to get too negative, but um it is crazy. It is crazy how many times we heard that man say Christopher Reeves. Yeah, it's not once or twice. No, it's a hundred. Over the course of like none appropriate 20 years of him rapping about Christopher Reeves. Christopher Ree. [ __ ] Yeah. No, it's funny because I don't think I would know who Christopher Reev was if it wasn't for Eminem. Crazy. Yeah. I mean, real talk, that's how I learned, too. Yeah. Shout out to Relapse, I guess. Um, Amaze Hobbs writes in and says, \"Blessing, any interest in the Digimon card game. I'm very inexperienced with the IP, but love the",
            "start": 2653.6
        },
        {
            "text": "that's how I learned, too. Yeah. Shout out to Relapse, I guess. Um, Amaze Hobbs writes in and says, \"Blessing, any interest in the Digimon card game. I'm very inexperienced with the IP, but love the gameplay. Would love to hear yours and Mike's thoughts.\" Um, no, but you know, maybe I'll check it out. I I love the like I think the designs of the Digimon cards are sick as [ __ ] Uh back in the day when I was a little kid, I collected them as well. Uh and then they re-released the OG set, so I got all those last year. But um my friend Yoshi is actually super super super into uh the Digimon card Digimon general, but the Digimon card game and like he hosts like big the big tournaments and stuff and it's pretty cool. Big tournaments. Big tournaments. The Digimon card game is like it's up there. like they're taking it really seriously and like I'm I don't know if I I'm into Digimon so I'm sure I get served more Digimon content than most people do but um yeah it's it's not magic levels",
            "start": 2693.04
        },
        {
            "text": "there. like they're taking it really seriously and like I'm I don't know if I I'm into Digimon so I'm sure I get served more Digimon content than most people do but um yeah it's it's not magic levels obviously but it just looks cool. I like the art. From my outside perspective, this and Lorana seem to be on the same kind of level in terms of obviously Lorana has more just general interest, but in terms of like tournament gameplay and like people taking the game seriously, yeah, I see them talked about a I I do mess with Lorana. I I like Disney Lurana. I've only played it once with Blind and Yousef, but like I I want to go back to it. I now I'm just sitting on a bunch of boxes. Yeah. Of Lurana cards. The three starter decks for the first round of them and I never never got Lorana stream. We got to do table We got to do tabletop Tuesdays because of alliteration. We got rules of iteration, man. Um let's see. Joe for for Relli writes in says, \"Happy Magic the Gathering Final Fantasy Day",
            "start": 2735.68
        },
        {
            "text": "We got to do table We got to do tabletop Tuesdays because of alliteration. We got rules of iteration, man. Um let's see. Joe for for Relli writes in says, \"Happy Magic the Gathering Final Fantasy Day to all the cycles who celebrate.\" Happy one to you, too, Joe. Alex Raer says, \"Ten Bones for Barrett being awesome.\" Hell yeah. Demon Hacker says, \"Does Barrett's Naughty Dog roundup include pre- Crash games?\" You'll have to watch it to find out. Wow. Wow. Wow. Um, Va Vuos says, \"Beaver text. What is that?\" I love that you had to hesitate before you said it. Show some [ __ ] respect to the beaver. Bless. We educated you. We're 266 days away from hoppers in theaters. Oh, sorry. I've already forgotten. I already wiped out. It's okay. You can forget for now. You have some time. We'll figure it out. Don't worry. And then Dexter Schwarzler writes in and says, \"So proud of you, Barrett. Can't wait.\" Uh, and then one more from Kebabs. He says, \"After beating Crash one for content, Tim said,",
            "start": 2778.96
        },
        {
            "text": "it out. Don't worry. And then Dexter Schwarzler writes in and says, \"So proud of you, Barrett. Can't wait.\" Uh, and then one more from Kebabs. He says, \"After beating Crash one for content, Tim said, \"We'll be back for two. We'll be back for Warped. I never forgot. Glad that is finally happening.\" Oh, that's hilarious. Oh, kebabs. Only you. I do remember that stream. That was your birthday stream. It was my birthday stream. I think first year, 2015. Damn, dude. 10 years ago. Damn. Yeah. All right. We got to play Crash, too. Yeah. Maybe a little bit of CTR as well. Yeah. No, we're going to bounce around and have a lot of fun. I'm stoked on that. Y'all play Crash Bash. Hit me up. I'll play some Crash Bash. Hell yeah, dude. You know, Naughty Dog, though. No. Naughty Dog didn't make that one. Who made Crash Bash? I don't know. But Naughty Dog made Crash Team Racing and I love that. I didn't know Naughty Dog didn't make Crash Bash. Hold on. I got to pause the show. Anything Anything past",
            "start": 2829.2
        },
        {
            "text": "Who made Crash Bash? I don't know. But Naughty Dog made Crash Team Racing and I love that. I didn't know Naughty Dog didn't make Crash Bash. Hold on. I got to pause the show. Anything Anything past the PlayStation one, Naughty Dog was not involved in in terms of Crash Bandic. Well, Crash Bash was PS1. It was PS1. Oh, but yeah, it was late though. 2000, I think. Okay, so it was primarily developed by Eurocom. Wait, hold on. Hold on. We're hopping to the Wikipedia because here's the weird thing cuz I don't know how the history goes here is that like Yeah, Crash Team Racing is the last game Naughty Dog works on in Crash Bandicoot. After that, Naughty Dog gets uh fully bought out uh by uh Sony PlayStation. The Crash Bandicoot IP stays with Universal Interactive. And then Travelers Tales made their games for a while and then it got acquired by Activision. Gotcha. So the first page, the first sentence of the um Crash Bash Wikipedia page, Crash Bash is a is a 2000 um is a 2000 party video",
            "start": 2865.84
        },
        {
            "text": "their games for a while and then it got acquired by Activision. Gotcha. So the first page, the first sentence of the um Crash Bash Wikipedia page, Crash Bash is a is a 2000 um is a 2000 party video game developed by Eurocom Entertainment Software in association with Cerni Games. Do you think that's Mark Cerny? That must be Mark Cernney. I believe so. Yeah, Mark Cernney had had his hands on Crash Bash. I knew he was a genius. Dude, where' Knack come from? Where' the idea for Knack come from? Crash Bash. Think about it. And here's the thing. Crash Bash obviously the worst. No, actually. Whoa, whoa, whoa, whoa, whoa, whoa, whoa, whoa, whoa. It's not Sonic Shuffle exists, but like it's not Mario Party. Let me just say that. All right. But some of those mini games, we got to bring it back. We got to do a Crash Crash stream, dude. That pogo one. The pogo. I was going to say the pogo. Oh my god. That was in the demo. And then what was what was up with the ice one? There was like one where",
            "start": 2907.68
        },
        {
            "text": "got to do a Crash Crash stream, dude. That pogo one. The pogo. I was going to say the pogo. Oh my god. That was in the demo. And then what was what was up with the ice one? There was like one where you're on like a a circle of ice. Yeah. And you're all sliding around like a bumper. sumo bumper car type thing. Yeah, there are some there were some hits and stinkers. Crash bash on the stream schedule for an entire month. Every day crash bash. Oh no. Oh wow. I don't know if we need to do that's an over correction. Yeah. Uh oh man, we got super chats coming in, but they're all about cards. We'll get to that later in the show. Let's hop in back in time to story number two. That's right. We went one, we went three, now we're going back to two. Xbox handheld device quote is essentially cancelled. This is Eddie Makuk at GameSpot. Ryan Walsh in the chat says, \"Tim, Crash Bash is nothing like Mario Party.\" People just be saying things. I mean, sure, you're not rolling dice and going on a game",
            "start": 2952.72
        },
        {
            "text": "This is Eddie Makuk at GameSpot. Ryan Walsh in the chat says, \"Tim, Crash Bash is nothing like Mario Party.\" People just be saying things. I mean, sure, you're not rolling dice and going on a game board, but it's a mini game collection party collection starring a mascot for a big platform. Nothing like it, Tim. Uh, though Microsoft never announced an official Xbox handheld device, there are rumors about how such a device might factor into the company's nextG console plans. Those plans are continuing to evolve, it seems, as a new report said Microsoft's own Xbox handheld is essentially cancelled. A report from The Verge citing insiders said such a device is no longer going forward. This follows on this follows on from a report at the end of May that suggested plans for an Xbox handheld were sidelined. Different from canceled, sidelined, now cancelled. The Verge report added that Microsoft remains bullish on the idea of making nextG Xbox hardware, but perhaps not in the way people",
            "start": 2989.6
        },
        {
            "text": "were sidelined. Different from canceled, sidelined, now cancelled. The Verge report added that Microsoft remains bullish on the idea of making nextG Xbox hardware, but perhaps not in the way people think. Quote, \"We'll see multiple devices from PC makers like Asus that will also be considered nextgen Xbox consoles,\" the report said. Spencer alluded to a closer collaboration between PC and console in a recent Xbox podcast interview. Quote, \"This is the tightest collaboration I've seen between the gaming organization and the Windows team in my three decades at the company.\" he said. Spencer also mentioned how Windows PC is an open platform that he believes if managed properly, a PC can be considered as a game console. While Microsoft may not develop its own dedicated gaming handheld device, the company is working with third-party devices like the recently announced ROG Ally ROG Ally handhelds from Asus. I think this is really good news and I think that why I say that is the knowledge",
            "start": 3037.36
        },
        {
            "text": "the company is working with third-party devices like the recently announced ROG Ally ROG Ally handhelds from Asus. I think this is really good news and I think that why I say that is the knowledge that they understand they need to focus on the OS. They need to get Xbox OS not just working. This this is not a good enough situation. Xbox OS has to just simply work in any place that you're playing it. What do you mean? Like I think that they're the OS that they're making that is going to be on this the the Xbox Alli X and that that is also going to be on the next generation console of Xbox. I wonder if they even get it on Xbox Series. Like I wonder if like they're going to get everything kind of using the the same uh operating system because at that is when we're going to be at the point that the dream has been fully realized and there is no actual difference between a PC and a console for Xbox because Xbox is the platform and we don't need to differentiate between Xbox for PC and Xbox",
            "start": 3084.8
        },
        {
            "text": "the dream has been fully realized and there is no actual difference between a PC and a console for Xbox because Xbox is the platform and we don't need to differentiate between Xbox for PC and Xbox period. Like that is I think the final point of trouble for them. uh but they also don't want to give up the console side because they want to have that hardware and that makes sense but we just need to get to that point where there is no actual difference between the experience between the two and yeah them when there are handheld uh hardware uh partners like Raj and I'm sure Legion and others are soon to come potentially even Steam. Yeah. Uh if if Steam wants to play nice, which I think they might when it comes down to it. um Xbox having its operating system everywhere that really is the everything is an Xbox. This is an Xbox and the experience is going to be your Xbox experience. So them they don't need their own hardware to do this with the strategy that they are we're not guessing",
            "start": 3136.72
        },
        {
            "text": "everything is an Xbox. This is an Xbox and the experience is going to be your Xbox experience. So them they don't need their own hardware to do this with the strategy that they are we're not guessing anymore. They're doing it and they're telling us they're doing it. So do you think we're not going to see Xbox hardware then in the future? No, I do I do but I don't think it's going to be important. I I think it's just going to be an option, but I think it's going to be similar to PCs where it's like, yeah, Windows has Surface laptops and that is an option to get. Yeah, there are better gaming laptops out there and anybody that takes gaming seriously isn't playing on a Surface. They're playing on a monstrosity. You know what I mean? Uh but like do you see what I'm saying? It's like they're going to have hardware, but it's not going to be the thing. It's not going to be the push. Yeah, I see what you're saying. I guess I I then try to make sense of it of what does that benefit like? How",
            "start": 3184.8
        },
        {
            "text": "going to have hardware, but it's not going to be the thing. It's not going to be the push. Yeah, I see what you're saying. I guess I I then try to make sense of it of what does that benefit like? How does that benefit Xbox? Because it's not the box. The box doesn't mean anything. It's it's the the OS is what? But like say like you're if I understand it's not the Okay, but like where does the where does the money come from? Are we just talking about Game Pass and software sales at that point? Yeah. But also they're going to have hardware that they're selling. It's similar to this generation. Where's the money coming from this generation where their hardware? It didn't sell that well. I guess that's fair. I don't think it's going to change. I guess my thing is if the our hardware becomes so understated that like you're like all right any PC can be an Xbox, right? Like if I'm say Asus or Legion or whoever, right, is putting out technically better Xbox hardware than Xbox is the and the",
            "start": 3224.64
        },
        {
            "text": "so understated that like you're like all right any PC can be an Xbox, right? Like if I'm say Asus or Legion or whoever, right, is putting out technically better Xbox hardware than Xbox is the and the Xbox hardware becomes that understated. I'm almost like I I feel I wonder at what does it get counter counterintuitive to the business at some point? No, because I think that that's the business that they are transitioning to and they're already currently in. I think, think about it, they're competing more with Steam and competing is even the wrong word. Like they're playing the same game that Steam is, but the difference is Steam puts out one original IP sequel or something every handful of years, whereas Xbox has an entire suite now of uh devs and publishers to be able to put original owned content on their platform. Like that is the difference, right? and having the play anywhere and all that. I feel like there just a lot of services that have been built up for the last decade that I",
            "start": 3261.2
        },
        {
            "text": "content on their platform. Like that is the difference, right? and having the play anywhere and all that. I feel like there just a lot of services that have been built up for the last decade that I think they're now ready to be like, \"Yeah, the Xbox is this the OS. It is not this box or that box, right?\" Um, and we're Steam's been doing this for a long time. And it's funny because you don't need the box for Steam to be a thing, right? Like it you could just use Steam on majority of uh computers at this point. But yeah, interesting stuff. Very interesting stuff. Uh let's hop to story number four, our last story of the day. Uh PlayStation is being really, really thoughtful about picking which games to port to PC, says Studio Boss. Uh this is Andy Robinson at Video Games Chronicle. PlayStation Studios boss Herman Hol has said the platform holder is continuing to make a thoughtful and measured approach to porting its games to PC as it balances growing its audience and protecting the value",
            "start": 3310.96
        },
        {
            "text": "Studios boss Herman Hol has said the platform holder is continuing to make a thoughtful and measured approach to porting its games to PC as it balances growing its audience and protecting the value of PS5. It's so funny how opposite. I know we've been talking about this for years, right? But it's never been more opposite than than this as far as PlayStation and Xbox and what they've been doing. Yep. Sony has importing it first party games to PC for some time. However, unlike Xbox, which releases PC versions day and date with console, Sony's non-live service games like God of War Ragnarok and Spider-Man 2 have typically arrived at least a year a year after their PS5 versions. In the past, Sony has indicated that it would like to be more aggressive with its PC ports. However, speaking during a Sony business segment meeting on Friday, Hol indicated that it would be it would uh continue to be conservative with its multiplatform releases in order to protect the value of the PS5 console.",
            "start": 3356.56
        },
        {
            "text": "a Sony business segment meeting on Friday, Hol indicated that it would be it would uh continue to be conservative with its multiplatform releases in order to protect the value of the PS5 console. Asked about the industry trend of companies moving towards multiplatform gaming and how Sony will protect the value of PlayStation consoles, Hol said, quote, \"You're quite right uh that we're continuously exploring new ways for players to interact with their franchises. It's important to realize that we're really thoughtful about bringing our franchises off console to reach new audiences and that we're taking a very measured and very deliberate approach in doing that. Particularly on the single player side, our tentpole titles, they're such a differentiator. He added, quote, \"The point of differentiation, I should say, for the PlayStation console is that they will showcase the performance and the quality of the hardware. So, we want to ensure that players get the exper get the best experience",
            "start": 3399.2
        },
        {
            "text": "I should say, for the PlayStation console is that they will showcase the performance and the quality of the hardware. So, we want to ensure that players get the exper get the best experience from these titles. We're very thoughtful about how and if uh and how we bring these titles to other platforms end quote. Hiyaki Nishino said the platform holder would continue to monitor players patterns and behaviors to quote ensure that we serve them appropriately. The executive was also asked about Microsoft's pivot to multiplatform releases and if he thought it was a good thing. Quote, we think that competition in the business is healthy and pushes us to innovate. he replied. There are multiple participants who together drive the overall gaming industry and while there are new engagement models being explored, we ultimately think this is a good thing. However, as I mentioned earlier, we are confident and committed to our current strategy and there isn't an urgent need for us to pivot.\" End",
            "start": 3441.04
        },
        {
            "text": "being explored, we ultimately think this is a good thing. However, as I mentioned earlier, we are confident and committed to our current strategy and there isn't an urgent need for us to pivot.\" End quote. Kind of a weird full circle here. Bless. One of my favorite things is when a rapper I love and a producer I love team up and announce we're going to put out a joint project. I mean Nas and DJ Premiere. You know it's coming up. It's going to happen. And the producer is like I'm going to produce every song on this album. And the rapper's like I'm going to rap on every song on this album. Yeah. And then magic happens. There's a vision. There's a cohesion. there is an agreement or a shared the shared vision of all of this. I like when these businesses have a vision that's clear and they're committing to and it's the it all every step they're making makes sense to go towards that. PlayStation, Xbox, two incredibly different visions at this point. Yep. I'm in support of both and I I think",
            "start": 3487.2
        },
        {
            "text": "to and it's the it all every step they're making makes sense to go towards that. PlayStation, Xbox, two incredibly different visions at this point. Yep. I'm in support of both and I I think that PlayStation should be this steadfast about we're not going to put everything everywhere. like we are valuing our PS5 because people value the PS5 and are buying it and we're going to continue to invest in that. Meanwhile, Xbox completely different and I think are busting the industry open in a very exciting way. We'll see the ramifications of everything. But I do think that having both is very very exciting where there are different ways to play that I think speak to different types of people. But also, uh, I think the majority of people that are rational, if they have the means, would be excited about all of it. Yeah. You know, like if you can play all these things and have these different experiences, cool. They're they're investing in different ways. I think this is cool. I do wish that the",
            "start": 3535.76
        },
        {
            "text": "all of it. Yeah. You know, like if you can play all these things and have these different experiences, cool. They're they're investing in different ways. I think this is cool. I do wish that the story was slightly different. I wish PlayStation was at a point cuz I do hear this and I go, \"Okay, this just means you you don't have the teams to actually day and date port to PC and have it run as well as you want it to.\" um in in order to not have all the controversy because it seems like every time a PlayStation game launches on PC, there's some [ __ ] There's some [ __ ] right? Um but and I think if that weren't the case, I think this tune would be a little bit different because I truly believe at the end of the day, PC doesn't get in the way of the console at all. Yeah. Like people buying God of War on Steam is not going to affect people buying God of War on PlayStation 5. Yeah. I think that's the one part where I'm more so lean on the I I understand why you don't want to do day and",
            "start": 3584.4
        },
        {
            "text": "God of War on Steam is not going to affect people buying God of War on PlayStation 5. Yeah. I think that's the one part where I'm more so lean on the I I understand why you don't want to do day and date from a marketing perspective. I partly because there's that double dip of oh if you launch God of War in 2018 on um on PlayStation and then we launch God of War again in 2020 on PC, you're going to get those repeated sales from that some of that same audience. But I think also at the same time, you are then incentivizing the audience to have to get a PS5 if you really care about the the the the IPs, right? like the the there's a weird spectrum of how the console manufacturers operate between I think Nintendo on the far I'll say far right um PlayStation you had the time to think about that and make a choice for us and that's what you made listen if any I'll say it I'll say it if I'm going to describe it has to be the far right let's give it to describing any of the companies as",
            "start": 3622.8
        },
        {
            "text": "that and make a choice for us and that's what you made listen if any I'll say it I'll say it if I'm going to describe it has to be the far right let's give it to describing any of the companies as conservative it's [ __ ] Nintendo Xbox doesn't give a [ __ ] Xbox is like do whatever the [ __ ] We don't give a [ __ ] anymore. And PlayStation is weirdly centrist. We're PlayStation. PlayStation is very much like let's have our cake and [ __ ] eat it too, right? Like PlayStation, they they are to some extent their IP in the same way that Nintendo all the way are their IP. I don't ever expect Mario to end up on a play on a PC. You know what I mean? I don't ever expect Zelda legally. Sorry. Yeah. legally by Nintendo's doing. I don't expect Mario or Zelda or Samus or whoever Yeah. to end up as a PC thing because once you do that, Nintendo just completely turns into a different company. I think PlayStation is in that weird place where they're socially liberal but financially conservative.",
            "start": 3671.84
        },
        {
            "text": "a PC thing because once you do that, Nintendo just completely turns into a different company. I think PlayStation is in that weird place where they're socially liberal but financially conservative. Exactly. Whereiscally conservative fiscally PlayStation's like, \"Ah, we should put our [ __ ] on PC.\" But socially they're like, \"Ah, but like we want people to still feel like they need to buy a PlayStation and so put God of War on PlayStation first and in a few years fiscally we're going to make that money back by putting it on PC.\" Yeah. End of my comparison. And that was game sailing everybody. We did. All right. Nintendo Bubs says he's out of line, but he's right. Am I wrong? Uh Tim. Yeah. We just had a lot of big business conversations. Business. Oh yeah, but if I wanted to have some small business conversation, the tiniest business conversation I could have had, where would I go? You go to our last news story, the Wii News Channel, where we cover all the small news items that you",
            "start": 3717.76
        },
        {
            "text": "business conversation, the tiniest business conversation I could have had, where would I go? You go to our last news story, the Wii News Channel, where we cover all the small news items that you need to know about. Story number five is Wii News from IGN. GameStop's being a big business. GameStop is doubling down on trading cards. Cool. Uh, quote, \"We are focusing on trading cards as a natural extension of our existing business. The trading card market, whether it's sports, Pokemon, or collectibles, is aligned with our heritage. It fits our trading model. It appeals to our core customer base, and it's deeply embedded in physical retail. Unlike software, it's tactile. Unlike hardware, it has a high margin potential. It's a logical expansion. End quote. The announcement sent stocks tumbling 22%. Devil May Cry 5 sold more than 10 million copies worldwide. [ __ ] yes. You'll love to see it. That's awesome. I I keep itching for Devil May Cry 5. Yeah. I don't know when I'm going to have the",
            "start": 3765.68
        },
        {
            "text": "22%. Devil May Cry 5 sold more than 10 million copies worldwide. [ __ ] yes. You'll love to see it. That's awesome. I I keep itching for Devil May Cry 5. Yeah. I don't know when I'm going to have the time to go back to it, but yeah, I I keep thinking about it. Oh yeah, do it. Why not? I should live a little. Nobody's stopping you. And then Peak from Agro Crab and Landfall launches June 16th on PC. And that is it for Wii news. Uh let's take one more look at super chat to see what you guys are saying. Rotating cast says, \"My Switch 2 has a stuck pixel in the center. RIP.\" Oh, man. Oh, that hurts. Oh, dude. My PSP had a stuck pixel back in the day and I It just drove me [ __ ] insane and I ended up buying like I tried to do a whole bunch of things and they were GameStop was [ __ ] me. They just were like, \"Stop. GameStop.\" Then I [ __ ] them. I bought another PSP and I switched them out. [ __ ] yeah, dude. Yeah, dude. Yeah. [ __ ] the man. The badass right there. I'm such a badass, dude.",
            "start": 3810.72
        },
        {
            "text": "were like, \"Stop. GameStop.\" Then I [ __ ] them. I bought another PSP and I switched them out. [ __ ] yeah, dude. Yeah, dude. Yeah. [ __ ] the man. The badass right there. I'm such a badass, dude. No dead pixels for this guy. I love a similar uh uh story there where I remember turning in my copy of uh Arkham City on 360 and for some reason uh the money I got back was more than the cost of the game of the year edition of Arkham City and I'd not played the DLC yet. So I went in, handed it in, and then got Arkham City game of the year edition. And even the employee was like, \"What?\" And I was like, \"Fuck, [ __ ] off. I'm out.\" Uh, Street Shadow says, \"If true, Xbox must solve library m uh migration to a PC hybrid. Either port console only games to PC or support strong emulation or legacy libraries won't carry over. That is that's the step we're at.\" Like that is the biggest thing is we got to get the Xbox OS to be able to play games. And the thing is it will never be all of them. We just",
            "start": 3862.24
        },
        {
            "text": "won't carry over. That is that's the step we're at.\" Like that is the biggest thing is we got to get the Xbox OS to be able to play games. And the thing is it will never be all of them. We just need to all accept that the third parties like they're they're not going to agree to that. They're not going to put in the work necessarily. Having said that, Xbox has invested in this and backwards compatibility for so long at this point that I do think that they have a big leg up in terms of the heavy lifting of a lot of the work. So, I do think that the majority, if not all, of Xbox titles from the past are in due time going to be on PC. Yeah. Jordan White says, \"Just got the notification that my XR1 Pros will be arriving before my trip to Italy in Paris. pairing those with my ROG Alli X are going to make these flights so much fun. Thanks, Tim. Dude, please keep me updated in your experience cuz I'm telling you, it's about to change your life. That flight is going to be unlike anything",
            "start": 3913.44
        },
        {
            "text": "going to make these flights so much fun. Thanks, Tim. Dude, please keep me updated in your experience cuz I'm telling you, it's about to change your life. That flight is going to be unlike anything you've ever experienced. Oh, yeah. Uh Joker writes in and says, \"How much debt should I expect to get into if I decide to get into Magic?\" I mean, that's up to you. I I I think I personally do a good job of mitigating like how much money I spend. Now granted I'm in a very privileged position that I get sent stuff from Riot some or not Riot sorry from uh Magic sometimes um which does do a lot but also at the same time whenever I'm buying cards I usually just buy uh the packs for like the pre-release events and I just let those be the ones that I rock with and then I play a lot of Magic Arena and I don't really spend much money on Magic Arena because you can just earn packs. And so that's how I do it. And I think if you find those things for you, those like boundaries for you of like all",
            "start": 3958.96
        },
        {
            "text": "and I don't really spend much money on Magic Arena because you can just earn packs. And so that's how I do it. And I think if you find those things for you, those like boundaries for you of like all right, this is where I'll spend, this is where I don't spend, you'll be fine. Mike Kerszer in the chat says, \"I'm like 13 minutes behind. I'm confused why Tim thinks the Xbox ally has an Xbox OS.\" It's not. It's Windows with a new front end. This is step one towards an Xbox OS. Like, I think that what they what we're seeing now is just the time and place of them not having this hardware out yet and like having everything solved because the problem is gaming on Windows is just not ideal. Steam is way better. The Xbox app on PC, it works. It is not and it's good enough. It is not where it needs to be. And I and clearly they're working on an Xbox OS. And I think that by this time next year, we're going to be in a very different conversation about an Xbox OS and what it looks like on on any of",
            "start": 3999.12
        },
        {
            "text": "be. And I and clearly they're working on an Xbox OS. And I think that by this time next year, we're going to be in a very different conversation about an Xbox OS and what it looks like on on any of these uh mobile handheld devices. Handheld devices. Yes. Um let's see. We're running late, so I got to pick and choose a little bit. Chat Samson L writes in and says, \"Top three is definitely Magic, Pokemon, and Yu-Gi-Oh. Then One Piece at four. Lorana, Digimon, and other Bandai card games are all successful, too.\" I mean, anecdotally, I that sounds about right to me. Yeah. Like Magic Pokemon and Yu-Gi-Oh. And then like, yeah, I'm surprised by how much I hear about the One Piece card game. That's one that I do want to pick up and and and try out. But let me tell you, I think Riftbound is going to it's going to enter that conversation. I don't think it's it's not going to be Magic cuz Magic has the big three. No, cuz those have had decades and decades and decades. But like in the big five, I",
            "start": 4038.0
        },
        {
            "text": "it's going to enter that conversation. I don't think it's it's not going to be Magic cuz Magic has the big three. No, cuz those have had decades and decades and decades. But like in the big five, I could see it entering the conversation. And this is me speaking as somebody who only recently got into TCGs like six months ago. So don't take my word as gospel. Um let's see here. Let's see here. Let's see here. Street Shadow. Oh no. We already read that one. Uh Snake 1987 says, \"Bless and Mike should do should start a series where you buy the newest starters or boosters for a TCG, play a few matches, then use the scale to rate them.\" I like the rating aspect of it. I've been talking to Mike for months about how do we make good TCG content cuz I think that's an ongoing issue of like what does that look like? I think even the best of the best of making TCG content still struggle with certain things, right? Like it's just tough. It's hard to make that [ __ ] entertaining for people to watch.",
            "start": 4079.28
        },
        {
            "text": "look like? I think even the best of the best of making TCG content still struggle with certain things, right? Like it's just tough. It's hard to make that [ __ ] entertaining for people to watch. Um so I'm constantly thinking about it cuz I think like kind of funny uniquely has a really good setup for if we wanted to go all in on that stuff. We could probably actually make really good content compared to a lot of other people in the space. But it is about figuring out how to make that [ __ ] fun. That's the hardest part, man. Um, and then we'll do one more from CJ Splitz in who writes in and says, \"Just wanted to shout out Herman calling out Astrobot as a smash hit and PlayStation ambassador.\" Yeah, I love seeing the graphic they put out of um like the big PlayStation games year to year kind of displaying everything. like you'll have like like this year Death Stranding 2 and Ghost of Yotay and like 20 I think 23 right was or 2022 was God of War Ragnarok and then 2020 after that was",
            "start": 4124.8
        },
        {
            "text": "kind of displaying everything. like you'll have like like this year Death Stranding 2 and Ghost of Yotay and like 20 I think 23 right was or 2022 was God of War Ragnarok and then 2020 after that was Spider-Man. Uh but then last year 2024 was Astrobot just like in that prime space and I was like [ __ ] yeah let's go. Yeah, dude. I love I love them saying that it is, you know, I I'm happy to hear that they're calling it a smash hit, but like we I the sales though. Mhm. Like they're not talking about sales and last we know it's 2.3 million copies at $60. Yeah. I would hope that the margins for the amount of time and the amount of budget you put into making an Astro team of Soie justifies I really hope and they're saying that put your money where your mouth is, PlayStation. Give me more. Yeah. More ideas like that. We're gonna get more. We're going to get more. I believe it. Just like I believe going to kind of funny.com/sher wrong where you can write in. Let us know what we got wrong as",
            "start": 4165.52
        },
        {
            "text": "More ideas like that. We're gonna get more. We're going to get more. I believe it. Just like I believe going to kind of funny.com/sher wrong where you can write in. Let us know what we got wrong as we got it wrong so we can correct it for those watching later on YouTube and listening later on podcast services around the globe. Globe globe. Here's the thing. Phil Shu writes in and says Marvel Rivals wasn't even out when Concord was failing. I know that. I still use it as an example just to replace Marvel Rivals with whatever other freeto-play shooter exists. Marvel Rivals was heavily in beta though. like me, Mike, and like I a lot of the community were playing Marvel Rivals around the time of Concord. And I think that does inform how people receive it, even though it wasn't officially out. Um, but yes, Marvel Rivals wasn't all the way up when Concord was all the way up. All the way up. Um, let's see here. Somebody says Marathon delayed according to IGN, but this seems like, let's see.",
            "start": 4209.12
        },
        {
            "text": "Um, but yes, Marvel Rivals wasn't all the way up when Concord was all the way up. All the way up. Um, let's see here. Somebody says Marathon delayed according to IGN, but this seems like, let's see. Let's see. Let's see. Sony admits Marathon feedback. This seems like a new article. Hold on. We might have to I might have to read this after this and see if this is worth if this is KFGD worthy. The headline from IG I'm looking at is Sony admits marathon feedback has been varied but insists it will avoid repeating Concord mistakes and commits to launch by end of March 2026. Oh, fun. So, yeah, snuck that into this. Yeah, these interviews. Snuck that snuck that in. So, we're going to copy that. We're going to paste it into the KFD Slack channel. All right. We're going to talk about that in a future show. Thank you for Thank you so much for that. Um, and that's it. That's it. I think the rest of this is editorializing. So, we're gonna get rid of that and we're gonna end the show cuz Tim Mhm.",
            "start": 4245.36
        },
        {
            "text": "show. Thank you for Thank you so much for that. Um, and that's it. That's it. I think the rest of this is editorializing. So, we're gonna get rid of that and we're gonna end the show cuz Tim Mhm. It's been KFC. It's been another episode. It's Friday. What you doing this weekend? I have to go to a wedding. His friends weddings. Is it in town or are you traveling? It is in town. Thank god. And I like this friend. You know what I mean? That's not always true. It's not always the case. Listen, I know that's right. Have fun this weekend, Tim. Of course. This has been kind of funny games daily. Each and every weekday we run you through the nerdy news you need to know about live on YouTube, Twitch, and on podcast services around the globe. If you love what we do, support us with the kind of funny membership on Patreon or YouTube to get all of our shows ad free. Watch us record them live and get a daily exclusive show. Enjoy the games cast next and the stream after. But until next time, game",
            "start": 4294.64
        },
        {
            "text": "membership on Patreon or YouTube to get all of our shows ad free. Watch us record them live and get a daily exclusive show. Enjoy the games cast next and the stream after. But until next time, game daily. [Music]",
            "start": 4333.68
        }
    ]
}