{
    "id": 14337,
    "video_id": "cIifhy-K3a8",
    "show_name": "Highlights",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Andy Cortez",
        "Mike Howard"
    ],
    "title": "Mike LOVES Elden Ring Nightreign",
    "description": "From Gamescast: https://www.youtube.com/watch?v=WdgPytbRYFM&pp=ygURa2luZGEgZnVubnkgZ2FtZXM%3D\n\nDownload Cash App Today: https://capl.onelink.me/vFut/7u0sm0fp #CashAppPod Sign up with our exclusive referral code KINDAFUNNY in your profile. Send $5 to a friend within 14 days, and you’ll get $10 dropped right into your account. Terms apply.\n *Referral Reward Disclaimer: As a Cash App partner, I may earn a commission when you sign up for a Cash App account.* #sponsored\nGo to https://mood.com and use code KINDAFUNNY to get 20% off your first order.\n\nFOLLOW US ON EVERYWHERE!\n---------------------------------------------------  \nYouTube: Youtube.com/KindaFunnyGames\nTwitch: https://www.twitch.tv/kindafunnygames\nPatreon: https://www.patreon.com/kindafunny/\nTwitter: https://twitter.com/KindaFunnyVids\nInstagram: https://www.instagram.com/kindafunnyvids/\nTikTok:  https://www.tiktok.com/@kindafunnygames?lang=en",
    "published_at": 1750801419,
    "duration": 835,
    "transcript_chunks": [
        {
            "text": "Mike.\n Yeah. Me and Andy beat Elden Ring Night Reign. And we're gonna talk all about it. But before I do, we got to bring up a big crime that's been committed this last generation of video games.\n Make fun of Barrett.\n And that's Nintendo Switch and Marvel Ultimate Alliance 3, Greg. Being trapped on that system. That's [ __ ] up that we can't play that everywhere. I\n agree. I better play that again.\n That game rocks. But that this game will scratch my itch, though. So, good enough. Okay, I'll take it.\n What about Andy? Let's talk about Elen Ring Night Rain. Of course, it is an from software experience made exclusively for me, the only jabron who loves multiplayer games mixed with battle royale, closing circles, and uh sprinkle in a little from software magic. This is a game that I love to death. It will probably go down as one of my top favorites in the uh the company's franchise list here.\n Yeah. I mean, you're you were saying this is probably going to be your number one of the year.",
            "start": 0.16
        },
        {
            "text": "Yeah. I mean, you're you were saying this is probably going to be your number one of the year.\n Yeah, really enjoyed it.\n Th this will go down as my favorite. is everything that I want out of a from soft experience. Uh being able to share it with my friends. Most importantly, having it being very fast and not have it, hey, let's slow down. Let's read these stats. Let me guess. If I put 50 into health, how much more will my health bar go up? It's just simply, hey, drop your runes off here at this sight of grace. Let's level up. Let's move on to the next awesome piece of action. And so it's this blend of highpaced action, extreme difficulty with from software game design, and then on top of that, of course, my favorite is the map exploration. I am always wowed and impressed by all the cool scenes that we see, all the different bosses that they mix in to the different locations and having what, Andy, 10 bosses. How many do they have? Eight to 10.\n Uh they have eight unique bosses.",
            "start": 46.56
        },
        {
            "text": "Uh they have eight unique bosses.\n Yes, eight unique bosses. And then each one of those bosses has a just splattering of different uh amounts of bosses that you can fight before them, too.",
            "start": 100.0
        },
        {
            "text": "Yeah. A bunch of different Elder Ring enemies. And you know, we reviewed this already in a way that was kind of like, yeah, we played it uh we were doing our best. It was a weird review period because this I think this game is very much a your mileage may vary. Whenever anybody asks, should I play this? I have no friends to play with. I would say no, probably because it's the same thing as signing on to play signing on alone to play squads in Fortnite. When two teammates immediat immediately run opposite directions, you're like, \"Oh, [ __ ] This is why am I even here right now?\" And that can happen quite a bit in the Elder Ring Night Reign experience based on just reading a whole lot of tweets. I know the first couple days in there they were having a lot of matchmaking issues and it took a while for the game to kind of get its rating up above mostly negative or mixed on on Steam because a lot of people were having issues with networking and just with what the game was and then they",
            "start": 112.24
        },
        {
            "text": "a while for the game to kind of get its rating up above mostly negative or mixed on on Steam because a lot of people were having issues with networking and just with what the game was and then they made playing solo a bit easier.",
            "start": 157.76
        },
        {
            "text": "Is it fun, Andy? People want to know, is solo fun? Uh, I I think solo is much better and easier to deal with now because they gave you a free res. So whenever you do go down, you can just kind of come back during a boss fight. And uh I I mean I I my opinion of this game has only gone up. I think the game really really surprised me with how much deeper it was. I thought it was it really just felt like wow this is a like one of the best mods you could download on the internet and you know they it's cool what they've done here they just want to this was just one of the teams on from software saying I really want to make a kind of rogike fast-paced multiplayer experience and you know we look at this as hopefully their testing grounds for their future in multiplayer and making things easier to squat up with friends but I would say that my op yeah yeah my opinion this only went up cuz I think when the game came out I was like yeah I think it's around an eight out of 10. I' I'd go up to",
            "start": 174.24
        },
        {
            "text": "to squat up with friends but I would say that my op yeah yeah my opinion this only went up cuz I think when the game came out I was like yeah I think it's around an eight out of 10. I' I'd go up to like a nine. I I think that um the explorable areas with how the world does change with these shifting lands and how much adventure we found where once you beat a boss then the next time you drop into the world there will be a massive part of the map that is different and changed and exploring that was so much fun. um trying to find the balance of we're running out of time, but I really really want to explore this. Having those sort of mini metagame excursions where you go, I mean, Mike, it felt like every round we were going, \"Oh, we got to go take on that rooftop boss cuz it was so challenging. I think we could take it on now.\" You got Loretta, the run killer. Like, there's just so many awesome moments in this game that are fun as hell. And the ability to I I think having that RNG is also",
            "start": 224.56
        },
        {
            "text": "I think we could take it on now.\" You got Loretta, the run killer. Like, there's just so many awesome moments in this game that are fun as hell. And the ability to I I think having that RNG is also a lot of really fun. Like I I know some people can look at RNG as something that can just kind of get in the way, but whenever random number generator, that's what it means. So I hate saying RNG and some people just don't even know what that means. Um but the the RNG of sometimes having a run and then suddenly the build is working out and you go, \"Oh [ __ ] this is going to be a special one.\" It it just gets really exciting. And then us beating the bosses and having people from Chad join us. It was a good time. I had a I had a lot of fun with it. Yeah. Mike, what are you prepared to give it a kind of funny score?",
            "start": 273.6
        },
        {
            "text": "On the kind of funny scale, I would give this uh an 8.5 out of 10 on the kind of funny scale. It is great to amazing. It is an absolute blast to play. This is, like I said, a game that is strictly for me. And I think there are others that probably found a lot of fun with their friends doing this, but as someone who's always wanted to share the Dark Souls experience with others and then having that turned up to 10 where there is a giant map, there is a closing circle and it is, hey, we can't stand around at the sight of grace and discuss what move sets we should get. we just need to go go and have that all mixed in so well where yeah there is a little bit of thought process right Andy of like what are my passives on all these weapons that I grab what is that next thing that I should be looking for whether it be a buff uh to maybe help some of my moves or is it something that will affect the boss in a different way different like poisons holy damage what should we be kind of gearing",
            "start": 319.76
        },
        {
            "text": "looking for whether it be a buff uh to maybe help some of my moves or is it something that will affect the boss in a different way different like poisons holy damage what should we be kind of gearing towards so there is a little bit of thought process to that it's not mindless just run around and constantly attack you do have to be kind of mindful of what you're thinking you should be building towards. But I love the just fast-paced nature of this. I think the bosses are really tuned well for a threeplayer situation. Each boss felt like they were coming after every single person on the screen no matter what. There wasn't much free time. The only time I ever felt like I was uh free to just kind of be quiet and easy was when I had a weapon that said, \"Hey, the boss will rarely look at you.\" Right? And so I think they did a great job tuning these these eight bosses to, hey, three players are on the screen and they really know how to attack you. I think in other soft games, they're not",
            "start": 366.32
        },
        {
            "text": "Right? And so I think they did a great job tuning these these eight bosses to, hey, three players are on the screen and they really know how to attack you. I think in other soft games, they're not really tuned to have two or three other people on the screen with you. It is usually a one v one fight. And so to see them say, \"Hey, this is the core of the game. Let's build these bosses out like that.\" Every single one was so much fun to see from, of course, the beginning when the wolf turns into three wolves and all of you are getting attacked one by one. I think that's really cool to the final boss where he can just, you know, close the gap and create space so quickly on you that you're never really safe no matter how far away you are. I think each of the character classes are really built out in a fun way for you to try and be something different than you normally would be. I'm usually a sorcerer and even the sorcerer in this class is different than how I would play, right? Because",
            "start": 408.08
        },
        {
            "text": "out in a fun way for you to try and be something different than you normally would be. I'm usually a sorcerer and even the sorcerer in this class is different than how I would play, right? Because there is no mana flasks here. you have to kind of play that a little bit differently how you get your FP back to use magic spells. And so each one from the super tank berserker guy to of course the guardian eagle who is kind of the the big shield man uh all have their own unique stuff. And I think that's what will get me coming back. Tim is there's things that I want now in the future now that I've beaten it that I want to see. But really I can jump back tomorrow because I have what six other characters to play, five other characters to go check out.",
            "start": 451.04
        },
        {
            "text": "A lot of other characters. This episode's brought to you by Cash App. We've all had those moments getting meals out with people that always end in some kind of awkward experience of having to figure out the least complicated way to just get it done. Or even after figuring it out, have you used an app and ended up having to wait days for your money to finally show up? What if we could solve all of that easily? Cash App is a completely different experience. Fast, easy, and safe, and a great way to receive and transfer money to family and friends. It's incredibly easy to set up. You just enter your phone or email and some other basic information. No bank account needed. And then there's no waiting around for days. It's your money. You shouldn't have to wait. We love using Cash App because it's fast, it's safe, and it just makes life way less stressful. For a limited time only, new Cash App users can use our exclusive code to earn some additional cash. For real, there's no catch. Just",
            "start": 488.88
        },
        {
            "text": "it's fast, it's safe, and it just makes life way less stressful. For a limited time only, new Cash App users can use our exclusive code to earn some additional cash. For real, there's no catch. Just download Cash App and sign up. Use our exclusive referral code, kind of funny, in your profile. Send $5 to a friend within 14 days and you'll get $10 dropped right into your account. Terms apply. That's money. That's Cash App. This episode is brought to you by Mood. Let me tell you about the online cannabis company that's revolutionizing how we deal with life's challenges. From sleepless nights to stressfilled days, mood.com has created an entire line of functional gummies that target specific health concerns with 100% federally legal THC blends. They'll deliver them discreetly right to your doorstep and you can get 20% off your first order at mood.com with promo code kind of funny. I've been having a great time trying out all their different gummies and I'm loving how each one feels.",
            "start": 530.32
        },
        {
            "text": "doorstep and you can get 20% off your first order at mood.com with promo code kind of funny. I've been having a great time trying out all their different gummies and I'm loving how each one feels. Their sleepy time gummies will knock you out in about 15 minutes flat. No hangovers, no groggginess, and their epic euphoria gummies are perfect for those days when nothing's going right. And best of all, not only does Mood stand behind everything with an industry-leading 100-day satisfaction guarantee, but as I mentioned, listeners get 20% off their first order with code kind of funny. So, head to mood.com, browse their amazing selection of functional gummies and find the perfect gummy for whatever you are dealing with. And remember to use promo code kind of funny at checkout to save 20% on your first order. And in the last in the last week, they kind of just out of nowhere dropped an enhanced version of one of the bosses. And they were like, \"This is the extra hard version of it for people",
            "start": 575.2
        },
        {
            "text": "first order. And in the last in the last week, they kind of just out of nowhere dropped an enhanced version of one of the bosses. And they were like, \"This is the extra hard version of it for people that want the extra challenge.\" And it's not just we gave it a bigger health bar and it does more damage. It has new move sets and new completely new mechanics uh that it does in in the second it starts off in its second phase. So, when one of these bosses kicks up at second phase, you go, \"Oh [ __ ] the purple lightning is going to start happening.\" The boss starts off in that phase and then suddenly, I don't know if you saw any of the footage of this, Mike, but there are those wind currents that shoot you up, you know, like the um Blessing calls them, the trampolines, but this boss creates like a gigantic purple tornado, and you have to jump into the tornado. Like, it's it's wild what they're doing. And then now this dude uh who is one of the more annoying bosses to deal with uh the big",
            "start": 618.72
        },
        {
            "text": "a gigantic purple tornado, and you have to jump into the tornado. Like, it's it's wild what they're doing. And then now this dude uh who is one of the more annoying bosses to deal with uh the big sort of man horse man",
            "start": 666.56
        },
        {
            "text": "centaur guy uh there's they are releasing the enhanced version of him in the next couple of days as well. It's just really cool what they're doing to keep players in while this next big DLC will happen. And this next big DLC should be awesome whenever that does happen. Another wild one from software again. Drop se no microtransactions. It's just all in the game, right? Like that was the one when we talked about it's like they could make millions of dollars selling skins if they wanted to, right? They have a rabid fan base that is all in on this. They could have easily been like, \"Hey, we got a bunch of these skins, five bucks a pop, and people would have gone crazy, right? But they stuck what they normally do of, hey, we're not charging you anything. You just play the game and have fun.\" And it's wild to be sitting on that end of it, looking back and going, \"Man, they didn't charge me a dime for any of this. I had a blast with just the upfront cost and I'm loving every moment of it.\"",
            "start": 679.36
        },
        {
            "text": "Yeah.\n Uh, closing out the Elen Ring talk here. Uh, Sha Slay Super Chat's insane. Did you platinum it? It took me forever to get three wins trophy. Andy, I know you're not a trophy guy and you're on PC, but are you interested in doing all the achievements?\n Uh, there's too many other things to play. No. Like, I've I've never been that dude. At one point we were close to getting the three wins in a row, the turkey, and uh we got our ass me, Mike, and I forget who we were with got our asses handed to us. So it was like, \"All right, well that's gone.\" And I'm not\n We're never doing that again. We're not going to do that.",
            "start": 731.2
        },
        {
            "text": "We're never doing that again. We're not going to do that.\n Yeah. I'm not like super pumped or excited. Yeah. Uh this game is great. Go play with your friends. It's a ton of fun. I can't wait to see the future of this. How they incorporate new bosses. How do they add other bosses from the games to be kind of the minor bosses? Will we see a switch up of the map anytime? What are the new added things like Andy brought up with just changing up the world in just a small slight way? There's\n and the little side quest",
            "start": 761.76
        },
        {
            "text": "and the little side quest\n big future to this. There's a lot more to this game than I thought that there would be. Not that I should be giving them credit for making a you know a full developed game. I just I expected, you know, I I think the negative part of me looked at this as like, oh, multiplayer cash grab. And there was a lot more in here than I thought there would be when it comes to different characters having their own mission structures and and conversations that they're having with other people and like getting lore bits about all of these different people about why they're here. Uh, really, really damn cool. Awesome game.\n Can't wait. Greg Miller has beat Death Stranding 2 and he's prepared to give his final score. But we're going to hear that after a word from our sponsors. Wow.",
            "start": 785.68
        }
    ]
}