{
    "id": 14201,
    "video_id": "dE_yMb2eAqQ",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Andy Cortez",
        "Blessing Adeoye Jr."
    ],
    "title": "Summer Game Fest 2025 Kinda Funny LIVE REACTIONS",
    "description": "Go to http://kindafunny.com/XREAL to grab yours now!\n\nTime Stamps:\n00:00:00 - Pre-Show\n00:23:00 - Summer Game Fest Start\n00:26:47 - First World Premiere\n00:29:17 - Fortnite x Star Wars\n00:30:31 - Kojima & DS2\n00:36:39 - 2nd World Premiere\n00:39:15 - Sonic: Crossworlds\n00:42:25 - 3rd World Premiere\n00:44:54 - 4th World Premiere\n00:46:26 - Mouse P.I.\n00:47:24 - 5th World Premiere\n00:49:58 - 6th World Premiere\n00:52:53 - 7th World Premiere\n00:54:50 - Marvel Cosmic Invasion\n00:56:00 - Onimusha\n00:57:51 - 8th World Premiere\n00:59:55 - 9th World Premiere\n01:01:44 - ARC Raiders\n01:03:59 - Dune: Awakening\n01:07:10 - Chrono Odyssey\n01:08:35 - Wuthering Waves\n01:09:40 - Mio\n01:10:20 - Out of Words\n01:11:30 - Mafia: The Old Country\n01:13:20 - LEGO Voyagers\n01:15:03 - 10th World Premiere\n01:16:37 - Lies of P: Overture \n01:18:40 - 11th World Premiere\n01:20:23 - Blade & Soul\n01:22:33 - The Seven Deadly Sins Origins\n01:24:10 - Ads? Idk, this segment around here was bad\n01:26:11 - 12th World Premiere\n01:27:52 - 13th World Premiere\n01:30:22 - Dying Light: The Beast\n01:32:36 - Mixtape\n01:34:31 - 14th World Premiere\n01:36:15 - Acts of Blood\n01:38:13 - 15th World Premiere\n01:39:59 - Maggie Robertson & Ads\n01:43:57 - 16th World Premiere\n01:48:45 - 17th World Premiere\n01:50:18 - Wildgate\n01:51:57 - 18th World Premiere\n01:53:36 - 19th World Premiere\n01:55:34 - Mecha Break\n01:58:05 - 20th World Premiere\n01:59:42 - 21st Wor…Nevermind\n02:01:20 - 21st World Premiere\n02:02:32 - 22nd World Premiere\n02:04:43 - Wuchang Fallen Feathers\n02:06:14 - 23RD WORLD PREMIERE\n02:07:38 - Some Ads\n02:10:05 - 24th World Premiere\n02:11:52 - Splitgate 2\n02:14:26 - 25th World Premiere\n02:16:56 - The Final World Premiere\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1749251340,
    "duration": 8607,
    "transcript_chunks": [
        {
            "text": "We're 23 moments away from 2025 Summer GameFest event. Are they still calling it kickoff? No. No, just Summer Game Fest. It's just Summer GameFest. Just Summer GameFest. Okay. I don't know. I'm just saying words. No, you don't. You just misinformation moments. Yeah, we were going to I was I was moment could be a minute. It works. I'm going to let him have it. I was going to let him go, too. But guys, I'm all gone. They're fine. Own it. I I am owning it. And here's the thing. There will be 23 moments that happen. 123 moment. How do you measure measure a pre-show in huggies in kisses? Um, dude, my brain is is a different level of mush than it's been in a long time. These last couple days have just been so intense that I'm like, every show I'm on feels like a fever dream and I'm like, I don't know what's going to come out of my mouth and I hope it's okay, you know? It's just I'm not worried about getting in trouble or anything, but I am worried about it just making sense. Yeah, sure.",
            "start": 5.84
        },
        {
            "text": "know what's going to come out of my mouth and I hope it's okay, you know? It's just I'm not worried about getting in trouble or anything, but I am worried about it just making sense. Yeah, sure. Yeah. Yeah. Is any of this like, you know, can you listen to this and form a thought? Exactly. Exactly. I remember a couple days ago when I said I I don't even remember exactly what I said, but I was like, my thoughts aren't my thoughts. Yeah, you did say that. I said something like that. out. I was so tired last night. Yeah, I fell asleep in the chair with Ben. Like, I had a headache all day long. It's just And again, I was like, \"This isn't even the halfway point. There's so much E3, SGF, whatever you want to call it now, season of gaming. I mean, technically SGF's just starting now. The only conference we've done is PlayStation. That's State of Play.\" Uh, that's a pre SGF thing. But, yeah, it was wild. Last night, I was playing uh uh Mario Kart World and I had to push through cuz I'm like I",
            "start": 59.36
        },
        {
            "text": "we've done is PlayStation. That's State of Play.\" Uh, that's a pre SGF thing. But, yeah, it was wild. Last night, I was playing uh uh Mario Kart World and I had to push through cuz I'm like I slept so poorly the night before. I was like, I need to at least get to like 10:30 to fall asleep or else it's just going to ruin where I'm at now. And I'm just sitting there like dozing off like playing cart. I'm like, man, this is the life. This is the damn life of it. Blessing. How are you? I'm doing well. Good. How are you? I'm I'm great. That's good. Yeah. A little weird. Greg, how are you? I'm great. I'm good. I still need time. It's still my time. I'm great. I'm good. Oh, it's Andy. It's It's Greg's time. What is up with this chair, by the way? Does anyone else ever sit in this chair? Is that the one that slows down? Nice little bounce. No, I mean it goes way back. It feels like I'm about one Greg reaction away from going. I wonder if that's the chair that we we found a screw the other",
            "start": 96.32
        },
        {
            "text": "the one that slows down? Nice little bounce. No, I mean it goes way back. It feels like I'm about one Greg reaction away from going. I wonder if that's the chair that we we found a screw the other day. I wonder if uh they aren't recliners and I'm reclining right now. That's the screw that came loose from Tim's head. Jubilee's got it. It's been fun though. You know what I mean? I don't Old Tim can die. This is the new Tim. This Tim's here now. You guys just need to deal with it. Greg up. You could watch too. Same energy. Uh, Andy, how are you? I'm all right. I'm all right. Just all right. Good pizza. Great pizza. Good pizza day. Yeah, good cookie out there. Oh, I didn't have it. Yeah, Blessing only ate a cookie. Yeah. So, we'll move for him. And I don't understand. Are Joey. Are we just are Toto just giving away cookies now because we order so many pizzas or do are we ordering cookies on top of everything? I have a theory. Somebody probably was like, \"The cookies are really good. Next",
            "start": 137.52
        },
        {
            "text": "Toto just giving away cookies now because we order so many pizzas or do are we ordering cookies on top of everything? I have a theory. Somebody probably was like, \"The cookies are really good. Next time we need to make sure to buy a bunch of cookies.\" Yeah. Um, who would have said what? Did you say that? I don't know. Wasn't me. You said that like you said that. It wasn't me, though. Was it somebody you I want you to guess? Uh, Kevin. That was probably It's always Kevin. Oh, yeah. I was going to guess. Cool. Greg. I don't know. But I I want to try the Are the cookies good? The cookies are really good. Cookie. Cookie was really, really good. Yeah. We didn't eat the pickles. A never too late. Pickles. There's pickles out there. At some point. I'm eating the pickles. I had a lot of pizza. I was doing the show with you yesterday. You have two and a half hours left to react and then an hour plus games cast after that. You're going to have time to eat a pickle. Wait, that's the show's that",
            "start": 182.12
        },
        {
            "text": "was doing the show with you yesterday. You have two and a half hours left to react and then an hour plus games cast after that. You're going to have time to eat a pickle. Wait, that's the show's that long, I think. So, yeah, two hours. I saw Dustin tweet yesterday or some show four hours and I didn't No, that's not real. That's not real. I hope not. I'm going to have to go to the airport in the middle if that's the case. I'm going to text Lucy and be like, wrap it up. That's enough. Bless, can you bring me the pickle? Thank you. I'm excited for this. I want to touch action pickles. Yeah. Uh, everyone, you can super chat in. Let us know what you want to see, what you think we'll see, what you don't think we'll see. What are your predictions? I already saw a couple. I already saw somebody mentioning a super chat about Kingdom Hearts 4. Did you That's Adam two times who says on route home trying to catch the start with y'all. Come on. Kingdom Hearts 4 L M AO. Never going to happen.",
            "start": 226.64
        },
        {
            "text": "mentioning a super chat about Kingdom Hearts 4. Did you That's Adam two times who says on route home trying to catch the start with y'all. Come on. Kingdom Hearts 4 L M AO. Never going to happen. Start. I would say never, but it's unlikely. I'm at a 6%. Oh, for Kingdom Hearts 4 being here. Okay, I'll go 12. Okay, I appreciate that. Again, I think I'm in a very I'm You know what I mean? You're in a You heard this a lot growing up. I'm going to throw it out here. Please do. This is a fertile crescent for me right now. All right. You never heard this a lot. Is this something you learned with Ben? No, this is something from school about, you know, how like you know when the it was like what the river valleys were always fertile, the fertile crescent. No, fertile crescent was It doesn't matter. It's somebody chat, let me know. This is a fertile crescent right now where I'm so distracted by everything else that I have no expectations for this show. So, all Jeff has to come out here and do",
            "start": 269.92
        },
        {
            "text": "It's somebody chat, let me know. This is a fertile crescent right now where I'm so distracted by everything else that I have no expectations for this show. So, all Jeff has to come out here and do is show me a cool couple games, announce an infamous remaster, and we're off to the races. Oh, if he comes out with sleeves, I'm going to be disappointed. Oh, wow. He's going to have sleeves. Mesopotamia. Imagine. Oh, right. I haven't heard Mesopotamia in at least 35 years. When you were a kid, though, you're like, I got to love this [ __ ] like I want to be quizzed on this when I'm trying to apply for a job at a at an office. Then they were like, should we teach them how, you know, what makes up England with the whole Scottish thing and everything else? They're like, \"No, we don't need to teach them that. Teach me.\" Zero Cool TV says, \"Halo Master Chief Collection get announced uh with Summer GameFest or Xbox Showcase.\" It's interesting. We talked about this a bit in our predictions, but I",
            "start": 312.96
        },
        {
            "text": "them that. Teach me.\" Zero Cool TV says, \"Halo Master Chief Collection get announced uh with Summer GameFest or Xbox Showcase.\" It's interesting. We talked about this a bit in our predictions, but I think that if a Halo 1 remake is, thank you so much, is real, then um I'll tell you to get right back up. Don't you have to get like scissors for that? Is there a tear hole in that? You got a tear hole. I apologize. Got a tear hole. Um, if Master Halo 1's being remade, I think that'll be an Xbox thing and then Master Chief Collection will be like alongside it. But if it's just Master Chief Collection being ported to PlayStation 5 and X and uh Switch 2 as is, one or the other or both, whatever. Um, I think that'll be Summer GameFest. Do you want to run through some of the predictions that we No, I want to run through somebody. I don't have record of them, so I don't know. Oh, I thought he was embarrassed or something. I think I was trying to hide something. Well, more importantly than eat",
            "start": 351.52
        },
        {
            "text": "I want to run through somebody. I don't have record of them, so I don't know. Oh, I thought he was embarrassed or something. I think I was trying to hide something. Well, more importantly than eat the pickle. You don't know the pickle. Wait, hold on. Does that say zero calories? It's a cucumber. Yeah, with salt. Cucumber first. I never thought about that. Sword by first name. I'd love to see some dispatch on this show. Oh man, I would love to see that. You know what we will see? Mouse PI. They tweeted the black and white first person. Yeah, they put out some new art yesterday and they said like, \"See you tomorrow or something like out. So, I think we have the release date. That's exciting. This patch has skyrocketed to one of my most anticipated games of the year for the rest of the year. Uh, it still only has a 2025 as a release window, and that was one that got announced at the Game Awards last year, and so I think it makes sense to expect it to show up here with an actual release",
            "start": 393.56
        },
        {
            "text": "Uh, it still only has a 2025 as a release window, and that was one that got announced at the Game Awards last year, and so I think it makes sense to expect it to show up here with an actual release date. Uh, I talked to Greg about this on an earlier show, but like I got to check out or I didn't get to check out I played the demo that's available to everybody. Has anybody else played the demo for Dispatch? No, I had so much going on. I totally did not realize that that game had like big management sim elements to it. I thought it was going to be more of a straightforward tailtale choose your own adventure game. And when you play the demo, like you get the cinematic, here's the setup here. You're a hero that's not heroing anymore. And so now you're working at a dispatch call center that sends out heroes. And then very quickly they put you into like the gameplay which is you on a screen sending heroes out to different locations based off of like what their needs are and did not realize",
            "start": 435.6
        },
        {
            "text": "out heroes. And then very quickly they put you into like the gameplay which is you on a screen sending heroes out to different locations based off of like what their needs are and did not realize that that's what the game was. And after I played the demo I was like that that was actually really fun. Hell yeah. Yeah. It's a really cool game. So now I'm really excited for it. Liza P DLC baby. Shadow drop. Shadow drop. Bam. Final prediction. And is it a shadow drop or a date? I think it's a date. Do I want it to be a child job? Absolutely. But I think it'll just be a date. And I'm going to guess August 20 something. Whatever lines up best with the weekday. I like that. I like that. Late August. Uh Dante the clerk says, \"I would like to see Metal Gear Solid collection volume 2. Free Metal Gear Solid for from PC. Nintendo can make my day by announcing Metal Gear Solid Twin Snakes for Switch 2 Gamecube.\" Dude, I would [ __ ] punch through the goddamn wall if they say Twin Snakes is on",
            "start": 470.88
        },
        {
            "text": "Gear Solid for from PC. Nintendo can make my day by announcing Metal Gear Solid Twin Snakes for Switch 2 Gamecube.\" Dude, I would [ __ ] punch through the goddamn wall if they say Twin Snakes is on there. Obviously, I like the collection, too. I'd be down for the collection. But to be able to play Twin Snakes modernly, I allegedly started it up on my Retroid. [ __ ] yeah. If they do that, if they put Twin Snakes out, Twin Snakes, if they put it out, I will on camera order another Gamecube controller for myself. Good. Fix your sins, everybody. But show your credit card for all of us. Sure. Sir Yogi says, \"Uh, something new from Valve, Steam OS, uh, PC Index or Halfife 3.\" I think that there's a high probability that something from Steam from Valve is here. Not a guarantee, but I think it's likely. Roger Roger was raising the hype on this. Yeah. Apparently, who who was he talking about this with when we were out there? Not me. Apparently, uh there's a tracker on uh Gabe New's yacht. Oh,",
            "start": 517.92
        },
        {
            "text": "likely. Roger Roger was raising the hype on this. Yeah. Apparently, who who was he talking about this with when we were out there? Not me. Apparently, uh there's a tracker on uh Gabe New's yacht. Oh, and the yacht uh is moving down. It's moving down. It was spotted near San Francisco at some point. This is another level of just fans being [ __ ] going too far. Going too far. Just being hungry for a yacht. The yacht is getting down there. It might already be there. I didn't get the update. Roger, if you're listening, please update us on Gabe New's yacht. What do they call it? Copium. Mhm. Yeah, it's another level. Yeah, but again, bless where there's smokes. Get it together. That's not even the smokes. It's just on a Well, no. No, but there was smokes and now there's a yacht. Fair enough. They're going to hit us with the with the fake out. We're going to see the Valve logo. Bruno man says, \"I believe the tracker went dark.\" Oh [ __ ] they saw people tracking them. We're going to see",
            "start": 561.12
        },
        {
            "text": "They're going to hit us with the with the fake out. We're going to see the Valve logo. Bruno man says, \"I believe the tracker went dark.\" Oh [ __ ] they saw people tracking them. We're going to see the Valve logo. Everybody's going to get all horny. It's going to be Deadlock. Everybody's going to go, \"Ah, [ __ ] guys.\" Okay. Well, it's the first time they showed it. That's kind of neat. And that's not it. We have first reveal of Deadlocked. And that's not it we have from Valve. We have one more thing. Halfife 3. Wow. Mhm. Wow. Book it. I'm saying everybody book it. Jubilee says it. Yep. Rogers. Here comes Rogers out here with the yacht report. Yacht needs [ __ ] Norat over here tracking Santa. Uh it went dark about two hours ago. Uh, it is going down towards LA, so it might be already there. So, Gabe Newle might be in the middle. It might be there. We'll keep you on the We all joke, but it will be insane if it's not. This is like the submarine tracking like it went signal went dark.",
            "start": 604.96
        },
        {
            "text": "So, Gabe Newle might be in the middle. It might be there. We'll keep you on the We all joke, but it will be insane if it's not. This is like the submarine tracking like it went signal went dark. Weren't we tracking somebody's like flights or yachts? Elon, that was a big Taylor Swift. Taylor Swift. Okay, that's what I thought it was. Yeah. And carbon footprints and [ __ ] Yacht Club. They're probably going to be here. Gabe Newell on a yacht. Coincidence. Yeah. Mean of the holler. I mean that shadow drop or do you want what are you going to do with that? No, give that one a real date. You know you'll get a real day for that and I mean this my one of my games guys predictions. Meet me the hollower and you'll get a first look at Shovel Knight 3D. I hope you're right. Bring in Shovel Knight to a new dimension in quotes is what they said. It's a text second person shooter. Uh Galaxy Lord says Tim's MI is going to run on stage. If anyone sees him, please let me know. So, I missed the actual",
            "start": 647.52
        },
        {
            "text": "a new dimension in quotes is what they said. It's a text second person shooter. Uh Galaxy Lord says Tim's MI is going to run on stage. If anyone sees him, please let me know. So, I missed the actual start of this, but the idea is that when you went in your profile there, it's like creator edited me and there's nothing there. Is that my Mi that I've had since 2006 is gone? How did you carry your Mi from 2006? I don't know. Like you transferred it from the Wii to the Wii. My icon is still my Mi for my online thing. But when I was But it's just your picture. Yeah. So, a picture of him still exists. Exactly. When I was tinkering around in my profile, I saw it there where it was like create a me. I'm like, I should have one. But NFT, but I was also like I don't care. I don't know what we're using these people for anymore. Yeah. Aar 124 super chat says, \"Love watching these with my kind of funny crew and kind of funny best friends. We love being here for you, Aar.\" Thank you. Somebody in my",
            "start": 688.96
        },
        {
            "text": "these people for anymore. Yeah. Aar 124 super chat says, \"Love watching these with my kind of funny crew and kind of funny best friends. We love being here for you, Aar.\" Thank you. Somebody in my Twitter reply said, \"Tim's me is likely on his Wii U.\" Does that not transfer over? Did it not go to my Switch? I feel like he was hanging out on the Switch for the last couple years, but I don't know. I have my Wii U. I can rescue him if that's hanging out. Like, what do you mean? He's there. I don't know. I haven't tried on them as often as I probably should have cuz they don't have the Miiverse anymore. So like where I guess you like certain games used Miis the same way that the Switch 2 still has Miis. Like it's your it's your your profile. Yeah, I guess that makes sense. Remember when they cucked all the Miis in Nintendo Switch Sports? They're like, \"Here's these other cool these new cooler modern ones. You're never going to use these. Bring back the Mi.\" You think that's why it wasn't",
            "start": 726.24
        },
        {
            "text": "cucked all the Miis in Nintendo Switch Sports? They're like, \"Here's these other cool these new cooler modern ones. You're never going to use these. Bring back the Mi.\" You think that's why it wasn't that successful? I say that not knowing if it was successful. Possibly. I'm going to guess yes. I agree. Even though I don't know whether it was or not. Admiral Redford says, \"Nice Metal Gear shirt.\" Thank you. So nice. We bought it twice. Are you wearing that shirt as like a hint of anything? No, I'm wearing the shirt I was telling Andy because I forgot today's Summer Game Fest. I normally like dress up and wear a blazer and stuff, but I was driving. I think that's Game Awards. I thought about it this morning. I was like, \"Yeah, but you look like a clown at GameF.\" No, every chat's like you should wear a Metal Gear shirt instead. after the chat's like, \"Why is his neck so big? What's going on with it?\" Grab it. Grab it and feel it. Grab it. Bite the pickle. Grab the neck. Bite the",
            "start": 773.28
        },
        {
            "text": "you should wear a Metal Gear shirt instead. after the chat's like, \"Why is his neck so big? What's going on with it?\" Grab it. Grab it and feel it. Grab it. Bite the pickle. Grab the neck. Bite the pickle. Grab the neck. I can't wait for you to spill pickle juice everywhere. It's going to be a mess. There's no towels. Wet that pickle. [ __ ] sell a thing that requires towels. Like, I'm hiding the goods. I am wearing um a Persona 4 shirt. Yasami High School. We're not going to see this today because we're going to see this at Xbox. But thank you very much. No matter what, I'm still excited for Personal 4 remake, remaster, whatever it could be. Sure. Yeah. Yeah. Rewind. Rerun. Rerun. I did. You predict this for today or Xbox? Um, I predicted it for today cuz I was impatient cuz like we did the SG predictions before the Xbox predictions and I was like, \"Fuck it. I know this is going to happen.\" I just use the word no loosely. I think this is going to happen. I assume this is going to",
            "start": 813.12
        },
        {
            "text": "the SG predictions before the Xbox predictions and I was like, \"Fuck it. I know this is going to happen.\" I just use the word no loosely. I think this is going to happen. I assume this is going to happen from the rumors. Oh, you got that waft. That's the smell of pickle. Mibs uh super chats when he members when he ups his membership for six months says as an Irish best friend seeing an Ireland video from kind of funny pop up today was surreal Dublin kind of funny meet and greet when shout out to cool Greg. Yes today's Greg way is in fact one of today's Greg ways in fact cool Greg documenting his Ireland trip so check that out and shout out to the person in the subreddit that was like I think I just saw Greg in Ireland the first day of his trip around as soon as I saw that I turned to Jenn like you've been Ireland she's like yeah I'm like how small is Ireland? She's like pretty small. I'm like, \"That's insane.\" Cuz like then not only was that, then it was other people in the suburb",
            "start": 859.12
        },
        {
            "text": "like you've been Ireland she's like yeah I'm like how small is Ireland? She's like pretty small. I'm like, \"That's insane.\" Cuz like then not only was that, then it was other people in the suburb being like, \"I'm here. Where was he?\" And they're naming the train station. Like, \"Fuck.\" I I I really wanted us to lean into like never acknowledging that Cool Greg went to Ireland to just keep them guessing, you know? Like, was that cool Greg? Was it someone else? People will never know. I'm going get in there. Have your Holton's big popup. Do you like pickles? No, I hate pickles. Oh [ __ ] I'm sorry. No, it's okay. It's okay. Okay. Yeah, cuz it's an intense smell. Oh, I know. That's why there was a rule that if you sat at this, you have to bite it. Suck on it a little bit. Oh, see? And look at the color of it. Disgusting. That's bad. I again I'm very particular about my pickles. As I said yesterday, I love pickles, but like that's not what I want. Telling what this is. What y'all be",
            "start": 897.92
        },
        {
            "text": "at the color of it. Disgusting. That's bad. I again I'm very particular about my pickles. As I said yesterday, I love pickles, but like that's not what I want. Telling what this is. What y'all be eating? If you had a handful of popcorn and then you bit into that after, it would be the Oh, it would be ecstasy. How big should my first bite be? Huge. Like, but like really like just the tip. Why? You guys can decide decide my fate. An inch deep. One inch deep. Yeah. For that string. You can get six inches in. Yeah. I can't. I got a sensitive throat. Give it a shot. What about like this much? Yeah, that's a big bite. That's a big bite. Yeah, I don't think that's crazy. Oh god. Jesus. See, no crunch. Disgusting. Yeah, I don't like that. I don't need a soft flaccid pickle. Give me a Clawson right now. What' you think? No, I'm mad at it. Oh, so I wish there was a crunch. If you haven't been watching content, Tim's never had a bag pickle. That was He didn't think they existed or were easy to",
            "start": 930.88
        },
        {
            "text": "now. What' you think? No, I'm mad at it. Oh, so I wish there was a crunch. If you haven't been watching content, Tim's never had a bag pickle. That was He didn't think they existed or were easy to find. I'm not mad at it. Is this from 7-Eleven? Did we go by to 7-Eleven across the street? See, I thought they might have it when you guys were asking where they'd be. Cool. Greg surprised us on Continue to eat this pickle. Oh, wow. Okay. Nice. Wow. Big development. You need V RVC says it too. You need a crunch. You need the crunch. Yeah. Pickle. God. What are we doing here? We're getting ready for SGF 2025. That's right. Summer GameFest is upon us. Yes. There was just the Nintendo Switch 2 release. Yes, there was just a PlayStation State of Play. But now the real fun begins. Uh we are about five minutes away from Jeff Keelley's Summer Game Fest kickoff presentation. Uh theoretically two hours, maybe more, maybe less of what's going on in the games industry, announcements, surprises,",
            "start": 974.8
        },
        {
            "text": "five minutes away from Jeff Keelley's Summer Game Fest kickoff presentation. Uh theoretically two hours, maybe more, maybe less of what's going on in the games industry, announcements, surprises, release dates, probably a shadow drop or two. Um we're stoked about it. Uh the way your day will work with us, of course, is you will live react to it. Then we will immediately do a Games Cast post show where we review uh the entire thing, give our ratings and stuff like that. Then I will run to San Francisco International Airport while I where I will fly to Los Angeles where I will spend all of tomorrow seeing video games at Summer GameFest playdays. Uh Sunday I will see a bunch more games. Uh of course the boys here will be reacting to the Xbox presentation at 9:30 going live with the pre-show 10:00 that'll kick off. uh they will talk over it like we're going to talk over SGF. Then I'll talk over the Outer Worlds 2 presentation. Then you'll get a Games cast uh post show reviewing that. I'll",
            "start": 1022.16
        },
        {
            "text": "that'll kick off. uh they will talk over it like we're going to talk over SGF. Then I'll talk over the Outer Worlds 2 presentation. Then you'll get a Games cast uh post show reviewing that. I'll fly home after seeing more video games. We'll all get together on Monday, talk about what we've played in the Switch, what we've been doing over here, what do we think SGF games, etc., etc., etc., etc., etc. It's E3, baby. Man, he's going to town. Yeah. No, he's all up in that. He kicked it to me so he could chew up the first part, but I thought it was going to stop. No, he just kept eating. Dustin King says, \"How about that Sonic leak?\" I'll never forgive any of you. If you haven't gone to youtube.com/kindfunn our highlights channel, go there right now and see our exclusive reveal of Sonic Revolution. Of course, Tim and Bless did a live react to it. Dumb name for a Sonic game if you think about it. And if you remember the one games cast where I was about to bring up a game and then Blessie",
            "start": 1066.8
        },
        {
            "text": "Of course, Tim and Bless did a live react to it. Dumb name for a Sonic game if you think about it. And if you remember the one games cast where I was about to bring up a game and then Blessie said, \"No, don't talk about it. That's a real game, Andy.\" And I was like, \"Oh shit.\" And I legitimately thought like, \"Oh no, I just said something I shouldn't have.\" I think about that costume. I really stopped you. I was like, I did a good thing today. I couldn't I couldn't wait to tell Tim about that. I saved the company. I saved the company. I saved Andy's ass. I couldn't wait to tell the story of Tan like tricking Blessing and Blessing be like, \"No, no, Andy, that's actually a real game.\" I was like, \"Oh, [ __ ] Damn.\" Haidider asks, \"Arc Raider: Shadow Drop today?\" I feel it in my bones. Andy, what do you think? Um, I'll stick with yes. I know that, you know, there have been other leaks since then that where people are assuming that maybe it's just hinting at another date for, you know,",
            "start": 1106.4
        },
        {
            "text": "what do you think? Um, I'll stick with yes. I know that, you know, there have been other leaks since then that where people are assuming that maybe it's just hinting at another date for, you know, another beta, but it's it's been pretty consensus that the first network test was so solid and it was so great. And plus, I don't know if they want to get in the way right now with Switch 2 being out. I think this would be another good time to just say like new beta out right now and then we'll hop in later. But I don't know. We'll see. I got a bold prediction. Metal Gear Solid 3 Delta virtuous mission demo out today. Oh, damn. That's a great [ __ ] call. That'd be Damn. What about online? Do you think we see online stuff? Metal Gear Online? I mean, they got to talk. Did we ever get confirmation that that was Metal Gear Online? No. They never said teases is all I've seen. Maybe chat, correct me if I'm wrong. Have you seen something else? I mean, I feel like it's confirmed in the same way",
            "start": 1147.28
        },
        {
            "text": "that that was Metal Gear Online? No. They never said teases is all I've seen. Maybe chat, correct me if I'm wrong. Have you seen something else? I mean, I feel like it's confirmed in the same way that like they teased the ape escape thing and then confirmed it like Yeah, but like the ape escape thing is like, you know, you can Yeah, it's a mode, right? Online. I feel like you would want to talk a lot more about that in like more of an official way to like if it's just like the Nintendo Switch online N64 games now you can play online. You know what I mean? Just like, oh yeah, it's just the mode we had before and it functions kind of that way. The multiplayer functions. I like I don't think it's going to be like a modern online experience. You don't think it's going to be a live service? You don't think we're going to get a battle pass? No. No. A road map. See, if they if they did all that stuff, yeah, I feel like it'd be a bigger announcement, but I think it's just I'd love to see the",
            "start": 1198.08
        },
        {
            "text": "don't think we're going to get a battle pass? No. No. A road map. See, if they if they did all that stuff, yeah, I feel like it'd be a bigger announcement, but I think it's just I'd love to see the old one back. Yeah. And to some extent and it'll last a month and then we are 2 minutes out and it looks like right now we're cracking about 8,000 people watching live across both platforms as we build a Summer GameFest. Thank you so much. Remember, if it's your first time here, like, subscribe, share, hit the follow button. If you're over on Twitch, remember, maybe kick a subscription out there. Remember, if you have Amazon Prime, you have Twitch Prime, can give a free 30-day subscription to folks like us, kind of funny games. Of course, each and every weekday and variety of platforms, we run you through the nerdy video game news you need to know about. And here's a word from our sponsors. This episode's brought to you by XRE. Y'all know that a few months ago, my life changed forever when",
            "start": 1233.6
        },
        {
            "text": "you through the nerdy video game news you need to know about. And here's a word from our sponsors. This episode's brought to you by XRE. Y'all know that a few months ago, my life changed forever when I brought a pair of XRE1 AR glasses on a long flight to New York. I legit could not believe how easy it is to use and high quality my experience was playing games, watching movies, TV shows on the plane without just too much extra stuff around me or especially not a giant goofy headset around my head. No joke, this is my favorite new tech product in years. And it has earned a permanent spot in my travel bag. It is only hard to believe that it works as well as I'm saying until you try XR1 AR glasses for yourself and then you will see that the future is now. The tech is here. Connect XReal 1 glasses to wherever you are playing. Whether it's a handheld console, a PC, phone, home console. You just get a massive 150in virtual screen anywhere, anytime for any game. Gaming on the go, like a long",
            "start": 1269.84
        },
        {
            "text": "to wherever you are playing. Whether it's a handheld console, a PC, phone, home console. You just get a massive 150in virtual screen anywhere, anytime for any game. Gaming on the go, like a long haul flight, you need the XR 1. Neck starting to hurt from staring down at your handheld, we've all been there. You need an XR1. A screen as big as your wall. Instant plugandplay with all of your devices via USBC. Built-in audio with sound by Bose's anchoring your screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full HD. These are what make XR1 a musthave. And we hear XR1 Pro is coming soon with an even bigger virtual screen. Hit our link below to get your XR glasses today. There's nothing better than when a sponsor of Kind of Funny is something that we are legitimately obsessed with, and that is exactly the case here with XRE. You're going to hear me talking about these forever. Go to xreal.com for more. And here we are. It's about to start, everybody. Who do we",
            "start": 1316.72
        },
        {
            "text": "obsessed with, and that is exactly the case here with XRE. You're going to hear me talking about these forever. Go to xreal.com for more. And here we are. It's about to start, everybody. Who do we see first? Lucy or Jeff? Jeffrey. He's going to keep Lucy in a cage. Good luck to you all. I hope your dreams come true. Yes. Good luck every as well. Show me that Bloodborne. [Music] Please welcome to the stage the creator of the Game Awards, Jeff Healey. Whose voice is that? That's Kyle. That's 700 bucks right there. And please welcome a woman who lived with Jen and Greg. Lucy J. How about these shoes? You like his shoes, Tim? I mean, I like how loud though. Stands out. I love the energy. Hello everybody and welcome to summer gamefest showcase to celebrate what's new and next in video games. Now every year we have the distinct honor of together to spotlight the boundless creativity that defines our industry. Thank you all for joining us and giving us your time. And special thanks to Dante.",
            "start": 1369.04
        },
        {
            "text": "every year we have the distinct honor of together to spotlight the boundless creativity that defines our industry. Thank you all for joining us and giving us your time. And special thanks to Dante. I was reading my feed this morning and saw that he canled a date and he hopes I don't disappoint him. Dante, we're going to do our best to make it worth your while. We have a really fun show ahead. Over the next two hours, we're going to give you a whirlwind tour of dozens of dates at home like from studio big and two hours to puppets, zombies to Marvel Heroes. This show has a little bit of everything. He said, including, yes, some brand new game announcements. Two hours are Thank you. Got to have some of those. Now, before we dive into the excitement, let's take a moment to recognize just how dynamic our industry has become. Here's a look at the top 10 selling new games on Steam so far in 2025 by units, according to Game Discover Co. Sponsor a baby, lots of great games. Now, the list",
            "start": 1432.56
        },
        {
            "text": "how dynamic our industry has become. Here's a look at the top 10 selling new games on Steam so far in 2025 by units, according to Game Discover Co. Sponsor a baby, lots of great games. Now, the list includes beloved franchises, but sitting proudly at number one with over 13 million units sold since February is Repo, a groundbreaking indie game crafted by a passionate team of just 10 people at Semiwork in Upsala, Sweden. And closely trailing it is schedule one from TVGS, a solo developer in Australia. It's inspiring that these indie creations stand side by side with heavyweights like Monster Hunter Wilds and the Oblivion remake. Wonder how many erotic games they had to knock off. Now, let's also apply Obscure from Sandfall. Okay, these games don't have might get some nominations at the end of the year. We're not there yet. But it is a monumental achievement. I'm just saying connect the dots Metacritic score ever recorded for a game. All from a team of under 30 developers who bravely",
            "start": 1485.84
        },
        {
            "text": "of the year. We're not there yet. But it is a monumental achievement. I'm just saying connect the dots Metacritic score ever recorded for a game. All from a team of under 30 developers who bravely stepped away from big publishers to forge their own path. One thing is clear. With digital distribution and engines like Unreal, today's most innovative projects increasingly emerge from outside the traditional publisher system. And that's something to celebrate. But with more than 18,000 games released on Steam just last year, more than double from 2020, the challenge now is discovery. And that's precisely why events like Summer GameFest, our partner showcases happening all weekend long, and initiatives like the Steam NextFest are so essential. These events help remarkable games, big and small, find their audiences. And hopefully if you're watching this show, you'll discover your next favorite game. So in that spirit, let's kick things off with a game from an independent studio who is",
            "start": 1541.84
        },
        {
            "text": "find their audiences. And hopefully if you're watching this show, you'll discover your next favorite game. So in that spirit, let's kick things off with a game from an independent studio who is thinking very big. In 2017, four developers broke away from AAA publishers to chart their own course. Today, they're a thriving independent studio of 30 creators. And what you're about to see is a powerful testament to what passion, freedom, and a small, dedicated team can achieve. Let's take a look at our first new game announcement. I would have stuttered like 12 times throughout that whole sentence. Great job, Jeff. You think you're the harbinger? You might be [Music] Andy Bless are y'all tingly. What's happening with this? I mean, it could be Mortal Shell. I think it's a Mortal Shell sequel. Maybe the main They know not of your nature. Yeah. Yeah. Weapon, man. Remember Mortal Shell? No. No. Don't at all. No. [Music] Freaking cool [ __ ] Damn, that was a big ass. Look at that dumper. I",
            "start": 1591.28
        },
        {
            "text": "Maybe the main They know not of your nature. Yeah. Yeah. Weapon, man. Remember Mortal Shell? No. No. Don't at all. No. [Music] Freaking cool [ __ ] Damn, that was a big ass. Look at that dumper. I didn't play Mortal Shell, so I don't remember there being guns. They'll worship you until you fail. Then what? I watch Lauren stream a lot of all my knowledge. God, the need [Music] hair, dude. Oh, wow. There it is. Wow. I think I booted this game up and played precisely 15 minutes and I was like, I'm good. I liked the like you turning into like the rock. Yeah, more to come. But right now, the end, the Nexus War, Galactus Fight, or even live at risky reels. Over the years, Fortnite has innovated with mass scale live in game. Show me my superhero battle pass. Fortnite is set to do it again across console, PC, and phones. The Death Stars super laser is charged and ready to decimate the battle royale island. But there's still hope. You and your friends can join the fight. Here's the first",
            "start": 1660.48
        },
        {
            "text": "console, PC, and phones. The Death Stars super laser is charged and ready to decimate the battle royale island. But there's still hope. You and your friends can join the fight. Here's the first exclusive look at what you'll be part of tomorrow in the brand new live event, Death Star Sabotage. That means we're close to this superhero thing. Some people were saying it's a DC Comics battle pass. I don't buy that, but it is a Tim Drake Superman leak. We know from its bad feeling about [Music] this everything you've got. [Music] Think I saw Jonesy. All right. Right now, it is an honor to welcome to Summer GameFest a legendary game creator who is set to release his latest project in just a few short weeks. With each of his games, he pushes the gaming medium in bold new directions. and we are honored to have him with us for the first time at Summer GameFest in person. Please everyone join me in welcoming the great Mr. Hideo Kajjima. What if he comes out and just somehow mentions the snow",
            "start": 1769.52
        },
        {
            "text": "honored to have him with us for the first time at Summer GameFest in person. Please everyone join me in welcoming the great Mr. Hideo Kajjima. What if he comes out and just somehow mentions the snow bike mic video? Hey, that's my guy. I free Lucy. I wore this jacket because snow bike mic went big. Mr. Kjima, here we are. The world tour begins at Summer GameFest. Uh it's great to have you here. We are so excited for DS2. So, let me ask you, Mr. Kajjima, uh, you've worked for many years on this project. What do you hope players take away from DS2 when they play it later this month? Well, we hit the pandemic after we released DS1. Everyone experienced the pandmic. So, I wanted to show something new connection after we faced the pandemic. So, I want everyone you to think about that when you play this game. Okay. Well, talking about playing the game, it's coming out later this month, but right now, I know you prepared a special exclusive clip for SGF. Let's take a look at this. The dude",
            "start": 1834.0
        },
        {
            "text": "play this game. Okay. Well, talking about playing the game, it's coming out later this month, but right now, I know you prepared a special exclusive clip for SGF. Let's take a look at this. The dude who's translating was the guy who answered the phone when me and Roger got to code your productions an hour early. He was like, \"Wait, what are you guys doing here?\" Oh, [ __ ] My bad. Oh, it's the guy who looks like Snake. Did you play through this part in your preview? No. Thank you. No further questions, your honor. Tim. Mhm. You can go. What does that mean? Welcome. How's it going? Oh. can't be ripping a dart here, man. Come on. He makes his own rule. Sir Shan Pan. So, you are Neil Vana. Mhm. Where are you here? What do you do? Lucy. Lucy James for living. I'm a porter. [Music] So, thank you. We're good for the day. Okay. Thanks, Ne. What? So, you made it then. Sorry. You really don't remember me. My god. Ring one. He hates to see it. I thought it was like 69 had you together. You're",
            "start": 1894.8
        },
        {
            "text": "you. We're good for the day. Okay. Thanks, Ne. What? So, you made it then. Sorry. You really don't remember me. My god. Ring one. He hates to see it. I thought it was like 69 had you together. You're alive. I start kissing. Stop. Stop. Stop. Stop. Stop. Let's see them floppy noses rub against each other in that one trailer. Floppy nose. Well, that was a clip from the game, a cut scene. Uh we saw a first glimpse of Neil and Lucy and we met them in the the trailer back at South by Southwest, but we got a little bit more of them here. Tell us a little bit more about this clip and the characters of Neil and Lucy. In DS2, it's a very important character. Neil and Lucy. I can't really say because there'll be spoilers. You saw the cancer mark on both of their hands. So, they have this deep connection and reveals throughout the story. And last time on DS1 we have Cliff who was played by Matt. And of course by story you know he will not be in DS2 but this time Neil will be like playing like",
            "start": 1992.32
        },
        {
            "text": "and reveals throughout the story. And last time on DS1 we have Cliff who was played by Matt. And of course by story you know he will not be in DS2 but this time Neil will be like playing like the role that Matt did uh for DS2 this time and Cliff was a very popular character but I think we have to kind of like top that character. So Luca Marinetti was a great actor and I think it were great. He did a great performance. So I think you'll like this new character, Neil, too. Well, the game's going to be out in 20 days, so I'm not going to give any spoilers. You know, that's what I brought today. But there is more to share. And uh you won't have to wait very long to uh learn more about the game. Actually, this Sunday as part of Summer GameFest, you tune in to the DS2 live game premiere, uh, where Hideo will be joined by many members of the cast. He'll be sharing, uh, a new demo of the game, game, live gameplay demo, uh, alongside El Fanning and Troy Baker. And I'll be there hosting it. And",
            "start": 2102.52
        },
        {
            "text": "Hideo will be joined by many members of the cast. He'll be sharing, uh, a new demo of the game, game, live gameplay demo, uh, alongside El Fanning and Troy Baker. And I'll be there hosting it. And let's just say this is not the last that you've seen of Neil this weekend. And we'll leave it at that. I'll show you the gameplay scene. So, hope you enjoy. Uh, will join us Sunday, too. Excellent. All right. Uh, thank you so much, Hadale Kajjima, everyone. Great to see you, Mr. Kajjima. Was it on this show that we discovered their husband and wife in real life, or was that on my stream? Now, I'd like to introduce my co-host for along for the party, a veteran games journalist on GameSpot and the co-host of the Friends Per Second podcast. Please join me in welcoming the incredible Lucy James. Hell yeah. No sleeves. She's doing it right now. You tried it for Jeff. Yeah, you can't you can't transfer that to Loose. Thanks, Jeff. And hello, Summer GameFest. I am so excited to be here this year.",
            "start": 2157.44
        },
        {
            "text": "yeah. No sleeves. She's doing it right now. You tried it for Jeff. Yeah, you can't you can't transfer that to Loose. Thanks, Jeff. And hello, Summer GameFest. I am so excited to be here this year. Thank you for having me. Now, we are honored to reveal an exciting new project from Raw Power Games. A new team headquartered in Copenhagen, Denmark. Here, you can engage in intense combat, fight for land, glory, and legacy, and lead massive armies into epic scale battles as narrated by actor Tom Hardy. Oh. Oh, that's Venom, right? Thou shalt not kill. So the priests tell us. So the Lord commands. I'm the guy who played Venom. I will man do not listen. I saw big head Isaac. She learned to talk to like this at Greg's. But war found me. [Music] You think Tom Hardy plays video games? I became like them. Madden. I took up the soul. See, I was going to say Ghost Recon. Pray redemption through God. That's so funny. He seems like a Ghost Recon guy. I don't know. Path once taken have only one",
            "start": 2206.56
        },
        {
            "text": "like them. Madden. I took up the soul. See, I was going to say Ghost Recon. Pray redemption through God. That's so funny. He seems like a Ghost Recon guy. I don't know. Path once taken have only one ending. I shall find no peace on this road. There is only [Applause] death star wars. That's just my story. [Music] Go write your own. This kind of hype [Music] early access to that was a very cool new project in a brutal European medieval world. Use this more. Now it's time to hang on to the edge of tomorrow. Sonic Racing Crossworlds is a thrilling new entry in the legacy of racing action games within the Sonic franchise. Crossworlds brings other worlds and familiar faces to Sonic Racing, including surprise guest characters being revealed here at SGF for the first time. Spongebob. God, I hope it is. I said it. It is. It is. Cuz I saw the stuff on Twitter, but it looked like it was fake AI [ __ ] I got But it's hard because like the videos look as bad as what I expect this. [Music] We're",
            "start": 2281.12
        },
        {
            "text": "it is. I said it. It is. It is. Cuz I saw the stuff on Twitter, but it looked like it was fake AI [ __ ] I got But it's hard because like the videos look as bad as what I expect this. [Music] We're about to have a tamillution. Oh yeah. Who's the green dude? Let's mix riders. Yeah. You didn't answer the question. I don't know his name. I don't know his name either. Hey, how's Miku? Oh, wow. Now you have Michael to play this with. Yeah. Oh, I see. Now we're cooking. Big garage. Let's [ __ ] Oh, you got me now. Didn't knock my water over. Bear. Are you hopping in? No. It's cart racing with Joker. You have to go update your persona rank. Time for me to win this. Roger. I said, \"Who's the green guy?\" Oh, he's been around. And Tim says, \"Sonic Racing September, but that riders, we'd like to introduce the man behind the creation of everyone's favorite blue hedgehog, Tekashi.\" They're going to say the guy that went to prison. Jet the Hawk. Remember when we met him? Top Golf. Oh my god. Sonic",
            "start": 2370.16
        },
        {
            "text": "the man behind the creation of everyone's favorite blue hedgehog, Tekashi.\" They're going to say the guy that went to prison. Jet the Hawk. Remember when we met him? Top Golf. Oh my god. Sonic racing. Sonic racing world is the next. If only there was another Sonic fan in the office. I could have gone to Vegas team and the Sega arcade racing team. You can feel brand new experience from the new future building which you can walk in the list. God damn, I'm so right about you. Also, unlike another car racing game, I can't I can't. This game will have online class who you are. It's fine. Be that guy. Such a cool shirt. Don't be that guy. You're fine. So powerful with all of your friends across all of the platform. Crossplatform play. Lastly, I have one more thing I'd like to show everyone here today. Take a look inside of the [Applause] traveling Minecraft. That's the ender dragon. I really wish it was Spongebob. I really wish it was Spongebob. And Sonic, I guess you could say you got to",
            "start": 2456.08
        },
        {
            "text": "today. Take a look inside of the [Applause] traveling Minecraft. That's the ender dragon. I really wish it was Spongebob. I really wish it was Spongebob. And Sonic, I guess you could say you got to go craft. Not bad. Not bad, Lucy. Lucy. Next, we're excited to reveal a brand new action RPG from Bandai Namco Studios. Embark on a journey across a dark fantasy world and uncover a vast story that eclipses time. Why has everything got to look like Bloodborne? We just have normal games for normal people. Why is everything got to look like I [ __ ] came out of a gothic stained glass window? [ __ ] me. L said everything right up until I stepped into this nightmare. What if I told you that this character's brother died? I'm listening for some. Was it cancer slowly while he hold his hand? Yeah. At least I got a Fortnite thing. A lot of ways to connect for others. Es guys, we got to change the blood. Oh, come on. You can't be having for our That was [ __ ] wild. You show that on YouTube. Yeah,",
            "start": 2511.12
        },
        {
            "text": "least I got a Fortnite thing. A lot of ways to connect for others. Es guys, we got to change the blood. Oh, come on. You can't be having for our That was [ __ ] wild. You show that on YouTube. Yeah, dude. our hopes lost long ago. But [Music] you you have the power to change all of this. I think it's Skyrim Code Code Bane 2. That's a good call. Chat play or a weapon to wield. I always heard it was really really mid like as far as soul games go. Not super ruin. And this time another portal, man. We're on the portal. You'll find how to save us all. That was a cool move. Like your eyes full of stuff. He has a motorcycle. Of course he is. He's also got the powers from prototype. There it is. Got too. Cool. Now we got something from Epic. This is a project. Um, nope. Never mind. I was going to say the team eco game. Little nightmares. Oh yeah. Oh yeah. No. Yeah, right. Oh, but this dude's like shooting. No. Yeah. Yeah. No, this isn't Little Nightmares. Little Nightmare jacket, right? This",
            "start": 2581.76
        },
        {
            "text": "say the team eco game. Little nightmares. Oh yeah. Oh yeah. No. Yeah, right. Oh, but this dude's like shooting. No. Yeah. Yeah. No, this isn't Little Nightmares. Little Nightmare jacket, right? This play. I think I think we've seen this before. Section 9. I guess I'm not I'm not familiar with second night cuz Little Nightmares is being made by Super Massive and then the Little Nightmares devs are working on Rean Animal, right? I just forgot like Section 9 Interactive is an independent studio in Malmo, Sweden. See, I was going to guess Copenhagen End of Abyss. I like Thog Solid. That looks pretty cool. It looked like that was a very cool new game. That was End of Abyss, the debut title from Malmo, Swedenbased Section 9 Interactive, an atmospheric action adventure game coming in 2026 to the Epic Game Store and consoles. Next, we'll step into the black and white world of Rubber Hose Animation with Mouse PI for Hire, developed by firsttime developer Fumi Games and published by Playside,",
            "start": 2698.48
        },
        {
            "text": "Epic Game Store and consoles. Next, we'll step into the black and white world of Rubber Hose Animation with Mouse PI for Hire, developed by firsttime developer Fumi Games and published by Playside, releasing later this year. Here's a quick new look at the game and the reveal of a familiar voice. Who's going to be There's something rotten at the heart of Mouseberg. Crooks, beware. Detective Peppers in the house. There are those who would bend the city to their will. Dumb wise guys and fake cheese wheels. And those who do anything to save it. [Music] Oh [ __ ] Here we go. Man, what a chameleon. That was one of That one was his best performance in terms for Troy Baker. All right, that's not all from Playside. Now comes the announcement of another ambitious project from this independent Australian developer. We've been talking to them for a while about this project, which builds on their recent launches of Kill Knight and Age of Darkness, but this takes things to a whole new level. It's a",
            "start": 2781.2
        },
        {
            "text": "developer. We've been talking to them for a while about this project, which builds on their recent launches of Kill Knight and Age of Darkness, but this takes things to a whole new level. It's a premium real-time strategy game built for PC based on one of the most iconic fantasy franchises in the world. Any guesses? Let's take a look. Oh, Game of Thrones. Is this that same one that we already know about? No, cuz that one was like a third person action meme that I think already looks like you from the eyebrows. Yeah. Nose up. You may think you know how the game is played. Time to play the game, but this is not the game. You know, that's Jamie Lannister. I didn't know it. Ain't that nothing? Nike doesn't look like he's trying a whole lot of effort. Your legacy. Hi. How has it not been a good game? It's wild. How is that possible in an Age of Souls games? Draaris, you decide who wins. That's why I'm so glad that Keley leads it off with a real time strategy game. Give you the whole genre.",
            "start": 2842.08
        },
        {
            "text": "game? It's wild. How is that possible in an Age of Souls games? Draaris, you decide who wins. That's why I'm so glad that Keley leads it off with a real time strategy game. Give you the whole genre. Don't have a battle laces moment. Got him. Oh, that's fine. You can come back. Yeah. Got her. That was a good ass shot. Good [ __ ] chat. Sick. Oh, this is cool. This is like having Gandhi win World War II and [ __ ] [Music] I get the ship reference. I understand what you're laughing at, everybody. Yeah, dog. War for Westeros. Pretty neat. Everything's 2026. I bet you Mike flies to [ __ ] Malma, Sweden or whatever to go play that. This one is Australia. Action adventure RPG. What [ __ ] nightmare is this? It's space bloodborne. The great Silkovski once said, \"One could count a million billion sons in the known universe.\" Whoa, they're transporting a whale and I other intelligent beings. It is said if they were out there, they would have visited Earth. Whoa. Wait. What's the game? The",
            "start": 2925.28
        },
        {
            "text": "sons in the known universe.\" Whoa, they're transporting a whale and I other intelligent beings. It is said if they were out there, they would have visited Earth. Whoa. Wait. What's the game? The answer is maybe the FPS that came out like last year. The time has not come yet for the Russian. I know what you're talking about. Russian that came out like February of last year. Yeah. Theicart. The atomic heart. Yeah. What's that developer? Is it [ __ ] crazyart? That's a quick turnaround. Was it really last year? It was two 3 years ago. Okay. Was it really good? I think it was 23 2020. Look at this. You're surfing. Jesus. Time flies. I guess he did pretty well if they got Queen. [Music] So there's no music, right? I'm going to pick I don't remember much conversation about this one like after it came out you know they just do a DLC too that I don't remember. I think the general thought on Atomic Car 1 was like pretty good game not much more than that. I remember I started it. Wow asses",
            "start": 3010.72
        },
        {
            "text": "it came out you know they just do a DLC too that I don't remember. I think the general thought on Atomic Car 1 was like pretty good game not much more than that. I remember I started it. Wow asses played probably a couple hours and I was like I'm I thought it was pretty neat but not enough to keep on going. I forgot what really had my attention. I feel like that came out the same time as someone. [Music] Why are they making this flag? This is one of those games where like it's everything. It's an everything game. What do you want to do? Oh god, that's terrifying. Ass. Another assumpt [Music] I think I I went into this game wanting it to be Wolf Sign 2. Oh, and then it just wasn't. No date. That's right. Atomic Heart 2 is an active development at Munfish on Unreal Engine 5, a spiritual successor to the first game with a retrofuturistic world on a global scale. And this time there's a greater emphasis on RPG elements and player freedom. But that, believe it or not, is not all from",
            "start": 3083.04
        },
        {
            "text": "successor to the first game with a retrofuturistic world on a global scale. And this time there's a greater emphasis on RPG elements and player freedom. But that, believe it or not, is not all from Munfish today. Oh my god, they can't stop the M. Atomic Kart 3. We made a third one. It is an active pre-production. A giant cube. It's a battle royale. Yeah, I still barely believe it myself. It's a rogue light ever shifting worlds. When it showed up, I was in the lab. I didn't even see it. You know, also spiritual successors though a terrible sense of my own powerlessness. [Music] How did the whole of humanity miss it? Is there a game called Spiritual Possess? Did we actually didn't appear but revealed itself? What if it was always there and we've only just started to see it? At what point do you start considering the idea of a funny laundering scheme around Atomic Heart? cuz like announcing the atomic heart multiplayer. They got wall running though. They got Titanfall wall running. I",
            "start": 3155.6
        },
        {
            "text": "do you start considering the idea of a funny laundering scheme around Atomic Heart? cuz like announcing the atomic heart multiplayer. They got wall running though. They got Titanfall wall running. I mean this looks good ass. Jesus. I'll stop calling him now. Sorry. Munfishes really likes asses and I I can't disagree. All right. Atomic Universe. That's what we need. Cute little guy. The cube. Another new project from Munfish. An MMO RPG shooter set in the atomic universe on a massive levitating cube. You can see there where the edges are constantly rotating to create unique gameplay combinations that are ever evolving. Oh, so it's not a battle. All right, let's jump into the Marvel Cosmic Invasion Universe. The new retro beat him up coming to PC and consoles this holiday with multiplayer fun for up to four players. You can pick between 15 Marvel characters to play, but so far only seven have been revealed. Well, now it's time to meet the next two Hulk. What a great art style. She looks",
            "start": 3225.04
        },
        {
            "text": "for up to four players. You can pick between 15 Marvel characters to play, but so far only seven have been revealed. Well, now it's time to meet the next two Hulk. What a great art style. She looks awesome. She looks so damn good. He looks great. This game looks amazing. Inject this art style inside of me. However you want, you know, however you want. Or if it's of your choosing. E, someone said this is a Prime Switch 2 game. Agree 1,000%. Yeah. Yeah, I'm not a beat him up guy, but this is an IP that'll make me I want to play. You play that with Ben. Come on, man. A good time, man. He sucks at that kind of We were playing TMNT with him at the arcade and I had to tell him or No, I'm no date. But what do we got here? My world. What? This is the third trailer we've seen for this game, right? First time seeing gameplay. Uh we get little glimpses here and there. You don't have a chance. Remember the second one we saw was just really weird. Like you would think this game is coming out next",
            "start": 3290.72
        },
        {
            "text": "First time seeing gameplay. Uh we get little glimpses here and there. You don't have a chance. Remember the second one we saw was just really weird. Like you would think this game is coming out next month. Maybe. Well, I think they said 202. Damn it. Did they say here? Wa. That looked awesome. Not enough. I need more piggy. Is this your first time hearing uh the English voice? Uh, I don't remember. I feel like the original the announcement trailer I think was different. We both want the same thing. This looks so nasty. Like I want this, dude. At the top. And I'm hoping this game is really difficult. We need the flamboyant bad guys. Like they're nailing it. I want this game to be so hard so that Tim is forced to like get good at it, beat it, and then get it to secure. Tim just needs to get over the fact that sometimes health is called vitality in some of these games. You know, sometimes you press a button to heal. Magic is called intelligence. Sometimes that tease. I think these are",
            "start": 3368.08
        },
        {
            "text": "over the fact that sometimes health is called vitality in some of these games. You know, sometimes you press a button to heal. Magic is called intelligence. Sometimes that tease. I think these are all new things. So that was a new look at Onim Musha Way of the Sword, which we announced back in December at the TGA's. It is coming in 2026 and will be playable this summer at Gamescom. Now, let's completely switch gears to make sure I love my puppets. And this next project is one I've been tracking for a few years as a team at Son String Studios is using Unreal Engine 5 to create an insane digital puppeteering pipeline. It's actually a thing. What you're about to see is running completely in real time in Unreal, and I cannot wait to play it. Here is an unexpected new game announcement that combines comedic storytelling and arcade fighting action. Check this out. I like those things. Yeah, I like those things. As soon as it pops up of a million punches, you'll get yourself killed. Jeff is",
            "start": 3430.88
        },
        {
            "text": "comedic storytelling and arcade fighting action. Check this out. I like those things. Yeah, I like those things. As soon as it pops up of a million punches, you'll get yourself killed. Jeff is a freak. Okay. Wait. So, so I I went from so out to so in. Jeff Key is a [ __ ] freak. I am [ __ ] in. He's been chasing this for a few years. Little sack of fuzzy [ __ ] Show me what you got. Is this going to be a punchout game? He said arcade fighting. Yeah, we got to transform. Why are you even here? Don't waste my time. It's hilarious. Save us, Fuzzy over. [Music] And a boy. And a boy. Eat red crap. Burn toast car blue. This whole thing is gameplay. They said I mean all in Unreal. Yeah. It's not a puppet like crazy. Oh god. It's in VR. It'll be VR, dude. [Applause] [Music] Oh, that it's good cuz they're puppets. This looks way too real. That's awesome. Using my Lotus. What? Game of the show. Super fun. Got to wish list that, right? All right. Well, next it's time to see the announcement of a",
            "start": 3485.44
        },
        {
            "text": "they're puppets. This looks way too real. That's awesome. Using my Lotus. What? Game of the show. Super fun. Got to wish list that, right? All right. Well, next it's time to see the announcement of a brand new game in Deception We Trust. An ancient white castle deep in the mountains. Lost to time and legend. Only the chosen find their way here. Gathered from every corner of the earth. Divine bound. Wolves and lambs engaged in a perilous dance of wits. A game where truth is but a shadow. Enough theatrics. I'll get to the point. Killer N is a murder mystery action game. The killers lurk elusively in plain sight. Kill someone and a clue will remain. Hair, fingerprints, blood. The lambs scramble to find clues. One step closer to unmasking the culprits. Who is guilty will eventually come to light. Wolves win by killing every lamb. Lambs win by booting out every wolf. Such simple rules. But there's so much more to this game of murderous mystery. Complete quests to level up. Buy items with",
            "start": 3571.2
        },
        {
            "text": "Wolves win by killing every lamb. Lambs win by booting out every wolf. Such simple rules. But there's so much more to this game of murderous mystery. Complete quests to level up. Buy items with the gold you earn. Loot chests for weapons and armor. Steal items. Blow up opponents. Poison others. Place traps. Discover one of your own as a wolf. Is killing not to your taste? Then you'd better escape the castle. Now the paths to victory are clear. You would do well to remember. Music sounds like that says Kingdom Hearts game of life for death. Your invitation. No, wait. Oh, what? Can we borrow the library? Borrow that music library. Was Killer in a 24 player multiplayer game from Square Enix where you compete in a game of life or death using social deduction skills to win. All right, it's hard to believe this next game was first announced at TGA in 2021. And though it's been a while, their recent tech tests prove that some things are definitely worth the wait. I'm of course talking about",
            "start": 3646.4
        },
        {
            "text": "to believe this next game was first announced at TGA in 2021. And though it's been a while, their recent tech tests prove that some things are definitely worth the wait. I'm of course talking about Ark Raiders. This is one of the most anticipated games of the year, and we're excited to share a new trailer which will tell you more about the mystery surrounding the world of Sparanza and the long aaited launch 700. This is your moment. You super chat said Arc Raiders Shadow. The world premiere of the release date trailer for Arc Raiders release date. Is this your moment or will you be embarrassed by me by bringing this up? Hider 700. You embarrass me. Remember this is supposed to be a looted shooter like The Division. It just hurts my heart. What is it now? It's an extraction multivation. Okay, sure. It's still awesome for what it is, but it's not that you want more division. Yeah. [Music] Clear your mind of all distractions. You don't have to walk this path alone. Oh, that's a new map.",
            "start": 3700.32
        },
        {
            "text": "sure. It's still awesome for what it is, but it's not that you want more division. Yeah. [Music] Clear your mind of all distractions. You don't have to walk this path alone. Oh, that's a new map. That look cool. Surround yourself with resourceful friends. Shout out to that dude Turtle became good friends with me. Well, not really, but like we had a good run and then the game ended. Shout out to that turtle. Went back to the lobby and and Turtle still there. I was like, \"Oh [ __ ] you're still here.\" Turtle was like, \"Yeah, I was like, \"All right, man. You want to go again?\" He's like, \"Yeah, okay.\" He was dumb, dude. There's seven servings in zero calories. That's insane. How much How much sodium per serving? So much. You couldn't cramp right now. Your daily value per serving. Jesus. Yeah. Oh my god. I I only ate two/3 of it. I'm going to not eat the last third. Sorry. I got a kidney stone [ __ ] size of a baseball. Jesus Christ. Arc Raiders. [Music] Oh, god damn. Okay. Yeah, they're",
            "start": 3747.76
        },
        {
            "text": "Oh my god. I I only ate two/3 of it. I'm going to not eat the last third. Sorry. I got a kidney stone [ __ ] size of a baseball. Jesus Christ. Arc Raiders. [Music] Oh, god damn. Okay. Yeah, they're going to announce right now beta. Nope. That's right, everyone. Arc Raiders is coming October 30th, 2025 for PC and console. Congrats to Embark Studios. All right, Dune fans. Now you can finally step onto the world of Arachus yourself. Yeah, June Awakening combines the survival and genres with a thrilling cinematic story on PC in just a few days on June 10th, but you can play it right now in Steam Advanced Access. I thought I broke for a quick second. I would have stopped you. I would have stopped you. I like I like watching your wheels click into place. Oh, [ __ ] But this is one of those games. I was talking like I was on stream the other day being like I've seen Shroud stream this 17 different times. When is this game out? I just like it's always in a weird almost come out like last",
            "start": 3808.72
        },
        {
            "text": "games. I was talking like I was on stream the other day being like I've seen Shroud stream this 17 different times. When is this game out? I just like it's always in a weird almost come out like last month and then got delayed. It got delayed into the busiest period of all time. It's always in another early access or some sort of test period. If you stream this, let me know cuz I'll hop in. Okay. Cuz I I want to play this real quick. Isn't it on the calendar? I'm playing it with Nick, me and Mike. Yeah. Do you know when? Next week. Yeah. Put me in there. I'm ready. Look at me. I can send me every word that I've heard from a lot of people about this. if you're into survival games and from people who are super deep into these genres say it shouldn't be as good as it is like on the surface doesn't seem like there'd be a whole lot there but that it's a lot better than everybody assumed and people are enjoying it over the many several tests it's been I just remember the demo I went to I",
            "start": 3865.36
        },
        {
            "text": "doesn't seem like there'd be a whole lot there but that it's a lot better than everybody assumed and people are enjoying it over the many several tests it's been I just remember the demo I went to I think it was like last summer game fest where they're showing me the different maps and it was like yeah we got the sand planet it. And then we got like this more extreme sand play that special K in the chat says Lucy is killing it much better than Greg. I've never been given a shot. So the thing that sold me though was like at one point they were like at level 40 you can lock you can unlock the I always forget oropter and I was like sign me up. I love that progression. Yeah. James Williams was like yeah then they said here's a red sand planet and this is blue sand. Yep. The sand is white. Shout out to the 11,000 people watching right now across YouTube and Twitch. Thank you for hanging out. If you don't hang out every day with us, remember we're Kind of funny games. We're all about live",
            "start": 3933.28
        },
        {
            "text": "out to the 11,000 people watching right now across YouTube and Twitch. Thank you for hanging out. If you don't hang out every day with us, remember we're Kind of funny games. We're all about live talk shows, usually around video games. We do kind of funny games daily at 10:00 a.m. Pacific, followed by a kind of funny games cast, followed by streaming video games, but often by in review uh screencasts. Very excited to start Superman in review next week as we build up to July 11th. Oh [ __ ] Shout out Tricks just said, \"Andy, watch Summer GameFest to on Twitch with a linked account to receive a Soulframe Preludes access code.\" Soulframe is the one that I've been like the Warframe devs. Yeah, I saw my world fall to ash. Just open up the tab. Consumed by the tides of Annihilation. Is it? I don't think no. And the void calls. Try as I might to plan their advance first descendants maybe not. No, I think I've seen this before. The big tall dudes. I Oh, I did see this. I Yeah, this is a this",
            "start": 3990.84
        },
        {
            "text": "think no. And the void calls. Try as I might to plan their advance first descendants maybe not. No, I think I've seen this before. The big tall dudes. I Oh, I did see this. I Yeah, this is a this is an MMO that a lot of people in chat were telling me to check out. Neither man nor god, living nor dead. Yet what then of those who dame to turn back the hands of fate, to save what remains of our broken worlds? You need only take my hand. Return to the past where your journey awaits. Yeah, there's they're doing a lot of weird systemwide [ __ ] with like time movement and how it should be impossible in a multiplayer game, but they're goated. Which got you the lead of the story has yet to emerge. Whatever's coming next cannot be easy. I will never forget my cause. What is more coming? My favorite type of trailer. My favorite type of trailer. Just as he once came to me. I have a doctor's appointment tomorrow. Tower is light. It's all the sodium. What happened while I was out? This is six",
            "start": 4036.12
        },
        {
            "text": "type of trailer. My favorite type of trailer. Just as he once came to me. I have a doctor's appointment tomorrow. Tower is light. It's all the sodium. What happened while I was out? This is six daily savings. So, I hear you're looking for someone. You saw my knee. Friend, your warrior. My knee is missing. Worship strength and crave glory. I never doubted that you would. Jesus Christ. We did not need that, you guys. We got these pens. Of course. Of course. Of course. I feel like I get three emails about that game each day. rat in the west. Okay. Oh, this is on the the Switchintend. This looks awesome. Looks even better than it did before. Yeah, this look well on console. That's [ __ ] hilarious. The [ __ ] self-report Nintendo execs back that can't be ours. It was way better. That's Mio Memories in Orbit, a stunning new Metroid Vania platformer that has a demo on Steam you can play right now as part of NextFest. What you're about to see next is a stop motion co-op platformer where",
            "start": 4132.88
        },
        {
            "text": "Memories in Orbit, a stunning new Metroid Vania platformer that has a demo on Steam you can play right now as part of NextFest. What you're about to see next is a stop motion co-op platformer where everything has been crafted by hand. It's called Out of Words, and I'm honored to show it to you today. Okay. [Music] Okay, [Music] dude. Joseph Ferris is [ __ ] punching the wall right now. I love this. Tim, let's play it all in one setting together. Definitely down. Don't you see? We can't. Come on, follow me. This looks awesome, dude. It looks like a happy co-op inside. Yeah, that's a perfect way. 2026. God damn, did you not hear Grand Theft Auto was going to be there? What a really unique and different game. This August signals the release of Mafia: The Old Country, the next entry in the acclaimed Mafia franchise from the team at Hangar 13. It's a gritty mob story set in the brutal underworld of 1900 Sicily. Here is the summer GameFest trailer. Betrayal burns because it can only come",
            "start": 4208.48
        },
        {
            "text": "acclaimed Mafia franchise from the team at Hangar 13. It's a gritty mob story set in the brutal underworld of 1900 Sicily. Here is the summer GameFest trailer. Betrayal burns because it can only come from someone close. An enemy can't hurt you like a friend. [Music] Who are you? Who are you? I work here. My friends, my family, my beautiful daughter, Isabella, don't looks out for people around here. Sometimes a client is feeling less than cooperative and we need to uh teach them all this remind them of their obligations. Peace is between us and Spadaro. Where I come from, commitment means everything. If this is how he wants it, this is how it'll be. The Dawn's noticed you, Enzo. This is an opportunity. Do you wish to commit to this family? We can't let them get away. Wow, it looks so good, dude. Yeah, I did the PAX panel for this one. I'm really stoked for it both because I love this kind of you're playing a movie action, you know, blockbuster game like Tim was talking about, but",
            "start": 4289.12
        },
        {
            "text": "good, dude. Yeah, I did the PAX panel for this one. I'm really stoked for it both because I love this kind of you're playing a movie action, you know, blockbuster game like Tim was talking about, but they're doing so much with the knife combat. Guns aren't that big of a deal. Obviously, it's like this really up close, personal, you can't take hits and stuff. And who are you, Enzo? And if you thought that guy was a stud, just wait till you see this next game. Lego Voyagers captures the creative hands-on spirit of classic Lego play and will also support a Friends Pass, just like Split Fiction. Here's the first ever look. [Music] Interesting. Andy, is this like a follow-up? Yeah. Builder's Journey. Oh, it is actually. Yeah. [Music] Tim, let's do a stream where we play the whole thing together. Yeah, this [ __ ] was mind-blowing raid tracing wise, dude. Lego Builder's Journey. Lego Builder. And that [ __ ] made me cry. It was beautiful. I think a lot of people missed it. Was it Was it",
            "start": 4365.52
        },
        {
            "text": "Yeah, this [ __ ] was mind-blowing raid tracing wise, dude. Lego Builder's Journey. Lego Builder. And that [ __ ] made me cry. It was beautiful. I think a lot of people missed it. Was it Was it only on mobile? I can't remember. I bet on PC. Okay. Okay. [Music] Burns of Beast says, \"If this is actual game image and stuff, this looks real good.\" This is the game. Yeah, this is the game. This is how it's going to look. [Music] Guys, breaking news from my text messages. My uh Pock Girl and Metamorpho figures have shipped from Walmart. Best friend pointed me out. So, we're all set now. We have the entire pieces uh for the Superman robot 4. Thank you. Last night I gave Ben the engineer finger and he was me like, \"I don't like this.\" And I'm like, \"I know, but we need it for the the the little robot.\" He's like, \"Oh, okay.\" I don't like this. Hello, Summer GameFest. I'm Carolyn Lawrence, voice actor for a few familiar faces you might have grown up with on Nickelodeon. Some with squirrel",
            "start": 4443.12
        },
        {
            "text": "robot.\" He's like, \"Oh, okay.\" I don't like this. Hello, Summer GameFest. I'm Carolyn Lawrence, voice actor for a few familiar faces you might have grown up with on Nickelodeon. Some with squirrel suits. Thank you. some with science smarts and some with serious attitude. Nickelodeon has always been about wild worlds and weirder characters. And while I'm mostly sworn to secrecy, today I am thrilled to have a hand in revealing something that brings a lot of like Jimmy Neutron. I hope you enjoy the first look at Neunes and the Dice of Destiny. Yeehaw. [Applause] Okay, I like Hold on. This sounds like a This is like an awesome setup. Don't [ __ ] it up now. Carolyn, brave and wise and powerful and ridiculously handsome wizard would call upon his magic powers to summon the most ferocious, most awesome, most totally radical team of adventurers the land had ever seen. They alone would be able to [Applause] [Music] I was really excited. I'm more in than ever. We're so bad. A Nick Tunes",
            "start": 4492.72
        },
        {
            "text": "most awesome, most totally radical team of adventurers the land had ever seen. They alone would be able to [Applause] [Music] I was really excited. I'm more in than ever. We're so bad. A Nick Tunes Diablo. What are we talking about? Kind of weird that they were teasing like Fairly Odd Chapto's puppet to save the city of Krat from disease. Well, the elements were Eliza P. Overture is a DLC expansion to Eliza P that transports players back in time with new characters, environments, and of course, imposing enemies and bosses. Here's the exclusive new look. Am I getting goosebumps? Say out. Andy, when you did the preview, did you mention about how in their presentation they referenced Perry Poppy? No, I don't think that's really. Yeah, they're like, \"And if you need any help with the demo in the back, we got our very own Perry Poppy and like call PR is a watch is kind of funny and watches our streams and stuff.\" I was just like sitting there. I was like, \"What the fuck?\" And then like the",
            "start": 4558.4
        },
        {
            "text": "back, we got our very own Perry Poppy and like call PR is a watch is kind of funny and watches our streams and stuff.\" I was just like sitting there. I was like, \"What the fuck?\" And then like the dude sitting next to me was like, \"Hey, ain't that you?\" And I was like, \"First of all, who are you?\" Like, \"What the [ __ ] is happening?\" Shout out Shout out Glenn. Glenn rocks. [ __ ] gun blade, dude. That [ __ ] was [ __ ] sick. Mommy was cold. [Applause] Beat that boss. Beat his ass. Stupid ass. Beat that boss. Stupid ass. Yeah, I didn't see any animations ever. cuz I beat them real quick. They I didn't get one hit on me. Oh, gotcha. Yeah, cuz in the footage I saw we couldn't record our boss footage. Oh, got you. You just saw the campaign. I was testing the waters. Holy [ __ ] There you go, Andy. Overure is available today across all platforms play. So enjoy it this weekend. All right. Next up, the small video game publisher, Colorado shared this game with me a few months back with a DM",
            "start": 4626.16
        },
        {
            "text": "Andy. Overure is available today across all platforms play. So enjoy it this weekend. All right. Next up, the small video game publisher, Colorado shared this game with me a few months back with a DM that said, \"DOkyoki Literature Club meets Silent Hill.\" That piqued my interest on top of [ __ ] up. What? [Music] Holy [ __ ] Why does her eye look like Chucky? I sit at the front of the dinner table where he used to be. What is happening? Plates of food. Did somebody take over Barrett's mic? [Music] I don't like this. I don't like it. Beautiful. [Music] Broken. Find the shotgun. [Music] The garden is left. I ain't playing this [ __ ] man. [ __ ] I'm not playing this [ __ ] man. It's doing a lot. Dinner's ready. That was bad. I've been doing it for like the last 30 seconds. There's a hunger that feeds and blooms and I will feed and I will bloom. I will. Thank you. I don't [ __ ] with this. Yeah, when they said doky doi and silent hills like oh you know that's about to be [ __ ] it. I",
            "start": 4692.48
        },
        {
            "text": "that feeds and blooms and I will feed and I will bloom. I will. Thank you. I don't [ __ ] with this. Yeah, when they said doky doi and silent hills like oh you know that's about to be [ __ ] it. I wouldn't recommend eating those tomatoes. All right. And NCOFT is expanding its Blade and Soul universe. Let's take a look at the rich lore and dynamic action in Blade and Soul Neo just out on Steam and Blade and Soul Heroes coming soon. God damn it. I'm just like cuz I still not doing Night Rain. I'm not quite ready to start the Lies of PE DLC. I'm like a little one chapter behind. Damn it, R. I just want to play my Switch 2 this weekend. I know, right? Like I'm trying to hop into Delta Rune. And also, we're still reviewing Death Raining 2. Or at least I'm reviewing Designing 2. That's a cute little wolf. Guy's cute. Chris Angus says, \"Andy, we got to get back to rivals.\" Also, shout out to Haidider 700 who did super chat again and said, \"Simply put, I'm an embarrassment.\" And just a heads",
            "start": 4792.16
        },
        {
            "text": "wolf. Guy's cute. Chris Angus says, \"Andy, we got to get back to rivals.\" Also, shout out to Haidider 700 who did super chat again and said, \"Simply put, I'm an embarrassment.\" And just a heads up for you boys, it seems like we're about we're about to hit an hour into the show. That's a bummer. So far, I'm well. Yeah. I mean, minimum 7.5 with the lies of be. [Music] What I need is everybody in the chat right now, tell your rich relatives to give me money. Oh. So that I could fund a single What the [ __ ] Oh [ __ ] A single player game based on spellbound. Spellb breakak. That one was a 30. Oh, yeah. You like that one? That game was so cool. That That was the one with all the elements. Yeah. Such a magician mage. What are they doing? What is [Music] this crystal? Oh, it's a crossover with some game. I don't know. The game that we just saw, I think. No, that's a different game. Oh, is this a different one? I don't know. Which is this where the game's ending? They're all running",
            "start": 4865.28
        },
        {
            "text": "with some game. I don't know. The game that we just saw, I think. No, that's a different game. Oh, is this a different one? I don't know. Which is this where the game's ending? They're all running together. We had Blade and Soul Neo, Blade and Soul Heroes, then Crystal of Atlan cross, One Punch Man. Now it's Se the Seven Deadly Sins Origin. Okay, this is a very bad segment. This is bad. This is the worst I've seen in a very long time. This is the usual paid part where Jeff hands it off and all right, now we're going to watch a bunch of trailers back to back to back for games. Say the name of this one again. The Seven Deadly Sins Origins. Um, you can follow along on in the documentary. Thank you. I'm Seven Deadly Sins is like a Netflix anime, isn't it, Barry? Well, it's from the Bible. Well, [Music] They might be unregulated. Covet. No, Coveting is not a seven. No, that's one name. Yeah. Yeah. Sloth. Sloth is one. Yeah. Damn, I should know this better. Wrath. Wrath and Wrath is like my",
            "start": 4940.2
        },
        {
            "text": "[Music] They might be unregulated. Covet. No, Coveting is not a seven. No, that's one name. Yeah. Yeah. Sloth. Sloth is one. Yeah. Damn, I should know this better. Wrath. Wrath and Wrath is like my favorite one. And horn is the seventh one. I know. I know. Jeff Key for $12. I like in cut to like a black screen. I'll go. And next up, this is Seven Deadly Sins from blah blah. And that's all you pay me that. Let me you know, we'll differentiate these little block breakups. Uh pride. There's that's it now. Oh, here you Okay. Oh, winter for no. All right, cool. What is happening? Let's just speed right past the Witcher 4. Well, now it's Unreal. Yeah. Yeah. Yeah. This is a technological showcase set in the world of The Witcher 4. Human creator is now fully integrated into Underland. Yeah. Like I understand this is like the commercial segment, but I feel like he didn't throw to it. He doesn't want to say this is the bathroom break. Yeah. But like it felt like it was very much core like a",
            "start": 4987.11
        },
        {
            "text": "I understand this is like the commercial segment, but I feel like he didn't throw to it. He doesn't want to say this is the bathroom break. Yeah. But like it felt like it was very much core like a core part of the show. Usually like there's a level of okay this is for sure on the Epic Game Store. Like this segment should have started with this. Yes. This trailer. Yeah. This game looks cool though. We find a way. Wa. What is this? Infantessimals. Infantessles looks like sequel to Gorgonite. How do you keep referencing the Gorgonite? Oh, god damn much. It means so much to me. We altered. Is it finally happening? Unleashed genetic power across continents. Now it is up to us. Is that actual gold? Nurture. Is this the sim? The park sim again to find hope. Third one of the franchise. I forget if they announced this already. I thought I thought I don't think so. He He did the narration for the last one, too. An allosaurus, by the way, fine. Are you a dinosaur guy? I'm dinosaur guy. Blessing.",
            "start": 5060.48
        },
        {
            "text": "they announced this already. I thought I thought I don't think so. He He did the narration for the last one, too. An allosaurus, by the way, fine. Are you a dinosaur guy? I'm dinosaur guy. Blessing. Yeah. During Jurassic Park review, Andy was dropping stuff that I swear to God, he was like, he had a Wikipedia up when he was just [ __ ] with us. He knows all the dinosaurs. I never pinned you for a dinosaur guy. My favorite is I know I've known this for a long time in the uh Berry Discovery Museum that Ben's obsessed with is doing a big dinosaur exhibit. So, I sent him a bunch of photos of it. You should come sometime and not two weeks later got the photo just a photo sent to me of it. I was like god damn you it was my first time in a Golden Gate Park. Wait, how how long ago was that? What? Couple months ago. Let's go, baby. Come on. 10 years ago, we broke new ground with our first game, Shovel Knight. Today, I'm thrilled to share a world premiere look at our next IP, Mina the Hollower.",
            "start": 5122.64
        },
        {
            "text": "Couple months ago. Let's go, baby. Come on. 10 years ago, we broke new ground with our first game, Shovel Knight. Today, I'm thrilled to share a world premiere look at our next IP, Mina the Hollower. Yes. Mina continues our traditions of refining retro gameplay for a new generation. It's a bone chilling adventure that it blends intense combat, free roaming exploration, and precise platforming. As Mina, a whip wielding hollower, you'll burrow through danger and unravel the mysteries of a cursed island. A decade ago, we unearthed a groundbreaking legend. This year, we're bringing our next bonafide classic. [Music] I almost got to play that GDC. Not this past month, prior year. Line was too long. Cop show. Yeah. October 21. Yes. 31st. Yes. 31st. Yeah. Oh, sorry. Little Halloween action. [ __ ] yeah. This game's going to kick ass. Feels like a Zelda. Yep. [ __ ] it. Oh yeah. [Music] Whoa. We were talking earlier today about how I've not really gotten into like any Zelda 2D Zeldas. Yeah.",
            "start": 5162.64
        },
        {
            "text": "yeah. This game's going to kick ass. Feels like a Zelda. Yep. [ __ ] it. Oh yeah. [Music] Whoa. We were talking earlier today about how I've not really gotten into like any Zelda 2D Zeldas. Yeah. But if Do we count Chory? Yeah, cuz I I did love now. Oh, that's cool. Nice. What about pee strelo? I'm not I've not started it. Booted it up. Played like an hour. Next comes from a well-known developer that has done Yeah. Kyle Kyle Bossman, everyone. Final boss. All right. One more thing to show for Jeffy Smash. Right. Oh, hey Jeffy. If you're reading this, it means three things. Number one, you're killing it at the fest with your oodles of totally natural charisma. Mike's taking over. I'm at your house playing long darts with the fam. And three, Deadpool. Oh, you're going to do me a solid and skip that Silk Song trailer so you can pimp my revolutionary VR gaming venture that will shock the industry probably. A wet one on the lips, waved. Very cool. All right, let's take a look. [Applause] I",
            "start": 5232.56
        },
        {
            "text": "that Silk Song trailer so you can pimp my revolutionary VR gaming venture that will shock the industry probably. A wet one on the lips, waved. Very cool. All right, let's take a look. [Applause] I love that they took the silk song thing. That's a great call. Handcrafted with cuddles by the merk with a metaquest. Kick back and bask in the glory of gaming's first quintuple egg tropical farming sim experience. Big old Neil Patrick hairs. Oh, hi new friend. I feel escape the turd burger of latestage capitalism and enter a world of VR magic and wonder. You'll care for exotic pets, the elderly, and this [ __ ] thing with hip hop Satan. Oh, don't worry. He deserves this big time to No, wait. What the Ezekiel? Yeah, Ezekiel signal demon. I wiped my ass on this first. You're welcome. Doug says, \"Is that Neil Patrick Harris?\" That is Neil with He was in Deadpool inside me come true in VR. Spider-Man gets Insomniac and I get this [ __ ] that might I played it. I did this demo already. I'm",
            "start": 5303.12
        },
        {
            "text": "\"Is that Neil Patrick Harris?\" That is Neil with He was in Deadpool inside me come true in VR. Spider-Man gets Insomniac and I get this [ __ ] that might I played it. I did this demo already. I'm embargoed and no longer embargoed. It's Neil Patrick Harris's Deadpool. In his ear is the one and only Cal Penn from Harold and Kumar go to White Castle doing a shield thing. Last year at games last year, I enjoyed it. I think my biggest let down of it was Neil Patrick Harris. I don't think he's I don't think he's caught somewhere between Nolan North and Ryan Reynolds. Hopefully with the entire thing, you'll be able to feel it out and find it. But we'll talk about this in the post with some big news. The release date [Applause] Check. Go Dynamite the Beast. What can you tell me about the Baron? He's a narcissistic sociopath. He's experimenting on humans like they're lab rats. [Applause] God only knows what the baron's planning to do with those monsters. It's crazy having an investment in this",
            "start": 5371.68
        },
        {
            "text": "a narcissistic sociopath. He's experimenting on humans like they're lab rats. [Applause] God only knows what the baron's planning to do with those monsters. It's crazy having an investment in this because I played Dine 2. Like we played Dy Light 2 and liked it a lot up until the end. Up until up until that very last fight. I'm like, I guess I'm going to die like that. Sick jumps. [Music] I don't care how high his walls are or how big his army is. That [ __ ] will pay for what he did to me. All the years he took for me. All the agony he put me through. You want revenge? Damn right I do. God damn. Dying like the beast. I forget what's the the deal with this. Is this multiplayer or is this straight up just a single player champion? This is the single player one. Gotcha. Kyle E and F is an old chemical factory south of the city. The Baron's men operate out of there. Then I'll go there and [ __ ] kill him. Hell yeah. Oh, look a promo for the IGN life or IGN life. There's the big news.",
            "start": 5440.16
        },
        {
            "text": "old chemical factory south of the city. The Baron's men operate out of there. Then I'll go there and [ __ ] kill him. Hell yeah. Oh, look a promo for the IGN life or IGN life. There's the big news. Dying like the Beast is coming on August 22nd, Gamescom week. All right. This next game draws inspiration from classic coming of age films to capture the highs and lows. The bonds of friendship and the nostalgia of growing up. Dude, mixtape comes from Beethoven Dinosaur. Interactive. If they give us a 2025 release date, y'all are cooking. That plays like a love letter to teenage memories. Say 2026. For the love of God, this is like going to determine a lot. Yeah, I counter picked this. Getting buzzed. I've got to get out of this place. [ __ ] off. [ __ ] yeah. So cool. I need this to come out of here. It looks too good. At the end of an era when everything's about to change, it's time to look back on your greatest hits. Mom, who is it? One moment. It's the pigs, darling. [ __ ] [Music] This",
            "start": 5530.24
        },
        {
            "text": "here. It looks too good. At the end of an era when everything's about to change, it's time to look back on your greatest hits. Mom, who is it? One moment. It's the pigs, darling. [ __ ] [Music] This year, experience a retrospective cook. Beethoven and Dinosaur invites you to relive the teenage riot. To spend one last night together before school's out. So good. And with the soundtrack this good, it's going to be one hell of a And the cure. I love the Stan Bush, dude. [Music] Experience it for yourself. Next tape. Nothing but the hits. Don't get too excited. I mean, they said this year. They said this year. We knew 2025 already, so there's still a chance it gets delayed. Yeah. But the fact that they're still seeing it, I'm so excited we're seeing it again, man. That's awesome. A beautiful world where harmony reigns. Will you struggle until your last fleeting moment? Your destinies are sealed. There is no escaping them. That is why we must end you right here and now. It's like a mythic",
            "start": 5588.48
        },
        {
            "text": "world where harmony reigns. Will you struggle until your last fleeting moment? Your destinies are sealed. There is no escaping them. That is why we must end you right here and now. It's like a mythic question. Yeah. On your go. This is gorgeous. Greg [ __ ] Take this. Industry. Put it into action. Crafting blacksmith power. Savor each moment. That like perk screen didn't really do it for me. Get ready. Four is too many. You got to keep the three. I want three choices. Are you with me? [Music] We will live on in this world. No matter what hardships await, people are going to be so horny for that big fish. I can tell. We fight for a future filled with hope. It's already happening. It's already trending. I thought you meant it was happening in that room you're sitting in right now. Tier two. Yeah. Our mixtape. That's an infernal one. That's a secret tree. They give a date in their email. What's up, A beautiful game. That was the global announcement of Toa. A new rogike from band",
            "start": 5665.36
        },
        {
            "text": "two. Yeah. Our mixtape. That's an infernal one. That's a secret tree. They give a date in their email. What's up, A beautiful game. That was the global announcement of Toa. A new rogike from band brownies. A game draw that one. A whimsical spin looks good. I love that's what I said when they did the first. Next, we want to introduce you to a game. First time solo developer in Bang, Indonesia with the help of nine of his friends. An intense action. I mean, if I had booked an appointment, I wouldn't be able to say anything to my knowledge. This is axe. What? I don't know. I don't know. fighting ax or what? They'll leave me with nothing. Oh, dude. This game [ __ ] like Sefue sort of looking. Oh, yeah. I have this wish list. This game looks awesome. The hunt isn't over. This is one of those Twitter games. I see it Twitter games, dude. See it a bunch wish list and [ __ ] Damn. Damn. Damn. At some point I want to do my wish list episode cuz I got a bunch of things on there. A bunch of",
            "start": 5744.32
        },
        {
            "text": "Twitter games. I see it Twitter games, dude. See it a bunch wish list and [ __ ] Damn. Damn. Damn. At some point I want to do my wish list episode cuz I got a bunch of things on there. A bunch of people that play C2 and went you want to make this too. Yeah, it just looks right. Yeah. Yeah. Hell yeah. The Johnny Warren, have you checked out Dead is Disco? It's on my wish list. Is there a demo? There's a demo on No, I have not. Yeah, you should check it out. Heard a lot of people recomo it. A lot of red codes. It still feels extremely early, but it's Sefue as a rhythm game essentially. God damn. Holy [ __ ] Oh my god. [ __ ] yeah. So blood axe. Oh, it's even cooler. Summer 20s. Oh, grad. Amazing what these solo devs could do today. Now it is time for the reveal of the next game from Montrealbased Tribute Tribute Games, the makers of TMNT Shredders Revenge and Marvel Cosmic Invasion, which you saw a little bit earlier. If you're like me, you've been waiting for more than a decade for",
            "start": 5796.56
        },
        {
            "text": "Tribute Tribute Games, the makers of TMNT Shredders Revenge and Marvel Cosmic Invasion, which you saw a little bit earlier. If you're like me, you've been waiting for more than a decade for this reveal. What Simpsons? Like what could it be? [Music] Scott Pilgrim. That's what I was going to say. Oh, it's got to be. Yeah, it is. Crazy. This is what a perfect combination of things. Cool. [Music] We're back. I want to return for this. Y'all didn't watch the anime on Netflix, you need to. Very [Music] good. Is it the [Music] Gucc Oh, [ __ ] yeah. It's a brand new adventure. [Music] Ex. Awesome. That's a great name for a game. That's a lovely ties into a brand new brawling adventure. In EX, you'll battle through spaceime and the streets of my hometown of Toronto with Scott, Ramona, and five of their former rivals in this online four-player co-op adventure with a story written by Scott Pilgrim creator Brian Lee Maui. Awesome. All right, we're going to be right back. But first, we have a very",
            "start": 5879.12
        },
        {
            "text": "former rivals in this online four-player co-op adventure with a story written by Scott Pilgrim creator Brian Lee Maui. Awesome. All right, we're going to be right back. But first, we have a very special message from Maggie Robertson, TGA winner in 2021 for her performance in Resident Evil Village. Mom, there you are. Wait long. We've been preparing delightful ways to make you suffer. Are they doing something? So, enter the village if you dare. We've slashed the price to be lower than ever for you simple little man things. Still thirsty. Worry. Oh, I heard it's like 10 bucks, right? Ungrateful wretch. I think it's there's plenty on sale for 10 bucks right now. Now, cease this foolishness and make your decision wisely to prepare for Nope. Well, no. This he's he he teed this up as a break. I'm going to go pee. That's what I was talking about. Like that's a good throw to a break. Yeah, the one from before I just didn't pee. Jesus Christ. Yeah, this game went like full full Gooner. It was",
            "start": 5984.24
        },
        {
            "text": "going to go pee. That's what I was talking about. Like that's a good throw to a break. Yeah, the one from before I just didn't pee. Jesus Christ. Yeah, this game went like full full Gooner. It was such a like I had I had such high hopes for it after playing it at Summer Game Fest last year. I think it was like me and Huber in the room. We walked out like wa that was awesome. It was great. just for like a cool co-op shooter and then you know it's free to play and you're buying heroes to play as. Yeah. Uh and you know, look, I'm not going to complain about a titty, but it's just like it it like it went really really really deep into I feel like there's a lot of titty this summer gamefest. Yeah, for sure. It it feels like the titty ratio has gone up a little bit. We'll see the stats after the show. Time humankind obsessed. Look at me again. the [ __ ] Don't you say that? Also, I'm going to force myself to get into beat ups cuz I want to play that Scott Pilgrim. I will say the Scott",
            "start": 6040.64
        },
        {
            "text": "the show. Time humankind obsessed. Look at me again. the [ __ ] Don't you say that? Also, I'm going to force myself to get into beat ups cuz I want to play that Scott Pilgrim. I will say the Scott Pilgrim isn't my favorite of them. Scott and stuff, but like but maybe this will the issues that I had. Yeah. Like the like the You talking about the Ubisoft being tribute. Yeah. Yeah. like when they released it on like modern stuff and it was like my first time playing in a long time. It was like yeah this is this is an older one. I remember playing it. Yeah. When they released it and like very quickly I was like okay yeah there's another beat him up. Like this is kind of it's the same issues that I have with all the beat him ups that I try similar to where the weird depth of Yeah. I'm like the movement doesn't feel right. Like it's going to be seu. I want to play Sefue. [Applause] Here we go. Bless. Let's learn all about it. Oh man. Mind's eye. Oh, it's Roger. What are you doing? [ __ ]",
            "start": 6083.52
        },
        {
            "text": "movement doesn't feel right. Like it's going to be seu. I want to play Sefue. [Applause] Here we go. Bless. Let's learn all about it. Oh man. Mind's eye. Oh, it's Roger. What are you doing? [ __ ] Roger, what are you doing? Come with me. Out of the back door. [Music] At first, I thought it was just broken synapses in my head. Keep your lens feet on. years. Isn't it really [ __ ] up that like when something out of the ordinary happens, I think I'm being pranked by Greg. It's a very down deep. Greg walks to the restroom and Roger comes in through the back door of the studio and we go, my mind goes, what's happening right now? Oh, I thought you talking about the song that was playing during the mind's eye. Oh, no. I was like, yes. I was waiting for Greg's face to pop up for you were a good Is this just Is this the only ad section or are we actually getting a deeper? I'm pretty sure this is the ad section. Yeah. This was the Gears of War, right? Yeah. Yeah. Yeah. I mean, I know what song",
            "start": 6135.76
        },
        {
            "text": "this just Is this the only ad section or are we actually getting a deeper? I'm pretty sure this is the ad section. Yeah. This was the Gears of War, right? Yeah. Yeah. Yeah. I mean, I know what song before Gears ago, you know. Nobody cares. Twitch.tv kind of funny. Doesn't really work. That game comes out in 4 days. Yeah. Yeah. That's insane. I cannot wait. Shocking that we haven't gotten [ __ ] around. It man cross mind's eye come summer 2025. That's a big oof. What are you doing? Hi everyone. I'm Hakan Abra, CEO of Attractive. We can't wait for you to discover Mindsight when it launches on June the 10th from Build a Rocket Boy and IO Partners. And yes, you may have noticed Agent 47 will be contracted for a very special assignment in Red Rock City. This week, Red Rock City. This week, we finally revealed 007 First Light to the world, and your reactions were heartwarming. It's coming in 2026, but we want to make uh the wait more exciting. We are bringing someone into Hitman: The World",
            "start": 6195.2
        },
        {
            "text": "finally revealed 007 First Light to the world, and your reactions were heartwarming. It's coming in 2026, but we want to make uh the wait more exciting. We are bringing someone into Hitman: The World of Assassination who is very dear to the Bond universe. Let's take a look. [Music] Who's going to be y'all? Your target is the elusive shadow banker known only as Lashifl. forgotten she used a highstake poker game at the Monik in Paris. Our clients have deemed this unacceptable. I've invited these people for a reason. I know their weaknesses. I'm looking for my BB. Mr. Renan, he's too impatient. And Miss B, well, she likes a drink. Don't know about the newcomer, Mr. Smith, though. He's the only wild card. Well, this is turning into an interesting evening. Welcome to the VIP room here at the Casino Monarch. Reaper. Unusual name. Names are for friends. Wouldn't you agree, Mr. Lucifa? Tim, you ever played Hitman? I mean, yeah, I never beat any of them. I played a fair amount. Like, there you",
            "start": 6265.64
        },
        {
            "text": "Monarch. Reaper. Unusual name. Names are for friends. Wouldn't you agree, Mr. Lucifa? Tim, you ever played Hitman? I mean, yeah, I never beat any of them. I played a fair amount. Like, there you have it. Hitman and 007 are coming together in a very unexpected way. We know our players waited a long time for 007 first line. It's just around the corner, coming out next year. However, Hitman is live right now. So, I thought, why wait? And I asked a fellow Danish friend to join me here. As a matter of fact, he is here with us today. That's right. Everyone at Summer GameFest, please welcome the great Mads Mikkelson. Oh man, him and Kajjima have been just ripping it up backstage. You're going to get so many [ __ ] photos. Good to see you, Mads. Thank you for joining us. Thanks for coming to Summer Gamefest. Uh Mads, you are Cliff, but you're also Agent 47's next target as Lifra, uh the villain we know from Casino Royale. Yep, that's it. And you know, this is I've always had a deep love for",
            "start": 6336.48
        },
        {
            "text": "Gamefest. Uh Mads, you are Cliff, but you're also Agent 47's next target as Lifra, uh the villain we know from Casino Royale. Yep, that's it. And you know, this is I've always had a deep love for this character. It's it's a role that means a lot to me because of a lot of reasons. So when Hagat gave me the chance to step into the shoots of the shifer once again, I did not hesitate for one second. But this time he's a little different. Great head of hand. He's more confident. He's dangerous. He's not just a brilliant mind hiding behind a desk. He's visceral, unpredictable, and ruthless. And uh let's just say this time he doesn't outsource the violence anymore. I would love to have the career of Mad Maple. He's always had a good career so far. Mission is set in in a casino in Paris movie Casino Royale while keeping surprises for our players. James Bond and Agent 47 have very different set of skills and the mission will be handled in very different creative ways. Yeah. He's not going to",
            "start": 6395.64
        },
        {
            "text": "Royale while keeping surprises for our players. James Bond and Agent 47 have very different set of skills and the mission will be handled in very different creative ways. Yeah. He's not going to beat me in poker. He's going to figure something else out. So, I guess it is not just about the shot, it's about the the bluffing around the table this time. Yeah, sure. Exactly. is uh the shifa is always like two steps ahead of you. He reads you before you read him. So it's a little like bringing a chess player to a poker game. We built a mission to allow several parts, unexpected characters, appearances, and even custom poker mechanics. Wow. No hesitation. Wasn't even not a chance. We want you. So the team is updating the game as we speak. Le elusive target mission starts today in a few hours for only 30 days and if you play it you will unlock a unique reward in 007 first night. Amazing. All right. Well, Hakan Mods, thanks for joining us for Summer GameFest. Appreciate it, guys. Thanks for",
            "start": 6448.36
        },
        {
            "text": "only 30 days and if you play it you will unlock a unique reward in 007 first night. Amazing. All right. Well, Hakan Mods, thanks for joining us for Summer GameFest. Appreciate it, guys. Thanks for having us. Good incentive right there. Great stuff. All right. Now, here's the announcement of a new party game coming later this year that will delight LEGO fans. Made with over 1 million Lego bricks, 300 minigures and over 700 trillion minifigure combinations. Lego Mario Party. It's Saturday night. So, make some noise for Lego Party. Get ready for a nailbiting competition. We're minifigures. We don't have nails. It's an action-packed contest to collect the most golden bricks. But will you be helped by friendly or hindered by evil monsters? Or lightly toasted by a flying lizard with wings? That's a dragon, Ted. And what about our amazing mini games, Ted? We've got more of them than you can count. We'll crash. It's actually This will be my number one or number two. a lot with surprises",
            "start": 6503.68
        },
        {
            "text": "That's a dragon, Ted. And what about our amazing mini games, Ted? We've got more of them than you can count. We'll crash. It's actually This will be my number one or number two. a lot with surprises around every corner. Anything. This is a game that will come out for PS2. Anything. Anything. Yes, anything. Okay, but certainly not a giant crap for master. Face and clear. Greg, why would you monkey paw this? What did I do? I didn't I wanted I want regular Lego games. Lego party. It's one of those things where like When we look at that super great ray tracing Lego game, everything else looks like [ __ ] Everything else looks so flat. But it's a normal thing where like the one we just saw. Yeah. You're like, \"Okay, cool.\" Like that looks like it's got personality to like Well, they're not going to put Mario Party everywhere. Games 20 players across five ships venture into the most treacherous region of space hoping to get their hands on the artifact. The game is called Wildgate and the",
            "start": 6561.44
        },
        {
            "text": "to put Mario Party everywhere. Games 20 players across five ships venture into the most treacherous region of space hoping to get their hands on the artifact. The game is called Wildgate and the open beta starts next week during Steam Nextfest. And we're also very happy to announce the game will launch on July 24th for PC, PlayStation 5, and Xbox. Let's see what it means to get into some serious space shenanigans. I love space shenanigans. Nope, I'm good. Danger. I booted into this. It's kind of fascinating. I I didn't love the the sort of need to have multiplayer pe, you know, multiplayer people on ships, but it's one of like three or four different games doing a very similar thing where it's you and your crew on a ship. It's Sea of Thieves in space kind of, but you know, you find a ship, you break into it, you fly in, you'll like steal their good engine part and bring it back to yours and install it. Their ship is and it's very like user friendly. It feels and looks a lot like",
            "start": 6621.68
        },
        {
            "text": "ship, you break into it, you fly in, you'll like steal their good engine part and bring it back to yours and install it. Their ship is and it's very like user friendly. It feels and looks a lot like Overwatch. Like ratchet and clank in Overwatch. Do you like doing heists on other people's ship, but I didn't get to experience a whole lot of the PVP stuff cuz there's another game like this called Jump Ship that just kind of had its demo come out a couple days. Dude Law says Andy's willing to try different type of games. Mad respect game from Toronto based Drink Studios. the team behind the drink and nobody saves the world. They're making a full 3D game that can be played alone or with a friend in co-op. You can find out more during Day of the Devs right after the show. But for now, here is the global reveal of blighted. Interesting. Always a blight. Always a scourge. Always world. What if it's a seed successor? How did it put Se on the screen? Put sever on the screen with the ancient",
            "start": 6677.08
        },
        {
            "text": "the global reveal of blighted. Interesting. Always a blight. Always a scourge. Always world. What if it's a seed successor? How did it put Se on the screen? Put sever on the screen with the ancient rituals. The dead buried with a seed from the trees of memory. Those who ate of the fruit saw the lives they lived. Why would you eat their fruit? Pass their knowledge. Kind of reminds me of nine souls right now. until Sorcisto in his lust for power consumed the brains of the living spreading this blight. You harbor it too, I see. Oh. Oh. Wa. [Music] What a good art style. So, so good. [Music] Should you fall, pray the vultures consume you. Oh, man. Damn. Before the bite does. Super. Super Giant's like, \"Oh [ __ ] what the fuck?\" Steam. Damn. They're coming for us. What's it called? Blighted. Yeah, there is more bled coming up right after the show in Day of the Devs. All right. Next is a firstperson survival action horror game from Team Cloud50 with founders in Canada and Armenia. They",
            "start": 6729.92
        },
        {
            "text": "Yeah, there is more bled coming up right after the show in Day of the Devs. All right. Next is a firstperson survival action horror game from Team Cloud50 with founders in Canada and Armenia. They partnered with the new Munfish powerhouse label to bring this insane Unreal Engine 5 game to life. Everywhere on this one dismemberment. Here is your first look. Got Dazzlow in the chat. Oh no. Oh this god. Oh godes. [ __ ] this. Where was the dinka? Gross dude. I don't like fingers. Oh, what about that? You like that? I turn you around. Stop. Jesus, dude. People are messed up. Like people made this. This looks unbelievable. Everything's so wet. It looks so good. Somebody says you were asking for the bulge. That is true. We were asking for Dom. We did ask for do a lot of titties on the show is what I said. Wow. [ __ ] that. That dude walking through that room. Bless woman swipe right on that before she swipes right on us. You know what I mean? That's crazy. It's cuz they're tall, you know?",
            "start": 6817.04
        },
        {
            "text": "what I said. Wow. [ __ ] that. That dude walking through that room. Bless woman swipe right on that before she swipes right on us. You know what I mean? That's crazy. It's cuz they're tall, you know? 6'7. It's like just cuz I'm 5'11, I'm not ei Jesus. [ __ ] this, man. [Laughter] God, why does it It looked way too good. Poor little baby. All right. Mecca Break is one of 2025's most anticipated shooters with its previous beat amassing over 30. I was thinking the same exact thing. I feel like it was another game that came out in total. In this game, you explore a sci-fi universe and pilot powerful mechs with immersive aerial and ground combat. As a top wishlisted game, players are clamoring to know just one thing. When is the release date? Well, here is Mecca Break's latest trailer with the answer you've all been waiting. customization in this game is just like so unmatched and amazing. But I like just just make an armored core single player game. Oh my god. And don't ever pick the",
            "start": 6894.32
        },
        {
            "text": "the answer you've all been waiting. customization in this game is just like so unmatched and amazing. But I like just just make an armored core single player game. Oh my god. And don't ever pick the light class. The super fast swift dude. I died a million goddamn times as that class and I was so mad. So hard. This looks like a like a cinematic cut scene you'd see pre-rendered one in like an old game. Yeah. Like not quite great. But at the time 47th game so far, by the way, about half an hour left to go. Tired. I'm so tired. Mike texted me earlier. Damn. October. That could have been the game of the summer. What game? What game is coming out on October 30th? Is it? Uh, it was the one that I had I had. Was it Mina the Holler? That's Dark Raiders. 10:30. Oh, Dark Raiders. That's what it Yeah, it could have been the game of summer. Mike, hope you're getting better out there, Mike. Mike, go to rest up, Mike. Yeah, go to a doctor, Mike. Mike will be here Sunday hopefully. [ __ ] go to a",
            "start": 6957.04
        },
        {
            "text": "it could have been the game of summer. Mike, hope you're getting better out there, Mike. Mike, go to rest up, Mike. Yeah, go to a doctor, Mike. Mike will be here Sunday hopefully. [ __ ] go to a doctor, Mike. [Music] There was just so much liquid in his voice as he was talking to me last night. Do you think he's taking an antibiotic yet? No. I'm telling him I'm probably just going to give him some that my mom buys in Mexico. Do you think cuz like he's too lazy to get a Do you think Tim gets back from hooping before this trailer ends? This [ __ ] is gone. I mean, it's Yeah. July 1st, everybody. Who's in this next title, smallcale players traverse the oversized world around them, filled with local wildlife and hostile machines built by a small eightp person studio. This is infinite decimals. Oh, it's the one we just saw. The Gorgonites. Right, man. Epic is publishing a lot of stuff, too. That was the longest trailer of all time. There was a debate if you'd get back in time. Mechanical",
            "start": 7034.48
        },
        {
            "text": "Oh, it's the one we just saw. The Gorgonites. Right, man. Epic is publishing a lot of stuff, too. That was the longest trailer of all time. There was a debate if you'd get back in time. Mechanical approaching. UAV online. What was this one called? Infinite testicles. Good luck asking for that at your best buy. Am I right? We must now face a stark reality. [Applause] [Music] The industrial civilization we were expecting to join. Whoa, that's a cool looking vehicle is no more. [Music] You see a couple Pikmin pop [Music] up. Character grounded. Whatever it takes, we find a way. That looks like an ornithop there. Bless. I just love saying that word. Yeah. 2026 marks the 30th anniversary of a legendary video game franchise that I think we all know very well. Halfife. Please check this out. Halfife 3. Happy birthday. Let's go, dude. Uhoh. Happy birthday. Remake of one. Full remake of one. No, that was one. This is two. Oh, damn. Happy birthday. Jeff took it from PlayStation. Happy birthday.",
            "start": 7097.12
        },
        {
            "text": "3. Happy birthday. Let's go, dude. Uhoh. Happy birthday. Remake of one. Full remake of one. No, that was one. This is two. Oh, damn. Happy birthday. Jeff took it from PlayStation. Happy birthday. Happy birthday to you. And to celebrate early, a special message from Get that bag. Let's go. That's it. No, he's still I need a glass of wine, too. All right. Thank you, Takuchi son, for that very special message. We cannot wait for when the time is right. Share more leading into the anniversary of Resident Evil. Now, it is time for the next big update. Have the screen go [ __ ] boo. Boo. is cuz the nine in Resident Evil 9 is actually no. Well, let Kenny Omega do his thing though. Hold on. Maybe he's going to be Res. I am Resident Evil. Let's rumble. Rumble versus back. Wait, look. Kenny Omega. No. Yeah. Yeah. It's Kenny Omega. All right. What's it hyper? Yeah. Is this just a fight the fighter pass thing? Uh, that makes sense. Yeah, it is for Street 6. Yeah, season 3. I wrote down Resident",
            "start": 7185.48
        },
        {
            "text": "No. Yeah. Yeah. It's Kenny Omega. All right. What's it hyper? Yeah. Is this just a fight the fighter pass thing? Uh, that makes sense. Yeah, it is for Street 6. Yeah, season 3. I wrote down Resident Evil 9, but like spelled N. How much of a pump do you think that he requested before? Like, let me pump for at least 20 minutes. Get my veins looking all good. It's a gassy grid. All right. [Applause] [Music] Blasto. [Laughter] Same silhouette. Julia ring. Get them all. Oh, they're finally announcing deadlock. Good for them. [Music] [Music] [Applause] What was the game from the Dishonored developers? Their last game. Death. Death loop. It's like they put death loop in Fortnite. Yeah, [Applause] last play. Every time I see a game, I'm like, what if it was single player? Then [Music] countdown begins. Okay, this sounds fun. This seems like straight up Team Fortress, too. Yeah. [Music] Adios. He killed Blaster. He blasted Blaster. [Music] wish list. Now, is there a demand for a Team Fortress",
            "start": 7283.68
        },
        {
            "text": "Okay, this sounds fun. This seems like straight up Team Fortress, too. Yeah. [Music] Adios. He killed Blaster. He blasted Blaster. [Music] wish list. Now, is there a demand for a Team Fortress game from a developer that's not Valve? Well, it's Cap. I mean, it's a Capture the Flag. That was Last Flag, a new online action game from the new indie studio Night Street Games, which is the ultimate game of Capture the Flag set in the 1970s. As you saw, the closed alpha will be starting later this year. Next, we have a beautiful new trailer for a Soulslike action RPG game developed in China by Lindsay Wu Chong Fallen Feathers, which is launching on July 24th. Here's a look. I played it, thought it was all right. Hope it's cooler. Is this bloodshed really what you wanted? Fate is all set in stone. You can't change how it ends. [Music] [Music] Oh, will it take to finally awaken Yeah, the white spectctor and the night spectre. Golf clubs. Let's [ __ ] go. Wuang. No way. Oh my god. Let's [ __ ]",
            "start": 7417.68
        },
        {
            "text": "You can't change how it ends. [Music] [Music] Oh, will it take to finally awaken Yeah, the white spectctor and the night spectre. Golf clubs. Let's [ __ ] go. Wuang. No way. Oh my god. Let's [ __ ] go. Finally. Holy [ __ ] [Music] After 20. Awesome. Or like gone awful. I don't want any ghost face killer where my heart find them. Whoa. Yeah. Yeah. [ __ ] yeah. Yeah. [Music] Oh, dude. Yeah. presented by Ghost Face Killer. Dude, that's [ __ ] awesome. Love that. Ghost Face Killer is calling on you to rescue his Woo brothers. Wu Tang Rise of the Receiver is a new co-op action RPG anime style fighting. It's the debut title from the 53 member Brass Lion Entertainment. Now, here's a new look at Guild Wars 2, which has new updates, including player housing and is free to play. This weekend, to celebrate, you can take advantage of double XP all weekend long. I love the premise, though. Yeah, that's great. Damn, Bill Wari's still gone. Still don't know. This is that MMO that after me and my",
            "start": 7510.96
        },
        {
            "text": "celebrate, you can take advantage of double XP all weekend long. I love the premise, though. Yeah, that's great. Damn, Bill Wari's still gone. Still don't know. This is that MMO that after me and my home me and a couple of my friends couldn't afford World of Warcraft anymore cuz it was 15 bucks a month. We bought this cuz there was no monthly thing. About a week and a half later, we're out by the Longhorn Landing Apartments garbage and throwing our [ __ ] games in the trash. We were so sad it wasn't World of Warcraft, man. They tried. They tried something. So depressed. I'm in game codes right now. Mainly for YouTube, but I think Roger, too. What code do you want? PlayStation. Um, I just got one. Oh, okay. Great. As I think it was being announced. Let me check my email. Roger, if you're watching, let me know. So that's one reason why I was like, you know, see if the shadow drop happens cuz we didn't get I was asked about, you know, review codes and like just silence. Yeah. So Tam",
            "start": 7650.8
        },
        {
            "text": "watching, let me know. So that's one reason why I was like, you know, see if the shadow drop happens cuz we didn't get I was asked about, you know, review codes and like just silence. Yeah. So Tam reviewed it. Yeah. Game. Why is it? Mhm. The DLC. Mhm. It's messed up. Got to get our cloud up. He knows the host of the game. Got to get our cloud up. Go host. I'm I'm give it waves. Damn. Splitgate. I was asked so much about that over the weekend. Dude, I' I've gotten so many commercials for Splitgate, too. Oh, really? Yeah. Commercials on like Twitch. On like Twitch and I I want to say Tik Tok also. Like just random ass places. [Music] I can't believe that Resident Evil 3. That was bad. Bad. I wonder if something fell through. Probably not, but you you hope. Cyberpunk. The trailer rendered in 240p. We [ __ ] up. We can't show it. I met Johnny Silverhand. Chip. Long story. Wake the [ __ ] up, samurai. Here is another game throwing back to a classic animation style. Enter a surreal world",
            "start": 7708.72
        },
        {
            "text": "in 240p. We [ __ ] up. We can't show it. I met Johnny Silverhand. Chip. Long story. Wake the [ __ ] up, samurai. Here is another game throwing back to a classic animation style. Enter a surreal world where you're a down on his luck outcast who has to battle his inner demons literally in this action rogike. Here's into the unwell. It's crazy what the word rogike does to me. As much as I hope that one day I can rid myself of this sickness, I see three options to upgrade. Oh, I pulled out his tooth. Gross. I get so excited. I get so [ __ ] hyped. I got extra health back on a critical. Oh, he's peeking outside. Oh, this one's light. Does lightning damage chains. I can make my dash invincible. Another relapse, huh? This is the flex. Get well soon. [Music] I love some Looney Tune [ __ ] Whoa, cool. Maybe it's too much for someone like you. I [ __ ] with this, dude. I [ __ ] with this. It's like Crash Bandicoot boss fights, but delusional. It won't always be so easy. Did they say the name of",
            "start": 7786.56
        },
        {
            "text": "Maybe it's too much for someone like you. I [ __ ] with this, dude. I [ __ ] with this. It's like Crash Bandicoot boss fights, but delusional. It won't always be so easy. Did they say the name of this? Into the unwell. I like this a lot. Yeah, this is cool. You still look a little unwell. He said it. Oh, there you go. You guys wanted it. There it is. Hey guys, I'm Ian Pru, the co-founder of 1047 Games. No, don't. When we started Splitgate in our dorm room, we just we're not taking it back way. Now, with the help from our amazing community, we've built Splate, too. Why not the way to do it? Because I grew up playing Jeff approved that and I'm tired of Call of Duty every year. [ __ ] And I wish we could have Titanfall 3. Yeah. Yeah. No, this guy's a loose cannon. With Splick 8, we asked ourselves, how would we take portals to the next level? What if you could portal to entirely different worlds? So, we combined the action, movement, and gunplay of arena shooters. During rehearsal, did",
            "start": 7864.96
        },
        {
            "text": "how would we take portals to the next level? What if you could portal to entirely different worlds? So, we combined the action, movement, and gunplay of arena shooters. During rehearsal, did no one say you got to keep your head up if you're going to wear that? Otherwise, it hides your eyes. You look like Battle Royale launches free right now, and it's [ __ ] awesome. Hell yeah, brother. He's speaking for us. Just look at that water placement. Excellently done. This is the epitome of sport. Yeah. Splitting survivors and jetpack geniuses. The movement is so fluid, so fast, you can't stop. You can't catch. And he complete the comeback. He's going to try. They shoot. He gets the kill. Now that's how you portal. They're not done yet. They got one. They got another. I'm going to do it. When we played the beta or whatever network test it was got our asses handed to us quite a bit, but like this is a fun time. It's such a good quality game. Yeah. And it just we're just in a different era",
            "start": 7941.44
        },
        {
            "text": "we played the beta or whatever network test it was got our asses handed to us quite a bit, but like this is a fun time. It's such a good quality game. Yeah. And it just we're just in a different era where it's just so hard to make these succeed. But it's like, man, what a [ __ ] dream awesome game that we would have killed to have as kids, you know? What's up with that closing circle? Was there? Yeah, he said battle royale. Oh, I missed that. Yeah, I was too focused on his [ __ ] hat. [Music] Final round. [Music] Last man standing. Victory. But there's also a few games that can make me look as incapable as I can because of just not understanding the whole Portals thing. Like once you get used to it, it gets really cool when you But at first it's really embarrassing. [Music] Have somebody style on your ass, go through a portal and you mind. Now we are honored to showcase the latest project from the talented minds at RGG Studio in Japan. Jesus Christ. There you go, Roger. You can not",
            "start": 7993.76
        },
        {
            "text": "style on your ass, go through a portal and you mind. Now we are honored to showcase the latest project from the talented minds at RGG Studio in Japan. Jesus Christ. There you go, Roger. You can not rest. Oh, this is the one that they showed at Game Awards, isn't it? Cool looking one. Thanks, Project Century. The one that looked way older. Yeah. This doesn't look that old, though. I mean, it didn't look that old. Yeah. Oh, yeah. Okay. I didn't know they had neon like that, guys. Let him in. Let him cook. All right. You just watch infant festival. Some kind of weird ass alien tiny people. No problem there. [Music] Okay. I want to play this. Yeah. [Music] Jesus. Don't just take it. What would be your reaction? We just do a molotov [ __ ] Got a name? Project's century. Marco Dto. Dito. A jab then, huh? Don't I look like one? You're not. So, what are you then? Hell yeah. Stranger Thing sick. That's a good title. Real good title took too. Yeah. You saw it at TJ last year as Project Century",
            "start": 8056.56
        },
        {
            "text": "then, huh? Don't I look like one? You're not. So, what are you then? Hell yeah. Stranger Thing sick. That's a good title. Real good title took too. Yeah. You saw it at TJ last year as Project Century set in 1915. And now the full name has been revealed. Stranger Than Heaven, the brand new title from RGG Studio. This time it's now 1943. RG. I'm sure more surprises are surely on their way. And you looked way older in terms of period. We're almost done here, but we do have I didn't realize your game. That was like very special global game announcement to share with all of you who've been waiting. Today, we've showcased a lot of projects from teams around the world, including many brand new studios, and we're proud of that. But this one comes from a studio that is no stranger to delivering blockbuster games time and again. When I first got a glimpse at this project last summer, I was absolutely blown away by the scale, scope, and ambition of this developer vision. Let's go. And while",
            "start": 8162.68
        },
        {
            "text": "blockbuster games time and again. When I first got a glimpse at this project last summer, I was absolutely blown away by the scale, scope, and ambition of this developer vision. Let's go. And while there are many places, really any place, this game could have been revealed, we are so deeply honored that we get to share it with the world right here at Summer GameFest. Getting choked up. He's getting choked up. Pedro FPM X files. Mega Man. Grace. Grace. Grace. Grace Ashro. Yes. Oh my god. Resident Evil Capcom character. Is that for this Resident Evil 9? Yeah. Coming. They got us with the fake out. The fake outs. You just look so Capcom. Yeah. If this is about the report you asked for yesterday, it'll be ready in three. No. Oh, no. Two days tops. Put a hold on that for now. We found another body. One that exhibits the same pathology investigation, right? The president's daughter. Now, I need a good technical analyst on this. Okay. I need your eyes on the crime scene. The Remwood Hotel. I",
            "start": 8233.12
        },
        {
            "text": "One that exhibits the same pathology investigation, right? The president's daughter. Now, I need a good technical analyst on this. Okay. I need your eyes on the crime scene. The Remwood Hotel. I heard Ashley Graham. Got a hotel. Love that. Your mother was Luigi's Mansion 3, but scarier. That's where your mother's, man. Alyssa died eight years ago. Perhaps it's time for you to face the past. Grace, she's upside down. Andy Alyssa Ashcrooft, there's a reporter in city. Could work. That could be her mother was murdered in a hotel. Stay close. They're coming. I know now that you're the one that I've been searching for. The special one. The chosen one. This Ashcraftoft. [Applause] Investigating all these strange deaths, huh? We need to keep our voices down. Have you seen the same [ __ ] I've seen? Please know that you are my hope city. Yes. The [ __ ] That's so cool. Oh [Music] [Applause] god. Requ. Oh yeah. Oh yeah. 227. No. Let's [ __ ] go. Yo, we're locked in for fancy critic, y'all.",
            "start": 8336.16
        },
        {
            "text": "seen? Please know that you are my hope city. Yes. The [ __ ] That's so cool. Oh [Music] [Applause] god. Requ. Oh yeah. Oh yeah. 227. No. Let's [ __ ] go. Yo, we're locked in for fancy critic, y'all. Blessie is locked in. I'm so [ __ ] locked in on fancy critic. I'm so screwed. It was the blink of an eye. Playable to fans this August. The Gamescom where will also be hosting opening night live on Tuesday, August 19th. Resident Evil Recquum marks a bold shift for the franchise, both in tone and gameplay. And today's reveal isn't just about survival horror. Expect highstakes cinematic action, too, with much more to share soon leading up to its launch on February 27th, 2026. Amazing. Thank you, Capcom. That was an amazing announcement. Glad we kept it a surprise. All right, that's going to do it for our live Summer Gamefest show. Let's thank our co-host, Lucy James. Didn't she do a great job, everyone? Lucy. Good job. Lucy got to see the trailer for the first time this. Oh, I can't believe",
            "start": 8430.4
        },
        {
            "text": "for our live Summer Gamefest show. Let's thank our co-host, Lucy James. Didn't she do a great job, everyone? Lucy. Good job. Lucy got to see the trailer for the first time this. Oh, I can't believe it. You kept that so secret. Very top secret. All good. All right. Well, there's much more SummerGamefest to come. Make sure to visit summergamefest.com to see a listing of all the digital events this weekend. You can watch and to highlight even more games, including the Xbox Game Showcase on Sunday. And stay tuned online to see coverage of many of the playable games at Summerfest Play Days that's taking place this weekend in LA. And make sure to stay tuned for Day of the Devs, which is coming up next with additional new reveals from incredible independent studios around the world and deeper looks at some of the independent games we showcased today. Thanks so much, everyone. Awesome. And thanks to you, Lucy. Great job co-hosting. All right, that's going to do it for Summer GameFest. We will",
            "start": 8513.12
        },
        {
            "text": "at some of the independent games we showcased today. Thanks so much, everyone. Awesome. And thanks to you, Lucy. Great job co-hosting. All right, that's going to do it for Summer GameFest. We will see you at Gamescom on August 19th. Thanks everybody. Spooky to see myself looking at a handsome Jeff. A beautiful Lucy. My [ __ ] bug shows up. Pizza hanging in my ear when you see yourself in the Switch. Live reaction to the Summer Game Fest 2025. We're about to do our Games Cast review of what we just saw and break down all of the things that we're excited for and things that we're not so excited for right after a quick break. [Music]",
            "start": 8556.24
        }
    ]
}