{
    "id": 14245,
    "video_id": "iJ-rOluaOQs",
    "show_name": "Kinda Funny Podcast",
    "hosts": [
        "Greg Miller",
        "Nick Scarpino",
        "Joey Noelle",
        "Mike Howard",
        "Danny Jolles"
    ],
    "title": "SnowBikeMike Eats Paper Towels - Kinda Funny Podcast",
    "description": "Download Cash App Today: https://capl.onelink.me/vFut/7u0sm0fp #CashAppPod Sign up with our exclusive referral code KINDAFUNNY in your profile. Send $5 to a friend within 14 days, and you’ll get $10 dropped right into your account. Terms apply.\n\n*Referral Reward Disclaimer: As a Cash App partner, I may earn a commission when you sign up for a Cash App account.* #sponsored\n\nGo to https://mood.com and use code KINDAFUNNY to get 20% off your first order.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1750714486,
    "duration": 4630,
    "transcript_chunks": [
        {
            "text": "[Music] What's up everybody? Welcome to the Kind of Funny Podcast. I'm one of your hosts, Greg Miller, alongside the producer/seducer, Nick Scarpino. What kiss? You're I was going to say like you're kiss. You elevate it every show with the outfits. Something's going on every time. Thank you. I have to, as you know, it's all uh uh function over form because I never know how freezing it's going to be. Yes. In this studio or hot, so I bring a windbreaker and also a winter coat for everything we do. Well, you're wearing this French t-shirt, which to begin with, right? Then you got nice socks on and not new shoes, but very clean shoes. I've had these for a while. These have I said they weren't new. The all-white shoe usually gets dirty very quickly. Joester also wears the Air Force ones. I'd also like to point out legit watch. You don't see that often in the in the 2025s. Somebody can still cuz everybody has an Apple. I wear an old school mechanical watch. I love it. It it chafes my wrist",
            "start": 0.04
        },
        {
            "text": "like to point out legit watch. You don't see that often in the in the 2025s. Somebody can still cuz everybody has an Apple. I wear an old school mechanical watch. I love it. It it chafes my wrist every single day and causes me so much pain. Like I have a dry spot on my hand right here from it and I just refuse to not wear it. How many watches do you have now? Cuz you like watches a lot. Just one. Okay. I was I couldn't remember if it was that you had one in Well, I have like a few that are like like you know like G-Shocks and stuff like that. But no, I don't know what a G-Shock is. It's cuz it's smaller like you know watch if I if it breaks or I lose it or whatever. It's not this one though. You care about this is a little harder. Yeah. To to to come by if I were to lose it. This will be tough. This will be tough. Yeah. Okay. Fair enough. Fair enough. I like that a lot. Yeah. Man who knows a lot about watches. Danny John. Hello Danny. Hey buddy. How are you? how you doing? I felt bad.",
            "start": 57.36
        },
        {
            "text": "This will be tough. Yeah. Okay. Fair enough. Fair enough. I like that a lot. Yeah. Man who knows a lot about watches. Danny John. Hello Danny. Hey buddy. How are you? how you doing? I felt bad. I went back. Of course, Danny, everybody knows. Yeah. You know, Danny, why? March 25th, 2021, he was on the kind of funny podcast. All right. And I I went back and watched the intro today and I did the thing where I I I like to keep the guest at the last person to introduce. But then the problem is then you're like iced out. You don't You don't You're not You don't I was nervous even getting on the watch. You jumped you jumped right down. Like, let's let him off the leash. Let's let Danny cook cuz Yes. I uh sometimes I will get on a podcast and I am like it'll be like five minutes of me being like Yeah. Yeah. Yeah. Yeah. And I don't want to do that to you, especially with you in person here. I know. I'm so I'm so honored to be here in person. We're we're honored to have you here in person. It's",
            "start": 98.4
        },
        {
            "text": "Yeah. Yeah. Yeah. And I don't want to do that to you, especially with you in person here. I know. I'm so I'm so honored to be here in person. We're we're honored to have you here in person. It's an honor. Oh, it's an honor to have you around. Don't worry about it. Uh Danny, if people don't know, of course, they should know you from SA Sasquatch, the sketch troop that I've been talking about for years and years and years and years and years and years and years. Sasquatch is is I think for both Jack and I our number one thing always. Jack, I've never heard of him. Yeah, he's doing fine. Uh, definitely not also on the show. I know. I feel who's on the show on Games. I know. I do. I think about Jack Austin and I just think like we have to help him. Oh, yeah. Cuz I just I look at his career and I just think we should get where where's it going? We should get a Yeah, we really should think about that. As somebody who flies Delta, I cannot tell you how upsetting it is to see Jack Jack's in",
            "start": 137.6
        },
        {
            "text": "I just think we should get where where's it going? We should get a Yeah, we really should think about that. As somebody who flies Delta, I cannot tell you how upsetting it is to see Jack Jack's in three of the new releases right now. But this is this is what I always keep thinking to myself as I look at his current. I think I think how do you live with only having three movies out for you? How do you live? Like how do you pay your bills? Hey, every platform I turn on, the first thing is a jet. And on a real note, try scheduling stuff with a person like that. Oh, I can barely let Greg down. We have nothing going on. Let me tell you, I got to watch Superman, too, Nick. I wish I could. I wish I could help you. I got to watch. Sorry, buddy. Yeah. No, but he's uh but yeah, Sasquatch is uh is my baby and my love. Um, but then also, you know, some other things I'm up to. Dude, you got a lot going on. You got a lot going on. Of course, last time you were here, you Yeah. kind of a failure, but",
            "start": 173.76
        },
        {
            "text": "baby and my love. Um, but then also, you know, some other things I'm up to. Dude, you got a lot going on. You got a lot going on. Of course, last time you were here, you Yeah. kind of a failure, but it together because you were on Crazy Ex-Girlfriend, but that was done. We're over, you know what I mean? Like, man, done. The Shooting Stars fading back to Earth here, you know? But look at you now popping up on Hacks. We pop up on Hacks. We're on Ted. We're uh I'm [ __ ] sitting in my living room. Mhm. Enjoying a nice Sunday afternoon with my wife. Goes, \"Do you want to watch Hacks?\" like, \"Oh, yeah. I'd love to watch Hex. You love my life.\" She goes, \"You love my life, too.\" We get to talk to We get to the scene and I see you and I lose my [ __ ] Yeah. And I did the thing that you're like, you know, when you're trying to like, you're like, \"You don't understand. He's a big deal.\" And we had him on the podcast and we know this guy and it's Danny and he's really funny. And my wife's like,",
            "start": 215.6
        },
        {
            "text": "know, when you're trying to like, you're like, \"You don't understand. He's a big deal.\" And we had him on the podcast and we know this guy and it's Danny and he's really funny. And my wife's like, \"Uh-huh. Uh-huh. Uh-huh. Could you please unpause the episode, watch the rest of the show, now watch? I'm so proud of you, man. That's [ __ ] awesome.\" Thank you. It was great. Truly amazing. It was amazing to be on. It's like, yeah, it's very cool. I I've had a very interesting streak going where everything I'm on is really good. And there's so much because of you or in spite of you? Oh, for sure. In spite and also just weird book cuz I audition for so many things that I'm like, sure, I'd do it. Sure. I'd Yeah. No. And I'd be pumped to be on this. And then it's like only book things where I'm like it's like Hacks and Ted are the two things I'm on right now. And it's like two of the best comedies by a bullet. You just did you just raw audition for Hacks or Raw audition? I mean I knew I know",
            "start": 258.24
        },
        {
            "text": "it's like Hacks and Ted are the two things I'm on right now. And it's like two of the best comedies by a bullet. You just did you just raw audition for Hacks or Raw audition? I mean I knew I know Hannah obviously and like Paul and Luchia like been around my life like I've seen them around Paul used to do like 15 years ago my shows in New York when I was just starting standup but like I didn't think he really remembered me but he did. Um but no I was a raw audition. That's awesome. Raw Zoom audition. I don't like that name. I don't like raw. I just I don't think that's even a thing they say. Well everybody says that's the industry term. Yeah. Raw dog audition. I got to learn my lingo. I watched La Landing talking about Raw Dog. That's great. That's you in the room, man. Out of focus, but that's you. That's you. You know what I mean? Well, yeah. I don't like that you're out of focus. Yeah. You're not the star of the show. I get it. Could be. Look at the people in the way background. I",
            "start": 296.8
        },
        {
            "text": "that's you. That's you. You know what I mean? Well, yeah. I don't like that you're out of focus. Yeah. You're not the star of the show. I get it. Could be. Look at the people in the way background. I couldn't even tell you who you are. I don't know. I'm right up there. I was eating a bagel back there. That bagel. And of course, it's Christmas in June. Joey Noel, it's me. I'm back. Whenever I hold on the intro, it's not that I can't remember your name. It's I don't know what month we're in. It's Christmas in June. Shoot. I know. That is the trouble with giving me like a adjusting nickname every month. How are you, Joy? I'm good. Yeah. I spent my entire weekend catching up on Hacks. Damn. It's a spoiler cast for Hacks now. Exactly. Yeah. It was one of those things where like I had missed season 3 and then season 4 came out. I was like, \"Fuck, I have to go back and watch season 3.\" But then I was like, \"What happened in season two?\" So then I, you know, just the forever trying to fix my",
            "start": 341.12
        },
        {
            "text": "3 and then season 4 came out. I was like, \"Fuck, I have to go back and watch season 3.\" But then I was like, \"What happened in season two?\" So then I, you know, just the forever trying to fix my brain. I gave Joey homework. I was like, \"Dy's gonna be on the show. You have to catch up on hacks.\" And she was like, \"Darn.\" It's been on my list for so long that sometimes I just need that like deadline to like commit and watch it. But then we had that cathartic moment where I was like, \"This is texting you last night.\" Yeah. I was like, \"This is our life. Our job is that we have to watch one of the best shows on TV right now.\" Yeah. So we can geek out one day. It was tough. Yeah. Yeah. Carol Bernett makes an appearance. What the [ __ ] Insane. And then like some of my favorite Tik Tokers really trying to find a way to stumble on a set. You're like trying to spread the sheets over here. Like you're done. We already shot all your seats. But well, if I'm here, I should probably shake hands",
            "start": 378.8
        },
        {
            "text": "trying to find a way to stumble on a set. You're like trying to spread the sheets over here. Like you're done. We already shot all your seats. But well, if I'm here, I should probably shake hands with everybody on set, right? That's what we do. It's a polite thing to do. Well, I'm excited to talk about that and more because this is the kind of funny podcast. Each and every week, four, sometimes five best friends gather on this table far so long. They call me a spider for a reason. Look at that strength. You know what I mean? That's how I could do it. you know, anytime, anything, anywhere. I I almost hurricaned Nick today. I jumped up and I said pop-up power bomb, but he didn't understand the, you know, direction. But you did something to me. I'm very If you're going to say moves, you know, did you say you did something to me, too? And I can't remember. Well, you like I can't remember if you in my general direction. Yeah. Well, I got to show people how high I can kick a lot of times.",
            "start": 413.6
        },
        {
            "text": "did you say you did something to me, too? And I can't remember. Well, you like I can't remember if you in my general direction. Yeah. Well, I got to show people how high I can kick a lot of times. You know what I mean? Do you have a high kick? Show him. Is this well known? Show him. Is this well documented? Show him. Are we doing news here? You have to see it. And it's in jeans. I just want to say, wow, that was high. Now, again, I want to just throw out that it's high because he's tall. Not because he can lift his leg up higher than his waist, but his waist is at eye level for me and you. That was above I mean, that's that was jeans. I got the Undertaker boot. That's what I can do. All right. Undertaker. And he did the thigh slap just for me. Just for my enjoyment. That's like, you know, once you're in the professional wrestling community and you learn it, you can't stop. Like when I walk by and I do little kicks of the dog, I do it, too. Everything. I don't care what that website",
            "start": 459.04
        },
        {
            "text": "once you're in the professional wrestling community and you learn it, you can't stop. Like when I walk by and I do little kicks of the dog, I do it, too. Everything. I don't care what that website says. You're still a WWE superstar. I'm a legend. Don't worry about it. Of course, we come together to talk about whatever's going on in our lives. Of course, with a live audience like you and of course like Meline Exposure, Mad Exposure, Maline Stanley out there once again freaking out about Danny, which was funny to go back and watch the old episode where she freaked out about Danny. So, I'm glad we're able to she because she's in there as number one fan talking about Crazy Ex-Girlfriend as always. Now, talking about hacks, how she needs it back right away. So, I appreciate that, Maline. Yes. Yes, there it is. If you didn't believe us, did she steal that off the set? Where did that come from? No, I sent it in as a b-roll. If you want to click through it, there's just more images of uh",
            "start": 500.56
        },
        {
            "text": "Yes, there it is. If you didn't believe us, did she steal that off the set? Where did that come from? No, I sent it in as a b-roll. If you want to click through it, there's just more images of uh Danny's time on hacks, but again, we're going to talk about that. Oh, that's from Danny. I thought that was from Maline. I was like, how did she get that like Danny, you got to watch out. You got to stop. We have photos of her. This is not good. How did she get this candid photo of you? Uh, if you love us, we love you. Please pick up a kind of funny membership. youtube.com/kindfunny games. patreon.com/kindfunn and Spotify of course you get all of our episodes adfree that's more than 20 episodes a week 80 a month and of course you get a daily dose of me Greg Miller with a podcast we call Gregway which is usually 15 to 20 minutes of me in the car but Roger and Mike have been taking over lately and they did like a 45minute episode today on how to how to get a how how they tried to buy a",
            "start": 533.12
        },
        {
            "text": "which is usually 15 to 20 minutes of me in the car but Roger and Mike have been taking over lately and they did like a 45minute episode today on how to how to get a how how they tried to buy a treadmill from big five ridiculous outrageous those two are amazing and I think they need to be stopped they're scary of course uh if you have no bucks toss away no big deal you can watch live Obviously recorded on youtube.com/confunname twitch.tvtv/confunny games. Listen on podcast services and YouTube later around the globe. It's a big week. It is. Let me read from the official tomb here. Okay. To don't worry about it, Joey. I'm not. Don't try to correct me. I'm not worried. Don't try to correct me, Joey. I'm like actually I'm really worried about it. Spell to O M E. Yeah. To crushed it. I wanted to toss a B in there for tomb, but it's cuz I got tombs on the brain now. Why? Don't worry about it. Mike and Roger are freaking it again. That's right. On Friday, June 27th, Mike will go step for",
            "start": 572.16
        },
        {
            "text": "to toss a B in there for tomb, but it's cuz I got tombs on the brain now. Why? Don't worry about it. Mike and Roger are freaking it again. That's right. On Friday, June 27th, Mike will go step for step on a treadmill with Norman Reus in another literal marathon stream for the launch of Death Stranding 2. But this time, they have a few surprises. They had surprises last time, so I'm scared what that means. Get ready to go the distance because they will stream as long as you support. Uh, can they make it past Kind of Funny Games Daily on Monday? How high will Mike's heart rate be? How much chilies will they order? Find out Friday, June 27th, exclusively on Twitch. Come support them. I only know a fraction of what they have up their sleeve. I and it's kind of ridiculous. Yeah, you want to watch this. Now, if you want to go that extra mile, why not fly to San Francisco? Saturday, I'm throwing my own kind of funny game showdown championship parade in San Francisco. Meet me in front of the",
            "start": 613.52
        },
        {
            "text": "this. Now, if you want to go that extra mile, why not fly to San Francisco? Saturday, I'm throwing my own kind of funny game showdown championship parade in San Francisco. Meet me in front of the Ferry Building at 10:00 a.m. Then walk the Embaradero to Square Pie, guys. All while celebrating the only man who did the impossible and led team blue to its third consecutive championship, me, Greg Miller. Bring signs and prepare for the weirdest walking meet and greet of all time. And hey, after that, you're going to be right next to Punchline Comedy Club.com where you can go see Danny performing that night. Two shows Saturday night. What time is the first show? I think it's at 7. Yeah. Yeah. Okay. I'm there Wednesday through Saturday if you want to also get that out of the way so you can really show if you go to every single show. I do a different hour every single show. Godfrey. Uh, of course, today's kind of funny games daily was about meta and Xbox teaming up on the headset. Games cast",
            "start": 652.64
        },
        {
            "text": "show if you go to every single show. I do a different hour every single show. Godfrey. Uh, of course, today's kind of funny games daily was about meta and Xbox teaming up on the headset. Games cast was our Death Stranding 2 review with JK Games is Jerica Hannah. And the stream this afternoon is going to be Dune Awakening with Mike and Nick. If you're kind of funny member, you can get the treadmill. Greg Wayne we were talking about. Thank you to our Patreon producers James Hastings, Carl Jacobs, and Omega Busters today. Omega Buster. Sorry, just one today. I was thinking the Dave and Busters, you know, kind of like the Tomb thing again. Remember last time I went there, I got sick off that. I do. Yeah, cuz you order Caesar salad. Why? And then he got they came with this giant parmesan crisp and he ate the entire crisp as we were talking about. No, it was a it looked like brought to you by Cash App. We'll tell you about that later. For now, here's Nick defending why he went to poop his",
            "start": 696.88
        },
        {
            "text": "and he ate the entire crisp as we were talking about. No, it was a it looked like brought to you by Cash App. We'll tell you about that later. For now, here's Nick defending why he went to poop his pants because honestly, candidly, you know what it reminded me of? Only had one bathroom. You You'll respect this. You'll appreciate this. Growing up in the Catholic church. Do you remember when you'd look at the stained glass and they'd show the halo around people's heads, but it wouldn't be like a halo like this? It would be like Yeah. Like that, like a half tortilla shell thing. That's what this reminded me of. And it was made of cheese. How do you not eat that? What I want to say is I hate that I do understand and respect it. See, my mom used to get me this treat that I don't even remember, but it was from the grocery store and it like remember place for a treat to come. It's likely place for a treat to come. But stick with me cuz this is going to I want to make sure I'm being very",
            "start": 736.8
        },
        {
            "text": "but it was from the grocery store and it like remember place for a treat to come. It's likely place for a treat to come. But stick with me cuz this is going to I want to make sure I'm being very clear that it see it was a treat that should not have existed in the very white grocery stores we were going to. Oh, interesting. I I I don't even know what it was. I don't know what from what culture it came. A big wafer that then had like honey on it and then another wafer, but maybe the honey was baked in. I'm a kid, so I like a stroop waffle. Strip waffle. It It Okay, guys. I always say it's stroop waffle. I knew a strip waffle was [ __ ] I [ __ ] supposed to know flying the plane, Joe. You put it on top of that Virgin America. Rest in peace. Come on. Doesn't exist. I know what it was. They slam my Anyways, it was about as big as a tortilla. Okay. And it was like this honey and I would get it and I would come home and I would eat it and I would watch Karma San Diego. Where in the world is",
            "start": 774.32
        },
        {
            "text": "my Anyways, it was about as big as a tortilla. Okay. And it was like this honey and I would get it and I would come home and I would eat it and I would watch Karma San Diego. Where in the world is Karma San Diego? But it also reminded me of like if I if we had selfies back then I would have put it up and I would have been like oh that would have been a big post. That would have got a lot of likes. Lot of likes. [ __ ] fat little Jesus. Look at me. I'm Jesus Christ. That would have went over well. That would go real well especially that but no that that was always it. And remember the [ __ ] excitement if you could get when they had the big Eucharist and they would break it up and if you could get one of those pieces rather than the Oh, here's the real here's out of a factory little I saw you take those out of the bag. I don't want that. That's not That's not Jesus. Father Jeff. [Laughter] Do you remember any of your priest names? Oh yeah. Father Mike. Father Mike. They always Yeah, it",
            "start": 816.08
        },
        {
            "text": "take those out of the bag. I don't want that. That's not That's not Jesus. Father Jeff. [Laughter] Do you remember any of your priest names? Oh yeah. Father Mike. Father Mike. They always Yeah, it was always Father Mike. Like you were trying to dump like like they were the stepdad trying to be the cool stepdad. It's like not Father Michael. [ __ ] then. I don't give a [ __ ] Rabbis have obviously phenomenal names because you got you're dealing with Jewish names. So one of my rabbis my big the one that like had the name was lay it on me. What's the name? Rabbi Nosenchuk. No [ __ ] that's not real. That's real. Rabbi Nos and Chuck Nosen Andchuk. I don't know where he is now, but he cuz we were I went to a synagogue in Virginia that like there weren't many. So you went to it was literally called Northern Virginia Hebrew Congregation. So it was for all of Northern Virginia. Uh and so we were kind of a feeder like synagogue where it was like people either it was either rabbis on their way",
            "start": 857.2
        },
        {
            "text": "Northern Virginia Hebrew Congregation. So it was for all of Northern Virginia. Uh and so we were kind of a feeder like synagogue where it was like people either it was either rabbis on their way up or rabbis on their way down. Sure. Sure. Sure. So and uh and he was on his way up. So Rabbi Nos and Chuck left us pretty fast to because he was good. He was good. He was good. With a name like that, how can you not? I know. I I wonder where he is. I think he got I think he's like pro he was he was on his He was got to be in LA somewhere being a a star rabbi somewhere in LA, right? Oh wow. Where do you go if you're a star rabbi? Oh, you go to one of you go one of the big city the big market. You hit one of those. They got some synagogues that you wouldn't believe the size of. Oh my god. Marona. Oh my god. You can't even believe it. Now, are you still uh practicing in the Judaism? No. No, not really. But I I mean, you know, it's always it's always a little in you. Uh yeah. So you mean the",
            "start": 900.24
        },
        {
            "text": "Oh my god. You can't even believe it. Now, are you still uh practicing in the Judaism? No. No, not really. But I I mean, you know, it's always it's always a little in you. Uh yeah. So you mean the guilt? Yeah. You know, as a Catholic, I'm always feeling a little guilty about something. Yeah. Yeah. We I think there's a very uh heated heated argument right now between Catholics and Jews of who really like owns guilt cuz I feel like both of us claim to have guilt. That's like our thing. And I'm like, boy, we both really have a a case to be made. Which has it worse? Yeah. I think it's the Catholics. Well, you would say that. Yeah. You have no a Jewish mom. I mean, I dare you. Yeah. My culture has made me feel that Jewish mom got it. They got it. They got But then if you say, so this is like the war cuz Catholics will always be like, you have no clue what you're talking about. You don't even can't even imagine. But I'm like, you don't. Our guilt comes with just a little bit of violence,",
            "start": 941.84
        },
        {
            "text": "the war cuz Catholics will always be like, you have no clue what you're talking about. You don't even can't even imagine. But I'm like, you don't. Our guilt comes with just a little bit of violence, too. Like always like not like real like emotional violence. I think Jewish mom. Do you know? See, my thing about the thing is I think I think the Catholicism of guilt is much more of a you're a kid and you're guilty and then you grow out of it, but you still say you feel the guilt, but you don't feel the guilt. Honestly, real talk, the only reason why I say I feel the guilt still is cuz occasionally my mom watches this podcast. Oh, and I don't want her to call me like you just totally turned away from the church. That's what you've done. about that. I'm just trying to avoid one conversation that could potentially happen per year by still saying that I But I'd like to point out, same with me. If my mom heard me say like, \"Eh, kind of not really,\" I would get a call. I would get a call",
            "start": 993.04
        },
        {
            "text": "that could potentially happen per year by still saying that I But I'd like to point out, same with me. If my mom heard me say like, \"Eh, kind of not really,\" I would get a call. I would get a call immediately just like, \"What are you doing? What are you doing? What are you doing? You are concerned. You are.\" We had a big holiday season where uh my son learned about all the different uh religions and things like that. Very into Hanukkah. We went to Home Depot and made uh Thanks so much, Jesus. Well, no. Well, he's one of us. My boss is a Jewish carpenter. When made the manora, you know what I mean? And then he made several drreidles at different events that had things where you can make a drrele. So, he still plays with a drrele. Still very much into it. Wow. Let me tell you, he's going to age out of that. Uh Hanukkah, I'll tell you that Hanukkah does not carry the same punch as Christmas. You're going to want to stick with Christmas. Christmas I I do think the Catholics did a much",
            "start": 1036.24
        },
        {
            "text": "to age out of that. Uh Hanukkah, I'll tell you that Hanukkah does not carry the same punch as Christmas. You're going to want to stick with Christmas. Christmas I I do think the Catholics did a much better job marketing that. I really I So I'm I am talking about this a little bit on stage because I have said I think uh I think you guys do holidays so much better than us because you just make [ __ ] up. Yeah. And we just do exactly what happened. We're working on appropriating uh Halloween as a Catholic holiday. I'm not sure how we're going to do it. But you'll add cuz that's what you'll do. You'll add things. You'll just you guys are going to be like Well, candidly, we just take the holiday, add a little Jesus in there. Just a little Jesus. But Jesus, but then there's Santa. There's the the mistletoe. There's all these things you're just adding. They're not based in part. That's what I'm jealous of. That's fair. We just like the example I always use is like for Passover, there was",
            "start": 1077.28
        },
        {
            "text": "the mistletoe. There's all these things you're just adding. They're not based in part. That's what I'm jealous of. That's fair. We just like the example I always use is like for Passover, there was which is a holiday we have there. We fled Egypt. There was one baker who forgot to put yeast in the bread. Unle bread. Unle bread. And so the bread didn't rise in a cracker. Yeah. It just doesn't feel like that needs to stay with the holiday. Like we could have dropped that detail and instead Yeah. Every Jew has to eat crackers for an entire week and is constipated. You get horribly constipated for the week. You have nothing. And it's like cuz of this one guy. It's like what are we doing? And you guys just have a guy that comes down your chimney even though he can't fit through. And he brings you presents. Yeah. And it's dope. And it's nothing. There's nothing in you. You play your cards right and you start a company with someone and they have a kid later, they put you in their phone as",
            "start": 1119.52
        },
        {
            "text": "you presents. Yeah. And it's dope. And it's nothing. There's nothing in you. You play your cards right and you start a company with someone and they have a kid later, they put you in their phone as Santa. So, it gives you crippling anxiety every single time they text you, including over this weekend because you don't know if you're reply responding as Santa or not. I I'm texting you in the middle of the night and if it's something weird, you know it's not a Santa thing. It's true. But then your wife texts me sometimes and she says, \"Hey, Santa.\" And I'm like, \"Now I got to take this seriously.\" It wasn't a serious. You do a great job. Thank you. Yeah. You had a good one here. I'll takes a village. It does. And remember, of course, like you know, we have St. Nicholas. All right. So, like there's origins to Santa. All right. He's been around. I have a question. Is the role of tooth fairy going to be available for Ben? Because I would like that. Oh, sure. We can do that. Yes. Okay. So,",
            "start": 1165.68
        },
        {
            "text": "there's origins to Santa. All right. He's been around. I have a question. Is the role of tooth fairy going to be available for Ben? Because I would like that. Oh, sure. We can do that. Yes. Okay. So, here here we go. I would like to be a threatening present. Threatening present. This is what Jen uh sent to Santa and me on on a group thread Tuesday. 540. I I've confusing. You see, I see it. Santa, how are you? Um, can I please have a Ghostbuster M monster truck? for Christmas. Love when Jen feeds in the lights. Thank you so much. Thank you so much. Well, it's that idea that he can only Also, it's June. He can he can only getting it. Well, hold on. Remember, of course, like he this is our way out of anything, not to buy in the moment and our way to threaten him. Uh Santa responded, \"Ho ho ho. Hello, Ben. Santa will put that monster truck on your Christmas list. Be a good boy for your mom and dad.\" And like still to this day, like when he's getting Malfie, when he's trying to fight me,",
            "start": 1200.56
        },
        {
            "text": "ho. Hello, Ben. Santa will put that monster truck on your Christmas list. Be a good boy for your mom and dad.\" And like still to this day, like when he's getting Malfie, when he's trying to fight me, he's trying to leave the room, I'll say, \"All right, I'm going to text Santa.\" And he comes back, \"No, no, no, no, no.\" I mean, that this is Yeah. This is good. This is a holiday. This is it. Yeah. Yeah. Because that's how good your holiday is. It's June and you're holding power over your kid with this holiday. Now, while we're here, I wasn't going to do this, but I will turn it in. Uh, kind of funny. Best friends, I do need your assistance in figuring out how to get a Ghostbusters monster truck. Does that exist? It does. And it was at Ross for a long time, but he's going to want this still by by December though, dude. He has wanted this for quite some time. Okay. This is He loves Monster. This is not a new thing. Yes. This is not a new thing. It has been percolating. They had them at",
            "start": 1249.04
        },
        {
            "text": "by by December though, dude. He has wanted this for quite some time. Okay. This is He loves Monster. This is not a new thing. Yes. This is not a new thing. It has been percolating. They had them at Ross like years ago and I never bought one. Egg on my face. Now it's like $150 on eBay. You got no buy for someone on Etsy is is making custom monster like you know you take the Hot Wheels monster truck you rip that thing off and then you put whatever Hot Wheel on top. I got Ecto1 ones like I feel like somebody with skills could combine these. Here's what I'll say. Yeah, Uncle Tim will definitely buy this. Is that what it looks like? That's the other thing. Yeah, that's nasty. It's only 50 bucks though. Where'd you find this? Use us to crowdsource. I'm I I mean I'm blinded. I saw one of them. All right, send me this. I'll buy it. Okay. Yeah, 50 bucks. Well, how big I'm going to go buy this for? Anything for scale? No. I got six viewed in the last 24 hours. But how many of them are now US?",
            "start": 1293.36
        },
        {
            "text": "All right, send me this. I'll buy it. Okay. Yeah, 50 bucks. Well, how big I'm going to go buy this for? Anything for scale? No. I got six viewed in the last 24 hours. But how many of them are now US? Cuz people are googling. Okay. So, this is it's not me. It's on card. It's out of the box, which I don't care about. Ben doesn't even need to know that it should drive. Yeah. Send me this, please. Please. Please. Does it actually drive? I don't get No, I mean like that that's like a remote. It's a remote control one. I don't care about the remote control part of it. But he never comes with a a remote then he'll never Is he into monster trucks? Oh, yeah. Wow. So much so they're going to like the monster trouble like round. He doesn't know yet. Oh, don't spoil it. We're doing the putting your show tonight. He might show up to your show. Usually I text him as the Easter Bunny, but I won't mention it. Yeah, I know. We got invited. We're going to go to See, that's the one I kept seeing $200",
            "start": 1337.28
        },
        {
            "text": "show tonight. He might show up to your show. Usually I text him as the Easter Bunny, but I won't mention it. Yeah, I know. We got invited. We're going to go to See, that's the one I kept seeing $200 kind of thing over there. Midtown. I don't care. Just uh No, not No, because you never know what's going to be a hit and what's not going to last. I know. It's so funny to me, too, because I'm like as a as a as a person who doesn't have children, I was like, why would you not just buy that for him? But then yeah, I guess it makes sense because he might play with it for one second and they want 13 more of them once then you don't. He plays with and it's just like I'm just and I'm not even that guy. I love toys but we are surrounded with just [ __ ] hunks of plastic that just aren't and it's like all right you can't say you're getting rid of it. So I need him to like go away. He needs to go to a camp so I can sit there and just get rid of it. But then I want to play with the toys or play",
            "start": 1372.56
        },
        {
            "text": "like all right you can't say you're getting rid of it. So I need him to like go away. He needs to go to a camp so I can sit there and just get rid of it. But then I want to play with the toys or play with my or whatever. Yeah. Yeah. It's a whole thing. It's a whole thing over here. But Danny, yeah, you're an actor. Um, what's it been like? Like like do you feel since you were here in basically co where you're still work from home and all that jazz do you feel like your career is like not taken off but are you on do you feel like you're on another echelon or is it still just doing your thing? So, we were talking about this outside a little bit, but what the way I've said is like my career was going like this and like Crazy X probably being the real like propeller, but then like through standup and cold bear and all these things like my career was like just been this like rise co hit and I went crashing through the earth. It felt like so like when we when we did that podcast that was",
            "start": 1405.36
        },
        {
            "text": "and cold bear and all these things like my career was like just been this like rise co hit and I went crashing through the earth. It felt like so like when we when we did that podcast that was during a time where I was like starting to where I was like oh I'm losing momentum, you know, it's it's just felt like a disaster. Uh, all of a sudden followers were everything. I was like, \"Followers? Who cares?\" Like, you know, I'd always been like, \"It's an art form. Who g?\" And all of a sudden it was like, \"Oh no.\" And so I kind of lost everything. And then except standup. Standup was the one thing I could do. And I was like, \"I think I'm a good actor.\" And then over like in particular the past year or two, it's felt like we're coming back. And so now, yeah, it feels like I have momentum. And like I mean hacks was just such a cool get. And then and Ted was like really exciting and bad like there's I've act I get to act in really cool stuff and that is like my claim to fame I always feel like",
            "start": 1445.2
        },
        {
            "text": "I mean hacks was just such a cool get. And then and Ted was like really exciting and bad like there's I've act I get to act in really cool stuff and that is like my claim to fame I always feel like cuz I'm like I'm in Babylon like just weird cool things where I'm like that's a cool one to be in. Uh so yeah I feel like things are going well but you never know. When things were crashing as you put it. Yeah. Was there the thought of I need to have a backup plan. I need to hang this up. I need to go whatever. I mean yeah I just got married. I just got married. I mean, look, I'll always go back to sales if I got it. But I uh Oh, you a good salesman. I'm so good at it. So good. My dad's a sales trainer, so I was raised in a sales house. I was raised to sell. I was born to sell. Yeah. So, I was like I was like, I can go back to sales uh if I really had to. But no, I was like I was like, I'm good at standup. I think I'll always be able to figure out a way to tour. And then that's been like",
            "start": 1486.96
        },
        {
            "text": "like I was like, I can go back to sales uh if I really had to. But no, I was like I was like, I'm good at standup. I think I'll always be able to figure out a way to tour. And then that's been like the coolest part has been like now I'm touring for real. in like a way I never did precoid. Like I'm really touring. And what does that mean? What's real touring look like? Oh, one two to three weekends a month. Okay. I'm on the road doing shows in different venues around the country like really like you know getting to meet like new people and also like having people see me and like that that's that to me feels like the most cuz Hollywood's so weird. Hollywood is like I don't know at this point I'm like I've been up and down so many times. I'm like who knows? Axe could be the last thing I ever book. I could book two things today. Yeah. Like, who knows? But I'm like, standup's real and it's a real connection with like the audience. It's kind of like what you guys have where it's like, this",
            "start": 1535.6
        },
        {
            "text": "book. I could book two things today. Yeah. Like, who knows? But I'm like, standup's real and it's a real connection with like the audience. It's kind of like what you guys have where it's like, this is a real connection. Uh, standup's that for me. So, I'm like, I think it'll all be okay. But yes, I did. I was like, all right, if I had to sell cars, I could sell cars. I could sell car. I sold theater tickets before I went. I sold like season subscriptions. Oh, okay. I set like a record in my like one week. Like the highest per week ever. DiCaprio and I like did Yeah, I did like 30. Oh, yeah. Oh, so that that movie I have an exciting opportunity to tell you. Oh, I I was a Oh, yeah. That that movie was so helpful when it came out cuz the last scene is him in a room with a pen and I was like, \"That's what my dad does.\" My entire life I've been like trains people. He teaches people how to sell and everybody was like, \"What is that?\" And I was like, that last scene gives me so much anxiety",
            "start": 1578.56
        },
        {
            "text": "\"That's what my dad does.\" My entire life I've been like trains people. He teaches people how to sell and everybody was like, \"What is that?\" And I was like, that last scene gives me so much anxiety cuz I was like, \"How do you sell the pen?\" Nobody ever sells the pen. They never give you the answer. Sell you the pen. The question is, so I I'll This is what my dad would say. Rob Joll. Uh, is he still doing customers selling? Yes. Great. Great sales name. Oh, he's good. Rob J. Killer. Killer. My dad My dad is Rob. Oh, my dad's a killer salesman. Um, unbelievable. But he So, like sales is you are trying to solve a problem that somebody doesn't realize exists yet. That is what it is. Your car is going to break down in the next year. You can buy a car now and you can have a little bit more time and we can really like get you a great car or you can wait a year, your car breaks down and you can come here in a panic and take whatever deal we have. Let's solve it today. That is the idea of",
            "start": 1618.8
        },
        {
            "text": "time and we can really like get you a great car or you can wait a year, your car breaks down and you can come here in a panic and take whatever deal we have. Let's solve it today. That is the idea of sales. And if we do a good job in 2 years, you're going to want to come back to me because you trust me. That is how sales works. So to sell the pen, the question becomes, how many pens do you have in your house? Do you need a pen? And most importantly, how many months are you from the inevitable moment we all have where we go, why don't we have any pens in this house? I can't find a pen to save my It's not annoying. So, let's get ahead of that and let's look at a pen right now and get you a pen. That is how you sell the pen. And it's listening. It's trying to answer your question and finding out if this problem is coming up. And if you're truly like, I have 70 pens. It's like great. You shouldn't get a pen. But you're trying to get ahead of the problem. That's how you sell a pen. I like",
            "start": 1665.68
        },
        {
            "text": "out if this problem is coming up. And if you're truly like, I have 70 pens. It's like great. You shouldn't get a pen. But you're trying to get ahead of the problem. That's how you sell a pen. I like that. There you go. I look at that movie all wrong. I just watched it for the cocaine. Was awesome when they do drugs. Yeah, they do a lot of drugs. They do a lot of drugs. I learned about drugs in that movie. I'll tell you what's quite loot. I was like I was that movie is so good. I remember watching being like, wow, I didn't know any of that stuff. I watched that movie exclusively on airplanes and every time I watched it, my wife was your airplane movie. This is not an appropriate movie to be watching on a United flight. Oh, and you Well, they cut they actually what's funny is I think I watched it the first time before it was like edited and now when like you know there's like the nude moments where like there's nudity or whatever like there's a picture it's like when Margot Robby like",
            "start": 1712.48
        },
        {
            "text": "it the first time before it was like edited and now when like you know there's like the nude moments where like there's nudity or whatever like there's a picture it's like when Margot Robby like walks up and she's supposed to be like full frontal. It's scaled up so much that it's just a pixelated version of her face. Oh, and I'm like okay I appreciate that. I respect that. I see the need. I see the need. I don't like it but I see the need. Mhm. Remember my story for that was I was uh at my ex's Christine's and they were like what we should go see a movie and I was like we should go to and then we took like her parents I'm like sitting next to her Wolf of Wall Street it started they're cool they were cool they were cool like even with the coolest I know fellas I know Scorsesei I know what I'm getting into and like they the opening shot doing blow out of an ass like Christ and he slaps her ass and does a blow the best movie. Give him the Academy Award for that. Take it out away from the",
            "start": 1748.56
        },
        {
            "text": "getting into and like they the opening shot doing blow out of an ass like Christ and he slaps her ass and does a blow the best movie. Give him the Academy Award for that. Take it out away from the Revenant. Give it back to him for Wolf of Wall Street. That's what I say. Start the campaign. It's an alltime. Start the campaign. It is a great airplane movie by the way. I I was going to say like that that the big short like there's a couple that it's like Crazy Rich Asians is the all-time best airplane movie. My number one and I'll defend it guys. I've watched it 700 times on an airplane. Edge of Tomorrow. Great airplane. Is that Live Die Repeat? Is it that one? Okay. It's now Ed. I think it's Edge of Tomorrow again. I think they changed it when it came out. Just the poster, right? No, they I think they promoted it when it came out. I could be wrong, but I think they promoted it when it came out on on demand. Was like a Harley Quinn thing where they they like screwed up a lot of the promo",
            "start": 1787.44
        },
        {
            "text": "think they promoted it when it came out. I could be wrong, but I think they promoted it when it came out on on demand. Was like a Harley Quinn thing where they they like screwed up a lot of the promo for that movie. So, I feel like it didn't get the initial pop it should have gotten. I stand by it as a potential top 10 action movie of all time, if not top 10. I I think Edge of Tomorrow is unbelievable and I can watch it 7,000 times. I would I would agree with you. It's a bummer it didn't do well cuz I think they were definitely setting up a sequel for it. Yours is the bigger one. I know, but get get in there. We'll just We'll just My top three plane movies. Nick can't do any distraction. Like, you know, he was awkwardly trying to get the coffee. No, it wasn't my best. It wasn't throw shade at anyone right now. No, but yeah. No, I wasn't. It's not your fault. Somebody interrupted the conversation to get his I was quietly I was quietly doing it. Reaching over awkwardly. I mean, I",
            "start": 1827.2
        },
        {
            "text": "shade at anyone right now. No, but yeah. No, I wasn't. It's not your fault. Somebody interrupted the conversation to get his I was quietly I was quietly doing it. Reaching over awkwardly. I mean, I thought it was going to spill onto me. My top three plane movies. Sure. Here we go. Give them Wolf of Wall Street, of course. Interstellar and Avengers Endgame. That covers you for every flight in the world. That's 9 hours. That's like nine hours of movie right there. Do you not get like choked up watching Interstellar? I cry all three movies for different reasons. Yeah. A cry on a plane. Oh, a cry on a plane is a sensational looney, Joey. It's terrifying. It's just like drinking a ginger ale. It's different up there. A crying on a plane. I'll do it all. That's the only place I feel comfortable. Oh my god. I the other this was a couple week like a couple months ago for I and I said to I said you're an idiot as I pushed play but I was like let me watch Inside Out. Oh I was crying so hard on",
            "start": 1870.16
        },
        {
            "text": "Oh my god. I the other this was a couple week like a couple months ago for I and I said to I said you're an idiot as I pushed play but I was like let me watch Inside Out. Oh I was crying so hard on that plane and I was like and you knew you were going to do that. I just wanted I wanted Pixar movie. I wanted a little cry and I got it. It's the kind of cry where you're like I should look into this. I should look deeper into why I'm crying about this and really explore that and talk about in therapy, but this is free. Yes. And I'm not going to spend any money on it. Inside Out. Yeah. It broke me. You watched the second one? No, I haven't yet. Pretty good. That was good. I I fun. I know. The first one was just so good. I'm like And you know what the other problem is? Is I'm like I'm going to cry. Mhm. Cuz dealing with emotions inside that that's my sweet that's you're in Danny Land. Okay. When you're you're in a you're right in there. That's where I'm going to get real mo. So, I'm like I",
            "start": 1908.32
        },
        {
            "text": "cry. Mhm. Cuz dealing with emotions inside that that's my sweet that's you're in Danny Land. Okay. When you're you're in a you're right in there. That's where I'm going to get real mo. So, I'm like I It's one of these things where like I've sat down to watch Inside Out 2 multiplies and I'm like I just can't today. Like I just can't do it. It's I think it's less emotionally taxing cuz it's more about like coming of age in a different way. Okay. It's not about dealing with your anxiety. It's more about dealing with like puberty. All right. If I'm remembering that movie correctly. Maybe I'll watch it. Maybe I'll watch it. I mean, yeah, it definitely does have some of the the new emotions that pop up. I think maybe it wasn't horny. Did you say horny? No, it was definitely more anxiety. What am I thinking? I mean, there was that like attraction aspect that pops up, but I wouldn't say that's like the dominant feeling of the movie. Fair enough. So, watch. No, I'm going to play video games.",
            "start": 1950.8
        },
        {
            "text": "am I thinking? I mean, there was that like attraction aspect that pops up, but I wouldn't say that's like the dominant feeling of the movie. Fair enough. So, watch. No, I'm going to play video games. Really? Put on a movie. I would have put No, Greg's got a Steam Deck right in front of him or some sort of old PSP or whatever the [ __ ] And how you liking the Switch too? I'm enjoying myself. Uh but no, I I'll tell you what bummed me out is that I obviously won't I won't make time to watch anything. But like it was that when the Switch died on this flight from LA or whatever and it was like we were getting ready to land, it was like, \"Okay, you've done well enough. Don't worry about it.\" I did What kind of [ __ ] did you put on? No, no, I did open it up and I found The Great Outdoors, John Candy, Dan Akroyd. And it was like, I haven't seen this in decades. And it was that thing where I started it and then started like fast forwarding and I was like a I got to watch this movie sometime",
            "start": 1997.68
        },
        {
            "text": "Candy, Dan Akroyd. And it was like, I haven't seen this in decades. And it was that thing where I started it and then started like fast forwarding and I was like a I got to watch this movie sometime and I haven't because I haven't but I mean it's like if you want to do yourself a solid here's what we're going to do. Okay, let's see. You're going to tell Uncle Nick when he's got when you got four hours free. I'm going to send a large piece to your house a Ghostbusters monster truck freak kid to play with and you're going to watch backtoback Uncle Buck and the Great Outdoors. Uncle Buck I was never an Uncle Buck guy. It's a better movie. It's a better movie than The Great Outdoors. It is. It's so much more heartfelt and it's what I want to be. It's what I want to be to your child. Oh, okay. I want to be Buck. Want to come and make a big old [ __ ] pancake for bed and have them be like, \"Why does this guy smell like smoke?\" And it's going to be fun. Okay. I can leeches. What are you",
            "start": 2038.56
        },
        {
            "text": "I want to be Buck. Want to come and make a big old [ __ ] pancake for bed and have them be like, \"Why does this guy smell like smoke?\" And it's going to be fun. Okay. I can leeches. What are you talking about? They fall asleep in the canoe and they get leeches all over. I always think when you say leeches, my mind is your mind. What movie do I think? Tim Getty's. Oh, what movie? Wow. You say leeches. No, I didn't say dead weight. Okay. Leeches. What movie? Uh, well, I went Star Trek with the thing that goes in your ear. Oh, that was good, too. No, that would have been my second guess. I was going to say Stand by Me. Remember what he finds less piece of league. See? Yeah. But again, I wasn't a stand by me kid either. No one's a stand by me kid. I feel like that's one I watched too young and then never came back to. I'll never forget I want to say it was it was either Will Weaten or Jerry Oonnell. Yeah. Reaches in and grabs the Jewish people league and there's a leech on his peepee and",
            "start": 2073.68
        },
        {
            "text": "then never came back to. I'll never forget I want to say it was it was either Will Weaten or Jerry Oonnell. Yeah. Reaches in and grabs the Jewish people league and there's a leech on his peepee and he's like and he passes out and I'm like I'm never going in water ever again. I do remember leeches was a real fear as a kid. Yeah. Leeches. Yeah. Bricksand. Brick sand and lasers. Mhm. Remember when someone was like if you look into a laser it'll [ __ ] kill you. It'll kill your eyeball. That was a I do remember. Yeah. Laser pointer seemed really dangerous. Laser pointer seems we were so nice. We were so young. We were so young. We didn't know. We were so young. We didn't even know. Uh but at the time we didn't even know AI. Uh the laser pointer of 2025. I say wow. Yeah, that's accurate. That's what this is going to be titled. The laser pointer of 2025. Yeah. No. Yeah. Leeches. I remember thinking like leeches are everywhere. Leeches are in every body of water. Yeah. You can't swim without",
            "start": 2108.32
        },
        {
            "text": "what this is going to be titled. The laser pointer of 2025. Yeah. No. Yeah. Leeches. I remember thinking like leeches are everywhere. Leeches are in every body of water. Yeah. You can't swim without no a leech. And now I'm like I don't know if I've ever known anybody who's had an actual leech experience. Yeah. Ticks. That's what we should have been looking out for. Yeah. You're terrified of those. Well, we had big ticks going in Virginia. Oh, for sure. Yeah. Ticks all the time. Burn them off. Terrifying. Yeah. You have to burn them off. Kind of the easiest way to do it. It's crazy. That's Yeah, cuz they go and then they although you got to get Now I get I get tick tick stuff on my algorithm for whatever reason. I don't know why you watch one tick video. Now it's all tick. Greg baby, but I'm kind of I kind of want the little tooth tool that you get. I kind of just want Do you have one on your keys, Greg? I on my old keychain. I did. Now it's it's in the little one. They look like this",
            "start": 2146.96
        },
        {
            "text": "kind of I kind of want the little tooth tool that you get. I kind of just want Do you have one on your keys, Greg? I on my old keychain. I did. Now it's it's in the little one. They look like this and you hook it and then you twist. This is the whole It pulls the Yeah, they got the one that I have that I gave to Roger when he was he has the other one, but you put it on and you you do it and then you're supposed to catch the tick, you know, at the mouth and then pop them up that way. Wow. You're not supposed to squeeze them cuz then they inject it back in. There it is. Exactly. That's what this looks like. Yeah, you squeeze them, inject it back in. Burning, you could burn yourself. There's all these different things. This is the idea. But the problem is like some of these ticks are so [ __ ] small you can't even use this. Oh yeah. I Well, in that case, you leave men. Well, they get bigger though. Yeah, that was the other thing is play with it a little bit. You can let it get a little",
            "start": 2188.8
        },
        {
            "text": "small you can't even use this. Oh yeah. I Well, in that case, you leave men. Well, they get bigger though. Yeah, that was the other thing is play with it a little bit. You can let it get a little bigger and then it'll come off. That was something we was told as a kid. It was disgusting and don't care for them. Glad I live in LA where that is not an issue. They roy. Oh, we got coyotes all the time. I battle coyotes. two dogs constantly on therapy. Do you have little dogs? One is really little. Do you have the vest? What's Do you know about the coyote vest? What is it? What is it? We're going to hear about the coyote vests after one second when I remind you of course this is the kind of funny podcast each and every week. Uh four sometimes five best friends gather around this table come to hang out with each other and talk about whatever it is they want to talk about. Uh if you like supporting that, pick up a kind of funny membership. patreon.com/kindfunny youtube.com/kindfunname Apple",
            "start": 2224.08
        },
        {
            "text": "hang out with each other and talk about whatever it is they want to talk about. Uh if you like supporting that, pick up a kind of funny membership. patreon.com/kindfunny youtube.com/kindfunname Apple and Spotify where you can get the show ad free. But right now, you're not using your benefits. So, here's a word from our sponsor. This episode's brought to you by Cash App. We've all had those moments getting meals out with people that always end in some kind of awkward experience of having to figure out the least complicated way to just get it done. Or even after figuring it out, have you used an app and ended up having to wait days for your money to finally show up? What if we could solve all of that easily? Cash App is a completely different experience. fast, easy, and safe, and a great way to receive and transfer money to family and friends. It's incredibly easy to set up. You just enter your phone or email and some other basic information. No bank account needed, and then there's no",
            "start": 2262.72
        },
        {
            "text": "to receive and transfer money to family and friends. It's incredibly easy to set up. You just enter your phone or email and some other basic information. No bank account needed, and then there's no waiting around for days. It's your money. You shouldn't have to wait. We love using Cash App because it's fast, it's safe, and it just makes life way less stressful. For a limited time only, new Cash App users can use our exclusive code to earn some additional cash. For real, there's no catch. Just download Cash App and sign up. Use our exclusive referral code kind of funny in your profile. Send $5 to a friend within 14 days and you'll get $10 dropped right into your account. Terms apply. That's money. That's Cash App. This episode is brought to you by Mood. Let me tell you about the online cannabis company that's revolutionizing how we deal with life's challenges. From sleepless nights to stress-filled days, Mood.com has created an entire line of functional gummies that target specific",
            "start": 2301.68
        },
        {
            "text": "cannabis company that's revolutionizing how we deal with life's challenges. From sleepless nights to stress-filled days, Mood.com has created an entire line of functional gummies that target specific health concerns with 100% federally legal THC blends. They'll deliver them discreetly right to your doorstep, and you can get 20% off your first order at mood.com with promo code kind of funny. I've been having a great time trying out all their different gummies, and I'm loving how each one feels. Their sleepy time gummies will knock you out in about 15 minutes flat. No hangovers, no groggginess, and their epic euphoria gummies are perfect for those days when nothing's going right. And best of all, not only does Mood stand behind everything with an industryleading 100-day satisfaction guarantee, but as I mentioned, listeners get 20% off their first order with code kind of funny. So head to mood.com, browse their amazing selection of functional gummies, and find the perfect gummy for",
            "start": 2345.2
        },
        {
            "text": "but as I mentioned, listeners get 20% off their first order with code kind of funny. So head to mood.com, browse their amazing selection of functional gummies, and find the perfect gummy for whatever you are dealing with. And remember to use promo code kind of funny at checkout to save 20% on your first order. And we're back, Joey. Yeah. What's going on with this vest? Kevin, do you have this vest? This is Wait, this is the coyote vest. That goes out. I bananas. I think I think they're so funny and I think that all of the little dogs should be wearing them just because they No, it looks like something got a Mad Max Beyond Thunder. I'd like it. Why do you not like it then? It seems like it's primed for so bad for the dog. Yeah, I I would say so I'll say this. We don't have a backyard, okay? So we walk our dogs. So a coyote would have to attack our dog with me next to it. There was a time where we had so many coyotes in our area. I was walking her with a five iron. That's just cuz I was",
            "start": 2387.84
        },
        {
            "text": "So we walk our dogs. So a coyote would have to attack our dog with me next to it. There was a time where we had so many coyotes in our area. I was walking her with a five iron. That's just cuz I was like this thing. See my my brother has dogs and I think the well he lives in Orange County and I don't know if they have a lot of coyotes in his area but he carries like a stick for other dogs apparently. He has the bigger problem with like when the dogs come close to another dog, he always worries that the bigger dogs are just going to bite his dog and stuff like that. We have a reactive dog, so my dad is kind of similar. Yeah. I guess be careful about that. Yeah. Dogs awfully drive me up a wall. It's crazy how many people just don't care. They're like, well, my dog's trained. It's like, well, it's not trained that well. And like it's never about your dog. It's always about the other one. Also, it's just also it's so well trained. It's waltzing up to us and I hear you saying come back and",
            "start": 2436.72
        },
        {
            "text": "it's not trained that well. And like it's never about your dog. It's always about the other one. Also, it's just also it's so well trained. It's waltzing up to us and I hear you saying come back and it's not exactly. It's not that well trained. Actually, it kills. I don't know how we don't love this. I mean, it's just so embarrassing. It's a nightmare. Which is why it's so funny. I uh the the a big huge pet peeve for me. Mhm. Uh and this happens a lot in the city is people will walk around with their dogs not on leash in San Francisco. And I'm like, dude, like look, I get it. You train your dog. I'm not worried about your dog running up to someone or biting someone. I am worried about your dog having that momentary lapse of like awareness and just running into the [ __ ] street and getting run over. Like it's so s It would be so sad to me to see that. Getting scared. I mean that's like the other thing. Yeah. Like put your dog on a leash. I get scared. I've almost been run over. Yeah.",
            "start": 2475.52
        },
        {
            "text": "run over. Like it's so s It would be so sad to me to see that. Getting scared. I mean that's like the other thing. Yeah. Like put your dog on a leash. I get scared. I've almost been run over. Yeah. It's like And I'm kind of smart. Yeah. Well, all of us. You know, it's tricky. I have my moments. Uh we have a super chat. Ricardo Gonzalez paid us $5 to say, \"Greg, that sounds like a Colombian obla. They traditionally come with dolce de leche inside.\" Yeah. Now, I don't like I'm I'm kicking around. My thing about this, you're talking about a flower wafer, which I appreciate. This looks like like a crepe but crunchy. Yeah. And so, like, my one question to you, Ricardo, and you don't have to pay $5 to tell me, is are they sweet like honey on their own? Like, is there honey in the wafer? Stro waffle. You're just remembering how big it is. A stroop waffle. It was too large to be a stroop waffle. You don't Maybe it was just someone didn't understand. This is back in the day. Nobody would have",
            "start": 2517.36
        },
        {
            "text": "You're just remembering how big it is. A stroop waffle. It was too large to be a stroop waffle. You don't Maybe it was just someone didn't understand. This is back in the day. Nobody would have had a stroop waffle back in the day. That's true. We didn't know anything about Holland. Nobody knew what's happening over there. We didn't understand Amsterdam. No. Someone say this is interesting because these are listed as wafers. Someone against a wafer but what what what made it so different? Well, I don't know. I mean, I was a child. has a child recollection of a wafer. When you are you're familiar with the Eucharist flavor with the Eucharist, the body of Christ. Oh yes. In Catholic church. Sure. Yes. So what Greg this the wafer the wafer? So for a long time they had they used to do the the big show of I haven't been to church in a while. I don't know what they do these days, but they had the one that was this big and it was it was pre lined. So when you you snapped it, it would like kind",
            "start": 2564.96
        },
        {
            "text": "show of I haven't been to church in a while. I don't know what they do these days, but they had the one that was this big and it was it was pre lined. So when you you snapped it, it would like kind of come apart. Yeah. And we it was always the coolest thing. But when you ate it, you always wanted it to taste like you're talking about like a street waffle, but it didn't. It was just un It's basically unlike it's like a styrofoam though. It tastes like a little bounce. Like it tastes like a really really like when your wife's like, \"I want to make tuna, but I want a healthy cracker to put on top of it.\" And now you're like ruining the tuna experience across the board because she gets the ones like gluten free, sugar free, salt free, fat free, air free, water free, egg free, all of those things. That's this wafer fins now. Honey wafers. Maybe those are them that the original honey wafer. Now, see, now we're talking. Okay. This feels more. This doesn't Oh. Oh. Oh. Okay. Click on the one",
            "start": 2604.8
        },
        {
            "text": "That's this wafer fins now. Honey wafers. Maybe those are them that the original honey wafer. Now, see, now we're talking. Okay. This feels more. This doesn't Oh. Oh. Oh. Okay. Click on the one that has the the picture of the wafer itself there. But that's just not even the size of a paper plate. Yeah. Uh, well, that's got cheese on it. That's what people [ __ ] do. Easy to put. What are people doing? Well, if it's a Well, at least it's microwafer s'mores. That That looks Oh my god. Can you Can we talk about Mike Snow Mike for a second? Sure. Always. Mike hits me up the other night. We're playing Dune Awakening. Obviously, we're going to play after this. If you guys were watching live, it was super fun. And he goes, \"Do you want to hop on, Slappy?\" And I'm like, \"Yes.\" And Andy's like, \"Yeah, we're we're hopping on.\" Mike's like, \"Great. I'll be on in 1 second.\" 5 minutes go by. 10 minutes go by. We're on the Discord. He's not on there. We don't know what the hell's going on. Mike, he",
            "start": 2644.88
        },
        {
            "text": "we're we're hopping on.\" Mike's like, \"Great. I'll be on in 1 second.\" 5 minutes go by. 10 minutes go by. We're on the Discord. He's not on there. We don't know what the hell's going on. Mike, he texts us both. Hey guys, sorry. I got to make a plate of nachos real quick. Oh, he and I also I didn't know that he was waiting for you guys. My bad. makes the nachos on a paper towel. Yeah, not on a plate. Who makes nachos on a paper towel? Does he have paper plates? I think he does. Okay. Does he have a real plate? Does he have anything but a paper towel? I mean, cuz the problem is the paper towel with nachos. You're eating paper towels. Eating paper towel. You're going to eat paper towel. Yeah. No, it's that's a banana. There are plates in our house. I don't know if he knows where they are cuz our stuff is kind of segmented. I don't think he cares, Joey. But then some one of my other friends was like, \"Yeah, you take the paper.\" This is literally a conversation I had. He goes, \"You take",
            "start": 2684.96
        },
        {
            "text": "our stuff is kind of segmented. I don't think he cares, Joey. But then some one of my other friends was like, \"Yeah, you take the paper.\" This is literally a conversation I had. He goes, \"You take the paper towel, you lay everything out, you put it in the oven.\" I'm like, \"What? We We're going to put We're going to light paper towels on. Are they not going to let you're going to start a fire, dude? You can't do [ __ ] like that.\" Also, if you're putting in the oven, what are you putting in allowed to give Mike these ideas while we're roommates? Like, I would like to have my house intact. No. A paper towel in the oven is a horrible idea. I know. That's what I told him. Oh, Mike, here comes Mike. Here comes [ __ ] pick up pick up a pick up a microphone. We got to get to the bottom of this. Please tell them you're which one? Cookie sheets. Like a ton of them. So, right now it's been brought to the attention of the panel uh Snow White Mike that you're making nachos by putting them on a",
            "start": 2726.88
        },
        {
            "text": "Please tell them you're which one? Cookie sheets. Like a ton of them. So, right now it's been brought to the attention of the panel uh Snow White Mike that you're making nachos by putting them on a paper towel. Oh, yeah. Yeah, yeah, yeah. Yeah, man. Snow, why are you nachos? But we're all on board with nachos. The nachos isn't the issue. Nachos plate nachos right now. Yeah. Yeah. No further preparation. The plate. Well, like here's the deal, Greg. You know what I mean? I got a couple things issues in my life if we're going through it. Okay. Uh I bought too big a plates. They don't fit in the microwave quite right. Okay. These big ass square plates. I thought they would be badass. You know what I mean? They go in the microwave. I turn the microwave off. Clay clay. So, I don't want to hear that. Okay. I don't want to hear it from the 90 seconds I'm waiting for these nacho cheese to melt. Okay. So, then I decide, you know what? Let's just skip the plates, skip the skip the dishes. I'll",
            "start": 2762.8
        },
        {
            "text": "that. Okay. I don't want to hear it from the 90 seconds I'm waiting for these nacho cheese to melt. Okay. So, then I decide, you know what? Let's just skip the plates, skip the skip the dishes. I'll put down just a nice little bed of paper towels. But the bottom level of nacho is just paper towel at that point. They melted together. Peel the cheese off. You're taking Is the paper towel killing me? Yeah, it's bleach. It's not good. But but but so that but that's the question, right? So So I think the question is, are you happy eating paper towel? The choice you're making. It's just a little bit. You know what I mean? I noticed the paper towel cleans you out. You know what I mean? The scoop is protecting the towel. You know what I mean? The scoop nacho is protecting the cheese going on the towel. The issue that I have is when I go with my rice cakes and cheese that I like. You know, I'm a rice cakes and cheese type of guy. I put the rice cakes down. When you put that on, the cheese",
            "start": 2807.36
        },
        {
            "text": "the towel. The issue that I have is when I go with my rice cakes and cheese that I like. You know, I'm a rice cakes and cheese type of guy. I put the rice cakes down. When you put that on, the cheese melts to the side. That's when it really gets on the towel. Now, you got to make a decision. How much towel is too much towel to eat? You know, someone say any towel too much towel in the control booth has brought up. Paper towels can contain chemicals such as chlorine and dioxins used in the bleaching process. potentially harmful if if ingested. Uh, you know, I'm g have to do my own research on that one. Yeah. Yeah. I mean, that might be fake news, but uh I don't think so. I think if you smell a paper towel, you can smell the bleach. You know, I haven't got there yet. So, I'll report back. Why don't we do this? Because we we like to go on a little Every once in a while, we like to go on a Target run. I'm buying his kid a $3,000 monster truck. Yeah. That he's not going to play with. What",
            "start": 2850.4
        },
        {
            "text": "don't we do this? Because we we like to go on a little Every once in a while, we like to go on a Target run. I'm buying his kid a $3,000 monster truck. Yeah. That he's not going to play with. What if I bought you a little set of plates from IKEA? How would you like that? When can I just go back to paper plates? You know what I mean? I'm just a paper plate guy. Do we have a problem with just paper plates? I think that you should own more trash in the land. Just recycle. You're fine. Why don't you just buy go to the dollar store, buy one plate that can be your microwave? Yeah, you can do what we do. Here we had one bowl for like one bowl. It was nice. We have multiple sets of plates in our house. Yeah. You also have to remember that I live with two incredible girls as my roommates and like they got all this stuff. I just don't know where it is. I have my set area. I go to that area. That's all I open up. Well, you would I don't believe that for a second. You don't know where the other",
            "start": 2888.48
        },
        {
            "text": "they got all this stuff. I just don't know where it is. I have my set area. I go to that area. That's all I open up. Well, you would I don't believe that for a second. You don't know where the other plates are and you're I believe it. Joey, believe I'm telling you. I Mike has like a cabinet and I believe that you know where that cabinet is and the silverware and that's it. I have one cabinet. It's above the fridge. So, I got to get on a chair to get on top. You are so full of [ __ ] I've never seen you get on a chair for that. It's a stepping st. You got to go to step all day. So, yeah. I mean, I'm making nachos on paper towels right now. It's an easy life, you know? It's just like a good time. We're going We're out there. Try to find the shaoo. Come on, bro. Listen, I'm going to play Dune in an hour. Watch out. Y you're my [ __ ] Mi. Love you. My life is never boring. I'll give him that. It's just it's a choice. Oh, yeah. You know, that's the part that I think upsets me is that he's",
            "start": 2925.84
        },
        {
            "text": "in an hour. Watch out. Y you're my [ __ ] Mi. Love you. My life is never boring. I'll give him that. It's just it's a choice. Oh, yeah. You know, that's the part that I think upsets me is that he's making that choice. Yeah. It's a choice that doesn't need to be made. Yeah. Yeah. Yeah. It's the wrong choice. It's the wrong choice. In no timeline or set of circumstances could that ever be considered the correct choice. Yep. Ever. Yep. Like putting the nachos just on the little glass thing in the microwave is a better choice than laying down the paper towel. Yeah. If you just use that as a plate, I think it would be less and just put it in your hands. Yeah. No, he's eating paper towel. I love Mike. The reason I love Mike is because he's a level of chaos in my life that I didn't know I needed. I think it's like having a child except I don't have to pay for him. Yeah, probably self-sufficient. I mean, at what point, you know, does like Ben, my three and a halfyear-old's capabilities outpac",
            "start": 2962.72
        },
        {
            "text": "I think it's like having a child except I don't have to pay for him. Yeah, probably self-sufficient. I mean, at what point, you know, does like Ben, my three and a halfyear-old's capabilities outpac his in terms of adultness. I think like Ben knows to get he uses Ben knows where his plates are. Yeah. So, this is a loaded question that I'm sure will backfire on me in a way here, Danny. But like you're down in LA, La La Land, Hollywood. You're working with comedians. You're working with actors. And this stick with me and think about before you just go yes cuz I know the answer is going to be yes. I'm not I'm not going to answer. I'm not going to answer. Are those kind of people [ __ ] up like our people cuz it's like games, video games, I'm going to talk about games attracts a certain person. A Greg Miller, a Dan Reker, a Snowike Mike. Weirdos that just don't know what they're doing. That Cortez with his case of chili. just weirdos like and I feel like right now having the kid in him in",
            "start": 3011.76
        },
        {
            "text": "A Greg Miller, a Dan Reker, a Snowike Mike. Weirdos that just don't know what they're doing. That Cortez with his case of chili. just weirdos like and I feel like right now having the kid in him in preschool has introduced us to other parents who all have real jobs like adult jobs, grown-up jobs and I go to their house like this place is really put together. They know what they're like they are adults whereas it's clear we all work with children. Is that like that in LA in your circles as well? So yeah, it's we are so yeah, you've made a choice to do a very odd thing with your life. If you decide I'm not going to do the normal job and at first that sounds really cool, right? Like this is always the problem is at first you're like you're like I'm going to do something a little different in my life. I'm going to do that and it's great. But the problem is is that adult does come. Adult will come for you. It comes for us all. Yeah. So, you have to start making adult decisions. So, what",
            "start": 3057.92
        },
        {
            "text": "in my life. I'm going to do that and it's great. But the problem is is that adult does come. Adult will come for you. It comes for us all. Yeah. So, you have to start making adult decisions. So, what you end up with is these weird, and I include myself in this, like man-baby people where it's like we're paying taxes. Mhm. And we're owning things and doing this. And also, we don't know how to live cuz I skipped all of those steps to focus on standup. And that is what LA is as a whole. It's a bunch of people who don't really know how to be adults, but then all of a sudden you are like, \"But I do pay bills now.\" And I have friends who have so have done very very well and they have so much money and they don't even know remotely what to do with it in an intelligent way. So they're burning through it and then they run out of money. Mhm. And I've this is like a classic cycles. You you have these actor friends. They will make a ton on the project. They burn through it just set it on fire and",
            "start": 3112.64
        },
        {
            "text": "it and then they run out of money. Mhm. And I've this is like a classic cycles. You you have these actor friends. They will make a ton on the project. They burn through it just set it on fire and then they start going like dude I'm in bit like I am oh my god. And then they book another thing and they like tighten it down and they're like, I got to, you know, oh man. And then they book something else and they have a ton of money and they just do the exact same cycle. And you just watch these cycles of money. It's brutal. Yes, these are all children. We are all children. But it's just that thing where Mike burns the money he doesn't have. Yeah. Spend so much money on Magikars, but he won't buy a round plate that fits in the microwave. He spent what, $250 on that Wolverine sweatshirt? We went out. You just buy more plates today to get Starbucks. We do our, you know, Mike and I like to catch up every day, talk about stream, stuff like that. And he goes, \"Slappy, come here.\" We walk out to",
            "start": 3161.52
        },
        {
            "text": "out. You just buy more plates today to get Starbucks. We do our, you know, Mike and I like to catch up every day, talk about stream, stuff like that. And he goes, \"Slappy, come here.\" We walk out to his car. He opens up the back door like he's about to sell me some illegal goods packed with Call of Duty Verdans merch packed with it. And it was lit. And I was jealous. And I offered to buy the hat off him and he said, \"No.\" Why are you trying to bump? It looks [ __ ] cool. It's a great dude. It says, \"Welcome back to Verdance. Drop in.\" Where would you wear that? On this podcast. You wear it on set and you want to wear it home. Your wife wouldn't let you. No, she would take that and throw it out. But it has one of those cool like little strings across it like you're a captain of a shirt. Oh, I do like those are pretty sick. That's like me, right? My wife is desperately trying to throw out a bunch of my shirts right now. We are in a war over I have a lot of wrestling shirts and she is in",
            "start": 3200.64
        },
        {
            "text": "I do like those are pretty sick. That's like me, right? My wife is desperately trying to throw out a bunch of my shirts right now. We are in a war over I have a lot of wrestling shirts and she is in a war to get them thrown out and we we have been battling. There's been a battle. I had uh there was a time when my wife and I had to have a come to Jesus where she was like, \"You either need to throw out all these shirts that kind of funny makes or you need to talk Joey into start printing shirts that aren't on black blanks because my entire closet was just black t-shirts.\" That was like Danielle, if you can get anyone to buy shirts that aren't on black, I would I would sell them. I know. But we just can't. I've thrown out so many shirts where she's like, \"I can't see you in that bridge shirt again. You can't wear that one more time.\" That shirt at this point is like legitimately 10 years old probably. It's a great shirt. But I I just cuz I was like I'm collecting them. These are like",
            "start": 3238.08
        },
        {
            "text": "again. You can't wear that one more time.\" That shirt at this point is like legitimately 10 years old probably. It's a great shirt. But I I just cuz I was like I'm collecting them. These are like keepsakes for me. Like this is an amazing like lineage of the company and it's all history. She goes throw them out. Not in this house. Not this is the battle. This is the war that we fight. Greg is a notorious hoarder of t-shirts. I just want you to know that. Does Jen care? Yes. And but I'm not a hoarder. You're on her side of the argument. And I'm not a hoarder. Like I just have two drawers of t-shirts. Big deal. shirts every day. And that's and that's the point which is that my wife has a closet of [ __ ] clothes that she never wears that are all beautiful. They're lovely dresses, but they're beautiful. And then it's like I have these drawers of t-shirts and she's like, \"You're taking It's like you're taking up way more space than me. How dare you just cuz these aren't like cultured.\"",
            "start": 3278.64
        },
        {
            "text": "beautiful. And then it's like I have these drawers of t-shirts and she's like, \"You're taking It's like you're taking up way more space than me. How dare you just cuz these aren't like cultured.\" Yeah. I'll tell you what, my wife my wife I carried it down over the weekend cuz I got more stuff coming in. We got a lot of Superman shirts going. My wife does this two twostep process for me and it's great cuz it's like a grieving process, but then I get to hold on to them for a little bit longer than they go. Yeah. The shirt goes from being a street shirt to a sleepy shirt. Cuz when they get, you know, we sell it, we to be not to toot our horn here, Joe, but we use really nice blanks for our t-shirts. Very soft comfort colors. Fantastic. And they only get more comfortable. So much so that once they fade a little bit, I'll go, \"Where did that shirt go?\" And I'll open up my jammy drawer. Mhm. And it'll be tucked in there and she goes, \"Now it's time to sleep in that for a year.\" And then",
            "start": 3323.28
        },
        {
            "text": "they fade a little bit, I'll go, \"Where did that shirt go?\" And I'll open up my jammy drawer. Mhm. And it'll be tucked in there and she goes, \"Now it's time to sleep in that for a year.\" And then once it gets threadbear, it gets thrown out. So it's very good. So maybe your wife could use that strategy for you where she Well, she's done that. There there's a I would say I have I have a top drawer. Yes, there's three drawers of t-shirts. Three drawers and the top drawers are t-shirt or t-shirts that don't have a design that she would like me to wear out. The next one are designs, but it's if I must and it's like if I ever see this outside the house, I'll kill it. I must like that. I'm going to disown you. I'm going to pretend like I don't know you. I do wish there was something I could do cuz it is that idea. We like we went Jen surprised me on that Father's Day trip or whatever, right? And like what do I need to dress like like she's like no it's a casual trip and then we got to go out",
            "start": 3361.04
        },
        {
            "text": "it is that idea. We like we went Jen surprised me on that Father's Day trip or whatever, right? And like what do I need to dress like like she's like no it's a casual trip and then we got to go out to dinner and she I was put on some wrestling shirt and she's standing there in this like night not not a nice dress but like I love the sundress I guess. I'm like well come on. I should have tossed in at least a WWE collar shirt I have. What are we doing? Yeah. or the new Superman superman dog shirt that you bought. I did. Yeah. Well, I didn't get that one yet, though. I got three from Shout out to Homage that uh they make the really really nice shirts with little H on them. You know what I mean? I got a a gift pack from them of their new super cozy uh Superman sweatshirt, a Superman cozy shirt, and then a crypto shirt that I'm very stoked about. Everybody does crypto. Everybody loves a crypto shirt. Look at this. Look how And like again, if you don't know uh homage, you do. Homage. I",
            "start": 3401.6
        },
        {
            "text": "shirt, and then a crypto shirt that I'm very stoked about. Everybody does crypto. Everybody loves a crypto shirt. Look at this. Look how And like again, if you don't know uh homage, you do. Homage. I don't I if I was saying I was making an homage, I'd have no problem. When I read it off the site, my brain breaks for some reason. Uh but you see me wearing before the old ECW, the Raws wore one. It's those guys that make the really really high quality shirts. Those are nice. I have a lot of Yeah, I have like I almost wore a I almost wore a wrestling shirt here. And then I heard my wife I heard my wife go, I know it's a very comedian look, which I hate. I hate when I'm crypto shirt is What do you What's your What's your uh what's your vibe on stage? your punch line all week. Yeah, because you look nice right now. Is this kind of what you wear when you're on stage? Yeah, I tend to This is sort of where I've landed is like it's either blank t-shirt, sometimes a button-d down, but I don't",
            "start": 3441.68
        },
        {
            "text": "look nice right now. Is this kind of what you wear when you're on stage? Yeah, I tend to This is sort of where I've landed is like it's either blank t-shirt, sometimes a button-d down, but I don't love it and then it's like jacket based on the based on temp of the room. I'll uh I'll chuck on a jacket, but the jacket is I think there's some comics who only perform in jackets. Yeah, I'm jacket optional. I I I worry because sometimes the heat sneaks up on you fast. Yes. And then you get a little dehydrated on stage, especially for like Punchline, which I'll give you fair warning, does not have air conditioning, so it can get a little bit steamy in there. Yeah. So then, so I'll probably be in a t-shirt. I I'll like this. I'd feel very comfortable doing my shows in like I feel good about that. And yeah, but I uh I'm I'm a laid I'm chilling. Not doing a suit. You're not dressing in a three-piece suit for No, I did I did a suit when I wore when I did Col Bear. I wore a suit and I uh I was",
            "start": 3481.52
        },
        {
            "text": "And yeah, but I uh I'm I'm a laid I'm chilling. Not doing a suit. You're not dressing in a three-piece suit for No, I did I did a suit when I wore when I did Col Bear. I wore a suit and I uh I was like, I really want to wear a suit when I do late night, but I was like, I don't want to um I don't want to screw it up. And so I uh for two weeks I did every show in LA in a suit just to if you just wore the same suit for two weeks straight, didn't get it dry cleaned, and then rock it on late night. Yeah. Yeah. I would have done that if my wife hadn't been like, \"So think about it.\" Yeah. Let's let's talk about it for a second. Use our head. And I was like, \"Dumb.\" Uh, but yeah, so I practiced in a suit, so I was like smart. I was writing. That's actually really smart. It was I It was I I had a couple I've had a couple my late night I stand by as like I did a couple really good business moves with that one. Look at you. Yeah, that suit looks so good. That man knows how to sell a pen. I was",
            "start": 3523.04
        },
        {
            "text": "couple I've had a couple my late night I stand by as like I did a couple really good business moves with that one. Look at you. Yeah, that suit looks so good. That man knows how to sell a pen. I was so right. Um, that's actually a crazy angle. Pull that back up. Pull that back up, Kev. He's going to get it. There he is. What a crazy angle. I can't believe that's out. This is the first time you've seen this. Yes, because the secret of late of the Col Bear show is he isn't there. Do you film that earlier? You film it on a separate night. Oh. And so they That's so much better. It's so much It's a bummer because it's a bummer because everybody in your because everybody in your family goes, \"What was Steven Coar like?\" And you go, \"I never met him.\" And they go, \"Ah.\" So you do that for the rest of your life. But the upside is there isn't a band. There isn't a weird celebrity there. There isn't like it's like the stage is just empty and it's a crowd that's told like, \"Hey, Six Comics are",
            "start": 3567.36
        },
        {
            "text": "of your life. But the upside is there isn't a band. There isn't a weird celebrity there. There isn't like it's like the stage is just empty and it's a crowd that's told like, \"Hey, Six Comics are doing their late nights.\" That's So it's like a show. It's like a show. So they're fired up. They're popped. So much better. So much easier. Really great way of doing that. Yeah. Like that's the shot most people have and that's just like that's cool. I didn't realize they did that. That's actually really That's great for them. It's great. So if you watch the show, he's like, \"Please welcome Danny Jones.\" And then it just got come out and then at the end he's like, \"So it's like he doesn't invite me over. You don't get to go see.\" Yeah. That's And that was like kind of nice too is like Yeah. But there's that was kind of nice. I don't want to talk to him. Well, it's like no I would have loved but you know it's like there used to be this thing of like when you do late nights sometimes they'll",
            "start": 3618.0
        },
        {
            "text": "there's that was kind of nice. I don't want to talk to him. Well, it's like no I would have loved but you know it's like there used to be this thing of like when you do late nights sometimes they'll invite you over and it's like well that can't happen. Yeah. That cannot happen here. Of course it's dead. I like that you live in I like that you live in the world where you're like I don't even want to go over to the thing. I got too much [ __ ] going on. I'm too much. I got a show. If Coar wants me for the desk, book me on a different Exactly. Get me over there to talk about one of the various projects you're on. Yeah. Yeah. Yeah. But but it was uh Yeah. Yeah. That was They also like love to change your sets when you do late night. That's the terrifying thing. Yeah. You have to submit the whole thing. You submit it, but then like some of them, the bookers will be like, \"What if we move this over here and what if we did this over here?\" and you're like, I've done this every way you're",
            "start": 3653.76
        },
        {
            "text": "whole thing. You submit it, but then like some of them, the bookers will be like, \"What if we move this over here and what if we did this over here?\" and you're like, I've done this every way you're talking about. Like I you we I can tell you this is the way to do it. But they'll make it's why a lot of people have very bad late night sets is because they'll they'll mess with it. And so, but I had watched my friend Rammy do a really good job of just he's stuck by his guns. And so I like went into it being like and then I was like, I'm not changing the line. I'm going to hold strong. And so you would do these shows the week of they would book all these shows late at night that like nobody was at and the booker was there and all of us would do our sets and I bombed every single one of them. Uh cuz my set was like one long thought. It was so bad for the rooms and but I knew it was going to work. But I was like this is not how you do this. And so I would uh I would go on stage and I would",
            "start": 3691.12
        },
        {
            "text": "Uh cuz my set was like one long thought. It was so bad for the rooms and but I knew it was going to work. But I was like this is not how you do this. And so I would uh I would go on stage and I would bomb and this woman Jessica, she was so so nice, but she would come off and she'd be like and I would go, \"I feel so good. I feel so good about it.\" And she'd be like, \"Really?\" And I was like, \"I feel unbelievably confident.\" She and she was like, \"Okay.\" And then like another comic would be like more wavery. And so she would work with them. And I just like kept being like, \"I'm good. I'm good. I'm good. I'm good.\" And that's how I got to do my set as I wanted to. Smart. I lied. Just kept going, \"Oh my god, so good. Are you kidding me? That was so good.\" And she was like, \"All right, you want to eat it? Go ahead.\" Yeah. Yeah. She just like at a certain point was like, \"I guess he just thinks this is gonna go well.\" How much time do you do when you do late night? You're supposed to do",
            "start": 3733.76
        },
        {
            "text": "want to eat it? Go ahead.\" Yeah. Yeah. She just like at a certain point was like, \"I guess he just thinks this is gonna go well.\" How much time do you do when you do late night? You're supposed to do five. My late night set was seven minutes. Oh, I ran it so hard. I went seven minutes. It took me so long. Uh I remember going backstage and she seemed like she'll deny this, but Jessica, I swear she she was like, \"That went great.\" Like she seemed stunned. She seemed blown away. I was like, \"Yeah, yeah, I told you.\" I was like, \"Yeah, I lied. I just kept lying. That's That's the way to do it. Secret to success.\" The secret to success is a lie. I did. And it worked out. Yeah. But they love to change [ __ ] Move it around. And you got to be clean. And you got to be clean. That's why Nick hasn't done it ever. Yeah. That's That's why he's a regular punch line, but he's like he's like Andrew does. I tell you what, if I had if I had a nickel for every time. Have you submitted? No, I've never",
            "start": 3779.04
        },
        {
            "text": "done it ever. Yeah. That's That's why he's a regular punch line, but he's like he's like Andrew does. I tell you what, if I had if I had a nickel for every time. Have you submitted? No, I've never submitted before. You should submit. In due time. Okay. Yeah. Get that. It's a good It's a It's a It's a fun process to go through. I've had a a bunch of friends do it. And uh aside from the uh the feedback I've gotten from people like competing in like comedy competitions, they're like late night submission is probably the most anxietyinducing thing they have talked about, but they had fun doing it. But the leadup to it was like, \"Oh, this is very very nerve-wracking.\" I I my biggest fear going into it was the night before I did like a visualization in the shower. I was like, \"I'm going to put myself on the stage, blah blah.\" And I did it and I saw my dad in the top and I started to cry in the shower and I was like, \"That's bad.\" I don't know. I don't know things about like it's not good.",
            "start": 3827.44
        },
        {
            "text": "myself on the stage, blah blah.\" And I did it and I saw my dad in the top and I started to cry in the shower and I was like, \"That's bad.\" I don't know. I don't know things about like it's not good. We cannot cry on stage. So I like I was like, \"Okay.\" So I was like, \"Really?\" Cuz it was it is that buildup of like you you got to be locked in on the stage. The nice thing is you do stand up. I've done standup every night in my entire adult life. It's the only thing I know. I've done a show every night. It's all I know. And so the second they handed me the mic, I went completely calm. It is There's a moment in my set where I'm looking at the ceiling and I remember thinking, \"Wow, the ceiling changes colors.\" In the Ed Sullivan Theater, they change the colors. That's cool. And then I remember going down going, \"Boy, you are calm.\" cuz I was just literally like they were laughing. I just like had that thought. That's how calm I was. I walked off stage began to ball. Did not stop crying for",
            "start": 3868.4
        },
        {
            "text": "going down going, \"Boy, you are calm.\" cuz I was just literally like they were laughing. I just like had that thought. That's how calm I was. I walked off stage began to ball. Did not stop crying for about two days straight. I cried so hard. Just like all the emotions came out. Yeah. Yeah. Yeah. But I didn't cry on stage, but I was the second I got off stage cried so hard. Yeah. Silly question. I would expect you or you to know. Does that happen a lot where people cry on stage? Like where I mean I mean like in that moment like I I've never seen that and I've watched a lot of standup comedy on, you know, late night or whatever. So, I will, spoiler alert, in my new special. You will see me cry. My new special I cry. Oh, yeah. On. When's your new special out? I don't know yet, but I cry. Yeah. Yeah. I I It's catch you off guard. I had a feeling it was going to happen cuz there was a buildup to a moment, but it was two million times harder than I thought it was going to be. Mhm. Like I",
            "start": 3912.16
        },
        {
            "text": "Yeah. I I It's catch you off guard. I had a feeling it was going to happen cuz there was a buildup to a moment, but it was two million times harder than I thought it was going to be. Mhm. Like I really Yeah, it due to the setup of the situation, I was like, \"Oh man, it's really coming out.\" Uh so yeah, no, it's probably the it's probably the hardest I've cried in my adult life was at the is crazily caught on camera. Wow. That's wild. It's wild. What a tease. I want to watch it now. I know. You can't tell us that. And then I know. Well, it's Well, but I was like because I was like it is pertinent, but usually you do not cry on on stage cuz usually you're um usually don't cry on stage. You're not supposed to. I don't have the breath of experience that daddy has in stand up, but I'll go to say you don't cry when you're on stage for the most part. Well, it's actually one of the cool things about standup is cuz you do it so often you go, \"Oh, I don't even feel anything anymore.\" But you do",
            "start": 3953.36
        },
        {
            "text": "you don't cry when you're on stage for the most part. Well, it's actually one of the cool things about standup is cuz you do it so often you go, \"Oh, I don't even feel anything anymore.\" But you do cuz you've never sneezed on stage. You've never There's all these things that actually you'll never do on stage cuz there is still a little adrenaline going through your body. Yeah, that's that's a good point. That what a cool It's true. How many times like I've had moments where I'm like, \"Oh man, I'm not feeling great or like I have an allergy.\" Yeah, you're right. you go up on stage, you're like for that 10 minutes, you're solid. I've I've been in the middle of a panic attack, gone on stage, fully calm, right back off stage, right into the pan, but like my body's just like, \"We're on stage. We're good.\" That's cool. Yeah. Yeah. Yeah. You still get a little adrenaline. Oh, yeah. Cool. Uh Danny, I want to promote your upcoming tour and all that stuff, but before we do, my last thing I",
            "start": 4000.96
        },
        {
            "text": "We're good.\" That's cool. Yeah. Yeah. Yeah. You still get a little adrenaline. Oh, yeah. Cool. Uh Danny, I want to promote your upcoming tour and all that stuff, but before we do, my last thing I because this is a fleeting thought that you just said something that cued it. What happened with you and uh Bert and Bert? Bert talked about your you cuz you did one of the specials you promoted with us was the choose your own adventure like I'm going to do that and so he watched it and like his friend was complimenting it and he was like I didn't like it or something. Well he no he he said you sucked. So well you know Bert uh went on a podcast and he brought it up by himself to unprovoked unprovoked shots at you for no reason. So Bert brought it up unfooked and he uh you know he said he didn't like it and I felt that wasn't a necessary thing to say particularly cuz like I don't really know him. The thing I say in that thing was like I I know a lot of people work with Bert genuinely. He is a",
            "start": 4034.48
        },
        {
            "text": "it and I felt that wasn't a necessary thing to say particularly cuz like I don't really know him. The thing I say in that thing was like I I know a lot of people work with Bert genuinely. He is a great guy who treats people really well. So I I really nothing positive. So I like really kind of put I I was like I'm not here to get in an argument with Bert Crusher. I'm here to defend my special. I stand by if you make it to the end of that special, you would have answered his criticism. Yeah, I don't think he made it to the end. Uh, which is a little add Well, and look, that's that is the problem with that special. That is why that special we could debate is a failure because a lot of people don't make it to the end of things. I did. And the end of it really wraps it up. And that's a that's so he didn't make it there. And uh that's what uh I was told by a streamer when I made it and uh that's what happened. And so yeah, we we learned a valuable lesson, but yeah, so Bert and I uh I you",
            "start": 4078.8
        },
        {
            "text": "so he didn't make it there. And uh that's what uh I was told by a streamer when I made it and uh that's what happened. And so yeah, we we learned a valuable lesson, but yeah, so Bert and I uh I you know, he said that, I responded, we moved forward with our lives. Oh yeah. Well, I didn't mean like it was drama. It was just fun. It was again, I know you might not see it this way, but as me watching you and knowing you and similar to Nick, it was just like ah Danny and it's like B says, but it was still like it wasn't like he was like Danny sucks. It was like this fun thing and you had such a great response where you cut it on your Instagram where you were like, \"Well, that was over the Okay.\" But yeah, it was like a really fun way to do it of like two artists talking about art. Yeah. I I just was like I at first I was like, \"I'm not going to do anything.\" And then I was like, \"Well, he brought it up like I'm allowed to respond, you know?\" So I like So I did. So uh yeah, it's I I think",
            "start": 4129.12
        },
        {
            "text": "was like I at first I was like, \"I'm not going to do anything.\" And then I was like, \"Well, he brought it up like I'm allowed to respond, you know?\" So I like So I did. So uh yeah, it's I I think the only thing that's I did assume when I posted that that I would hear from Bert and I have not heard from Bert and that part makes me sad. I did think he would be like, \"Oops of days. Sorry about that.\" And I'd be like, \"No big deal. You saw my pose. No big deal.\" Haven't heard from him. But um you know, well, we have burden though. That'd be amazing. Uh but yeah. Yeah, that's that's that. It's uh you know, it is what it is. Uh we live and we learn. To segway from that, a live chat came through. Uh Joseph Griggsby in the chat was asking, \"Are you talking about Ramy Yousef?\" I am talking about Ramy. Yes, he is. He just did a show with him. I did a show last night. Oh, last night at the uh the which is amazing. The Curran Theater. Yes. Pretty big deal. Ramy is uh Yeah, Ramy's one of my I",
            "start": 4164.8
        },
        {
            "text": "Ramy. Yes, he is. He just did a show with him. I did a show last night. Oh, last night at the uh the which is amazing. The Curran Theater. Yes. Pretty big deal. Ramy is uh Yeah, Ramy's one of my I slept on Ramy's couch when I first moved to LA. He's like one of my oldest friends. Isn't that weird? Like so I guess a question for you and I know we're getting a bit Do you think is it incredible to to enjoy the success you've had but then also to like see your friend group like also get that? Yes. And I got very lucky where um I'll say his name. Uh, so I have a friend named Josh Benowitz and Josh is now one of the top writers in Hollywood. I would argue he's unbelievable. Created every works on Ramy, uh, Carmichael show, like so many shows that, you know, in movies. Uh, he wrote the Babes movie with Alana Glazer. He he's just amazing. And when I first started in New York, he was one of my first true comedy friends. And he exploded by me so fast. It was unbelievable. It was just like that",
            "start": 4209.28
        },
        {
            "text": "with Alana Glazer. He he's just amazing. And when I first started in New York, he was one of my first true comedy friends. And he exploded by me so fast. It was unbelievable. It was just like that thing of like we both were starting out and then he was repped by a massive manager and agents and was touring and was auditioning and in it was just like everything I wanted he he got immediately and I was so jealous and at a certain point I was like why am I jealous this is a good thing great thing and it and it and not just did I go I'm going to now root for my friends it got it out of my system and so now I am so I think lucky in a sense that Josh really was like my gateway into like now I'm like I have root I root so hard for my friends. I love when my It's so cool seeing your friends get s It was so cool. Rammy last night was in front of 13,600 people and like they're so excited to see him and he's so he's so good on stage and he's so good and we've both like I've watched him get so",
            "start": 4253.68
        },
        {
            "text": "s It was so cool. Rammy last night was in front of 13,600 people and like they're so excited to see him and he's so he's so good on stage and he's so good and we've both like I've watched him get so much better. It's so cool. Rachel I've known since college. Alex Edelman I've known since college. Uh, like I could start going down the list of my friends. Alex just uh about what a year ago did his oneman show for HBO. Yeah. Yeah. I went to I went to his Broadway opening night. That's awesome. Like seeing your friend do a Broadway I used to be in the show. My only touchstone for He used to mention me in the show cuz I he was uh when he did his ridicul if you don't know the show, he went to a white uh white pride party. Uh he is Alex Edelman. is very Jewish. Uh, and I was one of the first people he told about it and I was like, \"Are you out of your mind? You better talk about this on stage.\" And I used to be in the show and then he cut me. I know. But, uh, yeah, Alex was like Alex is",
            "start": 4304.72
        },
        {
            "text": "people he told about it and I was like, \"Are you out of your mind? You better talk about this on stage.\" And I used to be in the show and then he cut me. I know. But, uh, yeah, Alex was like Alex is Yeah, it's just really cool. I saw I I briefly met him at Cheaper than Therapy. He came by and I don't know if he was headlining and work. I think he was working on it at that moment, but I think he had was workshopping it like at a theater and then was just like I'm going to go by Cheaper just like do a set just have some fun. And so it was interesting hearing him talk about like how he's taking that on tour and then I was like what are you doing at Cheaper? He's like come hang out and like just just do some of it or do like just workshop a little bit of it at this cool little club when there's zero expectation that he's going to be there. Yes. Right. And so I think for and then for context like for you guys like some of the smaller clubs like San Francisco is a pretty good scene and so",
            "start": 4356.4
        },
        {
            "text": "zero expectation that he's going to be there. Yes. Right. And so I think for and then for context like for you guys like some of the smaller clubs like San Francisco is a pretty good scene and so people will come in and you know everyone like you know and you just drop by and just just go put up and people freak out because they're like holy [ __ ] this person's here you know it's pretty cool. The cool thing about like you know I was like I'm always like go see a headliner if you know them. It's so fun. But one of the coolest things about standup is you can go to a random night and we do need to get up like you go standup is a game where you just go up regularly. So, we do drop I I'll drop drop drop in. People drop in like people are drop I'm dropping in somewhere tomorrow night somewhere in San Francisco. Don't go to it. Please go to my shows instead. But like go to punchline. Go to punchline comedy club.com. Get tickets Wednesday through Saturday. Please for the love of God. Uh I",
            "start": 4396.72
        },
        {
            "text": "in San Francisco. Don't go to it. Please go to my shows instead. But like go to punchline. Go to punchline comedy club.com. Get tickets Wednesday through Saturday. Please for the love of God. Uh I I'm very excited. Um but yeah, it's like we drop in all the time. I'm sure he and I'm sure he was he's great. great. I mean, he's a really great guy. But yes, I have so many friends who are so successful and it is crazy and wild and uh yeah, it's it's it's very cool. I'm very happy for them all. Jack, no. Never heard of him. We're not putting him over anymore. All right. We've done enough of him. We got him three movies last year. Exactly. I think Exactly. We've done enough back to the games cast. All right. I keep invoicing him, too, and he just he's not paying. No, it's weird. I keep sending him the 10% invoice fee for that. Doesn't work out. Danny, you're fantastic. Thank you for making the time to come by today. Please. Anytime. And truly anytime. Where can people keep up with you?",
            "start": 4431.6
        },
        {
            "text": "him the 10% invoice fee for that. Doesn't work out. Danny, you're fantastic. Thank you for making the time to come by today. Please. Anytime. And truly anytime. Where can people keep up with you? Plugs. Here we go. So, uh, number one, uh, follow me. The following me on social media is always the nicest thing you can do. Danny Joll on all platforms. Um, that really is like always just like the nicest thing you can do. Um, and it is like the strongest currency in our game. Uh, you can see me on the road right now. Uh, obviously this week, Wednesday through Saturday, SF, please buy tickets. I would love for I would love for you to see you all there. Um, and then also I'm in DC, I'm in uh Boston, I'm in uh everywhere. Just please buy tickets. And the last thing I always say uh on any podcast I do is that standup comedy is like hockey. It is fun to watch in person, but it is fun to watch on TV. It's so much better in person. It is just a different experience. So, if I am not coming to your",
            "start": 4472.96
        },
        {
            "text": "do is that standup comedy is like hockey. It is fun to watch in person, but it is fun to watch on TV. It's so much better in person. It is just a different experience. So, if I am not coming to your city, please just look up your local comedy club and look at their upcoming lineups. Find a headliner that you can find 10 minutes uninterrupted online. If you cannot find 10 minutes uninterrupted, no crowd work, no anything. If you can't find that, don't go. But if you can find that, just buy a ticket to go see them and just trust it and you'll have the best time of your life and you'll never stop going. It's the best art form on the planet. God damn, that's a sign. That's a pitch. That's a salesman. That's it right there. Everybody, thank you so much for joining us for another episode of the Kind of Funny Podcast. Remember, each and every week, four, sometimes five best friends gather around this table coming to talk to you about whatever it is they want to talk about. And if you like",
            "start": 4518.48
        },
        {
            "text": "Kind of Funny Podcast. Remember, each and every week, four, sometimes five best friends gather around this table coming to talk to you about whatever it is they want to talk about. And if you like that, you'd like that. So, you should pick us a membership. YouTube.com/kindfunny games. Uh, patreon.com/kindfunn Apple and Spotify to get each and every episode ad free. Of course, to get your daily dose of me, Greg Miller under Greg Way, but more importantly, support an 11 person small business out here trying to entertain you. Oh, look. I'm smaller than Nick. What's it like, Greg? Do you feel powerless? I don't like it. What is your feeling? Terrible. Uh, Nick and Mike are about to stream some Dune Awakening. Danny's about to rock comedy in San Francisco at Punchline. Uh, Joey just going to hold down the fort like she always does. Yeah, I got a lot of movies to see this week. God damn it. Until next time, it's been our pleasure to serve you. I get used to this. [Music]",
            "start": 4563.28
        }
    ]
}