{
    "id": 14284,
    "video_id": "MU4lm-_VhUM",
    "show_name": "Highlights",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Andy Cortez"
    ],
    "title": "Greg Miller Gets Emotional Talking About Superman",
    "description": "From In Review: https://www.youtube.com/watch?v=xKM6gO6pYBk&t=2986s&ab_channel=KindaFunnyGames Go to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\n\nFOLLOW US ON EVERYWHERE!\n---------------------------------------------------  \nYouTube: Youtube.com/KindaFunnyGames\nTwitch: https://www.twitch.tv/kindafunnygames\nPatreon: https://www.patreon.com/kindafunny/\nTwitter: https://twitter.com/KindaFunnyVids\nInstagram: https://www.instagram.com/kindafunnyvids/\nTikTok:  https://www.tiktok.com/@kindafunnygames?lang=en",
    "published_at": 1750349704,
    "duration": 1669,
    "transcript_chunks": [
        {
            "text": "Greg Miller, let's get to you. What do you think about Superman one? Uh, I mean, I can start with the negative if you want. You know, I've been on the record for many years on podcast, if you'll get me there, talking about of how much damage this movie did to generations of fans to make Superman the most boring [ __ ] on earth. You know what I mean? He's he's too powerful. He can rewind time. What are we talking? You know what I mean? Like there the thing again, we're talking about it from a film making perspective at 78 and how amazing the effects are and what they did there and how great it is. But also, I love miniature work. You watch those original Star Wars, there's something about that that looks so much better than we're watching whatever shitty alien it is with the [ __ ] horrible rotoscope 3. You know what I mean? Like, I like this. I'd rather it look dated this way than that way. Um, but I think one of the big things from that moment in time that's so interesting and always",
            "start": 0.08
        },
        {
            "text": "rotoscope 3. You know what I mean? Like, I like this. I'd rather it look dated this way than that way. Um, but I think one of the big things from that moment in time that's so interesting and always puts me at odds when I have to debate someone on Superman or somebody just wants to say, \"Oh, he's so boring. Why do you like him?\" And I have to be like, listen, like your impression is based on what he was in the golden age of superheroes, right? Like it starts June 1938, right? Why does it start June 1938, Tim? Good question. You don't know? No, it starts June 1938, even though it's not the actual issue they're opening because of course that's the dated date of Action Comics number one. Okay. Action Comics number one actually, of course, came out April 1938. Uh but it was dated uh 38 on the actual comic itself. So they're Richard Donner is making a Superman movie about the Superman he grew up with and he does a great job with it. As me a modern Superman fan, right, the only the Superman",
            "start": 36.56
        },
        {
            "text": "actual comic itself. So they're Richard Donner is making a Superman movie about the Superman he grew up with and he does a great job with it. As me a modern Superman fan, right, the only the Superman I really knew, right, when I'm not a kid watching this movie, but the kid collecting comic books and reading, right, is post Crisis Crisis on Infinite Earths. It was a giant DC comics event that came together and took the infinite earths of DC comics and condensed them to one and gave us a Superman that is probably far more the Superman you know from Smallville or Lois Lois and Clark or even the Lois and Superman and Lois the the one they just did with Tyler Hawklin. I can't get the name off my head. You know what I'm saying though? Um a modern Superman that isn't the most powerful person in the world that is is a person that's more Clark Kent, right? Like that's my biggest thing. Like the you know I'll never forget the heartbreak I had watching Kill Bill volume 2 where Bill launches into",
            "start": 79.12
        },
        {
            "text": "world that is is a person that's more Clark Kent, right? Like that's my biggest thing. Like the you know I'll never forget the heartbreak I had watching Kill Bill volume 2 where Bill launches into this monologue about Superman and how he's really Superman but he puts on the disguise of Clark K and it's like that's what this movie is, right? I as a person who has watched this and read so much and done all this different stuff, right? I look at this movie and I'm always in a way so depressed by it of the fact that Superman is Superman and comes back to Metropolis and has to act like Steve Urkel. Like it's really what a shitty existence for this guy. And I I know that I'm taking a comic book movie even though it's an elevated way too seriously as I enter into this. But it's like I am always like I just I feel so bad for him having to fake who he is. Which again, imagine that being my perspective as a fan when I get to Lois and Clark and Dean Kane shows up and plays a Superman and a Clark",
            "start": 123.68
        },
        {
            "text": "I just I feel so bad for him having to fake who he is. Which again, imagine that being my perspective as a fan when I get to Lois and Clark and Dean Kane shows up and plays a Superman and a Clark and a Clark that isn't a bumbling [ __ ] right? Like he isn't, you know what I like? And it does that that makes even less sense with glasses being your only disguise. I get all this. I understand. And again, it would never take away from the amazing performance of Christopher Ree here of being able to be Clark Kent and be that in in a moment change into Superman and you watch and you go, \"Holy [ __ ] that is two different things.\" Like that's incredible. But in terms of my take on this movie and my feelings about this movie, obviously I adore it. Obviously I grew up on it. It's an interesting one of like obviously we owned it but the memory for me is always going to the gas station at the corner which was Super America where they had a movie section in the back when you could rent stuff from",
            "start": 171.6
        },
        {
            "text": "of like obviously we owned it but the memory for me is always going to the gas station at the corner which was Super America where they had a movie section in the back when you could rent stuff from and I remember we would go there and I would rent weekend after weekend just down the line of the Superman movie. So, one Superman, next one, two, three, you know, every weekend out it. And I I this is a fun one. You remember Benjamin Cooper? It was a place downtown San San Francisco uh oyster cocktail spot. It's out of business now. It didn't survive COVID. Rest in peace. But there was this really bizarre moment for me where it was like in a hotel or attached to a hotel. So, you had to go through the hotel lobby to get to the bathroom. And I was coming back from the bathroom a few cocktails in one of the times I was there. And I just stopped because I got hit with the wood paneling they used smelled like the wood paneling in that Super America that I hadn't smelled in three, four decades",
            "start": 213.92
        },
        {
            "text": "one of the times I was there. And I just stopped because I got hit with the wood paneling they used smelled like the wood paneling in that Super America that I hadn't smelled in three, four decades or whatever it was. And I had to text my mom and be like, I've been I'm getting choked up. So I've been transported back to this place, you know what I mean? That I haven't been. And I can see Superman, you know what I mean? Like that's what this franchise movie whatever means to me. There it is. Rest in peace Benjamin Cooper. So it's like that's how intrinsically this is tied. So, it's like I can sit here and complain about all my Superman mythos things and the the [ __ ] boulder I've had to roll up a hill my entire life of being like, \"No, he's not that powerful.\" Like, no. Well, the animated series, a tank could kill him, you know? I mean, like a video game would be cool, but there's so much so much pulled into this, right, of that what that is and who it is. And yeah, Christopher Ree",
            "start": 250.88
        },
        {
            "text": "series, a tank could kill him, you know? I mean, like a video game would be cool, but there's so much so much pulled into this, right, of that what that is and who it is. And yeah, Christopher Ree was my Superman growing up, like for sure. like I he didn't start the vibes because I had the toys and I had the things and whatever, but like I'm sure as soon as we could, we were watching and when I pictured him and I had the posters and all that stuff and like, you know, you bring up like we talk a lot about deaths and where you were for that. Like I'll never forget waking up uh at my mom's house when he passed away. You know what I mean? I I was up visiting my mom. I was at Missou at the time and I was going to drive back that morning and waking up to the news that he had passed and I was like, \"Oh my god.\" And it would have been I'm within a few years there I had seen him speak live after he had been injured. My mom, you know, I mean like I remember world my world stopping when he got",
            "start": 290.48
        },
        {
            "text": "\"Oh my god.\" And it would have been I'm within a few years there I had seen him speak live after he had been injured. My mom, you know, I mean like I remember world my world stopping when he got injured and it was that like you know there is no internet so you're waiting for the new news every night of like what's going on? Is he going to be okay? D and I remember uh you know obviously he pulled through and he's he was so open about his journey. I I really recommend you read still me if you haven't. It's a great book. Obviously the movie again is way quicker to it. Superman. It pulls a whole bunch of documentary footage that I remember from back in the day. Then being here, he talks to his whole family. It's incredible. But I remember his journey being so inspiring. And you know, my mom was an administrative assistant for a long time. And it's like it sounds like an episode of The Office, but there was like some paper convention that was like she was working at a paper company or",
            "start": 327.84
        },
        {
            "text": "was an administrative assistant for a long time. And it's like it sounds like an episode of The Office, but there was like some paper convention that was like she was working at a paper company or whatever. You can all laugh. It's okay. I see you holding back the smiles. But it was like they were doing it and it's one of those like kind of like their E3 where you'd go and like you'd get the swag bags and put the new pens in them and all this jazz and I like I liked going and doing free [ __ ] but it was that like for some reason that thing had hired Christopher Reeve to come speak at it and so I got to go there with my mom you know what I mean? You talk about generational and stuff like this of like him in the wheelchair up there talking about his journey and talking about all this stuff and I don't know probably you know some leadership or you know perseverance I don't know I don't remember what the narrative was other than he was there and it was first time I saw him bald like he",
            "start": 367.04
        },
        {
            "text": "and I don't know probably you know some leadership or you know perseverance I don't know I don't remember what the narrative was other than he was there and it was first time I saw him bald like he made a joke about he looks more like Lex Luthther now than he does Superman or whatever but yeah like you know I mean that's like a touchstone for me in a very interesting way like and I've talked a lot about this you know um I remember when Harold Ramos passed away and everybody at IGN looked at me to do something to say something to make an up at Newton I like I really am not that guy. And it's a weird thing because obviously Harold Ramos I loved his work but it's like I never felt like I knew Harold Ramos and even like watching Ghostbusters over and over again. I never pretended I was Egon. I pretended I was me as a Ghostbuster. I was running the Chicago chapter or whatever the [ __ ] it was a kid. You know what I mean? Whereas like Superman and Chris Reeves like he was Superman. You",
            "start": 399.92
        },
        {
            "text": "I pretended I was me as a Ghostbuster. I was running the Chicago chapter or whatever the [ __ ] it was a kid. You know what I mean? Whereas like Superman and Chris Reeves like he was Superman. You know what I mean? Like that means so much to me to this day. So yeah, like the movie is still incredible obviously and I have so many different things. I could go in two hours alone. The movie's awesome. It does it have many 1978 things that I will make fun of as we go? Yes. Are the credits too long? Yes. Overall, the plot? Yeah. But it's like even like when we're talking about like and it's a comic book and they're trying to do the 38 comic book, but Gene Hackman's Lex Luthther. I'm the greatest criminal mastermind of all. Okay. Why? Like why are you doing this? You're living in a subway station. It's pretty dope. Why wouldn't you just say that? You got Miss Test. Why are you working with Miss Tesmacher and Otis? You're so great. Why are you working with Hless [ __ ] But whatever. I as an",
            "start": 437.44
        },
        {
            "text": "It's pretty dope. Why wouldn't you just say that? You got Miss Test. Why are you working with Miss Tesmacher and Otis? You're so great. Why are you working with Hless [ __ ] But whatever. I as an adult watching this cuz I don't feel like I've done a watchw watch in a long time where I sat down and actually watched it. I was for me as an adult talking about this, I would put out chemistry. Like everybody has chemistry in this picture where like even though it's nonsense that Lex Luthther would hang out with this these these two hacks, I would swim in a pool. The the back and forth between them, you know what I mean? Like it's so quippy and so good and so fun. I love Otis for what? You know, I I just love that. Let alone the people at the Daily Planet, let alone Clark and Lois, let alone Superman Lois. Let like some really good comedic lines. Yeah. Yeah. Yeah. Yeah. Yeah. Uh one of my favorite chats I've ever seen in the history of kind of funny. Furry B production says, \"Not going to",
            "start": 475.36
        },
        {
            "text": "Lois. Let like some really good comedic lines. Yeah. Yeah. Yeah. Yeah. Yeah. Uh one of my favorite chats I've ever seen in the history of kind of funny. Furry B production says, \"Not going to lie, as a person with great reflexes and balance and a high IQ, sometimes I look at humans the same way. Are you implying that you think you're Superman?\" He does. He does. I love that for you, Furry B. Wild. This episode's brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized shades that won't break the bank. Shady Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people. They have hundreds of options to choose from, so you're bound to find the perfect pair to match your style. If you don't love your shades, exchange them for a new pair or simply return worry-free within 30 days. There's no risk when you shop. Their team are always",
            "start": 519.44
        },
        {
            "text": "find the perfect pair to match your style. If you don't love your shades, exchange them for a new pair or simply return worry-free within 30 days. There's no risk when you shop. Their team are always there to have your back with personal and fast support. Y'all know I've been outside a lot playing Pokémon Go, and it's such a great experience wearing Shady Rays when I'm out and about looking dope. Exclusively for you, Shady Rays is giving out their best deal. Head to shady.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. Again, go to shadyrays.com, use code funny to get 35% off polarized sunglasses. Uh Donner later went on to direct films in the 80s such as The Goonies and Scrooed while reinvigorating the buddy cop film genre with the Lethal Weapon series. Yeah. Which he did four of. Was great. I didn't know Donner had it like that. Oh, he I didn't either, but damn. A good resume. Put that on LinkedIn. Really",
            "start": 563.28
        },
        {
            "text": "film genre with the Lethal Weapon series. Yeah. Which he did four of. Was great. I didn't know Donner had it like that. Oh, he I didn't either, but damn. A good resume. Put that on LinkedIn. Really impressive. Well, I think the the um I forget how it was. Maybe Greg, you can catch me up on this, but I think at some point they approached Spielberg to direct Superman. Oh, dude. This thing had a whole bunch of [ __ ] [ __ ] before it ever got to Donner. Donner took it over. They kind of knew each other. And then when Spielberg was producing Goonies, he was supposed to direct Goonies also, but he's like, \"I can't do it for I think it was a scheduling conflict. We brought Donner in to do it and Donner was like, \"Yeah, it was great.\" Yeah, this is one of those rare movies where I feel like the the movie itself and we're going to get to opinions and all that is so interesting and what they did especially for the time period blah blah. But the story of how we got there is also so fascinating",
            "start": 611.6
        },
        {
            "text": "the movie itself and we're going to get to opinions and all that is so interesting and what they did especially for the time period blah blah. But the story of how we got there is also so fascinating of the Sulkins having this thing and not knowing what the [ __ ] they were doing with it and Dick Donner getting a call while he's on the [ __ ] from this guy and the the producer like do you know who I am? He's like no. He's like I got the Superman rights. He's like all right I'll give you a million dollars to do it. He's like, \"Okay, I'm in or whatever.\" And they sent him this telephone book script that made no it was all it was, \"Do you know any of this? Is this in your notes? Sorry.\" They sent him this script, right? And it's again, it's so easy for us now with the success of the MCU with Superman and a million other things and even the failures, right? But they sent a script where in 1970 whatever this comes out in eight, right? But this script that was Donner has said in podcast",
            "start": 643.12
        },
        {
            "text": "Superman and a million other things and even the failures, right? But they sent a script where in 1970 whatever this comes out in eight, right? But this script that was Donner has said in podcast well written, but the Sulkins, the brothers who had the rights to this, right? totally told them to hone in on the comic bookness of it, the comic of it. And so they're making a parody of a parody is what he always described. Like they are making it a Superman movie to be like the Adam West Batman TV show cuz that's all people really knew from like modern superheroes of the time. And so it's like all this bizarre [ __ ] The one that always gets called out, and I know I'm going to lose you on this, but I'll have you. Telly Savales. The Kjak was like he was very famous and he was bald and he had he always had a lollipop and it was the whole thing. He was but he was cool. Anyways, I know what it's there's an actor named Kelly Savales who was on a show named called KJack. He was it was a big",
            "start": 682.08
        },
        {
            "text": "he always had a lollipop and it was the whole thing. He was but he was cool. Anyways, I know what it's there's an actor named Kelly Savales who was on a show named called KJack. He was it was a big deal. Think of Cheers. It was like it wasn't a comedy, but whatever. There's a moment in this script where Superman's trying to find Lex Luthor. And so he's going and he looking at bald people in Metropolis. And so he lands and like grabs a guy by the shoulder and it turns around and it's Telly Savage. I was wondering what that was all about. And he says his touchstone line of back at you baby or whatever the [ __ ] his line was. Look, here's looking at you, baby. Or whatever. Exactly. And so like Matt Murdoch, it's this great story of Richard Donner gets it and looks at it. He's like, I have he grew up as a kid revering Superman and what those comics were and he talks about how he had like Action number one like before his mom threw it away and like he knew what comic books could be and so",
            "start": 724.56
        },
        {
            "text": "grew up as a kid revering Superman and what those comics were and he talks about how he had like Action number one like before his mom threw it away and like he knew what comic books could be and so he called his friend this other guy who makes movies Malawitz. What? Tom Tom Mal. No, you're not going to help me. It's okay. I I'm the one who should have remembered it. and he's like, \"You got to come over. I'm doing I'm gonna do Superman. We got to save this script.\" And it's another insane story. Makeits. Uh, it's another insane story from this of like, so Tom's like, \"All right, I'll come over.\" Richard Donner gets high and then is waiting for his friend to show up. He puts on the Christopher Reeve screen test suit that obviously it wasn't Reeve yet, but it was this. And then when his friend pulls up, he runs out in in the front yard and is running around in the Superman suit. He goes, \"You're a [ __ ] idiot.\" But like he come in, they talked about what it was and they read through",
            "start": 762.96
        },
        {
            "text": "pulls up, he runs out in in the front yard and is running around in the Superman suit. He goes, \"You're a [ __ ] idiot.\" But like he come in, they talked about what it was and they read through the script like we could do something here. And so then it begins this like insane series of events and conversations with these producers to the where we get to they Richard Donner the story goes had never seen the final finished film until the premiere cuz he was editing it and working on it blah but then the brothers flipped out and like bent Warner Brothers over a barrel. He didn't think it was going to make it to the premiere. He's like, \"We're going to have to push this movie.\" But Warner Brothers finally gave these producers the money they wanted. So then like the finalized version showed up and they watched it there. It's a huge hit. It does really well. And like Richard Donner is getting ready to go to or can finish Superman 2 cuz they filmed Superman 1 and 2 at the same time. He's",
            "start": 808.08
        },
        {
            "text": "up and they watched it there. It's a huge hit. It does really well. And like Richard Donner is getting ready to go to or can finish Superman 2 cuz they filmed Superman 1 and 2 at the same time. He's getting ready to go finish the film and his agent calls him and is like, \"Uh, I just got off the phone with the Sulkins and your services are no longer needed.\" Like they just fired him. They thought they had such a big success they wouldn't need him anymore. They were but it had been contentious prior to that 100% he during during Superman the movie they during filming of Superman movie Donner bars them from the set finally it's like you can't they kept having these arguments of you're overbudget and he'd be like you you've never told me what the budget is like I can't be over if I don't know what it is and it was just this crazy [ __ ] of like when he comes when Donner finally comes on the project they've already signed Marlon Brando he's got a $4 million deal Gene Hackman's got a $2",
            "start": 847.04
        },
        {
            "text": "what it is and it was just this crazy [ __ ] of like when he comes when Donner finally comes on the project they've already signed Marlon Brando he's got a $4 million deal Gene Hackman's got a $2 million deal they just and they were like like weeks months away from filming. Like they were so close to going and Don's like, \"No.\" And he pushed back. We got to start from scratch. And the Sulkins were like, \"No, no, it's perfect. Everything.\" He went he he tells the story. He went and saw like what they had rigged up for flying and it was just like the worst green screen line, a surfboard. He's like, \"We're starting over. Like we have to do it.\" But and like they were so desperate to find someone that would work with them or whatever, they ended up doing it with him and he got to make his movie and part of another movie before everything fell apart. And then we should talk about sort of like it was it Richard Lyster? Is that how you say his name? The guy who came in after him. So they br",
            "start": 885.52
        },
        {
            "text": "and part of another movie before everything fell apart. And then we should talk about sort of like it was it Richard Lyster? Is that how you say his name? The guy who came in after him. So they br they bring in a producer to be an intermediary between him and the Selicans. And that guy ends up being like kind of pivotal in this as being like a go-between to make sure that the movie gets done. But then when Superman 2 comes around, they hire him to direct. Even though Donner had already shot like 80% of the film. So that's this huge deal. It's a massive [ __ ] deal because by by union rules, if someone else had shot the majority of the film, they get director credit. So he went back and reshot all of the scenes just so that he could be credited and and Chris Ree was like no like we already did all this like this is ridicul and Donn and Donner was his guy too like they were like and that's the thing where that Donn's name got like erased from it and then when Superman 2 comes out and at",
            "start": 922.4
        },
        {
            "text": "did all this like this is ridicul and Donn and Donner was his guy too like they were like and that's the thing where that Donn's name got like erased from it and then when Superman 2 comes out and at the time people like it we'll see what you like. No future spoilers. Uh they were the people were like, \"Oh man, it's so cool that they kept like the the through line and the touch line and never acknowledging that no, they [ __ ] took my work and either did something like that or just kept the footage as is or whatever.\" Uh then the other thing about just to lay out how shitty the Sulkins were, right? Cuz I'm just going to [ __ ] all over them. Uh Sulin was a This is from the Hollywood Reporters. Uh they have this great like they just let Richard Donner talk and they wrote it up in like 2016. Sulcen was a producer of 1973's The Three Musketeers. He was also reported to have taken unused footage from that film and turned it into a sequel, 1974's The Four Musketeers. Shut up. Mades",
            "start": 962.96
        },
        {
            "text": "2016. Sulcen was a producer of 1973's The Three Musketeers. He was also reported to have taken unused footage from that film and turned it into a sequel, 1974's The Four Musketeers. Shut up. Mades Revenge, uh, The Four Musketeers. Mad's Revenge, prompting the Screen Actors Guild to introduce The Sulking Clause, forbidding any filmmaker to divide a film into two installments without contractual permission. These guys were dirt bags. Who was the director of that film? I don't remember. It was Richard Lyster. And so he hired him because he owed him money because he didn't pay him from that film. and he was like, I'll bring this guy in and just like pay him a little bit as a penance to or penance to like get him off my back from this lawsuit that's impending. And so they were just screwing over everyone. So the fact that this movie is watchable, let alone a classic to so many people not getting in anything. Well, that's the thing, too, is like you watch this film and you go like you can",
            "start": 998.0
        },
        {
            "text": "everyone. So the fact that this movie is watchable, let alone a classic to so many people not getting in anything. Well, that's the thing, too, is like you watch this film and you go like you can see that Richard Donner was like, \"Hey, we're going to we're going to actually like try to do this character justice. We're going to treat this like it's a real film. We're going to have some heart in this. We're going to tell the story of Superman for people who don't know Like when I was a kid, I didn't know really the mytho of Superman because I I hadn't read the comic book. So this was my first introduction to like Krypton, Jorel, all that like Zod and Ursa and all these characters that are there. And so you you watch this back and you're like he loved Superman. He did not want this to be a bad movie. He didn't want it to be campy like that. Like and that was like he the Sulkins made him they wanted a name for Superman. So like he met with Sly Stallone and like he was he says like Sly was",
            "start": 1036.8
        },
        {
            "text": "movie. He didn't want it to be campy like that. Like and that was like he the Sulkins made him they wanted a name for Superman. So like he met with Sly Stallone and like he was he says like Sly was very nice or whatever and I was just some shitty kid but it was like he wasn't what I want. He's like because they the Sulkins also wanted uh like Paul Newman or Robert Redford names were thrown around and he's like James flying it's going to be Robert Redford flying. It's not going to be Superman. That's why he wanted an unknown and eventually found Christopher. Was this after a Rocky movie? Was this already in Oh yeah, Rocky would have already Rocky. Yeah, at this point so was pretty big deal. Yeah, cuz Rocky had come out already. Um, the other two touchstones that are actually absolutely bonkers for this. Uh, here you already touched on Marlon Brando, which we need to talk about. Who is Marlon Brando in the movie? Dorel. Dorelle. [ __ ] The dad. So, before we get to that, I never I saw",
            "start": 1071.04
        },
        {
            "text": "for this. Uh, here you already touched on Marlon Brando, which we need to talk about. Who is Marlon Brando in the movie? Dorel. Dorelle. [ __ ] The dad. So, before we get to that, I never I saw the name of the credits. I was like, \"Oh, I'm excited.\" But I just pictured the godfather. Dude, I went to I was the exact same thing. I had to Google Maron Brando cuz I'm like, \"Wait a minute, that's the Godfather.\" And then Marlon Brando has looked so different throughout his life. I Yeah, sure. in the Godfather. He has a bunch of cotton. Yeah. Well, they aged him up for the Godfather and they did like, you know, they he wanted to be that character. He used to be hot. He was a good looking [ __ ] Yeah. He was very He was the guy for a long time, which desire which led him to like Brando was the the like the top of the top as so far as stars are concerned. He was Yeah. He was is wildly regarded as one of the greatest actors of all time, but he was also incredibly incredibly lazy and hated to",
            "start": 1107.68
        },
        {
            "text": "the like the top of the top as so far as stars are concerned. He was Yeah. He was is wildly regarded as one of the greatest actors of all time, but he was also incredibly incredibly lazy and hated to act and unprofessional. And we can talk about Brando stories in a second. The least of which is my favorite of which rather is the island of Dr. Maro where he and Val Kilmer, another notorious egoomaniac, were just having ego fights the entire time and drove the director crazy. Um, but before we get to that, what is who is the main credited writer on this right now? Oh god, don't even get me started. It's what? It's Mario. It's Mario Puzo. Do you have any idea who Mario Puzo is? You guys are saying so I I can't believe how much this is just your guys' life. Like isn't this wild? I said a chat that I need to bring up is Rusty Pod just said famous bald lollipop cool. Mario Puzo, if you don't know, tell me, wrote the book and then went on to write the screenplay for The Godfather. Godfather",
            "start": 1145.28
        },
        {
            "text": "that I need to bring up is Rusty Pod just said famous bald lollipop cool. Mario Puzo, if you don't know, tell me, wrote the book and then went on to write the screenplay for The Godfather. Godfather 2, Godfather 3. Mario Puzo is very very regard like regarded as just, you know, a good writer that wrote Godfather. God, you know, if you ever want to watch the uh the offer on Paramount Plus, I highly recommend that. That's another great telling of how The Godfather came about, the wacky [ __ ] crazy story that is. But they hire him because they were like, quote, \"We need to get a writer on this that's of note to lend credibility to this because they were so worried that that everyone was just going to see Superman as this stupid campy kids thing.\" And so they put Mario Puzo and Marlon Brando in it. And it's totally the wrong call, especially for Marlon Brando because you want to tell the story of the green suitcase? Yeah, I can. So, well, real quick. So, like the Puzzo thing that's from",
            "start": 1189.84
        },
        {
            "text": "in it. And it's totally the wrong call, especially for Marlon Brando because you want to tell the story of the green suitcase? Yeah, I can. So, well, real quick. So, like the Puzzo thing that's from the story that didn't work, right? It's Donner and Makowitz who come on and do it and then uh screen actors. No, the writers, but he gets credit in this. He's credited as a writer. Oh, yeah. So, that's the whole problem, right? Where it's that the screen writer guild, I'm not that familiar with unions have such weird rules and that's why it's always, you know, if an amperand or the word and that means a very different thing. Donner gets a credit writing on it too or whatever it is. And then they wouldn't put Mowitz in it. So he got snuck in as creative consultant, which now is a band term or was at the time at Warner Brothers from then on out. Doesn't matter. The the green suitcase, right? Uh or the green bagel. And he Well, he No, you're you're on you're on the money. You're on the money.",
            "start": 1233.2
        },
        {
            "text": "at the time at Warner Brothers from then on out. Doesn't matter. The the green suitcase, right? Uh or the green bagel. And he Well, he No, you're you're on you're on the money. You're on the money. Is the green suitcase broken. Yeah. Yeah, I know. It's It's very scary. I've leaned back in a few times. So when Dick Donner gets this, right, and he's like, \"Okay, cool.\" And like Marlon Brando's part of it, like he's already in it, right? So you have to go meet with Brando, right? And it's him, maybe Mowitz and one of the sulcans go to meet with Brando. But on the the come up to it, he's like, \"How do I talk to Marlon Brando like this the worldass actor everybody loves yada yada yada?\" And so he starts calling around for advice and it's Copala, right? Who like he called somebody and then Francis Ford Copala, but he's like one of the people who knew Brando well and he's talking to is like he's going to want to play everything as a green suitcase. Like he's so overacting. He loves money, so",
            "start": 1278.64
        },
        {
            "text": "Ford Copala, but he's like one of the people who knew Brando well and he's talking to is like he's going to want to play everything as a green suitcase. Like he's so overacting. He loves money, so he'll do anything and he's great at it. But it's like he's going to have these weird ideas about like what if I did it as a green suitcase? Like what if blah blah blah and and you have to talk him out of it. But they were like if you let him talk, he'll talk himself out of any problem. Well, it was it was two things. One, it was at this point in his career, he had been acting for so long and he had just he just wanted the money. He didn't want to work and he was he knew that he was like if I can convince this young director who I'm Marlon Brando this would be the equivalent to Tom Cruz talking to you right now if you were this is like your second film right so he was like if I can convince them that nobody knows what Kryptonians look like and maybe they look like a green bagel or green",
            "start": 1317.6
        },
        {
            "text": "to you right now if you were this is like your second film right so he was like if I can convince them that nobody knows what Kryptonians look like and maybe they look like a green bagel or green suitcase. Yeah. No. So you're conflating I think unless you know the story better. No no you probably do. The phone call was he's going to try to do it his green suitcase cuz he's a [ __ ] weirdo. So Dick Donner is ready for that. He's prepared for that. He's having these conversations. And Marlon Brando goes, \"Well, what if I played it as a bagel? It's light years away. People don't know what any why. What's to say they didn't look like bagels or whatever?\" Just this nonsense [ __ ] statement, right? And I I this is how copious I was with my note takingaking. I grabbed this from the Hollywood Reporter. This is Dick Donner's own words. He he turns to him and he goes, \"It's 1939. There isn't a kid in the world that doesn't know what Joro looks like. And he looks like Marlon Brando.\" and he",
            "start": 1358.0
        },
        {
            "text": "Reporter. This is Dick Donner's own words. He he turns to him and he goes, \"It's 1939. There isn't a kid in the world that doesn't know what Joro looks like. And he looks like Marlon Brando.\" and he looked at me and smiled and said, \"I talk too much, don't I?\" He said, \"Okay, show me the wardrobe.\" So, like, he diffused the situation, but it's because he just was lazy. He wanted to do VO. He was like, \"If it's a bagel, I don't have to be on set. I can do a day of VO.\" And they he had it written to his contractor. He was like, \"I'm getting paid $4 million. You get me for 12 days.\" But then he was notorious for like ah stalling and not wanting to come out of his trailer so he could get overages and [ __ ] He just liked money a lot. the same thing that I wrote down right when Donner's talking about Brando and Kevin I'm going to want to watch the Reeve clip in one second but Donner says not difficult when they're talking about is he difficult to work with not difficult though we had to",
            "start": 1395.68
        },
        {
            "text": "about Brando and Kevin I'm going to want to watch the Reeve clip in one second but Donner says not difficult when they're talking about is he difficult to work with not difficult though we had to put his dialogue on the other actor's chests he would say quote I don't want to read it like I've read it before a bunch of times the first time I read it'll be honest he made it work he was the ultimate he was Marlon Brando he was Maron [ __ ] Brando he didn't want to memorize the line at one point I've heard so many stories about this island I'm like [ __ ] this guy he's not that good that he should have been getting away with this. He at one point, I don't know if you have it in here, but when he's doing the iconic speech where he's like talking to his son, the baby in the ship, it cuts and he's looking down at the baby and apparently they had to write the the Q cards on the baby's diaper cuz he didn't want to [ __ ] remember the lines. And he's great in the film, don't get me wrong. Like,",
            "start": 1428.56
        },
        {
            "text": "looking down at the baby and apparently they had to write the the Q cards on the baby's diaper cuz he didn't want to [ __ ] remember the lines. And he's great in the film, don't get me wrong. Like, of course, he's still like, if you watch this and didn't know anything about this, you like Jerel's pretty good. Like, and I So, I've dig out of it at all. I have no I mean, yes, The Godfather, yes, this movie, but no like love for Marlon Miranda. I didn't watch it. Somebody's like, \"What a [ __ ] dick this guy is.\" And like, everybody's always like, \"But he's so good.\" I'm like, \"Is he?\" Can we show the Christopher Ree clip? This is Christopher Ree on the David Letterman show. Other people on the show have worked with Marlon Brando and I know with him for a few days and uh anything interesting come of that relationship? Um I I must say I don't I don't say this to be vicious, but I don't worship at the altar of Marlon Brando because I feel that he's he's capped out in a certain way. He's no",
            "start": 1464.48
        },
        {
            "text": "come of that relationship? Um I I must say I don't I don't say this to be vicious, but I don't worship at the altar of Marlon Brando because I feel that he's he's capped out in a certain way. He's no longer in the leadership position that he could be, he could really be inspiring a whole generation of actors. And by continuing to work, but what happened is the press loved him whether he was good, bad, or indifferent where people thought he was this sort of institution no matter what he did. So, he doesn't care anymore. And I just think it would be sad to be 53, whatever he is, and not give a damn. That's all. I just think it's too bad that the man has kind of been forced into that hostility. Um, that's But you wouldn't. Well, he's here tonight, Chris. God bless. God bless how good how good he used to be. Yeah, he was great. He's still great. Wait, the the uh Apocalypse Now story of like they hired him for an absurd amount of money and they thought he was going to look one way. He",
            "start": 1501.36
        },
        {
            "text": "good he used to be. Yeah, he was great. He's still great. Wait, the the uh Apocalypse Now story of like they hired him for an absurd amount of money and they thought he was going to look one way. He showed up [ __ ] 50 lb overweight. 50 lb overweight. And they're like, I guess we'll just change the story. Apocalypse Now, he plays Curts, I think, is the name of the character. who is the the whole point of the the main character go is it's he's got to go find this rogue [ __ ] iconic captain that's gone missing has been living with the [ __ ] Vietnamese and whatever and he's supposed to be living out in the middle of the [ __ ] like jungle just suffering so he's going he's supposed to be emaciated and Marlon Brando shows up and he's like 100 pounds overweight and the and Copela's like what the [ __ ] am I supposed to do with this what the hell like yeah he's crazy also like news to me that it's Christopher Reev yeah I did want to point that out before we got going. I me too. This is",
            "start": 1544.32
        },
        {
            "text": "the [ __ ] am I supposed to do with this what the hell like yeah he's crazy also like news to me that it's Christopher Reev yeah I did want to point that out before we got going. I me too. This is understandably confusing because of course the adventures of Superman, George Reeves, and then he was, you know, the black and white Superman you'd all expect, right? Then the next big Superman is Christopher Reeve. So there it's common nomenclature. Many people fatted the Batman. No one's worried about that right now. That is super information. I don't even think that I don't even think this George Reeves thing got completely just dropping George Reeves here as if we know who the [ __ ] is. You know who George Reeves is? Black and white Superman. Kevin throw up a thing. The Ben Affleck played him in a movie. Thank you. Hollywood Land. A great motion picture. We should put it in review right now. They did a lot of cocaine. Uh you know what was funny? Read reading some of the seen this man",
            "start": 1585.68
        },
        {
            "text": "him in a movie. Thank you. Hollywood Land. A great motion picture. We should put it in review right now. They did a lot of cocaine. Uh you know what was funny? Read reading some of the seen this man before. No. You guys are psych. What did you do as children? What the [ __ ] did you do? This is 40 years before I was born. Oddly enough though, you know, reading reading through some of the trivia and stuff, I didn't realize how many times they had done Superman. Like there had been like other oneoff. Yeah. I didn't realize there was there were more Superman. I thought it was just these two. Yeah. Leading up to I've never seen this. Did you not watch I Love Lucy? What did you do in your afternoons at your grandma's house? And I I love He showed up as himself in Superman. Little What?",
            "start": 1627.12
        }
    ]
}