{
    "id": 14203,
    "video_id": "PcNIXwPGNSA",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Joey Noelle",
        "Barrett Courtney",
        "Blessing Adeoye Jr."
    ],
    "title": "More Switch 2 Shenanigans Until Summer Game Fest!",
    "description": "Go to http://kindafunny.com/XREAL to grab yours now!\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1749242471,
    "duration": 7036,
    "transcript_chunks": [
        {
            "text": "[Music] [Music] Ah [ __ ] we're still there. We go. What's up everybody? Welcome to your pre-show to the pre-show of SGF. I'm one of your hosts, Greg Miller, alongside Forbes 30 under 30, aka a leftover Poppy aka Mario Kart expert. Blessing at Oay Junior, the new king is what they call me, Greg. The new the new king. The drift king. The DK. The DK. Yeah. Over here, of course, he's sad boy himself. I'm washed. Other Mario. No. No. That's what everybody's saying is what they call. I don't know what the [ __ ] I'm doing. They call him Andrew cuz he's for washed king. The the washed king, you know. I'm hiding behind calling this this more of a party game, you know. Uh I'm doing all right. I'm I'm You know, it's one of those I don't have the SGF like tinglies, you know, like I I think it's You know what we are right now, everybody? We're playing a game called Ace Combat. Uh we are a heat-seeking missile. M we're coming up on the rear of a nice F14 over there. We're about to blow. They fire",
            "start": 0.0
        },
        {
            "text": "know what we are right now, everybody? We're playing a game called Ace Combat. Uh we are a heat-seeking missile. M we're coming up on the rear of a nice F14 over there. We're about to blow. They fire off that shaft grenade. Okay. You know what I mean? They fire off that heat signature, that flare. We're lost. There's too much. There's too much to be excited about. So, you don't feel like you're excited about anything. Yeah. It's just all It's all just It's I mean, it's like Yeah. SGF is today. Can you I was driving home last night exhausted. I was like, \"Holy [ __ ] wait a second. SGF's tomorrow.\" Yep. Yep. I feel like for me it's the it's the hunger or it's the lack of hunger for we're feasting. Yeah. Like I we're always in a place where there's too many video games. And so the idea of another event that's going to announce a million more video games for me to look forward to, like I'm always welcome to it. You know, if you show up to my house and you have [ __ ] Domino's pizza and",
            "start": 75.84
        },
        {
            "text": "another event that's going to announce a million more video games for me to look forward to, like I'm always welcome to it. You know, if you show up to my house and you have [ __ ] Domino's pizza and Pizza Head and all this [ __ ] even though I have Square Pie guys already, I'm like, I'll take more. Of course. I'm not going to say no to more of that pizza. It's like back to what we're ordering for lunch. But yes, uh it's like that over stimulation almost. And I feel like the state of play might have been like the thing that took it over the edge of like [ __ ] Christ. Okay. Yeah. Yeah. Uh, in the chat, CJ asked, \"Greg, when is your flight?\" question mark exclamation mark. Uh, I'm I am on the traditional kind of funny SGF flight schedule. So, I will live react. Uh, I will do the post show and then I will immediately run to SFO to fly to LA to see all the games from our play days. Uh, I can't see the chat too clearly. I believe it's C Twigs. It's a weird angle. Cig says, \"Bless is still",
            "start": 113.6
        },
        {
            "text": "then I will immediately run to SFO to fly to LA to see all the games from our play days. Uh, I can't see the chat too clearly. I believe it's C Twigs. It's a weird angle. Cig says, \"Bless is still on pizza.\" I I want you to know that I have no regrets for anyway wrong this company anymore going into going into the future. Okay. I almost I almost uh You ever see that video on highlights today? I almost got um donuts um during KFGD cuz I went out I I picked up my Pro Controller for my Switch to at Best Buy and on the way back I was like, \"Why are you using that? Why aren't you using it? It's in my car. Nobody. It's so far away. Trash.\" And you talk [ __ ] about the O Switch One controller. You're not even bringing yours out. On the way back, I was like, \"Oh, it is it's donut day, I think. Let me pick up some donuts.\" Even though I just I did that a couple days ago. Yeah. Um, and then I remembered the Sonic video. I was like, \"Fuck them. Nobody's getting [ __ ] donuts from that. [ __ ]",
            "start": 149.68
        },
        {
            "text": "Let me pick up some donuts.\" Even though I just I did that a couple days ago. Yeah. Um, and then I remembered the Sonic video. I was like, \"Fuck them. Nobody's getting [ __ ] donuts from that. [ __ ] all y'all.\" Uh, do we want to start Grand Prix knockout tour? What are you boys feeling? Known for whatever. Let's do a knockout tour. Yeah. Who doesn't love a good knockout tour? Of course, everybody, warm up your Switch 2 at home. We will eventually open it up and play with the audience. Remember, of course, we are kind of funny games. You can follow us on youtube.com/kindfunny games. Twitch.tv/kindfunnyames. If you have Amazon Prime, you have Twitch Prime, we would love you to give away that free 30-day subscription they give you, but don't remind you about to us. I'm still searching for my cart. I feel like that's my biggest problem right now. I that last one where I had a horrible showing yesterday before I went or before we went into Games Cast, I tried a new cart and it was just",
            "start": 190.4
        },
        {
            "text": "my cart. I feel like that's my biggest problem right now. I that last one where I had a horrible showing yesterday before I went or before we went into Games Cast, I tried a new cart and it was just trash. Reminder to go to uh press X for settings, controller, turn off uh smart steering. smart. Um I I've was playing around with carts last night. I think the one that I'm uh liking the most is this hot rod. Yeah. But again, it's one of those like we're still unlocking everything. So it's like a question. Is there another microphone on that side somewhere? Yes. Okay. I'm going to switch over there cuz better view. Yeah, it's a way better view of my screen. Okay. So on player three, yeah, put the thing on. I'm going to try your hot rod. See what's up with that. There's also the the uh I unlocked the the Rob Hog. Yeah. Yeah. Fair enough. Insane name. What do you mean? You know what I mean? Bless. You're [ __ ] with Bowser. Yeah. So, like I've been talking about this uh in the last day of",
            "start": 226.16
        },
        {
            "text": "the the Rob Hog. Yeah. Yeah. Fair enough. Insane name. What do you mean? You know what I mean? Bless. You're [ __ ] with Bowser. Yeah. So, like I've been talking about this uh in the last day of trying to figure out who my main is for this game cuz typically for Mario games, Mario sports games, Mario spin-off games, I made Mario cuz uh this goes back to me as a kid playing Mario Tennis for the first time. And like in Mario Tennis, they tell you kind of what the strengths are of the character. Mario was the all-around character. And as a kid, I was like, \"Oh, I want a character that has no weaknesses.\" Yeah. And so, I always picked Mario. Um, but before I played Mario Tennis, I had Mario Kart and Bowser was my first main in Mario Kart cuz he was heavy. So like when you would do like a boost at start, you hit all the other characters spin out and all that stuff. And I play as Toad and I get really [ __ ] up from that. So yeah, exactly. And when I was doing the Grand Priest last night, I",
            "start": 274.24
        },
        {
            "text": "at start, you hit all the other characters spin out and all that stuff. And I play as Toad and I get really [ __ ] up from that. So yeah, exactly. And when I was doing the Grand Priest last night, I was like, you know what, for old time sake, let me use Bowser. And the more I use him, more I was like, oh wait, this actually I'm having a lot of good success here. So people are saying, shout out to Scarlet Libra with a super chat. Hey guys, awesome news. getting my first car this weekend. Sometime within the next month, I will too get a Switch to. Enjoy SGF. We will. We hope you enjoy SGF. Remember, we are uh what uh an hour and a half away from Jeff's. No, two hours and a half. I missed my start cuz I was trying to [ __ ] figure out a time. Whoa. Frames here. I know. If only a few here tell us chat. Let me know if Bless is still quiet whenever he talks. I I boosted him up a little bit, but at least in in terms of levels, it looks like it didn't change too much. I can readjust like",
            "start": 322.8
        },
        {
            "text": "tell us chat. Let me know if Bless is still quiet whenever he talks. I I boosted him up a little bit, but at least in in terms of levels, it looks like it didn't change too much. I can readjust like after this. So, how much have we played uh one-on-one, boys? So, like did you go home? Did you play a lot last night on cart? What' you do? I played about 2 hours. I just went through all the Grand Prix and got the golds. Yeah. Uh same last night. uh didn't really have the energy to do too much else after doing all the Grand Prix, unlocking the final Grand Prix. That was such a moment. I'm glad that I saved that uh kind of for myself uh on my own cuz the food bag for you. Yep. Yep. Yep. Thank you. Just driving I didn't mean to stop it. Um I don't [ __ ] believe it or not. Yeah. Someone told me that Shy Guy has two costumes and I've yet to find his his second costume. Um. Oh, who am I? Who am I turning into? Oh, this [ __ ] weirdo. Oh. Oh, Clapquack. What do you mean, weirdo? What do you",
            "start": 366.88
        },
        {
            "text": "me that Shy Guy has two costumes and I've yet to find his his second costume. Um. Oh, who am I? Who am I turning into? Oh, this [ __ ] weirdo. Oh. Oh, Clapquack. What do you mean, weirdo? What do you mean? What do you mean you know this man's name? You don't know about Clapquack. That's That's insane. I said it on the screen. He didn't really know it. He's cheating. No, I know. I know it because we talked about it on like a games daily or something and I was making fun of how they're just putting anybody in the game. Clapquack, I believe, is from Mario Sunshine. Oh, that's why I don't know. Yeah, he's one of them non-chanic freak. non- mechanic. Yeah, I did a played a little bit uh earlier today. I had like a a room open uh for people to jump into just messing around doing some more Grand Prix and kind of getting familiar a bit more with like the flow between like wall riding and like grinding and doing alternate routes and stuff like that. Can I Dude, can I tell you I got two things?",
            "start": 416.64
        },
        {
            "text": "Prix and kind of getting familiar a bit more with like the flow between like wall riding and like grinding and doing alternate routes and stuff like that. Can I Dude, can I tell you I got two things? Firstly, I might have to go back on a critique that we had yesterday on the Games Cast about this game where one of our one of the things we talked about were kind of the lack of distinction between u a lot of the a lot a lot of the tracks like it doesn't feel like there's as many standout like oh this is like one of a kind kind of track. As I went through each of the Grand Prix I found more and more tracks where I was like oh no this is memorable. Oh no this is like you know there's this got the sauce. This track has the sauce. Right. So, I think maybe the more I the more we play this game, the more we're going to start to hit that like memorable status. So, that's first and foremost. Secondly, I didn't fully understand how the tracks work when you're going from like track to track",
            "start": 465.68
        },
        {
            "text": "the more we're going to start to hit that like memorable status. So, that's first and foremost. Secondly, I didn't fully understand how the tracks work when you're going from like track to track during the Grand Priest until I went to versus race. Yeah. And just like started clicking on the tracks individually and seeing that like if you click on a track, you have like six different routes you can take to all the tracks that are surrounding you. Like it's kind of crazy when you see how they actually lay it out. It's really cool. I I was starting to notice that earlier when we were doing I was doing Grand Prix with just uh I assume a bunch of best friends who jump uh jumped into my room and I was noticing like when we're selecting each track for the Grand Prix, we're always selecting the next match is always uh going uh going to a place that the last course just went to. So that really like made me think about like oh damn of like the the amount of alternate routes and stuff that",
            "start": 507.68
        },
        {
            "text": "the next match is always uh going uh going to a place that the last course just went to. So that really like made me think about like oh damn of like the the amount of alternate routes and stuff that you're going to be able to have throughout this game. Um and again like I do wonder what Tim was saying yesterday of like how much are we going to like remember any of this stuff after playing for a couple months, but it was one of those like See I but I think that that's the thing that might have like watered down the conversation a bit is when you're going from track to track I think those in between moments aren't memorable. Yeah. But like I think they give you the tracks themselves. Like the tracks themselves are actually really You get to me. You get it. I forget. How do you look behind you? Um X the top button. It's triangle. You know what I mean? Nintendo triangle. Oh got to be different cuz they think they're in charge of everything. Ah [ __ ] Yeah. Bananas. Bananas. There you go,",
            "start": 554.24
        },
        {
            "text": "Um X the top button. It's triangle. You know what I mean? Nintendo triangle. Oh got to be different cuz they think they're in charge of everything. Ah [ __ ] Yeah. Bananas. Bananas. There you go, Greg. We were friends. I've seen a lot of vindication on our subreddit. Of course, Patrick Klepic's amazing reporting as a parent. The fact that you can't do local, you can't do local open world, which remember as soon as they showed it, I was like, I'm going to have to buy two of these [ __ ] switches cuz I know Ben's going to want to do that with me. Now, I know there's a workaround of going, you know, do a private room, go in online. I can do that. [ __ ] work the way it is. I was trying to I've never been able to pull off the thing where I slow down to second place and have the Bowser shell move on to the next person. I keep trying to do that and it [ __ ] me every single time. What are you talking about? The rewind? No, not even the rewind. Talking about dodging a blue shell. Yeah,",
            "start": 598.8
        },
        {
            "text": "move on to the next person. I keep trying to do that and it [ __ ] me every single time. What are you talking about? The rewind? No, not even the rewind. Talking about dodging a blue shell. Yeah, dodging blue shell. Like I saw a video doing that of like Oh, yeah. They the way I dodge a blue shell is by slowing down and then it just passed me through the first person. Oh. Oh yeah. Yeah. Yeah. That's like that's an OG strat. But no. Did you see the video Jeff Grub put out? No. Where he had he was in first, had a blue shell on him, did the rewind feature. The rewind feature got him out from under the blue shell and the blue shell just doing nothing. I know. Holy [ __ ] Yeah. Did you see Jan's video of him tricking Dan? [ __ ] [ __ ] with all of them. That was so good. And the [ __ ] moment Dan Reker notices it. That's so good. It's one of those like I feel bad for gaslighting Fran for like an hour about if this was 30 or 60 cuz it is very clearly 30. But you know what? It was worth it.",
            "start": 651.76
        },
        {
            "text": "Dan Reker notices it. That's so good. It's one of those like I feel bad for gaslighting Fran for like an hour about if this was 30 or 60 cuz it is very clearly 30. But you know what? It was worth it. But now is this 30? I'm not even trying to be a big This is 30. Okay. I I still think this looks better than it has in the past. Maybe it's just cuz you're playing on big and I think it also just might be as well like um like a locked 30. So just like there's there's no like frame dipping. Jesus Christ. Whoever has that boomerang needs to chill the [ __ ] out. Hey man, we're the boomerang bros out here. All right. Don't worry about what we're doing. Worry about yourself. Greg BB's. Yeah, I got knocked out. Oh no. Bar, what happened? Oh, this game's so [ __ ] good. It feels so good to play. Here's some hammers for you, [ __ ] Is single player is single player 30? No. Uh the game supports up to 60 frames per second with uh two players. Uh from what I can tell, which makes sense because you",
            "start": 695.04
        },
        {
            "text": "some hammers for you, [ __ ] Is single player is single player 30? No. Uh the game supports up to 60 frames per second with uh two players. Uh from what I can tell, which makes sense because you can do two players on Ah, no. So they probably had to make sure that that got working for 60 frames per second. Oh, let's [ __ ] go. Cuz that's the [ __ ] you car. Get out of here, Toad. Learn to drive. I'm locked in. [Music] Justice for Diddy Kong. Absolutely not. Yeah, justice for Diddy Kong, dude. No. Also, I've gotten you two Bowser outfits. Thank you. I don't think I even have Sonic Revolution looks sick as hell. SGF week is [ __ ] crazy. It's so I've listen I've watched it so many times. Jesus [ __ ] Christ. God [Applause] damn. What are some quick predictions for SGF? Lucy James kills it. Yep. Yep. I don't know. That mind goes to Persona 4. I don't think that's today, though. If Persona 4 shows up, I think that'll be Xbox. Um I think I saw another rumor about that showing up um today or",
            "start": 755.76
        },
        {
            "text": "Yep. I don't know. That mind goes to Persona 4. I don't think that's today, though. If Persona 4 shows up, I think that'll be Xbox. Um I think I saw another rumor about that showing up um today or just specifically at Xbox. Yeah, that makes sense cuz that that's where they revealed three reload. Damn it. At the last second, too. Oh, blessing. What happened? What happens that I got second place? You know, third though. Come on now. It's tough being top three. It's tough being top three. You would understand rare up here. I do like this hot rod. This is a good car. Yeah. Yeah. I actually feel like the the speed for it, I think, is a is a solid speed. What am I most excited to see today? I like I really have no idea or expectations of what to expect today. That's the best part about it right now where I think we have so much other [ __ ] going on that even though I've done the predictions episode, I've forgotten what I predicted. Yeah. Yeah. There's just too much stuff going on. Yeah. I",
            "start": 829.52
        },
        {
            "text": "now where I think we have so much other [ __ ] going on that even though I've done the predictions episode, I've forgotten what I predicted. Yeah. Yeah. There's just too much stuff going on. Yeah. I feel like this has been the I guess compared to previous seasons, it's probably the same, but it's been the last the least I've cared about like the online Reddit rumors and threads of, oh, these are the things at least. These are like the things that, you know, we know that that's going to happen. Uh, LO Seahawks 12. Any wild hopes and dreams? As always, a Superman game, an infamous remaster. You know what I mean? I'm not I'm not, you know, infamous. Portal returns somehow. Do we think that cool [ __ ] Do we think that God of War game shows up today since it wasn't at the state of play? Yeah. You know, any wild hopes and dreams. Nah. All my dreams are dead. Oh my god. Just can't think of any honestly. If this is a dud, like, thank god. We'll slow down. Let's [ __ ] slow down on [ __ ]",
            "start": 889.76
        },
        {
            "text": "You know, any wild hopes and dreams. Nah. All my dreams are dead. Oh my god. Just can't think of any honestly. If this is a dud, like, thank god. We'll slow down. Let's [ __ ] slow down on [ __ ] game being announced and [ __ ] [Music] Take a breather. Hoffman place. Which show do you have the most excitement for? I would say I'm more excited for Xbox than I am SGF. And I think it's just because I I know I'm going to want to know about The Outer Worlds 2. I know I'm going to like The Outer Worlds, too. I want to know about State of Decay. They're teasing that. I want to know about what this Xbox handheld rag thing is. like there's enough seeds I expect to see grow or sprout there that I'm excited for. Whereas SGF is kind of like I know we're going to get a middle section that is a bunch of gotacha mobile game and that's that's fine. I'm not against it. It's like uh I do hopefully want to see maybe not today. At some point this week um Unbeatable they've been I feel like they've been",
            "start": 927.12
        },
        {
            "text": "of gotacha mobile game and that's that's fine. I'm not against it. It's like uh I do hopefully want to see maybe not today. At some point this week um Unbeatable they've been I feel like they've been teasing a lot. That's like the indie like music rhythm game. Um where it's what's their tagline? It's like uh a world where music is illegal and you do crimes. That's a good line. Uh but yeah, they've been like working on stuff uh working on that game for a while. I remember playing a demo back like four years ago and they've just been like they've been a bit more active, I would say, on uh social media lately. So, I'm I'm hoping for something with them. So, we'll see. Oh, yeah. No matter what, we're going to have a good time for sure. You miss Mike? No. Oh, yeah. I was thinking about that leaving yesterday. How much I miss Mike. Yeah. Not having Mike today, I think. Really? Yeah. Can he sort his [ __ ] out to be good to go for the Xbox One? That's the other one. It's like, come on, let's",
            "start": 979.28
        },
        {
            "text": "yesterday. How much I miss Mike. Yeah. Not having Mike today, I think. Really? Yeah. Can he sort his [ __ ] out to be good to go for the Xbox One? That's the other one. It's like, come on, let's go. Let's go. Maybe stop streaming night. Do you think we'll pick an antibiotic? No, absolutely not. Mike's the kind of guy where it's like, yeah, he won't. And if he did, it would be like a dog one. I got to cheat. I know Slappy talk slappy. Greg, how much do you know or are there things that you know are going to be here that like that you haven't talked about yet or like course? Yeah, things behind the scenes. Oh, yeah. So, you ready to talk about Halfife 3? you know, me and Gabe had a long conversation on his boat. I don't I would say unless I I guess I don't I don't know megatones. That's where it really falls in. You know what I mean? That's where I think you get into like I'm not holding back on knowing something about what Naughty Dog or some [ __ ] like [Music] that. Oh, that wasn't",
            "start": 1031.36
        },
        {
            "text": "it really falls in. You know what I mean? That's where I think you get into like I'm not holding back on knowing something about what Naughty Dog or some [ __ ] like [Music] that. Oh, that wasn't even any of y'all. Oh, that was just a [ __ ] NPC doing [ __ ] two red shells walking in the middle of the air. I want to try jumping up there. How do I jump up there? I want to be like you guys. Oh [ __ ] What the [ __ ] Did I miss my chance? Everybody on the rail. I was like, what did you all do? Get on there. Oh, come on. There we go. I'm on a rail. [ __ ] yeah. Good job. I'm on a rail, [ __ ] Oh, shy guy. This is so precious. So, one of the things that'll I think it's something we talked about about Smash uh uh Bless the other day, uh that I think I I I don't want to, but I worry about falling into the trap of is that I wonder if my Mario Kart skills while out of the box mid, but good enough, you know, blast number two and three there, no big deal. uh if they're going to languish behind",
            "start": 1098.72
        },
        {
            "text": "into the trap of is that I wonder if my Mario Kart skills while out of the box mid, but good enough, you know, blast number two and three there, no big deal. uh if they're going to languish behind the world because like I see I I I kind of feel at least right now at launch that this is striking me so much as a Smash where it's like I love playing it with everybody but going home and doing the single player stuff like I'm not as stoked about that. Now I think it's also because last night I was like I really want to play uh Zelda finally so I jumped into Link's Awakening and had a great time. What a [ __ ] I saw post uh like just it running at like a solid frame rate I was like Jesus Christ. The thing you know when I finally got around to trying it cuz I wanted that Zelda experience and it was just like oh this is so garbagey on Switch one. The fact that it actually is crushing and and then you're into how good the game is period. Let alone how great the soundtrack is. You know what I",
            "start": 1163.04
        },
        {
            "text": "was just like oh this is so garbagey on Switch one. The fact that it actually is crushing and and then you're into how good the game is period. Let alone how great the soundtrack is. You know what I mean? Like I was just vibing last night. So it's like plane ride today I'm vibing with Zelda. You know what I mean? Where it's like that's great but again like I feel like I know I need Oh [ __ ] you Bowser. [ __ ] you. That was a good one of you. Uh, you know, I don't want to I don't know. I don't want to I don't want to go force Mario Kart cuz I feel like I need to force Mario, but I also don't want to be trash at Mario Kart when I come back. Yeah. Yeah. I started up a new Breath of the Wild save earlier as well. I'm like, ooh, maybe it's time to go back. This is And I like I want this to be a safe spot. Can it be a safe spot? Yeah, this is a safe space. Un we also still reserve the right to make fun of you. That's fine. Fine. Just wait for me to leave it here. All right. Uh Link's",
            "start": 1207.84
        },
        {
            "text": "to be a safe spot. Can it be a safe spot? Yeah, this is a safe space. Un we also still reserve the right to make fun of you. That's fine. Fine. Just wait for me to leave it here. All right. Uh Link's Awakening again had always been on my list. Finally got around to it. Yada yada. You know, wait for this thing. Playing it last night and going through and doing I I was it really struck me of like what kind of Zelda fan I am cuz I would have told you obviously and I know you you guys have listened to me a long time, right? But like Ocarina Yeah. Majora's Max like formative Greg games of like I remember being so adamant I wouldn't like Zelda and Michael Bryant handing me the gold card and be like you're an idiot you have to play this hand me a strategy guy too right and like I stayed up till what was it 2:30 in the morning the night of the acts playing Zelda like so but I think ever since then I've chased that high and while I've had bits and pieces work for me really well I think of like",
            "start": 1251.6
        },
        {
            "text": "was it 2:30 in the morning the night of the acts playing Zelda like so but I think ever since then I've chased that high and while I've had bits and pieces work for me really well I think of like a link link between worlds where I is you know how much I loved Breath of the Wild here and talked about it and you know beat it and yada yada yada and even tears while I didn't finish it I did 40 hours of it and obviously all the conversations I had on the show like how great it is and how amazing it is. It's a masterpiece but like it didn't deliver and I don't want to be that guy but it didn't deliver what I want out of a Zelda because I'm still chasing Ocarina. Yeah. And so to be like playing last night and be like, \"All right, cool. I'm Link with a sword and it's not breaking.\" And I'm going around knocking this thing and I'm getting a rupee and I'm meeting weird folks in town like that. I think I I like more. And she's singing. I'm like, I don't know. It's a weird It's a weird",
            "start": 1290.96
        },
        {
            "text": "I'm going around knocking this thing and I'm getting a rupee and I'm meeting weird folks in town like that. I think I I like more. And she's singing. I'm like, I don't know. It's a weird It's a weird justosition of I can sit there and tell you obviously how great objectively Yeah. Tears and breath are, but it's just like I like I I I was thinking about last night like if they slash when announced a major remake when [ __ ] you guys, you know what I mean? Like I'm going to cry. Like that's my Zelda. That's what I I'm I want to get back to. No, that's totally fair. And that's that's not like [ __ ] everybody. Come on. Go. Go. Not like this. Thank Jesus. [ __ ] from three to [ __ ] 13 when it counts. Yeah. I was talking about about this on stream uh the other week. Uh for me, I'm like I hit the realization I'm just not a 2D Zelda person. What? M um you know like link link to the past you know I never came back around on like playing and fall falling in love with I tried Link's Awakening",
            "start": 1331.76
        },
        {
            "text": "the realization I'm just not a 2D Zelda person. What? M um you know like link link to the past you know I never came back around on like playing and fall falling in love with I tried Link's Awakening and I played a couple dungeons and liked it fine but not enough to see it through. Echoes of wisdom started immediately was like no this isn't my kind of thing and then I started like really thinking about it and in even like the indie games that take inspiration from 2D Zelda like I don't think I've really fallen in love with any you know like I'm not a hyperlight drifter person. Death's Door. I liked that game, but I remember being like the one person that was kind of complaining about not really liking how the combat felt and stuff. Oh my god. Um like I think there's a category of Zelda that I've fallen in love with more than others. And for me it is like the Breath of the Wild and Tears thing, but then also Yeah. Like the Ocarina style, Twilight Princess, like I consider that a",
            "start": 1378.08
        },
        {
            "text": "that I've fallen in love with more than others. And for me it is like the Breath of the Wild and Tears thing, but then also Yeah. Like the Ocarina style, Twilight Princess, like I consider that a different thing than what Breath of the Wild and Tears of the Kingdom show. Yeah. I'm surprised like I'm surprised they've not turned that into a third tier as far as like making a new one of those. I I imagine they get back. I'd be surprised if they did another um Tears of the Kingdom like for the Switch 2. Maybe it's not quite the traditional stuff that we know, but I feel like with a new generation, they might want to do something like completely out of left field. Got to [ __ ] up. Oh, blessing. What happened? [ __ ] up. Yeah, that's it for me. Oh, come on. In ninth. [ __ ] Yeah, but I and I also think there's a great beauty to that. Oh, I love that there's Zel that like, you know, you wouldn't and I'm paraphrasing what you said there, but but you wouldn't be a Zelda person right now if",
            "start": 1418.08
        },
        {
            "text": "also think there's a great beauty to that. Oh, I love that there's Zel that like, you know, you wouldn't and I'm paraphrasing what you said there, but but you wouldn't be a Zelda person right now if it wasn't for Tears and Breath, right? Like in terms of if they didn't Yeah. I mean, for me, like it was um Well, I guess for me it was Ocarina, right? But like even Twilight Princess, but Tears of Breath of Wild definitely elevated that to a new level for me. And it's it's interesting that you don't vibe with A Link to the Past cuz like all of the like besides uh obviously Breath of the Wild Tears of the Kingdom, all of the Zelda games that you [ __ ] with are just Link to the Past but 3D. Yeah. I think it's I I honestly think it's just the era that I grew up in cuz like my first console was an N64 and then we also owned an NES and so like that's why I'm so in love with um Mario 3 and like like even the first original Legend of Zelda I have more of an affinity for. than um Link to the",
            "start": 1468.88
        },
        {
            "text": "an N64 and then we also owned an NES and so like that's why I'm so in love with um Mario 3 and like like even the first original Legend of Zelda I have more of an affinity for. than um Link to the Past. Interesting. Um yeah, like I was it's that weird thing where it's both Super Nintendo and Gamecube to me were the generations of Nintendo that I didn't have. And so like when I look at games that are very much of that of those eras, I don't have the same kind of like, you know, thing for sure. And I think nostalgia is such a powerful part of it, right? Yeah. I came to Link to the Past as one of my first Game Boy uh clam shell SP games where I was like I was in college, I spent the food money I should have not spent on Game Boy, I spent on a Game Boy and I got that and I remember sitting there and playing it and enjoying it and I like that game a lot, but like in the chat, yeah, Taylor Strong, Link to the Past is the goat of goats. I played it and I enjoyed it, but I couldn't tell you a",
            "start": 1506.96
        },
        {
            "text": "and playing it and enjoying it and I like that game a lot, but like in the chat, yeah, Taylor Strong, Link to the Past is the goat of goats. I played it and I enjoyed it, but I couldn't tell you a damn thing about it. Like it's it's just it didn't resonate with me because Ocarina and Majora resonated so much I think where it's like it's almost that conversation I have all the time about like your first Bethesda first Fallout is is never can it be surpassed cuz you find that oh my god look I can do anything. You go back or you go forward like oh that's what all these games are. It just seemed very neat to me. I did a thing um a few weeks ago where I made my uh backlog um like a serious like all right these aren't just games that I haven't played. these are games that I really really want to play. And like I got to the Zelda conversation and I was thinking through it and I was like, \"All right, like I I've not played all the way through Link to the Past, but I also don't want to play",
            "start": 1551.04
        },
        {
            "text": "to play. And like I got to the Zelda conversation and I was thinking through it and I was like, \"All right, like I I've not played all the way through Link to the Past, but I also don't want to play through Link to the Past.\" But then I got to Majora's, which I started Major's Mask, never played all the way through it. And immediately I was like, \"Oh, [ __ ] yeah. I would love to return to Majora's Mask. Like, I really want to actually play through that game. That'd be a much easier place.\" Majora's Mask is so [ __ ] good. And then also Wind Waker was one I never got around cuz I never had a GameCube. Oh, [ __ ] this game. Let's boot up Winder, dude. Now, hold on a second, [ __ ] Don't say [ __ ] you don't want to do. We've seen a lot of Mario Kart. Let's see some other [ __ ] We got a lot of time. Legitimately, I would start if you want to get my Switch. I will start Wind Waker right now. Yeah, just for a little Yeah. Go ahead. We're playing Wind Waker. Everybody kind But that was",
            "start": 1591.04
        },
        {
            "text": "lot of time. Legitimately, I would start if you want to get my Switch. I will start Wind Waker right now. Yeah, just for a little Yeah. Go ahead. We're playing Wind Waker. Everybody kind But that was the thing like last night I was like I don't know like you my you know Sega bent obviously made me so weird for Nintendo where it's just like I have very specific things. But playing uh Zelda last night, it was like that thing of like, man, I really hope I keep this love of the Switch 2 with me throughout its life cycle cuz even Switch one obviously dropped so novel, you know what I mean? It was such a big deal to play, but then it was, as I said yesterday at length, right, of like, oh well, I'm not on this review, so I'll everything goes to the back burner. And I really think we're in a different place now with the team we have and the size we have and the not that everybody's looking to me to do everything kind of thing. I really hope that it can be that cool. I'm I'm reviewing whatever",
            "start": 1623.92
        },
        {
            "text": "place now with the team we have and the size we have and the not that everybody's looking to me to do everything kind of thing. I really hope that it can be that cool. I'm I'm reviewing whatever I'm reviewing, but then I'm also taking time to play something I'm enjoying on the Switch because right now I really do want to How long How long's Links Awakening? God, it's been a minute. 135. Yeah, that sounds right. I'd love to crack that out before I get back on Monday to tackle Death Stranding. And that's a that's a tall [ __ ] order because that's I'm going to SGF to play games and I'm already exhausted, but I got two flights maybe. I'm I'm excited for this. Me, too. I don't I've never even booted up Wind Waker. What? Yeah. Never even booted it up. I'm just going to get here. We're playing Wind Waker, everybody. Yeah, this Yeah, the Patty cake says, \"Greg, I'll be interested to hear your thoughts in six months on how you split your time between Switch 2 and The Rock Alley.\" I'm right",
            "start": 1668.64
        },
        {
            "text": "Wind Waker, everybody. Yeah, this Yeah, the Patty cake says, \"Greg, I'll be interested to hear your thoughts in six months on how you split your time between Switch 2 and The Rock Alley.\" I'm right there with you. I think still The Rock being my PC, like I already have like, as you all know, independent games and smaller games are insane. So, it's like three more codes for PC only games have come in that I've loaded up on it. So, it's like there's always something going on out there. But yeah, I will be as well too because I think I don't know if if you know my Switch is just my little fun kickback machine. That's a different thing. Yeah. Why do they have double versions of everything? European American. Okay. Yeah. Um and yeah, for me I'm wondering the same thing with me and my Steam Deck where my Steam Deck has become my one of my default platforms. Like if I'm traveling, I'm taking my Steam Deck way before I'm taking my Switch. And we'll see if that switches with Switch too. But",
            "start": 1713.44
        },
        {
            "text": "where my Steam Deck has become my one of my default platforms. Like if I'm traveling, I'm taking my Steam Deck way before I'm taking my Switch. And we'll see if that switches with Switch too. But like even as I look at my home screen, you know, I see Hitman, I see Cyber Punk, I see Sonic and Shadows, and I'm like I want to be excited for these, but I'm also like, well, I could have played Hitman on my Steam Deck anyway. And that's the thing where you're in a we're in a spot with this launch where it's like old game is old to us cuz we have the buffet of everything everywhere, right? So, it really does become cool as these games start coming out day and date, knock on wood, then it's a question of like, yeah, are we buy like the next indie that hits me up and is like, \"Is it Switch or this?\" Oh, yeah. And that's what I was saying with like Tony Hawk and [ __ ] where it's just like, oh, this is it's not the crazy new thing, but it's bringing me back to uh a thing we've had for a long",
            "start": 1756.4
        },
        {
            "text": "Oh, yeah. And that's what I was saying with like Tony Hawk and [ __ ] where it's just like, oh, this is it's not the crazy new thing, but it's bringing me back to uh a thing we've had for a long time. Vioani says, \"I love Wind Waker more than I love my dad.\" Wind Waker is still uh my number two on my uh Zelda rank list. Wow. Yay. Like it's funny. Fears of the Kingdom was so good, I knocked Breath of the Wild down to number four. Nice. It's funny starting this cuz uh last night after I played a bunch of Links Awakening, I just went into N64 and booted Ocarina just for that galloping with a bonus. God, come on. [Music] Do you ever you always stick with Link? You ever name it yourself? No. I mean, in this game, no. No. Any other game I'm going blessing, but damn, those are good for opening line. Long ago. I was going to say, Andy, get in here and do VO. Golden power hidden. [Music] They always crush it with music. It was a proper It it was a prosperous band blessed with with green",
            "start": 1790.72
        },
        {
            "text": "line. Long ago. I was going to say, Andy, get in here and do VO. Golden power hidden. [Music] They always crush it with music. It was a proper It it was a prosperous band blessed with with green forest. It was also preposterous. But one day, a man of great evil found the golden power and took it for himself. I wonder who that's going to be. Bowser. with its strength at his command, he spread darkness across the [Music] kingdom. But then, when all hope had died, and the hour of doom seemed at hand, a young boy clothed in green appeared as if from nowhere. [Music] Wielding the blade of evil's bane, he sealed the dark one, the dark one away and gave the land light. Come on. Chills. This boy who traveled through time to save the land was known as the hero. See, that's I didn't think they would reference opera. Yeah, hold on. The boy's tale was passed down through generations until it became legend. Well, not his legend. [Music] But then a day came when a fell wind began to blow across the",
            "start": 1840.88
        },
        {
            "text": "reference opera. Yeah, hold on. The boy's tale was passed down through generations until it became legend. Well, not his legend. [Music] But then a day came when a fell wind began to blow across the kingdom. The great evil that all thought had been forever sealed away by the hero dot dot dot once again crept forth from the depths of the earth. Eager to resume its dark designs, the people believed that the hero of time would again come to save [Music] them. But the hero did not appear. You want to know why? Bless cuz he cuz Major was it because he was like a different in a different time because at the end of Hold on faced by an onslaught of evil. The people could do nothing but appeal to the gods cuz he went at the end of Ocarina he goes back in time to his original time one which is the Majora's timeline. So the timeline he leaves is this one. And so there's no longer a hero in their last hour as doom drew nigh. Something happened and it was [ __ ] cool. What became of that kingdom?",
            "start": 1915.28
        },
        {
            "text": "Majora's timeline. So the timeline he leaves is this one. And so there's no longer a hero in their last hour as doom drew nigh. Something happened and it was [ __ ] cool. What became of that kingdom? None remain. Who know? That's [ __ ] crazy because I've seen I've seen the Zelda timeline and I always thought that was always just fan [ __ ] Some [ __ ] The memory of the kingdom vanished, but its legend survived on the wind's breath. Yeah. A lot of people just uh say like, \"Oh, Skyward's the only one that created it.\" But they were already doing a lot of other [ __ ] for the time. On a certain island, it became customary to guard boys in green when they came of age. Back to you, Barrett. See Link there? He looks cool as [ __ ] Clothed in green. Ah, cloth in the green of fields. They aspired to find heroic blades and cast down evil. The elders wished only for the youths, the youths to know courage like the hero of legend. That's [ __ ] cool. This game's so coated. So good. That's [ __ ]",
            "start": 1984.8
        },
        {
            "text": "to find heroic blades and cast down evil. The elders wished only for the youths, the youths to know courage like the hero of legend. That's [ __ ] cool. This game's so coated. So good. That's [ __ ] cool. This is what I love about this experience is that this is how I played it in college, but I had it in my Gamecube in my room and like I remember having a like it felt like I was having a theater cuz everybody crowded in to watch me play this. [ __ ] yeah. There was one where we were spinning [ __ ] statues and everybody had a different idea on how to get through this. We're going to finish this puzzle. Var, is it the only Zelda game aside from like the direct sequels like Major and Tears of Kingdom that directly references like that another Zelda game? So, it's like that strongly, I guess. Um, I know there I mean Majora's Mask obviously being the direct sequel for that Link uh from Ocarina of Time. This does a lot of heavy stuff. I think I think Twilight might have had some Oh, but",
            "start": 2034.96
        },
        {
            "text": "Um, I know there I mean Majora's Mask obviously being the direct sequel for that Link uh from Ocarina of Time. This does a lot of heavy stuff. I think I think Twilight might have had some Oh, but Twilight has the like the Yeah, the uh zombie link. Yeah, but that's also the Hero of Time as well. Yeah. Um, uh, a cool little Yeah, I don't think from what I remember, nothing as strong as that opening, but there's like fun little things. Um, like the towns in the original Legend of Zelda. Mhm. Are all the same names as the sages in Ocarina of Time. Oh, yeah. Yeah. So, like just little stuff like that. My favorite spot to gaze out at the sea. When I play with goals, I call it Arrow's Lookout. Barry, you be the girl. So, do you remember what day it is? Oh my god, little sister's annoying. You're still half asleep, aren't you? Did you forget? Big brother, it's your birthday. That's why grandma has been waiting for you to come back to the house. Oh, grandma. She's been grandma. She's been",
            "start": 2089.2
        },
        {
            "text": "still half asleep, aren't you? Did you forget? Big brother, it's your birthday. That's why grandma has been waiting for you to come back to the house. Oh, grandma. She's been grandma. She's been waiting for a while now. Also, did you see Toad's voice actress got like got recast? Oh, really? Yeah. Like the story number one for KG was like the same actress as Peach is the same one for Toad. So, she's been recasting. Interesting. So, I wonder he's still going to sound like that. It's a good thing I came to find [Music] you. You should probably go home and see what grandma wants. Don't you think like they the director comes on go like click bar taking some liberties you read it give me give me a take for me and then I go shut the [ __ ] up and let take you take for me do do we need to get one of Tim's uh [ __ ] GameCube controllers Tim come on it's [ __ ] the day after Switch launched get it together says it's at his house oh [ __ ] let me tell you The [ __ ] camera is inverted. Yeah,",
            "start": 2143.92
        },
        {
            "text": "one of Tim's uh [ __ ] GameCube controllers Tim come on it's [ __ ] the day after Switch launched get it together says it's at his house oh [ __ ] let me tell you The [ __ ] camera is inverted. Yeah, that's your C stick, remember? Yeah. Oh, it is a C stick. I really hope they let me change that in settings. Uh, Billy says, \"Hey Chad, if I want to play this game, do I need to get the controller for it to work well or let me uh is it just for nostalgia?\" For me personally, I would say get the controller because I it would break my brain trying to see what they're saying up there and then trying to do it down here. It's worth it. I mean, come on. It's worth it. And don't we all just want excuses to spend our money on junk? Lord knows I do. Tuga says you can remap the controls and invert the camera back. Yeah, cuz I think I just need the right. Oh, yeah. Yeah. Yeah. It's just right and left. Oh, that's crazy. Okay. So, oh, you just replace two of them. Wait, no, now it's the same. So,",
            "start": 2201.28
        },
        {
            "text": "camera back. Yeah, cuz I think I just need the right. Oh, yeah. Yeah. Yeah. It's just right and left. Oh, that's crazy. Okay. So, oh, you just replace two of them. Wait, no, now it's the same. So, yeah, you just change left to left. So, now change right to right to right. Yeah. Hold on. I'm going to save this. Yeah. And then we're going to change again, right? Yeah. Yeah. Okay. Okay. Oh, that's a weird way they do it, but I see what they're doing. It's confusing. Okay, that should There you go. Oh, thank god. Yeah, there we go. God, this looks really good. It does. So in terms of like [ __ ] a remaster Nintendo keep it. The HD version is still better in a lot of ways. [Music] What if I what if I just beat this version? Oh I I think that's totally fine. There's just there's like definitely old video gamey stuff with like uh the kind of third act of this game where you're exploring like the entire world for for something that I don't I won't repeat. You just It's so crazy playing so",
            "start": 2261.28
        },
        {
            "text": "old video gamey stuff with like uh the kind of third act of this game where you're exploring like the entire world for for something that I don't I won't repeat. You just It's so crazy playing so much of um Breath and Tears and wanting to sprint that like Yeah, you just uh you just got that one speed and then you just auto uh rolling rolling roll. What? Rolling, rolling, rolling. Uh Joey in the chat says, \"Hey, has Greg tried Fantasy Life on the Switch 2? Sounds like a perfect game for this console?\" I have uh streamed like two seconds of it uh yesterday on stream. Uh it runs just like The Rag. uh maybe loads a little bit uh slower and the graphics are a little bit worse, but yeah, fantasy life's still crushing over there. It's all the sink over here. Yeah, you are. Ah, you need a key, I think. Maybe. Maybe not. Hi, Joey. Hi, Joey. Yeah. What do you want to do for lunch, Joey? What do you want? You want pizza? We doing some pizza again? I'm not. Yeah. Get some toss. Oh, you wings.",
            "start": 2333.16
        },
        {
            "text": "I think. Maybe. Maybe not. Hi, Joey. Hi, Joey. Yeah. What do you want to do for lunch, Joey? What do you want? You want pizza? We doing some pizza again? I'm not. Yeah. Get some toss. Oh, you wings. Does toss do that earlier? Oh, yeah. But nobody seems stoked about that. Okay. Pizza's easy. I think to Yeah, please. [Music] But I want Roger to feed them to me. You doing the thing where you put the whole wing in your mouth and like flat it out. I do that. Yeah, I do that for Andrew's playing fantasy life. Whoa. Which Andrew is that? You know, I have no idea who any of these people. Dude, I went last night I added Rahul uh to my friends and then I went through and I was like, there's a guy just Billy. I'm like, I'm sorry, Billy. Bye. I don't know who the [ __ ] you are. I don't know. There's like weird name guy. I'm like, \"All right, Jack Lung says, \"Greg, aren't you supposed to be at SGF?\" No, I'm reacting post showing and then immediately running to the airport. Very excited uh for",
            "start": 2380.72
        },
        {
            "text": "like weird name guy. I'm like, \"All right, Jack Lung says, \"Greg, aren't you supposed to be at SGF?\" No, I'm reacting post showing and then immediately running to the airport. Very excited uh for something happening on this trip. Okay, it is the nerdy thing. Stick with me. As you all know, I swear by sfbags.com. They have been my VA case, my Switch case, Steam Deck case, my ROG case. I'm going to get the Switch 2 case from eventually when it's restocked. I got from them for testing slashre purposes. The tech the tank techfolio which is their backpack that looks like nice or whatever. But this one's even bigger and can expand. It's like basically the idea is that it can hold a gaming laptop, your regular laptop, an iPad, Switch, whatever the [ __ ] So, but they're also they put in their thing like you could also like theoretically pack clothes in and so this is such a short trip. I'm just doing a backpack. It's my Switch, my Pro Controllers, some chargers, and then my clothes and my",
            "start": 2430.16
        },
        {
            "text": "thing like you could also like theoretically pack clothes in and so this is such a short trip. I'm just doing a backpack. It's my Switch, my Pro Controllers, some chargers, and then my clothes and my toiletries. and it like it still looks like my normal ass backpack. So, in a few weeks you will hear me because I've been doing this for packs that Montreal trip. I've used it for very different things all gaming related where it's like, well, I'm bringing my [ __ ] uh Xbox Series S and the screen. I'm bringing my Steam Deck and my Switch. I'm doing this. So, it's like you're going to have to hear me talk about a backpack soon. Hell yeah. [Music] things are too alert about their surroundings for free to just jog up and cap. Oh, so I need to sneak. You got to be sneaky. Man, look at Nintendo and their design. They knew I'd be chasing that one pig. Yep. They're like, \"Wait till he learns.\" Where is it? Under absolutely no circumstances. Will I play enough GameCube games to justify buying",
            "start": 2470.8
        },
        {
            "text": "and their design. They knew I'd be chasing that one pig. Yep. They're like, \"Wait till he learns.\" Where is it? Under absolutely no circumstances. Will I play enough GameCube games to justify buying the controller? But I'm thinking you're thinking about it now. I'm thinking about it. Oh [ __ ] That blessed. It was an accident. The poor little pig. Tim's here. I'm talking to you, Mike. Get in here. I'm very excited. You're playing Wind Waker. This is exciting. I love hearing it over there, Barrett. Great VO. Um, I'm about to record a Gregway about my first 24 hours with Switch 2. If you have any questions you want me to answer, go to my Twitter right now, Tim Getty's, and reply to it. I'm going to record it in like 10 minutes. So, do it right now. Everybody, right now. I love you all. Everybody go ask how big his neck is. Barry, are you going to eat pizza? Yeah. Yeah. Yeah. [Music] Now, the more I play this, the more I'm now flashing back to how I played Ocarina, cuz like rotating the",
            "start": 2515.52
        },
        {
            "text": "go ask how big his neck is. Barry, are you going to eat pizza? Yeah. Yeah. Yeah. [Music] Now, the more I play this, the more I'm now flashing back to how I played Ocarina, cuz like rotating the camera does not feel right. This is obviously old game's old, but like I'm realizing now that what I did when I was playing it before would be on turn and then just the camera. Yeah. Yeah, that's like the way to play. Yeah, I forgot about that. Talk to that snotty kid. I was going to say, look how crazy that snot is. Um, you grab a bow. I was calling for you, Link. That's a really good bear. That was a really good one. So is my mom. Yo, hire this man. Get him in games everybody. Put this man in your video game. Please, for the love of God, someone cast me. I'm having uh fun just auditioning for stuff. Can you talk about anything you're you've auditioned? Uh, I don't want to talk about anything like I've auditioned for. Uh, but it's been a lot of like cartoony like stuff that I I just I enjoy",
            "start": 2557.44
        },
        {
            "text": "Can you talk about anything you're you've auditioned? Uh, I don't want to talk about anything like I've auditioned for. Uh, but it's been a lot of like cartoony like stuff that I I just I enjoy kind of getting into the the state of thinking about like kids cartoons type type of stuff and like animeish cartoon or like straight up like more so like Cartoon Network Nickelodeon type of stuff. Um, it's just been fun. I've just trying to like think about back to like what Link try these on. Time certainly flies. I can't believe you're already old enough to wear these clothes. Come on. He's not stoked about it. [Music] Don't look so disappointed, dear one. Just try them on. Today is a day to celebrate. It is the day that you become the same age as the young hero spoken of in all the legends. Little joker at the end of each one. Every segment ends a little bit of joker. You only have to wear them for one day, so don't look so down. Oh, interesting. Be proud, child. In the olden days, this was",
            "start": 2610.56
        },
        {
            "text": "joker at the end of each one. Every segment ends a little bit of joker. You only have to wear them for one day, so don't look so down. Oh, interesting. Be proud, child. In the olden days, this was the day boys were were finally considered to be men. They were taught the ways of the sword to prepare them for battle with their enemies. [Music] But we don't live in such an age any longer. Our ways are the ways of peace. We get another coffee and me. I'm good. Nowadays, I suppose Orca is the only one on the island who still knows anything about sword play. Orca. Hanging the family shield on the wall as decoration is another tradition that has been carried down from those days. I'm losing it. Hanging there. I just I love that it's uh like it's considered dorky, you know, like he's embarrassed to be wearing this. Yeah. Isn't that nice, Link? They suit you perfectly. A perfect fit. Well, tonight I'm going to invite the whole town over for your birthday party. So, I'd better start getting",
            "start": 2672.56
        },
        {
            "text": "to be wearing this. Yeah. Isn't that nice, Link? They suit you perfectly. A perfect fit. Well, tonight I'm going to invite the whole town over for your birthday party. So, I'd better start getting ready, shouldn't I? It's like the equivalent of like if your parents came to you and put gave you like a Renaissance fair outfit and went put this on for the day and I'm like, \"Ah, shit.\" All right. Be like, \"God damn it, Mom.\" Your grandma is going to make your favorite soup for you tonight. Now I'm doing Yoda. I just know you're looking forward to it. Now go get your sister Arrol. That piece of [ __ ] That [ __ ] She's so annoying. [Music] Lots of Toad says chat. I mean, it's an homage. You know, we're going to get a new toad to toad voice sometime soon. It is messed up going back to the N64 Mario Kart though. Bless and hearing Toad not sound like a crackhead. Yeah. No. Hearing Toad sound like a When did that change? Um was it GameCube generation maybe? Or was that I feel like there was",
            "start": 2733.76
        },
        {
            "text": "Mario Kart though. Bless and hearing Toad not sound like a crackhead. Yeah. No. Hearing Toad sound like a When did that change? Um was it GameCube generation maybe? Or was that I feel like there was like either one game on the N64 or like whatever Toad's first appearance on Gamecube where his voice just went went through it. He just started smoking. Chat also said Marge Simpson. That's actually very accurate. Um, so you'll want to go, I think, to the dude who does the sword stuff. Yeah. Uh, cuz then you can start like cutting down. Name Orca. Um, go to the right. Oh my Link. Congratulations. Look at the blush. That outfit. That outfit looks cute on you. Oh wow. [Music] Damn. Oh, actually, yeah. I do the arrow stuff first cuz I think that'll be like the Oh [ __ ] [Music] This is t tutorial stuff. Um, look at this guy. Yeah, dude. He reminds me of the scientist from um That is a noggin. Oh, what? Um, Nightmare Before Christmas. That's correct. You're a smart one. Look at this guy on the",
            "start": 2792.16
        },
        {
            "text": "stuff. Um, look at this guy. Yeah, dude. He reminds me of the scientist from um That is a noggin. Oh, what? Um, Nightmare Before Christmas. That's correct. You're a smart one. Look at this guy on the fly. You, my friend, have just l targeted me. You see, of course, my [ __ ] blessing doesn't let me speak. I know what an L targeting is. Also [ __ ] up that it's not Z targeting anymore. Updated. Big L. Big L on the Z targeting. Uh, someone in chat was asking, \"Bless thoughts on the new Lil Wayne album.\" I started listening to it. I only got about three or four songs in and then I was like, you know what? I'm going to listen to to the new Little Sims album instead. And let me tell you, the Little Sims album, [ __ ] fantastic. Little Wayne album could not hold me. Cannot hold my attention. Uh, Greg, I was telling uh Andy this as well. I think you would appreciate this. Uh, band I listen to called Hot Mulligan. Yeah. Just uh put out a new single. It's a new album coming out in a couple",
            "start": 2851.2
        },
        {
            "text": "Uh, Greg, I was telling uh Andy this as well. I think you would appreciate this. Uh, band I listen to called Hot Mulligan. Yeah. Just uh put out a new single. It's a new album coming out in a couple months. But more pertinent, their music video for this new single is very just like super late 90s, early 2000s. Like uh it it feels like a combination of like some 41, Blink12, and like Green Day like music videos from back in the day. I think you would get a kick out of it. Yeah, Andy was getting me to listen to and I did and I was boopping around the house. Turn style. Oh, I like that. Damn. Hell yeah. Uh they got a new album out today. No, it's not a new at all, but they have new brand new. Okay. Okay. Nice. Um, and then I real quick, sorry. Yeah, I I need your opinion on something, Barrett. Where are we at with New Found Glory? Cuz I obviously that was like a college band for me that I liked a lot and I listen to those two college albums all the time, but the other day Discover Weekly",
            "start": 2911.52
        },
        {
            "text": "Where are we at with New Found Glory? Cuz I obviously that was like a college band for me that I liked a lot and I listen to those two college albums all the time, but the other day Discover Weekly gave me 100% from them, their new single and I was like, \"Fuck, this slaps.\" That's just me talking. You know what I mean? Take it with a grain of salt. Uh, I was never the biggest newfound person uh growing up. So, I that's like a part of the pop punk uh scene that I'm a bit more hazy on for sure. Um but yeah, I see the they put out a new single like a month ago. It's really good. Um yeah, I'll check it out. Uh I know like they're the the the big hit back in the day, but they were never And that's my thing where I was like this sounds more like that New Found Glory than some of the albums we got afterwards. Gotcha. Uh Merk says, \"Greg, I've been waiting for you to check out Microwave.\" Microwave. Microwave. Um, I can see the track list already for this new Hot Mulligan album. And uh I",
            "start": 2958.8
        },
        {
            "text": "we got afterwards. Gotcha. Uh Merk says, \"Greg, I've been waiting for you to check out Microwave.\" Microwave. Microwave. Um, I can see the track list already for this new Hot Mulligan album. And uh I forget how um they they write very poignant music uh in terms of like lyrics, but they're also very unserious people. So I can see one of the songs on here. That kind of funny. Um is called Monica Luinski. Okay. That's fun. That's fun. That's a That's a combination of words that have not been said before. Yep. Nope. All right. I'm going to I'm at I'm following microwave. I'm going to listen I'm putting uh to my like songs but not often so I remember to listen to that. You might want to go back to her spot. Uh her lookout. Oh, up here. Yeah. Moving to bed bug island. The lead track on this album. Hell yeah. Yeah. I can't wait for it. It's one of those tough thing I feel like a lot of pop punk bands do this where they announce their album like three months ahead and I'm like and I see I can",
            "start": 2996.72
        },
        {
            "text": "Hell yeah. Yeah. I can't wait for it. It's one of those tough thing I feel like a lot of pop punk bands do this where they announce their album like three months ahead and I'm like and I see I can see the entire track list. I'm like what are we doing? Yeah. I hate that's how the new thing is. Uh the chat there, King Ryan James, did you guys try the CRT filter? Heard of this but I haven't tried. I mean I'm down to try. Go to the suspend menu really quick. Let's see what's up with that. Um see where do we do the CRT filters before you come in? [Music] Yeah. Imagine this before we come in. I mean, yeah. Yeah. You saved it, right? And then go over to settings there. Oh, yeah. There you go. Yeah. There you go. Nice. Power only the Nintendo Switch 2 can offer. That's so nice. Smart. Yeah. Smart call in the middle. Oh, I I like that. I like that. That's good. But wow, you look I guess they're pretty neat though. So anyway, League, can you close your eyes and hold out your hand just for a",
            "start": 3057.2
        },
        {
            "text": "call in the middle. Oh, I I like that. I like that. That's good. But wow, you look I guess they're pretty neat though. So anyway, League, can you close your eyes and hold out your hand just for a second? We ran into Will Smith over at the Nintendo. Not that one. Not that one. Yeah. Yeah. Yeah. And he showed us photos of the setup. He found his childhood TV and brought it home and like put it hooked up to all his video games and stuff. [ __ ] yeah. That's awesome. Man, this be so easy to do if Tim had [ __ ] you. Yeah, I'm like, [ __ ] All right, everybody buy me a GameCube controller. I'll go hoard them at home or no one. What are any of these buttons on this controller? I'm going to assume Y is Y. Yeah, sure. What the [ __ ] is Z? Well, go to suspend menu. You can look at the controls. [Music] Let's see. Yeah, Y is Y Z. And then Z is uh your bumper. Yeah, which makes sense of of thinking about the layout of the GameCube [Music] controller in our house from here. Okay, first of all, I",
            "start": 3107.76
        },
        {
            "text": "Let's see. Yeah, Y is Y Z. And then Z is uh your bumper. Yeah, which makes sense of of thinking about the layout of the GameCube [Music] controller in our house from here. Okay, first of all, I need to set this to something. Yeah. So, hit one of the Yeah, there you go. And go up there. God, the I might I might start up a playthrough of this. A wild replay. This is where games were games. Who's that? Who's that? It's one of them bird guys from Breath of the Wild. They're from this game. One of one of the RTO from Breath of the Wild. They're from this game. One of the one something crazy. One of the bird men from Tears. What? Something I Oh, I forget if I have this right. Oh [ __ ] What's that blessing? Oh. Oh [ __ ] Kidnapping. They're throwing rocks in it. [ __ ] yeah. I know you have a thing against pirates, but this game kicks so much ass. God, I'm willing to put a put aside my pirate beef for a second. Now, one game that we saw um at the State of Play had me rethinking about pirate",
            "start": 3161.44
        },
        {
            "text": "against pirates, but this game kicks so much ass. God, I'm willing to put a put aside my pirate beef for a second. Now, one game that we saw um at the State of Play had me rethinking about pirate hating until afterwards where we realized it was Ned's game. That was Sea of Remnants or whatever. Yeah. I was like, \"Shit, these pirates might be cool.\" And then they're like, \"Ah, it's a gotcha game.\" Oh no. Dies. Rip. Nano in the chat. Wow. I can't believe they retroactively made a Breath of the Wild game on Gamecube. Got to find something to defend yourself with. Wait, guys. Am I going to pick up a stick? No, it's not. It's not Breath of the Wild last Breath of the Wild sequel. Pretty cool. [Music] He's killing me. Oh, yeah. They're just following around. They think you're so cool, though. My green. Oh, Greg's online. What are you playing, Greggy? Oh, you already know. Links Awakening. I was I got the itch. I can walk around kill some stuff while this happens. Nice. Oh, so I should find",
            "start": 3236.16
        },
        {
            "text": "green. Oh, Greg's online. What are you playing, Greggy? Oh, you already know. Links Awakening. I was I got the itch. I can walk around kill some stuff while this happens. Nice. Oh, so I should find an orca. Yes. Um in that ship down there. Oo, check out that ship. [Music] The little animations. Him. So cute. Him. Yeah. Swimming around. There's no Oh, beetle. [Music] Yeah. [ __ ] Anything you don't need? I don't want to try to redo Beetle cuz like I I know like his voice from Breath of the Wild I have so stuck in my head and I know that's not a a voice I can do. Bye. Yeah, there you go. Bye. That would take some work. Thoughts on the new Hammy album? Hammy. Hammy. Go pull Hammy. [Music] I was listening to Willow as I do. Um, and Spotify just started like doing random shuffle of like recommended songs. Um, so I was just like listening to music without even like looking at the app or whatever and letting it go. And I was like, \"Man, a lot of these songs are great.\" I realized, turns out",
            "start": 3308.08
        },
        {
            "text": "songs. Um, so I was just like listening to music without even like looking at the app or whatever and letting it go. And I was like, \"Man, a lot of these songs are great.\" I realized, turns out I love Paramore. Oh, did I realize I [ __ ] with Paramore pretty heavy? to um they follow up saying Heart Attack Man. Shout out to Heart Attack Man, Cleveland's very own. Uh yeah, I I like the new album. Um they're they're a crazy group of group of dudes. They're fun. Um there's another question as well. Barrett says, \"Oh, um Sirius Black says, \"We need new Just Friends music.\" Just Friends was that band that I was trying to get y'all to listen to cuz it's like one of the most like Bay Area bands ever. They're like a mix of like pop punk, funk, hiphop, uh, and like a bunch of other stuff. And they're just they're like one of the funnest groups. Um, that feels like a culmination of a bunch of different cultures from the Bay Area. There you go. And their name is Just Friends. Yeah. Ah, this is",
            "start": 3385.92
        },
        {
            "text": "just they're like one of the funnest groups. Um, that feels like a culmination of a bunch of different cultures from the Bay Area. There you go. And their name is Just Friends. Yeah. Ah, this is Orca. There you go. Oh, what is the matter, Link? You have an urgent look about you. Has something happened? Guy looks evil. Whatever it is, from the look on your face, I suspect it is no laughing matter. What say you, Link? On guard. Ah, have you come for some serious instruction? The way of the sword? Yes, sir. I love they gave him a little [Music] belly. Very good. Your first lesson lesson shall be the horizontal slice. Face me and press B. Do not fear for my safety. I am ready for you. He's got a little beer belly. Yeah, been drinking. Wrong. Press only B. He doesn't want me to lock on. Oh, did he [ __ ] stutter? Good. Keep coming at me until you hear me say very good. Oo, got some combos in this game. Hold on. God. Yeah. Hold on. Very good. Next is the vertical slice. Hold L to target me,",
            "start": 3433.36
        },
        {
            "text": "he [ __ ] stutter? Good. Keep coming at me until you hear me say very good. Oo, got some combos in this game. Hold on. God. Yeah. Hold on. Very good. Next is the vertical slice. Hold L to target me, then press B. Yeah, keep swinging. Oh, this is cool. Yeah, it is. Blast. Very good. Next is the thrust. My favorite. L target, then tilt forward and press B. Come at me. Thrust with your sword. Just your sword. Very good. Keep thrusting. Be chill, Orca. They knew what they were doing. Next is the spin attack. Hold Briefly to build up your strength, then release it or rotate uh your your your stick around once. Whoa. Shout out to unique technique. Crazy how this is better sword combat than Breath of the Wild. Whoa, whoa, whoa. I really that in those games. I wouldn't argue against that. Hold Briefly. Oh, brief. Oh, I see. Yeah, he wants you to keep doing uh the spin attack. Hold Briefly and release it. Do a spin attack. There you go. But even on my worst night. Oh, we got a parry. Yeah, we",
            "start": 3499.76
        },
        {
            "text": "Oh, brief. Oh, I see. Yeah, he wants you to keep doing uh the spin attack. Hold Briefly and release it. Do a spin attack. There you go. But even on my worst night. Oh, we got a parry. Yeah, we do, buddy. Come on. I'll talk until you see him. Oh [ __ ] Oh, he does a little [ __ ] Oh, god. Little piret. This game is so [ __ ] good. Very good. Now, finally, the jump attack. Draw your sword. L target and do that. [Music] And yet I sense a certain anxiousness in the sword you hold. An eagerness that goes far beyond the mere desire to be wielded on the fields of battle. I do not know what has happened. But I have faith in you. Somehow I doubt you will misuse that sword. Immediately walks outside, stabs somebody. You may have it, Link. Starts killing all the pigs. I give it freely. Take the blade with you. [Music] And this is that classic [ __ ] man. So good. [Music] Doing this one. So [ __ ] Sorry. Uh, since the olden days, you [ __ ] blacking off. What are you looking at chat? I see what",
            "start": 3574.16
        },
        {
            "text": "with you. [Music] And this is that classic [ __ ] man. So good. [Music] Doing this one. So [ __ ] Sorry. Uh, since the olden days, you [ __ ] blacking off. What are you looking at chat? I see what chat was talking about. [ __ ] man. Its blade is infused with the desire to become strong and righteous. Be strong, link, man. And Sunund Dead in chat says Final Fantasy Magic the Gathering has been acquired. I still don't have any yet. O, but I'm going claim to be in the mail. I'm going to an event tomorrow hopefully. I'm I'm on a wait list cuz I called late. But waving chat is crazy. I'm so, you know, I just wanted calls it like live. You know, he's doing his job. He's doing three things at once. Voice acting. He's greeting Chad and he's running the stream. [Music] All right, let's go save whoever the [ __ ] Hey, now you can start cutting [ __ ] Oh, yeah. I can cut those red. Yeah, you can. Oh, yeah. There you go. [Music] Don't cut your own mailbox. Give me a sword. I'm cutting everything.",
            "start": 3653.04
        },
        {
            "text": "the [ __ ] Hey, now you can start cutting [ __ ] Oh, yeah. I can cut those red. Yeah, you can. Oh, yeah. There you go. [Music] Don't cut your own mailbox. Give me a sword. I'm cutting everything. Got to do it. Like there's not children around right now. Chop it in half. Anakin style. What is I got? Crabs. forget if you can collect those or not. All right, I got to go this direction also. Oh, he's still sneaking around. Yeah, he's just looking for his pigs. And this is the girl that has a crush on Nick, right? Sure. What was that noise? It was awful. You better return home quickly. I a sound like that can only mean trouble. You know what I'd do if trouble came my way? I'd throw rocks to fight it off. You can handle that, couldn't you? It's easy. Just stand in front of a rock and press A to lift it. Press A to get through. Do you understand? [ __ ] All right. So, I got to go home. Talk to Ma or talk to grandma. [Music] Thank you. Blessed my mom. Barrett, was Wind Waker on 3DS? No, it",
            "start": 3717.76
        },
        {
            "text": "to lift it. Press A to get through. Do you understand? [ __ ] All right. So, I got to go home. Talk to Ma or talk to grandma. [Music] Thank you. Blessed my mom. Barrett, was Wind Waker on 3DS? No, it was on Wii U. I don't get to talk to Grandma. Maybe go I I forget. I guess I just got to go directly to No, go up um the ladder. I forget if you do this now or later. Yeah, I guess you do that later. Okay. Yeah, just uh go and find that big bird. It's on YouTube. Does this have an old TV screen effect or does the game look like that? Yeah, there's the CRT filter uh available for GameCube and I believe N64. Yeah, that's right. So, bros, what's funny is that I like I already don't even notice the CRT filter. Like you just Yeah, it's so it's just subtle enough. You get you get kind of used to it. Oh yeah. There you go. Oh. And they never put the Wii U port on Switch. Damn. I know. Cuz like a lot of the little control things like the camera stuff blast like feels much better on the HD",
            "start": 3800.4
        },
        {
            "text": "to it. Oh yeah. There you go. Oh. And they never put the Wii U port on Switch. Damn. I know. Cuz like a lot of the little control things like the camera stuff blast like feels much better on the HD version. Yeah. Yeah, that's the thing is like now that I've started this, you're getting kind of used to it or no? No. Like I mean I'm getting used to it as I go, but I it's still one of those things where I probably still want to wait for a remaster until I fully commit to playing. You're going to wait a long time, buddy. You think so? Yeah. Hope not. What about the one? What about the one they've been working on for the last Oh, please. [Music] I will tell you, I think that way is for something way later on in the game. Gotcha. [Music] If you go back to the other side of the island, I think that's where you'll kind of find your Oh, yeah. There's a bridge up there. I see. BC says, \"When does when does SGF start?\" SGF starts in 1 hour and 30 minutes at 2:00 Pacific time. Uh, we will be",
            "start": 3872.0
        },
        {
            "text": "that's where you'll kind of find your Oh, yeah. There's a bridge up there. I see. BC says, \"When does when does SGF start?\" SGF starts in 1 hour and 30 minutes at 2:00 Pacific time. Uh, we will be going live shortly before that in the studio. I think we're Yeah, we're going to go live at 1:30. So, in about an hour, we'll start our pre-show. Um, what the [ __ ] Like, was this [ __ ] always in Link's Awakening? What? The 2D stuff and the No, no. Like the Goombas. Yeah, the Mario references. That's so cool. Yeah, I never I never knew they did that. That's why people really [ __ ] with it because of how weird and um referential it gets. Gotcha. Yeah, there you go, buddy. Level design. Dark Souls got [ __ ] on on Wind Waker. Someone else they using the Gamecube controller? No, Tim [ __ ] us. Yeah, Tim took all of them home for no reason. I'm sure Gia is playing a lot with him. Sure. Kurran came over last night. All of his friends, Danny, all the other ones and current name drop. That's how",
            "start": 3931.28
        },
        {
            "text": "Tim took all of them home for no reason. I'm sure Gia is playing a lot with him. Sure. Kurran came over last night. All of his friends, Danny, all the other ones and current name drop. That's how you know I'm mad. Greg, when they drop Double Dash on the Gamecube service, are we doing are we doing a stream? Like, are we dropping everything? What's Yeah, we are. Yeah, we are. How could we not? We're getting Fran back here to re-review this [ __ ] Jerier says, \"We we've stayed at a thousand a solid 1,000 viewers since we started playing this year.\" Wind Waker people, they they thirst for enough with the Mario Kart. It's great. Everybody's playing it. Go do your thing. You know what I mean? When can you watch Wind Waker played by Bless for the first time, Barrett doing VO, me sitting here playing different totally different video game. Oh yes. Uh oh. Can you see the Gregway? I saw somebody say today's Gregway is fantastic. I don't know what that I don't know what that means. Well, didn't",
            "start": 3977.76
        },
        {
            "text": "different totally different video game. Oh yes. Uh oh. Can you see the Gregway? I saw somebody say today's Gregway is fantastic. I don't know what that I don't know what that means. Well, didn't he already upload a Gregway? Uh Cool G did is doing a Gregway today, too, which he said he was on. So, yeah, that might be Tim's recording Greg now. Yeah, I see that. Yeah, I don't I don't think they can hear or see that. Everybody in the chat start saying in the chat, \"No, we can see Tim. Tim is making great points.\" Let's [ __ ] with this will [ __ ] with super hard if you say that right now. We always when you're when we're recording something else in the other room, we can still see the chat. So everybody's always like you get confused. But if you all start saying, \"Oh, that's really smart, Tim. Good call, Tim.\" We like that, Tim. Definitely. No, we can see Tim. That's Yeah. In fact, cool. Greg's uh Ireland report is up as a Gregway right now. So that is probably what they are. Tim is",
            "start": 4036.16
        },
        {
            "text": "Tim. Good call, Tim.\" We like that, Tim. Definitely. No, we can see Tim. That's Yeah. In fact, cool. Greg's uh Ireland report is up as a Gregway right now. So that is probably what they are. Tim is freaking it. to every say, \"Tim, I like your Metal Gear shirt.\" Stop drinking that Lacroy, Tim. We can see Tim so we can tell you what he's doing. Someone else say how mad he's getting. Great point, Roger. Oh, [ __ ] We got to say, \"No, Roger, we can see you, too.\" Say, \"No, Roger, we can see you, too.\" Got uh something up in here. Uh what a fun place to work. Thank you guys for making this possible. If you're watching, you don't know us, like, subscribe, share. Of course, if you're on Twitch, you have Amazon Prime, you got Twitch Prime, you give us a free 30-day subscription. Got his ass good in there. Of course, pick up a kind of funny membership. And you could if you go pick up a kind of funny membership either on youtube.com/kind of funny games, patreon.com/kindfunn, Apple or Spotify,",
            "start": 4078.96
        },
        {
            "text": "in there. Of course, pick up a kind of funny membership. And you could if you go pick up a kind of funny membership either on youtube.com/kind of funny games, patreon.com/kindfunn, Apple or Spotify, you could see the Gregway Tim is recording right now, which was supposed to be yesterday, but the day got away from him. You could see uh your own shenanigans interrupting his Gregway about whatever it is. You'd also get Greg Cool Greg's report on being in Ireland. [ __ ] yeah. He said, uh, he was like, um, you're making great points, Tim. What? Why does that happen? And then me and Roger started laughing and and we're like, no, Greg's [ __ ] with you. And he goes, oh, great Metal Gear shirt, Tim. Wait, so they can see me? [Music] Dude, the the reaction is so heartwarming to the [ __ ] with Blessing video. The Oh, yeah. The fake Sonic one where every was like, \"This is why I love you guys. I'm never going to figure your comment. You I sent all Tam I was like when we were watching live I",
            "start": 4132.56
        },
        {
            "text": "Blessing video. The Oh, yeah. The fake Sonic one where every was like, \"This is why I love you guys. I'm never going to figure your comment. You I sent all Tam I was like when we were watching live I was sending him your your quotes because they were so good. But even yours are like like when you just turned to him and he's like is this what like when Greg Miller [ __ ] with you scary I keep flashing back to me stopping Andy like when he was about to like tell the story. And I was like, \"No, no, wait. It's real.\" Cuz then I like I did see you like on your phone doing like making a face and I was like, \"Am I still being [ __ ] with?\" But I I I don't know. That [ __ ] blew me away. The ones I sent to Tam were quote, \"This is the hardest I've ever been got in my life.\" And then you people are [ __ ] insane. Everybody go to youtube.com/kindfunny, our highlights channel. You can catch you can catch the exclusive reveal of Sonic Revolution or Tam Reolution. Shout out to Roger Craig Smith",
            "start": 4176.24
        },
        {
            "text": "are [ __ ] insane. Everybody go to youtube.com/kindfunny, our highlights channel. You can catch you can catch the exclusive reveal of Sonic Revolution or Tam Reolution. Shout out to Roger Craig Smith for being the homie. Insane. That the [Music] goat. Oh, thank goodness you're safe. When I saw you get dropped on the summit, I thought for sure you'd you'd summit. Middle gear. Metal gear. So that bird dropped me on the top of a mountain. Oh, wow. This is fired. Yeah, we're going to go a different direction for Tetra. That wasn't that nice of it. But miss, what about this [ __ ] stupid looking boy? Stupid looking. His outfit is so dumb. My grandma Mama gave it to me. All right, see you later, kid. Idiot. Hi, big brother. Alex J. Sandival in the super chats. Y'all think there's a Sega exec that side real hard and cross Sonic Revolution off of potential. I was thinking like, man, Sonic Revolution is a terrible name for a video. Big moment right here, boss. Oh no. No. My sister about to get",
            "start": 4223.04
        },
        {
            "text": "side real hard and cross Sonic Revolution off of potential. I was thinking like, man, Sonic Revolution is a terrible name for a video. Big moment right here, boss. Oh no. No. My sister about to get kidnapped. Jesus. [ __ ] Never seen again. [Music] God, they do such a good job of setting up like the the stakes and the like uh the like motivation for Link as a character here. How mad would you be if the live action movie is a Wind Waker adaptation? I just pissed off Barrett. I just pissed him off. Yeah. [Music] I mean, I'm I'm mad in general that it's a live action adaptation. [Music] I mean, work for the last Airbender movie. I'm [ __ ] with you. I'm [ __ ] with you. Also, the last air bender TV show. Yeah, I remember that. That came out. Yeah, that was a thing that exists. What's [ __ ] up is that the bird actually kills her. Gamecube was a really dark era for Nintendo. Bless you, Andy. Please. All I mean to say is that if you big bad pirates hadn't come to this quiet little island,",
            "start": 4310.48
        },
        {
            "text": "up is that the bird actually kills her. Gamecube was a really dark era for Nintendo. Bless you, Andy. Please. All I mean to say is that if you big bad pirates hadn't come to this quiet little island, that poor girl wouldn't have been snatched away by that bird. I mean, he's making good points. You brought the danger to our door. And just what do you mean by that? Just be quiet for a moment, Jesus, and I'll tell you. He's like, \"Shut the [ __ ] up. Let me speak.\" Now, as my work entails delivering letters, I spend much of my time traveling amongst amongst the many different islands. As a result, I hear many things. Haven't any of you any of you heard word that young girls have been getting kidnapped lately from all regions of the great sea? No matter wherever you've whether you've heard it or not, that seems to be the case. Young girls with long ears like yours have been getting kidnapped, never to be seen again. [ __ ] you mean long ears? And unless my eyes fail me, the young girl who",
            "start": 4411.2
        },
        {
            "text": "or not, that seems to be the case. Young girls with long ears like yours have been getting kidnapped, never to be seen again. [ __ ] you mean long ears? And unless my eyes fail me, the young girl who was just kidnapped from this island also has long ears, does she not? Much like you do, Miss Fearsome pirate. My point is that this bird mistook that poor girl for you and that's why it grabbed her. Never mind them are some long ears. And correct me if I'm wrong, but I believe it was young Link here who saved you from the monsters in the forest. Wasn't a weird space. I think you added space to your name. Is that true? Oh, and while I'm at it, you suck. I may as well tell you that that bird that kidnapped both you and Link's sister has made its foul nest to the north on the heights of the Forsaken Fortress. The Forsaken Fortress? Isn't that the place where So, what are you going to do? Under the circumstances, I don't think it would be unreasonable for you to give Link a little help now,",
            "start": 4463.2
        },
        {
            "text": "Fortress. The Forsaken Fortress? Isn't that the place where So, what are you going to do? Under the circumstances, I don't think it would be unreasonable for you to give Link a little help now, would it? I don't need you to tell me that. [Music] That's way, first of all, that's way different from the voice that Oh, I'm giving her the Metal Gear voice, right? Yeah. Even if I were to consider it lately, I've heard nothing but evil rumors about this dress. See, that's better. That's more appropriate. All right, we got to keep consistency. You can't possibly mean to go there. You can't possibly mean to go there with nothing but that cheap little sword. That's not brave. It's stupid. I mean, come on. Even a simple little island like this has has to have something you could use as a shield. You know, something to protect yourself with. Anything. Hind D. Tell you what, if you come back with something like that, we'll let you stow away on our ship. What's up, Beans? I was gonna say Beans got",
            "start": 4520.6
        },
        {
            "text": "know, something to protect yourself with. Anything. Hind D. Tell you what, if you come back with something like that, we'll let you stow away on our ship. What's up, Beans? I was gonna say Beans got games subscribing for 40 months in a row saying bless Greg Barrett. What's up fellas? I was combining our names. He's a vampire. Uh stopping by before I head to SGF. I hope you have a great time. Beans, make sure you say hi to me tomorrow at Play Days. [ __ ] yeah. Oh, and one more thing. Once we leave, you won't be coming back here for a while. So, you better go say goodbye to your family while you still have the chance. I don't want you getting all weapy eyed and homesick on me. I'm getting the shield and I'm saying goodbye to grandma. Yeah, there you [Music] go. Tetra has been chugging vodka to get that voice. Joey Ratchstone says Kelly. It's Kelly. What is it, Link? I forget the grandma's voice. Please tell grandma what's troubling you. And where's Arrol? Is she still playing outside",
            "start": 4570.88
        },
        {
            "text": "to get that voice. Joey Ratchstone says Kelly. It's Kelly. What is it, Link? I forget the grandma's voice. Please tell grandma what's troubling you. And where's Arrol? Is she still playing outside with the seagulls? Oh, there's no response to things like that. Ah, Grandma's like, \"Oh, you know, let's uh We'll talk about that later.\" I love how it's supposed to say goodbye. Well, you got to go up to get the shield, buddy. Oh, the shield's up there. I see. No, it's not. [ __ ] Grandma, no. [Music] Blake, got the rumblies in my tumblies. Is he hungry or you going to poop? Yeah, both. Wait, you do or my grandma? Who knows? Is this what you're looking for? Where Barrett starts and grandma ends? It's hard to tell. He gets so into his rolls. Take it with you. Oh, he looks so sad. I guess it is true. Arrow really has been kidnapped, hasn't she? What kind of a monster could take such a sweet young child? Damn, you look so sad. Blessed. Now you're going to leave her. I mean, your other",
            "start": 4622.12
        },
        {
            "text": "it is true. Arrow really has been kidnapped, hasn't she? What kind of a monster could take such a sweet young child? Damn, you look so sad. Blessed. Now you're going to leave her. I mean, your other grandchild. Listen, I got to I got to save my sister. Yeah, you got to save your sister, man. Or die. You know, one of the two. You know, you're either going to have two grandchildren or none. Those are the options, right? Double or nothing. Oh, let me say goodbye to what's up. What's good, Link? I I thought I heard Arrol's voice cry from far away. Is it Is it really true? All right. Why are you still blushing? My sister's been taken. She was She's And she's smiling at the side of me. She was so [ __ ] annoying. I'm so happy she's gone. Oh, heart. Cool. There you go. [Music] appreciate. Um, is it DC man in chat that says, \"Just watch the Sonic reaction video. You people are monsters.\" Thank you so much for that. I appreciate it. All right. I see Tim is finally done with his uh Tim way",
            "start": 4716.52
        },
        {
            "text": "is it DC man in chat that says, \"Just watch the Sonic reaction video. You people are monsters.\" Thank you so much for that. I appreciate it. All right. I see Tim is finally done with his uh Tim way here. Uh, so I'm going to pop off for a little bit. Um, oh yeah, you got to talk to Tetra uh to set up for SGF since we're about an hour away. Well, I was I was going to say if this is this might actually be a good stopping point for Wind Waker cuz now I'm like I want to save the rest of this for. Yeah. Yeah. Yeah. So that that you'll get in five years. Yeah. That'll get someday. Uh do you want to come on give it to me? Do you want to stay on stream? Do you want to pop off? So what do you want to do? I mean I'm I'm down to stay. I'm not for either. So like if Mario Kart's move, if me hopping into any of these games Well, I mean I'm already playing Links Awakening, too. I don't know if we cared about that or Yeah. If you want to play Links Awakening. Sure. Yeah. Show off like how good that",
            "start": 4789.44
        },
        {
            "text": "any of these games Well, I mean I'm already playing Links Awakening, too. I don't know if we cared about that or Yeah. If you want to play Links Awakening. Sure. Yeah. Show off like how good that looks now. Yeah, give me that one. I think that's the one I brought anyway. Thank you. I'm hungry. We got that zah coming. Pizza's on the way. Radstone says, \"Thanks for the voiceover, Barrett. I'll pass that on to him.\" You won't. I already forgot it. Show this. Go [ __ ] Looks like Chad's excited for Link's Awakening. Chad, how many of you guys decided to get Switch Twos? I was having a conversation with uh some of my friends who like who love video games, but like I was talking to my friend Asan and he was like, \"Yeah, I'm not going to get one till the end of the year.\" And it hit me that like, \"Oh yeah, not everybody gets consoles at launch.\" You know what I mean? Like there's plenty of people that are crazy people. They're playing people that are just waiting for that that what do they",
            "start": 4832.16
        },
        {
            "text": "\"Oh yeah, not everybody gets consoles at launch.\" You know what I mean? Like there's plenty of people that are crazy people. They're playing people that are just waiting for that that what do they call it? Kill a rap type situation. Yeah, Mario Kart might not be them. Be that for them. Like Spoon Martinez in chat says next year for me. I think it's the first time I've seen on TV. Oh, this looks great, right? Oh my god. Uh, Waffle on the Run says, \"Have you all played Soulcalibur yet?\" I Soulcalibur 2 was the first thing I booted up on the Switch, too. Really? Yeah. I was waiting for Mario Kart to download. I already had the Gamecube thing downloaded. Um, and I know I've like played so much Soulcalibur 2 growing up, so I I knew how you do that. You do it well enough that you're like, I want to see what it looks like. Exactly. Got it. Oh, says I'm signing between a Steam Deck or ROG or waiting cuz if I stand by my Steam Deck gets the most use out of me currently as a platform. Yeah. I",
            "start": 4889.04
        },
        {
            "text": "to see what it looks like. Exactly. Got it. Oh, says I'm signing between a Steam Deck or ROG or waiting cuz if I stand by my Steam Deck gets the most use out of me currently as a platform. Yeah. I mean, my ROG is what I've been all about, too. Yeah. Plus, how's the online and Soulcalibur 2? I didn't try playing online. My thing with the with the Nintendo Switch um like Switch online classic stuff, the online I think for me is always the same, right? Where it's like it's not like they go in there and like redo matchmaking and all that stuff. Unless I'm wrong and they do do that, but like unless I don't do this unless they do that. Unless they do, I I totally miss the update. But like the online stuff has never been a draw for me with the Switch online view. Like I I I can't imagine they have roll back net code for Soulcalibur 2 on Gamecube. So PC man says I'll be waiting until the end of the year specifically for Pokemon Zah. God, I hope that's good. Me too. It's the thing where like",
            "start": 4948.32
        },
        {
            "text": "roll back net code for Soulcalibur 2 on Gamecube. So PC man says I'll be waiting until the end of the year specifically for Pokemon Zah. God, I hope that's good. Me too. It's the thing where like have you seen much about it? Like have you watched the trailers? Yeah, I've watched what's out. Yeah. Gotcha. Yeah. I'm I'm like [ __ ] Oh, got I'm very much like wait and see on the battle system. Yeah. Yeah. Cuz they're doing something different with it. B outsider. Where's Barrett? You know what I mean? I don't get no VO. Moldorm. Oh no. Oh, is this the first dungeon? Yeah. Gotcha. Off the lenses. I think I'm going to wait till dust dust floods. Keep forgetting. I got to know. That's crazy. Me, too. Yeah. Yeah. I hadn't thought about that at all. Not that I care, but you know what? Just as an industry. Do you think Oh, [ __ ] you. Do you think you took care? No, but I'm always open to it. I'm always open to trying to get Oh, [ __ ] I hit the wrong button. Stupid goddamn Switch controller.",
            "start": 5007.44
        },
        {
            "text": "industry. Do you think Oh, [ __ ] you. Do you think you took care? No, but I'm always open to it. I'm always open to trying to get Oh, [ __ ] I hit the wrong button. Stupid goddamn Switch controller. Throw it. And incandescent says, \"How long until the Switch 2 OLED?\" I've never been so aligned with him on a thing as far as like OLED screens because yeah, I mentioned it on one of the things yesterday that like when I did my transfer from Switch one to Switch 2, I picked up my Switch One, saw the OLED screen, I was like, \"Fuck, this is good.\" Like I wish the Switch launched with an OLED, but we'll get it. Oh, Alex says, \"Y'all look bored.\" This game play right here. Playing naturally like you play at home, Alex, you piece of [ __ ] Get the [ __ ] out of my chat. Yeah, Rajiv chat says, \"I honestly like the new screen. I forget how exactly ELED was though.\" I al I also really like the new screen. I don't have like complaints about it aside from the Wonder Woman 1984 meme. Uh but it could",
            "start": 5085.28
        },
        {
            "text": "like the new screen. I forget how exactly ELED was though.\" I al I also really like the new screen. I don't have like complaints about it aside from the Wonder Woman 1984 meme. Uh but it could be better. Could be better. Yeah. Captain Jabro says, \"Greg look like my wife playing Night Ray. [Music] Come on. Just classic. Let's [Music] go. What a weird game this one is. Like I played it up until the second dungeon and I was like, you know what? I I I understand why people It It feels like another Majora's Mask situation of like people love when Nintendo Let's go. Let's go the opposite. We're supposed to go right, we'll go left. Yeah, you already got the very traditional. We'll come off and be You're getting a Yoshi doll for somebody. Yeah, like you're going to be hopping on glmbbas and [ __ ] Swamp garage. A path opens in the blooms. Thank Ait says, \"Greg, are you interested in the Super Popcorn Super Theater popcorn containers? The Daily Planet newspaper box is pretty cool.\" Yes, I'm",
            "start": 5154.88
        },
        {
            "text": "Swamp garage. A path opens in the blooms. Thank Ait says, \"Greg, are you interested in the Super Popcorn Super Theater popcorn containers? The Daily Planet newspaper box is pretty cool.\" Yes, I'm interested in wasting all my money on everything, so don't worry about that. This looks incredible, right? For and especially remember how bad it looked. Yeah. Like it that was one of the big reasons I put it down was I was like, \"Oh, this looks kind of atrocious.\" When I when I put it [Music] on the windfish go [Music] So, Bless. Mhm. Link's Awakening. Yeah. A Zelda remake. Yeah. Are we going to see a lot more of those? Like, do you think like when do you think will they ever do Hey, we're remaking The Legend of Zelda? Oh, the original. like you know I feel like there's something there because like it's hard to go back to that old game and how ch you know game play has changed since then like I think but like have they changed the gameplay much for Link's Awakening like I think this game is",
            "start": 5221.24
        },
        {
            "text": "it's hard to go back to that old game and how ch you know game play has changed since then like I think but like have they changed the gameplay much for Link's Awakening like I think this game is pretty much what the game was on Game Boy as far as like the moment to moment obviously they've like done a lot to it but like I I don't know what you could do to the original Zelda aside from like when I think of a Zelda The Legend of Zelda remake I think of HD 2D as opposed to like doing this. Oh my god, but that would be [ __ ] dope. And I think that is a possibility. That'd be [ __ ] I would think that I would think maybe you could get this this style for Link to the Past. Yeah. Yeah. Yeah, for sure. Um but I more so want Ocarina. Yeah, me too. Of course. Yeah. Yeah. I just wonder how far they'll take that and what they'll do with that. Yeah. [Music] Uh, Toby Blue says, \"As someone who's ignorant, does Zelda one have much of a story?\" Not really. As far as I remember, right? Like it's",
            "start": 5305.44
        },
        {
            "text": "they'll take that and what they'll do with that. Yeah. [Music] Uh, Toby Blue says, \"As someone who's ignorant, does Zelda one have much of a story?\" Not really. As far as I remember, right? Like it's very It's one of those games back in those days. I don't know how young you are to be ignorant like that. The the the instruction manual had the story. Yeah. Yeah. That's actually You made up a lot of stuff in your head about what you were doing, too. Yeah. Like there's definitely something there. It's not like but it's like for like the original I think there's barely outside of the manual like they drop you into the world you go into a cave and they're like you're don't go alone take this and they give you a sword and then really you are just going into dungeons directly like there's not really much dialogue whatsoever outside of like a sentence like a sentence here and there that's like setting up a store or something but yeah I think you're getting that entirely out of the manual and",
            "start": 5353.68
        },
        {
            "text": "much dialogue whatsoever outside of like a sentence like a sentence here and there that's like setting up a store or something but yeah I think you're getting that entirely out of the manual and then Link's Awakening or Link's uh Link to the Past has story Zelda 2 actually I'm not Sure. How much story is in that? Me neither. I think there's I think there's quite a bit cuz I remember like the memes of typos and [ __ ] that they got here. Sure. [Music] Nana Pazo in chat says the story was big pig doing bad. Big pig big pig was doing bad. Lukan chat says, \"Is Link's Awakening a good Zelda to start with for someone for someone who hasn't played any?\" I mean, I think so, but it's hard to say. What you want? Yeah. Like, if you're looking for like a cute like 2D like this style of Zelda game, I would say it's not a bad one to start with. But like if you want like a like a full-on like Zelda experience, I would say Breath of the Wild or Tears of the King. 100%. Yeah, I think that that would",
            "start": 5397.84
        },
        {
            "text": "would say it's not a bad one to start with. But like if you want like a like a full-on like Zelda experience, I would say Breath of the Wild or Tears of the King. 100%. Yeah, I think that that would be my thing where it's like I'm so jonesing for this because I want a simpler Zelda. I want just to go beat up on monsters. I want to go run dungeons. I want to get the heart containers right. Like again, like I was talking about at the top of the show, you know, I want to do a traditional Zelda, whereas like Yeah. Like obviously Breath and and Tears are so [ __ ] good that if you've never played those, yeah, get out there and do that. Yeah. I mean, Al Allen chat says operine of time and like I would love to say that but it's so old. But it's so old. That's why I think you that's why I think they got to remake it. Like one I don't think we're going to get I think whatever the next big 3D Zelda uh game is. It's not going to be like another like entry into the Breath of Tears like like",
            "start": 5480.4
        },
        {
            "text": "they got to remake it. Like one I don't think we're going to get I think whatever the next big 3D Zelda uh game is. It's not going to be like another like entry into the Breath of Tears like like another tril adding to a trilogy of video games. I think they have to make something that's going to be ground floor so they can continue to get new people in and reset and like do all that stuff. And I think Ocarina is the best way to go. You know what? That's this is the best way we can reset is by going back to something that's like considered the pain. Oh, come on. He was right there. I got greedy. I got greedy. That was on me. Come on. I thought with him at the water line, I thought I could still pop him out. I didn't realize the game. Al says, \"Yeah, but the 3DS version is still incredibly well done.\" But the thing is I unless they port the 3DS version, right? Like if I'm recommending a Zelda to somebody who's not playing one, I'm not going to be like, \"Oh, go to the store and buy a 3DS",
            "start": 5524.16
        },
        {
            "text": "done.\" But the thing is I unless they port the 3DS version, right? Like if I'm recommending a Zelda to somebody who's not playing one, I'm not going to be like, \"Oh, go to the store and buy a 3DS to play Zelda Ocarina.\" Good point. Unless, listen, unless they're trying to play through some other means, which I can't cosign. But allegedly allegedly [Music] [Music] Jesus here everybody. Let's [ __ ] go. That song obviously so iconic, but what it reminds me of is being a kid in my childhood bedroom watching whatever the show was called where they did the video game challenge. It was on before school. Kids would play games like that like a Nickelodeon situation. It was like basic Fox for me growing up as a kid. And this is like I'm talking like this would be you know late 80s early 90s and so it's like yeah it's very much that but I as a Sega kid not having it that's where I was like listening to Mega Man music and listening to Zelda music when they went and did the challenges. [Music] I",
            "start": 5566.32
        },
        {
            "text": "it's like yeah it's very much that but I as a Sega kid not having it that's where I was like listening to Mega Man music and listening to Zelda music when they went and did the challenges. [Music] I think that for me was probably straight up G4. Oh wow. like watching um whatchamacallit cinema tech and like the shows where they would just play trailers and I'm just seeing games that I've never heard of before like just random PS2 and like JRPGs and [ __ ] where I'm like oh what the [ __ ] is [Music] this Pop Offs Nick Arcade mine was on I could get it I don't remember I I remember it being on Fox like before cartoons in the morning but I I was So young I can't even give you anything. Here. Thank you, Joey. You did a great job. Were there [Music] meatballs? I'mma feed myself a meatball. I'm not going to make Roger do it. All right, I'm getting a meatball. All right, you that keep playing answer in chat. I'll get some pizza eventually. Uh, boom bango. Greg, did you ever have the Sega",
            "start": 5653.04
        },
        {
            "text": "I'm not going to make Roger do it. All right, I'm getting a meatball. All right, you that keep playing answer in chat. I'll get some pizza eventually. Uh, boom bango. Greg, did you ever have the Sega channel? My wife joked, \"We were raised in different tax brackets cuz she had never heard of it.\" I did not have the Sega Channel and my parents I think it wasn't a money thing if memory serves. I think it was just my parents like what? Like how are we going to plug it in? Are you going to eat up the phone line? No thanks kind of thing. But I also think I might have been transitioning. I don't remember. You'd have to tell me when the Sega Channel launched. If you forget everybody, the Sega Channel was ahead of it time for the Genesis. you popped in the cartridge and then plugged in your phone line and then you could like basically download Netflix games that way. Um, and so yeah, I forget why we didn't do I think it was that it was so ahead of its time and I think also I might have been",
            "start": 5721.28
        },
        {
            "text": "line and then you could like basically download Netflix games that way. Um, and so yeah, I forget why we didn't do I think it was that it was so ahead of its time and I think also I might have been moving on when the Sega Channel launched. Maybe I was already onto the Saturn. I [Music] forget. Don't be stupid. I tried to jump over him. I thought I could do it. Couldn't do it. You got to try sometimes, [Music] chat. What a game. This game's [ __ ] [Music] awesome. Glad I found it. Nobody's talking about it. Just me. Get back, Link. He's going to blow. [Music] Berry, I found Chompy. Can I free you, Choy, though? Oh, I saved him. Okay, great. I told you I'd get Boww while back, and I did, I guess. Oh, now he's in the Oh, that's [ __ ] cool. Uh Joey, Greg, have you ever tried Skyward Sword? Yes. Oh, I've tried every Zelda game since Ocarina of Time. Um cuz yeah uh yeah Skyward Sword I did not like but I was also so anti-we but again like I was saying it was getting so removed from the",
            "start": 5760.32
        },
        {
            "text": "Yes. Oh, I've tried every Zelda game since Ocarina of Time. Um cuz yeah uh yeah Skyward Sword I did not like but I was also so anti-we but again like I was saying it was getting so removed from the Zelda game I wanted I was say why are we pausing why can't that [Music] uh Seahawks 12 I had to leave for a little while. This looks like a different Zelda game than when you're playing earlier. That is correct. Uh Degeneration Max Greg, what's the latest on Mike? He's sick. Death doloop. Anti-we. I mean, I loved my Wii for what it was, but by the time Skyward got there, I just wasn't feeling it. I didn't want Waggle for it. I was very anti-Waggle. Launch Waggle. Fine. Years in Waggle. No, thank you. What's up, Gravedigger? Oh. [Music] We have to come see me shack over there. You got [Music] it. Uh, Dolphin Corn. Greg, take a month off and finish Tears of the Kingdom on Switch. I'll tell you how it's going to go. I'm going to I'm going to play Link's Awakening. I'm going to do Echoes of",
            "start": 5840.32
        },
        {
            "text": "it. Uh, Dolphin Corn. Greg, take a month off and finish Tears of the Kingdom on Switch. I'll tell you how it's going to go. I'm going to I'm going to play Link's Awakening. I'm going to do Echoes of Wisdom. I'm going to play Pokemon. There's a lot for me to play over here. Don't you worry about me, okay? Stop worrying about me, please. I feel like I want to take Chomp. I want Chompy Chomp to stay with me to fight stuff, but I kind of feel like I should take him back right away cuz of course his mommy misses him. Does you Wait. Yeah, do something. Chomp. Fight with me. We got crows to fight, bro. Can I jump with him, too? And I can't jump over these things. [Music] Oh, can I do a jumping attack? Oh [ __ ] Okay. Good day. Oh, okay. I [Music] can't. And my axe. [ __ ] You see? Yeah. Now we're a team. We're 19 more time. Bomb [Music] Chompy. 52 minutes. Barnelli says, until SGF, which means about 20 minutes till we'll go live, hang out with you in the studio. [Music] Go talk to him over",
            "start": 5915.96
        },
        {
            "text": "a team. We're 19 more time. Bomb [Music] Chompy. 52 minutes. Barnelli says, until SGF, which means about 20 minutes till we'll go live, hang out with you in the studio. [Music] Go talk to him over here. What does Dampy get in here? Tell me what's up. Dam the gravedigger. I'll stay post here. Take care of the other business. Just don't leave me waiting too long. Right. Oh, I can't do it till I drop off my boy. Okay. Come on, Chomp. Chomp. Let's chop you off. [ __ ] up this pig butt. Yeah, chubby. [Music] Won't work. I understand you want me to dig, Chompy, but how do I how do I how do I do it without without turn you in, Choppy? Let's get you home. Chompy, you need to go home. Chompy, go home. Choppy, go home. Oh no, it wouldn't blaster when somebody comes back. Yeah, let me drop off Chompy and then I can pass off to whoever. [ __ ] you. Can I drop off Chompy first? Oh, I eliminated it. Sorry. I was like I was like last night when I got home I was like all right let's unload all the",
            "start": 5986.44
        },
        {
            "text": "and then I can pass off to whoever. [ __ ] you. Can I drop off Chompy first? Oh, I eliminated it. Sorry. I was like I was like last night when I got home I was like all right let's unload all the trash that I don't want anymore. You're not you're not Choppy's mom. Where's Choppy's mom at? She inside. Oh yeah. Yeah, that's right. She should be in here. I brought back the chomps. It is my Switch gets here though before you leave today. I might borrow Captain Toad. Oh, sure. Are we all on the same family plane? Yeah, you're on there, too. I love that. I [ __ ] Where's Chompy live? Chompers. Don't you love hopping into a game after years and being like, \"How does this work?\" I wish that was an excuse. No, I I just started a new save last night. But the woman was like, \"Go save Chompy.\" And I was like, \"All right.\" And then I ran out. I'm like, \"Wait, where the [ __ ] are you at, lady?\" So funny. Uh Devin says, \"Joey, how are you feeling after the overnight stream?\" Oh, I feel great. I was",
            "start": 6130.0
        },
        {
            "text": "like, \"All right.\" And then I ran out. I'm like, \"Wait, where the [ __ ] are you at, lady?\" So funny. Uh Devin says, \"Joey, how are you feeling after the overnight stream?\" Oh, I feel great. I was talking to Roger earlier. I definitely [ __ ] it up where I like I slept for a couple hours and then I watched a bunch of TV and then I fell asleep from like 8:00 to 11:30 and then I slept till 4:00 and then I slept till 9:00. So, like I do think I'm back to being normal, but I did it in like a very not great way, but maybe the best way. Who can say? So, I had a great time. We had a lot of fun. I don't get late night Nick very often kind of pretty much ever and then late night Nick with Fran in general was really fun and then Rogerino the goat I'll just stop here like I like that she has a little bow that's what she wanted now she she gets what she wants cool it's so And you want a cart, you said? Yeah. Thank you, Jester. I want to see how many costumes there are, you know. Yes, we are",
            "start": 6200.8
        },
        {
            "text": "little bow that's what she wanted now she she gets what she wants cool it's so And you want a cart, you said? Yeah. Thank you, Jester. I want to see how many costumes there are, you know. Yes, we are reacting to SGF. The boys will be going live probably 1:45, 1:30, somewhere in there. Something like that. Um, probably. So, that's like I don't know. I don't have my watch or my phone. I don't even know why I said I don't have my watch cuz I don't wear a watch ever. Um, but yeah, guys, I want to get better at Mario Kart, but I don't think I'm actually ever going to get better at Mario Kart. I just feel like I'm so far behind. Who did everybody unlock? How do I unlock Berto? That's really what I want to know. Um, Dr. Dun, who am I enjoying most in Mario Kart? Here's the thing. I only really played Toadette. That's really all I've committed to. I'm happy that she's here and available. And I don't have Berto yet, so that's all I got. I also like I don't really I'm not great at like Oops,",
            "start": 6264.4
        },
        {
            "text": "played Toadette. That's really all I've committed to. I'm happy that she's here and available. And I don't have Berto yet, so that's all I got. I also like I don't really I'm not great at like Oops, that's not it. What's the like I don't really understand this. Barrett, you're the Mario Kart champion. How do What is the strategy behind picking a cart? Well, it it's too early now uh for me for me to tell at this point. But just in general for Mario Kart, uh if you hit the X button, is it this one? Yeah. Uh, and then you kind of like look around at like a good balance between speed and acceleration. I feel like it it it's a there's definitely some cards where it's just kind of about preference, but Yeah. Like the bike so far. Yeah. The bike so far like I haven't loved any of the bikes that uh I've unlocked just because the the speed is way low. Yeah. Yeah. Oh, that one was actually kind of nice. This one's not bad. Yeah. Um, and I also like don't feel like I know enough about like the",
            "start": 6339.64
        },
        {
            "text": "uh I've unlocked just because the the speed is way low. Yeah. Yeah. Oh, that one was actually kind of nice. This one's not bad. Yeah. Um, and I also like don't feel like I know enough about like the different like character types and stuff like that or if that's a factor. I I think it still is, but it's not like listed anywhere, right? No, it's like back end. Yeah. Kind of stuff. Um cuz yeah, I just don't really know enough about any of this cuz I I have always just picked based on aesthetics. Yeah, just vibes. Yeah. That's like, oh, I want Toadette to have a cute pink cart. That's all I got. Um, what have I not I guess I haven't played through most of these. I'm excited to watch your video as you go through everything. Yeah, I do. In my video, my first time playing Mario Kart World, which you can check out now on the videos tab under youtube.com/confunname. Uh, I did like the first two Grand Pris and then a knockout tour. Um, just because I didn't want to go too long because I was",
            "start": 6397.84
        },
        {
            "text": "you can check out now on the videos tab under youtube.com/confunname. Uh, I did like the first two Grand Pris and then a knockout tour. Um, just because I didn't want to go too long because I was doing that while uh everybody was streaming. I was like, I want to go join. I want to go dominate some of these kids. It was fun. Not so much the a factor for me anymore. I feel like really. Yeah, it's a little bit more even keel. Yeah. And yeah, that's what we were talking about yesterday on like kind of our impressions after like the first day, right? Um, it feels like a lot of the design philosophy around this to me at least is a bit more leaning towards that kind of chaotic party uh vibe of Mario Kart just with like the amount of uh players this time around the items that they've brought back from like other Mario Karts uh past and stuff uh seems to be a bit more of that chaotic uh I need a vibe. Yeah, it's like let's make it more fun than competitive. Yeah, maybe it's true. There will",
            "start": 6452.72
        },
        {
            "text": "from like other Mario Karts uh past and stuff uh seems to be a bit more of that chaotic uh I need a vibe. Yeah, it's like let's make it more fun than competitive. Yeah, maybe it's true. There will definitely still be that competitive kind of vibe to it, like uh people figuring out like the the wall driving and grinding and like the kind of strategies with all of that stuff, but I think overall um at least early impressions still cuz I've only had two days with this at this point. Yeah. Is that your plan for the weekend? I I think so. Too fast. But it was also just like seeing Blessing like start up Wind Waker. I'm like, [ __ ] do I want to replay Wind Waker and starting up Breath of the Wild? And seeing Breath of the Wild in like 4K 60 is like a [ __ ] all this is all really cool right now. I wasn't like super stoked cuz I don't have anything that I'm like dying to play, but then I was like, what? But what if I did? Yeah. What if I did start my new Animal Crossing island? Um, then",
            "start": 6502.32
        },
        {
            "text": "now. I wasn't like super stoked cuz I don't have anything that I'm like dying to play, but then I was like, what? But what if I did? Yeah. What if I did start my new Animal Crossing island? Um, then maybe play some Captain Toad. I had a lot of fun when I was saying that the other day. Oh, the treasure tracker. Yeah, [ __ ] yeah. It's so good. Treasure Tracker is so good. Um, someone this game or someone said Juna says, \"I feel like being a great driver almost doesn't matter.\" Yeah. And I and I think that was kind of my point that I don't know if I uh said well yesterday, but like the more traditional like being good at cart driving from what we've known for Mario Kart 8, um it's just different this time around. And so I think like the kind of what is considered to be a great driver in this game, learning all the other new strategies, I think is going to be the the big point here. But in terms of like the more traditional knowing the core tracks and kind of like how to hit certain um",
            "start": 6555.84
        },
        {
            "text": "game, learning all the other new strategies, I think is going to be the the big point here. But in terms of like the more traditional knowing the core tracks and kind of like how to hit certain um uh what's the word I'm looking for? Drifts and all that stuff. There's just like a lot more options which again to me feels a bit more because we have more options feels uh a bit more of that party vibe. Yeah. Well fun. Oh yeah. Keep hitting that question block. It's going to get you more coins. Oh, perfect. Yeah, sometimes I'm just like I don't have the brain power to think about all the things I need to think about in general, but also in my game. Who's your main? Uh, I'm Or do you not? So, for Mario Kart 8, my main for 150 was um Link. I liked Link's speed. Um, and then 200, he was a little too fast for me for 200, so I went with Shy Guy cuz he had like more of a kind of balance uh speed and acceleration and all that stuff. Mhm. With this game, because there's only 150 CC and I don't have",
            "start": 6610.84
        },
        {
            "text": "fast for me for 200, so I went with Shy Guy cuz he had like more of a kind of balance uh speed and acceleration and all that stuff. Mhm. With this game, because there's only 150 CC and I don't have Link, I'm like kind of lost a little bit. So, you don't have Link cuz you haven't unlocked him yet or cuz he's No, cuz it's just core Mario characters right now. Oh, yeah. So, maybe one day they add like other like more grand Nintendo IP into this later on. DLC maybe. But um yeah, so right now I'm just sticking with Jai Guy cuz that's my little that's my little buddy. That's my little dude. Um yeah, I haven't unlocked nearly enough to really get into the the minutia of what I like in terms of feel. But yeah, right now I'm doing Shy Guy and uh I forget which cart I I finally found a cart last night that I I I like so far. Uh hoping to unlock more stuff that I like a bit more in terms of feel and speed. Yeah. Yeah, chat. We will probably go back on standby in just a couple of minutes here.",
            "start": 6671.52
        },
        {
            "text": "night that I I I like so far. Uh hoping to unlock more stuff that I like a bit more in terms of feel and speed. Yeah. Yeah, chat. We will probably go back on standby in just a couple of minutes here. Um, so we can start properly setting up for Summer GameFest. If you're watching on time Yeah. Uh, if you're watching on YouTube, uh, that means when this stream ends, it should kick you over to our next stream, which will be our Summer GameFest reactions. If you're on Twitch, you can stay locked in here. Locked [Music] in. Time goes so fast. Indeed it does. [Music] Can you still change Shy Guy's color? No. Sad. Not bad. I I liked black Shy Guy cuz he's the color of my soul. And then also like I I always wear a lot of like black hoodies and just like a lot of black in general. So I was like, \"Oh yeah, that's my dude right there.\" But no, just red shy guy. which is [ __ ] up because I see in the world if you're traveling around the world in Mario Kart World, you see other colored shy guys.",
            "start": 6719.76
        },
        {
            "text": "yeah, that's my dude right there.\" But no, just red shy guy. which is [ __ ] up because I see in the world if you're traveling around the world in Mario Kart World, you see other colored shy guys. It's like what the [ __ ] And I think that the same goes for Yoshi as well. It's just the traditional green Yoshi. Another chance for them to add it in a update that is annoying. Yeah, for $20. Yeah, you could have the thing that we included the last time for free. Great. Thank you. Thanks, Nintendo. [Music] You guys are featured on YouTube. Let's [ __ ] go. Oh, so glad it's me in this really terrible. This is expert Mario Kart gameplay right here. Mario Kart expert in the m in the making right here. from the person that played maybe 5 hours of Mario Kart on the Switch without being at [Music] work. Fine. There are different colored Yoshis in the game. What the [ __ ] God damn it. Do you know what the like is to unlock all the extra characters is just playing more? Yeah. Yeah. So, there's",
            "start": 6797.68
        },
        {
            "text": "work. Fine. There are different colored Yoshis in the game. What the [ __ ] God damn it. Do you know what the like is to unlock all the extra characters is just playing more? Yeah. Yeah. So, there's like uh little like uh like to- go bags uh that you'll see throughout the How do I get Berto? Uh I So, there are certain characters that you unlock doing uh by doing Grand Prix and I think knockout like solo knockout tours as well. Uh then there's some other characters that are like kind of just generic uh like Mario uh enemies that you can unlock randomly. Um, you'll get turned into a different character while racing like uh Oh, by hitting something or whatever. I think it it's the wizard enemy. I forget his name. Um, like fly over you and like turn you into like a different character and then that unlocks those certain characters. Got it. Uh, and then outfits for the different characters. Yeah, the bags um that you'll find throughout the world and those are tied to where you're at in the",
            "start": 6868.2
        },
        {
            "text": "that unlocks those certain characters. Got it. Uh, and then outfits for the different characters. Yeah, the bags um that you'll find throughout the world and those are tied to where you're at in the world. So, I got like the pit stop like Shy Guy, but I think that was because I was at a certain track in the world. Um, and so yeah, that's like kind of the whole draw to doing like full completionists, playing as different characters and all that stuff. Yeah, you can only unlock uh costumes for characters if you're playing as that character. Uh, Barrett, since you like like hot mulligan, please give arms length a listen. Uh, very much the same Midwestern emo pop punk style. They just came out with their second album and it's definitely an album of the year contender. I did start up that album because people were uh skating me on Blue Loose Sky telling me to check out Arms Length. We got to figure out a different term. We're leaning into the SKS. Um cried tweet from my cold dead hands.",
            "start": 6918.32
        },
        {
            "text": "because people were uh skating me on Blue Loose Sky telling me to check out Arms Length. We got to figure out a different term. We're leaning into the SKS. Um cried tweet from my cold dead hands. I'm always just going to call it a tweet. Um sorry. Yeah, I only like I I I got like halfway through that first song and then I got like sidetracked by something else. But I do want to give that album a listen to. Um, all right y'all. It is 1:26, so I'm going to put us back on standby. Um, thank you all so much for hanging out with us as we uh kind of kill some time in between Games Daily and Summer GameFest, but we're going to get ready for our reaction to Summer GameFest. Again, if you're on YouTube, our stream will end here, but it should automatically kick you uh over to our live reactions, which will go live uh shortly in the next couple minutes. Uh Twitch, you can stay here and hang out. Um, but until next time in like a couple of minutes, it's been our pleasure. Bye, Chat. [Music]",
            "start": 6968.16
        }
    ]
}