{
    "id": 14220,
    "video_id": "rpbgOawqU2I",
    "show_name": "Highlights",
    "hosts": [
        "Tim Gettys",
        "Andy Cortez",
        "Blessing Adeoye Jr.",
        "Mike Howard"
    ],
    "title": "Xbox Game Showcase Was Kinda...",
    "description": "From Gamescast: https://www.youtube.com/watch?v=anJ-qQUZQOM Go to http://kindafunny.com/XREAL to grab yours now!\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\nFOLLOW US ON EVERYWHERE!\n---------------------------------------------------  \nYouTube: Youtube.com/KindaFunnyGames\nTwitch: https://www.twitch.tv/kindafunnygames\nPatreon: https://www.patreon.com/kindafunny/\nTwitter: https://twitter.com/KindaFunnyVids\nInstagram: https://www.instagram.com/kindafunnyvids/\nTikTok:  https://www.tiktok.com/@kindafunnygames?lang=en",
    "published_at": 1749493781,
    "duration": 1469,
    "transcript_chunks": [
        {
            "text": "Xbox Game Showcase 2025. No longer are we in a world where Activision shows up at a couple different places. Bethesda gets its own showcase and Xbox does its thing. Now it's all part of one giant experience. Um featuring a direct after. This is our third year we've now seen this uh this time featuring on uh Obsidian Games's Outer Worlds 2 and the surprise of Grounded 2. Um overall Xbox Game Showcase, what are your top level thoughts? Snow bike mic. Oo, Tim, coming to me first, of course. Uh, top level thoughts, Tim. You know what? It was a really nice afternoon being spent with all of you. So, always remember that. I really love seeing games and hanging out with you. But for me on the Xbox Game summer showcase, I was going to say this, Tim. Um, you know what? The opening was really weak and I think the first party promotion was also on the weaker side. I think first party was lacking this year when we come to promotions, trailers, get hype moments. And so I just didn't feel like the oh",
            "start": 0.48
        },
        {
            "text": "I think the first party promotion was also on the weaker side. I think first party was lacking this year when we come to promotions, trailers, get hype moments. And so I just didn't feel like the oh snap, Xbox has got the games. We know they have the games, but this summer showcase didn't show we got games, right? And so I'm a little lacking on that one. Also, a lot of the games that were shown aren't my style. I actually come out of this enjoying Jeff Keelley Summer GameFest that had more games that spoke to me than this one. Unfortunately, I thought the third party support was pretty strong with Persona in Final Fantasy. Uh there was a day back in the day with XCA that Barrett never thought Persona would be on an Xbox. Now we get Persona 4, which is great to see him happy about that. And Xbox fans can be very excited about Final Fantasy coming to their consoles with 16 today. And then of course this fall, uh we will get Final Fantasy 7, which is like, hey, finally that's a big help.",
            "start": 45.84
        },
        {
            "text": "Xbox fans can be very excited about Final Fantasy coming to their consoles with 16 today. And then of course this fall, uh we will get Final Fantasy 7, which is like, hey, finally that's a big help. And we knew Phil was bringing that team over to help us out and get over there. Um man, oh man, Tim, I thought we would see more EA or Ubisoft here. We did not see those two big parties present on this. So, I thought the overall third party support was kind of mid this year. Wasn't blowing uh me away on this one. I also thought that we had a very weak Call of Duty reveal. That was a crazy way to end this showcase of like, hey, 25 years of Xbox, we got Fable, we got Gears of War, and we got one more that's been with us ride or die. And you're like, okay, Phil, what are we talking about? And then we just got a Call of Duty reveal. That was not exciting. Right. When I think Call of Duty, I want guns. I want action. I want COD. And that was not it. Uh I do want to give major shout outs to of",
            "start": 90.64
        },
        {
            "text": "we just got a Call of Duty reveal. That was not exciting. Right. When I think Call of Duty, I want guns. I want action. I want COD. And that was not it. Uh I do want to give major shout outs to of course uh Obsidian who was putting out three games this year. That should be applauded. And also Clockwork Revolution from In Exile that absolutely showed up with a mega kind of breakdown show up that I thought for sure we'd be showcasing this game for this year with the release date. Kind of tough that it's like, hey, we'll be there when we'll be there. And so this year for me is falling in the mediocre to okay range, a five to six area for putting it on the kind of funny scale. Uh like I said, first party I think Xbox has got ahead of it saying, \"Hey, we want you to love us again. We got the games.\" And for the past two years, we've seen those games, but they're not ready yet or we know they're coming. And so we kind of got to this moment of like, man, how much can we show? We're not there",
            "start": 135.28
        },
        {
            "text": "And for the past two years, we've seen those games, but they're not ready yet or we know they're coming. And so we kind of got to this moment of like, man, how much can we show? We're not there yet. And so we can show only so much. And so you got DLCs that will hold you over. When I look over, I I don't want to talk too long, but you look at the end of 2025, I don't think this will go down as like a strong end. It will be a good end because when you really look at it, we have a whole lot of games to play. You're backed up, but I don't I think it's missing one piece to be like that was a really good another year to end this off, but we have so much games. We know there's more games coming. So for me, right down the middle, mediocre to okay. Wasn't blowing away. I think next year will be better. let down on it. Uh before we get to everyone else's thoughts, I do want to say that the homies over at Activision have sent us a ton of codes for the Tony Hawks Pros Skater 3 and 4 Foundry demo",
            "start": 181.76
        },
        {
            "text": "let down on it. Uh before we get to everyone else's thoughts, I do want to say that the homies over at Activision have sent us a ton of codes for the Tony Hawks Pros Skater 3 and 4 Foundry demo that's now available on PlayStation, Xbox, and PC uh for people that pre-order the game as well as select Game Pass subscribers. But if you just want it for free, if you're not one of those people, um Roger is going to be dropping the codes in the chat uh throughout this episode of Gamescast. You need to go to tonyhawkthegame.com/preorder uh to redeem the access code. So, you get to choose what system you want the demo on. Um, so these codes, they need to be used. TonyHawk.com, tonyhockthegame.com/preorder. Go there, look at them in the chat. Bless him. Where you at with this one? Um, I will say that I was surprised and delighted um during a lot of this showcase. I would personally give it an eight out of 10. I thought it was a solid great. Um, I go through announcements that were here. Games",
            "start": 224.24
        },
        {
            "text": "I was surprised and delighted um during a lot of this showcase. I would personally give it an eight out of 10. I thought it was a solid great. Um, I go through announcements that were here. Games like Super Meat Boy 3D was a surprise that delighted me. Right. you get to clock C clockwork revolution and I'm with Mike as far as oh I thought you you would have ended this trailer with a date because this is a longass trailer where you're showing us a lot of the inner workings of the gameplay and I think my main critique with this trailer is that it was a load blown way too early like if this was the trailer you wanted to show you should have waited until the last last moment we got to follow up next year with this like you already showed way too much this is the trailer you show when the game is out this fall like this is the trailer you show but right before the game is out and so I We might have seen too much of it, but I'm not going to complain too much because every moment of this",
            "start": 267.44
        },
        {
            "text": "is out this fall like this is the trailer you show but right before the game is out and so I We might have seen too much of it, but I'm not going to complain too much because every moment of this game that we saw was pretty fantastic. Um, Ailion from Don't Nod was a surprise, right? Like I know there are plenty of people that love Don't Nod, that are Don't Nod fans, but don't Nod now means more things to more people as far as, you know, their history with games like Life is Strange, but then like now recently being doing things like Banishers and then also Justant. Uh, I'm somebody who's always, you know, on the lookout for what this studio is doing next. And this game looks really different and really cool and I like the direction of it. Mudang Two Hearts is another one that uh looks really cool, right? Giving us kind of that like third person action shooter slash undead slash, you know, stealth sci-fi thing. Like it looks like it's taking a lot of inspiration for a lot of different",
            "start": 308.08
        },
        {
            "text": "cool, right? Giving us kind of that like third person action shooter slash undead slash, you know, stealth sci-fi thing. Like it looks like it's taking a lot of inspiration for a lot of different places. But even as we were watching it, one of the things I mentioned is like it felt it feels like we're not getting a lot of games that look like this anymore as as far as like the third person campaign um like action shooter game, right? like if you're not Capcom, like you know, I feel like we're not getting as many of these. And so this looks cool. It has some Splinter Cell kind of energy to it, but then yeah, a lot of weird supernatural stuff going on. And this looked really cool. And then you get games like At Fate's End and Persona 4 Revival and Invincible Versus and Keeper. Like this showcase had a lot of announcements that really spoke to me, right? For I think for a lot of this is going to be determined down to what is your taste in video games? What are the kind of games that",
            "start": 346.48
        },
        {
            "text": "showcase had a lot of announcements that really spoke to me, right? For I think for a lot of this is going to be determined down to what is your taste in video games? What are the kind of games that you're looking forward to? And a lot of the games that showed up here are games that I look forward to. I think at the same time for me though I have questions of where was Fable, where was Perfect Dark, where was Eay, where, you know, what's going on with Forza? Are we going to see a new Forza Horizon type thing, right? It what's going on with anything Halo? You know, I I think if I'm coming into this with the mentality of somebody who's a firstparty Xbox fan, then I totally understand the disappointment as far as what are the big dogs doing? But I think overall though, I had a good time. And I think the only times where I felt any sort of bored was when they were doing what feels at this point like housekeeping. I think we have to have a discussion around the Fallout 76s and the Elder",
            "start": 383.04
        },
        {
            "text": "I think the only times where I felt any sort of bored was when they were doing what feels at this point like housekeeping. I think we have to have a discussion around the Fallout 76s and the Elder Elder Scrolls Onlines and those the Sea of Thieves the games that you know are main states because they're at every single Xbox showcase and I understand that. But those are the parts where now I'm like every time I'm like all right cool like Sea of Thieves is back. We know we're going to get an update. Like I understand why you talk about it but I get bored. Like that's the reality. bring that up cuz I think they've finally found a a better rhythm for them. They're shorter, they're in, they're out. I think back in the day, we used to clump them all together and we would really sit there blessed. So, I think you know their main stays. They're going to be there. And if you're a fan of that, you're excited, right? Because these games are getting content. They're staying in the mix. And I think",
            "start": 422.32
        },
        {
            "text": "So, I think you know their main stays. They're going to be there. And if you're a fan of that, you're excited, right? Because these games are getting content. They're staying in the mix. And I think they've done a better job of like, let's space them out. Let's get in. Let's get out. Sure. Fishing stayed its welcome. Fishing did not get in like Sea of Thieves that came in. It showed you smugglers, got you out and made a way out of its way. ESO, you probably don't even remember what ESO showed you because that's how fast it was, right? And so I think they've at least done better at how they show that is right. Yeah. And also the there's a there's a argument back and forth of which had the worst ending between this and SGF in my opinion. Right. SGF at least we got Resident Evil 9 which is exciting, but the the buildup to that was terrible. This year the Yeah. Yeah, to Mike's point of, oh, we got something, you know, that's been with us since the for for the history of Xbox and you have",
            "start": 459.36
        },
        {
            "text": "but the the buildup to that was terrible. This year the Yeah. Yeah, to Mike's point of, oh, we got something, you know, that's been with us since the for for the history of Xbox and you have a really really cool cinematic opening and it ends up being a Call of Duty. I understand Call of Duty biggest game of the year every year. The it is a fantastic cinematic, but it is a big letdown when I am looking at this trailer. I'm like, \"Oh, what is it? Is it a new Prey? Is it Perfect Dark? Is it a weird fable thing? Like, what the [ __ ] is this?\" And it turns out to be a Call of Duty Black Ops thing. I love Call of Duty Black Ops, but I don't think this is the way to show this. I think this was them showing you, hey, you should be interested in the in in our campaign. Like I think this was their attempt at saying, \"Hey, that thing you've been drinking, by the way, sugar-free, caloriefree, would you believe that?\" And you go, \"Oh [ __ ] I I didn't know. It was so delicious. I think the",
            "start": 499.52
        },
        {
            "text": "their attempt at saying, \"Hey, that thing you've been drinking, by the way, sugar-free, caloriefree, would you believe that?\" And you go, \"Oh [ __ ] I I didn't know. It was so delicious. I think the trailer looked awesome. It It looks great. And if it's anything like Black Ops 6 and how amazing that campaign was and that's such a such an underrated campaign, I think that's something that people should definitely play. And this looks like, hey, you know, it's not just bro army shooter. Look how weird this can get and how kind of supernatural and very remedy like that this can get. Uh, I thought that looked pretty great. I'm I'm with Bless. I'd give it I'd go eight, maybe 8.5. I'm I you know, it it's up there. I really think that this game this uh showcase had a lot of awesome surprises. Um, and I and some things that we did know still looked amazing. and Clockwork Revolution looked fantastic like you had mentioned uh at Fate's End was it um and the that the Mudden game of course looked",
            "start": 538.56
        },
        {
            "text": "and I and some things that we did know still looked amazing. and Clockwork Revolution looked fantastic like you had mentioned uh at Fate's End was it um and the that the Mudden game of course looked really really fantastic but there was also just a lot of you know Planet Alana 2 was such an awesome little announcement to happen there was a lot of unknowns showing up here that really looked great and I think they knocked out of the park. I I I do, you know, I won't disagree that when you say the developer that's been with us from the beginning, I'm like, \"Oh [ __ ] Halo.\" Like, \"Oh my god, that's all this can be.\" But, you know, it it it's Call of Duty and not everybody's going to love that. But, just real quick, like one thing that I think is important to note and I think it's just weird because they had the the inerson on or sorry, not in person, the on on site on camera uh bits with the the you know, with with Sarah and Matt and and Phil. All of those I feel like they didn't really",
            "start": 582.8
        },
        {
            "text": "because they had the the inerson on or sorry, not in person, the on on site on camera uh bits with the the you know, with with Sarah and Matt and and Phil. All of those I feel like they didn't really do a great job of making it clear of what exactly they were talking about. It kind of just feels like buzzwords buzzwords. But the quote here that Phil said was in 2026 Xbox will have a new fable, the next Fortza, Gears of War Eday, and the return of a classic that's been with us from the beginning. So that's not what that's not what Call of Duty is. But that was Yeah. Like have that be the setup into the next thing. Yeah. Sarah Bond talking about Silkong a whole bunch and then us being like wait did you know does she mean later this year that the game is also coming that year? I think the the ROG Ally Series X or whatever they're calling it got me really pumped up. This episode's brought to you by XRE. Y'all know that a few months ago my life changed forever when I brought a pair of XR1",
            "start": 627.12
        },
        {
            "text": "ROG Ally Series X or whatever they're calling it got me really pumped up. This episode's brought to you by XRE. Y'all know that a few months ago my life changed forever when I brought a pair of XR1 AR glasses on a long flight to New York. I legit could not believe how easy it is to use and high quality my experience was playing games, watching movies, TV shows on the plane without just too much extra stuff around me or especially not a giant goofy headset around my head. No joke, this is my favorite new tech product in years and it has earned a permanent spot in my travel bag. It is only hard to believe that it works as well as I'm saying until you try XR1 AR glasses for yourself and then you will see that the future is now. The tech is here. Connect XR1 glasses to wherever you are playing. Whether it's a handheld console, a PC, phone, home console. You just get a massive 150in virtual screen anywhere, anytime for any game. Gaming on the go like a long haul flight? You need the XR1.",
            "start": 670.96
        },
        {
            "text": "Whether it's a handheld console, a PC, phone, home console. You just get a massive 150in virtual screen anywhere, anytime for any game. Gaming on the go like a long haul flight? You need the XR1. Next, starting to hurt from staring down at your handheld? We've all been there. You need an XR1. A screen as big as your wall. Instant plugandplay with all of your devices via USBC. Built-in audio with sound by Bose anchoring your screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full HD. These are what make XR1 a musthave. And we hear XR1 Pro is coming soon with an even bigger virtual screen. Hit our link below to get your XR glasses today. There's nothing better than when a sponsor of Kind of Funny is something that we are legitimately obsessed with, and that is exactly the case here with XRE. You're going to hear me talking about these forever. Go to kind offunny.com/xreal. That's kind of funny.com/xr. I promise you, you are going to love these things. This",
            "start": 720.64
        },
        {
            "text": "exactly the case here with XRE. You're going to hear me talking about these forever. Go to kind offunny.com/xreal. That's kind of funny.com/xr. I promise you, you are going to love these things. This episode's brought to you by Factor. Summergamefest is here. The Switch 2 is here. The sun is here. So many summer things are here. And the number one thing you don't want to be doing all summer, spending hours cooking inside. That's where Factor comes in. Factor chef crafted dietitian approved meals are ready in just 2 minutes. taking the hassle out of eating well. We love Factor here at Kind of Funny and Greg's often making and enjoying meals quick in between shows here in the studio. I just had a roasted garlic chicken and I'm telling you, you would have loved it. Factor meals arrive fresh and ready to eat, perfect for any active lifestyle over summer and beyond. With 45 weekly menu options, you can pick gourmet meals that fit your summer gains and goals. Choose from options like",
            "start": 770.32
        },
        {
            "text": "fresh and ready to eat, perfect for any active lifestyle over summer and beyond. With 45 weekly menu options, you can pick gourmet meals that fit your summer gains and goals. Choose from options like calorie smart, protein plus, keto, and more. Get started at factormeals.com/kindfunny5050 off and use code kind of funny50 off to get 50% off plus free shipping on your first box. That's kind of funny 50 off at factormeals.com/kindfunn 50 off for 50% off plus free shipping. factomeals.com/kindfunn 50 off. Yeah, as somebody who is, you know, owning a Steam Deck and I still love the damn thing, but I would love more power at this point. And when early on when we're hearing about this Xbox handheld, I go, \"No, that sounds like an absolute no for me cuz I don't want to just use the Xbox launcher. The fact that this is going to be this Windows mobile thing including every launcher that you could want and it doesn't just look like a Windows desktop, you know.\" Did they name Epic? Huh? Did they",
            "start": 813.76
        },
        {
            "text": "The fact that this is going to be this Windows mobile thing including every launcher that you could want and it doesn't just look like a Windows desktop, you know.\" Did they name Epic? Huh? Did they name Epic? I don't know. I didn't I didn't think they did. They said I mean like the fact that they said Ubisoft, Steam, and everything. Okay, Epic is missing. I mean, I don't Epic is missing. I feel like that is something that could easily be done wi with this sort of launch. I I either way I'm like, \"Oh, this really really turned around my hype levels for what this handheld is because I'm always caught in between that weird area of like my Steam Deck has all of my my Steam games.\" And yes, I can easily put a Ubisoft loader like I tried doing with Prince Persia Lost Crown before they eventually went to Steam or I could get the Epic Store on there going through the desktop mode or whatever. It's annoying to do that [ __ ] Like I like I love tinkering with [ __ ] I don't love doing that",
            "start": 864.88
        },
        {
            "text": "went to Steam or I could get the Epic Store on there going through the desktop mode or whatever. It's annoying to do that [ __ ] Like I like I love tinkering with [ __ ] I don't love doing that level of tinkering when it's like I have to plug this into the HDMI to like type on the screen. It's just it's annoying, right? This seems like this could be the solution. And immediately turned around how hyped I was. And I think it looks awesome and the UI looks really sick. I imagine the other launchers are going to work just through Windows, right? So like Epic should work. Yeah. Well, and that's kind of what I'm assuming is like I'm sure there will be a solution there. Maybe it's just Epic didn't agree to the marketing or the mentioning or whatever. You know, I also I also want to go back to the Call of Duty thing cuz I totally agree with you as far as getting people in and being like, \"Oh, this looks cool. Oh, this is Call of Duty.\" I think my main critique now I think about it is the",
            "start": 914.16
        },
        {
            "text": "the Call of Duty thing cuz I totally agree with you as far as getting people in and being like, \"Oh, this looks cool. Oh, this is Call of Duty.\" I think my main critique now I think about it is the fact that it closed the show. I would have had this be I don't open the show or open this would have been a sick show opener. I think it being the show closer kind of sets expectations. Yeah. Well said. Double finds game looked awesome. Yeah. Yeah. Tim, what' you think? Yeah, this one uh I I feel like caveing this with uh last year, I'm pretty sure I gave the Xbox showcase a 10 because I think that that was a a masterpiece of a showcase. Um and I feel like with that context, I put a 7.5 on this. I think it's between good and great. I can see an argument for saying it's great, but personally, like I'm not that interested in most of these games. So, um I'm I'm sticking with my 7.5 there. Game Freak's game, baby. I mean, absolutely wild, right? Yeah. Looking through here, a lot of really",
            "start": 954.24
        },
        {
            "text": "like I'm not that interested in most of these games. So, um I'm I'm sticking with my 7.5 there. Game Freak's game, baby. I mean, absolutely wild, right? Yeah. Looking through here, a lot of really quality stuff. I think overall that was a great presentation. It was well paced. Like we moved pretty quickly through things and there was a lot of like oh oh moments through that which was cool. Um I do think that some of the on camera stuff actually probably all of it was not right. Like they it was a little bit like what are you telling me right now? Like Matt Booty or whoever it was I think I think it was Matt in the center of it talking about Game Pass and stuff. It's like what? Like we know. And I get that you're going to remind people, but I feel like we're still a little bit there's just too many brands. There's too many things to keep track of when it comes to the this is an Xbox and Xbox Game Pass and the cloud and all that stuff. And it makes sense and it works, but I feel like",
            "start": 991.6
        },
        {
            "text": "too many brands. There's too many things to keep track of when it comes to the this is an Xbox and Xbox Game Pass and the cloud and all that stuff. And it makes sense and it works, but I feel like we're still not quite there of I understand what that means, you know? Um not just me, but I feel like normal people watching the stuff that if they're going to talk that way, it's for them. Um but a lot of pretty big surprises. Did not expect to see Final Fantasy. I really thought that if we ever did it would be a Game Pass deal and it's not these. It's not Game Pass. It is coming to Xbox. You have to buy it. Um and Xbox 16 or sorry, Final Fantasy 16 Complete Edition coming out today. That's awesome. I want to see that game find as much success as it possibly can. Um the Tony Hawk stuff obviously I'm going to pop off for the secret characters and the the three new levels look awesome. Um Ninja Giden getting a date. It looks great. It's like there is a lot of stuff here that is cool, but to",
            "start": 1034.56
        },
        {
            "text": "I'm going to pop off for the secret characters and the the three new levels look awesome. Um Ninja Giden getting a date. It looks great. It's like there is a lot of stuff here that is cool, but to me, Super Meat Boy 3D, that's the one that I'm like the big surprise and delight of like, oh yeah, never would have saw that coming and I'm stoked for it. Um, and I am very excited that they did talk a little bit about the Xbox OS and that they're taking that stuff seriously because I think that that is very very important for um the strategy of Xbox to be successful. And I think that it's proving to be successful. This was a very very very good show of just showing that they have a ton of games, a ton of great partners when it comes to Persona and Final Fantasy. Um, ending on Black Ops. Again, I think it's the placement more than anything that's the problem there. That is interesting. I do think it's cool that the big budget AAA uh shooting games are still having campaigns cuz that wasn't",
            "start": 1076.32
        },
        {
            "text": "I think it's the placement more than anything that's the problem there. That is interesting. I do think it's cool that the big budget AAA uh shooting games are still having campaigns cuz that wasn't always the thing. And um the campaign last year was awesome. So, if they can focus more on that stuff and actually like tell people, hey, we we're taking this stuff seriously and so should you, I think that's cool. But not as a show closer for an Xbox showcase when we have so many cool games to talk about. Um, I do think they're definitely teeing up for an amazing 2026 after an amazing 2025. I'm not taking away from where they're at here. Um, but yeah, them hyping everything up for next year. I think it's going to be a banger showcase next year. It's really interesting to me. Uh, I know we're all giving our quick thoughts and we're trying to keep it short, but you guys not really mentioning many first party titles, right? Bless highlighted clockwork and I know Andy likes that. We're",
            "start": 1119.6
        },
        {
            "text": "we're all giving our quick thoughts and we're trying to keep it short, but you guys not really mentioning many first party titles, right? Bless highlighted clockwork and I know Andy likes that. We're keeping it short, but like all of you are highlighting third party games here and it's like that's where I'm coming from. Like feels like we missed on that front for an Xbox showcase. Yeah. Well, it depends on them not, you know, if the games aren't ready. I think EDAY I'm more and more thinking that Eay will be a game that they shut off that initial teaser and we won't see that for a couple years. Like I'm getting I'm closer and closer to that sort of line of thinking in a similar vein to where you get a little tease of Wolverine and Wolverine's been gone for a long time. Um, and I'm also kind of used to this sort of showcase for the last couple years of the first parties just aren't, you know, they're they're cooking elsewhere and we'll let them cook for a while. But, you know, I I'm",
            "start": 1158.96
        },
        {
            "text": "kind of used to this sort of showcase for the last couple years of the first parties just aren't, you know, they're they're cooking elsewhere and we'll let them cook for a while. But, you know, I I'm not basing this on where are the Xbox first party games. I'm still just basing this on are they showing cool [ __ ] or not, you know? I think my thing is I I came into this not really having the big expectation for all right, what are the the surprises that we don't know about? I feel like there's I feel like there's a good majority of Xbox studios that are working on games that we already like know what they are. And then the ones that we don't know of, they just released games. Like I don't I don't know what could have been here aside from an Ever Wild or like if Rare decided to scrap Ever Wild and they were doing something new that could have shown up as an Xbox first party thing that I would have wanted to know about. And then as far as the things that we do know, I am like where are",
            "start": 1200.76
        },
        {
            "text": "Wild and they were doing something new that could have shown up as an Xbox first party thing that I would have wanted to know about. And then as far as the things that we do know, I am like where are those things? But at the same time, going back to the predictions that we did last week for Xbox, my big the theme of my predictions was that Xbox was going to have a banger 2026, I'm coming out of this showcase being like, \"Yeah, Xbox is going to have a banger 2026, right?\" Like, when I'm thinking about 2025 for Xbox, I'm like, \"Man, this this is Obsidian. Like, this is Obsidian's year.\" Like, this isn't Xbox. This is Obsidian. And then also, of course, Doom and Southern Midnight and stuff we've gotten, right? But like, you know, I feel like we are I feel like right now Xbox is loading up. I don't want to compare it to the Dominoes cuz I'm tired of the dominoes. the dominoes on the table. I mean, they're [ __ ] going like like they're it's been done at this point. Like now it's just like",
            "start": 1244.4
        },
        {
            "text": "don't want to compare it to the Dominoes cuz I'm tired of the dominoes. the dominoes on the table. I mean, they're [ __ ] going like like they're it's been done at this point. Like now it's just like the next wave of banger games. But yeah, 2026 feels like I guess a landmark for where we're at with the dominoes falling. Yeah. I mean, I got to bring up one thing that I don't think we've said so far on this show. No State of Decay. Yeah, that was surprising. That's a really crazy. It was odd that it was shown last year after what we knew about the studio and what was going on inside of the wall. So, it was like, okay, that's interesting. I mean, you could go down the list, Tim. Where's Contraband? We talked about that partnership with Avalanche. State of the decay is one of those. Of course, you look at uh I mean, Perfect Dark. Why do we keep showing Perfect Dark? Why did we show gameplay last year if we're not going to be getting into it? And it feels like like Blessing's saying, we've",
            "start": 1278.8
        },
        {
            "text": "you look at uh I mean, Perfect Dark. Why do we keep showing Perfect Dark? Why did we show gameplay last year if we're not going to be getting into it? And it feels like like Blessing's saying, we've shown you these, we're loading them up for a big 2026, 2027. Are we holding things back for a Gamescom or a Game Awards? And then of course we know they kick off the year with ID at Xbox the IND whatever the the developer direct. There's like they already have a lot of announcement moments here and it feels like now we're kind of spreading them out and maybe that's where we see some more. I think we'll see Fable at the Game Awards. I think we'll see something big for Fable at the Game Awards. I mean Crow in chat says where is OD? That's another one. It's interesting that he doesn't bring that up at all. He has been on stage. He has talked now and it's like, \"Oh, we're talking about this. We're talking about the next cool Metal Gear S game, but where's we're not speaking about OD?\" It's an",
            "start": 1317.92
        },
        {
            "text": "up at all. He has been on stage. He has talked now and it's like, \"Oh, we're talking about this. We're talking about the next cool Metal Gear S game, but where's we're not speaking about OD?\" It's an odd one, man. I'm telling you, it's Death Stranding 2 marketing and and the Fizzen announcement. That's a separate thing that's announcing a many years down the line ending a state of play. Like, we'll get OD. I think OD is going to be a very small project that there's just going to drop. I imagine that maybe I'm wrong about this, but I see that as like a 10-hour thing at max. Wow. But but yeah, I agree with post death training too. I think that's when you start to actually talk about it more. Uh, a couple super chats that I wanted to get to here. The House has spoken says, \"Could have been a nine out of 10 show, but ending with Call of Duty is total whiff for me. Eight out of 10.\" Uh, Bobby Joe says, \"Where's Fable?\" I feel like we didn't expect Fable to be here. The vibe of this office",
            "start": 1361.84
        },
        {
            "text": "nine out of 10 show, but ending with Call of Duty is total whiff for me. Eight out of 10.\" Uh, Bobby Joe says, \"Where's Fable?\" I feel like we didn't expect Fable to be here. The vibe of this office at least. Like I think that it not being here not a surprise to me because I I do feel like that's a later down the line thing. Uh, Matt Sanders says, \"I'm so sad we didn't get to see Silk Song. I just want the constant demand to end. Um, yeah, it's we saw we saw Yeah, we we did. It's just like it's that weird thing coming out the same day as the Xbox Ally X, right? Okay. What was that phrasing? Yeah, let's talk about this playable day one when the Xbox when it releases on the Xbox all is how I took this later this year. Cuz I took it I took it as it was gonna be a launch. I know it was a very weird that another one of those like Tim said, it's like you're not making this very clear. We got to rewrite this and figure this out because Yeah. You walk away going, \"Okay, well, she said day",
            "start": 1401.84
        },
        {
            "text": "weird that another one of those like Tim said, it's like you're not making this very clear. We got to rewrite this and figure this out because Yeah. You walk away going, \"Okay, well, she said day one.\" She meant day one when the game releases, it will be on that. We got to get the people who are on like the writing team for the like out of out of world out of world showcase. Um out of words. Out of words. Uh we got to get the people who write that to like write the base Xbox show. Back.",
            "start": 1444.8
        }
    ]
}