{
    "id": 14208,
    "video_id": "sm9a__rOvAI",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Blessing Adeoye Jr."
    ],
    "title": "All of The Nintendo Switch 2 Launch News! - Kinda Funny Games Daily 06.05.25",
    "description": "Go to http://kindafunny.com/XREAL to grab yours now!\n\nWe’re here to talk about video game news!\n\nToday after, KFGD, you’ll get:\nMore Switch 2 gameplay!\nGAMESCAST - Nintendo Switch 2 First Impressions\nAfter Gamescast is More Switch 2!\nIf you’re a Kinda Funny Member:\nToday’s Gregway is . . . TIM!\nThank you to our Patreon Producers:\nKarl Jacobs\nOmegaBuster & Delaney Twining\n\n00:00:00 - Start\n00:07:50 - Housekeeping\nThe Roper Report   -\n00:10:06 - My Switch 2 came with…snacks?! - Jazz Stewart @ Polygon\n00:21:55 - GameStop Nintendo Switch 2 customers hit with punctured screens after store employees staple receipts to the box - Aaron Klotz @ Toms Hardware\n00:39:05 - Ad  \n00:38:15 - Xenoblade studio reveals it co-developed Switch 2’s big launch game - Andy Robinson @ VGC\n00:41:20 - Nintendo Fans Surprised to Find Switch 2 Edition Game Cartridges Also Work on Switch 1 - Tom Philips @ IGN\n00:48:30 - Say goodbye to streaming apps on the Switch 2 - Simone De Rochefort @ Polygon\n00:54:00 - Mii characters are now genderless on Nintendo Switch 2 - Marc Griffin @ Polygon\n00:58:00 - Lucy James is co-hosting Summer Game Fest - Geoff on Twitter\n01:00:00 - Wee News!\n01:01:10 - SuperChats & You‘re Wrong\n\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1749148800,
    "duration": 4695,
    "transcript_chunks": [
        {
            "text": "[Music] two. It's a lot of Switch too. Bless. We'll have all that and more. Actually, just that cuz this is kind of funny games daily. [Music] What's up and welcome to Kind of Funny Games Daily for Thursday, June 5th, 2025, the official launch day of the Nintendo Switch 2. Of course, I'm your host, Tim Gettys. I'm joined today by Blessing Aoya Jr. Uh, I grew up with the PlayStation 2 version of Soulcalibur 2, and so I had [ __ ] ass Hayachi as my special character for the game. And so to now be playing the GameCube version of Soulcalibur 2 and be playing with Link and everything is right. Everything is right. God, what a time to be alive. F-Zero GX is playable officially from Nintendo in 2025. It feels good. It feels real good. Feels real fast. I love it. Everybody, you're probably wondering, why are we at a different set right now? We're sitting on chairs instead of sitting at a desk. It's because it's the Switch 2 launch day. We're about to have a fun party stream after this of all",
            "start": 0.79
        },
        {
            "text": "why are we at a different set right now? We're sitting on chairs instead of sitting at a desk. It's because it's the Switch 2 launch day. We're about to have a fun party stream after this of all of us playing the Switch 2, just like we did all night long last night. We went live around 7:30 and uh we're still live. We never stopped being live. Roger and Joey stayed literally the entire night. Uh Fran came through for a for many hours. Um Nick was there, me and Bless were there for a while. Greg was there, Andy. It was just like a a menagerie fun little party of people. What What do you want to say about last night? I mean, honestly, I'm sad that I couldn't stay longer. It was such an active day. It was such a busy day. And so, like to start it off with getting the Switch Twos in the office and then rolling that into I mean, y'all talking about Ballerina and then the State of Play, right, which was really big. And then, you know, I had volleyball I had to go to, you know what I mean?",
            "start": 62.64
        },
        {
            "text": "and then rolling that into I mean, y'all talking about Ballerina and then the State of Play, right, which was really big. And then, you know, I had volleyball I had to go to, you know what I mean? Then coming back and, you know, playing the Switch 2 and Mario Kart. Um, I don't know. It was just such a good time, such a busy day. But yeah, I like I felt like I I felt lame because I pieced out at what, like 11 11:30. I don't know, man. I wish I could have stayed later. I ended up leaving at at uh midnight with Greg and I didn't want to. It was like such middle school sleepover vibes. And I haven't felt that in a long time. Like that type of experience. And it you can only get it when there's something fresh and new and there's an excitement in the air that everyone's like equally excited about. you know, a new console, Mario Kart, just boopping around, trying different things, friends complaining about how many frames per second it is. It was just like a magic to everything. So, um,",
            "start": 104.08
        },
        {
            "text": "about. you know, a new console, Mario Kart, just boopping around, trying different things, friends complaining about how many frames per second it is. It was just like a magic to everything. So, um, anyways, great time and we're going to keep those great times going because, uh, it's just starting now. Today, we're going to be streaming all day, uh, Mario Kart and all the other stuff, too, I'm sure. Uh, and then tomorrow is Summer GameFest. Oh my god, I forgot. Summer Gamefest itself. Another thing for us to react to. And then, uh, Saturday, we're taking off, which really just means playing Mario Kart at home. Yeah. Yeah, finally get around to Delta Rune and then Exactly. And then Sunday, uh, we'll be back here in the studio at the desk reacting to the Xbox showcase, which I am very excited for. Would you say you're more excited for Summer GameFest or Xbox showcase? Oo, I would say equal. I'm equally excited. Yeah, I think I would say I'm pretty excited for both. I think mainly",
            "start": 143.36
        },
        {
            "text": "excited for. Would you say you're more excited for Summer GameFest or Xbox showcase? Oo, I would say equal. I'm equally excited. Yeah, I think I would say I'm pretty excited for both. I think mainly because I don't know what to expect for either. I know Xbox is a bit easier because you kind of know that you're you have the expectations of might we might see Perfect Dark, we might see Clockwork Revolution, we know we're going to see Outer Worlds 2. You know what? I'll say Xbox cuz Outer Worlds 2 specifically. I cannot wait to see more of that. I love the first Outer Worlds and so I'm really excited to see what they have for the second one. Yeah, I'm leaning towards uh Xbox as well. I I feel like just because they've really knocked it out of the park the last couple uh years with this one. And I feel like we're at a place now that they have a lot uh even more than they had last year uh in terms of teams and things that they could announce. So I feel like there's uh a very high chance of",
            "start": 183.28
        },
        {
            "text": "I feel like we're at a place now that they have a lot uh even more than they had last year uh in terms of teams and things that they could announce. So I feel like there's uh a very high chance of it being entertaining and filled with at least a couple things that make me go, \"Oh, I'm stoked about this.\" Yes, I'm excited to play this on all platforms. Maybe the cloud. Um I was trying to segue from speaking of clouds. doesn't fully work, but cuz you got your head in the clouds. Speaking of I got my head in my cloud for for years. I had my head in the clouds dreaming, thinking about what Pokemon Scarlet and Violet Running right would look like. Yeah. And it was hard to fathom allegedly. You know what I mean? Uh but now it's not. Kevin, can you bring up the the link that I I sent? Um this is one of the greatest before already before the video even plays. I can see like a the smoother textures in the Switch 2 version. This is insane, by the way. Yeah, the windmills were the biggest",
            "start": 220.32
        },
        {
            "text": "is one of the greatest before already before the video even plays. I can see like a the smoother textures in the Switch 2 version. This is insane, by the way. Yeah, the windmills were the biggest problem in Pokemon Scarlet and Violet. And for some reason, there's more windmills in Scarlet and Violet than any other Pokemon game in history. Uh, that was a design they wanted to challenge themselves. Yeah. But what I love about this is like you look at the bottom left, you see that windmill turning that turbine. For audio listeners, like we're looking at a sidebyside of the Switch One and Switch two versions of Scarlet or Violet. Uh, and yeah, we're looking at the windmills and the Switch One windmill. the rotation on the on the fans propellers, they are in stop motion essentially, right? Because of how bad the frame rate is in that game. And in the Switch 2 version, it is so smooth. I mean, here's the thing. Like, you'll look at this and your eyes are drawn to the the windmill closest to",
            "start": 265.0
        },
        {
            "text": "of how bad the frame rate is in that game. And in the Switch 2 version, it is so smooth. I mean, here's the thing. Like, you'll look at this and your eyes are drawn to the the windmill closest to us on the bottom left that on the Switch two is is running right on the Switch one janky as all hell. But you get distracted by that and then you start looking at the other windmills. Yes. Can we just like appreciate windmill number four? Windmill on the top. Yeah, windmill number four is trying its best. Like that is one frame per second. Yeah. Like two frames at max max per second. Yeah. You you guys are better at looking at rates. Are the windmills at the bottom all moving at the same rate? Can you full screen? Yes. I don't I don't I don't know if we'll be able to tell honestly. Well, I mean, wind in the back, honestly, windmill in the back is better than the Switch One's first windmill on the front. Like, to really drive this home, I think this is [ __ ] up. Mhm. They are messing with",
            "start": 306.56
        },
        {
            "text": "wind in the back, honestly, windmill in the back is better than the Switch One's first windmill on the front. Like, to really drive this home, I think this is [ __ ] up. Mhm. They are messing with what Scarlet and Violet is at its core. This is not Scarlet and Violet. This ain't the Scarlet and Violet that I know. The game should not run this smooth. Yeah. People shouldn't be able to do this. No, it's not fair. We had to play it the other way. I had to play it the tr it truest form. Jesus. Oh, everyone remember this is kind of funny games daily. Each and every weekday we run you through the video game news that you need to know about live on YouTube, Twitch, and podcast services around the globe. I like that we have this nice little windmill music. Yeah, I was about to cut it off for a little while. If you love what we do, support us with the kind of funny membership on Patreon, YouTube, and now Spotify and Apple podcast to get all of our shows ad free and a daily exclusive Gregway.",
            "start": 354.96
        },
        {
            "text": "while. If you love what we do, support us with the kind of funny membership on Patreon, YouTube, and now Spotify and Apple podcast to get all of our shows ad free and a daily exclusive Gregway. for a chance to be part of this show though. Submit your thoughts and opinions as YouTube super chats as we go. Just like Bob Shiggity already did, saying, \"Are you guys getting Magic the Gathering Final Fantasy pre-release tomorrow?\" I don't know what the plan is. I didn't get a pre-order cuz they're so expensive. And I'm trying to I'm waiting to see if we if anything comes in the mail to see what's up. Did you pre-order? I pre-ordered something a while back. I don't remember what it was, but I got some set of cards. I just don't understand magic, so I'm not sure what I did. At the very least on Saturday, I got plans to go to a Magic event and I'm gonna play some Magic Final Fantasy set with people. I love that. So, I will have my hands. I think that that's so cool that you do that. Oh,",
            "start": 398.32
        },
        {
            "text": "on Saturday, I got plans to go to a Magic event and I'm gonna play some Magic Final Fantasy set with people. I love that. So, I will have my hands. I think that that's so cool that you do that. Oh, really? Legitimately. Thank you. I appreciate it. I think that's like such a like putting yourself out there like having fun, meeting people, playing games, trying new stuff. Couldn't be me. My weeks nowadays, my weeks are I go I play volleyball on one day of the week and another day of the week I go and I play cards with strangers. It has changed my life. I feel like such a better man. Hell yeah, dude. That's awesome. Uh, a little housekeeping for you. We're an 11 person business all about live talk shows like the one we're doing right now. After this, we're going to be playing a lot more Switch 2. And then at some point today, we're going to do a Games Cast. That's our Nintendo Switch 2 first impressions. Uh, we want to get uh more people a little bit more time uh with different things,",
            "start": 434.0
        },
        {
            "text": "2. And then at some point today, we're going to do a Games Cast. That's our Nintendo Switch 2 first impressions. Uh, we want to get uh more people a little bit more time uh with different things, whether they're just playing in the office area or on stream uh for us to be able to give our thoughts on our first day with the Switch 2. Uh then if you're a kind of funny member, today's Greg way. We don't know what it's gonna be, but it's gonna be me. That's strike three for Greg, by the way. It's me. This one's me. Oh, it's you. This one's me. Okay. I don't count when it's other people. Yeah. Yeah. Wasn't it strike three yesterday or two days ago? Uh no, he got it in on time. Or he didn't write the time, like the amount of how long the Gregway was, but he did write the topic, which is good enough for me. Interesting. I just want to get there without having to read the X's. I don't like X's. I don't like X's. Yeah. especially Seven Evil Ones. True. Thank you to our Patreon producers Carl",
            "start": 471.12
        },
        {
            "text": "for me. Interesting. I just want to get there without having to read the X's. I don't like X's. I don't like X's. Yeah. especially Seven Evil Ones. True. Thank you to our Patreon producers Carl Jacobs of Mega Buster and Delaney Twining. Today we are brought to you by XR Real, but we'll tell you all about that later. I'm really excited. I'm going to try my XR with the Switch 2 later today. Oh, I I'm not confident it's going to work. So, you're going to put on the glasses and see your Switch 2 screen? Unfortunately, because I have Nintendo work though, the XR anything that has the uh USB video out. Yeah, it works. Okay. Switch doesn't cuz they're [ __ ] and you need to dock it. Remember that whole thing where you the dock to the HDMI? So, you instead need to have a little dongle that you can power and then a second USBC going out. So, I'm going to test. We'll see. I'll keep you all updated. Maybe I'll do it on stream. Maybe I'll have I'll play Mario Kart against you. You playing on the",
            "start": 511.28
        },
        {
            "text": "power and then a second USBC going out. So, I'm going to test. We'll see. I'll keep you all updated. Maybe I'll do it on stream. Maybe I'll have I'll play Mario Kart against you. You playing on the TV and you're playing with the glasses in augmented reality. No one will make fun of me. Why don't you just plug in the HDMI to type C in the back of the Switch? Yeah, we could do that. Okay, but then I'm tethered to the world. Wait, aren't you mobile regardless? Mobile. Okay, get this man on the road. Mobile. Uh, for now, let's begin with what is and forever will be the Roper Report. It's time for some news. We have eight stories today. Story number one, what a headline. My Switch 2 came with dot dot dot snacks. What a day. This comes from Jazz Stewart at Polygon. Upon receiving my Nintendo Switch 2 and Switch 2 Pro controller delivery on this cold, wet June launch day morning, I was blessed to find a gift from Sam Walton himself. Okay, maybe not Sam, who's been a ghost since 1992. While I",
            "start": 553.68
        },
        {
            "text": "2 and Switch 2 Pro controller delivery on this cold, wet June launch day morning, I was blessed to find a gift from Sam Walton himself. Okay, maybe not Sam, who's been a ghost since 1992. While I expected to open my package to reveal Nintendo's hot new console, lo and behold, nestled in the reusable bags placed on my front porch were two cans of pizza flavored Pringles and two bottles of Coke to wash it all down. I've witnessed many console launches in my day, but I've never been gifted snacks to power my initial gaming session with a brand new console. Now, Bless. Yeah. Did you prepped the show today? Yeah. You're the one that came up with the new stories. Yeah. You're the one that decided this is story number one. Yeah. All right. Yeah. All right. Yeah. Switch 2 gamers have flooded the internet with details on their Nintendo Switch 2 halls. While some brag about claiming their new console at midnight or being able to find one without a pre-order, others brag about the flavor of",
            "start": 610.56
        },
        {
            "text": "the internet with details on their Nintendo Switch 2 halls. While some brag about claiming their new console at midnight or being able to find one without a pre-order, others brag about the flavor of Pringles they received from Walmart. Some unlucky individuals didn't receive the snack care package, while others received the snacks with other miscellaneous bonus goodies, including wet wipes, Tide samples, and band-aids. Apparently, Walmart knows just how messy a good gaming session can get. Reception has ranged from confusion to appreciation, with some believing this is some ploy to save face after Walmart started cancing pre-orders a few days before the Switch 2's release. No matter where you landed in the discussion, this bizarre pre-order bonus will be remembered when we look back on the Nintendo Switch 2's launch. What's going on, Tim? I don't know, but last night me, Kevin, and Greg were at the Nintendo store for the the launch party event for Nintendo Switch 2, and Greg Miller",
            "start": 650.72
        },
        {
            "text": "the Nintendo Switch 2's launch. What's going on, Tim? I don't know, but last night me, Kevin, and Greg were at the Nintendo store for the the launch party event for Nintendo Switch 2, and Greg Miller did one of the most or asked me one of the most bizarre questions. [ __ ] it, why? No, this can't be. No way. [ __ ] It really is. What the [ __ ] man? I'm talking [ __ ] about him. Why? What could he possibly have to say? We have prles to talk about on this gaming news show. We had to talk about these wet wipes that are going out with people. Want to be just like screaming falling down. You still champion the time. Kind of funny. Game showdown. Season three champion. Oh [ __ ] [Music] Move my hand over here. Frankly, boys, it's a little bit insulting. Yeah. that on a day this big, you would make this story number one. All right. Sure. It's Switch Two launch day, but as you might remember, Timothy, yeah, me and this championship run. Mhm. We're intertwined with the Switch Two. All right.",
            "start": 687.28
        },
        {
            "text": "make this story number one. All right. Sure. It's Switch Two launch day, but as you might remember, Timothy, yeah, me and this championship run. Mhm. We're intertwined with the Switch Two. All right. Run. What happened when they announced the switch, too? I I don't I said I would cash in stars in the bank and you ran away like a coward. Yeah, that's that's true. That was a [ __ ] move on your part. All right. So, what I did is tried to make it right, Tim. I told everyone near and far that I would confirm the parade details. [Music] that I would confirm the parade details. That's right, San Francisco. We're bringing the kind of funny championship parade to you. What day is it going to be? Saturday. Before I get to that, what I need you all to know is that this is a championship parade for me. Thank you, Barrett. Greg Miller, your season 3 champion. All right. And I know a lot of you are saying, \"Maybe I don't want to go to San Francisco on a Saturday.\" That's fine. Right now, go to",
            "start": 754.76
        },
        {
            "text": "me. Thank you, Barrett. Greg Miller, your season 3 champion. All right. And I know a lot of you are saying, \"Maybe I don't want to go to San Francisco on a Saturday.\" That's fine. Right now, go to kind offunny.com/store. Kevin, show kind offunny.com/store right now, please. I appreciate the smoke. I see everyone else in here annoyed by it. Not me. We have not one but two championship shirts for you. Jesus. Oh my [ __ ] There's the kind of funny game showdown team blue championship. Three Pete. Of course, we're the three Pete. There it is. You see it right there. Threetime champion. That's what you're looking for right now. Of course, if you are one of the people who thinks I'm the most handsome champion there's ever been on Game Showdown, we appreciate that. And there's a shirt for that, too. Oh my god. There's the Team Blue shirt right there. All right. Team Blue shirt. These are what you need right now. Roberto Super Chats, what's the name of Greg's walkout music? That is Element8s",
            "start": 823.12
        },
        {
            "text": "too. Oh my god. There's the Team Blue shirt right there. All right. Team Blue shirt. These are what you need right now. Roberto Super Chats, what's the name of Greg's walkout music? That is Element8s ego, everybody. Love that song. Great song. These shirts are up right now. And what I'm going to need you all to do is realize you already spent all mom's money on the Nintendo Switch. And you need to buy both of these shirts and bring them to San Francisco on Saturday, June 28th. Saturday, June 28th is Greg Miller's Championship Parade, everybody. Well, I can't be there. Oh, that's a shame. It's Pokemon Go Fest. Oh, that's a shame. Well, you see what's funny about the Greg Miller Championship Parade is that it's going to be down on the Embaradero. No. As part as part of Pokemon Go Fest. See, Tim, no. See, Tim, I know I know how much you love to me. You love Pokémon Go and you love walking the Embaradere with your little friend Andy Gold Farm. Well, I thought I would bring the parade to",
            "start": 863.44
        },
        {
            "text": "Tim, no. See, Tim, I know I know how much you love to me. You love Pokémon Go and you love walking the Embaradere with your little friend Andy Gold Farm. Well, I thought I would bring the parade to you. So, you don't have to choose. You don't have to choose what you do. You can come be part of the parade with hundreds, if not thousands of kind of funny best friends in my team blue shirt as we walk the Embaradero. Yeah. We didn't get We didn't get in. This isn't like a legal parade. We're not taking over the street. We'll walk on the sidewalks and be respectful. We'll play Pokémon Go with you. You can have fun. You will lift me up. You will carry me. We will walk the Embaradero and end outside of SPG. That's Square Pie, guys, on their little grassy area. Oh my god. Can we get Hunter Pence to come give a speech? Can we get the mayor to come give a speech? Oh man. I have a call with Nantic today to see if they'll give me a special Pokémon Go thing. No. I want everyone to know, if you",
            "start": 910.32
        },
        {
            "text": "to come give a speech? Can we get the mayor to come give a speech? Oh man. I have a call with Nantic today to see if they'll give me a special Pokémon Go thing. No. I want everyone to know, if you have been watching the show for the last couple years, I've been on my journey to level 50, the final level in. And if if things keep going the way that they have been the last couple days, I should hit level 50 on Saturday, June 29th. Oh, that's a shame. Oh, that's a shame. Oh, I can't believe this just lined up this way. Mhm. I can't believe Joey didn't help me and tell me things you told her. Saturday, June 28th, Greg Miller Championship Parade. Probably around 11 am. We'll figure out the details on where we're meeting, but right now, just buy the shirt. All right. I earned it. You earned it. I earned it. All right. Thank you. Have a great show. Thank you. I do like this as a test of whether or not people will wear Greg Miller on their chest. Yeah. You know, it's a test that I think",
            "start": 954.8
        },
        {
            "text": "it. I earned it. All right. Thank you. Have a great show. Thank you. I do like this as a test of whether or not people will wear Greg Miller on their chest. Yeah. You know, it's a test that I think historically they don't historically those shirts don't sell well, but they were drawings before, not championship shirts. Oh god. Are you really talking to Niantic? Yeah. Cuz I guess there's some other Pokemon Go thing happening today. There's always Pokemon. They were like, \"Well, I'm\" He's like, \"I'm I'm out of town at this Pokemon Go thing.\" Oh, yeah. The Go Fest Go Fest. Yeah, cuz Go Fest is like a monthlong thing, but then this Go Fest Global. That's a two-day thing. And he just said, \"Call me anytime.\" And I said, \"I will.\" Oh, great. Well, I don't want I was about to say, \"Thanks, Greg.\" But no, I'm not going to. You're welcome. You know, at first I was like, \"Wow, two days away from your birthday. Like you really dodged that being on your birthday, but then you explain the Pokémon",
            "start": 998.56
        },
        {
            "text": "But no, I'm not going to. You're welcome. You know, at first I was like, \"Wow, two days away from your birthday. Like you really dodged that being on your birthday, but then you explain the Pokémon Go thing on. That's actually worse. I know. Important for optics. Mhm. The San Francisco Pride Parade is not that day. It is the next day. It is on Sunday. That makes a lot of sense. Okay. Heads up everybody. I There were a lot of jokes in the beginning. Greg's going to steal the Pride Parade. I said I wouldn't do that and I I refuse to do that. You're going to open up for them. Yeah. Yeah. Exactly. Opening up for the Pride Parade. Oh, man. I should reach out to them, too. Okay. Good idea. Thanks. Bless. Oh my lordy lord. Well, what I was going to say awful before that happened, uh, is it was me, Greg, and Kevin at the Nintendo store, and Greg asked me one of the oddest questions a human being's ever asked me. Do I want a band-aid? And he like had band-aids, and he like offered me a",
            "start": 1041.2
        },
        {
            "text": "was me, Greg, and Kevin at the Nintendo store, and Greg asked me one of the oddest questions a human being's ever asked me. Do I want a band-aid? And he like had band-aids, and he like offered me a band-aid. And I don't think there's any question more alarming than do you want a band-aid? Mhm. When you don't know you're bleeding. Yeah. I wasn't bleeding. H that's bizarre, right? Yeah. But he asked and immediately I started looking. I'm like, \"What don't I know?\" You know, is he asking asking you this with a straight face? It's not like a Greg Miller character. Total straight face. Genuinely bandaid a band-aid like travel kit. Yeah. What happened after? Is that the end of the story? That's the end of the story. I He had Did you ask Did you grab a band-aid from him? Did you say no? I didn't need it. He did that to me, too. And I was like, \"Am I bleeding?\" He said, \"No.\" And I'm like, \"What the hell am I going to do with a band-aid?\" Well, that's what Walmart's doing to many of their",
            "start": 1075.6
        },
        {
            "text": "need it. He did that to me, too. And I was like, \"Am I bleeding?\" He said, \"No.\" And I'm like, \"What the hell am I going to do with a band-aid?\" Well, that's what Walmart's doing to many of their customers. They are giving wet wipes, Tide samples, band-aids, miscellaneous bonus goods. Now, before the show, Kevin asked, \"Is this just a is this a make good or is this like a marketing move for how messy um this pre-order stuff has been?\" And I'd imagine so. Of course, shout out to Raj Former, Roger Porny, um and Joy who were streaming last night and were getting chats in from people in the audience that were like, \"Yo, I just got my Switch, too.\" And they sent in Coke and Pringles. Um I saw people on my Blue Sky uh timeline uh tweeting about this, right, of getting Coke and Pringles. And good looking kitchen behind too. You see that? Yeah. Shout out to this. Of course, if you go to the hash Walmart surprise, that's where Roger was asking people to send their things to kind of kind of",
            "start": 1127.36
        },
        {
            "text": "good looking kitchen behind too. You see that? Yeah. Shout out to this. Of course, if you go to the hash Walmart surprise, that's where Roger was asking people to send their things to kind of kind of funny vids on uh Twitter and Blue Sky. Oh, we have that same table. Now, who says that's not ours? They snuck in. I do appreciate that there's no consistency as far as the flavoring of Pringles and with the prizes. Oh, Mexican. The Walmart surprise is hilarious cuz like Pringles and Coke, I understand that as a universal like, oh, that's cool. the it's where we get into the wet wipes and band-aids where I'm like, \"Oh, okay. You're just picking things out. I feel Yeah, you're just grabbing whatever's there. There's utility there. But I have good news. What's that? I have a Switch tube being delivered today from Walmart. So, let's see what happens here. I'm really excited about get some Pringles, you know. Would you would it surprise you to know that like in organizing the show really? It",
            "start": 1168.96
        },
        {
            "text": "today from Walmart. So, let's see what happens here. I'm really excited about get some Pringles, you know. Would you would it surprise you to know that like in organizing the show really? It is a thing of like all the new stories are kind of like this. Yeah, it is. Everybody got out the way of the Switch launch as far as everybody as far as like other news dropping, but all of the news here, all the news items we got are very much like just weird news stories that we got like of the Switch. I will say that obviously any new launch of anything with demand is there's going to be a lot of problems. There's going to be canceled pre-orders. There's going to be like just like a weird ass things happening left and right. But what I will say anecdotally, said that wrong, but you get what I'm saying. Yeah. I have never seen more people happy with how a launch went online than this. Oh, the amount of like how well Best Buy has handled uh pre-orders of like waiting in line. Sure, there's a long",
            "start": 1208.96
        },
        {
            "text": "Yeah. I have never seen more people happy with how a launch went online than this. Oh, the amount of like how well Best Buy has handled uh pre-orders of like waiting in line. Sure, there's a long line. There's a lot of people, but the lines move fast. They were organized. Things were good. Our experience at the Nintendo store last night was amazing. Hell yeah. Like they got that [ __ ] down. Do we know how long it took Barrett? Cuz Barrett did send us a Slack last night saying that the line he was at at Best Buy was like hell. I think it was about 90 minutes that he waited. Okay. Yeah. Yeah. And I met him halfway through. Makes sense if there's hundreds of people, but like think about that. 90 minutes for hundreds of people to get their orders and stuff. Like that's awesome. Oh yeah. So I I I'm just like impressed with uh Best Buy specifically. I guess I want to give the shout out to Boys in Blue. Boys and Hold on. Explain that to Blue and Yellow. Blue and yellow. Okay, that's better.",
            "start": 1249.76
        },
        {
            "text": "I I'm just like impressed with uh Best Buy specifically. I guess I want to give the shout out to Boys in Blue. Boys and Hold on. Explain that to Blue and Yellow. Blue and yellow. Okay, that's better. That's better. Um you know who's not happy? M some people from in New York who bought their Switches from a particular GameStop. You're going to have to read story number two for that. Story number two, everybody. GameStop Nintendo Switch 2 customers hit with punctured screens after store employees staple receipts to the box. Oh no. Come on. Aaron Clattz at Tom's Hardware reports. Nintendo's highly anticipated Switch 2 arrives today, but for some the launch is bittersweet. Some units from GameStop have reportedly been damaged by staples responsible for holding store receipts onto the boxes. [ __ ] don't be stapling my [ __ ] Just period. Also, how hard are you stapling these things? Like, that is some wild stuff. Yeah, don't be doing that. You're treating these boxes with no regard. Like",
            "start": 1287.36
        },
        {
            "text": "don't be stapling my [ __ ] Just period. Also, how hard are you stapling these things? Like, that is some wild stuff. Yeah, don't be doing that. You're treating these boxes with no regard. Like Greg Miller, dude. Yeah, he does that. Disgusting. Uh, several customers have gone to X and Reddit to report the issue, noting that the staples are puncturing through the Switch 2's thin packaging material and damaging the console screen. One such customer said stated on X that GameStop stapled the receipt for me and my friend Switch 2's to the box. Another from Rude Boy on X said, \"Hello, my Switch 2 has staple holes in the screen. They stapled the receipt to the box.\" What do we see? Why are they straight up doxing these [ __ ] Why are they calling out the GameStop at 1756 Forest Avenue, Staten Island, New York 10303? Cuz people should know the GameStop not to go to. Don't go there, man. They be stapling. But like LCD screens when you when you puncture them, they bleed, right? Like they the",
            "start": 1335.76
        },
        {
            "text": "Island, New York 10303? Cuz people should know the GameStop not to go to. Don't go there, man. They be stapling. But like LCD screens when you when you puncture them, they bleed, right? Like they the No, no, but like I'm serious. Like the the liquid the liquid part of LCD, right? Liquid crystal display bleeds. There's no bleed in this. I think we're being bamboozled. You think they're faking it? I think someone someone wants attention. I think someone hates that particular store. It has a film. All right. Well, that's good enough then. JG says they need a band-aid. They should have got it from Walmart. Should have got the band-aid. And also, yeah, this is another reason why Nintendo's like, \"Don't take off the protective film because guess what? It saved I imagine it saved the Switch cuz it's still turned on. So, you can still play it.\" Most of the reports appear to be coming from the affforementioned GameStop location in New York. So 1756 Forest Avenue in Staten Island, New York",
            "start": 1383.76
        },
        {
            "text": "cuz it's still turned on. So, you can still play it.\" Most of the reports appear to be coming from the affforementioned GameStop location in New York. So 1756 Forest Avenue in Staten Island, New York 10303. Get it together. Can you imagine being an employee at GameStop? 1756 Forest Avenue, Staten Island, New York. We're going to get sued. Can you just imagine the feeling of seeing this being like, \"Fuck, I'm out of here.\" Like the way that I would not show up to work for the rest of the week. I'm calling in sick. Oh man. I'm applying to other GameStops. Oh, I'm like, get me out of here cuz I'm going to have a [ __ ] riot outside my store. Done. We're done. Story number three. Let's get going some real news. Some good stuff. Okay. Okay. Well, actually, before we get to to real news, I want to continue this stuff. I saw some guy on on Twitter that I don't even want to like show him cuz like this is so stupid. I just want to say it. Um, first person banned from San Francisco uh Nintendo",
            "start": 1426.24
        },
        {
            "text": "to continue this stuff. I saw some guy on on Twitter that I don't even want to like show him cuz like this is so stupid. I just want to say it. Um, first person banned from San Francisco uh Nintendo because he his whole channel is breaking tech. Uhhuh. like busting it open and stuff and like he had the switch and was outside the store and broke it outside the store. There's just a picture of him holding it. Wait, was there broken? I assume. Was there a crowd? Like I assume there were like people around him. I mean, he did it for attention. Yeah. Well, yeah, but like it's his Switch at that point, right? He didn't break the store switch. Yeah, but like to be doing that in front of a bunch of Nintendo fans. Yeah, but to get banned from a Nintendo store. Come on, man. You can't Come on. What are you doing? It's not like we arrested him. You're seriously on the side of this. I I mean I just think it's a little absurd for him to get banned. He spent money on the thing. He can do whatever",
            "start": 1472.56
        },
        {
            "text": "are you doing? It's not like we arrested him. You're seriously on the side of this. I I mean I just think it's a little absurd for him to get banned. He spent money on the thing. He can do whatever he wants. He could break it and try to eat it. Here's the thing. People I see there's a few people in chat that are like, \"Oh, it's wild to ban him. That sucks, but it's his money.\" Here's the thing. He's allowed to do whatever he wants. He's not being arrested. He's being banned from establishment that is watching him break their product. Kevin's right. It was his property in front. Kevin, do you need a band-aid? Get out. Why are you touching me? Hearing Greg come through the god mic out of nowhere is [ __ ] hilarious. Tim chat's on my side. You've lost this one again. First friend, now me. Greg's getting you [Laughter] too. If somebody I don't know, man. Actually, that's not a good example. I was going to say if somebody came in front of our in front of our office and like I don't know",
            "start": 1511.92
        },
        {
            "text": "Greg's getting you [Laughter] too. If somebody I don't know, man. Actually, that's not a good example. I was going to say if somebody came in front of our in front of our office and like I don't know [ __ ] like was wearing shirts that said [ __ ] kind of funny sucks and all you all should die or whatever. We'd be like all right that person if they're if they're in any of our [ __ ] Reddits or anything we ban them. They're not allowed. Yeah, Kevin. I feel you're you're allowed if you have a community of people, you should be allowed to be like, \"All right, we don't like certain people. They're not allowed here.\" I said I wasn't going to do this, but I'm doing it. As long as you're not discriminatory. Yeah, Kev, I put a link to this uh right before story number three. the tweets just banned from Nintendo San Francisco. And there's a picture of him with his Switch broken. You bring it up whenever you'd like. Cuz my f Okay, here's the here's the thing, right? Cuz my followup Mhm. cuz I",
            "start": 1557.08
        },
        {
            "text": "from Nintendo San Francisco. And there's a picture of him with his Switch broken. You bring it up whenever you'd like. Cuz my f Okay, here's the here's the thing, right? Cuz my followup Mhm. cuz I feel like my example I just gave wasn't great, but if I see somebody outside of my Nintendo store just breaking a Switch for attention, I feel like that's potentially a safety hazard. Mhm. Cuz like I feel like you could possibly get jumped in front of the Nintendo store with with those actions, right? If you have a line of people that are waiting to pick up their Switch and they see you [ __ ] breaking a Switch in front of them, like you can that you could cause bad [ __ ] to happen that way. Yeah, totally. I am just going to say in San Francisco, we've many of us have seen people just pooing on the street and like there's a good chance that some random person will pooing in front of the Nintendo store. Should they get banned? Should they get banned? I will say, Kevin, I've never seen",
            "start": 1597.12
        },
        {
            "text": "on the street and like there's a good chance that some random person will pooing in front of the Nintendo store. Should they get banned? Should they get banned? I will say, Kevin, I've never seen someone poo on the street. No, come on. Never. I've seen it twice. And it's How have you seen it, Tim? It changes you. It takes something that you didn't know you needed an innocence and I hated it. But I did see Stop. I'm not saying you promised not to bring this. But no, no, no, no. I told you specifically. No, but no, no, no. But like, wait, what are you about to say? I didn't do anything. I didn't do I'll just say it. I'll just say it. I'll just say it. There was a man aggressively peeing by a 7-Eleven close to my house. You're giving way too many details. Kevin, I'm aware. I'm aware, but like I'm this deep already. You know what I mean? I love being me off there like you made it sound like Kevin, you took a [ __ ] in front of a GameStop or something. Well, first of all, we have a good",
            "start": 1642.56
        },
        {
            "text": "I'm this deep already. You know what I mean? I love being me off there like you made it sound like Kevin, you took a [ __ ] in front of a GameStop or something. Well, first of all, we have a good friend who takes [ __ ] in bushes aggressively. You know what I mean? Why does the word Why do you keep attention to the word aggressively? What does that mean in this context? I mean, just imagine Greg Miller taking a [ __ ] in a bush. You're telling me that's not aggressive? You know what? I can see he's definitely crying there. I'm still Do I want to know the rest of the story that you were about to tell him? That was it. Okay. But bless we were driving towards this person. They are in their car. Well, no. No. Their door is open. They are facing the cars that are driving towards them. And he's just aggressively peeing forward into the light. It was unlike anything I've ever seen. Dude, dick out full stream towards the traffic. It was a shocking stream. It was crazy. Yeah. Like it was a",
            "start": 1695.68
        },
        {
            "text": "just aggressively peeing forward into the light. It was unlike anything I've ever seen. Dude, dick out full stream towards the traffic. It was a shocking stream. It was crazy. Yeah. Like it was a lot, guys. Like you could tell quarter inch thick stream. Oh Jesus Christ. You really got to think about the order of the words you're saying what the stories were saying. Yeah. Should I said his stream was a quarter inch? Sorry. Thick quarter inch. You start off with quarter inch real thick. I I'm just saying that's that's impressive to see from a car as you're driving 25 35 miles an hour and you can just tell the force that's coming at you. This is the switch to launch KFC by the way. Yeah, we got to I begged him not to bring this story up. I said don't mention it. Don't mention it. You You changed some freaking details. You're the one that told the exact story. I can't I What am I going to do? I got to be honest. You know what I mean? This is going to get like 25k views at least. You know",
            "start": 1747.44
        },
        {
            "text": "some freaking details. You're the one that told the exact story. I can't I What am I going to do? I got to be honest. You know what I mean? This is going to get like 25k views at least. You know what I mean? I know. I love it. This is what we do. This is what This is what we do. What did I just say? Uh let's read some super chats before we get to uh the stories and the ads and stuff. Uh Matt Avery just says, \"Roger, go to bed.\" Roger's going to bed. As I was getting here, he was leaving. Yeah. And Joey cuz they were here all night. I saw him as they came in. He had he seemingly had a lot of energy to him. I was like, you seem surprisingly awake for somebody who's been awake for the last Yeah. 24 hours. Um, Ry G, sorry, Ry Rimes says, \"Who's the best retailer to buy physical Switch games from? And who has the best rewards program?\" Those are great questions. Best Buy used to have a great rewards program. Dude, I miss Best Buy gamers a lot, dude. It was so good. so good. Like I used to",
            "start": 1795.68
        },
        {
            "text": "And who has the best rewards program?\" Those are great questions. Best Buy used to have a great rewards program. Dude, I miss Best Buy gamers a lot, dude. It was so good. so good. Like I used to exclusively buy games from Best Buy because they had such a deal, but then that went away. So I honestly don't know. This might be one from chat like cuz like I wonder is G is GameStop good with their membership cuz they're the only one I can think of that has a consistent membership. GameStop sucks in my experience. I I don't know. No, I'm saying they're like their membership stuff. Yeah. Um but I I feel very lucky that we have this Nintendo store. It will be where I buy my physical Switch games now cuz they just present them very nicely. And like my biggest problem is I hate buying them on Amazon cuz it is a crapshoot of what you're going to get. Yeah. If they even have Nintendo games. That's just a problem. Bezos. Yeah. If they even have Nintendo games. Like they're selling out. They're not",
            "start": 1838.32
        },
        {
            "text": "cuz it is a crapshoot of what you're going to get. Yeah. If they even have Nintendo games. That's just a problem. Bezos. Yeah. If they even have Nintendo games. Like they're selling out. They're not selling the Switch. I I don't even think about that. Shit's crazy. Sergio Duna says, \"Got a new job today.\" New job and a new Switch, too. Oo, congrats. Congratulations. Amazing. Mr. Hawk says, \"Could this be a way for Walmart to utilize their grocery delivery system in order to get pre-orders delivered at a specific time?\" That is a insane conspiracy theory that I kind of love, dude. I Yeah, I like that conspiracy theory. Yeah, I like that cuz Yeah, cuz that Well, that is the big thing is like it sounds like the pre-orders if you go to a store for the midnight launch or 9:00 p.m. launch or whatever. That went well, but they're not really shipping morning of day of like So Best Buy is like not doing a great job with the shipping part of it. Whereas it sounds like Walmart's kind of kicking",
            "start": 1882.24
        },
        {
            "text": "That went well, but they're not really shipping morning of day of like So Best Buy is like not doing a great job with the shipping part of it. Whereas it sounds like Walmart's kind of kicking ass. I've seen so many people like, \"Yo, I got a knock on my door at 6:00 a.m.\" Switching Pringles and Yeah. And every picture I'm seeing is like in like a almost like a grocery bag. Like they're not in boxes like I would expect for like a Joey Ratzom says that's exactly why they did it. It was the Spark drivers. I'm learning a lot today. No way. I didn't even think about that. The ingenuity. Huh. That makes a lot of sense. How nifty is that? Robert Gado says, \"What's the name of Greg's walkout music?\" I don't remember. So rewind just a little bit. Uh, Rail says Walmart delivered my Switch 2 at 6:15 a.m. The delivery driver said she was getting a $10 incentive for delivering Switch 2 orders before 9:00 a.m. This is crazy. This is cool. Yeah, this is really cool. This is cool. Good for you,",
            "start": 1926.8
        },
        {
            "text": "6:15 a.m. The delivery driver said she was getting a $10 incentive for delivering Switch 2 orders before 9:00 a.m. This is crazy. This is cool. Yeah, this is really cool. This is cool. Good for you, Walmart. Bad for you for not handling the like pre-order. Like, is your order going through stuff that well? But otherwise, look here. See him making moves. Uh, Mr. Nice Guy Ry says, \"I've never bought something so quickly quickly in my life.\" Assume they're talking about the Greg shirts. I unfortunately am too. Yeah. Uh Jeff Bull Jr. says, \"Walmart gave me Coke and Hot Ones Pringles with my Switch 2 delivery.\" This is hilarious. Yeah. Like again, this is one of those ones where this There's the reason I put this story number one is because it is kind of a bizarre slashcool thing that I think a lot of people are just going to associate now with like when they think back to their Switch launch memories of [ __ ] sitting back eating a [ __ ] pizza Pringle. Nothing like 6 a.m. pizza, drinking",
            "start": 1972.32
        },
        {
            "text": "lot of people are just going to associate now with like when they think back to their Switch launch memories of [ __ ] sitting back eating a [ __ ] pizza Pringle. Nothing like 6 a.m. pizza, drinking a Coke that may or may not have your name on it. You know what I mean? Pizza's on a Pringle. You can eat pizza anytime. I mean, that's fair. Uh Dustin Mim says, \"I got my Switch 2 from Walmart, and it wasn't the Mario Kart bundle. It was just the regular Switch 2, but they did give me a Switch 2 Pro Controller I didn't order.\" That sounds like you picked up somebody else's order. That does not sound like yours, Dustin. Uh Super Tyler said, \"The Game Stopped by Me held a Mario Kart 8 tournament to see who would get the first Switch, too.\" That's rad. my roommate. Uh, shout out to Tounris one. Oh, that's awesome. To tune is at least at one point from Game Explain. I've watched a lot of their videos. Oh, cool. Um, Povert says, \"Target sucks Dragon Balls as they didn't create a shipping label",
            "start": 2015.84
        },
        {
            "text": "that's awesome. To tune is at least at one point from Game Explain. I've watched a lot of their videos. Oh, cool. Um, Povert says, \"Target sucks Dragon Balls as they didn't create a shipping label till today. Won't get mine till Wednesday.\" Yeah, I haven't heard anything good about Target. Yeah, it's the whole thing's been a trash fire, but yeah, that doesn't surprise me. Alex Faser says he can do what he wants with his property and they can do what they want with theirs. The logic applies both ways. And that's what I'm saying. Alex Fer, that's the bottom line cuz blessing said so. Jeff Grub's game mess says Kev is wrong. He could break it and store could ban him. There you go. Get him, Grub. I didn't say that they couldn't plan ban him. I just said they shouldn't. That's absurd. He broke it outside. I mean, we don't know that. You know what I mean? I'm just saying I'm sorry. I just saw a picture. I'm just like doing some math together in my mind's grub. I mean, I didn't have all the",
            "start": 2057.44
        },
        {
            "text": "it outside. I mean, we don't know that. You know what I mean? I'm just saying I'm sorry. I just saw a picture. I'm just like doing some math together in my mind's grub. I mean, I didn't have all the information. Tim just I just I just went off what Tim told me. He promised. I got to assume he didn't do it in the store, though, right? Cuz like if he did in the store, that's an open and shut case. You looked at the Mario mascot in the [ __ ] eyes. If you do it in the store, that's an open and shut case. You're banned. The mascot wasn't there, right? I didn't see him. I didn't have eyes on him. That sucks. I did see a bunch of dogs dressed up as Mario and Luigi. Gold Brock, that's your first warning. It's your first warning. You get two. Jeff Grub says it is Tim's fault. I'll I'll accept that. Grub, good luck with the Summer GameFest. I'm very proud of you guys for still doing the Giant Bomb Couch even though you guys are independent. Y that makes an incredibly hard job even harder. And",
            "start": 2101.92
        },
        {
            "text": "Grub, good luck with the Summer GameFest. I'm very proud of you guys for still doing the Giant Bomb Couch even though you guys are independent. Y that makes an incredibly hard job even harder. And I can't wait to see how you pull it off. But I know you're going to I have faith in you. Ricardo Gonzalez says, \"Just started watching and the first thing I hear is Kevin saying twoinch thick stream has be cracking up at work.\" It's what we do here. It is what we do here. We supply joy. We supply joy and information and advertisements. Here's one of them. This episode's brought to you by XRE. Y'all know that a few months ago, my life changed forever when I brought a pair of XRE1 AR glasses on a long flight to New York. I legit could not believe how easy it is to use and high quality my experience was playing games, watching movies, TV shows on the plane without just too much extra stuff around me, or especially not a giant goofy headset around my head. No joke, this is my favorite new tech",
            "start": 2137.12
        },
        {
            "text": "was playing games, watching movies, TV shows on the plane without just too much extra stuff around me, or especially not a giant goofy headset around my head. No joke, this is my favorite new tech product in years and it has earned a permanent spot in my travel bag. It is only hard to believe that it works as well as I'm saying until you try XR1 AR glasses for yourself and then you will see that the future is now. The tech is here. Connect XR1 glasses to wherever you are playing. Whether it's a handheld console, a PC, phone, home console, you just get a massive 150inch virtual screen anywhere, anytime for any game. Gaming on the go, like a long haul flight, you need the XR1. Next starting to hurt from staring down at your handheld, we've all been there. You need an XR 1. A screen as big as your wall. Instant plugandplay with all of your devices via USBC. Built-in audio with sound by Bose. Anchoring your screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full",
            "start": 2181.52
        },
        {
            "text": "your wall. Instant plugandplay with all of your devices via USBC. Built-in audio with sound by Bose. Anchoring your screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full HD. These are what make XR1 a musthave. And we hear XR1 Pro is coming soon with an even bigger virtual screen. Hit our link below to get your XR glasses today. There's nothing better than when a sponsor of Kind of funny is something that we are legitimately obsessed with. And that is exactly the case here with XRE. You're going to hear me talk about these forever. Go to xreal.com for more. Greg just informed me that people are booking flights to go to the parade. What was that festival that had the multiple documentaries? Firefest. Firefest. This is giving me some Firefest vibes. The problem is this will be undocumented. I mean, will it? We can only You don't think Kevin's going to be out there with the iPhone on? Absolutely not. With a microphone? No, thank you. Oh, but it is Tim's",
            "start": 2231.12
        },
        {
            "text": "is this will be undocumented. I mean, will it? We can only You don't think Kevin's going to be out there with the iPhone on? Absolutely not. With a microphone? No, thank you. Oh, but it is Tim's birthday, so we can count it as his birthday party. There you go. Story number three. Xenolade Studio reveals it co-developed Switch 2's big launch game. This comes from Andy Robinson at BGC. He's freaking out here. Xenolade studio Monolith has confirmed it assisted development of today's big Switch 2 launch game, Mario Kart World. Posting on X, Monolith said it had assisted with the design of characters and courses for the Switch 2 game. Monolith, which is fully owned by Nintendo, has previously contributed to many first-p party games, including Splatoon, Animal Crossing, and Zelda. Interesting. Yeah, not too big of a surprise. They have done this a lot in the past. It feels like they're Nintendo's designated open world. Exactly. Assist team. And so this being an open world game, that makes a",
            "start": 2279.04
        },
        {
            "text": "not too big of a surprise. They have done this a lot in the past. It feels like they're Nintendo's designated open world. Exactly. Assist team. And so this being an open world game, that makes a lot of sense. Them designing characters a little bit weird. Courses. That makes sense. Yeah. It's funny cuz they do even though I say that, right? Like they say everything but open world, but like the courses are part of the open world. And yeah, and I'm trying to like not give too many of my actual impressions of Mario Kart or the Switch yet because we have other shows for that today. But uh one of the biggest observations I've had is how impressed I am with the open world. Like I'm not necessarily saying I like it better than just traditional Mario Kart courses. We'll have to wait for later for my thoughts on that. But uh I do think that it's like very fun to just drive around. There's like a lot of things like it's welldesigned to get from one place to another. That's my thing with it is my",
            "start": 2324.88
        },
        {
            "text": "thoughts on that. But uh I do think that it's like very fun to just drive around. There's like a lot of things like it's welldesigned to get from one place to another. That's my thing with it is my impression, my very limited impressions cuz I've only played maybe 20 to 30 minutes of the uh free roam mode. But as far as the layout of the land, I think it's actually like really really wellcraftrafted. I just wish it was filled with more varied things to do and like more interesting things to explore and maybe as I play more I'll find some of that. But like as far as like the construction of it, I'm fairly impressed so far by how natural the world of Mario Kart World feels. And so, you know, maybe Monolith has a lot to do with that. But shout out to Monolith, man. I feel like they are uh such a important factor to Nintendo in the last decade. Y and uh you know, Xenolade is one of those franchises that it really seems like if you know, you [ __ ] know. Like I don't know anybody that",
            "start": 2365.04
        },
        {
            "text": "such a important factor to Nintendo in the last decade. Y and uh you know, Xenolade is one of those franchises that it really seems like if you know, you [ __ ] know. Like I don't know anybody that plays Xenolade and is like it's okay. You know, it's their life. It's their personality. Um so, and the games are beautiful. You look at Pokemon Scarlet and Violet and then you look at Zetlade Chronicles, you're like, \"What the [ __ ] happened? How is this possible?\" I think it pulls together Nintendo's um library so well just as far as like the audience it serves and how serious people take it, right? Like it's that game where we I think with with many Nintendo games, at least for me, I'm like, \"All right, story isn't necessarily the thing I come to these things for.\" Like, and I say that loosely because Tears of the Kingdom, I love the story of Tears of the Kingdom, right? Um, you know, Metroid I think often times has stuff where it's like, \"Oh, I care about what's going on here in the",
            "start": 2408.56
        },
        {
            "text": "because Tears of the Kingdom, I love the story of Tears of the Kingdom, right? Um, you know, Metroid I think often times has stuff where it's like, \"Oh, I care about what's going on here in the story, but it's different from I think something like when I hear when I hear people talk about Xenolade and the characters and like how much they vibe with like the riding of the game and all that stuff, right? I think it serves a particular sect of the Nintendo audience that is very important for like that hardcore side of gaming. Totally. Story number four. Nintendo fans surprised to find Switch 2 Edition game cartridges also work on Switch One. This comes from Tom Phillips at IGN. Nintendo fans have known for some time that Switch 2's backwards compatibles with Switch One. But what happens when you do the reverse and stick a Switch 2 game in a Switch One? God, people are [ __ ] weird, but I get it. Yeah. You know, uh instead of Switch 2 only game, like this reminds me of back uh in the PS1",
            "start": 2452.8
        },
        {
            "text": "you do the reverse and stick a Switch 2 game in a Switch One? God, people are [ __ ] weird, but I get it. Yeah. You know, uh instead of Switch 2 only game, like this reminds me of back uh in the PS1 days when I was just, you know, I know exactly what you're going to say. I know. I know. I know. But I I I just I wanted to take it a step further. Yeah. There's nothing cooler in the world than CDs. Yeah. In the '90s. I agree. Specifically, like CDs were so cool. That Monster Rancher game so [ __ ] cool. Turn CDs into monsters. Are you kidding me? AOL giving out these things in the streets. Me and Kevin using them as frisbes towards each other. Weapons. Yeah, it's probably like it's probably good why they uh kind of went away over time there. But, you know, they're cool as hell. And uh some PS1 games you put into a CD player, it would play music. Yeah. So cool. Really cool. Crucet, man. Never forget. Insert of Switch 2 only games like Mario Kart World and Switch One and Nintendo's last",
            "start": 2492.32
        },
        {
            "text": "PS1 games you put into a CD player, it would play music. Yeah. So cool. Really cool. Crucet, man. Never forget. Insert of Switch 2 only games like Mario Kart World and Switch One and Nintendo's last gen console will simply display an error message saying the software is designed for Switch 2. But pop a Switch 2 edition cartridge of games also available on Switch One like Legend of Zelda: Breath of the Wild and it works. Whoa. What's going on here? Well, Nintendo itself hasn't gone into detail, but packaging for Switch 2 edition games looks like absolute ass. Uh, and does note that cartridges contain both the original game and the Switch 2 upgrade. I editorialized a little bit in there. You can guess what part. Uh, this Nintendo Switch 2 edition comprises the Nintendo Switch game and the Switch 2 edition upgrade pack. Uh, the upgrade packs also available separately. So, in other words, when you put a Switch 2 edition cartridge and the Switch One, the older console knows to ignore the",
            "start": 2534.24
        },
        {
            "text": "Switch 2 edition upgrade pack. Uh, the upgrade packs also available separately. So, in other words, when you put a Switch 2 edition cartridge and the Switch One, the older console knows to ignore the Switch 2 bit and just play the original game. Nintendo doesn't appear to have ever stated in plain English that this is how some Switch 2 edition cartridges operate, but it's useful feature to be aware of. Um, I didn't realize this, but I did realize something kind of similar. Yesterday, I was playing um Tears of the Kingdom a little bit when Mario Kart wasn't ready to download or anything yet. And I just had it on my monitor, which isn't 4K, uh, but it was running way better. And I was very impressed with it. I was like, I can't believe it looks this good. And then I realized I was playing the Switch one version. It wasn't even the upgrade pack on the Switch 2. Then I got the Switch. I'm like, \"Oh my god, this is even better.\" So Switch One games just playing on the Switch 2 are better.",
            "start": 2575.2
        },
        {
            "text": "Switch one version. It wasn't even the upgrade pack on the Switch 2. Then I got the Switch. I'm like, \"Oh my god, this is even better.\" So Switch One games just playing on the Switch 2 are better. Really? Yeah. Oh, that's awesome. Like even Smash I saw people Smash Ultimate loading way faster. See, I thought I noticed that too when I was play when um you and Greg were at the Nintendo store and like we had the um the stream focused on you guys. In the background, I was just playing Smash Ultimate on on Greg's Switch 2 trying to unlock characters because apparently Greg has never booted up Smash Ultimate before in his life because I I booted up the game and it was like Piranha Plant has been unlocked and I was like, \"Uhoh, there's not going to be all the characters that I want here.\" And then I hopped into the um into the Smash mode and it started teaching me about if you fall off the stage, you lose a life. And I was like, \"Oh, fuck.\" And I look at the character select screen, there's",
            "start": 2614.32
        },
        {
            "text": "I hopped into the um into the Smash mode and it started teaching me about if you fall off the stage, you lose a life. And I was like, \"Oh, fuck.\" And I look at the character select screen, there's 10 characters available. I'm like, \"Okay, go. Okay, cool. We're not going to play this on stream probably.\" But I started to try and unlock characters. And as I did that, I was like, I feel like this game is running better, but I I don't know if this is the um what do they call those pills that's like there's nothing to them, but like they make you feel better anyway. Placebo. I thought it was like a placebo situation. Placebo switch. Smash Smash Ultimate already ran like flawlessly all things considered, right? Like in terms of the gameplay, but um the I was watching videos of it loads faster into levels. And the thing that was really impressive to to me of like, oh, I see the difference is when you're on the character select screen cycling between uh colors of outfits, it's instant. Yeah.",
            "start": 2650.56
        },
        {
            "text": "levels. And the thing that was really impressive to to me of like, oh, I see the difference is when you're on the character select screen cycling between uh colors of outfits, it's instant. Yeah. Like literally [ __ ] instant. So, it's like, all right, cool. Does that matter? No. But like, it's just cool to know. It's like, all right, cool. These games are better even without any type of patch or update. So, cool. Um, I love that. Yeah. And any any any thoughts? I mean, yeah, if you're somebody who I guess owns both Switch one and Switch two and you buy a Switch 2 version of a thing, but you want to play it on or you buy a Switch 2, I guess, crossgen version, whatever they're calling it, right? Like Switch 2 edition of a Switch One game. Guess what? That cart works on both. That's convenient. I'm I'm really interested in the next month of coverage of Nintendo as a whole and like all the digital foundry br videos of breaking things down like actually getting the numbers of things just",
            "start": 2687.76
        },
        {
            "text": "I'm I'm really interested in the next month of coverage of Nintendo as a whole and like all the digital foundry br videos of breaking things down like actually getting the numbers of things just cuz I'm interested in that stuff. Uh, but I'm also interested in just like the weird things that come up or like the stories that we're going to learn because something I've been fascinated by is Nintendo's insistence on transferring your Switch One to your Switch 2 and then it just like deletes everything from your Switch One. Wait, deletes everything from your Switch One. Yeah, if you did the system transfer, you're talking about the game cards and [ __ ] Yeah. All right. Like your whole account, all the all the the stuff. And I'm like, that's cool. I get it. But I I imagine there's a lot of people that still want their Switch ones for some reason, you know? So, it's like, wait, your account's getting deleted from your Switch One. All the data on your Switch One is being transferred. I don't",
            "start": 2730.16
        },
        {
            "text": "that still want their Switch ones for some reason, you know? So, it's like, wait, your account's getting deleted from your Switch One. All the data on your Switch One is being transferred. I don't think that happened with mine when I did mine last night. Like, I still, if I boot up my Switch One right now, my account and stuff is still my homepage looks the same. Kevin, could you do me a favor and grab the the white Switch OLED from my desk? Yes, sir. Cuz I I actually haven't seen what happens afterwards. Let me let me check. I mean that yeah, it gave me like a warning of and it was this for specific games. It was Pokemon actually where they were like your save data is is going to move entirely. Well, that makes sense though because that that those that's that's those are the games that don't have cloud saves. Correct. So that's the only like the only way that save exists. But outside of that, like I think maybe as as far as the virtual game card stuff, yeah, like I probably wouldn't",
            "start": 2772.8
        },
        {
            "text": "have cloud saves. Correct. So that's the only like the only way that save exists. But outside of that, like I think maybe as as far as the virtual game card stuff, yeah, like I probably wouldn't be able to play my digital games unless unless I switch the game cards back, I presume. Yeah. But like everything's still the same. Yeah. Here's my thing. Like uh someone in the chat says Tim be spreading lies. I'm trying to not spread lies. I want to like fact check right now to figure this out. But what I will say is that's what the thing said when you're transferring. It says it will delete your stuff from your other Switch. Interesting. So maybe Nintendo's lying everybody wouldn't be the [ __ ] first time. I mean yeah I didn't I did not read the fine print. I was just like give me my Switch 2 games. Get me in there. So you might you're probably right about that. Everything's here. Yeah. That's why that's why I was like I don't know. That's I was confus I was scared for you. Everything's",
            "start": 2810.48
        },
        {
            "text": "2 games. Get me in there. So you might you're probably right about that. Everything's here. Yeah. That's why that's why I was like I don't know. That's I was confus I was scared for you. Everything's here. I was like, \"What did you do to your Switch One?\" Wait, what is it transferring over? Hold on, though. To play this game, you'll first need to load the virtual game card on this system. Yes. So, that's that's probably what they're implying, I imagine. I want this very clear to everybody. Uhhuh. I don't care. This doesn't affect me. I was fascinated on if it's going to affect others. All right. I take accountability for being wrong, but we we did it together. Hey, we did it together. We fact checked the system worked as intended. Mhm. That's how this all goes. But I also want it clear. I'm not trying to not take accountability for this. But I just want clear. I was saying that you were you were fascinated with what's going to happen over the next month. Mhm. I still am. So people",
            "start": 2842.96
        },
        {
            "text": "I'm not trying to not take accountability for this. But I just want clear. I was saying that you were you were fascinated with what's going to happen over the next month. Mhm. I still am. So people like people like getting rid of their Switch ones, what problems people are going to have. I'm fascinated in that. So yeah. Story number five. Say goodbye to streaming apps on the Switch 2. This comes from Simone De Ro for at Polygon. Thousands of games will be backwards compatible with the Nintendo Switch 2, but streaming apps are getting left behind ahead of 100 Nintendo Switch 2's launch on June 5th. Players are keeping an eagle eye on Nintendo's compatibility page with lists how many games have been tested for compatibility with the new console. As of May 27th, the vast majority of Nintendo's own games and its third party games will be playable on Switch 2. Great news for players who have built up a Switch library. But what's not making the leap are streaming apps like Crunchyroll and",
            "start": 2887.44
        },
        {
            "text": "own games and its third party games will be playable on Switch 2. Great news for players who have built up a Switch library. But what's not making the leap are streaming apps like Crunchyroll and Hulu, as well as the Comic Reader, Inky Pen. These apps aren't compatible with Switch 2, and it's not immediately clear if new versions are in development. This happens every time. It's happened. This is the second time it's happened, right? Cuz the Wii did the Wii U have Wii U did Netflix and stuff. Mhm. Hold on. Didn't the Wii also have Netflix, but it was a disc? Both did. The Wii had Netflix and Wii was actually really big for Netflix. like we was kind of that start of like Netflix's digital push and like that becoming like a really really big thing. Um on one hand I was going to say on one hand I understand it. I honestly don't I and I I I think the part that I understand is the fact that the Switch doesn't need this [ __ ] So maybe that's the part where I'm like okay well cool it",
            "start": 2936.8
        },
        {
            "text": "one hand I understand it. I honestly don't I and I I I think the part that I understand is the fact that the Switch doesn't need this [ __ ] So maybe that's the part where I'm like okay well cool it doesn't have it. But when I think about my personal use case for Hulu and Netflix and all that [ __ ] being on the Switch 2, for me it's just a thing of convenience. I don't always want to change my HDMI output or source or whatever to the second one where I have my Roku or my Apple Apple TV [ __ ] stick or whatever it is. The thing that the one that Gary gift me. Thanks so much, Gary. What would um and I love it very much actually. But I just want it there, man. I want all of my [ __ ] anything that I have that has video output should just have Netflix and Hulu. That's my stance on it. I'm not giving it up. I mean, that's fine. You know, I respect you. You know, I don't agree. Like, only because here's the thing. They got the 4K now. I know. They got they got the HDR now. It this is a",
            "start": 2977.72
        },
        {
            "text": "not giving it up. I mean, that's fine. You know, I respect you. You know, I don't agree. Like, only because here's the thing. They got the 4K now. I know. They got they got the HDR now. It this is a it's a weird thing for me because on one hand, I I'm with you that like why not? It could just be everywhere. But my reason for why not is that if the app isn't kept up to date and there's not people actually giving a [ __ ] about making sure the app is running right, it's not worth it, man. But why wouldn't that happen? Because that it never does. Like these freaking shitty ass Nintendo Switch versions of these apps are not good. They're usable. And sure, is usable better than not there at all? For some people, yes. I really, really, really question how many people are actually using these apps on the the on the Nintendo Switch. And I'm sure there are people that do. I feel like the I feel like the number would be high if they actually put the apps on there. I don't think so, man. It's",
            "start": 3022.8
        },
        {
            "text": "apps on the the on the Nintendo Switch. And I'm sure there are people that do. I feel like the I feel like the number would be high if they actually put the apps on there. I don't think so, man. It's the Switch. I think that something we're not you're not thinking about is the XR factor of imagine you're playing your Switch in your AR glasses and you're having a great time, but now it's it's time to stop playing video games and now you're going to switch over to Netflix. Do you need to you want to unplug your XR glasses or you want to just keep watching Netflix where you're comfortable in your bed, your massage chair, your massage chair, too. You're saying a lot of interesting things, Kev, but like I was saying earlier, because of Nintendo Switch is bizarre ass video out stuff, it's inconvenient. I'd rather use my phone with the actual glasses anyways. Like Nintendo makes it not a good experience to do a lot of these things already, but we won't let them bully us. You know what I",
            "start": 3067.12
        },
        {
            "text": "I'd rather use my phone with the actual glasses anyways. Like Nintendo makes it not a good experience to do a lot of these things already, but we won't let them bully us. You know what I mean? Yeah. I don't know. It's I'm sure people do use this and again, whatever. Like it doesn't affect me if they have it or don't. I'm not going to use it. Yeah. Um, but I I just this is in my opinion not something worth getting upset about. See, I I for me I think of I specifically think of um my sister's family and our kids, right, of like and like I think families with children that might not have as many like streaming devices as like us tech nerds or video game nerds or like people people who are who are really in on this stuff, right? Like I feel like there is a convenience of all right we have a I don't know we have the the Roku and we have the Switch. All right cool we can have Switch on TV one and Roku be for TV2 and both those have Netflix and Hulu and we have all that solved. Now, I'm",
            "start": 3112.96
        },
        {
            "text": "a I don't know we have the the Roku and we have the Switch. All right cool we can have Switch on TV one and Roku be for TV2 and both those have Netflix and Hulu and we have all that solved. Now, I'm saying this even though I feel like there's a large amount of people now that just have straight up smart TVs. And so maybe that maybe that is like not just a thing anymore as far as like the how convenient it is to have those extra devices that have Hulu and Netflix just installed on them so I can use them anywhere. But for me, I also think of it as just an easy thing to have, right? Like even if you don't update it, clearly not because it's not good. Bless bless. I'm gonna put Tim's argument aside and I'm gonna elevate things one further. Not only do I want Netflix, I want it to be picture and picture while I play my video game. Okay, now you're doing too much. Am I Nintendo's not Am I? No. Well, just think about how good it would be. Did they have that for Xbox One when they first",
            "start": 3159.36
        },
        {
            "text": "and picture while I play my video game. Okay, now you're doing too much. Am I Nintendo's not Am I? No. Well, just think about how good it would be. Did they have that for Xbox One when they first launched it? I remember that being like I think they might have cuz they had to like you plug in your cable box, right? Yeah. And then Tim wire it to my face with my XR glasses. I love Kevin trying to like like very much solve like our particular use cases. So it's interesting the chat the chat's against me. Some of them are against me and I I understand and again I want it clear. I'm not making the point that I don't use it. So I don't understand why anyone would like I understand that people want to. I just also think that this is an example of making a bigger deal out of a thing that doesn't actually exist in the form that people are acting like it does. It reminds me of the like, oh man, the Switch two box looks like the Switch one box. How are parents going to know that it's the right",
            "start": 3203.36
        },
        {
            "text": "actually exist in the form that people are acting like it does. It reminds me of the like, oh man, the Switch two box looks like the Switch one box. How are parents going to know that it's the right thing? I don't think that's a real actual problem in 2025. Things are different now. GameStop employees will fix that. They'll stop it. Also, it's a big ass, too. We know the difference. Mhm. And it's like we see like I feel like there's this for fear that we all just kind of perpetuate. That's an interesting conversation, but it's like, yo, let's be real about stuff. And if there's [ __ ] morons out there that like don't aren't able to do the research of knowing that there's a two after it, that's on them. For me, it's more it's less of an argument of like for me it's more of an argument just of convenience of like I feel like for anything that like I think anything that outputs like video or it's anything that's a entertainment box, I should say that's a way better way to say anything",
            "start": 3246.32
        },
        {
            "text": "of convenience of like I feel like for anything that like I think anything that outputs like video or it's anything that's a entertainment box, I should say that's a way better way to say anything that you have that's an entertainment box for the most part. like a wide consumer like you know largely popular entertainment box should just have these streaming apps available like so should it have Spotify maybe should have Apple music honestly you know where do you draw the line yes it should have all that stuff has all that stuff has all that stuff on this thing I use Spotify for my PlayStation all the time if I could use Spotify for my Nintendo Switch 2 and play Mario Kart while listening to Spotify of course Nintendo doesn't have Nintendo wouldn't let that happened. I was about to go off, but Nintendo probably would be very frustrating with that stuff. But I'm going to say yes. I think they should strive to have those features cuz those features are convenient for people and they do",
            "start": 3287.84
        },
        {
            "text": "but Nintendo probably would be very frustrating with that stuff. But I'm going to say yes. I think they should strive to have those features cuz those features are convenient for people and they do upload the console. They require people to make the apps and work on the system. Then make the apps and work on that. That's my argument. It's I I'm not going to say it's not that hard cuz I know all this [ __ ] is hard, but you can do it and it's worth it. You have this is going to send sell tens of millions of units. Mhm. You don't you don't think a lot of those people aren't going to use your Spotify, Netflix, Hulu, Crunchyroll apps on your thing? I don't think enough. I do not think enough. That that is my only argument. I do not think enough. Fair enough. Uh because despite what everyone wants to act like, the majority of people do have devices that could do that. Multiple. That's true. I just want an extra one. I just want an extra one that can do it. An extra one. Yep. Uh story",
            "start": 3335.6
        },
        {
            "text": "wants to act like, the majority of people do have devices that could do that. Multiple. That's true. I just want an extra one. I just want an extra one that can do it. An extra one. Yep. Uh story number six. Mi characters are now genderless on Nintendo Switch 2. This comes from Mark Griffin at Polygon. The Nintendo Switch 2 has changed MI character creation. Uh Polygon can confirm after going hands-on with the console. When creating new MI avatars, players won't be able to choose between male or female options like the Switch, but rather between two styles. The new system offers players a generic generic avatars with the option to customize the Mi. And if you're wondering whether or not the Mi characters were redesigned, no, they weren't. Instead, me look unchanged, carrying over the debut design from the Nintendo Wii. I love that these little [ __ ] are still here. They don't go away. My guy is still here, dude. From 2006. My guy looks nerdy as hell, by the way. Like, my guy, dude, I",
            "start": 3376.64
        },
        {
            "text": "design from the Nintendo Wii. I love that these little [ __ ] are still here. They don't go away. My guy is still here, dude. From 2006. My guy looks nerdy as hell, by the way. Like, my guy, dude, I must have made my I guess I made it in 2017 when I got my Switch and I never changed it. And I look back and I'm like, god, I was a [ __ ] nerd. And I know I still am. Like, that hasn't changed. Hilarious. Let me see if I can find my Yeah. you cuz it's just in the menu, right? Create edit a mei list. I'm I'm going to see if I can find it. I don't have any miis. Uh while the genderless direction serves as a change for the Mi characters, Nintendo isn't new to adopting this selected style language for gender preference. In 2022, Splatoon 3 introduced the concept to the franchise. Um two years before Animal Crossing: New Horizons was released with similar options, referring to gender as styles. Cool. Yeah. This is take a step into the into modern times, a step into the future, right? Like I",
            "start": 3421.04
        },
        {
            "text": "Animal Crossing: New Horizons was released with similar options, referring to gender as styles. Cool. Yeah. This is take a step into the into modern times, a step into the future, right? Like I think this is a good move for the inclusivity that we're talking about here as far as like being able to use pick whatever clothes, do whatever styles you want with whatever body shape that you that you choose. Makes sense. Yep. Good stuff for for me. Happy Pride. [ __ ] yeah. Me, let's go. Story number seven. Lucy godamn James is co-hosting Summer Game Fest. This comes from Jeff Keley on Twitter. Jeff says, \"Excited to welcome Lucy James to Summer Gamefest on Friday. She'll be co-hosting the live showcase. See you on Friday.\" So freaking awesome. So proud of her. This is great. She's going to crush it. We're all going to show up and be very excited for her. Yes. This is something I've I've been wanting out of the Jeff Showcase showcases for a while. Like open it up and like get more faces in",
            "start": 3466.72
        },
        {
            "text": "it. We're all going to show up and be very excited for her. Yes. This is something I've I've been wanting out of the Jeff Showcase showcases for a while. Like open it up and like get more faces in front of the camera and get more faces like hosting these things. I think Jeff does a great job. He's great like you know host hosting obviously but he's been doing this for a very long time and I think hosting three events every single year. There's so much room for getting variety in there, getting new faces in there, getting some like somebody like Lucy James who's been in the industry forever and is really great on camera and knows how to host and all that stuff. Like getting uh uh getting more folks opportunities to be on the the like the biggest stages possible. Good on Jeff. Like this is what I've been wanting to see for years. Yep. Good stuff. And love that it's Lucy. Yeah, because I love Lucy. I love Lucy also. You're trying to make a transition or you trying to make a joke about",
            "start": 3512.16
        },
        {
            "text": "what I've been wanting to see for years. Yep. Good stuff. And love that it's Lucy. Yeah, because I love Lucy. I love Lucy also. You're trying to make a transition or you trying to make a joke about the old TV show? Which one? It was that. It was that. Uh, but man, you know, I've been thinking about a lot of things. Big things. I don't have anything, man. I'm all transitioned out, man. It's a big day, too. It is a big day. The Switch 2 was out. Oh, man. But if I want to know about something smaller, where would I look? You'd look toward our last story, the Wii News Channel, where we cover all the small news items you need to know about. That's true. We news everyone from gamesindustry.biz. Ubisoft's Mark Rubin has announced his departure from the company as its live service shooter Xdeantiant is officially sunseted. Reuben who was executive producer on the title shared he was leaving the developer on social media saying quote I've decided to leave the industry and spend more time with",
            "start": 3551.68
        },
        {
            "text": "is officially sunseted. Reuben who was executive producer on the title shared he was leaving the developer on social media saying quote I've decided to leave the industry and spend more time with my family so unfortunately you won't be hearing about me making another game. He wrote um if folks are more interested in that story you should go over to games industry.biz biz cuz he also goes into details about uh more of the stuff that just went wrong with XFiant. A lot of it I think just comes down to bad communication, bad vision, not being given the resources um and like bad like engine stuff like the engine they were working on just wasn't fitting for the kind of game they wanted to make. Um but very fascinating fascinating stuff and also yeah he's leaving the industry like not just leaving the company which is wild but yeah Ubisoft Ubisoft new game pass games coming June 5th we have Balders's Gate 1 and two June 10th James Burke's birthday we have Warhammer 40k coming uh sorry",
            "start": 3594.08
        },
        {
            "text": "leaving the company which is wild but yeah Ubisoft Ubisoft new game pass games coming June 5th we have Balders's Gate 1 and two June 10th James Burke's birthday we have Warhammer 40k coming uh sorry Warhammer 40k Space Marine coming uh June 11th Barbie Project Friendship let's go and Kingdom Two Crowns June 12th EA Sports It's FC25. June 13th, The Altars. June 17th, FBC Fire Break, Crash Bandicoot 4, and Lost in Random: The Eternal Die. Sick, sick, sick. Let's get to some super chats cuz that's it for Wii News. What you got for me, Tim? I don't know. I want to We got Daniel saying that broken switch is one less for a real customer. That's true. I another thing another anecdotal uh thing here is it seems like Switch twos are very well supplied. Like it seems like you you want to get your hands on one, you can get your hands on one. It might not be your first place you go, but it sounds like you put a little effort into it, you'll get one of these things. I saw some stories popping up.",
            "start": 3635.68
        },
        {
            "text": "on one, you can get your hands on one. It might not be your first place you go, but it sounds like you put a little effort into it, you'll get one of these things. I saw some stories popping up. Yeah. I think there was a story about like especially like if you go to a store, you're Yeah. you have a very likely shot of grabbing uh a switch too, which is really exciting. Keeps up. Yeah. Uh, Claw Master says, \"Just want to confirm after the Marvel announcement yesterday, the entire fighting game community lost their mind.\" And yes, Max dude lost his [ __ ] He couldn't speak right. You watched his reaction? No, I haven't seen it yet. Good stuff. I got to get around to it. Real good stuff. Robbie Rob says, \"Stood in line at like 10:30 yesterday at GameStop. Second in line to buy it at 3, second to pick it up at 9, and no staples. Fantastic purchase.\" Hell yeah. Congratulations on the no staples. I don't I want to man I'm going to look into this guy that was banned from Nintendo store.",
            "start": 3696.72
        },
        {
            "text": "to pick it up at 9, and no staples. Fantastic purchase.\" Hell yeah. Congratulations on the no staples. I don't I want to man I'm going to look into this guy that was banned from Nintendo store. Yeah, cuz like what's up with them? You know what I mean? What's your I think I think his attention seeking is working. You're right. I shouldn't pay attention to him. Yeah. Damn. But then how will we do our own research? It's tough. I'm I'm between a rock and a hard place. Real pickle on this one, huh? Favio says Walmart delivered mine. Hey, I need to admit something. Uhhuh. I've never had a pickle in a bag. What does that mean? You know those pickle pickles that they sell in the bag? Oh, yeah. Never. I've never had one of those either. I wouldn't Is that like a popular It's apparently very popular and I love pickles. Are you talking about with brine or without brine? I don't know. Like is there fluid in the bag? Mhm. Okay. Cuz there's there's one they sell at 7-Eleven nearby that has no",
            "start": 3733.36
        },
        {
            "text": "and I love pickles. Are you talking about with brine or without brine? I don't know. Like is there fluid in the bag? Mhm. Okay. Cuz there's there's one they sell at 7-Eleven nearby that has no fluid. It freaks me out. Somebody get me a pickle. See, I feel like you saying cool guy, not the 7-Eleven. You saying you haven't had pickle in a bag is like one of those I think it's one of those things that's specific enough to where it's like me being like I'm not spam. You know what I mean? Like like I I don't know. Well, that's I'm with you. I'm with you. But I think recently people have been telling me like this is a it's a thing. It's a big thing. I've never I don't know if I've ever I don't know if I've ever been walking around walking on the sidewalk, saw somebody walking and they they just they just got a pickle in a bag. Greg Wait, Tim, were you there when I opened when I opened my present that Avery got me? Yes. Yes. That's where the pickle in the bag. That's why it's in your mind.",
            "start": 3779.76
        },
        {
            "text": "they just got a pickle in a bag. Greg Wait, Tim, were you there when I opened when I opened my present that Avery got me? Yes. Yes. That's where the pickle in the bag. That's why it's in your mind. Well, that's one of the reasons why. Greg, can you No, Chad. I've had a lot of spam. Educate me on some pickles here. I love spam, but like I feel like if I hadn't had spam, it wouldn't be that much of a surprise. What is this? Oh, it's a band-aid. So, take it. See, my my natural reaction was to look at myself like, do I have Exactly, Greg? Yeah. Pickles in the bags. These little guys. Yeah. What's the deal? Are they Is this a big deal? Is this like a cultural Some say it's a big deal. Hey, I've never seen this before in my life, by the way. Oh, really? This packaging? No, I've never seen this. Oh, no. Yeah, they're a big enough deal that I mean I think that if you're on the if you're if you're paying attention to pickles like I am, yeah, you'd know about it. Yeah, we had one forever,",
            "start": 3825.28
        },
        {
            "text": "this. Oh, no. Yeah, they're a big enough deal that I mean I think that if you're on the if you're if you're paying attention to pickles like I am, yeah, you'd know about it. Yeah, we had one forever, right, at the original spare bedroom. Is that here? Huh? We had one here for like a year. I got there was one where it was like a bit that somebody sent and we had like I think on the set forever in the old I don't remember that. I don't remember that at all. Fairly certain. Could be wrong but fairly certain. Uh but yeah, pickles in a bag. People love pickles. Don't you love pickles? I do. I just I've never had came blessed cuz he didn't know about those. No, I don't love pickles. Really? Yeah. I don't really mess with pickles like that. [ __ ] If I wanted to try one of these today. Yeah. Like but I want a real one. I don't want a a shitty 7-Eleven one without the Why is I mean I would just I mean I'm going to be straight up with you. I think that's what they are. Oh yeah. I've never I've",
            "start": 3867.28
        },
        {
            "text": "but I want a real one. I don't want a a shitty 7-Eleven one without the Why is I mean I would just I mean I'm going to be straight up with you. I think that's what they are. Oh yeah. I've never I've never been like I want a pickle and I go and I get the pickle in a bag. Like I I do think I'm above that. I either want I want some arteasonal pickles that are like in the jar at the deli. You know what I mean? Where some guy's got to go in with tongs to get them or I'm eating Clawson and I'm probably only eating Clawson's. All right. I'll have to think about this. Wait, but like these are flavored. Yeah, that's I mean that's kind of cool. Yeah. No, that's giving that's very much giving 7-Eleven. The last one is Tatio. And then Tim, the 7-Eleven, the dry Brian one. It's It's only one of them. They still have the one in fluid. The Brian ones. Oh, okay. Yeah. Get over here behind Bless. Throw that back up cuz I remember Andy's got the wrinkle of Texas Mu movie theaters having pickles. Yeah.",
            "start": 3900.96
        },
        {
            "text": "They still have the one in fluid. The Brian ones. Oh, okay. Yeah. Get over here behind Bless. Throw that back up cuz I remember Andy's got the wrinkle of Texas Mu movie theaters having pickles. Yeah. Were they pickles in a bag or were they nice deli pickles like with big? Uh they were uh early on they had the it was the big ass Yeah. The big jug. The big uh Yeah. clear thing and then you know the tongs and they put in the paper bag. But now they've sort of switched over to this. I've seen a lot of like the the Cinemark Beastro have these. You know, they still got them in the valley. Are these good? Are these acceptable to eat? Oh yeah. Okay. There you go. Where would you recommend I get one if I wanted to try a pickle in a bag? I'm telling 7-Eleven. They got them at 7-Eleven. Let's go. All right. All right. Me, you, you get a pickle, I get a hot dog. I don't know if I I'm I've been to 7-Eleven quite a bit nowadays. I don't know if I've seen these show up at 7-Eleven. They're over by",
            "start": 3940.8
        },
        {
            "text": "right. All right. Me, you, you get a pickle, I get a hot dog. I don't know if I I'm I've been to 7-Eleven quite a bit nowadays. I don't know if I've seen these show up at 7-Eleven. They're over by the like egg sandwiches that nobody eats. I'm going to eat a pickle today, guys. We're going to do it. I'm going to go to 7-Eleven or I'm going to have our best men go to 7-Eleven. I'm so excited. I want a hot dog so bad. He won't go to the 7-Eleven, by the way. Oh, you're right. I'm not even gonna ask. I'm not gonna ask. Nor will we answer. Would you believe he he threw a pickle down in front of that 7-Eleven, got banned for life, man? See, you can't y'all got to be careful about what you're doing in front of these stores. You know what I mean? They care. Up, dude. They You're going to cause a riot. 8bit Louise says, \"Happy Nintendo Switch 2day. Tim, tell Kevin to stop supporting X and use Blue Sky instead. Stop Xing and start BSing.\" 8bit Louise, you can't be doing that. Yeah. And here's",
            "start": 3988.0
        },
        {
            "text": "riot. 8bit Louise says, \"Happy Nintendo Switch 2day. Tim, tell Kevin to stop supporting X and use Blue Sky instead. Stop Xing and start BSing.\" 8bit Louise, you can't be doing that. Yeah. And here's here's the thing that I want people to keep in mind because I put the links to the news uh stuff in the document. So, usually Kevin's going off the stuff that I'm putting in there. A lot of news comes directly from X. I don't control where people post things. And so, like I try to use Blue Sky because Blue Sky is now my main platform. Um, so like oftent times I'm I see the Blue Sky post, but like there's a lot of things where if I'm referencing the story, if I'm referencing an X tweet specifically, that's the only way I can do it. It it could also be that I'm logged in on X and not Blue Sky, but it's just because my X is auto login and my blue sky isn't. I don't use social media anymore. Too much work. We all need to grow up. Take that however you will. Fair enough. Also, I don't respect",
            "start": 4027.76
        },
        {
            "text": "but it's just because my X is auto login and my blue sky isn't. I don't use social media anymore. Too much work. We all need to grow up. Take that however you will. Fair enough. Also, I don't respect X. I call it Twitter, but also I don't care anymore. I can't I can't be I also call it Twitter. I can't keep caring about if I'm talking about this thing all the time. I'm just going to call it whatever the [ __ ] I want. I'm sorry. Like we've lost the battle. Trump is president. Everything's gone to [ __ ] I don't know what to do anymore. It was It was Twitter's fault, too. I can't stress about calling it X or Twitter. I don't care. I don't use the platform like that. Anyway, the Frog Knight says, \"Tim, switch to Tony Hawk 3 and four pre-order is up on Best Buy. Exciting times, everybody.\" Uh, Maro Maro says, \"Heading to my local Best Buy to hopefully get a Switch 2. Lady on the phone said they have 25 in stock and five bundles, but I find that hard to believe. Wish me luck.\" I do wish",
            "start": 4066.48
        },
        {
            "text": "Uh, Maro Maro says, \"Heading to my local Best Buy to hopefully get a Switch 2. Lady on the phone said they have 25 in stock and five bundles, but I find that hard to believe. Wish me luck.\" I do wish you luck. I think I think it's going to happen. Hell yeah. Great. Let's do it. Damn, dude. Be able to get it the next day in the morning. That's cool. It's cool stuff. Yeah. Victor Fry says Xbox One had Snap and I loved it. Bring back picturein picture on consoles. You guys, I need you to understand how much I love Fran Mirabella. Every time the rare times I'm with him these days, it always just brings me so much joy. Last night's stream is a perfect example of it. But there's so many memories I have of Fran that will just never leave this noggin of mine. And one of them is him reviewing the Xbox One when it first came out and him essentially turning one of the IGN demo rooms into his private office for an entire week. [ __ ] yeah. As he had the Xbox One and the Connect set up and he was",
            "start": 4112.16
        },
        {
            "text": "Xbox One when it first came out and him essentially turning one of the IGN demo rooms into his private office for an entire week. [ __ ] yeah. As he had the Xbox One and the Connect set up and he was just in there all day yelling at that thing, snapping things. Hell yeah. And just living his Fran life, you know what I mean? Xbox on, Xbox on, Xbox on for hours a day. We're all just trying to work. Hearing Fran just say Xbox on He's playing like Dead Rising 3 on the screen with like football playing in the corner. He's like, \"All right, that means it's working over there.\" This is the [ __ ] life. Uh Nova says, \"Not Switch, but yesterday's PlayStation State of Play was a repeat of E3 2018 for me. That's where Dragon Ball Z Fighters and Tetris Effect were originally shown. Both were my personal games of the show. Wow. That is kind of a fun little Yeah. Everything kind of comes back around in circles. It rhymes. Poetry. George Lucas said that it rhymes. Poetry. Well, it's it's like",
            "start": 4155.84
        },
        {
            "text": "personal games of the show. Wow. That is kind of a fun little Yeah. Everything kind of comes back around in circles. It rhymes. Poetry. George Lucas said that it rhymes. Poetry. Well, it's it's like poetry. It rhymes. Oh, that was him trying to defend the prequels. I Who was I I Oh, you know what? Never mind. I was going to make a reference to a different podcast. You ever listen to a podcast and then like you try to recall it and you think it was like in you you were having a conversation earlier and then you realize it wasn't a conversation you had. It was a podcast that you were listening to. Anyway, what's the next super chat? That's all. That's it. That's those chats. Did we get anything wrong on this episode? Impossible. Absolutely not. Let's see. Let's see. Okay. Okay. Um, Kabad says, \"Worth noting the No Man's Sky update also makes the cross functionality available to all players. It was in beta before, now it works with Switch, too.\" That's cool. Sick. Um, that's probably",
            "start": 4208.4
        },
        {
            "text": "says, \"Worth noting the No Man's Sky update also makes the cross functionality available to all players. It was in beta before, now it works with Switch, too.\" That's cool. Sick. Um, that's probably from yesterday, right? Yeah, it's yesterday. Castrol said, \"Uh, well, whatever. I'll read it. I'm in a giving mood.\" Tim said that this was the launch of the most satisfied customers. That's not true for Target pre-order customers who had their Switch to ship on launch day. FedEx Ground to arrive a week late. I did specifically call out Target. Yeah, you did. Damn. You did. You know what I mean? He's giving out ass whoopings. He got you, bro. I don't know who got who there, but I Oh, no. You got him. I believe in it. Okay. Um, what the [ __ ] We got some weird [ __ ] in here today. Um, interesting. Bless you. Condors Condor says, \"As somebody who worked fulfillment at Target during the Xbox Series X and PS5 launches, the package generally won't go out until late afternoon because that's",
            "start": 4253.44
        },
        {
            "text": "Bless you. Condors Condor says, \"As somebody who worked fulfillment at Target during the Xbox Series X and PS5 launches, the package generally won't go out until late afternoon because that's when the shipping company picks up the day shipments, at least from the store, can't speak to shipping warehouses. We had a daily deadline to finish by 4:30 and shipments for pre-orders generally and annoyingly don't go out until early the next week. That's crazy. Yeah. So, it sounds like don't go to Target, but also don't trust like go and pick it up, you know? Like, it's really cool that Walmart did this, but this is not the norm. It should be, man. Figure it out. Everybody goddamn Pringles. Cameron Kennedy one's pretty good. Cameron Kennedy says, \"Hey y'all, if you do a local switch one to two transfer, it doesn't delete everything. If you choose the option, we don't have the two yet. It uploads everything and wipes your switch one.\" Tim was only half wrong. Take back the apology, please. I",
            "start": 4300.44
        },
        {
            "text": "it doesn't delete everything. If you choose the option, we don't have the two yet. It uploads everything and wipes your switch one.\" Tim was only half wrong. Take back the apology, please. I will take back the apology. Thank you, Cameron Kennedy. Thank you. There you go. He's not a liar, guys. Man, that was that's, you know, I I understand the stress that you're under. Yeah. That reminds me of the time that I thought uh Tom Cruz's name was Tom Steamboat. You know, like we both were equally equally equally wrong. Equally right. Equally right. We're both half. I hate this. Don't let him wrong his rights. No. Right. Jesus. I guys, you're right. Now I'm Kevin's with us. I'm equally Kevin's in the same boat with us. The same steamboat. The same steamboat. Axita writes in and says and just says, \"No, Christians cannot wear tattoos.\" I I don't know what that was a reply to. I I don't know. I don't I don't think we even mentioned tattoos this whole episode. I also have never heard wear",
            "start": 4343.12
        },
        {
            "text": "says, \"No, Christians cannot wear tattoos.\" I I don't know what that was a reply to. I I don't know. I don't I don't think we even mentioned tattoos this whole episode. I also have never heard wear tattoos. Neither of us even have tattoos. So, I kind of like that though. Wear tattoos. But you're not wearing it though, right? Like it's injected into your skin. I think I've heard wear tattoo. It's embedded into your skin. There's a bunch. Also, I know plenty of Christians that have There's a bunch of Christians in the chat that have tattoos. Yeah, it's definitely not. I grew up in church and like there were plenty of tattoos there. You grew up in a church? Yeah, I practically grew up in that church. Let me tell you, I was there all the time. It was my It was my second home. Mr. Hawk says, \"I transferred my Switch profile to the cloud last week in preparation to download on my Switch 2. After everything was uploaded, the system prompted me to wipe it. If I turn it on now, it starts up",
            "start": 4392.48
        },
        {
            "text": "\"I transferred my Switch profile to the cloud last week in preparation to download on my Switch 2. After everything was uploaded, the system prompted me to wipe it. If I turn it on now, it starts up into the system setup process.\" So, yeah, we have actual evidence from Mr. Hawks. Wow. Backing up what Cameron Kennedy said. You'll love to see it. Kebab says to explain the George Lucas thing, the prequels often repeated specific story beats from the original trilogy, such as character escapes by hiding their ship on the back of something in an asteroid field. Lucas said, \"It's like poetry. It rhymes. Hopefully, it'll work. I'm going to stop asking things, you know, because I didn't need to know any of that. I didn't need to know any of that. I try to I I try to not think about the prequels. Um, and then Well, Kab's also got your [ __ ] ass. Okay. Golly. Bless didn't think Tom Cruz's name was Tom Steamboat. He was trying to guess his last name based on Tim saying his last name is shared",
            "start": 4434.32
        },
        {
            "text": "Um, and then Well, Kab's also got your [ __ ] ass. Okay. Golly. Bless didn't think Tom Cruz's name was Tom Steamboat. He was trying to guess his last name based on Tim saying his last name is shared with the type of ship. Yeah, but like if I explained it that way, it wouldn't have been as funny as a joke. You know what I mean? Like sometimes I say things because they're funny, not because they're factual. Follow what I mean, not what I say. Right, the wrongs, wrong the rights, everybody. Kind of funny. We're here and Games Dy's done, but the fun's not done. We're about to start more fun. We're streaming games. Yeah, we are. I don't know who's going to come out. I don't know who's going to play, but you're going to [ __ ] have a good time. I'm going to have a good time. We're all going to have a good time. Kevin, are you going to have a good time? I'm going to have so much fun. Let's get beers and pickles. I want a goddamn pickle. Oh, they might have one across the street. I don't know",
            "start": 4473.76
        },
        {
            "text": "a good time. Kevin, are you going to have a good time? I'm going to have so much fun. Let's get beers and pickles. I want a goddamn pickle. Oh, they might have one across the street. I don't know that I trust that. What? Sometimes I'll order chips from across the street and I'll be eating them and I'm like, \"This is stale as [ __ ] dude.\" What do you mean you order? Like when you go to a store and you buy a thing. Call that ordering. No, that's not ordering. Ordering is when you get You wear tattoos, too. Bless. Wait, wait. What's define order? So, you you get your phone, you order it, and then it gets delivered to you. Okay, you know what? That's fair. I never thought about that. I just always thought order was like the same literally the same as buy is how I would use it. I don't think so. Like when you when you walk into order something in real time and like if you walk up to the the the like you order a sandwich, you know what I mean? You walk up to the sandwich vendor and you say",
            "start": 4511.36
        },
        {
            "text": "Like when you when you walk into order something in real time and like if you walk up to the the the like you order a sandwich, you know what I mean? You walk up to the sandwich vendor and you say seenor sandwich vendor. I would like I'm not saying that. Do you add a g to sandwich? You know why say we say sandwich that way? You've heard it my whole life. Wait. So okay. If I Latin, by the way, if I if I if I order something, basically it has to come to me sometime in the future. No, no, no. What I'm I order someone in the chat says order implies a wait, which I I think inherently You know what? That's fair. No, now that I think about it, that makes sense. And uh Tim, to clarify, in Spanish, the word sandwich is sanguch. So, it gets transmoged to English, you know. Yeah. where it kind of looks like a Spanish word cuz it kind of looks like I can't say I ordered cuz it kind of look but bless I'm think it looks like a Spanish word in my head. You get what I'm saying? I love that it's just",
            "start": 4551.44
        },
        {
            "text": "like a Spanish word cuz it kind of looks like I can't say I ordered cuz it kind of look but bless I'm think it looks like a Spanish word in my head. You get what I'm saying? I love that it's just in the chat just says not true and I don't know what that's in reference to but I think that's a great place to end this episode of kind of funny games daily. It's been a fun All right, hold on. Sandwich is a torta. That's nonsense. That's nons tora means cake. Tortra means cake. I understand that people from Mexico have this weird thing where they're like, \"Oh, it's a sandwich.\" No, it's a cake. For the record, I don't cosign anything he just said. Like, I'm sure it's fine, but I can't tell if it's not what he just said. But I don't cosign any of that. I love I love that you dropped transmog. That's [ __ ] awesome. That's because I add the G, so it looks like a Spanish word. Until next time. Happy Switch Day game daily. Damn. Hey. Hey. [Music]",
            "start": 4603.04
        }
    ]
}