{
    "id": 14288,
    "video_id": "TFmdZWEalY0",
    "show_name": "Highlights",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Andy Cortez",
        "Blessing Adeoye Jr."
    ],
    "title": "We Played Invincible VS...",
    "description": "Go to http://kindafunny.com/XREAL to grab yours now!\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\n\nFOLLOW US ON EVERYWHERE!\n---------------------------------------------------  \nYouTube: Youtube.com/KindaFunnyGames\nTwitch: https://www.twitch.tv/kindafunnygames\nPatreon: https://www.patreon.com/kindafunny/\nTwitter: https://twitter.com/KindaFunnyVids\nInstagram: https://www.instagram.com/kindafunnyvids/\nTikTok:  https://www.tiktok.com/@kindafunnygames?lang=en",
    "published_at": 1749591814,
    "duration": 974,
    "transcript_chunks": [
        {
            "text": "Invincible versus that's a good intro to Invincible obviously. Exactly right. They did exactly what they did in the uh showcase as well. Um you got to play it this fighting game u from Skybound Games, their new developer, Quarter Up. Quarter up. Pretty cool 3v3 tag fighting game set in the Invincible universe. How long did you get to play and what did you think? So about three weeks ago I got to go down uh to the animation studio where they animate Invincible. Um, and I was there for about an hour. The first half was them showing us the trailer and then presenting the game to us and talking about it. And then I got to spend about 30 minutes with my hands on the sticks and it was me and a developer and I was playing and he was telling me certain things of like how certain mechanics work and Question for you real quick. What up? Your hands on the sticks at this point. Blessing Adoya Jr. 2025 fighting games are back bigger and better than ever. Are sticks actual arcade fighting sticks or",
            "start": 0.16
        },
        {
            "text": "Question for you real quick. What up? Your hands on the sticks at this point. Blessing Adoya Jr. 2025 fighting games are back bigger and better than ever. Are sticks actual arcade fighting sticks or are you still on the controller? I'm still on the controller. I'm still on the controller. Right. Like for me it's I I have fighting I have multiple fighting sticks. I even have on my desk a um not hip-hop spell but leverless uh fighting stick that I have there just for aesthetics. Just for aesthetics honestly like I really tried with the stick. I just can't I'm part of the culture but you know. Yeah I'm part of the culture but like I'm using a controller cuz that's what I'm used to and that's what I'm going to kick ass with. Uh and so yeah they gave me I think it was an Xbox controller honestly. Um but I went down Yeah. three weeks ago. I walk into the the animation studio and looked around and I was like huh so this is where y'all be taking forever at. This is where you'll be taking your",
            "start": 42.0
        },
        {
            "text": "Um but I went down Yeah. three weeks ago. I walk into the the animation studio and looked around and I was like huh so this is where y'all be taking forever at. This is where you'll be taking your sweet time making Invincible season 3 or four or whatever on right now. Um, yeah. So, I got to play 30 Minutes and Greg, I'm curious cuz it sounds like you got to check it out, too. Yeah. Did you play it? Yep. Oh, yeah. I can't wait to talk to you about that. Um, I have a lot of takeaways. So, we saw this a couple of days ago. It was revealed at the Xbox showcase on Sunday and then the studio got a press release on Monday kind of breaking down a little bit about uh Quarter Up. At that reveal, I think all of us were kind of trepidacious about, all right, like, you know, we're seeing this after the Marvel fighting game was announced. Oh, we got 2X KO. Oh, man. It seems kind of like a crowded space. Oh, this is an original studio under Skybound. Now that I I can actually talk about this freely,",
            "start": 76.56
        },
        {
            "text": "Marvel fighting game was announced. Oh, we got 2X KO. Oh, man. It seems kind of like a crowded space. Oh, this is an original studio under Skybound. Now that I I can actually talk about this freely, my main takeaway from my preview is that one, this game is early. The studio started in 2023, and playing the game feeling and getting my hands on it right feels kind of early. Um, this game might be niche compared to a Street Fighter or Mortal Kombat, but I do think that this game will find its place. I think this game, from my limited time with it, was very fun to play. I like it visually. I like it conceptually. I totally understand the um the concern around Invincible as an IP. Is there enough meat there to garner a community of like a fighting game based community? Is this the right direction? I think it is. I think that with the characters you have here and the team you have working on it, that's the place to start with it cuz this is QuarterUp Studios. Like I mentioned, they started",
            "start": 117.76
        },
        {
            "text": "I think it is. I think that with the characters you have here and the team you have working on it, that's the place to start with it cuz this is QuarterUp Studios. Like I mentioned, they started in 2023. This studio is a majority of is majority made up of people that worked on Killer Instinct 20 2013, which was the Xbox One launch Killer Instinct. That studio went on to be um uh taken by Amazon and the development for that game. pow, shut up, get in the car. But yeah, and that the development for that game uh got passed on to Iron Galaxy and they saw it through post-launch updates and all that stuff. And so Amazon ended up adopting that studio, having them work on um their internal games and a lot of the people that worked at that studio ended up leaving, right? And um this game was pitched to Skybound from people originally from that studio, higherups from that studio that were like, \"Yo, we want to make an invincible fighting game.\" And so this is coming from people who want to make",
            "start": 163.04
        },
        {
            "text": "to Skybound from people originally from that studio, higherups from that studio that were like, \"Yo, we want to make an invincible fighting game.\" And so this is coming from people who want to make this game, right? This isn't a Skybound. We want to make a fighting game. Let's search out some people. Let's do this. No, this is people who are I would describe as fighting game sickles. Like one of the first things I heard when I walked in were like the studio heads. They were like, you know, chilling waiting for everybody to get there for the presentation cuz they're like doing it in groups of four media people at a time and they're sitting around like the donuts and food that were there and they were talking about Marvel vs. Capcom as soon as I got there. They were already talking about other fighting games and [ __ ] and getting real nerdy about it which uh had me excited. But uh this is a 3v3 tag fighter. Um slated for 2026. Um it's on everything and talking more about my takeaways",
            "start": 210.24
        },
        {
            "text": "fighting games and [ __ ] and getting real nerdy about it which uh had me excited. But uh this is a 3v3 tag fighter. Um slated for 2026. Um it's on everything and talking more about my takeaways from it of playing it. It is colorful. It is vibrant. It is very violent which I like. And it feels like a meld of certain things picked from certain other fighting games. Right. You got the 3v3 from Marvel vs. Capcom. You got the superhero sort of feel in combat of something I'd say like an Injustice. And then you also have, yeah, the violence of a Mortal Kombat minus the fatalities, right? But you do have essentially brutalities where there are certain ways that you end matches that'll explode somebody's head or explode somebody into a million pieces. I was like, \"Do you have fatalities?\" They're like, \"No, you're just going to punch him to death.\" Yeah. Cool. Exactly. Um, they also have custom intros for certain characters where you'll enter a fight and it is Mark saying something to",
            "start": 244.0
        },
        {
            "text": "They're like, \"No, you're just going to punch him to death.\" Yeah. Cool. Exactly. Um, they also have custom intros for certain characters where you'll enter a fight and it is Mark saying something to Omniman. In the build that I played, they only had four characters. They had Mark, they had um Adam, they had Thula, who's one of the ultrammites, and then they had bulletproof. Exact same build I had. Cool. Yeah. And then I one of the questions I asked was, \"How many characters are we looking at?\" Exact same question I asked. I counted I literally counted the character slots and there were 17 character slots, but when I asked them, they were like, \"Hey, we're still figuring that out. We want to like, you know, we're that's one of the things that we're still working on for launch is seeing what characters we can get in there.\" And one of the other questions I asked was, \"What is the challenge of making a game that has a lot of people that are just very strong Superman style heroes,",
            "start": 288.24
        },
        {
            "text": "what characters we can get in there.\" And one of the other questions I asked was, \"What is the challenge of making a game that has a lot of people that are just very strong Superman style heroes, right?\" and they talked about how they were looking at certain character qualities and character aspects and making them feel original. Mark, for example, is like a straightup brawler, right? Very physical character. You have Adam Eve who is very projectile based. Um Thula though is mid-range cuz she has like that long ponytail that she'll use to like kind of like almost like a Scorpion style throw at you to pull you in sort of thing. Bianca Beller. Yeah. Yeah. She has the Bianca Beller little whip action. Yeah. So, they balance that a lot as far as how they're approaching these different characters. But one of the things I really liked as well was the tag format where I'm like, \"All right, cool. I'm do I'm using those three cuz I'm not really a bulletproof guy.\" Um, you're not? No. Yeah. But",
            "start": 319.28
        },
        {
            "text": "But one of the things I really liked as well was the tag format where I'm like, \"All right, cool. I'm do I'm using those three cuz I'm not really a bulletproof guy.\" Um, you're not? No. Yeah. But like in in getting my hands on it, right? It is pretty simple to control. You have your light, medium, heavy, but then you also have um a tag button and you have a special button. Specials are uh work kind of like in Smash Brothers where uh you press a direction and you press A. Um and it's using a special, right? They wanted to develop this game to be friendly for casual players, newcomers, all that stuff. But then also they described it as a tournament quality brutal fighting game. Um, and they didn't really name drop EVO as much, but they made it seem like, yo, we want this game to show up at EVO. We want this game to show up um, at those spots. And in a lot of ways, in that way, it feels like a Dragon Ball Fighters where Dragon Ball Fighters had the auto combos. Dragon Ball Fighters had",
            "start": 356.88
        },
        {
            "text": "EVO. We want this game to show up um, at those spots. And in a lot of ways, in that way, it feels like a Dragon Ball Fighters where Dragon Ball Fighters had the auto combos. Dragon Ball Fighters had the easy special moves to do. Dragon Ball Fighters. I I forget if Dragon Ball Fighters did this, but this game has like the if you hold a tag your tag button while doing a combo, it'll automatically tag out and continue your your combo with the player that you tag in, right? Like this game controls the way that you want it to control for a 3v3 tag game. And I had a lot of fun with it. This episode's brought to you by XRE. Y'all know that a few months ago, my life changed forever when I brought a pair of XR1 AR glasses on a long flight to New York. I legit could not believe how easy it is to use and high quality my experience was playing games, watching movies, TV shows on the plane without just too much extra stuff around me or especially not a giant goofy headset around my head. No joke,",
            "start": 394.48
        },
        {
            "text": "and high quality my experience was playing games, watching movies, TV shows on the plane without just too much extra stuff around me or especially not a giant goofy headset around my head. No joke, this is my favorite new tech product in years and it has earned a permanent spot in my travel bag. It is only hard to believe that it works as well as I'm saying until you try XR1 AR glasses for yourself and then you will see that the future is now. The tech is here. Connect XReal 1 glasses to wherever you are playing. Whether it's a handheld console, a PC, phone, home console. You just get a massive 150in virtual screen anywhere, anytime for any game. Gaming on the go like a long haul flight, you need the XR1. Next, starting to hurt from staring down at your handheld, we've all been there. You need an XR 1. A screen as big as your wall. Instant plugandplay with all of your devices via USBC. Built-in audio with sound by Bose. Anchoring your screen anywhere in space. It's awesome. It just",
            "start": 433.44
        },
        {
            "text": "need an XR 1. A screen as big as your wall. Instant plugandplay with all of your devices via USBC. Built-in audio with sound by Bose. Anchoring your screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full HD. These are what make XR1 a musthave. And we hear XR1 Pro is coming soon with an even bigger virtual screen. Hit our link below to get your XR glasses today. There's nothing better than when a sponsor of Kind of Funny is something that we are legitimately obsessed with, and that is exactly the case here with XRE. You're going to hear me talking about these forever. Go to kind offunny.com/xreal. That's kind of funny.com/xre al. I promise you, you are going to love these things. This episode's brought to you by Factor. Summer Gamefest is here. The Switch 2 is here. The sun is here. So many summer things are here. And the number one thing you don't want to be doing all summer, spending hours cooking inside. That's where Factor comes in. Factor chef crafted",
            "start": 482.8
        },
        {
            "text": "here. The sun is here. So many summer things are here. And the number one thing you don't want to be doing all summer, spending hours cooking inside. That's where Factor comes in. Factor chef crafted dietitian approved meals are ready in just 2 minutes. taking the hassle out of eating. Well, we love Factor here at Kind of Funny and Greg's often making and enjoying meals quick in between shows here in the studio. I just had a roasted garlic chicken and I'm telling you, you would have loved it. Factory meals arrive fresh and ready to eat, perfect for any active lifestyle over summer and beyond. With 45 weekly menu options, you can pick gourmet meals that fit your summer gains and goals. Choose from options like calorie smart, protein plus, keto, and more. Get started at factormeals.com/kindfunn5050 off and use code kind offunny50 off to get 50% off plus free shipping on your first box. That's kind of funny off at factormeals.com/kindfunny50 off for 50% off plus free shipping.",
            "start": 533.6
        },
        {
            "text": "off and use code kind offunny50 off to get 50% off plus free shipping on your first box. That's kind of funny off at factormeals.com/kindfunny50 off for 50% off plus free shipping. Factomeals.com/kindfunn 50 off. Greg, what did you think? Uh yeah, I'm not the fighting game guy, right? So when, you know, we heard Invincible Game, I was like so stoked. Then it was fight. I'm like, \"Oh, okay.\" Sitting down and playing it like I don't know what I'm doing obviously. You know what I mean? And I was sitting with, you know, the gameplay director or whatever his title was. So there was no chance for me to actually play somebody also who didn't know what they were doing. Uh it's really pretty. Uh I'm always going to be down for more invincible uh you know, anything. Uh the blood of it was nice. I think the tag stuff was cool. I was playing on simplified controls, they said. Uh, so it was easy to call in support and get them in. You know, they were teaching me the combos to get people to come",
            "start": 577.36
        },
        {
            "text": "think the tag stuff was cool. I was playing on simplified controls, they said. Uh, so it was easy to call in support and get them in. You know, they were teaching me the combos to get people to come in. Like that right there where the blue invincible came in to help out Eve and stuff. Uh, but it was Yeah. Cool. But I was so thankful you had played it ahead of time. Yeah. Because Yeah. I was like, I got I don't you know what I mean? Like I I don't know if it's good, bad, or other. It was pretty and it was fighting and it was bloody, but it's that same thing. I was like, is there a story mode to this? Like Yeah. Cuz I was like, you know, in you know, uh, Injustice, right? Like, yeah, we're going to have that. I'm like, okay, cool. But I don't even know what that if I actually play it. That was one of the things that I didn't get clarification on. Forgot to ask. Also, one thing to shout out is that this is pre-alpha gameplay footage. I think I don't know if we're blocking it with our",
            "start": 621.44
        },
        {
            "text": "was one of the things that I didn't get clarification on. Forgot to ask. Also, one thing to shout out is that this is pre-alpha gameplay footage. I think I don't know if we're blocking it with our video, but they wanted us to shout that out. But yeah, that was one of the things I was mainly concerned about when I'm thinking about things that might bring it forward and things that might hold it back cuz as I'm playing this, I'm like, \"Oh, this is something that I think the fighting game community is actually going to like a lot.\" Like I mentioned, it's not on that Street Fighter, not on that Mortal Kombat level of it. But I do think it's good enough to where you could see a lot of hardcore fighting game uh community get into it. But I was thinking about the Greg Millers of the world, people that I know might love Invincible but might not love fighting games. And coming out of it, I was like, man, I wish I I asked about a story mode because Invincible as an IP, if you're putting if",
            "start": 653.04
        },
        {
            "text": "that I know might love Invincible but might not love fighting games. And coming out of it, I was like, man, I wish I I asked about a story mode because Invincible as an IP, if you're putting if you're putting out an Invincible game, you should have a story mode that does something with those characters that might get you interested. Yeah. Just like Injustice did, right, where Injustice one, I suffered through the entire thing to see the story. Yeah. Do you think that they Is there any part from either of you that you think maybe they showed this off a little too early? I see I I wonder cuz like it says 2026 in the trailer I believe. I don't know if I believe it yet. Maybe once we get closer to it like things start to ramp up or maybe this is one of those games where they're like, \"All right, we launch it bare bones, but we're going to improve it as it goes.\" That's what I think. I I see this coming out very early 2026 and then kind of just doing what it does. Yeah. I honestly part of",
            "start": 683.04
        },
        {
            "text": "we launch it bare bones, but we're going to improve it as it goes.\" That's what I think. I I see this coming out very early 2026 and then kind of just doing what it does. Yeah. I honestly part of me would like it to get delayed to 2027 cuz when we're talking about 2026, we're talking about 2x KO and I believe Marvel the fighting game that just got announced got a 2026. Yeah, Tokcon Fighting Souls. I believe that got a 2026 window as well. Correct me if I'm wrong. I don't think this game should come out the same year as those games, right? I think this game has a really good opportunity to capture an audience. But three tag fighting games in the same year, I think is going to do is not going to do this thing the justice it deserves. Um, and I think they they have their heads on straight as far as like their approach to it. The combos felt fun. The combos kind of reminded me a little bit of uh Killer Instinct from 2013, right? The violence of it I think is novel in the way that like",
            "start": 725.04
        },
        {
            "text": "as far as like their approach to it. The combos felt fun. The combos kind of reminded me a little bit of uh Killer Instinct from 2013, right? The violence of it I think is novel in the way that like usually only Mortal Kombat is like the the franchise, the fighting game franchise that has like the blood and the splatter and all that stuff. I like what they're doing uh here with that. Honestly, it reminds me if we're putting talking about tiers of fighting games, right? I would put this somewhere around that Fatal Fury, if not maybe even above Fatal Fury as far as like how expensive or or non-expensive or how budget it might feel. Like I think there will be a community for this, but depending on how it gets placed, depending on where it falls, it could be a challenging thing. Did you ever play Power Rangers Battle for the Grid? No, I didn't. because that I keep thinking of that game seeing this and like talking about even it being based on IP that is like people like but it's not you",
            "start": 766.4
        },
        {
            "text": "play Power Rangers Battle for the Grid? No, I didn't. because that I keep thinking of that game seeing this and like talking about even it being based on IP that is like people like but it's not you know something that I think is going to bring in millions and millions of people but Kev can you bring up Power Rangers Battle for the Grid? Uh cuz I haven't seen gameplay of that in years so I want to just make sure that I'm not like totally talking out of my ass here. Like I think that it's fairly similar. I think this is more Marvel vs Capcom tag Fighty than that one is. But um you saying that you'd put this potentially even above a Fatal Fury. That surprises me cuz I I know that that is a lower end fighting game, but it's still at its core like a proven entity in the space and like does every once in a while show up at a EVO or something. Well, I I think the reason I for me I'm looking at it as presentation and how good it feels to play and Fatal Fury, the the latest one, City of the",
            "start": 803.68
        },
        {
            "text": "once in a while show up at a EVO or something. Well, I I think the reason I for me I'm looking at it as presentation and how good it feels to play and Fatal Fury, the the latest one, City of the Wolves, that feels good to play and that looks good, but you can tell like it's like this is nowhere close to a Street Fighter kind of thing. I think from what I played Invincible Versus, I think it's I think it looks better and it's going to play better than Fatal Fury in my opinion, right? And like I played more even King of Fighters 15 uh than I played Fatal Fury. Invincible Versus has the stuff. And even as I'm looking at this, I totally understand where where you're coming from, Tim. But I I I do think the like 10 years ago as well. So Oh, gotcha. Gotcha. Gotcha. Yeah. I think the pedigree of the the people working at the studio here might speak more towards like it just feels a bit more natural. It feels right. Fighting games in terms of game feel oftent times like it's very it's very",
            "start": 843.28
        },
        {
            "text": "of the the people working at the studio here might speak more towards like it just feels a bit more natural. It feels right. Fighting games in terms of game feel oftent times like it's very it's very clear when something when a game doesn't have it. I think this game has it like and another thing to mention too of some things it does, right? It has like um they call them they have devastation arenas and they also have this thing called arena shifts, right? Um in quite a few of the areas uh there's a stage that's like the city stage that you're playing at. And as the fights progress, you have [ __ ] destru uh getting destroyed in the background. And like the stage looks completely different from the beginning of the match um versus the end of the match based off of like the destruction that happens. Uh but then also midway through they have special moves where if you do it you can knock somebody all the way to the moon and then all of a sudden like you're playing on the moon kind of",
            "start": 882.72
        },
        {
            "text": "happens. Uh but then also midway through they have special moves where if you do it you can knock somebody all the way to the moon and then all of a sudden like you're playing on the moon kind of thing. Yeah. Like they have th those novel things. Now again I think because of the IP maybe that lessens like the it does this weird thing where I think it concentrates like the amount of people that might be interested in an invincible thing but also then captures the people that are already into invincible. So, I I do think there's the double-edged sword, and that is probably where the Power Rangers thing comes from as far as all right, we're talking about Invincible here, and you're turning that into a fighting game. But, I also think the fighting game community, if you make something that plays really good, IP almost doesn't matter. Like, I IP can just be like kind of the flavoring to, oh man, no, I just want to play Invincible Versus because the game is fun. Yeah, cool stuff. I hope it",
            "start": 923.84
        },
        {
            "text": "really good, IP almost doesn't matter. Like, I IP can just be like kind of the flavoring to, oh man, no, I just want to play Invincible Versus because the game is fun. Yeah, cool stuff. I hope it has a story mode. Yeah, I wouldn't play through",
            "start": 958.96
        }
    ]
}