{
    "id": 14268,
    "video_id": "TvPjgiDYei0",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Mike Howard",
        "Parris Lilly"
    ],
    "title": "Donkey Kong Bananza Nintendo Direct IMMINENT - Kinda Funny Games Daily 06.16.25",
    "description": "Go to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\n\nWe’re here to talk about video game news!\n\nToday after, KFGD, you’ll get:\n - A GAMESCAST all about Handheld Gaming in 2025\n - After Gamescast is the Kinda Funny Podcast where Joey has to deal with Nick and Greg.\n - Then the STREAM is kicking off Naughty Dog Week with Crash 2 & Crash Team Racing!\nIf you’re a Kinda Funny Member:\n - Today’s Gregway is 14 minutes about if Doomsday will show up in James Gunn’s DCU.\n\nTime Stamps:\n00:00:00 - Start\n00:06:13 - Housekeeping\n         -  The Roper Report   -\n00:09:27 - Nintendo Direct WEDNESDAY!\n00:17:20 - Nintendo Switch 2’s INSANE First Week IN DETAIL\n00:28:30 - First Gears Beta Weekend\n00:32:35 - Amazon and Nintendo Might Be Making Up\n00:36:11 - Early Testers Liked Death Stranding 2 Too Much\n00:41:29 - The Witcher 4: CD Projekt Is Taking a 'Console-First' Development Approach\n00:48:33 - Stellar Blade Sold 1 Million Copies In Just 3 Days On Steam\n00:50:20 - Wee News!\n00:55:19 - SuperChats & You‘re Wrong\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1750097388,
    "duration": 3600,
    "transcript_chunks": [
        {
            "text": "Today's stories include a Nintendo Direct for Donkey Kong Bonanza announced Switch 2's insane first week and Kajjima had to make Death Stranding 2 worse. We'll have all that and more on today's kind of funny games daily. [Music] Good morning gamers and welcome to Kind of funny games daily for Monday June 16th 2025. I'm one of your show hosts Snow Bike Mike and today I am joined by one of my gaming dads. Happy Father's Day to one of the coolest dudes around Mr. Paris Lily. Paris, how are you big dog doing? Good. Thank you. Look, happy Father's Day to you. I saw I saw what Sarah Bond sent you. Still one of the most hilarious things I have ever seen and I love that they're keeping it going. So freaking good. Yes. Uh thank you to Sarah Bond and team Xbox for year two of celebrating Snowike Mike's Father's Day. Uh you know fun. I truly appreciate the card. I now have two Sarah Bond postcards that I have framed in my gaming studio. So I'm very lucky for that. But Paris, of course, happy",
            "start": 3.36
        },
        {
            "text": "Mike's Father's Day. Uh you know fun. I truly appreciate the card. I now have two Sarah Bond postcards that I have framed in my gaming studio. So I'm very lucky for that. But Paris, of course, happy Father's Day to you and the family. How was it this weekend, big dog? Oh, it was good, man. Just uh Dad, you know, let's put it this way. Dad wouldn't cut the yard first thing in the morning. Yes. Yes. But then, you know, kids got up, they gave me some wonderful gifts, and I have to barbecue. You know, my my wife made breakfast, the whole thing, but I have to barbecue. So, I smoked some ribs and I actually made a video I was going to post uh trolling Khalif and I was like, you know what? It's Father's Day. No violence today. I I'll put it out at a later date. It was no violence. It was good. Oh, that's great to hear. Paris, any gaming over the weekend? Of course, big dad's got to work. He's got to cut the grass. He's got to cook for everybody, but did you sit down on the couch and play any",
            "start": 62.32
        },
        {
            "text": "that's great to hear. Paris, any gaming over the weekend? Of course, big dad's got to work. He's got to cut the grass. He's got to cook for everybody, but did you sit down on the couch and play any games? So, I want to shout this game out because um I I was lucky enough to go over to Poland for the preview event for it uh some weeks back. I now doing my second playthrough of The Altters. Um I played it on Steam. Now I jumped on Xbox. I'm playing it on Xbox. It's one of the best games of this year, man. It's really, really good. And and the basic premise of it is, let me let's do the combination here. It's a survival game. It's it's a base builder. It's resource management, and it's a story about different versions of yourself. That's what the altars are, right? And there's potentially 11 different versions of yourself that'll be in this game. But the twist is it's different life choices at different points in your life. If if that makes sense. It's like a certain point in your life",
            "start": 108.64
        },
        {
            "text": "different versions of yourself that'll be in this game. But the twist is it's different life choices at different points in your life. If if that makes sense. It's like a certain point in your life you instead of me meeting my wife, what would happen if I didn't, right? What would happen if I went to college instead of me going to trade school? Just simple stuff like that. But these changes completely create a different version of yourself. And you're stranded on this planet. And the whole reason you have to create these altars is you're by yourself. You're you're you're uh Yan. and you have to create these different versions of yourself to help you get off of this planet before you essentially you die. And the story is phenomenal. There's not like all these big enemies you're fighting or anything. It's like I said, it's the survival aspect, the base building aspects of it, and then it's the story of you dealing with different versions of yourself and them being self-aware that they",
            "start": 159.84
        },
        {
            "text": "anything. It's like I said, it's the survival aspect, the base building aspects of it, and then it's the story of you dealing with different versions of yourself and them being self-aware that they are clones, right? And again, I don't want to spoil too much of it. I'm just telling everybody right now, you want to play this game. It is that good. 11bit has to be one of my favorite publishers out there from Frost Punk to obviously here playing the altars right now. Moonlighter 2, which is coming pretty soon. I'll have more to talk about that, you know, down the road. But they've quickly become one of my favorite publishers out there because I love the uniqueness of their game. So, if you're looking for something different to play in 2025, go check out the Altars. Which, by the way, Mike, it was you and I were doing the partner preview 2 years ago when they first debuted this that they saw our reaction to that, which is why they wanted me to come out and preview the game and obviously",
            "start": 198.88
        },
        {
            "text": "it was you and I were doing the partner preview 2 years ago when they first debuted this that they saw our reaction to that, which is why they wanted me to come out and preview the game and obviously get to play it. And again, everybody loves kind of funny, man. Look, bring back the Xcast. Bring it back. We got a little X cast minute you and I today. We'll talk some Xbox throughout the show, but yeah, currently sitting on the PC Metacritic at 84. Got a lot of positive reviews, Paris, and to hear you gush about it. I'm very excited. I want to make time this week to try to play it because yeah, it it it seems so cool. It was fascinating. Pairs, all the clones and what that meant. I love the survival games, you know, that the base building. So, I'm excited to see how it all kind of meshes together to make a really fun game. Oh, no. Absolutely. And one one other thing I have to shout him out directly. So Alex Jordan, he is the voice actor of Yan. All the different versions of Yan in this",
            "start": 245.36
        },
        {
            "text": "to make a really fun game. Oh, no. Absolutely. And one one other thing I have to shout him out directly. So Alex Jordan, he is the voice actor of Yan. All the different versions of Yan in this game. He's accomplished voice actor in this industry. He's like in Dragon Age Veilg Guard. He was Mr. Hanss in Cyberpunk 2077. Stuff like that. The fact that one person did this, I'm telling you, when you play it, because every version of Yan, you would think it's a different voice actor for all different versions of it. That's how good he is doing this. So again, just kudos to him. I've been lucky enough to get to know him over the past year or so. Awesome dude. I I got to even sit down, interview him during the preview event, talk about the game. Really great guy and just uber talented as a voice actor. So again, when you're playing this game, realize it is one person doing all of this, which is insane in itself. That's dope. Of course, if you've already jumped into the altars over the",
            "start": 295.04
        },
        {
            "text": "voice actor. So again, when you're playing this game, realize it is one person doing all of this, which is insane in itself. That's dope. Of course, if you've already jumped into the altars over the weekend, please super chat away. Let us know what you think of the game so far. And of course, get involved in the conversation today here on Kind of Funny Games Daily with me in Paris. You can write in any burning questions that you got an opinion piece or if you just want to talk Xbox with the boys, we want to talk with you. Super chat over on YouTube so we can get you involved. But of course, don't forget this is kind of funny games daily. Each and every weekday, we run you through the nerdy news you need to know about live on YouTube, Twitch, and of course on podcast services around the globe. If you love what we do, consider supporting us with the kind of funny membership available on YouTube and on Patreon to get our shows ad free. Watch us as we record them live and of course get",
            "start": 337.2
        },
        {
            "text": "globe. If you love what we do, consider supporting us with the kind of funny membership available on YouTube and on Patreon to get our shows ad free. Watch us as we record them live and of course get your daily dose of Greg Miller with that exclusive Greg Way piece of content. We are now available on our p our kind of funny membership on Spotify and Apple podcasts as well. So you can support us over there for a chance to be part of the show. Submit your thoughts and opinions as super chats as we go over on YouTube. Some housekeeping for you. We are an 11 person small business all about live talk shows. Today after kind of funny games daily, you'll get a games cast all about handheld gaming in 2025. You'll have Tim, you'll have Greg, you'll have Paris and myself talking handhelds in 2025. Greg Miller loves his handheld gaming. I know Paris has a bunch of them. So, he'll give you some good expert analysis. And I am on the fence. So, I have a lot of questions for these guys on is it time",
            "start": 377.84
        },
        {
            "text": "Miller loves his handheld gaming. I know Paris has a bunch of them. So, he'll give you some good expert analysis. And I am on the fence. So, I have a lot of questions for these guys on is it time for me to be spending the bag and jump into handheld gaming with the upcoming Xbox and Raj RG Ally coming out very soon. But that's after today's kind of funny games daily. Then after the games cast, you'll get a kind of funny podcast where Joey has to deal with Nick and Greg. Yeah, I don't know how well that will go, but tune in for that one. Then there will be a stream kicking off Naughty Dog week with Crash 2 and Crash Team Racing. This week you get the very special Barrett Courtney presents I've played every Naughty Dog game and rank them special presentation at the end of the week. Barrett, it's a big deal throughout the week. We are going to be talking about Naughty Dog and you. And so what better way than during the streams to celebrate both of those by playing some cool Naughty Dog",
            "start": 425.04
        },
        {
            "text": "it's a big deal throughout the week. We are going to be talking about Naughty Dog and you. And so what better way than during the streams to celebrate both of those by playing some cool Naughty Dog games, right? Yes. Uh we're playing Naughty Dog games throughout the entire week. Today we're u Tim and I are going to be playing Crash Bandicoot. Tomorrow, Blessing will play uh Jack and Dexter, the precursor legacy for the very first time. Wednesday, uh Greg and I will be playing Uncharted 2. Uh Thursday, I'm skipping work to catch a Cleveland Guardians uh San Francisco Giants game. Uh so you and Nick will be playing The Last of Us Part Two, maybe some of that Rogue Light mode. Uh, and then Friday, yes, uh, my, uh, video presentation. I replayed every Naughty Dog game where I will not be ranking the Naughty Dog games. It's more so about the journey this time. Uh, so stay tuned for that. Uh, that'll take a place of your regularly uh, scheduled games cast this Friday. Keep an eye out for",
            "start": 476.56
        },
        {
            "text": "the Naughty Dog games. It's more so about the journey this time. Uh, so stay tuned for that. Uh, that'll take a place of your regularly uh, scheduled games cast this Friday. Keep an eye out for that one. Of course, if you're a kind of funny member, today's Gregway is 14 minutes about if Doomsday will show up in James Gun's DCU. Keep an eye out for that one. Of course, thank you to our Patreon producers Carl Jacobs, Omega Buster, and Delaney Twining. Today we are brought to you by Shady Rays. But we'll tell you all about that later. Let's begin the show with what is and forever will be the Roper Report. It's time for some news. We have seven stories today. A Baker does it. Story number one, we have a Nintendo Direct coming your way this Wednesday. Get your super chats in. What is your hype level for Donkey Kong Bonanza? What does the Direct need to show you? The news report says, \"Tune in at 6:00 a.m. PT on June 18th for a livereamed Donkey Kong Bonanza Direct presentation featuring",
            "start": 515.52
        },
        {
            "text": "level for Donkey Kong Bonanza? What does the Direct need to show you? The news report says, \"Tune in at 6:00 a.m. PT on June 18th for a livereamed Donkey Kong Bonanza Direct presentation featuring roughly 15 minutes of information about the upcoming Nintendo Switch 2 game. DK is out July 17th. What's the direct mean for kind of funny?\" Well, on Wednesday, none of us will watch the DK Direct live at 10:00 a.m. we will watch it live with you on stream and then we'll do the games cast right afterwards as the DK Direct post show. Then kind of funny games daily will follow that. So, a quick rewind for you. Wednesday, June 18th, 6 a.m. if you want to watch it live or with us at 10:00 a.m. you will get a Donkey Kong Bonanza direct presentation. Paris, 15 minutes of DK, no other Switch 2 titles, so you know, focusing on this. How do you feel about seeing some more Donkey Kong? My hype level's at a five. A five out of 10 out of 10. Okay, so I I got to play it at the at the preview event for",
            "start": 572.0
        },
        {
            "text": "so you know, focusing on this. How do you feel about seeing some more Donkey Kong? My hype level's at a five. A five out of 10 out of 10. Okay, so I I got to play it at the at the preview event for for the Switch, too, right? It it just it did not grab me, man. Wow. It just so my hope coming out of this is they show me some stuff that wows me that gets me back on board because I went into that preview very excited for Donkey Kong. I'm a huge Donkey Kong fan, but playing it I I guess it's just not what I wanted from Donkey Kong. I I don't know any better way to say it. So hopefully I see something new in this direct that gets me back on board, but unfortunately yeah, I'm I'm just I'm just mid with with my hype level for it. I want to put a big pin on that because I want to swing back and ask you some questions about your experience with Donkey Kong and what you kind of need to see out of this direct because I'm on the opposite side, Paris. This is what I bought my Nintendo Switch 2",
            "start": 631.84
        },
        {
            "text": "ask you some questions about your experience with Donkey Kong and what you kind of need to see out of this direct because I'm on the opposite side, Paris. This is what I bought my Nintendo Switch 2 for. I wasn't a big like hype level for Mario Kart World. Of course, I've had a great time with that, but I wanted the Nintendo Switch 2 for the idea of Donkey Kong Bonanza, right? This 3D action platformer where he's digging through mine tunnels and having fun. I'm hoping to relive some of those moments of here's this cool 3D platformer collectathon with Donkey Kong. It's not Mario anymore. I want something new in my life. And that's what I'm hoping for. So for me, I I bought the Switch 2 for this. I am very hyped for this game. 15 minutes of Donkey Kong going a little more in depth since I didn't get to go to the big Switch 2 presentation with Roger Bless and Tim where I know they went hands-on with the game before. Uh, this has got to be a nine out of ten for me of like this is gonna be",
            "start": 679.44
        },
        {
            "text": "get to go to the big Switch 2 presentation with Roger Bless and Tim where I know they went hands-on with the game before. Uh, this has got to be a nine out of ten for me of like this is gonna be a fun Wednesday morning of 15 minutes. I like this. Now, I want to swing back to you, Paris. What's up? Why did this not grab you? Is it not that 3D action platformer collectathon like I'm envisioning a Mario Odyssey but Donkey Kong? That's obviously that's what they're trying to do with this. And you're doing the essentially the destructible environments on it. And again, I I'm taking a very small sample size at at a preview event, so don't get me wrong, but I didn't feel like I I it was kind of directionless when I got to the main area of of where you were in in the preview. I was like, \"Okay, I smash a bunch of stuff. All right, what do I do next? Yeah, sure. I collect this. What's this for?\" I I didn't necessarily like all the traversal in it. It didn't feel as intuitive as I wanted it to",
            "start": 723.68
        },
        {
            "text": "smash a bunch of stuff. All right, what do I do next? Yeah, sure. I collect this. What's this for?\" I I didn't necessarily like all the traversal in it. It didn't feel as intuitive as I wanted it to be with the destructible ways that you can go through the environment. Again, small sample size. It's just that was my first impression of it. So, that's why I'm hopeful to see more here at this Direct. I'm like, \"Oh, okay. I see where they're going with this. Okay, I'm I'm I'm back on board wanting to play it.\" But when I compare it to previous Donkey Kong games, and obviously I guess the Mario Odyssey team made this, Mario Odyssey grabbed me immediately, right, playing that whereas this one did not. So, I'm hopeful, you know, I see more there that gets me back on board cuz again, Donkey Kong is one of my favorite characters ever. Okay. So, you talk about the traversal, you talk about this open kind of zone world of like, hey, lead me somewhere. Give me some direction. What do you want to",
            "start": 772.56
        },
        {
            "text": "is one of my favorite characters ever. Okay. So, you talk about the traversal, you talk about this open kind of zone world of like, hey, lead me somewhere. Give me some direction. What do you want to see out of this direct? What is that thing that would maybe turn your five out of 10 to a little bit higher, Paris, at the end of this 15 minutes? I want to see more how the destructible environments with DK adds to the actual gameplay elements with this kind of being an open zone world. Is it essentially I can go do whatever I want whenever I want? Is it that I have to go a certain path with this? Is there secrets and things that I'm going to discover by being destructible go, you know, digging into the environment, right? Are there some mini bosses? Obviously bosses and the characters. Show show me some of that stuff where utilizing Donkey Kong's, lack of a better term, destructive ways adds to the gameplay elements of this versus obviously something like we have with with a with a",
            "start": 816.64
        },
        {
            "text": "Show show me some of that stuff where utilizing Donkey Kong's, lack of a better term, destructive ways adds to the gameplay elements of this versus obviously something like we have with with a with a Mario, you know, in an open world environment. So, I I just think I need to see more. I mean, you know, like I said, it just did not grab me on first impression. Okay. As a kid that grew up with Donkey Kong 64, I know Barrett loves that game like I do. Getting the special edition console, of course, the DK rap, you know, do we think we get some sort of special music, Paris, or is that dead and gone? I won't get something fun, kind of bouncy, something that I'll remember for a lifetime with that. Yeah, this didn't seem like it would lean into that where we get like a new DK rap or anything like that. And that's another thing I want to see Cranky Kong. I want to see Diddy. I want to see more of the the whole DK crew as as a part of this as well. So, I mean, like I said, you know, we we",
            "start": 858.8
        },
        {
            "text": "like that. And that's another thing I want to see Cranky Kong. I want to see Diddy. I want to see more of the the whole DK crew as as a part of this as well. So, I mean, like I said, you know, we we we'll see. Okay. Do you think this has a chance to wow people like Astrobot just did last year, right? Like I think Mario Odyssey team making this. It's already in very high regard. It's Nintendo first party. It's Donkey Kong. It already has the mixture of being great. But do you think something like a Astrobot that we just came off of this has a good chance of like, oh wow, this is something special right here today? That that's actually a great a great comparison that you're you're making there because again the first time I saw Astrobot at the state of play and then the first time I actually played Astrobot, I'm I'm hooked immediately. I'm in again one of the best games of last year. This just didn't do that for me, you know? I mean I I don't know. I I I if you're asking me right now,",
            "start": 904.24
        },
        {
            "text": "played Astrobot, I'm I'm hooked immediately. I'm in again one of the best games of last year. This just didn't do that for me, you know? I mean I I don't know. I I I if you're asking me right now, no, I don't think this would live up to the phenomenon that was Astrobot. Um I I keep saying it, but I I just need to see more. I'm This is not with with with all the games that we played so far in 2025. This is not on my anticipated list at all. Well, there you go. Hey, this Wednesday, June 18th, at 6:00 a.m. PT, of course, look up your local time zone. You'll get 15 minutes of Donkey Kong Bonanza coming to the Nintendo Switch 2 with this Nintendo Direct. Don't forget that kind of funny on Wednesday. We'll watch it live with you at 10 a.m. for our live stream into a Games Cast and then we'll flip-flop and we'll do Games Daily afterwards, but you'll get a whole Wednesday, I'm sure, full of Donkey Kong. And James Peters writes in for a YouTube super chat and says, \"Anyone else extremely",
            "start": 946.32
        },
        {
            "text": "flip-flop and we'll do Games Daily afterwards, but you'll get a whole Wednesday, I'm sure, full of Donkey Kong. And James Peters writes in for a YouTube super chat and says, \"Anyone else extremely excited for a 3D Donkey Kong platformer? I've been playing DK64 to get pumped up for it as well.\" James, I'm glad to hear that you were excited just like me and I'm sure many others. Of course, if you're watching live on YouTube and on Twitch, let me know your hype levels in the audience right now. And of course, if you're watching later on YouTube, give us your hype levels and predictions for the big presentation on Wednesday. Looking forward to talking more things Donkey Kong with all of you. Paris, let's keep it on Nintendo because we got a fun new story coming out for story number two. Nintendo Switch 2's insane first week in detail coming from Matt Piscatella at Circana Paris. I got a couple of big bullet points. We're going to go one by one down this lineup right now. Nintendo Switch 2",
            "start": 996.56
        },
        {
            "text": "Switch 2's insane first week in detail coming from Matt Piscatella at Circana Paris. I got a couple of big bullet points. We're going to go one by one down this lineup right now. Nintendo Switch 2 set a new all-time launch week unit sales record for video game hardware in the US with over 1.1 million units sold during the week ending June 7th 2025 excluding sales from the my Nintendo store. The record was previously held by PlayStation 4. Little clap right there. Congratulations Paris. the hype, the big sales for us to be expected. I think so. I think Switch 2, regardless of the price increases, was highly anticipated. So, it was not a shock at all that it set records and Nintendo clearly did a great job of making sure that anybody that wanted to get a Switch to was able to get a Switch, too, you know, within the first week. So, you know, kudos to them. Look, as as bad as I talked about Donkey Kong a second ago, I mean, I love my Switch, too. Um, I I I think it's great. Um, been",
            "start": 1040.8
        },
        {
            "text": "too, you know, within the first week. So, you know, kudos to them. Look, as as bad as I talked about Donkey Kong a second ago, I mean, I love my Switch, too. Um, I I I think it's great. Um, been having fun with Mario Kart. Been tinkering around in Cyberpunk 2077. Jumped into Breath of the Wild playing that as well. It's a great It's a great piece of hardware and Nintendo's Nintendo. They're always going to make great games. So, of course, the hype was was going to be there. And like I said, regardless of it being 450 and really 500 with the Mario Kart bundle at launch, people showed up and they went out and bought it. Yeah, they showed up, Paris. And it felt like there was more or a better easily available option to purchase it. I know it was always Mayhem night one, but it did feel like more people bought it than more people saying, \"Ah, I didn't get it. It sold out. This was whack. I didn't get a hold of it.\" And it also felt like my GameStop when we went to it, right, had 102 units",
            "start": 1099.76
        },
        {
            "text": "people bought it than more people saying, \"Ah, I didn't get it. It sold out. This was whack. I didn't get a hold of it.\" And it also felt like my GameStop when we went to it, right, had 102 units available that you could pre-order the following day that weren't just online options. And so, yeah, it felt kind of like the right storm here, Paris, on availability. I think of course Switch One heading into Switch 2 had that perfect storm of people know what the console is. They know what the, you know, the idea and the vision is from Nintendo and how this dual handheld/home console was going to be and yeah, it just feels right for me and I'm excited to see over its lifespan. Paris, we talk about the Switch One selling so well. I assume I predict that the Switch 2 is going to do the exact same, if not better, because it feels like they're really on the path of nailing what they want to do with this console. Yeah, completely agree. Let's go to part two on this one. 79% of US Nintendo Switch",
            "start": 1144.72
        },
        {
            "text": "if not better, because it feels like they're really on the path of nailing what they want to do with this console. Yeah, completely agree. Let's go to part two on this one. 79% of US Nintendo Switch 2 buyers also purchased Mario Kart World either physically or as a part of the Mario Kart World Switch 2 hardware bundle pass. I mean, duh. You know what I mean? It was one of the it was the only first party launch, you know, release out of it that wasn't Tears of the Kingdom with an upgrade. It feels right. Mike, you still had uh Welcome Tour. Okay, like we need to find out what the attach rate is for Welcome Tour. I I gave him $10. I gave him $10. Put some respect on it, Mike. Uh but Paris, yeah, I mean the game was a lot of fun. It was one of It was the only first party big name that you were going to buy at 79% feels right to me, if not higher. Parents, I feel like everybody in their mother should probably have this with their Switch, too. Yeah. Yeah, 100%. like you said, it was the",
            "start": 1187.52
        },
        {
            "text": "were going to buy at 79% feels right to me, if not higher. Parents, I feel like everybody in their mother should probably have this with their Switch, too. Yeah. Yeah, 100%. like you said, it was the flagship game for for launch. It is Mario Kart. We know historically Mario Kart has always been one of the the best sellers for Nintendo with a high attach rate to their hardware. So, of course, and making it, bundling it in, I'm I'm like I would be very curious to know what the split was between the bundle and the people that went and just bought it standalone because I would imagine God it probably is what 60 40 maybe even 7030 people just bought the bundle. I mean, why wouldn't you? And again, it was readily available. It was not hard to be able to get. You could walk into a store day one and go grab that bundle. So, yeah, to me, that was just a logical choice. You get to save 30 bucks if you buy the bundle. You were going to get Mario Kart anyways. You just go get the Mario Kart",
            "start": 1239.36
        },
        {
            "text": "one and go grab that bundle. So, yeah, to me, that was just a logical choice. You get to save 30 bucks if you buy the bundle. You were going to get Mario Kart anyways. You just go get the Mario Kart bundle. Uh, Paris, I wish I got the bundle because I was one of the per people that Oh, you were one of them. I got the standard edition because, of course, it was mayhem opening night trying to get it. That was more like a panic buy. But of course, I knew exactly what was going to happen. I bought the Nintendo Switch 2. I plugged it in. What was the first thing I did? Went to the Nintendo eShop, paid $80 for Mario Kart World. You knew it was going to happen. There was a cycle of things that was just going to happen. And so, yeah, I'm one of those people. And also, I have a hard time imagining everybody didn't do that. 79% is very high. I'm surprised that's not 85 to 90 because it feels like it was the game, the only game to buy. but it also was backed up by a number of other goods selling",
            "start": 1283.84
        },
        {
            "text": "everybody didn't do that. 79% is very high. I'm surprised that's not 85 to 90 because it feels like it was the game, the only game to buy. but it also was backed up by a number of other goods selling games. And that's our final piece coming from Matt Piscatella. The top three bestselling Switch 2 physical video games sold in the week were Mario Kart World, Cyberpunk 2077, and The Legend of Zelda: Tears of the Kingdom Nintendo Switch 2 Edition. Cyberpunk 2077 getting a whole lot of third party love on this Switch too, Paris. So, I have to tell this story really quick. I kind of chronicled it a little bit on the social media as was happening. So, you know, in in my day job, I had been traveling like for the couple weeks coming up to Summer GameFest and the launch of the Switch 2. So, I was in Louisville, Kentucky when the Switch 2 came out. I had already pre-ordered the bundle, so that was coming to the house, but I knew I wanted the physical copy of Cyberpunk 2077. So, I went to two",
            "start": 1321.84
        },
        {
            "text": "in Louisville, Kentucky when the Switch 2 came out. I had already pre-ordered the bundle, so that was coming to the house, but I knew I wanted the physical copy of Cyberpunk 2077. So, I went to two different Walmarts and then ultimately a Target to find that physical copy. and it was literally the last one left when when I went in the store because everybody was was buying that physical copy of Cyberpunk. So, I I'm not surprised to see the sales numbers for that. And not to mention, it's almost like a um it it shows off the the the technical the performance prowess of the Switch, too, because obviously we know Cyberpunk, you know, is, you know, a showcase game on PC to show off the visuals and everything. I mean, and it's it's cyberpunk, man. I mean, it it looks pretty darn good and it plays pretty darn well on the Switch, too. I was pleasantly surprised. I mean, you play in that quality, not the quality mode, but you play in that performance mode at 40 frames frames per second. Plays",
            "start": 1372.56
        },
        {
            "text": "pretty darn well on the Switch, too. I was pleasantly surprised. I mean, you play in that quality, not the quality mode, but you play in that performance mode at 40 frames frames per second. Plays great. 720p handheld. Obviously, you can do up to 1080p if if you dock it as well. But yeah, really good. Really good. So, kudos to CDPR, man. I'm pretty sure there's some wizards and sorcerers over there. I I I jokingly say that Merlin must be the CTO over there at CD Project Red because they they they they do miracles with with their games, you know, on these hardware on this hardware, I should say. The almost all of the lifespan of my Nintendo Switch One Paris. I had the Witcher 3 game cartridge inside of my Nintendo Switch as my physical copy. So, it'll be interesting to see if I buy Cyberpunk 2077 physically, put it in there just for the fun of it to say that it's always in there cuz I love booting up my Switch One and having that copy in there just laughing at it, thinking how cool.",
            "start": 1422.4
        },
        {
            "text": "2077 physically, put it in there just for the fun of it to say that it's always in there cuz I love booting up my Switch One and having that copy in there just laughing at it, thinking how cool. But yeah, I mean, incredible sales. On the flip side, I'm always a digital guy, Paris, and seeing Cyberpunk being right there, front and forward on the front page was impressive to see. I really, really love seeing that. We We have my Cyberpunk expert coming in, uh, Nick. Really quick, how does it make you feel? Cyberpunk 2077, the second bestselling uh Nintendo Switch 2 physical game for the launch. I think it needs to be number one. No, tell me. It needs to be number one. If it had a free roam, then it would have been a number one, but I guess it doesn't have that, huh? He loves Cyberpunk. And yeah, Paris, I mean, Mario Kart World as we expected. Cyberpunk, a big win right there. I was apprehensive, Paris. I really didn't believe that you were going to show me a Nintendo Switch piece of",
            "start": 1467.04
        },
        {
            "text": "yeah, Paris, I mean, Mario Kart World as we expected. Cyberpunk, a big win right there. I was apprehensive, Paris. I really didn't believe that you were going to show me a Nintendo Switch piece of hardware that could live up to it. And that was also on me. You know, I think we're kind of spoiled here in the studio of watching Nick and Andy do the big Nvidia sponsored streams on the 5090 with full path tracing. And I'm going, well, this is like some crazy stuff. There's no way. And it's like, okay, we'll temper your expectations a little bit, Mike. It's running the game very well. It's not doing the 5090 level, but it's still running it well. And I will say after watching it run, playing it, it it is impressive, Paris, that this piece of machine can run some third party games that you know during its lifespan I can get I can be a little more confident in my purchases moving forward. Oh, 100%. What it told me was expect every third party public everything's going on here. Look, Xbox is",
            "start": 1509.36
        },
        {
            "text": "during its lifespan I can get I can be a little more confident in my purchases moving forward. Oh, 100%. What it told me was expect every third party public everything's going on here. Look, Xbox is going to put everything on their on on that Switch, too. Every third party publisher is going to get their games on a Switch, too, because why not? if it can run it. We're clearly seeing the amount of of consoles that are already being sold. So, imagine what it's going to be by Christmas time. So, at this point, why wouldn't you put your games on a Switch, too, if it can run it, you know, in handheld and dock mode? That's the truth. Paris, very exciting stuff. The Legend of Zelda: Tears of the Kingdom, uh, number three on the physical selling list. Paris, did you jump into the upgraded versions of those at all? What did you think? Yeah, so I did Breath of the Wild. Um, that was the one I wanted to to check out uh to play and it's I mean to play it at at 60 frames and it just loads quicker.",
            "start": 1552.48
        },
        {
            "text": "of those at all? What did you think? Yeah, so I did Breath of the Wild. Um, that was the one I wanted to to check out uh to play and it's I mean to play it at at 60 frames and it just loads quicker. Everything is just it's just better. I mean obviously the HDR all that visually looks better as well. So the upgrade is good and I did the I did the Nintendo Switch online expansion pass so I got the upgrade for free doing it that way. I didn't have to pay the 10 bucks to do it and looks great. Um so I'm going to play through that for a while. then I'll jump over to Tears of the Kingdom and check that out as well. But yeah, so far so good. Looks really good. Some big Nintendo Switch news and guess what everybody, I have more Nintendo Switch news right after a word from our sponsors. This episode's brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized shades that won't break the bank.",
            "start": 1597.84
        },
        {
            "text": "brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized shades that won't break the bank. Shitty Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people. They have hundreds of options to choose from, so you're bound to find the perfect pair to match your style. If you don't love your shades, exchange them for a new pair or simply return worry-free within 30 days. There's no risk when you shop. Their team are always there to have your back with personal and fast support. Y'all know I've been outside a lot playing Pokemon Go, and it's such a great experience wearing Shady Rays when I'm out and about looking dope. Exclusively for you, Shady Rays is giving out their best deal. Head to shady.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. Again, go to",
            "start": 1642.48
        },
        {
            "text": "you, Shady Rays is giving out their best deal. Head to shady.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. Again, go to shadyrays.com, use code funny to get 35% off polarized sunglasses. Welcome back. During the break, I asked Paris if he played Gears of War with the big remaster coming out, if he jumped into the beta at all. And Paris, you said it didn't go as well as you planned it to go. I said I got my ass handed to me in Gears of War multiplayer. Clearly, I have not played Gears of War multiplayer in a very long time. You know, obviously there's a certain meta to it. You know, everybody's running around with shotguns and doing all that stuff, but uh I mean, it was it was Gears. I mean towards the end I you know I started to you know get get my feet under me and had a little bit of success but yeah I'm clearly not good in Gears of War multiplayer but I mean I saw some people cuz that that first day on",
            "start": 1688.24
        },
        {
            "text": "know I started to you know get get my feet under me and had a little bit of success but yeah I'm clearly not good in Gears of War multiplayer but I mean I saw some people cuz that that first day on Friday when we're talking about the the beta weekend that they did Friday I could not get into a game. They were having some some clearly some issues but Saturday I was able to get in and I played you know played a few hours and I played a little bit um on Sunday morning and played fine. I actually jumped between playing on PC, on Series X, and on PlayStation 5. And yeah, it was good. It is weird playing Gears of War on a PlayStation. That is freaking weird. But, uh, going back to last weekend at the Xbox showcase, Danny and I, you know, went through a presentation on it, and he he was playing on PlayStation, and I was playing on Xbox, and we're doing co-op. Freaking blast, man. Had a blast. I I can't wait for it reloaded uh to come out because I'm definitely going to jump back in and do",
            "start": 1735.52
        },
        {
            "text": "on PlayStation, and I was playing on Xbox, and we're doing co-op. Freaking blast, man. Had a blast. I I can't wait for it reloaded uh to come out because I'm definitely going to jump back in and do some co-op. So, I don't know about multiplayer. I don't know if I need that pain. But, uh I I'll for sure be playing uh co-op cuz that was a lot of fun. We we had so much fun playing it that they they kicked us out. They were like, \"This is not a preview of it. Y'all got to go. Get out of here.\" Yeah. I mean, it's a special one, Paris. It was very cool. I was hit with the wave of nostalgia. I was smiling from ear to ear, getting my butt kicked in multiplayer, remembering the maps, smiling at the wall bouncing. I mean, my social media has blown up of just kids wall bouncing left and right with the Nasher shotgun, laughing, blowing people to bits. It It's so cool, Paris. And so, yeah, I'm very excited about this release. It's a big deal. Uh, one of the final big titles to come over to",
            "start": 1784.56
        },
        {
            "text": "with the Nasher shotgun, laughing, blowing people to bits. It It's so cool, Paris. And so, yeah, I'm very excited about this release. It's a big deal. Uh, one of the final big titles to come over to PlayStation. As you say, it's like it's odd to play it on a PlayStation, but it feels good. It's awesome to get it out there with more players and Halo, I'm sure, will be right behind that here soon enough, Paris. So, we'll be a a wild moment for you and I, old Xbox heads for sure. Yes. Yes, it will. It will be a very strange day when Master Chief is on PlayStation, but but it's coming. I mean, obviously, I I know we could just talk about that just really quick. you know, they've they've made it very clear they're putting all their their flagship games uh across multiple platforms, obviously Xbox Play Anywhere, all the initiatives, you know, they talked about during the showcase. So, it's happening. Look, whether you like it or not, whether you think it's weird or not, whatever you want to",
            "start": 1823.6
        },
        {
            "text": "Play Anywhere, all the initiatives, you know, they talked about during the showcase. So, it's happening. Look, whether you like it or not, whether you think it's weird or not, whatever you want to grab your pitchforks or do whatever it does, at this point, Master Chief, clearly Marcus Phoenix is already there, Forza is already there. They're putting all their big games on on PlayStation and any device. that can run it cuz you better believe they're coming to Switch too as well if they can run on on Switch too. Uh before we move on to story number three, let's give a quick birthday shout out to David B who writes in and says obligatory birthday tax for me and my dad since we share our birthdays today. David B, happy birthday you and your dad and also happy father's day to your father as well. Paris, that's a pretty cool one. Little fatherson birthday combo. That's that's crazy happen stance as well. That's wild that they did that that took place there. But happy birthday you two.",
            "start": 1870.48
        },
        {
            "text": "as well. Paris, that's a pretty cool one. Little fatherson birthday combo. That's that's crazy happen stance as well. That's wild that they did that that took place there. But happy birthday you two. That's awesome stuff. Um, up next, Paris. Story number three. Amazon and Nintendo might be making up. This coming from Robert Anderson at IGN. After more than a year of near total absence, aside from a rogue Echoes of Wisdom listing, Amazon has finally resumed direct sales of Nintendo published Switch games in the US. The move breaks a longunning freeze out that saw Amazon skip all sold and shipped by Amazon listings for Switch 2 titles, ignore pre-orders entirely, and leave everything to third-party sellers. Until now, only third-party Switch 2 titles like Sonic X Shadow Generations were available to pre or were order directly from Amazon. First party launch games such as Mario Kart World and the Switch 2 editions of Legend of Zelda: Breath of the Wild and Tears of the Kingdom were",
            "start": 1914.56
        },
        {
            "text": "available to pre or were order directly from Amazon. First party launch games such as Mario Kart World and the Switch 2 editions of Legend of Zelda: Breath of the Wild and Tears of the Kingdom were noticeably missing. That now changed. While all these are currently listed as temporarily out of stock, Amazon is now accepting orders suggesting seriously of serious availability updates are on the way imminently. So, what about the console in general? Nintendo Switch consoles are currently sold out at every major retailer. While launch day stock was solid, helping the console shift over 3.5 million units in just 4 days worldwide, it's been tough to come by ever since. Previously, the Amazon listing for the Switch 2 plus Mario Kart World bundle was cluttered with questionable third-party sellers. Those listings have now been removed, replaced with a simple, currently unavailable notice. With Amazon once again offering firstparty Switch to games, it's worth keeping a close eye on that page.",
            "start": 1972.64
        },
        {
            "text": "Those listings have now been removed, replaced with a simple, currently unavailable notice. With Amazon once again offering firstparty Switch to games, it's worth keeping a close eye on that page. Stock updates for the console itself could follow soon. It's worth noting again that this situation specifically applies to Amazon in the US. The retailer has continued to operate Nintendo Switch listings as normal in other regions such as the UK throughout the ongoing standoff between Nintendo and Amazon US. Paris. This is one I wasn't really aware of, but I definitely made a mental note as I noticed we weren't pre-ordering the console from Amazon here with the big console launch. I noticed, man, nobody's bringing up Amazon. Why is Amazon not on the list that Wario was tweeting out? I didn't know we were having kind of a a standoff freeze off, Paris. Okay, so Mike, I I'm I'm a little salty and bitter about this to let you know. So, I have all this gift card money at Amazon. So, when this",
            "start": 2023.2
        },
        {
            "text": "know we were having kind of a a standoff freeze off, Paris. Okay, so Mike, I I'm I'm a little salty and bitter about this to let you know. So, I have all this gift card money at Amazon. So, when this and I was like, \"Oh, man. I'm just getting switched to from Amazon. I can't wait.\" So, when all this was going on, yeah, I was I was a little bitter cuz I'm like, \"Now I have to go go spend out of my actual bank account somewhere else to go get it instead of Amazon.\" But I'm glad they're they're obviously figuring this out now. I mean, Amazon, I'm pretty sure, is the biggest global retailer, you know, right now. So, of course, you would want your products on on Amazon. So, whatever internal strife was going on that put them at odds that they weren't selling it right away. I I'm glad they're figuring it out now. So, moving forward, you know, people can just go get the Switch to and all the accessories and games off Amazon as they need. Agreed, Paris. Yeah, this is kind of the thing I go to",
            "start": 2076.08
        },
        {
            "text": "it out now. So, moving forward, you know, people can just go get the Switch to and all the accessories and games off Amazon as they need. Agreed, Paris. Yeah, this is kind of the thing I go to is Amazon nowadays. I know that's the one spot that I kind of can get everything. And yeah, for it not to have Switch games, Switch 2 with the console was uh kind of odd, but it is interesting to see that that might be changing. Of course, games being listed. Be ready for possible the console as well. Uh so keep an eye on for that one here in the US. Odd that it only applies here. I'm sure there's some sort of rift that was going on before them that we didn't get to see on the front end, but uh Paris, hopefully you'll be able to spend some of your gift card money here soon enough. I spent on other stuff now. That's better. Let's move on to story number four. Early testers liked Death Stranding 2 too much. This coming from Jordan Midler at vGC.news. Death Stranding 2 on the beach composer Woodkid",
            "start": 2121.52
        },
        {
            "text": "now. That's better. Let's move on to story number four. Early testers liked Death Stranding 2 too much. This coming from Jordan Midler at vGC.news. Death Stranding 2 on the beach composer Woodkid has said that Hideo Khjima made changes to Death Stranding 2 because early testers of the game liked it too much. Death Stranding uh Death Stranding 2 on the Beach will be released June 26th exclusively for PS5. Now in an interview, Woodkid has discussed his time providing music for the game and working with creative director Hideoko Kajjima. Quote, \"There's a key moment where we had a discussion probably halfway through when we were doing the game where he came to me and he said, \"We have a problem.\" Woodkid uh told Rolling Stone. Then he said, \"I'm going to be very honest. We have been testing games with player testing the game with players and the results are too good. They like it too much. That means something is wrong is wrong. We have to change something.\" And he changed stuff in the",
            "start": 2163.2
        },
        {
            "text": "games with player testing the game with players and the results are too good. They like it too much. That means something is wrong is wrong. We have to change something.\" And he changed stuff in the script and the way some crucial stuff happens in the game because he thought his work was not polarizing and not triggering enough emotion, not triggering enough emotions. He said, \"If everyone likes it, it means it's mainstream. It means it's conventional. It means it's already pre-igested for people to like it.\" And I don't want that. I want people to end up liking things they didn't like when they first encountered it because that's where you really end up loving something. And that's and that was really a lesson for me. Not doing stuff to please people, but to make them shift a little bit and move them. chat super chat away. Did you love Death Stranding one? And what are your expectations for Death Stranding 2? Paris, is this odd for you to hear that you hear Hideok Kajjima, the game",
            "start": 2223.68
        },
        {
            "text": "and move them. chat super chat away. Did you love Death Stranding one? And what are your expectations for Death Stranding 2? Paris, is this odd for you to hear that you hear Hideok Kajjima, the game is testing too well. He's got to get back in there and change it up because he doesn't want to be mainstream. He wants you to feel a certain way about this. How does that make you feel, Paris? This should not surprise anyone. It's Hideo Kajjima. This is what he does. Of course. Of course he did this. I'm I'm not surprised at all. So, I mean, I know we're we're we're we're playing it right now, so, you know, I will limit my my overall thoughts, but for to see him doing this, of course, it's it's what he does. You know, he's he's earned it over the years with all the games that he's come out with, he's earned it to this point right now where he's going to tinker and he wants to make sure you get the experience that he's trying to convey. So yeah, not surprised. Yeah, Paris, this is one at",
            "start": 2271.6
        },
        {
            "text": "he's earned it to this point right now where he's going to tinker and he wants to make sure you get the experience that he's trying to convey. So yeah, not surprised. Yeah, Paris, this is one at first when I read this, I kind of shook my head. I was like, \"Say what?\" But then I remembered, I don't know if it was a couple months ago, if it was the leadup to Death Stranding one. But I remember sitting down with Greg and kind of hearing this exact same quote of Hideokima didn't want this to be mainstream and he wanted his work to be a little controversial and have people question it and think twice about it. And I remember thinking, man, like I never thought that way. I I don't usually think that way. I guess I am kind of more of a mainstream jabron when it comes to it. And so, yeah, this is an interesting take, but it feels right for him, his studio, the games that he's trying to make. And so, yeah, it will be interesting. They liked it too much, Paris. Usually, I would walk away going,",
            "start": 2324.0
        },
        {
            "text": "an interesting take, but it feels right for him, his studio, the games that he's trying to make. And so, yeah, it will be interesting. They liked it too much, Paris. Usually, I would walk away going, \"High fives everybody. Pop the bottle of champagne. We did it.\" But for him, it's let's get back to the drawing board and maybe tweak things. I don't think it will be a massive overhaul and redo. Of course, I think it's just maybe some small things that he will change narratively, maybe small things gameplay, but you're not changing the foundation of this game halfway through like the composer said from Wood Kid. Right. Exactly. I I like it. Uh CJ Splitson said uh with a super chat writes in and says, \"Kajima, keeping AAA gaming interesting.\" So there you go. Keeping it interesting stuff like that. Of course, people are reviewing it. Myself and Roger have not played it yet. We're very excited for our Death Stranding 2 marathon walk-athon stream on the 27th. So, make sure to tune in for",
            "start": 2365.84
        },
        {
            "text": "that. Of course, people are reviewing it. Myself and Roger have not played it yet. We're very excited for our Death Stranding 2 marathon walk-athon stream on the 27th. So, make sure to tune in for that. If you are on the fence about the game, if you want to share this experience with me and Roger, we are going to bust out the treadmill once again. We're going to walk and try to beat the game in one weekend and beyond. So, hopefully you all will tune in for that and have some fun. It will be a great time. Pause. Pause. Yeah. I I cuz I have yet to say this to you or Roger. You two are crazy people. You're insane people. I just I just want you to know that what you did last time, I loved it, but you're insane. My lazy ass is never doing it. I'll tell you that right now. But uh I'm excited to see you do it again. That's great, Paris. I appreciate you. It was uh so much fun. We had a blast. Uh we had a heart rate monitor at one point that was tracking mine. And I swear, Paris, it was",
            "start": 2408.4
        },
        {
            "text": "to see you do it again. That's great, Paris. I appreciate you. It was uh so much fun. We had a blast. Uh we had a heart rate monitor at one point that was tracking mine. And I swear, Paris, it was definitely broken. And then we put it on Roger. Turns out that was the real deal. We We might have to call up a doctor. We'll see. We'll call up a doctor. Yeah. I would I would randomly just check in just to see like, \"Oh, what are they doing?\" And I like, \"Not me. Couldn't be me. I'm not doing that.\" We're going to have a whole lot of fun. So, me and Roger are just waiting with all of you. We cannot wait to jump in. Uh the 27th for us will be that big stream. So, tune in on that. Paris, let's keep it going. Let's go to story number five. The Witcher 4 CD Project Red is taking a console first development approach, but with good reason. This coming from Wesley Yinpool at IGN. CD Project has explained why it's taken a console first development approach for the hotly anticipated The Witcher 4,",
            "start": 2448.16
        },
        {
            "text": "approach, but with good reason. This coming from Wesley Yinpool at IGN. CD Project has explained why it's taken a console first development approach for the hotly anticipated The Witcher 4, having gone with a PC first approach for its previous games. Earlier this month, CD Project Red revealed a stunning The Witcher 4 tech demo built using Unreal Engine 5 that gave fans a clear sense of what to expect from the game. The tech demo captured on PlayStation 5 and running at 60 frames per second follows Siri as she explores the neverbeforeseen region of Kovir in the midst of a monster contract. There is an incredible amount of detail in the tech demo with fluid animations on a level we have yet to see on current generation of consoles. Siri and her horse uh have particularly impressive movement and interactions with each other, NPCs, and the game world as they make their way through the mountains of Kovier to uh the bustling port town. Uh at one point in the demo, CD Project upped the NPC",
            "start": 2493.68
        },
        {
            "text": "and interactions with each other, NPCs, and the game world as they make their way through the mountains of Kovier to uh the bustling port town. Uh at one point in the demo, CD Project upped the NPC count to in the market scene to 300 individually animated characters. The showcase ended with the first look uh of atlan Exterior uh the winter capital and major port city. Speaking to the tech experts at Digital Foundry following the demo, CD Project Red's VP of technology Charles Tremble explained why the studio showed off the Witcher 4 tech demo running on a PS5 first and before PC, saying it's going for a console first development approach for the game. quote, \"We always do PC and we push and then we try to scale down,\" he said, \"but then we had so many problems in the past that we tried to say, this time around, we really want to be more console first development.\" That mention of having problems in the past is a nod to the disastrous launch of 2020 Cyber Pro or Cyberpunk 2077, which",
            "start": 2548.56
        },
        {
            "text": "say, this time around, we really want to be more console first development.\" That mention of having problems in the past is a nod to the disastrous launch of 2020 Cyber Pro or Cyberpunk 2077, which ran so poorly on consoles on the release that Sony ended up pulling it from the PlayStation store and offered refunds amid the for uh uh CD Project Redp apologized to customers for not showing the game on base last gen consoles ahead of launch, admitting we should have paid more attention to making it play better on PlayStation. 4 and Xbox One. CD Project Red spent years recovering from the game's technical issues, but has has done so successfully to the point now where CD uh Cyberpunk 2077 is a massive hit and was even successfully released on the Nintendo Switch 2 as a launch title. Paris a lot there, but taking a console first approach, showing it on the PlayStation 5 first before PC, you know, working on PC and then trying to scale back wasn't the way it seems like for this team. How do",
            "start": 2607.6
        },
        {
            "text": "there, but taking a console first approach, showing it on the PlayStation 5 first before PC, you know, working on PC and then trying to scale back wasn't the way it seems like for this team. How do you feel about that one? I like this approach. Uh because it really and you literally just chronicled the whole reasons why uh dur during that article read. I mean, look, we all know cuz I still get [ __ ] to this very day. Cyberpunk 2077 was a disaster at launch from a technical standpoint on consoles. And the majority of people that are going to play The Witcher 4 are going to experience it on a console. You got to make sure you get that right first. You can easily, I shouldn't say easily, but you can scale up from console to PC once you make sure you got console right. So, this is the right approach. I'm glad this is what they're doing because if they're able and I know this is a tech demo and not representative of what the final game's going to be, but the fact that on Unreal 5, this",
            "start": 2660.96
        },
        {
            "text": "approach. I'm glad this is what they're doing because if they're able and I know this is a tech demo and not representative of what the final game's going to be, but the fact that on Unreal 5, this new version of Unreal 5, they got The Witcher 4 looking this good on a PS5 running at 60 frames per second. If this is the target that they're going for, imagine what how it's going to play on a PS5 Pro. Imagine how it's going to eventually play on whatever the next generation consoles are going to be. I mean, we obviously see what it's like on Series X. I I hope they're not trying to target 60 on the Series S because I don't think there's a reason to. Let's just get a really good version of it on the Series S. But I was a little surprised to see that they are still targeting current consoles. But I guess that makes sense because even if it does come out in the next console generation, it's most likely going to be a crossgen game. So, it needs to run on the Series S and all these current",
            "start": 2710.88
        },
        {
            "text": "But I guess that makes sense because even if it does come out in the next console generation, it's most likely going to be a crossgen game. So, it needs to run on the Series S and all these current consoles, you know, at a reasonable weight, at a at a reasonable, you know, frame rate and at reasonable visual fidelity, things like that. So, I'm excited for it. Like I said before, I'm pretty sure Merlin is the CTO over there, CMP PR. So, they'll they'll pull some miracles out, you know, from a performance standpoint. And I think the most important thing out of what you read is they got those lessons learned from Cyberpunk 2077. And look how many years it took them to get that game right on consoles. So much so that when Phantom Liberty came out, they just completely ditched uh the PS4 and the Xbox One and they focus currently, you know, entirely on this generation of consoles to make sure that they got it right. So I would be shocked if The Witcher 4 launched in the state that Cyberpunk",
            "start": 2755.52
        },
        {
            "text": "Xbox One and they focus currently, you know, entirely on this generation of consoles to make sure that they got it right. So I would be shocked if The Witcher 4 launched in the state that Cyberpunk 2077 did because there's no excuses at this point. They have the lessons learned from it. They obviously seen how uh the community reacted to it. Hell, PlayStation removed it from their store at one point. That's how bad technically challenged it was at one point. So, yeah, I'm very impressed by what what we got to see. I watched that entire uh Digital Foundry interview. So, it was very fascinating to hear from the engineers themselves of what they're doing with this. And uh I mean, I wouldn't expect the Witcher 4 till what probably 2028 at this point. Yeah. maybe 2027 if we're lucky. So, we'll see. Okay, keep an eye on that one. Uh Anthony Adam writes it with a super chat and says, \"I feel like the Cyberpunk incident actually caused a lot of console players to move over to PC game space. I",
            "start": 2804.96
        },
        {
            "text": "see. Okay, keep an eye on that one. Uh Anthony Adam writes it with a super chat and says, \"I feel like the Cyberpunk incident actually caused a lot of console players to move over to PC game space. I for one moved over to play Cyberpunk.\" Uh Paris, that was a tough launch on console for me. I didn't get to really jump into Cyberpunk on my Xbox because of how bad that launch went. But yeah, the idea of moving players over to PC, Anthony, it sounds like made a PC gamer out of him so he could jump in and play his favorite game of Cyberpunk, which is awesome. Yeah, I mean I mean uh you know, The Witcher 3 is what got me on PC because I wanted to play, you know, obviously the demos and everything that you showed. So yeah, going all the way back to 2015, that's when I decided to play on PC. Cyberpunk I played the majority on PC, but I did jump back and and played a good amount of it on the Series X as well post them, you know, fixing a lot of things and yeah, it looked and played great. So,",
            "start": 2851.12
        },
        {
            "text": "I played the majority on PC, but I did jump back and and played a good amount of it on the Series X as well post them, you know, fixing a lot of things and yeah, it looked and played great. So, I would expect the very same for The Witcher 4. Story number six, Stellar Blade sold 1 million copies in just 3 days on Steam. This coming from Darren at GameSpot. Stell Blade launched last week for PC, and its first weekend saw the biggest spike in concurrent players, an early trend often seen with major releases. After reaching a peak of 147,000 concurrent players on Steam shortly after launch, the number surged to 192,000 concurrent players on the weekend. This doesn't include the players on Epic Games Store where Stellar Blade is also available for purchase as noted by industry analyst Daniel Ahmad. Uh Stellar Blade is doing very well in China thanks to the Chinese dub of the game and being priced much cheaper there. Shift Up also confirmed that Stelllade has sold over 1 million units in",
            "start": 2896.4
        },
        {
            "text": "Ahmad. Uh Stellar Blade is doing very well in China thanks to the Chinese dub of the game and being priced much cheaper there. Shift Up also confirmed that Stelllade has sold over 1 million units in just 3 days. And with PS5 sales combined, this brings a grand total of sales up to 3 million so far. The game has also been fine-tuned since launch, and it has received two major expansion packs as well. Paris, people want to play Stellar Blade on PC. It's selling well. Yeah, not surprised. It was a great game. It's a great game. So, yeah, of course. Now that it's available on PC, it's just more people are going to have opportunity to play it. And it's clearly these sales numbers are reflecting it. Totally, Paris. I mean, congratulations. A a a good game is always going to be good, Paris, and where it comes to, people are going to want to jump up and play it if they haven't been able to play it yet. So, congratulations on the big concurrent players. Uh 3 million sales so far. Uh that's",
            "start": 2949.6
        },
        {
            "text": "where it comes to, people are going to want to jump up and play it if they haven't been able to play it yet. So, congratulations on the big concurrent players. Uh 3 million sales so far. Uh that's insane with PS5. So, congratulations, Paris. That's big news. Stellar Blade is selling big players. They got a big player base. If I wanted something a little bit smaller than the Stellar news story, where would I go? you'd go to our last story, the Wii News Channel, where we cover all the small news items you need to know about. Let's take it to Wii News to wrap up the show. Story number seven, Wii News. Shadow, the global leader in high-performance cloud computing, is proud to announce the launch of Neo, a brand new cloud gaming PC offering designed to deliver next level RTX experiences for gamers, creators, and professionals alike. Neo will officially roll out in Europe and North America starting June 16th, 2025, which is today. Paris Paris. cloud gaming, you know, high techch tech. Are",
            "start": 2998.64
        },
        {
            "text": "creators, and professionals alike. Neo will officially roll out in Europe and North America starting June 16th, 2025, which is today. Paris Paris. cloud gaming, you know, high techch tech. Are you interested in checking out Shadow at all for Neo? Yes, I am, cuz I I am I am a huge fan of cloud gaming. I think it's the future of where we're headed. Okay. All right. Keep an eye out for that. I'm sure in the uh next couple of weeks we will probably talk about that and where it's at. Fantasy Life, The Girl Who Steals Time, has surpassed 1 million units sold worldwide. Congratulations Eddie at GameSpot, actor Rob White weed off, apologize on that, who played John Marston in oh Rockstar's Red Dead Redemption series, has teased that he has such exciting news to share as soon as this week. I saw that clip go live. Of course, John Marston's voice actor, um, Rob W over here teased that he's got some big news this week, Paris, and we should all be ready to rock and roll as something could happen.",
            "start": 3051.44
        },
        {
            "text": "clip go live. Of course, John Marston's voice actor, um, Rob W over here teased that he's got some big news this week, Paris, and we should all be ready to rock and roll as something could happen. Paris, what do you think this is going to be? I I do think it's the switch, too. Oh, snap. Okay, Paris, I didn't think of that. Okay, that's exciting. What did you think it was going to be, Mike? Uh, you know what, uh, Barrett, I didn't really have a good vision in my mind. I thought maybe we'd be going back to Undead Nightmare Bus or Bar just cuz I hold it so tightly to my heart. But yeah, I when he was saying that, my mind was racing. I'm like, man, that's a lot of games. Where am I at? I don't remember. So yeah, switch two. That's it right there. Parents also saying just in general a nextG update would be exciting for Red Dead 2 as well for like a PS5, Xbox Series. That'd be exciting. The 61 indie showcase returns on September 18th, 2025. Submissions are open until June 20th or on June",
            "start": 3108.4
        },
        {
            "text": "update would be exciting for Red Dead 2 as well for like a PS5, Xbox Series. That'd be exciting. The 61 indie showcase returns on September 18th, 2025. Submissions are open until June 20th or on June 20th and will close on July 8th. As always, participation remains completely free and open with zero barriers to all indies interesting interested in submitting. Please visit 61indy.com/showcase. So, another 61 indie showcase coming this September. You, if you're an indie developer, you got a cool game, go out there, submit your stuff, and get shown over there. Rematch slow clap soccer game tweets. Crossplay between Steam, PlayStation, and Xbox won't be available at launch, but it's one of our top priorities for the upcoming updates. We'll share an ETA as soon as possible. Stay tuned. #reatch Paris. This game had so much juice going in. And I will say this, usually not having crossplay at launch is a major snowbike mic multiplayer gaming in 2025. No, no, you got to have that. But this",
            "start": 3152.72
        },
        {
            "text": "Paris. This game had so much juice going in. And I will say this, usually not having crossplay at launch is a major snowbike mic multiplayer gaming in 2025. No, no, you got to have that. But this game is so good, Paris. This game has got the juice that I think it will be just fine through launch, but it needs to have crossplay later on 100%. But at the same time, like this game has got the juice. It's real good. I think it's going to be okay. I think it's going to be okay. Finally, VGC reports the standard edition of gear gearboxes Borderlands 4 won't cost $80 after all. Gearbox announced on Monday that Borderlands 4 will cost $70 for its standard edition. It also confirmed a $130 Super Deluxe Edition, which includes bonus items and DLC, and a $150 collector's edition, which doesn't include the game itself. Okay. Well, that doesn't sound right. True fans will find a way to get that uh collector's edition. That's crazy. That's crazy. Okay. Uh Paris, $70 for Borderlands 4. I mean, yes,",
            "start": 3213.2
        },
        {
            "text": "the game itself. Okay. Well, that doesn't sound right. True fans will find a way to get that uh collector's edition. That's crazy. That's crazy. Okay. Uh Paris, $70 for Borderlands 4. I mean, yes, good news that it's 70 bucks, even though I just the prices of games are just killing me. I'm glad this is 70 and it's not 80 or or higher. But this is why Randy should have never tweeted. He should have just closed his laptop and walked away. should have walked away from that one. None of this. Yeah, but to your point about that one edition not even having the game, it's like you can't even throw the digital code in there on that. It's like gh that's crazy is right. Let's jump into some super chats while we wrap down the show. Feel the Surge writes in and says, \"Happy Monday, you two. Mike, any updates on your One Piece journey? I think the last thing I heard was Marine Ford. Where are you?\" Thank you, big dog. Hey, Feel the Surge, thank you so much for writing in. Your boy Snow Mike Mike",
            "start": 3271.44
        },
        {
            "text": "updates on your One Piece journey? I think the last thing I heard was Marine Ford. Where are you?\" Thank you, big dog. Hey, Feel the Surge, thank you so much for writing in. Your boy Snow Mike Mike Mike has not returned to One Piece. I'm in the middle of Marine Ford. I'm watching hard. Uh, but I have not been having any watching sessions lately. It's been a lot of Lazarus, a little My Hero Academia vigilantes with Barrett. I get to talk to him a little bit about, but I'm in this weird stage where I haven't been playing One Piece, but all I've been thinking about is One Piece. So, I got to watch some here soon. We'll schedule a kind of anime for later in the year. Hopefully, that'll get a spark a fire under your butt to get back to One Piece. I love that. Uh, Jacob Jacob C writes in and says, \"Barrett, will you go see Raphael Dav Devers at the Giants game now that my idiot Red Sox have traded him to SF? I hate my team.\" A lot of conversation about this player, Bear. What's up? Uh,",
            "start": 3323.04
        },
        {
            "text": "says, \"Barrett, will you go see Raphael Dav Devers at the Giants game now that my idiot Red Sox have traded him to SF? I hate my team.\" A lot of conversation about this player, Bear. What's up? Uh, yeah, that was a that was an interesting trade. Uh, even my when I texted my dad that uh I was going to go see the Guardians this Thursday, he was like, \"Hey, you get to see Devers play. That's exciting.\" So, um I'm not as familiar with him as a player, but uh I'm I'm excited to see what he's got on Thursday if that's if he's already starting to to play. I don't know when that trade uh happens, but yeah, big deal. Paris, of course, our Giants are playing pretty well this season. So, some kind of high hopes to make it to October baseball right now. Giants are playing well. Guardians, not so much. Even my dad was like, \"Uh, hey, go Giants.\" Cuz the Guardians, not it this year. I'm I'm just excited to see see my home team uh in town. My Padres's are playing well, too. I like that. I like that.",
            "start": 3360.4
        },
        {
            "text": "Even my dad was like, \"Uh, hey, go Giants.\" Cuz the Guardians, not it this year. I'm I'm just excited to see see my home team uh in town. My Padres's are playing well, too. I like that. I like that. And screw the Dodgers. I think we are in agreement. Screw the Dodgers. Boo. Boo. Yeah, my Colorado Rockies suck. I have to go to an Oakland Athletics game in Sacramento to see that stadium to see them at that minor league ballpark. That's wild. Uh, and so yeah, baseball summer time to get outside and go enjoy a couple of innings and some hot dogs. It's going to be a good time. Our final one, Kobe writes in to says, Kobe writes in and says, \"What's good, Mike and Paris? Played Gears Reloaded with my dad this weekend for Father's Day. We were washed, but it brought so much nostalgia since this was the game that started our gaming journey together.\" Dang, Kobe, that's awesome. Yeah, that's great. As Paris brought up, great co-op campaign experience, Paris, for you and your friends to play up",
            "start": 3404.0
        },
        {
            "text": "the game that started our gaming journey together.\" Dang, Kobe, that's awesome. Yeah, that's great. As Paris brought up, great co-op campaign experience, Paris, for you and your friends to play up to two players on that. and just memories. Paris, I'll never forget Halo 2 was our game. Halo 2 when we would used to go over to AJ Tesserero's house. It was the young kids, me and AJ and all of our friends and Phil, his older brother, and all of his friends in the the other room and it was non-stop Halo. But I'll never forget the day that Gears came out and Phil was playing Gears and everybody kind of creeped into the room was like, \"What's that?\" And they're like, \"Oh, that's Gears of War.\" I just realized something. If this is the Kobe that I'm thinking it is with his dad. I I met him at Summer GameFest. We we hung out a little bit at Summer GameFest. Met his dad. Super awesome. Super awesome guy. Dad is awesome as well. So that's really cool that that they got to connect and play some",
            "start": 3448.24
        },
        {
            "text": "GameFest. We we hung out a little bit at Summer GameFest. Met his dad. Super awesome. Super awesome guy. Dad is awesome as well. So that's really cool that that they got to connect and play some gears together. Which by the way, uh you know, XCAST alumni, you know, when we've always had guests on the show, uh Lightweight Gaming, who I know she's been on other shows on camp as well. Got to meet her in person. She's awesome. as well, man. So, shout out. He's great. Fantastic creator. And let me let me say this. I'll say this directly to Greg. Mike should have been at the Xbox. I missed you. I missed you, Paris. Should have been Mike. I'm just saying. We're going to have some good gaming memories. Me and Paris are going to hit the road on some fun, awesome moments. Uh hopefully there's some great gaming experiences that me and Paris can go take part of and have some fun with all of you. What about Gary? Uh Gary. Yeah, we'll call Gary. We call we call him up. We call them up. We'll call",
            "start": 3495.6
        },
        {
            "text": "great gaming experiences that me and Paris can go take part of and have some fun with all of you. What about Gary? Uh Gary. Yeah, we'll call Gary. We call we call him up. We call them up. We'll call him. Of course, you can always write in with your wrongs anytime we get anything wrong throughout today's show. Paris, I updated that one. I have nothing on the your wrong side. Uh so, let's keep it going with our sign off. This has been kind of funny games daily. Each and every weekday, we run you through the nerdy news you need to know about live on YouTube, Twitch, and of course on podcast services around the globe. If you love what we do, consider supporting us with the kind of funny membership on Patreon or YouTube to get all of our shows ad free to watch us record them live and get your daily exclusive show. Greg Way, enjoy the games cast after this and of course kind of funny podcast and the stream. But until next time, it's been our pleasure to serve you.",
            "start": 3540.72
        }
    ]
}