{
    "id": 14285,
    "video_id": "wAxnQYwEZVQ",
    "show_name": "Highlights",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Mike Howard",
        "Parris Lilly"
    ],
    "title": "Are There Too Many Handheld Consoles?",
    "description": "From Gamescast: https://www.youtube.com/watch?v=_LxxfRp_h2g&t=2001s&ab_channel=KindaFunnyGames Go to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\n\nFOLLOW US ON EVERYWHERE!\n---------------------------------------------------  \nYouTube: Youtube.com/KindaFunnyGames\nTwitch: https://www.twitch.tv/kindafunnygames\nPatreon: https://www.patreon.com/kindafunny/\nTwitter: https://twitter.com/KindaFunnyVids\nInstagram: https://www.instagram.com/kindafunnyvids/\nTikTok:  https://www.tiktok.com/@kindafunnygames?lang=en",
    "published_at": 1750280465,
    "duration": 1102,
    "transcript_chunks": [
        {
            "text": "Any opening statements about the state of handheld gaming in 2025? Paris Lily, I think Microsoft with Windows has an opportunity to really dominate that market for everything that you were just talking about. Windows is the dominant operating system. Windows allows you to have anti-che so you can play games like Fortnite and Call of Duty. Windows allows you to have multiple storefronts, whether it be Xbox, Steam, GOG, Epic, Ubisoft on on down the line. Obviously, what we got to see uh last week is them trying to iterate and and have a a true Windows handheld experience that's easy to use. Press the power button, you're into your games, you're able to play them, have the multiple stores. We talked about the emulation piece of this. Obviously, Windows is very friendly with that as well. They're not there yet. I want be crystal clear on that. There is still work that they need to do to get there. I think right now clearly Nintendo with the Switch 2 kind of dominates the handheld market.",
            "start": 0.0
        },
        {
            "text": "not there yet. I want be crystal clear on that. There is still work that they need to do to get there. I think right now clearly Nintendo with the Switch 2 kind of dominates the handheld market. We're seeing the sales numbers out there. I say behind them what Valve has done with Steam OS. But Linux, you know, has its limitations, which is why I think Windows does have an opportunity if they can kind of shore up some of those sore points that they have right now. But I'm excited for the future of handheld gaming because I do think there is a market there. I think every everything that you listed out about it, the fact that I can play my AAA PC games on the go when I'm traveling, I can cloud stream them at high quality as I'm sitting on my couch, you know, through through my my internal network. Things like that excite me for the future of where handheld gaming is going. Um, we're almost there, I think, but there's still work to be done. Mike, I actually don't know about you and",
            "start": 54.32
        },
        {
            "text": "network. Things like that excite me for the future of where handheld gaming is going. Um, we're almost there, I think, but there's still work to be done. Mike, I actually don't know about you and handheld gaming at all. Like, what are your thoughts on it in general and let alone 2025? Yeah, I'm more the person on the fence about handheld gaming here, probably on this panel. Uh, I feel like I am surviving an onslaught of everybody having a handheld gaming device now or announcing a new one that I should go purchase. I am just overwhelmed on the Tik Tok shop of all these different emulators that are trying to get sold for 70 to 100 plus dollars. And so for me, handheld gaming has kind of come really fast on these past couple of years where before it was clear, this is the Game Boy. I like the Game Boy. This is my Nintendo 3DS. I get that, right? I think the Nintendo Switch really nailed the handheld for me after, of course, the PSP and VA, which I loved and enjoyed. But the Switch",
            "start": 99.92
        },
        {
            "text": "the Game Boy. This is my Nintendo 3DS. I get that, right? I think the Nintendo Switch really nailed the handheld for me after, of course, the PSP and VA, which I loved and enjoyed. But the Switch nailed what a handheld to me in this new generation should be, right? It is a atome console and then it can be picked up and on the- go for that versatility and that portability. And so for me now, I look at my Switch, it's like, okay, well, they nailed that. Like that is where I go to. But I am someone who plays in a lot of different ecosystems and I kind of want my games to come with me and I've always had a dream of X Y and Z, Xbox, PlayStation, Nintendo, Steam all coming with me somewhere, right? And so now I'm a little overwhelmed by how much options there are and the worry that if I invest X amount of dollars into something, I'm going to be left behind or I'm going to miss out on something or it's going to become e-waste. My favorite word, Tim Gettys, in 3 to 5 years where no, that's",
            "start": 146.48
        },
        {
            "text": "X amount of dollars into something, I'm going to be left behind or I'm going to miss out on something or it's going to become e-waste. My favorite word, Tim Gettys, in 3 to 5 years where no, that's not viable anymore. We've moved past that, right? As an Xbox fan, we've come hard off of the Xbox Series S. And I know for me and Paris will tell you, not many games were really held back by that. But there was way too many news stories of the Xbox Series S is holding it all back. They can't make games for this. Oh, this game's not releasing there. And so I worry about handhelds being the same way of like if I invest this now this game won't run on it or this game runs so poorly on it it's not worth it. And so I'm a little more on the fence about that. I think portability as well is a fun conversation we'll have here uh throughout. But yeah, I'm more of the apprehensive of like I'm ready to commit but I don't know which one to do because there's too many. Greg Miller. Hi Tim. How are you?",
            "start": 194.4
        },
        {
            "text": "we'll have here uh throughout. But yeah, I'm more of the apprehensive of like I'm ready to commit but I don't know which one to do because there's too many. Greg Miller. Hi Tim. How are you? I'm great. How are you? What are your thoughts on handheld gaming in 2025? What a time to be alive. Uh, you know, I think we're very lucky and me in particular since I'm a little bit older than most people and not older than Paris. Come on, no one's that old. Uh, but the idea that, you know, I've talked at length about the fact that all the nerds like me grew up and kind of took over the world in some very bad ways, but in some great ways, right, in the way of like all these superhero movies we get and all this cool [ __ ] and how popular video games are and da da da. But the fact that handheld gaming is where it is in 2025 is so special to me. As someone who's always loved handheld gaming, right? Game Boy was my first Nintendo anything. I was a a Sega kid and then I had to beg mom for that. She",
            "start": 238.8
        },
        {
            "text": "is where it is in 2025 is so special to me. As someone who's always loved handheld gaming, right? Game Boy was my first Nintendo anything. I was a a Sega kid and then I had to beg mom for that. She said, \"There's no way I'll ever spend $100 on a video game console and then Aunt Dell bought it for me.\" Um, and then, you know, from there it was into Game Gear and it's been on every other uh stretches you go to PSP, DS, 3DS, etc. You have to go through all this, right? But especially when I came to IGN in 2007 and you'd sit there and review all these different versions of games and really find usually and I'm talking about like you know crossplatform tie when they're trying to do like a tie-in or a thing or a wrestling game or a sports game find the handheld version to be so less than you know what I mean not be able to I'm not talking about exclusives or something like Elite Beat agents or Lumines or whatever right but like you're getting into these games that were designed for the",
            "start": 277.2
        },
        {
            "text": "know what I mean not be able to I'm not talking about exclusives or something like Elite Beat agents or Lumines or whatever right but like you're getting into these games that were designed for the handheld of their choice and what they were and that's good but As we've seen this industry coales, right, and become, oh man, games cost so much money, we can't afford to take chances. Handheld gaming as we knew it in 2007 could never exist like it does now. And rather than it go away, it really opened up to, hey, gamers want to be able to play their games everywhere. You know, I I joke around obviously all the time about the VA and the PSP and you know, they I just Blue I BSed Blue Sky uh Tim uh that you know, VA crawled so that all of these handhelds could run. But for real, like hats off to Nintendo. Thank you so much Nintendo for with the Switch One going like we are going to make this thing. It's the one Nintendo system. There isn't a handheld and a console anymore. It's just one. And",
            "start": 322.24
        },
        {
            "text": "Nintendo. Thank you so much Nintendo for with the Switch One going like we are going to make this thing. It's the one Nintendo system. There isn't a handheld and a console anymore. It's just one. And the fact that people ran to that for as underpowered as it was and were like, I want this and that PC manufacturers took notice, PlayStation took notice, Xbox took notice. So now we are, hey, let's solve these problems so you can get a good enough experience in a handheld form factor that you can somehow complement your other devices. Like I am so thrilled right now where we're at, let alone where we're going to be in 6 months, a year, 2 years, 5 years, 10 years when suddenly like this isn't even a conversation anymore. It's just all ubiquitous and it's, you know, streaming 4K, whatever the hell it is. I don't know. This episode's brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium",
            "start": 368.32
        },
        {
            "text": "the hell it is. I don't know. This episode's brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized shades that won't break the bank. Shitty Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people. They have hundreds of options to choose from, so you're bound to find the perfect pair to match your style. If you don't love your shades, exchange them for a new pair or simply return worry-free within 30 days. There's no risk when you shop. Their team are always there to have your back with personal and fast support. Y'all know I've been outside a lot playing Pokémon Go, and it's such a great experience wearing Shady Rays when I'm out and about looking dope. Exclusively for you, Shady Rays is giving out their best deal. Head to shady.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five",
            "start": 411.2
        },
        {
            "text": "and about looking dope. Exclusively for you, Shady Rays is giving out their best deal. Head to shady.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. Again, go to shadyrays.com, use code funny to get 35% off polarized sunglasses. Tim, I'm right there with you. I mean, we are living in such a great time in terms of portable gaming devices, handheld gaming devices on the PC and console side. Like, I feel like because of how handheld devices are, they're they're kind of a area in tech that cares about the tech of it, I think, more than most because it has to have the hardware to be able to run the games, but also a screen to be able to display them, but also a controller to be able to to have the inputs, right? So the combination and ingenuity required for these devices I think requires them to really like push things forward and come up with like new standards that everyone can then learn from each other. And",
            "start": 455.6
        },
        {
            "text": "the combination and ingenuity required for these devices I think requires them to really like push things forward and come up with like new standards that everyone can then learn from each other. And it reminds me a lot of thinking about just controllers and like all right there wasn't a D-pad until there was. There wasn't an analog stick until there was. And then there becomes these kind of like standards that are set of we need shoulder buttons. We need this many face buttons. And you know if a controller came out for a new system and it had 20 face buttons, guess what? They're not going to be used because games need to be made for every single device. So they have to be homogenized to a certain level. So, I think we're at a great sparities. And I think we're in a great place that no matter what your needs are, you'll at least get a good enough version if you're willing to spend the money. Uh, and I think all of that is only going to get better and better over the next couple years.",
            "start": 503.2
        },
        {
            "text": "what your needs are, you'll at least get a good enough version if you're willing to spend the money. Uh, and I think all of that is only going to get better and better over the next couple years. But I think that we are firmly in a present where it's here. This is happening. And it's not a, oh man, this is going to be so great in a couple years. It's going to be, oh, it's just going to be better. And uh, I really do think that we're at the point with handheld gaming that we were with the I'll say iPhone 10 when it for finally went full screen, right? And it's just like ever since then, it's like cool, the phone tech's being upgraded, but at the end of the day, the iPhone X is all you need, you know? And sure, an iPhone X in 2025 is maybe unacceptable, but like in terms of what it needs to do, it has all those functions. And I only use iPhone cuz I've only had iPhones, but Android as well, whatever the equivalent when it went full screen. Um, must have been like the Samsung S freaking",
            "start": 549.6
        },
        {
            "text": "do, it has all those functions. And I only use iPhone cuz I've only had iPhones, but Android as well, whatever the equivalent when it went full screen. Um, must have been like the Samsung S freaking 12 or some [ __ ] But like the cookie cutter, cookie dough, shut up. Whatever the hell it is. Uh, my point being, I feel like we're already at that point. the we're at the the convergence points the smartphones hit a decade ago now because we're freaking crazy old. Um, but I think handh held devices on the small side are perfection and on the higherend side I think with the help of cloud streaming are essentially at perfection. But without that we're just a couple years away from being in in a perfection place. Having said that, the moment we get there, the hardware for consoles and PC is going to be higher anyway. So we're always going to be chasing that high to some extent. 100%. Yeah. Um I want to get into a bunch of specifics of what we use and our experience with things and if there's",
            "start": 595.84
        },
        {
            "text": "to be higher anyway. So we're always going to be chasing that high to some extent. 100%. Yeah. Um I want to get into a bunch of specifics of what we use and our experience with things and if there's products that we we don't like. Uh Paris, what what are your kind of if not daily drivers? Like what are what are your the handheld devices you stand by? Steam Deck is probably my number one handheld that I use. Um, I I just prefer through the hardware and obviously the user interface that Steam OS has. And I have enough of the games I like to play on my Steam library that it makes it pretty accessible for me. After that would be the Switch. I mean, clearly from the Nintendo games that I would be able to play on that. I do have um, and I never get these names right, but I have the the Rogue Ally, the original one. Um, I actually dual boot that with with Steam OS and Windows right now just to go back and forth. It is my least use because of the user interface of Windows. I'm just not a fan",
            "start": 640.4
        },
        {
            "text": "the original one. Um, I actually dual boot that with with Steam OS and Windows right now just to go back and forth. It is my least use because of the user interface of Windows. I'm just not a fan of it currently. Obviously, they're working on that to fix it as I already talked about, but Steam Deck would be my primary. Mike, what about you? Do you have any uh Steam Deck and the Switch? Of course, I go to where my collection of game catalog is, where I've spent the most money, where I want to be able to play those games anywhere. And so right now it is Steam with the Steam Deck and it is the Nintendo Switch. I am looking forward to this Xbox partnership with the ROG Ally to see if this is going to be for me cuz yeah, that's where my big base of game library is and so I'm hoping for the best. But yeah, right now I I I enjoy the Steam Deck whenever I play it and then the the Nintendo Switch too. Greg, hey, how are you Tim? I'm good. Uh yeah, I mean it's a tossup depending on what I'm",
            "start": 686.24
        },
        {
            "text": "best. But yeah, right now I I I enjoy the Steam Deck whenever I play it and then the the Nintendo Switch too. Greg, hey, how are you Tim? I'm good. Uh yeah, I mean it's a tossup depending on what I'm reviewing or playing. Uh if I'm playing something uh for funsies, it's usually going to be the Raw Ally X. Uh it has, you know, I got it all set up in January and it has dominated my year in terms of what I play. It's made me an Xbox gamer uh thanks to Xbox Game Anywhere, right? We're at that po point right now that comes around I'd say every year and a half, you know, it's kind of like the blood moon or whatever where I go, man, I should really be into No Man's Sky and I start a new [ __ ] thing and I do the new [ __ ] thing every year. Every year and a half I really like I and then eventually I'll I'll play for, you know, 10 or 20 hours and then it's really going to want me to do like a bunch of, hey, go craft all this stuff. I'm like, I don't want to make [ __ ] factories or whatever",
            "start": 731.28
        },
        {
            "text": "I'll I'll play for, you know, 10 or 20 hours and then it's really going to want me to do like a bunch of, hey, go craft all this stuff. I'm like, I don't want to make [ __ ] factories or whatever and I'll stop. Uh, but this is the first time where I was like, \"Wait a second.\" You know, I went to redownload on place and I was like, \"Wait, open up the Xbox app on the rag. There it is on game pass. There it is. Xbox game anywhere. Download it here. Download on the the ex the exit home. Be all set, right?\" Uh, and then if I'm doing PlayStation stuff, also review stuff. It's going to be on the portal. So, right now, right, it's interesting because you figure it was all ROG in the runup to Switch uh Switch drops. We play a bunch of that. And then of course, as Paris already said, we are reviewing Death Stranding 2 on the beach right now. You can look for our review one week from today on the Kind of Funny Games cast where Jerica Hannah is flying herself out here to be on the panel and",
            "start": 776.8
        },
        {
            "text": "Death Stranding 2 on the beach right now. You can look for our review one week from today on the Kind of Funny Games cast where Jerica Hannah is flying herself out here to be on the panel and review it alongside us from JK Games. Uh but you know, now that I'm doing the Death Stranding grind, I'm out playing my Portals on every night at home, of which I have two. I have one for the office and one for home because I love the portal so much. Yeah. Yeah. So, it really comes down to what I'm playing at that moment. Obviously with Switch 2 being so hot right now, I'm excited to get back to that after this. But again, now I gota do this No Man's Sky thing. You gota go do it. They got You got to do get lost. I know the call. And I play 300 hours. Never. That never happens. Yeah. I uh am very lucky that I'm in a position that I get to try out so many of these things. And also like anyone that's listened to us for a while knows like I am obsessed with this type of tech. And like I care deeply",
            "start": 813.92
        },
        {
            "text": "that I'm in a position that I get to try out so many of these things. And also like anyone that's listened to us for a while knows like I am obsessed with this type of tech. And like I care deeply about every factor that we we mentioned I care about. So, while I am on a forever quest to find the one device to rule them all, I have definitely learned that just doesn't exist. And when I care as much as I do about each of the verticals, I want the best for each vertical, right? Um, so because of that, like I actually run a ton of different devices for different reasons. And even sometimes a specific reason, PlayStation comes to mind. When I'm streaming a PlayStation game, it is a question for me of am I going to use the Portal or am I going to use my Steam Deck OLED? And it comes down to do I for the game I'm playing, do I care more about the haptics and uh ergonomics of the Portal, which is perfect in my hands, or do I care more about the OLED screen that is just that much better than",
            "start": 853.28
        },
        {
            "text": "I for the game I'm playing, do I care more about the haptics and uh ergonomics of the Portal, which is perfect in my hands, or do I care more about the OLED screen that is just that much better than the the Portal in addition to running cloud streaming significantly better than the PlayStation Portal does when you get everything all tinkered in. Um, but the other ones I want to give a shout out to for sure because of course the Nintendo Switch 2, that's the best single device if you just want to keep things easy and you're a Nintendo fan. It's a no-brainer. Um, you know, things are going to work and the things that are going to work are your Nintendo games, both modern and go back to NSO. Great ways to play at this point a very sizable library of the vast majority of Nintendo's history you'd ever want to actually play. Um, but that is not at this point something I could be like if it's your only gaming device, the Switch 2, because we just don't know if the thirdparty support's going",
            "start": 896.0
        },
        {
            "text": "ever want to actually play. Um, but that is not at this point something I could be like if it's your only gaming device, the Switch 2, because we just don't know if the thirdparty support's going to be what I expect it to be, but it's still a little too early for that. But on the handheld side, like the old school emulator side that I care a lot about. To me, the creme to la creme, it's the Retroid Pocket 5. This thing shaped like a Vita, but bigger buttons. Uh, beautiful OLED screen, like one of the nicest screens I've ever seen. Um, and this thing can go all the way up to like PS2 and all that easy. PS3 and that sometimes hit or miss or whatever, but if you dial things in, you can get it going. But in addition to all that, it streams great. Like this could be a PlayStation Portal replacement. Um, most devices can be as well. So, um, I absolutely love this thing. What is that using to play remote play? Is it doing the Chiky like on Steam or Chi for Deck? Uh, similar things. There's a",
            "start": 939.12
        },
        {
            "text": "Um, most devices can be as well. So, um, I absolutely love this thing. What is that using to play remote play? Is it doing the Chiky like on Steam or Chi for Deck? Uh, similar things. There's a thing called Moonlight that you can use. Like there's a lot of just uh streaming platforms that are real dialed in cuz the people making these apps and programs are doing it for this specific reason. So it's like they're really tuning it in. It's an interesting one where just uh uh the other day our friend Tamore uh from GameSpot had uh put up a BS. That's a blue sky Tim. Uh he was out there bsing about how the remote play or the portals never worked for him for remote play. It's always this. It's always a while. And I have the complete inverse where for me on my deck when I was uh using my deck before the rag and now with the rag when I use chiky what chik chaki I can I never get a great connection out of it. I get a lot of artifacting. I just and I don't think the visuals look as sharp as on",
            "start": 982.4
        },
        {
            "text": "the rag and now with the rag when I use chiky what chik chaki I can I never get a great connection out of it. I get a lot of artifacting. I just and I don't think the visuals look as sharp as on my portal which is a weird one. And so it's just a a flip where I feel like I've been burned enough that I'm always going to stick to hey I want the PlayStation device. It very much is an iPhone versus Android thing. Uh the PlayStation Portal it does just work uh once you set it up. I mean, and it's very specific in your house, it just works. You can take it farther if you want to, but on the the other side, the more time you spend tinkering and dialing in on all the specific like internet data stuff, it's a much better experience, but you have to do that stuff. And it does require a lot more um [ __ ] like honestly. Um but my favorite thing, my use case for this one is being in the bed. Like it's just so small and being able to remote play my systems like it's awesome. You're used to small",
            "start": 1023.12
        },
        {
            "text": "[ __ ] like honestly. Um but my favorite thing, my use case for this one is being in the bed. Like it's just so small and being able to remote play my systems like it's awesome. You're used to small things in the bed. I am. That's true. I got him. Uh, Paris, I saw you ready to jump in there for for something. Oh, no. I was just going to me I forgot to mention the Portal what you guys were talking about. I use the Portal obviously as well uh for PlayStation games when I'm just sitting out on the couch and playing whatever. It's it's a great device. Ironically enough, I had a lot of issues when it originally came out with the Wi-Fi. It was very spotty in my house, but ever since they did that update last year, it's it's been great. been pretty flawless.",
            "start": 1062.88
        }
    ]
}