{
    "id": 14209,
    "video_id": "wDKaLwlmij0",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Andy Cortez",
        "Blessing Adeoye Jr."
    ],
    "title": "PlayStation State of Play June 2025 Kinda Funny Live Reaction & Review!",
    "description": "Go to http://kindafunny.com/XREAL to grab yours now!\n\nTime Stamps:\n00:00:00 - Start\n00:15:06 - State of Play Reactions\n01:11:29 - Post Show Breakdown\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1749078974,
    "duration": 8447,
    "transcript_chunks": [
        {
            "text": "What's up and welcome to Kind of Funny's live reaction to the June 2025 PlayStation State of Play. Um, I guess kind of kicking off our summer GameFest coverage. That's that's a little wild, you know, PlayStation coming through last minute. I was going to say not they weren't on your dance card to begin with. You know what I mean? Here they are. Here they are now. Uh, sneaking in in the beginning. It's going to be a great time. and we're going to live react after this. We'll do our games cast breaking down everything that we just saw. But of course, you're going to want to stay tuned to kind of funny all week long because the Switch 2 is here, Summer GameFest is here. Um later tonight at about 7:45, we're going live on the Twitch channel um to go all night long playing Mario Kart and all the other Nintendo Switch 2 launch titles, etc., etc. Checking things out, all the old games. Are they new again? We'll have to see. Uh and then of course live reacting on Friday to Jeff Keelley's",
            "start": 7.76
        },
        {
            "text": "the other Nintendo Switch 2 launch titles, etc., etc. Checking things out, all the old games. Are they new again? We'll have to see. Uh and then of course live reacting on Friday to Jeff Keelley's summer gamefest event and uh doing the same rigmar roll our whole thing about the the games cast breakdown. Then on Sunday we have the Xbox showcase. But that's all later. Now we're here PlayStation. I'm Tim. That's Bless. That's Greg. That's Andy. Boys, how are we feeling? Bless. Feeling pretty good. Very excited. Um there are only a few things that I have expectations for and so I feel like there's a lot that they can surprise us with. Right. There have been the murmurss about the Greek God of War game and you know you imagine that we see it here today or Summer GameFest but more likely here today. Um there's that there's Capcom stuff always appears at State of Plays, right? And so I'm excited to see if we see a Resident Evil 9 if we see a Marvel vs. Capcom or whatever else they could be",
            "start": 45.76
        },
        {
            "text": "today. Um there's that there's Capcom stuff always appears at State of Plays, right? And so I'm excited to see if we see a Resident Evil 9 if we see a Marvel vs. Capcom or whatever else they could be hiding up their sleeves. Uh very excited Gregory. Yeah. Uh, I think in the hullaloop that has been the Nintendo Switch 2 arriving today, being unboxed today, us going to the Nintendo store and streaming from there. Midnight launch, Mario Kart World, right into Jeff Keley, we're doing this thing outer. There's so much to talk about that I feel like entering this late in the frey, I keep forget, not forgetting, but like it's totally like it's a dark match. Like I'm not even paying attention that it's happening, that there's going to be a PlayStation state to play. So then to be here on the precipice of it, you know, right before we came out here, Kevin's like, \"You think they got something good this time?\" I'm like, I actually do, seeing as how they didn't have the usual disclaimers on the",
            "start": 88.8
        },
        {
            "text": "of it, you know, right before we came out here, Kevin's like, \"You think they got something good this time?\" I'm like, I actually do, seeing as how they didn't have the usual disclaimers on the blog of like, it's 40 minutes, but it's our third party partners and there will be there's going to be there's going to be four VR games. It's going to be this. Like, there's going to be some real stinkers here. Prepared. Uh, Andy, what about you? Um, I I think my expectations will always be down because to me, the February State of Play, nothing can reach the highs of that. how amazing that show was throughout ending with the Sorrowos reveal and Rahu Cole like I think that's as good as a state of play can get and uh I I don't really know what to expect. I'm kind of with Greg. It's such a weird shuffle of so many things happening right now that you know it's easier to hide behind 40 atrocities in one. That's that's the second time what they say and you're knocking out of the park with both",
            "start": 129.04
        },
        {
            "text": "shuffle of so many things happening right now that you know it's easier to hide behind 40 atrocities in one. That's that's the second time what they say and you're knocking out of the park with both referenced for video games, you know. Yeah. I feel like it's a good time to be pumped for video games and I think that the timing of this state of play, it being the first of the showcases of this summer gamefest, I think is that funding of anything could happen cuz like obviously I I do think that uh Resident Evil 9 will be here and it makes the most sense here, but if it's not, it still could show up in other places. So, there's kind of like this fun thing of like even PlayStation stuff, right? If a big PlayStation thing that you're expecting here doesn't show up here, they usually show up at SGF. And so, yeah, there's so much potential of what the rest of the week can hold for us. Yeah, I'm not expecting this is going to be my favorite state of play ever, but I I do expect this to be a",
            "start": 171.12
        },
        {
            "text": "SGF. And so, yeah, there's so much potential of what the rest of the week can hold for us. Yeah, I'm not expecting this is going to be my favorite state of play ever, but I I do expect this to be a good one at the very least. Like I I am expecting a actually I'm gonna even go higher. I'm expecting great from this. Yeah, that's the thing, right, where again I think since I haven't had time to cook on it and get all worked up or feel like I'm let down already by the blog post. I feel like there's a high likelihood for surprise and delight in this one in a way. Like you Xbox, I feel like we don't know everything, but I feel like I know a lot of what's probably going to be at Xbox. Of course, here it is. Like it is legitimately Shortinger's cat, right? Of like what are we about to get when we open this box? I mean, are we going to be happy? We going to be sad? We don't know. I had a Coke. How you doing? He's having a Coke right now. And that's the thing he's talking about. He doesn't know",
            "start": 209.76
        },
        {
            "text": "open this box? I mean, are we going to be happy? We going to be sad? We don't know. I had a Coke. How you doing? He's having a Coke right now. And that's the thing he's talking about. He doesn't know how to get amped up for this. There there is a Coke on the premises. Yeah, everyone. I'm just saying if I was an athlete, all right, right before that 100 meter dash, I'm chugging a Coke cuz it feels good. It makes you feel good. It makes you think fast. That's from me to you. All right. Olympic brother. I got high excitement for this one. Excitement I guess from the place of I expect great things from the sense of I think in the last few summer PlayStation showcases or PlayStation I guess presentations. The SATA plays I think have had a better track record than even the PlayStation showcase itself, right? Like we always talk about the one that had all the multiplayer stuff, the Concord, the marathon reveal, all that [ __ ] And like that was a PlayStation showcase. So when you remove that",
            "start": 248.32
        },
        {
            "text": "right? Like we always talk about the one that had all the multiplayer stuff, the Concord, the marathon reveal, all that [ __ ] And like that was a PlayStation showcase. So when you remove that from the last few state of plays that have happened in the summer, they've been generally pretty good. Like we was fizzing a state of play. Mhm. Yeah. Like I guess you'll get you Yeah, we got a fizz. We got like I mean the fighting games right between Tekken and I think Street Fighter 6 for sure was announced at a state of play. Like those are kind of the tier of announcements that we're talking about and I think for that like for summer I think they've done a pretty good job with these. So I would expect the same. I predicted it for SGF, this would also be a good place to have Capcom come out, such a good partner, and talk about Monster Hunter and what the update is for this summer. Yeah, that's true. But yeah, I think Resident Evil makes a lot of sense. But in addition to Resident Evil games",
            "start": 288.48
        },
        {
            "text": "a good partner, and talk about Monster Hunter and what the update is for this summer. Yeah, that's true. But yeah, I think Resident Evil makes a lot of sense. But in addition to Resident Evil games being announced at uh Sony events the last decade or so, uh we get a lot of Final Fantasy announcements too, a lot of Square Enix announcements. And like I I get the vibe that that shifted to the Jeff shows cuz we've seen a lot of like the rebirth updates and stuff from uh Summer Gamefest and Game Awards and stuff, but um it is definitely possible that if Final Fantasy 9 remake is finally going to show its face, it shows up here. I don't expect I think the thing about this one is there was so much that has a good chance of being here. I don't think all of it will, but the idea that there might be a God of War Metroid vania that we're about to see, that's exciting as hell. we might get gameplay of Sorrowos. Aside from that, I mean, that was my kind of big hope was either that to be at the",
            "start": 328.32
        },
        {
            "text": "be a God of War Metroid vania that we're about to see, that's exciting as hell. we might get gameplay of Sorrowos. Aside from that, I mean, that was my kind of big hope was either that to be at the Summer GameFest or to be at whatever the next State of Play would be. That was before we even knew it was going to be today. What other first party stuff do you think could show face here? See, I'm expecting partnerships. It's I think the PlayStation studios, actual owned studios are in weird places where Bluepoint, we know that they had a God of War multiplayer thing that was cancelled. Bend had a different thing that was canceled, right? Like we already know what Naughty Dog's working on and that doesn't feel like it's right around the corner. Sorrowos we know of. So I Yeah, Sorrowos update could make sense, but also maybe that you save that for September state of play. Like as far as the things that we don't know are happening. Fair games. Oh, don't Jade just pieced out. Yeah, Jade just",
            "start": 367.44
        },
        {
            "text": "make sense, but also maybe that you save that for September state of play. Like as far as the things that we don't know are happening. Fair games. Oh, don't Jade just pieced out. Yeah, Jade just pieced out. That's the other thing. You did drop the money symbol, remember? Now it's just an S. in true in um our state of play predictions that me and Tim did yesterday. I mentioned that I wouldn't be surprised to not even see Marathon here even though that's a fall game, right? Like even with that stuff, they're in weird places. So for a first party, I would expect things like I think Lost Solicide is published by PlayStation, remember correctly. I might expect something like that. Whatever the team LFG project gummy bears game is, I think could make sense to to reveal here. Little Devil Inside perhaps. We're never seeing Little Devil Inside, but yeah, like more partnership stuff. I I I would expect that. Team LG is a great call. Yeah, we're going to see the We're going to We're not going",
            "start": 406.8
        },
        {
            "text": "perhaps. We're never seeing Little Devil Inside, but yeah, like more partnership stuff. I I I would expect that. Team LG is a great call. Yeah, we're going to see the We're going to We're not going to see a gummy bear, but we're going to see frogs and we're going to hear ribbit frogs going to hear ribbit. Um I saw a couple people in the chat uh questioning if we know anything about this this PlayStation showcase or uh state of play. I know nothing about this. Do you guys I almost made a prediction then forgetting that I I have a demo for it at SGF. So that would have been bad. I don't know where that ties in if that would actually be here at Jeff or nowhere or what. Yeah, I know possibly one thing, but I don't know. I don't know if it's here. Yeah. Yeah. Again, exciting times. And I also feel like I don't need much from this. Like I feel like like a lot of the things we're talking about are exciting to me. But if Wolverine's not here, I'm not going to be like, \"Where the [ __ ] is",
            "start": 446.32
        },
        {
            "text": "feel like I don't need much from this. Like I feel like like a lot of the things we're talking about are exciting to me. But if Wolverine's not here, I'm not going to be like, \"Where the [ __ ] is Wolverine?\" I'm like, \"If it is, I'm like, \"Holy [ __ ] that's awesome.\" The hypest thing that right there, no lie, says infamous question mark. Don't even make me dream, you know? No, don't do that to him. Don't make me dream of infamous. He will drink another Coke. He's right there behind me. You want to see me bite Andy? Look at full teeth. Oh, full teeth. Yeah. Yeah. I like to gum them. We got a We got We'reing six minutes. That's like a That's like one of those cables you put at the bottom of the ocean floor. All right. I'm not breaking my teeth biting that thing. Touch his neck. We're right there. We're 6 minutes away from uh the state of play. We got a lot of super chats I want to get to. Uh Ben Rock says, \"Betting this money that Cotor remake shows up.\" No [ __ ] way. Don't make me",
            "start": 487.12
        },
        {
            "text": "there. We're 6 minutes away from uh the state of play. We got a lot of super chats I want to get to. Uh Ben Rock says, \"Betting this money that Cotor remake shows up.\" No [ __ ] way. Don't make me dream. Oh, you know what I mean? I forgot about that. I do. Yeah. I thought there was turmoil there, wasn't there? Yeah. Yeah. I don't think we're seeing that. Uh, and then Dream shows up with their Star Wars game. Says Eclipse. Yeah, I watched that trailer again a couple days ago. Uh, got to feel something. What's me and Molecule doing? Slavator says quote Killzone remasters. I'll be happy. Killzone remasters. Polifany. Not being a car guy or a Gran Turismo guy. I feel like that could drop anywhere. The first trailer of some [ __ ] sexy car. I'm surprised Grand Tur still doesn't have PSVR or a PC port. Oh yeah, because of all the VR enthusiasts. Ghost of the Where's Demon Souls on PC? Where's Bloodborne? Bloodborne. Yeah, I mean same place that you know Little Devil Insiders is nowhere.",
            "start": 522.4
        },
        {
            "text": "a PC port. Oh yeah, because of all the VR enthusiasts. Ghost of the Where's Demon Souls on PC? Where's Bloodborne? Bloodborne. Yeah, I mean same place that you know Little Devil Insiders is nowhere. Ghostly Con says, \"What are we doing? Greg, Tim, be CEOs. Don't let Bless go to a volleyball. We all want to see Bless play some Mario.\" No, it all worked out. It all worked out. Mario Kart, it looks like if the people you see who are playing it right now online got uh cartridges. We're relying on download codes. So that's why we went back to our plan for the Nintendo Switch to launch party this evening. 7:45 we go live. We'll go live from the store. Then after that, then at 9:00 it's already downloaded in there. Everybody starts playing here. Yeah. Play volleyball games at 6:30. So yeah. Still wear the knee pads though. I'll I won't change. I'll come in. Would you pad up for this? Are you elbow pads, knee pads? What do you for? No. No. I go home. wear them little shorts. Uh, sometimes,",
            "start": 566.8
        },
        {
            "text": "wear the knee pads though. I'll I won't change. I'll come in. Would you pad up for this? Are you elbow pads, knee pads? What do you for? No. No. I go home. wear them little shorts. Uh, sometimes, yeah, sometimes. Yeah. [ __ ] yeah, dude. That's awesome. They get in there, you know. Uh, Vul Dasher says, \"Call me silly because I am silly.\" But a God of War Metroid Vania like Blasphemous sounds absolutely golden. Social media seems to be a fan of the idea, too. So, hope we see that. I think we're seeing Resident Evil 9 close the show. Yeah, man. I'm sorry. Bless. I'm begging you to do anything so when I glance over, I don't keep seeing this old man in the frozen ass. I didn't care about the video. He looks friendly. He does like friendly. What is he selling me? Windows. What's happening? Uh DJ Kendall says, \"If we see Wolverine, what are we doing to celebrate? What's the biggest get hype moment you hope to see? Anything you you're sure you won't see.\" Part of me is like, are they",
            "start": 614.96
        },
        {
            "text": "Uh DJ Kendall says, \"If we see Wolverine, what are we doing to celebrate? What's the biggest get hype moment you hope to see? Anything you you're sure you won't see.\" Part of me is like, are they dropping this today because Switch is going to be all the buzz, you know? It's just like the dropping the news on a Friday afternoon so that it kind of gets buried over the weekend. You know, we have stuff to show, but not enough. It's not the biggest thing. Not enough hype to kind of overshadow the We won't take the 24 hours of getting beat and told we did a bad job because Nintendo, you'll all be pissed off about the Nintendo servers in a little bit. Yeah, exactly. You could be mad. I think it's going to be good. I think it's going to be good. I think they have some good stuff up their sleeves. Now, now I'm not saying that from a place of privilege of information. Yeah. Biggest get high moment. Again, I just feel like we're in a good spot where like there's some I don't expect to see, but",
            "start": 658.8
        },
        {
            "text": "Now, now I'm not saying that from a place of privilege of information. Yeah. Biggest get high moment. Again, I just feel like we're in a good spot where like there's some I don't expect to see, but hype mode, Kingdom Hearts 4, Final Fantasy 7 part 3, like Wolverine, uh, Wolverine's not there. Don't make me hype for Wolverine. I'm just talking about get hyp. It has been a while since Wolverine. It has been, but I don't think I don't think you know, you know what'll be nice in this in my bones. What'll be really nice in this God of War Metroid vania is that we can we'll finally see him using the chains of Olympus to grapple onto stuff and swing off of off things. Blades of Chaos. Yeah. in a way that isn't super automated. You know, like in Ragnarok it was like you just zip to that one point and that's it. Now we're going to see him like if it's sides scroll and he's going to be swinging and like that's your mobility. Can I get I know I I predicted it for SGF, but can I get like some",
            "start": 696.24
        },
        {
            "text": "and that's it. Now we're going to see him like if it's sides scroll and he's going to be swinging and like that's your mobility. Can I get I know I I predicted it for SGF, but can I get like some points if this shows up here? Yeah. Oh yeah. All people will remember is that around SGF you said this happened. Well Tim did predict this for the state of play. Exactly. Well, Blessing is the one who's been saying for so long this is real because he listened to Jeff Grub once. That's true. So, but blessing said it for SGF. Yeah, but now I think I said 2D Metroid Vania. I made that up. That was a shot. That was a three-pointer right there. Swish. Another net. What you going to do? I had a Coke. I had a Coke. Everybody look out. We're going to react to this. What happens in the state of play? Nobody knows. But we had a coke. Just looking at Tim's face the whole time. Oh, he knows at any point. At any point, where do we go from G to PG? You know what I mean? Oh, no. Uh, Tides of Annihilation is",
            "start": 735.92
        },
        {
            "text": "knows. But we had a coke. Just looking at Tim's face the whole time. Oh, he knows at any point. At any point, where do we go from G to PG? You know what I mean? Oh, no. Uh, Tides of Annihilation is the one I want to see here. What is that? TNA. Oh, yeah. Tides of Annihilation, dude. Jennifer English looks good as [ __ ] Awesome ass action game. That game looks big old creatures walking around. Yeah. Yeah. Somebody in there said, \"Really? What's going on with Mind's Eye?\" Really? Let's all pull back. I can't wait for that game to come out. I really want to play it and see what the [ __ ] it is. Uh, Vult Dasher says, \"Also playing some paying some tax because Greg and Andy look like absolute hotness.\" Damn, damn. That's [ __ ] up. That's what the Coke does to you. You know, you know, we've been drinking it and running at night like wolves naked. I haven't been a part of those activities. Christopher says, \"Andy's looking good with the jacket.\" Thanks, Doc. Uh, Mark Austin says, \"Halo",
            "start": 776.96
        },
        {
            "text": "been drinking it and running at night like wolves naked. I haven't been a part of those activities. Christopher says, \"Andy's looking good with the jacket.\" Thanks, Doc. Uh, Mark Austin says, \"Halo leads the show. Shocks the world.\" Shocking the world. Can you imagine? We hear that choir. I need a new console. You know what I It's 2 p.m. Where's the stream? Oh, that's true. It's Barrett's watching. I'm sure it's into the YouTube. I'll pull it up when it's ready. I'm saying, why is PlayStation late? They've got a countdown. I was going to bring it up when it got to 1 minute. How long's the countdown? Is one of those two minutes? You won't know until it hits 1 minute. Oh, world premiere. Here we go. There we go. Wow. We left. We got one minute to go. What did you know about going? Well, you really think Kingdom Hearts could show up here? I mean, it it the game's been announced, so they have to talk about it again somewhere. I don't think it's going to be. Oh, yeah. I I gave Kingdom",
            "start": 824.24
        },
        {
            "text": "you really think Kingdom Hearts could show up here? I mean, it it the game's been announced, so they have to talk about it again somewhere. I don't think it's going to be. Oh, yeah. I I gave Kingdom Hearts a 5%. Oh, okay. Then, you know what? I'm going say 15 15% chance to see Kingdom Hearts. What if You know, I'm just going to throw this out there just on a whim, just uh [ __ ] closing my eyes. Hail Mary Uncharted One remake. I like that. Just a random, you know? I like that. Just one of those like, oh [ __ ] I like it. Fully redone 3D models. If we get an Uncharted remake before we get an infamous remake, I'll bite you full teeth. We have an Uncharted movie franchise. We could have an infamous movie franchise. One of the predictions that I forgot to put in any of my predictions was that Randy Pitchford shows up. I'm going to say I'm going to pitch further. I think he shows up twice this weekend. Oh [ __ ] At least twice. Two different showcases. Not invited to either one. One time",
            "start": 873.2
        },
        {
            "text": "Randy Pitchford shows up. I'm going to say I'm going to pitch further. I think he shows up twice this weekend. Oh [ __ ] At least twice. Two different showcases. Not invited to either one. One time in the back of your car. How'd you get here? Magic sound shapes. Rez. Wait. Uh enhanced. Yeah, this is this is going to be enhanced. This is going to be something from them. Yeah, this is their composer. [Music] What was the last game they did with the dog? Humanity. Humanity. Thank you. The music already sounds like catches effects. Yeah. That shoe effect. I mean, it's like one of them gummies. Couple them gummies. We don't give the studio enough respect. No, we don't. 100% we don't. This sounds like Texas. Yeah. I mean, it looks like it, too. What's happening? [Applause] No. Don't Don't let me drink. [Music] Oh my god. I don't know how. Oh, that's why it started with the thing. That's awesome. What? Lumines is the greatest puzzle game of all time and I will not hear. Tetris is great. I",
            "start": 925.6
        },
        {
            "text": "me drink. [Music] Oh my god. I don't know how. Oh, that's why it started with the thing. That's awesome. What? Lumines is the greatest puzzle game of all time and I will not hear. Tetris is great. I love Tetris. I'm not trying to talk [ __ ] about Tetris, everybody. Oh my [ __ ] god. We're back, baby. This is so And just drop it today. Just [ __ ] drop it today, dude. We have nothing else to play today. Feel my [ __ ] heart. I don't do this on reaction. [Music] Oh my god. Thank you for coming back. Wow. That's sick. Fall. That rocks, dude. That's a great way to start off a show. And VR. [ __ ] I'm going to use the VR again. I said fall. Yeah. Thanks. Hello from PlayStation 5. I will be drawing. They're going to knock this out. This is like the best thing that could happen in Olympus. Mhm. Thank you and enjoy the rest of state. Thank you. Thank you. [ __ ] yeah, dude. That's cool. I was talking about the show on the right. Chris Anka the red shirt. Silly Chris Anka. You wake up, medium",
            "start": 991.04
        },
        {
            "text": "Thank you and enjoy the rest of state. Thank you. Thank you. [ __ ] yeah, dude. That's cool. I was talking about the show on the right. Chris Anka the red shirt. Silly Chris Anka. You wake up, medium molecules back. Wake up with a night boner. It isn't just a dream. It's a promise. One we're turning into reality with our third generation of Luna filament and advanced generative AI. We're reshaping the line between dreams and reality. We create life. Joanna Dark for our future. Deli Corporation. Wait. No. Let's see about getting passed through to Earth. And why are these things trying to kill us? There you are. All better. It's back. It's back, baby. It's back, baby. Holy. Come on. Uh, they [ __ ] took the sticky note. They ripped it up. Oh my god. I am DI03367. They are Hang on a second. Don't you have a name or something? I'm good. Get behind me. I think I can help. This is dope. Targets identified. Neutralizing threats. Neutralize us. Looks like we're going to have to fight our way",
            "start": 1100.92
        },
        {
            "text": "Don't you have a name or something? I'm good. Get behind me. I think I can help. This is dope. Targets identified. Neutralizing threats. Neutralize us. Looks like we're going to have to fight our way through here. What the? Bypassing first and second firewalls. Hooking control protocols. Initiating hack. I don't like this Megan doll. I mean, the game looked rad though. Looked like stellar blade. Hey, that see that's what I thought too. I I said I am D. Okay. Okay. Look, how about we call you Diana? Diana of the Wonder Woman. [Applause] Yeah, that feels targeted. Company that knows. They watched KG yesterday. They're like, \"Fuck you.\" That's awesome. That's a company that knows. That rules. Very cool looking. I mean, give me that on keyboard mouse, though. You know what I mean? Oh, hey. Today is Saturday, which means curry cha. Awesome. I love curry. Speaking of curry, apparently the current president is actually a human. What does that mean? It's okay. I'll get it. What's that cartoon",
            "start": 1197.6
        },
        {
            "text": "is Saturday, which means curry cha. Awesome. I love curry. Speaking of curry, apparently the current president is actually a human. What does that mean? It's okay. I'll get it. What's that cartoon Andy on HBO Max? Smiling friends. Yes. I got the same sort of rotoscope vibe, too. Stay with me. Oh my god. Listen up. You're going to die in about 15 seconds. Seriously. Seriously. Don't worry. I made this just in case. The dead gear life support system presents. You're already half dead. From now on, you're half dead, man. No way. That's pretty lame. I can't hear any of the dialogue. Another dead man. I was going to say this gives me like some 51 vibes for sure. This reminds me of let it die. Whoa. [Music] What the hell? See that returnal [ __ ] bullet hell [ __ ] It's like dead rising. Oh, cool. This looks kind of awesome. There's a really weird cartoon. Yeah. [ __ ] hyper real carto. Yeah. Yeah. A lot of cartoon stuff. [Music] Romeo is a dead man coming 2026. Maybe. Huh? That was",
            "start": 1282.72
        },
        {
            "text": "Oh, cool. This looks kind of awesome. There's a really weird cartoon. Yeah. [ __ ] hyper real carto. Yeah. Yeah. A lot of cartoon stuff. [Music] Romeo is a dead man coming 2026. Maybe. Huh? That was Grandpa's voice. Are you like a spirit? I'm on your back. What? There we go. That was cool. Showing the whole team. Yeah. It's the most fun. Yeah. Come on. This is a cool name, right? It is. action game. I did one of course main character there Juliet Starling Romeo is a dead man stuff going on there. Maybe it's all the same universe. I'm a dead man. That rocked. That was really cool. Silent Hill. [ __ ] Did you just say that? That Capcom font. See the FS in the [Music] chat. He's a dead one. I miss Mike. Take it too soon. I talked to him last night when we played Elden Ring. He was like, they're like, \"How's Mike doing?\" He's like, \"Jad, I miss you. I miss you, but I also miss Andy.\" The longest we've ever heard in your life. It I have to clip it out. You a lot of weird interpretive",
            "start": 1367.2
        },
        {
            "text": "they're like, \"How's Mike doing?\" He's like, \"Jad, I miss you. I miss you, but I also miss Andy.\" The longest we've ever heard in your life. It I have to clip it out. You a lot of weird interpretive dances in here just like Hell is played the demo yesterday. Greg, where's that? Pretty cool. Yeah, really into it. Damn. Stop moving. [Music] Just going to turn and look at the camera. I don't want to look. Oh, [ __ ] that. Armed with only a pipe. [Music] Cool weapon though. Yeah. I don't know if she knows how to use it though. Yeah. This is where turns devil make cry flying around. Ah no, she's going to turn backwards. She's got no uh her neck's [ __ ] up. You had to put some new poring. God damn. That's ugly. I was asked what I thought of Alan Wake too yesterday. And I said, \"It's a masterpiece, but too scary for me.\" And they said, \"You should play Silent Hill, Andy.\" I said, \"Why would I do that? That doesn't make any sense.\" Oh, September say we didn't know that date. Damn. You ready",
            "start": 1543.36
        },
        {
            "text": "but too scary for me.\" And they said, \"You should play Silent Hill, Andy.\" I said, \"Why would I do that? That doesn't make any sense.\" Oh, September say we didn't know that date. Damn. You ready to stream that through October? Uh Andy, uh vacation. Hot [ __ ] All I ever wanted. I was right there with you. Pre-order today around the 16th century. Kazan. The castle has been cited again. Dude, the church's orders are absolute. [ __ ] wolf. That is sacrifices must be stopped. We will track the ethereal castle. break its gates and exterminate the creatures that dwell within. The demon lord himself will fall by our hands. This mission will test the limits of your courage. You will face horrors beyond your darkest imaginings. Beasts that defy reason. Creatures born of pure darkness. Hear me out. I was going to say women so horrible you want to [ __ ] off. Just you'll call them mommy. They'll be all the internet weirdos will be weird about it. Stepping on people. The co-op or is that just",
            "start": 1661.76
        },
        {
            "text": "I was going to say women so horrible you want to [ __ ] off. Just you'll call them mommy. They'll be all the internet weirdos will be weird about it. Stepping on people. The co-op or is that just like a partner? Is it Castlevania or is it someone else? The music sounds very Castlevania. Well, time. Did we see other Capcom costume back in the game? So, I hope this is not Castle. This doesn't look up toite. We start our mission. All right. Names two ars looks like a blood stain sequel. That feels more correct. Yeah. To death. Yeah. No. A cool. I enjoyed part one. I didn't love it, but I I enjoyed it. Thought it was good. A solid 7 out of 10. 2026. So, you've come, George of the Church, right into the palm of my hand. The visuals of Shinjuku that I'm seeing are a hellscape I can't quite put into words. Hell yeah. But you've somehow been sent back in time 8 years, but the situation here is critical. What did Digimon? Okay, I'm counting on you, agent. [Music] Our ultimate mission is to",
            "start": 1739.24
        },
        {
            "text": "into words. Hell yeah. But you've somehow been sent back in time 8 years, but the situation here is critical. What did Digimon? Okay, I'm counting on you, agent. [Music] Our ultimate mission is to uncover the causality between these anomalies. It's probably a phase electron lifel. Who exactly are you working for? I remember you guys. Oh, or what is that? You really don't know anything about the digital world? We have been enemies for years now, but this is the first time the Titans have launched on Cartoon Network instead of whatever other channel was on. I probably would be really, it seems the upcoming battle is truly unavoidable. The world on this end is running out of time. I didn't I didn't have Dragon Ball cuz I didn't have Cartoon Network. So, I had Fox Kids, baby. I was going to say I think it was like on ABC Family or some [ __ ] was not the end of the digital world. Stop it. It's my favorite trailer type. This is my favorite type of trailer. Just a bunch of random lines from",
            "start": 1818.4
        },
        {
            "text": "I think it was like on ABC Family or some [ __ ] was not the end of the digital world. Stop it. It's my favorite trailer type. This is my favorite type of trailer. Just a bunch of random lines from the game talking over gameplay. The world tree has been attacked. It is just as great. You should really answer your mom's calls. We must protect the world from them. For this purpose and this purpose alone were you born. If that thing opens, then we'll be swarmed by Digimon. Attack. Everyone, lend me your strength. Everything's riding on you. To move forward into the future, we must fulfill our mission. Crimson Jedex. That's a Jedex. Shout out to Jedex, man. Oh, channel 3. What channel did that Kirby cartoon come on? Was that Jedex? It'll be right back at you. Yeah, Fox. Oh, was that just Fox? I'm pretty sure. Yeah. What was Fox's like? Didn't they have like a Saturday morning block for kids? That was something Fox. Wait a minute. Wait a minute. Wait a minute. Oh. Oh. Timothy. Timmy. What?",
            "start": 1874.96
        },
        {
            "text": "I'm pretty sure. Yeah. What was Fox's like? Didn't they have like a Saturday morning block for kids? That was something Fox. Wait a minute. Wait a minute. Wait a minute. Oh. Oh. Timothy. Timmy. What? We didn't fake this one. Holy [ __ ] Abandon not your children of evil. The Invidia League delivers. Deliver us from our wow. That we might know something. Was this the last one? Nine and tactics. God, that looks awesome. This looks so good yourself or the father. Why do you fight this path of subtifuge and conflict? The powerful must rule the weak. It is our duty. Heavens fall upon your crown. This vile Sher has gone on long enough. Sher. It ends now. I take it back. The video looks like when you have a ROM and you like put the higher graphics settings and it smooths everything out. Your father showed us how to make a whistle of a blade of grass. Yeah, we got be old and Final Fantasy Taxis. Come on. Hell yeah. Both versions. Oh, include proud. Thanks for tier one subscribing 35 months.",
            "start": 1924.56
        },
        {
            "text": "showed us how to make a whistle of a blade of grass. Yeah, we got be old and Final Fantasy Taxis. Come on. Hell yeah. Both versions. Oh, include proud. Thanks for tier one subscribing 35 months. We have Amazon Prime, you have Twitch Prime, Benson and I'm Sid Schum here to deliver news and release dates for games coming to PS5 later this year. We hope you enjoyed that first look at Final Fantasy Tactics: The Evil East Chronicles. The game will include two versions of the original PlayStation Classic. The enhanced version, which features improved graphics, fully voiced dialogue, refined gameplay, and much more. As well as the classic version, which brings a faithful recreation of the 1997 original to modern consoles. Final Fantasy Tactics: The Evil East Chronicles launches on PS5 and PS4 September 30th and will be available for pre-order later today. This next game is something really special. When I first played it, I laughed so hard I almost barfed. Let's check it out. Jesus. Then",
            "start": 1973.52
        },
        {
            "text": "September 30th and will be available for pre-order later today. This next game is something really special. When I first played it, I laughed so hard I almost barfed. Let's check it out. Jesus. Then went to a doctor. A Here we [ __ ] go. Baby steps. Baby steps. Yeah. Happy feet. Just go behind this bush. I'll wait. I can run away. Mike and I play this as GDC. Very very funny. No, you don't want me watching. I You can watch. In Baby Steps, all you have to do is carefully place one foot in front of the other, which is easier said than done. Main character Nate requires some pretty deliberate movement to make even the simplest progress. It's a captivating openw world experience filled with oddball characters. Here we go. Oh god. Oh no, you found it even without a map. The best toilet on the mountain. Oh, good. Definitely check this one out when it comes to PS5 on September 8th. Put everything in September. [Music] I knew it. I I saw as soon as popped, I'm like is a unique action",
            "start": 2037.84
        },
        {
            "text": "on the mountain. Oh, good. Definitely check this one out when it comes to PS5 on September 8th. Put everything in September. [Music] I knew it. I I saw as soon as popped, I'm like is a unique action adventure title from Bandai Namco Studios. Whoa. In this journey to save your origami home, you'll transform into paper shapes abilities until I want to save by a paper airplane, a nimble frog, the origami killer, and a powerful ape. I like this a lot. [Music] Masterami arrives on PS5 later this summer. Summer, huh? I was going to say call September summer Sean up. Thanks, Sean. The Hot Shot series has been the PlayStation from the very beginning, and its latest installment, Everybody's Golf Hot Shots, boasts its largest character roster ever. [Music] Compete in courses from 10 different regions around the world, each with weather effects and new nighttime variants. Pre-orders begin later today and those who do will get Bandai Namco's iconic Pac-Man unlockable. Can you figure out why",
            "start": 2093.12
        },
        {
            "text": "regions around the world, each with weather effects and new nighttime variants. Pre-orders begin later today and those who do will get Bandai Namco's iconic Pac-Man unlockable. Can you figure out why Bandai is publishing this? PlayStation's out of the golf business. Everybody's golf hot shot drives. All right, guys. There's other months September. There's other months in the years. Yes. Oh, nice. Ninja Guide in Ragebound is a challenging new entry in the longunning action franchise. From the makers of the Blasphemous series, Ragebound stars dual protagonists from rival clans forced to combine their souls and skills against a demon. And longtime fans will really love the pulse pounding soundtrack featuring guest composers from the original series. Oh [ __ ] I got to play two hours of this and it it's as good as it was. Ninja Guiden Ragebound arrives July 31st on PS5 and PS4. And a demo available now. No. Come on. Come on. Give it to me. From the game Bakers, Karen is a survival",
            "start": 2166.48
        },
        {
            "text": "this and it it's as good as it was. Ninja Guiden Ragebound arrives July 31st on PS5 and PS4. And a demo available now. No. Come on. Come on. Give it to me. From the game Bakers, Karen is a survival climbing experience where you must carefully plan your ascent up a deadly mountain. Manage balance and stamina to discover secrets. Hey, hey, wait for me. Encounter other climbers. I'm Marco. Nice to meet you. And survive the harsh conditions of the climb. I feel like we've been here forever. And I know you saw Didn't that get announced at around the same time? Or am I making that up? You can give it a try yourself with a demo that arrives. I don't think you're wrong. I think I've seen the name Karen for a long time. Demo available later today. Nice. That's all from us, but there's still a lot of State of Play to come. This next reveal comes from the game preservationist at Digital Eclipse. Nothing can prepare you for their next collection arriving later this year. God of War. We knew",
            "start": 2228.96
        },
        {
            "text": "lot of State of Play to come. This next reveal comes from the game preservationist at Digital Eclipse. Nothing can prepare you for their next collection arriving later this year. God of War. We knew pretty early on that the game was fun to play. I think people were excited about it. The most rewarding part of it is just seeing people react to it. Font you. We knew that we were on to something. Come on. It was such a shock to see this game. I was like, I can't believe this game exists. [Music] Never forget just showing kids that a local HB is Cyrax and my dad just being really proud of me. It became I didn't know you were like we're showing you a part of a world that is much larger. These collections are so good. Like they put so much documentary stuff in and just like the way they present anything is like amazing. That's awesome, dude. I had the Game Boy template to make the games better. It's a bit of the Wild West. Every part of that game. Are they going to spell who we were and",
            "start": 2290.64
        },
        {
            "text": "anything is like amazing. That's awesome, dude. I had the Game Boy template to make the games better. It's a bit of the Wild West. Every part of that game. Are they going to spell who we were and what we wanted to do? [Applause] Victory. Go. Oh, official fight pad. I like that. Cool. I like that a lot. [Music] It's going to look so It's so sexy. Yeah, we need that. God damn, that's sexy. Damn. Project. That makes a lot of sense. Here we have evidence of an enemy intruder coming. Oh my god. Knowledge. Sending reinforcements. Use extra caution. That guy. God, he's close. Capturing P5 Pro. We've lost sight of the enemy. Find him. We're under fire. Enemy position unknown. Reloading like this. It's a revolution. All right, commander. Good, baby. Take here comes another one. You look freaking time for you to taste some real pain. What's the matter? I'm over here. Go back to your old world. Fighting the end was one of those moments where I'm like, I don't know if I should be playing",
            "start": 2351.52
        },
        {
            "text": "time for you to taste some real pain. What's the matter? I'm over here. Go back to your old world. Fighting the end was one of those moments where I'm like, I don't know if I should be playing something devilish. Dude, that would be at the end of FPS 2. What the security gotcha gotcha its own military finally out Con you see hide in there, Andy. Whoa. Like multiplayer. No, I think that was just new camo. Yeah, how the camo's working. But it's the way the guy that the guy ran looked like a multiplayer character. Shining stones imbued with humankind's never ending. This is still middle gear. I mean everybody in chat is saying time immemorial. This power has been the impetus for human wars. Looks like y'all were wrong. Were you grabbing you? You know what? Drink another coinous atmosphere and one thick with the presence of Aatima. Oh, is this Neo3? Is it? It's Wool on Fallen Dynasty 2. Neo3: Wool on Spawn 2: Rise of Rome. He's back. What makes a shogun? Here is my answer. Literal. That",
            "start": 2453.92
        },
        {
            "text": "one thick with the presence of Aatima. Oh, is this Neo3? Is it? It's Wool on Fallen Dynasty 2. Neo3: Wool on Spawn 2: Rise of Rome. He's back. What makes a shogun? Here is my answer. Literal. That looks like the same boat from Rise of the Run. I mean, they just be putting out games. Yeah, this is like their fifth game this generation. I mean, shout out to them, though. Cuz the combat always rocks. Oh, yeah. You know, how foolish of you to have entered the depths of hell. Nice. Very cool. That's pretty big. Yeah. You said it would never happen. You're right. Who might you be? Warrior. Tokugawa. Takio. Google that. I was going to say somebody's popping at home for that, right? Yeah. Stage open. [Music] Oh, member of the Takugawa Shogunut. Okay. No one knows how old the city really is. For me, it's all I've ever known. My whole world. 10 minutes left. I was raised in this city shadow, free to take whatever I need to survive. Yep. You say the top left. It didn't when I set to the right.",
            "start": 2552.28
        },
        {
            "text": "me, it's all I've ever known. My whole world. 10 minutes left. I was raised in this city shadow, free to take whatever I need to survive. Yep. You say the top left. It didn't when I set to the right. It did. The city hides many lost and legendary treasures. Oh, there's a thief. Give us Yeah. locked away, waiting to be found. Damn. Welcome back. Waiting to be taken. Exactly how everyone wanted it. Yeah, exactly. But some treasures. Dude, if they announced a DSX like this, I'd be pissed for more trouble than others. There some real monkey paw stuff going on. Yeah. [ __ ] Now that's that out loud is going to happen. I thought I was dead. And who are you? I mean that happened with me with Arkham Shadow Bless. And you know what? Great game. I mean a day XVR game as pissed as I would be would be a good game. Are you there yet? [Music] Cleo hasn't follow but she's keeping it safe in her tower. Hey, you you got some hosen? Marketland seems a bit tense today. I heard something happened with",
            "start": 2687.84
        },
        {
            "text": "be a good game. Are you there yet? [Music] Cleo hasn't follow but she's keeping it safe in her tower. Hey, you you got some hosen? Marketland seems a bit tense today. I heard something happened with another tide walker. Damn it, it's gone. Someone beat us to it. The guy stranded. Ever since the great flood, Elland, my dear planet, has been dying. Everything from us. Keep your politics out of my kids. Yep. But you tide walkers are all connected. I say as the water and it's up to you now to use that power. Oh, neat. [Music] [Applause] Yo, this is cool. It's like when you see a blood stain in Dark Souls and the person jumps off a cliff. This is actually [ __ ] dope. Like it's like Detroit become human, but you see their choices in real real time. Will you help us? [Music] Fascinating. This is [ __ ] awesome. I is always a big damn. Will we get the annihilation? See, do it. Give it to me. What month was that? February of Astrobot. It's a pleasure to be back today to share more news with",
            "start": 2765.36
        },
        {
            "text": "is [ __ ] awesome. I is always a big damn. Will we get the annihilation? See, do it. Give it to me. What month was that? February of Astrobot. It's a pleasure to be back today to share more news with you. What a last few months it has been in the world of Astro. Astrobot launched last September to such encouraging feedback. Even receiving a few others we are truly grateful for. I love this guy. In October, we added five speedrun levels, followed by a Christmas special packed with festive surprises. And then earlier this year, the vicious void galaxy made its appearance, adding yet more new challenging levels, all of which came at no additional cost. And today, I am pleased to announce that later this month, you will be able to enjoy five brand new challenge levels in Astrobot, bringing the total to a whopping 90 planets. and new special boats will be there too, including Atsu from Ghost of Yote alongside other fans favorites, but these ones are a surprise. And finally, the Astrobot",
            "start": 2847.76
        },
        {
            "text": "the total to a whopping 90 planets. and new special boats will be there too, including Atsu from Ghost of Yote alongside other fans favorites, but these ones are a surprise. And finally, the Astrobot Dual Sense wireless controller will return later this year with a slight twist. So, be on the lookout for more news on it from all of us at teamobi. Thank you all for the amazing reception you gave our game and enjoy the rest of the show. Cool. Yes. Neither do I get points for that since it didn't happen at SGF, but I called it. It's SGF. Is that how it works? Oh man, you're mean. [Music] Say that looked like some arcane VFX. He told me to get a ship. [Music] character look escape from Monkey Island, but I think that's just the pirate guys. [Music] Video games are magic, dude. I might have been too har. Oh my god. What the [ __ ] What the hell was [Music] that? I'm [Music] shiny. Damn. They want their own [Music] CF. What is going on? Yeah, that combat team kind of look like turnbased",
            "start": 2906.2
        },
        {
            "text": "been too har. Oh my god. What the [ __ ] What the hell was [Music] that? I'm [Music] shiny. Damn. They want their own [Music] CF. What is going on? Yeah, that combat team kind of look like turnbased setup. It look like CL's here. Ben Star's got it. [Music] Rogue light. They're restarting. There's a little bit of everything, you know. Got a hell of a jam to them. Yeah. Why are they mannequins, too? Why are they little doll art? Sea of Remnants. Is it of or is it just Sea Remnants? I see Remnants. Yeah, maybe that was just a sword. I definitely wrote down Sea of Remnants. Oh, there's a skateboarding game. Oh, yeah. sand skating thing in it. [Music] So, what's your pitch for the next game? You're going to feel. We'll just make awesome. You're in. Make you [ __ ] feel. [Music] When you got swimming animals in place they don't belong is my favorite. at one level entirely. Chad, is this the pathless steps? It is. Okay. Yeah. Then I'm excited for this. I was surprised he didn't get a pop",
            "start": 2986.72
        },
        {
            "text": "swimming animals in place they don't belong is my favorite. at one level entirely. Chad, is this the pathless steps? It is. Okay. Yeah. Then I'm excited for this. I was surprised he didn't get a pop when he showed it. Yeah. I think I was looking at Journey. I was like, \"Okay, cool. I like Journey. I love the Ples. I remember they also did [Music] Abby. Heat. Heat. [Music] [Music] [Music] Welcome to the world of sword of the sea. August 19. That looked really, really pretty. Hi everyone, I'm Kristen Zatani. That was a new look at Sword of the Sea, a visually striking adventure from the team behind Abzu and the Pathless. We're excited to announce that Sword of the Sea will launch this summer into the PlayStation Plus game catalog. On June 17th, Remedy brings otherworldly action to Game Catalog with FBC Fire Break. In this cooperative FPS set in the paranatural world of control, you and two fellow agents must confront and contain the reality warping chaos found within the oldest house.",
            "start": 3094.08
        },
        {
            "text": "with FBC Fire Break. In this cooperative FPS set in the paranatural world of control, you and two fellow agents must confront and contain the reality warping chaos found within the oldest house. Fun in short bursts or deep dives, FBC Fire Break launches day one in the game catalog on June 17th. Right around the corner, Andy, I love a multiplayer shooter. I'm mainly pumped just to see PlayStation Plus Classics catalog welcomes several new titles this summer. The PS2 version of legendary immersive sim Deuse X arrives June 17th. In July, Twisted Metal 3 and Twisted Metal 4 join the service just in time for the second season premiere of Twisted Metal, which arrives July 31st in select countries, including Peacock in the US. Yeah, a good show. Additionally, two of Capcom's most beloved games from the original PlayStation are set to join the classics lineup. Resident Evil 2 and Resident Evil 3 will arrive later this summer in the classics catalog. Yeah, that's tea up right there.",
            "start": 3176.8
        },
        {
            "text": "games from the original PlayStation are set to join the classics lineup. Resident Evil 2 and Resident Evil 3 will arrive later this summer in the classics catalog. Yeah, that's tea up right there. Additionally, Mist and Riven will arrive later this month as part of the Days of Play celebration running now through June 11th. Days of Play is a twoe event that includes bonus PlayStation Plus content drops, great deals on software and hardware, and more. Visit PlayStation blog and playstation.com for full details. His parents cut their own rope to save him. He watched them fall, then found his way off that mountain. He was 11 years old. Oh, Bond. He then started a grand tour of every major boarding school in Britain. Always at the top of his class. We would have never predicted that. That's from Walking Dead in the Navy. His superiors all praise his instincts and they're all in need of early star. Nobody knows what to do with him. That's a very good point. This is going to star a",
            "start": 3230.48
        },
        {
            "text": "That's from Walking Dead in the Navy. His superiors all praise his instincts and they're all in need of early star. Nobody knows what to do with him. That's a very good point. This is going to star a celebrity. He feels the same way. But what he did in Iceland, what he did in Iceland was insubordination. It was illisiplined, utterly reckless. He only survived thanks to blind luck. Give me one good reason to put him in the program. Sounds like Tom Cruz. I think you've just covered them all. Greenway, it's really quite simple. Bond is a bullet without a target. Let's give him one. No. No. Never mind. Don't know who this is. Wait, it looks like somebody. Do you have an appointment? The name's Bond. James Bond. He's with me. And you are? Don't think we've had the pleasure. Now, let's not get ahead of ourselves. James, I was so close. Oh, you shouldn't have. We're facing a situation. I feel like I was close to most delicacy. I need all my pieces on the little manipulator. Whatever the",
            "start": 3281.12
        },
        {
            "text": "get ahead of ourselves. James, I was so close. Oh, you shouldn't have. We're facing a situation. I feel like I was close to most delicacy. I need all my pieces on the little manipulator. Whatever the endame is, we won't see it coming. Jet lag gets me every time. She's not your friend, Bob. She's an [ __ ] Call the club with respect, Mom. to hell with that. Chad, who's the actor that plays young Dexter? [Applause] [Music] Tell me, what do you do, James? Lately, Patrick Gibson had time to go. [Music] [Music] Close enough. Welcome back, Uncharted, everybody. Oh, yeah. I suppose this is another teachable moment. Very cool looking number is such a cool tagline. Oh, good. We can get this. It's just a It's not a real golden gun. It's just colored gold. Hello, I'm Hacken Abra, CEO of Iron Tractive. The team is thrilled to announce 007 first flight. You'll experience James Bond as a young air crewman in the Royal Navy before the tuxedo and the martinis as he first steps into the world of",
            "start": 3334.08
        },
        {
            "text": "The team is thrilled to announce 007 first flight. You'll experience James Bond as a young air crewman in the Royal Navy before the tuxedo and the martinis as he first steps into the world of espionage striving to earn his double status. Everyone at Iraactive has poured the passion and dedication into crafting experience that honors the legacy of Bond, harnessing our 25 years of agent expertise. This is just the beginning of our journey with 007 and we can't wait to share more with you soon. I'm not as excited about that as I thought I was going to be. I didn't think it looked awesome. Like the gameplay is fun and like that but it's like I look at like the shots and I'm like, \"Oh, it doesn't look like a triple crazy.\" But I also just don't care about James Bond a lot. Nice. Nice. That's true, too. I can't believe it's Erica. That's still just wild. This looks amazing. You're still with me, Logan. [Laughter] That would be funny. I stole it from the chat. Somebody's like, \"It's a freak.",
            "start": 3451.72
        },
        {
            "text": "too. I can't believe it's Erica. That's still just wild. This looks amazing. You're still with me, Logan. [Laughter] That would be funny. I stole it from the chat. Somebody's like, \"It's a freak. It's a Yote fake out. It's actually Wolverine.\" I don't know why I thought Gabe when he said that'd be awesome. I want to be Gabe. Be the wolf. [Music] Sweet. I want those freaking knives on the ropes. I want those weapons. What the [ __ ] What the [ __ ] What the [ __ ] What the [ __ ] What the [ __ ] Let's [ __ ] go. But why is it Japanese? What? Nigel. Oh, they cooked. They cooked. What the [ __ ] Let's [ __ ] go. Yes. Oh, come on. Holy [ __ ] This looks [ __ ] awesome. What a fun take. That's awesome. Oh. Oh my god. You guys are never going to see me again. You head backwards. You're never going to see me [Music] again. Ghost Rider. Going from like scene to scene. One is very guilty. Your stribe also very injustice. Dude, I I can't believe it's not count. I mean, after Infinite like",
            "start": 3505.68
        },
        {
            "text": "going to see me [Music] again. Ghost Rider. Going from like scene to scene. One is very guilty. Your stribe also very injustice. Dude, I I can't believe it's not count. I mean, after Infinite like although honestly was this other opposite. Yeah. And honestly, Arc System Works doing this. Arc System Works is the This is the best thing that's ever happened. Both like everything involved. This is the best thing for Arc System Works is the best thing for Marvel fighting games. Yo, is this a rest in peace 2x KO or what? Yeah, dude. This is sick as [ __ ] Like people studios are like, \"Fuck, god damn it.\" [Music] 44 is also crazy. Oh, took Fighting Souls. Marvel took Fighting Souls. Yeah, that's tough for a 2X scale cuz I also expect that game to come in 2026 and it's just like that no one's going to be able to remember the name. Uh, they're changing the date. Deadpool. Deadpool. Deadpool. That's a good trailer. Wolverine. Oh, we're going into Arxis worker. Oh, okay. What the [ __ ] is",
            "start": 3637.52
        },
        {
            "text": "going to be able to remember the name. Uh, they're changing the date. Deadpool. Deadpool. Deadpool. That's a good trailer. Wolverine. Oh, we're going into Arxis worker. Oh, okay. What the [ __ ] is about to happen? Interesting. It's a PlayStation Studios game. PlayStation published. PlayStation loves fighting games right now. I love it. That's why they got the fighting stick. They bought EVO. So, I don't know if you've heard of Project Defiance. [Music] I mean, I feel do so well with Dragon Ball fighters. It makes sense that more IPs look at them and go, \"Oh, we should give him our damn what a come up. [Music] Dude, what a fun, unique style. Like, that's so great. In a in a chat, Hi Qual says, \"Uh, lame short documentary.\" Just go read the PlayStation blog. You don't deserve to enjoy anything. Just go away. The inspiration for working on this project really came from a place of pure fandom and wanting to say, \"Why isn't PlayStation in this space?\" So, PlayStation approached us with",
            "start": 3726.0
        },
        {
            "text": "Just go away. The inspiration for working on this project really came from a place of pure fandom and wanting to say, \"Why isn't PlayStation in this space?\" So, PlayStation approached us with this vision to bring Marvel back to the forefront of the tag fighting genre. [ __ ] yeah. And that got us really excited because we had worked with them before on successful stuff like the Marvel Spider-Man franchise with Insomniac. When it came to approaching Marvel, you have to kind of first float the idea and let them know, hey, you know, we're thinking about approaching a company like Arc System Works to make a fighting game. We'd love to partner with you to do this really great collaboration. Would you be interested? When they named the developer, that really perked up our ears. It's always refreshing to work with a team that will take on the challenge of tackling Marvel, putting their own spin on it, and they're just uppercutting that challenge into the stratosphere. And that's what you get",
            "start": 3807.68
        },
        {
            "text": "to work with a team that will take on the challenge of tackling Marvel, putting their own spin on it, and they're just uppercutting that challenge into the stratosphere. And that's what you get with this team. I mean, they couldn't make something boring if they tried. Dude, this changes like now that I think about emo like after this is going to be the tricky thing is that most combining including myself sacred communities between our system work and then the partner that's crazy enough to take on the task because you either do something like this big and bold and the community you know like that that's so massive. I have a good grasp on their art style and how they would approach certain IPs. You come in with your kind of own expectations of here's what I would expect to see from Arc System Works when they take on a Marvel IP. And what came up was something that went beyond that. Damn, I know Capcom's pissed. Capcom finally sound finally saw the ex like get married on they're like",
            "start": 3850.56
        },
        {
            "text": "Works when they take on a Marvel IP. And what came up was something that went beyond that. Damn, I know Capcom's pissed. Capcom finally sound finally saw the ex like get married on they're like damn it really is over after they released all the remasters games all the collections. I remember personally the first time I saw Iron Man was really when I felt we had something special. [Music] Iron Man is supposed to be the sleek fighter jet. Think luxury race car mixed with a brick house. And the fact that they added anime mech elements to him just felt really naturally at home. One of the mantras that we have for this project is from Japan to the world and really trying to take not just the IP but gameplay mechanics and say what can we really take from Japan, the creators that are doing awesome work here and bring that to the global platform. Also, this is a great answer to a great collaboration also when Arc looks at these Marvel characters. DLC. It's also the gameplay mechanics rivals",
            "start": 3901.12
        },
        {
            "text": "work here and bring that to the global platform. Also, this is a great answer to a great collaboration also when Arc looks at these Marvel characters. DLC. It's also the gameplay mechanics rivals thing. Yeah. Like this is going to have such a life that's different. Like this is a game that lasts the entire generation. You've seen tag fighters that have 2v2, 3v3. We felt like we just had to go 4v4. And in doing so, we found a lot of unique fun ways to choice. And I think four shows that I think players are going to be very Yeah. No, we're going to get so many characters. Learning four characters is extremely daunting, but the team at Arc System Works has found a way to design a system that adapts to your play style. So you could either duke it out as just the leader and three assists or you can tag in your assist to swap the leader and change the match up. I don't think a lot of people thought this day would would be here would come. You know, this has just been an awesome journey and",
            "start": 3979.36
        },
        {
            "text": "can tag in your assist to swap the leader and change the match up. I don't think a lot of people thought this day would would be here would come. You know, this has just been an awesome journey and I'm excited that we get to be able to share it with all the fans out there. I'll tell you right now, a lot of fighting games, they never get to experience this level of production and it's just a dream to even be working with these two great partners. The three companies have come together to do this and uh I think we really are going to make something magical here. So yeah. [Music] Oh yeah. I love that the music. It sounds like a video game. It sounds like a classic fighting game. You're still with me? Take [Music] rest. Seems the upcoming battle is truly unavoidable. Also went over. They promised us 40 minutes. Here we are. 54 minutes in. Good job. Pragmata feels like 3 years ago. Yeah, you're right. That was in this. That's crazy. Marvel Tokon Fighting Souls. Oh, wait. That means God of",
            "start": 4037.28
        },
        {
            "text": "us 40 minutes. Here we are. 54 minutes in. Good job. Pragmata feels like 3 years ago. Yeah, you're right. That was in this. That's crazy. Marvel Tokon Fighting Souls. Oh, wait. That means God of War. Oh, I got my I'm getting my SGF prediction. Let's go. That is very exciting stuff. Uh well everybody, that was our live reaction to the state of play. We're about to do our games cast breaking down everything we thought about that uh after a quick word from our sponsors. This episode's brought to you by XRE. Y'all know that a few months ago, my life changed forever when I brought a pair of XR1 AR glasses on a long flight to New York. I legit could not believe how easy it is to use and high quality my experience was playing games, watching movies, TV shows on the plane without just too much extra stuff around me or especially not a giant goofy headset around my head. No joke, this is my favorite new tech product in years and it has earned a permanent spot in my travel bag. It is only hard",
            "start": 4129.12
        },
        {
            "text": "stuff around me or especially not a giant goofy headset around my head. No joke, this is my favorite new tech product in years and it has earned a permanent spot in my travel bag. It is only hard to believe that it works as well as I'm saying until you try XR1 AR glasses for yourself and then you will see that the future is now. The tech is here. Connect XRE1 glasses to wherever you are playing. Whether it's a handheld console, a PC, phone, home console. You just get a massive 150in virtual screen anywhere, anytime for any game. Gaming on the go like a long haul flight? You need the XR1. Next, starting to hurt from staring down at your handheld? We've all been there. You need an XR1. A screen as big as your wall. Instant plugandplay with all of your devices via USBC. Built-in audio with sound by Bose anchoring your screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full HD. These are what make XR1 a musthave. And we hear XR1 Pro is coming soon with an even",
            "start": 4204.4
        },
        {
            "text": "sound by Bose anchoring your screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full HD. These are what make XR1 a musthave. And we hear XR1 Pro is coming soon with an even bigger virtual screen. Hit our link below to get your XR glasses today. There's nothing better than when a sponsor of Kind of funny is something that we are legitimately obsessed with, and that is exactly the case here with XR. You're going to hear me talking about these forever. Go to xreal.com for [Music] more. What's up and welcome back to the kind of funny games cast live for June 4th, 2025. Of course, I am your host Tim Gettys. I'm joined today by blessing out Jr. Good day Tim. Greg Miller. Hello Timothy. And Andy Cortez when he comes back from taking a little peep. He had to go pee pee. He did. He did. We did just react to the PlayStation State of Play for June 2025. And we're about to break down everything that we just thought about it cuz this is the kind of funny Games cast where",
            "start": 4252.48
        },
        {
            "text": "He did. He did. We did just react to the PlayStation State of Play for June 2025. And we're about to break down everything that we just thought about it cuz this is the kind of funny Games cast where each and every weekday we get together to talk about the latest reviews, previews, and topics in video games live on YouTube, Twitch, and podcast services around the globe. If you love what we do, please support us with the kind of funny membership on Patreon, YouTube, Spotify, or Apple Podcast to get all of our shows ad free and a daily exclusive show. Right now is a great time to get the Kind of funny membership if you've ever been considering it because we're doing so much content surrounding Summer GameFest and the Nintendo Switch to launch. For a chance to be part of this show though, submit your thoughts and opinions as YouTube Super Chats. What did you think of the state of play? What are you most excited for that was announced? Super chat in and let us know. Little housekeeping",
            "start": 4311.44
        },
        {
            "text": "submit your thoughts and opinions as YouTube Super Chats. What did you think of the state of play? What are you most excited for that was announced? Super chat in and let us know. Little housekeeping for you. We're throwing a Switch 2 launch party tonight at 7:45 p.m. Pacific. We're going live on twitch.tv/kindfunn. TV/kindfunname. Uh, and Greg and I are going to be heading down to the Nintendo store in San Francisco. Uh, we'll be live from the store. Roger and a menagerie of uh, kind of funny um, homies are going to be hanging out, playing Switch 2, talking about Switch 2, just having a great time. And guess what? We're going all night long. Uh, we're going to be streaming until 10:00 a.m. tomorrow when we're going to continue streaming uh, with kind of funny games daily. So, real talk, we're just going to be streaming for ever less forever while you go play. season. I'll be back. Remember, we are an 11 person business all about live talk shows. Games Daily was us unboxing the Switch",
            "start": 4350.4
        },
        {
            "text": "just going to be streaming for ever less forever while you go play. season. I'll be back. Remember, we are an 11 person business all about live talk shows. Games Daily was us unboxing the Switch 2 for the very first time. Then we had an in review episode for John Wix the Ballerina. Definitely check that out when you get a chance. Everyone's question is the movie good? You have to watch the interview to find out right now. It's really good. It's really good. The kind of funny member today's Greg Way is Greg Gabin about how great it is to be a gamer today and his ear hair. You got ear hair? Not anymore. Oh, you understand if you watch the show. That's right, everybody. Stopped at Walgreens, bought a razor, shaved my ear. Good for you. Thank you to our paid show producers, Carl Jacobs, Omega Buster, and Delaney Twining. Today, we are brought to you by XRE, but we'll tell you all about that later. For now, let's start with the topic of the show. At this time, you got to stop and ask,",
            "start": 4392.64
        },
        {
            "text": "Buster, and Delaney Twining. Today, we are brought to you by XRE, but we'll tell you all about that later. For now, let's start with the topic of the show. At this time, you got to stop and ask, maybe it was a poop. You know, maybe Andy wasn't pee. She said pee pe, but then he's been gone a long time. You look like you had something to say, but then you stopped. Why? Why are you afraid to say something? I didn't say anything. I was going to say anything. I don't know why. June 2025. State of play is the topic of the show. We just watched it. They said 40 minutes. It was more than 40 minutes. Those filthy little liars. I love it. Um, under promise, overd deliver. The kind of funny motto. I I want to start with Bless. What did you think of this? Um, I thought it was a solid good. I think some high highs and then I think a lot of like all right cool this is a showcase kind of moments right of all right I'm seeing new games they're not necessarily all exciting me we're getting updates for",
            "start": 4437.2
        },
        {
            "text": "high highs and then I think a lot of like all right cool this is a showcase kind of moments right of all right I'm seeing new games they're not necessarily all exciting me we're getting updates for things that I know a lot of people are looking forward to right but this wasn't like a oh damn they hit us with this [ __ ] game this this franchise been waiting for a damn this trailer is blowing me away but I think in a showcase where we got the announcement of a new Luminous game and it looks really awesome and this is from a post the [ __ ] out of me this from a post tet effect enhance studios. That's really exciting. Uh from getting that Ninja Guide and Ragebound game, of course, that's a game that we've seen before plenty of times and this is us getting the release date of July 31st, but that trailer was [ __ ] awesome. Uh Mortal Kombat Legacy Collection, kind of a targeted announcement there, but like for me as somebody who loves Mortal Kombat, I look at that and I go, let's [ __ ]",
            "start": 4481.36
        },
        {
            "text": "that trailer was [ __ ] awesome. Uh Mortal Kombat Legacy Collection, kind of a targeted announcement there, but like for me as somebody who loves Mortal Kombat, I look at that and I go, let's [ __ ] go, right? And then we have a lot of space for things like uh you know, Thief VR. All right, cool. I guess you know, everybody's golf. All right, cool. Like, and I like everybody's golf, right? But I think some of the things they showed definitely felt like they brought the energy down a little bit. Even stuff that we're excited for. Like I forget which game it was, but there's a game that I'm looking forward to where the the trailer they showed I was kind of like, \"All right, cool.\" I I think 007 might have been the one where excited to see it. But there's something about that trailer that didn't blow me away necessarily and we'll get we'll get around to it. But I mean, closing this thing off with a 4v4 Marvel fighting game developed by Arc System Works. I know that's not an announcement",
            "start": 4519.52
        },
        {
            "text": "blow me away necessarily and we'll get we'll get around to it. But I mean, closing this thing off with a 4v4 Marvel fighting game developed by Arc System Works. I know that's not an announcement that's going to speak to the widest audience of gamers watching a state of play, but that is still an earthshattering announcement for a large community of players, right? When you think about how popular and how how popular Marvel is, right? Let alone Marvel versus Capcom, and then also like how many people love Arc System Works, how many people have been waiting for the next, you know, followup to their last game, right? Guilty Gear Strive. This is one where I'm so happy that they chose to close the show with this because this is one of those one one of those games that deserves to close the show. This is super exciting. This is going to I mentioned this during the re live reaction. This is going to be a game that lasts for a generation, right? It's going to be at EVO every single year. It's",
            "start": 4553.52
        },
        {
            "text": "This is super exciting. This is going to I mentioned this during the re live reaction. This is going to be a game that lasts for a generation, right? It's going to be at EVO every single year. It's going to get updates hopefully with new characters and unlocks and like you're going to get the ultimate edition in probably five years. It's going to be off the chain. Uh that's going to be the version everybody's finally happy with. But I'm [ __ ] excited for this. This is such a cool announcement. And yeah, overall, like, are we doing scores? Hell yeah, we are. I'll I'll give it a 7.5 overall. Oh, okay. Uh, I'm going to go next cuz then I need to take a little trip to the PP room. Um, but it's okay if if you if you had to go poo poo. You could tell us. You would have to lie about it and be embarrassed, you know, not have to say it. Oh, you think I was shouldn't? No, man. Sometimes I pe sometime I just look at my phone for too long. I'm like, I got a show to be on. I I am uh I'm slightly",
            "start": 4594.88
        },
        {
            "text": "you know, not have to say it. Oh, you think I was shouldn't? No, man. Sometimes I pe sometime I just look at my phone for too long. I'm like, I got a show to be on. I I am uh I'm slightly higher than blesses on this. I would say that this is like this is a great uh PlayStation state of play. They kind of delivered everything I'd kind of look for. New announcements, answering questions, getting release dates, genuine surprises for things that I'm interested in. That Marvel game looks awesome and uh definitely very out of left field, but that sounds like a kind of dream announcement of like Arc System Works making a Marvel fighting game. Hell yeah. Uh you love to see that type of stuff. And uh on top of that, I I love when I enjoy a showcase that isn't the things that I expect to be there. God of War wasn't there. Resident Evil wasn't there. I'm pretty damn surprised by that, but this was still very good for those things not being there. Um going through I think that the the lowest",
            "start": 4635.36
        },
        {
            "text": "God of War wasn't there. Resident Evil wasn't there. I'm pretty damn surprised by that, but this was still very good for those things not being there. Um going through I think that the the lowest point for me was probably Metal Gear Solid where it's just like what did we get new there? Not really much. Um but not mad it's there. Didn't take up too much time. And uh yeah, getting more Astrobot like uh the Tides of Tomorrow looked very interesting. Um a lot of cool stuff. I I feel like overall there was a lot of um new game announcements which is fun to see. Um yeah, overall that was a a genuine surprise for me. Got that Middle Gear Online tease. What did you The Metal Gear Online tease which I got many questions about. Oh, I guess that's true. Yeah. So they did have that. I've been trying to find anybody talking about that in terms of an official statement. I'm still searching for you. Yeah, but I mean that does nothing for me personally, but it was something new. Um, and yeah, Final",
            "start": 4680.56
        },
        {
            "text": "to find anybody talking about that in terms of an official statement. I'm still searching for you. Yeah, but I mean that does nothing for me personally, but it was something new. Um, and yeah, Final Fantasy Tactics, it's real. That's crazy. It doesn't look that good, but it's real. Uh, Greg, what do you think? Uh, I think that I'm right there with you, Tim. I think it's an eight, and I assume you're giving it an eight flat for great. Okay. Yeah, I heard you say great. He's talking to him as he leaves the room. And anyways, I get it, but I It turns out I have like a 90 foot cord. I'm just weaving through the audience outside the restroom. Kevin set up cameras all along the way. Yeah, I for me and shout out to Vum Dex with the raid. Thank you so much. Uh yeah, for me this was a great one. I think I'm right there to what Tim was talking about even what you're talking about where I feel like I think we started off really strong and then I felt like we kind of just settled in for a while",
            "start": 4721.36
        },
        {
            "text": "I think I'm right there to what Tim was talking about even what you're talking about where I feel like I think we started off really strong and then I felt like we kind of just settled in for a while and maybe settled too long and then by the end when we got out there there I'm right there with Tim of like all right cool here's some Metal Gear but okay whatever. Even the Astrobot stuff was like Astrobot. Okay, it's later this month and it's like it's good news. I'm happy with that. Uh but then if to have it be like, okay, here's uh we're dropping in on First Light, which again I don't think looks great. There's something about that that I really want to like on paper. I'm not a big uh 007 fan by any stretch imagination, but I love a good action game. I love a third p a good third person action game, but looking at that, I'm like that just doesn't look great yet. And there's a lot of time and a million other things and we're not playing it yada yada yada. And then, you know, you go",
            "start": 4761.12
        },
        {
            "text": "action game, but looking at that, I'm like that just doesn't look great yet. And there's a lot of time and a million other things and we're not playing it yada yada yada. And then, you know, you go into ghost, you're like, \"Here comes some ghosts.\" Oh, okay. This is just an ad for the next State of Play in July. I'm fine with that as well. But to be caught off guard with the Marvel reveal. I'm not even a fighting game guy. And I thought that art style is stunning. I think the fact that it's PlayStation Studios publish is very interesting. And then to have that little mini dock on it, I I think, you know, again, I I was I think I went in my head when I was talking earlier, I was dipping into 75, but I think when they came up here at the end to end strong, they ended strong and I appreciate that. Andy Cortez, I'm right with Blessing. I'd give this a 75. Really, really good time. Some pretty awesome surprises that we didn't really expect to see. And again, thinking back to the February",
            "start": 4800.16
        },
        {
            "text": "that. Andy Cortez, I'm right with Blessing. I'd give this a 75. Really, really good time. Some pretty awesome surprises that we didn't really expect to see. And again, thinking back to the February state of play where I think that's the best state of play I've experienced probably in a long ass time where that was just kind of like whoa really big announcements and you start to wonder how are you differentiating showcases and state of plays now because these are like some really big um sort of things you're dropping here. I would say that this one, yeah, kind of had that little lull down in the middle and we're getting some things that we did expect to see, but Suda 51's game looks fantastic. This this origami game looks really cute and great and I love those tiny little games that are the unknowns that we just had no idea existed prior to the show. So, seeing all these neat little video games got me excited. I love video games. I think like we saw a lot of that. Yeah, I really enjoy",
            "start": 4834.0
        },
        {
            "text": "unknowns that we just had no idea existed prior to the show. So, seeing all these neat little video games got me excited. I love video games. I think like we saw a lot of that. Yeah, I really enjoy them. Um, I I don't disagree with you with First Light looking kind of maybe not what we expected or underwhelming a little bit. And I think a lot of that maybe has to do with the whatever engine that they're using. It still looks like it looks like Bond in an in a Hitman video game and and it's like it's their engine. That's kind of how their characters look. And I I'm still really really pumped because I feel like we have been missing the we are trying to fill the void of the Uncharted game for a long time. I am missing the game with the quippy cool antagonist. Whether you think he's cool or not, that's, you know, subjective. I I'm just excited to see a dude who is kind of like finding his own way. Uh, I'm I'm pretty pumped for this video game because I miss this genre of and it's not",
            "start": 4878.0
        },
        {
            "text": "or not, that's, you know, subjective. I I'm just excited to see a dude who is kind of like finding his own way. Uh, I'm I'm pretty pumped for this video game because I miss this genre of and it's not even necessarily a genre cuz there's a lot of thirdp person action games. No, but you're right. There is where you watch this and this is where I think so many, you know, we call that Uncharted right away, right? But there was that time where and they're one some of my favorite games in a genre where you're playing a game that looks like a movie. You're third person behind the back, explosions, over-the-top action, blah blah blah. You're getting a lot of cut scenes. Yeah. A blockbuster. We know the amount of interactivity that IO can put into their games and just the amount of things that can be manipulated and worked around. This isn't going to be I think what excites me is that we are getting an Uncharted game with the with IO's level of interactivity. See, that's the thing that I think",
            "start": 4927.6
        },
        {
            "text": "be manipulated and worked around. This isn't going to be I think what excites me is that we are getting an Uncharted game with the with IO's level of interactivity. See, that's the thing that I think worries me is I don't know if we're going to get like that level of interactivity. Like I when I watch the trailer, I I see the set pieces in the gameplay, right? And I think that's something that I wasn't thinking about when it came to IO making a game. Like Hitman doesn't really have set pieces like that. Like you are the set piece. You are creating these scenarios. You have the freedom to like put on a [ __ ] I don't know a chicken outfit and murder a person by like [ __ ] luring them behind the bushes and snapping their neck, right? But like you are creating those moments so much and every gameplay moment we're seeing in this trailer looks like they're creating that gameplay moment for you, which is what you get out of an Uncharted. That's what you get out of these blockbusters that",
            "start": 4968.88
        },
        {
            "text": "gameplay moment we're seeing in this trailer looks like they're creating that gameplay moment for you, which is what you get out of an Uncharted. That's what you get out of these blockbusters that we're talking about. But I think maybe that's the thing that I'm identifying where I'm seeing this and I'm like, \"Oh yeah, IO doesn't make games like this.\" And I think maybe that's why there's a bit of like, oh yeah, you could tell they're making like an Uncharted like thing, but we've seen the quality of a thing that's Uncharted. Sure. And so they're not necessarily, it doesn't feel like they're playing to the strengths that I know they have. I think seeing the guy get kicked over that ledge in addition to throwing the gun, those all seem like very improvisational moments that they're trying to show you this isn't just going to be a scripted shoot the guy in the head and move on. I think that they're going to have a lot of different things to play around with in your It kind of reminds me",
            "start": 5009.28
        },
        {
            "text": "show you this isn't just going to be a scripted shoot the guy in the head and move on. I think that they're going to have a lot of different things to play around with in your It kind of reminds me of walking into the club level of Sefue. kicking the chair if you want to, throwing the bat, you know, I think they're I think they are going to go for that level and I I that could be a really really awesome meshing of genres that I I just miss playing this type of video game, you know? Yeah. Yeah, I'm with you there, too. I was saying when we uh were watching it that I was a little a little let down by the James Bond stuff, and I love that type of game, the Uncharted type of game. And Hitman's great, too. I never got fully into it like you guys did, but um the idea of an IO James Bond, I'm like, \"Hell yeah.\" And looking at that, I'm I'm more like, yeah, it reminds I think for me watching the trailer reminds me more of um A Way Out from the Halfife. Yeah. Like it gives you that quality of",
            "start": 5042.8
        },
        {
            "text": "\"Hell yeah.\" And looking at that, I'm I'm more like, yeah, it reminds I think for me watching the trailer reminds me more of um A Way Out from the Halfife. Yeah. Like it gives you that quality of like, okay, cool. You're doing something from the m with the moment to moment set pieces, but like it's almost like, oh man, we don't have a like just the Naughty Dog level of production and budget, which nobody does. So, it's not like necessarily a knock because I think even outside of that, I look at this and I still think this looks like a good game. I also just don't care about James Bond in that way. So, it's hard for me to feel like really let down by this because it's not like, \"Oh, what's this next Jame? Oh my god, James Bond, this IP I care about it.\" Re what this is is, oh, new Machine Games thing is coming out. Oh, it's Indiana Jones. Ah, yeah. I mean, I don't really care about Indiana Jones. And I feel that same way here where I love their approach to gameplay and their approach",
            "start": 5083.28
        },
        {
            "text": "Games thing is coming out. Oh, it's Indiana Jones. Ah, yeah. I mean, I don't really care about Indiana Jones. And I feel that same way here where I love their approach to gameplay and their approach to game design, but it's in IPs that whatever. If you said this was Ethan Hunt, I'd be way more pumped, you know? Yeah, I mean, I'm with you there. I I like James Bond enough and I specifically like James Bond video games. Um, so I guess my biggest thing is I'm just going to say like I look at this guy, I'm like, I don't really care about you. Like I don't look interested in this guy as James Bond and they can win me over. Do you think it would have gone somewhere if we knew the actor? I I I mean I haven't watch the actor. Is that Are we Who is this young Dexter? We're confirmed. I don't know. Yeah. As much as just by looking at him, it looks like Young Dexter. Yeah, I haven't read it. Anyway, if it was Josh Beck, Patrick Gibson is his name. I think for me the the reason it feels weird is",
            "start": 5123.76
        },
        {
            "text": "Yeah. As much as just by looking at him, it looks like Young Dexter. Yeah, I haven't read it. Anyway, if it was Josh Beck, Patrick Gibson is his name. I think for me the the reason it feels weird is um I guess it was one of those things where it's like, what does an IO 007 game really look like? And it just it looks like a a more of a 007 game of what I would think of in my mind and less of an IO game. and like the juice of like the creativity that we see from IO. Maybe there's more to it, like this is just a a highlight reel of actiony moments, but I'm hoping to get more of that that side of Hitman uh that we know them for, right? And I think that's why the the trailer for me at least was a little bit weird of like it feels so linear action uh all that, which is not what I go to IO for. Yeah. And on the flip side of that, the what I would uh what I would go back at with that that statement, I would say that these are the trailers that get people wowed. Sure. Like when you have these",
            "start": 5168.32
        },
        {
            "text": "Yeah. And on the flip side of that, the what I would uh what I would go back at with that that statement, I would say that these are the trailers that get people wowed. Sure. Like when you have these games that look like movies, that gets the general audience more pumped. And I don't know how much Hitman has sold in the past, but I would say that to the general audience, this would look more appealing. Don't shade a Hitman around. I am a little bit. Yeah. Like I love Hitman, but I don't I think if they wanted to make another Hitman they would have like am I wrong? They made three. But also I I understand what you're saying. Yeah. Like this has a chance to take them up an echelon. This is what we're always talking about why we love to see our developers who make Yeah. make our developer or see our developers who are are making great games partner up with something that's a bigger IP than what they've been able to make before. Another great example, as great as they are, is Insomniac,",
            "start": 5219.76
        },
        {
            "text": "see our developers who are are making great games partner up with something that's a bigger IP than what they've been able to make before. Another great example, as great as they are, is Insomniac, right? They get Spider-Man. Suddenly people really know Insomniac in a different way. And you'd hope that here. But I think I for me the biggest thing for what you said Andy is like I do I do think that this is just a trailer thing of hey get the set piece moments put it in the trailer. Like we're not going to show the moment to moment of walking like we're going to save that for the IO showcase that they're doing with Mind's Eye. But like we're going to save that for featuring Mind Eye Minds Eye. Yes, this game is having we're going to save that for when we get later into the year and there's another PlayStation state of play that we can go all right. I'm not going to do the nar narrator voice, but the narrator voice of this is a what a day looks like in the life of James Bond 007 and then",
            "start": 5265.04
        },
        {
            "text": "PlayStation state of play that we can go all right. I'm not going to do the nar narrator voice, but the narrator voice of this is a what a day looks like in the life of James Bond 007 and then you show us a full level and walk us through that and you get those little moments of oh these are the IO systems that you know IO for. I think I hope we get that stuff. I mean I think we're going to get that within a couple days, right? Oh, did they say oh IO showcase, right? I mean I hope so. Yeah, I mean they're saying gameplay this summer which like I think implies summer GameFest season. So I think we're going to see a lot of this soon. Um, I saw someone in the chat say CK Squid said this is not the game to dog on. It was a highlight of the show. I don't even dogging on this. I think that it's just like it just it looks good, but I I was kind of expecting a little bit more just from the initial actual reveal of the the game more than just a logo that we've seen for the last four years or",
            "start": 5300.72
        },
        {
            "text": "just like it just it looks good, but I I was kind of expecting a little bit more just from the initial actual reveal of the the game more than just a logo that we've seen for the last four years or whatever. I hope we get like a cool watch that has like different functions. Oh, they already had the Omega. They showed the watch that said Omega. Omega. A laser out of it. I want a pen that like if you like click the pen, it explodes. Like I want that [ __ ] That's what I know for there's got to be [ __ ] like that. Uh let's go through what we did get at the show. It starts off with Luminous Arise coming fall on PS5 and VR. Greg, you love Luminous? I do. It is my favorite puzzle game of all time. Did pretty well in my top 100. No spoilers. All right. As I've been building the list. Uh yeah, I was very happy to see Enhance get their flowers as deserved for Tetris Effect, but it always hurt me that it was Tetris. I love Tetris. I'm not saying but Lumines is my [ __ ] [ __ ] right? I mean,",
            "start": 5335.28
        },
        {
            "text": "I was very happy to see Enhance get their flowers as deserved for Tetris Effect, but it always hurt me that it was Tetris. I love Tetris. I'm not saying but Lumines is my [ __ ] [ __ ] right? I mean, you want to talk about a game I've been with uh from PSP PSP. I think, you know, I think Luminesca Electronic Symphony the Vita launch game is such a fantastic rendition and then there's been the remasters and this that the other to get a brand new one to have it here to have them saying all this, you know, in the video they showed up at the end when they talk, right, of like how, you know, changing your life and doing this thing and blah blah blah like all the [ __ ] that Enhance is known for. Even their PlayStation blog, I've been inserting uh quotes and paragraphs as we've been talking, right? uh for this off the PlayStation blog. They wrote, \"Luminous Arise on PlayStation 5 with optional PSVR2 compatibility is more than just an ordinary puzzle game. Our aim is to hit you right in the",
            "start": 5379.64
        },
        {
            "text": "uh for this off the PlayStation blog. They wrote, \"Luminous Arise on PlayStation 5 with optional PSVR2 compatibility is more than just an ordinary puzzle game. Our aim is to hit you right in the fields. You emerge from the darkness in a in the first stage, parenthesis, a glimpse of what you saw in today's announcement trailer. And every stop on the over 30 stage journey evokes a different and complex emotional response. From lush jungles, oceans teeming with life, and snakes preparing to strike, to more electronic frontiers like the bustling streets of Tokyo in the endless expanse of outer space. All with visual flourishes to indicate to incite synthesia. Senesthesia. Sick. That's a big man word. You know what I mean? For a little boy like me who just likes doing the puzzle. Shake your booty. Shake your booty. looks incredible. And I mean, I I feel like this is another example kind of like the Marvel Arc System Works thing where it's like, okay, cool. It's enhanced and it's Luminous",
            "start": 5418.72
        },
        {
            "text": "Shake your booty. looks incredible. And I mean, I I feel like this is another example kind of like the Marvel Arc System Works thing where it's like, okay, cool. It's enhanced and it's Luminous and you're like, I know exactly what this is going to be and it's going to be awesome. It's Tetris Effect for Luminous, which is, you know, Luminous was already a music based puzzler. So, taking Tetris and applying music to it worked so well before. This is about to be incredible. What a crazy way the human body works that like pairing awesome music with blocks falling down on each other make like evoking a feeling and me being like wow like I have chills all over the place. It also be exciting for me to dust off PlayStation VR 2. You know what I mean? Like I'll play this obviously not on VR 2, but I do want to jump in for first playthrough and be immersed. I'm happy for you, Greg. I do wish it was Tetris Effect 2. I hear you and I respect that. And don't get me wrong, Tetris, again, I'm not",
            "start": 5465.28
        },
        {
            "text": "I do want to jump in for first playthrough and be immersed. I'm happy for you, Greg. I do wish it was Tetris Effect 2. I hear you and I respect that. And don't get me wrong, Tetris, again, I'm not throwing shade at Tetris. Another game I do love that did quite well on my top 100 list. You know what I mean? That but yeah, I'm I'm happy to finally get my my just do over here. I'm going to pick it up though. Thank you. I appreciate that for me. And then next up, Pragmatana. It's alive. I don't believe it. It's real. Uh character's name is Diana. It's coming out in 2026. They had a fun little thing of having the the sorry uh postit kind of change over to it's real XD. Uh, our two protagonists, Hugh and Diana, happen upon one another and must work together to defeat the lunar station AI and return to Earth. They both have their own abilities. You'll need to control them both at the same time to overcome the obstacles that you'll face. Bless, what did you think of this? I don't think I like",
            "start": 5506.32
        },
        {
            "text": "to Earth. They both have their own abilities. You'll need to control them both at the same time to overcome the obstacles that you'll face. Bless, what did you think of this? I don't think I like this trailer. It was another one of those that I thought just like presented weird. I don't think the game's going to be bad or anything. like it's Capcom and I think the idea and a lot of the concepts here seem really really cool, but I I feel like Capcom needs to like go to somewhere someone else to like dial in how their trailers look cuz some of the moment to moment of the gameplay just didn't didn't hit for me. But I don't know if I'm alone in that. I as somebody who's not the action game guy, right? Like I thought this was a great trailer for me where I was like, \"Oh man, [ __ ] this looks cool and I like the setup to it and I like running around here and I like that it doesn't look like it just has to be the crazy combos and everything else.\" Like it looks like there's some",
            "start": 5545.44
        },
        {
            "text": "this looks cool and I like the setup to it and I like running around here and I like that it doesn't look like it just has to be the crazy combos and everything else.\" Like it looks like there's some platforming. There's some exploring around here. I I really liked what I saw here to a point like I want to play this. Andy, yeah, I thought it looked pretty rad gameplay-wise. I mean, it's kind of just up my alley. You're third person shooting um dodging away from things. I do think that the the freakiness of the little child reminds me of uh Ethan Winter's girlfriend in Resident Evil 7. Yeah, there's like some kind of weird uncanny [ __ ] going on there that like kind of freaks me out, but I'm glad it's not dead. And I'm glad it is presenting to be a game that looks like something I'd be into, which is just generally, you know, running around, dashing around things, getting head shot, critical shots, all that stuff. Yeah, gameplay wise, I think this looks cool. I'm not really digging",
            "start": 5578.8
        },
        {
            "text": "into, which is just generally, you know, running around, dashing around things, getting head shot, critical shots, all that stuff. Yeah, gameplay wise, I think this looks cool. I'm not really digging the vibe of it overall, and I don't like the girl. It's freaking me out. Uh, yeah, I'm very shocked to see this here. And, uh, hell yeah, Capcom. News actually happening. Come on. Speaking of new IPs, Romeo's a dead man. Next up, Suda 51 2026. Maybe uh from Grasshopper 51 and Ren are behind it. Uh Romeo swaps between guns and swords using his enemy's own power against them to absolutely annihilate the evil hordes in this peak example of full-on bloody action. Uh when it first started, it's you know this like weird animated thing when it's that vibe of just like how random can we possibly get and let's just throw everything in there. How weird can we be? that often doesn't work for me. There was something about this from the jump that I'm like, I like every single thing they're doing here.",
            "start": 5619.6
        },
        {
            "text": "let's just throw everything in there. How weird can we be? that often doesn't work for me. There was something about this from the jump that I'm like, I like every single thing they're doing here. This weird sort of fisheye lens look and everything, but I mean, will any of this ever be in the game or was it just maybe this is just the intro cut scene? I have no idea. Yeah, I wouldn't be surprised if they splice it in like some weird moments or if it's like Yeah. pre start menu or some [ __ ] When they get out of this and get into the gameplay and stuff, then they do a section where it is just crazy. It kind of looks like we talked made a Rick and Morty reference. Yeah, exactly. of hype hopping universe universe art style. Oh yeah, I guess that is true. He is a universe hopping dude. So we Yeah, we'll likely see a lot of different versions. 51 makes the best sevens possible. And I mean that as like a very high compliment. Like you know the No More Heroes games are some of my favorite",
            "start": 5664.32
        },
        {
            "text": "Yeah, we'll likely see a lot of different versions. 51 makes the best sevens possible. And I mean that as like a very high compliment. Like you know the No More Heroes games are some of my favorite games from the Wii era. Um this could be an eight though. I don't know. This looks This looks Listen, if it's an eight, I'm [ __ ] I'm praising a I'm hollering. Hallelujah. But like yeah, this is so quintessential Pseudo 51. Like as soon as we got into gameplay, I was like, \"Oh, okay. I I see who this is. I see who this is that's working on this.\" And like it looks cool. It looks fun. It has a fun vibe to it. And I think for these Grasshopper games, I'm almost more in it for the vibe than anything, right? I'm They're always wacky. They always got some crazy [ __ ] going on. They always got some high violence. And like it's always from It always feels like it's from the mind of somebody who's a video game nerd, but then also an Adult Swim nerd. And opening up with a cartoon that felt like uh",
            "start": 5699.6
        },
        {
            "text": "high violence. And like it's always from It always feels like it's from the mind of somebody who's a video game nerd, but then also an Adult Swim nerd. And opening up with a cartoon that felt like uh Smiling Friends uh from Isiling Friends on Adult Swim. or is that started off on and then HBO Max because of the Warner Brothers? Yeah, if I can jump in with more from the blog, especially about the art styles and what's going on here and why it gets me excited. Right. Super bloody action, crazy twists and turns to blow players minds and a whole mess of kind of stereotypical gimmicks all rolled into one wild ride. Our hero, our hero, Romeo Stargazer, just like I said, Julia Juliet Starlight from uh Lollipop, is a man stuck between life and death. His own was saved mere seconds before the end by way of a time paradox that shattered the space-time continuum, which was created by a genius scientist screwing around. Now Romeo is FBI space-time special agent Dead Man and sporting a rad mask",
            "start": 5739.68
        },
        {
            "text": "by way of a time paradox that shattered the space-time continuum, which was created by a genius scientist screwing around. Now Romeo is FBI space-time special agent Dead Man and sporting a rad mask called Dead Gear. He must hunt space-time's most wanted fugitives through multiple universes, which is awesome. So, it sounds like what I wanted out of Doctor Strange in the Multiverse of Madness, right? Of really jumping into a bunch of weird [ __ ] and seeing a bunch of weird things go on. Yeah, I think even more so. Yeah, I think you said No Meso, right? Like No More Heroes is another game from Suda that it's all about going up the chain of who the best assassins are and you're taking out each assassin one by one. And so if we're getting a similar framing of we're going to different universes one at a time and you're fighting your way up to a boss and you're getting a cool boss battle every single time. Like that's the that's the type of Suda 51 game that I want. And on top of that, like",
            "start": 5782.96
        },
        {
            "text": "one at a time and you're fighting your way up to a boss and you're getting a cool boss battle every single time. Like that's the that's the type of Suda 51 game that I want. And on top of that, like unless I'm missing something bless that by far looked like the best looking Pseuda 51 we've ever had. Yeah, cuz like No Heroes, man. And don't even start about No Heroes 3 cuz like I wanted that game to look and play so much better. But that was a game that came out came out on the Switch one, right? And like pseudo 51 doesn't often come out with game um with like AAA looking games that are for the most modern, most current of consoles. And so this being a PS5 game, let's [ __ ] go. That initial runup in the action Barrett, if you could rewind, reminded me so much of when the character in Intergalactic runs up to the enemy at the end of the trailer. first sort of like cloudy, overcast, foresty area reminded me so much of the end of that trailer. Um, did you ever see that one uh Twitter",
            "start": 5818.24
        },
        {
            "text": "runs up to the enemy at the end of the trailer. first sort of like cloudy, overcast, foresty area reminded me so much of the end of that trailer. Um, did you ever see that one uh Twitter thread probably about a year or so ago that was a bunch of different indie devs messing around with their games and saying, \"Oh, I I put a put a random number into a certain slider of your game and see what happens.\" Right? So, it would be like, \"Oh, like this gun's massive now or there's I feel like they did that with particles in this game.\" like they're like just like whatever your number for particles is multiplied by a thousand and that's what you're going to get. So much so much of them kind of olude the screen sometimes. Looks really great though. I I really dig the vibe of this. Yeah. Damn, Andy. Good for you. Oh yeah, vocabulary today. Thanks, bro. Sesthesia. Uh, next up we had Silent Hill F coming September 25th, 2025. That was new information, right? I don't think we knew the date before",
            "start": 5859.28
        },
        {
            "text": "Good for you. Oh yeah, vocabulary today. Thanks, bro. Sesthesia. Uh, next up we had Silent Hill F coming September 25th, 2025. That was new information, right? I don't think we knew the date before that. That's cool. Um, I didn't vibe with this one. It felt a little generic to me of like, all right, we've seen this type of like Japanese horror game before. I was waiting for it to turn that corner, right, where I was like, oh, here's where it's going to be its own stamp and here's why it's a 2025 game, you know, like why is it a modern? I never Yeah, I never got that. And honestly looking I was like, man, I was like, man, they need to make a new Fatal Frame. I mean, that that's the thing is like that felt very Fatal Frame. But from the blog, I'm not a Silent Hill guy. So from the blog, they had this one statement that I liked. The mission statement during development was the following. Find the beauty in terror. Yeah, get behind that. Scary. This This looked really scary. Little too",
            "start": 5902.08
        },
        {
            "text": "had this one statement that I liked. The mission statement during development was the following. Find the beauty in terror. Yeah, get behind that. Scary. This This looked really scary. Little too freaky. There was a I legitimately had a jump scare where a car an enemy popped in from the right side of the screen and it legitimately freaked me out. And if you play this, I'll play it alongside you. Me and you do a dual stream. Hold hands. Yeah. Or you got to do that thing where you drink a pint of glass of whiskey again. Go do it. I was going to say like two like one controller, two hands, and our other hands are holding holding whiskey. really just want to hold your hand, man. Uh we got Bloodstain the Scarlet Engagement coming 2026. Uh we're excited to announce Bloodstain the Scarlet Engagement. Entirely new 2.5D sidescrolling action RPG helmed by creative director Chutaro and produced by EGA. This duo is renowned for creating games with famous for the 2D exploration style sidescrolling",
            "start": 5943.12
        },
        {
            "text": "Entirely new 2.5D sidescrolling action RPG helmed by creative director Chutaro and produced by EGA. This duo is renowned for creating games with famous for the 2D exploration style sidescrolling action gameplay. 2D exploration style sides scrolling action gameplay. Just words. We can't say Metroid Vania, but that's what that is. Um, it really makes me think of how I felt about the first Bloods was like it's just not a pretty game. Yeah. Like the And it's it's not about the art, it's about the implementation of the style cuz you look at when the camera zooms in on these characters, they look fantastic. It's it's the cell shading with the not separating the back enough or not separating the backgrounds enough from the foreground. I there's just something I've never vibed with even in the first blood scene which I still enjoyed as a game. Yeah, it all gets like noisy with the stuff that you're talking about. Nothing pops. Something about the gameplay looks fun, but yeah, I the look turns",
            "start": 5982.56
        },
        {
            "text": "blood scene which I still enjoyed as a game. Yeah, it all gets like noisy with the stuff that you're talking about. Nothing pops. Something about the gameplay looks fun, but yeah, I the look turns me off so much. So many of the scenes look like there's you need to hit turn the lighting back on and then it's like, oh, there we go. There are the shadows. There's, you know, I just I've never quite vibed with it, but it was I still think a pretty fun video game. Mhm. Then we got Digimon Story Time Stranger getting a date of October 3rd, 2025. And Andy was saying this, but yeah, definitely one of my least favorite types of trailers where it's like we don't have any attachment to these characters and they're just saying things that have no context at all to anybody. So whatever. But people are hyped for this and the Digimon RPGs are really good. So I think this is going to continue that trend. Good for Digimon for still being around, you know. Hell yeah, man. You know, hell yeah. Uh, then",
            "start": 6032.08
        },
        {
            "text": "hyped for this and the Digimon RPGs are really good. So I think this is going to continue that trend. Good for Digimon for still being around, you know. Hell yeah, man. You know, hell yeah. Uh, then we had Final Fantasy Tactics: The Ivaliz Chronicles. The Nvidia leak continues. At this point, all that's left is Final Fantasy 9 remake. So, oh [ __ ] Yeah, kind of crazy. Um, both versions, the original and the remake in one package. This is coming September 30th, 2025. This game's amazing. So, just it coming back in any way, shape, or form is awesome. It being fully VOD, I think, is great. Like, that is the type of thing that these games are going to bring back need. I didn't love the the new new style. Andy was talking about the emulator thing. Yeah. Oh, I love painting. It looks like it's on canvas. Like the detail there of like looking like it's paint. I love that. Andy, does this do anything for you? No, not really. I mean, it it I think that first shot of the character was like,",
            "start": 6072.88
        },
        {
            "text": "on canvas. Like the detail there of like looking like it's paint. I love that. Andy, does this do anything for you? No, not really. I mean, it it I think that first shot of the character was like, \"Oh, that's pretty.\" And then the more that I watched, I think it maybe looks like a canvas cuz we're back here, Greg. And maybe if you get like the I think it's just like the way that the pixels are being smoothed out. I don't know. Just I just even as they moved there the I mean the canvas is just a layer on top of it, but it looked I thought it looks just kind of like a smoothed over like making it less pixy version of the original. I forget the name of the There's like a Photoshop filter that like kind of gives the same liquify. Yeah. Yeah. Like cuz for a second when they showed this initially I was like oh that's cool. They're going to start with this uh art style, like the original art style, and then show us what the enhanced version looks like. It's like, oh, nope, that's just all",
            "start": 6117.44
        },
        {
            "text": "I was like oh that's cool. They're going to start with this uh art style, like the original art style, and then show us what the enhanced version looks like. It's like, oh, nope, that's just all right. Yeah, it reminds me a lot. And there actually was a tactics game on Game Boy Advance, but the remake style here looks like a GBA game, and I don't mean that as a compliment. Um, but great game. This is one that I'm waiting for cuz like I've never played Tactics, but I've heard all my life how good Tactics is. And with the being in the era of HD 2D, I thought for sure we would get like a really cool Yeah. art art style revamp of tactics and seeing that this is it doesn't make me want to run to play it. Um but I also think I wonder how much of it is just the fact that we've been ruined by HD2D. Like once once um what do they call it? Once project Octopath Traveler got announced it was over. Like we didn't need to to innovate anymore on our side. They crushed it. We're done. Everything",
            "start": 6159.68
        },
        {
            "text": "HD2D. Like once once um what do they call it? Once project Octopath Traveler got announced it was over. Like we didn't need to to innovate anymore on our side. They crushed it. We're done. Everything everything just make it look like that. Yeah. Can I just say this right now? Yeah. Andy, you have the floor. I'm about three I'm correcting some wrongs. I'm writing some wrongs from my childhood cuz I'm about three and a half hours into Vagrant story. Oh yeah, that might be the best game of all time. Wow. Wow. Like they got a real time parry. They got a real time like it. That's a good video game, man. Allegedly, I'm playing it. Allegedly. Yeah, of course. You know, I love that you're playing a good ass game, dude. Holy [ __ ] Did not think you're going to say Vagrant Story. Nope. Right. Out of all the games. Uh, I want to keep talking about all these games, but I want to do that everybody after a quick word from our sponsor. This episode's brought to you by XRE. Y'all know that a few",
            "start": 6196.88
        },
        {
            "text": "of all the games. Uh, I want to keep talking about all these games, but I want to do that everybody after a quick word from our sponsor. This episode's brought to you by XRE. Y'all know that a few months ago, my life changed forever when I brought a pair of XRE1 AR glasses on a long flight to New York. I legit could not believe how easy it is to use and high quality my experience was playing games, watching movies, TV shows on the plane without just too much extra stuff around me or especially not a giant goofy headset around my head. No joke, this is my favorite new tech product in years and it has earned a permanent spot in my travel bag. It is only hard to believe that it works as well as I'm saying until you try XR1 AR glasses for yourself and then you will see that the future is now. The tech is here. Connect XReal 1 glasses to wherever you are playing. Whether it's a handheld console, a PC, phone, home console. You just get a massive 150in virtual screen anywhere, anytime for",
            "start": 6237.92
        },
        {
            "text": "The tech is here. Connect XReal 1 glasses to wherever you are playing. Whether it's a handheld console, a PC, phone, home console. You just get a massive 150in virtual screen anywhere, anytime for any game. Gaming on the go like a long haul flight, you need the XR1. Next, starting to hurt from staring down at your handheld, we've all been there. You need an XR 1. A screen as big as your wall. Instant plugandplay with all of your devices via USBC. Built-in audio with sound by Bose anchoring your screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full HD. These are what make XR1 a musthave. And we hear XR1 Pro is coming soon with an even bigger virtual screen. Hit our link below to get your XR glasses today. There's nothing better than when a sponsor of Kind of funny is something that we are legitimately obsessed with, and that is exactly the case here with XRE. So, you're going to hear me talk about these forever. Go to xreal.com for more. And we're back,",
            "start": 6285.28
        },
        {
            "text": "funny is something that we are legitimately obsessed with, and that is exactly the case here with XRE. So, you're going to hear me talk about these forever. Go to xreal.com for more. And we're back, everybody. Baby steps next up. We got the date. September 8th. This game looks hilarious. The only guy that's played it is not here right now. Mike. Oh, Greg. Yeah, he went to go pee pee. Do you think he's actually pee peeing or do you think he didn't want to tell us peeking? He just screamed he's peeing. Um, he played it. This is one that I'll definitely try out. Yeah, it for the sheer curiosity. Um because I remember I think apologies, we were yapping over like this intro bit, but British humor always gets me. They be making some good jokes over there. We don't give them enough credit for how funny. Except for tomorrow to more. We'll talk about that. We'll talk about Baby Step's incredibly funny. Um we were yapping over the dialogue. I urge you to go back and listen to it. We took this",
            "start": 6338.72
        },
        {
            "text": "funny. Except for tomorrow to more. We'll talk about that. We'll talk about Baby Step's incredibly funny. Um we were yapping over the dialogue. I urge you to go back and listen to it. We took this demo demo at GDC. Mike and I, they're making it look so easy in the trailer to walk. Obviously, it's incredibly difficult since you don't know what to do. And part of it was like in this garbage world you're on. Uh there was like a basically a merrygoround and like the top of it was like so the merry ground was like entirely sunken and there was like some hat I think you can like collect hats at the top of the merrygoround and so we were all muddy just trying to climb up there and grab it before you would inevitably fall and we did that for like 10 minutes. It's like that's game new. That's the kind of game you're getting here. And then you get this in the stuff here is either going to [ __ ] hit like it does with me cuz I'm a big weirdo and like stupid weird humor or totally miss for you.",
            "start": 6386.4
        },
        {
            "text": "kind of game you're getting here. And then you get this in the stuff here is either going to [ __ ] hit like it does with me cuz I'm a big weirdo and like stupid weird humor or totally miss for you. But it's all stuff they like adlibbed. Like they you can hear them. It's like that kind of vibe of them just going back and forth talking and like trying to feel each other out like what are you saying? Like why is this h you know what I mean? It's it's real funny. I I think it looks awesome. I I hope it's good. Yeah. From what we played, I I was encouraged of like, oh, there's a real game here of like it is the they called it there, you know, in the demo like open world, right? Because it is well, go anywhere you want and do whatever you want. Like, you know, you might have to they tell you to go up to that thing all the way over there, but you can [ __ ] around and find other people, find other stuff. Andy, I just read a comment on YouTube or a chat from Falcon 4196 who said he's",
            "start": 6426.56
        },
        {
            "text": "you to go up to that thing all the way over there, but you can [ __ ] around and find other people, find other stuff. Andy, I just read a comment on YouTube or a chat from Falcon 4196 who said he's blasting a dookie. Perfect combination of verbs and nouns. Next up, we had uh one of my highlights of the show, Herogami. It's from Van Dynamco. Uh origami home, Greg. What's that mean? Origami. He wrote that origami home. You have to read every note. I I mean it's what it's like. Oh, he just missed. It's Herogami. Well, you have to protect your origami home because it's being threatened. Got it. Okay. Got it. Yeah, it was all one word. Uh September 3rd. A lot of September games in the press release. In Herogami, players will assume the role of hero, a brave warrior defending their fragile world from digital invaders known as the blight. Andy, there's always a blight. There's always a blight. There's always a scourge. Oh my goodness. Uh yeah, this looks awesome. Great visual style. It looks",
            "start": 6461.28
        },
        {
            "text": "from digital invaders known as the blight. Andy, there's always a blight. There's always a blight. There's always a scourge. Oh my goodness. Uh yeah, this looks awesome. Great visual style. It looks like it's a a fun platformer and a fun puzzler. Put them together, it's going to be a good time. Yeah. Main character looks sick as [ __ ] That's just a really cool design. Great color scheme with the It almost looks like a Destiny mask. Like it looks like if somebody made a Destiny character in origami. Yeah, super creative. Uh I I love the idea of switching into all these different things. Very, you know, it takes twoish. Very uh Kirby freaking great adventure. Yeah, that one. Uh and the Forgotten Land. Um yeah, I think it looks really fun. Super into it. Uh you guys have any thoughts on it? Welcome back, Terway. Yeah, that was my thing. I looked at I'm like I feel like I've done this before. I'm sure it'll be great and you know, blah blah. I'm not trying to throw it out, but it didn't",
            "start": 6509.28
        },
        {
            "text": "Welcome back, Terway. Yeah, that was my thing. I looked at I'm like I feel like I've done this before. I'm sure it'll be great and you know, blah blah. I'm not trying to throw it out, but it didn't do much for me of like, okay, I thought Terway had more personality, which is See, it's interesting. And maybe actually that that is why I prefer this is like Terway I think it was just personality. Like I feel like the gameplay stuff was kind of like, all right, I know what I need to first person kind of. Yeah, I think I'm way more into this style. This was more like, oh, there's an actual like there's action here and more like twitchy type stuff, which I I personally prefer. Uh, and then everybody's golf hot shots coming September 5th, 2025. Yep. Uh this is that one we went that you know we were like uh wow band dynamo remember this got announced I forget where thank you somebody help the last direct and it was that thing where we were like okay cool and then there was so much chatter",
            "start": 6551.2
        },
        {
            "text": "were like uh wow band dynamo remember this got announced I forget where thank you somebody help the last direct and it was that thing where we were like okay cool and then there was so much chatter back and forth of all of us talking about it in the chat at the same time and then being not a thousand% clear remember the rumor was when we were live last time and I forget where we ended up was oh is this the VA golf game the VA's hot shots golf repurposed this way and I can't remember if we came down on a conclusion, yes or no. I remember being very animated about it and going through it very much, but not I don't think it was 100% sure. I think it was just kind of thrown out there as like your inner thought and then I don't know. No, it wasn't my thought. I think chat was attacking me saying it was and I had here's what the official press release from back then said. Get ready to par down, right? Because it's par. That's good. as one of the world's most popular golf games returns to",
            "start": 6588.48
        },
        {
            "text": "it was and I had here's what the official press release from back then said. Get ready to par down, right? Because it's par. That's good. as one of the world's most popular golf games returns to the links in Everybody's Golf Hot Shots. Developed by Hyde and published by Bandai Namco Entertainment America, this beloved golf gameplay from the hit series Everybody's Golf, formerly known as Hot Shots Golf in North America, gets upgrades and improved graphics, new gameplay modes, and new customization options. Everybody's Golf Hot Shots is slated to release blah blah. So again, they're using very general stuff. It would make sense, of course, with Bandai Namco being the folks who published Freedom Wars when that was remastered here. Uh but Barrett, can we see the footage? My thing, I get so excited because I love Everybody's Golf. I think Everybody's Golf on PlayStation 4 is a perfect golf game. And I look at this and I just go, it doesn't look good. When it was a Switch game, you're like,",
            "start": 6630.64
        },
        {
            "text": "because I love Everybody's Golf. I think Everybody's Golf on PlayStation 4 is a perfect golf game. And I look at this and I just go, it doesn't look good. When it was a Switch game, you're like, okay, I understand it's a Switch. And then it's like, oh no, it's everywhere else. It's like, well, it especially doesn't look good here on PlayStation. Thought flat textures. It's the golf gameplay systems, of course. So, yeah. Sorry, they didn't break it out, so I'm trying to find it in the There's something about the style that's appealing to me that I would I would always gravitate towards this as opposed to a PGA tour or Tiger Woods. Oh, thousand% thousand%. But it's just more that thing of I look at this, I'm like, well, I just Why not just go play everybody's golf where? Yeah, on PS4. My game that I own on PlayStation 4. Oh, that Oh, the old Okay. Yeah, like the online servers are off, but I wouldn't necessarily be playing other people. I mean, if that's the thing, you're just jumping",
            "start": 6670.96
        },
        {
            "text": "that I own on PlayStation 4. Oh, that Oh, the old Okay. Yeah, like the online servers are off, but I wouldn't necessarily be playing other people. I mean, if that's the thing, you're just jumping into play multiplayer. I understand. Then I stand down. or yeah, they turned off servers, but I don't think you do direct peer-to-peer play. But again, I just don't think that looks great. And again, the way they're talking about it and the fact that it's them and it's not Clap Hands, who are the folks who did it. There's enough on this one where I look at it, I'm like, I'm not counting down the days to this one. I'm excited to try it and see, maybe I'm wrong, maybe it is everything I want out of it. But no, there's something there that isn't doing it for me. This is where you're holding up the executive like pilot shirt. You're like, \"Where's Clap Hands at? What have you done with them?\" They're like, \"They made they made this exact game but for iPhone.\" I'm like, \"I don't want a [ __ ]",
            "start": 6710.08
        },
        {
            "text": "executive like pilot shirt. You're like, \"Where's Clap Hands at? What have you done with them?\" They're like, \"They made they made this exact game but for iPhone.\" I'm like, \"I don't want a [ __ ] iPhone game. Uh, Ninja Giden, Ragebound. Get the date. July 31st, 2025. Very happy. That's sooner than I expected. I I was thinking August, which I know isn't far from July 31st, but uh I want to get this back in my hands as soon as possible. I got to play about 2 hours of it, and I was like, \"God dang, dude. This thing is hitting.\" And uh pretty much every way that you'd want a retro game like this to feel as like a modern game coming out nowadays. But uh they're going above and beyond with this one. like this. I think this is going to really really surprise people and be even better than they expect it to be. Yeah, that's my thing is I always thought this game looked cool, but for some reason this trailer is presenting it in a way that's really making my brain go, \"Oh no, I I need to play",
            "start": 6739.76
        },
        {
            "text": "expect it to be. Yeah, that's my thing is I always thought this game looked cool, but for some reason this trailer is presenting it in a way that's really making my brain go, \"Oh no, I I need to play this.\" Like I they're showing a lot of like the fast action moments of like hit hit jump. Like it's doing something to like uh I think take my brain back to those flow state kind of games, you know? Like the games where it's like, \"All right, cool. I just got to [ __ ] take out everything in this room and do everything as like get to these platforms like as quiz as quick as I can kind of stuff and it's really working for me stylistically. Like all the pixel art looks amazing. The music that they had in the trailer looked amazing. Like the music was great. Yeah, they're doing a really good job of showing off this game. Then we had uh Karen K I R coming November 5th, 2025. There's a demo out today uh coming to PS5 and PC via Steam. again. One, I I feel like we've been hearing I've heard",
            "start": 6781.04
        },
        {
            "text": "job of showing off this game. Then we had uh Karen K I R coming November 5th, 2025. There's a demo out today uh coming to PS5 and PC via Steam. again. One, I I feel like we've been hearing I've heard about this forever ago, which isn't weird, but also I know there's juice and there was a that one co-op one. There was a there was a moment there where it seemed like we had a lot of climbing games all happening at once. Still feel like in that moment, right? Yeah. Looks pretty, but not I don't not going to do it for me. Yeah, I'm there, too. That's a no for me, Andy. Okay, that's a no for me. What about you? You going to play? You going to be cool? Uh, no. I think the art style also reminds me of that that one sort of resort game that you got into for a bit. The combat one, Hintterberg, Dungeons of Hterberg. I was Yes, thank you. I was in a different vein, but yes, yes, yes, yes. Kind of reminds me of that a little bit. Um maybe it's just the mountainy snowy vibes, but yeah, didn't do a",
            "start": 6815.92
        },
        {
            "text": "of Hterberg. I was Yes, thank you. I was in a different vein, but yes, yes, yes, yes. Kind of reminds me of that a little bit. Um maybe it's just the mountainy snowy vibes, but yeah, didn't do a whole lot for me. I think there's too many things to play to to play that right now. Uh, and then we got Mortal Kombat Legacy Collection from Digital Eclipse coming this year. I'm super stoked for this. They do such a great job with their retro collections, like really putting the love and care that these things should get. I loved the cowabunga collection for all the Turtles games and yeah, getting all the classic Mortal Kombat. That's rad. Yeah, I love that they have the like Game Boy ones, too. Like not just the first three. No, no, not just the first four because they got MK4 in there as well. Um, so that's [ __ ] awesome. I want more love for like the PS2 era and not just Mortal Kombat. But I'm talking about in general for collections because I feel like a lot of these collections either",
            "start": 6863.84
        },
        {
            "text": "Um, so that's [ __ ] awesome. I want more love for like the PS2 era and not just Mortal Kombat. But I'm talking about in general for collections because I feel like a lot of these collections either we'll do arcade era and then like you know like 8bit all the way up to it feels like we're always stopping at that 16 bit 32-bit uh like era. I feel like I want to push forward a bit cuz I see MK collection um for me obviously like I understand why you were choosing these games and why this is like the classic thing but man if you give me a collection with Armageddon Deception Shaolin Lance Deadly Alliance then we're cooking. My question for you on this, I've never delved in. I've seen the collections, but Okay. Are there the the clips and stuff there is that just for this ad or they're like documentaries? It's in the game. I'd love to see that. Yeah. And very well presented. You can like see all the box art and like look at all the like the manuals and stuff like all digitally like very",
            "start": 6902.48
        },
        {
            "text": "documentaries? It's in the game. I'd love to see that. Yeah. And very well presented. You can like see all the box art and like look at all the like the manuals and stuff like all digitally like very very high quality. Like it's they're very very cool collections. And yeah, the fact that you were saying this, but getting all the Game Boy versions and stuff too like it's cool for turtles where it's like all right, cool. There's the NES version of the arcade game, but then there's also the Game Boy version and you know, whatever. Not that game exactly, but like it's very cool to be able to see the differences between. Yeah, it's really cool for preservation and also like it's one of those things where I I did this recently for the Yu-Gi-Oh um like dark I forget what it was. The collection, the Yu-Gi-Oh collection early days early days that came out back in like February. And there are certain games that I I remember playing as a kid that as an adult, every time I think about those, I'm",
            "start": 6946.16
        },
        {
            "text": "the Yu-Gi-Oh collection early days early days that came out back in like February. And there are certain games that I I remember playing as a kid that as an adult, every time I think about those, I'm like, \"Oh yeah, that was cool. I'll never play that game ever again.\" And I picked up Yu-Gi-Oh Dark Duel Stories through the early days collection and it was really cool going back and reliving a thing and seeing how that was. I'm going to do that again for the Mortal Kombat game on Game Boy cuz I spent so much time in the back of my mom's car just [ __ ] playing that game and being obsessed with it. Me too, actually. Yeah, like that was my first foray into Mortal Kombat. Um, and so yeah, to have that stuff accessible even if the games probably suck, like it's just really cool for nostalgia sake and I'll for sure spend the money to relive my childhood. Mhm. Uh and then bless we got a PlayStation Fight Stick Project Defiance. Uh love this. You know, obviously they they got EVO and a bunch",
            "start": 6979.6
        },
        {
            "text": "and I'll for sure spend the money to relive my childhood. Mhm. Uh and then bless we got a PlayStation Fight Stick Project Defiance. Uh love this. You know, obviously they they got EVO and a bunch of fighting games. They've been supporting Street Fighter for a long time now in terms of their state of play is like usually having Street Fighter announcements or waves or whatever. But uh I love seeing them continue to care about fighting games and like present them as if they matter as much as they do. Yeah. Yeah. I I I would love to have like a conversation with like whoever's in charge of all the fighting game stuff at PlayStation cuz they have such a dedication to this specific genre. Like you go to the PlayStation Twitch at times and they're just doing fighting game tournaments, right? Like one of my favorite things that uh they have for a lot of the fighting games, if not maybe all the fighting games available on PlayStation is uh they have like the hourly tournaments where at any",
            "start": 7014.88
        },
        {
            "text": "Like one of my favorite things that uh they have for a lot of the fighting games, if not maybe all the fighting games available on PlayStation is uh they have like the hourly tournaments where at any point if you just want to go through a bracket in a fighting game, I do this for Tekken all the time. you can go through if you win like four matches in a row, you win like a special like icon or some cosmetic thing for your profile, right? Like there's a dedication to fighting games from them buying EVO and all the stuff that they have and they see potential. They see the audience. Like there's something they see there which is really cool. And yeah, I think doing a fight stick makes so much sense. I don't know why I never predicted that they would do it, but it looks sleek. It looks it's I mean it's very PlayStation 5 branded, which is cool for this thing. Uh, and yeah, like I'm fascinated to see once they go to the next EVO or the EVO after the next Evo, like how many people people are",
            "start": 7054.24
        },
        {
            "text": "it's very PlayStation 5 branded, which is cool for this thing. Uh, and yeah, like I'm fascinated to see once they go to the next EVO or the EVO after the next Evo, like how many people people are going to be carrying these things around. We got Metal Gear Solid Delta. I got this on blue sky. Kab's told me he wanted to talk to me about something else on Blue Sky, but then I ran into this meme. Sir, second Coke. He just Hey, Greg. Look at you. Look at you, Tim. That's me. Grab his neck. Metal Gear Solid Delta, August 28th, 2025. Uh, the question of the day, was that Metal Gear Online? Jess Ray is at GameSpot says, \"The new trailer for Metal Gear Solid Delta Snake here to reveal new footage, including what appears to be Metal Gear Online gameplay.\" Appears. Appears. Appears. I never played online for three. I played a bit in four, but I had an error where I watched a lot of Metal Gear Online YouTube. Addison. No, it wasn't Addison. Oh, sitting at Addison's house doing the dance. No, even",
            "start": 7091.44
        },
        {
            "text": "for three. I played a bit in four, but I had an error where I watched a lot of Metal Gear Online YouTube. Addison. No, it wasn't Addison. Oh, sitting at Addison's house doing the dance. No, even though Addison was the one who did uh let me borrow his Melissa and yeah, that's how I fell in love with Mel. He let me in. But like I remember just being on YouTube and those those are some of the first like machinimas I watched were people doing role playing stuff in Metal Gear online. So I'm happy it's back. Uh I'm into this man. I obviously not a big surprise but I really love I'll tell you this Metal Gear 3 might be a good game. Might be a good game. I I just love it where it's like guys clearly we know these moments. you know, these characters like I it this sounds the way it's supposed to sound. I I love the way that it looks. It looks like Metal Gear Solid 3 just fancier. Like I like that what they didn't change is what I like the most. Like I feel like the way that they move and",
            "start": 7136.8
        },
        {
            "text": "to sound. I I love the way that it looks. It looks like Metal Gear Solid 3 just fancier. Like I like that what they didn't change is what I like the most. Like I feel like the way that they move and stuff. I'm like, \"Yeah, that's Metal Gear Solid 3.\" Like it is as modernized as I would hope it would be because I feel like if they went further, it takes away the soul of Metal Gear. See, I I'm so excited for this and like I think it looks great fidelity-wise, but there is something about how the characters look and move to where I don't know if I'm feeling the soul of it. Same like the uh hot slot moment where he's uh reloading the gun and like running and stuff. This animation right here, like it looks so weird. Yeah. U I'm I'm right there with you, Bless. where I feel like this is at least the most I've seen of actual like getting a lot of moments in gameplay of how this all looks and it looks very awkward for 2025. Yeah, I think a lot of that is um it's it's art style versus the age",
            "start": 7178.24
        },
        {
            "text": "the most I've seen of actual like getting a lot of moments in gameplay of how this all looks and it looks very awkward for 2025. Yeah, I think a lot of that is um it's it's art style versus the age of of you know animations back in the day and maybe not ma you know they're not matching up right now but I'm still unbelievably pumped for this of course. A that I watched that intro the other day. Holy cow. [ __ ] hotness, man. The re-recorded song. Which again, that's another example for me. It's like they changed it just enough that it's like this is different. This is new, but it is still exactly what it's supposed to be. Uh then we got Neo3 from Team Ninja coming early 2026. The demo is out today. Um in Neo3, the protagonist is a young warrior poised to become the next Shogun. Uh they got ninjas now. They got ninjas now. Man, what a movie. Cool. Time and it was not happening. I did play quite a bit of Neo 2 and then I fell off. I've never I've never booted up a Neo game. I always I'm",
            "start": 7225.12
        },
        {
            "text": "ninjas now. They got ninjas now. Man, what a movie. Cool. Time and it was not happening. I did play quite a bit of Neo 2 and then I fell off. I've never I've never booted up a Neo game. I always I'm always told I should cuz I always say that Liza P is the best Souls like that's not a from Software game and everybody's like you got to play Neo 2. You got to play Neo 2. I will eventually. I just maybe I was kind of bummed out by the quality of everything else that was happening out besides the combat in Wolong Fallen Dynasty and and Rise of the Ronin, but um yeah, I mean I will definitely try out this demo. I think I obviously should try out those video games as well. I think they're worth returning to just to see cuz I I'm with you where I played all of Stranger of Paradise, played all of Wong Fallen Dynasty, I started Rise the Ronin and like it's it's like you go when you go to a restaurant and order different dishes, but you can but they're using all the same ingredients and so like",
            "start": 7275.6
        },
        {
            "text": "Wong Fallen Dynasty, I started Rise the Ronin and like it's it's like you go when you go to a restaurant and order different dishes, but you can but they're using all the same ingredients and so like everything kind of tastes a little bit the same and it's like all right, I'm ordering I'm ordering something else, but yeah, it's Taco Bell, right? Like there's something to the even going from Stranger Paradise to Wool Long Falling Dynasty where I'm like, \"Oh, okay. I see what y'all do here.\" Like y'all make a specific type of game and it works, but I' I'd be fascinated to like go back and see with Neo one and two like all right, is it the same recipe? Like is did these games stand out because they were the first two to hit the masses and then they made everything else and now they kind of like have this uh formula or are these ones really like the goats compared to all these other team ninja games? [ __ ] I'm going to get some Taco Bell after this. Dude, I'm hungry too. Uh, then we got",
            "start": 7324.8
        },
        {
            "text": "have this uh formula or are these ones really like the goats compared to all these other team ninja games? [ __ ] I'm going to get some Taco Bell after this. Dude, I'm hungry too. Uh, then we got Thr Legacy of Shadow from Vertigo Games. Maze Theory in association with Idos Montreal coming to PlayStation VR 2. Um, it looked good. Like it looked like a good VR game and it's Thief like that kind of did checks all the boxes I feel like they need to for a VR game. Yeah, exactly. I I think it's not enough. I, you know, I'm going to turn on my PlayStation VR 2 for Luminous. That is a day one ready to go. this I look at I'm like, \"Okay, cool.\" But I'm not I was never the thief guy, right? I was never all about that life. Yeah. I need this to not do well because if this does really good, they're going to make a DSX VR and that will ruin me cuz I will need to play it. Just give into it. No, you got to go on my same journey with Arkham Shadow, right? Where I was like the biggest hater of Arkham",
            "start": 7364.4
        },
        {
            "text": "to make a DSX VR and that will ruin me cuz I will need to play it. Just give into it. No, you got to go on my same journey with Arkham Shadow, right? Where I was like the biggest hater of Arkham Shadow and then I reviewed it and I called it a uh what was it? Uh not a pizza but a um calone. Yeah. Yeah. That's the thing is like if they make a same ingredients but they just deliver to you in a different way. If they make a DSXVR game, it'll probably be good. That's the heartbreaking thing. Like that actually kind of works. Next up, we had Tides of Tomorrow. Look pretty damn neat. It's a multiplayer story. Road 96 people behind it. Uh this is February 24th, 2026. Tim, I gave you an insane amount of paragraphs because I think it's important. This is when they were showing this and they as we're looking at it right now. You're seeing these holograms or shadows of other people and then they go into it and start talking about it being a multiplayer story, right? And dealing with the",
            "start": 7413.6
        },
        {
            "text": "as we're looking at it right now. You're seeing these holograms or shadows of other people and then they go into it and start talking about it being a multiplayer story, right? And dealing with the consequences of the other players and blessing immediately perked up. And I know how much you like Road 96 and all the permutations there. I'd like to read this if you don't mind. You can stop me if I get long in the tooth and you think I'm it's no longer interesting. But they literally like, \"All right, cool. We showed you this. We said it's a multiplayer story, but what does that [ __ ] mean?\" Basically, when starting a game of Tides of Tomorrow, you must select a player to follow. This player has played the game before you and can be a total stranger, someone from your friends list, or a famous streamer. You begin your journey, rescued from deadly waters with no memory of who you are or how you got there. Somehow, you've awakened centuries after a massive flood wiped out most of",
            "start": 7458.48
        },
        {
            "text": "or a famous streamer. You begin your journey, rescued from deadly waters with no memory of who you are or how you got there. Somehow, you've awakened centuries after a massive flood wiped out most of civilization. Now, scattered communities survive across a harsh ocean world. You are infected with plast plastia plastia, a disease caused by an ancient poison, microplastic pollution. If you don't find a cure soon, you'll slowly turn into plastic. But you'll soon discover that there are others like you, always found in the ocean with no memories of their past. You are all connected. The people of this world call you tide walkers. In Tides of Tomorrow, each player embodies one of these tide walkers, a mysterious community of sea nomads. Players will have to question their relationship to each other, challenge their morality, and learn more about the bond they all share. You travel the ocean aboard your trusted boat, visiting locations after location after location, each one previously",
            "start": 7495.2
        },
        {
            "text": "other, challenge their morality, and learn more about the bond they all share. You travel the ocean aboard your trusted boat, visiting locations after location after location, each one previously visited by a player you're following. Thanks to our asynchronous vision system, you'll see echoes of this player's choices and actions in the form of ghosts. These visions help you avoid traps, solve puzzles, investigate what happened before, or simply adapt based on other players actions. Not only that, but the game's NPCs will remember what the other player did, and they won't hesitate to talk about it. That other player was not in some kind of parallel universe. Their actions on the world are concrete and will have tangible consequences on your experience. For for example, if a player stole something valuable from an important NPC, that character might now hate all Tide Walkers, forcing you to sneak around instead of being welcomed. Some players can drastically I'm sorry. Some levels can",
            "start": 7538.96
        },
        {
            "text": "valuable from an important NPC, that character might now hate all Tide Walkers, forcing you to sneak around instead of being welcomed. Some players can drastically I'm sorry. Some levels can drastically change depending on what the last player did. Without spoiling our secret recipe, each level blends handcrafted narrative moments with systemic game elements, resulting in a unique experience for every player. That's a true challenge to build because we take the previous player's choices into account as well as your own choices to make sure you still feel in control of your adventure. Each new step of the journey lets you choose where to go next and who to follow. Will you stick to the same person, try someone new, or pick based on your own instincts? There are lots of reasons to follow one player over another, maybe like their play style, want to discover their choices, or to benefit from the resources they left behind. Stalker, this sounds [ __ ] awesome. It sounds very hard to",
            "start": 7583.6
        },
        {
            "text": "one player over another, maybe like their play style, want to discover their choices, or to benefit from the resources they left behind. Stalker, this sounds [ __ ] awesome. It sounds very hard to develop, but this gets I saw this and I was like, okay, whatever, blah blah. But to lay it out and explain it was I was like, oh, wait a second. This sounds like a total I'd love to get into this and be following Bless or jump to Andy or see what's going on or just, you know, leave a trail forever people follow. That's gamedev magic right there. Really awesome. What does what does the game look like in four years from now? You know what I mean? Like how do all these choices sort of look in your video game? And at first when you mentioned you will always be following somebody that's ready to play the game. I was like, who was the first one? What happened to the developers? I'm still You said microplastics and I my brain went on just a journey about thinking about the future. I went to another",
            "start": 7622.72
        },
        {
            "text": "the game. I was like, who was the first one? What happened to the developers? I'm still You said microplastics and I my brain went on just a journey about thinking about the future. I went to another treasure and they said we got Astrobot. The boy is back. The bot is back. Uh later this month we got five new challenge levels now bringing it to a total of 90 planets. New special bots including Ghost of Yote characters and some more that they're not telling us yet. They're just teasing. And it's definitely going to be [ __ ] Cloud Strife, baby. It's happening. Um, I hope uh they say, \"We're delighted to announce yet more additional content landing in Astrobot July 10th at 6:00 a.m. Pacific.\" Thank you for being that specific, guys. Uh, indeed, five brand new levels will make their way into the game as part of the Vicious Void Galaxy. Uh, as with our last update, the five levels were will require you to pull every bit of skill together to complete. So, hang on to your Dual Sense",
            "start": 7663.52
        },
        {
            "text": "into the game as part of the Vicious Void Galaxy. Uh, as with our last update, the five levels were will require you to pull every bit of skill together to complete. So, hang on to your Dual Sense controller and dive in. The five levels will be twin frog trouble, suck it up, handheld havoc, high inflation, and well, you'll have to play and see what's up with them over there, man. Keep doing it. They're doing it on purpose. Good for them. Good for them. Also, I hope these levels are like I hope they're just knocking this [ __ ] out cuz like I kind of part of me is like work on the next game, but I hope there's just one dude that's like, \"Hey, I'm making the levels and I got nothing else to do.\" I mean, here's what I love here. Who knows? Maybe completing all Vicious Void might lead to something really cool. I mean, what could that be? I mean, I love it. Uh, and of course, the new levels will come with their own special bots. We won't ruin the surprise. Love this. Can't wait. I'll take",
            "start": 7706.8
        },
        {
            "text": "really cool. I mean, what could that be? I mean, I love it. Uh, and of course, the new levels will come with their own special bots. We won't ruin the surprise. Love this. Can't wait. I'll take as much Astro models as they'll give me. And I love that they continue to. I thought that they were going to do more of like a a sizable DLC, but instead they're just kind of like It's weird cuz at this point they could have, you know, like if they didn't release anything and just like package them up and gave it a big name and then charge for them, like nobody would have been mad about that. Yeah. But I kind of like this. It's fun to just consistently just get some. It reminds me a lot of the when the Mario Kart 8 booster courses were coming out. Roman Sky. Next up, we had Sea of Remnants. We have confirmed there is an of in the name uh coming 2026. We did it. While you might find familiar tags to explain the gameplay within, such as ocean adventure RPG, simulation, survival building,",
            "start": 7745.2
        },
        {
            "text": "We have confirmed there is an of in the name uh coming 2026. We did it. While you might find familiar tags to explain the gameplay within, such as ocean adventure RPG, simulation, survival building, turn-based strategy, we'd rather introduce it with this single line. This is an infinite voyage looping between death and rebirth. A journey where we row forward tirelessly only to return to where it all began. Hm. Rogue light. Rogue light. The story. One ship, an uncharted sea, and a crew of puppet folk. They're puppets. Nets. Yeah. Uh, from the email. Yeah, I got an email that I added in on top of the blog stuff, which may temper your expectations. Today, during the PlayStation State to play, Net Ease Games officially revealed Sea of Remnants, a freetoplay ocean adventure RPG directed by Joker Studio, coming to PS5, PC, iOS, and Android in 2026. Sea of Remnants invites players into a visually captivating world where they assume the role of a puppet-like sailor who's lost all their",
            "start": 7781.84
        },
        {
            "text": "by Joker Studio, coming to PS5, PC, iOS, and Android in 2026. Sea of Remnants invites players into a visually captivating world where they assume the role of a puppet-like sailor who's lost all their memories. Alongside a mysterious girl, players will voyage across vast seas, uncharted islands, and a city slowly awakening to its secrets through open world exploration, intense naval combat, and dynamic interactions with a cast of over 300 eccentric characters. Players will uncover the truth behind their forgotten identity and shape the fate of the world around them. Those damage numbers, I see that I go, \"Ah, yeah, mobile game. This does look like a like I could totally see yeah chat was said someone in chat said pirate gotcha can someone just make a black flag successor yeah when I when I got it and I was looking I was like oh you know open RPG okay cool and then it was like oh then you get into this like okay netis okay okay ready free to play free to play all this we'll see what",
            "start": 7825.6
        },
        {
            "text": "I got it and I was looking I was like oh you know open RPG okay cool and then it was like oh then you get into this like okay netis okay okay ready free to play free to play all this we'll see what this is I'm not holding out hope for it being great yeah me neither funny cuz like this is definitely not a Tim game but like I think this looks really cool. Yeah. But yeah, hearing those stuff I'm definitely not so cool. Um, then we got some game catalog updates. Uh, we have FBC Fire Break coming June 17th. Oh, I think you missed number 21, Sword of the Sea. I thought it was a Oh, I did. It was bad to put Sea of Remnants and Sword of the Sea back to back. I was confusing when I was adding things to the document. Yeah. Yeah. Yeah. We got a Giant Squid presents uh this coming August 19th, launching onto the PS+ catalog. In Sword of the Sea, surfing across the landscape can actually evoke a state of meditative calm and flow. As a surfer and snowboarder myself, I have felt the rush of movement",
            "start": 7873.2
        },
        {
            "text": "onto the PS+ catalog. In Sword of the Sea, surfing across the landscape can actually evoke a state of meditative calm and flow. As a surfer and snowboarder myself, I have felt the rush of movement and seeing the beauty of nature in a way that only those extreme sports can deliver. Nice. Hell yeah, dude. Take me on a journey. This looks awesome. It's just like Journey with like a [ __ ] skateboard. What was the Is it Solar Ash? Was that the game from the Hyperlight Breaker studio? Like that it gives you vibes of that spec specifically like the snowboarding part, right? like cuz I think Solar Ash had that uh to it as well. I'm excited for this even though it looks so much like Journey just in the in the environments. Yeah, it's really damn cool. I haven't been able to meet the high that I got from Journey from any of these other games. Like uh I know you're a big Pathless guy. I wasn't a big Pathless guy and I I wonder I don't know what it is, but I mean yeah, so much about this does",
            "start": 7915.44
        },
        {
            "text": "got from Journey from any of these other games. Like uh I know you're a big Pathless guy. I wasn't a big Pathless guy and I I wonder I don't know what it is, but I mean yeah, so much about this does scream my name. Uh then we got the game catalog coming. In addition to that, FBC Fire Break coming June 17th, DSX is coming in June, the PS2 version. Uh, Twist Metal 3 and 4 in July, trying to coincide with season two of the show coming out on Peacock the [ __ ] Resident Evil 2 and 3 OG's coming in the summer and then Mist and Ribbon in the summer. Bunch of classic games. Uh, Twist Metal 3 and four aren't the worst Twisted Metals. They weren't made by uh Incognito. They were made by I9 Studios. That's what it was. Um, damn. 989 made some [ __ ] ballerass sports games. I'll tell you they did. Yeah, they did. Uh they made some stinker Twisted Metal games, but I have very fond memories of playing Twisted Metal 3, even though it was absolute trash. So, you know what? This is one of those ones",
            "start": 7953.52
        },
        {
            "text": "they did. Uh they made some stinker Twisted Metal games, but I have very fond memories of playing Twisted Metal 3, even though it was absolute trash. So, you know what? This is one of those ones allegedly I'm going to pop into NCAA Final Four 99. That was the one for me from 99 Studios. Hell yeah. Uh yeah, then we got 007 First Light. We already talked a bit about that. Do you guys have anything else to add or move on? Move on. still very interested in. I'm looking forward to Friday showcase from IO. Uh see what they got and yeah, but again, yeah, there's the watches. Oh, there's the watches. Thank you so much. Ghost of Yote got a little bit of this gameplay deep dive coming in July. Um Sucker Punch has a special state of play episode dedicated to Ghost of Yote coming next month. Looks sick. Wolf's sick. That wolf's mad, man. Yeah, this is one of those ones where like I'm I'm so already sold on Ghost to now when I see it in a showcase, I'm like, \"Oh, don't move on to the next thing.",
            "start": 8000.8
        },
        {
            "text": "Wolf's sick. That wolf's mad, man. Yeah, this is one of those ones where like I'm I'm so already sold on Ghost to now when I see it in a showcase, I'm like, \"Oh, don't move on to the next thing. I'm already told.\" What if a wolf only like if it was missing an arm and they call it the one-armed wolf, Sakuri? Oh my god, I wouldn't hate that. I wouldn't hate that actually. Good [ __ ] I thought you were going to make like a Bucky reference. Yeah. Uh and then finally, Marvel Token Fighting Souls. Uh, this comes from Arc System Works PlayStation Studios. It's a 4v4 tag battle fighting game coming to PS5 and PC in 2026 from Japan to the world. Wow, what a pitch perfect game announcement. I loved how they did this. What a genuine surprise. Game looks freaking fantastic. Has such a to take Marvel these days and have a unique take on it, I think, is very difficult. Um, but they pulled it off and I loved the little rewind tease telling the documentary story of like how the game came to be. Cool",
            "start": 8043.52
        },
        {
            "text": "these days and have a unique take on it, I think, is very difficult. Um, but they pulled it off and I loved the little rewind tease telling the documentary story of like how the game came to be. Cool stuff. This closing the show I thought was a 10 out of 10 win. I thought that that's why they said the uh whole presentation was going to be about 15 minutes shorter because they didn't want to count that portion and people go, \"What the [ __ ] Yeah, you're giving us this documentary instead of game, you know, uh, announcements or whatever.\" I thought it went on a little too long, but still really really You hate devs. Yeah. I mean, the documentary stuff worked for me, but that's also because like I'm so into how the [ __ ] did you do this, right, of the PlayStation studios publishing it, Marvel, and then Arc System Works. This is such a meeting of like three very distinct things that you don't often see happen this way, and it's a perfect storm of, oh, yes, this makes sense to give a",
            "start": 8095.2
        },
        {
            "text": "Marvel, and then Arc System Works. This is such a meeting of like three very distinct things that you don't often see happen this way, and it's a perfect storm of, oh, yes, this makes sense to give a Marvel fighting game to Ark. Sorry, Capcom. Um, but yeah, like this is really cool, right? I think especially coming off of uh Guilty Gear Strive, but even more so Dragon Ball Fighters, which is a game that really hit the masses and people loved Dragon Ball Fighters did such a good job of being approachable and accessible to an amount of people that might not be super duper fighting game nerds, but that had an autocombo system where you can just kind of mash and, you know, be as competent as you can right at that level and you can have fun with that game even if you're a casual player. I imagine this game is going to have that similar thing of trying to trying to appeal to the hardcore uh uh players that are coming off of being in the Marvel C versus Capcom community or the Arc System",
            "start": 8136.32
        },
        {
            "text": "this game is going to have that similar thing of trying to trying to appeal to the hardcore uh uh players that are coming off of being in the Marvel C versus Capcom community or the Arc System Works games communities, right? But then at the same time hitting the casual PlayStation audience that see a Marvel game, see that it looks cool, want to play it, and then pick it up and get to mash the way through and have a good time. Like I'm so fascinated by what other decisions are you going to have as far as like is there going to be a story mode situation? Cuz that would be such a slam dunk. There has to be, right? I would hope so, right? Like I think there have been so many strides in story modes and fighting games in the last generation and a half that it would be such a slame dunk to have that. But did Guilty Gear have uh do they do story mode stuff there? Yes, in the more old school traditional way, like little tiny things. Fighters was kind of the same way, right? Fighters had like a",
            "start": 8175.76
        },
        {
            "text": "But did Guilty Gear have uh do they do story mode stuff there? Yes, in the more old school traditional way, like little tiny things. Fighters was kind of the same way, right? Fighters had like a story to it. They had an original character and like a weird story, but I didn't even play much of that because it didn't feel like the like the highlight of the game. Okay. Um but I think here you would be more incentivized to appeal to a western audience as far as what you do do with a story. Like I hope they look at either Tekken and Mortal Kombat and go, \"All right, even if it's short, even if it's a two to three hour thing, like let's have some cutscenes with dialogue and like give you a unique story in the Marvel universe cuz not many people get the chance to do this.\" So, I hope we see that. And also, I'm just very excited to see what this roster is going to be because 4v4 is insane. Um, I don't know if I'm sure there have been fighting games that have done that, but not any of like the",
            "start": 8209.92
        },
        {
            "text": "And also, I'm just very excited to see what this roster is going to be because 4v4 is insane. Um, I don't know if I'm sure there have been fighting games that have done that, but not any of like the big ones that I remember. So with that, you're going to have a large roster of characters. Who are we going to see? You know, throw Black Panther in there. Show throw I don't think we saw Hulk in the trailer. Like throw Hulk in there. Throw everybody. Throw like the Btier characters. Ctier. See a bunch of X-Men. God, it looks good. Um, so yeah, that was the PlayStation State of Play. Uh, I want to get to a couple super chats before we we close out here. Also, though, Bless, one of your predictions, correct? No marathon. No marathon. No marathon at all. No fair games either. Yeah. Does that surprise you? No. Okay. I guess no multiplayer stuff at all. Gotcha. Gotcha. Gotcha. Uh, Alex Fraser says, \"Remember when they said 2023 for Wolverine and that felt like a distant future?\" That's wild.",
            "start": 8251.52
        },
        {
            "text": "you? No. Okay. I guess no multiplayer stuff at all. Gotcha. Gotcha. Gotcha. Uh, Alex Fraser says, \"Remember when they said 2023 for Wolverine and that felt like a distant future?\" That's wild. Is that what they said? They never said 2023 for Wolverine. Well, 2023 did feel like a far away title. Yeah, that was Yeah, that was when El I'm going to I'm going to bring up the OG teaser. See? Uh, let me see. No year on that teaser. 2022, right? Did the trailer come out in 2020? No, that was like 2021 was the PlayStation the PlayStation showcase where Wolverine showed up now. See, that's [ __ ] crazy. That's even crazy. You say that and that sounds crazy. Yeah, but like Dustin King says 10 out of 10 show Neo3. Let's [ __ ] go. Neo2 is truly an incredible game and I'm so excited for them to get back to their excellence and a demo today. Incredible. You don't even know. Uh, Bam says 10 out of 10. It's Marvel, baby. Not by Capcom. It's Marvel, baby. So good, man. Come on. I need God. If they",
            "start": 8291.68
        },
        {
            "text": "back to their excellence and a demo today. Incredible. You don't even know. Uh, Bam says 10 out of 10. It's Marvel, baby. Not by Capcom. It's Marvel, baby. So good, man. Come on. I need God. If they announce a Capcom fighting game that's all the Capcom characters, it's gonna be hype as [ __ ] See, because now I'm like, \"What license can they get?\" Hit up DC. Be like, \"Yo, let us Oh my god. Oh my god. DC versus DC versus Capcom will be such a good clap after this breakup. Capcom's going to be posting non-stop on Instagram like how great their life is. I'm so healthy now. God, that's so funny.\" Um, Hannah Barbara versus Capcom. Just going out with anybody. Christopher Holland says, \"That state of play was garbanzo beans with a little smiley poop emoji.\" Uh, Bonus Prime says, \"Eight out of 10. Well-rated show. Nothing huge, nothing offensive.\" Uh, Lil Wade says 8 out of 10 only because of Neo3. Best Souls born in my opinion. Let's go. Um, Guitar Hero Arrow says, \"Mom shot myself at",
            "start": 8337.92
        },
        {
            "text": "of 10. Well-rated show. Nothing huge, nothing offensive.\" Uh, Lil Wade says 8 out of 10 only because of Neo3. Best Souls born in my opinion. Let's go. Um, Guitar Hero Arrow says, \"Mom shot myself at Creative Business 3 business unit 3. Thinking it was a Final Fantasy 16 spin-off or something. Excited to play Tactics though.\" Yeah, I'm right there. I'm excited the tactics is being made uh remade that logo. We're showing that logo. I was like, \"Oh, [ __ ] man.\" Um yeah, there we go everyone. Guess what? The day is not over though. It is for now, but we will be back in just a few short hours kicking off our Switch 2 launch party. I am very, very excited to play some Mario Kart. Uh so, thank you for hanging out with us all day and all night tonight and all day again tomorrow and just over and over and over till the end of time. So much fun stuff to do. Until next time, I'm go get some Taco Bell. Bye. [Music]",
            "start": 8386.32
        }
    ]
}