{
    "id": 14219,
    "video_id": "Y0tJDxQ0OIU",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Greg Miller",
        "Blessing Adeoye Jr."
    ],
    "title": "James Bond Game '007 First Light' Reveal is COMING - Kinda Funny Games Daily 06.02.25",
    "description": "Go to http://kindafunny.com/XREAL to grab yours now!\n\nWe’re here to talk about video game news!\n\nWe’re throwing a SWITCH 2 LAUNCH PARTY\n - This Wednesday going into Thursday morning, tune in as we pickup, unbox, and play our Switch 2's for the very first time!\nToday after, KFGD, you’ll get:\n - GAMESCAST - Final SGF Predictions\n - After Gamescast is Kinda Funny Podcast\n - Then the STREAM is Elden Ring Nightrein\nIf you’re a Kinda Funny Member:\n - SnowBikeMike GOES BIG with this month's Patreon exclusive poster made by the incredible PandaMusk!\n - Shred the gnar gnar on Patreon before the month ends!\n\nTime Stamps:\n00:00:00 - Start\n00:09:56 - Housekeeping\n        -  The Roper Report   -\n00:16:56 - James Bond Game From Hitman Dev Has a New Title, 007 First Light, Official Reveal This Week\n00:34:16 - The Witcher 4's Unreal Engine 5 In-Game Features and Technology Set to Be Revealed Tomorrow\n00:40:41 - Hi-Fi Rush Dev Tango Gameworks 'Remains Dedicated to Distinctive and New IPs,' as It Starts Hiring for New Action Game\n00:47:35 - Wizards of the Coast signs publishing agreement with Giant Skull\n00:52:06 - Wee News!\n00:57:03 - SuperChats & You‘re Wrong\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1748888283,
    "duration": 4082,
    "transcript_chunks": [
        {
            "text": "Today in the nerdy news you need to know about IO's James Bond game has an official title. We are going to see more of The Witcher 4 tomorrow and hi-fi Russia's studio is hiring for a new action game. We'll have all this and more because this is kind of funny games daily. [Music] What's up everybody? Welcome to kind of funny games daily for Monday, June 2nd, 2025, Nintendo Switch 2 launch week, summer gamefest week. Oh, what a week. I'm one of your hosts, Greg Miller, alongside Forbes 30 under 30, aka New York Game Awards nominated aka Perry Poppy. Blessing Addy Oay Jr., I have to acknowledge the fact that you're still using this coffee cup that you got from the Nintendo store. That's correct. And I looked inside it expecting to see regular coffee and I'm surprised to see that you have ice cubes in this thing. You're drinking ice coffee out of a regular coffee mug. Well, as you know, in our Hit Games cast where we went through the Nintendo store and talked about it and did all that",
            "start": 6.48
        },
        {
            "text": "ice cubes in this thing. You're drinking ice coffee out of a regular coffee mug. Well, as you know, in our Hit Games cast where we went through the Nintendo store and talked about it and did all that stuff and we went through all our purchases, I said, \"I bought this coffee cup cuz it's cute and I like it. Obviously, I like the roost. I like Animal Crossing. You know that.\" Um, and that I was going to have it be my coffee cup. But then it's just getting hotter now. You know what I mean? It's summer time and so I like a good iced coffee, especially I did 20 minutes, 21 technically in the car today for Gregway. And so I got it parched and so I want the liquids in me quicker. So I need I cool it down. So yeah, I've been putting the iced coffee in there. I'll be putting the I'm not used to seeing Yeah. ice cubes in a coffee cup. I hear you again. I'm just committed to it cuz well then I'd be using a glass and I got the Pedro glass for my water now. Like I got my I got my setup here. Wait,",
            "start": 68.56
        },
        {
            "text": "Yeah. ice cubes in a coffee cup. I hear you again. I'm just committed to it cuz well then I'd be using a glass and I got the Pedro glass for my water now. Like I got my I got my setup here. Wait, where did this Pedro glass come from? Uh Mil Valley Pasta. For some reason he had them. So I was like when I put them on Instagram story I'm like you saved me one and it sat in the shop for weeks until I actually made it there. But I got there and now I have a Pedro Pascal cup. How you doing? How's your weekend? Uh I am excellent. My weekend was good. It was a good family weekend. Nice. All right. You know what I mean? So we went to the beach. took Benny out for ice cream. He woke up from his nap. We were there. We got home. I made him watch the Superman trailer again. And then I gave him all the Superman toys I had bought and been hiding. So like a big Hopefully you're incepting him right now. Exactly. 100%. But part of it was, of course, let's have a great family weekend so I can ignore",
            "start": 102.88
        },
        {
            "text": "the Superman toys I had bought and been hiding. So like a big Hopefully you're incepting him right now. Exactly. 100%. But part of it was, of course, let's have a great family weekend so I can ignore these [ __ ] the rest of this week. We got SGF. We got uh Nintendo Switch, too. We got bonkers coverage and plans over here. It's time to get serious. It's E3 week. It feels like that. It does, which has me very excited. Um, what I did over the weekend was play a bunch of games. Kind of like trying to dive into my backlog. It's funny cuz I went this weekend I played um, Hollow Night. I actually started that on my trip on my Steam Deck to my trip to LA last week. And I think I haven't seen you in a while. You've been off there doing even you went to LA. You did all stuff. You I haven't done been on shows. I feel like the last like three to four weeks I've been in LA every single week. Yeah. And yeah, I feel like I've not I've just not been on shows as much as I usually am. But that has",
            "start": 135.92
        },
        {
            "text": "been on shows. I feel like the last like three to four weeks I've been in LA every single week. Yeah. And yeah, I feel like I've not I've just not been on shows as much as I usually am. But that has given me time to like just be on my Steam Deck and play different things. And so yeah, I've been uh playing Hollow Knight. I started playing HalfLife over the weekend. I also played the demo for Dispatch when I was I want to hear about that. Yeah. Yeah. I saw of course you you've made your return to streaming. I see you over there on twitch.tv/blessing junior. Yeah. I'm trying to like stream a bit more consistently. So as an excuse essentially to like dive into my backlog cuz we've had this top 100 game things that the thing that we've been preparing for. And funny enough, we've already submitted our list now. Um, but for some reason after submitting the list, I was like, \"All right, now I'm going to play the games that I was actually gonna [ __ ] try and play for this list.\" And so, yeah,",
            "start": 174.96
        },
        {
            "text": "our list now. Um, but for some reason after submitting the list, I was like, \"All right, now I'm going to play the games that I was actually gonna [ __ ] try and play for this list.\" And so, yeah, I've been going through these games. Um, but yes, during the weekend I picked up Dispatch and I played the demo. Have you gotten to check out the demo yet? No, I have not. Yeah, that dropped uh late last week into this weekend. I know. And so I'm already sold on it. I saw you come to the realization that it's a management thing. Like that's the whole hook, right? Is like Aaron Paul's the character you're playing as. He can't be a hero. So, he's behind the desk dispatching uh the heroes to go out and do things. Yeah. And I don't know how It's funny. I rewatched the trailer after I played the demo. And I played the demo a second time. I played this demo twice because the first time in playing it, I start the demo and I'm in the cut scenes and I'm like watching the story play out and I'm like,",
            "start": 209.36
        },
        {
            "text": "And I played the demo a second time. I played this demo twice because the first time in playing it, I start the demo and I'm in the cut scenes and I'm like watching the story play out and I'm like, \"Oh, this is [ __ ] awesome. The the animation quality is so good. Like, this game is has such good presentation. I'm I want to just watch this this show or this game as like a Netflix show or as an Amazon show the way I do Invincible.\" Yeah. Um, the choices feel very tale and I like the writing. I like the characters. Like this world has personality to it. And then they threw me into this management sim where it is all right. You have eight heroes that are essentially like suicide suicide squad style. Like you know they're criminals but they're now enlisted as heroes but they're also kind of bad people but like you know they're trying to make a do a good thing, right? So you have these heroes that are like Ztier essentially that you're sending out on these different missions uh because",
            "start": 245.36
        },
        {
            "text": "bad people but like you know they're trying to make a do a good thing, right? So you have these heroes that are like Ztier essentially that you're sending out on these different missions uh because you're looking at this map of the city and then you have like different things happen that pop up. So like you'll get an exclamation point that you'll hover over and it's like all right I my son's balloon got stuck in a tree. Can you send somebody that can get a balloon out of a tree and then also somebody that's not going to scare children or you'll get a different thing that's like all right there's a bank that's being robbed. can you send somebody that can deal with maybe that that might have stealth for a hostage situation or might have like the strength to deal with like you know robbers or whatever it is and you're looking at your roster of heroes and having to figure out like all right who's right to send all right this person is now resting because I just sent them on another",
            "start": 286.8
        },
        {
            "text": "or whatever it is and you're looking at your roster of heroes and having to figure out like all right who's right to send all right this person is now resting because I just sent them on another mission and so now I got to look at the remaining people that I have on my list and like having to balance all these heroes and then also having another layer of being able to level up the heroes as you go way different from what I thought it was going to be. I thought it was gonna be straight up just a tail game. Make choices. Yeah. Yeah. Yeah. Um and like the management stuff is in there in the trailer, but I think I just thought it was going to be miniame type stuff and it seems like this is actually a good portion of what you're doing during the game. And I was very surprised. I came out of that out of the first demo playthrough cuz it's like a 30-minute demo. It's not that long. Came out of the first one being like, \"Oh, that was different than what I thought this game was. I don't know.\"",
            "start": 326.32
        },
        {
            "text": "out of the first demo playthrough cuz it's like a 30-minute demo. It's not that long. Came out of the first one being like, \"Oh, that was different than what I thought this game was. I don't know.\" And then I played it again. I was like, \"Oh, this is [ __ ] awesome. It's got the sauce. It's got the I'm even more excited now for this game.\" And so shout out. Did you do it on Steam Deck or do you is it deck? No, I just played it on my computer. I don't know if it's deck compatible. Do you I mean did it How much mouse movement is there? Um I believe you can play with a controller, but I mean it it seems like one of those games that'll be easier with a mouse. Obviously we're not going to do that, you know. No, you should check it out. Oh yeah, 100%. No. Dispatch is high on my list of anticipated stuff for this year. Yeah, for sure. Yeah, I you know, the demo just kind of snuck up on me and then I've been playing a different game. Oh, Fantasy Life Eye. Oh, the girl who steals time. All",
            "start": 360.24
        },
        {
            "text": "stuff for this year. Yeah, for sure. Yeah, I you know, the demo just kind of snuck up on me and then I've been playing a different game. Oh, Fantasy Life Eye. Oh, the girl who steals time. All right. Oh, there's a 21minute Greg uh review in progress as your Greg way today. So, you can get on that uh once Cool Greg gets it uploaded and see about that. But that's what I've been tinkering with. Yeah. A lot of games happening. There are a lot of games, too many games would say. You know what I mean? Yeah. Yeah. Yeah. I think that's the that was the motto from yet last week for me of like, all right, there's just way too much happening here. And then for people to come out and say, \"Fantasy life eyes your kind of game, Greg.\" We watched the trailer like I don't know about that. Can you give me like what your 21 minute Gregway is in like two words? This game, this game has so many [ __ ] systems layered on top of each other. Bear, if you toss up a trailer, I can tell you a little bit more",
            "start": 393.92
        },
        {
            "text": "like what your 21 minute Gregway is in like two words? This game, this game has so many [ __ ] systems layered on top of each other. Bear, if you toss up a trailer, I can tell you a little bit more about fantasy life. I, the girl who steals time. Uh, it was this idea that uh last week I Well, we've reacted to the trailer before. It's been in presentations. And then last week, somebody was like, \"Greg, you you like Animal Crossing, but this is way better than Animal Crossing. There's more to it.\" And then we watched this trailer and I said, \"This looks like a game that's doing a bunch of stuff and not getting any of it 100% right. It looks like a jack of all trades, masters of none, right? If you're an audio listener going for it. Yeah. Master 14 unique lives. These are jobs you can have as you run around. It's like I I I gave a literal I'm, you know, a little more than 5 hours in right now. I gave a literal verbatim here's the story so far kind of thing. And it sounds like when Ben",
            "start": 428.72
        },
        {
            "text": "as you run around. It's like I I I gave a literal I'm, you know, a little more than 5 hours in right now. I gave a literal verbatim here's the story so far kind of thing. And it sounds like when Ben tells me a story cuz it's so well you're doing this, you're doing that and then you go time it and then like last night at the 5 hour mark is finally when it was like all right, here's Animal Crossing. Like everything else has been not at all build a town, do this thing. I'm shocked cuz we're watching the trailer and I'm shocked by how much combat I'm seeing. There's a lot of combat. Yeah, if you want there to be. There's a lot of tree stuff in there. So, I'm very I I am enjoying my time with it. I'm excited for more. Uh I talked a little bit just tip of the sword um on uh uh Friday's show with Steen Tatillo about it, right? That I think one of the things I I think that it's awesome they're getting right uh because this is a level five game, right? Available right now on PC uh Switch One,",
            "start": 466.8
        },
        {
            "text": "Steen Tatillo about it, right? That I think one of the things I I think that it's awesome they're getting right uh because this is a level five game, right? Available right now on PC uh Switch One, PS5, Xbox. It'll be a switch to enhanced edition or whatever come this week or maybe a standalone. But what I think is really interesting about it is that they are crossplatform save. So, oh, when I get I think what's going to give it even more legs for me is that Thursday get the Switch 2 and want to try as much new stuff as we can on it, but how many new games are there to actually try out, right? And the fact that I can download this and then kick my save over from PC and see how it runs in Switch 2 and do all that I'm pretty stoked for. Oh, yeah. So, you're into it? I am. Yeah. Yeah. Yeah. It's that thing of, you know, when I kind of talk [ __ ] about it when we watched this the trailer last time around, somebody BSed me and they were like, \"Hey, like I hear you, but I'm 20 hours in and",
            "start": 507.36
        },
        {
            "text": "that thing of, you know, when I kind of talk [ __ ] about it when we watched this the trailer last time around, somebody BSed me and they were like, \"Hey, like I hear you, but I'm 20 hours in and the game's ridicul. I'm I'm still my head's still swimming.\" I was like, \"All right, that can't be the case.\" And then for like the people, they keep adding more characters. They keep adding more systems. They keep adding more things that I should be doing or not doing. And it's like I don't know at what point we're find because like they pitch it as like, \"Oh, it's a cozy slow life sim RPG.\" So, like they're pitching it like Animal Crossing. So, eventually I know the training wheels are going to fall away and be like, \"All right, what do you want to do? Would you just want to cook food and sell it? Or do you want to go fight these monsters? Or do you want to chase the thing where you can go back in time a thousand years and come forward a th I don't know what the [ __ ] going on, but that's",
            "start": 544.32
        },
        {
            "text": "it? Or do you want to go fight these monsters? Or do you want to chase the thing where you can go back in time a thousand years and come forward a th I don't know what the [ __ ] going on, but that's awesome.\" Yeah. So, I'm looking forward to playing more of that and seeing what that's all about. Cool. But for now, I'm excited to talk about the news. Yeah. I'm really excited for this because this is Kind of Funny Games Daily. Each and every weekday on a variety of platforms, we run you through the nerdy video game news need to know about live on twitch.tv/kindfunn. TV/kindfunnyames, youtube.com/kindfunnygames, and podcast services around the globe. If you like that, we'd love you to pick up a kind of funny membership. Of course, $10 a month gets you all of our content ad free. That's more than 80 episodes of content a month. And of course, it would get you your daily me, Greg Miller, where I talk about whatever I want to talk about in my car. I usually answer your questions, sometimes",
            "start": 581.2
        },
        {
            "text": "than 80 episodes of content a month. And of course, it would get you your daily me, Greg Miller, where I talk about whatever I want to talk about in my car. I usually answer your questions, sometimes review games, uh, of course, for 15 to 20 minutes each and every weekday, adding up to four hours of exclusive podcasting each and every month. However, if you have no bucks toss away, no big deal. Like, subscribe, share, click the follow button. If you have Amazon Prime, you have Twitch Prime, give us that free subscription that expires each and every 30 days. And of course, to be part of the show live as we record it, youtube.com/kindfunnygames with your super chats, you can get in here and talk about the news or just talk. A lot of people are talking about this. Parker Reel says, \"Will Greg be doing his championship parade in July? The MS and I are heading to on an SF trip and need the deets. Uh I as I have confirmed I will be talking the details of my game showdown championship parade",
            "start": 616.56
        },
        {
            "text": "be doing his championship parade in July? The MS and I are heading to on an SF trip and need the deets. Uh I as I have confirmed I will be talking the details of my game showdown championship parade on Nintendo Switch today when we're streaming live. I figured two big news announcements. Chocolate and peanut butter coming together. Why do you do this? I will confirm it is not in July. It is going to be in June. Um Oh, that's soon. Oh, very soon. Sooner than you think. That's scary. Actually, you've missed a few meetings. Oh god, I missed a few. I've been gone for three meetings. You do ask what did I miss in the meeting and I usually tell you the important stuff. I forgot about my big important meeting. Uh Besa Bran says, \"My everyday coffee is shaken iced coffee.\" There you go. Good for you. All right. Uh and then there's more stuff coming up, but we'll get there as we get there. Uh remember, of course, some housekeeping. We are an 11 person small business all about live talk shows.",
            "start": 655.04
        },
        {
            "text": "you. All right. Uh and then there's more stuff coming up, but we'll get there as we get there. Uh remember, of course, some housekeeping. We are an 11 person small business all about live talk shows. And as I already told you, it is a humongous week for us and the industry. Uh first things first, we are throwing a Nintendo Switch 2 launch party and you are invited this Wednesday. going into Thursday morning. Tune as we tune in as we pick up, unbox, and play our Switch twos for the very first time. Uh details a bit wishy-washy on this. We're either going to go live just before 8, maybe just before 900 p.m. here, West Coast, West Coast time. Uh we will have people in the studio, Mike and Roger, going live while others will be out in the world securing switches. Uh at 9:00 p.m., of course, the the midnight for here on the West Coast. We will get it. We will bring it all the way back here to the office. We will unbox it. We will play it. And at some point, others of us will go home and go",
            "start": 696.4
        },
        {
            "text": "the midnight for here on the West Coast. We will get it. We will bring it all the way back here to the office. We will unbox it. We will play it. And at some point, others of us will go home and go to bed. Stella, uh, Stella's in the chat. Hi, Stella. Uh, Mike and Roger will stay awake all night long playing the Nintendo Switch 2 for your amusement, seeing what's going on with Mario Kart. Uh, that will roll right in, uh, to kind of funny games daily. And then, of course, uh, we will give you the news you need to know about before playing more Switch 2, before reacting to SGF, of course. Or that's Friday, I guess, but we're playing all day, doing live thing. SGF on Friday. Hey, it's a crazy week, but what you need to know is you can stay up with us all night long and that uh that all night long stream will just be Twitch exclusive just because uh we don't the way marathon streams are handled. Yeah, you'll have to check it on Twitch. Are we trying to upload to YouTube later? I assume we",
            "start": 741.28
        },
        {
            "text": "long stream will just be Twitch exclusive just because uh we don't the way marathon streams are handled. Yeah, you'll have to check it on Twitch. Are we trying to upload to YouTube later? I assume we usually do that. We'll talk about Yeah, we'll see what the vibes are if if it's worth if it's worth putting up and stuff. Um and then yeah, games daily uh that Thursday morning and then that'll I think go right into just game like us playing. Yeah, the plan is that then we will go from Games Daily straight into playing more Switch 2 and then when we feel we've got our heads wrapped around it, we'll do a live games cast on the same setup while we play more stuff of what our first impressions are. Barry, I want you to think about something. All right, bear. Start [ __ ] I need you to think about Del. Think about Delta Rune chapter 3 and 4 and how me and you tackle it cuz is that something we stream? Is that something where we kick everybody else off and play it or do we play that on our own",
            "start": 778.72
        },
        {
            "text": "Del. Think about Delta Rune chapter 3 and 4 and how me and you tackle it cuz is that something we stream? Is that something where we kick everybody else off and play it or do we play that on our own time? Or do you guys start playing fantasy life I alongside me? It's multiplayer. You can start your own. Here's the thing. Bless. It's like u you and I love Delta Rune. A very small portion of our audience loved Delta Rune. I don't remember chapters like one and two like the best. I mean, it doesn't matter. And I also think I played that on Steam. And so I don't know if I need to play chapters one and two to play three and four on Twitch. So I just I don't know. And also just like even if we did just stream chapters 3, like is that good streaming content, you know? I mean, it could be at 3:00 a.m., you know what I mean? Like, I'm saying I'm not staying overnight, but like we wake up, you know what I mean? We go home, we fall asleep at 7:00 p.m., we wake up at 3 cuz we know that like, all",
            "start": 816.32
        },
        {
            "text": "a.m., you know what I mean? Like, I'm saying I'm not staying overnight, but like we wake up, you know what I mean? We go home, we fall asleep at 7:00 p.m., we wake up at 3 cuz we know that like, all right, cool. Who the [ __ ] is watching? Me and you show up and we live our Delta Rune best. I like that a lot. Just think about it. I'll think about it. Just think about it. I'll think about it. I'll think about maybe alternate ways that might be better to cover Delta Rune as well. Fair enough. Fair enough. Uh remember, uh today after kind of funny games daily, you're going to get the games cast. It is our final SGF predictions as we prepare for Jeff's show on Friday. Uh after Games Cast is going to be a kind of funny podcast where we will celebrate the fact that we won the Tomorrow War. That's right. We made a trend everybody. That's all you need to know. I miss so much. And then your stream's going to be more Elden Ring Night Rain. Uh if you're a kind of funny member, Snowike Mike goes",
            "start": 860.48
        },
        {
            "text": "right. We made a trend everybody. That's all you need to know. I miss so much. And then your stream's going to be more Elden Ring Night Rain. Uh if you're a kind of funny member, Snowike Mike goes big this month with the Patreon exclusive poster made by the incredible Panda Musk. Remember, of course, we have uh contracted Pandamusk to give you 12 amazing posters at kind of funny.com/premium. Of course, uh every month on Patreon, we have a special tier where you get a physical item. This month is this amazing snow bike mic poster that I just love. I love this. It's fantastic. What is this pulling for? Like what's the That's a snow bike. He loves snow bikes. I'm thinking more of like the art style. Like what is this pulling from? What is this inspired by? artist. See, what I look what I see is snow bike part. What's the game? Thank goodness you're here. I feel like that's what I get when I look at this. Yeah, I kind of see that. I can see that. Yeah, that is a good question though. What",
            "start": 895.6
        },
        {
            "text": "is snow bike part. What's the game? Thank goodness you're here. I feel like that's what I get when I look at this. Yeah, I kind of see that. I can see that. Yeah, that is a good question though. What is the What is the inspiration there? Cuz there it is tickling something in my brain as well. We're all tasked with giving kind of a mood board vibe. Yeah. For our uh respective posters. So, I just wonder I just wonder what Mike pulled from. Huh. Like it seems like one of those Adult Swim cartoons that's on at like 8:00 p.m. not like midnight. You know what I mean? Like they know the kids are still watching so they kind of keep it cute. Yeah. Like an early adult swim kind of thing. Sure. Yeah. Uh and then of course my Greg Way like I said is 20 minutes of my review so far of Fantasy Life. I the girl who steals time. Thank you to our Patreon producers Carl Jacobs a mega Buster and Delaney Twining. Today we're brought to you by XRE. We'll tell you about that later. For now, let's begin the",
            "start": 942.08
        },
        {
            "text": "girl who steals time. Thank you to our Patreon producers Carl Jacobs a mega Buster and Delaney Twining. Today we're brought to you by XRE. We'll tell you about that later. For now, let's begin the show with what is and forever will be the Roper Report. Time for some news. Five items on the Roper Report. A baker does it. Number one, James Bond game from Hitman Dev has a new title, 007 First Light. Official reveal this week. This is Rebecca Valentine at.com. Finally, more than 5 years after its announcement, we're about to get our first real look at IO Interactive's new James Bond game. Initially teased as Project 007, the official title is 007 First Light and is set for reveal sometime this week. In a post to Twitter/X Today, developer IO Interactive showed a still image of a of presumably James Bond in a silhouette lit faintly by a single beam of light. the text reading first light 007 and game reveal this week. It included a hashtag earn the number likely a reference to the fact the",
            "start": 985.28
        },
        {
            "text": "James Bond in a silhouette lit faintly by a single beam of light. the text reading first light 007 and game reveal this week. It included a hashtag earn the number likely a reference to the fact the project is an origin story centered around Bon earning his 007 number. The post didn't include any fir further details, but it seems likely we'll see this game at one of the showcases planned for this coming week as a part of summer gamefest. Summer gaming or one of the other gaming events typical for this first week of June. Blessing Addio Jr. Craig Miller 007 First Light. What do we think of the name and do you care? Um, I mean, I care about this project cuz I [ __ ] love IO Interactive and what they've done with Hitman. Um, what do I think of the name? I'm not Oh, no. Well, I'm not sold completely on it yet, but I think it could grow on me. I think at first blush, and this is a me problem, I immediately I immediately think of Infamous First Light. It's all I'm like, \"Oh, that's it.\"",
            "start": 1043.28
        },
        {
            "text": "completely on it yet, but I think it could grow on me. I think at first blush, and this is a me problem, I immediately I immediately think of Infamous First Light. It's all I'm like, \"Oh, that's it.\" Like, it just does a weird thing in my brain that like now when I see that title, I automatically think of that other game. That's going to fade with time. Of course, I'm the I'm probably like one of five people that have that problem. Um, I know. And I'm one of them, too. All right. Nobody's getting away from this. How dare they? How dare they insult Fetch this way and steal the name. It's [ __ ] up. It's real [ __ ] up. Um, I'm excited for whatever for what this reveal looks like. Barrett, if you can bring back up the silhouette, cuz the question I want to throw back at you now. Uhhuh. Is what are they hiding with the silhouette? I know Barrett knows. I I already have a good guess. Do you think Cuz my where my conspiracy brain goes is is there like a an actor that we know? Oh, 100%.",
            "start": 1093.6
        },
        {
            "text": "what are they hiding with the silhouette? I know Barrett knows. I I already have a good guess. Do you think Cuz my where my conspiracy brain goes is is there like a an actor that we know? Oh, 100%. That's why they're covering the face here. Who do you think it is? Josh Beck. Oh my god. Damn. You were [ __ ] ready. You were ready for that. That's [ __ ] awesome. I don't actually think it's going to be Josh Peek. The hair and silhouette reminded me. Let me see him again. Hold on. Cuz can I tell you I'm going to tell you? I'm going to tell you. [ __ ] That could be Josh Beck. I have a prediction. It's one of my SGF predictions. We're doing the SGF predictions right after this. How many of us do you think had a James Bond predict? Because I definitely had a James Bond prediction. I didn't until today where I'm calling the I'm calling the shot here. Okay. But I need this is I'm gonna I don't want this one to be stolen from me. All right. It's going to be Rahul. I was thinking the same. I",
            "start": 1129.84
        },
        {
            "text": "today where I'm calling the I'm calling the shot here. Okay. But I need this is I'm gonna I don't want this one to be stolen from me. All right. It's going to be Rahul. I was thinking the same. I think it's Rahul. And I think they reveal that it's SGF. Does this look like Rahul? I mean, who knows how much the lights playing with it. You know what I mean? A lot of people want to look at this and see a white guy. Let's just call it down the line. You know what I mean? But I think the golden light can play off of skin differently. And I think again that'd be a good swerve. See Vitz Patel. Isn't this dude white? I don't know. Is it? It's a silhouette. Vitz, do you want to [ __ ] you know Vitz over here sees a silhouette ready to go to the cops and say he knows who the man is? Well, I I mean for me that's like another thing with the silhouette, right? Even if it's an actor, even if it's not like a recognizable actor that we know that's being revealed for the role, I think even if it is",
            "start": 1181.6
        },
        {
            "text": "for me that's like another thing with the silhouette, right? Even if it's an actor, even if it's not like a recognizable actor that we know that's being revealed for the role, I think even if it is just a a James Bond that we haven't seen before, whether it is somebody of a different scale skin color or somebody that just looks different than, you know, Daniel Craig or like the um Pierce Broden or like the James Bonds that we know, I think that enough is exciting enough to like, you know, keep the character as part of the reveal. Have the charact like have the character look be a part of the oh man. The official press release they gave said and I mean this isn't giving much right but it's like the official press release I got today from 47. The reveal will give a world premiere look at 007 first light featuring never-before-seen footage to start a new era for James Bond in video games. I love that. Is New Era doing a lot of heavy lifting in my mind? Of course it per it could just be a",
            "start": 1219.68
        },
        {
            "text": "first light featuring never-before-seen footage to start a new era for James Bond in video games. I love that. Is New Era doing a lot of heavy lifting in my mind? Of course it per it could just be a [ __ ] white guy and it would still be a new era of 007 video games. But I like the idea that IO is sitting there doing saying like you know what we're going to do the thing that the movies aren't. movies. Everybody wants them to shake up the not everybody, a lot of people want them to shake up Bond, you know, maybe do a gender swap, maybe do a race swap, do whatever. If they're not going to be a part of it, maybe we could do that and stand out that way. And then also definitively set ourselves away from Nobody's going to glance at Rahul on the cover and be like, \"Oh, is this tied into the movie?\" or something like that, you know, or hear me out. Okay, Josh Peek. I think you're really hot with the Josh Peek button. I'm glad we built it for the words new era. I love I love those words so",
            "start": 1253.92
        },
        {
            "text": "or something like that, you know, or hear me out. Okay, Josh Peek. I think you're really hot with the Josh Peek button. I'm glad we built it for the words new era. I love I love those words so much for describing this because I think that comes with a lot of things is what you're talking about as far as being able to define what IO Interactives James Bond is. But I think with that I for me era implies franchise that implies series that implies 100% it does we just don't we don't want to be one and done with this. We want to like carry the flag for what this version of James Bond is going to be for the foreseeable future for us. And I think that when you think of previous eras of James Bond, they have always, I won't say, but most of the time have been connected to a movie actor. They've either been you're playing as the Pierce Brosman one or you're playing as the Daniel Craig one, right? Like I think there have been a rare times where you're playing as an original James Bond. I think",
            "start": 1293.36
        },
        {
            "text": "been you're playing as the Pierce Brosman one or you're playing as the Daniel Craig one, right? Like I think there have been a rare times where you're playing as an original James Bond. I think there was like a Wii one where you're like going through the different areas. Yeah, that's what I was thinking. Wasn't there something there? I'm not a James Bond guy. So yeah, that was like the one I think where you're like the one James Bond game they made where you're playing as an original um Bond. But here if you are as IO interactive making the IO bond I think with that that comes with a lot of like things you need to do because then you kind of have to create your own not your own universe but I guess your own story your own like line of this is what this bond is this is what this bond is doing and so like and that could even um flow back into gameplay as far as like you're used to getting the first person games for the most part there have been some third person right but like for what",
            "start": 1341.28
        },
        {
            "text": "and so like and that could even um flow back into gameplay as far as like you're used to getting the first person games for the most part there have been some third person right but like for what we know IO to be doing with Hitman, right? Like you're going to redefine a lot of what it means to even play as James Bond itself. Barrett, before you jump in, I just want to say super chats getting your predictions for who this is or if you even give a [ __ ] Back to you, Barrett. I got it. Face scan. They're going to face scan you in. You are Bond. That would be awful. God, that would be terrible. Can you imagine? The cut scenes are like it's all like polygonal like what's worse that or Josh. It's funny cuz like out of all the places where technology has advanced, I feel like face recognition for like video game cameras is the one thing that's like never come around. I' I've been seeing like a lot of Google VO on Tik Tok. You know, like the AI stuff, it's [ __ ] ridiculous how good it is.",
            "start": 1378.88
        },
        {
            "text": "for like video game cameras is the one thing that's like never come around. I' I've been seeing like a lot of Google VO on Tik Tok. You know, like the AI stuff, it's [ __ ] ridiculous how good it is. Like how like impressive it is technically. We've made so many strides, but the camera [ __ ] for video games is not taken one step out there. I already have a bunch popping in. All right. Uh Cody super chats in and says, \"Richard Madden is that silhouette I'm calling it. Richard Madden. If you're not familiar with Richard Madden, he is one of the Game of Thrones people. Now, I I've gone as far as I can with that because I don't love Game of Thrones. I know he's a Game of Thrones person. If I thought I had Game of Thrones guy and if I Rob Stark, thank you. If I had the work ethic, I would have came in an hour early and made like a bracket full of actors like who is this? Well, I think and this is where it gets interesting now. I'm Let's put Let's put down our swords. Let's put down our",
            "start": 1422.88
        },
        {
            "text": "came in an hour early and made like a bracket full of actors like who is this? Well, I think and this is where it gets interesting now. I'm Let's put Let's put down our swords. Let's put down our torches. Let's get Okay. Mhm. As everybody knows, I'm not the foremost authority on British history or British culture. All right, so we just said it. All right, I did watch 28 Days Later and 28 Weeks Later this weekend. Of you know how much I love those films. All right, but for Richard Madden, the immediately underneath it, everybody stay with me on Google it says Scottish actor. Are we What? This is again I don't know what I'm talking about. Full stop. I'm not trying to offend anybody. Isn't it like does 007 have to be mainland British? Because I know Scottish people are very much like I'm [ __ ] Scottish, right? Again, 20 weeks later, uh Killian Murphy, right, is Irish and like he won't shake the he like mean mugs the royalty when they come to the premieres and I [ __ ] love it. Right.",
            "start": 1461.92
        },
        {
            "text": "Scottish, right? Again, 20 weeks later, uh Killian Murphy, right, is Irish and like he won't shake the he like mean mugs the royalty when they come to the premieres and I [ __ ] love it. Right. And like some interviewer one time was like, \"Oh, you're [ __ ] uh British.\" He's like, \"No, I'm not. I'm Irish.\" He's like British. And they got a huge [ __ ] fight about it. Like I know that there's stuff going on over there. Well, like you can portray that character, right? Chat's quick to point out Sean Connory is uh Scottish. Okay, great. Thank you. Yeah, and if you're going to go Scottish, you could just go all the way even more west. Broahan is Irish. Somebody says and then yeah, Josh back. Well, I mean the amount of people who shouted out it looks like Jack Quaid in the silhouette. Bring back up the I don't see any of these. Honestly, you want to know what I see? I don't think I don't think IO I don't think is going that out of pocket. Like we're doing our own game and he's American.",
            "start": 1511.76
        },
        {
            "text": "back up the I don't see any of these. Honestly, you want to know what I see? I don't think I don't think IO I don't think is going that out of pocket. Like we're doing our own game and he's American. What's [ __ ] Thor's actor's name? Yeah, I see Hemsworth here and I know this isn't Hemsworth, but like that's when I see the silhouette, that's the only person who I can like fit in it and I know it's not it. So like I think maybe the silhouette is just here to throw us off. I can see when we get the final actor, they look nothing like what if this is actually the villain. Oh [ __ ] Bar that'd be awesome. And they make the bear they make the Barrett. They make the the entire trailer opens and it's just like famous. You know what? Video game level famous. Yeah. Actor is there and whatever. and he's this white guy with a gun. It turns out he's the bad guy and Rahul kills him. Benar, when is Benstar gonna be a bad guy? He's too nice and he's not intimidating. He's sexy. There's a",
            "start": 1545.52
        },
        {
            "text": "and he's this white guy with a gun. It turns out he's the bad guy and Rahul kills him. Benar, when is Benstar gonna be a bad guy? He's too nice and he's not intimidating. He's sexy. There's a difference. He No, he's But like I think he could turn it. I think like Sepharoth is a bad guy, but also sexy. Yeah, that's what I was going to say. I feel like Ben Star could portray a Sephro if you wanted to. Yeah. Don't put him in a corner, Greg. I did though. Don't put baby right there. I'm excited to see whoever this is. I mean, do you think it could be Benar? I mean, it could be anybody. Yeah, they could easily I mean, we're going off of a silhouette and want to jump and do that. It could be Ben Star. Ben Star is having quite the But I feel like Raul is our like the pick. Like Rahul is like who we're like, \"Oh, we could see him playing a James Bond.\" Which I could also see Ben Star playing a James Bond, but like I feel like he's too nice. Ben Star would shoot me. Is James Bond mean? He's",
            "start": 1587.92
        },
        {
            "text": "we're like, \"Oh, we could see him playing a James Bond.\" Which I could also see Ben Star playing a James Bond, but like I feel like he's too nice. Ben Star would shoot me. Is James Bond mean? He's the When I I don't associate James Bond. Listen, I just saw a clip of James Bond on Reddit today. Out of context, he looked pretty mean. He shot a guy in the leg and set him bond up with Do you want know what it is? It's the fact that Benar is also funny. Like he's a good-looking man, but he's also funny and we've allowed the funniness to good looking but I can't make a joke to save life. I [ __ ] hate talking to him. I saw him like trying to dunk on more and like I was you see this been making fun of his from software and I was like I don't know man the punch line isn't there. You need Alana to elevate to elevate the humor. You know what I mean? It's [ __ ] up. Y'all need to get further into exped or no bless you finished expedition 33, right? I think like Ben has that side of him for sure.",
            "start": 1628.24
        },
        {
            "text": "elevate to elevate the humor. You know what I mean? It's [ __ ] up. Y'all need to get further into exped or no bless you finished expedition 33, right? I think like Ben has that side of him for sure. I'm just saying I agree with that. Yeah. Uh Joshua Mitchell super chat and says, \"I want Rahul to be the silhouette I'm sorry. I want Rahul, but the silhouette is kind of giving Arthur Darville uh when he was Rip Hunter in Legends of Tomorrow.\" And until we got to the very end there, I was lost. What the [ __ ] were I made up? Now I'm with you. Those are all made up of words until Legends of Tomorrow, which I know you knew way too. Oh, that's Arrow. You knew way too much about Arrow. Yeah, Legends of Tomorrow is where I stopped. Oh, this is what we're crediting him for is Legends of Tomorrow. Rip Hunter was great. [ __ ] Damn it. Speaking of Doctor Who, I was thinking about the re most recent doctor um Gatwa. That's obviously not his silhouette, but I was like, I would have loved to see",
            "start": 1664.16
        },
        {
            "text": "Rip Hunter was great. [ __ ] Damn it. Speaking of Doctor Who, I was thinking about the re most recent doctor um Gatwa. That's obviously not his silhouette, but I was like, I would have loved to see him portray a James Bond possibly. Can I see the silhouette now that I've looked at Arthur Darville? His name is Rory from Doctor Who. I just gave the Doctor Who mind to everybody. Well, he's not the doctor. He's like one of the companions. That's what he's known for. I could see it. I could see it. Yeah, you can fit that in there. Uh, and then Dan says, \"Do you think we'll be able to create our own James Bond?\" Uh, if so, can't wait to see what freakish Bonds people make. I hope not. Face skin. I don't think James Bond is the kind of character that you like let people create a character for. Yeah, I agree. Especially with the the merch and marketing you're going to want to put behind this. I would think you'd want it you'd want to craft something on your own and for the opportunity that",
            "start": 1709.68
        },
        {
            "text": "Yeah, I agree. Especially with the the merch and marketing you're going to want to put behind this. I would think you'd want it you'd want to craft something on your own and for the opportunity that you have as I interact actor to set yourself apart for like storytelling and what you want to do with that, right? Like not that you can't ob obviously you can tell amazing stories with original characters, but I think there's something different for when you have a recognizable all right James Bond. we can tell our James Bond story here. Like I think that's the one thing that was missing from Hitman is obviously Agent 47 recognizable, iconic, all these things. And those games had stories, but those the story was the far far from like the great thing that people loved about the Hitman like recent games, right? It is the gameplay, it is the stealth, it is like the amount of variety that you have and how you can play those games. I think this is IO's chance to have that plus a really good",
            "start": 1750.56
        },
        {
            "text": "games, right? It is the gameplay, it is the stealth, it is like the amount of variety that you have and how you can play those games. I think this is IO's chance to have that plus a really good story in their game that people will remember and care about. Oh yeah. Uh RVB RVB Jeeps says watch it be Agent 47 with a wig. I do like that. Alex Super Chat say to Barrett. That was awesome. Uh Rick L says could be uh Joe Alwen. What do you think, Greg? No. Dead to us. All right. Pretty simple. I'll win. Someone else saying the actor who plays Neville from the Harry Potter movies. Sure. Yeah. Yeah. Yeah. Yeah. Yeah. Dexter says, \"I think Charlie Cox. Hope you all have a great weekend.\" That'd be awesome. He's just all in on video games though. Yeah. [ __ ] off. I really had a great time with Expedition when I had to work with that sexy Ben Star. Charlie Cox, James Bond. That is that is actually a really good point. I know we're talking about a lot of movie stars, but like it is James Bond.",
            "start": 1784.88
        },
        {
            "text": "when I had to work with that sexy Ben Star. Charlie Cox, James Bond. That is that is actually a really good point. I know we're talking about a lot of movie stars, but like it is James Bond. Like this would be a a character that like you could you do have to pull to get a movie star in. Andrew Brown says people hated Daniel Craig when he was first cast as James Bond. It's true. Hear me out. You get car me from the bear. Oh, sure. Yeah. Yeah. Yeah. Yeah. British accent. Is he What's he What is he Willy Wonka? What is his Wait, was he Willy? No, he said he should be Willy Wonka. Everybody said he should be Willy Wonka because he looks so much like Gene Wilder. He does actually. I never put that together. Oh, dude, there's so many good photoshops of him in the purple suit with the hat and [ __ ] That's really funny. Uh, Race Cox says, or yeah, Rance Race Rants Rance Cox uh says it's going to be a daged Pierce Brosman. And then Cookie Cooking with Vinnie says it's snowike mic. I daydream",
            "start": 1832.88
        },
        {
            "text": "That's really funny. Uh, Race Cox says, or yeah, Rance Race Rants Rance Cox uh says it's going to be a daged Pierce Brosman. And then Cookie Cooking with Vinnie says it's snowike mic. I daydream about that every so often. If one of us like for some reason got cast in like a big deal like a cameo in a Marvel movie but we didn't tell the others and then we just went to a normal screener and like all of a sudden [ __ ] Nick's in the background. Like what the [ __ ] is going on? I might have one of those coming up. Oh, really? No. I'd be I'd be I'd be happy if you did though. Thank you. I appre I'd be happy if you did, Greg. That's why we're best friends. Come on. Uh, of course you could be a kind of funny best friend. You could be live in the chat shouting out all sorts of stuff, distracting me by saying Stella, you know, wishing my bully into existence. Of course you could super chat live as we do the show to be part of the news. And most importantly, you can pick up a kind of funny",
            "start": 1871.52
        },
        {
            "text": "me by saying Stella, you know, wishing my bully into existence. Of course you could super chat live as we do the show to be part of the news. And most importantly, you can pick up a kind of funny membership. It's the best way to support our small independent 11 person operation and make sure you get all the cool content like Wednesday into Thursday's allnight stream. Uh, if you want to support Kind of funny, of course, you can go to patreon.com/kindafoney, youtube.com/kindfunny games, Apple or Spotify to pick up your Kind of funny membership. Get all of our shows ad free and of course get your daily dose of me, Greg Miller and Gregway. But right now, you're not using your benefits. So, here's a word from our sponsors. This episode's brought to you by XRE. Y'all know that a few months ago, my life changed forever when I brought a pair of XRE1 AR glasses on a long flight to New York. I legit could not believe how easy it is to use and high quality my experience was playing games,",
            "start": 1916.96
        },
        {
            "text": "ago, my life changed forever when I brought a pair of XRE1 AR glasses on a long flight to New York. I legit could not believe how easy it is to use and high quality my experience was playing games, watching movies, TV shows on the plane without just too much extra stuff around me or especially not a giant goofy headset around my head. No joke, this is my favorite new tech product in years and it has earned a permanent spot in my travel bag. It is only hard to believe that it works as well as I'm saying until you try XR1 AR glasses for yourself and then you will see that the future is now. The tech is here. Connect XReal 1 glasses to wherever you are playing. Whether it's a handheld console, a PC, phone, home console. You just get a massive 150in virtual screen anywhere, anytime for any game. Gaming on the go like a long haul flight? You need the XR1. Next starting to hurt from staring down at your handheld? We've all been there. You need an XR 1. A screen as big as your wall. Instant",
            "start": 1954.4
        },
        {
            "text": "Gaming on the go like a long haul flight? You need the XR1. Next starting to hurt from staring down at your handheld? We've all been there. You need an XR 1. A screen as big as your wall. Instant plugandplay with all of your devices via USBC. Built-in audio with sound by Bose anchoring your screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full HD. These are what make XR1 a musthave. And we hear XR1 Pro is coming soon with an even bigger virtual screen. Hit our link below to get your XR glasses today. There's nothing better than when a sponsor of Kind of Funny is something that we are legitimately obsessed with, and that is exactly the case here with XRE. You're going to hear me talk about these forever. Go to xreal.com for more. Now, as someone who believes in taking a joke too far, I wanted to give Stella props in the chat cuz as we went to add, she goes, \"Wait, Chad, has Greg wished everyone a happy pride yet?\" And everyone went, \"No, no, no.\" And then",
            "start": 2003.2
        },
        {
            "text": "taking a joke too far, I wanted to give Stella props in the chat cuz as we went to add, she goes, \"Wait, Chad, has Greg wished everyone a happy pride yet?\" And everyone went, \"No, no, no.\" And then Stella goes, \"Wow, how homophobic of him.\" That's good. Happy Pride. Cuz I noticed it, too. So, I was waiting for I was waiting for Greg to say that. And I was like, Greg still hasn't said Greg still hasn't said when he's doing his parade. And a lot of people are worried that he's going to take over Pride and like, can you confirm or deny that, Greg? I will deny that. I'm taking over a different event. Number two, on the rope for report what? They're already out there. You're celebrating one thing. Celebrate my thing. You know what? Fair enough. Gamers. Uh, number two, The Witcher 4's Unreal Engine 5 in-game features and technology set to be revealed tomorrow. This is Tom Phillips at.com. The Witcher 4 developer CD Project Red has confirmed it will showcase more of its highly anticipated",
            "start": 2056.96
        },
        {
            "text": "Engine 5 in-game features and technology set to be revealed tomorrow. This is Tom Phillips at.com. The Witcher 4 developer CD Project Red has confirmed it will showcase more of its highly anticipated upcoming RPG this week. In a post on social media this afternoon, CD Project announced it would be bringing a look at quote the innovative technology and features that will power the Witcher 4 and beyond. Beyond. Thank you. Uh to Epic Games' State of Unreal briefing tomorrow. Epic's keynote will kick off at 9:30 a.m. Eastern time tomorrow, June 3rd. It will be streamed online. How much of this do you think we're going to get for The Witcher 4 as far as the frequency in which we're seeing the marketing for this game being tied to Unreal Engine? Is this like did did Epic throw just a bunch of money at CD Project to go, \"Hey, every trailer we're going to just we're just going to ex like make sure we're highlighting that this is Unreal Engine 5.\" Like, I'm surprised we're seeing this show up",
            "start": 2098.8
        },
        {
            "text": "at CD Project to go, \"Hey, every trailer we're going to just we're just going to ex like make sure we're highlighting that this is Unreal Engine 5.\" Like, I'm surprised we're seeing this show up again this way is what I'm getting at. Yeah. No, it's a I mean it's a good partnership, right? Uh chat or blessing or Barrett, anybody I forget. Was the last was Witcher 3 the last Witcher Jesus. Was that in an Unreal Engine or was that in a proprietary engine? Is the big deal here that they're using Unreal because hey, this is this is new for us and we're doing this whole thing. Yeah, that's a Yeah, that might be a question for chat because I remember Redkit says Cory Cudney. Cyber Punk had a big thing of like all right, we're not using this engine. Yeah. So, I imagine that would be a thing. Of course, if you're CD project, this is going to be a colossally huge game, but you have to learn a new engine on top of it, right? You're working so closely with Unreal that yeah, there's probably a",
            "start": 2149.12
        },
        {
            "text": "course, if you're CD project, this is going to be a colossally huge game, but you have to learn a new engine on top of it, right? You're working so closely with Unreal that yeah, there's probably a financial partnership there of cool, we're going to help you every step of the way, plus we want to use you cuz like I mean, honestly, great partnership. I it's very beneficial for for both sides, especially for Epic. Like I think one of the things that was the most like interesting things for that original Witcher 4 reveal trailer was that you know the text that was like oh this is running in like a future Unreal Engine version or whatever. I forget the exact wording but it was something along those lines. Um and I think we see that and we're like a damn that's cool. You know the Witcher is kind of you know they're they're showing us like this future look at how games are going to look like the Witcher 4. That's [ __ ] awesome. And to see it pop up again now, it's like, oh, you guys",
            "start": 2190.96
        },
        {
            "text": "is kind of you know they're they're showing us like this future look at how games are going to look like the Witcher 4. That's [ __ ] awesome. And to see it pop up again now, it's like, oh, you guys clearly have like shaking hands and being like, yo, we're gonna prop each other up in this relationship, which makes a lot of sense. Ghost of Dreams in the Twitch chat said that it's been pointed out by the Kingdom Come Deliverance devs, or one of the director, I think he said, is already gone from over there. That no open world RPG has been made in Unreal Engine 5 yet. So, I guess that's why you'd want to be behind and do it, let alone The Witcher name. Awesome. I'm excited to see more. But to your question of how much are we actually getting, right? Yeah. They announced they'll be bringing a look at quote the innovative technology and features that will power the Witcher 4 and beyond. So I wonder are we seeing systems? Are we seeing a little bit of a gameplay demo? Are we is it going to",
            "start": 2232.64
        },
        {
            "text": "look at quote the innovative technology and features that will power the Witcher 4 and beyond. So I wonder are we seeing systems? Are we seeing a little bit of a gameplay demo? Are we is it going to feel like we're like GDC talk where it's like we're going to be excited. We look at like oh like that's my thing is like there's no way they're going to show us systems and stuff, right? Like it doesn't feel like this game is I feel like for that the game would have to be less than two years away. You know what I for a game that feels like it's early and we have access to uh CD projects all of their like timelines as far as where chat remind me of where they're at with Witcher 4. Are they like solid that is officially in pre-production? I thought right or is it in production? You're right. You're right. You're right. Cuz I think it might just be the other day. um for because depending on where that's at like that could inform yo if we're in a place where we're ready to really talk about",
            "start": 2265.84
        },
        {
            "text": "right. You're right. Cuz I think it might just be the other day. um for because depending on where that's at like that could inform yo if we're in a place where we're ready to really talk about what we want to do with the Witcher 4 systems wise weather systems lighting systems all production as of seven months ago full production now okay full production like that'd be cool to get but yeah you're saying as of seven months ago that doesn't feel like we're at a place where we're going to get a deep dive into this thing cuz why but then also with CD project and CD project has been very good in recent years about being as transparent as possible, but also like, are we reading too much into it? The innovative technology and features that will power The Witcher 4 and beyond. So, it's like, here's what we're using for it. It could just be facial animation tomorrow. It could just be one gray box combat thing they're doing as they run between things. Is that I'll ask you this question, right?",
            "start": 2306.64
        },
        {
            "text": "what we're using for it. It could just be facial animation tomorrow. It could just be one gray box combat thing they're doing as they run between things. Is that I'll ask you this question, right? Sure. Is Is that exciting for The Witcher 4 fan base? Is that the right foot to lead off with in marketing The Witcher 4 or should you like would you have preferred would you prefer for them to like play it closer to the chest and have whenever we see The Witcher 4 be it a big trailer, a big reveal, a big thing, you know? Yeah. I don't I don't think this counts so much as a marketing beat. Like I think this is literally a marketing beat for Unreal. I think it's a marketing beat for uh what they're working with in terms of the briefing and the tech. But like this was a marketing beat. trailer right dropping here coming out and doing five minutes on how exactly how we can make her eyes react to this and that and I think that's the level we're getting tomorrow and again I think it might even be",
            "start": 2347.44
        },
        {
            "text": "dropping here coming out and doing five minutes on how exactly how we can make her eyes react to this and that and I think that's the level we're getting tomorrow and again I think it might even be like a NPC they're pulling from this that they're showing how they animated this NPC to do this and how we can make a real-time effect in real time splash and if something over here blah blah blah like I just I don't think it's going to be it'll be newsworthy for all of us tomorrow in terms of oh look how great this looks or whatever There's not something for like the Witcher Reddit to be like, \"Oh, we're going to now theorize based off of this.\" That's what the caliber of announcement and conversation I think we're having tomorrow. Fair enough. We will find out tomorrow 9:30 a.m. Eastern time. It'll be 6:30 our time. So, you'll get it on Games Daily no matter what. Unless it totally is lame, we don't care. Uh, number three, hi-fi Rush uh dev Tango Gameworks quote remains dedicated to",
            "start": 2391.2
        },
        {
            "text": "time. It'll be 6:30 our time. So, you'll get it on Games Daily no matter what. Unless it totally is lame, we don't care. Uh, number three, hi-fi Rush uh dev Tango Gameworks quote remains dedicated to distinctive and new IPs as it starts hiring for new action game. This is Vicky Blake over at IGN. Hi-fi Rush developer Tango GameWorks has unveiled its new look website and confirmed it's working on an unannounced game action game, I'm sorry. Uh the site, which shows new branding and careers page recruiting for new roles for an unannounced project, states Tango GameWorks's core mission is to quote create new games and expand intellectual properties end quote as an independent development studio based in Tokyo, Japan end quote under the crafting umbrella. Quote, \"Finally, after months of waiting, Tango GameWorks is back and in a brand new way.\" The studio's new website states, \"We've opened our site to give our fans and future team members a look into our studio. Here you can learn about",
            "start": 2435.28
        },
        {
            "text": "Tango GameWorks is back and in a brand new way.\" The studio's new website states, \"We've opened our site to give our fans and future team members a look into our studio. Here you can learn about the studio philosophy as well as see featurettes from members of the team. Since joining Craftton, Tango Gameworks embarks on a new chapter developing titles that resonate with players around the world. We remain dedicated to the creation and growth of distinctive and new IPs taking on challenges to be a unique voice in the games industry. End quote. Blessing. You loved Hi-Fi Rush. I did love Hi-Fi Rush. Do you believe in this mission statement? Uh, see that's the tough thing is I I want to and I do. I H High-fi Rush I think fits the bill. It's something that's unique and fresh, especially when you want to talk about within the action game genre. Like, you know, Hi-Fi Rush in terms of gameplay, right? It's an action game. We get millions of action games. People love action games. That's kind",
            "start": 2481.36
        },
        {
            "text": "want to talk about within the action game genre. Like, you know, Hi-Fi Rush in terms of gameplay, right? It's an action game. We get millions of action games. People love action games. That's kind of mainstream, right? But like what it does with art style, what it does with scope, right? It's like a tight sevenhour experience. What it does with the music gameplay and all this stuff really does make it fresh, really does make it something that stands out and really I think was sort of the I think that was the sharpness that was felt in people's hearts when this studio was shut shut down by Xbox. It's like really the studio that did something really cool, really fresh, and really different. This is the one there that the that you're shutting down. So like my my um there's part of my brain that reads that last part and goes ah that's just marketing speak right we remain dedicated to the creation of growth and of distinctive and new IPs. Ah that's something that every studio says. That",
            "start": 2526.88
        },
        {
            "text": "that reads that last part and goes ah that's just marketing speak right we remain dedicated to the creation of growth and of distinctive and new IPs. Ah that's something that every studio says. That said from Tango Gameworks I do believe it and I am excited to see what they bring to the table because I hope I hope that whatever their new IPs are have that same level of you know freshness uh same level of like standout ability that Hi-Fi Rush did. Yeah. Um, but then there's also the side of me that's like, \"All right, Craftton bought you.\" Is Craftton looking no independent development studio based in Tokyo, Japan? So, this we can already get ahead of it. Whatever they make will be up for independent game of the year. That can be indie. That can be indie game of the year because they said they're an independent development studio even though they're owned by Craftton whose revenue in 2024 was $ 1.9 billion. So yeah, there's the part of me that's like, \"All right, let's talk to [ __ ]",
            "start": 2563.12
        },
        {
            "text": "they're an independent development studio even though they're owned by Craftton whose revenue in 2024 was $ 1.9 billion. So yeah, there's the part of me that's like, \"All right, let's talk to [ __ ] Striking Distance Studios and see how independent they feel.\" But like Insomniac is independent. You know what I mean? Like they're independently under PlayStation just like just like how just use the words however we want to. Gamer is independently under crafting if you think about it. Same with Bungie. Yeah. Oh yeah, Bungie super independent right now. Um but yeah, there's the part of my brain that's like, \"All right, you're undercrafting.\" Like is the Higher Rush a new game thing? the all right one for us, one for you situation of this new IP that they're working on is something that needs to be a money maker so they can actually justify their existence under a big corporation. How many of these actually get out? How many of these IPs and you know we wish them the best and I'm not even",
            "start": 2606.88
        },
        {
            "text": "to be a money maker so they can actually justify their existence under a big corporation. How many of these actually get out? How many of these IPs and you know we wish them the best and I'm not even throwing [ __ ] at Craftton. There's many other video game publishers who are way worse about everything. It's just like this is the normal conversation of the dollars and the cents and the stockholders and this and like you're going to have to be making games that make them money because that's why they bought you. And so what we actually get into and we're creating new games and expanded intellectual properties like how much what is the level of success as always that your publisher is looking for to say you did great keep making those kind of games. Yeah. I think the thing I'm I'm wonder about with Craftton as well, right? Like oh man I'm on their website and I thought they had less studios. They have more studios than I thought. Uh cuz crafting came out of PUBG Corp, right? like PUBG",
            "start": 2648.64
        },
        {
            "text": "with Craftton as well, right? Like oh man I'm on their website and I thought they had less studios. They have more studios than I thought. Uh cuz crafting came out of PUBG Corp, right? like PUBG launched that grew craft behemoth thing over that and we saw oh the Dead Space game that we played and we liked a little bit more than other people protocol. Yeah, Colossal Protocol came out under Craftton and like game let down a lot of people but I would say at the very least at least that game came out and it was a full single player. It was what they promised it to be even if it was like a seven. But then it was that problem right where it was like this is Yeah. It was a seven out of 10 but exactly they then killed the studio and they don't kill the studio. Striking distance is still around. Leadership's all gone or Glenn left and then they made the rog like with a completely different art style. It's like again we're to the point that we've lost the plot that video games are hard to make.",
            "start": 2685.04
        },
        {
            "text": "all gone or Glenn left and then they made the rog like with a completely different art style. It's like again we're to the point that we've lost the plot that video games are hard to make. Every time you make a video game you should be getting better at making a video game. Your team coaleses. They learn more. they understand the processes and they so like to let them do that and then be like, \"Oh, are I they're not getting a Calistor Protocol 2 in in in the PS2, the PS1 days, even PS3, you usually see people come out with a seven out of 10, a cult classic, whatever, and then get to iterate on it and hopefully make it better and make it more mainstream. Those days are done.\" And we keep having the same [ __ ] reoccurring problem of, \"All right, cool. That's done. Leadership leaves. They go make their own little we're going to make a we're a double A size studio is going to make a quadruple AAA game.\" And then the whole [ __ ] thing repeats itself as nobody can get this done. Yeah.",
            "start": 2723.92
        },
        {
            "text": "go make their own little we're going to make a we're a double A size studio is going to make a quadruple AAA game.\" And then the whole [ __ ] thing repeats itself as nobody can get this done. Yeah. Like the point I I I wanted to make was that like you know Craftton I in in where they're at as a publisher, right? Are they on that come up level of oh we're buying buying buying and like now we have the money to like sustain and then they're going to hit that point of downfall. But I think you're right as far as like well Kalisto came out it didn't do as well as they wanted it to and now that studio has lost leadership and like they're it doesn't feel like we're we're not we're definitely not getting a Kalisto 2, right? Like I would assume. Yeah. I'm hoping that that doesn't happen when Tango Game works. But also, yeah, like we're in this weird place in the industry where sink or swim, like make a banger and make a bunch of money or look like look over your shoulder. Yeah, 100%. Uh Jackie",
            "start": 2764.08
        },
        {
            "text": "Game works. But also, yeah, like we're in this weird place in the industry where sink or swim, like make a banger and make a bunch of money or look like look over your shoulder. Yeah, 100%. Uh Jackie M with a super chat is they bought IP. So, Highf Fire Rush 2. That is what's listed over here on their, you know, take this with a grain of salt to Wikipedia. I forget if we've had them come out and straight up say that, but then I also wonder of like, okay, cool. But, you know, Craftton also knows there's money in mobile. Are we going to go that way with it? Are you going to try to switch it off and make a phone game or something that effect? Not that'd be bad necessarily. Yeah. But is it going to be the Hi-Fi Rush 2 y'all want based on what you got out of that first? I hope so. I mean, I don't think so. I don't have doubt in that. But yeah, I mean, Kind of funny games in chat also said sometimes you still look over you still have to look over your shoulder after making a banger, which",
            "start": 2800.48
        },
        {
            "text": "think so. I don't have doubt in that. But yeah, I mean, Kind of funny games in chat also said sometimes you still look over you still have to look over your shoulder after making a banger, which is also what Tango Gameworks had to do. Fair enough. Um, let's keep it moving. We'll move on to story number four. Uh, Wizards of the Coast signs publishing agreement with Giant Skull. This is Rachela Kaiser. Uh, over at Venturebe, maybe Quaser. I'm going to say Quaser. Uh, Wizards of the Coast announced today that it has reached a publishing agreement with the development studio Giant Skull. It will publish the studio's title currently in development, a single player action adventure game with an immersive story set in the Dungeons and Dragons universe. While Giant Skull has not revealed any further details about the game thus far, it's currently in development for PC and console. Many of you might be saying, \"Why do I care about Giant Skull? I've never heard of them.\" Stig Asen, Giant Skull",
            "start": 2838.72
        },
        {
            "text": "details about the game thus far, it's currently in development for PC and console. Many of you might be saying, \"Why do I care about Giant Skull? I've never heard of them.\" Stig Asen, Giant Skull CEO, said in a statement, quote, \"Our talented and experienced team at Giant Skull is built on creativity and curiosity. Our goal is to craft a rich new Dungeons and Dragons universe filled with immersive storytelling, heroic combat, and exhilarating traversal that players will fully embrace. As Muc formerly worked on Star Wars Jedi and God of War series for Respawn and Sony Santa Monica, respectively. Stig, of course, a name that's been around a long time and has put out lots of great games. So, the fact that he is over there working on this gets me immediately excited, let alone Dn D. The whole reason. Yeah. And like Balders's Gate leaning so hard into that, right, was so great. Just not the gameplay I wanted. Where this sounds way more like if they can do immersive storytelling that way",
            "start": 2882.16
        },
        {
            "text": "reason. Yeah. And like Balders's Gate leaning so hard into that, right, was so great. Just not the gameplay I wanted. Where this sounds way more like if they can do immersive storytelling that way and give me that kind of gameplay. [ __ ] yeah. Yeah. I mean, I think that's a great idea and I'm fascinated to see what that's going to be. Is it going to be Yeah, like a God of War style game but in just an D&D world. I would think that speaks to an audience. I I am also fascinated though at the same time that I would have thought that like Dn D video games in general, and maybe this is I'm speaking out of turn chat. Let me know if I'm wrong. kind of funny. I com wrong. I think that D and D video games in general would be a bigger thing than what they seemingly are, right? Like I feel like Balders's Gate kind of has has the sauce and then like like D and D video games outside of that feel few and far between. Like am I wrong about that or does chat know if I'm like super off base? What are",
            "start": 2925.36
        },
        {
            "text": "Gate kind of has has the sauce and then like like D and D video games outside of that feel few and far between. Like am I wrong about that or does chat know if I'm like super off base? What are you going to like rolling a dice and like that? I'm thinking of just D and D world like games that just exist in that universe. No, I think you're right then. Yeah. I mean, how many are there in that universe? Yeah. And like I the D and D fan base is modernly Yeah. modernly like the D and D fan base is growing day by day somehow because it feels like it's already like out of you know people there's already so many people who I know that are into D and D and tabletop uh role playing games. But like with all of like the podcasts and Dimension 20 and Critical Role and all these things, right? Like I have multiple different friends that are part of different friend groups that are inviting me to their D and D groups and I'm like man this is everywhere. I saw who was it that posted um well I had a",
            "start": 2966.24
        },
        {
            "text": "have multiple different friends that are part of different friend groups that are inviting me to their D and D groups and I'm like man this is everywhere. I saw who was it that posted um well I had a few friends I think Sage Ryan was one of them that posted on Instagram stories uh them at the Dimension 20 show that was in uh Los Angeles uh yesterday last night and they're in a [ __ ] stadium like playing D and D in front of thousands and thousands and thousands of people right like Balders's Gate 3 being such a success currently is not an accident like there is such a market for it and so I look at this and I'm like, \"Oh, damn. This is such a slam dunk of a thing.\" But I also, that's why I have the thought of like, man, I'm surprised. Yeah. Thank you, Bear, for bringing this up. I'm surprised that this isn't a thing that we're seeing left and right, right? Like, we're not getting D and D games as much as we're seeing Warhammer games, for example. Yeah. Yeah. For sure. For sure. Yeah,",
            "start": 3013.04
        },
        {
            "text": "that this isn't a thing that we're seeing left and right, right? Like, we're not getting D and D games as much as we're seeing Warhammer games, for example. Yeah. Yeah. For sure. For sure. Yeah, it's a great point, a great uh question. I think it's the again the universe, I think, is one thing. I think it's the mechanics of it as well that are so interesting in that adlib nature. And I think maybe that's why it's harder to make a game. And why Balders's Gate works is there's so many permutations and it's the things we talked about in the Outer Worlds re-review, right, of just like coming into Outer Worlds and having that ability, all right, you can kill anybody or team up this way or like okay, that that that's what makes this role playing game feeled out and real. And so there's so many video game RPGs, but how many are leaning and able to lean into that to really change the story and the narrative on a whim is different. Yeah, I think that's a really good point, right? Like if I",
            "start": 3056.24
        },
        {
            "text": "video game RPGs, but how many are leaning and able to lean into that to really change the story and the narrative on a whim is different. Yeah, I think that's a really good point, right? Like if I wanted just a fantasy RPG, like there's so many I can run to that, right? But when I think of D and D, I am thinking the mechanics and like rolling the dice, all those permutations. Yeah. Blessing, Greg. Stig making a new game in the D&D world is pretty gosh darn big. But I'm sick of all this big news. It's a big week. I need some small news. Where should I go? You'd go to our last story, the Wii News Channel, where we cover all the small news items you need to know about. Number five, the Wii News. uh from IGN from software has released Elder Ring Night Reign patch 1.01.1, the game's first since launch, and it made single player mode a lot easier. It adds an effect, quote, automatic revival upon defeat, which allows revival once per night boss to solo expeditions and increases the amount of",
            "start": 3095.84
        },
        {
            "text": "launch, and it made single player mode a lot easier. It adds an effect, quote, automatic revival upon defeat, which allows revival once per night boss to solo expeditions and increases the amount of runes gained for solo expeditions. Thank god. Do they also fix how it runs on 50 cards? Thank god. Oh, wait. Are you asking? Yeah. Um cuz our stream on Friday, like I was originally playing at Nick's computer and it looked like ass and then I had to move over to Mike's computer that we already had set up for Roger, but then Roger abandoned us. [ __ ] Roger. And it was working thankfully uh okay on Mike's desk. But it was like just one of those things like if we want to play Night Ring this week, there's only two computers in the lab right now that run it well and then the third one is just running like booty. That's wild. I didn't hear that. I've never heard of PCs having trouble running a game. That's nuts. I know, Greg. Uh, from Noble, uh, People Can Fly announced that they're suspending",
            "start": 3139.88
        },
        {
            "text": "like booty. That's wild. I didn't hear that. I've never heard of PCs having trouble running a game. That's nuts. I know, Greg. Uh, from Noble, uh, People Can Fly announced that they're suspending the development of Project Gemini and Project Irost. Uh, they will also regroup as a studio and scale down their teams, which means layoffs. Boo, that sucks. Outr Rididers devs here, right? People can fly. So, damn, that sucks. I don't know anything about Project Gemini or Bifrost, but always sad to see plans not net out the way they should and move on. Especially when it seems like from what I had gathered before about people can fly like I mean from here, right? like there's they they had a lot of projects that they were scaling up for, working on all these things. Like I even heard through the grapevine of like, oh yeah, no, they're doing a lot. Um, and so yeah, to see these things shut down, it's like, well, that sucks cuz obviously you had plans and now like whatever the case may be,",
            "start": 3188.4
        },
        {
            "text": "the grapevine of like, oh yeah, no, they're doing a lot. Um, and so yeah, to see these things shut down, it's like, well, that sucks cuz obviously you had plans and now like whatever the case may be, probably money not funneling in at the rate you wanted to to support these things. [ __ ] [ __ ] goes down. Good luck to everybody. Uh, from IGN, a PSA, Nintendo has confirmed that owners of the new Nintendo Switch 2 should not remove the protective film covering its screen. Quote, \"The screen is covered with a film layer designed to prevent fragments scattering in the event of damage. Do not peel it off.\" End quote. What's going on here? It's got to be like not It's not going to be a sheet of plastic. It's going to be just a film that somebody's going to take a razor blade to. I don't even [ __ ] know. it like I mean is that it easily starts coming off though you know that's where my brain goes then don't don't you just put another one on like is that the same as like the thing that I",
            "start": 3226.24
        },
        {
            "text": "[ __ ] know. it like I mean is that it easily starts coming off though you know that's where my brain goes then don't don't you just put another one on like is that the same as like the thing that I put on there anyway because I always do put the protective it's I would think it is so it comes pre-protected according to but I don't know because the I pre-ordered their carrying case like the Nintendo Switch cuz I don't care about the fancy ones just give me a basic [ __ ] Switch one that my Switch 2 will fit in and that comes with a protective screen. So is that different? I would assume so. Yeah, that's different. Yeah. Yeah. Yeah. You're going to have double protection. Double rapid. Exactly. That definitely works. Don't listen to it. Don't. That's a jump. 99.9 plus 99.9. That's pretty. You times that. It's a lot of friction there. Ripping and tearing. Uh, from Insider Gaming, first revealed on social media by a former High-Res employee. Hi Studio has let go of pre High-Res Studio",
            "start": 3270.0
        },
        {
            "text": "You times that. It's a lot of friction there. Ripping and tearing. Uh, from Insider Gaming, first revealed on social media by a former High-Res employee. Hi Studio has let go of pre High-Res Studio has let go of President Stuart Chisol. uh executive producer Travis Brown and another senior staff member known as Radar. Now, first off, hold on a sec. Like on over I mean I don't know the news that's breaking news to me, but it's crazy to hear somebody letting go of their president and a producer. Sure. And then they only know this one guy's radar. Senior staff member. Like I get it. Like I totally get it. It's just like that's what that's interesting. Uh from VGC, uh Yoko Shimo Shimo Mura has created a new track for Street Fighter 6 which will be added to the game in a free update coming later this week. That's awesome. That's random though. That's like who is who is Yoko? Oh, she did music for Kingdom Hearts Live Alive. I love that Live Alive is my touch point to it. But like she's like",
            "start": 3313.28
        },
        {
            "text": "this week. That's awesome. That's random though. That's like who is who is Yoko? Oh, she did music for Kingdom Hearts Live Alive. I love that Live Alive is my touch point to it. But like she's like a very legendary composer like up there with the greats. Okay. And so Street Fighter 6 is really cool for her to do music for as if you could get away from it with the conversation here. My Gregway Today and now Fantasy Life Eye has officially sold 800,000 copies worldwide. So keep your eyes peeled on that in my reviews so far if you want to hear more about that. Uh Sega Football Club Champions has been announced for PS4 and 5 uh mobile and PC. And then The Elder Scrolls Online, Seasons of the Worm Cult part One, and free update 46 base game patch are now available on PC and Mac. It arrives on Xbox and PlayStation consoles June 18th. And that's it for Wii News. We ask people watching live to of course be part of the chat by writing in at youtube.comfunny games with super chats. Uh",
            "start": 3367.52
        },
        {
            "text": "on Xbox and PlayStation consoles June 18th. And that's it for Wii News. We ask people watching live to of course be part of the chat by writing in at youtube.comfunny games with super chats. Uh Meloofello says, \"My favorite duo, G-spot and Beehole.\" How many night lordbosses have we beaten? Bless Bro and I beat them all this weekend. It's a contender for sure. I don't understand how people beat all the bosses this weekend. They're good. What the But that good. I forget who it was, but when Andy and I were playing on Friday, someone in our chat maybe like or maybe someone in Andy's chat like Thursday night or in our chat Friday morning from our community was like, \"Damn, that final boss is crazy.\" It's like the game just came out. Yeah. What are you What are you doing? Are you some Are they This must be some some Fast and Furious [ __ ] where they're They're hacking the planet. Yeah, they're Well, they're I was going to say they're stealing them out of the backs of trucks and playing",
            "start": 3414.88
        },
        {
            "text": "This must be some some Fast and Furious [ __ ] where they're They're hacking the planet. Yeah, they're Well, they're I was going to say they're stealing them out of the backs of trucks and playing the game early. Oh, but that's still crazy cuz me and Andy had the game early and we couldn't beat the final boss. Um I I'm still sitting on four of the night lords uh defeated and like it's the it's the tough thing now of because the game is now is now out, most people are still contending with like those first few Night Lords. So, like I've beaten the Tricolos multiple times. You know about Tricphilos? No. He's a dog with three heads and he splits into three. It's great. That's awesome. Um, but yeah, like I I'm still on this first four. Um, I don't know if I'm ever going to get around to beating the second four. Here's the other thing. You don't like it that much? I I like it a lot, but you guys like it. Yeah, but like it's not the thing where I'm like, \"Got to get back there. Got to got",
            "start": 3462.48
        },
        {
            "text": "the second four. Here's the other thing. You don't like it that much? I I like it a lot, but you guys like it. Yeah, but like it's not the thing where I'm like, \"Got to get back there. Got to got to get back there.\" Yeah. I'm not thinking about playing it until somebody hits me up until Andy's like, \"Yo, let's play Night Rain.\" And then on Friday, we played it for like four and a half hours straight. And so, what if I hit you up? I'm like, \"Hey, let's play fantasy life.\" Ah, I don't know about that. I don't know about that. It's also the thing too where you mentioned at the top of the show, this is a bit busy season. There's so many games coming out. And so, yeah, I wanted to play I wanted to play like some Hollow Night and some Halfife and some things that I wanted to get to before I hit this week because I knew this week's where it starts. This week is where it starts. Review season is what they call it. Dane writes in with a dad joke of the day. ran out of toilet paper and I've",
            "start": 3502.24
        },
        {
            "text": "hit this week because I knew this week's where it starts. This week is where it starts. Review season is what they call it. Dane writes in with a dad joke of the day. ran out of toilet paper and I've been having to use lettuce leaves today was the tip of the iceberg. Good. That's good. Iceberg lettuce. Oh, okay. Uh Sean writes in. It says, \"Birthday tax. Not sure if I'm doing this right.\" LOL. Regardless, love you all and can't wait to enjoy SGF with the best friends. Happy birthday. Happy birthday, Sean. Zamperelli. We don't want to get We don't want to piss anybody off. if the the bits is it's been too too long for this, but like after the last Reddit post about us not wishing had birthday enough. I almost bought uh like the party poppers and hit it under the desk. You were telling me and Roger that. I was like this this is swinging in a direction that I don't know if you want to go. I was going to go really hard. Do it one more time though. Which part? Just say happy birthday.",
            "start": 3535.12
        },
        {
            "text": "me and Roger that. I was like this this is swinging in a direction that I don't know if you want to go. I was going to go really hard. Do it one more time though. Which part? Just say happy birthday. Happy birthday. Happy birthday. What's the name again? What's their first and last name? Charles. Sean. Sean. Happy birthday, Charles. Joey Radstone super chats and says, \"Last super chat for a while. Just wanted to say thank you guys for being awesome. Now it's time to save up for the little girl my wife and I are expecting this December. First time dad. Any advice, Greg?\" Congratulations, Joey. Congratulations. Uh try to soak it all in. It goes so so fast, especially those first couple days in the hospital. So, for maybe it'll be a once in a lifetime, maybe twice in a lifetime thing. Maybe, you know, 10 if you're weird. Uh, but you you're going to be in a hospital and it's going to be crazy and it's going to be fast and furious. You got to take notes. You got to remember everything. You",
            "start": 3581.12
        },
        {
            "text": "you know, 10 if you're weird. Uh, but you you're going to be in a hospital and it's going to be crazy and it's going to be fast and furious. You got to take notes. You got to remember everything. You got to take a lot of photos. Uh, Matthew Hudaldo says, \"Hey, Greg, that shirt looks good on you.\" Thank you. It's my latest one from DC Comic Shop. I bought those first two, you remember that I wore right after the anniversary and I wore them in. I said, \"How do I I'm like, \"How do you like the shirt, Tim?\" He's like, \"It actually doesn't look like that good of a shirt.\" I'm like, \"They actually aren't.\" And those are already breaking down. But this one, comfort colors. I think they got it set. I don't feel like it's screen printed. I'm pretty stoked about what the [ __ ] The logo looks great. Oh, I blew my nose. It's a the dry ass napkin. I'll be quiet now. Um, El Captain22 says, \"Sounds like kind of funny. Has a well planned out week. Be a shame if Sony announced the state of play for",
            "start": 3628.48
        },
        {
            "text": "Oh, I blew my nose. It's a the dry ass napkin. I'll be quiet now. Um, El Captain22 says, \"Sounds like kind of funny. Has a well planned out week. Be a shame if Sony announced the state of play for this week and makes Tim's hair fall out.\" I assure you, if you announced the state of play right now, we would be happy as pigs and [ __ ] because that'd be awesome. It'd be a shame. It's going to be a traffic bonanza already. It'd be shame if I got called in to jury duty. That would be bad. We hope that doesn't happen. We hope that doesn't happen, but we'll see. We'll see in 15 minutes. Greg Bot writes in and says, \"AVP in review when.\" Uh, we will be getting back to the Aliens versus Predator universe, but of course, last week was Karate Kid in review. This week is Ballerina in review and then next week we start Superman in review as a leadin to the James Gun film on July 11th. Remember, there's an interview every week. So, we try to build to a movie. So, since we're not building to an AP",
            "start": 3657.68
        },
        {
            "text": "next week we start Superman in review as a leadin to the James Gun film on July 11th. Remember, there's an interview every week. So, we try to build to a movie. So, since we're not building to an AP right now, we're just let Well, I guess we are Badlands, but that's [ __ ] forever away, right? So, whatever. We'll get back to AP. Don't you worry pretty little head about it. Um, T-Bone says, \"I think it's a pretty good chance that IO Interactive makes their own 007 and not have it based off any famous actor.\" I think you I still think you cast a famous inqu a video game famous person in whether he looks like that person or not I don't know but I my prediction actually no Josh Peek I was going to say you cast an actor for the mo cap and then just have a different voice actor voice him but I feel like that's less exciting for um you got to have you got to go all in. Uh cheesy abish uh says what do y'all plan on switch two at drop. I imagine our stream will be dominated by Mario Kart",
            "start": 3698.4
        },
        {
            "text": "I feel like that's less exciting for um you got to have you got to go all in. Uh cheesy abish uh says what do y'all plan on switch two at drop. I imagine our stream will be dominated by Mario Kart World, but then there'll be some Delta Rune in there, too. You can't start your very first Switch 2 stream without the Nintendo Switch 2 welcome. You start if if I'm here at [ __ ] we download everything. It's 10:00 now and you go. I was like, let's play Welcome Park. I'm walking the [ __ ] out of this building. I'll play some Welcome to her. I'll you'll hear it from me. All right. I'm Why she use your dork voice? That's just my voice. I just sound like a dork. My regular voice. He just comes out like that. CJ Splitzon says, \"Rahul being in two games is weird. Let me tell you about a man named Troy Baker, Nolan North, a woman named Laura Bailey.\" Ben Star. Oh my god. You know that's how it is. Don't worry about this. But also, Rahul being in two games would be sick as [ __ ] You know what I",
            "start": 3743.84
        },
        {
            "text": "Baker, Nolan North, a woman named Laura Bailey.\" Ben Star. Oh my god. You know that's how it is. Don't worry about this. But also, Rahul being in two games would be sick as [ __ ] You know what I mean? Like he is [ __ ] he is the he is the guy now. Good for him. I say that like we've already confirmed he's seven. Call send him flowers. Congratulation right now. Uh, of course, uh, we ask people watching live, we go to kind of funny.com/you wrong and tell us what we screw up as we screw it up. A lot of stuff about my confusion about Scottish, British, England, and all that stuff. So, let's get into it. Uh, the Axel guy or that Axel guy, that Exxel guy, that Exa guy, exa, that guy with a bad name. Uh, James Bond is canonically Scottish and Scotland is indeed mainland British Britain. Let me try all that again. James Bond is canonically Scottish and Scotland is indeed in mainland Britain. Then since that's confusing to me, Katie G says Scottish is mainland British, just not English.",
            "start": 3790.88
        },
        {
            "text": "me try all that again. James Bond is canonically Scottish and Scotland is indeed in mainland Britain. Then since that's confusing to me, Katie G says Scottish is mainland British, just not English. England, Wales, and Scotland are all part of Britain. Okay, I'm still on that Zela guy is what I think it is. Uh Nolan Massie Media says, \"Oblivion remaster is Unreal 5 open world RPG.\" Okay, sure. Damn. They didn't make the [ __ ] game. Yeah, that they Well, it's like they used paint to paint over it. They used Unreal 5 to paint over [ __ ] you know? It's not like it was ground up, right? Uh and then Brad says, \"Please read the people can fly update in full. They call out Square Annex and then links to a uh people can fly uh LinkedIn post that I will now read because if they're yelling at somebody I will. Today we made a very difficult decision to suspend the development of project Gemini and project byrost. The current relevant oh sorry the relevant current reports have been released to",
            "start": 3835.76
        },
        {
            "text": "I will. Today we made a very difficult decision to suspend the development of project Gemini and project byrost. The current relevant oh sorry the relevant current reports have been released to the market. The suspension of Project Gemini is a consequence of the fact that the publisher has not presented us with a draft of the subsequent content writer to the publishing agreement covering the terms and conditions of further milestones on Project Gemini and the lack of communication from the publisher as to its willingness to continue or terminate the Gemini project. Sweet [ __ ] Jesus. Oh, we're into the legal ease. We're going to go after you with the legal [ __ ] ease. This is on me. I only read Yeah, I didn't I should have read the full thing cuz this should have been like the last news story. Project Bifrost was suspended due to the above and the analysis of the group's cash flow which showed a lack of pro prospects for securing organizational resources and funds necessary I burp",
            "start": 3890.4
        },
        {
            "text": "story. Project Bifrost was suspended due to the above and the analysis of the group's cash flow which showed a lack of pro prospects for securing organizational resources and funds necessary I burp in the middle of that necessary to continue the production and release of this project. As a result, we have to significantly regroup as a studio and scale down our teams which hurts the most. We wish to express our deepest regret and sadness over how these events have unfolded and our sincere gratitude for everyone's contribution to up to this point. This is from the CE. So Project Gemini was outr rididers 2. Is that the apparently that's what I would read on this one and Square is just not answering emails now. Oh, hey, look how it's coming. There's all quiet on the Western Front about that. It's like they just forgot to tell them that they're not moving forward with this thing anymore. But that was God damn, that sucks. Thank you for That's a great eurole. Yeah, that's fantastic. Thank",
            "start": 3933.36
        },
        {
            "text": "It's like they just forgot to tell them that they're not moving forward with this thing anymore. But that was God damn, that sucks. Thank you for That's a great eurole. Yeah, that's fantastic. Thank you for that. Kebabs, you usually send in trash and so you should learn from Brad. Brad knows how to wrong correctly. I just did it. Done. Sorry, kebabs. And that's it everybody. That's another episode of kind of funny games daily in the bank. But your live programming day is far from done here. Of course, we're going to do the games cast next where we will give you our final summer gamefest predictions for Jeff's big show on Friday. We'll hang out, we'll laugh, we'll cry, we'll have a good time. After that, of course, is the kind of funny podcast where we'll laugh some more and celebrate The Tomorrow War, a film we all like and we didn't get paid to say it. And then after that, it will of course be a stream. More Elden Ring Night Rain. Will our computers run it? I mean, probably. PC",
            "start": 3976.96
        },
        {
            "text": "The Tomorrow War, a film we all like and we didn't get paid to say it. And then after that, it will of course be a stream. More Elden Ring Night Rain. Will our computers run it? I mean, probably. PC gaming is so simple. There's no way this could [ __ ] up. Remember, if you like our shenanigans, we'd like you to pick up a kind of funny membership. $10 gets you all of our shows for a month, adree. Of course, you could go to patreon.com/kindfunn, sign up for that premium item, get your snowike mic poster for this month to join all the other kind of funny posters you have. Uh, no bucks toss away. No big deal. Like, subscribe, share, ring the bell, Twitch Prime, Amazon Prime, you know it. For now, it's time to talk about SGF. Remember, our big Switch launch party kicks off Wednesday night and goes all through the night. Will Roger and Mike order bad food? Of course they will. Until next time, though. It's been a pleasure to serve you. [Music]",
            "start": 4017.44
        }
    ]
}