{
    "id": 14281,
    "video_id": "yzLLONCPWjs",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Andy Cortez",
        "Blessing Adeoye Jr."
    ],
    "title": "We Played Outer Worlds 2, Invincible VS, Grounded 2 - Kinda Funny Gamescast",
    "description": "Go to http://kindafunny.com/XREAL to grab yours now!\n\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\n00:00:00 - Start\n00:05:30 - Housekeeping\n00:06:35 - Topic of the Show: Greg Miller played some games in LA\n00:07:04 - THE OUTER WORLDS 2\n00:37:40 - INVINCIBLE VS\n00:51:20 -  GROUNDED 2\n\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1749583282,
    "duration": 3547,
    "transcript_chunks": [
        {
            "text": "[Music] What's up and welcome back to the kind of funny games cast for Tuesday, June 10th, 2025. Of course, I'm your host Tim Gettys. I'm joined today by blessing Adi Yoay Jr. Good day Tim. Greg Miller. Hi, Tim. And Andy Cortez. Good morning. How y'all doing? So good. Well, Andy, the best. What do you got in your hand? What you up to? I was just telling you about the Possessors demo. Possessors is the one of the games that Heart Machine is working on uh sidescroller from sidescrolling Metroid Vania and uh it was one of those that when they announced I was like, \"Oh [ __ ] they're working on another game as well.\" But it's got a really good style and it looks crazy good on Steam Deck Oled. Yeah, I will download that tonight to play. Very exciting. I've been busy though with the Switch 2 obviously of course but also Tony Hawk's Pros Skater 3 and four demo. Oh yeah. Oh, I've been playing all that. The Foundry playing college. Oh man, good times out there. But this demo drives me crazy",
            "start": 0.15
        },
        {
            "text": "obviously of course but also Tony Hawk's Pros Skater 3 and four demo. Oh yeah. Oh, I've been playing all that. The Foundry playing college. Oh man, good times out there. But this demo drives me crazy because I'm just like I need to stop playing now because the game's coming out next month. We're a month away. It's going to take over my life. Greg, you're reliving your childhood where you would just play the demo over and over and over again. Exactly. Exactly. That's all you had. That's all that I have. A demo disc. Yeah. A beautiful thing. Lost to time. Everybody, how are you doing, Greg? I'm great. Excited to talk about some of these video games I played down in LA and then go play video games at my desk. Exactly. That's the thing. You uh went down to LA, played a whole bunch of games at Summer Gamef Fest Playdays, but then also was this a separate event or what was this? Uh so the Xbox stuff. Yeah. Uh yes, separate event. So of course, uh Summer GameFest is Jeff Keelley's show. Uh",
            "start": 54.32
        },
        {
            "text": "Summer Gamef Fest Playdays, but then also was this a separate event or what was this? Uh so the Xbox stuff. Yeah. Uh yes, separate event. So of course, uh Summer GameFest is Jeff Keelley's show. Uh he does it on Friday. And then there's Summer GameFest play days which are held at an actual place in Los Angeles where a whole bunch of uh jouros and creators and media and other video game people come together and play demos kind of like a very small scale E3 or something to that effect. Uh on Sunday of course was the Xbox presentation they did this year and they had taken over a different loft where they had multiple floors of games the media lounge for you to come in and watch the showcase like I did from there. I sat next to Rebecca Valentine across from Jason Shrier. Amazing. amazing moment whereas we all know the shry guy, right? Shy guy. Shy Guy's out there doing real work, doing real news, right? And so what's I don't I don't get to be in the room with Jason often, right? Usually",
            "start": 90.4
        },
        {
            "text": "whereas we all know the shry guy, right? Shy guy. Shy Guy's out there doing real work, doing real news, right? And so what's I don't I don't get to be in the room with Jason often, right? Usually when we host he's, you know, on the screen or whatever. And so like I've always taken him as a nononsense. Yeah. You know, he doesn't want the the [ __ ] that comes with, you know, game events or whatever. So, right, we're in the media room. They have all this amazing food over there. There's they had just a great meeting room because it was just like just long desks with drops and cables and powers and everything was you there and it wasn't crowded. It was great. But the clock the countdown clock on the thing gets like four minutes and the some Xbox person turns off the lights in the room so that it'll be like a thing and Jason goes, \"A come on.\" So mad that they were turning off the lights in here and watch this like a theater presentation. I'm trying to take notes, man. Come on. What are",
            "start": 133.68
        },
        {
            "text": "it'll be like a thing and Jason goes, \"A come on.\" So mad that they were turning off the lights in here and watch this like a theater presentation. I'm trying to take notes, man. Come on. What are we doing here? Anyway, so yeah, so we watched the presentation there and then that began a series of uh on the hour on the half hour behind closed doors demos for uh the people there that had booked stuff ahead. That's where I played with the rock ally. That's where I went and had hands-on with it and that's where I played uh games like the Outer Wild Outer Worlds [ __ ] 2 uh Invincible Versus and uh Grounded Too. Hell yeah. What we talking about? Mhm. Blessing played Invincible too, didn't you? I did play Invincible versus Thank God because when I sat down and the guy's like, \"How much do you know about Invincible?\" I'm like, \"Sir, there's nothing you could teach me about Invincible.\" He's like, \"Cool. How much do you know about fighting games?\" I'm like, \"I don't know how anything I was I",
            "start": 175.92
        },
        {
            "text": "about Invincible?\" I'm like, \"Sir, there's nothing you could teach me about Invincible.\" He's like, \"Cool. How much do you know about fighting games?\" I'm like, \"I don't know how anything I was I was um offended when Greg turned to me at my desk and he was like, \"Bless you like you like Invincible and all.\" I'm like, \"We don't talk at all, do we?\" Cuz I [ __ ] I'm all here. The thing is that we talk we talk, but we talk about so much that I just can't keep it. I don't You're not wearing no Adam Eve shirt. I don't know what's up. That's fair enough. It's hard. It's easier to hide behind 40 atrocities than one. How many times are you going to say it, Andy? And how many times is it going to be relevant? Not that this is one of those times, but I don't know. I don't know if it's ever been relevant. What is it from? Get cultured everybody. This is the kind about the imperial thought machine. Bless. you know, Imperial, like when you're being oppressed and they're it's, you know, they're",
            "start": 216.48
        },
        {
            "text": "relevant. What is it from? Get cultured everybody. This is the kind about the imperial thought machine. Bless. you know, Imperial, like when you're being oppressed and they're it's, you know, they're always just hitting you with all this [ __ ] all the time and you can't really focus on one bad thing that the oppressors are doing. So, it's easier to hide behind 40 atrocities than just one. You're talking about 2025 America right now. Andor. Here's a quote for you, too. Yes, he was underneath me and behind me and on top of me. What's that from? Something I watched last night. I can't talk about it. [ __ ] invincible. You don't know [ __ ] I don't know [ __ ] about nothing. This is the Count of Funny Games Cast everybody. Each and every weekday we get together to talk about the biggest reviews, previews and topics in video games live on YouTube, Twitch and podcast services around the globe. If you love what we do, please support us with the kind of funny membership on Patreon, YouTube,",
            "start": 248.4
        },
        {
            "text": "previews and topics in video games live on YouTube, Twitch and podcast services around the globe. If you love what we do, please support us with the kind of funny membership on Patreon, YouTube, Spotify or Apple Podcast to get all of our shows ad free and you get a daily exclusive Gregway. For a chance to be part of this show though, submit your thoughts and opinions as YouTube super chat. So, if you have any questions about Outer Worlds 2, out of words, uh, Invincible Versus, or just anything about Greg's time in Los Angeles, California, please YouTube super chat away. I got Dan Riker stories for days. We're If you have any questions about Dan Ryker, please super chat them, man. Like, what's wrong with him? Uh, we're 11 person business all about live talk show. Did you watch Did you see me on Giant Bomb? Did you watch this? I have not watched it yet. man made burgers like and then he for some reason went the extra mile of like on this, you know, making the patties and forming them",
            "start": 290.32
        },
        {
            "text": "me on Giant Bomb? Did you watch this? I have not watched it yet. man made burgers like and then he for some reason went the extra mile of like on this, you know, making the patties and forming them and then never washed his hands and then ate pizza with those hands. Oh. And then when somebody's like, \"Did you wash your hands?\" He had no idea that that would be bad. How is he still alive? Luck. It's luck, man. Uh Games Daily, Greg and I just covered Nintendo revealing a new Switch 2 Splatoon spin-off game. And after this, Nick and Mike are streaming Mind's Eye, and I can't wait for that. You guys are going to want to be a part of it. This game seems like a disaster, but how big of a disaster? We'll have to wait and see and find out altogether because they didn't send out any review codes. Well, I wonder why. If you're a kind of funny member, today's Gregway is all about what makes a good PS5 trophy list. Thank you to our Patreon producers Carl Jacobs, Omega Buster, and Delaney Twining.",
            "start": 330.48
        },
        {
            "text": "I wonder why. If you're a kind of funny member, today's Gregway is all about what makes a good PS5 trophy list. Thank you to our Patreon producers Carl Jacobs, Omega Buster, and Delaney Twining. Today, we're brought to you by XRE and Factor, but we'll tell you all about that later. Let's get into the topic of the show. Dots. Greg went down to Los Angeles. I talked into, you know, cooperation. I know. I I did my job. I'm the guest. I'm the guest. I did it. Was it just Greg that didn't do it? Yes. I'm sorry everybody. I'm promoting the show. I'm so big on it. I feel like usually does its Yeah, you're right. Yeah. Kevin is not having that. We were down two people. Tots. Tots. Tots. There we go. Tots. Tots. Tots. The tots is Greg went down to LA. Greg played a bunch of Xbox games and bless played Invincible Versus. We're going to talk about all of that stuff. We have to start with the biggest one though, The Outer Worlds 2. Obsidian's latest original launched on October 25th, 2019. Greg,",
            "start": 368.56
        },
        {
            "text": "Invincible Versus. We're going to talk about all of that stuff. We have to start with the biggest one though, The Outer Worlds 2. Obsidian's latest original launched on October 25th, 2019. Greg, Andy, and Stella just re-reviewed it on the Kind of Funny Games cast uh a week or two ago, so you can check out that. The Outer Worlds 2 is the sequel to the award-winning firstperson sci-fi RPG from Obsidian Entertainment. Greg, what did you get to play with this one? Uh, I got to play what would have been probably 30 40 minutes of this. It was, you know, we had an hourong session, went in there, got right on sticks, had three different saves to choose from, which I'll explain because it's very important to all this. Uh, and then, yeah, we got some Q&A time. probably did 50, I would say, and then probably had 5 to 10 minutes uh with the team afterwards to ask them some questions about The Outer Worlds 2, Tim, a game I have been very excited for uh before ever playing it because I didn't love",
            "start": 414.88
        },
        {
            "text": "probably had 5 to 10 minutes uh with the team afterwards to ask them some questions about The Outer Worlds 2, Tim, a game I have been very excited for uh before ever playing it because I didn't love Outer Worlds at launch. And then even on this replay of Outer Worlds, I I think with my expectations lower, I enjoyed it more than I did at the launch review. Uh but still wasn't like floored of like this was, you know, the best thing since sliced bread. What do you want to know, Tim? I want to know if you think that this one is going to be the best thing ever. Do you want me to put my hyperbole away or do you want me to start with hyperbole? This is like a good news, bad news thing. Start with the good news, start with the bad news. Put it away. Okay, put it away. Uh, yeah. This tickled my fancy quite a bit. Um, I think especially for me, what's the hyperbole? I think this is going to be Obsidian's best RPG. Oh, I think more than Fallout New Vegas. More than Fallout New Vegas. I think",
            "start": 455.76
        },
        {
            "text": "fancy quite a bit. Um, I think especially for me, what's the hyperbole? I think this is going to be Obsidian's best RPG. Oh, I think more than Fallout New Vegas. More than Fallout New Vegas. I think South Park: The Stick of Truth. I think if you Yes. I think if you liked Fallout New Vegas, you're gonna find all of that expanded here. One of the things, and I forget if they talked about this in the video or if it was in my presentation, or maybe it was both, but really the idea that this is the first time they've been able to go into this world and this kind of game and this kind of RPG with money and time because of Xbox. And I think it really shines through uh in a number of different ways. And I think there's two big parts to talk about. Number one would be what I think me and Andy complained a lot about in our review. Combat. Yeah. Like it was like combat just doesn't feel good in the Outerorlds. I don't think it felt good back in the Outer Worlds when we played it contemporarily,",
            "start": 500.64
        },
        {
            "text": "a lot about in our review. Combat. Yeah. Like it was like combat just doesn't feel good in the Outerorlds. I don't think it felt good back in the Outer Worlds when we played it contemporarily, let alone now, right? It doesn't feel bad, but it doesn't feel good. There's no oomph. There's no impact. The weapons I didn't think were interesting. I know there's science weapons peppered in, but you could miss them easily and not have anything to do with them. Right? And then more importantly for me, and what I really love of my openw world western RPGs, right, is story, but more importantly customization. What you guys saw in the giant direct and in the story thing is as far as I know the story goes, right? What we played, like I said, was, hey, they gave us three different saves to start from. One that was combat focused, one that was sneaking focused, and one that was science focused. And one of my complaints with Outer Worlds on the replay was, I love being the sneaky person. I love",
            "start": 540.96
        },
        {
            "text": "One that was combat focused, one that was sneaking focused, and one that was science focused. And one of my complaints with Outer Worlds on the replay was, I love being the sneaky person. I love coming in there hacking the system, doing the thing, stabbing the back, being done, da da da da da da. And I didn't think Outer Worlds served that to make that interesting for me or make that feel good. I never felt like I was doing something. My attacks from behind rarely killed people. They weren't doing, you know, like this isn't what I'm looking for from this. So, I went sneaking expecting it to be okay, cool. Like, it's going to be hopefully better, but how good could it be? It's so much better on the roleplaying aspect of it where immediately like when I got in there you you know pull up your radial wheel with all your different weapons andor like things to go in there. And one of the things there is anti addict dematerializer. And so the idea here is that when you walk up on somebody",
            "start": 579.04
        },
        {
            "text": "radial wheel with all your different weapons andor like things to go in there. And one of the things there is anti addict dematerializer. And so the idea here is that when you walk up on somebody now, you know, it's left on the D-pad for how I was playing to stealth them and kill him, right? Uh there was a guy I walked up to and it was like if you hit left, you're not going to kill him. He's too powerful, right? So, I did it and I was able to get him down before anybody noticed it. Left on the D-pad. Yeah. Yeah. For a quick stealth kill, like a, you know, action moment. Bind it to whatever button you want. It ain't about that. But the idea was That's weird as [ __ ] Why wouldn't it just be your melee? I don't I've seen plenty of games to have that have a Usually I think I think of a stealth attack being on like an A or an X or something like that. But yeah, I think I'm just happy that there's a dedicated button for it rather than not having anything. Anyways, that's just weird as I'm",
            "start": 622.4
        },
        {
            "text": "attack being on like an A or an X or something like that. But yeah, I think I'm just happy that there's a dedicated button for it rather than not having anything. Anyways, that's just weird as I'm with I'm with you. Yeah, we're all with you. Rebind it however you want to. It doesn't matter. There's a self kill button. So, you stealth the guy, but then you can use the dematerialized to spray them with acid and their body goes away. That way, other guards wouldn't find the body, right? Oh, okay. Then there was another one uh that I had on my this build, right, that was an N-ray scanner and basically it looks like Star-Lord's mask. You put it over your face and then you see X-ray through all the walls and stuff so you can see the enemies. We saw a couple clips of that where you would it seemed like a momentarily thing. Was it a cool downbased item? It eats up your uh you know the meter you'd usually be using for tactical time dilation. There's more there's more assigned to that. There's",
            "start": 658.72
        },
        {
            "text": "like a momentarily thing. Was it a cool downbased item? It eats up your uh you know the meter you'd usually be using for tactical time dilation. There's more there's more assigned to that. There's different things to go in there. There was like a bubble shield you could put on instead of time dilation. There was time dilation. There was this mask. I'm sure there's going to be a bevy of weapons and things for your play style to go and do that way. Stealth kill on keyboard mouse is a semicolon. Uh but the idea right of going through and having that experience like immediately just from the start and using my stuff like oh wow this feels so different and then we kept I kept running into them and what we had said in our review the hope would be right of them saying hey we're going to have this feel different and look different like I came to a jam door and it pops up and it's like you could open this if you had engineering 7 which I didn't or if you had trait Brrawy which I thought was a",
            "start": 696.8
        },
        {
            "text": "feel different and look different like I came to a jam door and it pops up and it's like you could open this if you had engineering 7 which I didn't or if you had trait Brrawy which I thought was a cool way of like showing that it was the same thing I took a bunch of screen grabs that were I'm not going to show up cuz he ripped off my glasses or whatever, right? And Bronny's just pure strength taking it down. That's that's a trait you pick or whatever from one of your character from when you've been doing this, right? Another thing, you know, Outer Worlds understandably is to the dialogue in the original was so good and so quirky and so fun. Same thing here of coming up to meeting people and then seeing like, okay, cool. I'm an ex-con, right? So, I had this little thing there indicating that that's a line just for me. But then the other ones underneath it, usually you'd see like in a Fallout or something, you know, intelligence plus and to be grayed out and you could read what it is.",
            "start": 740.16
        },
        {
            "text": "that's a line just for me. But then the other ones underneath it, usually you'd see like in a Fallout or something, you know, intelligence plus and to be grayed out and you could read what it is. This one had them has them locked. So it's like requirement not met. So really giving you an experience I feel it's going to be to your character rather than kind of letting me see everything which I'm appreciative. I like that. Yeah. Yeah. Getting in that way. And then yeah, getting to dive into, again, they talked about this in the show. I was excited for it. I think it works well. Uh the skills this time around, right, where in the Outer Worlds one, you got into the minutiae of it. you would go in, upgrade your stealth, upgrade your melee, and up once you got 50 points in there, then it would break off to, okay, now it's one-handed melee, two-handed melee. Uh, dialogue skills, which I always love using, suddenly became, you know, lie, intimidate, persuade, or whatever, and you'd have to do",
            "start": 772.64
        },
        {
            "text": "off to, okay, now it's one-handed melee, two-handed melee. Uh, dialogue skills, which I always love using, suddenly became, you know, lie, intimidate, persuade, or whatever, and you'd have to do those. So, there'd be plenty of times I'd get into conversations, and I had brought up my lie, but I need to persuade here. And so, it didn't work. I was like, that kind of sucks. And it's like, I'm just trying to explore this and have my RPG, my character be in this RPG, a smooth talker or whatever, right? Um, I like the idea here of what they're showing uh and what they talked about there of like now it's just over the top right of like you have guns, melee, sneak, lockpick, engineering, explosives, hack, medical, science, uh, observation, speech, and leadership, right? Those are the skills you're going in, you're putting your points into that then of course dictate uh what perks you're going to get to assign to it, right? And so, did they show you what creating a character would look like?",
            "start": 810.64
        },
        {
            "text": "going in, you're putting your points into that then of course dictate uh what perks you're going to get to assign to it, right? And so, did they show you what creating a character would look like? They did not. This demo started 60% into the game. You were already well on your way. Uh, we were in this demo. But we were entering into a Rift laboratory. Uh you see some of the Rift stuff out there and getting that Rift gun, which again felt so different from Outer Worlds, which always felt so boots on the ground, right? Like I'm here and I'm walking upstairs and I'm going here. But this was I got the rift gun and suddenly then there's the rifts in the world that they talked at a lot about uh in the presentation. But you find these rifts, you zap them, right? And then suddenly there's all these like broken platforms that you can then run and jump. And I we had we all all of the builds had double jump boots on them or whatever. So you could jump and then double jump and get there and you",
            "start": 844.88
        },
        {
            "text": "like broken platforms that you can then run and jump. And I we had we all all of the builds had double jump boots on them or whatever. So you could jump and then double jump and get there and you were platforming. And again, whereas I think uh lots of times in these type of RPGs, whether it be Obsidian, whether it be Bethesda, whether it be somebody else, you feel so heavy and you don't feel like you're turning. Well, like this felt like I was actually first-person platforming in a really com way. Yeah, exactly. And again, that's such a great parallel of what we loved about Avowed was that combat. And to see it come over here again, like I stealth the whole way. I'm killing people, whatever. It pops off. I get out my shotgun. It's a two double barrel. It's got the kick. It feels good. It's taking them down. They're reacting. Eventually at the end, like, you know, the whole thing goes fubar. There's a giant robot to fight. Stealth's no longer the option. I go in there. I get this uh",
            "start": 885.6
        },
        {
            "text": "taking them down. They're reacting. Eventually at the end, like, you know, the whole thing goes fubar. There's a giant robot to fight. Stealth's no longer the option. I go in there. I get this uh light machine gun I had, right? It's And it's like, you know, it's fighting me up. It's fighting me. I got to stay on target. I got to use it that way. I was really impressed with the combat that way, let alone the double jump and using it there. I'm running at the robot. I double jump over him. I'm shooting down on him. like it did not feel as fast, as fluid as whatever as like a Borderlands, but it felt in that vein of like, oh man, this feels like something I'm excited to get into combat for. I saw a couple of people in chat asking uh if you played any of the opening of the game and how that compares to 60 seconds. Yeah. Or I'm sorry, 60% in tossed into these. All three of these saves uh were that. And again, that was the thing. I did so much stealth when it my demo was over. I had like",
            "start": 923.04
        },
        {
            "text": "compares to 60 seconds. Yeah. Or I'm sorry, 60% in tossed into these. All three of these saves uh were that. And again, that was the thing. I did so much stealth when it my demo was over. I had like four minutes to kick into a combat scenario. And again, I didn't have the mask. I didn't have this build didn't have the dematerializer stuff on its hot bar, right? It was I jumped in and they had different grenades and all these things and what they're going with over there. I mean, obviously you jumping on the hyperbole of saying that this is uh I think it could be it could be it could be the best, but I you are a big Fallout New Vegas guy, correct? Like, is that your favorite Fallout? No, no. I I've just started a a true playthrough of Fallout New Vegas. I've tried Fallout New Vegas many times and stopped. I even playing it now. So, Fallout 3 is your your Fallout. Yeah. Yeah. Exactly. That's where I started with. Yeah. Yeah. Yeah. Okay. So, you're saying this might be the best. Where's",
            "start": 961.6
        },
        {
            "text": "and stopped. I even playing it now. So, Fallout 3 is your your Fallout. Yeah. Yeah. Exactly. That's where I started with. Yeah. Yeah. Yeah. Okay. So, you're saying this might be the best. Where's that coming from? Like, what what do you think? I think it's the minutiae of these choices. I think it's it's really getting in there and what we always talk about wanting in these games when we talk about them is, hey, I want to go through and I want my choices to matter and I want it to feel like it wasn't just a binary. I want it to feel like I played incredibly different than Andy and why. And so that I want I I want that experience of coming back and finding out what weapons Andy was using and what his, you know, load out was and why that happened, let alone the fact that I was able to talk my way out of this or talk my way into this and Andy didn't even do that. He did that. Yeah. Like it's it's the thing of like, you know, they they made a big point of the the the flaws system being",
            "start": 997.52
        },
        {
            "text": "my way out of this or talk my way into this and Andy didn't even do that. He did that. Yeah. Like it's it's the thing of like, you know, they they made a big point of the the the flaws system being out there, right? And how flaws were in the original Outer World and they were fine. I added them and I never really thought about them. here with the popping and knees thing as a sneaker. I'm like, \"Oh, I'm gonna get that and I just have to make sure I've cleared the room before that. That'll be fun.\" But to find out what else they have under the hood, and they have it under the hood in a really minor way, too of like uh in of course uh the combat for Outer Worlds, uh we have that inhaler for your medical your medicine, right? Uh it was interesting in the last game, you know, you're you I had like 40 health packs, right? By the time I was to anything that mattered. So, it's just like you're healing all the time. You're not really challenged with it. And a [ __ ] ton of consumables, too,",
            "start": 1032.96
        },
        {
            "text": "like 40 health packs, right? By the time I was to anything that mattered. So, it's just like you're healing all the time. You're not really challenged with it. And a [ __ ] ton of consumables, too, right? This time they've added in this thing called drug crash. It popped in my game when I was in the boss battle. Overuse of the medical inhaler can cause you to experience a drug crash. While crashing, the inhaler is disabled, preventing you from healing further. To prevent crashes, ensure you're watching your toxicity closely. Investing in the medical skill can increase your toxicity as well. So now you have your health bar, but there's also a toxicity meter underneath it. So as you're taking this, it's affecting you. So you can't do what I was doing in Outer Worlds in the final battles, right? better just like [ __ ] I'm Jose Conco every syringe everything I got I'm eating it I'm like oh [ __ ] I'm a [ __ ] psychopath running out there right but so this and these choices like what I",
            "start": 1069.92
        },
        {
            "text": "right? better just like [ __ ] I'm Jose Conco every syringe everything I got I'm eating it I'm like oh [ __ ] I'm a [ __ ] psychopath running out there right but so this and these choices like what I was faced with playing I was like oh man and then thinking back on it again the combat's cool and that'll be interesting and I'm excited to play with that more but for me it is about these really defining my character in this RPG in a way I don't think lots of games do because they give you the taste of the minutiae but still stay very top level. It seems like they are very committed to drilling down on this and making you have your own experience, which could all be marketing. It could be that we are 60% in and I've been playing the whole time and me and Andy really aren't that different. But it really makes me want to when we get this game roll a stealth character, but then also roll a psychopath, somebody they talked about in the thing, right? Like make a guy who looks like the Joker,",
            "start": 1102.96
        },
        {
            "text": "it really makes me want to when we get this game roll a stealth character, but then also roll a psychopath, somebody they talked about in the thing, right? Like make a guy who looks like the Joker, and go through and kill everybody. Roll a dumb guy and just go through and do the make every one of the dumb choices and see how that affects this. It seems like they're making a world. And one of the things the developers kept talking about when we were there were reactive moments, which is the game reacting to what you've built. And again, I think they said it in the presentation a lot of like they know wanted this in Outer Worlds. They had it to some degree, but it wasn't where they actually envisioned it. I feel like this is closer than ever to what Obsidian's been envisioning with the world reacting to what you do, which is what I want out of these games. When I play these games, whether it is New Vegas right now, Fallout 3, Avowed, I want them referencing what I did in the area",
            "start": 1144.64
        },
        {
            "text": "world reacting to what you do, which is what I want out of these games. When I play these games, whether it is New Vegas right now, Fallout 3, Avowed, I want them referencing what I did in the area before. I want them referencing, you know, in in Outer World, there was a big thing, right, where I was going the corporate path. I was kind of being evil cuz I didn't like Phineas or whatever. And then we got to the big moment with like the underling, right? Uh who would be in the final boss if you didn't kill her, but I had to kill her. So, I killed her. And then it was hours later where I showed up somewhere and they were like, \"Oh, well, the corporate people like you, so you're okay in our book.\" And I'm like, \"I murdered all of them and evacuated that building and never came back.\" So, it's like I would have liked to have seen some like I'm hoping for more of that here. And it sounds like that's what they're building for. Uh they're sticking with no respector tutorial. Again, the",
            "start": 1182.56
        },
        {
            "text": "it's like I would have liked to have seen some like I'm hoping for more of that here. And it sounds like that's what they're building for. Uh they're sticking with no respector tutorial. Again, the reasoning being here is from the devs we were talking to, like they want this to feel like a role playing game. They want your choices to matter and be committed. So, they don't want you, man, this is tough for a stealth character. I'm gonna respspec just for this to a melee whatever, drop my points in there, beat the [ __ ] out of everybody, and then go back to it. They want you committed to your journey, which I'm all about. DJ Kento super chats in saying, \"I thought the Outer Worlds episode of Secret Level was really darkly funny, but also sad. I'm wondering if that vibe permeates the game, too. You laughing here? You sad? You getting emotionally caught up?\" I it's so I think that's the big question mark for me of this of like I like what they're saying mechanics-wise both in combat and",
            "start": 1222.08
        },
        {
            "text": "too. You laughing here? You sad? You getting emotionally caught up?\" I it's so I think that's the big question mark for me of this of like I like what they're saying mechanics-wise both in combat and both in terms of choices in my character story overall. Who knows? I didn't see that. What I've seen is what everybody else has seen in terms of the world. Uh you know I think the dialogues I was I was having which was limited because it wasn't that kind of demo was interesting enough. I think there's the usual jokes and things around there. I did notice and I I got kudos from the developers for this of getting called out of like somebody who just put another 40 hours or whatever it was into Outer Worlds going in here. I was like, \"Is it just my is it just my head playing with me or is there less to pick up?\" And they were like, \"No, no, that's a good catch.\" Like, there's far less to pick up in this game because we want what you pick up to matter. In Outer Worlds, it just became you're",
            "start": 1259.36
        },
        {
            "text": "less to pick up?\" And they were like, \"No, no, that's a good catch.\" Like, there's far less to pick up in this game because we want what you pick up to matter. In Outer Worlds, it just became you're picking up everything. You don't give a [ __ ] You're throwing it in. It doesn't matter. We've put fewer things out, but they should matter to your gameplay more. And I thought, okay, that's what I want to hear that, right? And they're talking about this is a bigger game. It's more it's it's going to be obviously size of the areas are bigger. There's a lot more to RPG. There's a lot more equipment. There's a full modding system. This is stuff we didn't get to see, right? And they said this was their quote game is significantly longer than the first one cuz again, responding to the criticism. That's what they said. Holy cow. Yeah. And the first one was like 15, 13 depending on what you did. I mean, you could go longer. And then this is pre-DLC's and everything else like that. I asked them",
            "start": 1298.88
        },
        {
            "text": "That's what they said. Holy cow. Yeah. And the first one was like 15, 13 depending on what you did. I mean, you could go longer. And then this is pre-DLC's and everything else like that. I asked them as a fan of uh Perils of Gorgon and Murder on Aridos like that let you out get I was like that'll let you get wacky. Do you think you're getting did that permeate here? And they're like not really like that's what we want to use that's what we're using those DLCs for in terms of it but this game is going to be set you know and be the outer worlds but hopefully we're giving you enough places to impro improvise and run around and have your own stories like that. any sort of uh did you have any idea of how the NPCs fighting alongside you sort of acted? How was were you ever, you know, ordering them to go attack people or use their ultimate abilities or anything? I had a dude with me. I forget his name. He's one of I think the big military dude, not the little military dude. Uh I didn't he",
            "start": 1333.44
        },
        {
            "text": "them to go attack people or use their ultimate abilities or anything? I had a dude with me. I forget his name. He's one of I think the big military dude, not the little military dude. Uh I didn't he didn't affect or seem to do anything. And I it's one of those where it was done. I was like, \"Oh, was he with me the whole time?\" Cuz I don't remember him shooting or really talking. You know what I mean? Which is both good and bad if you want, I guess. But for me, I wouldn't have wanted him to do much anyway. So when when you were going to the menu and looking to see how you could customize your character, were you seeing your that that sort of squadmate there as well? Similar how not it's exactly how it was before here. Like I said, I have my screenshots pulled up. I might not have that actually as a screenshot, but yeah. See, it's exactly the same thing as before up there. Character inventory, map, journal, companions, right? To go through and switch all your stuff. more importantly and",
            "start": 1378.24
        },
        {
            "text": "as a screenshot, but yeah. See, it's exactly the same thing as before up there. Character inventory, map, journal, companions, right? To go through and switch all your stuff. more importantly and I don't know if I grabbed a screen of it but like I thought it was really interesting this time around where of course Outer Worlds there is a lot of equipment and a lot of gear but it's all kind of sy looking I felt you know what I mean when this being a stealth save my I loaded in and I was in a ghillie suit already which gave me plus 50 or whatever the hell it was but then there was a bunch of other stealth armor there and it all looked dramatically different than the other thing which I love playing dress up in these kind of games let alone now that there's third person to this I thought that a nice thing for me. I guess that's the biggest thing coming off Outer Worlds. It feels like Outer Worlds 2 listened to the most recent review and built the game based on that, which is just of",
            "start": 1413.6
        },
        {
            "text": "that a nice thing for me. I guess that's the biggest thing coming off Outer Worlds. It feels like Outer Worlds 2 listened to the most recent review and built the game based on that, which is just of course the fact that everyone's probably had the same criticism of this game of the original game of how much there's something there and we like it, but it needs to be refined. And I really feel like they've refined it here in that segment after, you know, in that sort of longer showcase after the big Xbox showcase. Immediately I sort of noticed, wow, they're not showing any tactical time dilation. Is that just gone? It's still there. It's still there, I think. I don't know what uh Yeah, I don't have my screenshots in front of me. I edited them specifically. Um it's still there. I don't know what they're calling it this time around or if it is, but it's still there's still a thing that's like TTD. No, that's my grab shield or whatever. So, yeah, that's must be But no, it's still there.",
            "start": 1449.84
        },
        {
            "text": "what they're calling it this time around or if it is, but it's still there's still a thing that's like TTD. No, that's my grab shield or whatever. So, yeah, that's must be But no, it's still there. It's just now one of the consumables uh that'll be on your left bumper. So, like see like here again, I'm sure it's in the footage over there, but these are all like the ones you could put on your left bumper to consume. These are your grenades or your throwables and then these are your weapons. Okay. So, you tap this to you bring to bring that up and then you can select what you want. Obviously, you can go to your inventory and assign it to the hotspots as you remember. Still very much the hot keys as before, but an easier way to get into it I feel like and have Yeah. bubble shield the one that melts things. Uh, and then that might actually be No, that's that's X-ray and that's technical time dilation I think. So, it's more of an item this time around. It's not something that's just",
            "start": 1490.08
        },
        {
            "text": "that melts things. Uh, and then that might actually be No, that's that's X-ray and that's technical time dilation I think. So, it's more of an item this time around. It's not something that's just everpresent apparently. Again, I didn't get the story sides of it. I don't know if it's it might be very similar of like you've enlisted and here's your first device and this thing does all this [ __ ] You'll get more as you go or whatever. Fascinating. Yeah. Anything you're not loving so far? I wish I could have seen more of the story. I mean, I know this is our first blush with it, but I wonder how many deep dives we get uh beyond this. I would have loved to have started a character and see how it starts and go from there and get, you know, the actual back and forth, but that's a hopefully preview event, you know, where you get three hours with the game or something to that effect. That would be it's like why I put the tentative like I think this could be their best. It's I don't know what",
            "start": 1524.56
        },
        {
            "text": "event, you know, where you get three hours with the game or something to that effect. That would be it's like why I put the tentative like I think this could be their best. It's I don't know what the story is going to be. I don't know how it's going to be. I I wonder how people will connect to being a space cop. And I think a lot of that's going to come down and I don't even mean like in the ACAB way, just like, oh, that's not my my vision. That's not what I would want to do as a character. But I think the presentation they kind of gave themselves an out, right, where they said that, but then they were like, \"But why are you there? Are you an Nexcon? Are you this? Are you that?\" So I'm wondering if when you go through and you pick those backgrounds, it's going to be very specific of like to escape. You did this and took this guy's helmet and now you've been here for 3 weeks and you're just trying to get out. I don't know. I remember in a vowed you never getting reprimanded for",
            "start": 1558.56
        },
        {
            "text": "like to escape. You did this and took this guy's helmet and now you've been here for 3 weeks and you're just trying to get out. I don't know. I remember in a vowed you never getting reprimanded for stealing anything cuz you were always the law. But I mean, we we saw in that big demo that you stealing [ __ ] does definitely get you in trouble and people still get angry. Uh cuz I I always thought Avowed had that very it felt like a convenient way to not punish you for for stealing or a convenient way to not have to worry about the authorities coming to get you because you would just steal [ __ ] They'd be like, \"Hey, don't you Oh [ __ ] you're that you're the dude. Oh, go ahead. Yeah, take whatever you want.\" Um, and in this one, seeing that kleptomaniac or whatever was a um a flaw that you could select kind of, you know, it it made me happy that that's at least something that will be punishable. Yeah. you know, a lot of excitement from me just because I love these kind of games, uh, my",
            "start": 1589.44
        },
        {
            "text": "could select kind of, you know, it it made me happy that that's at least something that will be punishable. Yeah. you know, a lot of excitement from me just because I love these kind of games, uh, my favorite genre, but more importantly to get in there and really have that review conversation, maybe even spoiler cast of what everybody else did and how it deviated and what their build was and, you know, oh wow, you're using, you know, science weapons were never my thing in Outer Worlds one, but and I don't think they'll be here, so to see somebody else go off that way. You're just saying one of your favorite genres here with this. I think I know the answer to this question now, but I would like you to kind of like expound a little bit more on the the why of it. But where are you planning to play this game? On PlayStation 5 so you can get trophies or on the Xbox side so you can also play on your ally? This is a fun conversation um we tiptoed on and maybe just my Gregway really did. But",
            "start": 1633.92
        },
        {
            "text": "play this game? On PlayStation 5 so you can get trophies or on the Xbox side so you can also play on your ally? This is a fun conversation um we tiptoed on and maybe just my Gregway really did. But like no like one of the reasons I ate fived the Xbox presentation, right, is three words of Xbox play anywhere, right? Like if if games are Xbox play anywhere, I will play them on Xbox from here on out. Like I love trophies and I always will, but the convenience of I'm getting on a plane and I want to roll a new character or I want to keep going with my save or, you know, I just don't want to deal with spotty Wi-Fi for a PlayStation Portal or remote play on my rag ally, right? Like no, I'm I'm all in on the play anywhere future of Xbox if that's what's going on because I've enjoy that's what this year has been defined by, right? since a vowed started. The reason I was so like, \"Oh man, trying to make all this [ __ ] work for a vowed review was I wanted to be in that system and I started",
            "start": 1669.2
        },
        {
            "text": "this year has been defined by, right? since a vowed started. The reason I was so like, \"Oh man, trying to make all this [ __ ] work for a vowed review was I wanted to be in that system and I started using the Razer laptop, which I also really appreciated, but getting that taste and seeing it kick over to the Xbox and then finally getting the ROG up and running.\" So, uh I don't want to go too long on this, but I am just interested in the thought process on why you would get platinums before of like you want the platinum because it's PlayStation, all that stuff, but like are you still interested in doing the achievements? Absolutely not. It's hilarious. God damn, you're such a monster. You're such a piece of [ __ ] I hate you. Well, it's like one of those things where a Gregway uh you know, Langley Mne who's watching live right now was like, \"Does this mean my Gregway questions getting answered?\" Because I was talking about PlayStation 5 trophies. I'm like, \"Yes, that's that was",
            "start": 1708.72
        },
        {
            "text": "know, Langley Mne who's watching live right now was like, \"Does this mean my Gregway questions getting answered?\" Because I was talking about PlayStation 5 trophies. I'm like, \"Yes, that's that was Langley's question.\" But somebody else on a Gregway comment, I forget if it was I think it might have been Spotify was like, \"Hey, like for Play Anywhere, how does it work with popping achievements?\" And like, \"Oh, like I don't know cuz I just don't like for me personally, I think Xbox and I you could all tell me I'm completely wrong and I'll take that. But as a PlayStation obsessed trophy person coming in, I feel like Xbox has buried achievements where it's like, yeah, they pop, sure, but like it's not on my home bar. It's not on the thing. I got to go I pull up my quick menu and I got to go over and I got I drill into a place where I'm almost like I don't care. Like this is not front and center. And again, it's also the thing remember like trophies. I was playing Xbox before uh when they",
            "start": 1745.84
        },
        {
            "text": "and I got I drill into a place where I'm almost like I don't care. Like this is not front and center. And again, it's also the thing remember like trophies. I was playing Xbox before uh when they had achievements and the PlayStation didn't. And it was very much the I'm so late to this game. I'm not going to chase achievements. It's not my thing. PlayStation started. I was a PlayStation reporter, so it was like, oh, I'm in the ground floor, so I'm going to get trophies, of course, because I'm just doing that. And so, I think above all, when you talk about the shift I'm in right now of moving to being a Xbox play anywhere person, it's just where my life is in 2025 where I don't have the old days of I come home and I play DC Universe online for 12 hours straight and order a patch cheese and eat it all day long, right? Like, that's just not how it is. I'm not that single person nor dating person or whatever where it's like now it is like cool I have the best intentions every night of",
            "start": 1780.32
        },
        {
            "text": "and eat it all day long, right? Like, that's just not how it is. I'm not that single person nor dating person or whatever where it's like now it is like cool I have the best intentions every night of playing whatever for review but maybe I fall asleep in the chair with Ben and I just want to play it in bed before I go to bed. Maybe it is Jen's like we have to spend time together. We're married so I have a glass of wine with her and then I wa she watches Twilight and I play something next to her. Or maybe it is that hey I'm on the review grind as I am right now. I'm going downstairs to the big TV and I'm going to play there. Like and then more importantly than anything it is the cool we are going somewhere. We are on a trip. We're playing here in the off. I I don't know. Whatever. It's like the convenience of having the games anywhere and having it be the game is what it is matters more to me than trophies. Any uh final thoughts on Outer Worlds 2 before we move on? Again, I know I",
            "start": 1821.92
        },
        {
            "text": "like the convenience of having the games anywhere and having it be the game is what it is matters more to me than trophies. Any uh final thoughts on Outer Worlds 2 before we move on? Again, I know I people accuse me of having way too much hyperbole to begin with. I think this is truly special from what I played. And maybe maybe it will be that the overall narrative sucks and whatever, but like the choices and the character creation and like character creation throughout the game of going through and being like I'm going to go through all of these different perks, right? And like do I want to have like I the one that they build here. They have my perks on this stealth save, right, are 10. They they've already done 10 of I have ninja, I have assassin, I have ghost, I have pickpocket, I have trophy hunter, I have like it's all you know in ghost if you are crouched when an NPC starts investigating you gain camouflage for a short duration has a cool like the nerdy nerdy [ __ ] weird RPG",
            "start": 1857.6
        },
        {
            "text": "trophy hunter, I have like it's all you know in ghost if you are crouched when an NPC starts investigating you gain camouflage for a short duration has a cool like the nerdy nerdy [ __ ] weird RPG [ __ ] of this is what gets me excited where it's like oh I'm going to build that but then I look over there and it's like oh man yeah the psychopath thing that they talked about over there or demolitionist or you know brand and it's like all this stuff is like I want to see what all of these are and then actually make choices that I hope matter. the fact that there's fewer things like, you know what I mean? It's not like, oh, I'm putting it I'm early on picking, I'm just going to go with one-handed melee because I got to put the points somewhere, right? The fact that there's bigger choices there that seem to influence these kind of choices more makes it very interesting and appealing to me. Again, as somebody who played out and loved the combat, but didn't connect to the story and also",
            "start": 1898.16
        },
        {
            "text": "there that seem to influence these kind of choices more makes it very interesting and appealing to me. Again, as somebody who played out and loved the combat, but didn't connect to the story and also didn't connect to my character, my build. I was like, I'm just sorting and board, I guess, which is on me. I could have done different things, but I didn't feel compelled to. This one and putting the controller down and walking away left me daydreaming about like, oh, what if I did this kind of character? What if I should I play three saves at once for review? And like I'm popping over after I do a quest with everyone to do something different. That's what I thought. I don't say that often about these kind of games. So, I'm excited. Uh, I just want a yes or no from this. Sure. To end the outer world segment, Starfield was your game of the year a couple years ago despite all its flaws. Yes. Is there a chance that this is better than Starfield in your mind? Yes. a thousand percent. I mean,",
            "start": 1934.0
        },
        {
            "text": "world segment, Starfield was your game of the year a couple years ago despite all its flaws. Yes. Is there a chance that this is better than Starfield in your mind? Yes. a thousand percent. I mean, again, like let's, you know, put aside, you know, all the the bows and arrows and torches here and remind you of like I know why Starfield isn't a great game. Like, you know, I know why people didn't like Starfield for sure. Uh, this one feels Starfield for me was such a personal journey with the bug that I had and this that the other and D. I don't think I'm going to start this game and struggle to be like, who am I? What is my character? Like again, what I thought Avow did so well and I praised it in previews and even you know Outer Worlds did originally but not I don't think as well was here's your backstory, here's your thing here like three different puzzle pieces immediately to say all right you have a vision of who your envoy is. What are you going to do with it? Taylor Swift. Uh",
            "start": 1971.36
        },
        {
            "text": "your backstory, here's your thing here like three different puzzle pieces immediately to say all right you have a vision of who your envoy is. What are you going to do with it? Taylor Swift. Uh yeah, I did no I did somebody else for that. I forget what it was for my vowed character. Is it going to be Taylor Swift for the for I doubt it. No, I've gotten to a different place with that as well where, you know, I go in there and I compose at the keyboard. I'll make all the different choices and see who it Now, wasn't Taylor Swift and Outer World DS, but that was because of the perk I put on it where she used to be the mascot. Remember, she was the mascot. Poses at the keyboard, everybody. Uh, we're going to keep talking about video games, including Invincible versus after a word from our sponsors. This episode's brought to you by XRE. Y'all know that a few months ago, my life changed forever when I brought a pair of XRE1 AR glasses on a long flight to New York. I legit could not believe",
            "start": 2010.32
        },
        {
            "text": "This episode's brought to you by XRE. Y'all know that a few months ago, my life changed forever when I brought a pair of XRE1 AR glasses on a long flight to New York. I legit could not believe how easy it is to use and high quality my experience was playing games, watching movies, TV shows on the plane without just too much extra stuff around me or especially not a giant goofy headset around my head. No joke, this is my favorite new tech product in years and it has earned a permanent spot in my travel bag. It is only hard to believe that it works as well as I'm saying until you try XR1 AR glasses for yourself and then you will see that the future is now. The tech is here. Connect XR1 glasses to wherever you are playing. Whether it's a handheld console, a PC, phone, home console. You just get a massive 150in virtual screen anywhere, anytime for any game. Gaming on the go like a long haul flight, you need the XR1. Next, starting to hurt from staring down at your handheld, we've all been",
            "start": 2046.08
        },
        {
            "text": "a massive 150in virtual screen anywhere, anytime for any game. Gaming on the go like a long haul flight, you need the XR1. Next, starting to hurt from staring down at your handheld, we've all been there. You need an XR 1. A screen as big as your wall. Instant plugandplay with all of your devices via USBC. Built-in audio with sound by Bose anchoring your screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full HD. These are what make XR1 a musthave. And we hear XR1 Pro is coming soon with an even bigger virtual screen. Hit our link below to get your XR glasses today. There's nothing better than when a sponsor of Kind of funny is something that we are legitimately obsessed with, and that is exactly the case here with XRE. You're going to hear me talking about these forever. Go to kind offunny.com/xreal. That's kind of funny.com/xr. I promise you, you are going to love these things. This episode's brought to you by Factor. Summergamefest is here. The Switch 2 is",
            "start": 2096.96
        },
        {
            "text": "forever. Go to kind offunny.com/xreal. That's kind of funny.com/xr. I promise you, you are going to love these things. This episode's brought to you by Factor. Summergamefest is here. The Switch 2 is here. The sun is here. So many summer things are here. And the number one thing you don't want to be doing all summer, spending hours cooking inside. That's where Factor comes in. Factor chef crafted dietitian approved meals are ready in just 2 minutes. taking the hassle out of eating. Well, we love Factor here at Kind of Funny and Greg's often making and enjoying meals quick in between shows here in the studio. I just had a roasted garlic chicken and I'm telling you, you would have loved it. Factor meals arrive fresh and ready to eat, perfect for any active lifestyle over summer and beyond. With 45 weekly menu options, you can pick gourmet meals that fit your summer gains and goals. Choose from options like calorie smart, protein plus, keto, and more. Get started at",
            "start": 2146.8
        },
        {
            "text": "summer and beyond. With 45 weekly menu options, you can pick gourmet meals that fit your summer gains and goals. Choose from options like calorie smart, protein plus, keto, and more. Get started at factormeals.com/kindfunny5050 off and use code kind offunny50 off to get 50% off plus free shipping on your first box. That's kind of funny off at factormeals.com/kindfunny50 off for 50% off plus free shipping. Factomeals.com/kindfunn 50 off in the YouTube chat. So lipsis wrote Greg likes starfield and dislike Indiana Jones. Just remember that. Yes, I did. You stupid [ __ ] Yeah. Jesus Christ. You stupid. Just go to Metacritic and rank them by score if that's the opinion you want. Wait till the Outer Worlds is out and then just rank everything by score and decide what's the better game and what you want to do. You're here for [ __ ] opinion, you stupid idiot. Drives me crazy. I'm with you. Thanks for supporting. I'm the one drinking the Coke. Grace not even drinking a Coke. I had enough.",
            "start": 2188.96
        },
        {
            "text": "you want to do. You're here for [ __ ] opinion, you stupid idiot. Drives me crazy. I'm with you. Thanks for supporting. I'm the one drinking the Coke. Grace not even drinking a Coke. I had enough. Getting fired up. Maybe I will. Yeah. Stupid [ __ ] Um, Invincible versus That's a good intro to Invincible. Exactly right. They did exactly what they did in the uh showcase as well. Um you got to play it this fighting game u from Skybound Games, their new developer, Quarter Up. Quarter Up. Pretty cool 3v3 tag fighting game set in the Invincible universe. How long did you get to play and what did you think? So about 3 weeks ago, I got to go down uh to the animation studio where they animate Invincible. Um and I was there for about an hour. The first half was them showing us the trailer and then presenting the game to us and talking about it and then I got to spend about 30 minutes with my hands on the sticks and it was me and a developer and I was playing and he was telling me certain things",
            "start": 2238.08
        },
        {
            "text": "the game to us and talking about it and then I got to spend about 30 minutes with my hands on the sticks and it was me and a developer and I was playing and he was telling me certain things of like how certain mechanics work and question for you real quick. What up? Your hands on the sticks at this point. Blessing at Aoya Jr. 2025 fighting games are back bigger and better than ever. Are sticks actual arcade fighting sticks or are you still on the controller? I'm still on the controller. I'm still on the controller. Right. Like for me it's I I have fighting I have multiple fighting sticks. I even have on my desk a um not hip-hop but loverless uh fighting stick that I have there just for aesthetics just for aesthetics honestly like I've really tried with the stick. I just can't I'm part of the culture but you know yeah I'm part of the culture but like I'm using a controller cuz that's what I'm used to and that's what I'm going to kick ass with. Uh and so yeah they gave me I think it was",
            "start": 2285.36
        },
        {
            "text": "culture but you know yeah I'm part of the culture but like I'm using a controller cuz that's what I'm used to and that's what I'm going to kick ass with. Uh and so yeah they gave me I think it was an Xbox controller honestly. Um but I went down Yeah. Three weeks ago, I walk into the the animation studio. I looked around and I was like, \"Huh, so this is where y'all be taking forever at this where you'll be taking your sweet time making Invincible season 3 or four or whatever on right now.\" Um, yeah. So, I got to play 30 Minutes. And Greg, I'm curious cuz it sounds like you got to check it out, too. Yeah. Did you play it? Yep. Hell yeah. I can't wait to talk to you about that. Um, I have a lot of takeaways. So, we saw this a couple of days ago. It was revealed at the Xbox showcase on Sunday and then the studio got a press release on Monday kind of breaking down a little bit about uh Quarter Up at that reveal. I think all of us were kind of trepidacious about all right like you know",
            "start": 2320.8
        },
        {
            "text": "and then the studio got a press release on Monday kind of breaking down a little bit about uh Quarter Up at that reveal. I think all of us were kind of trepidacious about all right like you know we're seeing this after the Marvel fighting game was announced. Oh, we got 2X KO. Oh man, it seems kind of like a crowded space. Oh, this is an original studio under Skybound. Now that I can actually talk about this freely, my main takeaway from my preview is that one, this game is early. the studio started in 2023 and playing the game and feeling and getting my hands on it right feels kind of early. Um, this game might be niche compared to a Street Fighter or Mortal Kombat, but I do think that this game will find its place. I think this game from my limited time with it was very fun to play. I like it visually. I like it conceptually. I totally understand the um the concern around Invincible as an IP. Is there enough meat there to garner a community of like a fighting game based community? Is",
            "start": 2357.52
        },
        {
            "text": "it visually. I like it conceptually. I totally understand the um the concern around Invincible as an IP. Is there enough meat there to garner a community of like a fighting game based community? Is this the right direction? I think it is. I think that with the characters you have here and the team you have working on it, that's the place to start with it cuz this is QuarterUp Studios. Like I mentioned, they started in 2023, this studio is a majority of is majority made up of people that worked on Killer Instinct 20 2013, which was the Xbox One launch Killer Instinct. That studio went on to be um uh taken by Amazon and the development for that game taken. Shut up, get in the car. But yeah, and that the development for that game uh got passed on to Iron Galaxy and they saw it through post-launch updates and all that stuff. And so Amazon ended up adopting that studio, having them work on their internal games. And a lot of the people that worked at that studio ended up leaving, right? And",
            "start": 2400.24
        },
        {
            "text": "updates and all that stuff. And so Amazon ended up adopting that studio, having them work on their internal games. And a lot of the people that worked at that studio ended up leaving, right? And um this game was pitched to Skybound from people originally from that studio, higherups from that studio that were like, \"Yo, we want to make an invincible fighting game.\" And so this is coming from people who want to make this game, right? This isn't a Skybound, we want to make a fighting game. Let's search out some people. Let's do this. No, this is people who are I would describe as fighting game sickos. Like one of the first things I heard when I walked in were like the studio heads. They were like, you know, chilling, waiting for everybody to get there for the presentation cuz they're like doing it in groups of four media people at a time. and they're sitting around like the donuts and food that were there and they were talking about Marvel vs. Capcom as soon as I got there. They were",
            "start": 2451.52
        },
        {
            "text": "doing it in groups of four media people at a time. and they're sitting around like the donuts and food that were there and they were talking about Marvel vs. Capcom as soon as I got there. They were already talking about other fighting games and [ __ ] and getting real nerdy about it which uh had me excited. But uh this is a 3v3 tag fighter um slated for 2026. Um it's on everything and talking more about my takeaways from it of playing it. It is colorful. It is vibrant. is very violent, which I like, and it feels like a meld of certain things picked from certain other fighting games, right? You got the 3v3 from Marvel vs. Capcom. You got the superhero sort of feel in combat of something I'd say like an Injustice and then you also have, yeah, the violence of a Mortal Kombat minus the fatalities, right? But you do have essentially brutalities where there are certain ways that you end matches that'll explode somebody's head or explode somebody into a million pieces. I was like, \"Do you",
            "start": 2486.48
        },
        {
            "text": "right? But you do have essentially brutalities where there are certain ways that you end matches that'll explode somebody's head or explode somebody into a million pieces. I was like, \"Do you have fatalities?\" They're like, \"No, you're just going to punch them to death.\" Yeah. Cool. Exactly. Um, they also have custom intros for certain characters where you'll enter a fight and it is Mark saying something to Omniman. In the build that I played, they only had four characters. They had Mark, they had um Adam, they had Thula, who's one of the ultramites, and then they had Bulletproof. Exact same build I had. Cool. Yeah. And then I one of the questions I asked was how many characters are we looking at? Exact same question I asked. I counted I literally counted the character slots and there were 17 character slots. But when I asked them, they were like, \"Hey, we're still figuring that out. We want to like, you know, that's one of the things that we're still working on for launch is seeing",
            "start": 2531.36
        },
        {
            "text": "17 character slots. But when I asked them, they were like, \"Hey, we're still figuring that out. We want to like, you know, that's one of the things that we're still working on for launch is seeing what characters we can get in there. And one of the other questions I asked was, what is the challenge of making a game that has a lot of people that are just very strong Superman style heroes? And they talked about how they were looking at certain character qualities and character aspects and making them feel original. Mark, for example, is like a straightup brawler, right? Very physical character. You have Adam Eve, who is very projectile based. Um, Thula though is mid-range because she has like that long ponytail that she'll use to like kind of like almost like a scorpion style throw at you to pull you in sort of thing. Bianca Belair. Yeah. Yeah. She has the Bianca Belair little whip action. Yeah. So, they balanced that a lot as far as how they're approaching these different characters.",
            "start": 2565.52
        },
        {
            "text": "to pull you in sort of thing. Bianca Belair. Yeah. Yeah. She has the Bianca Belair little whip action. Yeah. So, they balanced that a lot as far as how they're approaching these different characters. But one of the things I really liked as well was the tag format where I'm like, \"All right, cool. I'm do I'm using those three cuz I'm not really a bulletproof guy.\" Um, you're not? No. Yeah. But like in in getting my hands on it, right, it is pretty simple to control. You have your light, medium, heavy, but then you also have um a tag button and you have a special button. Specials are uh work kind of like in Smash Brothers where uh you press a direction and you press A. Um and it's using a special, right? They wanted to develop this game to be friendly for casual players, newcomers, all that stuff. But then also they described it as a tournament quality brutal fighting game. Um and they didn't really name drop EVO as much, but they made it seem like, yo, we want this game to show up at",
            "start": 2598.64
        },
        {
            "text": "stuff. But then also they described it as a tournament quality brutal fighting game. Um and they didn't really name drop EVO as much, but they made it seem like, yo, we want this game to show up at EVO. We want this game to show up um at those spots. in in a lot of ways in that way it feels like a Dragon Ball Fighters where Dragon Ball Fighters had the auto combos. Dragon Ball Fighters had the easy special moves to do. Dragon Ball Fighters I I forget if Dragon Fighters did this, but this game has like the if you hold or tag your tag button while doing a combo, it'll automatically tag out and continue your combo with the player that you tag in, right? Like this game controls the way that you'd want it to control for a 3v3 tag game. And I had a lot of fun with it. Greg, what did you think? Uh yeah, I'm not the fighting game guy, right? So when you know we heard Invincible Game, I was like so stoked. Then it was fight. I'm like, \"Oh, okay.\" Sitting down and playing it like I don't know",
            "start": 2638.08
        },
        {
            "text": "Uh yeah, I'm not the fighting game guy, right? So when you know we heard Invincible Game, I was like so stoked. Then it was fight. I'm like, \"Oh, okay.\" Sitting down and playing it like I don't know what I'm doing obviously. You know what I mean? And I was sitting with you know the gameplay director or whatever his title was. So there was no chance for me to actually play somebody also who didn't know what they were doing. Uh it's really pretty. Uh I'm always going to be down for more invincible uh you know anything. Uh the blood of it was nice. I think the tag stuff was cool. I was playing on simplified controls. they said. Uh, so it was easy to call in support and get them in. You know, they were teaching me the combos to get people to come in. Like that right there where the blue invincible came in to help out Eve and stuff. Uh, but it was Yeah. Cool. But I was so thankful you had played it ahead of time. Yeah. Because Yeah. I was like, I got I don't you know what I mean? Like I I",
            "start": 2676.64
        },
        {
            "text": "came in to help out Eve and stuff. Uh, but it was Yeah. Cool. But I was so thankful you had played it ahead of time. Yeah. Because Yeah. I was like, I got I don't you know what I mean? Like I I don't know if it's good, bad, or other. It was pretty and it was fighting and it was bloody. But it's that same thing. I was like, is there a story mode to this? Like Yeah. Cuz I was like, you know, in you know, uh, Injustice, right? Like yeah, we're going to have that. I'm like, okay, cool. But I don't even know what that if I actually play it. That was one of the things that I didn't get clarification on. Forgot to ask. Also, one thing to shout out is that this is pre-alpha gameplay footage. I think I don't know if we're blocking it with our video, but they wanted us to shout that out. But yeah, that was one of the things I was mainly concerned about when I'm thinking about things that might bring it forward and things that might hold it back cuz as I'm playing this, I'm like, \"Oh, this is",
            "start": 2711.36
        },
        {
            "text": "that was one of the things I was mainly concerned about when I'm thinking about things that might bring it forward and things that might hold it back cuz as I'm playing this, I'm like, \"Oh, this is something that I think the fighting game community is actually going to like a lot.\" Like I mentioned, it's not on that Street Fighter, not on that Mortal Kombat level of it, but I do think it's good enough to where you could see a lot of hardcore fighting game uh community get into it. But I was thinking about the Greg Millers of the world, people that I know might love Invincible but might not love fighting games. And coming out of it, I was like, man, I wish I I asked about a story mode because Invincible as an IP, if you're putting if you're putting out an Invincible game, you should have a story mode that does something with those characters that might get you interested. Yeah. Just like Injustice did, right, where Injustice one, I suffered through the entire thing to see the story.",
            "start": 2741.6
        },
        {
            "text": "a story mode that does something with those characters that might get you interested. Yeah. Just like Injustice did, right, where Injustice one, I suffered through the entire thing to see the story. Yeah. Yeah. Do you think that they Is there any part from either of you that you think maybe they showed this off a little too early? I see I I wonder cuz like it says 2026 in the trailer I believe. I don't know if I believe it yet. Maybe once we get closer to it like things start to ramp up or maybe this is one of those games where they're like, \"All right, we launch it. It's barebones, but we're going to improve it as it goes.\" That's what I think. I I see this coming out very early 2026 and then kind of just doing what it does. Yeah. I honestly part of me would like it to get delayed to 2027 cuz when we're talking about 2026, we're talking about 2x KO and I believe Marvel the fighting game that just got announced got in 2026. Yeah, Tolken Fighting Souls. I believe that got a 2026 window",
            "start": 2775.36
        },
        {
            "text": "cuz when we're talking about 2026, we're talking about 2x KO and I believe Marvel the fighting game that just got announced got in 2026. Yeah, Tolken Fighting Souls. I believe that got a 2026 window as well. Correct me if I'm wrong. I don't think this game should come out the same year as those games, right? I think this game has a really good opportunity to capture an audience. But three tag fighting games in the same year, I think is going to do is not going to do this thing the justice it deserves. Um, and I think they they have their heads on straight as far as like their approach to it. The combos felt fun. The combos kind of reminded me a little bit of uh Killer Instinct from 2013, right? The violence of it I think is novel in the way that like usually only Mortal Kombat is like the the franchise, the fighting game franchise that has like the blood and the splatter and all that stuff. I like what they're doing uh here with that. Honestly, it reminds me if we're putting talking",
            "start": 2819.28
        },
        {
            "text": "the franchise, the fighting game franchise that has like the blood and the splatter and all that stuff. I like what they're doing uh here with that. Honestly, it reminds me if we're putting talking about tiers of fighting games, right? I'll put this somewhere around that Fatal Fury, if not maybe even above Fatal Fury as far as like how expensive or non-expensive or how budget it might feel. Like I think there will be a community for this, but depending on how it gets placed, depending on where it falls, it could be a challenging thing. Did you ever play Power Rangers Battle for the Grid? No, I didn't. because that I keep thinking of that game seeing this and like talking about even it being based on IP that is like people like but it's not you know something that I think is going to bring in millions and millions of people but Kev can you bring up Power Rangers Battle for the Grid? Uh cuz I haven't seen gameplay of that in years so I want to just make sure that I'm not like totally",
            "start": 2859.12
        },
        {
            "text": "in millions and millions of people but Kev can you bring up Power Rangers Battle for the Grid? Uh cuz I haven't seen gameplay of that in years so I want to just make sure that I'm not like totally talking out of my ass here. Like I think that it's fairly similar. I think this is more Marvel vs Capcom tag fighty than that one is. But um you saying that you'd put this potentially even above a fatal uh fury. That surprises me cuz I I know that that is a lower end fighting game, but it's still at its core like a proven entity in the space and like does every once in a while show up at a EVO or something. Well, I I think the reason I for me I'm looking at it as presentation and how good it feels to play and Fatal Fury the the latest one, City of the Wolves, that feels good to play and that looks good, but you can tell like it's like this is nowhere close to a Street Fighter kind of thing. I think from what I played in Invincible Versus, I think it's I think it looks better and it's going",
            "start": 2896.72
        },
        {
            "text": "good, but you can tell like it's like this is nowhere close to a Street Fighter kind of thing. I think from what I played in Invincible Versus, I think it's I think it looks better and it's going to play better than Fatal Fury in my opinion, right? And like I played more even King of Fighters 15 uh than I played Fatal Fury. Invincible Versus has the stuff. And even as I'm looking at this, I totally understand where where you're coming from, Tim. But I I I do think the 10 years ago as well. So Oh, gotcha. Gotcha. Gotcha. Yeah. I think the pedigree of the the people working at the studio here might speak more towards like it just feels a bit more natural. It feels right. Fighting games in terms of game feel oftent times like it's very it's very clear when something when a game doesn't have it. I think this game has it like and another thing to mention too of some things it does, right? It has like um they call them they have devastation arenas and they also have this thing called arena",
            "start": 2937.68
        },
        {
            "text": "it. I think this game has it like and another thing to mention too of some things it does, right? It has like um they call them they have devastation arenas and they also have this thing called arena shifts, right? Um in quite a few of the areas uh there's a stage that's like the city stage that you're playing at. And as the fights progress, you have [ __ ] destru uh getting destroyed in the background. And like the stage looks completely different from the beginning of the match um versus the end of the match based off of like the destruction that happens. Uh but then also midway through they have special moves where if you do it you can knock somebody all the way to the moon and then all of a sudden like you're playing on the moon kind of thing. Yeah. Like they have th those novel things. Now again I think because of the IP maybe that lessens like the it does this weird thing where I think it concentrates like the amount of people that might be interested in an invincible thing but",
            "start": 2976.08
        },
        {
            "text": "Now again I think because of the IP maybe that lessens like the it does this weird thing where I think it concentrates like the amount of people that might be interested in an invincible thing but also then captures the people that are already into invincible. So, I I do think there's the double-edged sword, and that is probably where the Power Rangers thing comes from as far as all right, we're talking about Invincible here, and you're turning that into a fighting game. But, I also think the fighting game community, if you make something that plays really good, IP almost doesn't matter. Like, I IP can just be like kind of the flavoring to, oh man, no, I just want to play Invincible versus cuz the game is fun. Yeah, cool stuff. I hope it has a story mode. I wouldn't play through that. Uh, Greg. Yeah. Last game we're going to talk about today. Grounded two. Grounded two. What a surprise. Yeah, I did get to play it. I did get to play it. Yeah, it was a surprise, right, of like, oh, I",
            "start": 3015.28
        },
        {
            "text": "Greg. Yeah. Last game we're going to talk about today. Grounded two. Grounded two. What a surprise. Yeah, I did get to play it. I did get to play it. Yeah, it was a surprise, right, of like, oh, I didn't third game from Obsidian this year. Uh, yeah, Grounded Two, the sequel to Grounded One, of course. Uh, and it's one of those I played Grounded One on launch night in early access where I got on there and I was like, \"Okay, this is cool.\" But as they pointed out in their direct, right, there's no like you're playing it and there's no The story ended so quickly, it wasn't even there, right? is paper thin and obviously over years they added that as they went and and put more stuff in there which I appreciated. Um jumping into this one though and Kevin yeah you got to skip to the uh very end of this like because you have the direct and then you have worlds direct and then you have uh grounded at the very end. You just toss the grounded trailer too if you want. It won't be that long of a",
            "start": 3054.88
        },
        {
            "text": "of this like because you have the direct and then you have worlds direct and then you have uh grounded at the very end. You just toss the grounded trailer too if you want. It won't be that long of a preview. uh to get in there and get on six of this. I would say I went from oh okay we I didn't you know the way it worked for this is that you know you they were like we have an embargoed you know there's a behind closed doors for an unannounced game do you want I'm like yeah I'll take anything I can get or whatever instead of jumping I was like oh this I don't know if I would have needed to see and playing it I have opinions I I what what's going to happen is this is going to launch in early access again game preview and I will be there on night one like I I enjoy Grounded that much I had come back when they did the the 1.1 or 1.0 0 release or whatever it was with Mike where I jumped in there and had it and played around with it and they enjoyed it more. Uh, this one they're very clear",
            "start": 3096.48
        },
        {
            "text": "back when they did the the 1.1 or 1.0 0 release or whatever it was with Mike where I jumped in there and had it and played around with it and they enjoyed it more. Uh, this one they're very clear of like they understand that criticism. They're starting this one with a a story. This is act one of the story for the kids lost uh this time in the park rather than the backyard. The first thing that spoke to me and this is somebody who again played Grounded on Night one and then 1.1 is how much better this one ran. Uh, and granted it's not fully live so we'll see if that actually happens when we're on real servers, but playing it uh I was like, man, this is running really well and it's looking really cool. um you know the bells and whistles they're getting in there and talking about we had a this is a similar thing where we played for I want to say 30 minutes and then had the interview time with them at the end of it or whatever and one of my questions was you know the story for me in my",
            "start": 3135.6
        },
        {
            "text": "this is a similar thing where we played for I want to say 30 minutes and then had the interview time with them at the end of it or whatever and one of my questions was you know the story for me in my head of Grounded the original was the hey they they were one of the first big ones to do early access on Xbox and really add to it and it was Obsidian doing it. Why not just add to Grounded One? Why are we restarting? especially when they they they were boasting, you know, 25 million Grounded One players and they were very honest and open like listen, Grounded One had to run on the Xbox One and so that really hampered us in terms of what we could do. He's like the team originally, the original team on Grounded One, they wanted mounts, which of course they have mounts in this that are called buggies cuz they're buggy and they couldn't do that. They wanted this, they couldn't do it. So like it really was if we wanted to capitalize on what we had with Grounded One and make something here, we",
            "start": 3169.2
        },
        {
            "text": "cuz they're buggy and they couldn't do that. They wanted this, they couldn't do it. So like it really was if we wanted to capitalize on what we had with Grounded One and make something here, we had to jump and do it Grounded 2, which works for me and is exciting for me. Um, if you've played grounded, it was very similar to that. Of course, I woke up, I ran into my research station, found ro raw science, and, you know, did this, made that, followed the tutorial of making the different things I was making. What was interesting and as a shakeup from this time around is you now have an omni tool. So, rather than have to carry, I'm carrying, you know, the axe, I'm carrying the etc., I'm carrying the whatever the things to help you craft, you get one omni tool that can be all of those things. So, saves you on inventory space, which obviously is a big deal. The buggies are a big deal obviously because you can ride them to traverse the much larger map quicker, but they can also cut things",
            "start": 3207.84
        },
        {
            "text": "So, saves you on inventory space, which obviously is a big deal. The buggies are a big deal obviously because you can ride them to traverse the much larger map quicker, but they can also cut things down faster, right, when you need the big blades of gl grass. Uh they can also carry the planks for you so you can carry more stuff. It's it's you're getting in there and using them to kind of mid-max slash expedite uh what you're doing uh in terms of the game. But uh you know I the story was forefront of this uh you know you get you like I said you you show up you're shrunk down you immediately go into the science center and you know there's this message from Sloan Bob who's like the corporate overload of this whole thing like giving you very good narration throughout what's going on being very funny and cheeky about what's going on. Uh Burgle of course the robot we all love he's in distress calling for your help cuz somebody's removed his head from his body. So, you're already set off to",
            "start": 3244.72
        },
        {
            "text": "funny and cheeky about what's going on. Uh Burgle of course the robot we all love he's in distress calling for your help cuz somebody's removed his head from his body. So, you're already set off to go do that thing and you know, you're in there eventually start talking to Sloan and that's where it feels very obsidian RPG-ish, right? Where I'm choosing I'm choosing my answers. I'm choosing what I'm saying. I'm choosing what I'm doing. Uh, so that I can go out there and do that. Uh, like I said, it was more grounded from somebody who's not the world's biggest grounded fan. Uh, it does obviously feel much improved in terms of how it plays, how it runs, these little bells and whistles and quality of life things. And so I'm excited for night one to jump back in and see what I think of it. But I don't know if it will grab me and keep me around because I'm just not the crafting guy. Like I just don't want to craft the lean to this thing to that thing. Were you playing solo or with any devs?",
            "start": 3286.32
        },
        {
            "text": "I don't know if it will grab me and keep me around because I'm just not the crafting guy. Like I just don't want to craft the lean to this thing to that thing. Were you playing solo or with any devs? No, we were playing solo. There was a bunch of there was lots of us in there on like maybe eight stations, maybe 10. Uh but no, they were all single players uh stories we were going through. I didn't get uh my Pringles with my Walmart order too. Um, but a couple nights ago, I ordered uh just some Door Dash for me and G to eat dinner, and it came with a a secret delight cookie, a little chocolate chip cookie that I didn't order, but they're just like, \"Here, this is for you.\" And I I ate it, but I didn't realize I I some of it was left on my table. No, it ain't. And uh when last night I came and um I it was moving and I'm like, \"What the fuck?\" And it was a [ __ ] ant. And I thought I was like, \"There's must be like many ants.\" And it was just like one goddamn ant. This [ __ ] thing",
            "start": 3321.68
        },
        {
            "text": "came and um I it was moving and I'm like, \"What the fuck?\" And it was a [ __ ] ant. And I thought I was like, \"There's must be like many ants.\" And it was just like one goddamn ant. This [ __ ] thing moving, Mike. Oh yeah, these ants are powerful. I knew that, but I'd never seen it in action quite like this. It was one of those moments I had to call GM, like, \"Hey, you need to come see this shit.\" The science books were right. Crazy, man. Yeah. Grounded too in early access soon. Strong can't. Just want to tell that story. I saw a real strong ant the other day. The other thing to toss out I think that's interesting, right, is what they were saying of again dropping this with act one. They want to do bigger updates that are further spread out. So, they were talking like maybe four to five months on content updates between them rather than peppering in a little thing here and there and then having people like me be like, \"It's not that much different. It's not what I want.\" Uh, Dan says,",
            "start": 3364.72
        },
        {
            "text": "on content updates between them rather than peppering in a little thing here and there and then having people like me be like, \"It's not that much different. It's not what I want.\" Uh, Dan says, \"The Steam reviews for Mind Eye are coming in and it's looking like I should get my popcorn out.\" Well, everybody, you should get your popcorn out. Hold on. Yeah, that's actually a great one. I put it into random. Uh, [ __ ] [ __ ] [ __ ] [ __ ] [ __ ] While we were live, I got an email about the Mind's Eyes codes we've sent, and it's I've I've been asking repeatedly, can we get a code for Mind's Eye? Can we get a code? We did the Google form. We did everything. Hi, Greg. Thank you for your patience and your interest in reviewing Mind's Eye from Bill the Rocket Boy and II partners. Due to the limited allocation of codes available for review purposes, we are unable to accommodate your request this time. Damn. We'll be sure to reach out soon if we have an update. Please don't buy it. What was",
            "start": 3406.32
        },
        {
            "text": "allocation of codes available for review purposes, we are unable to accommodate your request this time. Damn. We'll be sure to reach out soon if we have an update. Please don't buy it. What was the thing that the developers say? Weren't they like claiming that people were being persuaded not to There was They were thinking there were shenanigans. Persuaded. Yeah, they were thinking there were shenanigans on their reviews and then did you see that then somebody asked the IO uh the IO interactive CEO and he's like no we don't believe that I was like they're minds looking great everybody looking forward to this game the final super chat of the day DC103 says yo Tim first super chat ever have you seen the Ray Neo switch dock not 100% sure but I think it works with the X-roll glasses love from Ireland to all I have not I'm looking into it now thank you very much for sending this my way uh everybody like we were saying, um, actually we got one more super chat. Zeke speaks saying, \"Usually",
            "start": 3441.44
        },
        {
            "text": "Ireland to all I have not I'm looking into it now thank you very much for sending this my way uh everybody like we were saying, um, actually we got one more super chat. Zeke speaks saying, \"Usually not a crafting/ survival guide, but Grounded hits different. My partner and I have put 60 plus hours into it. Something about the handcrafted world and writing makes it stand out.\" Nice. So, hell yeah, man. A cute game for sure. Check out Grounded 2 when it hits early access very, very soon. Um, and speaking of soon, we're about to play Mind's Eye. I can't wait to see Mike and Nick in this journey. How will it go? I hear the first like two hours is all cut scenes, so love it. Not great. Fun times everybody. Uh, until next time though. Love you all. Goodbye everybody. Another preview tomorrow. [Music]",
            "start": 3483.28
        }
    ]
}