{
    "id": 369,
    "video_id": "Y3lig2H2CD0",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "How New Zealand Made Me Feel Stupid - The GameOverGreggy Show Ep. 36 (Pt. 4)",
    "description": "Full Episode Friday! Get it EARLY here! http://gameovergreggy.bandcamp.com\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1407913202,
    "duration": 1420,
    "transcript_chunks": [
        {
            "text": "my topic yes this can be summed up with two words new zealand i will take you back to last week's The GameOverGreggy Show we're talking about Monopoly colin tells me about a good documentary Under the Boardwalk about these professional Monopoly players are going like to and that's how it opens what a great song I so happy they used that um but they go and they you know it's these people they're playing through the Monopoly World Tournament yada y y blah BL blah they have different every country has a representative at this thing and they're going through and they're showing the different people winning who they are you know England and Africa they're bumping around doing all these different things not Africa obv then there they jump over and they're like New Zealand's winner and they panned the globe to show you where new zealand was and i realized i had no earthly idea where new zealand was now in the car i mentioned this and don't ask colin because he knows exactly where it is",
            "start": 1.1
        },
        {
            "text": "Panned the globe to show you where New Zealand was and I realized I had no earthly idea where New Zealand was now in the car I mentioned this and don't ask Colin because he knows exactly where it is, no, no, that's the whole thing. He likes I want we're we're about to go on this for a while. Nick, do you know where New Zealand is? I want to say now I don't know 100%, but I want to say it's near Australia. It is; it has to be yes, it's south of Australia, right? No, no, southeast. It's one of the islands, right, like by Australia, right? It's like it's like a ripple; it's New Zealand and then there's another one that's right by it, right, like what Tasmania or whatever I don't know. It's an archipelago or something like that, right, archipelago, whatever. See, I know this. New Zealand is two big islands. Big Island singer, oh okay, I know she was from New Zealand; I thought she was from Australia because when she talks, she kind of has that accent. I'm like, \"Oh, that must be near.\"",
            "start": 40.88
        },
        {
            "text": "New Zealand is two big islands. Big Island singer, oh okay, I know she was from New Zealand; I thought she was from Australia because when she talks, she kind of has that accent. I'm like, \"Oh, that must be near there.\" The only reason I would know about New Zealand is there's so much to unpack with what you just said, but we'll just dial it back. They pay in the globe; they show New Zealand next to Australia, and I'm just like, \"Huh,\" I did not know New Zealand was there, and in my head forever, like, like I tweeted this. I, you know, I'm very honest about my flaws right? I'm stupid for not knowing this. Don't get me wrong; this is one of those moments where you're like, \"Man, I can't believe I'm that dumb,\" that I I cuz like I you know I tweeted about it Colin wasn't even sure if I was serious about the tweet people were going people were going back and forth on Twitter like you can't be this stupid right? And then there was which I'll get to in a second, a whole bunch of other people going \"I don't know where it is either\"",
            "start": 86.16
        },
        {
            "text": "were going back and forth on Twitter like you can't be this stupid right and then there was which I'll get to in a second a whole bunch of other people going I don't know where it is either and there I noticed really quick there was a huge divide of Americans who had no idea where New Zealand was and the rest of the world going you're stupid and you're a typical American but Chris came home right and she's like are you are you sure like did you where did you think it was nowhere and I'm like no in my head I thought it was on the earth like I'm did you think it was nowhere it's like I didn't know it was a country right I always assumed I always thought for some reason that it was like east of England it was on Europe it was like Northeast of France we're going up towards like Switzerland and stuff like that over there by Zealand as many people say wait wait wa wait I threw that in for you you're going north of France and Northeast and you're talk talk about",
            "start": 125.84
        },
        {
            "text": "towards like Switzerland and stuff like that over there by New Zealand as many people say wait, wait, I threw that in for you. You're going north of France and northeast, and you're talking about Switzerland, yeah, that's right. Alright, do you know where Switzerland? Yeah, it's like down and around here, but here it's right about there, yeah. You go over from France up and over from France, like where Belgium and the Netherlands are, yes, okay, okay. And so I always thought it was there, and so what you said that was very funny is like they had the same uh accent as Australians. I knew this never don't tell someone from New Zealand they have the same accent, they'll get pissed off. They're weti for a second because we're all going to get back to the same point here real quick: it never dawned on me that fact that I thought that that was there, that like the fact that why would these people have Australian-like accents is that fine? Okay, thank you and be up up here over here in Europe.",
            "start": 166.28
        },
        {
            "text": "on me the fact that I thought that that was there, that like the fact that why would these people have Australian-like accents is that fine? Okay, thank you and be up, up here over here in Europe or whatever right on top of that. So I tweeted out; people start getting mad and again it's the international people who are getting mad at me and it's all the Americans - not all the Americans obviously, cuz Colin was already like \"I'm an American, I know where it is\" a lot of the Americans yeah, a lot of Americans and it was just who just had no idea. And so I didn't tweet anything out angrily or anything 'cuz I'm wrong, like I'm wrong, I should know where this is you know what I mean? But it comes back to the fact that I think for America, Americans if we haven't bombed you or gone to war with you or gone to war with you like I mean like at our side we don't know, I don't know anything about your countries and I'm not trying to say that as to be offensive in any way shape or form again I'm saying I I want",
            "start": 212.72
        },
        {
            "text": "with you like I mean like at our side we don't know I don't know anything about your countries and I'm not trying to say that as to be offensive in in any way shape or form again I'm saying I I want to talk a little bit about why that is is it that is it is it a cop out calling for me to say that America's America is so big there's so many states there's so much land that we're focusing on ourselves more because there's so much **** happening here and the fact that New Zealand doesn't blip on my radar other than Lord of the Rings which many people were quick to point out oh what's your **** problem where you think they film Lord of the Rings like was it the guy from Spider-Man it was Spider-Man it was the guy who said he was there but I mean that was you drop a crane on this guy there's no geography he swing the cranes around so he can get from New Zealand Australia you're all man Spidey oi no it it was one of those things where people were saying that right like as if that was",
            "start": 251.84
        },
        {
            "text": "No geography he swings the cranes around so he can get from New Zealand, Australia. You're all men, Spidey, oi no it was one of those things where people were saying that right like as if that was justifiable because of The Lord of the Rings movie. I think a lot of Americans know where New Zealand is, but I don't care about The Rings. I don't think it's because of The Lord of the Rings a lot of Americans know for because I think all this is the thing that actually really got me because I was like how is that possible you know like it was one of those things where I understand that some people there are things I don't know and there are things everyone doesn't know yeah but when I think about the world I know where basically every country is generally sure you know like you'd be really hard pressed to name a country where I'm like I don't know somewhat or pretty specifically where it is I get mixed up like the Philippines and things like that like where those are all the islands stuff.",
            "start": 291.36
        },
        {
            "text": "to name a country where I'm like I don't know somewhat or pretty specifically where it is I get mixed up like the Philippines and things like that like where those are all the islands stuff all the islands and all that stuff Indonesia and then like up to out here and then you go up to like Southeast Asia Laos and Vietnam like that's that's the thing is like because I don't know like you said like you know we would know if you we bombed you went to war with you whatever like can you find Iraq yes can you find Afghanistan yes so like you know where these kind of more obscure tougher to understand places are based on the fact they're in the news more for us because they're newsworthy for us because we're doing something there that's bad or good you know there's depending on how you look at it exactly no and I'm not trying to be vague on I mean like depending on how you look at it and what's happening there right that there's like a death there or there's a bombing or this or where at War",
            "start": 331.68
        },
        {
            "text": "Exactly no, and I'm not trying to be vague on it. I mean, like depending on how you look at it and what's happening there - right, that there's a death there or a bombing or this or war, you know what I mean? Like that. I don't mean here's the thing: I made a joke on my Twitter, obviously, in 140 characters about like great job, US educational system, it's your own fault, you... AO education blah blah blah again. New Yorker guy coming out, one construction worker. But I think like there's a lot of layers to this problem. But I took all the same geography classes you guys did and I passed them and did well in them, but I memorized what I needed to memorize for the test and then said \"erase it.\" Why do I need any of this? Yeah, see I think I know where like Mount Gagazet is in Spira from Final Fantasy X way more than I know things are, and that's messed up. Well, this is what I always think about when Colin talks - we talk about this all the time, and just like the fact...",
            "start": 371.44
        },
        {
            "text": "is in spirit from Final Fantasy X way more than I know things are and that's messed up well this is what I always think about when Colin talks we talk about this all the time and just like the fact that Colin, you know, is this history guy and I always talk about the fact I love history but I'm not on Colin's level he's like why do you say that because I feel it's insulting to what he does and what he is in the same way it'd be insulting if like I I don't nobody at this table but if somebody's like I'm a big DC fan I'd be like how big of a DC, you know what I mean like there's different levels of what you do and I've clearly and admittedly have invested my time and interest and brain power into nerdy fun things that I want to know more about right like I can tell you I can tell you all the history of Metropolis and I know nothing of New Zealand in my Australian history is pretty much a penal Colony that now rules itself, you know what I mean like I like that's and I'm not trying",
            "start": 408.96
        },
        {
            "text": "History of Metropolis and I know nothing of New Zealand in my Australian history is pretty much a prison colony that now rules itself, you know what I mean? Like, I like that's... and I'm not trying to be insulting those who, like, a lot of people were super offended by this. A lot of New Zealand kids were tweeting me being like, \"That's where I live, man, I'm a big fan.\" What's up, and I'm like, \"This isn't me trying to be mean to you; I'm not bashing you.\" I... you know what I mean? It's just that I don't know, and I don't have a good answer for you other than I studied general geography. I remember getting extra credit in geography because I knew whatever color you had to fill in on the map for some random place – no, not some random thing; it was green. Yeah, done good enough. It's up here... This is where I blame the internet, right? Because the internet has become this thing that means you don't have to remember anything true. So like when it comes to geography or where things are...",
            "start": 446.36
        },
        {
            "text": "It's up here, this is where I blame the internet right because the internet has become this thing that means you don't have to remember anything true so like when it comes to geography or where anything is on a map I don't commit that a like you were saying like it's not one of my passions like Colin has a passion for things like that in history um so he commits those things to memory it's it's it's a passion subject so you're going to learn more about you're going to retain more of it for me right now I couldn't tell you where half the states are in the United States see now that's the opposite I feel like give you give me the empty United States I'm going to be able to do it but that's cuz I'm fascinated with what we do here and and this is something I I want to get all over the map I could get I could get the Western area of the United States where there are four states yeah that's it that's all I got and if you give me one drink in me I couldn't tell you",
            "start": 485.96
        },
        {
            "text": "all over the map I could get I could get the Western area of the United States where there's four states yeah that's it that's all I got and if you if you got me one drink in me I couldn't tell you which one was Washington or Oregon where they were are you serious I'm joking um cuz I'm going I'm going to now I'm getting mad I'm going I'm going to Portland in like uh two weeks so I had to look that up on a map uh but that's the thing the internet is it makes all that stuff null and void right and that's a scary concept like you don't have to know where things are on a map CU your life doesn't really depend on that anymore we got Google Maps like I don't really you have to know uh where New Zealand is because no one's going to come up to me and be like hey tell me where New Zealand is right now and is it one or two islands where I'm going to kill you it's not going to happen right so when you say where's New Zealand I'm like I don't know it's near Australia and you say north or south",
            "start": 522.32
        },
        {
            "text": "now and is it one or two islands where I'm going to kill you, it's not going to happen right? So when you say \"where's New Zealand,\" I'm like, I don't know, it's near Australia, and you say north or south, and they go, hold on, Google, yeah. South, I thought it was south, but why do I have to doubt myself? I've got Google steering this back to why I think, and again, this is a generalization based on the people who tweeted me, and were Internationals. Internationals were offended again that I didn't know New Zealand; I'm dumb, I'm you're dumb American, which I I've always said I'm a meathead American from the middle of the country. I think there's something to be said, and this is what I was talking about earlier, I want Colin's opinion on this: the fact that the United States is so vast, there's so much going on; there are 50 states right here. The fact that if you're just England, if you're you know, you're the one like small, you're like the size of a state, you know what I mean? It's easier to",
            "start": 561.64
        },
        {
            "text": "on there's 50 states right here, the fact that I think the fact if you're just England, if you're you know, you're the one like small, you're like the size of a state, you know what I mean. It's easier to understand, especially when you're an island, I mean your life is livelihood is connected to so many different things that that makes more sense to you. I don't maybe I'm again generalizing but it's it's the same flip-flop of like how many people in New Zealand can tell me where Kansas is and you know what I mean, like I don't know, yeah I mean but they can tell you where the United States is and like that, but again we're in every headline sure, but but I I I don't know, I don't really agree with you, like I think that it this reminded me a lot of like when I have conversations with people and they they'll talk about like the planets right and they're like what's the planet like for you know next to us Mars and I'm like are you kidding me yes Mars is next to us you know",
            "start": 593.28
        },
        {
            "text": "people and they'll talk about like the planets right and they're like What's the planet like for you know next to us Mars and I'm like are you kidding me yes Mars is next to us you know like to me like there's certain things that like you just have to know like that you just know right the order of the planets is one of those things you have to know the order of the planets like my very energetic mother just sent me you don't know the order of the planets from from the center yeah I'm not even gonna try really couldn't tell you you got to know these like like to me like Mercury hold on let me Google it Mercury Venus Earth Mars Jupiter Saturn Uranus Neptune let me check Google never forget I'm never gonna forget sometimes Pluto like why like so to me it's just like I think it's just I I can't balance whether it is like like when I was a kid like a young kid I had a huge map in my room I was obsessed with that like so that's that's like I love seeing you there with a coffee and",
            "start": 630.84
        },
        {
            "text": "just I I can't balance whether it is like when I was a kid, like a young kid, I had a huge map in my room, I was obsessed with that. Like so, that's like I love seeing you there with a coffee and a robe and you're smoking a cigar or a pipe and you're just like... New Zealand. I used to draw like I used to draw routes on it and I don't know, I just studied it, I knew the map, I know the map of the world really well and like to me, I so I can't take that for granted in the sense that like I was attracted to these sorts of things like you said. But at the same time, you know what I find funny about that story is not necessarily that you didn't know where New Zealand was but that you thought it was in Europe. But when I think about the map of Europe, I can see it perfectly in my head and I'm like, \"where do you think that it was?\" You know, like that's the one thing that's... that's where Belgium and",
            "start": 669.4
        },
        {
            "text": "about the map of Europe I can see it perfectly in my head and I'm like where do you think that it was you know like that's the one thing that's the one thing I think but that's where Belgium and like the Netherlands are I know I know so I I can see Greg's perspective on this right cuz part of the reason why I know New Zealand and obviously is because of Pop Culture right I might be getting this wrong and I hope I'm not but Flight of the Conchords those guys were from New Zealand and they always made a joke saying that everyone's like oh you're from Australia and they're like no we're in New Zealand and it's that it was an ongoing joke throughout the whole series and I was like oh that's funny that brought to mind the fact that they like there is this place called New Zealand Talent people are from there you should know what it is other than that I had no exposure to it in pop culture and in the media other than you know its relation to Australia so it's not something that would have been",
            "start": 707.52
        },
        {
            "text": "from there you should know what it is other than that I had no exposure to it in pop culture and in the media other than you know its relation to Australia so it's not something that would have been on my mind enough to really drive it home where it is in the map I'm not saying it's not something that you should or should not care about it's just sure nobody's saying that we should care about the people the same way if you said where is you could say where is Kansas right now and I would be like do you know where Greenland is by Iceland really is it see I would just think all the lands are near each other Switzerland Greenland Iceland I always remember that Greenland on Iceland cuz when you look on the map one of them's got a lot of snow on it the other one's pretty green and it's the opposite of Sweden Colin why uh as far as I understand that was like an I don't know if it's an urban legend or a myth whatever but like when the Vikings went you know landed on Iceland to attract more",
            "start": 740.24
        },
        {
            "text": "Opposite of what Colin said, why uh as far as I understand, that was like an I don't know if it's an urban legend or a myth, whatever, but like when the Vikings went you know landed on Iceland to attract more people to go there um or I guess it was Greenland when they when they went to Greenland they pretended like it was Greenland or whatever green um but I don't know if that's like an urban legend or not. The thing that the thing that uh fascinates me though is that you know, I guess you mean Northeast Europe so you mean like Scandinavia, that's where you thought New Zealand was right, so like not Northeast of France which we were talking about before but like going all the way around to like towards like Russia or towards the Baltic states and **** like that. And then going west of Russia West okay yeah, so like this, so look at the map and point, so like Eastern Europe, like where Ukraine is, yeah, that sounds right, let me let me get it.",
            "start": 777.76
        },
        {
            "text": "and then going I'm going west of Russia okay yeah so like this so look at the map and point so like Eastern Europe, where Ukraine is yeah that sounds Bri let me get it down I will literally pinpoint to you where I thought it was I don't know I don't judge you on it I thought it was astounding because I never thought that that was something that was possible and then reading a lot of the responses and us talking here it seems like maybe I'm in the minority but I don't like that we have the stigma in this country of not knowing anything because there's lots of people that know lots of things and I sometimes think we're proud of that and I don't think we should be proud of that you know I do think that there's a little bit of a bar about Americans where it's like well we're the United States and we don't need to know where you know the Czech Republic is or whatever and it's like yeah you kind of do",
            "start": 815.96
        },
        {
            "text": "\"A bit of a bar about Americans where it's like, well, we're the United States and we don't need to know where you know the Czech Republic is or whatever. And it's like, yeah, you kind of do. You should know that. Like, there are certain things you should know. I think it's not really a judgment call because there are definitely things that people would say to me and I'd be like, 'I don't know.' Maybe a pop culture reference, certainly that would be my weakness today. But yeah, but that's not like real knowledge. This is where it's like Idiocracy right? Like, I don't know. It's just... I don't really judge it. It's the same thing I was thinking with planets though. Where I honestly have those conversations with people sometimes and in my mind I'm like, 'Are you for real?' You know, like, you weren't interested enough in science to learn that the Gas Giants are out there and the rocky planets are inside? Like, right there. I know.\"",
            "start": 857.2
        },
        {
            "text": "you are you for real you know like you like you weren't interested enough in science to like no or the Gas Giants are out there and the rocky planets are inside and see like right there like I I know my very energetic mother like I can name the planets at no point could I tell you which one the rock ones are and which ones the gas ones are like that's all the inner planets are the rock ones and then when you go to the past the asteroid belt they're all gas of course yeah you're right see for me it my upbringing was I had great parents but they never really challenged me to learn any of these things and I I always say like I didn't start really trying to assimilate information or take an interest in anything until well into college which is hard to say cuz I did really well in High School didn't really care I just figured out what the system was and was like cool I know exactly what I need to do to get an A and sometimes I got a B or an A plus whatever it doesn't matter I took",
            "start": 888.52
        },
        {
            "text": "School didn't really care, I just figured out what the system was and was like, cool, I know exactly what I need to do to get an A, and sometimes I got a B or an A plus, whatever it doesn't matter. I took advanced placement classes just so that I could get a B and it would still count as an A, and I was like, cool, I got a good grade point average, got into college, tried doing that in computer science and failed miserably because computer science is really hard, which was the first time in my life that any situation had ever forced me to be like, uh-oh, now I have to actually think about what I want to do and figure it out and go after something, and that's when I started doing film. Mhm. But until that point, everything was in one ear, processed, put on the paper, and the second was on the paper, it was gone. Right? That I that's the problem I think I have with and I'm not just geography here, I'm talking about learning in general right is in the way like uh Grade School junior high and high school.",
            "start": 928.56
        },
        {
            "text": "Was gone right, that's the problem I think I have with and I'm not just geography here, I'm talking about learning in general, right? Is in the way like uh Grade School junior high and high school works is that you you study for the test, you're not you're not studying to commit unless you're interested in the subject material, you're not like it is literally in one like I'm talking about the story like I I distinctly remember in junior high sixth seventh grade being the only person in one in my geography or social studies class to get the extra credit question about where this obscure country was and it was because the night before I studied the map and I remember that country right over here, that was. And now I I don't even I can't even tell you what section of the world we were studying, I'm just telling you that I remember at that point, that's what it was all right. So see I was thinking yeah you're right Ukraine, right? Cuz I'm saying again Northeast of France, I'm not going up.",
            "start": 966.68
        },
        {
            "text": "I'm just telling you that I remember at that point that's what it was all right so see I was thinking yeah you're right Ukraine, right? Cuz I'm saying again Northeast of France I'm not going up north I'm saying in this land mass here so I would have been probably like yeah Poland or somewhere right in there, yeah okay maybe even about yeah yeah. I mean again this is like like I said as soon as I tweeted as soon as it happened I was like huh I can't I can't believe I didn't know that that I had no knowledge of a whole New Zealand Mass off of Australia I didn't even think about it but then Christine came home I told her and in the middle of the story I just started laughing hysterically because this would have been I wish and there's no way obviously to rewind time not watch that video and somehow tell you guys to ask me cuz it would have been awesome to put up a blank map here and go like color in where you like we do that every week by the way we could just have you have it has to be",
            "start": 1007.12
        },
        {
            "text": "tell you guys to ask me cuz it would have been **awesome** to put up a blank map here and go like color in where you like we do that every week by the way we could just have you have it has to be on your honor System we should just put up a map and calling you be like Nick where is the Czech Republic and just watch me fail miserably I don't know it's it's it's not a like it's I don't want to I don't think people should be ashamed I just think that and like shame it's funny I guess like there are things that we don't know and so I just you know I wonder what kind of innate knowledge I personally have and other people have that maybe we just assimilated because we were interested in the topics like you were saying sure yeah I think I mean I'm sorry to interrupt you no it's fine it's just you know I just had a map in my room my whole life you know and like that probably informed me I I think it's funnier now that I'm thinking about it that Greg thought that New Zealand was a Soviet",
            "start": 1051.84
        },
        {
            "text": "You know, I just had a map in my room my whole life. You know, and like that probably informed me. I think it's funnier now that I'm thinking about it that Greg thought that New Zealand was a Soviet satellite, which is even better - that's an even better part of the story. Well, it's funny too because like I think about after after it all happened after this the wool was pulled off of my eyes, I'm thinking oh yeah and how many times have you seen like an AU or NZ and I'm it never dawned on me why these two - cuz it's just like it's just it's information that is not pertinent to me at that time. You know what I mean? And people tweet about they like you're telling me that you met Lucy the lion O'Brien from IGN, and she's like \"I'm from New Zealand.\" I'm like, \"She probably said that,\" and just it never even registers. You know what I mean? It's like when somebody just tells you where they're from, you're like okay cool cool all right great. And I this all goes back to the fact of too on top of what I've",
            "start": 1088.64
        },
        {
            "text": "Registers, you know what I mean. It's like when somebody just tells you where they're from, you're like, \"Okay, cool, cool.\" All right, great. And I... This all goes back to the fact of too, on top of what I've been telling you about test-taking and how I think the American educational system trains you to learn, which is not the best for recollection in your adult life. It's the same thing when I became a journalist, when I was working at The Daily Newspaper. Right? I literally had to... When I I discovered early on that if I didn't come home and have a pad in my pad and pen in my uh pocket, I would forget things. Because I got so used to you asking me the question, you respond, and I write it down. And like that's what I remember when I need the article. That when we would just have a conversation 30 minutes later, I would forget what you told me. I just wouldn't even... Like your age, like you know what I mean? Like I'm terrible at stuff like that, birth dates, names. Now I feel like I've overloaded on names where now",
            "start": 1130.76
        },
        {
            "text": "I would forget what you told me, I just wouldn't even like, I mean your age, like you know what I mean? Like I'm terrible at stuff like that - birth dates and names. Now I feel like I've overloaded on names, where now when I meet new people, uh, you know... We just had Christina, obviously right? Christine comes today, this is my fiancé Brandon. I'm like, great, I look at him and I'm shaking his hand, I'm like \"Brandon Ralph\" - Superman! Like I need some kind of device to remember your name otherwise yeah, I'll just move on. There's so many people at work now that I go, \"Hey man, what's up?\" No idea what your name is, and we're way too... We're way past the point of me being able to ask. I don't know a lot of people, you know what I mean? Like it's just like you need there's so much information on a daily basis that we need at ready to go - ready to go - ready to go, that there's things that when I meet you or deal with a country or see something that isn't pertinent to that, what I need right now, I just... it's just gone.",
            "start": 1169.44
        },
        {
            "text": "\"I need to be ready to go, ready to go, ready to go. That there's things that when I meet you or deal with a country or see something that isn't pertinent to that what I need right now I just it's just gone. Don't worry, I don't have time for this. Plus it's like we're in the era of information overload where like every day 50 people talk to me at the same time about 50 different things and like I just can't be an expert on every subject. I have to just choose, pick and choose my battles. My wife, if she were listening to this, would be basically rolling her eyes. She loves to travel, which I feel like uh and I don't want to overgeneralize because you're right it's it's it's ridiculous to overgeneralize say everyone in the United States doesn't know geography because it's absolutely not true um but my wife is more European I think uh in mindset than I think than I am growing up in Southern California and being kind of you know subjugated\"",
            "start": 1202.88
        },
        {
            "text": "Is more European, I think. Uh, in mindset than I think than I am growing up in Southern California and being kind of you know sub not subjugated but like just kind of uh that's the wrong word - subjugated, say I was going to say \"cled\" but isolated was the what I was looking for in the in the isolationist Inland Empire. Right, right, that's that's our sign by the way. It's like, yeah we just scored a goal. Um, my wife however traveled; she wanted to when she graduated from high school and in college she went abroad and studied and and taught over there. Um, what she does now and she loves that so much that I can see her looking at different places in the world and like \"what do we do there?\" \"where are the different places we go?\" \"what would we stay?\" \"what would we explore?\" These things. So I bet if you I asked her any country, she would know exactly where it was and probably how much the airfare for it was to get there because that is her thing; that is her passion to travel. She told me when we got married.",
            "start": 1241.64
        },
        {
            "text": "I asked her any country she would know exactly where it was and probably how much the fare is to get there because that's her thing, that's her passion, to travel. She told me when we got married, she was like, \"I just want someone who will go on adventures with me,\" and I want you to be that guy. I'd rather not go to Taco Bell. My two stipulations are: is there a Starbucks there, and do they understand the words \"venti iced coffee, unsweetened, no room\"? I don't need room in this $3 coffee, just FYI. Yeah, yeah, I mean, it's you know, I don't know, it's just a weird thing what you're passionate about, what you want to know about, like you know? I studied French right and went to France and enjoyed France; I know France pretty well. Japan, I love Japan. We've been there, we went there for TGS, we went there last year in November. South America, right, exactly around that belt to South America, one of the best South American countries, but yeah, I don't know. So I wanted to talk a little bit about it because I saw the tweet.",
            "start": 1291.52
        },
        {
            "text": "South America right exactly right around that belt to South America one of the best South American countries but yeah I don't know so I wanted to talk a little bit about it because I the Tweet obviously doesn't represent as much that was going on there just the fact of like it wasn't something I was proud of I also wasn't disturbed by it it's just like oh huh and but then it's that weird thing I think like whenever I maybe again I'm making a huge generalization please tell me in the comments uh tweeted me too but like when you live somewhere and that's your home and like it it'd be like you've never been to Chicago you know what I mean like you don't know anything about Chicago like it'd be the same you don't know anything about New Zealand granted again I know it's a country I know it's different but because you grew up in a cool place I can't be like you guys don't know anything about Riverside you guys would never have heard of that town really unless I was from there but again I I",
            "start": 1332.72
        },
        {
            "text": "but because you grew up in a cool place I can't be like you guys don't know anything about Riverside you guys would never have heard of that town really unless I was from there but again I I mean I'm from the suburbs Chago you'd say you're from March County I would understand that thanks the Big Ups Ryan I met pH met Ben McKenzie at Comic Con talked to him for about 5 seconds because he was on there for Gotham and I was like yeah you're still as cool as I remember you what up big UPS to Chino Big Ups Chino let us know in the comments how you come down on this whole issue about where countries are how well should someone know geography should you be able to pull it out of your butt at any time and watch a Monopoly documentary in peace",
            "start": 1368.72
        }
    ]
}