{
    "id": 2611,
    "video_id": "4ZC3cY0KjRs",
    "show_name": "PS I Love You XOXO",
    "hosts": [
        "Greg Miller"
    ],
    "title": "PS I Love You XOXO Update",
    "description": "What's the future of PS I Love You XOXO? Well...\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1494008307,
    "duration": 224,
    "transcript_chunks": [
        {
            "text": "What's up everybody, welcome to your update on PS I Love You XOXO. I'm your only host, Greg Miller. First and foremost, thank you so much. So many of you have reached out, of course, since Colin left, talking about PS I Love You, wanting to know what's happening with it, wanting it to go on in some shape or form. I've held off on talking about it because I wanted to center myself, find out what I wanted to do with the show, where Kinda Funny goes, what's the right move for the company, and I think we're on to it. So it's good news, bad news, stick with me. Depending on where you call it, PS I Love You XOXO is going to end. I thought about it for a long time, and you know, when Colin announced he was leaving, my first thought was, we got to end this show, right? This show is Colin and I. And so many of you reached out saying, don't do it. Colin himself said, don't end it. That in the same way that like I started Beyond, this was an extension of that, so continuing that on is an extension of that as",
            "start": 0.12
        },
        {
            "text": "of you reached out saying, don't do it. Colin himself said, don't end it. That in the same way that like I started Beyond, this was an extension of that, so continuing that on is an extension of that as well. I agree with you, which is why it's not all bad news here. However, I think what PS I Love You was was two people who were dedicated and in the PlayStation Community going at it. And sure, I could bring in guests and I could do this, but are they ever? I don't want to be shoehorned into only having experts who are about PlayStation or feeling like somebody comes in and every week they're judged if they know PlayStation or don't know PlayStation. Something that that seems like a whole can of worms. It's really hard for a team of three on camera people to do and figure out how they want to make work. So what I'm going to do is May 3rd, we're going to put up one more PS I Love You XOXO, the final episode. My co-host will be Jeremy Dunham. If you are a younger person, you might not know Jeremy Dunham of",
            "start": 41.24
        },
        {
            "text": "what I'm going to do is May 3rd, we're going to put up one more PS I Love You XOXO, the final episode. My co-host will be Jeremy Dunham. If you are a younger person, you might not know Jeremy Dunham, of course, the man who founded Podcast Beyond with me, one when along with Ryan and along with uh Jeff. Uh Dunham was the first host of Beyond. So I felt if we're closing the circle here on really what PS I Love You was, and you know, the spiritual successor to Podcast Beyond, it only made sense for the man who sent me on this journey to come here, ended alongside me. However, ending is an interesting way to put it. We think we're on to something with what PS I Love You is, the format of the show, and to that extent, and the the tenor of it, the uh we want to talk about games in a very serious fashion, and we think we have something that is the evolution of that. I'm not ready to tell you about it as you may or may not know, and I assume you do if you're watching this or listening to this on podcast services.",
            "start": 79.56
        },
        {
            "text": "we have something that is the evolution of that. I'm not ready to tell you about it as you may or may not know, and I assume you do if you're watching this or listening to this on podcast services. We do a show called Kinda Funny Live every year, and when we do that show, we like to announce new things and new products and where we're taking the company. And I think that's the right place to talk about what the evolution of this is, where we're going with the roots that are PS I Love You. But I wanted to be clear, I know some of you only do listen to the podcast, some of you only do watch YouTube. I've seen your tweets, you want to know what's going on. I wanted to let you in my headspace. I needed my own time to figure out really what I thought was the right move, where I thought we should go, and I think we have it now. But sadly, that doesn't mean that there's going to be a weekly PlayStation show. What does it mean? You'll find out very soon. That's all I want to say about that right now. So May",
            "start": 125.12
        },
        {
            "text": "I think we have it now. But sadly, that doesn't mean that there's going to be a weekly PlayStation show. What does it mean? You'll find out very soon. That's all I want to say about that right now. So May 3rd, me, Jeremy Dunham, Podcast Beyond founder, Rocket League Superstar, VP of something the company. I don't know, he's a big deal over there. He'll tell me about it. I guess I guess I could I could have looked it up beforehand. I didn't. I know he's a VP of something, you know, his official title, VP of something. It's Jeremy Dunham, that's all you need to know. So May 3rd, we'll be back here with the final PS I Love You XOXO. Then at Kinda Funny Live, June 3rd, we will talk about what's next for Kinda Funny Games. Until then, welcome.",
            "start": 160.12
        }
    ]
}