{
    "id": 2676,
    "video_id": "6y0gb9AdXkY",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "High School Drama Dept. Hitman (Cool Games Inc.)  - Kinda Funny Gamescast Ep. 122 (Pt. 3)",
    "description": "Cool Games Inc. has Griffin McElroy and Gamescast guest Nick Robinson come up with games based on viewer submissions. Let's see if Greg and Adam Sessler can hang!\n\nThanks to Blue Apron for sponsoring this episode. Go to http://www.BlueApron.com/greggy \n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1496233801,
    "duration": 1016,
    "transcript_chunks": [
        {
            "text": "You know what I love to do? Eat. You know what you love to do? Eat. So why not cook some home-cooked meals and eat them from our sponsor Blue Apron? Yeah, I wrote the ad. Blue Apron sends you food. It comes in pre-portion bags. You follow step-by-step instructions and you make the food for less than $10 a person. It is delicious and you impress the people in your house. No one in your house, tweet me Greg Miller the photos of your food this week and I'll try to send back a video of me impressed with it. Check out this week's menu like this month's spiced zucchini enchiladas and get your first three meals free with free shipping by going to blueapron.com/gamescast. You will love how good it feels and taste to create incredible home-cooked meals with Blue Apron. So don't wait. That's blueapron.com/Gamescast. Blue Apron, a better way to cook. Or as I like to say, \"Don't eat a shoe.\" And I'm not joking about the photos, f*** try me. Topic number three: Cool Games Incorporated. Yes, I was unaware of this show.",
            "start": 0.08
        },
        {
            "text": "Apron, a better way to cook. Or as I like to say, \"Don't eat a shoe.\" And I'm not joking about the photos, f*** try me. Topic number three: Cool Games Incorporated. Yes, I was unaware of this show. So Cool Games Inc. is a podcast that I do with my good friend Griffin McElroy every week, uh, where the premise is this. This is Griffin's idea and I adore it to death. Um, every week people submit, uh, ideas for video games to us, uh, and the idea might be something like to pull something from this week's episode, uh, available now, avail now on iTunes and wherever podcasts are sold, sold, sold. Um, people submit an idea like one of the ideas this week was Mario and Sonic at the Eurovision Song Contest. And so me and Griffin sit there and we just go through these ideas and we explore like, okay, what, what would Waluigi bring to the table versus what Big the Cat would bring to the table at a Eurovision like competition? And so it's, it's really great because it's offloaded virtually all the creativity to our, our fans.",
            "start": 46.0
        },
        {
            "text": "bring to the table versus what Big the Cat would bring to the table at a Eurovision like competition. And so it's, it's really great because it's offloaded virtually all the creativity to our, our fans and our listeners. They submit the ideas to us. We pick the ones that we find funniest and we sort of spitball. So we pick the nug, the one that we think is like the kernel and that becomes the, the title of the episode and that becomes like the thing. And so, um, we just, it's just kind of a fun like me and Griffin spitball stupid ideas all like for an hour once a week and then pick our favorite and that becomes our release. So Cool Games Inc. releases a game. When is it, when is the show, when is the game released? Every week. The week the game is released every, uh, Friday. Okay. Usually at night because I'm a procrastinator. Well, I want to turn our show The Gamescast over to you for one topic. The audience wrote in with all sorts of suggestions for or elevator pitch ones. So now we can, we or your, it's your.",
            "start": 106.92
        },
        {
            "text": "procrastinator. Well, I want to turn our show The Gamescast over to you for one topic. The audience wrote in with all sorts of suggestions for or elevator pitch ones. So now we can, we or your, it's your decision. It's your show. Now we can do one and spend 15 minutes with it or we can pop around at least one of these. One at least one of these people is like, is definitely a person after my own heart, specifically making a Phantom Dust reference just to make me happy, which I really like. Let's, let's, so we do a thing. Yeah, I saw that. And, and they're grouping me in with that like, oh yeah, you're part of it now, buddy. I know he's into the Phantom Dust. I am. I am. On the other hand, I don't, I kind of remember when that game came out. Understand? Yeah. And I think I like, you're going to review this to somebody else. So like that, this is, I remember the G4TV era. I think the G4TV fan best review complained about the camera and I remember like 16-year-old me being very angry about that fact. Um, you were that guy. I was.",
            "start": 142.64
        },
        {
            "text": "like that. This is, I remember the G4TV era. I think the G4TV fan best review complained about the camera and I remember like 16-year-old me being very angry about that fact. Um, you were that guy. I was. I probably left a shitty comment about to say, call G4. So we do a thing, uh, sometimes on Cool Games Inc. called the kind of rapid fire thing where we just run through ideas real quick. If anything catches our eye, then we can kind of elaborate on it. But I'll just start reading. Um, Forrest Suarez suggests Nap Simulator VR. I mean, I like that one. Here's what I like about that one. Yeah. So it's a VR game. VR experience should be short and punchy, right? You have, you're in VR and you have, you the setup beforehand is that you've been up all night working. You're, you've been up for 48 hours. You are crashing. So your vision's fading. You're doing this. You have to build the best nap in 60 seconds. And so there's like pillows around and blankets and hammocks and beds and like there, but there's like proximity to the.",
            "start": 181.08
        },
        {
            "text": "vision's fading. You're doing this. You have to build the best nap in 60 seconds. And so there's like pillows around and blankets and hammocks and beds and like there, but there's like proximity to the road, uh, there's a drippy faucet, f*** like that. You have to worry to find the optimal space. There are like, for example, as someone who takes an occasional nap, I, I think there are, there are pros and cons to taking a couch nap versus a bed nap. And that's something you got to factor in. I don't, I, I don't even think about doing a bed nap. I dabble in naps myself. I am all couch, all couch, all the time. Yeah. Actually, you know what I found? You, I usually need like sounds like the radio or something to be able take a nap. I found exactly what works for me. I go on Netflix and they have like all seven seasons of Forensic Files. Oh, oh no, that's kind of a spooky thing to it's, but, but no, the way it flows is just, it's just rudimentary and it like and, and, and, and, and flat with it, with, with it, with its voice over.",
            "start": 224.92
        },
        {
            "text": "Forensic Files. Oh, oh no, that's kind of a spooky thing to it's, but, but no, the way it flows is just, it's just rudimentary and it like and, and, and, and, and flat with it, with, with it, with its voice over. And boom, I go to sleep in like two minutes. Uh, when, when we were in New York for Polygon's like big video team meeting, I shared a hotel room with my co-host Griffin McElroy, who is, how many times can you say Griffin's name? I love to say Griffin McElroy's name. It's fun to say. There's, there's a rhythm of the, it's like a punch. Now, do you say Justin's name as much as Griffin? Justin, but Griffin McElroy, I say the full name of time. This just McElroy is mine. All right, that's an oration McElroy moment. Literally went on for 30 episodes of oration for somebody's like, you're saying his name. I like, God damn it. He never corrected me. You just do JMac and GMac. That's really good. I man, how has that not come up before? Anyway, what I was going to say is, uh, we shared a hotel room and he's way into the White Noise, the White Noise.",
            "start": 267.6
        },
        {
            "text": "me. You just do JMac and GMac. That's really good. I man, how has that not come up before? Anyway, what I was going to say is, uh, we shared a hotel room and he's way into the White Noise, the White Noise for sleeping. And I was, I was blown away at how much it affected me. I really, the White Noise just conked me right out. That could be a power. That could be something a direction you spec in Nap VR game. Now, I do, I will say this, it says Nap Simulator VR. And the idea of simulating a nap in VR is essentially just putting on a headset that's not plugged in. That's what a nap is like. So that's a free game that everyone has. If you have a VR headset, you close your eyes at home right now, you're playing. So many of my apps are also like anxiety dreams. So that's another way that you can look at it. You know, where it's like, hold on, I, I, I, I can't mail the letter, but they need to get the check. What do you mean there's a final today? I haven't been to this class all semester. Started having those again, really.",
            "start": 308.52
        },
        {
            "text": "where it's like, hold on, I, I, I, I can't mail the letter, but they need to get the check. What do you mean there's a final today? I haven't been to this class all semester. Started having those again, really weird. Back in school and I, I've had actors' nightmares repeatedly in the past few months where they're pushing you on stage. You don't, I'm suddenly in a play and like, I don't, you know, I have not learned the lines. One of them was like Shakespeare. I'm like, I can't, I can't, I can't dick my way through this one. And, and the other one is like, I'm suddenly taking a test that I haven't studied for. The, the anxiety dream that I share with, with, uh, my siblings and a lot of my friends who are also big Dance Dance Revolution players found this was, and it's talked about, not just, there's a recurring performance anxiety nightmare that people who play a lot of Dance Dance Revolution have where you go to an arcade and you go to play DDR and the machine is somehow f***ed up. Like for me, it's frequently the, the front of the machine is like.",
            "start": 349.64
        },
        {
            "text": "that people who play a lot of Dance Dance Revolution have where you go to an arcade and you go to play DDR and the machine is somehow f***ed up. Like for me, it's frequently the, the front of the machine is like covering up the top arrow so I can't quite hit it right. Or people have told me they've had ones where the DDR machine is extremely tiny or like the pads are just broken or arrows are missing. And so it's like, it's, I think for DDR players who go to play in an arcade and you're performing in a public place, this is our version of like a, like the, the stuff you're talking about with being in a play or something and not knowing the script. Like you go into to perform and you can't and it's not your fault. I guess what's interesting is the dedication that's on display. It's like, you know, most reasonable people like, I'm not doing that tiny DDR machine. No, it's like, no, I have to, have to. My credibility has been challenged as a DDR Master. It's, I, I don't, I can't remember the last time I walked into like a.",
            "start": 396.24
        },
        {
            "text": "people like, I'm not doing that tiny DDR machine. No, it's like, no, I have to, have to. My credibility has been challenged as a DDR Master. It's, I, I don't, I can't remember the last time I walked into like a, like an arcade or a mall and saw a DDR machine and didn't play it. Like you just have a, when you play the game, you have a physical compulsion to do it any chance you get, even if the pad is a nightmare. I've, I've played at beaches before with, with sand in the pad and it's not ideal. But this, wait, wait, wait, wait, wait, wait, wait, explain DDR at the beach. You don't get to walk away from that. We built an arcade in the sand. Surprise, not a bigger hit. Ocean Beach, North Carolina. They had like a DDR Max cabinet there right on the beach, which is like, seems like a very obvious idea that that's going to be a problem. Um, but my fond memory there was actually having a friend stand behind the DDR machine holding a cup while I played and he requested tips.",
            "start": 429.88
        },
        {
            "text": "like a very obvious idea that that's going to be a problem. Um, but my fond memory there was actually having a friend stand behind the DDR machine holding a cup while I played and he requested tips and we got like $3 and that was enough to play another game DDR. And I was like, man, that's a beautiful, that's a beautiful thing. Awesome. Look at that. Just, just the cycle of life. The video game hustle never, you can't start too early. All right, give you another game. Yeah. All right, here's another one. Um, Chris Berg says, \"Hitman, but set in a High School drama Department. You're a vengeful understudy willing to do anything for a top billing or a top killing.\" They didn't say that. I said that. Yeah. See, when I, when I read it off of Twitter, when I was copying it, I, \"Hitman, but in high schools.\" And then even here, it's like, I think we have to comically take people out right away. Totally. You can't, no killing, nobody murder. But you're like, you, you may be God. What would be some things like you got the sandbags that knock.",
            "start": 469.64
        },
        {
            "text": "like, I think we have to comically take people out right away. Totally. You can't, no killing, nobody murder. But you're like, you, you may be God. What would be some things like you got the sandbags that knock him out right side? It's this game is rated teen. It's about T for X. You have the sandbags. Uh, you swap out the lines and so like he ends up doing another play at rehearsal and so he gets thrown out. You could like as the understudy, you could be getting, getting him his, his Dr Pepper and maybe you put a little bit of some sort of diuretic in the beverage. Exactly. Yeah. I'm thinking like high school things. How, how do we make his acne break out like where they can't perform? Oh, you replace the makeup with like bacon grease or something. Yes. Oh, that's, this is good. That's horrible. Hey man, it's, we're helping out getting the part, you know what I mean? I know, I know, but I was just like, just put this different. Brings some 2017 into it. We hack their Facebook. We, he leaves his Facebook, his phone unattended. We post.",
            "start": 510.28
        },
        {
            "text": "out getting the part, you know what I mean? I know, I know, but I was just like, just put this different. Brings some 2017 into it. We hack their Facebook. We, he leaves his Facebook, his phone unattended. We post something mean bad on Facebook. Not about killing. Yeah. Someone about, I don't know, drugs, I, dick pics, maybe something like that. Y'all are really good at this, by the way. I would love to have both y'all on. We haven't done a guest in like seven months, but we should get back. Last cast, uh, I don't want to talk about it. They, they're gone. Bacon grease makeup. Bacon grease makeup. Uh, Colin Ray Parker suggests Master Pastor Blaster. Your congregation all fell into a hole in the church and becomes radiated mutants. You must now fight and contain them, which feels like maybe this could be like a Far Cry 5 DLC situation. Like the Blood Dragon, exactly, the Blood Dragon is. Um, let's keep, let's keep doing. Gavin Gav Games on Twitter suggests a game where you are only armed with a car battery and jumper cables. I'm trying what.",
            "start": 551.08
        },
        {
            "text": "like the Blood Dragon, exactly, the Blood Dragon is. Um, let's keep, let's keep doing. Gavin Gav Games on Twitter suggests a game where you are only armed with a car battery and jumper cables. I'm trying what would that control like? I think it's just that's, those are the only thing you have to swing. Like you're swinging the jumper cables to hit people. Oh, see, I was thinking you're not armed. You're just like the best Samaritan. You just, you know, someone out there needs a jump. Just open. It's what we were talking about earlier. It's the GTA guy, but only playing as a cop, right? You're just wandering this game looking at jump start. Someone's going to really be happy that I'm here. My head definitely went to combat for some reason. Everyone has. And I'm almost imagining, have you played Arms on the Nintendo Switch at all? That I'm imagining like an Arms like character who you've got the left and right jumper cables. You need to attach both of them. Here's what I'm thinking. I like your idea that it's, it's everybody.",
            "start": 592.64
        },
        {
            "text": "all that I'm imagining like an Arms like character who you've got the left and right jumper cables. You need to attach both of them. Here's what I'm thinking. I like your idea that it's, it's everybody. It's multiplayer. Let's, so let's, it's kind of, let's do like Battlegrounds where that's exactly what I'm picturing. Everybody has it, right? And then you have rooms that have weapons in them, but you have to power or something in them. You power up the door with the battery, but you have to leave it unattended so other people would swoop in and take your battery and your car. Shut you in the door. You're trapped in there. Something like that. I mean, one thing that with Battlegrounds is missing, I think right now, and I love that game and it's like getting, it's seeping into Cool Games Inc. Like the game we made this week is basically just PlayerUnknown's Battlegrounds, except one person is your Guardian Angel watching over you and can tell you that enemies are in the next room. So it's teams of two, one Guardian.",
            "start": 634.32
        },
        {
            "text": "this week is basically just PlayerUnknown's Battlegrounds, except one person is your Guardian Angel and one. But, um, one thing about that game is like, I always have this constant feeling of like, man, I wish I could booby trap this house. Like, man, I wish I could attach jumper cables and a car battery to the doorknob and then when someone walks in, they get zapped. So maybe this, maybe there's room for that in here somewhere. Okay, okay. Yeah. Oh yeah, set traps with your, or like, yeah, it's, it's like a really malevolent Scooby-Doo. You like at the end of the Scooby-Doo episodes, like they have the elaborate plan that Shaggy and Scooby, you know, always screw up to, to, to get the bad guy. But it's like that, but it's got like a nastier edge because there's electricity. There is electricity and death involved. And death. Phantom Crust, two-player PVP battle about removing crust from bread slices. Where's the.",
            "start": 666.36
        },
        {
            "text": "but it's got like a nastier edge because there's electricity. There is electricity and death involved. And death. Phantom Crust, two-player PVP battle about removing crust from bread slices. Where's the Phantom in this? I'm looking to you because you know. Well, I mean, we can get the Phantom in there. So the idea is that, uh, whoever doesn't get it done fast, whoever takes the longest to get the, so you got it. The bread is in the center. You got to run out. You got to fight each other's like Gang Beasts or grab it and run. Do it. You got to cut it. Then you got to deliver it. And whoever doesn't get to deliver, a Phantom swoops in like Nidhogg, takes the person. See, you know what I'm liking is just to give it a little bit more edge is that it's supposed to be for a cucumber sandwich. And if, if you've ever had a delicious cucumber sandwich, that ratio of cucumber to butter is essential. I mean, you're really, I mean, it's, it's, it's, it's tenuous and you can screw up at any minute to say nothing of you the perfectly.",
            "start": 699.88
        },
        {
            "text": "cucumber sandwich. That ratio of cucumber to butter is essential. I mean, you're really, I mean, it's, it's, it's, it's tenuous and you can screw up at any minute to say nothing of you the perfectly removed crust. And then Phantom. No, it's kind of like a Passover when you leave the wine out for Elijah. You leave the cucumber sandwich out. Yeah, you leave it. And then the Phantom comes and he relives. May, maybe he's an old British Phantom and he's just like trying to like, you know, re-engage with the living and the corporeal. And he does it through cucumber sandwich sandwiches. That's not a bad way to. It's kind of a tragic tale of loss until the end there. We had Overcooked DLC. Gang Beasts idea is also really exciting for me too. Like mash them up, mash them up. Yeah, mash them up. All right, cool. Um, let's see. You want to do one more? Yeah. I, I, for whatever, you pick one more from the fans. And the final one has to be this one. But it's my chicken scratch handwriting if you need it. Here's a, here's a fan one. Uh, Spencer.",
            "start": 741.84
        },
        {
            "text": "to do one more. Yeah. I, I, for whatever, you pick one more from the fans. And the final one has to be this one. But it's my chicken scratch handwriting if you need it. Here's a, here's a fan one. Uh, Spencer Cacchione suggests Alien Isolation, but all the aliens are replaced with Corgis. Okay. There's only one alien in Alien Isolation. So, and all of them are replaced with Corgi. One is it Livent Corgi? Yeah. Why are we hiding from the Corgi? I want to pet him. Maybe, maybe that's the, maybe that's like, maybe it's like a Gone Home situation where you're scared for the first half of it and then you realized it was all for naught. Don't I just embrace this Corgi? He seems like a nice guy. Good Corgi. Or maybe it's kind of like that famous Twilight Zone episode with like the town that's terrified to the little girl. Sure, sure, sure, sure. Except now it's a Corgi and you're on the spaceship and you're like, why is there a Corgi here? It must be evil, which you're trying to figure out what the evil is of the Corgi. It'd be.",
            "start": 786.52
        },
        {
            "text": "sure, sure, sure. Except now it's a Corgi and you're on the spaceship and you're like, why is there a Corgi here? It must be evil, which you're trying to figure out what the evil is of the Corgi. It'd be perfect. I would want this game to exist just for the fact of sitting there, watch you hear it in the vent and then it just like awkwardly falls, shakes its head, comes dog, comes out smiling at you. Maybe it's because it's the corgana space station vibe. But I'm definitely a picture, picturing a from Cowboy Bebop, if you've seen that. Like that's just, just, just a fat, thick, sort of twinky like Corgi that is sort of walk like there in the no gravity rooms. It's kind of waggling its little legs in the air. Some fun imagery drifting around. That's one of those cartoony things you like, right? It's one of those cartoony things I like. Yeah. And now our final Cool Games Inc. comes from Tim Gettys here, 'cause he's preparing for Kinda Funny Live and we're preparing for E3. We're clearly not preparing that hardly that.",
            "start": 826.68
        },
        {
            "text": "things I like. Yeah. And now our final Cool Games Inc. comes from Tim Gettys here, 'cause he's preparing for Kinda Funny Live and we're preparing for E3. We're clearly not preparing that hardly that hard. Sending you ideas, Tim. Tim's suggestion for his game is Press Conference Simulator 2014 HD Remaster. What have they updated? What have they added for the 2017 version? So think of 2014 video game conferences. What kind of thing would we have to add? First thing they've updated is they're not calling them press conferences. They're calling them Spotlight Showcases, Nintendo Direct. Yeah, yeah. That's the thing. You have the option if you want to instead of actually having a press conference to have a pre-recorded, pre-edited YouTube video. That was pioneered by Konami. And I remember G4 and everybody was like, let's not do it like that. Let's do it good. Yeah, let's do good. They were alternately horrifying and ingenious. Look away from those, those early Konami press conferences. There's just something so special.",
            "start": 864.68
        },
        {
            "text": "not do it like that. Let's do it good. Yeah, let's do good. They were alternately horrifying and ingenious. Look away from those, those early Konami press conferences. There's just something so special about like, God, 1 million troops. There's just so many things I still think about that all the time. Uh, Naoi Maeda, who was the basically the, the figurehead of Dance Dance Revolution the first decade of its existence, was there showing off, uh, Dance, what was it called? Dance Masters. It was like a Kinect dancing game where he said, \"You can move your body freely.\" And it's, I, there's a, there is one specific Konami press conference that I have fully memorized and will never get out of my head. I just like that you have to use the Kinect to actually move your body freely. We are, we are too constrained in our actual lives in the real world. We need to Kinect. Need to read my body so I can free the body. It's the second time I've talked about Kinect today. Really? What the f*** is going on? The first one here, 'cause I remember.",
            "start": 909.92
        },
        {
            "text": "the real world. We need to Kinect. Need to read my body so I can free the body. It's the second time I've talked about Kinect today. Really? What the f*** is going on? The first one here, 'cause I remember, no, the first one was on Cool Games Inc. God, I was going to say, I mean, I black out most Kinect. We talked about Kinect Star Wars a little bit. That was like such a freeing moment of packing to move and picking up the Kinect. I'm like, f*** you. Sometimes there will be like a tiny shitty thing about your life that you could fix really easily, but you don't. I've had my Xbox One Kinect in front of my TV for years now, just sitting there. And it's like kind of blocking the IR thing on my, my TV, my remote and the ceiling and stuff. So the IR will bounce off. And I'm not, it's not even plugged in. Why am I doing that? I, I, I got a new TV and it like the shape was different. So I had to get rid of the Kinect for that very same reason. Yeah. What was funny were like, you know, for the next three days yelling at a.",
            "start": 948.64
        },
        {
            "text": "television that stopped listening to me. God. And it was, it was kind of like, oh, don't give me the silence. She's really gone. She's really gone there. Thanks for watching this episode of The Gamescast, hosted by me, Greg Miller. Click here to subscribe. Click here to see more Gamescast videos. Click here to support us on Patreon. Click there to go see the Kinda Funny content we do at youtube.com/KindaFunny. I love you.",
            "start": 983.2
        }
    ]
}