{
    "id": 2630,
    "video_id": "a7Fyp94R6Pc",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Creativity - The GameOverGreggy Show Ep. 180 (Pt. 1)",
    "description": "How do we attempt to maintain being creative.\n\nThanks to Squarespace for sponsoring this episode. Go to Squarespace.com/Gameovergreggy and use promo code GOG\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1494831601,
    "duration": 2406,
    "transcript_chunks": [
        {
            "text": "June 3rd 2017 where are you going to be hopefully San Francisco, California, pardon with your favorite boys KindaFunny.com/KFL3, get your tickets now. There'll be girls there too, don't worry. Hey, you, you love the internet, right? Well, how about you make the internet? That's right, this episode of The GameOverGreggy Show is brought to you by Squarespace. Make your dreams come to life if your dreams involve the internet, and in this day and age, brother, you know they do. They let me write this ad again, by the way. Whether you need a domain, a website, or an online store, make your next move with Squarespace. Squarespace features beautiful, award-winning design templates, in all-in-one platform, 24/7 customer support. Squarespace provides all sorts of cool things like custom domains, and it's on the internet. You're on the internet right now. That means we're all part of the internet. This is like being told you're part of a tree and can grow an apple. Grow an apple today with Squarespace. Start your free trial at",
            "start": 0.28
        },
        {
            "text": "on the internet right now. That means we're all part of the internet. This is like being told you're part of a tree and can grow an apple. Grow an apple today with Squarespace. Start your free trial at Squarespace.com/GameOverGreggy and enter the offer code GOG to get 10% off your first purchase. Squarespace, growing internet Apple. I made that up. What's up, everybody? Welcome to The GameOverGreggy Show. I'm one of your hosts, Greg Miller, alongside the producer, seducer, Nick Scarpino. Hello. It's been a week, maybe more. How's your back? Uh, it's getting better. Yeah, it's getting better. Yeah, you getting there every day. How long before you're back out there rolling around on shag pits in bed? Oh, probably same difference. Uh, probably another week, I would imagine. Yeah, right now the thought of uh, doing anything physically strenuous uh, just throws a shudder up my spine, literally and physically and figuratively. So, um, yeah, I'm not going to be doing anything crazy anytime soon. Okay, yeah, over there the",
            "start": 41.4
        },
        {
            "text": "anything physically strenuous uh, just throws a shudder up my spine, literally and physically and figuratively. So, um, yeah, I'm not going to be doing anything crazy anytime soon. Okay, yeah, over there the pure one, Tim Gettys. La Croix. You should just be like, La Croix. When did it start, La Croix? Cause it's it's on its way to take over the entire world. I've noticed. Uh oh, I'm late to this party. This party I didn't get the invite and I showed up eventually cause I heard Greg brought you. Greg brought the party. Uh, Gia was she was at the party already and I was like, I'm not going to that party. I also wasn't invited to the party. Uh, but then I went down to LA for a meeting with Microsoft a couple ago. I'm a fancy, fancy ****. And uh, they had La Croix and they're like, well, since you're a fancy **** and this is fancy business meeting, you want some La Croix? It's fancy water. Like, yeah, I drink it all the time. Of course, I'm fancy. Yeah, no, I was just like, let me try it. And I tried it. I'm like, this is disgusting. And then just like every",
            "start": 101.36
        },
        {
            "text": "you want some La Croix? It's fancy water. Like, yeah, I drink it all the time. Of course, I'm fancy. Yeah, no, I was just like, let me try it. And I tried it. I'm like, this is disgusting. And then just like every other drink in the world, if you drink it enough, you stop like thinking it's nasty and you just keep drinking it. Yeah, and it's not bad for you. Just makes you bloated. But and joining us for the first time, Patreon supporter, Crush Your Goals podcast host, Chris Yates. Hello. Hello. How are you? I'm good. How are you guys? I'm great, man. Hanging in there. Chris, what's the what's so you supported us over on Patreon.com/KindaFunny to come on the show? Yes, I did. I **** you over, booked you, and then totally had the wrong day on my calendar. It's all right. We figured it all out. Here you are now. I'm here. Uh, tell us about what's the what's the give us give us the elevator pitch. Elevator pitch. Uh, just Crush Your Goals is just basically the idea of just doing what you love, whether it is um, you know, if you want",
            "start": 150.2
        },
        {
            "text": "us about what's the what's the give us give us the elevator pitch. Elevator pitch. Uh, just Crush Your Goals is just basically the idea of just doing what you love, whether it is um, you know, if you want to be a librarian, a cook, an astronaut, whatever it is that you makes happy in life, you know, I mean, you really go after it, just do that. You know, as long as you're not, you know, hurting babies or anything else, or just, you know, you know, the whole Kevin Smith Kool-Aid thing. Mhm. I've been drinking that. So that's basically it. How long you been doing your podcast? Since January 2nd, I believe. Oh, wow. Okay. Yeah, so I've been doing, yeah, about that. And then um, I've been doing it the whole time, posting and yeah, once a week, once a week. Once I kind of do something, you guys may be aware of it, where I uh, put it through topic by topic, segment by segment, because it's uh, I'm all by myself. And so it's the only way I can keep content and keep up with everybody else in this, you know, YouTube world. Yeah, that's smart.",
            "start": 189.92
        },
        {
            "text": "topic by topic, segment by segment, because it's uh, I'm all by myself. And so it's the only way I can keep content and keep up with everybody else in this, you know, YouTube world. Yeah, that's smart though. I like that. We were talking earlier about this and I was looking at a YouTube channel. It's very impressive looking. Thank you. It seems like you've you learned from from the right people. Uh, your logo designed by Zach Silver. It's the same guy that does our logos, Reflect Design Co., which is great. Yeah, Reflect Design Co. Fantastic work. And I love your thumbnails. I love the look of all of it. And yeah, you look like you've done a lot of content for only doing it the last couple months. Doing a lot of studying. Yeah, so it's good as in watching. Yeah, that's the things get done though. I talk about it all the time about how our stuff reflects what I learned from watching R de growing up. Well, and that was the thing too, is just seeing you guys and be like, I can do that. You know, I mean, just anybody can know",
            "start": 228.0
        },
        {
            "text": "time about how our stuff reflects what I learned from watching R de growing up. Well, and that was the thing too, is just seeing you guys and be like, I can do that. You know, I mean, just anybody can know get on it. And so literally with my setup is that I'm in my own room as well. It's literally just setting up, moving my bed, putting my camera up, my lights, and then that's it. If I come over and done your show at your house, I would have been on your bed. I mean, we can put you on the bed. We can do a show that way if you want. Moves the bed. Yeah, move the bed. Shut up, Kevin. Let me just dream about being on a bed. All right. You your dream about the bed. Aren't you married? I got one bed. I am married. That's right. He is married. God, not going to be weird. Uh, not yet. No, I don't know. It's it's still fun. It's still quaint. Say my wife, this wife, that. Cool. Greg was over here for a barbecue today. He was talking to me about it and we're were talking about it. He's you he's like, yeah, and you got someone bad at home and",
            "start": 269.16
        },
        {
            "text": "say my wife, this wife, that. Cool. Greg was over here for a barbecue today. He was talking to me about it and we're were talking about it. He's you he's like, yeah, and you got someone bad at home and now you get to call her wife. And I'm like, I do. It's cool. This is cool. You do have someone bad. Yeah, I do. I do. She's she's a bad ****. Exactly. I'll put it out there. Thank you very much for saying say that. Hey, thanks for bringing that person into our lives. No problem. Well, brought her into mine. So that's that's fair enough. That's fair enough. If you didn't know, ladies and gentlemen, this is The GameOverGreggy Show. Each and every week, four, sometimes five, best friends gather on this table, each bring a random topic discussion for your amusement. If you like that, head over to Patreon.com/KindaFunny where you can toss us a couple of bucks, get the shows early, or toss us more, get on the show, get some extras, have some fun, have a fun email and phone call with me when I **** up the scheduling because I'm too",
            "start": 309.72
        },
        {
            "text": "can toss us a couple of bucks, get the shows early, or toss us more, get on the show, get some extras, have some fun, have a fun email and phone call with me when I **** up the scheduling because I'm too overworked and have things happening. Uh, if you have no money to toss though, no big deal, head over to YouTube.com/KindaFunny where we post the entire show topic by topic, day by day, until it goes up as one big video and MP3 the following Friday. Chris, the floor is yours. What is your topic? My topic is creativity. I know this is a funny way of saying things because, you know, I'm copying you guys and Kevin Smith. But um, well, yeah, that's that's interesting. You're a big Kevin Smith fan, right? Yes, I am. Once when you got here today, I was talking to you and it was Kevin. I had floored you with that saying, I don't do games. Yeah, Kevin mentioned some about video games. Like, I don't play video games. I'm like, wait, how did you find us? I found you guys through Kevin Smith then. So I basically found you guys and just",
            "start": 344.92
        },
        {
            "text": "don't do games. Yeah, Kevin mentioned some about video games. Like, I don't play video games. I'm like, wait, how did you find us? I found you guys through Kevin Smith then. So I basically found you guys and just listened to you ever since then. So basically when that came in December of like a year or two ago, yeah, last week December, that's where I found you guys. I was just like, you know what? I think I can do a, well, I was step back. I was listening to Kevin Smith and be like, I can do a podcast, or at least I think I can do a podcast. Not well, mind you, but I was just like, I think I can maybe do it. And so I was just like, let's try. And so my first podcast was like, Yeti Mike, me talking to two friends and just like, **** it, let's try. And so then it was just like, okay, I'm going to recess things, re-redo things, cause life happens. And then so I got that ****. That's what Kevin does. He loves trying to distract everybody during the show. Here he goes. But anyways, um, so then I just I relaunched everything and it was",
            "start": 383.32
        },
        {
            "text": "life happens. And then so I got that ****. That's what Kevin does. He loves trying to distract everybody during the show. Here he goes. But anyways, um, so then I just I relaunched everything and it was just the idea of like, oh, I'm going to do with Kinda Funny. I can see I can do that. So I'm just going to do this. And then Kinda Funny. And then with Kevin Smith and things like that. Okay, creativity. I'm sorry, my apologies to get out there. I like that. I like that origin story. And so basically, um, how do you guys create personally? Do you guys have a schedule? Do you have a routine? Do you find time to be creative between work and a personal life? Do you have a Kinda Funny mindset? Do you have like a personal mindset set? That's kind of like the general idea of it. And then so you guys can take it wherever you want. Well, I want to start with you, cause like, you're you're you're here, Crush Your Goals, your podcast and all this stuff. But that's not your job, right? You have a you have a full-time gig. You have",
            "start": 416.16
        },
        {
            "text": "you want. Well, I want to start with you, cause like, you're you're you're here, Crush Your Goals, your podcast and all this stuff. But that's not your job, right? You have a you have a full-time gig. You have to go do. Yes. How do you find time then? How do how how did you go from my listen to podcast and I think I could do that too? You know what? I'm going to work a hard day of because what do you do for a job? I work with uh, special needs kids and then I make sure they get to school. And uh, that's an awesome job to have. Thank you. But I mean, I imagine it's stressful, it's tiring. Yeah, I you'd want to come home, I imagine at some point in looking at your physique, eat a three three dozen buffalo wings, have a beer. Yeah, how do you find time between I guess lifting a bus over your head and driving a bus? And then I mean, like, what motivates you to go be creative? Just doing it, I guess. At the end of the day, it's just finding the time for me. It literally is just that and just understanding like, what is it I want",
            "start": 452.56
        },
        {
            "text": "I mean, like, what motivates you to go be creative? Just doing it, I guess. At the end of the day, it's just finding the time for me. It literally is just that and just understanding like, what is it I want and how I want to do things. Because the way I want to do with my, I guess, platform or brand or whatever the hell you want to call it, I mean, it's mostly just me and two of my friends and then nice enough to like humor me. And so basically it's just me. And so it's just the idea of like, all right, how do I do this? How can I go that next step? And it's like, I want to be here, but I want to be there as well. So let's just might as well just do it. Start working on, just start working on you find what makes me happy. And this past year for me has been finding that. And then um, because when I first launched Crush Your Goals, I mean, I don't want to make it a Crush Your Goals topic, but it was just the idea of it was based on fitness, cause that's when I first thought of it. I'm like, oh, fitness clothing lines, Crush Your",
            "start": 487.96
        },
        {
            "text": "Goals. I mean, I don't want to make it a Crush Your Goals topic, but it was just the idea of it was based on fitness, cause that's when I first thought of it. I'm like, oh, fitness clothing lines, Crush Your Goals. That sounds awesome. And you know, most most people would associate that. Mhm. And then it was like that went on for a year and then it just didn't happen. And then my life happened. And then um, personal stuff happened. It was just like, what can I do now? This I'm not excited about this. I'm going to expose. I'm going to things. It's just it's not working. You know what I mean? It's these are like fitness expos and stuff like that. Yeah, this is fitness expos and things. Just I tried making deals with people and just fell through. And it's just like, well, ****, like, I'm trying my hardest to get **** done and it's just why is this not working? You know what I mean? If you're putting all your time, all your energy into said basket, why is it not working? Granted, you're not supposed to put all your energy into",
            "start": 529.48
        },
        {
            "text": "it's just why is this not working? You know what I mean? If you're putting all your time, all your energy into said basket, why is it not working? Granted, you're not supposed to put all your energy into one basket, they say. But um, so then I relaunched it and then it was just like, I want to make stories. I want to find that. And that's and I want to be a storyteller. And so how badly do I want to tell my stories or stories about film or whatever it may be or other people's stories? Sure. So I think with the Crush Your Goals podcast, I have when I have one-on-one time, it's me talking to people I find interesting or, you know, people I'm talking to as in like business people or develop or you not in a sense of developers as like gamers, but just like comics and things like that. More on the film and comic side. Sure, sure. Creators in general. Yeah, yeah. And you're also you're working on a script for a movie. Yeah, so that's that kind of is the goal when there's the other goal that you were talking about earlier.",
            "start": 565.56
        },
        {
            "text": "sure, sure. Creators in general. Yeah, yeah. And you're also you're working on a script for a movie. Yeah, so that's that kind of is the goal when there's the other goal that you were talking about earlier. Yeah, so um, if you can see, I have a really big head. And so I try to shoot for the stars. And that's just the whole big thing going for it. And so trying not to have an ego, but it just like, what is it do I really want to do? And it's like, I want to make a movie. That's been that's been my biggest dream. Like, cause growing up, I was always like, bust into school or things like that. So I never was like talking to people or or the sense of like, I was one of the cool kids. So I always did sports to kind of, you know, supplement that. But then it was just like, all right, I'm going to watch movies with my parents. And then my mom or my dad taking me to the movies on Wednesday or not Wednesdays on Sundays or things like that. And it was just, I want to do this. This is cool. Like, and then seeing Kevin Smith be like that",
            "start": 604.48
        },
        {
            "text": "my mom or my dad taking me to the movies on Wednesday or not Wednesdays on Sundays or things like that. And it was just, I want to do this. This is cool. Like, and then seeing Kevin Smith be like, that doesn't look that good. Like, Clerks. It's harsh, but you know, it's the thing of it's time. You know that though. Said multiple times, Clerks is not a good movie, not a well-made movie, I should say, as far as craft is concerned. But that's fun movie. It's a great movie. That's just been always been like my true passion. It's just like, I went to Long Beach State, right? And then so I did track. And then they said, hey, if you want to come into do track here, you can't do film. You're just you're you're what a bunch of ****. Your credits don't line up. So you got to do something different. Okay, so I did something different. And then it's like, I got a job offer to be a coach. And it's like, all right, well, this is good money. And this is like a cool experience. But this isn't filmmaking. You know what I mean? And then just like",
            "start": 643.8
        },
        {
            "text": "and then it's like, I got a job offer to be a coach. And it's like, all right, well, this is good money. And this is like a cool experience. But this isn't filmmaking. You know what I mean? And then just like, just figuring things out. Just like every single bump in the road. You know, that plan B of just been like, ****, this isn't what I want. Sure. By the time you turn around and look down the path you've gone, you're like, I'm way off track from where I want to be. Yeah, and they say like, Morgan Freeman was on The Nerdist one way back then. He's like, if you're doing plan Plan B, then why are you even worrying about plan A or some something to that effect? And it's just like, ****, I need to get back to that, cause that's what makes me happy. And then I just was like, **** it, I'm going to start writing. And then just see where it goes. And then slowly but surely became about my life. And then how I'm going to do things. It's like Ricky Gervais said on The Hollywood Reporter, or he years ago wrote an article and it was",
            "start": 681.68
        },
        {
            "text": "see where it goes. And then slowly but surely became about my life. And then how I'm going to do things. It's like Ricky Gervais said on The Hollywood Reporter, or he years ago wrote an article and it was like, write what you know. So what do I know? My life. Simple, simple. Play that way. But it's just like, okay, I'm going to write a story based on me and my best friend and everything we've experienced in the past three years of our lives. And then I'm going to try and just take it to that next level. So it's basically like 80% our lives and then 20% kind of just like spinning a yarn. That's awesome. That's really cool. I mean, it's I mean, creativity. That's what this is all about, obviously. But I mean, it's awesome to see you make time for that while you're doing this YouTube channel, while you have a great job. I mean, getting off of Plan B, trying to switch this up and get where you want to be. Yeah, and then for some people are probably like, why does this guy have a YouTube channel or this or that? It's just",
            "start": 713.64
        },
        {
            "text": "this is something I can do in the meantime. You know what I mean? This is something fun I enjoy. I don't expect many people to look at it or see it. You know, I've been podcasting for like two or three years now. And then when I first launched Crush Your Goals, I had a Crush Cast with the Yeti thing, right? So that's been three years of shitty podcasting. You know, and like, I'm just now getting to being halfway decent. You know, takes a lot of work to be just this half ass. You know, so me, we know we're well aware of that. Don't worry about that. So that's just that mindset of just like, I want to just keep trying, cause I'm back then, or I should say back then, back about two to three years ago, I had someone in my life say, you know, you're you're just going to be this one thing. You know what I mean? And then that person was",
            "start": 755.72
        },
        {
            "text": "a big part of my life at that time. And it was just like, you know what, **** you. Yeah, no, **** you. No, it's not. You know what I mean? I'm more than just said thing. You know, at least in my heart and like my head, I feel like I am. Sure. And so I was just like, how far can I take that, right? Or at least how far can I try to take that? That's this was a relationship, I'm assuming, huh? A relationship, I'm assuming. Yeah, no longer. Yeah, well, when you mentioned something happened, I assume that's what it was back in the day. But that's what you need to do. Like that. I mean, for us in particular, I mean, for what we've done and how we went, I remember when we were getting ready to leave IGN and it was that thing of telling people about it. And I think even Kevin Smith talks about on the podcast we did with him,",
            "start": 790.68
        },
        {
            "text": "we've done and how we went. I remember when we were getting ready to leave IGN and it was that thing of telling people about it. And I think even Kevin Smith talks about on the podcast we did with him, where it was just like, well, what do your significant others think about this? You know what I mean? And it was that if any of them would have been at the time like, this is a dumb idea. Why are you doing this? You couldn't do this. You can't. You're nothing with them. Blah, blah. It would have been like that moment of either you accept that and that's who you are. You're like, no, **** off. Like, this I can be more than this. I can do more than this. And to your point, um, shout out to my girlfriend. She is completely supportive of it. Uh, her name is Maia. What? She's 5 foot and has calves a size of softballs. Nice. So, uh, she works out too. So I imagine so. Yeah, either that or she's got amazing genes for calves. Yeah, and so she can eat whichever she wants and has amazing calves. But anyways, um, so yeah, she's been super",
            "start": 826.44
        },
        {
            "text": "so uh, she works out too. So I imagine so. Yeah, either that or she's got amazing genes for calves. Yeah, and so she can eat whichever she wants and has amazing calves. But anyways, um, so yeah, she's been super supportive of it. I mean, she's been there since day one since we first started dating. She saw me as a coach. You know what I mean? Cause that's where I was. I was a university coach getting my masters. And so I was just like, ****, this isn't what I want. And then funny enough, there is a touchstone of sorts to me in my life. Uh, did you guys remember the Marvel event in October, like three years ago in 2014, when they announced everything? When they announced the whole timeline and it was **** epic. They Captain America: Serpent Society. Everyone was just like, no one wants that. And Civil War. Everyone lost their ****. Yeah, I'll never forget that. Yeah, I was there with Maia. We got there. I called in sick. I was like, not sick, obviously. So I was like, **** this, I'm going. I'm not missing out on another cool thing. I've",
            "start": 860.16
        },
        {
            "text": "yeah, I'll never forget that. Yeah, I was there with Maia. We got there. I called in sick. I was like, not sick, obviously. So I was like, **** this, I'm going. I'm not missing out on another cool thing. I've never been to a Comic-Con, never been to like anything nerd-esque, I guess you would say, or anything like of that degree. You went to the coolest thing that there ever **** was. Yeah, I would have killed to be in that room. So I got there and we were like, **** late. It was just LA traffic sucks, especially in the morning. And you're just like, ****, we're not going to get in. And then literally like, you two come with us. Us, we need to fill up spots. Okay, so then they take us down to the front level and they're like, you need to sit right here. Jim Vejvoda, Stacks is right in front of me. No way. Stacks. Yeah. And then so then you, yeah, I and then uh, Joss Whedon sitting next to me like the entire. And I'm just like, why the **** are we here? You know what I mean? Like, there's something to this. Like, you were going to",
            "start": 903.04
        },
        {
            "text": "so then you, yeah, I and then uh, Joss Whedon sitting next to me like the entire. And I'm just like, why the **** are we here? You know what I mean? Like, there's something to this. Like, you were going to be announced as Black Panther. I wish. God damn, that would be something. But anyways, it was just that idea. That might caused a couple ripples, maybe, you know. But um, it was just that idea of like, holy ****, this is amazing. And then I remember leaving it being just like, ****, why am I not doing this? You know what I mean? Because you know, for me, it's been about films and superheroes and comic books. That's been like my thing. You know what I mean? And so it's just like, this is what I want to do. You know what I mean? Granted, it's, you know, pie in the sky, way down the line type of thing. But it's just like, how do I get there? Yeah, and so it was just literally me and her just like sitting. I was quiet. I was trying not to get emotional about it with her. And I was just like, cause she knew she was like, this is",
            "start": 938.12
        },
        {
            "text": "how do I get there yeah and so it was just literally me and her just like sitting I was quiet I was trying not to get emotional about it with her and I was just like cuz she knew she was like this is what you want and I knew right then and there I was going to like I'm going to have to quit or I mean like when that time comes or like I'm going to have to just take that next step sure and so I eventually did well that was a big thing for us I mean it was the conversation of well we feel like this is the right move but even if it fails like we got to take it now because other we don't want to look back in 10 years and been like well I wish we would have done that back then yeah I mean I'm also I'm also a a big fan of the concept that like there's no such thing as wasted creativity right so if you're going to go out and try something and even if one person watches it I think there's still merit in that I think there's still value in that um and a lot of people think that like a lot of",
            "start": 973.92
        },
        {
            "text": "if you're going to go out and try something and even if one person watches it I think there's still merit in that I think there's still value in that um and a lot of people think that like a lot of people make the mistake of thinking there is such a thing as an overnight success because once you discover someone or once you you know like you and I were talking about Joe Rogan earlier but like by the time I came across his podcast it was already one of the number one podcasts in the world right so it's easy for you to look at that and be like oh my God that's like I'm never going to be that because this guy is huge and obviously that happened overnight and then you start listening to his stories you're like no this guy built a career from the age of 16 to now and now he is huge right he's been huge for the last maybe 10 years but still you're you're neglecting to think about the other 20 years he spent mounting that amazing career and building toward that um and I you know you ask",
            "start": 1009.0
        },
        {
            "text": "been huge for the last maybe 10 years but still you're you're neglecting to think about the other 20 years he spent mounting that amazing career and building toward that um and I you know you ask when do we find time to be creative I I like to try to carve out at least um at least half hour not an hour of every day to just sit and write and do something on that nature sometimes you know I go into every day saying I'm going to write for an hour every day and then sometimes the day happens and you just miss out and you're like shit you feel bad but you write the next day um and that's not something that I ever really even need to any of that to see the light of day day it's just fun to sit with that and and it's very um it's almost a relief of the pressure to be like I'm just going to put some words down on paper right now and just see where that leads sharpen that tool keep that keep that creative part of my brain um going and I'm actually I'm fortunate enough to have things like you",
            "start": 1045.32
        },
        {
            "text": "some words down on paper right now and just see where that leads sharpen that tool keep that keep that creative part of my brain um going and I'm actually I'm fortunate enough to have things like you know obviously this is a incredibly creative Endeavor that we do um that has afforded me not only the the opportunity to do podcasting but also to do things like the animated show or do things like love and sex stuff we can go out there and do little stupid skits um and work toward that um but it's very easy even even for me sometimes I'll be like you know Tim Gettys and I will talk we'll go out to coffee like man I just wish we could do like this thing and I keep saying that and not realizing that we are in fact working toward that and we will have whatever those things are one day but you have to keep that in mind of saying it can't happen overnight real progress is a slow uphill sort of like progression you know I mean and it's very difficult to judge that and see that when you're in the",
            "start": 1085.32
        },
        {
            "text": "to keep that in mind of saying it can't happen overnight real progress is a slow uphill sort of like progression you know I mean and it's very difficult to judge that and see that when you're in the middle of it like Joe Rogan could look back on his life now and be like yeah I've clearly made it right but if you'd asked him maybe 10 15 years ago maybe he didn't think that right maybe he's like I'm still struggling trying to figure out what's next after Fear Factor or whatever and now he's like a household named to anyone that likes UFC or likes comedy um or likes hunting or psychedelic drug trips man shit yeah man, it what's cool with you specifically Nick Scarpino is everything you just said is absolutely right where when you're in the moment it's kind of hard to look around and be like all right this is what I wanted before and now I actually got it but I'll never forget being at Comic-Con year after year with IGN doing the shows and you would direct the um the live shows that we did that",
            "start": 1118.48
        },
        {
            "text": "this is what I wanted before and now I actually got it but I'll never forget being at Comic-Con year after year with IGN doing the shows and you would direct the um the live shows that we did that Greg Miller hosted and we'have so many celebrities come through and Greg Miller would be interviewing whatever and whenever we' go out to lunch we'd all be like man this is shit cool and rad and you were always just like yeah but I want to be I want people talking to me about the thing I'm doing yeah there was always that there was always that sort of I mean don't get me wrong the stuff that IGN does now into this day the stuff that we started and helped build is still tremendously creative and it's awesome and if that's if that's what you you know if your goal in life is to be is to kind of Chronicle what's happening in the world I think more power to you there's nothing absolutely nothing wrong with that but as a I have designs to create different things different kinds of media right I want to",
            "start": 1155.36
        },
        {
            "text": "what's happening in the world I think more power to you there's nothing absolutely nothing wrong with that but as a I have designs to create different things different kinds of media right I want to create more narrative content I want to create content that can live on sort of Beyond me you know make my name for that and um you can say it if you want I did I said it quietly um and so yeah it would all it would it would be Bittersweet every time we would stand on a press line and you'd sit there you I don't know if you've ever done a press line before but what you used to do I think it's probably still the case I haven't done one in years but you go you wait in the behind like in in the back room of a hotel or the back room of a Comic-Con and you know whoever will have just gotten off the main stage or whatever comes back and you're lined up with your camera and then one by one and they come down and you get about a couple minutes fan out everyone their mic out everyone hold their mic out",
            "start": 1191.16
        },
        {
            "text": "main stage or whatever comes back and you're lined up with your camera and then one by one and they come down and you get about a couple minutes fan out everyone their mic out everyone hold their mic out and you know the very from the very first press he's just such a great director and it was a pleasure to work I mean I all the faith in the world and that's really why I came together but it's a team effort yeah and you know and then well yeah and the point I was trying to get to the point is there was always a line right and like being that being on one side of the line had always always affected me yeah and I I always want I always thought I'm like it's it's awesome to be here don't get me wrong like this is a dream come true but I wonder I always wonder wonder what it be like to be on the other side of that line people that get to come out and talk about this thing they've been working on for like 3 years and like are you know that the all the anxiety and all the nerves and excitement",
            "start": 1225.36
        },
        {
            "text": "other side of that line people that get to come out and talk about this thing they've been working on for like 3 years and like are you know that the all the anxiety and all the nerves and excitement that goes into like letting the press and letting the public see that product um the thing you've poured your heart and soul into you know I think that's just there maybe I'm over romanticizing it by all accounts there's a lot films are hard and you know things TV's hard it's difficult this is hard work that people go through um but at the same time it's always you know I always like shit man like seeing Bruce Willis for the first time or seeing like Chris Hemsworth or seeing like Chris Evans and these like Robert Downey Jr. like holy shit like it makes it so much more real when you're like there's only a half a foot like the first time I saw Bruce first and only time I should say that I saw Bruce Willis I was like there's a shit half a foot of air between me and Bruce shit Willis like",
            "start": 1259.0
        },
        {
            "text": "there's only a half a foot like the first time I saw Bruce first and only time I should say that I saw Bruce Willis I was like there's a shit half a foot of air between me and Bruce shit Willis like you're talking Die Hard yeah Bruce Willis like my John McClane like one of my alltime idols and it really made really makes it real for you like this guy did it he did it you know he put the work in and and he made the smart choices and he made the sacrifices and and he's able to do the thing that he wanted to do um and it's a it's it's a lesson learn like all the people out there that are doing the thing you've always wanted to do are people they're not super human beings they're not uh maybe some of them came from bigger and better families or lineage especially in film if they maybe they came from a film background where their dad or their mom or their you know brothers were in film before them but at the same time they still get up every day in the morning and think how am I going to do",
            "start": 1296.44
        },
        {
            "text": "from a film background where their dad or their mom or their you know brothers were in film before them but at the same time they still get up every day in the morning and think how am I going to do the thing that I want to do in life how am I going to continue do do the thing I want to do in life how am I going to get better at it or bigger at it um and and that's important because they can do it then everyone can do it well to your point it's just like the idea of like I'm nothing special but why not me yeah you know what I mean like why can't I do it like just understanding and just trying to figure out like okay like I want to make a movie how the shit do you do that you know what I mean like okay we got to get audio got to get a camera got to get you know are you doing a Steadicam are we doing a tripod are we doing whatever makeup wardrobe you know Insurance things like that getting getting actors are you going to have actors or you going to professional actors are you going",
            "start": 1332.52
        },
        {
            "text": "are we doing a tripod are we doing whatever makeup wardrobe you know Insurance things like that getting getting actors are you going to have actors or you going to professional actors are you going to have your friends are you going to get you know a real set or you going to do film in real places you know are you going to have you know this that and the other and you just got to figure out well and you mentioned ego right and I think ego is an interesting thing because it's a double-edged sword a lot of people say the word ego like it's a like it's a bad word right like you're not supposed to have an ego about things but there but in order to do what we do you have to have a little bit of an ego you have to have a little bit of that voice in the back of your head that says you know what you can do this like you know you can go out in front of 1300 people or a thousand people or stream in front of 5,000 people and be confident in what you're saying um and you know you've got all of your",
            "start": 1363.16
        },
        {
            "text": "can do this like you know you can go out in front of 1300 people or a thousand people or stream in front of 5,000 people and be confident in what you're saying um and you know you've got all of your past experiences that can tell you like yeah you're okay doing that but at the same time there has to be a little bit of you that kind of blows smoke up your own ass you know what I mean and and gives you that confidence like you know what shit it just go try it you can do this why not yeah right and that's why I think everyone reveres Kevin and rightfully so Kevin Smith because he was the one person that said I'm going to just do this at all costs and it actually worked out and unfortunately for everyone Kevin Smith there's probably 10,000 uh failed filmmakers that are now doing other things but um again going back to my original point like I don't think like I honestly Kevin Smith said something once on a podcast I'm sure he said it more than once on a podcast because knowing Kevin",
            "start": 1395.84
        },
        {
            "text": "things but um again going back to my original point like I don't think like I honestly Kevin Smith said something once on a podcast I'm sure he said it more than once on a podcast because knowing Kevin Smith he says he he says the same thing a lot um but it's always very inspirational he said you know he maxed out his credit cards and even if if Clerks had failed um he knew even on that the day after uh like he talks about how he took it to the first film festival no one showed up and he he was sure he was going to sell it and after that first film festival he was like just completely destroyed and he said even in that moment even in that that that total pit of desperation that he was in he knew he was going to do it again and like he's like even if this fails if they don't sell us I'm going to find a way to do this again and I'm like that kind of enduring spirit and that kind of that level of faith in yourself is a very important thing to have um because if you can't be your own",
            "start": 1433.72
        },
        {
            "text": "going to find a way to do this again and I'm like that kind of enduring spirit and that kind of that level of faith in yourself is a very important thing to have um because if you can't be your own cheerleader no one else is going to be yeah ever you know if you can't if and this is the same always no matter like at what level you're at there is always a you always have to be the person in the room that believes in yourself the most and you have to convince everyone else around you you know you look at guys like The Rock you look at guys like uh Kevin Hart guys that are like at the top of their careers after like 20 or 30 years putting it in and you going to tell me you stay in a room with that guy and that guy's not going to just shit like emanate light it up like just you know what I mean like he's going to light up the room with how much how awesome that he is maybe in a positive or negative way depending on the star you're talking about but like The Rock believes in himself yeah he",
            "start": 1470.4
        },
        {
            "text": "like he's going to light up the room with how much how awesome that he is maybe in a positive or negative way depending on the star you're talking about but like The Rock believes in himself yeah he really does and if he doesn't and I'm sure there are moments I'm sure there are days in The Rock wakes up and he's like shit I don't want to hit the weights again for the one billionth time yeah but he finds that in himself to be like you that self-talk whatever that positive energy is that you have to tell yourself every day he finds it himself and he goes out there and does it he rolls over and just looks at the bed of money he's on he's like I can do it I'll get out there I'll pump he's like I'm all sore and then he just dives into his pool of money and he's like this is definitely work he deserves it. Rock's awesome. Tim, yeah how do you keep keep your creativity going I don't know I think not growing up is a big part of it yeah you know just kind of like sticking to your",
            "start": 1509.84
        },
        {
            "text": "he deserves it. Rock's awesome. Tim, yeah how do you keep keep your creativity going I don't know I think not growing up is a big part of it yeah you know just kind of like sticking to your guns of what you always wanted to do when you had nothing to do like just thinking back to being young and playing with LEGOs that was all I ever wanted to do and it was so much fun it just allowed you to just go playing with action figures that's great too and there's a lot of imagination there but there's something about LEGOs where you're you're literally able to build whatever you want and then come up with the same stories you would with action figures or whatever and I feel like that's always stuck with me and as I've grown up I just always think back to being in that mindset when I'm thinking about things and when I watch movies like all I was doing with action figures was trying to recreate what I saw on TV and movies right yeah and it's about taking the moments that you really",
            "start": 1541.12
        },
        {
            "text": "thinking about things and when I watch movies like all I was doing with action figures was trying to recreate what I saw on TV and movies right yeah and it's about taking the moments that you really that really resonate with you for whatever reason and trying to channeling that into your output and whatever it is and like it's it gets really rough because the Grass Is Always Greener no matter what you're doing no matter how creative you are being with the thing that you are doing you always want to be doing something else and you always think that there is something better out there to be doing and I think that The Rock I can only imagine that he wakes up and as awesome as he is and as much as everyone looks at him as 10 out of 10 a perfect human being I'm sure he's just like am I doing the right things is there more I could be doing like is this the thing that I want to be doing I have all this money but there's always someone who seems more successful or is doing it in a",
            "start": 1581.76
        },
        {
            "text": "I doing the right things is there more I could be doing like is this the thing that I want to be doing I have all this money but there's always someone who seems more successful or is doing it in a different way that makes you that something that you don't have and a lot of the times it's not a uh physical thing it's more of man they're able to do that I wish I was able to do well you see you see it all the time with with uh actors and with with like celebrities like The Rock is a perfect example right like The Rock started with WWE um went into it was like I want to be in movies right I want to be the next action star Arnold Schwarzenegger whatever you to call it right started actively pursuing that put the work in did The Rundown did movies like that um and then and now he's doing he's producing his own stuff so he's got Seven Bucks Productions Seven Bucks Productions um I believe if I'm not mistaken they're producing Ballers um and another other things he's now he's working into the",
            "start": 1621.76
        },
        {
            "text": "own stuff so he's got Seven Bucks Productions Seven Bucks Productions um I believe if I'm not mistaken they're producing Ballers um and another other things he's now he's working into the online Market all that stuff Ballers by the way I know you guys don't watch I love Ballers we talking every week do you watch it I saw part of season two he doesn't like sports, Monster um but yeah I mean I I guarantee at some point The Rock's going to be like you know I don't know what I I don't know The Rock but I'm sure at some point he's like how do I get into more like less action stuff more dramatic stuff maybe he's going to angle toward maybe getting a maybe getting an Academy Award right um it's not beyond that being president yes that he could be I mean he could he could take a step down from Academy Award and become president of the United States that would be that would be interesting um although The Rock if you're listening we need you come on be our hero um but I think what you brought",
            "start": 1663.08
        },
        {
            "text": "from Academy Award and become president of the United States that would be that would be interesting um although The Rock if you're listening we need you come on be our hero um but I think what you brought up is a very interesting point right when we first started podcasting the reason I found uh the Joe Rogan Experience and uh you know some other like Smodcast things like that was because I realized that I wasn't a fan of the product that we were making and I think that's incredibly important right if you're trying to make um films and you don't like watching movies you're not it's not going to work out right if you can't if you don't have a ongoing list of your top 10 movies that's every time someone asks you it's completely different you're probably not you probably don't have passion for doing this thing right um same with me in podcast I was like Hey we're going to start a pod game when we decided to do The GameOverGreggy Show uh two three years ago um three years ago three years ago",
            "start": 1704.0
        },
        {
            "text": "this thing right um same with me in podcast I was like Hey we're going to start a pod game when we decided to do The GameOverGreggy Show uh two three years ago um three years ago three years ago uh I was like I don't actually listen to podcasts and I think that's bad I think I probably should probably look out there and try to find someone that I can Vibe with and lo and behold as I started listening to Joe Rogan and to Kevin Smith and to a number of other podcasts like The Business um I became a fan of not only the medium but the personalities behind it and I think that's very important because if you can't say to yourself like eat a slice of humble pie like there are people out there that do it better you know Tim's a perfect example of this where he always looks up to the guys with Rooster Teeth um and there's two ways of looking at that there's that whatever you know I'm not a fan of their content so their content doesn't matter or they're doing something right I should",
            "start": 1738.88
        },
        {
            "text": "with Rooster Teeth um and there's two ways of looking at that there's that whatever you know I'm not a fan of their content so their content doesn't matter or they're doing something right I should probably try to figure out at least give this a chance and try to be and put my ego aside in that regard to become a fan of this and see and be inspired by this because that's really what it it's all about right anyone that's ever wanted to make a film or make a song or make a rap video or anything like that that didn't happen in a vacuum at some point you saw someone else do it and you were like that's cool I want I want to be able to do that right and then those that steps between what you're talking about which is the step between being like going oh that's really cool I wish to you know what I'm going to take that first step and start trying to be that person that does a little bit um that's the single most important step and then from that point on it's just about enjoying the ride",
            "start": 1773.68
        },
        {
            "text": "what I'm going to take that first step and start trying to be that person that does a little bit um that's the single most important step and then from that point on it's just about enjoying the ride because who the shit knows where you're going to end up circling back to way earlier in this when I was talking about you in the Comic-Con thing uh to bring it to Rooster Teeth I thought it was funny cuz two weeks and we went to Rooster Teeth for the week and we were on all the podcast so much of it just was like so tell us about Kinda Funny and like I had a moment where I'm like Nick Scarpino doesn't even realize it but we're literally doing the thing that he always wanted to do no no trust me we sat there people were interviewing us about our creative output yeah it's very cool I mean and that and that's too that feeds the ego and that feeds obviously the creativity right like right now I'm getting that that level of fulfillment and validation as a Creator which is good and once you start",
            "start": 1810.56
        },
        {
            "text": "and that's too that feeds the ego and that feeds obviously the creativity right like right now I'm getting that that level of fulfillment and validation as a Creator which is good and once you start getting it of course you just want more of it right you want to give back you want that that cycle of like and that's that's why creativity is is probably the single most important thing in what we do just the concept of it even if you don't necessarily define it it's just the concept of putting out that energy into the world with the fingers crossed that you're going to get it back tenfold you know well I mean it's it's speaking to what you're talking about and speaking to what you were talking about Chris with you know your podcast in the beginning is the fact that what it comes down to is if you're making a product you believe and you'll find other people who believe in that product if you're having having fun doing is what we why we all started this and where it all began but for you not to",
            "start": 1845.0
        },
        {
            "text": "making a product you believe and you'll find other people who believe in that product if you're having having fun doing is what we why we all started this and where it all began but for you not to enjoy how what you were putting on on the podcast wherever go find new podcast for you to be into it for a year you said right and then be like well I'm not on the path I want to be with it that's always the interesting aspect of it and it's interesting as we've gotten bigger and Kinda Funny's grown the more and more people now not in a bad way but want to change that Vision or whatever you know what I mean like why why are you doing this why wouldn't you do this why aren't you doing this show why wouldn't you do it this way and it's like I understand that and I respect that you want that but if I don't agree with it I can't make that happen I can't you know force your Vision into my vision 'cause then it'll be I'm doing it for the wrong reasons and then why would I won't be happy in the end and",
            "start": 1879.04
        },
        {
            "text": "I don't agree with it I can't make that happen I can't you know force your Vision into my vision 'cause then it'll be I'm doing it for the wrong reasons and then why would I won't be happy in the end and you won't be happy either because the product won't be genuine if that makes sense no makes perfect sense and that's the whole reason why we did this in the first place right was to do some to do what we wanted to do and hopefully attract a group of people out there that would help support us in that by watching it and and you know buying ridiculous t-shirts and that to me that is why I think that we are the luckiest people in the world because to me Kinda Funny Live is my ultimate creative output where I'm like I'm that is what I like to do I look up to people that put on awesome live shows and to be able to be like all right what would be cool for our audience to see and to be able to think that way I love that so much and I love that we've created a place where people just want to be",
            "start": 1914.36
        },
        {
            "text": "and to be able to be like all right what would be cool for our audience to see and to be able to think that way I love that so much and I love that we've created a place where people just want to be entertained by us so anything that we do is already going to be enough but that just puts the pressure on me to be like no no no take off a notch it can't be just be enough like this is the opportunity to be creative and give back and like that's a really unique thing that we have going for us like not there's other people that have it but it's ours is unique because it's ours and because the people are here for us so like what you're saying about you can't listen to what other people want because that isn't that's going to be so disingenuous and not the right product because they're here for us yeah yeah it's it's different between like being a thought follower or a thought leader right like if you're the reason people you know when they fire up their YouTube app on their PlayStation 4 and",
            "start": 1948.56
        },
        {
            "text": "us yeah yeah it's it's different between like being a thought follower or a thought leader right like if you're the reason people you know when they fire up their YouTube app on their PlayStation 4 and they're like they're looking through their subscriptions or they're looking for whatever the recent content is the reason they pick us over anything else out there is because we are doing we're making something that appeals to them right um and it speaks to them and you have to like there's something genuine about that that you just you have to kind of be be truthful to yourself when you're making it otherwise I really believe that maybe people can't put their finger on it but subconsciously they they they kind of like they're like someone's like trying to cater to me specifically and I I don't know if they like that or not on the nose I mean yeah I mean I guess there's there's a mix to that right like obviously if if tomorrow I was like you know what I'm just going to talk about wine",
            "start": 1992.32
        },
        {
            "text": "don't know if they like that or not on the nose I mean yeah I mean I guess there's there's a mix to that right like obviously if if tomorrow I was like you know what I'm just going to talk about wine forever like it might not vibe with the people that have come here to hear us talk about movies and comics and games and things like that right be really stoked you would be stoked subscri number one she would start the podcast with me yeah called Winecast um I'm sure there already Winecast um but yeah but I mean that's that's important right but that's also a very scary thing because when you're stepping out and you're starting to create your own content the first thing you do is you're like let's emulate the things that we see around us right but then slowly but surely you have to come out of your show and you have and this is something I struggle with too all the time uh which is just being saying like I'm going to now if it's a podcast really share what I really feel about things",
            "start": 2027.8
        },
        {
            "text": "out of your show and you have and this is something I struggle with too all the time uh which is just being saying like I'm going to now if it's a podcast really share what I really feel about things right but you're going out on a limb because you're actually like you're exposing yourself to people it's easy for me to be like you know the Morning Show for instance is a very easy thing for me to do because I don't necessarily have to run an opinion on something I can just I just get to go out there and be like here's all the cool stuff that's happening in the world that we like right it's not really my stuff but like this podcast is I'm a little bit more exposed because you know I bring topics to the table that I want to talk about and I clearly have an opinion on um and that's a very empowering thing but it's also double-edged sword because you know it opens up for people to disagree with you but that's good that's not provoking that's that's that's real engagement with people you",
            "start": 2060.28
        },
        {
            "text": "thing but it's also double-edged sword because you know it opens up for people to disagree with you but that's good that's not provoking that's that's that's real engagement with people you know um but it's but it's difficult to do for sure very nice is that good I think that's good just two little quick questions sure or at least to stay on this topic so I'll go with Tim Tim when are you going to record your first mixtape oh my God we're working on it see well we are we are we are working on it so here's the that's one way to put it one of the things I like a lot I'm answering this question for time one of the things I like about a lot of what we do is we the three of us and Kevin and and Andy and sometimes Cool Greg um we all push each other toward things yeah which is good like I I've often said and I know this about myself like I can't I could not do any creative Endeavor by myself I can't do it I just I'm not the Kevin Smith of the world where I'm like I'm going to go out there",
            "start": 2092.72
        },
        {
            "text": "often said and I know this about myself like I can't I could not do any creative Endeavor by myself I can't do it I just I'm not the Kevin Smith of the world where I'm like I'm going to go out there and do it and rally people around me I need a group of people that can push me who I can be like brotherly competitive with and people who I recognize the talents of me and go hey you should do this hey you should do this and with Tim I subtly over not so subtly really just blatantly over the past like four months been like hey we should here's an opportunity to do a cool rap song Here's this thing here's this thing and I'm wearing down I'm wearing down I need a rap song for The Animated Show like the scripts already well I was shit yeah there's another one but uh when we did the Star Wars Theater I need a Star Wars Rap you needed it I'm like and you shit knocked it out of the park did a day I know I'm happy I'm happy I love that shit I love it so much that is definitely where my passion",
            "start": 2133.64
        },
        {
            "text": "Theater I need a Star Wars Rap you needed it I'm like and you shit knocked it out of the park did a day I know I'm happy I'm happy I love that shit I love it so much that is definitely where my passion lies is the comedy rap shit and one day we're going to go all out don't know when though but that's the best thing too is like and that that's what's hard for a lot of people to that's what I was talking about earlier it's hard for a lot of people to understand or recognize when that's happening like Tim writing a verse of the Ewok uh rap song in in the animated show may not seem like it's the end all be all because it was a small blur in an animated show that got you know 40 000 views or whatever it got but that is a stepping stone to the next thing he's going to do keeps the tool sharp it keeps people thinking about Tim in that regard and it it all builds toward itself right that's the kind of thing that you look back later and you can point to and be like oh yeah that was that",
            "start": 2172.64
        },
        {
            "text": "it keeps people thinking about Tim in that regard and it it all builds toward itself right that's the kind of thing that you look back later and you can point to and be like oh yeah that was that little stone that I put on that one step that got me to this next thing that got me to this one thing that got me to like actually making the the album or the song mixtape album whatever we want to do bunch of videos things like that so it's important to see that all right and so then I have one smaller question but since you answered his question I'll ask you yeah perfect when is Nick going to complete his screenplay for about San Francisco or that idea oh interesting about San Francisco I remember him saying something on a topic about you having this like affinity for my Love Letter to San Francisco that's something along that um that's in the back burner I haven't even heard I must have missed that yeah I had an idea uh for an indie film that I by the way I have like I'm sure",
            "start": 2209.16
        },
        {
            "text": "to San Francisco that's something along that um that's in the back burner I haven't even heard I must have missed that yeah I had an idea uh for an indie film that I by the way I have like I'm sure you're like me I've got literally just folders of synopsis for movies that I want to write one day maybe sometimes they're one line sometimes they're paragraphs I Pages um but yeah I had this idea of kind of mirroring what I felt before I was before we left IGN which was um kind of trying to touch base or or find that part of everyone that's like wanting to change their life like similar to where where you're at right now right you're in this job you're in this world that you know you don't belong to anymore but you don't know how to change that and how does that manifest itself and like what would happen if you're in that state and you're on the breaking point and you just decided to go out into the City and like use the City as a distraction for one night and like what would that look",
            "start": 2245.48
        },
        {
            "text": "would happen if you're in that state and you're on the breaking point and you just decided to go out into the City and like use the City as a distraction for one night and like what would that look like for San Francisco the road well not even the road but like but San Francisco to me has San Francisco to me has been um you take you can't stop and you start taking over the buildings and then you're The Blob it's pretty The Blob or spoilers that thing and Guardians never mind um thanks haven't seen it don't worry about it it's a it's a pivotal moment in the movie cool um but yeah but so but San Francisco has meant so many different things to me over the years right it's been the city that I grew up in in my teens it's been the city I met my wife in it's been the city I committed to her as a man and you know I really became an adult in a man and um it's also the city that is has a complete and total shit Kevin I am a man committed to her as a man is he playing Zelda over there",
            "start": 2284.76
        },
        {
            "text": "man and you know I really became an adult in a man and um it's also the city that is has a complete and total shit Kevin I am a man committed to her as a man is he playing Zelda over there what's he doing playing Zelda oh the quest to be better than Nick begins um so anyway so that was that was the General concept right like what happens when a when when a person who doesn't want to face his life decides to use the city as a as a playground basically and a distraction and what does that look like for a night just a slice of life kind of movie um I have it on the back it's there but that's very deeply that's a that's a that's a deeply meaningful thing to me that's it's very difficult to rally and like want to touch that like get in touch with that part of yourself every night he has other screenplays that he is further along in fair enough well that was the only one that came to mind me how's our movie coming it's good we canceled it we canceled our writing date yesterday",
            "start": 2322.16
        },
        {
            "text": "has other screenplays that he is further along in fair enough well that was the only one that came to mind me how's our movie coming it's good we canceled it we canceled our writing date yesterday remember I know well yeah that we canceled the writing date we didn't cancel the movie it's good all right I read through the outline last week like I like this got put another actually do it I will actually I'll do that tonight today combating okay I'm good thanks for watching this episode of The GameOverGreggy Show click here to subscribe click here to support us on Patreon click here to see other episodes click here to go into a portal to take you to Kinda Funny Games I'm Greg kind of I kind of made all this happen but I mean not in like conceited way I'm just saying if I didn't want to do the Oreo Show ever then it would have never happened I hope Kevin isn't mad at me you mad at me Kevin",
            "start": 2362.04
        }
    ]
}