{
    "id": 2612,
    "video_id": "DOHpnks7XEE",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Gavin Hammon",
        "Ming Chen"
    ],
    "title": "Gavin Hammon and Ming Chen (Special Guests) - The GameOverGreggy Show Ep. 178",
    "description": "The Walking Dead Game's Gavin Hammon and Comic Book Men's Ming Chen join us to discuss toy collections, The Walking Dead, frozen pizza, and movies we haven't seen. (Released first to Patreon Supporters on 05.05.17)\n\nThanks to Pro Flowers for sponsoring this episode. Go to http://www.proflowers.com and use promo code greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1493974214,
    "duration": 6367,
    "transcript_chunks": [
        {
            "text": "Hey, want to hang out with us? Want to see if I really smell as bad as they say? I don't. Come to Kinda Funny Live 3. Get your tickets at KFL3.com. There's a slash there, you know where it goes. You're not dumb. You know who I love? My mom. You know who my mom loves? Flowers. Mother's Day is right around the corner, so let old Gruesome Greggy help you out. Visit our advertiser ProFlowers.com right now and get your mom some flowers. 100 blooms for $19.99. Actually, now don't do that thing I've done before. You put it off. Mother's Day will be here before you know it, and you know what you're going to do if you don't do it right now? You're going to screw it up. How do I know it? I've screwed it up before. You say to yourself, \"Oh, Mother's Day is coming up. I should do. I'll do it later.\" And then bam! Mother's Day is there, and you're holding a cheese pizza and you start crying and you wring the cheese pizza and you're like, \"Why? I ruined the pizza and I ruined Mother's Day when I could have\"",
            "start": 0.2
        },
        {
            "text": "then bam! Mother's Day is there, and you're holding a cheese pizza and you start crying and you wring the cheese pizza and you're like, \"Why? I ruined the pizza and I ruined Mother's Day when I could have just listened to Greg Miller back in the day.\" And you say, \"I am Greg Miller.\" Don't live this nightmare, ladies and gentlemen. Go to ProFlowers.com right now. You can get these blooms, 100 for $19.99, free glass vase as well. All you have to do is do it. Click on the microphone, use the code Greggy. ProFlowers.com, code Greggy. Don't ruin your cheese pizza and Mother's Day, because you will never forgive yourself or your mother. What's up, everybody? Welcome to the GameOverGreggy Show. I'm one of your hosts, Greg Miller, alongside the Producer Seducer, Nick Scarpino. Gavin, I'd like to apologize for the wife comment earlier. It's uh, it's disparaging. She'd like you, Nick. Of course, talking to Star of Stage and Screen, Gavin Hammon. What screen? Oh, thank you. Hello. You're on this, you're on a screen right now. You",
            "start": 39.92
        },
        {
            "text": "comment earlier. It's uh, it's disparaging. She'd like you, Nick. Of course, talking to Star of Stage and Screen, Gavin Hammon. What screen? Oh, thank you. Hello. You're on this, you're on a screen right now. You one screen. Yeah, there it is. Yeah. Don't don't get caught up looking at it. Don't drown in the pool. Don't look at your own reflection, drown in the pool. Gavin, of course, voice actor to the Stars. You've done a million different things. I have voice matched some Stars. Okay, talking it down. Which ones? Which ones do you do? Um, I I don't know. Think that's how it works. You of course know Gavin is Kenny in The Walking Dead. You know me as Kenny in The Walking Dead. Fuck. More importantly, you know him. We can swear on this show. Of fuck, of course you can. You kid me? Fantastic. Yeah, you deserve. Kevin says the c word a lot and then capricious. It's oh yeah, it's a tough one. Capricious. Uh, but more importantly, you're Furby. That's true. I'm also the voice of Furby in too many countries. Give me some Furb. Um, oo, well,",
            "start": 94.8
        },
        {
            "text": "c word a lot and then capricious. It's oh yeah, it's a tough one. Capricious. Uh, but more importantly, you're Furby. That's true. I'm also the voice of Furby in too many countries. Give me some Furb. Um, oo, well, Greg, depends on what you want me to say to you about different creepy. It's really creepy. Creepy. It can be creepy if you wanted to be. Should I stop? I'll yeah, you should probably stop right there. The pure one, Tim Gettys. Let's him host. I also enjoy that wives just love Nick. All all wives. He's a pretty lovable dude. Love Nick. My wife uh, likes me sometimes. Yeah, more often than not these days. All wives except for one. Except for the one that wives who don't have to live with Nick. That's how it goes. And rounding out our fivesome today, a packed house, Ming Chen. Y, how are you, M? What's up, everybody? I'm uh, I'm I think I'm the only guy uh, at this this podcast uh, that cannot grow facial hair. No, no, I can't do it well either. That's why I don't do. You can I just it does the stubble really well and then it",
            "start": 137.12
        },
        {
            "text": "I'm I think I'm the only guy uh, at this this podcast uh, that cannot grow facial hair. No, no, I can't do it well either. That's why I don't do. You can I just it does the stubble really well and then it goes nowhere. You get patchy. No, not even patchy. Just doesn't grow. Like it doesn't grow outward the way I should. Yeah, it's growing inward. You know, the ingrown hair. It does change him from the inside out. You start to turn on to this character that I'm not happy. It's like Bizarro Greg. It is. Usually when you see me unshaven, it means I didn't shower. I was running late or something like that. So I'm not in a good place already. Usually hung over. Yeah, maybe. I don't like it. I don't like it. I'm just jealous. You guys look manly, especially with that even with the Furby voice coming out of your mouth, you still look manly. Thank you. Thank you very much. Uh, Ming, of course, we know you from AMC's Comic Book Men. Yes. And the Kinda Funny Morning Show. More important, last week, you came for the morning show. You stayed for",
            "start": 190.0
        },
        {
            "text": "manly. Thank you. Thank you very much. Uh, Ming, of course, we know you from AMC's Comic Book Men. Yes. And the Kinda Funny Morning Show. More important, last week, you came for the morning show. You stayed for the podcast. Yeah, I love that. I guess you guys must like me or then there's pie after, right? There's pie. There's we to Outback Steakhouse. All right. Don't be pushing. There is a crazy cheesecake place next room. Is there? How have you tried that place yet? Everybody talks about it though. We never go. Only open at random. It's fantastic. But it's only open at the most random of times. They are on spring break. I think they're always on something. There's some weirding for who doesn't love cheesecake? I don't know. I don't trust. I don't want to know that person. My wife uh, is a huge, my wife and I, I should say, are huge fans of The Golden Girls. Maybe you've heard of that show. Maybe. And she wants, she'd like to live out her senior years, um, just like one of those four women where living with her friends,",
            "start": 228.52
        },
        {
            "text": "say, are huge fans of The Golden Girls. Maybe you've heard of that show. Maybe. And she wants, she'd like to live out her senior years, um, just like one of those four women where living with her friends, eating cheesecake at night, uh, wearing this the caftans, the big long like just billowy outfits that you don't have to care what you look. So she wants you to be dead and she's banging people. That's the unfortunate aspect of this. But I want you know, any good husband wants to give their wife whatever they want. So at some point I have to die, probably before I'm 60, so she can live out this fantasy of hers in Miami or wherever. She's going to kill it. She's going to be really good at it. I think she'd be great. She'd make a great Dorothy. My wife is Dorothy. My wife is very much like she's tall, doesn't really like a lot of things. She's perfect, perfect for that. Likes cheesecake. She likes you sometimes. She does like more often than not is how I like to put it. And you know, you guys have married for a while.",
            "start": 265.36
        },
        {
            "text": "like a lot of things. She's perfect, perfect for that. Likes cheesecake. She likes you sometimes. She does like more often than not is how I like to put it. And you know, you guys have married for a while. Yeah, that's that's good. Oh yeah, that's a good track record. If your wife likes you, stay above 50%. Oh, you're gold. Yeah, Golden Girls. That's like baton 500. Yeah, literally exceed. Now, here's the thing, Gavin. Yes, Greg, earlier was we were getting ready for this podcast. You were complimented on being so tan. And then you said you actually, it's an embarrassing story for your family. So I assume this is part of the 50% your wife's not happy with. I have no shame. How do how do you get so tan? Please tell me. You tan naked? They shake their heads at at the reason. But so what I do is, and this is true, is I drive around without a shirt on. So are we talking, do you wear undershirt though? Oh, fuck no. No, just pure. Yeah, yeah. I just peel it all off. And so, and I'm a drummer too. So I'm also I've got the windows",
            "start": 300.0
        },
        {
            "text": "around without a shirt on. So are we talking, do you wear undershirt though? Oh, fuck no. No, just pure. Yeah, yeah. I just peel it all off. And so, and I'm a drummer too. So I'm also I've got the windows down, sunroof open, and I got a drumstick on my my. Are you that old school drummer that keeps sticks in your car? Fuck yeah. There's two of there right now. My God, I love it. I'm sitting there and I'm driving up the five. It's hot. All the windows are down. I'm blaring Mötley Crüe or Iron Maiden or something and just beating on the steering wheel. Yeah, we my wife was driving by, she would just like, she would turn away. So they're not in the car with you when this is happening? No. Okay. I've yet to actually bust that out usually because she drives and you don't want to be like the passenger without a shirt on. That's just weird. It's like the hobo. We he seemed hungry and lost. You um, you ever been pulled over shirtless? No, I don't get I I don't drive that fast. Get pulled over. And also you are one of the the the few, the",
            "start": 341.96
        },
        {
            "text": "weird. It's like the hobo. We he seemed hungry and lost. You um, you ever been pulled over shirtless? No, I don't get I I don't drive that fast. Get pulled over. And also you are one of the the the few, the proud, the Prius C owners. I am a Prius C owner. Wow. You're cruising shirtless driving in a Prius C. Fuck piece of fuck. I love it. I fuck love it. But dude, I'm getting like 50 miles to the gallon. Yeah, it's so metal. And when I fill up, it costs like 18 bucks. Are you barefoot? Uh, no. Oh, I usually have shoes on. Okay, okay. I'm just trying to visualize everything that's happening. Driving barefoot is a no-no. Sometimes if the sun's beaten down just right, you hike the shorts up a little bit. Make sure you get the legs. I got some I got some good calves, so I want to make sure that you know, I get those in there too. You do have good calves. I was noticing that earlier. Uh, I boogie board. Okay, okay. You just live in the dream, my friend. I guess so. That's the thing is if Gavin stumbled up to you right, shirtless drumming, you'd",
            "start": 385.56
        },
        {
            "text": "you do have good calves. I was noticing that earlier. Uh, I boogie board. Okay, okay. You just live in the dream, my friend. I guess so. That's the thing is if Gavin stumbled up to you right, shirtless drumming, you'd be like, \"Oh man, here's 15 cents. What happened to this guy?\" No, no, it's good dude. Down on his has luck. But then he just goes and does million, my lot of cash. Yeah, well, all right. So fold it in. I guess if you didn't know, this is the GameOverGreggy Show. Each and every week, four, sometimes five, best friends gather on this table. Each bring a random topic discussion for your amusement. You have one more shot at it at the end of the show than yeah, we're new here. We don't I'm not new, but we didn't do that last. Well, Gav, it's Gavin's first appearance on a GameOver. This is true. Yeah, yeah. Uh, if you like that, you can head over to Patreon.com/KindaFunny. Toss us a couple bucks and get each and every episode early along with a bunch of bonus episodes, exclusive perks and goodies. Isn't that right, Nick, with his",
            "start": 432.88
        },
        {
            "text": "can head over to Patreon.com/KindaFunny. Toss us a couple bucks and get each and every episode early along with a bunch of bonus episodes, exclusive perks and goodies. Isn't that right, Nick, with his 76th sugar-free Red Bull of the week? Dude, uh, past me fuck kicked ass because I was like, \"I wonder if I have anything to drink in the fridge.\" And I looked in, I was like, \"Past me got a bunch of sugar-free Red Bulls.\" Nice job. Thanks. Now, when you say past me, do you mean Kevin? You ordered Kev, go get. I mean, cool. Greg was hanging out with us for one of the barbecues and I was like, \"Hey man, if you're going to get drinks, can you get me a bunch of?\" Actually, no, Lauren wanted these. Lauren Laning. Yeah, when he was here and he he and I always bond because I'm always like, \"Hey man, do you want something to drink? Like coffee or water?\" He's like, \"Got any sugar-free Red Bulls?\" I was like, \"Yeah, you know.\" Does he like, \"Hey man, you got any sugar-free Red Bulls?\" Yeah, like, \"I I got a guy.\" Oh yeah, he's we mainline this fuck. We were",
            "start": 472.44
        },
        {
            "text": "or water. He's like, \"Got any sugar-free Red Bulls?\" I was like, \"Yeah, you know.\" Does he like, \"Hey man, you got any sugar-free Red Bulls?\" Yeah, like, \"I I got a guy.\" Oh yeah, he's we mainline this fuck. We were on lucky number three before we started the podcast. And I was like, \"Can't hold my mic.\" I was on a on a tour in uh, damn Kevin. Wow. Rendering something out there. Kevin. I was on a tour in Europe. We were on the Warped Tour of this band that I was in. And that stop. So style back. We're going to rewind a little bit. We're in the car ride. It's us and Andy. We're coming back from one Outback Steakhouse. And I I do the AC/DC test test where I'm like, \"I'm just going to put on AC/DC and see how the entire car reacts.\" Very positively. Oh yeah. And you go into the story, For Those About to Rock. Yeah, it's it's it's the anthem, um, of GameOver Greggy. You were like, \"Hey, no big deal, but I was in a fairly popular band and I used to tr and just pick it up from there.\" I believe I said it a whole lot less douchy than that, but",
            "start": 505.96
        },
        {
            "text": "anthem, um, of GameOver Greggy. You were like, \"Hey, no big deal, but I was in a fairly popular band and I used to tr and just pick it up from there.\" I believe I said it a whole lot less douchy than that, but that's cool. Was his shirt on? I don't know. He was in the back. It may have been like half off a little bit. I was peeling. Um, yeah, so I was in a band in the 1990s, um, but before I had this real job of being a voice act, I had a real job of being in a band. What band? Um, it was called Dance Hall Crashers. Ska band. Um, many tour made records. Oh, so trumpets. We had at one point in the late 80s, I think we had two at at the most one, uh, a guy, Jeremy Goody, who's still awesome and has a studio in Piedmont, um, still friends with. But over time, we lost the horns and were more of just like a punk ska band because we had two female singers and guitars and we felt that there was enough melody going with plus like ska shows back in the 80s, especially late 80s. It was like skinhead city. So it'd be like periodically",
            "start": 547.2
        },
        {
            "text": "two female singers and guitars and we felt that there was enough melody going with plus like ska shows back in the 80s, especially late 80s. It was like skinhead city. So it'd be like periodically every show they would sort of assemble in the in the mosh pit and like do their weird whatever sort of chant song kind of thing they would do. Okay. And there was some crazy like some of those shows were riots and windows broken, pretty. So we were more, you know, comfortable doing punk rock shows. Sure. But yeah, no, I was in a band and we play. You're saying ska shows were more hardcore than punk rock shows? Oh yeah, because much higher. Ska was always the kind of like, \"Yo, we're in Johnny Tsunami.\" You know, we we serve. Oh no, this was like the second wave stuff. So it was, you know, tail end of that into like, uh, The Toasters, um, what where did Reel Big Fish come in? Reel Big Fish would be third wave. Like Dance Hall Crashers was and we played a ton with Reel Big Fish and No Doubt. And um, you ever you ever play with",
            "start": 599.88
        },
        {
            "text": "uh, The Toasters, um, what where did Reel Big Fish come in? Reel Big Fish would be third wave. Like Dance Hall Crashers was and we played a ton with Reel Big Fish and No Doubt. And um, you ever you ever play with Catch 22? Yeah, yeah, I like them. Yeah. Um, and we played with, you know, Memphis Ska-lites and this, you know, all the different ones. Ska. My buddy was in Trenton, New Jersey. Hey, New Jersey. Hey, New Jersey represent. Thank you. Was that like, were The Skatalites? Was that a big band? Remember them? Yeah, they were really cool too. There was them and then there's my buddy was in a band called The Debonaires, uh, all throughout like late '90s, early 2000s. So they were kind of kind of would play with those guys a little bit here and there. But shows with them, we played with Sublime, uh, quite a lot back in the day. Yeah, but no, like, so we used to show, we would do shows with Sublime where like they would open or we would open, you know, for us back points. Yeah, sometimes depending on where we were, like if we were in a",
            "start": 650.68
        },
        {
            "text": "but no, like, so we used to show, we would do shows with Sublime where like they would open or we would open, you know, for us back points. Yeah, sometimes depending on where we were, like if we were in a certain city, you know, this my turf sort of, I guess, or whoever had the bigger draw. But, you know, we was same thing with No Doubt. You know, we did shows with them and stuff. So they were the ones that really kind of exploded. And then the sad thing about Sublime is they really didn't explode until after Bradley had passed. And that record that they were working on, that they were kind of working on and working on, he passed away and they were kind of still tweaking and tweaking and kept sending it back to the label. And then it came out because that was going to be it. But fantastic band and fantastic record, that record, Sublime. But that was un I was more of a 40oz. to Freedom guy myself. But we were going somewhere. You were you were on the Warped Tour and oh, Red Bull. So I full circle. They",
            "start": 695.32
        },
        {
            "text": "record that record, Sublime. But that was un I was more of a 40oz. to Freedom guy myself. But we were going somewhere. You were you were on the Warped Tour and oh, Red Bull. So I full circle. They would just bring you these flats of Red Bull. And this was in like in Europe, which says more than red. I know. Might have had the taurine in it. You know, so it'd be, you know, it'd be like hash and Red Bull. Kind of like the thing around Lowlands, you know, festivals with see him through time, you know, watching Beck from the stage or something like that. Nice. You know, lived a life. I've lived a life. Yeah, I can die now because so I guess if you got no bucks to toss, you can get it topic by topic, day by day over on YouTube.com/KindaFunny until the following Friday when we post the entire thing is one big video and one big MP3 that Greg. I don't ask you a lot of questions because I pretty much know you at this point because you know my skills. Oh, heart punch. Have you ever just seen the timer and been like, \"You know what,",
            "start": 739.68
        },
        {
            "text": "MP3 that Greg. I don't ask you a lot of questions because I pretty much know you at this point because you know my skills. Oh, heart punch. Have you ever just seen the timer and been like, \"You know what, fuck it. I'm not doing the rest of the spiel.\" No, it's part of the fuck. Keep it going. You you podcast a lot. Yes, I do. You podcast professionally like these two clowns. You understand that what the audience likes, what the fuck just happened? I don't know. That's really weird. Anyways, what the what the audience likes is the pomp and circumstance. They like the rhythm. They get mad when you forget the pound on the table. They get mad. I don't want to ever screw somebody over, so I want to make sure they know that I'm there with them. I'm keeping this ship on course. And the course, hell, we're on a highway. Hell yeah. Perfect. Topic number one. Okay, revolves around both of our guests. Oh, we were at the lovely Outback Steakhouse. M, me. What did you have? I had a a sirloin steak, which I kind of regretted. Little",
            "start": 791.36
        },
        {
            "text": "hell yeah. Perfect. Topic number one. Okay, revolves around both of our guests. Oh, we were at the lovely Outback Steakhouse. M, me. What did you have? I had a a sirloin steak, which I kind of regretted. Little little gristly. Little gristly. Oh no, I should have went with the filet and should have added the ls because you guys paid for it. So to mention that at the beginning of the you guys paid for it. Thank you very much. You guys for it. Thank you. Yeah, I should have went with a more tender cut. While we were there, Gavin, who's lived a life, broke out photos of his studio. Oh yeah, where your drum kit is and now your VO booth is. Yeah. And it's wall-to-wall action figures and toys and stuff. Yeah, there's a lot of toys. And then of course, your whole show and life revolves around nerdom and toys and stuff like that. Absolutely. As does ours, as you can tell by the set and everything else. And Nick's previous topics on G.I. Joes and stuff. Love it. So we want to start there for this topic of talking about Gavin's collection to",
            "start": 829.4
        },
        {
            "text": "as ours, as you can tell by the set and everything else. And Nick's previous topics on G.I. Joes and stuff. Love it. So we want to start there for this topic of talking about Gavin's collection to which he will send Kevin photos. I'm sure we have to send you have to send Kevin photos. Email them to me now. You want them all? Oh, you can put them up right now. It's a it's a technologically advanced. We don't know pre-production. We're not quite advanced enough to actually have pre this. We don't know the pre-production part of the show. But on the show, we can easily email stuff and do stuff like easy done. Just so while while you do that then, Gavin, no, I can I can do two things at once. I don't think you can. I don't after all the Red Bull and hash you've had in your life. I don't know. It's a lot of both. I think this man's exhibited that he's multi-talented. So I believe in him. I think it's Kinda Funny. Kevin, yeah, no, no, Kevin, Kevin@KindaFunny. Also, if you thought that was a giveaway, remember,",
            "start": 877.36
        },
        {
            "text": "control at RoosterTeeth.com. Um, oh, shout out to you doing that, boy. They liked it just as much the second time as you did it the first time. So, Gavin, walk me through this. So the problem is, you're too much. We like we tonight had a bloomin' onion. Yeah, it was delicious. No, no, no, we had a loaded bloomin' onion. Sure. I was going to pass away. But that counts too. There was there's many layers to the loaded bloomin' onion. There's the bacon bits, there's the cheese, there's the fries, there's the fried onion. Don't forget the batter, right? So as you peel back all these layers, we find new things. We're already discovering so much about you on this episode, Gavin. I'm so sorry. You're like a loaded bloomin' onion. You're our own little that's the best compliment I've ever received. So when did you go from being",
            "start": 918.64
        },
        {
            "text": "discovering so much about you on this episode, Gavin. I'm so sorry. You're like a loaded bloomin' onion. You're our own little that's the best compliment I've ever received. So when did you go from being Kick-Ass crazy ska travel the world guy to married, two kids? Is it? Yeah. And room full of action figures. Uh, well, it went so the the room full of action figures has always been a thing. Yeah. So God, that's gorgeous. Kevin's going to throw it up here in. So that's half of the that's obviously hold on. The audience can't see it yet. G and and I I'm describing a thing you can't see. Well, it's going to happen to happen to the MP3 listeners too. Imagine heaven and that's what's about to come on with drum drum. Now we're just looking going to do good. He's going to bring it on the front one and the back wall. Important important notes. Different drum kit is in there now and it's in a different place. Okay, okay. It's more over to the left. So what we're looking at is you're seeing all sorts of figures, all sorts of",
            "start": 960.64
        },
        {
            "text": "important notes. Different drum kit is in there now and it's in a different place. Okay, okay. It's more over to the left. So what we're looking at is you're seeing all sorts of figures, all sorts of toys. There's a lot of things happening. It's a lot. It's a lot to absorb. Is that a TIE fighter? Cut by the way. We can always just cut the full screen as well on this so people can see the full version of it. You know, there's a whole mess of TIE fighters in there. Really? Oh yeah. You had them all mounted from the ceiling. Uh, I yeah, I mount most of the ships and stuff and things that fly from the ceiling just because it's easier. Okay. And so this has been going on your whole life, you say? Yeah, pretty much. Oh my God, I can't see it. I'll go like this. See fun. That's amazing. I mean, it's a room full of toys. Like we said, what was amazing is when when you were talking about this, you were like, \"Yeah, I just when you're you have two children.\" I do. And one just discovered that this room existed. No, he was so he's 11 now.",
            "start": 1005.36
        },
        {
            "text": "said what was amazing is when when you were talking about this, you were like, \"Yeah, I just when you're you have two children.\" I do. And one just discovered that this room existed. No, he was so he's 11 now. And I think he was like six right when like and this has existed like when we we bought the house in 2000 and originally that was just like a band room. So that was like perforated metal and whatnot on the walls. And then once I stopped rehearsing, so in 2000, the band broke up and I was still playing but not playing as much. And I was starting to do this and I needed a space that was was quiet. And this was already like a pretty good start. So I just started finishing things. And I've always had a room in a house whether we were renting it or someplace else that had a bunch of shit in it like this, of course. Um, so this just was a natural progression and it was a bigger space. And I just kind of did all the shelves and everything myself. All those weird little baffle things that have a bunch of",
            "start": 1045.68
        },
        {
            "text": "of course um so this just was a natural progression and it was a bigger space and I just kind of did all the shelves and everything myself all those weird little baffle things that have a bunch of stuff on them that are sticking out I made those those are on casters and then they they move around and there's you know how much money you think's invested in here Tim you don't want to think about are you going are you buying these mint on card and opening them are you buying my garage sales most of them I bought new to be honest um and I've had them um just depends on what it is if I'm buy you still go to like Toys R Us and Targets and no I usually just Amazon or Big Bad Toy Store or something like that it's easier cuz I I mean as you can see there's not a lot of space even like building the booth which created a ton more surface there's not a lot of space now Tim you look at this I do what's your first thought I I like I've changed my pants first of all this is right of your I'll",
            "start": 1089.0
        },
        {
            "text": "the booth which created a ton more surface there's not a lot of space now Tim you look at this I do what's your first thought I I like I've changed my pants first of all this is right of your I'll feed you I have to bring a change of clothes probably yeah I I I I'm loving this things like this this is this is uh this is what I dream of a room like this um I don't have a room like this uh I mean we have a store full of Tours so I say you kind of have a store yeah I can be kind of happy with that but I mean I would love my own my own room like this so 80% of the stuff that's in the store is there or vice versa everything that's there is in the store yeah so well done my friend what percentage of this is vintage versus say newer things uh so it's probably mostly fairly modern stuff um there's obviously Shoguns down at the bottom um above that are Simpsons figures The Playmates above that are Action Fleet which are like a Star Trek and Star Wars ships and then Marvel Legends the only thing",
            "start": 1128.48
        },
        {
            "text": "obviously Shoguns down at the bottom um above that are Simpsons figures The Playmates above that are Action Fleet which are like a Star Trek and Star Wars ships and then Marvel Legends the only thing that's really vintaged there is at the bottom with the uh yeah the bottom with the Shogun Warriors and then there's a Super Powers shelf in some place too **** yeah I want to see super is this picture on Instagram at all can people okay people I have like a another account called Action Figure Soundproofing cuz I I call it Action Figure Soundproofing not that I'm trying to write any of this stuff off and create some kind of crazy tax you know I want people to be a people listening to this I want them to be able to go to Action Figure Soundproofing Instagram and that this is a very impressive albeit slightly psychotic collection of oh yeah no it's creepy and what what I usually when anybody's if they're over at the house they've never been in there I always like cuz it has a double to",
            "start": 1175.8
        },
        {
            "text": "albeit slightly psychotic collection of oh yeah no it's creepy and what what I usually when anybody's if they're over at the house they've never been in there I always like cuz it has a double to the outside so I open the outside door and then I say you're going to learn something about me right now and then just sort of slowly open the door with the lights on do you think it's creepier to have this or like a sex dungeon H it depends on who you ask okay Greg you just you just inhaled but it's possibly because you have sign I don't think my wife would tolerate a sex dungeon but she tolerates that understood understood I think my wife would actually yeah it might be a tossup for my wife she might be like it's they're both weird stop it and I come day she like it was all um all that stuff was old so I threw it out there's no world where your wife would tolerate this room no I mine doesn't go in there yeah but she she'll come in and look around it's good it's not a good looking face you",
            "start": 1219.16
        },
        {
            "text": "old so I threw it out there's no world where your wife would tolerate this room no I mine doesn't go in there yeah but she she'll come in and look around it's good it's not a good looking face you know want to see that kind of face yeah right bad have you ever accidentally knocked one over and it dominoed and you they're all they're all like Museum Putty down so it's like I bought I bought a bunch of Museum Putty for this set I never used it I live in California so you know if there's a bad Quake I mean it's all going going right on a my friends put your stuff down that's right do you have a do you have a favorite piece uh I really like so I've got a we were talking about a little bit uh Blade of the Immortal Manji he's the main character he's like a samurai that's going to live forever until he kills a thousand guys and uh there's a 1 time that's know is it manga or is cliche uh yeah it's actually both I've never seen I think I think I want to say Miike is making a movie out of it too I",
            "start": 1261.56
        },
        {
            "text": "he kills a thousand guys and uh there's a 1 time that's know is it manga or is cliche uh yeah it's actually both I've never seen I think I think I want to say Miike is making a movie out of it too I saw something and it which is not a movie I ever want to see because it's a **** up book but um it's awesome uh but yeah it's a it's a manga that I read and it's I think it's like 28 or something graphic novels or you know trades I hate graphic novels the term why because it's a trade it was released as an issue TR okay I agree with that okay but yeah but it's great and so I have a 1 in Manji figure that I love that's the one that is oh you were right about the swastika on the back Kevin is so good Kevin not a because it's flipped around it's that's his name I love that I don't know why I love it I just I love the book and I love the character that's a cool toy is there is there any line of figures that you're like I'm just not going to buy these oh yeah no I I only buy something that I",
            "start": 1300.6
        },
        {
            "text": "it I just I love the book and I love the character that's a cool toy is there is there any line of figures that you're like I'm just not going to buy these oh yeah no I I only buy something that I either like the source material or I think it's a cool toy so there's tons of stuff that I wouldn't buy do you have any Transformers do you have any Power Rangers no I don't have any Power Rangers unless the Power Ranger could be acceptably passed off as like a Shogun oh do you have do you have any Robotech figurines yeah do you have the um the Transformer that was a ripoff of the Veritech Fighter yeah yeah yeah because I have that right there oh know Jetfire it's amazing yep I've also got Jetfire which is that one yeah and then I've also got you know I don't know what's his name Rick Hunter's Rick yeah I've also got his his jet now I think the one that I've got was the Toynami reissue of it I think so yeah yeah cuz I don't have an original Takara one those are crazy does yeah come no in this in",
            "start": 1356.0
        },
        {
            "text": "yeah I've also got his his jet now I think the one that I've got was the Toynami reissue of it I think so yeah yeah cuz I don't have an original Takara one those are crazy does yeah come no in this in this day and age it's like even if you're a big like Micronauts guy somebody has reissued all those toys within the last 15 years yeah see I it sucks cuz when I was a kid actually I don't know cuz I would I wouldn't have known but I I had whatever they were selling at the time in the mid '80s yeah which I have to assume was the original run of the toys in America yeah but uh my mom saw fit to dispose of those that's what they do yeah that's what she did I think one of them broke and she was like well that one's broke they're all gone you're in high school now stop playing with toys well since I've got kids I do the same thing I'm like oh this lost an arm it's trash it's no longer in mint condition see that's that's just one of those things you got as a kid you just go along with the",
            "start": 1395.0
        },
        {
            "text": "since I've got kids I do the same thing I'm like oh this lost an arm it's trash it's no longer in mint condition see that's that's just one of those things you got as a kid you just go along with the storyline like he lost his arm in in a war right he just like you just got to keep going in it everyone had Duke uh who only had half a body because the you know the GI Joe stupid rubber bands man they dried out and snap yeah my dad went through and he found actually rubber bands that were like the same size like like O-rings they were never the same they weren't but he went through and tried to match all of my old GI Joes that had broken take apart you had tiny enough screwdriver just screw and he um he got about 60% of them right God bless him and the other 60% like that is that is that is not right that he was assembling top yeah because I had a bunch of I had just a bunch of disembodied GI Joe figurines so you would have like a top of a Snow Job with the bottom of like say Quick Kick",
            "start": 1435.84
        },
        {
            "text": "not right that he was assembling top yeah because I had a bunch of I had just a bunch of disembodied GI Joe figurines so you would have like a top of a Snow Job with the bottom of like say Quick Kick exactly get this monster out of here this Abomination we did we did a topic on it um when we first built the studio my mom um not so subtly my brother is in Char was the person who helped put this together he's a set set designer um and my mom called me up she's like hey your brother's bringing a truck up here with all the set I'm going to put all your old toys on there I'm tired I don't want them in my garage anymore you're a 37-year-old man you should be responsible for if memory serves right she didn't tell Matt she was doing this she sure didn't on the truck she went to my brother's uh shop and bribed one of the people that he works with to put them on the truck so the truck shows up and I have five giant bins of all my old toys oh my God and we went through them it was actually a GoG",
            "start": 1477.52
        },
        {
            "text": "and bribed one of the people that he works with to put them on the truck so the truck shows up and I have five giant bins of all my old toys oh my God and we went through them it was actually a GoG topic people can see that if you if you didn't watch it um but it was cool cuz I was going through and it's it's amazing how you open it up and you're like holy **** I remember all of these it's right back and like Colin this is a back when Colin was with us and Colin just looked at all the GI Joes and was like that's Recondo that's a Dreadnok that's this that's I was like how do you even remember all this stuff but it was really cool and then of course it was like Duke with Lady Jaye's um like bottom part and I was like that's wrong but kind of right I don't know it's 2017 whatever whatever happens Happ so then Gavin what are you still hunting things no not really I just I buy stuff that if it comes out but you guys go to you guys are obviously convention like I don't do very many I",
            "start": 1513.6
        },
        {
            "text": "happens Happ so then Gavin what are you still hunting things no not really I just I buy stuff that if it comes out but you guys go to you guys are obviously convention like I don't do very many I certainly don't do nearly as many as Ming um do you pick up a lot of toys when you go to these things are you uh I try not to inevitably yeah you pick up a lot of stuff but yeah I went to 34 cons last year we think we go to too many cons Jeez that's a that's a lot of cons man I uh have a problem saying no so if I get invited somewhere we already invited you Kinda Funny Live 3 so too bad yeah I know so yeah so I guess I'm coming that's June 3rd correct June 3rd get your tickets now KindaFunny.com/KFL3 so then Ming your whole show is people bringing in things like Gavin's collection what what stands out to you what are the things you think of like you can't believe somebody's brought into the shop uh usually stuff from our childhood that we haven't seen in a while um those really stand out there",
            "start": 1554.4
        },
        {
            "text": "out to you what are the things you think of like you can't believe somebody's brought into the shop uh usually stuff from our childhood that we haven't seen in a while um those really stand out there are things I haven't seen since I was 6 years old and somebody will bring it in and you you get that flat all those memories come back right and um you know you just can't believe it uh that that is right in front of you interv youw again and then you find out it cost like 10 times as much as it did back in back in 1980 uh but you don't care you want it what's the thing we were talking about on the Morning Show today that's crazy just the fact of I remember like with people who were smart enough to keep things mint on card from that era cuz by the time yeah creeps but by the time I matured into a creep where I was like oh I want to make sure I the mistakes of the the past aren't really lived in the future where I was like I'm going to buy this entire run of Man of Steel toys I better get",
            "start": 1598.6
        },
        {
            "text": "a creep where I was like oh I want to make sure I the mistakes of the the past aren't really lived in the future where I was like I'm going to buy this entire run of Man of Steel toys I better get two cuz is at some point going to want Steel they're going to want Steel John Henry Irons they're going to want this Superboy this Eradicator no it turned out no they did not but my dad still has long boxes with all my unopened Man of Steel Total Justice JLA toys in there he's still waiting yeah hey man it could turn in any second might put you through college someday maybe you need to have those shipped to these guys and they can take they can pick through them and see what they want no trust me it's not going to happen I've been to I've been to San Diego and I walk the aisles and I see it and it's that long hair Man of Steel that or Superman that did like this where his arms up and it's up there for like a $150 and I'm like **** 4,000 of them the stuff from the from the '80s and the",
            "start": 1634.6
        },
        {
            "text": "it's that long hair Man of Steel that or Superman that did like this where his arms up and it's up there for like a $150 and I'm like **** 4,000 of them the stuff from the from the '80s and the '70s and the '60s it's worth money because people threw it out yeah no one knew so I have this uh Charles Barkley action figure from the hit movie Space Jam yes um do people ever bring in random **** like that oh yeah all the time all the time why would you think and um you know the Charles Barkley I would buy that know it's one of my prize possessions but and it's on the card an offer make him an offer oh no it's not me it's on card it's Frozen this thing in a cup of water and had to be like cite Frozen it's whole thing car Chuck deserves it yeah well well I mean come on you know how it was when you get your action figures and you're playing with them you need to make up reasons they're all doing things together I understand him getting Frozen doing things to each other yeah sense I I've",
            "start": 1673.92
        },
        {
            "text": "you get your action figures and you're playing with them you need to make up reasons they're all doing things together I understand him getting Frozen doing things to each other yeah sense I I've said this before the show and it's probably the most racist thing ever but I didn't mean it to be racist when I was a little kid but Charles Barkley was the Black Ranger out of the the cuz I knew who the **** Charles Barkley was so to me I'm like oh cool he the just the Black Ranger just out of his out but wasn't there a Black Ranger no he had the Black Ranger to and he had to be black too well on the TV show he was black yeah but I was a little kid so far we're going I mean this is very similar to how I bought Xena: Warrior Princess action figure when I was in high school and because and because they weren't making DC and I wanted a Wonder Woman so I bought her and of course Toy Fair a big deal at the time the magazine so going through there and I made it I made I shaved down parts",
            "start": 1717.64
        },
        {
            "text": "they weren't making DC and I wanted a Wonder Woman so I bought her and of course Toy Fair a big deal at the time the magazine so going through there and I made it I made I shaved down parts of her like her outfit then painted her the Wonder Woman outfit you got your Dremel out oh yeah you know I did come on I had the X-Acto knife you're going through doing little things yeah what was the Kevin washes on it too that this is my first time got to work your way out yeah Xena and Hercules were in the same universe I feel like Xena may have been a little more popular though crazy huge yeah right I don't know no Xena: Warrior Princess was a big deal yeah you ever into Hot Wheels Hot Wheels are a thing that I I feel like they've done a great job as a brand of staying relevant throughout generations of of kids playing with them and and like always having the new Fast & Furious license they they hot license for Hot Wheels they do",
            "start": 1754.72
        },
        {
            "text": "of of kids playing with them and and like always having the new Fast & Furious license they they hot license for Hot Wheels they do Hot Wheels has maintained how dare you Greg their Plateau yeah they've made maintained an aisle of the toy store for since I've been alive sure oh yeah since only Lego's done that here I here's the here's the difference though is that I just don't respect the Hot Wheels game no no exactly they're just doing okay boys like cars you know and then well most of the people that buy them are not boys they yeah adult males I've seen I don't respect you Hot Wheels and I have some have some experience with Hot Wheels collectors I'm sure they're different tribe different faction I remember waiting uh at the toys was 2 hours before it opened waiting for Star Wars toys and the other end of the lot would be these two uh you know um not rednecky looking guys and you know we' be what are you here for Hot",
            "start": 1795.24
        },
        {
            "text": "the toys was 2 hours before it opened waiting for Star Wars toys and the other end of the lot would be these two uh you know um not rednecky looking guys and you know we' be what are you here for Hot Wheels like all right I'm going to stay away from you but but it was a different class Warfare you're looking down your nose at them Tim talking about making my Wonder Woman I'm like I don't Hot Wheels and they're looking they're looking down on me but uh definitely older adult males see my thing with Hot Wheels is I feel like they're just on there there's like you look at the hierarchy of toys and like think down right and like how Lincoln Logs have faded Into Obscurity nobody cares about them I feel like Hot Wheels is right there at that line like in any second they could disappear too man I don't think so Hot Wheels especially when you get the tracks involved that is the thing of Dreams having a room full of loops and like ridiculous have that you just have your little circle in the one",
            "start": 1837.24
        },
        {
            "text": "don't think so Hot Wheels especially when you get the tracks involved that is the thing of Dreams having a room full of loops and like ridiculous have that you just have your little circle in the one felt that way but everyone wants that much sure yeah but you never do so you never have it I here here's the shout out I'll give to Hot Wheels before I **** on them again is remember when they had the Hot Wheels that you could slam into him and then the the like Hood would roll over into damage like yeah they could do this Gran Turismo could have do it 20 years later you that's like the thing where Hot Wheels had something there now big shout out to Micro Machines Micro Machines are **** awesome yeah Micro Machines great and when they started doing all the again licensing stuff where it's like they had the Star Wars license Micro Machines that's where I fell in love with the uh the A-Wing I was like oh man this is my favorite Star Wars **** I didn't even know it is the A-Wing still your favorite",
            "start": 1876.28
        },
        {
            "text": "the Star Wars license Micro Machines that's where I fell in love with the uh the A-Wing I was like oh man this is my favorite Star Wars **** I didn't even know it is the A-Wing still your favorite Star Wars uh I mean I love the X-Wing but it's like you know that's too but I love the A-Wing because the Micro Machine had the it was the perfect fit for the little the characters to like just you can stick them in the back and they'd fly in the back it wasn't accurate but it felt right yeah sure scale felt better too it did yeah cuz the was never big enough that was also the worst thing too about action figures is the when they had different scales so you had like one set that was one size and another set that's like that's when it came out try to do that now but you end up buying an X-Wing that's like this big yeah and then you got to hang **** ceiling I don't like action figures that are like those GI Joes I mean I'm from a different era so to me I'm like these are a little tiny I",
            "start": 1913.4
        },
        {
            "text": "that's like this big yeah and then you got to hang **** ceiling I don't like action figures that are like those GI Joes I mean I'm from a different era so to me I'm like these are a little tiny I don't know why they would ever make a toy that big I'm a big fan of the 6 inch you know you need that nice solid 6 inch which is with as much points of articulation as humanly possible there Star Wars figures that are 6 inch that are quite cool if you're into that sort of thing yeah is there a 6 inch W I have I have a giant W at home right now oh man I want a 6 inch W yeah I'll give you one later don't worry about it come visit my house I'll give you a 6 inch W any time no I'm on my way all right please make the love your life call your penis W from now on yeah but like next time you want you want the D you have to refer to it as the W W the W the W okay no no it's got to be the W how do you say W in French okay okay okay nail it that's it that's it romantic my second language so now you your life revolves",
            "start": 1949.2
        },
        {
            "text": "to refer to it as the W W the W the W okay no no it's got to be the W how do you say W in French okay okay okay nail it that's it that's it romantic my second language so now you your life revolves around toys and collectibles too but you don't have a room like this at home I don't have a room like this at home I I'm like you I have two kids but I just uh New Jersey property values I'm sure it's the same here I just don't have that room and luckily uh you know I can go to the the the store yeah and kind of claim it as my own sure that's smart that's smart because that's the thing right now with Jen moving in and us moving to a new place there is these conversations of like I have all these Superman toys and all these different things and like they're not getting thrown away don't get me wrong all right I'll ship her ass back to Canada but like like this is the whole thing of like well what happens where do like okay I'm like anything that's like questionable I'm like I'll just",
            "start": 1991.88
        },
        {
            "text": "me wrong all right I'll ship her ass back to Canada but like like this is the whole thing of like well what happens where do like okay I'm like anything that's like questionable I'm like I'll just bring it to the office shove it on Nick's desk put on sounds like a great idea throw away the laser tag whatever you're going to come and there'll be like nine Steels just line longed super could do is you could line we need some more soundproofing you could line the top of the studio with that on both sides Action Figure Soundproofing there you go now here's my before we jump out of this my final question for you young Gavin is the fact of now is your your collection of action figures down there have you started expanding into The Walking Dead line of figures because there's a Clementine figure there's a Lee figure there's not a Kenny figure yet which kind of **** if never will be what you talking about Kenny's a fan favorite I guess have you started picking up your friends though do you have you got",
            "start": 2036.0
        },
        {
            "text": "figure there's not a Kenny figure yet which kind of **** if never will be what you talking about Kenny's a fan favorite I guess have you started picking up your friends though do you have you got got two Melissa I don't have a Dave yet I only have Melissa because Skybound sent him to me and **** now that I've said that I'm gonna have like a box waiting in my house when I get home exactly yeah they are the the nicest people on the planet Skybound guys send in two more Melissas there you go yeah no they gave me like once a week have a room full of no I I I I only have the the those are the only two I have I didn't get any cuz I like the show but I mean I never got into the the figures from the show there's too many yeah that's true a lot of them I did Halo figures which is also McFarlane same toy company just cuz those are cool those are good figures you what's the Square Enix line the Play Arts Kai oh I've got some I've got like got um Metroid or I've got Samus and um I've got the",
            "start": 2073.16
        },
        {
            "text": "toy company just cuz those are cool those are good figures you what's the Square Enix line the Play Arts Play Arts oh I've got some I've got like got um Metroid or I've got Samus and um I've got the Link from Skyward Sword I've got the Toon Link but that might actually not be Play Arts might be something else might be Good Smile or something like that okay but mostly just video game ones things that I I don't like buy lines I buy like oo that's a really cool do you buy the characters do you voice if they if they get stuff no no okay no I mean I probably would but I haven't done a lot of characters that have been made into toys aside from actual toys that I've done sure but I've got like a Furby in my studio just like sitting in a it's open but it's in like one of those little po sorry this Furby plastic case it's in that plastic you're the actual voice of the Furby yeah like the current one the one from 2010 through now cuz when you said Furby I'm like what am I miss is there Furby",
            "start": 2115.8
        },
        {
            "text": "Furby plastic case it's in that plastic you're the actual voice of the Furby yeah like the current one the one from 2010 through now cuz when you said Furby I'm like what am I miss is there Furby some character that I don't know actual Furby yeah the actual Furby weird hamster bird thing oh yeah it's a hamster bird it came back I I was unaware yeah that was a that was a funny job so I went down there to audition it's like a place that I work all the time called creativity down in San Carlos and um they called me in and we did like the audition and like they're like okay so it's this thing they wouldn't tell me what it was it's this small furry thing it's from outer space has its own language chewbaca there's a few different ones there's a there's a princess there's like a main character there's like a warrior and I'm like see what you're casting like three people or something like that and they're like no no no we're looking for one person like you want me to to do like a princess",
            "start": 2164.56
        },
        {
            "text": "there's like a warrior and I'm like see what you're casting like three people or something like that and they're like no no no we're looking for one person like you want me to to do like a princess they're yeah okay and then they're like okay and we don't have a script but we're rolling and then eventually I I booked the job and then like maybe a week in I'm like is this Furby and they're like yeah yeah yeah it's Furby didn't we tell you that like no no told me that would have been fun if they just kept that going throughout the entire run of the series yeah like I don't know what this is and they're not giving me lines and it doesn't matter no it doesn't matter there was a lot of eventually there was a script but I mean for the most part it was there were a lot of moments where it'd be like okay we need like a kind of a euphoric orgasmic kind of building climactic sound when you transform into another character you're rolling what does that sound like what you what'd you give I'm not",
            "start": 2210.48
        },
        {
            "text": "okay we need like a kind of a euphoric orgasmic kind of building climactic sound when you transform into another character you're rolling what does that sound like what you what'd you give I'm not doing those man come on to close out this topic You're Building orgasmic oh no they're so awful I'm gonna I'm know it's exactly that perfect thank you was with you until the end if you need how do you orgasm too orgasmic I just got mine usually sounds like this thank you that's all I got that's it I'm so happy it's Sunday Sunday Tim what's your topic holy oh that was something The Walking Dead specifically how is it going to end how should it end talk about the end of Walking Dead I I don't like yeah like my thing is like let's keep it as the broad overall cuz you know there's through lines here and there whatever sure I'm I don't like this is weird where it's going to get spoiler territory but like we don't need to necessarily name any specifics I I think the only thing is I think there for",
            "start": 2249.44
        },
        {
            "text": "and there whatever sure I'm I don't like this is weird where it's going to get spoiler territory but like we don't need to necessarily name any specifics I I think the only thing is I think there for me there's a definitive moment that'll end and I think that only I don't think it's a spoiler for I think Walking Dead ends that when Walking Dead ends they'll kill Rick oh yeah I think they'll be the death of Rick and then Carl rising up coming sooner than later you think so I mean that's the thing you think that's the after the last season you're talking about you're talking about the show yeah yeah yeah I see I think the show will keep around in perpetuity I don't know I mean That season was awful personally I think the show season finale sooner than planned nothing happens but also I I think that they would have wanted it to go on like 15 or so Seasons but I think I think the 10 I think it it'll end at 10 what so what are we at now seven just yeah I I read that they have 1  Seasons",
            "start": 2303.72
        },
        {
            "text": "think that they would have wanted it to go on like 15 or so Seasons but I think I think the 10 I think it it'll end at 10 what so what are we at now seven just yeah I I read that they have 10 Seasons mapped out but I can see I mean that makes sense based on the comic cuz I mean you know now here is where the weird spoilery thing I don't think it's that spoiler comic over no it's still going but like there's I think you can look at what's happening where they left off this season where they'll start next season next season will be All-Out War all and then they'll the finale will have a definitive moment then there'll be a blackout then we'll come back and we'll pick up with what happens next and that'll be the thing where in a to the general audience they're going to be like what the **** and then I think you're going to have that renewed spark of interest that everybody's super into it because that's how it's been it's like Walking Dead the TV show got so popular that there was",
            "start": 2342.56
        },
        {
            "text": "and then I think you're going to have that renewed spark of interest that everybody's super into it because that's how it's been it's like Walking Dead the TV show got so popular that there was nowhere else for it to go but down and it was that thing of like people this that the other with the season and it was a weird one for me because I thought they did Negan so well for what I would have wanted out of Negan that first half of season and then at the end it kind of started getting a little muddled or whatever and then when they came back for mid-season break I totally somehow missed it this my whole life is like comics and Walking Dead and nerd stuff and it two two week the second episode aired and then that Monday on uh the morning show people were like what did you think and I'm like is it back like what I didn't even no I fell off even earlier than that like I thought the first two or three episodes of this season were great and I love Negan's character being familiar with with",
            "start": 2384.4
        },
        {
            "text": "is it back like what I didn't even no I fell off even earlier than that like I thought the first two or three episodes of this season were great and I love Negan's character being familiar with with him from the comic I was like oh they're doing a good job of adapting this differently for TV but then it just reached a point like no no you're just doing this over and over and over and over and it's like not going anywhere and so I just I didn't even come back yet I will I'm sure at some point just to like catch up but uh I'm just thinking more just overall broad like we know the story we know that no matter whether it's a video game TV show comic there is this world that exists there are the rules of the world and at some point the the main story line will come to an end I think that will die and that will not be the end I think that'll then it'll allow Carl to older but you talking about the show you're talking about the comic book overall cuz I think the comic especially if your guys",
            "start": 2418.76
        },
        {
            "text": "and that will not be the end I think that'll then it'll allow Carl to older but you talking about the show you're talking about the comic book overall cuz I think the comic especially if your guys are talking about him Rick dying in the show then I think the comic won't reflect that the comic will keep doing its thing I would say it's flipped I see Rick dying in the show being the end of the show I think Rick dying in the comic is just the thing to push forward for where the story goes after that see I mean I would think I can I feel you on it I understand what you're saying I would think in the the show Andrew Lincoln would be a huge wanting to leave is a huge problem right and I think that's what they're eventually going to get to is that all this all these cast members are going to want to do something else and so how do you balance that and do that and I think that would make sense for him to die there but I I think the book what I what I'm desperate kind of for the book to get",
            "start": 2455.88
        },
        {
            "text": "to do something else and so how do you balance that and do that and I think that would make sense for him to die there but I I think the book what I what I'm desperate kind of for the book to get back to is I'd like to see it rained back in there's just too many **** people in there and like too many characters coming back you guys read the the book I don't read the comic I read the first two trades okay yeah I read the comic okay definitely are you caught up totally I'm not totally caught up but uh you I know where I know where it's going for sure yep and that's and then Nick I don't need the comic at all no I just get my updates from you too and we totally yeah we're totally caught up and it's like is it is it worth like for people who haven't read is it worth going back and reading at this point I think so I think so too yeah you can pick up the compendiums are 48 issues each um I have every trade I can just them yeah it's like it's they're good read They're quick reads too and the",
            "start": 2497.56
        },
        {
            "text": "point I think so I think so too yeah you can pick up the compendiums are 48 issues each um I have every trade I can just them yeah it's like it's they're good read They're quick reads too and the thing is it's different enough from the show that even if you know the show there's so many twists and turns that how long have they have the barn for because you know that's my favorite season uh it's it's totally different I mean it's so it's like three issues okay yeah fair enough but that's the thing of like the comic I feel like I want him I'd like to pair it back I like cuz I thought my favorite you know in the comic was like when uh we were in there everything's great you know prison life's happening and then we got ripped out of that and it was just uh Carl and Rick for a while and I was like that's awesome I'd like to get back to that because that's the whole thing in both these issues it's really like we've gotten so far away from zombies which is fine you know what I mean now",
            "start": 2531.24
        },
        {
            "text": "was like that's awesome I'd like to get back to that because that's the whole thing in both these issues it's really like we've gotten so far away from zombies which is fine you know what I mean now they're coming back sure pretty strong that's this is where I think the topic that I was trying to head towards is is now that they've kind of done everything they can possibly do every variation of this person died that way this person died that way this is what this Leader's like this is what that Leader's like we're at a point where it's like they can't just introduce another big bad guy and have a different camp and have Alexandria get run over again and where do they go and like I I feel like where with the story line they're going at now there is a turning point that they need yeah in the comics they need to make a decision that's going to move the series in a totally different direction uh to keep it relevant um the kind of like fan-servy end that I don't think that they'll ever do",
            "start": 2566.68
        },
        {
            "text": "comics they need to make a decision that's going to move the series in a totally different direction uh to keep it relevant um the kind of like fan-servy end that I don't think that they'll ever do and it's a little too like G is the him waking up from the coma at the end and like the whole thing was oh wow like that would be dream oh that would that' be awful that one it's automatically awesome and awful at the same time where it's like oh that's really cool can't the ball to do that **** was it Dallas was that the original show yeah people didn't I don't remember them liking it too much when that happened didn't go over that was not well received the only cool about it is like it the whole thing started with him getting shot and put in the true so it's like that would be one big mindf*** but it's like that is there's so much that happened where it's like that's a weird ass coma you went through that's possible I mean that that's my thing so many other people so Random you also",
            "start": 2602.76
        },
        {
            "text": "mindf*** but it's like that is there's so much that happened where it's like that's a weird ass coma you went through that's possible I mean that that's my thing so many other people so Random you also dreamed about your best friend having sex with your wife and then you killed him that was pretty that's pretty **** up yeah and your son loses an eye I had a nickel the uh yeah right I mean I don't know where I was going with that I back I dream about you **** people appreciate that thank you um I yeah my thing is I I know that it's counterintuitive to what the show is but I do want some level of closure with it and whether that means hey we've we've closed out Rick's story line we've closed out the the original cast story line like I would like to see Maggie keep going I don't know if she's alive in the comic books or not but in the show I'd like to see her she it it looks like they're angling for her to be the leader that everyone needs at a certain point and and and Rick is very much",
            "start": 2643.8
        },
        {
            "text": "alive in the comic books or not but in the show I'd like to see her she it it looks like they're angling for her to be the leader that everyone needs at a certain point and and and Rick is very much you can kind of see that they're starting to build him out as like the grizzled old worn down you know leader who was might be it might be ready for him to go um you know I also would like to see someone take over that actually knows something about um military strategy so they don't keep getting their asses handed to them every single **** time they do anything that would be run around just in open out some concept of someone like hey look up the word flank and maybe use that from here on out I play Call of Duty yeah exactly um but you breach in there breach and clear do something do something we're like you know but but you know I mean that's the thing is I I kind of I was with you right the show came back and I was like oh I suddenly I looked on my DVR and I had three episodes um taped",
            "start": 2681.84
        },
        {
            "text": "we're like you know but but you know I mean that's the thing is I I kind of I was with you right the show came back and I was like oh I suddenly I looked on my DVR and I had three episodes um taped or recorded rather um I love the idea of you using a VCR and you're like you're like setting the timer last week oh yeah last time we had put it on EP we're going to put a lot on this tape because the last time you and I you re wounded at the end too right oh yeah absolutely the last time you and I had to interact with a VHS player did not go very well **** yeah the little tracking wheel you got to use it gentle was a gentleman I love this that's when you had to earn it you know what I mean you had to like work for it um but no but that's the thing and then and then halfway through my wife was like look we should it's on there let's just we have a Sunday let's just start watching and I got back into it and then toward the season finale I was like okay I'm a little bit more invested well",
            "start": 2721.4
        },
        {
            "text": "like look we should it's on there let's just we have a Sunday let's just start watching and I got back into it and then toward the season finale I was like okay I'm a little bit more invested well that's one of the things that I think works for both this the show and the comics is that binging them is awesome for me with the the way I got turned on to Walking Dead was uh my senior year of college 2005 uh editor or whatever TA in the class I was is like you like zombies right he's like and I'm like yeah he's he's like you need to read these and it was volume one and two of the trades and that was two had just come out yeah I was like **** this is awesome and this is before Comics were digital so I was like I'm not going to buy single issues I don't want to get back into bag and boarding I'll only buy trades and so what it was for me is that every time a new trade came out I would read all the other ones before it to get caught up so I know Walking Dead trades 1 through 1  so well and",
            "start": 2757.88
        },
        {
            "text": "only buy trades and so what it was for me is that every time a new trade came out I would read all the other ones before it to get caught up so I know Walking Dead trades 1 through 1  so well and then when they switched over to digital and that's just the number I pulled out of my ass I started picking it up month to month and it was so hard of like things happen so quick and then it is like you open it back up like wait where are we and what's happening art like all the characters started to look exactly the same after a while like exactly the same like there was an image I saw online one time where it's like someone just added a caption that's like look this is Rick saving Rick from beating up Rick like holy **** that's hilarious yeah and it's black and white so so it makes it it makes it hard but I had the same experience but in a much bigger way because you were trying to sell me on Walking Dead Forever and I was just like I don't really like it and then I gave it a real shot",
            "start": 2795.04
        },
        {
            "text": "it hard but I had the same experience but in a much bigger way because you were trying to sell me on Walking Dead Forever and I was just like I don't really like it and then I gave it a real shot and I binged the entire comic series from issues one to like 150 which was like wow a lot and then that was around the time that I think season 6 was like halfway done in on TV so then I binge the whole show up till there and the binging experience is yeah this is the Rick beating up Rick saving Rick from beating up Rick um doesn't help that they're all like long-haired with beards now cuz they can't shower yeah and it's all black and white it's all black and white but then both the show and comic got a lot less interesting when it was week to week for me yeah and and that's the thing about the show sorry I lost this The Narrative there of like yeah like I I don't mind I'm treating Flash the same way where I **** love Flash and CW but I've gotten so out of sync watching them week to week",
            "start": 2832.4
        },
        {
            "text": "show sorry I lost this The Narrative there of like yeah like I I don't mind I'm treating Flash the same way where I **** love Flash and CW but I've gotten so out of sync watching them week to week that it's like **** let him build up and I'll just knock him out on a plane or do whatever Jump Around do that yeah I'll be honest this season people are like you know something's missing what's missing Glenn and Abraham I'm going to be honest I miss Glenn's my favorite character um even for racist even for the obvious reasons and Abraham was probably a close second no Abraham was great in the show not there anymore and um you know they they two big holes to fill for sure and that's the thing is like yeah with the cast and the chemistry about it there are so many different things of like when Andrea was still on the show I hated and yeah and not the actress she's fine but it was just the fact of like you're not the Andrea from the books I I love Andrea from the comics so much that like",
            "start": 2873.2
        },
        {
            "text": "Andrea was still on the show I hated and yeah and not the actress she's fine but it was just the fact of like you're not the Andrea from the books I I love Andrea from the comics so much that like who are you and why are you doing this and like blah blah and so like Michonne's rise has been great and her feeling Andrea's role in the show I'm like all right no this is cool but even Michonne was rambling and aim aimless for so long that by the time like all right we kind of locked it in great and then like the way they used Daryl those episodes were great I thought this season I love Daryl and stuff like that but it is the thing of there still are so many like filler characters on there of like you can show me the whole lineup and it's the same way of like where when we were coming back from the season finale into this one we're like oh you think they're going to kill I'm like no they're going to kill that one guy none of us can name the one guy who dropped the photos you know what I mean",
            "start": 2911.96
        },
        {
            "text": "season finale into this one we're like oh you think they're going to kill I'm like no they're going to kill that one guy none of us can name the one guy who dropped the photos you know what I mean Ethan I think but I don't know if that's right or I still know his name but it's cuz I drop in and I'm doing other things the gay guy yeah the show guy with a nice jacket I forget his name yeah the show is he was like the when you first see him you're like this guy has been clearly behind the Gated Community yeah cuz he's not he doesn't look like Rick although shout out to Rick uh during what not last season season before that where they were like aimlessly walking around for forever and they had to do that bridge scene where they were like okay or just shoving them over Rick had the it was like really bum Rick my wife dug that man she was just like smells awful yeah side of a pier uh in the comics a main character got bit yeah and that is the first time zombies were a threat in a very very",
            "start": 2947.88
        },
        {
            "text": "really bum Rick my wife dug that man she was just like smells awful yeah side of a pier uh in the comics a main character got bit yeah and that is the first time zombies were a threat in a very very very long time my thing is I think that this is the time where they introduce some weird weird sh** like oh the zombies aren't they're like they're they're not affecting people anymore I just assume that would be Judith's role well that's that's the thing too like does Judith is she do they discover that like people that are born after are immune to the the **** and just go from there that that's I would be fine with that as far as like closure cuz I know they're never going to be like oh it's this thing that caused it we found a cure it's just we're Beyond we're so far beyond that but from the record like when we talk about how it's going to end I wouldn't be surprised if a narrative introduced to the final season of the show was we think we have a cure and it's not anything we've done in",
            "start": 2980.8
        },
        {
            "text": "record like when we talk about how it's going to end I wouldn't be surprised if a narrative introduced to the final season of the show was we think we have a cure and it's not anything we've done in the books before possibly because that's not really something they've done other than Eugene in the books but like I think it could totally be that they finally for that final season craft some kind of thing that the narrative is they're going going going and similar I know to what happened with CDC but they're getting to someplace they get there they make the final push Rick gets in the room but he gets bit along the way gets in there discovers yet there there there's nothing they can't fix this and he has a moment or whatever ever and Carl's off doing something else do you think uh they'll ever stop putting Carl on that hat in the show no do you think they'll ever make Carl cut his hair no I me I mean if it if if it follows the comics yes to both of those okay good but I mean they'll be",
            "start": 3024.76
        },
        {
            "text": "stop putting Carl on that hat in the show no do you think they'll ever make Carl cut his hair no I me I mean if it if if it follows the comics yes to both of those okay good but I mean they'll be like it's he's saying like make them like I mean it'll be like yeah I thought that was more of a like fans don't like the hat or whatever I think like there was going to be story lines and stuff and reasons for it me like do we need the Hat anymore let him give me back my yeah and then but Comics I don't know where they're going to end up it'll be interesting see how long it goes because I mean it is that thing of like this is going to continue to print money forever and ever and ever in any I mean at some point Kirkman said he wanted to do 300 issues is that what it was yeah okay and we're AT3 I think yeah something like that so we're not even we're just a little over halfway but I mean like I just you know it's funny cuz I was when I was helping Jen move she has my Walking Dead trade one",
            "start": 3059.36
        },
        {
            "text": "I think yeah something like that so we're not even we're just a little over halfway but I mean like I just you know it's funny cuz I was when I was helping Jen move she has my Walking Dead trade one that she had read and I picked it up and I was paging through it for the first time in years and that just that intro letter of him just talking about like I'm this is to me a zombie movie That Never Ends you know what I mean it's like I how it's one of those as his career Skyrocket and done so many different things I really wonder what that is because that's what Invincible must have been right of like yeah I could keep doing Invincible but I'm **** really busy so I need to start killing my children and decide which ones I want to do and do I want to go write more shows and do all these different things and work on movies like what has to give and again eventually The Walking Dead will have to give you assume in some way I mean I think that especially with Invincible it's gotten to a",
            "start": 3102.48
        },
        {
            "text": "things and work on movies like what has to give and again eventually The Walking Dead will have to give you assume in some way I mean I think that especially with Invincible it's gotten to a point point where I don't know what more they could do they've done every angle and reverse angle of that and like any like thing that you didn't expect has happened to the point that that series as a whole how many issues are we in now like 13 or something like that and like it's going to end so it'll end around 150 if not at 150 looking at that I'm like there's only been a couple Ls and overall it's been fantastic and there might be like a 1 issue L here and a 1 issue L there but overall has been great whereas with Walking Dead it's like most of it has been really good there's been a couple dips here and there when are they going to hit that point where it's like all right well you've I feel like they're already there where it's like they've done everything yeah what else you do right",
            "start": 3137.08
        },
        {
            "text": "dips here and there when are they going to hit that point where it's like all right well you've I feel like they're already there where it's like they've done everything yeah what else you do right because you need to keep me going oh **** the way that the series has and see that's the interesting thing about what you mentioned this main character getting bit in recent issues is like it didn't have for me the same pop as the other ones and I don't know if it didn't have the pop for me because I wasn't reading all the trades so I wasn't like in that moment I wasn't right there cuz like you sit down and even you know pages in okay I've been distracted from life for 10 minutes 15 minutes it's not the same way of spending hours to get to that point yeah yeah I mean give us what do you how's it going to end what's the answer uh I think I think I did a panel with Michael Rooker and somebody asked Michael Rooker Michael Rooker Henry portrait is killer somebody asked him how he wanted and",
            "start": 3177.56
        },
        {
            "text": "it going to end what's the answer uh I think I think I did a panel with Michael Rooker and somebody asked Michael Rooker Michael Rooker Henry portrait is killer somebody asked him how he wanted and then uh you know he just said uh you know Carl older grizzled walking down a train track into into the sunset and uh you know all all the stuff we've seen is his past memories and he's he's alone everybody else is dead and uh and that's how he wanted to wanted to end I I kind of like that where yeah he's the only one left everys out with the arm gets him in the other ey yeah everyone he knows loves they they're all gone he's the only one left yeah and um the everything we've seen were just as past uh you know his past memories yeah that'd be good yeah yeah you fig Carl's got to be the he's got to be it right like that's the thing yeah it can't be Judith cuz she's not going to remember anything yeah Judith want to **** cop out TV TV shows I tell you what why is that a cop out oh you",
            "start": 3212.04
        },
        {
            "text": "to be it right like that's the thing yeah it can't be Judith cuz she's not going to remember anything yeah Judith want to **** cop out TV TV shows I tell you what why is that a cop out oh you should read the books no whatever that baby's cute how dare you but that that but even I mean for Carl that was the same way too where I'll never forget that like you want to talk about oh **** moments in the comic when he got shot in the head and you were like what the **** and I was like man he's dead and then he was miraculously alive I'm like that kind of sucks that's weird or whatever and then I'm like oh he's kind of unbalanced and he's like no he's just normal kid again I'm like all right whatever H I mean I I feel like they've done a good job with this character I like how the series has handled kids growing in this world cuz they're all **** up like they there's been no kid in the series that's just cool and normal to be fair I guess none of the adults are normal either but",
            "start": 3255.92
        },
        {
            "text": "has handled kids growing in this world cuz they're all **** up like they there's been no kid in the series that's just cool and normal to be fair I guess none of the adults are normal either but the kids are really **** up yeah great yeah as you assume they would be yeah there was the kid that was uh in this in the TV show that with the other kid that was like homicidal yeah oh yeah yeah Lizzie Lizzie look at the flowers Lizzie oh yeah oh my God no that I wasing to the other boy that was in Alexandria the crybaby yeah that that was **** up that was a **** up story L shout out to Carol yeah that was shout out to Carol shout out to Carol man has to do it Carol's one of those characters actually that's probably one of the reasons why I think that this last season didn't resonate with me because I'm such a big Carol fan of the TV show that her that storyline of her being like I'm withdrawn I'm like get your **** head on straight Carol let's go let's go that's the great insult of",
            "start": 3293.8
        },
        {
            "text": "me because I'm such a big Carol fan of the TV show that her that storyline of her being like I'm withdrawn I'm like get your **** head on straight Carol let's go let's go that's the great insult of the the TV show is that for all the character development they've done for Carol they've just backed up on everything and it's just like you dropped the ball you you can't have her like do this like back and forth it's like no you've sold her she's a **** badass you can't have her lose then she's already lost it and it's like you're weak now and Eugene's even **** worse all the **** they're doing with him I'm like they built up from him being an **** like liar to him being a some guy that's supposed to be like a good dude now he's they're just dropping the ball again traitor yeah I kind of like that though I kind of like that I am it makes sense to me that like that he would end up that way it seems plausible because he would look for whatever that's his mess plus he's unmoored",
            "start": 3335.44
        },
        {
            "text": "I kind of like that though I kind of like that I am it makes sense to me that like that he would end up that way it seems plausible because he would look for whatever that's his mess plus he's unmoored without Abraham right like that's the thing but that but my thing is I feel like the Abraham moment like so **** awesome the thing with characters dying is it's like that needs to mean something or else there's no point so Abraham dying if it's going to just purpose or serve purpose to other characters it needs to serve purpose to those characters well it did it it made Sasha and uh I get it but decided to go on a suicide mission for no reason that was completely ill planned again somebody needs to read a book on Warfare stop just randomly haphazardly trusting everyone and assuming that like you can just walk into a place and kill everyone it doesn't ever work Kevin it doesn't work Kevin don't do that the only thing Kevin go walk into and kill is Wendy's he likes that Frosty oh no yeah",
            "start": 3374.84
        },
        {
            "text": "you can just walk into a place and kill everyone it doesn't ever work Kevin it doesn't work Kevin don't do that the only thing Kevin go walk into and kill is Wendy's he likes that Frosty oh no yeah Frosty freezing was that Wendy's Frosty? Frosty, Frosty, Frosties, just Frosty I've read The Art of War like IO yeah dude, stats you can find you come at me and I'll **** get no that's why we have you if we go to war we know that you're going to be the one leading us it's not this daffodil and it's certainly not going to be this beautiful son of a **** I'm much more of a Eugene yeah I just make it make bullets and **** roll with the punches I just bend over for whoever wants to whoever wants to take it from me yeah yeah you have Eugene's hair like his new hair I do not his TV show hair no I I could pull off the mullet I would need scissors but yeah we got some we got some for you sweet all right my topic mullet me up how stoked would your wife be if you came home with a mullet today really un",
            "start": 3419.6
        },
        {
            "text": "pull off the mullet I would need scissors but yeah we got some we got some for you sweet all right my topic mullet me up how stoked would your wife be if you came home with a mullet today really unstoked but it would last she at least year you got your shirt on she like I'll call Bae all right my topic comes from Twitter and interaction my topic is frozen pizzas okay now now what of course happened is a while back DiGiorno followed you Tim DiGiorno followed me on Twitter last year February 2016 nowhere in February 2016 nothing prompted this I didn't talk about DiGiorno wasn't on our pizza didn't tweet at anybody they just followed me and I was like that's weird this must be one of those things where on on Twitter like they follow 40,000 people they're just yeah they're just trying to get followers right I look they were only following like 200 people and I'm like this was targeted somebody followed me someone knew what was up and I don't understand why so then I tweeted about it and I was like",
            "start": 3460.84
        },
        {
            "text": "right I look they were only following like 200 people and I'm like this was targeted somebody followed me someone knew what was up and I don't understand why so then I tweeted about it and I was like holy **** DiGiorno followed me and this is real that's weird and they responded and they're like oh man hey you know something nice I don't remember what the **** it was then a fan responded to that including me and said they should get bring back the buffalo chicken pizza for GameOverGreggy then we go silent we go silent out of the blue DiGiorno responds to my tweet because I responded Yes or totally they respond to my tweet with a finger pointing down and it was the return of the buffalo chicken pizza stuffed crust pizza that's a lot of production I just don't get it though so then I don't know what went through their heads so then I respond I tweet about this holy **** that 14 months later they make good on this conversation and we're like they should send us some pizzas and then a week later we giant",
            "start": 3510.08
        },
        {
            "text": "their heads so then I respond I tweet about this holy **** that 14 months later they make good on this conversation and we're like they should send us some pizzas and then a week later we giant freezer box comes we open it up there's seven DiGiorno buffalo chicken pizzas inside this **** with a note from DiGiorno that's the most important part is that's actually let me go get the note you f***ing time talk about it's good so I was I was shocked by this because when I saw this I was just like wow this is the long con like they they they saw this tweet a year ago and they're like you know what it's in production we somebody earmarked this and we're going to get back to them and we're going to let them know when the the chicken pizza comes and they did so you assume that the the other assumption would be that they were like that that's a genius idea we haven't thought about that and let's let's you don't think Greg was the originator of that idea with them there's there's I don't think so either",
            "start": 3554.8
        },
        {
            "text": "be that they were like that that's a genius idea we haven't thought about that and let's let's you don't think Greg was the originator of that idea with them there's there's I don't think so either I'm just some information here that I don't think that we have correct okay I think the buffalo chicken pizza's been around for a long time there's I at some point this guy must have just come across this tweet this is not a new product but is the stuffed crust part of it new I don't is my question cuz some guy had said yeah and when we started talking about this again they were like well no I've seen the buffalo chicken in my store but I don't know if it had the the stuffed crust regardless I'll tell you what I check Andronico's every **** week and there's no buffalo chicken frozen DiGiorno other otherwise the letter from DiGiorno re is kind of funny it's not delivery dot dot dot unless Greg Miller asks for it to be delivery parenthesis this is not our new slogan winky Sly face emoji and then you",
            "start": 3594.48
        },
        {
            "text": "the letter from DiGiorno re is kind of funny it's not delivery dot dot dot unless Greg Miller asks for it to be delivery parenthesis this is not our new slogan winky Sly face emoji and then you best friends at DiGiorno that's got an emoji sticker serious so it's a best friend works at DiGiorno that's how it's all starts on that are we let to read that postscript says thanks for the assist him oh there you go or thanks for the assist on this I love everything about this cuz one best friends so we got we got the the community working over at DiGiorno but the best part is that they made the joke that everyone wants to make that oh it is delivery yeah exactly cuz they delivered the DiGiorno yeah which is fantastic so when all this goes down on Twitter Alex Entermann at the Bottom B, Bottom B it's like boredom but it's just no there's no B Reaper BM Reaper the BM Reaper has there been a G-Topic on frozen pizzas if not then this feels like the right time to do it and I I was like **** that's a great idea",
            "start": 3628.4
        },
        {
            "text": "but it's just no there's no B Reaper BM Reaper the BM Reaper has there been a G-Topic on frozen pizzas if not then this feels like the right time to do it and I I was like **** that's a great idea there has we talk about pizza a lot we had the whole Pineapple War mhm this is you know we're we're moving on now to the Frozen Pizza War I want to know how frozen pizzas come down for everybody shout out to frozen pizzas man yeah I I look at frozen pizzas shout out to frozen pizzas man the same way that I look at Panda Express where I'm like I **** love it it's not Chinese food but I **** love it frozen pizzas they're not pizzas no they're their own sub genre they're their own category I love that **** it's so good you never have a bad frozen pizza and if you you're not you are the issue not the pizza here's where I want to start with this is I want to talk to Gavin you have I'm old as **** no no no no you call remember the first Frozen I'm actually going the opposite way you",
            "start": 3675.96
        },
        {
            "text": "issue not the pizza here's where I want to start with this is I want to talk to Gavin you have I'm old as **** no no no no you call remember the first Frozen I'm actually going the opposite way you have children I do I remember for me frozen pizza was such a big deal as a kid you know what I mean are these kids are kids these days still eating frozen pizzas with Reckless abandon not in my house so I'm a I'm okay I was raised on Totino's hell yeah you were and I was raised on the Stouffer's, the Stouffer's french bread pizzas which I this is a sub genre of a sub genre I know I know but I would still totally eat those and I and I love them but um I we're total Pizza snobs I make it I make the crust I grow the tomatoes I grow the basil I make the sauce tomato he does it all shirtless he does shirtless I'm in the garden man I'm not wearing gets on the tomatoes and that comes through in the sauce and CRA I mean it's extra made with love salty it's like a musky salt too goddamn it but yeah so we don't",
            "start": 3717.28
        },
        {
            "text": "I'm in the garden man I'm not wearing gets on the tomatoes and that comes through in the sauce and CRA I mean it's extra made with love salty it's like a musky salt too goddamn it but yeah so we don't do the frozen pizza interesting we have like so the only ones that I will that I'll buy these days are the Trader Giotto's from Trader Joe's like those Italian style ones like their four cheese one it's pretty good yeah but like my wife made it for the kids one night and they're all they had like one piece that was it but like my pizza they'll **** kill the thing they'll eat the whole thing you ever put it on a bagel you ever make a bagel oh yeah Pizza on a bagel you add Pizza anytime I'm I I know I totally agree I mean I would make pizza on a piece of bread you know but my kids aren't going to eat it they're going to be out Ming are you in the garden of New Jersey your New Jersey home making in New Jersey uh but I grew up in the Midwest I I grew up on Tombstone pizzas **** yeah you did",
            "start": 3768.72
        },
        {
            "text": "to eat it they're going to be out Ming are you in the garden of New Jersey your New Jersey home making in New Jersey uh but I grew up in the Midwest I I grew up on Tombstone pizzas **** yeah you did here we go now see this is where it starts where in the Midwest were you uh I was in uh in in Illinois near you and then I grew up in Michigan and South Indiana and uh yeah you know what do you want in your Tombstone cheese and pepperoni the best commercial but then I moved to New Jersey yeah oh here and then I found out I scared what real pizza was you know New York New Jersey East Coast pizza your pizza snobs too yeah oh yeah bar on some of the best pizza so yeah it's good pizza I don't know wrong Pizza in the world and and there's a joint on every corner there's no reason to get a frozen pizza in New Jersey if you do you must be like on crack or just just this goes back to what I'm saying though it's like that's like in San Francisco there's so much good Chinese food but I still like Panda Express",
            "start": 3814.2
        },
        {
            "text": "in New Jersey if you do you must be like on crack or just just this goes back to what I'm saying though it's like that's like in San Francisco there's so much good Chinese food but I still like Panda Express it's just like it's even though there's no need for it it's its own little thing every once in a while you're just like you know what don't want to leave I don't want delivery I want Totino's you know I want to just open up my freezer and just have some magic happen a couple I give anybody at my door my some money see I think that's why for me they resonate in so much with childhood frozen pie it's cuz it is you're a kid you don't have money so it's like the first thing we knew how to cook exactly my brother knew how to put a Totino's in the oven so my grandma would come over take the money that you know that my folks left to buy us food and spend it all on steak for her and her boyfriend my brother could make the Totino's pizza this really happened to you yeah it's a sad but true story",
            "start": 3856.48
        },
        {
            "text": "that you know that my folks left to buy us food and spend it all on steak for her and her boyfriend my brother could make the Totino's pizza this really happened to you yeah it's a sad but true story God damn all right I also like your grandma had a boyfriend that's that's hot right there that's weird was he younger uh no no he was not she drove a Pinto a blue Pinto okay yeah like a mad woman see for me yeah it was that was it nickname the dick magnet cuz it worked oh God she did have a lot of boyfriends man did she she was like The Golden Girls she kind of was wow she was she was kind of the mean one though oh really I mean well apparently yeah she's taking the money left of you guys making she didn't give you the pizzas though killed my hermit crabs no they were there parents bought the pizzas they were already in how'd you kill your hermit crabs she just didn't feed him or do anything to him I was like four five did you feel guilty of that I picked the shell up and they just fell out",
            "start": 3894.36
        },
        {
            "text": "pizzas they were already in how'd you kill your hermit crabs she just didn't feed him or do anything to him I was like four five did you feel guilty of that I picked the shell up and they just fell out the worst now it happens that's their home that was that was they died in their homes they died doing what they love doing what they love living living in their crab home doing what they love so yeah for me it was it was it's for me it's it starts with Tombstone I remember my Mom and Dad buying those a lot because we'd have like you know kids sleepovers or whatever and these kids are just eating out a house and home you're not going to order 30 pizzas from the local pizzeria restaurant you're going to you're go there and you get all these goddamn Tombstone and we think they're great cuz you don't know any better you're just excited to be eating pizza cuz that's and that's the whole Bagel Bites thing it just pizza yeah that was the whole point any kind of pizza I can get I'm going to eat I",
            "start": 3939.56
        },
        {
            "text": "don't know any better you're just excited to be eating pizza cuz that's and that's the whole Bagel Bites thing it just pizza yeah that was the whole point any kind of pizza I can get I'm going to eat I don't care about this one bit see here's the the pro fat kid maneuver is you get the the Frozen like personal pizzas yeah you know um that are about that the nice size like when you know like maybe like the 6 inch around type one you're looking at you take that cook it fold that **** in half like a pizza Taco MH eat it that way yeah now you're playing with power yeah a we call that the fold the fold the fold call The Fold that's what you do with a good a good thin slice New York slice yeah yeah but there something about the personal Pizza cuz there's crust just all around that thing I'm a big crust guy love my crust interesting going there now where how do people feel about it's not frozen but a Boboli what the **** is a I know what a Boboli is when you're in the grocery store and you get to the",
            "start": 3979.0
        },
        {
            "text": "guy love my crust interesting going there now where how do people feel about it's not frozen but a Boboli what the **** is a I know what a Boboli is when you're in the grocery store and you get to the end of the aisle refrigerated section which is creepy they got the they're just hanging there the crust they got they're hanging there the bags of sauce and you aunt used to pull the **** on me of like we're I'm sleeping over at their house we're not ordering pizza okay we're we're eat the frozen pizza no we're doing Boboli and I'm like all right and you it's like the you're making it yourself but you're just assembling it's like it's like it's like Lunchables it's like a fancier Lunchables pizza out to Lunchables Pizza though **** Lunchables Pizza though we're talking sub genre of sub genre cuz I I get it thank you sir yeah it's not real Pizza it's just kind of it's like a cracker again your exciting Pizza yeah and Boboli like Boboli you could I think they they have a package where you could get like the",
            "start": 4018.08
        },
        {
            "text": "get it thank you sir yeah it's not real Pizza it's just kind of it's like a cracker again your exciting Pizza yeah and Boboli like Boboli you could I think they they have a package where you could get like the sauce and the cheese and together all it together Lunchables do we ever have this you have you have to assemble and then you then you put now this is this is I think Boboli gets me to a similar situation of your Papa Murphy's **** these take 'n' bake pizzas **** right off but I either want it frozen or I want it done I don't want this in between I'm already driving to the store to get your shitty **** H done there it is **** Boboli that's right no there it is this **** is garbage look at that crust look that ain't Pizza with the half-baked if it's like a Chicago-style it's like a half-baked cuz otherwise you're going to be sitting there for an hour I'm get a Chicago-style pizza I can do that get one of those that's half-baked and you bring it home and it's like 20 minutes in the oven that's have",
            "start": 4057.72
        },
        {
            "text": "you're going to be sitting there for an hour I'm get a Chicago-style pizza I can do that get one of those that's half-baked and you bring it home and it's like 20 minutes in the oven that's have you done the Papa Murphy's thing though cuz the Papa Murphy's isn't baked at all it's a take 'n' bake yeah no I know **** off no I don't need this **** cuz then you can't even Let It Rock in the Box yeah last week you did something that blew my mind I wasn't here to experience it oh sure I know where you're going with this one we had the DiGiorno pizzas we decided we wanted to cook the DiGiorno pizzas the Kinda Funny Studios used to be a home a long time ago then the landlord's like no more homes just businesses that run bad YouTube channels and so we got it but that meant they ripped out the oven so there's no way in the shower so there's no way to cook in here that's why we bought bought the grill maybe violated the lease having it out for that but we do the barbecues every week out there the",
            "start": 4109.8
        },
        {
            "text": "there's no way in the shower so there's no way to cook in here that's why we bought bought the grill maybe violated the lease having it out for that but we do the barbecues every week out there the roof and it turns out yeah you can barbecue a pizza you can use the grill to warm up a frozen pizza and so we did the DiGiorno buffalo chicken stuffed crust on the grill delicious Andy Cortez come here what's your review of this pizza review of the DiGiorno grill stuffed crust buffalo chicken pizza I was stunned at the quality of this pizza I really was like I you know you're not expecting much I really just wanted the meat right you were making no I think you were making ribs out oh you're talking about the rest of the barbecue yes I'll give this **** slice a shot the quality of the crust the crispness the **** crunch was just Stellar unheard of crispity crunchy I could see in your eyes like passion yeah he really believes got horny he got little bit of damn got half a stonk there yeah",
            "start": 4143.6
        },
        {
            "text": "the **** crunch was just Stellar unheard of crispity crunchy I could see in your eyes like passion yeah he really believes got horny he got little bit of damn got half a stonk there yeah yeah he got his six in yeah yeah no but that's the thing now and that's why it's interesting because we're jumping to the full circle here of like then this topic came up from Alex of like what about frozen pizzas and to sit there and think about it that was a delicious frozen pizza and I'm not just suckling suckling the dick here suckling that dick suckling the no dick you know what I mean because but it was it was good and it then but then it was like I it did the thing of like running through I remember for me frozen pizzas go I remember just doing Tombstones I remember my parents starting to shop I think Omni the Omni grocery store instead of Jewel-Osco which then sold Jack's Pizzas maybe this is Walmart Jack's Pizzas Jack's Frozen knockoff Tombstones they weren't nearly as good plus you're",
            "start": 4186.48
        },
        {
            "text": "shop I think Omni the Omni grocery store instead of Jewel-Osco which then sold Jack's Pizzas maybe this is Walmart Jack's Pizzas Jack's Frozen knockoff Tombstones they weren't nearly as good plus you're starting to get of age where you want real Pizza like I can go out we can somebody can drive all this different stuff then shout out to the Chicago suburbs for having Home Run Inn frozen pizzas Home Run Inn Dynamite Chicago local chain of pizza restaurants and then they started selling their pizzas the frozen in the case Top Notch it's almost as good as going there it's the it's the frozen pizza I've had where it's like holy **** this tastes just like it cuz Shakespeare's Pizza in Columbia, Missouri they do Frozen and they ship around the world or whatever or the United States they're good they're not nearly as good as Shakespeare's you know what I mean and then there's like the gap of I remember when we went to college you brought up the Totino's people usually think pizza rolls I they also",
            "start": 4230.16
        },
        {
            "text": "not nearly as good as Shakespeare's you know what I mean and then there's like the gap of I remember when we went to college you brought up the Totino's people usually think pizza rolls I they also did Totino's Party Pizzas they did these little pizzas that were there's no pizza like a party pizza pillowy bread pizzas that my friend would cook and then sit there and Kyle's a skinny **** he would just sit there watching the the blue or the blues or St. Louis Cardinals play with the thing on it and just slowly eat it like slowly like slowly just chew it up into his mouth yeah they're not cut up they're whole you check the ingredient list there's no there's no food all sodium chemical there's no real cheese and I remember one you know I remember weekends where like I would just eat all of his party pizzas just the entire weekend but they were they were fine for what college was and then I want to say there was a blackout period where I wasn't eating many frozen pizzas but then a Renaissance",
            "start": 4268.8
        },
        {
            "text": "pizzas just the entire weekend but they were they were fine for what college was and then I want to say there was a blackout period where I wasn't eating many frozen pizzas but then a Renaissance I love this show so much a Renaissance of the frozen pizza came around when I started eating the Paul Newman's Newman's Own frozen pizza now that is actually that's pretty good right and that you get a legit one and nothing too fancy and weird no it was either cheese or it was pepperoni I'm not I'm not here to reinvent the wheel here there's no CPK involved in this oh no no no come on come on now come on now and so it was that I would take them from you know I had them there CPK they're not good yeah how dare you even mention that it's really different and you're talking about the CPK is you buy at the store yeah yeah not CP going into a CPK it's fine but it's not a pizza per yeah I mean they have a good buffalo add a pizza restaurant I honestly there was like one with Hoisin sauce on it that's",
            "start": 4307.48
        },
        {
            "text": "the store yeah yeah not CP going into a CPK it's fine but it's not a pizza per yeah I mean they have a good buffalo add a pizza restaurant I honestly there was like one with Hoisin sauce on it that's good Pizza Kitchen I don't know well I think Ming is Ming is like yeah I'm laughing at you I'm shaking my head I can't see the CPK thing falls into similar of like a Panda Express it's a different it's a different Outback Steakhouse like well we got to eat somewhere this is here I'm not do not we're not we're not doing that great I'm just saying Outback Steakhouse been very good to us thank you I enjoyed my state quite I did too I talked a lot of **** about how much you guys went there and I granted I think three times a week going Outback for dinner was a bit much when you and Kevin it was just one week that we one Paul I don't believe that for a just one week three but you guys I've been one over I'm I'm sure someone clip it out and send it to her I'm just trying to defend it that was a long",
            "start": 4343.56
        },
        {
            "text": "week that we one Paul I don't believe that for a just one week three but you guys I've been one over I'm I'm sure someone clip it out and send it to her I'm just trying to defend it that was a long time ago Kevin was a different man but then so then then I I want to give similar to the whole DiGiorno thing was always the Freschetta Freschetta had the good commercials their pieces were all right but I thought DiGiorno was always the the Upper Crust of that argument wow do we wrap it up do we Loop in um and I was in the bathroom for a second so you may have talked about this but like the bagel pizzas that you could get we did bring out we did bring out Bagel Bites cover it well Bagel Bites also that's the same thing too not good no it was just likey I can eat remind you got cheese and sauce I mean they're legit yeah exactly earlier we were talking about the chips and dip and that whole conundrum of like what what's the whole point it is just the vessel for pizza and everyone loves **** Bagels",
            "start": 4382.72
        },
        {
            "text": "legit yeah exactly earlier we were talking about the chips and dip and that whole conundrum of like what what's the whole point it is just the vessel for pizza and everyone loves **** Bagels right you take the bagel you take the pizza they're you're going to have a good time big fan big fan overall Greg I had a moment with you and this happens every once in a while a good moment with you but I was looking at you and you started talking and you did the whole thing where you just kept talking talking there's a lot of details keep you just keep giving more details you start mentioning a bunch of friends names you start mentioning all these like places from the suburbs of Chicago and you just keep going and it reaches a point this happens every maybe like three months where like I started thinking about like wait am I keeping up with this right then I then I lose track you keep talking I'm just looking at you and then then it just ends somewhere Midwest thing with the restaurants and",
            "start": 4426.92
        },
        {
            "text": "thinking about like wait am I keeping up with this right then I then I lose track you keep talking I'm just looking at you and then then it just ends somewhere Midwest thing with the restaurants and the stores it was you're in the Chicago go to Home Run Inn they also do a pizza buffet say man I started to lose it right around Kyle that skinny **** that's what I'm saying that's what I'm saying all of a sudden Kyle that brought me back and like okay cool there's a character name there's a character name I'm wondering if there's a White Hen Pantry next to that whole **** yes God I hear you dude White Hen Pantry I call every day for like two weeks cuz event they were event cuz I wanted the Rolling Stone that had Jennifer Aniston naked on the cover the library had it cuz they were subscribers so they had it early so then I just called White Hen over and over again finally one day they had it rode my bike over there and got it now speaking of porn let's get back to frozen pizzas wow I think I",
            "start": 4461.04
        },
        {
            "text": "had it early so then I just called White Hen over and over again finally one day they had it rode my bike over there and got it now speaking of porn let's get back to frozen pizzas wow I think I believe it was uh Mike Boland somebody doesn't matter brought a whole bunch of porno mags they stole from their brothers to our house one time okay Mom and Dad are at work what caliber are we talking about Penthouse okay all right we're and we're jeez seventh, eighth grade somewhere in there maybe a maybe sixth somewhere in there but you know young yeah and so they're down there I'm up there and that's a lot for a young oh yeah there's things you're going to see in there that you probably we weren't ready for this is how it works this is what it looks like all right yep but I was disp I was dispatched to get pizzas and make the pizzas so I went up there and I put a Tombstone in there possibly a Jack's Party Pizza who knows again this is I what in the are my parents going to Walmart or are they",
            "start": 4503.48
        },
        {
            "text": "to get pizzas and make the pizzas so I went up there and I put a Tombstone in there possibly a Jack's Party Pizza who knows again this is I what in the are my parents going to Walmart or are they still using Tombstone from Jewel-Osco I don't know I'm not there to say Tim I'm not happen again you know what week it was open the pizza's done and Tim goes off I open it pull it out burn my little pudgy hand on the pan scream **** toss the pizza in the air Falls face first on the thing right clean it up throw it away put the other one in there finally go back downstairs in addition like it's been 40 minutes now right with all these pieces I bring them down for everybody like oh I'm like sorry about that I didn't anybody hear me scream nobody came to check on me when I yelled **** these kids were so into their porn that no one heard me burn my hand and throw a pizza on the ground all been there we've been on both sides you know I get it the the burning for the the frozen pizzas that's a",
            "start": 4541.24
        },
        {
            "text": "were so into their porn that no one heard me burn my hand and throw a pizza on the ground all been there we've been on both sides you know I get it the the burning for the the frozen pizzas that's a real thing sure I've had so many friends injured for life based on this my ex-girlfriend three separate Burns just cross her arms from freaking frozen pizzas that's a pizza burn you think you'd learn you know that line you know it's that line three separate ones you got to bring your top you got to bring your rack out of the top shelf but in the middle oh man no she you would think she'd learn she never learned she just kept doing it but she was always happy with the pizza she never blamed the pizza good for you cuz that's the type of thing that like taints your experience but not for frozen pizza well that's the thing about frozen pizza is your bar is already so low well it's like okay I feel like that the burn the the burn for the frozen pizza is similar to the mouth burn for the real",
            "start": 4579.48
        },
        {
            "text": "pizza well that's the thing about frozen pizza is your bar is already so low well it's like okay I feel like that the burn the the burn for the frozen pizza is similar to the mouth burn for the real Pizza where it's like it's never worth it but it's always worth it you know you ruin that first bite is going to ruin the rest of your meal that first but it's still just as good like the whole thing you're still like oh my God this pizza I love pizza yeah me you got something to say I you feel like you got cut off oh no I love pizza too so yeah I want to make you guys Pizza I'd love that the deal I'll make you Pizza love that and and cool Greg my mom makes homemade pizza say Greg now we don't make the dough so then I may not make it for you that's but I would love to help out because I know your last name and so I don't want to my thing is I'm in I'm in it I I I would love to help is what I'm trying to say I like rolling out the dough that's my favorite part I used to be I used to make",
            "start": 4617.68
        },
        {
            "text": "your last name and so I don't want to my thing is I'm in I'm in it I I I would love to help is what I'm trying to say I like rolling out the dough that's my favorite part I used to be I used to make pizza when I was 16 at an Italian restaurant do you throw it oh yeah oh and I don't throw it I like I it's a whole process for me first off Once the dough is made I roll it into a ball right get it nice and get it nice and set you form it you form it you let it rise a little bit then you can roll it out throw it boom centrifugal force it's perfect I taught Greg how to do it his pizza game went from I would say nonexistent I would say a c to an A minus now wow sometimes it gets a little you take me a picture I'm like that's a little off I want you to tell you didn't let it rise enough yeah that's never the problem I want to learn how to throw yeah I'll teach you how to throw the only issue I get sometimes is if I've split the split the dough to make two pizzas too much and then I've got one that's",
            "start": 4662.2
        },
        {
            "text": "the problem I want to learn how to throw yeah I'll teach you how to throw the only issue I get sometimes is if I've split the split the dough to make two pizzas too much and then I've got one that's frozen and I take it out you got to really let it come up otherwise you're just of pushing you're fighting it you're fighting the crust too much and then the kids complain oh **** kids seriously you make your own pizza then best thing to do though and this is something my mom still hasn't picked up no matter how much I tell her I'm like you have to weigh the dough you've got to figure out how much dough goes into what otherwise you do what my mom does which is one pizza is really thick cuz we had to fold in the edges and the other one's like bar like the thinnest crust possible imagine you pick it up and everything I just make one batch and split it Even Steven smart and then yeah one goes in the bag in the freezer the other one goes out to proof there it is I use Bali's I use Bali's recipe too",
            "start": 4703.28
        },
        {
            "text": "it up and everything I just make one batch and split it Even Steven smart and then yeah one goes in the bag in the freezer the other one goes out to proof there it is I use Bali's I use Bali's recipe too it's got a little bit of wine in it little bit of honey okay it's good it's good yeah I want the Gavin party pizza man when do we wi when are you how long you in I have I have to stay for the Mario Kart tournament and we got C now we got and I'll send you home with fresh eggs cuz I got seven chickens Jesus Christ what what does in this guy I don't know I don't know it is a lot of chickens you're living a life do you write poetry I got six cats close enough did they don't eat the chicken close enough I don't write poetry I can I can do Haiku but not on the spot okay a good good call I'll say that because you know next thing you know how you go final part of this topic before we switch over to the final topic is a shout out to one John Campion once made a frozen pizza at a sleepover had this wooden tray",
            "start": 4739.6
        },
        {
            "text": "because you know next thing you know how you go final part of this topic before we switch over to the final topic is a shout out to one John Campion once made a frozen pizza at a sleepover had this wooden tray that was like for breakfast and bed or whatever I'm all and I'm I'm a dumb kid but I'm all alone and with my friends or whatever and I'm like you know what I don't like dishes that much so why cuz you're cooking you know some some pizzas you want to cook just on the rack not on a pizza pie plate just on the rack you know what I mean so I pulled it off there put it onto the wooden uh tray you know went down there we cut it up there we all started eating we're like this tastes like varnish this this is the heat of this has taken the varnish it feels like out of this board now granted we're all dumb kids we don't know what varnish actually tastes like but it smells like what you know it it doesn't taste right it has some attributes of the wood now and we all stopped eating except John Campion who",
            "start": 4785.08
        },
        {
            "text": "we don't know what varnish actually tastes like but it smells like what you know it it doesn't taste right it has some attributes of the wood now and we all stopped eating except John Campion who ate the entire pizza and he was high for a week ex he's now expecting his second kid so there you go varnish confused Pizza dumb kids they grow up yeah exactly exactly final topic Nick movies you should should have seen and I'll give you an example I'm ashamed to say I have not seen Schindler's List oh it comes up maybe once every 3 months in conversation around around lot of a lot of more often than you think we're big of Jewish people here so we talk about a movie guy yeah a movie guy I recently um did a couple episodes of the Schmoedown um which is a show on Collider's Network on YouTube and one of the top one of the questions was a Schindler's List question and when you're amongst a bunch of was it what was it was it like super easy in Schindler's List is the only one in color that was the",
            "start": 4830.08
        },
        {
            "text": "one of the top one of the questions was a Schindler's List question and when you're amongst a bunch of was it what was it was it like super easy in Schindler's List is the only one in color that was the question that was the question and I guessed and I got it right thank God yeah I got it I was like I have to guess because I can't let is it multiple choice yeah well you can pick multiple choice for less for Less uh points um and I picked multiple choice the entire time cuz I'm like it's easier um but it's one of those movies that I really at this point really as a film buff really probably should see yeah and I've just got find is great in it I've just gotten to a point where I'm like maybe I just won't watch it maybe I'm just like it's G too far and I just got to keep going just go through it you never want to watch it again when I was at uh at IGN the reason I watched it was I when I was an intern I had to do get a bunch of clips for the hundred best movie moments so a lot of that I",
            "start": 4876.96
        },
        {
            "text": "it you never want to watch it again when I was at uh at IGN the reason I watched it was I when I was an intern I had to do get a bunch of clips for the hundred best movie moments so a lot of that I end up just going one of the capture bays and just watching movies and uh Schindler's List was one of them where I'm like you know what I'm gonna do this I'm gonna do everyone's talked about this for so long and I'm like it's a damn good movie it's one of those ones I never want to watch it again sure but it was it's a damn good movie it affects you it does guess under your skin another one that I just recently started watching no love Harry and the Hendersons is a movie I don't watch anymore because when I was a child it made me cry so badly I'm like I can't do this anymore yeah I can't like **** you John Lithgow yep um but speaking of John Lithgow I just started watching Buckaroo Banzai for the first time I have never seen this film before what is it Peter Murphy too uh Peter Weller is the",
            "start": 4914.16
        },
        {
            "text": "main character it's got Jeff Goldblum in it um John Lithgow is I guess a bad guy and just a host of other people that you're like I Christopher Lloyd's in it as a bad guy it is a very strange movie but it is that you've I've heard of forever and it's finally on Amazon Prime and I'm like I'll give this a watch the main character is a neurosurgeon SL Samurai SL rock and roll SL scientist like inventor I not seen and he goes It's called Buckaroo Banzai the Eighth Dimension that so he basically opens up by accident a portal to the Eighth Dimension it's a little bit of a convoluted plot I'm not quite sure I grasp the intricacies of it um but it's one of those movies that a lot of people like it's a cult classic and a lot of people love and I'm like I should watch this film so",
            "start": 4950.72
        },
        {
            "text": "plot I'm not quite sure I grasp the intricacies of it um but it's one of those movies that a lot of people like it's a cult classic and a lot of people love and I'm like I should watch this film so I want to know if there's anything you guys are ashamed to admit you haven't seen or if you can think of anything off the top your heads and does this include books video games whatever you want if the movies are too too narrow-minded no no I was just wondering I was just wondering what I I feel like for me the list would be so long I would even know where to begin I I lack so much classic movie knowledge MH like I've seen a whole bunch of garbage sure but I I haven't seen a lot of Daddy's Home Daddy's Home haven't seen Daddy's Home oh you should watch it it's this great movie with Will Ferrell and Mark Wahlberg the the plot is genius Mark Wahlberg is The Stepfather I have missed out on Dirty Grandpa as well that one you did **** up on watch classic I mean for me I I think like Blade Runner",
            "start": 4997.68
        },
        {
            "text": "and Mark Wahlberg the the plot is genius Mark Wahlberg is The Stepfather I have missed out on Dirty Grandpa as well that one you did **** up on watch classic I mean for me I I think like Blade Runner really yeah and that's you people's usually reaction to but I remember the time where I was like I'm going to watch Blade Runner I'm like which one do I watch and like there was like well this version that version blah D some of them aren't available here some of them I don't This is complicated I don't care enough you need someone to be like watch the director with the thumbs where you see the thumbs you got to see go through his eyes yeah you got to see good scene the thumb all the Star Trek movies besides the reboot the new ones really I've never seen any Star Trek none of the classic ones no Wrath of Khan, no, the the the whale what was it called The Voyage Home, no, but the the name of the ship Enterprise no whale there's something Kobayashi Maru, Kobayashi Maru is one of Kirk's friends yeah there you go",
            "start": 5036.72
        },
        {
            "text": "Wrath of Khan, no, the the the whale what was it called The Voyage Home, no, but the the name of the ship Enterprise no whale there's something Kobayashi Maru, Kobayashi Maru is one of Kirk's friends yeah there you go that's uh wait which one was Khan was that Wrath of Khan what's that I could have sworn that no the one with the whale no that's I only know it from pop culture references, The Voyage Home yeah where they're stuck in the 80s in San Francisco yeah here they're here genius and they filmed it's hilarious they filmed in my neighborhood uh that I Live Now the Marina and they like when he's in the car sequence where he's driving on the car with her yeah they're actually in a parking lot nice I didn't realize that I was like where the **** is that and then I looked and I was like oh they're in a parking lot that's hilarious I'm going to Google classic movies classic I mean there's tons get you're get like have you ever seen Casablanca have you ever seen Gone With the Wind things like that the thing is Film School",
            "start": 5076.32
        },
        {
            "text": "I'm going to Google classic movies classic I mean there's tons get you're get like have you ever seen Casablanca have you ever seen Gone With the Wind things like that the thing is Film School gives you all those yeah you saw those like freebies uh James Bond movies really yeah that's right you've only seen The World Is Not Enough The World Is Not Enough seen I've never seen any of the newer ones with I've seen all the Roger Moore love those the Daniel Craig ones they're good it's a bit of a roller coaster but overall they're they're good movies I would say it's just at this point I feel like there's been more bad than good yeah well it's been there's been four and I think two of them I think are generally upheld as good and two of them are not so good unfortunately it's all the uh the first and the third I think everyone loves the second and fourth the second was not so much well that was during the writer's strike you can't really can't fault him for that it looks like we're heading into",
            "start": 5124.48
        },
        {
            "text": "and the third I think everyone loves the second and fourth the second was not so much well that was during the Writers' Strike you can't really can't fault him for that it looks like we're heading into another I have not seen The Godfather really any of the three so I think been built up so much that I'm like o what what if I watch and it sucks It Won't Suck it's good but yeah I hear I just um I'm afraid guys I I think that one will hold up because that was one that I I hadn't seen it was overhyped for me and then I saw it in in college and I was like it is it's spectacular especially two one one to two one and two are amazing three you don't necessarily need three you don't need three you can just watch one and I I mean Godfather's on probably every top five list and I haven't seen it so I think it's time and time I think you've inspired me good you go go back to your hotel tonight thank you for not shaming hours oh no no hasn't seen Blade hey **** you man the biggest offender of all",
            "start": 5166.28
        },
        {
            "text": "think it's time and time I think you've inspired me good you go go back to your hotel tonight thank you for not shaming hours oh no no hasn't seen Blade hey **** you man the biggest offender of all time was up until about 6 months ago I hadn't seen Pulp Fiction oh yeah and that that's a shame because I am a huge Tarantino fan and I am a huge Samuel L. Jackson fan at least based off the work that I've seen of them it's the best it's the best I think of his movies I see my thing is I think the movie was ruined for me because of all the pop culture references that I like I've seen the movie over time through memes and references and say what again **** so that as I watched it I was kind of like just waiting for the other parts to come up instead of enjoying the movie for what it was and uh out the **** I'm like I think that uh Django Unchained is probably my still number one movie of all time I love that wow what when we said this though what jumped to your mind what's what what movie",
            "start": 5210.56
        },
        {
            "text": "the **** I'm like I think that uh Django Unchained is probably my still number one movie of all time I love that wow what when we said this though what jumped to your mind what's what what movie I've never seen any of the Saw movies yeah I love that that's where you go you should change that watch at least one through three they're fantastic at least one through three here's the thing well cuz that's the thing just watch there there's seven and they're making a new one this year but you don't need to watch all those well the thing is I would say like it's if you like horror um and you like twists nah like my I'm a big twist guy I but I don't like horror I especially I'm not a torture porn guy that's the problem Saw Saw is a torture porn thing you need to get through that for for the story and the cool **** to be worth it and it's a push it definitely is cuz I'm not a big torture porn guy either but I I would bear it to see the twist that they would do cuz Saw one through three they",
            "start": 5258.32
        },
        {
            "text": "and the cool **** to be worth it and it's a push it definitely is cuz I'm not a big torture porn guy either but I I would bear it to see the twist that they would do cuz Saw one through three they did such a good job and then it kind of gets a little eh very eh yeah but I stuck through it I'm running through my head I'm trying it's hard to run this a weird question of what don't you know what haven't you watched you guys seen Citizen Kane who hasn't seen seen Citizen Kane yeah a couple times we had to watch that one in film school that was another one of those like I don't think I'm going to like this and then you fall with it you're like wow it was pretty it was an amazing achievement Kubrick movies 2001 never saw 2001 that's good yeah 2001 me end slow for me who knows what the hell happens there well they left out some stuff in the book apparently um but I don't read the book 2001 is one of another one of those that I I had seen when I was a kid I think barely a little bit and I",
            "start": 5302.56
        },
        {
            "text": "there well they left out some stuff in the book apparently um but I don't read the book 2001 is one of another one of those that I I had seen when I was a kid I think barely a little bit and I think the reason why I realized that I probably had didn't watch the whole thing was when I came back and watched it an adult I was like wow this movie is so **** slow so slow I I can imagine myself seeing going space it's supposed to be it was space but the first shot you see is like the slow moving ship yep and then the next one you see is the girl the woman walking and then the pen floating and it's like wow that's really cool they could do that but by today's standard you're like yeah there are no lightsabers beautiful I mean it's one of those it's one of those films you're like we're just going to sit on this beautiful image for way too long you know and then we're going to go to this next beautiful image and sit for way too long and it's amazing but I recently watched that and it's",
            "start": 5343.32
        },
        {
            "text": "going to sit on this beautiful image for way too long you know and then we're going to go to this next beautiful image and sit for way too long and it's amazing but I recently watched that and it's another one of those I'm ashamed to say that I'm like I fell asleep I had to come back the next night and finish it oh wow I'm an old man like an old man old man back so I got to rest that every once in a while I watched Singing in the Rain for the first time a couple months ago that's fantastic I was high off La La Land really yeah and I'm like all right and then uh it was in theaters for like a one night only thing and I'm like all right cool let's go events and uh yeah exactly and we watched it and I'm like all right it was good it was definitely good uh I haven't seen um West Side Story oh that's the thing I've heard so many references but I've never actually seen it that's great uh Apocalypse Now oh really that was another one I watched at IGN when I shouldn't have been watching him",
            "start": 5384.72
        },
        {
            "text": "that's the thing I've heard so many references but I've never actually seen it that's great uh Apocalypse Now oh really that was another one I watched at IGN when I shouldn't have been watching him that one's great it's farfetched just because he's so fat hard to believe you know Brando a man living out in the middle of the Jungle kind of like wow man really wasn't that a thing they got a fight about when he yeah showed up fat and they're all oh **** well I guess we'll shoot you in the dark mostly we you we'll push you in a basically a tent around you and just shoot you in the dark you can talk about the colors the Colors oh my God the colors the colors movies I guess this is a hard question to answer I've never seen A Clockwork Orange really I read the book yeah but it seemed like it was going to be too heavy for me no the movie is very heavy but it's awesome it's very beautifully done yeah I bet and it's very uh the casting of it I've seen a lot of shots from it fun fact um the",
            "start": 5425.24
        },
        {
            "text": "was going to be too heavy for me no the movie is very heavy but it's awesome it's very beautifully done yeah I bet and it's very uh the casting of it I've seen a lot of shots from it fun fact um the guy David Prowse the guy that played Darth Vader as one of the bad guys isn't with the in the actually he's one of the rival gangs not not the he's not bad guy he's like the protector of the one guy right no he's r i oh maybe maybe I'm getting this wrong I feel like he was one of the guys that was like raping the girl and they come in and beat the **** out of him no but that's he's a rival gang member right was he no I think his gang he becomes the cop afterwards oh maybe **** out of him and that's why you probably thought it was rival maybe maybe okay okay okay yeah that's a movie I haven't seen in a long time that's a great one that's a great caper film I've never seen a Rocky movie whoa wud a whole Rocky movie I've seen all the Rocky movies in bits and pieces but I've never from start",
            "start": 5468.24
        },
        {
            "text": "seen in a long time that's a great one that's a great caper film I've never seen a Rocky movie whoa wud a whole Rocky movie I've seen all the Rocky movies in bits and pieces but I've never from start to finish watch watch Rocky Rocky is **** amazing Rocky is one of the best movies ever made and a lot of people especially a lot of young people who's you're only touched on Rocky is either like the later years Rocky or Creed by the way shout out to Creed Creed was great uh but Rocky was a real accomplishment and you get it's unfortunate because you think back to Rocky and you think fighting Ivan Drago fighting Mr. T, Clubber Lang you know these movies that became very formulaic and like Rocky's going to get he's oh he's losing and then he has to train hard and come back to it but the first one was not about that the first Rocky is very much just about him proving to himself that he's not a piece of **** that's all he wanted to do and it's very very it's a really",
            "start": 5507.04
        },
        {
            "text": "to it but the first one was not about that the first Rocky is very much just about him proving to himself that he's not a piece of **** that's all he wanted to do and it's very very it's a really well-made movie yeah I mean I've watched most of it I just never watched it in you go back and sit I bet you'd probably be like oh wait I don't remember any of this cuz I I bet you think Rocky III or IV or V you might not remember interesting Rocky Rocky III is rad because of the whole Thunderlips and you know and everything yeah that's it's parody but it's fun oh for sure yeah but you know you get a good sense of how much bigger that man was than Sylvester Stallone interesting yeah Blade Runner is probably the number one that a lot of people ought to have seen But Haven SE see for I mean I watch Blade Runner and to me it still looks how are you excited about the sequel no neither of you are n i it was just so well done that I just leave it alone stop doing this it's kind of like",
            "start": 5552.24
        },
        {
            "text": "I mean I watch Blade Runner and to me it still looks how are you excited about the sequel no neither of you are n i it was just so well done that I just leave it alone stop doing this it's kind of like Covenant you know or with Alien cuz it's like for me I mean Alien is still one of the creepiest like atmospheric horror movies I've ever seen and mostly it's just because of Ash you know and it's like Ian Holm Jam magazine you know and it's like that is **** terrify where does your brain go you're like I'm GNA kill this person by making her choke on this I'm going just Ram this down well he's a robot so I mean that's the thing that it's so dark and weird that I don't know that I don't know because it seems like they're just remaking it right well yeah I think they're sort of it's they're kind of looking at like what they did with Prometheus and going let's see I didn't see Prometheus do this again the Alien's weird though I feel like that's a franchise that they just just keep going with",
            "start": 5593.6
        },
        {
            "text": "of looking at like what they did with Prometheus and going let's see I didn't see Prometheus do this again the Alien's weird though I feel like that's a franchise that they just just keep going with just because it's a name well the they they made two that were great and three was **** and then I think the four oh dude come on I mean they say **** in that movie probably more times than every other movie combined well they're mostly British swear to God and I think mostly British people there the guys in the prison or something like that yeah prison yeah they're going to swear a lot I guess yeah that one had potential that had the potential to be something really the fourth one was like the rebirth one Ripley oh God yeah Jesus I feel like they're bringing a little bit more yeah yeah no garbage sorry uh The Thing I never saw The Thing oh yeah I like horror too oh yeah that's one good that one's really good how de let me ask you I'll a lot of Carpenter movies and I'll tell you you the",
            "start": 5637.68
        },
        {
            "text": "no garbage sorry uh The Thing I never saw The Thing oh yeah I like horror too oh yeah that's one good that one's really good how de let me ask you I'll a lot of Carpenter movies and I'll tell you you The Thing obviously not Escape From New York yeah but as a kid I've never seen Snake Plissken is that the Snake Plissken movie you never seen it yeah it's one of the Snake Plissken movies they decided to remake it and call it Escape from L.A. that was garbage which was the exact same movie literally it is a sequel but it's pretty much the exact same Movie Surf got surfing right he surfs that Peter Fonda is there was like Surf Ninjas and 3 Ninjas exactly like that there was maybe a turtle in there that was radioactive I don't know um Big Trouble in Little China yeah oh sorry overrated but again that's the movie I saw as a kid totally holds up just never was like I watched it recently cuz I was talking **** about it too cuz I was like I don't know I was talking **** I watched it recently",
            "start": 5679.16
        },
        {
            "text": "that's the movie I saw as a kid totally holds up just never was like I watched it recently cuz I was talking **** about it too cuz I was like I don't know I was talking **** I watched it recently it's still totally holds it's one of those I need to go back I remember being a kid watching I think I liked it I liked the scary part where he explodes or whatever like that was like something that was like those three guys like the three elements guys are just awesome yeah you seen Chinatown Chinatown with Jack Nicholson yeah it's great I read the script for it I don't know I don't even know what that is I haven't seen of mov yeah it seems like another like kind of murder mystery it's based on a book I believe and I I want to say it's a Raymond Chandler book but I don't think might have won an Oscar classic whatever look give those anybody suicide is it a Chandler based on a I don't know I looked that up Hey Kevin can you look up what Chinatown was based off of was it a Deep Throat",
            "start": 5727.76
        },
        {
            "text": "won an Oscar classic whatever look give those anybody suicide is it a Chandler based on a I don't know I looked that up Hey Kevin can you look up what Chinatown was based off of was it a Deep Throat situation like there was a lot of there was something like that Deep Throat like the porn or Deep Throat the uh no saying Chinatown was based on a Deep Throat situation yeah of an informant no I think you might be thinking about All the President's Men which was based on the Watergate scandal which is another movie that if you haven't seen I hadn't seen and I watched it I'm like **** this is really good I saw that one I saw that not a dead space in this topic I did not realize got a think I I I seen 12 Angry Men speaking of oh so good yeah I should see that I unfortunately saw 12 Monkeys oh yeah I did not like 12 Monkeys fan MH although I've never seen Brazil I I tried watching Brazil that's another one of those movies that I'm like I can't get through tried it too but did you see um Time",
            "start": 5763.28
        },
        {
            "text": "yeah I did not like 12 Monkeys fan MH although I've never seen Brazil I I tried watching Brazil that's another one of those movies that I'm like I can't get through tried it too but did you see um Time Bandits oh yeah grew up on that that movie scared the **** out of me when I was kid of the map in uh really in our our exercise room yeah oh wow that movie I was I have a t-shirt but you can't see it it's just garbage but it's supposed to be the map I love that movie that's one of my very favorite films of that is a uh that's one of those movies that I'm like because of the ending specifically I was like I never want to watch this movie ever again end it's so British it's so British it's like yeah you know that's it the firefighter was Sean Connery and he's like there you are and he's he's gone yeah bye your house just burned down see parents are God like it was C sh yeah is it a kid yeah yeah I don't know if the movies about you the movie is **** crazy I can't remember exactly what",
            "start": 5809.4
        },
        {
            "text": "gone yeah bye your house just burned down see parents are God like it was C sh yeah is it a kid yeah yeah I don't know if the movies about you the movie is **** crazy I can't remember exactly what happens but it's basically like what happens to put him on the Journey of being with these Bandits he lives at a time gate he lives like one of these little spots there's all these little spots throughout the Universe and throughout time that are like little portals where doors open up periodically and you can travel between them so Kevin's this kid he lives in in his room and then one night there's like this rattling and stuff and this horse just smashes through the closet and then goes riding down this wall behind his bed but it's not a wall it's like a forest and so he goes riding down this forest and then he turns and like everything's fine everything's back to normal then like the next night like these guys show up like he hears these noise and like these guys kind of come out of the",
            "start": 5853.28
        },
        {
            "text": "forest and then he turns and like everything's fine everything's back to normal then like the next night like these guys show up like he hears these noise and like these guys kind of come out of the closet and it's these six dwarves and they're like these robbers who've basically stolen this map from the Supreme Being to in order to do robberies in order to like Rob all these different famous people throughout time and then Evil who's Satan or whatever you want to say is after it too because it gives him ultimate power so he can rework the universe in his own image fantastic the 80s yeah **** love the I love the '90s was The Indian in the Cupboard and The Pagemaster it's just like all it has to do is like little things come to live but it's always friendly and cool yeah this was crazy and it's British too so it's incredibly funny yeah I like yeah maybe I'm looking through this the wrong way but I feel like the 80s like like we've gotten more censored as we go with like what is acceptable",
            "start": 5896.08
        },
        {
            "text": "British too so it's incredibly funny yeah I like yeah maybe I'm looking through this the wrong way but I feel like the 80s like like we've gotten more censored as we go with like what is acceptable for to put in front of kids because the '80s I feel like there was a whole subsect of quote unquote fantasy movies that could have been kids but were **** terrifying like The Dark Crystal was terrifying was **** Terrifying is the scariest thing I've ever SE beautiful best Skeksis ever that's another one I think a lot of people have heard of but have never seen which is I have to go back and watch Labyrinth Labyrinth is like to watch Jennifer Connelly and then uh there was also like I always got that one I always wanted it to be Labyrinth but it was always Legend starring Tom Cruise remember that one I swear I love that movie that held up great movie Tim Curry as you know dark or evil whatever it was I mean I didn't know it was him forever because he's like so made up he's got these ginormous horns",
            "start": 5945.92
        },
        {
            "text": "swear I love that movie that held up great movie Tim Curry as you know dark or evil whatever it was I mean I didn't know it was him forever because he's like so made up he's got these ginormous horns he's crazy and then shout out to I think it was Mia Sara who played Sloane in Ferris Bueller's Day Off she was in the only other movie seen her I to watch leg wait no you saw you saw Timecop I bet she's in that oh she is in Timecop right you haven't seen Timecop that's the most egregious really yeah it's probably one of if not the last great Jean-Claude Van Damme movies come on it it after Timecop it kind of started going down Van Damme movie **** slap you across the face if I I'm glad I'm away I'm never being invited back have you bring you pizza have you not seen Bloodsport no I've have not oh Christ Universal Soldier that actually might have been the last great Jean-Claude Van Damme movie I never saw Universal Soldier really amazing Dolph Lundgren I think this all of these movies are things I've",
            "start": 5986.76
        },
        {
            "text": "Universal Soldier that actually might have been the last great Jean-Claude Van Damme movie I never saw Universal Soldier really amazing Dolph Lundgren I think this all of these movies are things I've never seen oh wow so I'm going to go down you guys are aware slap him too well I've slapped him he does a splits real good every movie with Van Damme splits he did Bloodsport, he kicks three guys amazing Based on a True Story by the way Frank Dux was the real charact real person who went to when to say Hong Kong to fight in this underground like like bare knuckle fight called Bloodsport it was like people would bet on it and **** so he was an American Soldier they decided to go do that being chased by the Army because they want him back cuz he's Frank Dux and he justes the splits on chairs for no reason and it's great then he did Kickboxer and you were like that's pretty much the same movie it's just a guy that has to fight in another underground like kickboxing tournament but we don't give a",
            "start": 6037.44
        },
        {
            "text": "reason and it's great then he did Kickboxer and you were like that's pretty much the same movie it's just a guy that has to fight in another underground like kickboxing tournament but we don't give a **** because we want more Jean-Claude Van Damme then he did like a couple other weird ones in there like Lionheart Street Fighter because that's the the one I saw Street Fighter uh came in right around the time that Raul Julia was like I just need to get paid and then unfortunately passed away right after that thus leaving the Legacy the last film in his legacy being Street Fighter uh which is unfortunate cuz that movie was based on the game oh yeah oh man and then eventually they made Street Fighter: The Legend of Chun-Li well they cast Chun-Li, Smallville what up yeah they decided they were like we're going to cast Street Fighter and we've got this um this character in Street Fighter that everyone's familiar with who is the most American like of of Americans and let's what better person to play that role",
            "start": 6082.04
        },
        {
            "text": "cast Street Fighter and we've got this um this character in Street Fighter that everyone's familiar with who is the most American like of of Americans and let's what better person to play that role than Jean-Claude Van Damme, Belgian Muscles from the muscles from and remember he like he does that famous thing where he like flexes and it's just the American flag and you're like I buy it doesn't matter you're right yeah and then somewhere he did Timecop and Timecop was genius he's someone invented a a time machine and of course people that runs a muck and so they have to have a police force that police time and and again what better person to get for that than Jean-Claude Van Damme naturally and Jean-Claude Van Damme is is a Timecop so if anyone breaks the laws of time he has to go it's the first movie I ever saw with self-driving cars and I was like how farfetched is that never going to happen it also brought in the uh science incredibly scientifically accurate uh Theory same matter can't occupy the same space",
            "start": 6121.56
        },
        {
            "text": "self-driving cars and I was like how farfetched is that never going to happen it also brought in the uh science incredibly scientifically accurate uh Theory same matter can't occupy the same space at the same time meaning if I go back in time and see myself and I touch myself it will like destroy reality yep Nick touching himself usually results in real some sort of explosion time interdimensional like Shenanigans yeah oh yeah don't touch yourself oh man Jean-Claude Van Damme was a moment no matter what time don't touch yourself here's my final one and I think it closed out the topic well Starship Troopers really Starship Troopers it not a great movie no but it it has something about it that makes you want to think that it is for it was it was okay yeah I remember wasn't the big deal that there was co-ed showers I mean because this is like junior high or whatever but like there was there's some not Kathy Ireland was it Kathy Ireland big deal din oh no um uh who is Charlie Sheen's x-wife Denise",
            "start": 6164.88
        },
        {
            "text": "was co-ed showers I mean because this is like junior high or whatever but like there was there's some not Kathy Ireland was it Kathy Ireland big deal din oh no um uh who is Charlie Sheen's x-wife Denise Richards she is she's also in The World Is Not Enough yeah there you go but Teri Hatcher was in The World Is Not Enough right The World Is Not Enough right her name is Dr. Christmas Jones that's the only thing I remember that movie I thought Christmas only came once a year yeah that was the big punch line at the end uh no I want to say Teri Hatcher was not in The World Is Not Enough I think she was in Tomorrow Never Dies very remember when GoldenEye came out on N64 and then Tomorrow Never Dies came out on PlayStation everyone made fun of the PlayStation fans that was a thing well everyone made fun of the two movies as well because GoldenEye was awesome actually was pretty good movie not terrible back then nobody knew there was no internet then nope there's no way to there was no way to **** about nothing really",
            "start": 6214.44
        },
        {
            "text": "well because GoldenEye was awesome actually was pretty good movie not terrible back then nobody knew there was no internet then nope there's no way to there was no way to **** about nothing really complain if you didn't know ladies and gentlemen this has been The GameOverGreggy Show each and every week four sometimes five best friends gather on this table each bring a random topic discussion for your amusement if you like that head over to patreon.com/KindaFunny where you can toss us a few bucks and get each and every episode early along with a bunch of exclusive goodies and perks if you have no bus to toss no big deal you can head over to youtube.com/KindaFunny where post the entire show topic by topic day by day until it goes up his one big MP3 in video the following Friday Gavin sir Ming yes thank you so much for coming by thank you thank you thanks for having us Gavin where can people keep up with your booths and toys and escapades uh I'm on Twitter Gavin Hammon I'm on",
            "start": 6259.96
        },
        {
            "text": "Sir Ming yes thank you so much for coming by thank you thank you thanks for having us Gavin where can people keep up with your booths and toys and escapades uh I'm on Twitter Gavin Hammon I'm on Instagram Gavin Hammon what was the Instagram for toys again too because I want to go action figure soundproof fiction sound all right and then Ming uh yeah Twitter Instagram Ming Chen 37 m i n g c h n37 watch Comic Book Men every Sunday night after The Walking Dead and uh yeah come by see the secret stash right yeah come by the secret stash right back New Jersey only an hour south of New York City and uh we'll be there me Mike, Walt not Bryan he doesn't really work there so come on by screw Bryan, screw we'll see Kinda Funny Live 3 what's that Kinda Funny Live 3 oh yeah Kinda Funny Live 3 June 3rd right here back great until next time it's been our pleasure to serve you what's up P.O. Boxter click here to subscribe to the channel click here to support us on Patreon click here to see",
            "start": 6297.24
        },
        {
            "text": "3 June 3rd right here back great until next time it's been our pleasure to serve you what's up P.O. Boxter click here to subscribe to the channel click here to support us on Patreon click here to see a playlist of cool videos and click here for random Kevin fun times what's he going to put there nobody knows won't be nudity it's illegal on YouTube or we do it",
            "start": 6341.88
        }
    ]
}