{
    "id": 2657,
    "video_id": "F412wOtNkwk",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "PC Games You Should Play - Kinda Funny Gamescast Ep. 121 (Pt. 4)",
    "description": "Alfredo recommends a few PC games for us to play.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1495715400,
    "duration": 985,
    "transcript_chunks": [
        {
            "text": "All right, it's time for the final topic of the show, as always brought to you by you. You can go to cy.com Gamescast topic and leave your topic just like these beautiful people did. Jose O says, hey, what games on PC should you be playing? Oh, Counter-Strike, Battlegrounds, Diablo I, Blackwake, World of Warcraft, Deceit, probably Hearthstone too if you're in the card game. So I'm not, but I know a lot of people are. Yeah, I mean, Rainbow, Cluster Truck. What's this play? Well, what's this game you and Doug have been playing a lot lately? PlayerUnknown's Battlegrounds. So give us, give us that. Is the hotness right now. It's coming to consoles eventually, but right now it's in Early Access on it seems to be like all the rage. I don't know anything about it. I mean, it's essentially if you ever played H1Z1, the same premise where it's like imagine Hunger Games the game, right? Where you, you, you parachute down, you start looking for a gun frantically, right? You're starting to loot up and you're trying to",
            "start": 0.13
        },
        {
            "text": "same premise where it's like imagine Hunger Games the game, right? Where you, you, you parachute down, you start looking for a gun frantically, right? You're starting to loot up and you're trying to kill everybody and be the last one. Um, so like I said, it's if you played H1Z1, it's just like H1Z1. Is it like a Sci-Fi shooter? Is it like a modern third person, first person? Uh, both. Yeah, crazy. Who? Yeah, so you can like go into third person and like kind of, kind of like use that third person camera to like kind of see around, you know, the side of a tree and corner and stuff like that. And then you can go first person to, you know, ADS and scope down and whatnot. Huh. Okay. Or you go over the shoulder. They give you a variety of things. It's, it's a fun game. It's, it's a slower, more tactical version of H1Z1. So what other differences are there? Cause we had, I guess, Will Smith, not the Will Smith, a different Will Smith on the show a couple, a couple weeks ago and he was pitching us on the game and I'm, I'm",
            "start": 60.12
        },
        {
            "text": "H1Z1. So what other differences are there? Cause we had, I guess, Will Smith, not the Will Smith, a different Will Smith on the show a couple, a couple weeks ago and he was pitching us on the game and I'm, I'm super sold. We had a great time with H1Z1. We did a Let's Play one time where it was me, Kevin and Greg just playing. And have you played H1Z1? Yeah, so it's freaking awesome where it's just the how many players is uh, that's not really my type of 150 drop in for H1Z1 and 100 drop in for Battlegrounds. 100. Okay, cool. So you get the 100 people, they're all on this little island, they parachute in and then as the match goes on, there's like the areas you're allowed to be in get smaller. H1Z1 toxic gas and Battlegrounds, it's more of like an electrical field and it just closes everyone in to get like, gets the circle gets tinier and tinier until you have nothing but just a 10 by 10 to like fight and the goal is just to survive. Yeah, the last person. Team based or F you can do solo, team, uh, dubs and you can do",
            "start": 105.08
        },
        {
            "text": "gets tinier and tinier until you have nothing but just a 10 by 10 to like fight and the goal is just to survive. Yeah, the last person. Team based or F you can do solo, team, uh, dubs and you can do squads of four. Yeah, four. Look at the girlfriend. Yeah, four. And then there's, there's leaderboards, ranking systems. The thing about this, I know a lot of people have putting a lot of time in H1Z1. It looks promising, like way more promising than H1Z1. So H1Z1, yeah, H1Z1 like came out and did, they did their thing and it was riddled with issues and then people were like, we, we need this fixed. We need like region lock or ping lock and we need less desync. And then they're like, we have C like crates for you guys. It's like, what the heck are you guys doing, man? Fix the game. Not to say that Battlegrounds doesn't have those similar issues, but every week there's a patch also. Yeah, it's Early Access, right? It's Early Access too. Yeah, not excuse, but fair enough. I mean, that's a pretty big excuse. Still in development.",
            "start": 150.4
        },
        {
            "text": "have those similar issues, but every week there's a patch also. Yeah, it's Early Access, right? It's Early Access too. Yeah, not excuse, but fair enough. I mean, that's a pretty big excuse. Still in development. Well, regardless of Early Access, it's very difficult to have a big ass map with a hundred people in it all doing different things and have them like sync up one to one and not have there be desync or or all all those kind of issues. It seems like this game is a lot bigger than H1Z1. Like H1Z1 people loved, but this is everywhere now. It's because it's, it's, it's more competitive when it comes down to it because H1Z1, you know, you run around, you jump out a car like moving speed and whatnot and and but this game's a lot more about getting into a gunfight with each other and the hit detection is better and hit detection is like everything when the shooting game. Like you can point-blank shotgun someone in H1Z1 and it won't do anything to them. And like the number of clips that you'll have that that",
            "start": 201.24
        },
        {
            "text": "hit detection is like everything when the shooting game. Like you can point-blank shotgun someone in H1Z1 and it won't do anything to them. And like the number of clips that you'll have that that you just shoot the guy in the face and they don't die. Granted, you get this too in Battlegrounds, but it's on a smaller scale and you just have more confidence in the development team when they say, hey, these are the issues and these are what we're going to fix. Oh, by the way, we're having weekly updates on like the game, adding new things and trying to fix these issues. And you just have confidence and like, okay, I believe that this is going to end up being a really good finished as polished product further down the line. Awesome. So besides playing on Battlegrounds, what other games have you been playing on the PC? Uh, I've been playing this game called Deceit, which is a heck hilarious game. So you take six people. Okay, you wake up. I think one of the surroundings is a hospital, right? Everyone wakes up.",
            "start": 245.32
        },
        {
            "text": "on the PC. Uh, I've been playing this game called Deceit, which is a heck hilarious game. So you take six people. Okay, you wake up. I think one of the surroundings is a hospital, right? Everyone wakes up. It's a first person, you know, you shoot, whatnot. Everyone wakes up. Two of those six people are infected. The four people are trying to get out alive. Nobody knows who's the infected person. Does the infected person know they're infected? The infected people know and they know who the other infected person is. So they try to work together to to to screw over everybody. So here's the thing. Yes, so here's the thing, right? So you have people like trying to turn power switches on, right? To get to the next level and whatnot. And I'm like, Sean goes down a corridor, right? Turns on the power switch. I'm sitting, I'm, I'm infected. I'm sitting here like, is anybody looking? Shut that heck right down, right? Say Sean catches me and Sean's like, Alfredo tried to cut down the power. He's infected. That's where I go, no, no, no.",
            "start": 287.92
        },
        {
            "text": "infected. I'm sitting here like, is anybody looking? Shut that heck right down, right? Say Sean catches me and Sean's like, Alfredo tried to cut down the power. He's infected. That's where I go, no, no, no. I saw Sean do it. Sean did it right in front of me. He's the infected guy. And then you, there's this whole like, you try to like deceive each other and whatnot. And the cool thing is like, there's blood bags for the infected. Yeah, because they're creatures, right? So I'll get, I'll get into it, but there's blood bags everywhere, right? And the goal is to try as an infected to try and drink these blood bags to make yourself more powerful because every minute like when you're running around, the lights are on, you can see everyone's name on top of their head. Every minute the lights shut out and you can't see who's who. You can't see the names on top of people's like faces or whatnot. That's where the infected turn into the creatures at at their will, at their free will and try to like solo people out and like",
            "start": 338.64
        },
        {
            "text": "who. You can't see the names on top of people's like faces or whatnot. That's where the infected turn into the creatures at at their will, at their free will and try to like solo people out and like kill them in a corner somewhere. Huh. So this sounds heck awesome. Sounds like a party game. It's, it's an awesome game because it's, it's really funny because there's all these kinds of different devices and tools. Like there's one, there's one device that's a scanner where you literally, you pick it up and you scan it. It tells you the person's infected or not. But it's one of those things. If Sean's, if I'm infected, Sean's not. He scans me. He says I'm infected. What means why can't I just heck and say Sean's infected? Or I've had an opportunity where say both of us are infected and you grab the scanner and you scan me and you're like, oh yeah, Alfredo's cool. But we're both infected. We're working together. You know what I'm saying? I scan cool. It's all, it's all about just lying to everybody else. Sounds really cool.",
            "start": 382.28
        },
        {
            "text": "scan me and you're like, oh yeah, Alfredo's cool. But we're both infected. We're working together. You know what I'm saying? I scan cool. It's all, it's all about just lying to everybody else. Sounds really cool. That sounds great. We got to do a Let's Play of that. It's a fun time. Okay, what is there any other games that you'd recommend? Uh, Blackwake has also been a fun game. Blackwake. Yes. It's a pirate game. So you get a crew of, I don't know, maybe like 15 people and you run a ship, right? You and 15 are your closest friends. Yeah, you guys run a ship and you essentially have to take care of like everything you have to do with a ship, right? Loading the cannons and whatnot. And you have other people with their ships and you, you essentially fight each other and you just try and sink each other. And I've been doing stuff like just ramming into the other ship and so you guys have to like duke it out like with guns and muskets and whatnot. So it, it becomes this whole like, nah, I'm not about like Naval Warfare, but",
            "start": 422.76
        },
        {
            "text": "stuff like just ramming into the other ship and so you guys have to like duke it out like with guns and muskets and whatnot. So it, it becomes this whole like, nah, I'm not about like Naval Warfare, but but when I was sitting there and you have people like when you're the captain, you're like, you're the one that's choosing where people go and you're like, all right, load up the, load up the right side and you're like shooting cannons at the other people and you're like, heck, I'm going to ram into these guys. We're just going to duke it out. Like it makes pretty, yeah, yeah, no, just like Sea of Thieves. Um, but it's not right now Star Trek bridge. So yeah, yeah, it makes for, it makes for a good time. So cool. Yeah, I think between those three games there, that's a lot of to get into. Sounds fun. Um, let's see. Here we go. Marcus Pat has an interesting question. Is Alfredo's shooter skills declining with age? Oh, I was actually hoping you'd",
            "start": 465.2
        },
        {
            "text": "three games there, that's a lot of to get into. Sounds fun. Um, let's see. Here we go. Marcus Pat has an interesting question. Is Alfredo's shooter skills declining with age? Oh, I was actually hoping you'd read this one. Everyone's shooting skills decline with age. Yes, 100%. Like I'll put this up there for both Sean and I. I, I fully believe that Sean and like our skill levels, like the way we play games, our situation awareness, our flex scales are really high up there. So yes, they are deteriorating over time, but they're so far up there at to begin with that I, I still am able to be like the a part of the top 1% Rainbow Six. Um, Sean does very well in Counter-Strike, whatnot. Um, but it is declining. Like it is. I've been more and more. I have to rely less on my reflexes. What? It's, it's his rank. It's my rank. It's his rank. I'm a DMG. Nice. Yeah. Uh, yeah, I mean, you see this in Esports a lot, right? Like it's not even just shooters, it's all competitive games. But like StarCraft, like you're too old. Yeah, like a lot of a",
            "start": 509.6
        },
        {
            "text": "rank. I'm a DMG. Nice. Yeah. Uh, yeah, I mean, you see this in Esports a lot, right? Like it's not even just shooters, it's all competitive games. But like StarCraft, like you're too old. Yeah, like a lot of a lot of pro players hit their prime at like 18 to around there. And then after that, it starts to go away because you're getting older. Your neural pathways are fully formed. You're not forming new ones. You're not learning new things as fast as you used to and your reflex skills start to go away. And so it becomes more about playing smarter than the people who have better. But do people will just make a shot that I can't make? I can't believe you're 38. Yeah, you guys, you guys know, dude, I'm 37. Speak for yourself. You're like a month away. Get out of here. I am. But still, uh, but I mean, it's fixed for all you definitely rely more on um, setting up the situation in your favor as opposed to like, I'm just going to run in there and heck shoot everyone's face off. Yeah, better strategy, better positioning.",
            "start": 566.08
        },
        {
            "text": "you definitely rely more on um, setting up the situation in your favor as opposed to like, I'm just going to run in there and heck shoot everyone's face off. Yeah, better strategy, better positioning, better tactics. I feel like you hit a point that you get old enough though that you just revert back to that. At least Nick Scarpino has taught me that. Revert back to what? Infantile status when you realize you can't, no matter what amount of effort or strategy or tactics you stuck, you suck anyway. So then you can just go, I realized that a long time ago, so I don't even need to worry about whatever. Dude, you're supposedly, I've never played Halo against you, but you're, you're, you employ special tactics. Mastered the flag. I am the flag capturer. No, I've never, I've said this before. I've never seen someone in a heck CTF Blood Gulch match sit in the one bush in the back of your base for I heck you not a half hour waiting for the right moment to strike. I'll tell you what though, I'll tell you what, like",
            "start": 621.72
        },
        {
            "text": "heck CTF Blood Gulch match sit in the one bush in the back of your base for I heck you not a half hour waiting for the right moment to strike. I'll tell you what though, I'll tell you what, like out of nowhere the flag is gone and you're like, what the heck is going on? And then you just see Tim heck like crouching along the side clips and heck. It's like, yeah, man, I missed that. Master strategies from this man. Although if you shoot at him once, he'll just stand there because he knows he, he can't shoot for heck jig again for a while. Like the heck Hamburglar. You know what I mean? Sometimes he'll get away with it and sometimes, but he's always after. I'm always after that, that burger. Um, this one comes from Throw S. Oh, my man. No question. I was just hoping you can give him a quick shout out from his Twitch community and let him know that we're proud of him and can't wait to see the things he's working on. Yes, working on big things. So I'm excited for Mr. I love those guys. Hell yeah. Um,",
            "start": 665.04
        },
        {
            "text": "out from his Twitch community and let him know that we're proud of him and can't wait to see the things he's working on. Yes, working on big things. So I'm excited for Mr. I love those guys. Hell yeah. Um, let's see. I'm trying to find one for good old Sean Finnegan over here. It's funny too, cause they love everybody. Like occasionally Sean will walk in. Everyone's like, Shark Finnegan. Yeah, I'll pop in every once in a while. Uh, Sean, this is from Mr. Braw 96. Hey, and I, I guess this applies to you as well. Why don't you play Call of Duty Zombies? It's very up both of your alleys. Uh, like I said, also, how many toon can you eat? What the heck is not a big sweets guy? Yeah, all right. That's I'm not, not too big in the sweets. It's like a, it's like a chocolate candy. Yeah, it's like that chocolate little like weird ass thing. Not big caramel in there. And thank God I'm not. Kevin says he can take down this. Could you take it down? Uh, if necessary. All right, sorry. Going back to it. Call of Duty Zombies. Yeah, I mean, I've never been a big",
            "start": 710.96
        },
        {
            "text": "big caramel in there. And thank God I'm not. Kevin says he can take down this. Could you take it down? Uh, if necessary. All right, sorry. Going back to it. Call of Duty Zombies. Yeah, I mean, I've never been a big Zombies guy. Even back in, did they have Zombies in Modern Warfare? I don't even know if they did. Not two, right? Wasn't it World at War that introduced? Totally speak. I don't know. I'm pretty sure it was World at War. You know who we need? We need Bobby Amos up. Yeah. Uh, I, I loved Modern Warfare 1 and I loved Modern Warfare, but then like in games after that, it got kind of away from what I felt made Call of Duty super special as a competitive shooter. It kind of became more about the gaminess of it. Like kill streaks and care packages and loadouts and prestiges. And it was more, it got away from the gun skill and became more of a cool like a twitch shooter. And I just, this is not really my type of game. And so I had to sit inside, wait for bombs to stop dropping. I was like, what? Where's the gun? Where people",
            "start": 755.24
        },
        {
            "text": "and became more of a cool like a twitch shooter. And I just, this is not really my type of game. And so I had to sit inside, wait for bombs to stop dropping. I was like, what? Where's the gun? Where people were like, look at, I dropped 35 kills. And I was like, that helicopter killed 15 of them. Is that your skill too? The reason, the reason why I don't play Zombies and I respect the heck out of Zombies because when it comes to like doing Zombies and stuff, they have some really cool Easter eggs and heck to work towards that the community tries to like piece together. Um, I just got really fatigued really quick with the whole like horde mode because I played a heck ton of horde mode with like Gears and then I did the whole Fireteam for Halo. And after that, I was like, I, yeah, Firefight. And after that, I was like, I'm good on anything like horde mode coming after me. That's the thing is like, I guess my, and again, I never really got into Call of Duty Zombies enough to really know the ins and outs of it, but",
            "start": 805.08
        },
        {
            "text": "like, I'm good on anything like horde mode coming after me. That's the thing is like, I guess my, and again, I never really got into Call of Duty Zombies enough to really know the ins and outs of it, but it just didn't seem like on its surface level, like it was as strategy oriented as I hoped it would be from coming. A lot of strategy. No, but you know how like in Gears, like horde mode is about, you're not just killing things and trying to survive waves, but you're also building up your base tactically and employing a strategy with your team. Well, with Zombies, you're, you're trying to use your economy wisely. Yes. So are you doing that heck? Like are you building? You're building traps and like upgrading your base? Yeah, there's traps and upgrades. And then after that, like it's like, okay, round one, like I should knife because I won't use my pistol, whatnot. Trust me, I totally get you're coming from because when I was first introducing the Zombies, I was just like, this just, you know, like kill Zombies. Yeah.",
            "start": 848.72
        },
        {
            "text": "should knife because I won't use my pistol, whatnot. Trust me, I totally get you're coming from because when I was first introducing the Zombies, I was just like, this just, you know, like kill Zombies. Yeah, like a good Firefight, good horde mode is kind of like a Tower Defense. Yeah, like no, for sure. You have to employ good Tower Defense. Trust me, it's definitely about that. But I get what you're saying. Like you and I stepped away like way before that was like a super. I just never, I have limited time nowadays. I just, I very, it's rare I get into something new if it's already been established. Ladies and gentlemen, this has been Kinda Funny Gamescast. Thank you very much for joining us. This was a damn good episode. A bunch different. We normally have. I'd say informative. You guys definitely know your heck. I appreciate that. Thank you for joining me on this illustrious show. Thank you for having. Find Sean 'The Shark' Finnegan Chom Chom over at Shot by Finnegan on Twitter. Yes, or on IGN where you can find him",
            "start": 887.56
        },
        {
            "text": "IGN where you can find him doing his daily content and all that stuff. Yeah, check out Fireteam Chat if you're a Destiny fan. I'm always happy to talk, talk to people about Halo. So hit me up. And then Alfredo Plays over there at Alfredo Plays everywhere. Yep. And then Twitch.tv/AlfredoPlays where I just stream every, every single day. Yeah, you watch them wreck heck. Yeah, shoot things in the face. Till next time. I love you. Later. Hey, what's up? Hope you enjoyed that. If you did, you can click right there to subscribe to Kinda Funny Games. If you want some stuff that's not video game related, bam, click over there. Subscribe to Kinda Funny. If you want to support us monetarily, I'd appreciate it. Click right there and click right here for some fun Kevin nudes. Maybe no.",
            "start": 931.64
        }
    ]
}