{
    "id": 2623,
    "video_id": "HuF8AkUUEz4",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Call of Duty WWII - Kinda Funny Gamescast Ep. 119 (Pt. 3)",
    "description": "Is it time to go back to World War 2 in video games?\n\nThanks to Shari’s Berries for sponsoring this episode. Go to Berries.com and use promo code KFGames\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1494419400,
    "duration": 1086,
    "transcript_chunks": [
        {
            "text": "that's right I'm crazy enough to wear these on camera what will I do June 3rd at Kinda Funny Live 3? There's only one way to find out KindaFunny.com/KFL3, get your tickets, come here, hang out with me. So Mother's Day is like this weekend if you're listening on Patreon, it's next weekend, but if you're not, dude, it's this weekend. Luckily this episode of the Gamescast is brought to you by Shari's Berries. Now if you don't know Shari's Berries, some of our friends, namely Andy and Kevin, they uh, they Shari's Berries really well. You should have seen Kevin take these things down. I'd say it was impressive, but it was more scary. But you can, you know, gift these to your mother and see what she does with them. All you got to do is go to Berries.com and use the code KFGAMES. That's Berries.com and use the code KFGAMES. Okay, now let me tell you a little bit about these things, right? They're strawberries dipped in chocolate. You might think, oh, I've had that before. Not like this. Shari, I don't know what",
            "start": 0.16
        },
        {
            "text": "code KFGAMES. Okay, now let me tell you a little bit about these things, right? They're strawberries dipped in chocolate. You might think, oh, I've had that before. Not like this. Shari, I don't know what her special technique is, but she is nailing it. There's a special deal now starting in just $19.99. You can get huge freshly dipped strawberries plus shipping. And right now you can double the berries for just $10 more. And guess what, Kevin, guess what? What? The deal is even sweeter 'cause it's Mother's Day. For just $10 more, you double the berries and you get free cake truffles too. I don't know what those are, but does that excite you as much as it excites me? It really does. I'm sure that it does. I again, you know what? You've won me over. Now I'm just impressed. You guys did good. You did good. Everybody go Berries.com, Berries.com, use the code KFGAMES. You just got to click on that mic and you can make that things happen. This amazing deal won't last long and Mother's Day is coming soon. Don't disappoint",
            "start": 46.52
        },
        {
            "text": "Berries.com, use the code KFGAMES. You just got to click on that mic and you can make that things happen. This amazing deal won't last long and Mother's Day is coming soon. Don't disappoint her this year like you do every other year. Topic three of the show is Call of Duty: WWII officially announced. Now we got release dates coming, we got all that stuff. Sledgehammer going back to World War II. First time in a very long time. Sledgehammer did Advanced Warfare, no, uh, it would have been, oh, ****, here we go. They go to the bathroom, talk about this. Well, I want to sort it out without using my computer because I hate that. You, you know how fact checking ruins podcasts. It's scientific fact. So hold on, we can do this, we can do this, we can do this. So Black Ops is Infinity Ward, correct? No, that's Treyarch. ****. Black Ops is Treyarch 'cause it has all the gadgets and has Zombies. Exactly. And so we go back one, uh, Call of Duty: Infinite Warfare was just put out by Infinity Ward, which is confusing.",
            "start": 95.08
        },
        {
            "text": "Treyarch. ****. Black Ops is Treyarch 'cause it has all the gadgets and has Zombies. Exactly. And so we go back one, uh, Call of Duty: Infinite Warfare was just put out by Infinity Ward, which is confusing. Yeah. And then was the, was Advanced, so Sledgehammer was Ghosts? Oh, Ghosts was okay at the PlayStation 4 launch. That was the first next-gen one. Yeah. And Advanced Warfare was the year after Ghosts. So that has to be, um, it has, no, was it Advanced Warfare? That does sound right. It was, it was Ghost Recon. But, but it was CoD. Is that, and that's the one with the, they put him, they put him in the, yeah, yeah, suits. Yeah, yeah, yeah. And Troy Baker is one of the guys, right? Kevin Spacey year. That's the Kevin Spacey year. Okay. No, Kevin Spacey's, yeah, because Kevin Spacey was the year after Ghosts. Ghosts. I like this game. I like this game. We're trying to remember everything. Yeah, this is, this is the old man. Wait a second, do you, you're from, you're from Missouri. Do you know Bob Hoskins? Yeah. Um, oh, Mario. Yeah, yeah, yeah. Down at the",
            "start": 153.52
        },
        {
            "text": "game. We're trying to remember everything. Yeah, this is, this is the old man. Wait a second, do you, you're from, you're from Missouri. Do you know Bob Hoskins? Yeah. Um, oh, Mario. Yeah, yeah, yeah. Down at the pizza. Yeah, used to see him down the pizza. Of course, of course. Got his, his, his sister June. She, that her daughter got married, Jimmy. Um, Advanced Warfare doesn't sound right though. Was it? I thought it was Advanced Warfare. Oh, I don't want to look at it yet. Advanced Warfare. Advanced Warfare. Warfighter was Ghost Recon: Advanced Warfighter. There you go. There you go. Ghost Recon. Yeah. So we got it back to Ghosts. Was Sledgehammer Last Call of Duty: Ghosts? Was okay. Yeah. Brandon Routh in it. Brandon Routh in it. Superman himself. Yeah. But like, like the thing about Ghosts was it was the first one on the new platform. They got to bring all their stuff up to speed. It's not great, but it, it was, it was service. Sure. What gets me excited about this one is the same thing that tricks me about every Call of Duty is they",
            "start": 193.96
        },
        {
            "text": "they got to bring all their stuff up to speed. It's not great, but it, it was, it was service. Sure. What gets me excited about this one is the same thing that tricks me about every Call of Duty is they talk about having a focus on single player story and they're going to really double down it and make it a big deal. And when they start talking about this one, WWII, I don't like calling World War II because they don't have, they don't spell it out. You know, it's WWII. WWII means World War I. It's, it's a commonly, when I see it, right? But I like the, I like what they're talking about here of like, we're not, what, what always turned me off about Call or not Call of Duty games, World War II games, was like just jumping around. You mean WWII games? I ****, just like you. Why do we invite you on? Jumping around all the different things, playing them all the same time. But you know what I mean? Like never having a narrative to it. So the idea of what they're talking about with World War II here, WWII, Call of Duty: WWII,",
            "start": 235.2
        },
        {
            "text": "the different things, playing them all the same time. But you know what I mean? Like never having a narrative to it. So the idea of what they're talking about with World War II here, WWII, Call of Duty: WWII, officially trademark Activision, is the fact that, hey, this isn't going to take you all around the battlefields. It's going to focus on these very specific things and this very specific narrative that only spans, I think, two years or whatever. We're going to stick with these characters, which starts getting me excited for like a Band of Brothers vibe. And they again have great actors involved with it. So it's like, okay, maybe, maybe this is going to be the what I want. And I think I'm not alone in that. That's what it seemed like Battlefield did last year with Battlefield 1. That's my thing is I liked, I loved Battlefield 1's uh, single player last year, the little vignette stories. I thought that that was such a great way to do the single player, especially because World War I was never really tackled in a",
            "start": 275.24
        },
        {
            "text": "Battlefield 1's uh, single player last year, the little vignette stories. I thought that that was such a great way to do the single player, especially because World War I was never really tackled in a game, especially not on that level. Something like they, we didn't even learn about in history class really. Like, like, hey, there was this big war, a bunch of people died, then there was a Spanish flu, and oh, by the way, Nazis. Yeah, to the next one. But yeah, I know the, I, I loved last year's, and not all of the vignettes were as good as the rest of them. But with this is, I, I don't know, watching the story trailer, I mean, I've never been a Call of Duty guy, but watching the Infinite Warfare story trailers, I'm like, this seems interesting a bit. The Advanced Warfare with Kevin Spacey, I'm like, all right, cool, this, this, the narrative sounds interesting. This one, I'm like, this really just seems as generic as you can possibly get. So, but is it generic if it's going to actually achieve what",
            "start": 310.08
        },
        {
            "text": "all right, cool, this, this, the narrative sounds interesting. This one, I'm like, this really just seems as generic as you can possibly get. So, but is it generic if it's going to actually achieve what we want? Hey, here is the Band of Brothers. This crew you're with, you're going to get to know them, you're going to get to care about them. Couple of them are going to die, of course. We're going to take you from point A to point B and tell you a story. Yeah, that's the one where 'cause like my whole thing with like the Kevin Spacey year, I was like, oh, ****, I'm on such a House of Cards roll right now. I was really looking forward to Nine Lives or whatever cat, that cat movie wasn't announced yet. But I was like, I like Kevin Spacey in this moment. I'm excited for this. And then I looked at reviews and I was like, I didn't really deliver. He's in it for like 10 minutes, whatever. Not going to do it. Now, same thing can be said is that Infinite Warfare, oh, hey, we got a couple guys from Naughty Dog. We're doing these",
            "start": 349.28
        },
        {
            "text": "I didn't really deliver. He's in it for like 10 minutes, whatever. Not going to do it. Now, same thing can be said is that Infinite Warfare, oh, hey, we got a couple guys from Naughty Dog. We're doing these different things. Like the story is written. I hosted the panel. I like, I'm interested in this. And I played through the first five or six hours and it was like, all right, cool. But it's a little too sci-fi techy right now for me. And I because I, and it's also way too, all right, Admiral blah, blah, blah, blah. And I'm just, I can't get down with that kind of military storytelling usually. But then I, what I liked about Band of Brothers so much watching it was like the interpersonal connection. And it wasn't about like, you know, even though there's moment like, you always salute, salute the rank, not the person on that jazz. Like, but so like my problem, my, my worry is a little more meta, right? Like, and at the start of 2016, if you had said, hey, let's go back to World War II and shoot some Nazis in a multiplayer shooter,",
            "start": 387.32
        },
        {
            "text": "jazz like, but so like my problem, my, my worry is a little more meta, right? Like, and at the start of 2016, if you had said, hey, let's go back to World War II and shoot some Nazis in a multiplayer shooter again, I'd be like, yes, I have a lot of good memories of shooting Nazis in multiplayer shooters. In 2017, not to get too real, but like, I kind of don't want to expose myself to Nazis in a video game. And the real, we got enough Nazis here. We're full. Like the Nazi store, I, Nazi store. I hope like, I don't know that it's a good idea to empower the, the Neo-Nazi movement that's happening in America with the ability to play Nazis in a video game right now. Like, I know it's a dumb thing to say. It sounds like a dumb thing to say. But like, it's bad enough when somebody's calling me a **** on the internet. I don't want them, oh, sorry, is that, no, you're, I'm saying that he's just being, I, I just, uh, I just, uh, you know, I don't, I don't want to, I don't want to have, you know, actual Neo-Nazis yelling at me playing Nazis",
            "start": 421.84
        },
        {
            "text": "want them, oh, sorry, is that, no, you're, I'm saying that he's just being, I, I just, uh, I just, uh, you know, I don't, I don't want to, I don't want to have, you know, actual Neo-Nazis yelling at me playing Nazis in a video game. No, and, and like, I, I don't know, I, I hope do something ridiculous like only let you play the American side in multiplayer and everybody just, the other side just is skinned Nazi. Yeah, I think that would be really fun. Well, the ridiculous thing now is the whole, the, the tweets going around like Jason Schreier's tweet where, do you know what I'm talking about? Uh, Jason Schreier from, um, Kotaku tweeted out this, uh, image of a tweet conversation, uh, about people bitching about like, oh, why are you including, uh, women in the, the game because that's not factually accurate to World War II or whatever. And then he screenshot the same guy that was bitching about it, uh, saying, oh, Zombies confirmed for so funny. All right, we **** up. I got bad news everybody. It was Infinity Ward did Ghosts and Sledgehammer did",
            "start": 465.6
        },
        {
            "text": "and then he screenshot the same guy that was bitching about it, uh, saying, oh, Zombies confirmed for so funny. All right, we **** up. I got bad news everybody. It was Infinity Ward did Ghosts and Sledgehammer did Advanced Warfare. Exactly, exactly. Yeah, Advanced Warfare was, I thought that, I remember thinking Sledgehammer came out of the, out of the gate with a big one, with a good one. Yeah, the last one I played was, uh, Modern Warfare 1. Oh, really? Yeah, so it was a long, I'd played a couple, but I mean, like, like beat actually. Okay, okay, okay. Yeah, I jump in for every one, but I feel like I inevitably, it's just like, all right, this is, I'm just going to go do something else. Well, I love like Modern Warfare 1 was, is amazing. It's still good. Like it, they re-released it last year. I played it again. I was like, this is a great game. The second one, they got kind of cartoony, right? And, and it felt real. Like the old school World War II Call of Duties felt real. And then Modern Warfare felt real. And they killed the, they killed the",
            "start": 506.84
        },
        {
            "text": "the second one, they got kind of cartoony, right? And, and it felt real. Like the old school World War II Call of Duties felt real. And then Modern Warfare felt real. And they killed the, they killed the character. You're like, ho, ****, killed you. It's amazing. And then, then they kind of, then, then next thing I know, I'm fighting in like a Pizza Hut and a Burger King in suburban America. And it's World War III. And that was maybe not the realism I was looking for at the time. So I don't know. I mean, if this is like, it went from kind of not celebrating, but honoring the, the World War II to making this arcade shooter. And, and like that was where I kind of fell off. Sure. At the very least, it's a smart move to differentiate all the studios because that is the problem as we sit here like, wait, well, who is doing what and blah. If you can boil it down to, well, Black Ops is Treyarch, gadgets and all this stuff. Infinity Ward is moving on, whatever they're going to move on how they want. If they want to keep going",
            "start": 549.36
        },
        {
            "text": "what and blah. If you can boil it down to, well, Black Ops is Treyarch, gadgets and all this stuff. Infinity Ward is moving on, whatever they're going to move on how they want. If they want to keep going to the future. And if you go, Sledgehammer's is World War II or past wars or something like that. There's a vibe to it that it keeps a little bit more easy to. And I love the idea of the, I love the Band of Brothers like taking, taking like following through two or three games this group of same group of people as they spend four years fighting in Europe. And that's why I think there's something to be said if they deliver on that. And that was the whole thing where I think Advanced Warfare, again, it was okay. They're bringing me with Kevin Spacey, but it's not really, he's not really into it the way it is. If you're going to be able to deliver characters that I care about and go with it, great. And that's what, you know, again, it's always interesting when you talk, talked to the Call of Duty studios, you know, calling",
            "start": 587.68
        },
        {
            "text": "going to be able to deliver characters that I care about and go with it, great. And that's what, you know, again, it's always interesting when you talk, talked to the Call of Duty studios, you know, calling, you start harping on Raven, how much we loved Raven or whatever, Singularity. And then for me, X-Men Origins: Wolverine, the gameplay of it. And then Activision gets them as like just, you know, do Call of Duty cleanup, that stuff, keep making. And it's the same thing when you talk about, uh, you know, Glen and Condrey, who were over there making Sledgehammer Games a thing where that these are the guys who did Dead Space. Like they love games. They're not out for a bro shooter. And that's why it's the hope every time of like, you have these studios that you hope are pulling it together in a way that we're going to deliver on the promise of what these games could be. And 'cause like it is that thing of like, you know, who loves World War II movie, Saving Private Ryan, shows like Band of Brothers. There's an audience there",
            "start": 622.6
        },
        {
            "text": "on the promise of what these games could be. And 'cause like it is that thing of like, you know, who loves World War II movie, Saving Private Ryan, shows like Band of Brothers. There's an audience there for them if they can get that into the game medium and make you care about it that way. Well, and, and when they first rolled out like Medal of Honor was a thing, the some of those guys split off and started Infinity Ward and launched the first Call of Duty. I went to, I, they, they brought it to my off, I was at Maximum PC then. They brought it to the office and they, they came in with the game guys and they also had a guy who's like 70 years old and was a World War II expert. And he was like a, the, you know, they, they always, they, they still do that. They still bring an expert around. But like, it felt like they were there for the right reasons rather than making a thing that kind of like, it celebrated violence in a good way instead of in a, in a ne, I don't know, I'm not, I'm not, um, explaining myself well, but it",
            "start": 658.88
        },
        {
            "text": "there for the right reasons rather than making a thing that kind of like, it celebrated violence in a good way instead of in a, in a ne, I don't know, I'm not, I'm not, um, explaining myself well, but it, it, this feels a little bit different and at least what I've seen so far. So I don't know, we'll see. Going back to what you're talking about with the, the movies and stuff, it's just to me, it seems like such a, an old era. Like that we don't necessarily need to go back to it because we, I associate the PlayStation 2 and Xbox Original Xbox generation with World War II so much. It's like, I don't think that these games can elicit the memories I have of those games. Like, I'm sure that if I were to go back now, they wouldn't. But I remember them being so epic and it just like the Normandy Beach is just like that is one of those iconic video game moments. I think specifically I'm talking about Medal of Honor, but as I remember, my friend was so, Curan was so into Call of Duty 1 on PC. And like, I remember seeing him play it. I",
            "start": 692.32
        },
        {
            "text": "iconic video game moments. I think specifically I'm talking about Medal of Honor, but as I remember, my friend was so, Curan was so into Call of Duty 1 on PC. And like, I remember seeing him play it. I was just like, all right. And then all of a sudden, like a couple years pass and Call of Duty 2 was a launch title on, uh, Xbox 360, which is the only reason we even really gave it a shot because there wasn't much going on besides King Kong, uh, easy. And, and then eventually three and whatever. But once it got to Modern Warfare, that's when everything changed. And it was like, that was the, all right, New Era. We're moving past World War II. Everyone's done this too much. Like, it's totally overdone. There's nothing new to be seen there. And I feel like now it's, it is just kind of scraping the bottom of the barrel of like, just doing it again. Don't get me wrong on, I was with you when it was, oh, rumored is next Call of Duty going back. Like, do we need to? But I think the argument can be made that enough times past that",
            "start": 736.12
        },
        {
            "text": "just doing it again. Don't get me wrong on, I was with you when it was, oh, rumored is next Call of Duty going back. Like, do we need to? But I think the argument can be made that enough times past that it has been a, it has been generations. And it is the fact of when I think back to, you know, Po was just in town for my wedding, right? My best friend growing up. And he made the comment, he was like, I made some comment about being frozen by indecision. And he goes, shoot the **** gun. And that is a call back to high school when I was playing Medal of Honor sniping. And like my guys were both getting attacked by separate people. And rather than just choose one, I just sat in the middle. I'm like, I don't know what to do. And he like, shoot the **** gun. And but I reviewed Medal of Honor 1, Greg. Sorry, bro. I wasn't in my basement probably in high school, maybe in great, in junior high still. Uh, but it was that thing of like, I remember the gameplay of it in those like, you know, water cool moments or whatever",
            "start": 776.16
        },
        {
            "text": "wasn't in my basement probably in high school, maybe in great, in junior high still. Uh, but it was that thing of like, I remember the gameplay of it in those like, you know, water cool moments or whatever you want to talk about. And I remember the first, I, I guess I don't remember, but I remember what was the, uh, there the one where we got to do Pearl Harbor, where it was like Medal of Honor: Pacific Assault. Exactly. And I remember that being a big deal. And like, okay, cool. I'm not excited for nothing about the trailer excites me about like the Battle of the Bulge. Like they're talking about. I don't care about the Battle. I care about, oh, you brought in that actor I like and you want to tell a cool story. And if they're actually doing that, and of course, the problem is always that it's Activision. It's like, well, how did they give him enough time? Did they rush him through everything? Did they actually care? Blah, blah. Like that's what I'd want. And hopefully that gets away from where, and I know these are all",
            "start": 814.36
        },
        {
            "text": "well, how did they give him enough time? Did they rush him through everything? Did they actually care? Blah, blah. Like that's what I'd want. And hopefully that gets away from where, and I know these are all Greg Miller problems, not the world's problems. But like Infinite Warfare was of like, oh, cool, I like these people. I like the people creating the game. Oh, we're up in space and this is weird. And it's all Admiral this and Admiral that and jackals. And I'm like, okay. Like, well, I, I mean, for me, playing, playing like Medal of Honor, first PC Medal of Honor, playing Call of Duty 1. Like those gave me an appreciation. Those made me go out and seek out more. I, I went and read about World War II because of those books. I read Band of Brothers. I read a bunch of, um, uh, uh, um, oh, God, what's the guy's name who wrote all those comic books? Yeah, comic books. George railroad Martin. No, no, um, the, the, the, the oral history guy who wrote Band of Brothers and who wrote, um, uh, the Lewis and Clark book, Undaunted Courage, by Stephen Ambrose.",
            "start": 848.8
        },
        {
            "text": "comic books. Yeah, comic books. George railroad Martin. No, no, um, the, the, the, the oral history guy who wrote Band of Brothers and who wrote, um, uh, the Lewis and Clark book, Undaunted Courage, by Stephen Ambrose. God, we need to call him more than ever. Yeah. So, um, anyway, the, uh, you go out and you get those, you get those stories. And like, you can read the book, but then getting off of a barge in Stalingrad and having, being chained to another an NPC and them handing you an extra clip and handing the NPC a gun and you having to wait until that person that you're tied to is shot to grab the gun from them because they only have one gun for every other soldier. And this was what they thought was a good way to handle this. Like gives you a appreciate, like it, it puts you in a situation where you can experience something that would otherwise be impossible to experience, which is the neat thing about going back and visiting historical locations again. Sure, sure. I don't know. Yeah, no, I mean, I, they couldn't sell me on this",
            "start": 886.12
        },
        {
            "text": "that would otherwise be impossible to experience, which is the neat thing about going back and visiting historical locations again. Sure, sure. I don't know. Yeah, no, I mean, I, they couldn't sell me on this if they tried. But I'm not the audience. But now, but for Battlefield 1, were you excited for that when you heard and saw that originally? See, my thing was for Battlefield 1, from the moment I saw the story trailer, I'm like, I'm in. Oh, wow. Okay. Like there's that story trailer. I was like, they edited that trailer so well that I'm like, I'm sold by the hype of this. Like, this looks interesting. It looks super varied in a way that looks like it'll make sense. And going into once the, once I started playing it and once I started hearing what everyone else was saying where they're like, oh, these vignettes are not that long. You can get through them. They each tell their own self-contained story. I'm like, oh, you are speaking to me. Like, this sounds great. I wish there were more of those rather than just like",
            "start": 931.36
        },
        {
            "text": "not that long. You can get through them. They each tell their own self-contained story. I'm like, oh, you are speaking to me. Like, this sounds great. I wish there were more of those rather than just like one per kind of area. When I was playing Battlefield 1. Oh, yeah, yeah. It like, if I was just playing that for single player, it was a little short. See, it's enough for me. I don't know. I, I just like, I'm not the multiplayer shooter guy. So it's like, for me, I, I'm more of a Battlefront guy. I like a little more top level. I love Star Wars. So it's like, this is just cool and fun. And the idea that Battlefront 2 is going to have single player. And like, I am so sold based on this trailer. That's more up my alley. But yeah, Battlefield 1 did win me over in a way that watching the World War II trailer, I was like, oh, like it not only won, didn't win me over, it, I'm like, no, definitely not. Push you away. Okay, interesting, interesting. What if I tell you there's pigeons in it? Pigeons. Oh, the pigeons were a big sell for me.",
            "start": 967.16
        },
        {
            "text": "like it not only won didn't win me over it I'm like no definitely not push you away okay interesting interesting what if I tell you there's pigeons in it pigeons oh the pigeons were a big sell for me for that M Pig I mean this is World War II so they must have had like well you were around at the time right they they had the cell phones that like connected to the giant thing you crank the thing and then you have a backpack and the guy gets shot in the backpack and your radio doesn't work anymore you just designed a level you just designed a level I can't stop making games I don't even make games I just make shows about games are you guys hyped though World War II you think you're going to play it I mean I'll play it but I'm not I I play Everything though I'm that I'm that I'm a bad person I feel like it'll be the same thing for me as usual oh Call of Duty here I'll pop it in and I'll start the campaign and I'm hoping though it'll have it it'll have a hook that grabs me and keeps me in",
            "start": 1006.48
        },
        {
            "text": "I feel like it'll be the same thing for me as usual oh Call of Duty here I'll pop it in and I'll start the campaign and I'm hoping though it'll have it it'll have a hook that grabs me and keeps me in you know what I really want I just want a game that's headquarters headquarters mode on that little tiny map with the crates from Modern Warfare 1 that's I just want to play that that's all the Call of Duty I need I should load that up like every two or three years get like 16 people in there have a grenade spam call a day and just call it Call of Duty Pentagon yeah oh man hopefully you enjoyed that episode of Kinda Funny Gamescast if you did click there to subscribe to Kinda Funny Games click there to subscribe to Kinda Funny for noname content click here to support us on Patreon and this part's not sponsored Shari's Berries get out there",
            "start": 1042.04
        }
    ]
}