{
    "id": 2668,
    "video_id": "Hvfq0SXI4Ds",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Andy Cortez"
    ],
    "title": "Friday the 13th: The Game Is Fun  - Kinda Funny Plays",
    "description": "Greg and Andy spend the morning murdering campers at Crystal Lake.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1496096187,
    "duration": 5840,
    "transcript_chunks": [
        {
            "text": "So what's up everybody? Welcome to Let's Play here on Friday the 13th. Uh, Andy, this is Friday the 13th the video game. Okay, uh, I've been playing it all weekend. Is it a great game? No. Is it a really fun game? **** yes, so much fun. I'm gonna mute everybody, which is not, well, if I was playing all by myself, you know, mute Fluffy Muff Pie. I don't like Fluffy Muff Pie. You don't like that PSN name? Problem that one? No talk about, uh, should let us change our names, huh? Fluff, that's the one you want to get to. That's the one you want to get to. Yeah, yeah, he's stupid. What, what did Fluffy Muffpie do to you? Why are you so against him? Um, I don't know, just the overall vibe. Yeah, so dark. Can't you probably need to mute them quickly cuz what if there are some like racial or homophobic slurs? That's on them. I can't muted on the mics guys. They're muted on the mics like my ears so you can't hear them. The kids can't hear them. Oh good, perfect. Then I'm going to leave them unmuted because this is a big thing for Friday",
            "start": 0.04
        },
        {
            "text": "on the mics guys. They're muted on the mics like my ears so you can't hear them. The kids can't hear them. Oh good, perfect. Then I'm going to leave them unmuted because this is a big thing for Friday the 13th. Oh, I was all right. Never mind. Talk to me, Kevin. Explain what you're doing. I was going to bring it up once the game started cuz in the game starting it'll be fine. So here's the thing about Friday the 13th, Andy. Is it a great game? No. Am I in love with this game? Yes, it is a fun game. Okay, servers are totally **** as you've seen already in this morning of trying to play this thing. Uh, you jump out there, you see I'm getting kicked from games. Yesterday I played a few matches. None of my, uh, progress carried over. None of it got saved locally. Now granted the team that worked on Friday 13th independent small. I I'm sure they expect they expected to be hit. They expect to be this big of a hit. They expect this many people want to play it. Who knows? But Friday the 13th gameplay-wise has a lot of great ****",
            "start": 44.76
        },
        {
            "text": "small. I I'm sure they expect they expected to be hit. They expect to be this big of a hit. They expect this many people want to play it. Who knows? But Friday the 13th gameplay-wise has a lot of great **** ideas. Okay, janky? Yes. Glitchy? Yes. Did I have a match where I hid in a tent from Jason, saw him murder my friends, he ran away, I came out of the tent and then had an out of body experience where suddenly I was in the sky and I saw my counselor over here wandering around and then the more I moved her the higher she got until finally she was just floating in the sky. Yes, that did happen. Oh, it did happen and then I won that match by just waiting out Jason. Probably not part of the game, right? Not part of the game. That is not a perk. You take screenshots of that. Sorry, did you take screenshots of that? I took videos and stuff. The screenshot if you're not in the moment you're not going to really understand and even with me flying away I don't think that really worked out for anybody, you know what I mean?",
            "start": 88.08
        },
        {
            "text": "videos and stuff. The screenshot if you're not in the moment you're not going to really understand and even with me flying away I don't think that really worked out for anybody, you know what I mean? I don't understand how they can't hear them. How how Kevin isn't getting audio on them. Like are you getting audio at all in the game? No, not he muted the audio of the game. Yeah, and so what's going to happen? So what I love about Friday 13th is it's proc chat so we have to be close to each other to hear each other outside a Lobby **** like this. So once we start here now I won't hear any of these **** unless I pick up a radio and they pick up radio and I'm Jason. Oh, you're the bad boy now. Kevin, do you know how to bring up the brightness dark? What they did to us. Jason kill them. I don't are you guys getting a weird static on audio? Yeah, what's up with that? I don't know man. First off, what's up with that? What's up with that? You know what I mean? How weird that's unfortunate picture size no expert",
            "start": 129.8
        },
        {
            "text": "getting a weird static on audio? Yeah, what's up with that? I don't know man. First off, what's up with that? What's up with that? You know what I mean? How weird that's unfortunate picture size no expert settings here we go bring up that brightness bring up that brightness will you we're going to we're going to **** up all these like settings that just I think Kevin spend any time on I'm no offense to Kevin I don't I've spent a lot of time on the way too dark for an that's perfect thank you yeah now I can see it looks really bright up here for us like I can see good I'm glad I want I want it to look the TV underneath the big TV looks great I was playing conference monitor looks fine okay sense is available now what that'll do is highlight the conso for me now the map there I can you see the radio wheel over there the map I can use to Jump Ahead blindly I won't know where people are I like the UI I'm telling you look I'm telling you the game not perfect it's going to it's a rough launch too",
            "start": 170.6
        },
        {
            "text": "wheel over there the map I can use to Jump Ahead blindly I won't know where people are I like the UI I'm telling you look I'm telling you the game not perfect it's going to it's a rough launch too but there's something here that I really enjoy playing with okay and now of course you like him to you like look at him running I yeah well obviously it's Dead by Daylight ripoff you know what I mean not ripoff but same idea I could have SW that this game was announced oh don't got a gun they got the flare gun flare gun yeah pointed me you idiot oh she's so dead dude **** her up Juke her a brush it off don't let them oh man oh man I really like really fast dude that's at a Metal Gear sense you know what I mean you know how it is don't tap Don't Tap The Revolver he's right to me so now right now I'm a de power Jason you know what I'm saying oh you're not of your full strength exactly I'm going to get some I'm going to get some Shenanigans I I pick up the throwing knives don't use them often",
            "start": 210.84
        },
        {
            "text": "I'm a de power Jason you know what I'm saying oh you're not of your full strength exactly I'm going to get some I'm going to get some Shenanigans I I pick up the throwing knives don't use them often okay you know what I mean just not not not my not my shtick so you're like a you're like a rookie Jason who's coming up in the world too slow not a rookie Jason I mean by any here's what I'm going to do here I'm going I'm going to lay a trap right here for this **** and then I'm going to come over here go the vitamin SE he's here like the they know that I'm here this **** is trying to jump out like an idiot no drop another Jas another trap right there now if I if I time this out right oh there hey fluffy you she's come save me see this idiot that I can hear them talking well duh what does the Trap do is it like a bear trap it's a bear trap so now what I'm going to do Andy this is what I call the flush out I'm going to start hacking at the door they're going to run out the the window",
            "start": 259.32
        },
        {
            "text": "the Trap do is it like a bear trap it's a bear trap so now what I'm going to do Andy this is what I call the flush out I'm going to start hacking at the door they're going to run out the the window and you got the Trap waiting for them com in here see now they're panicking they see him running around they're panicking not even going for the windows yet these kids are n hope see me do that airor or there we go got one oh they got me too they trapped you they me too but they're both the drink thing ah don't worry about it I'll get some later I'm dead get it byebye peoples there you go that's how that's how you do it Dy that's how you do it look at this this is how you do with an environmental kill it's painful it's painful oh no oh you go Greg I got to do it man I got to do it you didn't have to I do I do I'm Jason this is from mother don't you they killed me and her now I see now this obviously indicates sound so that's where I know sounds are coming from they can lay down traps like",
            "start": 301.44
        },
        {
            "text": "to I do I do I'm Jason this is from mother don't you they killed me and her now I see now this obviously indicates sound so that's where I know sounds are coming from they can lay down traps like they can play radios they can like crawl oh I see what you're saying yeah you can do the you can do the Crouch crawl and not have to worry about anything okay I'm going to spend oh there you go look at this ID o I like it doesn't know where I am either that's the best part how does he not know oh but but their music builds they'll hear my music so they know that I'm in the area but you **** I don't so now people in the chat were saying oh just so you know we can't hear them you can hear them now yes it's proximity it's proximity oh **** you **** he just jumped into a window broke the window yeah now I'm going to lay another trap here I'm try to flank him oh this is spooky see this one like imagine it's same when you are the counselor too you know what I mean now when that when that H",
            "start": 356.56
        },
        {
            "text": "yeah now I'm going to lay another trap here I'm try to flank him oh this is spooky see this one like imagine it's same when you are the counselor too you know what I mean now when that when that H when that there he is where right there on your left on your left yeah in okay guys in the car yes I'm not worried about them being in the house you're putting traps all over the **** place are you kidding me **** nub call me a nub yeah I think so you're **** piece of **** okay **** all right cool what's a nub mean I don't know a nub is just a noob but that's not a noob move that's a **** pro move yeah it is a pro move I want them to walk out and get trapped yeah now can you is he still in there can the campers fall like in love with Jason no they can't seduce him no now what you can do is if you go over to Jason's Hideout where his mom's corpse is you can put on her shirt and then if he grabs you you can talk him down if you're a woman really got him yeah trapped him yeah I'm",
            "start": 404.0
        },
        {
            "text": "do is if you go over to Jason's Hideout where his mom's corpse is you can put on her shirt and then if he grabs you you can talk him down if you're a woman really got him yeah trapped him yeah I'm really I don't love that they can hear him though that we can hear them though cuz I'm worried they're going to say some really awful **** it's a video game yeah people say stupid **** those aren't us yo you're right you're right where's the Trap well it doesn't I mean it doesn't hold it holds them like they do the same rub X as fast as possible to get out as I do got it be the right time **** just ran into the same hey I found gasoline oh he found gasoline was the other dude's gasoline yeah he also found Jason he doesn't know yet though can they hear you no if mic's on yeah oh I see oh he jumped out the back a little SL get that little **** no Andy what watch what no that's not how we doing Greg you're not doing the best job yeah I am Kevin you don't know anything about",
            "start": 458.44
        },
        {
            "text": "oh he jumped out the back a little SL get that little **** no Andy what watch what no that's not how we doing Greg you're not doing the best job yeah I am Kevin you don't know anything about games you shut up I'm just trying to motivate you to **** work harder I want you to be my friend and hang out and have fun with me on **** shut up ghost mode MEC me me that's pretty cool I like that help help kind of reminded me of the dark he's here he's **** here after me I love this right help me he's coming through the door so you don't fit through Windows huh no yeah Jason can't go through the windows there he goes oh **** oh little **** oh the firecrackers I walked right into it oh **** oh they're attacking they're trying to be **** tough guys here oh **** but you're hooking out look at your face they totally like Home Alone you there like they had you just so trapped run oh my God pretty  good this is the cat and mouse game dude it's awesome I felt his fear yeah",
            "start": 510.68
        },
        {
            "text": "out look at your face they totally like Home Alone you there like they had you just so trapped run oh my God pretty  good this is the cat and mouse game dude it's awesome I felt his fear yeah like he was terrified I've lived that fear before I feel like we're very fortunate so you got Jason first I'm really excited about this a little little **** I do like being counselors quite a bit really yeah still following you but I feel like this is a good introduction sure you know  sure you think Jason would okay I was going to say you run a little faster now does that mode oh that's the top left meter no no that's me building the rage mode how many more traps do you have zero right now I burned them on the house trying to look cool got it it worked though yeah no you're all enjoying yourself oh **** you're done oh God oh my God damn it come on oh **** get him they're just like slow jogging like a Brisk jog oh you're **** done oh he not see had a little sh huh that Jason",
            "start": 567.6
        },
        {
            "text": "yourself oh **** you're done oh God oh my God damn it come on oh **** get him they're just like slow jogging like a Brisk jog oh you're **** done oh he not see had a little sh huh that Jason doesn't live by our rules man yeah normal man would have died but Jason stronger than ever stronger than I like that it looks like you can bust through a lot of the walls too yeah in Rage mode you can do that doors in the walls without having to hack at them so like a little Berserker mode exactly exactly interesting I also you like the seeing them run in the distance is awes oh no there's four them in there yeah I know they're getting away oh **** oh sh no this a dang it little **** oh you can fast travel or something this is yeah okay so they're going to be coming from right just knock down a tree and you're set well when you're in front of the car they can't drive through you oh good okay where they oh there they are look at them they're coming there's so many of them okay so I see",
            "start": 632.8
        },
        {
            "text": "a tree and you're set well when you're in front of the car they can't drive through you oh good okay where they oh there they are look at them they're coming there's so many of them okay so I see that on your d-pad the left button or R to the left is your sort of look they oh **** here we go get these **** no I can't drive oh damn oh yeah there it is there it is get **** I mean they're not like to I mean they're don't me wrong they're in trouble but they they have weapons so they can fight me off for a little bit hit that same artery not going to bleed out though is this are you in Rage mode right now or no almost look **** upe meter's almost there yeah we are right there but they can't kill you right they can knock me down but I get up again they a never going to K me okay oh God kill him the night kill him kill him Jason drinks a whiskey drink he drinks drink drink drink he sings the songs that remind him of his mother he sings the songs that remind him of a killing people",
            "start": 709.0
        },
        {
            "text": "kill him the night kill him kill him Jason drinks a whiskey drink he drinks drink drink drink he sings the songs that remind him of his mother he sings the songs that remind him of a killing people people hell yeah hell yeah oh wait who W man that went too far them down and make them pay oh that's your mom talking to you little motivation okay it's right here the mom is like an orts shoutcaster it's the house right here we're the one we're in no we don't I bet Jason regrets that he's like 7 fo4 yeah oh oh **** he's in the house oh **** in the house get out get get get get get out I didn't know this **** was in the house hero sword has no idea what's coming to him can you use a bow and arrow they can they can no I feel so evil and Sinister I'm laughing at their  pain what do those Transformers do is that something that the players have to activate they are call boxes I believe some of them are call boxes so you can uh similar to the generators in Dead by Daylight oh",
            "start": 767.16
        },
        {
            "text": "do those Transformers do is that something that the players have to activate they are call boxes I believe some of them are call boxes so you can uh similar to the generators in Dead by Daylight oh that's a big hack and slash right there got a weapon dang it so you just Crush her neck you're aixia her yeah you're killing that's the I haven't invested money in Jason attacks oh cuz it's just like he gets the job done cuz that's that part of the market is kind of not do too great why invest into Jason attacks put it into you know **** bong D diversifier these idiots for look at these idiots oh get just kind of want you to throw your **** ax oh you're **** he looks like a Brad Brad you're **** there it is there it is right yeah right the get in the dick oh the guy who has the Jesus G **** next time we start a game you'll see the worst face ever and it's a a character named Chad oh with the blond hair that guy I saw him in the trailer a little earlier yeah I don't know why we're",
            "start": 846.2
        },
        {
            "text": "**** next time we start a game you'll see the worst face ever and it's a a character named Chad oh with the blond hair that guy I saw him in the trailer a little earlier yeah I don't know why we're getting so much uh back static off that yeah that sounds awful but knowing this game who the hell know oh you got Berserker mode berser rage is active Ching **** that's for you ra AC raing machine break through break through I don't think that's a wall I came garage door oh behind you is that a person yeah I think so yeah yeah wow good job dude wow that was pretty good oh **** well the good news is you should waste time closing the door real hack him hack him Dam oh so dead you're dead Kevin you're dead it does look like Kev doesn't it it does look like big Kev they deserve to die Jason make them suffer I'm not liking those sounds what do you think of the game so far right like it's fun it's fun right like you see that why I'm like I'm **** really really like I know don't get me",
            "start": 901.52
        },
        {
            "text": "make them suffer I'm not liking those sounds what do you think of the game so far right like it's fun it's fun right like you see that why I'm like I'm **** really really like I know don't get me wrong I'm not putting down my reviewer hat totally like there's tons of problems it's janky but maybe it should be 40 bucks right now but **** dude if I ain't jooy myself oh oh now what are some of the features that you're not digging about it like cuz this whole sort it's mainly glitching out and you know the game being goofy now this guy is they've called in I don't understand this mechanic I I liked I like Friday the 13th I think I've watched most of them if not all of them there's a character in there Tommy somebody or other who kills Jason once in a while and you call him in and I think you become somebody becomes him and then he's really fast he's fast he's like he's like super he's a super character there he is not that super he's got his thing he's got his thing to take is he like The",
            "start": 968.88
        },
        {
            "text": "somebody becomes him and then he's really fast he's fast he's like he's like super he's a super character there he is not that super he's got his thing he's got his thing to take is he like The Jock he's the one who played like no no it's like you call him in you become him me like you get like get away from me super get away from me where did you go you pie that person did not sound like their game tyag would be Punisher leave me alone please this whole like ghost mode I don't know if I love it the thing that I liked about Dead by Daylight is that it takes place in a very small confined area mhm  so get him oh that was a good hacked him a little bit a good hack going come back so now they can't go through the windows anymore no they can't oh okay wait I thought I had rage mode can I just **** R through the wall okay jeez oh you piece of sh oh can I not grab Tommy Tom here is that the problem okay I've never I've never gone One V one with Tommy whatever the **** his name is",
            "start": 1013.64
        },
        {
            "text": "I just **** R through the wall okay jeez oh you piece of sh oh can I not grab Tommy Tom here is that the problem okay I've never I've never gone One V one with Tommy whatever the **** his name is Tommy Bahama you cannot how much he can kill Jason somebody saying in the chat that's power oh now see this is what I'm talking about with bugs oh there it goes are you bugged out or you no okay that is that that's the thing you're never sure is the game bugging out or is this a feature I'm never sure how much time do you have they're  0-minute matches okay **** get off the rock Jason get off the rock Jason get off **** oh man wasted it that was a the your just keep getting more and more Bolder ah all right all right Andy yeah Round of Applause at home for Andy for you Jeff Tommy Jarvis that's his name thank you very much everyone Tommy Jarvis yeah huh related to The Iron Man AI I believe mhm he is part AI so I guess from what I learned right now with that first encounter with Tommy",
            "start": 1063.6
        },
        {
            "text": "that's his name thank you very much everyone Tommy Jarvis yeah huh related to The Iron Man AI I believe mhm he is part AI so I guess from what I learned right now with that first encounter with Tommy is that I can't do one of my kill moves to him now can you he might be able to kill me I cannot wall run just I would love to see Jason in like full titan all like versatile action he also doesn't make noise I see do you still have the rage yeah so one person gets selected to be Tommy apparently apparently oh **** oh get dude Ah that's **** from me Jason don't let them yeah rub that **** yeah like that Tommy ****  SL oh getting some little uh Z fighting on that wall oh Tommy's still in the building huh where but where Tommy's in the room what do you mean is he under the blankets it could be he looks like he was behind you in that bed behind you was he I didn't get an x on I didn't get an X prompt on it oh they they tricked you he might not be in here at all they just put",
            "start": 1116.32
        },
        {
            "text": "it could be he looks like he was behind you in that bed behind you was he I didn't get an x on I didn't get an X prompt on it oh they they tricked you he might not be in here at all they just put like hunks of meat under the blanket there's no guarantee he's in here you know M damn when I left it still said maybe he's giving me old slippo now I hope Jason is going to reimburse these cabins for all the damage he's  done start up a little go start up a GoFundMe what are you going to do Tommy look at that little sneaky get that little **** go through the wall oh he was in God damn it a you piece of **** **** I **** up oh good thing there's a door right there or else that would have sucked oh oh what a **** tummy I've never had to do hand to hand with anybody them CQC it's a CQC keep an eye on that little **** damn it why you what are you doing it's making me uncomfortable seems like a little slot to  me oh oh **** he's going to make it wow music's turning on",
            "start": 1181.0
        },
        {
            "text": "CQC keep an eye on that little **** damn it why you what are you doing it's making me uncomfortable seems like a little slot to  me oh oh **** he's going to make it wow music's turning on for you not for Tommy there's Tommy get that little cute boy Andy he can jump out the window yeah there he is yeah got him ohg **** that was the finishing kill **** Tommy **** Tommy Jarvis one person got away with  the everybody's just complaining everybody who's already dead now totally being like a man Tommy you could have had him who one person that got away is there like a cut scene at the end no it doesn't show me that it'll show me the results of everybody who did or didn't die come back talk to his mom there Mommy yeah so this is the game okay I don't like multiplayer stuff I think this feels single playy you know what I mean where it is like you also get a lot of XP as Jason so who got away escapes killer GH killer ghost got away huh now are you able to well I I'll go",
            "start": 1240.96
        },
        {
            "text": "I think this feels single playy you know what I mean where it is like you also get a lot of XP as Jason so who got away escapes killer GH killer ghost got away huh now are you able to well I I'll go ahead and find out because I want you to be I want you to play as a counselor sure that's up next probably okay cool I'm too waiting about this I never did that I wonder how early they escaped yeah right you can just grab a boat or take the car well you have to the thing about it is you have to fix all those things so the car doesn't have keys a battery or gas you have to collect those and bring them back the boat doesn't have gas or a motor Fluffy Muff Pie talking **** what an **** um Andy talk fil time sorry F time Andy I I well time we have a delivery on the way oh **** piz no no no oh um something to give me a little boost oh cocaine we do doing some of that St Amazon Prime now has cocaine now it's pretty pretty crazy  1st century man they legalize everything  017 all right so",
            "start": 1300.16
        },
        {
            "text": "oh um something to give me a little boost oh cocaine we do doing some of that St Amazon Prime now has cocaine now it's pretty pretty crazy 1st century man they legalize everything 017 all right so we'll see how I pop in here as Andy but like I said game not perfect bugs and stuff but it's so much fun to play it does and it does get my even as Jason there's that like I mean I'm apex predator where I'm like I got to catch this guy before he gets wait but as counselor it is that **** of like when the music changes and it is that **** he's almost here what do I do what am I going to do gets you adrenaline pumpin so it looks like you're going to be a counselor now who's Jason don't know no we don't know you still don't know okay so what are the left and right icons mean that means who I've selected what my counselor of pick is and what my Jason of choice is old Higgins Haven we go here's the Here Comes Chad's face this guy goes down we're going to get a good Chad face oh God looks",
            "start": 1358.0
        },
        {
            "text": "I've selected what my counselor of pick is and what my Jason of choice is old Higgins Haven we go here's the Here Comes Chad's face this guy goes down we're going to get a good Chad face oh God looks awful terrible but it's like there's a badge for it called Chad Chad face so they're aware that it looks bad and they must have thought it looks so funny oh okay here we go I like this girl cuz she runs fast the **** happening what's her name Don know Greg for now you know what I mean Greg yeah I got this other **** over here walking to their cabin but I'm walking into my cabin so good enough good enough good enough oh gasoline my Pro tip Andy as soon as you come in you got to shut the things and you got to fortify oh okay oh then I then I like to open window so I have Escape Routes if I need you got to wonder why they have the ability to for fight doors they it's kind of like they knew it was coming but they still had they threw their little picnic part prevent bear attacks Bears got",
            "start": 1402.28
        },
        {
            "text": "you got to wonder why they have the ability to for fight doors they it's kind of like they knew it was coming but they still had they threw their little picnic part prevent bear attacks Bears got a map got a map bears are going to like Bears have a it's no it's not about the door and I got a walkie I probably should Pi up mus that means powering up that doesn't regardless of where I am that means Jason is uh he's powering up he's he's getting stronger he's getting closer to that race cut to the Montage for Jason oh here we go interesting so now I have the the phone I can fix a phone box so we can call the police you stumbled upon like but now we got to find find a cabin anybody have a walk I well I was going to say I do hear me find by the way Andel ladder they should already be watching hero sword he does oo AAR now if I find there it is that's the phone box there she had to go with the blue soy there's a lot of **** going on over here or we now I'm going need to focus guys all",
            "start": 1446.8
        },
        {
            "text": "hero sword he does oo AAR now if I find there it is that's the phone box there she had to go with the blue soy there's a lot of **** going on over here or we now I'm going need to focus guys all right why is everybody here oh skill skill checks Dead By Daylight skill checks yo what car the for seater **** let me drive no the training gamer dude shut up now it's boogie that's Boogie cross to bear not Gregs anymore all right we got it we can get in here now we can use the phone and when you **** up does that alert him to like oh some it makes more noise I believe yeah yeah no don't close it that was on me that was on me everybody sorry I'm stream the best counselor in the world cuz I I'm boosting the volume a little bit cuz I want to hear if Jason's nearby sure well you should have I think should Bo now we got to find the phone though Andy okay the phone the phone where the **** is the phone how quickly do the cops come it's a 5 minute close the doors not I mean the main do that",
            "start": 1494.4
        },
        {
            "text": "should Bo now we got to find the phone though Andy okay the phone the phone where the **** is the phone how quickly do the cops come it's a 5 minute close the doors not I mean the main do that was the outside you're right you're right no does that just mean you have to it takes longer to ax down you know what I call let's get the **** out of here nice dude why is there a bear trap on the ground is this the police cuz we can use it to lay a track for Jason she knows him by name well everybody knows the legend of Jason why would they stay at Crystal Lake then you know what I mean good great question now you said you saw a bear trap yeah on the right FL G on the hold want the first oh AK47 nice way too op the rocket launcher oh man just what I need I needed an RPG that way you should kept going straight now what is it I'm going to lay the bear trap here I'm going to set it so if he does bust through in a second reverse that **** CU this is the thing now what I like to do ****",
            "start": 1545.08
        },
        {
            "text": "kept going straight now what is it I'm going to lay the bear trap here I'm going to set it so if he does bust through in a second reverse that **** CU this is the thing now what I like to do **** I've got a good setup here guys so now what I like to do is just chill chillax you know I mean may we got this he doesn't have his T and making no noise so he if you don't make noise he can't see you at all with his little x-ray vision he won't see those the the white circles on the screen if you see like right now if you notice when I was using that sense mode the people and then if a person's in a house the whole house is red so he knows where to go interesting go left go left go I don't like the flickering in her eyes it's very weird it's the twinkle of life that Jason wants to extinguish you you know what I mean deep right call now here I do have the map we see I'm going to you can see Jason it's a car that's there oh they're leaving already get off the road they ped out on them on",
            "start": 1598.36
        },
        {
            "text": "you you know what I mean deep right call now here I do have the map we see I'm going to you can see Jason it's a car that's there oh they're leaving already get off the road they ped out on them on there's no room you got to wait for the cops now what's interesting is I believe I am in a very bad position of come back you're pretty far away from the cops the cops are going to come up at the High North there that H Camp thing I think I think but I can make my out I can if you go to the Cross Jesus will save you oh okay on the far left I'm going to I'm going to do a Crouch walk all the way over there see what happens I'm going to stay off the beaten path too all right okay I got a flare gun I'm getting nervous quick I'm getting a little spook ah we're going back inside H oh man I don't do great with scary games BT dubs hell yeah that's exactly what I wanted **** yeah no water needed Greg yeah tell Jason we've got some vitamin C to help our immune system so your axis can't help",
            "start": 1639.2
        },
        {
            "text": "do great with scary games BT dubs hell yeah that's exactly what I wanted **** yeah no water needed Greg yeah tell Jason we've got some vitamin C to help our immune system so your axis can't help help us your axes cannot dig into our skin cuz vitamin C prevents that it's true is that is the music we're hearing now means it means he's close he's getting closer he's here somewhere you got a good spot though you got a good spot she has a weird like esophagus see that you know what don't judge her she does okay now that means he's warped away oh thank God oh thank God so I'm going to start making the long trk are you serious yeah no maybe this is that maybe that's bait maybe he did that on purpose that's Pro Jason move yeah how much um we're going to do the Crouch walk the entire time how many of these the whole bottle you take the whole bottle oh take the whole bottle the whole bottle yeah to prevent from the axe you you don't want to get sick on you don't want to get an axe attack or",
            "start": 1688.88
        },
        {
            "text": "of these the whole bottle you take the whole bottle oh take the whole bottle the whole bottle yeah to prevent from the axe you you don't want to get sick on you don't want to get an axe attack or get sick for count5 three June 3rd that's Saturday every two one to four tablets that's a big whatever it's a big range how you feeling really comes down to how you feel one is fine Andy one is fine you're just going to pee it out I'm going to do two oh you're going the real long way hey man off the beaten path quiet as a mouse I mean you fig I got a minute 46 to kill right now Army of Champions says no the music being gone means that he muted the music just picture him like oh **** **** man put my headphone headphones back in Greg what's that no time to save those people what oh somebody is getting attacked yeah in within ear shot somebody's getting attacked oh **** so you could help right now with your flare gun yeah no that I look out for GRE I look out for one here no yeah ****",
            "start": 1743.04
        },
        {
            "text": "getting attacked yeah in within ear shot somebody's getting attacked oh **** so you could help right now with your flare gun yeah no that I look out for GRE I look out for one here no yeah **** them Kevin if we were playing i' I'd help you we'd roll as a giant Squad which by the way awesome clip I caught on Reddit yesterday from this Jason runs up and it's like all seven of the counselors and they all have weapons and they guy's like you can't beat us all and the streamer is Jason and then he just starts destroying them all he's like I can't beat you all is that what you said killing everyone know you have a minute until the police arve what's that music mean shit's getting real somewhere oh man I'm very scared Squad never roll alone says King Francis up and never roll Francis in the chat idink says Greg that path is actually very beaten it's not the main road though you know that's what I'm saying for 5 years of my life I always thought it was the beat and path oh yeah that's a",
            "start": 1791.92
        },
        {
            "text": "chat idink says Greg that path is actually very beaten it's not the main road though you know that's what I'm saying for 5 years of my life I always thought it was the beat and path oh yeah that's a weird one okay that's really dumb well don't listen it's not Point Kevin so someone asked are you just trying to survive the Tim line cuz it looks like you're going to win I can make it the 0 minutes but I when the police 0 minutes it's a 0- minute timer for oh that probably didn't sound great on stream but uh for the police the 5 minutes I have to make it to the police it's not the police don't come in and save you you have to get out and get to the police you have to get to them okay well you're near the cross so Jesus will be there Jesus Take the Wheel I would love to see Jesus like **** coming down from heaven **** up Jason **** Jason that'd be weird that'd be a cool One V one BL steady BL steady so he's next to you oh God see him there he is there he is see that red",
            "start": 1841.08
        },
        {
            "text": "coming down from heaven **** up Jason **** Jason that'd be weird that'd be a cool One V one BL steady BL steady so he's next to you oh God see him there he is there he is see that red what red thing he's gone now he was on the map for a second up by that Northeast uh triangle he's he's after the Northeast Council so he can't come on like holy **** what the cops cops are all the way over there oh boy Greg I'm going to keep crawling I don't need that kind of pressure hey the important thing is you helped save up a whole bunch of people you don't I'm Not Dead Yet Kevin you know well why is your teddy bear why is your **** teddy bear hit him with the flare Greg why is there a teddy bear we don't have time to investigate the environmental storytelling of this all right I'll hit him with the flare you what you don't know is his teddy bear is his one weakness no he's the mother's sweater the hell he's doing don't I'm not trying to distract you I'm sorry what does this mean",
            "start": 1896.2
        },
        {
            "text": "him with the flare you what you don't know is his teddy bear is his one weakness no he's the mother's sweater the hell he's doing don't I'm not trying to distract you I'm sorry what does this mean what does the music mean mean Jason's up with some Shenanigans H that'll be like VCR tracking if he warps over to me oh really yeah but so right now he's able to see the little white ccle yeah I should be if I'm why has he come **** you up yet well because it looks like there's still other people on yeah there's other people come on oh it's me and yeah ex killer ghost are the only other people still alive right now killer ghost is going to get him it's going to be a battle of the killer what is happening I don't like this should I run yeah run run **** Sprint that's as fast as you run huh okay all right he teleported away guys that's what I've learned that noise means all right all you have to do is get what's your time in the 40 you're running like a 43 I can't I mean she's in",
            "start": 1946.48
        },
        {
            "text": "all right he teleported away guys that's what I've learned that noise means all right all you have to do is get what's your time in the 40 you're running like a 43 I can't I mean she's in the tracksuit because she's Mis running okay we're we're going to sit here for a second let it recoup then we're all out balls out run yeah oh man I'm enjoying the **** out of this game I'm very nervous just watching it I don't like that her eyes are like **** can you let go of the eyes man I mean if you turn around you take off your game development hat and put the hit game Blobby blobs with Rooster Teeth or whatever the **** it's called I don't know there he is where he's the red thing on God he's he's he warped where's the VCR tracking **** I'm going to run out of juice you're going to run out of juice all right take a pause take a pause take a pause and just stand near a tree can you just stand near a tree and so he chops the tree look like a tree thank you me oh **** oh my God",
            "start": 2005.2
        },
        {
            "text": "run out of juice all right take a pause take a pause take a pause and just stand near a tree can you just stand near a tree and so he chops the tree look like a tree thank you me oh **** oh my God ah I just want to get enough distance to shoot him **** he's doing his thing oh he's doing his warp oh my god get to the cup we did it we did it hell yeah dog that's what I'm talking about why this game is so cool oh I didn't want a beer right now but okay I just meant we needed beers in the office hell yeah in this one hey uh Kev a little Red Bull action huh yeah give me a second oh man I'm telling you that's what it's about in this game yeah oh that was great that was cool **** I'm saying man game got something there he goes he's his mom's going to be so disappointed in him I know right I kind of want him she never does she never critiques him that I want him to walk in and his mom be like come on man of that was cool I don't I'm not loving this audio Yeah I don't know why",
            "start": 2052.84
        },
        {
            "text": "right I kind of want him she never does she never critiques him that I want him to walk in and his mom be like come on man of that was cool I don't I'm not loving this audio Yeah I don't know why it's all shitty like this uh should I unplug it and plug it back in no it's working that's good enough yeah with a with a Kinda Funny garbage truck on fire let's not **** with it it's working I've taken my that was not a good J hey um audio people in chat let us know if you're hearing that crackling as well no i' I've killed it and they can hear it oh okay just ask me next time maybe Okay Kevin Coello just saying why you asking them I'm pping my I am I got some heart pump pations that's what I'm talking about blood going to your dick **** throbb it's Eng gorged you know sure nothing gets me harder than run it from Jason yeah uh while we do that I'm going to check in on Subs I'm if I read your name you're sub resub we love and appreciate you uh jro dreams of pooping white crow 05 Jake",
            "start": 2121.52
        },
        {
            "text": "me harder than run it from Jason yeah uh while we do that I'm going to check in on Subs I'm if I read your name you're sub resub we love and appreciate you uh jro dreams of pooping white crow 05 Jake p47 love you guys sorry I'll miss you Kinda Funny Live three you but hopefully I'll see you at PSX just Ryan bear so close to two years can I get a Bongos on Kevin's butthole no you cannot J Fergy Ferg it's gross I think it be like index fingers okay uh Jay Fergy Ferg happy to support you guys wish I could make it to Kinda Funny Live three next weekend have fun everyone Light Side 39 yeah diabolical breakfast thanks for the holiday stream glad to finally watch the show live uh T lson 341 not all heroes wear capes here are some Amazon money remember if you have Amazon Prime you have Twitch Prime we'd love to get your free subscription because we use the money to pay **** Amazon you know Enigma 9011 happy one year jents see you guys this weekend woo thank you can't wait for kind of",
            "start": 2170.56
        },
        {
            "text": "Prime we'd love to get your free subscription because we use the money to pay **** Amazon you know Enigma 9011 happy one year jents see you guys this weekend woo thank you can't wait for Kinda Funny laugh uh arm AOS here's some of that here's some love from the capital of Canada Ottawa thank you for telling me what the capital candidate was I didn't know that yeah uh alasi says always Kevin the killer three months woot can I ask Candy Andy to say my name in a sexy Hispanic yell thanks love you guys that doesn't I mean Kevin the kill but I'm I'm assuming they want Kevin the killer then no sexy that's sex **** sexy kidding me that's the noise we make I know like as soon as we as soon as we are about to climax yeah that's how they know Madden 3 and Madden mad N35 s17 was my birthday yesterday got my switch I hate the old man on Zelda you guys are the best get me through every workday we're happy to we love you I mean keep keep going through it going to love it lak lad uh K RS woo",
            "start": 2214.4
        },
        {
            "text": "got my switch I hate the old man on Zelda you guys are the best get me through every workday we're happy to we love you I mean keep keep going through it going to love it lak lad uh K RS woo four lot of Twitch Prime subscriptions **** Twitch Twitch Prime is the jam now yeah hell yeah Ark wolf 17 months sub to this beautiful Bean footage of Baker's Dozen **** yeah big marshmallow it's lit y'all it is A- Rock 86 I'll see you beautiful Bast keep reading no no we're almost there I thought I would have made it you stop single Squire happy memoral day folks can't wait to see you forever keep can't work days can't keep me away from ever and we're going to pick back up with tag guys oh this guy's cocky oh you're her again well this is the character I choose oh okay I didn't know that it's not what I am on the outside that what are some of the strengths of the other people they all have different stats I can show you if I ever want the problem is once you get in a good game or a game I",
            "start": 2269.44
        },
        {
            "text": "not what I am on the outside that what are some of the strengths of the other people they all have different stats I can show you if I ever want the problem is once you get in a good game or a game I should say you don't want to bail out because then you're going to sit for a while and do it again the Chad guys's skill is like I look good in a polo exactly I'm I look like a douche and everybody hates me give me cargo short shorts and I perform at my best one those I got it and that's selfdefense I like that you're slowly building up what you're carrying yeah like oh no this is better than that so switch let's see right now I'm feeling like we might find some gas mat maybe T Keys oh my God is he building no he's building that means he's building up yeah he's building up I picture him getting in Gorge you know what I'm saying oh yeah oh machete I wonder what his dick looks like this got to be it looks really gross I bet yeah rotten there we go got a map oh man these are really good when",
            "start": 2315.88
        },
        {
            "text": "in Gorge you know what I'm saying oh yeah oh machete I wonder what his dick looks like this got to be it looks really gross I bet yeah rotten there we go got a map oh man these are really good when they're not like sugarfree right isn't it crazy oh yeah it's pretty crazy all about that let's see oh we got oh okay so the phone is in this house Greg did you see Baywatch ask Mr G man I did not uh Nick was going to see it with me and then he **** me over and went and saw with his wife all by himself **** I got gas too I'm really far from everything that requires gas though so I'm not I'm not really Pro taking this gas right now so that's what those campfire icons are well no the Blue Boat that's actually move your head the Blue Boat right there is one and then the blue car up there is the other thing now I'm going to make my way to that car probably the car doesn't seem that far away but you've got a machete but I dropped machete to take the gas you also have two arms you know what I",
            "start": 2362.32
        },
        {
            "text": "other thing now I'm going to make my way to that car probably the car doesn't seem that far away but you've got a machete but I dropped machete to take the gas you also have two arms you know what I mean oh **** there's ax too I know well I have the flare gun now which was really helpful last time yeah we need if we could get the here's what I want to do let's find a battery tell me what you want to do I'm going to go south to Flat Rock there okay and look in those houses okay cuz I feel like is that a better part of the neighborhood no it's just that I think usually items are somewhat close to each other you know what I mean okay so like hopefully one of those will have the fuse for the phone behind me hopefully you got some good RNG that's what the gamer say random random number generator oh good good luck essentially I thought we asked you to take your game development hat off no I said that's what the gamers call it oh is it yeah like when you get when you get a good loot drop",
            "start": 2414.48
        },
        {
            "text": "oh good good luck essentially I thought we asked you to take your game development hat off no I said that's what the gamers call it oh is it yeah like when you get when you get a good loot drop in Destiny they say thank R in Jesus Oh you see that oh play on that's kind of Blasphemous though you know cuz Jesus did have a part in that and then there's changing his name yeah I guess you're right kind of **** up when you think about you know but I guess that's what Dej wants to promote hey man what would what would do oh **** what is that that's okay so now guys spinner oh so now guys we have oh oh **** we got a we got a decision here guys okay so I have the gas and I have the propeller oh my God I know where both are I could go get the boat ready to go **** let's do it man let's do want try doing that all the way all right all the way could blow up in our face I'm put I have to put down my weapon you understand I have no weapon now damn that this is a big risk it is a big risk",
            "start": 2457.52
        },
        {
            "text": "want try doing that all the way all right all the way could blow up in our face I'm put I have to put down my weapon you understand I have no weapon now damn that this is a big risk it is a big risk big money big reward they say exactly exactly risk it for the biscuit believe now the other problem is the gas might be gone by the time I get there no don't no don't think I'm just laying out the possible problems is bro you're fine you're fine all right cool don't let these chowderheads full chowderheads okay chowderheads oh **** this is a bad time to come oh boy oh God okay thank god oh I see it's there's a very distinct Vibe here like it's very scary scary yeah I'm terrified um in like a good in like a way I like going the wrong way kind of turns you on mhm I know what you mean rock hard guys mhm engorged what an awful word that is huh gor I like it reminds me of a penis curious I've never understood why people don't like cuor you know oh God he's just powering up not don't stress",
            "start": 2500.96
        },
        {
            "text": "guys mhm engorged what an awful word that is huh gor I like it reminds me of a penis curious I've never understood why people don't like cuor you know oh God he's just powering up not don't stress yet stress level zero I believe what movie do that sound effect now it's bad oh God why the **** you making so much noise while you run what do you want me to do run quieter okay get to that **** boat okay there's the boat can you make a friend too I'd like for you to make a friend I don't want you to just save yourself oh oh these damn skill checks oh **** I'm bad at him guys I'm real bad that made a lot of noise Greg this one's going to be L1 right here this is going to be R1 yep L1 R1 God how does any no oh my God what I stopped oh all right shut up shut up shut Focus this was L1 right oh God this one's r one stop trying to like psychic them just wait it out it goes by so much slower when you **** up huh thank God it actually fit thank God it actually fit what she said all",
            "start": 2550.88
        },
        {
            "text": "God, this one's r one stop trying to like psychic them just wait it out. It goes by so much slower when you **** up. Huh? Thank God it actually fit. Thank God it actually fit what she said. All right, so now we got to get back to that Palmer's Pass house. Really? Yeah, that's where the gas is. I mean, it's possible there's gas in other houses, but I'm not going to take that shot. I'm I'm glad we're going the more adventurous route. I prefer this than to like then camping. Yeah, but I lived, you know what I mean? We are at a campsite. I lived, you know what I mean? I don't I think that's I might you know, I'm doing this for you and the horror movie fans out there, but just a reminder, I lived last game because I had made the smart choices getting a little spooked here though. I'm spooked. Rodney A says go out there and make a friend, Greg Miller. Yeah, we'd have to put on the chat and then explain to him I like you guys being shiny. Bolt says, Andy, how does that Z fighting with the plates on the",
            "start": 2623.28
        },
        {
            "text": "a says go out there and make a friend, Greg Miller. Yeah, we'd have to put on the chat and then explain to him I like you guys being shiny. Bolt says, Andy, how does that Z fighting with the plates on the walls make you feel? Doesn't make me feel great. Tell you what what's what's all that means? What the hell is he talking about? Uh, when you when two planes like the plates on the wall it's supposed to be sitting in front of the wall, but when they are aligned directly they kind of dance like there's texture fighting. It's called Z fighting. Take off the game development hat, man. It's pretty simple. I just got I just got a comment about it. I got a comment about it is what I'm saying. I got a comments about it. Where is silly hat? I don't know. Com yeah, where is the silly hat? You got the silly hat. That's we hired you for anxiety levels are high. All right, I agree they are kind of high. Oh God, great get in there get in there, Greg. This is a moment of truth. Is the gas still here guys? The gas is still here. Oh",
            "start": 2669.56
        },
        {
            "text": "hired you for anxiety levels are high. All right, I agree they are kind of high. Oh God, great get in there get in there, Greg. This is a moment of truth. Is the gas still here guys? The gas is still here. Oh thank God. I thought you going to say guys gas is. I also thought you were going to say f. So now the next question is do we want to crawl walk all the way back? Crawl walk, you know what I mean? That like crouchy walk thing. Iidea no run. Run's going to make a lot of noise. Two friends you have two friends though they keep stay there and be loud. Yeah, yeah, yeah, I think only two people fit in the boat too so I a't got no I I got no time for friends. Game Over hasy he has the gasoline. **** they know to theat they know I have the gas guys. They think you're going to the car though. What it's like can they try to stop you? Yeah, you can kill each other really? That **** sucks damn it really is like every man for himself or it doesn't have to be it doesn't have to be thank you. So what are we doing",
            "start": 2709.24
        },
        {
            "text": "they try to stop you? Yeah, you can kill each other really? That **** sucks damn it really is like every man for himself or it doesn't have to be it doesn't have to be thank you. So what are we doing for lunch guys? You just want to get some free Chipotle use all the tickets. Why are we laughing? I'm down. Yeah, it's good that you're running in the woods cuz there's a lot of things in the way that J can hit up can you know run into. Can you hit him with the gas? No, I don't think okay. Can you just like throw gas at his face? This is where everything's going to go bad cuz we're almost there. Can you take a sip of gas pull a lighter out below? I'm so close now. I feel like I got to crash walk. No, no, Kevin when I get there you're wasting time. I still have to do the **** mini game when I get there. It's not like I'm going to get there and be great. All right all right. I don't think he's there though, but he could be in a second. Kevin you're your backseat camp counselor right now. I wanted to be off Radar",
            "start": 2753.16
        },
        {
            "text": "like I'm going to get there and be great. All right all right. I don't think he's there though, but he could be in a second. Kevin you're your backseat camp counselor right now. I wanted to be off Radar Radar you know what I mean cuz I don't want it to be that he sees me making noise he comes here he finds me as I'm doing the mini game for gas. Now if I were him I would just wait with the car and the boat at all times. He now see of course he can't see those he doesn't have a map so he doesn't know or I guess when he does the warp he he doesn't see objects I guess once you I mean once you play enough you know where the docks are. Yeah exactly there's rotating Maps here but you all they all they are all **** oh my God does that mean he's close? I don't know means something's happening. Drop the **** and run drop the **** and run there's no time for dropping the **** here we go. Oh the policeman called oh see the scary thing is you can't see around you right now yeah but you'll",
            "start": 2807.68
        },
        {
            "text": "drop the **** and run drop the **** and run there's no time for dropping the **** here we go. Oh the policeman called oh see the scary thing is you can't see around you right now yeah but you'll hear the music thought I had it you know what I mean got a little cocky there it spe up see now Jason's got a lot of problems there right get in the **** oh no not like this the the real cop's coming in our life oh God the music's so intense Greg out of I'm out of here now Jason is only more powerful in the water I feel like I should tell you he's not yeah he swi he **** **** Zips around this goddamn Lake and then he can jump up and kill you real good too I just want to see him like jump out of the water **** whale or something oh **** he's in the water in the water how oh God go go go go go go go go go go go did I make it I made it oh God oh God oh this what I'm talking about yeah dog oh **** me what a fun little development right there like oh Jason he can also",
            "start": 2852.56
        },
        {
            "text": "go go go go go go go go go go go did I make it I made it oh God oh God oh this what I'm talking about yeah dog oh **** me what a fun little development right there like oh Jason he can also kill you from he has like way cooler kills too where he like jumps out and like **** R and he grabs by the way Jason is a dolphin so now we get to spectate okay all right I'm going to kill the like two people are alive no three people are alive hero sword 18 native fantasy it looks like they've given up it looks like they're just trying to wait it out she's got the gun they're waiting for the cops is what they're doing see what they got let's see how close they are with the cop there's almost 10 minutes left now I did take the gas and I did leave people behind so you know now that I wasn't the best guy there but I got is there just one gas oh **** no there I I don't know I don't know uh Rich her says Greg I've been interested in this game haven't played it I might have a couple friends",
            "start": 2907.88
        },
        {
            "text": "best guy there but I got is there just one gas oh **** no there I I don't know I don't know uh Rich her says Greg I've been interested in this game haven't played it I might have a couple friends who get it or already have it should I pick up this game wait and see or pass you're watching it here again I'm **** in love with this game totally it reminds me of something I always see you steam idiots playing you all you fun oh we got our Mouse and keyboards we're playing this game and it's early access but it's cool that's what this reminds me of okay so it looks like it's it's got Jank too but I mean there's moments of Awesomeness in there I like it a lot yeah we've had some really fun moments so far yeah right so what's up with this oh they put she got the battery elv oh my god well they all have like 80s you know team movie oh elv elv oh she did it she used her little knife she get away good **** get away Sprint there's no way he's she has no idea what to do she's doing it all",
            "start": 2955.64
        },
        {
            "text": "all have like 80s you know team movie oh elv elv oh she did it she used her little knife she get away good **** get away Sprint there's no way he's she has no idea what to do she's doing it all wrong. Elvar has never been you went to bad Windows too Jump On In but I don't know man oh God this is a very very that hurts her too that that that hurts a bit too yeah she probably you can do the slow crawl through but if you that spam the button why are you turning on your flashlight oh she used a first aid kit though pro move okay okay her flashlights on there he oh no look at that scary that is oh my God wait why was he just waiting he just smashed down that door that was so terrifying just go woman out get out oh my God all right get out of house don't run back towards the door oh you idiot I want her to die now I hope she dies what you pick up from him a flare gun okay okay she's developing a plan all right all right not bad so there's seven minutes overall in the whole game correct",
            "start": 2991.64
        },
        {
            "text": "I want her to die now I hope she dies what you pick up from him a flare gun okay okay she's developing a plan all right all right not bad so there's seven minutes overall in the whole game correct seven you can't see that while you play I see cuz they want you on the you know to be excited one minute 30 the police come oh man she's playing a cat and mouse game with Jason she just like sort of ducking and driving huh Jason's starting to lay his traps though oh oh **** n this isn't going to work out for Alvar you think so she's probably listening to like some Depeche Mode right now huh no you got to listen to the game play to know he's by right yeah but she can run for the cops backwards does she have a map I don't know what she's thinking oh my God are you seriously going back for the battery right now she's crazy fcking shot in Hell there's a mini game oh somebody got him with the fireworks okay all right hopefully oh God she's pulling Greg Miller here oh she must have the skill to go",
            "start": 3046.12
        },
        {
            "text": "right now she's crazy fcking shot in Hell there's a mini game oh somebody got him with the fireworks okay all right hopefully oh God she's pulling Greg Miller here oh she must have the skill to go faster maybe that's her perk yeah yeah you have a I turned it off cuz I I for I did in the beginning where I had it where it was just like four things and then I got better perks and I put them on and I kind of regret it cuz I do do repairs all the time now I probably should change it but again it's a pain in they ass to change things while you're playing if you don't want to get booted from the game that sucks I love this **** game guys are you having fun are you having fun we have 1776 viewers in uh watching right now Declaration of Independence happy Memorial Day everybody yeah thank you to all who serve AB oh my God that guy's going to die oh we got a Jason we got she the **** spear you can throw knes **** Pro Genji right there I'm just not good at it so I don't do it I got I'm a",
            "start": 3093.44
        },
        {
            "text": "all who serve AB oh my God that guy's going to die oh we got a Jason we got she the **** spear you can throw knes **** Pro Genji right there I'm just not good at it so I don't do it I got I'm a Jason who believes in knowing your pros and cons damn and that just theam go back you want to stick with yeah yeah I want to see what her story is oh my God God he just he just warp oh scary oh Jesus **** Christ **** Christ there it is **** jump through Windows all the **** time he said it himself I just jump through **** Windows all the time no he don't somebody asked about tips I wasn't seeing any but I'm jumping into stream tip now to see my tip looks like we have two tips my apologies everybody they weren't po popping on Old mxy oh Lord tip so far today comes from number one gifted dim 63 There go this tip is in remembrance of Memorial Day 017 I'm currently 9.5 years active duty for the Air Force and I'm proud to serve every day thank you so from who apprciate your service",
            "start": 3136.8
        },
        {
            "text": "dim 63 There go this tip is in remembrance of Memorial Day 017 I'm currently 9.5 years active duty for the Air Force and I'm proud to serve every day thank you so from who apprciate your service thank you J ear says and he **** right just want to see if you can get a birthday shout out turning 6 and drinking beer while watching you guys PS I Love You Kevin love you too bud happy birthday happy birthday let's see if these girls can survive here five more minutes it's not looking great I do like is wide open also the cops are here right yes they could run to the cops why don't they go to the cops are you able to EXC you you hear that are you able to bust out the map right now to see where the cops are I I don't know if I can't I can't now that I'm dead uh no you're not dead you escaped oh sorry now that I now that I'm gone voting away CU I having a great time you're a winner God I I thought for sure Jason was going to get us there for a second that was great uh Rich Herz Greg what",
            "start": 3196.52
        },
        {
            "text": "oh sorry now that I now that I'm gone voting away CU I having a great time you're a winner God I I thought for sure Jason was going to get us there for a second that was great uh Rich Herz Greg what is the leveling system like in this game as you see I walk away every time with XP it moves me forward you're leveling up unlock Bo different characters to play as which with different stats different Jasons different Consolers and then the XP you spend on $500 skill rolls and you get a perk or $500 500 Point skill rolls where you then get a perk that you can do are you checking your hair right now are you Snapchatting right now you Snapchatting while we stream this that's what you're doing well oh I need to let the people know how many how many is this how many kind of funny the twitch.tv/ of funny games right now down **** back I'm sorry back to cin withv I like your your **** Christ oh God he's he's got to be getting close to rage mode does he know about ra mod about I guess I",
            "start": 3248.6
        },
        {
            "text": "of funny games right now down **** back I'm sorry back to cin withv I like your your **** Christ oh God he's he's got to be getting close to rage mode does he know about ra mod about I guess I didn't really know about how many broken bones does she have from just diving through exus says make Andy play please that's an interesting idea no oh Jesus **** Christ you see that oh god oh stop it with the knives Jay come on man oh he she can escape right here this is the main road right isn't the cops right over well do they stay yeah the cops stay what are you doing what are you doing run right there maybe I don't know actually I don't know I'm not it could be the other way too shoot him yeah well yeah you got to use that at the last moment you know what I mean you saw me do it when I got away yeah it was it was a very clutch move yeah God he was so close when you did it I don't like that these heard you hear that was that are talking so much do you want me to mute people no I've",
            "start": 3288.84
        },
        {
            "text": "got away yeah it was it was a very clutch move yeah God he was so close when you did it I don't like that these heard you hear that was that are talking so much do you want me to mute people no I've already muted them with the camera with the okay so the viewers can't hear them they don't hear any noise from the game though right yeah unfortunately that sucks there's a lot of intense me I'll I'll reenact how about you bring up the thing but keep them low cuz I feel like the the thing is getting knocked down things hitting that's all really important look at this move she's just sitting there camping morph oh my God he's going oh my God I wouldn't I wouldn't have advised this why are you just diving everywhere I mean it's working it is I guess guess two 19's all all she needs to stay no oh God you Kevin they said they could hear everything who can hear everything the chat said they could hear everything before you they weren't muted no they definitely muted well not muted but I lowered",
            "start": 3349.04
        },
        {
            "text": "God you Kevin they said they could hear everything who can hear everything the chat said they could hear everything before you they weren't muted no they definitely muted well not muted but I lowered their level okay he threw a knife at her we can hear them mumbling in the background because of the TV we didn't go back got you thanks Kev love you wasn't critique speak just making no no no I know I'm I'm keeping you aware I I can hear everything they can happy Memorial Day Kev Happy Memorial day God bless the troops turn out that **** flashlight stupid see this is what's so great is when you're in the moment you're in the horror movie and you make all these decisions people don't think IR rational maybe and then when you're out you're an audience member in the horror movie you're like really yeah like why are you running back in the **** what are you doing just judging their every move he wanted keep going a private match bro like crouching are are you able to crouch Jason Jason no",
            "start": 3395.48
        },
        {
            "text": "yeah like why are you running back in the **** what are you doing just judging their every move he wanted keep going a private match bro like crouching are are you able to crouch Jason Jason no okay then the dumb ass left oh **** there he is where he in the other room oh I didn't see him I didn't see him no it's okay I'm getting tense I'm sorry there he is there he is's now see she's playing it right right oh let's just keep hopping in and out of the window oh no he knows you're outside get back in there now to be clear remember why spectating right now we can hear those guys she can't hear the other people so for her it's still dead quiet why that's a good plan though she St I mean 50 seconds is all she needs to do to stay alive right now dude if elv pulls this off we were doubting her from the **** getto she the only she's the only one still in the game too I wonder Tommy oh I'm surpris you even ding I was say that's one I would have dop through but okays El di oh my God close",
            "start": 3436.52
        },
        {
            "text": "from the **** getto she the only she's the only one still in the game too I wonder Tommy oh I'm surpris you even ding I was say that's one I would have dop through but okays El di oh my God close the door that is not what she meant to do for sure 30 seconds fortif 30 seconds don't even B have you not oh no lady dude I think she's good I think she's going to get this I don't know there could be another door that's just open right now Jason should be in Rage mode right now where he can just bust through the door bet Jason isn't using rage mode holy **** oh man that was **** sh him 6 yeah oh wow what an epic ending for her what an epic ending for her holy great godamn job unbelievable holy **** that **** rule that was an awesome ending for her that really good who was is that fluffy muffpie is who were watching there right Jesus man we doubted that fluffy muff pie the whole well I certainly did I don't know about you guys 100% i di right next to dude there were a lot of poor",
            "start": 3485.36
        },
        {
            "text": "muffpie is who were watching there right Jesus man we doubted that fluffy muff pie the whole well I certainly did I don't know about you guys 100% i di right next to dude there were a lot of poor I'm shocked that we like how do they know that he was in the house with her I don't know right I don't know oh man cuz they they happen to Escape right at the perfect moment yeah yeah sorry Alex says **** great matches so far agreed that was great kind of Renay says cesler did such a good job on this game yeah cesler so quick to point out all I did was advise yeah he's there doing that man CS C++ that was a great match now are other users able to join you or do you not even want to risk that right now I don't want to **** with it so here is where you can look at it right so this is this is who I'm playing as right her luck High stamina high speed high that's why I roll with her but you can click through this guy's lock this when I get this fat kid he's going to be me obviously I'm want to",
            "start": 3545.32
        },
        {
            "text": "I'm playing as right her luck High stamina high speed high that's why I roll with her but you can click through this guy's lock this when I get this fat kid he's going to be me obviously I'm want to play with him a lot too okay but uh yeah this all the way I like what's what's alvar's name AJ Mason Jenny Myers I'm doing pretty good at unlocking people here but I'm going to stick with my girl the runner who was locked Tiffany something Co TI Tiffany Cox I guess I oh let me uh let me rate my Uber driver huh rate your Uber driver please uh the crazy psycho says I need Nick to play this game that that could probably be a disaster Rich says you should try to do a Friday 13 let's play fill the game with everyone in Kinda Funny and friends in Kinda Funny have a full game I'd love to party mode this it would be complicated yeah that'd be that'd be cool to play yeah absolutely I don't know how we because it's you know eight players or whatever we need eight PS4s here granted we can fill it",
            "start": 3599.32
        },
        {
            "text": "this it would be complicated yeah that'd be that'd be cool to play yeah absolutely I don't know how we because it's you know eight players or whatever we need eight PS4s here granted we can fill it in with other fans so we could be the four of us five of those what I'd want to do is have is that what I should rate the Uber driver sure okay uh four stars but I'd love a good let's play of this yeah I'd like if we could have the four of us in here and whoever's Jason in another room be the other room that and that's what's so complicated right is like there's no way to say do it this way and have it all work yeah J says Community play yeah no I want to do that yeah yeah yeah also their servers AR super solid Chad looks so yeah yeah well private matches have been the best way to do it apparently Chad looks so moist every time he turns around yeah I get to run I can't believe he killed I believe it who's there haven't you read the stories haven't you heard the stories of Jason I miss",
            "start": 3646.48
        },
        {
            "text": "Chad looks so moist every time he turns around yeah I get to run I can't believe he killed I believe it who's there haven't you read the stories haven't you heard the stories of Jason I miss honestly guys I miss the mom talking to you sorry it's okay one day we'll get back to being Jason no does it just randomly choose who is okay got you hide in the bed oh um hide in the closet for you by accident thought it was a Chester drawer oh you don't want to get like a weapon first I didn't want to hide period oh okay got it I don't worry the weapons like I've never had a good hey I'm stand and fight Jason moment you know what I mean yeah oh Jesus Christ **** sorry everybody we picked up we picked up the walkie-talkie so now the dude is saying hello anybody there I don't even I should why do we hear water splish spashing around do we you guys don't oh okay well you did you did a second ago I was close to the bathroom maybe someone just pooping Jason poop they do a great job with",
            "start": 3705.56
        },
        {
            "text": "we hear water splish spashing around do we you guys don't oh okay well you did you did a second ago I was close to the bathroom maybe someone just pooping Jason poop they do a great job with sort of building thetion yeah all right so we have **** in this house all right open some windows up man I'm thinking what I'm going to do is go out and go to the house there to my right okay oh well there's somebody across the street in that house hell hello hello who's Lu got how's it going um Anthony de yeah me NE Anthony is Jason so watch out this is the place already been picked I think yeah I don't think anything stays between okay good Matt that'll be help yeah definitely not last time I play Jason Target the **** out of Anthony and now he's to get he's going to get me back get yeah he's get scared **** it's it's fine okay I'm trying to give everybody a great experience but scar can you throw away your um walkie-talkie no out of a big group of people run like",
            "start": 3760.0
        },
        {
            "text": "me back get yeah he's get scared **** it's it's fine okay I'm trying to give everybody a great experience but scar can you throw away your um walkie-talkie no out of a big group of people run like with like five people it just seems like it's going to slow you down I want you to win see where let's check in with everything somebody's already R for Tommy the car's got a gas tank already one of the cars I have a map what do you want me to do here um go get the bow and arrow you want me to go over the archery set yeah I don't maybe it isn't that weapon cuz I've never seen it I think I would have seen it by now well let's go and find out so you want me just just March over there I kind of want you to hang around with your friends to be honest with you yeah I just want to see I want there to be a moment where we're all together Jason says who do I kill first you know all right I'll Jeffree how were they they seem like they might have been far away though no no I'm coming you already see",
            "start": 3830.0
        },
        {
            "text": "be a moment where we're all together Jason says who do I kill first you know all right I'll Jeffree how were they they seem like they might have been far away though no no I'm coming you already see that guy right up there oh okay why the guy can't talk okay cuz cuz Jason will hear him he just don't talk oh God I think Jason might beat oh God God **** **** thanks guys for making me do this dude whatever this oh no we already busted through this wall can you fix the door cig you sneaky bastard oh God I don't like any of this Greg I see it oh my God that guy sees him fluffy whether you're Whispering or not he can still the voice is still registering go away I love you you know that this is terrifying you're hearing everybody else be attacked look at the teddy bear great get the teddy bear now the teddy bear will help me I think I saw it somewhere here oh **** the battery for the car over here I got the keys get the keys who's dying I think **** D just died oh he's",
            "start": 3887.68
        },
        {
            "text": "the teddy bear now the teddy bear will help me I think I saw it somewhere here oh **** the battery for the car over here I got the keys get the keys who's dying I think **** D just died oh he's outside my house oh I don't think he's at my house now if if he all right Greg you're almost at the shooting range so Jason only pops up on the bottom right radar he doesn't pop up on the map right okay what do you mean the shooting range what do you want uh the archery range yeah archery range I'm still way away from the archery yeah I know that's I'm saying keep going I called the cops guys all right fine oh **** the cops are coming five minutes maybe we should accommodate like may we should get closer to the cops I'm not out of we don't know where the cops son of a **** we won't know where the cops are till they're there they're going to be at one of the exits there so has a so I guess archery is kind of central for both those places want yeah let's do it come on do it oh God these",
            "start": 3954.8
        },
        {
            "text": "the cops are till they're there they're going to be at one of the exits there so has a so I guess archery is kind of central for both those places want yeah let's do it come on do it oh God these noises I think he's chasing that person yeah the guy who's running across the **** Ridge there fluffy pie was Fluffy pie fluffy muff pie fluffy muff pie yeah I'm going to wait that out a second hey B where are you **** youo it's it's good to have them as bait yeah God I'm gonna start my move Kevin wants to see the Archer range that's Zyer asked can the counselors get laid like the movies one of the loading screens has them impaled with a **** no there's no **** I'm the impaled with the skewer yeah like you know his spear thing yeah he's going to come again oh yeah every time every time it pops up as a loading screen Jen says that's how I want us to go it's so s they were killed while they were I don't know why I just I was like what does that have to do **** the **** just",
            "start": 4008.0
        },
        {
            "text": "time it pops up as a loading screen Jen says that's how I want us to go it's so s they were killed while they were I don't know why I just I was like what does that have to do **** the **** just Dr can you **** no but one of one of the guys is skewer in him I just dropped my crackers that was that him behind you yeah yeah you hold you hold it oh was just Le I'm going to put the battery in the car though just for the points I guess go for it oh **** you hear that they're putting the battery in the car just for the points I don't think they have gas in the car there's gas in the car there's gas in the car go to the car it's right there the car is right next to you oh they're over there different car different car I mean it's still not that far run should I go to that one yeah run no they don't have the keys yet look in the house next shut up I listen to them oh yeah I'm going to go hide in the building store I'm like right there too oh you are you are you are go in the",
            "start": 4070.6
        },
        {
            "text": "run no they don't have the keys yet look in the house next shut up I listen to them oh yeah I'm going to go hide in the building store I'm like right there too oh you are you are you are go in the house and look for Keys oh my coming to he's coming to me okay oh good he near the car oh he found me he me he found me he found me the car was a terrible idea go the other way go the other way I'd be the type to get into the car and be like I I only know how to drive automatic I'm coming go go go go go there's no way we're going to make D so they've got the keys it sounds like oh oh no no okay okay right he's oh man that was terrifying wait I don't think they have the keys **** I want their mic to cut out minute 38 where will the police arrive oh **** I need some help **** away from me leave me yo yo yo give me yo who's got Yo fluffy fluffy fluffy Fluffy's dead we talking about do what we're talking about fluffy is going to **** get it he's by the **** car he teleported he",
            "start": 4121.96
        },
        {
            "text": "me leave me yo yo yo give me yo who's got Yo fluffy fluffy fluffy Fluffy's dead we talking about do what we're talking about fluffy is going to **** get it he's by the **** car he teleported he teleported he teleported go go go go go go I have I got firers how many people has Jason killed so far I don't know no way to know I mean there is a way to know I'm just not going to check right now in the middle of this **** too dangerous oh no Greg use it get in dude get in go go no he's right there get the **** out oh my God there's something so special about the fact that like is he in front of us still you're in a car with two random people yeah and they're just like not even addressing the fact **** run run no you **** he got him all right 14 seconds till the cops get here you going to hide in that tve that stamina fluffy muff is dead he got it right he got cut off where the cops at where the cops at yeah where the cops at okay oh **** where are they I didn't see",
            "start": 4211.12
        },
        {
            "text": "you going to hide in that tve that stamina fluffy muff is dead he got it right he got cut off where the cops at where the cops at yeah where the cops at okay oh **** where are they I didn't see it's just the other side of the map they're there just the other side he'll get there oh oh my God Gregory Miller oh no hero sword me oh God I don't like it Greg is the car working still no the car's **** the car yeah car is no longer a viable form of trans he toed it with just like his fists oh bre the window Jason Jesus screw this oh God I'm coming in oh my God I'm coming in so hero sword is is Jason yeah hero sword is Jason it's not as threatening when you can hear you can hear him yeah oh God Greg what are you do the delicate dance has begun go go go run Greg run oh no oh God God Greg Greg oh my God he's right Greg oh God God no get get get get between some trees for no stay out in the open it's more safe that way why is she tripping why is it black and white I am slick huh I am slick",
            "start": 4287.08
        },
        {
            "text": "oh my God he's right Greg oh God God no get get get get between some trees for no stay out in the open it's more safe that way why is she tripping why is it black and white I am slick huh I am slick huh so you have a buddy near you or he's on the radio I don't know I don't know I don't know what's happening a lot of things have happened here that I'm unfamiliar with this uh form of Jason oh God run to the cops Greg I'm not close enough to run yet you're so close look you think I can make that in a run yeah maybe I'd rather save it for when I see him okay sounds I mean like when he actually pops up that's when I have to **** I just don't want the cops to leave will the cops leave I mean no no the cops won't leave the cops you just get when you get to them they're just what do why aren't they coming out they they're afraid of Jason like we're not going in there see he's killing somebody over there oh **** all right now run really right cuz he's killing someone I mean I'm",
            "start": 4365.6
        },
        {
            "text": "why aren't they coming out they they're afraid of Jason like we're not going in there see he's killing somebody over there oh **** all right now run really right cuz he's killing someone I mean I'm going to but then I'm going to make noise he's going to see me right now theoretically he doesn't know where I am the other guy's getting **** because my guy stared as **** and I'm hurt it a game all depends on your fear level pumping for pump says at least we can remember her booty trying to get to you in that booty you that's a good s oh black and white because he went through the broken window is that why I think black and White's my fear level yeah I think yeah that makes more sense **** I'm afraid right now leave me alone says tpine why is she so scared I don't know I mean she's seen her friends get kill oh it makes your **** radar gr that sucks they have a lot of cool game mechanics in this thing really cool interesting stuff Pini says Kevin would be the first to die in the",
            "start": 4433.72
        },
        {
            "text": "her friends get kill oh it makes your **** radar gr that sucks they have a lot of cool game mechanics in this thing really cool interesting stuff Pini says Kevin would be the first to die in the Friday the 13th movie no I doubt it I think you would actually no the funny fact kid lasts for a while I feel like we're almost in where I can just Sprint and make it territory you would eat M&M's and be loud about it no I wouldn't that's how I live life don't mistake how I live life with how I would survive Andy I'm running run Greg can you hop down that yeah MC Lord says your character has one out of 10th one out of 10 stealth anyway it's time to run all do you want to slow down a little bit give yourself that little extra in case you need to run again later no it's right here okay **** it isn't right here your flashlight helps you raise your fear level oh God Greg you're so close holy **** you're so close dude I mean you got the bat I feel like we're pretty safe at the moment",
            "start": 4479.2
        },
        {
            "text": "right here your flashlight helps you raise your fear level oh God Greg you're so close holy **** you're so close dude I mean you got the bat I feel like we're pretty safe at the moment that's what they want you to think that's what they want you to think I see you can see the lights though oh you're good dog you're good hell yeah dude **** yeah oh man that was a tough one **** yeah Heroes sword get **** oh man it was really scary though when he popped up behind you was like doing this can't hide from me Little Creeper damn he looks **** up turn into liquid can we get Greg's character's tracksuit on the RT store oh you were the last one too apparently let's see who was ex ex ex exxi good godamn Escape seeking destroyed Escape I'm the only oh no jaw ripped why is the The Meters changing with the affixiated it's their ping or whatever multiplayer **** crazy stuff I don't even know what that means steam stuff steam stuff dork dork nerdy **** you want to do",
            "start": 4526.44
        },
        {
            "text": "the The Meters changing with the affixiated it's their ping or whatever multiplayer **** crazy stuff I don't even know what that means steam stuff steam stuff dork dork nerdy **** you want to do one more yeah last one do one more hopefully you get Jason again yeah Jason someone asked if we can invite fluffy muffpie to can what else what sort of improvements would you like to see in the game like like items or like how do you envision DLC being cuz like Dead by Daylight what brings you back is hey we added a new killer we added a new monster but in Friday 13 you're just Jason you know like yeah yeah well I would like to see can you m them all actually more maps different counselors more perks easier perks to get maybe ATVs yeah ATVs of course Jets call air strikes uh yeah I mean like more I don't know a perk problem maybe there is one too be able to find gas and key and Stu cuz like that's the thing of like the key is kind of an needle in the H stack you know what I mean",
            "start": 4600.92
        },
        {
            "text": "like more I don't know a perk problem maybe there is one too be able to find gas and key and Stu cuz like that's the thing of like the key is kind of an needle in the H stack you know what I mean like that guy had it and died I don't know what happens that key does it respawn somewhere does it go somewhere else interesting probably on his corpse probably his corpse I don't know though I've never picked any or seen anything to pick up from somebody's corpse you know you know yeah no I understand try get to you that booty trying to get to you and that booty uh got some more tips here cilio art says I want to see that clip of Jason streamer murdering the entire group could you please give the link please go to the go to the Friday the 13th game Reddit uh it's on there uh Red Rising 95 during Andy's hiring process did Nick make him go to a windowless room sit on a black leather couch and do sexually explicit things while threatening his employment if he didn't comply uh we have who whoa",
            "start": 4665.72
        },
        {
            "text": "Andy's hiring process did Nick make him go to a windowless room sit on a black leather couch and do sexually explicit things while threatening his employment if he didn't comply uh we have who whoa you're not legally allowed to answer that as HR it's a Patreon exclusive it's going to drop pretty soon Jason Takes Manhattan DLC the chat's talking about Freddy DLC says H Thorne greed ear says Loot Crate microtransactions pay to win features would be nice his face every time I can't take it Chad let's see what we got this time I could in it would be a lot helpful if likeon if all of them were here we go oh **** yeah God is smiling down on us today and we murder people **** up their lives Greg kill them all Jason right outside that audio Yeah that audio is not great that's not normal I don't know what that's all about that that's with our setup sometimes it does this is it just the TV no it's the connection into the the thing I I don't know entirely 100% some of the uh recent uh let's",
            "start": 4707.68
        },
        {
            "text": "know what that's all about that that's with our setup sometimes it does this is it just the TV no it's the connection into the the thing I I don't know entirely 100% some of the uh recent uh let's plays having that issue too well wait what do you mean I'll tell about it when we're done wait really yeah I those are recording differently they shouldn't have had that issue it's only in certain moments where it Clips you know yeah essentially what what it is is when you start the PS4 if it's connected to the recording device somehow it like talks to it and knows where the where the the max audio is but then if you connect it to another device it can peek it out getting pretty inside baseball here hey man hey what was that light gray view right now why did it like uh I was trying to use my sense but I guess there was nothing to sense oh okay okay I oh look at this kid try to shut it dummy why are you sitting just stand there scare them I want to put down a trap oh Lord kid kush look for",
            "start": 4762.68
        },
        {
            "text": "but I guess there was nothing to sense oh okay okay I oh look at this kid try to shut it dummy why are you sitting just stand there scare them I want to put down a trap oh Lord kid kush look for the other window going to jump out the other window I bet oh there she is I want to see what at with the door situation was so whatever door I start to work on it's what door they're going to go through now what I'll do is I'll surprise him go hack at the back door and try to flush him out the front oh okay so we'll have to listen for that **** and oh so when the game starts your sort of wraith mode slowly builds I see rage mode no wraith rage mode shift okay no clink no you think they ran out the back door they're still in the house apparently oh wow b b bold technique you going to bust through the walls no it don't take too long I don't have that rage mode thing uhoh there she goes oh she's smart **** move throw a knife no no no we'll just warp on her back warp on her back warp all over",
            "start": 4825.12
        },
        {
            "text": "the walls no it don't take too long I don't have that rage mode thing uhoh there she goes oh she's smart **** move throw a knife no no no we'll just warp on her back warp on her back warp all over guys don't make me laugh when I'm trying to kill these people oh there she is look how sneaky she is sneak oh back in the house oh she's **** terrified she saw you behind her warp all over her back don't get it in her head though you guys are the worst help me help me help me help me what's kid Kush saying how stoned out of his mind is kid Kush right now oh you're **** ah ah two w dude help me do you have a gun dude this gu is gay just try throwing the knife oh she's **** oh you're **** no what the **** hell yeah there it is oh kid that's a good first God damn says kid C he can't take it it's a good first kill right there get on the board there it is that's what you're talking about you just need your first one yeah what's on the top of the the house",
            "start": 4893.96
        },
        {
            "text": "damn says kid C he can't take it it's a good first kill right there get on the board there it is that's what you're talking about you just need your first one yeah what's on the top of the the house there uh those are the throwing knives if you want to start collecting those bites got to get to you God you got that song on my head got to get to you in that boot o someone with this stand you're playing smart Craig fluffy muff pie come over here big boy you have a gun oh sh meu I'm gonna die I love hearing fluffy they're all going in the same house look at that look at that oh my God throw a grenade in there flush him out windows windows yo are you at bberry Camp is that the four seater oh they're getting the the car is it the four seater I'm coming should I go to one of the cars yeah go to one of the cars yeah go to the car by Blueberry Park go to the car directly in front of you and just wait in the road no can you just **** up the car while it's not going no that's probably smart",
            "start": 4970.16
        },
        {
            "text": "one of the cars yeah go to the car by Blueberry Park go to the car directly in front of you and just wait in the road no can you just **** up the car while it's not going no that's probably smart so they're in there someone is still in here okay interesting but now we do have an interesting choice it looks like you can't correctly placed down that house in The Sims when it's highlighted red oh oh you should just start breaking in cuz I think don't you have traps on both windows not all the windows but some windows yeah working on the door **** up fluffy muff pie there you go yeah no okay glitchy I'm talking about glitchy glitchy you're too big for the door you're too big for the door oh that was not the problem but native fantasy there it is there it is you're my native F oh they took the car like yep right there oh I love this this is going to be great which way are they coming right there check your map though I can't I used it no I can't oh I know I",
            "start": 5042.08
        },
        {
            "text": "F oh they took the car like yep right there oh I love this this is going to be great which way are they coming right there check your map though I can't I used it no I can't oh I know I didn't realize the map had limits but you're right I think yeah they're coming that way now can they drive off the road I mean c I think in certain SP spots you can yeah I don't I don't think this spot is going to be one where they're going to be able to get out oh my God is the map back oh no there they are oh you should go shoot him real quick yeah yeah go shoot him real quick the car goes backwards better not get behind me I'll run your ass over oh okay no he's telling his friends don't get behind me oh hey there you go good move kids they still have to go this way with the car though it's the only way out no there's got to be another one right now oh is there oh no you're right it is the share button is the back button is what it it's what it oh my god oh I see oh God let me out I see at",
            "start": 5104.04
        },
        {
            "text": "only way out no there's got to be another one right now oh is there oh no you're right it is the share button is the back button is what it it's what it oh my god oh I see oh God let me out I see at the pad not the button guys by the way oh okay I see I see do they all get out of the car no it's still reversing they got no choice but to reverse it's so doofy to see him in the distance I love this ghost mechanic thing there it is oh **** great kill one kill one shoot him oh **** okay good oh **** **** **** **** nice job what a good game don't let them they got back in the car totally **** the car's **** she doesn't know come on come on come on **** all right she left behind the guy who saved her all right teleport you know where the car's going to be they might go left though no no but like at the triangle at the triangle the at the Y oh I think she stopped to wait for her friend oh really oh that's so sweet of her well **** he saved her like **** oh here",
            "start": 5169.88
        },
        {
            "text": "left though no no but like at the triangle at the triangle the at the Y oh I think she stopped to wait for her friend oh really oh that's so sweet of her well **** he saved her like **** oh here we go so no turn it then I should be facing the correct way yeah maybe which way do I need to go oh oh my God how unex there we got get **** oh you're **** Elvira's done die do something Jason Jason **** hell man Jason Jason Jason Jason that sucks **** hey it's fun it's good game there we go go get this **** ass go get him go get him yeah he's fast he's one of them quick kids this is bizarre oh you're so **** good job saving your friend yeah dreaded fool hell yeah now let's find her friend they deserve to die Jason make them suffer yes mother oh yeah why did air cross the road to get **** killed is it the Halo sound oh yeah oh oh **** oh man she **** juked your ass Barry Sanders style yeah oh she ran in there oh my god oh no she come on God I got to be play better",
            "start": 5235.56
        },
        {
            "text": "to get **** killed is it the Halo sound oh yeah oh oh **** oh man she **** juked your ass Barry Sanders style yeah oh she ran in there oh my god oh no she come on God I got to be play better with the animations you have traps no no more it doesn't matter she didn't lock this door yet oh got her she might be running back to the car she probably jumped out the window no still just looking at the window **** oh now that's going to take a while yeah that was bad that's bad oh man I'm just going to war back to the car cuz I have a feeling they as I don't I don't know **** about the car apparently I thought the car would be dead after that first hit no no well like I him them hitting you doesn't do anything but you doing the **** D is what destroys it well but I I hit it twice that way you know did you hit it or did they just run when they hit me that's the oh okay okay she's outside I can't tell no yeah yep the total loser says they going to learn a day the",
            "start": 5327.28
        },
        {
            "text": "I hit it twice that way you know did you hit it or did they just run when they hit me that's the oh okay okay she's outside I can't tell no yeah yep the total loser says they going to learn a day the **** is get her jump window oh oh **** why not oh thr Dart I could do it I don't have any what does she have is that a gun knife I think knife okay God take it CH I really want this to be the final just like she's a big window person yeah oh she's already out oh was that a trap no was her I put down a trap okay got it is this the same one that we were watching win the other time oh she going to learn back in later throwing knife oh there we go a little tiny guy she's going to sneak out she's going to like pop out there she is throw a knife her through the window oh if you do this Greg oh my God MLG I want it to happen so bad she's thinking of going to the door pop out it's okay who would have thought that damn I used up all my traps Jason isn't a **** accurate",
            "start": 5398.6
        },
        {
            "text": "this Greg oh my God MLG I want it to happen so bad she's thinking of going to the door pop out it's okay who would have thought that damn I used up all my traps Jason isn't a **** accurate knifethrower goes more for Brute Force you know yeah I see her over there see if I can scare her I can't scare her is there anyone else left I don't I want to see if she hops out then I'm going to she probably hopped out right no sheing out she's hopping out she hopped the **** out did she there she go I love this this is that's someone else yeah she's way too fast that's her keep in mind there's different they you can be multiple characters so it might not be exactly is she escaping she just escaped right oh did somebody call the cops oh **** survive this round two terrible my wor ever embarrassing why I just got so hung up on her yeah I know I know it's okay you got obsessed with her you know just like Jason does just like Jason does just like Jason ladies and gentlemen this",
            "start": 5491.16
        },
        {
            "text": "ever embarrassing why I just got so hung up on her yeah I know I know it's okay you got obsessed with her you know just like Jason does just like Jason does just like Jason ladies and gentlemen this has been the kind of funny Morning Show plays Friday 13th thank you for joining us the holiday let's get through any tips and Subs we got here um you want to end the let's play are we putting it up as a let's play you think was it good enough to be a let's play was pretty good all right cool that's me playing uh let's play people on YouTube that's me playing uh that there Friday 13th I like it a lot uh if we're doing that here when I get to the lobby I'll jump out and go roll some new perks show you what that looks like okay all right cool uh while I do that though looking at Twitch people um okay no more tips so we're closing tips tips are called I'm going to back out of this thank you for uh your support appreciate your so you go to customiz well first off progression here you can see",
            "start": 5567.96
        },
        {
            "text": "okay no more tips so we're closing tips tips are called I'm going to back out of this thank you for uh your support appreciate your so you go to customiz well first off progression here you can see all my badges okay I got all these cool badges I've got you know what I mean Chad face the car I should have get twice cuz I stopped it twice but no big deal you know what I mean kill all the counselors I've done twice no big deal you know what I mean you know what I mean pretty cool oh so you've killed all eight seven okay we now jump to customize well here let's before I haven't done anything oh well let's see how many Jason I got so I got this Jason I don't like the spear you know what I mean I got this Jason I like this dirty looking Jason yeah okay well then he'll be mine now let's see what grab kills you want to give him all right now right now we have the choke of course classic mhm and I could buy some new ones I got that the XP here to spend it on but my thing about it is I don't",
            "start": 5614.24
        },
        {
            "text": "grab kills you want to give him all right now right now we have the choke of course classic mhm and I could buy some new ones I got that the XP here to spend it on but my thing about it is I don't know if it really does it really help what's no I think it's just Aesthetics I don't know if I get more of them or something bear hug oh head rip what's the third one the one of body SL head first right into the ground oh wow okay but it's one of those I don't feel like I'm Jason enough to really make use of it you know what I mean yep I see what you're saying you'll get more points and the other ones up probably jumping the counselor's here so here's where you go first off have I unlocked any new clothes yet no no I have not level I can't wait until you do I'm really excited I'm kind of sick of the track suit myself yeah here let's roll a perk just two for medical all right I never use medic sprays know I mean usually Jason grabs me I'm dead sure roll new per here heavy mover speeds up the",
            "start": 5658.56
        },
        {
            "text": "the track suit myself yeah here let's roll a perk just two for medical all right I never use medic sprays know I mean usually Jason grabs me I'm dead sure roll new per here heavy mover speeds up the amount of time it takes to barricade doors it's not bad I mean I feel like it's just kind of the go right like huh I guess so yeah good point good point good point unless you're like this is you know unless you're against the clock racing Against Time Racing Against Time for Your Life grinder I already have this one it's where you get to **** guys on the internet whoa no no no it is not right it's not the inter real life yeah this is this is wait hold on yeah I got I got this is a dumb one so I'm going to sell this perk oh you can like do a little Buy back yeah the ones I don't want there I could take it and I got  00 back trade in exactly I pictured these people who trading in like GameStop employees like I will give you like two CP for that I'll give you two CP for that not getting a",
            "start": 5703.96
        },
        {
            "text": "could take it and I got  00 back trade in exactly I pictured these people who trading in like GameStop employees like I will give you like two CP for that I'll give you two CP for that not getting a lot of good stuff here but then again I don't you know who knows all the perks you last roll while inside sling bag you have a chance to avoid Jason it's g I feel like you're the type of player who's on the move and that's why I have levelheaded I can avoid Jason altogether light less noise while I Sprint you know what I mean then I'm grinding out the XP because I want as much xp as I can but yeah nothing n of these didn't do a lot there's the Tinker one which I probably should keep using because now I've been using that Mick with a mouth says uh part seven is my go-to Jason something about it looks cool something about it looks cooler than the choke I guess he maybe has some sort of Animation that looks no no no that's what all these different animations back there were sure but just for",
            "start": 5754.92
        },
        {
            "text": "looks cool something about it looks cooler than the choke I guess he maybe has some sort of Animation that looks no no no that's what all these different animations back there were sure but just for as little as I get to play as Jason you know what I mean doesn't I also believe that's Nate Mckin I think okay hey Nate ladies and gentlemen thank you for watching this let's play on youtube.com/kindafunnygames it's Friday 13th usually they're more polished than this put together but we wanted to give you something here to show this game off because I really like this game big fan of this game I had a lot of fun watching won't get time to talk about it this week though you know what I mean so I wanted to toss this out there we got a couple things going on Kinda Funny Live Gamescast we're making 3 predictions there's a whole rig them a roll things happening so until next time it's been our pleasure to serve you",
            "start": 5801.88
        }
    ]
}