{
    "id": 2625,
    "video_id": "vC4bFU7DB0g",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Greg Miller Got Married (Continued) - The GameOverGreggy Show Ep. 179 (Pt. 4)",
    "description": "Genevieve Miller joins us to tell the whole story of her and Greg's love.\n\nThanks to Blue Apron for sponsoring this episode. Go to http://www.BlueApron.com/greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1494486004,
    "duration": 1125,
    "transcript_chunks": [
        {
            "text": "Hey, guess what we just did? Come and find out at Kinda Funny Live 3. Buy your tickets at KindaFunny.com/KFL3. You know what moms love? Food. You know what you love? Food. What I mix it with? Blue Apron, best friend. Yeah, I wrote that. For less than $10 per person per meal, Blue Apron delivers seasonal recipes along with pre-portioned greens to make delicious home-cooked meals. Choose from a variety of new recipes each week or let Blue Apron's culinary team surprise you. Recipes are not repeated within a year, so you'll never get bored. What's cooking in May? Glad you asked. Patreon supporter James Hastings: beef teriyaki stir fry with sugar snap peas and lime rice; baked spinach and egg flatbread with sauteed asparagus and lemon aioli. Sounds good. Three cheese baby broccoli, it's tomato oregano dipping sauce. No, I'm not, not nothing. Crispy Smashed Rösti Potato Salad with pickled mustard seeds and some kind of sauce I can't pronounce. You check out this week's menu and get your first three meals free with",
            "start": 0.0
        },
        {
            "text": "No, I'm not, not nothing. Crispy Smashed Rösti Potato Salad with pickled mustard seeds and some kind of sauce I can't pronounce. You check out this week's menu and get your first three meals free with free shipping by going to BlueApron.com/Greggy. You will love how good it feels and tastes to create incredible home-cooked meals with Blue Apron. So don't wait. That's BlueApron.com/Greggy. What else you gonna eat? A shoe. What Sean destroyed it? Did a great job. We did a whole bunch of crafts photos and then we wanted to interstitials of photos in places important to us. So first off, of course, was Wing Wings. When two Wing Wing Wing Wing is not open on Mondays, as you know. Yeah, not open on Tuesdays, but it does matter for the story. Not open on Mondays. Christian, the owner, the homie, family, the homie. I put up a whole Instagram sappy post about how much Wing Wings means me. It is a home away from home here in San Francisco, and he opened it for us. It was just him. He cooked for us.",
            "start": 59.04
        },
        {
            "text": "Family, the homie. I put up a whole Instagram sappy post about how much Wing Wings means me. It is a home away from home here in San Francisco, and he opened it for us. It was just him. He cooked for us. We took whole into photos with us, little stuff. Showed my dad around, you know, number one crane operator Greg Miller had a bunch of questions about her in the business. Showing mom around, giving us all this free beer and stuff. We didn't get any money. I realized after the fact, I do gave everybody T-shirts. It also Christian's **** awesome. If you're gonna Kinda Funny Live 3, go in and see him. Not just because, as always, I've said Wing Wings is great, but they are family and they were amazing. The photos there are my favorite ones from the wedding. Just, they're so good, so us. You know, I know because that was our relax too, because we just came back from the wedding. Yeah, everything we've done, right? And that was the things I never thought about it. We were setting up that it was like, \"Alright, cool.\"",
            "start": 121.93
        },
        {
            "text": "That was our relax too, because we just came back from the wedding. Yeah, everything we've done, right? And that was the things I never thought about it. We were setting up that it was like, \"Alright, cool. Now it's our reception and this is appetizers.\" And I never really, it never dawned on me that's what we were doing till we were there drinking out of there like that. We had, we poured Dales Pale Ale and the Los Gigantes into these like fine crystal engraved things my mom got us. And she was totally down in a red. Awesome. I love the the chicken wing sauce on the boobs. Yeah, that's possible. But there, you know, that's that's where we went on our third date. It's one of those like, obviously means so much to me, but that's something that I think means something Jen in our relationship in the fact that that I shared that so early with her, like what that place means to me. I'll never forget taking other first time she was drunk. It's like, \"I want Wing Wings.\" Where with some friends we went there and",
            "start": 156.1
        },
        {
            "text": "That I shared that so early with her, like what that place means to me. I'll never forget taking other first time she was drunk. It's like, \"I want Wing Wings.\" Where with some friends we went there and she's like, \"What do you get here?\" I'm like, \"I usually get buffalo regular and I toss garlic on there and I tossed bacon on that, something crazy. And I'm feeling crazy tonight, but it might be too hot for you. Don't do that.\" She's like, \"No, totally fine. I'll be fine.\" We've ordered that, sat down. Again, I'm drunk, so I just crush my wings. And I finally look over and she's got like one done and one shaking of a bite out of it. I'm like, \"Is it too hot for you?\" He's like, \"Fine.\" And I'm like, \"We can get you anything. There are, I know these people. We can get you every side. Wash, mom.\" \"No, I'm gonna finish them. I don't want to waste any food.\" So I ate all of them. She was, it was, you had the fiery poop definitely and you're definitely too hot for them. Our analyst Ben Ball, so do that, have that. But then there was a moment where like,",
            "start": 189.34
        },
        {
            "text": "Any food. So I ate all of them. She was, it was, you had the fiery poop definitely and you're definitely too hot for them. Our analyst Ben Ball, so do that, have that. But then there was a moment where like, I'm being a dick again, back shouting out Sean Finnegan. How great is the shark in the way that you know how I am? You know how I am. Everyone knows how I am. This had been a secret killing me. The number of tweets I deleted leading up to it of like kind of teasing something, but I'm like, \"No, I don't wanna do that. That's not what's about, obviously.\" But I'm so excited. I want to express that. I'm expressed all my best friend. Like I was like, \"I need, I, when we were starting to take photos, only can you start taking some of my iPhone?\" \"Sean, a camera, take some of my iPhone. I want to put something up today saying.\" And we did this, that we had this last moment. And Sean's like, \"Well, with this camera, I can just, you know, it becomes a hotspot and I can send them to my phones and I can edit them on here and give.\" \"Oh my God.\"",
            "start": 225.94
        },
        {
            "text": "We did this, that we had this last moment. And Sean's like, \"Well, with this camera, I can just, you know, it becomes a hotspot and I can send them to my phones and I can edit them on here and give.\" \"Oh my God, they'd be **** awesome.\" Like I do in the car on our way to one. You mean doesn't work? The app's ****, shit's bad. Nothing's working, you know what I mean? And so we get there like Sean's setting up, take photos there. And it was like, \"Can I just try one more time? Can I try?\" And I'm like, \"I know it's not you. Let's try to make the camera.\" Still didn't work. I'm like, he's like, \"Sorry, man. I should have bought a laptop unless you have a computer.\" I'm like, \"I don't, but Wing Wings does. Oh my. Hey Christian, can we use a computer?\" \"Yeah, of course.\" You went back there and Sean popped out the card. It did and went through and showed us photos. We Pixel XL and he put them on his phone. He's editing them, blah. And then I was like eventually like, \"Awesome. I know I just made you do that, but can you stop doing that and start\"",
            "start": 269.0
        },
        {
            "text": "Showed us photos. We Pixel XL and he put them on his phone. He's editing them, blah. And then I was like eventually like, \"Awesome. I know I just made you do that, but can you stop doing that and start taking more photos here?\" Because it finally dawned to me of like, I mean, my happy place in San Francisco. I have my parents here who are never together. I have my best friend here. I have her family here from Montreal. Like this is creating like everyone's talking to each other. Like to see my dad talk to Christian about what it's like to run away. I was like, \"Eh, what the? Swap your own little world, right?\" Yeah, yeah. This is never something I thought would be a thing, you know what I mean? Sean took amazing photos of that. And it was this awesome moment for us, for me, you know, new knowledge, different things. And then we went from there to Hard Water, the bar, another place in the Embarcadero. We talked about all the time or whatever that Colin lost favor with when they switched over to being seafood that I love.",
            "start": 302.33
        },
        {
            "text": "Then we went from there to Hard Water, the bar, another place in the Embarcadero. We talked about all the time or whatever that Colin lost favor with when they switched over to being seafood that I love them more, that they're more seafood. They still have awesome fried chicken, and I put more other southern dishes back on there. I digress. We walk in though, it was our, that's where we went on our first date. They reserved the bar for us. They reserved our stools where we had our first date. So we got to sit at those stools and be with our, surrounded by our family. And they gave us, oh great, they were awesome. They made this awesome cocktails. I'm sure they like, as soon as we got there, a guy came up to me was like, \"Hey, congratulations. What, what?\" You know, I don't, \"Thanks so much.\" And then they like to Sean, like, \"You want to come behind the counter and take photos?\" Like, you know, all this different stuff that normally doesn't get to happen. So that was just fun. What was that? I knew that'd be great. I knew",
            "start": 340.91
        },
        {
            "text": "Like, \"You want to come behind the counter and take photos?\" Like, you know, all this different stuff that normally doesn't get to happen. So that was just fun. What was that? I knew that'd be great. I knew Wing Wings, we're in a new City Hall, would be great. And then dinner's over at Water Bar next to Epic Steakhouse. Um, the one thing I didn't ever plan out in my head thinking about how amazing this would be and like what a special moment this would be and what like literally once-in-a-lifetime moment this would be was that when we finished in Hard Water, we were gonna, we take about a Sean because it's not working to go home. He's just a, he's, you knock off, you know, enemies. I take photos of everything in the Water Bar's closing up or I turned everyone like, he's every down to walk. Like it's like a ten minute walk. It's not that bad down the Embarcadero. It's like getting close to sunset. It's a beautiful sunny day out. Super hot this week. It's been, you know what I mean? It was beautiful out and we're like, \"Yeah.\"",
            "start": 375.56
        },
        {
            "text": "Walk. It's not that bad down the Embarcadero. It's like getting close to sunset. It's a beautiful sunny day out. Super hot this week. It's been, you know what I mean? It was beautiful out and we're like, \"Yeah.\" And so he's had this train of people walking led by Jen and myself, or Jen and her family and me and my suit, her in her wedding dress and her bouquet. And for a while I'd be behind her with Poe or my mom or whatever, then be with her or whatever. But V, it is now Embarcadero. If you're not from the San Francisco, like a touristy stretch along the bay, an amazing view of the Bay Bridge and all the stuff. And the cars that would slow down and honk and scream congratulations. The people that would stop and say hi and congratulations that keep going. It was like such an amazing moment, let alone to be walking behind Jen and see people. I do the double take and walk and stop like I like talk to each other, not to us even. It was just like, what a **** awesome thing for us to do. And like I have this moment.",
            "start": 413.3
        },
        {
            "text": "Behind Jen and see people. I do the double take and walk and stop like I like talk to each other, not to us even. It was just like, what a **** awesome thing for us to do. And like I have this moment. And like, \"God, thank God you wore the Converse. You bought your first pair of Converse.\" I love that. I saw, I didn't catch that until I fixed the last picture I saw of you guys where you were, I guess you're cuddling off all pictures. But yes, although the Converse peeking out here on the stairs, I think it's such a great idea. Watch. Yeah, yeah. And they they have those amazing pink mesh ones that kinda look like a dress fabric. It was great. Yeah. Oh yeah, with the Water Bar, had a lovely dinner. Mmm. Got a whole bunch of oysters, too many mushrooms. CD. Yeah, yeah. I had to talk Jen out of ever getting, and they were, had to talk Jen out of getting the giant seafood platter for herself. She went, got a petite one instead, which I didn't finish. Yeah, so I was right. You're on call. Exact, exact. Oh, it's been a waste of money. Yeah.",
            "start": 450.41
        },
        {
            "text": "Talk Jen out of getting the giant seafood platter for herself. She went, got a petite one instead, which I didn't finish. Yeah, so I was right. You're on call. Exact, exact. Oh, it's been a waste of money. Yeah. At that point, you couldn't just throw it back into the sea. Do you guys have a time off this wedding for so long? Yeah, like there's been so much just update and we'll have it won't happen in terms of logistics. What winning exactly? A big thing. So I've always been a cool Tappan. It sounded like to me, it's been happening since like November, right? So it's just like you kept talking about your plans. Yeah, it's like, yeah, so we're going to do this, then we resist, resist. But hit the point where it kind of goes over my head. We're just talking and I'm like, \"Cool, it's going to happen. I know it's this weekend.\" Cool. Sunday comes along and I text like, \"Congrats, you guys. I'm excited for you.\" Whatever. Totally thinking you're getting married on Sunday. And then on Monday, you start posting things. Mike, \"Huh, man, 'cause\"",
            "start": 495.02
        },
        {
            "text": "Cool. Sunday comes along and I text like, \"Congrats, you guys. I'm excited for you.\" Whatever. Totally thinking you're getting married on Sunday. And then on Monday, you start posting things. Mike, \"Huh, man, 'cause\" I'm Monday, Bernie was here. Yeah. And I gave you the text of like, \"Hey, like Bernie's gonna be here. We're gonna do the show without you. Don't worry. It's all good.\" Totally kind of giving you the like the bait of like, \"If you want to come in and do it, you can.\" Yeah, good. 'Cause like I thought that was just you're just taking the day off. Share like a, like it's not a honeymoon, but like a Monday. She laughs. Yeah, which we did not do a new dress. We turned out pack boxes anyway. But it was just so funny because all like I was so off about the whole thing. And then that's done. Well, I mean, that thing, the whole thing has been so incremental that I think it really snuck up because it was the thing of I remember when we finally were like, \"Alright, cool. It's going to be this weekend. It's gonna be May 1st.\" All the",
            "start": 535.88
        },
        {
            "text": "Has been so incremental that I think it really snuck up because it was the thing of I remember when we finally were like, \"Alright, cool. It's going to be this weekend. It's gonna be May 1st.\" All the family and data and putting it on the calendar. And then like, yeah, is that I I think, you know, life moves so much quicker as you get older. I feel, you know, my parents always saying that it's gonna go faster and faster and faster. And the thing especially with us, I find about how fast our life goes where you go, \"Remember that we do the podcasts where I was like, 'Well, remember in February this comes out?'\" You guys like, \"It's March. Like it's gone. Let's do it.\" It's the fact that for us, it we're so event based that there's always an event before the next event and there's always even after the next event. So it's like, sure, Kinda Funny Live 3 now is right on top of it. But I have a work trip next week and a work trip after that. And then it's Kinda Funny Live. And then at E3. And then it's Comic-Con. And",
            "start": 577.19
        },
        {
            "text": "It's like, sure, Kinda Funny Live 3 now is right on top of it. But I have a work trip next week and a work trip after that. And then it's Kinda Funny Live. And then at E3. And then it's Comic-Con. And then it's big, you know what I mean? Like there's all these different little things that get Astro parties in there too, somewhere in there. Yes, G-Give Dog. Uh, that email's going out real soon. Cast good tonight. Already seen the preview video for it. There's a video, there's a trailer. It's good. Where's the trailer from? What your after party? Oh, right on. It's **** good. No, it's fine. It's fine. But it's that thing of like, you, I always make the joke of right there like, \"Yeah, I will. I have to look at day in advance.\" So when something that's been like, \"Hey, what about next time?\" Like, \"I don't know. I can't. I can't give that brain capacity.\" People crazy. Exactly. 'Cause other people that aren't like that, I like that. I was just like, \"Oh my God.\" G has gotten used to it. But like when we have to plan things with her friends or",
            "start": 614.48
        },
        {
            "text": "That brain capacity. People crazy. Exactly. 'Cause other people that aren't like that, I like that. I was just like, \"Oh my God.\" G has gotten used to it. But like when we have to plan things with her friends or even my friends, oh, it's a disaster. But yeah, you're telling me Tim doesn't know what he's doing in two weeks, so you can't tell me if he's, I'm like, \"I can't tell you.\" Yeah, no, yeah. I can tell you what I'm doing tomorrow. And like, \"W\" so many times we're traveling. It's like, \"You you mean you can't tell me what to tell you guys are saying that?\" I'm like, \"I have no idea what I know there is a hotel.\" Yeah, that was amazing. Roof. Yeah, that was a story of my life trying to plan family and friends to active activities because my job was also super event-driven. So I'm happy we know. Yeah, that's life pace. And structurally, I know you're not gonna know what you're gonna do in two weeks. Mhm. I'm going to get back in there. That was why this something was such a weird wrench in the works of like, \"I cool. Like, okay, we got\"",
            "start": 653.05
        },
        {
            "text": "I know you're not gonna know what you're gonna do in two weeks. Mhm. I'm going to get back in there. That was why this something was such a weird wrench in the works of like, \"I cool. Like, okay, we got to end of like, it's going to be a month turnaround time. These letters from the government.\" Okay, fine. And then we've got that, got approved. It got passed off. Then you have to do this interview. I was like, \"Okay, how do I say is when they're you figure how to schedule the interview where Jen's got to go to the consulate in Montreal, the American Embassy and talk to somebody there.\" And she does that, but she preps for it for weeks and had fine. You're she's these giant binders of every factoid about me, every fact about a relationship. She's got plane tickets. She's got berths. And he's got everything, everything, everything. I'm like, \"This is awesome. I bet you're over preparing for this.\" Like, \"I what we got to do just on my understanding.\" And so she goes in there and when you go in there, they take your passport.",
            "start": 693.49
        },
        {
            "text": "Everything. I'm like, \"This is awesome. I bet you're over preparing for this.\" Like, \"I what we got to do just on my understanding.\" And so she goes in there and when you go in there, they take your passport. Like they take your passport and if you're approved, they'll send it back with a visa in it. When you get the visa, you have 90 days to come to the United States on a one-way ticket, get married in those 90 days and then file for adjustment of status of becoming a legal resident. Right now, Jen's here. She cannot go home. Well, I can, but I can't come back here. Oh, really? He thought I was that you couldn't go home period without filing for Advance Parole is what they call it. Yeah, I mean, I can leave. Yeah, it's coming back that's the problem with worth. Yeah, because my visa is good for only one entry. Okay, okay. The ones I spend that entry, I can come back on the visitor visa, but we have to start all over again. And that's the thing where there's all these red tape and all these different rule housing and she",
            "start": 730.78
        },
        {
            "text": "The ones I spend that entry, I can come back on the visitor visa, but we have to start all over again. And that's the thing where there's all these red tape and all these different rule housing. And she goes in to get the interview, ask her one question, close the question, \"How'd you guys meet?\" And then I'm like, \"This is such a cool girl.\" When you go in the future, I'll show you this body half. And then she goes like, I start getting excited and getting into the story as I go. \"It's fine.\" You go, \"It's okay. Make me.\" I was like, \"Are you'll get your passport back?\" And what it was like, \"Ten, seven to ten business days.\" And then I look at her and I'm like, \"So it's approved?\" And she's like, \"You're going to get your passport in seven to ten days.\" And I'm like, \"So you're saying that I'm good?\" And she's like, \"You'll get your passport back.\" And I'm like, \"Oh, why won't you tell me if it's fine or not?\" And so I waited seven to ten days because she probably doesn't, wasn't one day. It took four days. Okay, yeah. But you could track it.",
            "start": 767.38
        },
        {
            "text": "Back. And I'm like, \"Oh, why won't you tell me if it's fine or not?\" And so I waited seven to ten days because she probably doesn't, wasn't one day. It took four days. Okay, yeah. But you could track it online. Yeah, which I refreshed. They lied. America, God bless. God bless our bureaucracy. Honestly though, the thing I really enjoyed about this entire immigration process is how you can track and file stuff online is awesome. It's all paper-based. Well, no, wait, wait until you have talked the IRS. That's always fun. I'm so excited to go to the DMV, you guys. Oh God, don't be. People spend daily on there like Disneyland. You have not seen real America until you've spent an entire afternoon in the DMV. I mean, I'm taking this with an open heart. You know, I will go there. You can either get a driver's license here. Yeah, right. You would. Because the worst, actually, they've gotten better about it. But you bring stomach something to read for something. And depending on when you go and you take out which DMV you go to, like I would do",
            "start": 809.77
        },
        {
            "text": "Would. Because the worst, actually, they've gotten better about it. But you bring stomach something to read for something. And depending on when you go and you take out which DMV you go to, like I would do some research. One is the least popular DMV. Because I had to go to that DMV one time, the one over in Hayes. Yeah. Oh, it took a very, very long. No, no. Yeah, I had to get my license renewed, I think. I think I got my motorcycle license there and my license renewed at the same time. And it was, but I'm one of those weird people, and I'll admit this, I enjoy getting someplace, being on time and waiting. Like I'll be like, \"How long? Two hour? No problem. I can be free right now.\" If I have to, I will just sit with a book. Bhama back. Yeah, be so good in the Canadian healthcare system. You would wait like eight hours and be prepared. I'd be Greg's. I never, I don't even go, but they never tell you how long it's gonna be. Oh, welcome to America. Oh, yeah. Oh, you go to the ER at America. Live like this. Yeah, we'll get you at some point. And",
            "start": 858.79
        },
        {
            "text": "I'd be Greg's. I never, I don't even go, but they never tell you how long it's gonna be. Oh, welcome to America. Oh, yeah. Oh, you go to the ER at America. Live like this. Yeah, we'll get you at some point. And also, you're not getting out of here for less than $500. Oh, wow. Absolutely not. It's not happening. I wanted to get a bike. Yeah, I won't a bicycle. Yes, wait. Oh, wait. Yeah, wait. We have because I'm so accident-prone that if I do get a bicycle, I'm going to hurt myself. And order, yeah, relatively good health here now. But okay, yeah. But like, it's still emergency room visits are always like, I think I went to the urgent care when I got my finger smashed. And I went to a fancy urgent care in my neighborhood. My wife is like, \"You should definitely go to the urgent care. Your hand looks dim.\" I make my **** thumb was like twice. Wouldn't leave me. And I was like, \"I think it's fine.\" And she's like, \"I just go get an X-ray on it.\" The X-ray itself is $300. Oh God. And then the visit was three hours in like that. And I was",
            "start": 905.71
        },
        {
            "text": "Was like twice. Wouldn't leave me. And I was like, \"I think it's fine.\" And she's like, \"I just go get an X-ray on it.\" The X-ray itself is $300. Oh God. And then the visit was three hours in like that. And I was like, \"Me, never again.\" Oh my God. Not cool. Greg and Kevin could give you an X-ray for $75. So yeah, if you go on the right day. I mean, I don't believe you. I should have called Kevin. Just like, \"Kevin, can you sneak me into whatever holler?\" But I guess they have hookups like Best Buy. A mouse. Just it just in like a business building. It doesn't even look like a, it's not hospital. Well, the thing is, I thought my insurance would cover some of this, but it did not. I guess you have to be careful. I think I'm covered by my Canadian healthcare for the next 170 days. Or you're fine though, because there's only if you're outside of the country, you lose access to healthcare after six months outside of the country. Makes I leave up and out in two weeks. They must not chicken. Yeah, don't don't uh, I was going to make a",
            "start": 946.03
        },
        {
            "text": "Outside of the country, you lose access to healthcare after six months outside of the country. Makes I leave up and out in two weeks. They must not chicken. Yeah, don't don't uh, I was going to make a bad joke about pulling the goalie. I'll just go into it. Don't pull the goalie anytime soon. Well, luckily you think don't go off birth control. Are you okay? Oh, I didn't have either. But yeah, yeah, I'll do that. Yeah, no, I've been grinding up a second dose of Rachael Ray drink. So what are you doing? Put inside our bacon isn't getting bigger this way. Control. I don't know. I thought it's the other one. So I think it's clear they're just skin. Mmm. They found out mistaken even. Oh no, that's good. Post are putting in her morning shakes. Mmm. Mmm. Right. Little squid a chore that drivers building triceps that way. Man, I don't get these things by not sucking dick. If you didn't know, didn't know, this is in The GameOverGreggy Show. Each and every week, four, sometimes five, best friends gather on this table. God damn it.",
            "start": 987.4
        },
        {
            "text": "I don't get these things by not sucking dick if you didn't know, didn't know this is in The GameOverGreggy Show each and every week, four, sometimes five, best friends gather on this table. God damn it, you were ready, but like, \"to Reddit,\" like, \"wicked.\" Ah, if you like that, head over to Patreon.com/KindaFunny or any toss us a couple of bucks and get each and every episode early along with a bunch of exclusives, good perks and goodies. I got a good exclusive goods with it, didn't make much sense. Remember, Kinda Funny Live 3 is right around the corner. KindaFunny.com/KFL3, get your tickets. Come, I assure you it will be worth the dollars you spend on it. Remember, if you spend no dollars on Patreon, no big deal. You can head over to YouTube.com/KindaFunny, wait for the show up topic by topic, day by day until it goes up as one big MP3 and video, 'cause all we have, St. Alwoosh Miller, not hyphenated middle name. Thank you for coming by. No problem. I love you. I love you too. Until next time, it's",
            "start": 1044.05
        },
        {
            "text": "day by day until it goes up as one big MP3 and video, 'cause all we have, St. Alwoosh Miller, not hyphenated middle name. Thank you for coming by. No problem. I love you. I love you too. Until next time, it's been a pleasure to serve you. I love you, Nick. Thanks for watching this episode of The GameOverGreggy Show. It was all about me and Jen. Subscribe here, support us on Patreon there, go watch other videos over here, and then there's always this mystery link that I forget what it does. What does it do? Click on the mystery link. Where's it going to take you? Go to Kinda Funny Games. That's a good channel to subscribe to that.",
            "start": 1091.46
        }
    ]
}