{
    "id": 2641,
    "video_id": "x4zdE9ExFb4",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Would Zelda Be As Loved On PS4? - Kinda Funny Gamescast Ep. 120 (Pt. 4)",
    "description": "Would Zelda be as big of a hit if it wasn't a Nintendo property?\n\nThanks to MVMT Watches for sponsoring this episode. Go to http://www.MVMTwatches.com/kinda\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1495110602,
    "duration": 1231,
    "transcript_chunks": [
        {
            "text": "Hey, what's up? Hey, I'm Andy. Kinda Funny Live 3 is happening in San Jose, California, San Francisco, California. Get your tickets on the internet somewhere, KindaFunny.com/KFLT. This episode of Gamescast brought to you by MVMT Watches. They're founded on the belief that style shouldn't break the bank. The watchmaker's goal is to change the way the consumers think about fashion by offering high-quality minimalist products at revolutionary prices. MVMT Watches started at just 95 dollars. At a department store, you're looking at 400 to 500 bucks, but they figured out a way to just cut out the middleman and make everything way cheaper, providing the best possible price. We're talking classic design, quality construction, and that style minimalism everyone's always talking about. You probably stopped being late to that thing that you're always late to, and hey, you might as well look good doing it. Get 15% off today with free shipping and free returns. They're going to MVMTWatches.com/kinda. That's MV",
            "start": 0.0
        },
        {
            "text": "to that thing that you're always late to, and hey, you might as well look good doing it. Get 15% off today with free shipping and free returns. They're going to MVMTWatches.com/kinda. That's MVMTWatches.com/kinda. Join the movement. That's up in the day. As always, it's brought to you by you. You can go to KindaFunny.com/GamescastTopic just like all these people did to leave your questions, comments, and concerns. Jon Bernhardt says, \"What if Zelda came out mid-gen on PS4 and was called Rick's Adventure? Would people still give a fuck?\" It's a very interesting thing. I definitely think people would give way less fucks. I think it would be a slow build of a fuck. Like no one would be like, 'Day one, million copies moved.' It would just be like, 'This everyone's like, if you play Rick's Adventure and play that,' and then you're playing like, 'Oh, it's adventurous, really good.' Yeah, exactly. I mean, it feels a lot like, so yeah, man. I mean, I sitting over like, remember like Oceanhorn was a port",
            "start": 40.71
        },
        {
            "text": "Adventure and play that, and then you're playing like, 'Oh, it's adventurous, really good.' Yeah, exactly. I mean, it feels a lot like, so yeah, man. I mean, I sitting over like, remember like Oceanhorn was a port of a fucking mobile game or whatever. Oh yeah, we got it. I remember being like, 'Hey, this is actually, I played this last night, it's awesome.' And then, granted, then now people are talking to me about it, but it was that thing of our audience got super behind it. They started talking, then they asked about Vita. Now it's a Vita game, now a Switch game. Like, that's a game that came not from nothing, but it is like, they only ship this Zelda clone is actually pretty good. Like, I think Rick's Adventure, but hey, this is like Zelda. Just doing that didn't work for Darksiders ever, so we'll see whatever going on there. But yeah, I wonder if thought how much it would affect review scores and people's word of mouth about it because people love this fucking game. Sure. Oh yeah, self include. Yeah, but I wonder if you took out if",
            "start": 97.38
        },
        {
            "text": "Yeah, I wonder if thought how much it would affect review scores and people's word of mouth about it because people love this fucking game. Sure. Oh yeah, self include. Yeah, but I wonder if you took out if it was called Rick's Adventure, I probably wouldn't have played it. Like, no matter how many times people told me like, 'You gotta get on this,' I just, I probably would. Sure. But then playing it, I think that I would enjoy it almost as much, but I think you would lose something. I mean, there's something to it that yeah, it's Triforces and Ganon and Zelda. Yes, you know. Yeah, you feel the only nods to the the lore and such and shit like that. That's Mountain. Yeah, I want to know what this rich Rick fellow's all about. Yeah, also I feel bad that just this thing was like, let's think of the most generic name for man. Rick. Rick. Rick O'Shea says this another word about Zelda. Hi guys, longtime listener, first-time poster. Do you think the Zelda game essentially screwed the upcoming Spider-Man game with its climbing",
            "start": 131.13
        },
        {
            "text": "man. Rick. Rick. Rick O'Shea says this another word about Zelda. Hi guys, longtime listener, first-time poster. Do you think the Zelda game essentially screwed the upcoming Spider-Man game with its climbing mechanic? Not even Insomniac can complain that Spidey can attach to every single wall. No. Now I imagine that Spider-Man is going to be a very different style game. I think that it'll be an open-world, but it'll be much more designed, tight New York. Yeah, and it's going to be a lot of fun to move around, but it's going to be, I think, a bit more tunnel of inexperience. Going to have the same problems every Spider-Man game has. I'm just like, 'Wow, it's so disorienting when you climb onto a roof,' you know. I want to detain you and yeah, in the camera with wigs out or whatever. I yeah, I don't think it's going to be that. Oh, what? Because yeah, if you can't stick the side of a building, that's a huge problem, and I'm gonna screw that up. Yeah, yeah, remember what all the weird things like you shot your webbing with",
            "start": 176.22
        },
        {
            "text": "be that. Oh, what? Because yeah, if you can't stick the side of a building, that's a huge problem, and I'm gonna screw that up. Yeah, yeah, remember what all the weird things like you shot your webbing with sky? Yeah, in like Spider-Man. Yeah, yeah, remember then remember what is the big deal? Like, now you don't do that. Now it attaches to buildings, and we actually have like physics. Yes. Yeah, it's fascinating. You see how they pull it all together and what this actually looks like and how it plays and what is it and how open is it? I swear, does that gameplay we saw, that video we saw last year was gameplay footage, and it's like watching it. Um, I just can't fathom how you'd play that. Like, that seemingly bust through the cafe and is like jumping on the things that article the animation. I get it. Like, there could just be some way that if Spider-Man's like this, it touches the things that way, and cool. But what is the player doing there? How much time event is that? Yeah, there to the actual like gameplay?",
            "start": 219.05
        },
        {
            "text": "could just be some way that if Spider-Man's like this, it touches the things that way, and cool. But what is the player doing there? How much time event is that? Yeah, there to the actual like gameplay because it does kind of look like he's controlling it. I don't. Insomniac isn't really known for taking control away like Sunset Overdrive. Yeah, awesome. And now anything about Sunset Overdrive like that. Yeah, the locomotion in Insomniac. Yeah, I'm Rob City without ever touching the ground. That wasn't fucking like wall running and grinding and gliding. Yeah, they definitely learned a few tricks and a pre-interview. Alright, so Marty, we have you on the show. Yeah, so obviously there's a lot of Marty question. Big mark. What Josh Boyd says, \"Please ask him if he's still haunted by Battletoads.\" Yeah, everyone. I really don't like the video game Battletoads. I've expressed it several times, and then there was a Battletoad man at E3 last year. He's big and he was slimy. He's got the Microsoft booth looking at me. I didn't",
            "start": 253.4
        },
        {
            "text": "like the video game Battletoads. I've expressed it several times, and then there was a Battletoad man at E3 last year. He's big and he was slimy. He's got the Microsoft booth looking at me. I didn't like that. I had to review Rare Replay and play Battletoads. That like that. Max always helped people to scream Battletoads. I make sure that conventions. I don't like that game. It's a bad game. The names: a rash, pimple, and zit, and Herp. It's not, that's not been my good wart. Well, how many of those names? Herp. Herpie. It was probably fourth one. Game Herpie. We name six people there. See some of the battle. But I don't like that game. If you like that game, you have bad taste. Some things like that. That being said, Rare is a very good developer. It's true. Jason Hale says, \"What are we getting the Duck Dynasty review?\" Yeah, it's been a while. Please do it. It is your final thing whenever you're ready to move on from IGN. That's the last thing you post. So I said I was going to beat all three Mass Effect games or I would quit, and",
            "start": 296.3
        },
        {
            "text": "a while. Please do it. It is your final thing whenever you're ready to move on from IGN. That's the last thing you post. So I said I was going to beat all three Mass Effect games or I would quit. And I beat one. I never, not going to beat the other ones. And so instead of quitting, we settle on, and I said we're going to stream all of Duck Dynasty and have it be my review. And then we got busy. Becomes a job. Yeah, yeah. A lot of goofy ideas. They don't become reality. Yeah, we call those ideas Nevergreen. Yeah, Nevergreen ideas. We have Nevergreen ideas that I like that many ideas that we will never do. Yeah, it all happened some point. And then the final Marty question. Of course, there's a lot of questions about cardigans, but you know, this is the Gamescast returns. I don't want a cardigan a little while. Yeah, I like this. I like this look, Marty. I don't like running, so we're going a little bit of running. Yeah, from the cops. Oh, like 60 times illegal in San Francisco District 59 is illegal. You guys do",
            "start": 332.51
        },
        {
            "text": "I like this. I like this look, Marty. I don't like running, so we're going a little bit of running. Yeah, from the cops. Oh, like 60 times illegal in San Francisco District 59 is illegal. You guys do people take shits on gear and walking to work? That's not illegal. I know it is, but it's got to catch it. 69 is illegal. What a world. Christian James says, \"Does he still feel shame from Phil's look of disgust?\" Context, get us up to speed on what those questions about. So at GDC, we had head of Xbox Phil Spencer made a man on our Xbox Show Unlocked. And I had to, I liked you. I was taking time codes mostly for like, if he said something interesting, I took a time codes that Andrew and the news team could break it out, 'cause God forbid they did the job and just watch the shit. Well, it was GDC. There was a lot. Everyone's busy developing game conferences and whatnot. It was also weird because it was the, it was the morning of the GDC Awards, so I was wearing the sport coat and a tie. They usually don't do doctor.",
            "start": 376.16
        },
        {
            "text": "everyone's busy developing game conferences and whatnot. It was also weird because it was the, it was the morning of the GDC Awards, so I was wearing the sport coat and a tie. They usually don't do doctor. Uh, I'm a doctor. Delivered several children. She, yeah, you made more. I know. Thank you. Whoa. And so while he was talking, I was saying next to him. I was writing down a time code, and something happened with my hand, and I still don't know what it is. And there's a close-up GIF of it. No one understands what it is, but the pen just flew out of my hand off the table, and I very quickly tried to, it was while he was talking, tried to grab it, and then realize it was too late. And I just sort of came back and was like, 'No, nothing happened.' And Phil, who's just amazing, creative, very powerful man in video games, he also looked at me pretty much like the most disappointed father ever of just like, 'What? Like, what are you doing with your life?' And I just try to play it off of it. 'Nah, nothing, Papa. So alive. Everything's'",
            "start": 430.85
        },
        {
            "text": "looked at me pretty much like the most disappointed father ever of just like, 'What? Like, what are you doing with your life?' And I just try to play it off of it. 'Nah, nothing, Papa. So alive. Everything's fine. Everything's fine.' And so that GIF will live on probably as my curse. Congrats, new doctor management. You, me. Yes, you did the internet. I did the internet. That Duck Dynasty still never forget you. Now, no. Yeah, we can get a pen. Yeah, the fidgeting pen guy. Penguin, Penguin. Yeah. Yes, you're part of the Pen15 Club. Oh, that's penis if you write a crooked. Oh, ho. I still can't believe 69 is illegal in this part of the city. Crazy. That's not. Yeah, we got to go Spencer on the show just so we can give him a new nickname. McCallum, Filthy Spence. So I live down here. They were going to change your Twitter handle. Lana. I baby two people is E3. Yeah, yeah. Okay, he's getting. Let's do it. I know one. Chase says, \"What platforms do you think they're gonna most likely release new Armored Core games?\" No shit. So I know I, oh, I",
            "start": 478.35
        },
        {
            "text": "I baby two people is E3. Yeah, yeah. Okay, he's getting. Let's do it. I know one. Chase says, \"What platforms do you think they're gonna most likely release new Armored Core games?\" No shit. So I know I, oh, I know this thing. Ilana came back with some hardcore FromSoftware. That is, this is pre-fucking Dark Souls. Like, I love that studio. Miyazaki was going to use fucking dabbling with robots. I want, I don't want a Dark Souls game ever again. I want an Armored Core game in the style of Souls. I want it to be a roguelike to where every time you die, your mech is left there, and your pilot has to come back to get over the bonfires and retrieve your mech, or it's like, 'Fuck it, you got to build a new mech.' Huh? Yeah, I want that. I wanna play what? That PS4, Xbox One. All right. I can't believe you didn't play ignite. I did. I put, I reviewed them, but turned out Trevor Starkey said in the review, or I'm just like, 'Holloway, you're a fucking robot, and you're fighting, fuck, it's okay.' Yeah, that's so funny. Yeah, oh man, shot the",
            "start": 522.72
        },
        {
            "text": "did. I put, I reviewed them, but turned out Trevor Starkey said in the review, or I'm just like, 'Holloway, you're a fucking robot, and you're fighting, fuck, it's okay.' Yeah, that's so funny. Yeah, oh man, shot the Armored Core. Yeah. Chris Gilbert, \"Do you think Yooka-Laylee was a worthy successor?\" So we haven't had anybody on this show that really invested time in day. Yeah, UK. I had to. You, you're illegally head to our nanos legally. I think were your green card if you had. Oh no, I'm American. I was a little bit disappointed by it just in terms. I thought the, of the five levels, one of them wasn't good. So a fifth of the game I did not enjoy. I saw it wasn't quite as precise as Banjo games, and the camera had a little bit of a problem. Uh, that being said, like, I think this is a really solid building foundation for Yooka-Laylee 2, which could fix a lot of those problems and could do something really special. You can actually get what you go with you, I think, and be well on Switch when it comes down. Yeah, honestly, I do think it's",
            "start": 571.86
        },
        {
            "text": "which could fix a lot of those problems and could do something really special. You can actually get what you go with you, I think, and be well on Switch when it comes down. Yeah, honestly, I do think it's a relatively small studio, and we sort of at that cusp of we had Ratchet & Clank was amazing last year, and then we have Mario coming in, Super Mario Odyssey. Like, I feel like there's sort of this return to form of 3D character platformers. So no, there you go. Hilary Goldstein, friend of the show, you know. So please ask him about his writing process, specifically how he begins and how he overcomes writer's block. Thank you. It's a good question. I write mostly by hand, like in notebooks, especially like reviews or features. Like, if it's a new story, I just write it and get it up there. But I write by hand, and I write at bars, and I don't worry about. I let it be train of thought. I let it, I jump around from piece to piece. Like, if I'm writing a review and something else comes up, all right, over here, someone",
            "start": 617.64
        },
        {
            "text": "I write at bars, and I don't worry about. I let it be train of thought. I let it, I jump around from piece to piece. Like, if I'm writing a review and something else comes up, all right, over here, someone say something else. I don't mind to turn the page and write a note of this person said this thing. Like, this is interesting. Put this somewhere. Um, but mostly, yeah, I'm relatively lucky in terms of just, I've done this enough, and I've been a writer professionally for six years, but I went to school for creative writing and screenwriting. So I've been doing this long enough to where I just, I just get through it. And I think you're always your own worst critic, and so overthinking things. I don't know if there's the same one with you, but if you start overthinking something, that is one, you're going to fuck up and slow down. Yes, I did. Writing is locomotion. It's getting, it's moving. Yeah, that's all thingy. If you don't like what, yeah, this isn't great. We continue to go to get something good again. Do they come",
            "start": 663.78
        },
        {
            "text": "and slow down. Yes, I did. Writing is locomotion. It's getting, it's moving. Yeah, that's all thingy. If you don't like what, yeah, this isn't great. We continue to go to get something good again. Do they come back with fresh eyes later? Yeah, what's wrong and begin? Everything was, 'It's hard to believe it's hard to believe it's been X years since X franchise last graced X platform, but now they're back,' or 'Webster's Dictionary defines.' Those are two classic old e-book goodies. My favorite thing, I'm slurring Craig Harris wrong, but my favorite thing ever was one. Yeah, we were talking about tropes, and he threw that out there. Like, our creative left IGN. And Craig Dunn, yeah, more than a thousand reviews at IGN. Literally, I remember that being a big celebration. Have lasted me through. He throwed out that are just like, 'Well, Paul, you don't ever start your things with, 'Yeah, it's hard to believe it's been.'' And I went into the backend and Googled it and found like ten reviews that way from me. I'd say I didn't do it.",
            "start": 706.29
        },
        {
            "text": "Well, Paul, you don't ever start your things with, 'Yeah, it's hard to believe it's been.' And I went into the backend and Googled it and found like ten reviews that way from me. I'd say I didn't do it. Solitaire for Game Boy Color. Nice. Oh my God. I'm going to go. I complimented your shirt. Yeah, and then once I loved you, I realized I own this shirt. So that is the most immunity possible. Yeah, I have it in different color though. Mine was a chambray. Woo. That is my favorite Overwatch shirt. Oh yeah, no, no, it's chambray. It's really blue. Yeah, it's like a, it's a light blue, like a denim light. But yeah, James talking about shirt, dude. And it's, it's probably some kind of legacy. I do. All right. Bongos for cats. Yeah, I want you two to talk about Life Is Strange for a minute. Go, man. Life Is Strange is awesome. I think Life Is Strange is, it's, it's reach extends its grasp. I love what it tries to do, but ultimately, I think it feels like it is 40 year old French people writing what they think sixteen to seventeen year old",
            "start": 747.26
        },
        {
            "text": "is Strange is, it's, it's reach extends its grasp. I love what it tries to do, but ultimately, I think it feels like it is 40 year old French people writing what they think sixteen to seventeen year old American kids like the hella's used too much. The hella's used too much. Like, I don't know if I could do any better because I don't hang out with team for that much. Tim's probably good, probably thirty. That's probably all you do is hang out at bars. Yeah, yeah. And it seems in the bars and my shamans where the bars problems are not doing the job. Well, that being said, like, I really helped his Life Is Strange 2. I really think that is Life Is Strange. If they like the Life Is Strange. Yeah. And also honestly, like, I think Life Is Strange could do better now that Thirteen Reasons Why came flicking. The usually shares to be a sort of its TV analyzes. I hear. Yeah, I mean, I'd Life Is Strange definitely has its moment, but I thought overall it just, it, it overcame them. Yeah, because that was my thing is when",
            "start": 796.58
        },
        {
            "text": "I started playing it episodically. I played episode 1. I'm like, 'I don't really.' And like, 'Okay, the rewind was cool, whatever.' At the end, when it really kicks in, you're like, 'Alright, great.' But then when it came back and I stayed off, and I just played it back to back to back to back, that's when I look, 'Wow, this was actually a lot of fun. There's things I didn't expect to happen yet that I did and learnings characters.' Yeah, the clothes, the cool trick. Yeah, no, Chloe. Captain Barbossa says, \"If Marty could choose any video game character to have as a drinking buddy, who would it be?\" Sully. Right? Hell yeah, guys. God, Horace. Yeah. Do you imagine the stories that Sully would tell me? I'd be shit. Yeah, Sully. I like the enough you played on Persona to get to the drunk journalist confidant. Yeah, yeah. So it's like hot girl",
            "start": 837.59
        },
        {
            "text": "Yeah, do you imagine the stories that Sully would tell me? I'd be shit. Yeah, Sully. I like the enough you played on Persona to get to the drunk journalist confidant. Yeah, yeah. So it's like hot girl you could date is a strong journalist who you only needed a bar, and she's always shit-faced. Yeah, she'd be fun. She sounds like you're Jay Liam. I'd like to sit at the bar and Catherine because the bartender teaches you a bunch of facts and turns out, I get someone spoil Catherine. I think you're allowed us for. Okay. Turns out he's the actual devil. Oh, shit. Yeah, it's kind of weird 'cause you're like, been to demos. Like, 'I'm trying to fuck this blonde girl.' There's also saw the girl and the blonde girl's his daughter. That's weird. We don't. Like, the devil's deal. That's what he does. The devil dealing. So we are only off about. Yeah, I remember like, you know how Pacino, yeah, in that movie of Keanu Reeves, yeah, Devil's Advocate. Thank you very much. Cannot get to the name. He had similar things going on. They were",
            "start": 880.36
        },
        {
            "text": "only off about. Yeah, I remember like, you know how Pacino, yeah, in that movie of Keanu Reeves, yeah, Devil's Advocate. Thank you very much. Cannot get to the name. He had similar things going on. They were both, he wanted Keanu, who was his son, to fuck his daughter with the curly hair and make this Super Satan or whatever was Super Saiyan. Yeah, Super Saiyan. There's a girl. Super Saiyan. Very progressive. 2017, shout out Dragon Ball Z, bro. Steady30 says, \"What's your favorite podcast or an episode that you've been a part of that's throwing on the spot?\" Oh, like that I've actually been on. Yeah. Oh, that's what side. No, like 30 podcasts are better. Um, so my favorite ones have probably been, I really liked Beyond! 450 when we do that Jackalope with you, Colin, Max. Yeah. Uh, Bryan, uh, Injured. I think the last two E3 ones have been really fun. We did Beyond! at E3 and Max, Aaron, though, right? Axe Hotel. And he did the poolside one with the Fig two years back. It was a fucking disaster. Um, I think your Union, Colin's last",
            "start": 914.2
        },
        {
            "text": "Beyond! was the only super special to me. Um, and I don't know. I died every time I go into booth now for Beyond! I'm super fucking stoked about it. Oh yeah. I think our PS I Love You. We did, you know, will you do you have a, do you think back like a single? It's kind of hard because we have said, yeah, like we've had the thing right where it's a cheat code. Yeah, I always go having Beyond! 300 is always a super special one for me because is that one I think we knew what we were doing more in the office. Right? Yeah, both of ya. Beyond! 200 and her in the office. 300 was not supposed to be. But yeah, big heaven getaway dog. Yeah, that's a great one. That was such a moment. Yeah. Yes, I, it was like the space between spaces where we had quit IGN, but we hadn't started Kinda Funny, and it was just like that five day",
            "start": 961.47
        },
        {
            "text": "getaway dog. Yeah, that's a great one. That was such a moment. Yeah. Yes, I, it was like the space between spaces where we had quit IGN, but we hadn't started Kinda Funny, and it was just like that five day period and spent it going down to LA and then just got to hang out Kevin Smith and essentially tell him, 'Hey, this is what's happening.' And he was so stoked for us. Yeah, we're it's like, 'Whoa, yeah, this is all gonna work.' Yeah. Oh yeah, yeah, yeah. That's our, there's that. There's countless once I look back on, and it's hard because you end up doing it so much at someone's if they're like, 'What's your favorite meal?' You're like, 'The fuck? I've had a lot of good meals.' Yeah, exactly. A lot of other meals. It's hard to pick up nothing. Sue, then it starts feeling shitty of like trying to, you'll remember one later on. You mean like, I remember the first piece, the first PSX we did, the last live Beyond! We whatever. Yeah, that's her. And we knew it was our last one, but nobody else did, and that was like, I'd get choked up",
            "start": 1005.27
        },
        {
            "text": "You mean like, I remember the first piece, the first PSX we did, the last live Beyond! We whatever. Yeah, that's her. And we knew it was our last one, but nobody else did, and that was like, I'd get choked up on it because I was trying to express it without expressing it. Yeah, yeah. So that was super cool because like that year, PSX panels are super not attended. Okay. You're like way far away, and we packed every little Vegas, it was awesome. Yes, yes, it is. Final question comes from Carrie Ann. \"Can you excited for Darksiders III?\" I am. I'm a big fan of Darksiders. Actually, I don't really care that much about Darksiders I. Darksiders II. I don't like the aesthetic. I think it's that like sort of angry teenager, but rock thing that I know it's tough. Yeah, yeah, yeah. Honestly, a little bit. Um, but I think it's gameplay's super solid. It's this awesome mix of God of War's combat, Zelda's dungeons, and like single-player World of Warcraft just in terms of like the Norse mythology of the world and the quest system. And I",
            "start": 1044.78
        },
        {
            "text": "plays super solid it's this awesome mix of God of War's combat, Zelda's dungeons, and like single-player World of Warcraft just in terms of like the Norse mythology of the world and the quest system and I totally trust the developers at Gunfire Games. We have Thomas Channell IGN actually if you want to go see it. It was our idea first for this month. I went down there and saw on play two shits on it. I think Fury is a cool character and Gunfire developed probably my favorite PSVR game right now, which is called Chronos. Oh, not PSVR, sorry, it's only on Oculus. I really wish was on PSVR. Do you think this one will do well because this is the conversation we had where I was like Darksiders this and on the morning shows like well here you go it's your Mirror's Edge Catalyst. It's it's the other games you it's the games that the vocal minority like to the point you're a fan of it. I get it, you want it, you want it, you want it, and then it comes out and it just doesn't do perform. I don't know like I",
            "start": 1084.11
        },
        {
            "text": "you it's the games that the vocal minority like to the point you're a fan of it. I get it, you want it, you want it, you want it, and then it comes out and it just doesn't do perform. I don't know like I part of me is like yeah I don't know if it will perform but that being said if I just look at analytics like each one of the videos hit a million within like 15 hours and glad that they were exclusive. So like everyone's just looking out for our YouTube channel here like they **** crushed immediately in a way most random trailers or gameplay drops. Interesting, one of like Darksiders, the other one I had a better example, the music's merciless callicles and get a river, but I understand the fact of like good and evil. Yeah, there's another one to it. Don't know. Beyond Good & Evil's one of those games that whenever it comes out, if it does come out, it could never live up to light. Yeah, and it's yeah, I don't know, that's just gonna be interesting because I just don't. There are people I know who enjoyed",
            "start": 1126.99
        },
        {
            "text": "whenever it comes out if it does come out it could never live up to light yeah and it's yeah I don't know that's just gonna be interesting because I just don't there are people I know who enjoyed Darksiders so there's like it's rare to meet a Darksiders fan. Sure, but yeah, what I'm about, yeah, I mean the long ways out. This is probably a year from now that that does it next summer. Yeah, yeah, yeah, we'll see. Well, Marty, thank you very much for joining us. Where can folks find you? For having me, uh, you can find me, I'm on Twitter and Instagram at McVitie's with two G's and two T's. And then I feel like I mentioned a bunch, I do some stuff that I do, and I just got promoted, my editor feature. Yeah, so there's that. And then I'm on Unlocked and Beyond, which is our Xbox and PlayStation shows, bridging. I'm killing the console war, them together, bring them together. Yeah, yeah, good job. I like that. Alright, well, thank you for joining us. Thanks. Sometimes you want to have you back soon. Yeah, because this is fun. Yeah.",
            "start": 1163.5
        },
        {
            "text": "the console war them together bring them together yeah yeah good job I like that alright well thank you for joining us thanks sometimes you want to have you back soon yeah cuz this is fun yeah we talked about that sixty-nining stuff because I feel like we should we gotta get to the bottom you should mark like walking depending on what a person you exactly yeah till next time I love you you can click here for more game stuff you can click there for more non-game stuff you can click here to support us and guess what's over here I don't even know myself",
            "start": 1203.9
        }
    ]
}