{
    "id": 2638,
    "video_id": "x96bw06Dxkw",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "All The Major Games Releasing After E3 - Kinda Funny Gamescast Ep. 120 (Pt. 3)",
    "description": "What are all the major games with release dates after E3?\n\nThanks to MVMT Watches for sponsoring this episode. Go to http://www.MVMTwatches.com/kinda\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1495024202,
    "duration": 1894,
    "transcript_chunks": [
        {
            "text": "this episode of Gamescast brought to you by MVMT Watches. They're founded on the belief that style shouldn't break the bank. The watchmakers' goal is to change the way the consumers think about fashion by offering high-quality minimalist products of revolutionary prices. MVMT Watches started just $95. At a department store, you're looking at 400 to 500 bucks, but they figured out a way to just cut out the middleman and make everything way cheaper, providing the best possible price. We're talking classic design, quality construction, and that style minimalism everyone's always talking about. You probably stopped being late to that thing that you're always late to, and hey, you might as well look good doing it. Get 15% off today with free shipping and free returns by going to MVMTwatches.com/kinda. That's MVMTwatches.com/kinda. Join the movement. So a couple months ago we did a topic, the two topics actually, that were every game coming out before E3 and what we thought",
            "start": 0.03
        },
        {
            "text": "com/kinda. That's MVMTwatches.com/kinda. Join the movement. So a couple months ago we did a topic, the two topics actually, that were every game coming out before E3 and what we thought about it, if we thought was going to get delayed, sure, and if you thought was going to like set the world on fire or whatever. There was a ton of games, but this was post-Horizon and then E3, and keep reading. Now I want to do the same thing before E3 happens, of all the games that we know that are either hammering a release date in 2017 or that are said to be coming out in 2017, and a little kind of go from there. And also it's the discussion of what games are we most excited for. My all-time iPad app on you **** it with it. I don't want people to know. They need to know. Starting the first big one for me, Crash Bandicoot N. Sane Trilogy. Super damn stoked. June 30th. Hell yeah, get hyped. I'm looking forward to playing it. Yeah, I, I looking forward to playing Warped. Yeah, like did you media, did you play your",
            "start": 37.02
        },
        {
            "text": "me, Crash Bandicoot N. Sane Trilogy. Super damn stoked. June 30th. Hell yeah, get hyped. I'm looking forward to playing it. Yeah, I, I looking forward to playing Warped. Yeah, like did you media, did you play your FPS X-Ray? Did you weigh it, Appendix? I was a little worried playing one because I love the original Crash Bandicoot. Haven't played it in a while. I don't love it as much as you do. Um, it's not a good game. And just that the secret is, I don't think it's a great game. And so like that's why I think the remade pretty. But I was worried. I'm like running at the camera, you're on some ****. Yeah, that's why I think, I think it always, it, I think they are fixing the problem, the things I hate about Crash 1. Yeah, nothing. Are they? They're adding analog control. Yeah, definitely. I mean, if you played it and don't lie, you to straight-up don't like it, then they fixed you ****. Okay. And okay, son. More like by the time Warped came out, I feel like they, they, as in the industry of the whole, understood 3D platformers more and",
            "start": 101.04
        },
        {
            "text": "you to straight-up don't like it, then they fixed you ****. Okay. And okay, son. More like by the time Warped came out, I feel like they, they, as in the industry of the whole, understood 3D platformers more. And so I feel like Warped is the one that's gonna age the best of the three. Yeah, I think Warped's gonna age. It's gonna be the middle. I've aunt who's going to be the best. The problem with Warped, Warped's my favorite, but the problem with Warped is it has way too many gimmick levels, that ways for many vehicles. We have many like random **** that are not just plants. Also Jack, sorry. And I don't think those are going to age well. I think the rest of it will be what happens. You beat this game, Louis on, you unlocked CTF. Dude, you're not even **** heavy start like this. It's not, it's not possible. It's not got impossible. But if you were taking - this year, it's a pull off the year dreams blurry. So like Cooper shaker, that was acts like Cooper collection. Remember when you only that you none when you platinum did",
            "start": 143.28
        },
        {
            "text": "but if you were taking - this year, it's a pull off the year dreams blurry. So like Cooper shaker, that was acts like Sly Cooper Collection. Remember when you only that you none when you platinum did, right? You unlock the trailer by four. Yeah, just give me that card. Everyone's playing. I'm out in the car. Take a Crash Team Racing. Yeah. Oh, I'm into little throwback to the last topic, Mario Kart, to prove an example. Mario Kart 8 Deluxe. Share playing that technically. Yeah, it's like when I play on good systems, it's cool. I mean, whatever. I played the hell out of it on the that we use. So you didn't, you weren't thinking, I'm not saying I'm good, and it had the hell out of it. Me, you haven't had a real match since Switch came out. Any time you know that we stop this video right now, I feel like there's like seven people at IGN. They're better at Mario Kart than you guys. I don't believe for a second. I think Johnson or bloody bugger Isaac Brendan. What? I was sitting right next to Shaun 50. I Brendan a breath. Yeah, I would say",
            "start": 185.13
        },
        {
            "text": "IGN. They're better at Mario Kart than you guys. I don't believe for a second. I think Johnson or bloody bugger Isaac Brendan. What? I was sitting right next to Shawn Pitts watching now for the climate. I, Greg Miller, I bet is way better than me. He's my mother. Never get. He never played a **** Souls game. And also he's like, I guess I'll do the guides for Bloodborne. And all of a sudden became better at Bloodborne. Honey, I was **** on this app. Yeah, I'll sing this to Shawn Pitts who had $150. Yeah, I never. Did you really? He brought you to see it. No longer get me all the pennies. No, them not with the pen. I'll do next to a podcast. Work great. You don't run off of the fact that you are a graduate. That's like poor kid. Like he's just new, fresh face, pretty new at IGN. Made him pay 150 Extra Life. It's going to charity. Yeah, that was a, okay, that is good. I didn't realize I was going to Extra Life. He's a giant novelty check. Also, he's an idiot who",
            "start": 226.59
        },
        {
            "text": "pretty new at IGN. Made him pay 150 Extra Life. It's going to charity. Yeah, that was a, okay, that is good. I didn't realize I was going to Extra Life. He's a giant novelty check. Also, he's an idiot who doesn't know how to fill out a check. No one who pay to the order of $150 on being honest. Every single time I fill out a check, I Google check just to like see what I don't know. There it says pay to the order of Venom. Oh, these days. Come on, guys. No, no. I would say next to him, and I didn't realize it was happening right then. And all of a sudden he was like, ****, like it's, it, it's hot. I'm like, oh ****. So we were watching, and I've never seen a human being lose $150. I've never like look into their face as it happened. Yeah. And I did. And like it was so obviously the end of that race is like incredible. You could choreograph. Yeah, I know. Uh, and so look, I was like, I didn't want to lose. I wanted you to lose. Yeah, but it's a scene that seeing just the, I think he was happy to be a part of it. Yeah, a little",
            "start": 270.75
        },
        {
            "text": "you could choreograph. Yeah, I know. Uh, and so look, I was like, I didn't want to lose. I wanted you to lose. Yeah, but it's a scene that seeing just the, I think he was happy to be a part of it. Yeah, a little bit of him died on the inside. Here I go to the pale. I know, I know. Yeah, I am something. I'm taking him down. He just got here. Starting salary in IGN. I'm like a walking. Gave it to me home to San Francisco. Yeah, that's a city of the **** planet. Yeah, yeah, it's a great time. It's damn very Sam. I would love, we should do something where I come over and play because I'd love to come play legend. They're starting a little bit of a week. All right. Yeah, bunch of the new, new class. I brought you. Yeah, what's up with Nintendo on the mind? Arms coming out June 16th. We were supposed to play it this week, but we're not gonna do that anymore because we weren't do stream, Stack Up, lifted your stream, used you like always from what I played at the January event. I might, this is a good game. It's not necessarily something",
            "start": 319.65
        },
        {
            "text": "not gonna do that anymore because we weren't do stream, Stack Up, lifted your stream, used you like always from what I played at the January event. I might, this is a good game. It's not necessarily something right up my alley, but why it's good. And I think that it has that Splatoon quality charm where if they focus enough on the characters, they'll be invited to the next Smash Bros. And they will be Nintendo like on mascot. You have Squid Kids. And I think that it's going to find a lot of success within certain markets. That markets definitely. It's not going to be the general gaming public, which we saw with Splatoon, same thing. But family's going to love it, and the people that are dedicated to playing it are going to enjoy it a lot. We'll see. That's just from me playing it. Playing it with the most controls is pretty garbage. Playing it without most controls, pretty fun. See, I think that's the thing is when I look at it, I think motion controls, and I just don't wanna play games. Oh yeah, when I look",
            "start": 360.39
        },
        {
            "text": "controls is pretty garbage. Playing it without most controls, pretty fun. See, I think that's the thing is when I look at it, I think motion controls, and I just don't wanna play games. Oh yeah, when I look at it, it reminds me of like Red Steel. What you want. Yeah, scotoma. I call it getting bucks because I don't like it. Yeah, have you played it? No. Okay. Any other day. I mean, how obvious is it? Look, it makes me think it's a motion control game where nothing's gonna hurt the general public. And I think the box art and name are pretty generic. Yeah, that's the thing of like, you, I feel like looking through it in a store shelf, I'm like, I want to. But again, there's not that many Switches out there. There's not many, there's not that many AAA games for Switch. If there is a little bit of buzz, a lot of being, all right, maybe people get mad. But I mean, it's, it's releasing at a tough time for a fighting game, especially because it's coming right after Injustice 2 and the right before Tekken 7. Yeah, no, grammar vs.",
            "start": 404.58
        },
        {
            "text": "maybe people get mad. But I mean, it's, it's releasing at a tough time for a fighting game, especially because it's coming right after Injustice 2 and the right before Tekken 7. Yeah, no, Marvel vs. Capcom. Like it's a tough year than anything. They're not said. But my thing is, it's Nintendo, and it's not a fighting game in the traditional shirt. Yeah, well, Arms, Splatoon, and a shooter. You know what I mean? I get upon a day. Yeah, more Power Stone. No. And I love Power Stone. So I'm like, all right, I'm gonna wait. The jury's still out. We'll see where that game lands. But I don't know. Then Splatoon 2, July 21st. Again, I'm happy that I'm gonna give you another chance because I had fun that one time we did a Let's Play. Yeah, I'm at, it's one of those really like the, the Wii U. Exactly. I was so over with Wii U at that point. I never gave the game a chance. I'm gonna give it a chance here. I'm, yeah, I think I'll be assuming Nintendo can get their online ****, you know, connectivity issues. Mario Kart. Answer. We don't",
            "start": 438.84
        },
        {
            "text": "point. I never gave the game a chance. I'm gonna give it a chance here. I'm, yeah, I think I'll be assuming Nintendo can get their online ****, you know, connectivity issues. Mario Kart. Answer. We don't know when the pay service was coming. It's going to align with this. The online pay service was coming late around the year. But Splatoon 1 slowly became a relatively big hit, especially given the how this whole Wii U's are out there. So by almost five million copies. Yeah, in exchange in Japan. Fran Mirabella liked a lot. He just does not like Nintendo stuff. No, Destiny never made its way to them. Exactly, exactly. Um, yeah, I, I'm excited for this. I hope there's a sort of big lean into a single-player thing because I'm, I don't really have time. Yeah, I mean, dude, that's my thing is I'm hoping for it. I don't think they've talked about. I know yet Splatoon 1 had single-player modes, but didn't really like the way Titanfall did. Yeah, yeah, yeah. The know where everyone loved one level was like, it's called press",
            "start": 482.92
        },
        {
            "text": "they've talked about. I know yet Splatoon 1 had single-player modes, but didn't really like the way Titanfall did. Yeah, yeah, yeah. The know where everyone loved one level was like, it's called press f4 y o- on one, which wasn't, which had like no single-player. Also the, the cause and effect are truth and consequence, whatever was called. No rules. Titanfall 2. You fine. You don't like robots. I don't know. I like to think I like robots just fine. Right. Not only problem that when they were going, the relationships are invisible. Isn't funny of a robot. This robot's not that funny. I don't love this robot. No, I wasn't a very lovable robot. There's a very good level books at that time travel. I'm sorry to have to time travel. You know what? I don't give a shout out. Hey! Pikmin on the 3DS. Welcome aboard. Y 8. Yeah, I'm not down with this. I'm not that we're theater again. A, why isn't this on Switch? B, why is it happening? Yeah, which it just seems like mice. Have you heard of this Hey! Pikmin? It's, it's a 2D platformer",
            "start": 525.73
        },
        {
            "text": "not down with this. I'm not that we're theater again. A, why isn't this on Switch? B, why is it happening? Yeah, which it just seems like mice. Have you heard of this Hey! Pikmin? It's, it's a 2D platformer Pikmin game. Okay. And it's like, no one's asking for this. It's on the 3DS. It's, come on. It sort of reminds me of like the Mario vs. Donkey Kong: March of the Minis that I would like every one every year. And you're like, how? And it's there. Like, I think their whole thing is like, Pikmin's too complicated for children, so we're going to get them in with this. And I'm like, stop it. Stop it. Don't. Also, what about Switch? I click it. I really don't want to open my 3DS. I mean, now it's over. Just bad. Middle-earth: Shadow of War, August 22nd. But I had to play that. Yeah, I mean, I thought I'd really like Shadow of Mordor. I love the Nemesis System. One of the most interesting things that I'm shocked thousands of games have been stolen since then. We did it. We had it as an IGN First last month. I think the footage lost a",
            "start": 567.55
        },
        {
            "text": "I love the Nemesis System. One of the most interesting things that I'm shocked thousands of games have been stolen since then. We did it. We had it as an IGN First last month. I think the footage lost a little rough in my opinion. Just a lot of grays and browns. And I don't know if like it also could be open-world fatigue because we've already had a lot of really good open. Actually other things like my thing about it playing the first one was, I don't like this source material. I want to play. Nemesis System is awesome. Combat is awesome because it's Batman or ever when that's what this was all supposed to start at. But then it was like, all right, cool. Go over here, a million guys. Go over here, a million guys. What, what? And it didn't feel like that world was lived in. And this is the year of lived in open-world RPG. What's over that? What is over that Horizon? Oh my god, something amazing is happening here. This is so cool. If it's more of the same old, oh, it's just one. It's gonna be",
            "start": 616.27
        },
        {
            "text": "year of lived in open-world RPG. What's over that? What is over that Horizon? Oh my god, something amazing is happening here. This is so cool. If it's more of the same old, oh, it's just one. It's gonna be Luke, I'm sure thing comes out a little bit before something like **** Red Dead, which you know is going to nail that feeling. Yeah, yeah, it's tough. I do. I just want to see the Nemesis System put into something like the Batman world or the Harry Potter world. Yeah, Harry Potter heavy cold. Yeah. Uncharted: The Lost Legacy. Also, I do like this. Yeah, I was very excited for this game. Yeah. Oh yeah, I'm so excited. It's then being like, it's that with sort of middle ground lengths between like, it's, it's longer than behind, but it's shorter than a traditional Uncharted game. Yeah, **** following the two of them. I'm totally not exactly. Yeah, I know it'll be fun, different. That's what I want. That's very high on my list. I'm aside for. I also think August is going to be a great time for good at. Yeah, like it had to be",
            "start": 653.47
        },
        {
            "text": "not exactly. Yeah, I know it'll be fun, different. That's what I want. That's very high on my list. I'm aside for. I also think August is going to be a great time for good at. Yeah, like it had to be your last game of the summer before the fall release. Yes. Destiny 2, September 8th. I'm not touching it. Well, you were beyond my plus one for a while. Yeah, I **** with his life because I mean like big implies like I'm destined like area or whatever. And I'm a psycho, psycho. You Destiny. Look at it. I know. I chasing his name with something, babe. Yes, you're crazy. No, I played a bunch hours of first when it was still Destiny vanilla or whatever. Got a little or whatever. 1 or whatever where I didn't have to worry about anything more. And I was, I had fun with it, enjoyed it. But his rough came back a little bit for dinner rules. But it was by that point there were so many people so invested who knew everything. It was like, all right, you guys are really into this, and I don't really want to do that. I feel like",
            "start": 695.65
        },
        {
            "text": "for dinner rules. But it was by that point there were so many people so invested who knew everything. It was like, all right, you guys are really into this, and I don't really want to do that. I feel like this will be one that I get in and I thought I'd do the same thing, **** around with. And by the time they're like, all right, time to worry about raids in lights course. Oh my god, peace guys. This is why I feel shame to try to remedy that and give because Destiny is one of those games that like launch at like a six five and you ended up being like a nine because once like The Taken King came out, they're like, all right, you finally delivered two years later on what this game should have been. Yeah, which is what I take a lot of people feel about like Uncharted 2, Don turtle on AC to Daisy won. Well, I think, you know, especially all the games that live online, you know what I mean? That do change like this one. I mean, I DC Universe Online, I'm talking about not as a joke. You know, Rainbow Six Siege. It's not like that",
            "start": 735.25
        },
        {
            "text": "know especially all the games that live online, you know what I mean? That do change like this one. I mean, I DC Universe Online, I'm talking about not as a joke. You know, Rainbow Six Siege. It's not like that comes out and then gets added to have The Division. Yeah, The Division, Yantra missions, a great example. When I came back tone, I loved. Yeah, I didn't seem to be **** huge. And obviously like you mentioned earlier, we're gonna get a lot more in a week next week. Yeah, yes, the 19th. Yeah, I'm hoping they reveal some really cool **** and like it because like what I loved about The Division and not about Destiny was first off setting. But that aside is the fact that The Division, I felt like, cool, I can play this single-player and have a great time. And then if I do run into somebody, we run around and **** around. It's all benefiting everybody. Everything's going well. It's with Destiny. It was like, if I'm alone, I'm not having that much fun. And when I teamed up with other people, it was sometimes I felt like I was",
            "start": 766.24
        },
        {
            "text": "it's all benefiting everybody. Everything's going well. It's with Destiny. It was like, if I'm alone, I'm not having that much fun. And when I teamed up with other people, it was sometimes I felt like I was holding them back. They were off do this. We weren't getting the same progression. And then I was loot caves, which I did camp outside us for like, for that, that one hour. What? Yeah, yeah. I think did a really good job that that tone peace trailer with uneasy others. Yeah, yeah, it was really good. And it was a tone where it was, I mean, obviously Nathan Fillion was the voice actor, but it's felt like Firefly, Borderlands. And like, all right, that is a tone I can get behind. Yeah, if I don't need like gritty, just like wet blanket. And that was the thing is like the tone for the original Destiny, right, was lost and weird and not there. Literally recasted the narrator. Yeah, in that wood that shows you how vanilla original Destiny was that that was all you had when you took it out and put Nolan North and there was, yeah, and",
            "start": 802.06
        },
        {
            "text": "and not there. Literally recasted the narrator. Yeah, in that wood that shows you how vanilla original Destiny was that that was all you had when you took it out and put Nolan North and there was, yeah, and it did feel different. I don't know. But it reminds me of like if you watch the first season law officer Parks and Rec. It's like it takes a season for a thing like this to understand its voice. Like Andy is the bad guy in the first season of Parks and Rec. And so, well, I don't know why I'm comparing Destiny, Parks and Rec. But by the time that their third season, they're like, oh no, he's not the bad guy. He's like the lovable idiot. Yeah, yeah. We got a Marvel vs. Capcom: Infinite on September 19th. I'm excited for it. I love the Marvel vs. Capcom games. I'm not good at them all, but I love **** around by mashing and ****. I miss pixel art in 2D fighters. Same. And I understand it's a lot more work and it's hard. But it's, I look at this game and I'm like, it doesn't look much better than than three, especially when",
            "start": 839.05
        },
        {
            "text": "****. I miss pixel art in 2D fighters. Same. And I understand it's a lot more work and it's hard. But it's, I look at this game and I'm like, it doesn't look much better than than three, especially when they just put Ultimate Marvel vs. Capcom 3 out on. That's what I'm like playing it. Like, I'm having fun with it. You know, it's like looking at Infinite. Might, yes. Yeah, until it sits in the same boat as Injustice with me of a game. I'll get **** around with it. I won't want to see all the cool characters and easter eggs and nods and who's some of the four characters are hyper moves. Yeah, because I love Marvel and I love Capcom's history. And but like, yeah, like you, I'm never gonna get good. Looks good. Yeah, but it's fun. Yeah. So for that, Call of Duty: World War II, November 3rd. And we talked about it last week. I'm interested. I'm us super **** onboard. That trailer looked great. They said all the right things. We're not trying to make it a global. You don't want to span the globe. You're with these peoples",
            "start": 879.29
        },
        {
            "text": "week. I'm interested. I'm us super **** onboard. That trailer looked great. They said all the right things. We're not trying to make it a global. You don't want to span the globe. You're with these peoples. Like what is six months or a year or whatever. Like, I mean, you're at the tail end of the world. Again, starts in '44. Yeah, yeah, yeah. I actually went down a Sledgehammer for a couple hours a couple weeks ago. And what is that? You, who's that? It's the song for Chandler. What song is that? That was a long time. That's not a real song online. Yeah, stand out from the comments below if that's a real song. Ah, we have talking to them. Yeah, I love the idea that they're trying to tell like a realistic war story saying like, you're not a superhero. You don't have double jump. You don't have ground pound. Like you don't do a power slide. You dive into the **** sand and put your head down. We haven't had a World War II game in the Call of Duty series since World at War in 2008. Also, Sledgehammer's last game was really",
            "start": 924.83
        },
        {
            "text": "a power slide. You dive into the **** sand and put your head down. We haven't had a World War II game in the Call of Duty series since World at War in 2008. Also, Sledgehammer's last game was really great. Its pedigree is Visceral, the creators of Dead Space. And so zombies mode sounds cool. I don't know. I couldn't, I can totally get behind this campaign, especially in a fall that's, it seems like that the core shooters of the fall are Destiny. Well, that have been Peter Gabriel sledgehammer got damage. You keep the **** point. What happened? Oh, I know the trunk. Like, you know a song. I didn't realize the whole Bible is your Bloods hammer from Anthony. Hey. Okay. Yeah, the Call of Duty: World War II now theme song. Yeah, The Finest Generation. The, I could not care for a million sample for injuries over there making in flash cameras blastin. If we got Star Wars Battlefront II, November 17th. And that is what I am written by Al a max Q. Heck yeah. I'm so, so sold on that. Yeah, Battlefront I had such a great time",
            "start": 960.32
        },
        {
            "text": "with the first one. It was very limited. I liked it. It wasn't that deep of a first-person shooter. I could just jump in and have a lot of fun with it. It's so authentically Star Wars and how it looks and how it sounds. And the one thing I wish it had more of was single-player content. But few little missions they had were you flying around on and donator bike and backswing thing. I was so happy with it. This is like, this is what I want. Yeah, so much fun seeing the story trailer. Oh my holy crap. We're getting something post-Jedi. And it sounds like an awesome story. I'm so sold from the Empire side. Just like the idea of you're this like elite soldier, the elite Imperial soldier on Endor. And you look up and your home blows up. Yeah. Oh ****, what do I do now? Yeah. Uh, Iden seems **** awesome. Yeah.",
            "start": 1026.51
        },
        {
            "text": "like the idea of you're this like elite soldier, the elite Imperial soldier on Endor, and you look up and your home blows up. Yeah, oh ****, what do I do now? Yeah, uh, Iden seems **** awesome. Yeah, obviously, full disclosure, friends of ours are writing the game and of ours is starring in it. Yeah, you know what, we all have friends. Could do all our fur. We have more in this game than you do. What are you talk? I'm probably closer to Walton, you are. No way. Yes, absolutely. I'm so sorry. After, I think Battlefront II is up there for me. I think it's my most anticipated non-Nintendo game. Well, yeah, I get that. I'm use, I'm interested in that story. I want to play, not even just because Ms. Wall wrote it, because it seems like a really cool take on it. I know she'll have a change of heart by the end of it and go see BJ. I really, I really, but again, the hack that is Mitch and Wall to hack together, they're like, what are they doing? The Force Unleashed? Do it again. No, Mitch is like, missus like, has a black heart. Oh",
            "start": 1071.81
        },
        {
            "text": "see BJ. I really, I really, but again, the hack that is Mitch and Wall to hack together, they're like, what are they doing? The Force Unleashed? Do it again. No, Mitch is like, missus like, has a black heart. Oh, yeah, woman. I love Becca. Yeah, yeah, it'll be awesome if they get the energy. She's like, no, no, I still hate you. I still hate the light and everything. Yeah, and I'm like, I think the Prequels are terrible movies, but I think I love the aesthetics of those worlds and the creature design and the robot design. And so **** it, bring that into the game and let me **** around and, you know, and **** act like. Watto plays a lot of, you know, Watto plays what? Uh, he was, he was a hero who came in with me. I mean, he is his fat lady technically in. No, he's not. He's a slave owner. Yeah, that's important. All right, then we got Fire Emblem Warriors, which doesn't have an actual release date yet, but I imagine that's going to be a September game, maybe an August game. Which ones to this? Fire Emblem Warriors is the Hyrule Warriors",
            "start": 1121.21
        },
        {
            "text": "got Fire Emblem Warriors, which doesn't have an actual release date yet, but I imagine that's going to be a September game, maybe an August game. Which ones to this? Fire Emblem Warriors is the Hyrule Warriors style Fire Emblem Warriors, which I mean, this is an example to me where I'm is on Switch and 3D. Yes, but I'm cool with this because it's like, there's so many fun characters in Fire Emblem and the Dynasty Warriors games, you're fun. I mean, that Musou genre like works when you attach like, they've done Gundam. Loans up the eldest, a fight cycle, make it happen. Then of course, Mario Odyssey, which is coming this year. Very excited. I think it's coming at you. I do. Okay, I really do think is that that team moves over from 3D World two years, three years ago. Yeah, I have a feeling this is going to be there. I think at E3, they're going to deck out their booths as New Donk City or whatever the ****. Yeah, you know, I roll laughs here. I think this could be obviously their flagship game. Yeah, I totally see this. What it's October.",
            "start": 1172.77
        },
        {
            "text": "going to deck out their booths as New Donk City or whatever the ****. Yeah, you know, I roll laughs here. I think this could be obviously their flagship game. Yeah, I totally see this. What it's October, early November? I don't know. But yeah, so we'll be going. Yeah, I think November. Yeah, that's usually, that's uses their fault. The big question for Nintendo Switch, Xenoblade Chronicles 2, which you'd fit into the December slot. I don't trust us. Yeah, now do I? I, I think the December slot generally is the sent to die slot. Last Guardian was there. Siege is one of the few examples of a game that overcame the December slot and grew on to be some. Far Cry 3. Sorry, what's that? The year we **** voted on Game of the Year before. Yeah, yeah. Oh, yeah. Mitch called us in a conference room and showed it like, you got to like this game. Really, there's, you sold it poorly. Yeah, anyway, I played it over Christmas like, um, I think we Xenoblade Chronicles X in Japan, but not here. I can see that. Yeah, yeah, cuz seems like Chronicle.",
            "start": 1219.79
        },
        {
            "text": "this game. Really, there's, you sold it poorly. Yeah, anyway, I played it over Christmas like, um, I think we Xenoblade Chronicles X in Japan, but not here. I can see that. Yeah, yeah, cuz seems like Chronicle. Yeah, because X came out in Japan like six months ago. Yeah, yeah. So we'll see from there. But then there's a couple other games that are announced, four, oh, stragglers, if you will, that just don't have any confirmed dates. The two Sonic games, Sonic Mania and Sonic Forces. I am so sold on Sonic Mania, especially now it's come as a Switch. I'm hoping we get that mid-June or so. I bet it'll be a July, August game. Hopefully, like, I think it needs me before fall. Yeah, the earlier the better. Do you think it is a chance doesn't come here at all? Cuz they're superhuman and yeah, over small things been delayed already, guy. I know. Yeah, yeah. I really don't ****, you know, and I can't be, I'm so for Mania, not. I have not like a gorgeous man. The thing is, I love Generations, but I love Generations just because it was pretty good.",
            "start": 1266.81
        },
        {
            "text": "know. Yeah, yeah. I really don't ****, you know, and I can't be, I'm so for Mania, not. I have not like a gorgeous man. The thing is, I love Generations, but I love Generations just because it was pretty good. Yeah, well, one good about Sonic Forces, it brings that chubby, the chubby pregnant. That's what I like that. Yeah, I don't think that something could actually like pregnant. Yeah, I'm Tyler Perry. Mario's pregnant. Careful. Wario, Toad, Waluigi is Brian Altano in the ends of the 13 running Altano on 2017. Yes, yeah. I like that. Yeah, I'm feeling will dreamless Crackdown. It's Crackdown coming out this year. Microsoft to come on on our Xbox show. And this is Microsoft's, in my opinion, the Xbox's make or break here. Like Scorpio is a big thing to have to somehow convince people to spend money on a premium product and then also be like, what are we playing not only this year, but next year and the year after that? And so in theory, this year we get the unannounced Forza again, Forza 7, and then we're going to",
            "start": 1311.96
        },
        {
            "text": "and then also be like, what are we playing not only this year, but next year and the year after that? And so in theory, this year we get the unannounced Forza again, Forza 7, and then we're going to get Crackdown, State of Decay, and Sea of Thieves from what I wouldn't be surprised. Okay, them. Yeah, like I think Sea of Thieves is this year. I don't, we don't even know what that game is yet. Like, I'm **** stoked for it. It was one place, it was one of my favorite games at E3 last year. So it was a fun experience. It was so much fun. And then but Crackdown, we haven't seen since Gamescom 2015, which is horrible. Not a great, not great news there. That's a red flag, guy. Was it mentioned at all during the Microsoft press conference last year? And then right afterwards, the press release came out. Those look up, by the way, those doors. I don't, I'm excited cuz a **** Crackdown One, it's awesome. And I love like when I showed that that what, what you could do with a cloud with all the buildings falling down, rise show I",
            "start": 1360.23
        },
        {
            "text": "those doors. I don't, I'm excited cuz a **** Crackdown One, it's awesome. And I love like when I showed that that what, what you could do with a cloud with all the buildings falling down, rise show I buildings. Yeah, I don't know, man. I feel I can we see that game's drastically different, but they went and it something went wrong and they'd opted scrapped it and came back and yeah, that's why it's taking so long and that's why it's so far. Yeah, Cuphead. **** Cuphead. Is it this year? What are you doing? Oh, we get it at this year. This twenty, what doesn't matter? I know they burned all their positive moment on the board. Yeah, I'm just a prime example of the way me while you early. Yeah, well, I mean, for me, I think it's believing your vision cuz this is the one everybody played in like, man, this is great. Well, what do you do outside of the boss man open guys? Like, it's just boss battles. Like, oh, well, make levels. They're like, all right. They went in, made levels and they came back and he was like, oh, these",
            "start": 1406.94
        },
        {
            "text": "well, what do you do outside of the boss man open guys? Like, it's just boss battles. Like, oh, well, make levels. They're like, all right. They went in, made levels and they came back and he was like, oh, these levels aren't good. Got a PD. Why did I guess I would have rather it have been like, hey, here's the game. But for me, I'm like, this is too hard and I don't enjoy, but I respect what you're doing and I want our boss where a lot of people are going to **** like this. It doesn't matter that I don't because now it's going to come on. It's give me a six. Yeah, six point five because it, I go, the boss is cool, but everything else can't. Yeah, stuff so upsetting. Detroit: Become Human then. Not, there's no way that's this year. My pain. I agree. Gran Turismo Sport. I feel like it has to view this. Yeah, I mean, this is my thing. When we did our, um, in January, when Colin, I love you, did predictions and I was like, this is one that I see there happening the summer or not happening at all this year. Like, I can, I have no faith in",
            "start": 1446.03
        },
        {
            "text": "did our, um, in January, when Colin, I love you, did predictions and I was like, this is one that I see there happening the summer or not happening at all this year. Like, I can, I have no faith in them that these main games always get delayed and always get put it around. And yeah, and it's like, no, no. And this is the same thing. The audience is like, will do soon twenties. And I'm like, dude, everybody says something before they delay a game. Yeah, that's how ladies. We don't know what is the state of Sony first party in the fall. Yeah, we don't. We Mack tunes in the fall. Probably, probably. I mean, a lot of idiots start probably at around pretty. You like, I, I mean, I could, this is where it always gets weird cuz I'm even all laid out in front of me because they keep it all straight. Yeah, I could see God of War. I could see it. Yeah, I could see you saying at E3, hey, God of War's coming this year. This is, I could also see it being spring. Oh, yeah. I mean, that's whole thing is like, as you say with Spider-Man,",
            "start": 1479.96
        },
        {
            "text": "War. I could see it. Yeah, I could see you saying at E3, hey, God of War's coming this year. This is, I could also see it being spring. Oh, yeah. I mean, that's whole thing is like, as you say with Spider-Man. Spider-Man is not this year. But if that's not a man, if that team moved on directly from Sunset Overdrive, yeah, three years ago. So the game was in pre-pro before that. Yeah, although I don't know when that deal was signed exactly. That's my thing. I think that I think that we saw so little at E3 last year. I mean, again, to put it in context, the game doesn't have a title. They finished that trail and I said #SpiderManPS4. Like, they don't have to be called the #Spider. Exactly. My dad's not here. And I don't even know if we'll be next year. Like, I think they're gonna because it again, don't rush it. Oh, yeah, totally. I do. Don't you know, I would love more than anyone if you're on that. I **** can't wait for that game. Like, I'm gonna make you Spider-Man. Yeah, I gut tells me Spider-Man's next",
            "start": 1514.04
        },
        {
            "text": "rush it. Oh, yeah, totally. I do. Don't you know, I would love more than anyone if you're on that. I **** can't wait for that game. Like, I'm gonna make you Spider-Man. Yeah, I gut tells me Spider-Man's next year and that God of War's early next year. Like, that's another item slot. Mmm. But then what, Mack and GT? But that's the thing. It's like, Sony, the only hair, I'm gonna start there. It does matter because they align themselves with Battlefront. They align, yes, also Call of Duty with Destiny, with Red Dead. Like, that the era of needing to be in this, the, the fall holiday season, it doesn't exist more. That's the last three years put forward with PlayStation where we're just like, what are they gonna do? This got pushed in this game. It's like, yeah, The Order went out of there. Nobody care. You know, Uncharted went out of there. Nobody cared. Like, Horizon went out of there. Nobody cared. I gave you still **** killing in this area, let alone killing it against like this year, killing any stack spring where there's so many great",
            "start": 1553.4
        },
        {
            "text": "nobody cared. Like, Horizon went out of there. Nobody cared. I gave you still **** killing in this area, let alone killing it against like this year, killing any stack spring where there's so many great games out. Yeah, Ni no Kuni II. Nene. Nah, man. Shout to Colin Campbell, IGN piece. He didn't die. That's all I'm actually recently. Yeah, he interviewed me at D.I.C.E. Very much, man. We were going to secretly schedule Justin Davis for an interview with you at D.I.C.E. Oh, yeah, yeah, yeah. We're gonna really be like, oh, you could interview enough guests. Just get up and like, so, uh, I don't think it's us here. All right. I think it's cute to next year. Okay. I'm excited for it. I'd like, oh, yeah, I need a good one. Yeah, I want fiancé, which I feel like that's another we haven't seen enough of though, right? Yeah, I didn't feel have a big presence at E3. Okay. I thought you know of the scene trailers. Yeah, no, we dated again. There was what they show. They had a big event here in the city compound, but no footage of a lot like we",
            "start": 1588.95
        },
        {
            "text": "have a big presence at E3. Okay. I thought you know of the scene trailers. Yeah, no, we dated again. There was what they show. They had a big event here in the city compound, but no footage of a lot like we did. Wouldn't do any direct feed or anything. People that's up with it playable. Whether I might have been Resident Evil. What do you want a perfect? I remember this is a Friday night otherwise. Yeah, I don't do that. Metal Gear Survive. That's not this year. That'll take us this year. I am morbidly curious what that's good. It's on happen. Does it? That's my thing. Honestly, I think it could be a game that you never ever see. I think this game exists and I heard rumors at this game. Everyone's like, oh, Kojima last. And they wasn't saying, I heard some rumors that this was Kojima's idea. But this game was going to be like a Kojima produced game. Yeah, like, and then he came up with the idea for Death Stranding. So he's finally, it's his little, it's a secret bomb. We put him marry. Like, you know, he'd like knows",
            "start": 1634.99
        },
        {
            "text": "to be like a Kojima produced game. Yeah, like, and then he came up with the idea for Death Stranding. So he's finally, it's his little, it's a secret bomb. We put him marry. Like, you know, he'd like knows he's leaving. You know, I think we should do this thing. Yeah, well, I'm behind it and everything. Always **** Kojima. That's him taking a **** like the upper deck. Yeah, I'm leaving. My God. Red Dead Redemption 2. Did I really feel it's a 50/50 shot at this point? I want it so bad. So do I. But I just feel like it's gonna do the GTA thing where like, it was the same thing. Like, they have a date. It's all set. I'm like, remember GTA V had a date? Oh, GTA IV as well as games got too late. Yeah, yeah. Um, and the thing with this is, they can delay as long as they want. Yes. Take-Two. Watch. There's, well, there's, yeah, yeah. The videos that has that. And you have like, the only thing we've heard from that game with that one trailer in November. Yeah, and or September, whenever it was. And said it's all PlayStation.",
            "start": 1674.2
        },
        {
            "text": "yeah, yeah. The videos that has that. And you have like, the only thing we've heard from that game with that one trailer in November. Yeah, and or September, whenever it was. And said it's all PlayStation. Yeah, um, so like, I could see it on stage at Sony, which is, which would be weird cuz Rockstar generally doesn't know every button. Red Dead isn't GTA. GTA doesn't need E3. Does Red Dead? I think I don't have the cachet. The thing is, I don't think, I think, I think it has a lot of cachet. And I think it's definitely know found what I had before. And I also think that you put the Rockstar logo in front of it. Yeah, I understand that. I mean, I thought it's **** nuts when during the, I think of the NBA Finals last you or something. Or no, it might have been opening day or the first game of the NBA season. And all sun, there was that trailer. Yeah, I'm like, oh, ****. Like, they're going mainstream hard a year out, right? Yeah, I want to see this here. I'm totally fine. It's closed for next year. South Park.",
            "start": 1716.65
        },
        {
            "text": "season. And all sun, there was that trailer. Yeah, I'm like, oh, ****. Like, they're going mainstream hard a year out, right? Yeah, I want to see this here. I'm totally fine. It's closed for next year. South Park: The Fractured But Whole. No, not this year. Now, what I've been saying, man, it's like, when they announced this, I was like, huh? Now, the, I mean, like, I, I was surprised. Yeah, I mean, I'll never forget that Comic-Con panel I did with Trey and Matt. And they were like, not, not even joking, my backstage immersed. Like, this has been a nightmare. Like, we love it. The game is gonna be great. This has been so it will net. And I remember on stage them saying, we'll never make another game. Oh, my God. Okay, cool. And then they announced, I was like, huh? And there's like this really aggressive timeline with new developers. Well, huh? And then it got delayed and delayed and it's going to keep getting delayed. Like, this is definitely a first half. The last engagement last year. Well, the last thing they said was this fiscal year,",
            "start": 1759.97
        },
        {
            "text": "and then it got delayed and delayed and it's going to keep getting delayed. Like, this is definitely a first half. The last engagement last year. Well, the last thing they said was this fiscal year, which would be through March 31st. Yeah, I think it's next year for sure. First time, man. And then their Animal Crossing iOS. That got pushed out of last fiscal year individual. And that it is coming. I imagine what at some point in the Direct. I see them doing an Animal Crossing Direct similar to an example. Maybe like sound two weeks. And it's like, yeah, it's like the, here's the iOS one. And also there's a Switch game coming. Oh, that's all. I don't know. Yeah, yeah. That's, that's all we got here. That's not even coming. Like, we're obviously get huge announcements adding any E3 though. Yeah, that'll work too. Year. Like, all the leaks, all the screen leak. Yep. And fumble really well. Yeah, Canyon Park, our Westerns. That's real, Dan. We, they're saying the Spaghetti Western, Montana. Who are we coming out in",
            "start": 1799.3
        },
        {
            "text": "work too. Year. Like, all the leaks, all the screen leak. Yep. And fumble really well. Yeah, Canyon Park, our Westerns. That's real, Dan. We, they're saying the Spaghetti Western, Montana. Who are we coming out in September? Boo. Wait, stop. But what it was a Switch thing. Well, wait. And it says the land. You see that? No, the Bethesda. Lansing. Well, like their days, they showed that their E3 presence is like a theme park. And there was two things that were under construction. There was like Doom, Wolfenstein, so-and-so, so-and-so. And two things that said under construction. So I don't think those are new things. I'm also tweeted you a theme park with Nazis in Hell. Smite a. Yeah, that's my quick hot take. Sounds like I know what I'd like. Okay, what is the delight if not nasty hell? Yeah, sorry. Ronsky's classic Iran scoop. You can click here for more game stuff. You can click there for more non-game stuff. You can click here to support us. And guess what's over here now? I don't even know myself.",
            "start": 1837.64
        }
    ]
}