{
    "id": 2670,
    "video_id": "ysNSC0vtHko",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Jared Petty, Danny O'Dwyer, and Good Times - The GameOverGreggy Show Ep. 182 (Pt. 1)",
    "description": "Greg's joined by Candy Andy, No Clip's Danny O'Dwyer, and Pockets Full of Soup's Jared Petty. Love ensues!\n\nThanks to Pro Flowers for sponsoring this episode. Go to http://www.proflowers.com and use promo code greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1496041206,
    "duration": 1690,
    "transcript_chunks": [
        {
            "text": "what's up Patreon supporter Patrick Higgins and everyone else watching this this episode of The GameOver Greggy Show is brought to you by ProFlowers. I've kept it pretty quiet but did you know that I recently got married and you know what my wife loves flowers? Now will your significant other like flowers? I don't know. I don't believe in gender stereotypes, but I do know the old saying, it's the thought that counts. So count on ProFlowers. You can get $10 off your purchase of $9 or more over at ProFlowers. Well, ProFlowers is what I keep trying to say, and that includes their 100 blooms bouquet, a dozen red roses, and their plant gifts. And plants make me think of Poison Ivy from Batman, and that's pretty cool. Not the Poison Ivy from Batman & Robin, that one's like so show someone you're thinking of them and save a buck doing it. Go to ProFlowers.com and enter the code Greggy at checkout. That's ProFlowers.com with the code Greggy. ProFlowers, what else you going to send them, a shoe? I can use that tagline.",
            "start": 0.03
        },
        {
            "text": "save a buck doing it. Go to ProFlowers.com and enter the code Greggy at checkout. That's ProFlowers.com with the code Greggy. ProFlowers, what else you going to send them, a shoe? I can use that tagline for everything, right? Thank. What's up everybody? Welcome to The GameOver Greggy Show. I'm one of your hosts, Greg Miller, alongside the Reverend Jared Petty. Glad to be here. How you doing? I'm doing well. I'm happy you're here. I'm happy to be here. It's been a while and it's reasonably chipper. Yeah, reasonably chipper. Hey, we're this close to Kinda Funny Live 3. Everyone's starting to get to the end of the rope, starting to lose their mind too much down in here. Yeah, me, I walk around that is what people bustling around here's is me out of a bustle here, in a bustle there, everywhere. You know, too much. That's just wrong. Oh my, sure lately. Danny O'Dwyer, yeah, thanks, thanks for supplying me with the most Irish ass mug I've ever seen. I'm just saying, a me guilt is in Ireland. She's a real Irish.",
            "start": 40.8
        },
        {
            "text": "too much that's just wrong. Oh my, sure lately. Danny O'Dwyer, yeah, thanks, thanks for supplying me with the most Irish ass mug I've ever seen. I'm just saying, a me guilt is in Ireland. She's a real Irish person. She sent that to us. Oh, look, a little leprechaun along with some chocolates. It's because every mug on Ireland looks like this. Yeah, how do you know she ate a few many? How does it feel being exploited stereotype, Danny? It's great. I love us. Otherwise, I'm just like a white guy. I have something, I've something on you guys share. I'm interesting. Yeah, nicely. Yeah, of course. My unfair advantage is the fact that I'm from a country which up on 1080 years ago everyone has been mud huts. So how well everybody, I know you don't know. Did you know we really don't? Gonna take my word for it. Didn't the court build his own mud hut? I don't know who that is. Okay, they still fake Irish person. I told you they still use those mugs though in the mud. Oh, totally. Yeah, and over here, king of the boy orgy, Andy Cortez, son is.",
            "start": 94.29
        },
        {
            "text": "own mud hut. I don't know who that is. Okay, they still fake Irish person. I told you they still use those mugs though in the mud. Oh, totally. Yeah, and over here, king of the boy orgy, Andy Cortez, son is nothing. How you doing? How you doing? Is that the new call? Okay, I mean, well, I don't think I've ever given you an official moniker. Haven't you? Have it. So at one point it was a the editor predator. No, I never felt it was the he only does editing that's really good. Yeah, but then we Andy started breaking it and had a plan chosen stuff. Also, I'm seated on this side because I shaved a really long white hair in my ear last night and I cut my ear. How do you put it all together and what happened? Put it all together this morning. We didn't understand why his ear was bleeding. Now he is. Yeah, yeah, the air was growing from there. It was a long white hair about that long. Wow. Yeah, if you're illiterate, about every four inches with his fingers like that. Yeah, I don't. I said this morning on the Morning Show, I wanted.",
            "start": 135.99
        },
        {
            "text": "from there it was a long white hair about that long. Wow. Yeah, if you're illiterate, about every four inches with his fingers like that. Yeah, I don't. I said this morning on the Morning Show, I wanted a time lapse camera on like stuck on it so I could see how no one wants that. I really, I'm getting old and I'm starting to develop this little weed patches on my back. Wow. Like, like these little here. Yeah, but just, you know, those you'll be walking like out in the woods. No, just be like that one thing a really small ground and then another. I'm getting those, but they're made of human hair. Well, at least you have an excuse because you're getting old. I've always had angel wings up there for just no reason. Really, these patches, an eagle angel wings. But does it stop the lower you go down? I don't know. That says how when I when I grew in the chest hair. Okay, when did I grow it? I'm so lame. Oh yeah, I got new brothers. Oh, nipple hairs. I got near the nip hairs. I think I counted in total around hairs wide. You.",
            "start": 177.81
        },
        {
            "text": "how when I when I grew in the chest hair. Okay, when did I grow it? I'm so lame. Oh yeah, I got new brothers. Oh, nipple hairs. I got near the nip hairs. I think I counted in total around hairs wide. You can you're counting on your nips, man. I've had time in the shower. I'm a largely hairless creature. I mean, from the top on down. So there's not a lot of hair on my bike and observe. Oh yeah, down here. Well, that's this is compensatory. Okay, weird. Now I have had the beard longer than I have it. I've never shaved it off since I grew it. Yeah, when did you grow it? I was 18. I grew it. Oh my God. So I, how do you know? And now I'm 38. Well, there could be something on today. You don't know. I got it. I guess. But I want to start drinking. I would be right there. Launched it. Huh? Come by moon, delicious, ha, salut. 30. So 20 years. Yeah, I got this beard the really long time. Yeah, as beard is like I said, longer than I happened. But you don't get curious? No. What about underneath? Yeah, particularly. No, it's it's become so much a part.",
            "start": 218.19
        },
        {
            "text": "yeah, I got this beard the really long time. Yeah, as beard is like I said, longer than I happened. But you don't get curious? No. What about underneath? Yeah, particularly. No, it's it's become so much a part of me now that if I shaved it off, I really don't know what I do with myself. I think I would actually be kind of scarring. There was this guy about a year ago, a barber gave me like a horrible chin strap without a line. Oh no. He's short up here and just that part of my face had not been exposed to the air in like 19-year-old it. Yeah, yeah, and it was just it was weird alienation. Yeah, I walked around like this for like a month. I felt really weird that whole time. Here's the question for you, Jared. Oh, walk least what when you had hair, what did it look like? What kind of what kind of hairstyle we have going with flowing locks? No, we did not. Okay, get out of hand. Thank you, dick. Take this this this a dicey edge of them against you before you drop about, you know, oh, 100 pounds off of what you see here.",
            "start": 267.75
        },
        {
            "text": "going with flowing locks. No, we did not. Okay, get out of hand. Thank you, dick. Take this this this a dicey edge of them against you before you drop about, you know, oh, 100 pounds off of what you see here and make roll back the sands of time about 50 years and you've got this kind of flowing thick dark hair, no beard. Okay, very articulated chin. Okay, I blast from the past during that time. Cuts contact lenses. Guys are not tiny little bead things. They're bigger. Okay, that point. God knows why my eyes keep doing smaller. But the air and then the GDC ponytail. Oh, own ingenious way. Exactly. But most of the time, most of the time it was a mop top. I wore my hair in kind of a Beatles mop. Hmm. And then I experimented with the the locks. Therefore, I also for a brief period of time had a very ill-advised mustache. I'm a beard guy. Yes, Robin, I am not mustache guy. That's a strong mustachioed man. Well, it works with the beard, but the rest of context it's suddenly terrible. It's it's kind of like, I don't know, what's what's a great.",
            "start": 308.34
        },
        {
            "text": "yes, Robin, I am not mustache guy. That's a strong mustachioed man. Well, it works with the beard, but the rest of context it's suddenly terrible. It's it's kind of like, I don't know, what's what's a great sequel? You know, I was Ghostbusters, nothing. Well, yeah. Oh, okay. So we haven't gotten to any good ones. Terminator's do all right. My mustache is like, it's like, it's like Godfather III standing by itself. When context that is awful ever is just like momentum, er, er. Yeah, just like, ooh, you don't want that to happen. What's a beard? It's great. So why would she give throw beard? Hell no. No, your beard. I can I love. I looked like a your patchy back situation. I have my patchy face at you. Oh, that's a rough spot. It looks like when you know you grow your first beard and you're like 14. Yeah, but that's my life forever. Yeah, turns a gray and orange. It turns a real. Yeah, everything is right here. Right there. Yeah, course, a leprechaun. When you grow a beard. No, I have a buddy Dale. He's actually in town right now. Who is what?",
            "start": 357.95
        },
        {
            "text": "a gray and orange. It turns a real. Yeah, everything is right here. Right there. Yeah, course, a leprechaun. When you grow a beard. No, I have a buddy Dale. He's actually in town right now. Who is what? I'm Dale, squat, small dude. And who's got like the biggest ginger beard and hair to dress him up as a leprechaun. Sure. He loves American tourists to take photograph. Well then, hey, makes the money command. No, I got scared off of the beard and I still am gun-shy about it because this weekend I let it go where I was it was getting out there and Jen was like, just let it go. Let it keep going. Cool. I think I might. Well, the problem is you double back to IGN where once I walk past Ryan Geddes' desk, right? And he had a photo of him and his wife and he had a beard. But I made fun of him because the photo's in black and white and it looked like one of those photos of like when a POWs gets released and then they're like, they take that first thing and it's put in the newspaper or ever. That's what it looked.",
            "start": 405.62
        },
        {
            "text": "black and white and it looked like one of those photos of like when a POWs gets released and then they're like, they take that first thing and it's put in the newspaper or ever. That's what it looked like. And I made that commentary. I'm like, how old is how much how long does it be regarding like two weeks? You grow a beard for two weeks. Let's see now. I let it go for two weeks. Hot. Terrible damage. I did terrible at the end of two weeks. But it was that thing of the whenever you let it grow out, I shave it, it comes back to ya. Right. But I still get to that point now where I still think I look bad. A lot of kids were saying over the weekend in the social post like, he became to keep it. But then we're doing the final piece. I love you this weekend. It's that being that final look for it. I think I should read on the corner look for you. I and we were talking just before the show actually about speck. There's tiny bits. It's over in the front. Yeah, I think that would come out in the beard and that would be.",
            "start": 446.01
        },
        {
            "text": "on the corner look for you. I and we were talking just before the show actually about speck. There's tiny bits. It's over in the front. Yeah, I think that would come out in the beard and that would be great look for very distinguished. Great. Yeah, they all look great. You have a good beard. No. Yeah, that's looking Kinda Funny person. Obviously, it doesn't connect right here, right? And for the longest time, it was really only this and some goatee. Not a whole lot on the cheeks. No chops, no chops. Yeah, I know chops, which is unfortunate because I I got most of my genes from my father and he had a beard like age 1. It's not. Yeah, so did I got a deadly virus. Yeah, yeah, he did. Yeah, you kinda look like a sexy pirate. Thanks. Yeah, I can leave it. Boy, you look like a young Captain Morgan. Yeah, good. You know, before you get your adventuring pirate career really going. Nice and Drake. But now, okay, yeah, more like Captain Morgan, the guy, you know, he's put his staying on the rum thing. Yeah, I get the big gift there, Greg.",
            "start": 477.3
        },
        {
            "text": "you get your adventuring pirate career really going. Nice and Drake. But now, okay, yeah, more like Captain Morgan, the guy, you know, he's put his staying on the rum thing. Yeah, I get the big gift there, Greg. Eventually gonna get the poofy hair. Okay, off the angle that up a little bit and you'll look like the Tampa Bay Buccaneers, like the original. An amount reduce you and Sully as a college student. Exactly. Where I love to the Tampa Bay Buccaneers. Guys, you can isolate. I know that one. I do know that. Yeah, without to me, Nick, right? We can make sports references for the most part to be all right. I mean, talk about the sports balls. There's what exactly. I'm aware of them. If you're wondering everybody, Tim Gettys, he's at home working on Kinda Funny Live 3. It's coming up soon. If by the time you hear this, you're running out of time. Gets all there tomorrow on June 3rd. Yeah, a lot of time people start. We really could San Francisco. Come do it. And Nick Scarpino tried to come in with a cold this morning. We.",
            "start": 520.47
        },
        {
            "text": "you're running out of time. Gets all there tomorrow on June 3rd. Yeah, a lot of time people start. We really could San Francisco. Come do it. And Nick Scarpino tried to come in with a cold this morning. We don't do that. That don't do that. Really. We're like, don't do this. We got a live show coming up. Get the hell out here. We didn't use this mic. No, of course not. And also, he's probably faking it. He probably has a job interview. Okay. Yeah, nothing. Right. Yeah, damn it. So the kids are away. Now we get to play. Is The GameOver Greggy Show. Of course, if you didn't know, each and every week, four, sometimes five, best friends gather on this table, each touring a random topic session for your amusement. If you like that, head over to Patreon. Comment on us a couple bucks. Get a whole bunch of exclusive perks, goodies, and other things along with early access to the show. But if you have no bucks to toss, no big deal. Head over to YouTube.com/KindaFunny. We're posting the show day-by-day, topic by topic, and says.",
            "start": 557.97
        },
        {
            "text": "and other things along with early access to the show. But if you have no bucks to toss, no big deal. Head over to YouTube.com/KindaFunny. We're posting the show day-by-day, topic by topic, and says what's up is one big MP3 and video the following Friday. So at them gone. Yeah, I already invited Jared in. That was happening. No, Tim. I'm like, no big deal. I'll grab Andy. Then when Nick went down in a, you know, flaming glory to get worse. Yeah, on the Morning Show, Andy came in right away. They brought in the right hand. Yeah, exactly. From the outfield and even warm up. Even get to the bullpen or anything. Get. Yeah, yeah, I was ready for my call. But you came in and you were to destroy mark of a true athlete. Right. I feel like I'm in giant-sized X-Men, like number one. Like, yeah, right here was. And then my thing is like, this is a great crossover because then when it was in the Morning Show, I was like, hey kids in the Twitch chat, who should we have? Don't just throw out The Rock. I hate when they do.",
            "start": 597.38
        },
        {
            "text": "my thing is like, this is a great crossover because then when it was in the Morning Show, I was like, hey kids in the Twitch chat, who should we have? Don't just throw out The Rock. I hate when they do that. I'm should have The Rock on. Yeah, well, thank you very much. The exactly. And eventually though, I was like, well, if anybody's watching, they can chime in. And you, of course, Danny O'Dwyer, we're watching. I was a fan of Kinda Funny content. I know. I like to watch yourself. You almost said stupid stuff. Didn't you want your? I like to watch. And I was today's like my Friday because I'm leaving for the rest of the week. Right. So you know when you're like working, but you're also like a. Yeah, I'm almost done. I'm not going to do that much on this one of Final Fantasy doc today. And then I was like, yeah, that'd be cool. A lot to go over. Senioritis relative, if you will. See one right. A senior right here. I dusted uncle. You got that. You ever had you have that over there in Ireland two years? No, I'm just.",
            "start": 636.65
        },
        {
            "text": "that'd be cool. A lot to go over. Senioritis relative, if you will. See one right. A senior right here. I dusted uncle. You got that. You ever had you have that over there in Ireland two years? No, I'm just being your year. Senior year. It's going like it. Yeah, yeah, everything you're. I don't care, man. I like I'm a bad way through high school though. Yeah, well, kind of death. So they're like this. Oh, I'm just going to look at blow last night. Yeah, of course. Ah, my whole thing is it is a superpowers episode. Right. I can't remember last GameOver Greggy Show I had, which was an official episode with like basically, you know, a brand new cast, everything. Right. So the first topic I was like, well, we had a bonus number one. Get it going. And then we have a good topics coming up on even number one topic. She just be around for a while getting there. Whoa, hang out everybody. Sure. So let's get back to this now. Yeah, you're talking about all the different he's going. Where are you going? Where you going? I got a.",
            "start": 673.31
        },
        {
            "text": "around for a while getting there. Whoa, hang out everybody. Sure. So let's get back to this now. Yeah, you're talking about all the different he's going. Where are you going? Where you going? I got a cousin's wedding. Yeah. Oh, and it's my cousin who I've like never actually visited because he lives in Chicago. Great place to go. She's never been. You should go. So I wonder what's wedding. Why am I gonna siding? Yeah, it might cost him. So like, you don't know him, but you're going to know. I know him. I've just never been to Chicago. Oh yeah, okay. My own are there. My uncle literally you Greg. Mother, forgive me this mug. My uncle, my uncle literally owned a group of Irish goods stores in the Chicago, Illinois area. Yeah, a lot. Blarney Incorporated. Okay. Now, which was not no longer running. He works on a bunch of other stuff at the moment. Why did he golfs now? I don't know. Maybe the bottom fell out of shillelaghs. I see my. Here's what I think about it is like growing up in Chicago, right? We and I.",
            "start": 708.2
        },
        {
            "text": "on a bunch of other stuff at the moment. Why did he golfs now? I don't know. Maybe the bottom fell out of shillelaghs. I see my. Here's what I think about it is like growing up in Chicago, right? We and I don't know how it is not because I got a out. But at least my mother's generation, my parent or the parents generation of us, right? We're so proud of. Well, you know, I'm Polish. I'm Irish. All right. Mom have mom have a signs up parking for Irish jewelry. Blah, blah, blah. You know, even all dumb you want like, I'm America. I'm Vincent, parking from Irish. Oh, but you know that you hang in your garage, right? Not like you go to the supermarket here only. Right. Average Irish food, wood, beer, beer. Really. And that's illegal. Yeah, I think about Irish people being on signs. It's usually not for it's usually people. It's just in fiction. Yeah, well, there are proud people who I'm saying right in the Chicagoland area. Exciting to know that I could. Are we always associated with Boston and stuff like that? And then.",
            "start": 751.22
        },
        {
            "text": "it's just in fiction. Yeah, well, there are proud people who I'm saying right in the Chicagoland area. Exciting to know that I could. Are we always associated with Boston and stuff like that? And then like that's where the Irish live. Sure. Like even New York, right? Like, yeah, etches of that. But finally, Chicago's. Oh yeah, because got this opinion. So I'm having at their first time. Now what's interesting, you're skipping the most important thing because you do when you were hitting me up to be on the show today, you're like, I gotta go. But I'm going tomorrow by train. I am also than anywhere by train. We know, right? Nobody does. I think this is an excuse to like, I've been working for like a month on this Final Fantasy edit. And I've always, I love trains. And I think this is a really good excuse to like get ad for like longer than because otherwise I'm just dropping in on a Friday wedding, getting the hell out. Right. Or is this is like a fun time for me, my life to have like a little bit of like our own.",
            "start": 791.27
        },
        {
            "text": "ad for like longer than because otherwise I'm just dropping in on a Friday wedding, getting the hell out. Right. Or is this is like a fun time for me, my life to have like a little bit of like our own adventure time. And also, you can take a train to Zephyr. It's actually the same one they do before GDC on train shows the opposite way. Okay, that I'm going from Oakland, Jack London and I think to Chicago. How I'm gonna think 58 hours. I think train travel is the best line. I'm exciting. I don't want that long. Oh man. But you're gonna you're gonna get to sleep, right? Yeah, yeah, like three days. You're gonna tell your sleeper car, dollar cabin together. Yes, I got our own like like small, not the fancy fancy one, but we got like our own little cabin. Oh, but now it's the James Bond cabin. Not one you can spend like thousands on. Okay, but like it's only three days. May I ask how much this cost because I'm trying to gauge against the plane ticket and stuff like that? Oh no, it's it's more expensive evolution. It was.",
            "start": 830.81
        },
        {
            "text": "thousands on. Okay, but like it's only three days. May I ask how much this cost because I'm trying to gauge against the plane ticket and stuff like that? Oh no, it's it's more expensive evolution. It was like maybe around between 700 and 800. Oh yes, a terrible. That's not bad. Yeah, does I think it doesn't good. I don't know if it actually maybe doesn't. So I had a bunch of Cheez-Its and stuff. We all know there's a cart. There's a cabinet. Three meals. But we did also like just fill a bag full of like diet Cokes and chips. Do you stay? Are you planning a thing in the room a lot? Are you going to be wandering around the train? So the way they do is they have a Dave & Buster's car. They have they don't. They have a food car. Yeah, and they have apparently had like a general store. But have a viewing car. You're going through like, you know, I don't think Montana. I go through like what's wrong with Salt Lake City. Thanks. Yeah, and like love. I mean, you eventually under going to Kansas and stuff as well. Right. But like.",
            "start": 874.55
        },
        {
            "text": "through like, you know, I don't think Montana. I go through like what's wrong with Salt Lake City. Thanks. Yeah, and like love. I mean, you eventually under going to Kansas and stuff as well. Right. But like there's all like the pretty stuff as well. Yeah, and you can see what like we've done the time to see when we're going to be awake. So gonna be waiting to like Nevada. It goes up to like Truckee and all that on the way over. Okay, and then it's like really pretty. And then you go sleep for like the boring price. And then you wake up for the next stuff. So have you done a train with touring car before? Never. Oh, it's amazing. How do you know so much about trains for yourselves? You stand for long hanging everywhere. Yeah, but you take the bullet train. You there. No, no, no, no, no. What you think the come on there there when you're in a hurry. But if you're one one just wanted to see the countryside or two if you're poor like we were, then you take the five and a half hours of train transfers across country. I'm.",
            "start": 913.76
        },
        {
            "text": "there when you're in a hurry. But if you're one one just wanted to see the countryside or two if you're poor like we were, then you take the five and a half hours of train transfers across country. I'm bill from rural train to rural train to rural train. Okay, and travel to the countryside and travel through the mountains. Once we live up in the mountains, we didn't live in the city. No, every train trip up to us was this tiny little train called the PP train because it smelled like we're happy. And most the trains in Japan are really really clean. But the Nagaragawa Railroad had one train car that a cat had peed in like 20 years before and the smell had never gone away. And so we'd write up the Nagaragawa back down and again on JR and then ride all over the country. But the touring car on the Takayama Express is beautiful. I deal with some college movie on a holiday. Okay, so have you seen Your Name? No, not me. Okay, so the little town that's featured in Your Name, my wife and I.",
            "start": 950.99
        },
        {
            "text": "Takayama Express is beautiful. I deal with some college movie on a holiday. Okay, so have you seen Your Name? No, not me. Okay, so the little town that's featured in Your Name, my wife and I lived about 20 miles from that in Japan up in the oven, the Japanese Alps. And Takayama's not far from there. And yeah, we'd like the very far away from the rest of the office. The big giant mountains in the center of Honshu. I mean, they're huge. They're immense mountain areas like like super duper tall and then covered in snow. But there here and then very beautiful. But need jump off and you can just hang out the whole way down. Yeah, exactly. That's all for these. You can go to it. Have you upgraded your contacts? This is what the the Touring Car Liana Express. If you went up in the winter, the snow would be melting off the mountains and it would turn the river the color of jade. I mean, it would be the only Cleveland you work with the Japanese Tourism Board. I mean, literally just come back from there now. I.",
            "start": 985.62
        },
        {
            "text": "melting off the mountains and it would turn the river the color of jade I mean it would be the only Cleveland you work with the Japanese Tourism Board I mean literally just come back from there now I want to go back Corte amazing sake how extraordinary you thought that it's just like you're up there in the snow and that this is mountain town in the middle and oh and unlike the rest of the country during World War Two the mountains weren't bombed into nothingness and all the buildings are so there's factory of cottages up to the hundreds of years old and there's temples that were never burnt down and rebuilt and they were in and so you go up to these these bridges that are just ancient and they and it's so different than the rest in Japan yet so uniquely Japanese but these touring cars you look out you're going through cedar forest in the snowfall with this literally Green River like a waterfalls cutting down just for two hours winding up and there's like icicles and Magical Elves",
            "start": 1028.16
        },
        {
            "text": "you look out you're going through cedar forest in the snowfall with this literally Green River like a waterfalls cutting down just for two hours winding up and there's like icicles and Magical Elves running through the woods about as I'm doing except transpose all that with Kansas yeah okay kids you're going to look at see a bunch of Dan Reicher down East Kansas really pretty I actually I went I went to Kansas I went with Thanksgiving which I could actually wonder because I've never been I don't ever been to like the Bay Area sure I'm like LA right other stuff I got to see like a real sort of part of America and I was it would yeah that was thing I heard this past year I took a gen do a new game for tell you stuff and like cool Missouri and I that was the culture shock for her that was a bit different her first-ever tailgater first ever always like that kind of college pride we all have here did you like flyover country like did you enjoy it yeah I did it ruined me of back home in a",
            "start": 1062.15
        },
        {
            "text": "bit different her first-ever tailgater first ever always like that kind of college pride we all have here did you like flyover country like did you enjoy it yeah I did it ruined me of back home in a way where it's like you feel like you're kind of from you don't feel like your identity isn't like attached to this identity that everyone else has these millions of other people have so you end up crafting your own sort of one which is kind of like back home where like you know I'm from a town of 40 000 people but like we have an identity we hate them yeah Kenny the ones next door and we like these ones and you know you have just that weird tribalism yeah and and there's I don't know when when you're up foreigner in another country living in you tend to like know you know four or five of the things and then everyone else is just to other people but to go there and then be like oh no they got their own thing going on yeah the type of people their own culture yeah they're doing which is it",
            "start": 1105.57
        },
        {
            "text": "things and then everyone else is just to other people but to go there and then be like oh no they got their own thing going on yeah the type of people their own culture yeah they're doing which is it and then Japan last month was like the same kind of thing where it's like you get an appreciation for a whole different way of a culture looking at themselves yeah and I was like super Amy where have you been out of the country with you which I've never left the Mexico because I pretty much lived right there on the border I see your baby you wanna Susan I do have my favorite band what I'm just saying we all have to be visual maybe you see something say something you're right okay I an America we'd uh we'd cross the border to go visit a little town called Ain't That a Nosa and they sell like you'd go there to eat food and drink and chill like actually a lot of kids back home would when I was in high school would cross the border to go drink because they were legal over there yeah but it",
            "start": 1142.77
        },
        {
            "text": "you'd go there to eat food and drink and chill like actually a lot of kids back home would when I was in high school would cross the border to go drink because they were legal over there yeah but it was so **** terrifying I couldn't imagine ever doing that and I never wanted to because I was so scared of like just getting caught and things like that but no I like so I want to travel before I turn 30 and coming up pretty soon okay everywhere oh Jesus okay oh yeah so I want to hit when I wanna go I want to go to either Tokyo oh yeah or New Zealand I really want to be the Shire okay okay so bad two great plans yeah I know you're that big Lord of the Rings soon I mean not not the books okay yeah sure look I don't worry I read Fellowship once I can sixth grade or whatever how I get you shut up Kevin use your microphone the irony the one that looks like a hobbit I know you and Kevin yeah so I do want to go to New Zealand or Tokyo or a bunch of a bunch of other spots said you gotta go",
            "start": 1183.09
        },
        {
            "text": "up Kevin use your microphone the irony the one that looks like a hobbit I know you and Kevin yeah so I do want to go to New Zealand or Tokyo or a bunch of a bunch of other spots said you gotta go Tokyo Tokyo's awesome I've heard I and it felt like when I was at Rooster Teeth Gus had just gone yeah Gus went for a few weeks or whatever and then Adam Ellis went as well and just seeing their photos seeing them catalog everything on social media like a hot dude this looks **** and the ramen oh my god yeah man what is it about this time of year because I didn't really have eyes on Tokyo until I went last month and then when I came back it seemed like everyone I knew was going over there and soccer season 4 thing it's part of awesome so yeah that's right the cherry blossom so that's one part of it this brings probably the best time Elda Falls beautiful to it there's a game thing going on too because she was over there for Goldfarb's over there yeah that's why I think you're getting an",
            "start": 1228.12
        },
        {
            "text": "of it this brings probably the best time Elda Falls beautiful to it there's a game thing going on too because she was over there for Goldfarb's over there yeah that's why I think you're getting an influx right now right yeah we all worked with that industry come see Jess Toby that sounded like August right yeah I never been teenagers did alright I don't worry about it go Gamescom instead you should go to Germany actually it's **** dope so that paint had Germans amazing try was amazing I've never been I've never had that like feeling of being the other yeah right and you mind exactly it's like super I'm like there's no it reminded me going to Poland where everything because everything is like written and non like an alphabet you're not like the non Roman alphabet or whatever and it's like you don't have a reference point for anything I like even things that like you can kind of their kind of Acuras to the Western world they're like different in their own way likes like even saying",
            "start": 1279.39
        },
        {
            "text": "you don't have a reference point for anything I like even things that like you can kind of their kind of Acuras to the Western world they're like different in their own way likes like even saying hello and like talking to people it's just it's like 0% difference yeah but it's really but not in like language just in like culture and it just means that you're constantly feeling like you're not really you never know know you don't know don't offend anybody like I just so nice oh my god so that's right you'll get away with anything over there because even like that's the thing of like when the last trip I took was you know three years ago now for that Thanksgiving trip with Scott Lowe and whole bunch people and going there there's this awesome photo of us in one of the convenience stores all waiting for our dinner reservation and we sent Panda Musk outside to take it and he takes it and it's us in the window all drinking our beers or whatever waiting for reservation it's Kranepool and we",
            "start": 1315.18
        },
        {
            "text": "waiting for our dinner reservation and we sent Panda Musk outside to take it and he takes it and it's us in the window all drinking our beers or whatever waiting for reservation it's Kranepool and we posted it and soon we posted it like a great photo I think was Pear who pops means like you realize this sign above your heads there's no drinking alcohol and I the restaurant run inside the convenience store I'd also like to take umbrage with the idea that you can get away with anything I've got $1 000 speeding ticket from Japan two thousand dollars how fast with you coating about maybe 18 km/h / no knows what I mean 100 miles an hour I don't have anything to do that can you do that I know but up there Google a dozen or but yeah was a thousand dollar speed injection oh yeah don't speak just walk I don't mean that I'm in like you know how long does one coming out of big he'll get in so much thousand dollars eight hours of traffic school and a few different trips to to wait in line for",
            "start": 1353.7
        },
        {
            "text": "walk I don't mean that I'm in like you know how long does one coming out of big he'll get in so much thousand dollars eight hours of traffic school and a few different trips to to wait in line for several hours to get things stamped and a really like cool giant arcade where you had to drive fake cars at the end whoa in the traffic side only 1 miles over yeah I can't I could be exaggerating it might have been a little more I don't remember what f-test the traffic camera okay yeah it took me like two and half years again my American driver's license yeah it's a pain why thank you selling together I won because I was on a I've got a green card now so it went through a lot easier the first time I was applying I was on the visa which I got from CBS we got an intercompany transfer visa I'm basically when I like applied I had a license in Ireland but it was provisional it wasn't like a full one but I drove on it for like three years because back then nobody gave a **** in Ireland and so I",
            "start": 1392.94
        },
        {
            "text": "when I like applied I had a license in Ireland but it was provisional it wasn't like a full one but I drove on it for like three years because back then nobody gave a **** in Ireland and so I was reeling for the state wasn't like I had when I was doing like a younger California 1 or whatever am and basically because I was on that word visa I got put on some like they to look up information about who I was to make sure who I was and that process took over a year Wow and then in the end they were like still taking so long that I just went **** away for the green card so I did and then I went in and got it like within four weeks probably how long have you been here now I'm coming up on four years I think maybe three and a three change do you miss home ah like I was in England for five years before that and that felt as far mmm because like I getting home was relatively as expensive fiction and no money and yeah back then you don't have that much I mean you got more holidays in your",
            "start": 1442.86
        },
        {
            "text": "before that and that felt as far mmm because like I getting home was relatively as expensive fiction and no money and yeah back then you don't have that much I mean you got more holidays in your vacation you do but you saw them not that much and like I missed it like I missed the people but share Calvinism with parents and I miss my friends a lot but we're all like I got a fantasy football team with all my buddies and we wait now real football or fake American football okay good yeah no not your your not your sock well bye and so like if I missed it so much I wouldn't be here gosh oh my god my wife is here and we're you know settle down and happy and make your own family now kind of time yeah I like that kind of yeah we will you miss home you how long you been in San Franciscan er um I'm in San Francisco for it'll be two months on kind of playing life tonight oh yeah thrown your party perfect time very exciting you know so but before that I was in Austin it would have been I moved to",
            "start": 1483.18
        },
        {
            "text": "in San Francisco for it'll be two months on kind of playing life tonight oh yeah thrown your party perfect time very exciting you know so but before that I was in Austin it would have been I moved to Austin in 2008 um that summer house RT I'm the only nine right now how would we know he'll draw I was 20 okay yeah I was 20 so a little bit out of high school which is about five hours away from home okay so we just drove up there all my friends and I decided to move and say **** it I don't want to be here anymore back home there wasn't really much for me in terms of what I wanted to do with my career which is like I want to do art stuff animation or game design or whatever yeah so yeah I miss home only when uh when I'm in my group thread with my friends and they're like yo come over we're gonna do whatever whatever like we're gonna go play basketball or and that's when I like man I wish I was there you know because I have a really tight group of friends and then I miss my I'm bein",
            "start": 1531.33
        },
        {
            "text": "gonna do whatever whatever like we're gonna go play basketball or and that's when I like man I wish I was there you know because I have a really tight group of friends and then I miss my I'm bein my parents get Snapchat so they can send me like fact that any video a minor you have to dick they're my I was going to go even worse a better but you can send me photos of my nieces of my nephew because I'd go you know I never see them you know but you just you know text them to things sticks you have a text but the videos what like my dad uses text me videos and they're just so difficult like sometimes they don't play correctly or they're super blurry and it's fantastic you have an iPhone really you're it for a while it was just Kevin ruining the group threads I was I was like water whatever Kevin the punchlines now yes and I got your goddamn green bubbles popping up to uh you weightless you wait till your niece and nephews are old enough to like text you themselves right my oldest niece",
            "start": 1586.29
        },
        {
            "text": "Kevin the punchlines now yes and I got your goddamn green bubbles popping up to uh you weightless you wait till your niece and nephews are old enough to like text you themselves right my oldest niece now like have like I guess an iPod Touch they still make those okay very well better but she has a messaging app or you can use Messenger as long as someone else's on forever right yes if she like gets me up by myself she goes what's what's going on and it sends me like four Trump gifts like don't do that I live here yeah I'm trying to get away from them and talk to you I don't need that anymore up there that that photo him grabbing the is our on or that is bouncing around I was extraordinary that's amazing that was great episode of The GameOverGreggy Show if you agree subscribe here like the video there's nothing really to click on go support us on Patreon go watch other videos over here go check out Kinda Funny Games over there we're doing much cool Let's Plays and stuff come to",
            "start": 1629.62
        },
        {
            "text": "the video there's nothing really to click on go support us on Patreon go watch other videos over here go check out Kinda Funny Games over there we're doing much cool Let's Plays and stuff come to Kinda Funny Live three by shirt why don't you support us on all the Patreon did you know that we have a Twitter thing maybe should go there you know that f you have Amazon Prime you have Twitch Prime as well and you get a free subscription every 30 days you should give that to us did you know",
            "start": 1673.48
        }
    ]
}