{
    "id": 485,
    "video_id": "SCD1H6le_qg",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "What Moment Would You Go Back In Time To? - The GameOverGreggy Show Ep. 55 (Pt. 4)",
    "description": "Colin Moriarty questions what moment we would go back in time to.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1419494408,
    "duration": 1663,
    "transcript_chunks": [
        {
            "text": "Colin yes it's your topic but before we begin I want to say to everybody watching on YouTube Merry Christmas oh wow this is the episode that goes live on Christmas Day I'm cing right now you're cing right now yeah I thought for magicians that was so awesome from Courtney Williams Oh we have an insult from Courtney Williams yes Kevin what do you got for me all right Greg Miller once went to Barney's rooftop Deck restaurant for lunch and ordered a nishwa salad and called it a nikoy salad you totally pronounced nishwa wrong that's a line from White Chicks I believe not White Girls I don't think thank you very much Courtney of course if you want to insult me on the GameOverGreggy Show you can go to patreon.com/kindafunny right there you support us for 11 bucks Kevin insults me through you I feel like we should open more of those we should do four to five insults per show okay sure we sold Greg four to five times I said Merry Christmas and we sang A Carol and he's going red he's beat red",
            "start": 1.1
        },
        {
            "text": "Feel like we should open more of those. We should do four to five insults per show, okay? Sure, we sold Greg four to five times. I said \"Merry Christmas,\" and we sang \"A Carol,\" and he's going red; he's beat red like a Christmas carol. Need to stop it; it's getting out of hand. What are you talking about at this point? If you're like nice little people doing stuff, little girls, little boys, children, not, and you're doing something, rewind it. Kev, do let's go. Me and Kevin are sitting in a Thai restaurant, we're eating our Thai food, and all of a sudden these guys come in and just start playing guitar and singing \"Extremely Loud\" guitar. It was so upsetting, and like the people that own the restaurant, you can see them like what do we do? What we like; they did not know how to handle it, and like none of us knew how to react. It was up to... this is what you do next time. Oh yeah, then they start asking us for money, start walking by. I'm like \"Get the **** out.\" You walk up to the guy playing guitar.",
            "start": 57.92
        },
        {
            "text": "knew how to it was up it was joined in Che this is what you do next time oh yeah then they start asking us for money start walking by I'm like get the **** out you walk up to the guy playing guitar and as he's playing you just grab the struts just grab the bridge everything together and just look him in the eyes don't say anything just look at him in the eyes until he leaves I was going to say you could just go up to the you just go up and just un you know Dune one of his strings that be though is like then you're sitting here there's a bunch of other tables around and I'm like are you guys is is anyone actually into this because you don't want to be the guy that's like stop Christmas you know what I mean you want be the Grinch yeah I mean I'm pretty Grinchy you are Grinchy I'm I'm I'm a Grinchy ass Grinch but **** these guys like this is so rude to come into a place where we're eating our dinner and to just like do this thing that's like it's like me walking in with like speakers",
            "start": 124.04
        },
        {
            "text": "Grinchy ass Grinch but **** these guys like this is so rude to come into a place where we're eating our dinner and to just like do this thing that's like it's like me walking in with like speakers blasting rap music like that you don't want to hear like that's not cool and then recently we were walking downtown somewhere and there's just groups of people obnoxiously yelling at the top of their lungs like they're all singing Jingle Bells and it's like they're doing it just to be cute so you're saying this is some sort of epidemic that's happening in the city right now that I don't think I've seen a person sing Christmas carols ever in the nine years I've been in the city really when I was in band in high school I used to get a quartet together and we would go to Mission Riverside and it was so funny you say this and we would play music we would play holiday music and we just you know you put the thing out you'd make like 20 bucks turn NE uh yeah I probably was in Turnaround neck back then",
            "start": 162.08
        },
        {
            "text": "so funny you say this and we would play music we would play holiday music and we just you know you put the thing out you'd make like 20 bus turn NE uh yeah I probably was in Turnal neck back then do you think you were badass I was I had a ponytail like Stallone not Cagal, you did not have a ponytail I had a ponytail like Steven Seagal I need to see this photo uh there's one there's one photograph I'll take a picture of it when I go back to my mom's house there's one photograph of me and I had this wicked Widow's Peak like Eddie Van Halen and but I couldn't grow all of the hair out like Seagal did cuz I didn't have patience for that so I grew the top out and shaved the sides you know that was a thing back in like the late '90s man and I did that for a while and then I became drum major and my my uh band director at the time was like my teacher at the time was like you cannot have a ponytail and be drum major I just I won't allow it you've got to do it you've got to get kill that thing and so I you know I",
            "start": 201.76
        },
        {
            "text": "at the time was like my teacher at the time was like you cannot have a ponytail and be drum major I just I won't allow it you've got to do it you've got to get rid of that thing and so I you know I was like very very I was like I can't do this man this is like my identity right now and like what would Steven Spielberg say uh I already told you what he'd say I'm just a cook I'm just a cook so I shaved it I I shave I I cut my hair into like more of a fauxhawk style thing and literally the next day started dating like like discovered that girls thought I was way more attractive without that and I started dating one of the drill team members I'll never forget she's Phil gorgeous girl really really nice drill team and I was like why didn't I do this sooner why didn't everyone tell me that Steven Seagal wasn't cool anymore cuz he apparently at 98 Steven Seagal wasn't cool dude so how does this relate to to Christmas carols oh cuz we used to go out and play carols on I used to have you know I",
            "start": 245.92
        },
        {
            "text": "Seagal was not cool anymore cuz he apparently at 98 Steven Seagal wasn't cool dude, so how does this relate to Christmas carols? Oh, cuz we used to go out and play carols on I used to have you know I played trumpet for a really long time like 12 years or something like that. So me and I remember my buddy Adam Richman and uh I think my maybe it was my buddy Clay we'd go out and we we'd form a quartet and we'd play \"Deck the Halls\" - no, but it was fun and it was just something you did because it was like how hard is it to play that? You know. Yeah, this is funny to me because this goes against everything I just said about being obnoxious and being an ***hole, but young Tim, you know there's stories uh in Middle School there was this one girl that was so hot and so me and my friends were like let's go to her house and we were all in band and we were like let's play Christmas songs for her, so we just played \"Ukrainian Bell Carol\" - you know, that the whole time we never",
            "start": 287.92
        },
        {
            "text": "like let's go to her house and we were all in band and we were like let's play Christmas songs for so we just played Ukrainian Bell carols you know that the whole you have the other we never got to the we never got to that we just kept doing the thing over and over it's me then it was me on trumpet and three dudes with flutes played it we did it for so long until she finally it was either her or Mom it was probably her mom came out with a bucket of water and poured it out the window and poured it on all of us that's some did they come out before and say please stop or hello even no they just went straight to the water so my thing is this if your goal was to uh get her eye so to speak or catch her eye so to speak or make her notice you or make her like you you went about it the complete total wrong way yeah but Nick keep in mind that today Reddit there was a the top uploaded picture was this dude on a subway reading a book how to pick up women read book that said how to pick up women",
            "start": 332.64
        },
        {
            "text": "wrong way yeah but Nick keep in mind that today on Reddit there was a top uploaded picture was this dude on a subway reading a book \"How to Pick Up Women\" read the book that said how to pick up women on a subway and Sean and Nick are like no I thought it was genius did you yes okay that awkward move right there I would totally wear that that's the number one thing you don't do and I'm like are you kidding me that's the number one thing you do we out everyone you don't want I make shirts like this I think that guy was doing it in it did not strike me as he was doing it as like a fun way to start strike up conversations as much I'm reading the book he was doing it he was that that's first off that can't be a real book really are you're Amazoning it no I was going to show Colin the photo because I know he doesn't use Reddit because man that is the best way to get someone with a good sense of humor I'll tell you this though if you had that you can take that to any situation had like if",
            "start": 385.2
        },
        {
            "text": "I know he doesn't use Reddit because man that is the best way to get someone with a good sense of humor. I'll tell you this though, if you had that, you can take that to any situation, had like if you had a book that said how to pick up girls in bars and you were reading that in a bar, that's pretty genius. Like what girl every girl would look at you thinking you're an idiot but the one girl that got it, that's the one that matters, that's the one that you buy a drink for, that's the one you want to talk to, that's the one that wouldn't pour water on you when you're playing your guitar. Guarantee you're going to have a girl come up to you be like genius what's your name keep going would you like with oh my God see I was just about to say that that was like one of the first viral videos ever on the internet, the \"Ding Dong Ditch\" done Ding dong ditch done Ding. Remember that yeah I remember from Family Guy cuz Family Guy teaches me most of the things I missed on the internet and",
            "start": 429.04
        },
        {
            "text": "What Moment Would You Go Back In Time To - The GameOverGreggy Show Ep. 55 (Pt. 4)\n\nviral videos ever on the internet the Dinger done Ding, I remember that yeah I remember from Family Guy cuz Family Guy taught me most of the things I missed on the internet and in the world I can't find the photo but have we discussed the topic yet no we haven't even gotten to what your topic is oh it's Colin's topic wow jeez I said Colin it's your topic but before that Merry Christmas and then we went down this Rabbit Hole let's switch gears real quick maybe Colin's top Merry Christmas we could go back to Christmas with this topic very easily oh uh the topic is this I'm not sure how to eloquently put it but I was thinking about I was thinking about going back to your childhood but not like just going back and reliving random moments of any childhood but like your own child the things you remember and the things you would like to experience again the things make you feel warm and remind you being a kid again like when would you go back and when how for how long",
            "start": 471.56
        },
        {
            "text": "child the things you remember and the things you'd like to experience again, the things that make you feel warm and remind you of being a kid again. Like when would you go back in time? And how for how long? And at what age could you go back? You can go back as little or as much as you want to - just experience a day in the life, or a dinner, or a week, or a holiday. So I get to come back as I'm not trapped there; I'm not reliving my life and you might not live it literally the way it was, but you're not going to alter history. It's not going to be like that grandfather paradox okay? That's my take on it. You're covered - my questions are answered. I'm not going back in time and then having to live my life from that point forward; jump back and forth. Am I jumping back just to watch like a movie from my own eyes? Am I just watching like a movie, like I'm watching myself run around? No, I think I'd rather...",
            "start": 508.44
        },
        {
            "text": "What Moment Would You Go Back In Time To? - The GameOverGreggy Show Ep. 55 (Pt. 4)\n\nwatching like a movie, like I'm watching myself run around and no, I think I like that because there else gets weird; you don't want to be no, you're experiencing it; I want to, I, I would think that you could experience it as but I can't make choices; I'm just no, you can make choices; I'm saying that you're not going to make any choices that would be out of out of the ordinary; you're going to live have bra, you're going to live your normal life, bra; do I have my brain now; uh, I guess you would have to because you can jump back and forth; yeah, so here's my thing; I would go back to when I was like 7 or 8, Christmas Eve, while all my parents were sitting around the adult table, and I would request a seat at that table; then I would blow their **** mind with like all the information that I knew and like starting predict; I would predict the future; tell about the UFC; oh, I like that's; tell you what I thing mixed martial arts; you still have your ponytail; apple; apple invest in it right now; huge; huge; huge",
            "start": 544.12
        },
        {
            "text": "starting predict I would predict the future tell about the UFC oh I like that's tell you what I think mixed martial arts you still have your ponytail Apple invest in it right now huge huge huge dollars that huge huge huge hug huge Facebook not so much the IPO what's Facebook wait for it it'll blow your mind and they like what's that I'm like you don't even know what that is yet my God that's called dropping the mic dropping the mic I'm making all sorts of things up right then I would cartwheel out just cartwheel out did you cartwheel hell yeah I can cartwheel you know why I can cartwheel because when I was super chubby I wanted the I want I taught myself at a cartwheel cartwheel I taught myself a lot of this um the IGN E3 road trip yep video it's online because of Chris Farley he could cartwheel I thought it was funny so I learned how to cartwheel on my grass in my front yard while Shadow Boxing nice but in reality what would you want like what like all right I'll give you an",
            "start": 580.2
        },
        {
            "text": "Could cartwheel. I thought it was funny, so I learned how to cartwheel on my grass in my front yard while shadowboxing. Nice, but in reality, what would you want? Like, what... all right, I'll give you an example. Okay, I remember before my parents got divorced, I'd come home from school - kindergarten, first grade, second grade - off the bus and I had a Ninja Turtle metal tray that they'd put out like in the living room, and I would sit there and watch TV and eat a peanut butter and jelly sandwich, which was my mom's making. And then I'd just go and play with my G.I. Joes or my toys - like blocks or whatever - and play Nintendo games or something like that. Like, I want to just go back and relive a day like that... yeah, and just like remember what that is. But I also want to be cognizant enough to absorb information that I want to know - like, what was going on? What were the cars in the driveway? And what were my neighbors doing?",
            "start": 620.08
        },
        {
            "text": "but I also want to be cognizant enough to like absorb information that I want to know like what was going on, what were the like, like what car was in the driveway and like what were my neighbors doing and like what was the pinwheels up to, yeah, what were the pinwheels up to, how are the flowers looking in front of the house, that's a good one, yeah, because when you started talking about down that kind of not, yeah, mundane activity, like my I used to spend after school at my grandmother's right and watch like Batman: The Animated Series and Rugrats and Hey Arnold! and all this different Chicago stuff and cartoons and stuff Animaniacs, Tiny Toon Adventures, all that stuff, Rob Paulsen shout out, um I would love to go back and do that too, I was just like I remember she had this horrible shag carpet and like the feel of that and then like the kitchen had this like weird textured floor to it you know, just like memories and like the green fridge and all the and like the smell of her desk and all these different",
            "start": 656.56
        },
        {
            "text": "of that and then like the kitchen had this like weird textured floor to it you know just like memories and like the green fridge and all the and like the smell of her desk and all these different things that like you I have those like subtle memories of that I just don't have much to because like I was you know out there I have that bookcase that has all my games on it or whatever that's from her house and she had it forever and it's like I remember when I was a kid how big that bookcase was and how long that bookcase was and I remember when I was like I requested that for whatever house I was moving into like I knew my dad had all the furniture and he brought it and I was like this is it like I just remember it being like gigantic and so long and there it is and it's this tiny little thing she had A Tale of Two Cities on it and all this stuff yeah I don't know I just it's funny I have this I don't think I've ever expressed this to anyone but it's just a weird thing like I had this box",
            "start": 695.24
        },
        {
            "text": "Had A Tale of Two Cities on it and all this Twilight stuff, yeah I don't know, I just it's funny, I have this, I don't think I've ever expressed this to anyone but it's just a weird thing. Like I had this box of blocks, my dad used to do a lot of woodworking and he would have all the scrap wood and then he would rafter all into blocks for me. I was obsessed with building stuff; everyone in my family thought was going to be like an architect or something when I was a kid because I was like obsessed with building, yeah absolutely. Uh, like I used to build these like massive castles, like these huge structures with these blocks, like hundreds of them, and they were like big wooden blocks and it would just be massive, like all over my living room. I made these big complexes and I would go back into my block... like I had them in the my dad used to work, like like a side job as a produce guy and he had all these like great peach boxes that were like indestructible and so he'd bring them home and use",
            "start": 734.36
        },
        {
            "text": "Block like I had them in my dad used to work like, like, as a produce guy and he had all these great peach crates that were indestructible. He'd bring them home, and I put my blocks in, and I was going through them in college or high school, I think it was in college. And uh, I just dumped them all out, and in one of them, this is a weird thing, but there was a blue carpet fiber from my old house that I grew up in. And like, I was like, \"Holy ****,\" you know? Like, I'm like, that's just so weird. I'm like, this is this blue carpet fiber, and I put it back in the box with the blocks. Every couple years, I'd go and like dump them out again, and this carpet fiber would just be there. And I'd be like, \"This is a weird touchstone to my past,\" that carpet's probably been ripped out of that house and thrown out by now. And then I was really bummed when...and I don't know why it was.",
            "start": 766.96
        },
        {
            "text": "Touchstone to like my I'll never be back there again that car's probably been ripped out of that house and thrown out and stuff like that and then I was really bummed when and I don't know why it was just a nostalgic like Touchstone and then my my nephews you know I have nephews and nieces now and this is you know after I had left you know college and they come and play with my old stuff they don't touch my J but they can play with it anything they want and they play with the blocks and I remember going through them once and the carpet fiber was gone where's the **** fber well I remember like my my sister probably like what is this and like threw it out or whatever and I was like **** I'm like that was like a weird Touchstone I had in this box of blocks that back out you wake up the cops have you pinned down iing it was just a weird thing I'm a profound Cheryl my girlfriend always makes fun of me for where uh you know I'm like hyper nostalgic like hype like just crazy nostalgic",
            "start": 801.76
        },
        {
            "text": "Colin Moriarty questions what moment we would go back in time to.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\n\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys\n\ncops have you pinned down I was just a weird thing. My girlfriend always makes fun of me for being hyper nostalgic, like crazy nostalgic about my own house or my own childhood and upbringing. And wanting to go back to that point. So this was the where the question kind of came from because I want to really relive those days. Yeah, in a weird way, I want to be able to come back. I don't want to be there in perpetuity because it was probably boring and I didn't like it that much. But I'd love another day of being 10 years old and just playing in the pool and not giving a **** about anything. Think about your mentality - you didn't give a **** about anything, nothing mattered. You had no idea what anything meant, like no worries about money or bills or school. Like, whatever. Your life revolved around your friends and video games.",
            "start": 832.64
        },
        {
            "text": "anything nothing matter you have no idea what anything meant like no worry about money or bills or like your schools like whatever like you know like your life revolved around your friends and video games and and action figures that was awesome and like the occasional chore yeah it's like go mow the lawn and I'll give you no damn it I but I was excited I was like my dad would be like go mow the lawn and I'll give you $20 and we'll go buy like you know I remember like mowing the lawn and him going and buying me a TIE fighter you know and I was like deal yeah dude yeah I feel like there's a yeah dad there's a there's a ton of of just moments that I'd love to go back to and just experience again from when I was really young just a lot of a lot of playground related things like just being able to play tag and hide-and-seek and water gun fights and like just stuff like that I'll play tag with you yeah no but I mean like just like playing at The Parks I was at and like with the people",
            "start": 872.6
        },
        {
            "text": "able to play tag and hide-and-seek and water gun fights and like just stuff like that I'll play tag with you yeah no but I mean like just like playing at The Parks I was at and like with the people that I was with and like just doing all these things huh let's get them back one of them was right there let's have a Tim Gettys let's find every single person you can remember from your childhood and we'll play G some of them are little **** I but yeah I mean just doing all that stuff I'd love to just go back and just experience that again for a day but it's funny you saying you want to come back and all that stuff I feel like honestly seventh grade because that's when I really met my like core group of friends and like that it that's when I like defined really who I am and like got on the path to where I'm at today I feel like I would go back and just live it again like if I had the option everything from then to now knowing what you know yeah no way well I mean yeah miserable no I",
            "start": 909.8
        },
        {
            "text": "path to where I'm at today I feel like I would go back and just live it again like if I had the option everything from then to now knowing what you know yeah no way well I mean yeah miserable no I don't know man oh no there's no way I would absolutely do that if you said you can go back knowing what you know now to like when you were like seven I would just who wouldn't want to do that you wouldn't want to do that well you invest in stocks and **** that's not even that it's like it's just like going like knowing exactly who the person I like cuz I feel like all four of us have um let our passions lead who we are if that makes sense yeah I know right like um and I feel like for me you know just coming doing this show and being able to do the stuff we do at IGN like that's cool but that got started a little later in life for me um and I I think you know if you would you go be able to go back like and marvel at what you could accomplish knowing what you know now where would I be at 34",
            "start": 947.48
        },
        {
            "text": "started a little later in life for me um and I I think you know if you would you go be able to go back like and marvel at what you could accomplish knowing what you know now where would I be at 34 you know would I be is I I I couldn't I wouldn't want to go do it again because I'd be bored I'd be intellectually bored with everything that's happening and I'd start making different choices to not be bored maybe I'm not and then I'd also I'd always be terrified that I wasn't making the right choice that got me here you know I mean every choice gotten me here so am I take did I take this class or did I take that class before did I did I do this assignment and who did I talk for this I have folders of everything I've ever done yeah you don't get to do that you bring that **** back with you that's not how time travel works when you jump back to a seven-year-old it is risky I mean I can't I can't guarantee that if you're there for imp perpetuity that you won't make paradoxes too yeah the I",
            "start": 990.32
        },
        {
            "text": "not how time travel works when you jump back to a seven-year-old it is risky I mean I can't I can't guarantee that if you're there for imp perpetuity that you won't make paradoxes too yeah the I mean that's just guess that's why I bring up the idea of the movie thing like I would watch the movie of everything if like if it's movie movie doesn't necessarily make sense CU then I'm what I talk about what I think about in this scenario and not in a terrifying way like it was in this movie is in Being John Malkovich when John Cusack goes through the door like twice or whatever I for he goes through the door as John Malkovich and he ends up at like just an observer in behind his daughter's eyes yeah so he doesn't get to make any choices he just sees how that life is you know he's along for the ride yeah I feel like I would love that I mean I know obviously I'm talking at this point 13 14 years like of course that would suck that'd be the longest worst movie ever yeah but like that'd be there",
            "start": 1029.56
        },
        {
            "text": "yeah I feel like I would love that I mean I know obviously I'm talking at this point 13-14 years like of course that would suck, that'd be the longest worst movie ever yeah but like there'd be days you wake up and you're like oh my God I can't believe this is what happened or it's like oh **** I Know This Moment's coming or like God I'm going to do something so awkward today or like **** this is going to suck, but I still would love that I mean even going back and I feel like I can kind of do this watching the old videos I made recently I found an old hard drive and I have all these like crazy videos and I'm just like some of them are like I was a genius and some of them I'm like what was I thinking, no that one you showed me today, the Charles Barkley one, was genius, I'm telling you right now if this is what I'm saying not being a passive viewer I'm talking if you could go back and be like I'm just going to live my life from that point to this point not trying to be the person I am",
            "start": 1066.2
        },
        {
            "text": "What Moment Would You Go Back In Time To? - The GameOverGreggy Show Ep. 55 (Pt. 4)\n\nis what I'm saying not being a passive viewer, I'm talking if you could go back and be like I'm just going to live my life from that point to this point, not trying to be the person I am today, yeah, just seeing what else happens, seeing knowing everything I know now, what would be different? Would I wind up in the same place or like for me, would I skip college and just go to LA and find someone and start apprenticing with them? I would skip College, I would skip College. I probably would have skipped college. No, I would 100% you guys, but you guys majored in something that like you loved, and I did two with film, but I would have gone to a trade school probably knowing what I know now, cuz all of the technical information, no more like AFI or uh a school that wasn't you know a four-year University, it's still expensive, but something that taught you just a trade. Like see, I would have just talked to a camera sooner, like that's one of my biggest regrets in life, like I remember and",
            "start": 1103.32
        },
        {
            "text": "University it's still expensive but something that taught you a trade, like I would have just talked to a camera sooner - that's one of my biggest regrets in life. Like I remember, and it's funny that it wasn't until recently that I really started doing it. But like I back in 2007 maybe 2006, I was a junior in high school, and I remember me and Alfredo were talking, \"If you could go back in five years, what would you tell yourself?\" And I was like, \"I'd tell myself just talk to a camera and say the news.\" Yeah, you know, say what's going on. Like it back then sounded so simple, and now it's even more... it's like yeah, just do that, and it works. I'm like, why didn't I just do this before? Yeah, you'd have two million subscribers on YouTube right now. Yeah, it's just like able to exactly - you know. And that's just crazy to me that like you know in hindsight it's always 2020, you should have known, should have done this. That's what I",
            "start": 1143.56
        },
        {
            "text": "What Moment Would You Go Back In Time To? - The GameOverGreggy Show Ep. 55 (Pt. 4)\n\nYouTube right now yeah it's just like able to exactly you know and that's just crazy to me that like you know in hindsight it's always 2020 you should have known should have done this that's what I always think about with the when I did the video game column and blog right which got me to IGN I remember I used when I covered the PlayStation 4 and I'm sorry PlayStation 3 launch, I took my digital camera and did little videos of interviewing people in line and then the first Walmart you know PlayStation leaving Walmart y y and I put those on YouTube and those views jumped like crazy and like YouTube would hit you up and ask you like oh you should monetize these videos I'm like I'm not going to do that or whatever blah blah but it never dawned on me that I'm writing this blog and I'm doing this column and why not speak into that camera about video games once a week once a day you know what I mean it would have been how you could have it's crazy even like taking it even to video games",
            "start": 1181.56
        },
        {
            "text": "this column and why not speak into that camera about video games once a week once a day you know what I mean it would have been how you could have it's crazy even like taking it even to video games like just to see the birth of people talking into a camera about video games I think one of the first people that I really remember doing is Destin actually oh yeah like yeah like like even back on ScrewAttack, the Shotgun Review, like today we're inducting Mario's Boot and but that's that it's crazy to me that now it's so common it's so common and it's so just like oh yeah we all do this it's all it's a normal thing but it's like back when he was doing it it was not normal like he was one of the only dudes talking about video games on the internet yeah it's crazy yeah I don't know man it's it's very interesting I just I I get nostalgic for time like I I noticed that I mean maybe it's just a natural progression but as I get older I get nostalgic for weird **** like I'm even nostalgic for",
            "start": 1221.16
        },
        {
            "text": "interesting I just get nostalgic for time like I I noticed that I mean maybe it's just a natural progression but as I get older I get nostalgic for weird stuff like I'm even nostalgic for like 2011 now you know nonetheless 1991 I feel like Smash Bros does that to me like there because there's been such generations with Smash Bros and like my group of friends has a lot of the consistency but then there's also like a lot of different people especially now because of IGN like my IGN family it's like it's crazy to look back but man like I would give anything to go back to playing smash 64 or melee for the first time or like not even the first time like let's say six months into it you know just when it was finally that like the group of people that were like yeah we got this going or like Melee where me and my friends would just go home after school every day and just play Same **** Final Destination no items just us every **** day and then Brawl came out and it just",
            "start": 1264.0
        },
        {
            "text": "like Melee where was me and Corrin where we would just go home after school every day and just play Same **** Final Destination no items just us every **** day and then when Brawl came out and it just groups of us playing then coming to IGN playing with all of you guys and now all us playing this new one it's crazy oh I know that game is and Greg's favorite setup which is any stage but Final Destination 300% my God I tell you what I've been playing I've been playing with Frank Fanello uh guy who did Beyond with us in Toronto uh playing smash with him and he uses items and like that is like learning to walk again playing that game and like shit's falling from the sky like what do any of this my problem with items is just like once you learn which one one like their strength of just throwing if you just throw items at people they will die yeah I agree that's what I did to this new one this new one has some cheap ass weapons the Gust Bellows thing the Dumbbell Beetle that takes you away those are",
            "start": 1307.56
        },
        {
            "text": "just throw items at people they will die yeah I agree that's what I did to this new one this new one has some cheap ass weapons the Gust Bellows thing the Dumb Beetle that takes you away those are instant kills yeah I agree DDD don't need weapons except his hammer yeah all he needs is a hammer and and that that sociopathic face he has the face of a psychopath yeah he's just like just there's nothing going on behind those there's no conscience behind that as those eyes it's so I love how much Kard loves it like it's just so good he's a great character he's just such a dumb character did you ever a penguin with the Robon I think I know the answer to this but have you ever seen the Kirby cartoon I don't think so Kirby right Back at ya that's the name of it no I don't even think I oh Colin it's an American yeah yeah yeah it was on Fox Kids oh just do YouTube DTD in in this show oh man he has like the worst accent ever is you like yeah he is what kind of background is Jamaican what's up I",
            "start": 1349.16
        },
        {
            "text": "an American, yeah, yeah, yeah, it was on Fox Kids. Oh, just do YouTube DTD in this show. Oh man, he has like the worst accent ever is you like, yeah, he is what kind of backhand is Jamaican? What's up I see, I I don't even remember at this point, I just remember it was like whoa, this is so not what you would ever imagine Kirby's weird. I remember when Kirby came out, I was like what the hell is this because it was such a... it was a Game Boy game but it was also a late NES game around the time that like Yoshi's Cookie came out, Wario's Woods, Mega Man 6, there was like a lot of weird games like in '94 that were coming out I was like what the **** is this **** and it wasn't until later that I like in like the mid to late 90s when I started playing the Game Boy ones I was like this is a good series Kirby yeah it was. I never, I never got the... it was easy as hell, it's too **** easy, it's really easy, it's real bad but then again I'm an OG at games so you know whatever watching that did you guys see",
            "start": 1393.76
        },
        {
            "text": "yeah it was I never I never got the it was easy as hell it's too **** easy it's really easy it's real bad but then again I'm an OG at games so you know whatever watching that did you guys see that Kids React video with Mega Man I was like I was like Mega Man I was like I wanted to scream at the computer I'm like see something that's unfair something unfair about that video though is like those kids don't play video games period like if you got kids that would call themselves Gamers now playing I think it would be a different story not that much different but I that video I take a little offense to because I know for a fact those kids don't play games jerks I was just I was just thought it was so funny how evil it was cuz like they just put him in into Mega Man 1 which is definitely the hardest one too like like they didn't even do like Mega Man 2 or something a little more manageable it was like Mega Man 1 but they did give him Bomb Man stage they told him to go to bomb that",
            "start": 1438.12
        },
        {
            "text": "the hardest one too like like they didn't even do like Mega Man 2 or something a little more manageable it was like Mega Man One but they did give him Bomb Man stage they told him to go to bomb that is the easiest stage so they did try to give them some advantage if you go back to the day when you first unwrapped Mega Man Three, that would be a good day yeah man I mean I waited so long for that game I I remember that was in Nintendo Power Nintendo used to have like the shitty broke ass like No Frills drawings of characters remember that like some of them were terrible I remember there was like a poster they had like all like I remember taking the Mega Man 3 ads it was next to a Snow Bros. ad Snow Bros. was a really rare NES game that's like actually really expensive to find and I wish I I I rent used to rent it I wish I just **** bought it uh and I remember putting a poster on my wall whatever and just waiting for I was like oh man I'm gonna fight Gemini",
            "start": 1478.92
        },
        {
            "text": "and I wish I had rented it, I wish I just bought it, uh, and I remember putting a poster on my wall, whatever, and just waiting for I was like oh man I'm gonna fight Gemini Man first, I'm going to fight Shadow Man, and then I realized when I played the game you don't start with Gemini Man, you start with Magnet Man, and he ended up being the most OG of them all, Magnet Man was my dude, I used to dress up as Magnet Man, run around the woods. Ladies and gentlemen, that's The GameOverGreggy Show. Each week, four sometimes five best friends gather on this table, each bring a random topic of discussion for your amusement. If you like that, you can hit up kindafunny.com/patreon, each and every Friday to get the episodes brand new, spanking new, early as an MP3 and video. If you don't want to give us any money, that's totally cool, you can go to youtube.com/kindafunny to get each and every topic broken out day by day starting the next Monday, then go to kindafunny.com",
            "start": 1513.2
        },
        {
            "text": "want to give us any money that's totally cool you can go to youtube.com/kindafunny to get each and every topic broken out day by day starting the next Monday then go to kindafunny.com buy this shirt or the Moriarty Miller ticket if we never get back on the same page yeah we'll see we're tearing each other apart you're tearing it apart I'm at the top of the ticket I'll get another running mate it's fine I'm going tell you this right now Kevin anyone with a \"brby\" regional balance I'm gonna tell you guys right this right now if you guys can't even get get it together to podcast how the hell are you going to take care of this nation Tim and I are solid like a rock, rock we're solid solid we're solid Like a Rock like a rock all right whatever you say ladies and gentlemen Merry Christmas CH have a happy New Year if you're watching this late and until next time it's been our pleasure to serve you did you really do the thing with the woods oh yeah we've talked about that",
            "start": 1552.32
        },
        {
            "text": "CH have a happy New Year if you're watching this late and until next time it's been our pleasure to serve you. Did you really do the thing with the woods? Oh yeah, we've talked about that. I had a Fisher-Price magnet that came in like some sort of science thing. It was like this big plastic Fisher-Price mag. I was like probably like this and I used to rubber band it to my head and then I would put on like I'd have like this fake Mega Buster because Megaman had his own Mega Buster. Some of the Robot Masters had no Mega Buster, and some of them had two - like Needle Man had two, Gemini Man had one, Stinkoman had one. Yeah, but Proto Man didn't; he would throw his **** anyway. Uh, and then I would have like a cape, then he didn't have a cape, I just wore the cape anyway. I love this so much, I learned so much about it. And then I would D- and then I would Dash into the woods and run around. Were you like singing the song? I don't know what the hell I was doing. I used to my friend my",
            "start": 1594.48
        },
        {
            "text": "this so much I learned so much about I would D and then I would Dash into the woods and run around did were you like singing the song I don't know what the hell I was doing I used to my friend my friend Brian across the street used to have a boomerang too and so I used to play I used to dress him as Quickman sometimes as well which was basically just the same outfit but with a boomerang on my head instead of a magnet so that's it good night",
            "start": 1637.6
        }
    ]
}