{
    "id": 6,
    "video_id": "cSd1f2KMAYA",
    "show_name": "A Conversation With Colin",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "The Chemistry of Hand Lotion: A Conversation with Colin",
    "description": "What does Greg pull from the conversation pile today? Hand lotion. What's Colin have to say about it? A lot.\n\nLeave your suggestions for future conversations in the comments below.\n\nSUBSCRIBE/LIKE/SHARE\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Tim for filming.",
    "published_at": 1345748410,
    "duration": 173,
    "transcript_chunks": [
        {
            "text": "I squeeze three in my hands one two three okay and then I kind of do a little bit of this what's up everybody Welcome to A Conversation With Colin I'm Greg this is my roommate Colin uh sometimes Colin says crazy stuff so every Tuesday and Thursday we sit him down and give him a brand new topic to discuss he has no idea what the topic will be from my pile of topic cards but we spring them on them and people have fun if you like it if you have fun like this video share it with your friends and then subscribe to us here on YouTube youtube.com/ gameovergreggy Conor ready yes the topic of conversation today is hand lotion now Colin hand lotion is an interesting topic for you but you you you see I I buy this Neutrogena stuff I get all dry out I use it you always say I'm cheaping out I'm going cheap what what do you use Lubriderm why is that and why is it more expensive uh I don't know why it's more expensive because I'm not a chemist but uh but it's",
            "start": 0.12
        },
        {
            "text": "you always say i'm cheaping out, i'm going cheap, what, what do you use Lubriderm? why is that and why is it more expensive uh i don't know why it's more expensive because i'm not a chemist but uh but it's it's good lotion when i started getting tattoos when i was like 18 yeah 19 uh the tattoo artist that i was using at the time uh in cambridge massachusetts uh recommended to me Lubriderm because it's a it's a good lotion, it's a a thick creamy lotion yeah and it has no scent so it doesn't burn you uh or burn the tattoos since they're open wounds if you put if you put scented lotion on your tattoos as i learned when i got my first tattoo it really hurts did very bad yeah it was horrifying um so he it turned me on to the the wonders of Lubriderm about a decade ago and ever since then um i've really enjoyed spending you know paying a premium for this lotion but really having great skin as a result yeah yeah so what's your routine then when when do you put it on when do you put it off",
            "start": 43.04
        },
        {
            "text": "\"um I've really enjoyed spending you know paying a premium for this lotion but really having great skin as a result yeah yeah so what's your routine then when when do you put it on when do you put it off so well you don't never put the lotion off because it kind of just you kind of wash off or but uh I put it on uh when I get out of the shower uh I like to take Lubriderm I squeeze three in my hands one two three okay and then I kind of do a little bit of this and then I put it on my arms on my tattoos on my hands and then on my face then I take a towel and I kind of wipe it off in my palms but not over here because you got to worry about the cuticles and and things of this nature okay see that's my problem with it is that when I use it I I have really dry skin it hurts sometimes in the morning but then I got to walk the dog I got to touch doorknobs I I can't get I got to so I wipe it off my palms that's what I'm missing yeah wipe it off your palms and if you're using you know I'm not saying\"",
            "start": 83.8
        },
        {
            "text": "then I got to walk the dog I got to touch doorknobs I I can't get I got to so I wipe it off my Palms that's what I'm missing yeah wipe it off your palms and if you're using you know I'm not saying you're using cheap lotion but it sounds like you might be you might be using like Suave or something you're getting for like $3 a bottle maybe and it's it's a little greasy the more expensive the lotion gets typically the less greasy the lotion gets okay and and and it and it's it's got the the finer qualities of the lotion that you're looking for okay Norwegian quality some might say because Luber of course was made in Norway of course we all know that uh why did you get all these tattoos uh I don't know okay well Colin I think that about wraps up this conversation if you enjoyed it like it then share it subscribe to us here on YouTube we'll be back every Tuesday and Thursday with a new topic of conversation and until then I hope you have a conversational day",
            "start": 121.76
        }
    ]
}