{
    "id": 90,
    "video_id": "GnGi_XZYK3U",
    "show_name": "Cooking With Greggy",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "How to Make Buffalo Wings at Home: A Conversation with Colin",
    "description": "Got a hankering for some chicken wings? Let wing expert Greg Miller walk you through baking them at home.\n\nToday's topic was submitted by Colin Moriarty. Leave your suggestions for future conversations in the comments below.\n\nRECIPE\n- Chicken wings (1 or 2 pounds)\n- Teaspoon of salt\n- Tablespoon of veggie oil\n- Cup of flour or pancake power\n- Pepper and cayenne pepper and garlic salt and whatever\n\n1) Put the wings in a bowl. Coat'em with the veggie oil. Toss on the salt. Rub everything together.\n\n2) In a big ol' Ziploc, mix the flour/pancake powder with the other spices you like. \n\n3) Toss the wings in the powder mixture you've made.\n\n4) Lay the coated wings out on greased baking sheets.\n\n5) Slide the sheets into a pre-heated 435-degree oven. Leave'em for 20 minutes.\n\n6) At the 20-minute mark, flip'em and increase the heat to 445 degrees. Let'em cook for another 20 minutes.\n\n7) Warm up your sauce if it's cold.\n\n8) After the second 20-minute session, toss in your sauce and eat them.\n\nSUBSCRIBE/LIKE/SHARE\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Tim for filming.",
    "published_at": 1374584412,
    "duration": 1283,
    "transcript_chunks": [
        {
            "text": "You've got to get this - when you don't want to go touching your eyeballs, your butthole. You don't want to get sick; you don't want to get your butthole sick with some chicken juice. What's up everybody? Welcome to a conversation with Colin. I'm Greg, and this is my roommate Colin. Now sometimes Colin says crazy stuff. So every Tuesday and Thursday, I reach into my topic pile, pull one out, toss it at them; we talk it out for your amusement if you like that. Like this video, subscribe to our channel, share it with your friends. Colin, are you ready? No, Greg. I'm not. The question is, are you ready, Greg? Three things are true: Greg is better looking than you, are; I'm smarter than you are; and I'm more interesting than you are. But here, but here's - we did a conversation with Colin season two, maybe chicken cutlets right? Right, yeah. Everyone had your chicken cutlet R. We had a lot of questions about something a chicken product you make though. Oh, and so we're doing a conversation with Greg, chicken wings chick.",
            "start": 0.04
        },
        {
            "text": "Right, right, yeah, everyone had your chicken cutlets. We had a lot of questions about something a chicken product you make though. Oh, and so we're doing a conversation with Greg. Chicken wings, chick, let's do it all right. You got chicken wings all right, let's do it. Get all the supplies out here. You're going to have to do it now. Remember I got a new iPhone because you broke my old iPhone. No, you broke it. I'm wearing shorts and a button-down shirt, so don't worry about me. That was a big question last time we did one of these conversations was how this all worked with the how we had why we're all wearing shorts. The way we weren't chicken wings let's turn on a light here. I got you some Foster Farms all right go put it over there that's fine. I'll get the bowls down. This basically in the bag just looks like a chicken took a **** and threw up inside some plastic so let's uh hope you can do a little magic with this. I'll be able to do plenty of magic with that. Let's start doing some b-roll.\n\nI corrected phonetic mistakes, such as \"chicklet\" to \"cutlets\", \"Foster uh Foster Farms\" to \"Foster Farms\", and \"button down so don't worry about me\" to \"button-down shirt\". I also capitalized proper nouns like \"Greg\" and \"Foster Farms\".",
            "start": 41.84
        },
        {
            "text": "just looks like a chicken took a **** and threw up inside some plastic so let's uh hope you can do a little magic with this I'll be able to do plenty of magic with that let's start doing some b-roll close-ups on that get your Foster Farms arms yeah okay what do you need I need here's the thing I usually use flour but I'm going to need today you need first off you're going to get a big old plastic bag it's crucial over there I need for spices I need salt pepper PE uh no you probably want the you probably want these right yeah I get the big old kosher salt I have in there kosher salt in there you need kosher salt you need pepper uh cayenne pepper is in there as well I'm going to need that uh you can use flour or you can use pancake batter we're going to use the pancake batter today okay cayenne pepper I'm looking for the cayenne pepper it's up there it's red it's good I make this I make I make chicken wings at the house at least one at least once a week often more often twice a week if",
            "start": 78.2
        },
        {
            "text": "pepper I'm looking for the cayenne pepper it's up there it's red it's good I make this I make I make chicken wings at the house at least one at least once a week often more often twice a week if I'm getting crazy I'm not I'm not seeing it Greg help me out here buddy all right move you go back to the table and understand the guests see we got we have a lot of red powders in there yeah that's problem here we'll TOS chili powder we'll go chili powder maybe chili powder yeah let's see what else oh here it is you just had your back to it or it had it back to you I was look I wasn't even looking in the counter there I my back we got black pepper black pepper okay boom salt chicken pepper cayenne pepper you your batter there is what that's going to be you want to pick up that iPhone start going with it you can start doing all b-roll pickups you can move those legs around too garlic powder big part come over here uh you want you're going to need a few things a tablespoon a teaspoon and then",
            "start": 120.84
        },
        {
            "text": "It you can start doing all B-roll pickups, you can move those legs around too. Garlic powder is a big part of it. Come over here. Uh, you want? You're going to need a few things: a tablespoon, a teaspoon, and then a cup. So these are... these are... these are all part of it. Uh, vegetable oil as well. Vegetable vegetable oil. All right, so here you drop this there. Drop all this stuff down there. You got closeups on that C for the first time. Yeah, okay. So Colin, you just come stay with me. You just do B-rolls from over here. So there you got your wings. Now I usually do two packages of wings when I do this, which usually equates to 2 lbs. You can see here I'm actually going to be running 3 lbs. It's no big deal; the recipe scales if you want in terms of what you're putting in and how you're putting it in. Can you bring with the trash can? Big sure. You want all this chicken stuff getting all over our conversation table? Little Patch's box there. Yeah, a little product placement. We always eat that P cheese here, and you should too.",
            "start": 157.92
        },
        {
            "text": "can big sure you want all this chicken stuff getting all over our conversation table little Patch's box there yeah a little product placement we always eating that P cheese here and you should too San Francisco P cheese pizza tweet at him said you say said saw him here see toss it in I go by poundage right I what I'm going to do here is be making this uh three pounds of chicken wings getting it going that way see you toss them all in a bowl Colin easy to go here's the next thing I can have you get me all right get me two baking sheets okay uh preheat the oven to 435 okay dramatic effect while you do that some people rinse their wings Pat them down I don't just run out of the package right in the thing it's fine for me and I'm still alive that's the other thing Callin for his you know chicken wings are my favorite food I eat them all the time knock on wood never never been food poison always thought that would happen some raw chicken well now it's going to happen well are these all",
            "start": 202.72
        },
        {
            "text": "wings are my favorite food I eat them all the time knock on wood never been food poisoned always thought that would happen some raw chicken well now it's going to happen well are these alright yeah these are great these aren't really cookie sheets but they're something what do you call them I thought cookie sheets were like the ones with the sides and stuff like that you'd I thought it was all just baking sheets yeah baking sheet maybe You'd call that okay um I'm going to grab some aluminum foil then and Pam too Pam yeah looking handsome today guys thank you you can tell look at those guns how much how many chicken wings a week does he eat looks like a million bucks look how much weight I gained don't push it out suck it in I'm always sucking it in everyone's like stop pushing out I'm like I always suck it in this is my normal thing you just you just push this is this is it let me do that's sucking it that's what you're doing sucking your belly button up to your C like",
            "start": 255.08
        },
        {
            "text": "I'm like, I always suck it in, this is my normal thing, you just, you just push this is this is it, let me do this, that's sucking it, that's what you're doing, sucking your belly button up up to your C, like boom, that's where you got to go, that's what my wife would say, that's good, that's that's that's strong core right there. I know but I'm scooping, I can barely breathe when I do this though. Yeah but you know what, you don't need to breathe still look good okay, you just got to look good, those Hollywood actors ain't this how women do it all the time have you seen Spanx? Alright Greg, hey back to me so here's something that a lot of people will say about right is that they're going to say I'm not making real chicken wings 'cause I'm not frying them now they have a good point, the problem is that I have a little bit of a roommate who yells at me every time I use the fryer cuz it stinks up the house you get really cranky about it but also again with the amount of chicken wings I eat.",
            "start": 304.0
        },
        {
            "text": "A little bit of a roommate who yells at me every time I use the fryer because it stinks up the house, you get really cranky about it. But also again with the amount of chicken wings I eat both here in the house on a weekly basis and I'm making on my own and then at establishments all over San Francisco. You know, I don't want to die that quickly if I fried all my chicken wings, I'd be in trouble. Col, you know what I mean? Yeah, I hear you. Well, we're both going to die soon anyway, sure, that's true too. All right, so we sprayed down the cookie sheets with Pam. We've put all of them oil on here. You got a whole bunch of chicken wings in there, right? So now we're going to start seasoning up these guys. You want to do vegetable oil, this is where the tablespoon comes in - a tablespoon of Veggie oil. I'll move some out of the way like so and just dump it over there. I like to put a little more in; we got a lot of chicken wings here, so I want to make sure they're all getting",
            "start": 348.88
        },
        {
            "text": "of Veggie oil I'll move an item out of the way like so and just dump it over there I like to put a little more in we got a lot of chicken wings here so I want to make sure they're all getting equal love then salt teaspoon of salt I like how you have a separate spoon there smart you like that I I don't want the salt to stick to the thing and plus they're different sizes teaspooon you'll get some oh you got a tablespoon and a teaspoon right sizes math exactly it's all about it's all about that now here's what we're going to do we're going to let that sit for one second before I get my hands disgusting open up this bag again now what you can do is you can use flour usually I use flour but easy money the other day out of a convenience store yeah exactly our little convenience store in the San Francisco Bay area so now I'm just doing a cup here good old angel Mama come on give a little tap yeah tap tap Baro there we go there you go there she's flowing now must be",
            "start": 390.96
        },
        {
            "text": "store in the San Francisco Bay Area so now I'm just doing a cup here good old angel Mama come on give a little tap yeah tap tap Baro there we go there you go there she's flowing now must be that time of the month for look at her face she's **thrilled** she loves it getting tapped Andre mama she's getting tapped no there you go that's wait is that pancake batter it is again you can use flour or pancake batter cuz guess what I bet here's the real story of all this you probably could make pancakes with just straight flour and nobody would know the difference who the hell knows I ain't no chef is that true probably th this way all right so we got a cup of our ingredients here now here's where you get crazy you can just go do whatever you want I like a lot of garlic in there see now what I'm doing is se you know basically this will stick to the whatam call the chicken it's going to stick to the chicken it's going to give you that taste some of that cayenne pepper oh yeah so if you don't",
            "start": 433.32
        },
        {
            "text": "doing is se you know basically this will stick to the chicken it's going to stick to the chicken it's going to give you that taste some of that cayenne pepper oh yeah so if you don't like saucing them like I do if you just want a little bit of sauce yeah I go crazy this is all eyeballing it's all what you want to do to taste they say exactly to taste C have you come around by the hands over here yeah still be my co-host like here I want more pepper than this is you can get a you're still on the show well there's a move the trash can you're an adult there you go peppero now what I like to do Colin is then SI it closed and get it all mixed up so again I'm kind of getting equal there m all the chicken I want some chicken getting some pepper them not getting all this there we go it's good and then come over here now remember important step I already put the salt on there and I already put the thing on oh dear yes you got to get in there you got to get messy you got to get",
            "start": 476.72
        },
        {
            "text": "Go it's good and then come over here now remember important step I already put the salt on there and I already put the thing on oh dear yes you got to get in there you got to get messy you got to get in this is when you don't want to go touching your eyeballs your butt hole you don't want to get sick you don't want to get your butthole sick with some chicken juice that's that's how it happens right I think that's how it goes Sal Manilla nothing as bad as a sick butthole well after you eat these depending on your level of hotness I like the noise it's kind of like the sizzle it is very much like your sizzle noise that's the pizza the pizza guys here I'm going to go I'm going to go get the sign for it oh you are what what kind of tip what kind of tip do you want H 20% whatever Portillo chill the **** out man all right so anyways we've mixed them up good here we ordered a pizza too we decided the wings weren't going to be enough for just sorry we're just recording upstairs I'm just",
            "start": 526.08
        },
        {
            "text": "the guys out man all right so anyways we've mixed them up good here we ordered a pizza too we decided the wings weren't going to be enough for just sorry we're just recording upstairs I'm just going to get the pascal's tossing the wings in the bag now all right let's see so they're in the bag and I just toss them around it's shake and bake baby right exactly Nick Scarpino they can't hear you off camera pre-heat I'll tell you B's a lot more healthy exactly Nick's making a good point if you can't hear him off camera do I prefer fried or baked chicken wings fried that's I mean that's how chicken wings are supposed to be made but again with the volume of chicken wings I eat both at a restaurant and that I'm cooking on a day-to-day basis I cannot sit here and not if I fried them every time I die that's how it would go col if I fried as much chicken wings as I ate I'd be dead all of them so there you go look through there you got nice coverage you can see the pepper on there you can see",
            "start": 565.84
        },
        {
            "text": "I die, that's how it would go Col if I fried as much chicken wings as I ate, I'd be dead all of them. So there you go, look through there, you got nice coverage, you can see the pepper on there, you can see that we got good a good batter there, a good a good coating. Check them up a little bit more, get it right there now again, like I say, I've done this with as little as one pound of wings up until probably four. I mean I don't really care about the flour, the pancake batter, I don't use it that much, hence why I'm just like we'll toss it in there, what do I care? Have you done the breading like the breading? What do you mean get the bread crumbs that you can buy? You ever tried oh Mike Mitchell does that, the panco breading. Yes, Mike Mitchell tries out that panco breading once in a while. I've had them they're good. I stick with what's easy for me, what I like working he fries those too then yeah and that's the whole thing we're back to but we're back to again I eat too many chicken to do that way so to",
            "start": 615.2
        },
        {
            "text": "Good, I stick with what's easy for me. What I like working he fries those too, then yeah, and that's the whole thing we're back to, but we're back to again. I eat too many chicken wings to do it that way, so to keep the debris off of the pan you take them out individually and place them exactly. I'm shaking them in the bag, shaking off the excess flour as the kids say. What do we got here on the preheat? How's it doing? We're real close, yeah. Good, I'm going to get it. I'm going to get it on the camera here when it goes. Thank you. That's going to be important because it's at 435 degrees and... uh oh, 430, yeah, yeah, yeah. It's almost there. We're getting real close. Oh my God, my God. You're going to be happy you got that shot. Oh my gosh, this is going to be good. So you shake them off, you put them in there, spread them out for your friends. I like to give them a little air, you know, let them breathe. It's actually really close. The problem too all my cooking sheets are warped so they",
            "start": 652.2
        },
        {
            "text": "You put them in there, spread them out for your friends. I like to give them a little air, you know, let them breathe. It's actually really close to the problem too, all my cooking sheets are warped so they all roll back together when they get done. When the oils start going, when the juices start flowing. Portillo is not entertained; he likes the end product of the chicken wings but the cooking, he could care less about. Could not care less about it's a cute dog right there as I told people I think off camera, he ate a piece of watermelon yesterday. Probably got the upset tummy over there cuz it was a big chunk; he didn't even chew it up just took it right down the r the actual yeah, big old chunk of R that's no good for him, roughage not all right. So these are on the pan, we're down to our final here, de they get they get caught in there. You got to check to make sure you got them done all right. These look really good; let's just eat them as they are. What's the worst that can happen? Yep, there you go.",
            "start": 688.24
        },
        {
            "text": "They get caught in there, you gotta check to make sure you got them done all right. These look really good; let's just eat them as they are. What's the worst that can happen? Yep, there you go. Wasn't sure which side was which. All right, so now we're going to drop the trout here. All right, so again at 4:35, we're going to go timer for 20 minutes. You're scary; we've time traveled 20 minutes. Oh, there we go. All right, little listen to sizzling up con - that's what you want. Turn off the timer. So then at 20 minutes, what we do is we flip them. Oh, look, these guys are coming up nice now. You leave the oven open? Yeah, you like me to pull them out right? Yeah, and why do you do it that way? CU, you preheat because the oven's just going to lose all its heat. You want me to do that though? No, it's okay; it's too late now. Okay, I like seeing them all golden brown though, and sizzling in there. Look at this - these are Missou tongs. I know who got you those.",
            "start": 737.08
        },
        {
            "text": "Heat you want me to do that though no it's okay it's too late now okay I like seeing them all golden brown though and sizzling in there look at this these are Missou Tongs I know who got you those Justin Davis, aka Jizzy on Twitter, they call him that on Tech Fetish get up in there there you go I don't want to burn my hand get up in there get all up in there get up in there what do not oh look how good these guys have running up see you got to get close sometimes I should have maybe I should have I like I like a good I like that good char that you don't want to push it though I do well you're going to see what I'm going to do here in a second to push it remember we've been going at 435 I'm going to crank it up to 440 oh man that's really going to do it, Dogg getting crazy over here are you going to marinate them all in the what do you mean marinate them going to do the sauce afterward you're not going to throw the sauce correct we're going to do all this and then",
            "start": 794.92
        },
        {
            "text": "Over here, are you going to marinate them? It all in the... What do you mean marinate them? Going to do the sauce afterward. You're not going to throw the sauce correct. We're going to do all this and then the sauce gets afterwards. What what would you have me do? Take them out, put sauce on them, put them back in a little glaze a little glaze of sauce might not be a bad idea. That's when Nick Scarpino had a conversation with Nick Scarpino about how to make chicken wings right right I mean I don't know how to make chicken wings I'm a chicken wing virgin. What I'm going to go 4 45 oh man you're balling now let's see I like getting them all good I set it for 20 didn't I I didn't set a timer yet that's another thing now back in there for 20 more minutes you got it hold it see oh my God start start I **** it up too there we go all right so now uh let time travel another 20 minutes or not even we're going to time travel like 15ish and warm up the sauce. What I'm doing now Colin is I'm warming up wing sauce.\n\nI corrected phonetic mistakes, spelling errors, and capitalized proper nouns as per the metadata context.",
            "start": 835.68
        },
        {
            "text": "Up too there we go all right, so now uh let's time travel another 20 minutes or not even, we're going to time travel like 15ish and warm up the sauce. What I'm doing now, Colin is, I'm warming up wing sauce. Now, this is another thing people always see me making All These Wings on Twitter, and he assumes that I'm going to die of a heart attack, and I will one day, but like I said, baking them it's making them not as bad for me, it's not as bad as frying them. Sauce is another big part when you get sauce at a restaurant what they're doing is taking Frank's RedHot usually and putting in a bunch of butter, like an obscene amount of butter - there is such a thing as an obscene amount of butter - and they... When you make wing sauce, as someone would describe to make wing sauce, you're part of it. So, what are you doing here? What I do is just, I like my wings hot spicy, so I don't put any butter in them, I just pour",
            "start": 876.24
        },
        {
            "text": "make wing sauce as somebody would describe to make wing sauce you're part of it so what are you doing here what I do is just I like my wings hot spicy so I don't put any butter in them I just pour the sauce in now this has been like usually what I would do if I was making fresh Wings right like it's like blood yeah tastes like blood too you want to make sure you're eyeballing it you want a lot of sauce obviously um I'm just warming it up basically so you could put butter in this if you wanted to cut it we're all men here right you need your anybody need to cut no everybody shaking their head and no over there Mike does he's scared Mike's a big old baby we we talked about Mike he's the one who used those Panko breadcrumbs now I put it in there now I'm just whipping it a bit want to keep I don't want to do that skin that sauce you get on wings you know W sauce anything you don't want that you don't like sauce I don't like sauce at all that's a good point this makes it",
            "start": 920.04
        },
        {
            "text": "don't want to do that skin that scoop that sauce you get on wings you know W sauce anything you don't want that you don't like sauce I don't like sauce at all that's a good point this makes it goes fast enough but this speeds it up gets the heat distributed that's what you want but you can put butter in there I'm going to save some on the side for later I'm going to put some barbecue sauce on those so can we see what kind of what are we going to hide what kind of no I I usually I prefer Frank's Red Hot I'm using Crystal cuz that's all they sell turning this off over here let this keep going what kind of heat we got going we got like a high heat yeah I like to get it going fast put the pizza over here pizza and wings what a great day for a conversation with Colin see how those bad boys are looking how they looking oh they're looking good good stuff in there that huh see we're Faking It Like ain't nothing wrong like if I wanted to make the better wing of course is a",
            "start": 960.28
        },
        {
            "text": "Those bad boys are looking good, huh? See we're faking it like ain't nothing wrong. Like if I wanted to get the better wing, of course, is a fried wing you're always going to want a good fried wing but you got to do what you got to do to stay alive right Colin? What's your motto? My motto yeah got to do what you got to do to stay alive no taxation without representation all right so we're putting aside a few for SL I, you're scary enough. I don't think on this peeling off weird the Pam felt a little light, yeah I think I think that we're getting low in the bottle. So now what I do is I pull them off toss them in here look at those and yeah I did not pay him this enough so there you go. Go hard in the Pam don't go light on it, I want too light today I blundered a little bit when I made the chicken c as well well this is kind of what happens when you're on the spot sure yeah you're trying to do something you never I mean how",
            "start": 1010.92
        },
        {
            "text": "Too light today, I blundered a little bit when I made the chicken. This is kind of what happens when you're on the spot, sure. Yeah, you're trying to do something while you talk and walk people through. You don't usually do that. I'm really happy with the brownness though - the tanning here that we got good color on these. Do you need Reynolds wrap? Yes, do you absolutely need aluminum foil? Yeah, could you not get a pan that you use specifically for the wings and forgo the Reynolds? I mean, I guess you could, but so I feel like you might get it more crisp if you use the same pad. Interesting - I'll do the next one, I'll iterate on the recipe for you, Nick. Alright, like a cook they sell cooking pans that have little serrated edges. Yeah, you literally both shots - you're crossing sorry, sorry, it'll be all right. That's making every angle, and you're also talking off camera. Nick, can we stop? I don't think",
            "start": 1074.0
        },
        {
            "text": "P that have little serrated edges yeah you literally both shots you're crossing sorry sorry it'll be all right that's making every angle you're also talking off camera Nick can we stop I don't think we have to bust balls about how this coming out fair enough fair enough so we got all the wings in a bowl right this is important to the restaurant quality now you take all your sauce you just want to dump it all there get it on in there I like my wings SAUCE so that's a lot of sauce you don't need that much sauce but that's what I like to do and then you do this with your hand over it yep you don't want any WINGS jumping out do you sauce jumping out who cares WINGS jump unnecessary to me got WR what this seems like an unnecessary step the hand over the thing there how would you have them come out just don't feel like there's any danger of that happening uh you have not made wings as long as I have I have lost many a good Wing this way cuz I like get take your hand off look at them hopping",
            "start": 1118.44
        },
        {
            "text": "Out just don't feel like there's any danger of that happening uh you have not made wings as long as I have I have lost many a good wing this way cuz I like to take your hand off look at them hopping around they're getting close you try to get them out the knock out of the bowl well I'm trying to make a point and you're trying to mess me over oh yeah that's it right there that's the dirty cookie sheet I make cheese fries on every day we do a lot of dirty things with all our cookie sheets some plates out here for everybody I'm excited my mouth is salivating you want to get your shot and you can come have one Nick and tell me what you think you can be our taste tester I'm not going to do it I got to cool down you want to you want to break for a quick sec and we can set everything up like we did with cutlets sure all right so there you go Colin that wasn't easy you figure like what 15 minutes with prep time beforehand 20 on each side and you get your wings should we dig in here yeah you",
            "start": 1159.52
        },
        {
            "text": "with cutlets sure all right so there you go Col that wasn't easy you figure like what 15 minutes with prep time beforehand 20 on each side and you get your wings should we dig in here yeah you you got to you I'm going to say they're great so you got to view the honest guy no mhm I mean I'd be lying I've had these many times but mhm mhm but you like them they're good they're fast they're healthier than fried wings uh they get soggier then fried wings which I'm not a big fan of but what I like about them and this is weird a weird thing to say but there's like a bready thing about them that some people probably wouldn't maybe prefer on their wings but I kind of like that like there's a texture to it that's not just the skin texture you know with the flour went up okay well there he goes ladies and gentlemen thank you so much for following us yeah thank you so much all right try it at home make your own video response put it down there let me know how you make wings in the comments it'll",
            "start": 1208.08
        },
        {
            "text": "and gentlemen thank you so much for following us yeah thank you so much all right try it at home make your own video response put it down there let me know how you make wings in the comments it'll be great tweet at us we always have fun then like the video subscribe share it with your friends like Mike Mitchell so everyone can go make chicken wings until then have a conversational day just down to Bones like a cat in a cartoon eating the fish you know oh no that's it so good",
            "start": 1254.72
        }
    ]
}