{
    "id": 906,
    "video_id": "STWNZARr_aw",
    "show_name": "Kinda Funny Live",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Portillo",
        "Tonedeff"
    ],
    "title": "Tonedeff - Kinda Funny Live Theme Song (Official Lyric Music Video)",
    "description": "Get the Tonedeff song free at http://www.bit.ly/kfthemes\n\nSupport Tonedeff at http://www.QN5.com\n\n\n\n\n\n\n\nWatch the FULL Kinda Funny Live Here! https://youtu.be/2uJBDk0mFF4\n\nSign up for the forums now! www.kindafunny.com/forums\n\nGet the Kinda Funny iOS App now! https://itunes.apple.com/us/app/kinda-funny/id989981469?mt=8\n\nGet the Kinda Funny Android App now! \nhttps://play.google.com/store/apps/details?id=com.app.kindafunny",
    "published_at": 1433433603,
    "duration": 169,
    "transcript_chunks": [
        {
            "text": "[Music] [Music] [Applause] uh-oh yeah we going in the uncharted waters y'all drop it hey ladies and gentlemen in case you didn't know what the [ __ ] it is yeah y q five kind of funny shout out to the chicken wing the proud of Long Island C already the pure one here [ __ ] gys the producer Seducer next scorpo and of [Music] course what's up [Music] everybody kind of funny live in the middle of the whole set no sense to seat so what you can do when if be sitting down simple kick RI the [ __ ] with a grounding heat dog it's a roce y'all feel the sound damn right so we up in here living loud hands sucking Greg Mill House and his team P squeeze pass Saturday night if anybody you mothers I ain't the badest alive it's kind of funny like watching Police Academy twice it's kind of funny like me promise a caterpack the chapter three half life Jack knif the lit yet see the length of my teeth to the big dep C kind of funny as K get fresh without taking a the Nick neck impress with kiss it's just",
            "start": 3.35
        },
        {
            "text": "a caterpack the chapter three half life Jack knif the lit yet see the length of my teeth to the big dep C kind of funny as K get fresh without taking a the Nick neck impress with kiss it's just the lit Miss B wh chicks get the business Tim get getting his dick but he's diing his in every dis prank the had the convers with col just when he said she think it's trend for Poli kicked in un boxing his F thing no Drake destroit making up P tiet shipwrecks intent to be getting this di in in the S be best friend flying in all of us we making every I win we C out we the like decid no but the guys who decided mind you kind of [ __ ] so guys let's took a second to understand that toneev my favorite artist of all time and one of my biggest Inspirations in life just made a song about us how freaking cool is that did you notice that in addition to the beat sampling the Uncharted theme the verse was entirely made of classic Playstation sound effects cuz that's freaking awesome I'm utterly in love",
            "start": 73.56
        },
        {
            "text": "cool is that did you notice that in addition to the beat sampling the Uncharted theme the verse was entirely made of classic Playstation sound effects cuz that's freaking awesome I'm utterly in love with the song and you can D it free at bit. lee/ KF themes in addition to that tone went all out and put together the kind of funny theme pack volume one collecting all the Beats he produced that we use as theme songs to the game for gregy show calling Greg live love and sex stuff conversation with Colin fall the leader and more as well as the original rap versions of all those songs please go support him go listen to all of his amazing music and tweet at ton letting him know what you think he's done a lot for kind of funny and loves you guys just as much as we do so go show him some of that kind of funny family love peace [Music]",
            "start": 125.36
        }
    ]
}