{
    "id": 651,
    "video_id": "mTmthuEl7TM",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "Let's Play Lego Batman 3 - Freeplay Fridays",
    "description": "Greg and Tim platinum Lego Batman 3\n\nWe quit our jobs, please support us here: http://www.patreon.com/kindafunnygames\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation",
    "published_at": 1425067200,
    "duration": 1887,
    "transcript_chunks": [
        {
            "text": "what's up everybody welcome to another Freeplay Friday I'm one of your hosts Greg Miller alongside the Pure One Tim Gettys Tim host Tim uh last time you and I sat down for one of these we did a screwed up one we did the Criminal Girls it was it was it was dirty and perverted we invited though so it was okay invite only uh today I thought we would uh cleanse the pallet jump into Lego Batman 3: Beyond Gotham um now Tim you wouldn't know anything about this no how far beyond are we going I've gone about 34 hours Beyond in Lego Batman Beyond4 hours Batman 3 right Beyond Gotham um now the reason I've done all that is because you wouldn't know anything you're you're the Nintendo Fanboy on staff so you know know anything about these things called trophies and achievements they're a big deal to some of us uh Colin and I chased each other in trophies forever and ever and ever and ever everever and then finally I fell off fell off I got so busy I didn't feel like I wanted to play games",
            "start": 0.84
        },
        {
            "text": "of us uh Tim and I chased each other in Trophies forever and ever and then finally I fell off, got so busy didn't feel like playing games to platinums or whatever, but for DC Comics games still go crazy get every Trophy, Lego Batman's been putting out these DLC Packs right, when they do that it gives you more content adds trophies screws around, see here I have the Platinum 89% because it is they've added the Bizarro pack now we're about to play got to jump in get all these Bizarro Trophies won't take long thank goodness then I'm gonna have to wait for the Suicide Squad content to come out too well it's the gift that keeps on giving, you know it is, one of the things we're going to talk about as we do this Tim is what DLC is and what makes good DLC Greg thanks",
            "start": 40.28
        },
        {
            "text": "gift that keeps on giving it you know it is now one of the things we're going to talk about as we do this Tim Gettys is what DLC is and what makes good DLC it's downloadable content Greg thank you that is true I can't scream at you about that cuz that is very much like Bizarro World we're going to jump to start this going but my problem with this is that these levels they're putting out incredibly short now I bought the season pass for 20 bucks I get all the content it's great don't get me wrong it's two that's like two or three bucks I think this is fun though you get these things what's he on right now oh he's on a Lego head look Superman's all like Bizarro why does he look kind of look like a a octopus thing cuz it's a statue Bizarro broke oh so that's why yeah yeah I mean it was Statue he broke it of a banana octopus and then he broke it now it looks like a broken statue of banana octopus no it didn't look like an octopus when it was a regular statue when he broke it it kind",
            "start": 78.88
        },
        {
            "text": "Statue he broke it of a banana octopus and then he broke it now it looks like a broken statue of a banana octopus no it didn't look like an octopus when it was a regular statue when he broke it it kind of exploded and went all sorts it kind of went there makes sense so now we're going to this Bizarro Universe here we're on the Bizarro planet we know that because the S is backwards exactly now here's the rest of the Bizarro this of course this of course I don't know this dials into there's a Lego Batman bizar movie right now that was Guy Gardner guy Gardner yeah he's a Green Lantern you know right one of the Green Lanterns got punched out got punched out by Batman with one punch now you see I'm already a true hero which means I've got all the studs to fill up the stud meter quite the stud Greg thank you the reason I did that of course is just that I have all the multiplayer multipliers on so if you see right now if I get one stud it's worth 3,840 studs there are so many arrows right now now the",
            "start": 127.32
        },
        {
            "text": "you're the reason I did that of course is just that I have all the multiplayer multipliers on so if you see right now if I get one stud it's worth 3,840 studs there's so many arrows right now now the arrows are there red my R DDR are we playing DDR we're not playing DDR instead my red my my locators are on so I can find all the things I need so like these are showing me where mini kits will be like right now you look at him run yeah well he's Bizarro what do you want him to do look at him look at him fly look at him fly all stupid stupid ass bizar I like this game so right now we're doing the thing that happens this is how you trophy hunt Lego Batman right is like I'm just going to play through this one cuz if you if we pop out and we look at the trophies that we got going on here right it's mainly I have to come back for it's it requires a second playthrough for sure because I need to go back through with different characters you know what I mean like there's there's going what is it",
            "start": 165.48
        },
        {
            "text": "mainly I have to come back for it's it requires a second playthrough for sure because I need to go back through with different characters you know what I mean like there's there's going what is it here I need to basically come back for free play and play as Dark Knight and decide anyway so like right now doesn't even matter too much about getting the mini kits like I already got the True Hero status this didn't update for some reason which is not I don't like that at all I don't know why I didn't do that that's confusing these are Ultra Rare though yeah nobody's gotten them not people aren't getting them yet oh I didn't finish the level with it all right anyways so like I'm going to have to come back here and do like Poison Ivy or Swamp Thing so just run around and punch the hell out of everything now and see what's up that makes sense usually how I do things exactly so like but I want as we play through this you to think about the amount of content you're getting yeah and let me know",
            "start": 206.64
        },
        {
            "text": "now and see what's up that makes sense usually how I do things exactly so like but I want as we play through this you to think about the amount of content you're getting yeah and let me know if you would feel cuz like this one doesn't hurt me as much all right cool whatever it's you know well how much is this so you said $20 for the season pass but how much is just this Bizarro World I think it's prob I think it what I think it said three bucks $3 all right if you were to say five I'd be like that might be an issue $3 though eh what else are they going to do like $1 that seems like too little yeah so I don't know $3 we'll see I'm right now I'm okay with it as Colin would say I'll allow it yeah all options are on the table Yeah Obama style mhm uh what's up with the bird dude well he's got a mini kit in him I don't know how how to get it out of him just J yeah that's usually a problem I have how to get them how to get the mini kits out of the bird dudes yeah I like the design of the",
            "start": 240.24
        },
        {
            "text": "a mini kit in him I don't know how to get it out of him just Greg yeah that's usually a problem I have how to get them how to get the mini kits out of the bird dudes yeah I like the design of the bird dude from a Lego perspective yeah I like that they used one of the little uh the clampy things to be his beak birds have beaks it's true that's also very true I wouldn't have thought about that but that's the beauty of Legos is one man's clampy thing is another man's bird beak it's a true you're making a lot of good points see see right now is the point of trying to figure out who can do what I have a new team can you just fly forever yeah yeah all right you want me to do that for a while definitely they're coming Greg I think this is it they're finally going to come get us yeah well where did they that was kind of cool we he got yeah we're getting invaded by Apocalypse we got a bunch of the bad guy Apocalypse dudes coming out here being being Jero's Apocal apocal they do",
            "start": 284.36
        },
        {
            "text": "well where did they that was kind of cool we he got yeah we're getting invaded by Apocalypse we got a bunch of the bad guy Apocalypse dudes coming out here being being Jero's Apocal apocal they do call it they do call hey there's my fire breath my God fire breath water o Batman's getting a little scared are he scared are so you're Guy Gardner now well I'm Bizarro I'm Bizarro Green Lantern is what I right now made a teddy bear there for you he Garden's is that his garden power no it's just his G.R. Garden Ray all right you don't have to insult imagine if this was Marvel versus Capcom every time you did a move you had to say the thing it was Garden R **** Garden r that would suck it would there we go I still like how he runs it's fun so if you freeze those bricks uhhuh you get the mini bricks it should make one here probably yeah there you go see one of my mini kits here so all right you already explained this to me but I really wasn't listening sure I understand the arrows they're only there",
            "start": 328.44
        },
        {
            "text": "make one here probably yeah there you go see one of my mini kits here so all right you already explained this to me but I really wasn't listening sure I understand the arrows they're only there because you have you're a true hero so like you've already gained the power to if you go in here like in the extras I've collected all the red bricks so the red bricks all have what I need like I have all the stud times on I have and then it's gold brick detector mini kit detector Adam West's parsel detector like all the things I need to unlock the stuff that you if when you're going through on your own searching for trying to figure out how to get you like here I need poison ivy to be able to go through that thing and all different stuff this just seems a little too easy well yeah that's the point of after the fact you know I mean once once you're done that's just how it is bro now you and I weren't really paying attention cuz we couldn't hear the the uh story exactly well I",
            "start": 375.24
        },
        {
            "text": "after the fact you know I mean once once you're done that's just how it is bro now you and I weren't really paying attention cuz we couldn't hear the the uh Watchamacallit the story exactly well I mean I can tell you what happened oh thank you very much there was the banana statue yes thank you you're turned into an octopus right and um you're upset about that and then the gardener was like God damn it like what am I what am I going to do without my banana you're right right so now you're on the Bizarro Planet which is Beyond Gotham thank you like Gotham's over here yeah you're like here right now okay and um there's manyi bricks and you need to get them and there's a lot of arrows a lot of arrows thank you very much caught up yeah I'm pretty much caught up good I'm going to smash everything now be guy gner Guyer it's my boy you know how you know how he rolls mhm got them green shots what are those the blue things those are things I can smash with Sonic stuff now that's saying Batman",
            "start": 413.64
        },
        {
            "text": "now be Guy Gerber, it's my boy you know how you know how he rolls mhm got them green shots what are those the blue things those are things I can smash with Sonic stuff now that's saying Batman Sonic like you just run really fast around no no no no no like sonic waves like sonic waves oh and that's where it's coming down to I'm not sure like Batman real Batman look at that has all these I like that I like whatever you're doing right now the passing of the crotches well yeah that is that's one way to look at it I mean it is I don't think it's the correct way look at that they're just freaking crots shooting left right people everywhere here it's crazy oh no Cyborg Bizarro, Cyborg has did Bizarro cyborg just blow up Bizarro Batman well he yeah he did you can I mean they don't know what they're doing they're a bunch of bat my God they're a bunch of Bizarro mother yeah all right okay PS3 keep it down over there that was that was crazy I can't figure out nobody's got explosive powers",
            "start": 453.56
        },
        {
            "text": "doing they're a bunch of Bizarro men yeah all right okay PS3 keep it down over there that was crazy I can't figure out nobody's got explosive powers that doesn't make any sense I mean let's think about this who would have explosive power well that's the problem is that all my normal dudes aren't here there we go Cyborg sounds the most explosive out of all of them right that's true we got to figure it out by the way it's it's Bizarro Batman here has explosive powers that's a  I would have never thought that wow but you proved me wrong must get people back up to ground you're getting sucked up don't worry I got it I thought the Flash was the fast one this thing ever yeah I I again I've unlocked the red brick for mini Speed Build so you have to worry about it it builds up fine so are you enjoying yourself uh no but again I'm talking to you while I do it yeah you know what I mean like I feel like if I was sitting here",
            "start": 498.6
        },
        {
            "text": "Build so you have to worry about it, it builds up fine, so are you enjoying yourself? Uh, no, but again, I'm talking to you while I do it. Yeah, you know what I mean. Like, I feel like if I was sitting here playing, I'm pretty sure we can't hear it while we're recording. I think Gilbert Gottfried is doing the voice, cuz like Gilbert Gottfried is Mr. Mxyzptlk of course, of course. I know you're well, Mr. Mxyzptlk. Yeah, Mr. Mix, the famous Mr. Mxyzptlk. He's the guy they call him for sure. Mixie, Mixie, cuz there's a Y in there, and if you make him say his name backwards, or he, he disappears, he goes back to the dimension got it? So like right now we're just running around; he's he's narrating what's happening here as we do all this. So tell this game is narrated by Gilbert Gottfried. Yeah, not not the game. So okay remember remember earlier when we were talking about is it worth it? Yeah, I don't know. You're Gilbert Gottfried, you don't like Gilt. I love Gilbert Gottfried, but I don't know about him narrating this.",
            "start": 543.12
        },
        {
            "text": "so okay remember remember earlier when we were talking about is it worth it yeah I don't know you're Gilbert Gottfried you don't like Gilt I love Gilbert Gottfried but I don't know about him narrating this adventure it's just this one level that wouldn't be long if I could hear exactly what they want me to do Gilbert Gottfried of course the voice of Jafar from Aladdin yes that's right you like you like the Disney FL now you have to like him yeah there should be a Lego Disney game I would play that for sure isn't that pretty much Kingdom Hearts no cuz it's a it's a baby game with baby people in it so this is a baby game yeah pretty much no there baby games don't have that yellow crotch thing Greg yeah they do how else you switch characters in Kingdom Hearts like I mean I don't like so I come up with the headlines for videos normally and normally it's like you know it's hard for me sometimes cuz I don't want to like cross the line sure and I want to Pander right but sometimes you definitely",
            "start": 586.92
        },
        {
            "text": "with the headlines for videos normally and normally it's like you know it's hard for me sometimes cuz I don't want to like cross the line sure and I want to pander right but sometimes you definitely don't want to pander um when it comes to the \"Criminal Girls: Invite Only\" like I called that V's most perverted game right I might have to call this the PlayStation 4's most perverted game what cuz the yellow crotch throws heat up the gold leg on look at you well that wasn't you was that Mixie uh it was that or Bat Mite I think it's Bat Mite Bat Mite yeah let's see he's he's Mr. Mixel P for Batman so this game gets real into like the hardcore DC Universe oh that's what it's all about brother I mean I guess that is kind of cool you know Joker's as side all jokes oh crap getting floated away here so Adam West is a thing in this game yeah that's cool Adam West is amazing we all love Adam West thank God he's here to save us cuz they have the 60s Batman stuff in here too yeah these Lego games man I",
            "start": 630.52
        },
        {
            "text": "Adam West is a thing in this game yeah that's cool Adam West is amazing we all love Adam West thank God he's here to save us cuz they have the 60s Batman stuff in here too yeah these Lego games man I like that they're scraping the bottom of the barrel that's good what does that mean I mean just like what the hell does that mean they're obvious I mean they're just like what we'll give you everything and the kitchen sink yeah okay just we're really just going out like I don't know if there can be a Lego Batman 4 oh there will be there will always maybe it'll probably be Lego Justice League cuz they seem to be pushing that all right cool so we're in Lego Justice League and then eventually it's just going to be like Beyond Lego Justice League yeah and then eventually it's just like **** man Gilbert Gottfried he can't replace Adam West isn't here so it's just like they're just gonna start giving random cameos like Nick Kroll is going to be in this game course he should be why it's just like I",
            "start": 681.36
        },
        {
            "text": "Gilbert Gottfried he can't be in this game, West isn't here, so it's just like they're gonna start giving random cameos like Nick Kroll is going to be in this game, course he should be, why it's just like I don't know, he wore Batman well. You say you say random cameos, keep in mind that in this game Kevin Smith's in it, Conan O'Brien's in it, yeah there's a bunch of people who aren't necessarily like really into the universe, you know what I mean, in terms of like story content, yeah so he's got that. I enjoyed Kevin Smith's Batman run a lot, I'm really looking forward to uh whenever the third part comes out if that ever happens do you read those? I I have not read these ones your time oh they're really good what are they what's the I don't remember uh there's a series it's called The Widening Gyre I think the first one we go I don't remember the name of the second one but I I really enjoyed them you wow all right you World's Worst Detective, what so what's that yellow thing which one the big",
            "start": 722.56
        },
        {
            "text": "I think the first one we go, I don't remember the name of the second one, but I really enjoyed them. You know, all right, you world's worst detective? What's that yellow thing? Which one is the big yellow thing in front of you? Oh, it looks like their version of The Daily Planet ball in Bizarro World or whatever man, Bizarro. Oh wow, naughty! I like what do you mean Lego Batman's all about smashing stuff? Yeah, smashing, smashy, smashy, smashing it with a little... that was very 50 Shades of Grey. That was not in any way 50 Shades. You're just now you're trying to make this... I said this is going to be our palate cleanser and you're here making it all very not palate cleansing. Yeah, but sometimes I don't need to make things they just are those things and I'm just observing. No, I mean you're this is definitely some Sigmund Freud-esque what you're doing. I'm not the type of person that would make things nastier than they are. You're the pure one, but you're not acting like it. I'll say that.",
            "start": 762.96
        },
        {
            "text": "this is definitely some Sigmund Freud **** what you're doing I'm not the type of person that would make things nastier than they are you're the pure one but you're not acting like it I'll say that right now I like how they're just coming from the jungles jungle strings I think they're probably coming from their you know helicopter or wherever the hell they are up there yeah but why is the helicopter Carri have green strings cuz that it matches their outfits man when you're right you're right I mean come on if you're going to be you're going to be a bad guy you got to make it you got to make it the good kind of bad guy here I like how many uh bricks you got yeah lots of bricks you use them to buy stuff it's I mean it's way granted again like I'm way past it you know what I mean you're 34 hours into this game yeah exactly i' I've played enough Lego Batman here you know to be deserving of what I got here who's so who's in the the cage that's Adam West up there Adam West is just dancing well",
            "start": 809.24
        },
        {
            "text": "into this game, yeah exactly I've played enough Lego Batman here, you know, to be deserving of what I got here. Who's so who's in the cage that's Adam West up there. Adam West is just dancing well, yeah he, that's Adam West, you know, you remember the Bat-suit of course and so like that's just what he does here, he chills out, he'll say something funny when we come back and save him in free play 'cause we're not done after this, we got to come back and do it again. Get all bouncy houses, yeah like I like that, that's a good solution, yeah I don't know how bouncy Legos would be, that seems pretty unrealistic to the Lego canon well like that's I'm not okay with that, that that's where you're, yeah these games are like all right we'll stick to the DC Canon but we're just going to forget about the 30 plus years of Lego experience kids have had. Like imagine trying to bounce, yeah on Legos like that on Legos, that would hurt it would hurt it would hurt really bad, you couldn't do it but leg in your",
            "start": 845.16
        },
        {
            "text": "30 plus years of Lego experience kids have had like imagine trying to bounce yeah on Legos like that on Legos that would hurt it would hurt it would hurt really bad you couldn't do it but leg in your head when you're playing with the Legos anything can happen you know what I mean yeah but not that that's not that that's where you draw the line uh Guy Ger got frozen so he's coming G-Man he's making little teddy bear I'm I'm jamming on the the dirt M here to get whatever we need out of the ground teddy bear yeah why would he jam with the he's a little Jack-Jackhammer teddy bear man this game is just going off the rails you know what I I don't I mini Batmobile for Guy Gardner that Superman's getting in it that's Bizarro not Superman it's pretty clear Bizarro man all right so you got one more dude that you're looking for yeah we're going to get this thing down here finally oh jeez it's all this is a weird G-Man level man I was not expecting that there's a lot of colors so then I angle\n\nI corrected the following errors:\n\n* \"gner\" → \"Ger\" ( likely referring to Guy Ger, but more accurately Guy Gardner)\n* \"G man\" → \"G-Man\" (proper noun and reference to the Half-Life character)\n* \"Jack Jackhammer\" → \"Jack-Jackhammer\" (correct spelling of the toy brand)\n* \"Guy Garder\" → \"Guy Gardner\" (corrected name of the DC Comics character)",
            "start": 883.96
        },
        {
            "text": "dude, that you're looking for, yeah, we're going to get this thing down here finally, oh jeez, it's all this is a weird guy level man I was not expecting that, there's a lot of colors so then I angled that back and blew that up, there you go, build this thing, I think the last LEGO game I played was Star Wars: The First one, the first one that was a long time ago, are you sure about that, I think that was the first LEGO game it was yeah yeah and you were like you were like that's that's perfection they'll never get better yeah they did they did good though I liked those games a lot now I'm waiting for like something that makes more sense uh then congratulations you found it here you go look how easy it was I'm just glad that there's not Mega Bloks, that'd be really upsetting to everybody again nobody likes Mega Bloks if you like Mega Bloks I don't like I usually don't say statements like that cuz I like to be nice to people but not mega block now see on the little but we got to hear that",
            "start": 929.92
        },
        {
            "text": "likes Mega Bloks if you like Mega Bloks I don't like I usually don't say statements like that cuz I like to be nice to people but not mega block now see on on the little but we got to hear there that sounded a lot like Nolan North doing Bizarro so I'm confused now who was talking the whole time but say so that was the level that was what your two bucks got you now I got you new characters too three bucks three bucks right right right right right not two bucks cuz two bucks I'd say is definitely worth it three bucks I mean all right so you have to go back again yeah so like that's how they get you three bucks isn't bad yeah three bucks I'm okay with that you're okay cuz it gets you four like whatever a handful of new bronze trophies that's fine I just want the 100% back you know what I me like I don't want to that's how they keep me on on the trophy I don't know if I like that though so like you had 100% And then they took it away from you mhm so this is how many characters are in the",
            "start": 978.04
        },
        {
            "text": "like I don't want to, that's how they keep me on the trophy, I don't know if I like that though, so like you had 100% and then they took it away from you, mhm. So this is how many characters are in the game, all right, that's a lot, yeah, no, all right. I'm pretty well versed in comics, yeah, admittedly Marvel way more so than DC, get out of here, you piece of garbage, I'm pretty sure I could not name 90% of them, you know. Grayson? If I see him, oh okay, if I just saw the characters, yeah right, sure, sure, sure, that makes sense, that makes sense. All right, we're going to go into there was a dog, a bat dog, yeah, all right, Ace the Bat-Hound, he's right there, yeah, you, I want you to look at him, there he is, oh, we can play as him, we'll bring him in for you, good. And we have this crew of idiots that we get to bring here, tag superheroes, these people are going to go in and get the rest of the trophies for me, this is where we can finally just go, we can't skip this, hold on, let's listen, help Superman",
            "start": 1018.72
        },
        {
            "text": "We get to bring here tag superheroes these people are going to go in and get the rest of trophies for me. This is where we can finally just go, we can't skip this. Hold on, let's listen. Help Superman, Superman say as reward Bizarro gets his own planet all to himself very far away from other people. He says not helping, helping not understand but hate new planet and make city to live in called Rock Tropolis going back to Rock Tropolis here. That's what he called it. See that's the Daily Planet business then you see what he's doing here, you see how he's working it. There was a Lego game called Lego Rock Raiders. Look I like this a lot, look at him fight. It's like Port's best friend yeah and you got look over here like it's Ace the Bat-Hound running with Black Canary from Arrow, Black Canary cuz there was an Arrow DLC that I already bought wow. You can just switch through them yeah this is why free play is great my God. There we go see now now Swamp Thing gets to go in the hole he'll go out there",
            "start": 1065.12
        },
        {
            "text": "There was Arrow DLC that I already bought. Wow, you can just switch through them. Yeah, this is why Freeplay Fridays are great. My God, there we go. See now, now Swamp Thing gets to go in the hole. He'll go out there; he'll get my thing. We'll get everything we want. Oh wow, he got all up in there. Usually like to wait a little bit before I do that. You you prep it a bit. Yeah, yeah, I understand that. Come out of this now, East the Bat Hound can do what I need to do. Great man, you got this down to a science. Well, I mean, this is you know these are Char... Oh, she doesn't have a bat-er he does good. I know what I'm doing like I said 34 hours of Lego Batman. I think I should know how to do it. There we go. Get so is this the Lego game that you've invested the most time into probably with the DLC? Cuz I you know I Platinumed Lego Batman 2 as well and that was a similar there's a lot going on to that. Mhm got to get five of those birds. Did you play the Lego Marvel game that came out last year? I did, um it's it's one that I kept.",
            "start": 1113.36
        },
        {
            "text": "Let's Play Lego Batman 3 - Freeplay Fridays as well and that was a similar experience there's a lot going on in that one mhm got to get five of those birds Did you play the Lego Marvel game that came out last year? I did um it's it's one that I kept meaning to get back to cuz I played it so much at events that when it finally came out well first off it came out and then I was like well I'm going to wait for it on PlayStation 4 cuz if you remember it was doing that like I'm going to do both things thing we're like all hooray video games and then I never got back to it for more of that what's back here is it just back here I don't like this perspective yeah man all right bless it bless BL you again bless you third time fourth bless you fifth thank you all right so you're just cruising you're flying yeah I can just go wherever I want now so it doesn't matter Can I got Swamp Thing no this is going to be Poison Ivy oh Poison Ivy Dam what's she going to do she's going to go down that hole oh wow she went head first yeah she knows face",
            "start": 1157.64
        },
        {
            "text": "so it doesn't matter can I got Swamp Thing it no this is going to be Poison Ivy oh Poison Ivy Dam what's she going to do she going to go down that hole oh wow she went head first yeah she knows face first if you will she knows what's up she's Poison Ivy I you man yeah right back in right back out man that was fast Blood In Blood Out oh you like that Poison huh that little she knows what's up Adam West yeah save him with his little pink Arrow how do you scream there you go oh the Canary scream obviously yeah yeah saved Adam West good good deal there mhm back to somebody you can fly please that's Adam West singing as he went away makes sense Adam is pretty great do that Adam West Adam West is that what he SS yeah sometimes yeah about his name yeah Adam West is just you know character now he's awesome we every loves him I've had this theory that Nick Scarpino is Adam West for a while and you're just saying that just kind of confirms it cuz I've heard Nick sing about himself a lot no you",
            "start": 1208.36
        },
        {
            "text": "awesome we every loves him I've had this theory that Nick Scarpino is Adam West for a while and you're just saying that just kind of confirms it cuz I've heard Nick sing about himself a lot no you haven't yeah all the time does he ever sing nick scarpino nick scarpino no not that little diddy but there's like other ones all right yeah Black Canary she looks kind of like the Black Cat Superior like Superior Black that starts with Black and has white hair so wait are you saying Black Cat's better than Black Canary mhm you're full of **** and stupid Black Cat's like the coolest person in the world what no she isn't can you imagine hanging out with her she's a cat burglar who like wants to break up Spider-Man and Mary Jane all a cat burglar who named Black Cat that's awesome what Black Canary does Sonic scream she's you know married to Ollie depending on the universe like other canaries that makes sense canaries sing don't they no yes they you don't know anything about Canary",
            "start": 1266.88
        },
        {
            "text": "Canary does sound like Sonic scream, she's you know married to Ollie depending on the universe like other canaries that makes sense. Canaries sing don't they? No, yes they. You don't know anything about Canary, you don't I don't. Why do they call Cat Burglar cat burglar? Cat burglar does cats burgle things. I would assume it has something to do with the fact that like you know is this regular side no yeah cats are sneaky, sneaky, sneaky cat. I've never heard a cat coming. You're right, I mean at late at night sometimes outdoors I do hear cats coming actually. Oh my God, that got nasty. That's what I do. You can't you think you're the only one who gets to me nasty on this show. I don't I don't get nasty Greg, you don't. I'm the pure one seems like I distinctly remember you getting nasty but okay yeah I think that was that was Colin oh probably was Colin yeah yeah here we go all right so you're Black Saitama no that's Cyborg now Cyborg is an interesting one cuz he's actually going to become important eventually you know.",
            "start": 1316.24
        },
        {
            "text": "was Colin oh probably was Colin yeah yeah here we go all right so you're Black Adam no that's Cyborg now Cyborg is an interesting one cuz he's actually going to become important eventually you know what I'm talking about with all these all the all the movies that are happening all right great there's movies happening and then there's they are forcing Cyborg down your throat whether you want to know about Cyborg or not you are about to know a **** ton about Cyborg and I can respect that in the sense of like all right well I did not want to be magnitudes come on du uh but like he's yeah's he's in the movies he's got his own movie he's doing this he's doing that like they're about to get all Cyborg up in this business that's unfortunate I think he's in the Teen Titans show too what are you doing why are you locking out of this I tell you what side work he's a piece of work I mean just time commitment wise I feel like this is already worth $3 okay I guess my biggest complaint was the Arrow",
            "start": 1367.76
        },
        {
            "text": "why are you locking out of this? I tell you what, side work he's a piece of work. I mean just time commitment wise, I feel like this is already worth $3. Okay, I guess my biggest complaint was the Arrow DLC, that was based on the TV hit show Arrow, and it I wanted to never end and it was just really really short. I never even got off the island, I didn't get to do anything in Starling City, did it miss its mark? Come on, you know what the point is, you know I want... oh that was another one, I was trying to keep going but **** he did it, ladies and gentlemen, you thought he couldn't do it and Greg just was like I'll do it, watch me do it, I will. We're gonna knock this down and then it's going to come and we'll be fine, oh my God, we'll get the thing we want. There it is, does it turn into jump house again? Yeah, I will. Can we can the four of us go to a bounce house at some point? Yeah, I don't see why not. Do you think that we do you think that there's a bounce house out there that can fit our team",
            "start": 1409.12
        },
        {
            "text": "again yeah I will can we can the four of us go to a bounce house at some point yeah I don't see why not do you think that we do you think that there's a bounce house out there that can fit our team Greg's weight yeah and I think our people our weight yeah that is that is a concern that is a big concern actually cuz I feel like I mean we're under 1,000 lbs you think 1,000 lb is the limit I I don't know that sounds High I mean we're way under 1,000 lb I mean they're built for children all right we're going to have to figure this out get back to you on that one yeah oh back to the Lego Batman Well it's not it's just a it's a baseball bat there's no it's not a baseball bat that's a paddle why does it look like a clearly like a bat then no have you seen a paddle I have seen paddles that's the paddle I've seen them up close if you know what I'm saying my God no all right so what's the yellow stuff that's stuff you can melt so we melt this this will get us to the next area and then next",
            "start": 1453.24
        },
        {
            "text": "the paddle I've seen them up close if you know what I'm saying my God no all right so what's the yellow stuff that's stuff you can melt so we melt this this will get us to the next area and then next area has all the pieces we need good to to close this out get every Trophy and be on our way getting it back to 100% well no cuz I still got wait for this yeah I still got to wait for that Suicide Squad crap oh you're right it'll get me these done is that the end though then it'll get off I forget or are they going to make up new movies I mean they're going to there's going to constantly be movies I'm not sure how many more of them will get their own Lego DLC stuff so this again oh the the old Green Lantern umbrella you know you anything you can think of you can use as the Green Lantern so clearly umbrella was the best thing he could cognitively let's go back to this guy Gardner business sure let's do it why is his name guy Gardner cuz that's what he was named why are you named Tim Gettys",
            "start": 1502.96
        },
        {
            "text": "umbrella was the best thing he could cognitively let's go back to this guy Gardner business sure let's do it why is his name Guy Gardner cuz that's what he was named why are you named Tim Gettys that's that's the answer he's not a gardener he has nothing he has nothing to do with actual gardening man I'm sorry I I know you he's running with Swamp Thing and Poison Ivy so you think that that makes sense there's green he's their Overlord Mr. Green Thumb is what they called him is his middle name I don't I don't think so Guy Mr. Green th Mr. Green okay I did not hear that part of the story you weren't listening I apologize it does happen to me it was Gilbert Gottfried well again we're not sure who that is all right melt and stuff we got more the play switching through like no one's bus teddy bear again we need that teddy bear yeah I remember this again Cannon to Lego and DC the teddy bear that teddy bear Jackhammer freaking Jackhammer STS usually it's a teddy bear getting Jackhammer yeah that was",
            "start": 1547.76
        },
        {
            "text": "we need that teddy bear yeah I remember this again Batman to Lego and DC the teddy bear that teddy bear Jackhammer freaking Jackhammer STS usually it's a teddy bear getting Jackhammer yeah that was a Naughty Dog right yeah naughty Colin's favorite game mhm all right so this is done now there we go two kits left left dumb bird again that's my kit Bird is the word I heard oh **** off man who's who's using laser whose laser eyes on me over there oh I remember that actually oh man you're just blowing up the I'm trying to do does Cyborg have a stealth suit I can't remember do you remember does Cyborg have a Stealth Suit he does have a Ste suit all we got it oh he's a washing machine cuz that's stealthy nobody would see it coming yeah it's a very clean getaway was very good too Tim I want you to know how well you're doing today thanks one day my jokes are going to get washed up but not today keep it going I don't give me another no drying up the Well's done it's not a dryer it was a",
            "start": 1594.72
        },
        {
            "text": "you know how well you're doing today thanks one day my jokes are going to get washed up but not today keep it going I don't give me another no drying up the Well's done it's not a dryer it was a washing machine it could be both who knows yeah they have those the world pool things all same and yet I still put 2014 on a lot of things of course you do I think everybody still does there's my kit but I feel like we're past that point of the G and done um so now he's got to build this thing do this thing get out of here and we got all our trophies just build so fast it's crazy I actually I'll have to go that moon with Dark Side well I will make you sit through that too it's okay Guy Germaine got smoked cuz I'm **** it up oh my God yeah I'm **** it up it's me that's on me everybody not Guy she's having uh Bizarro Wonder Woman is having some issues happens the best of us mhm she's like oh actually hold on too that's a good point oh there Dark Side to side right that we need to be in this",
            "start": 1648.56
        },
        {
            "text": "having uh Bizarro Wonder Woman is having some issues happens the best of us mhm she's like oh actually hold on too that's a good point oh there dark side to side right that we need to be in this world right mhm Right Dark Side on the moon is the name Dark Side of the Moon. I'm Rusty, you were saying I wasn't Rusty but I am I'm still Rusty oh I like that one she looks cool that's a dude but cool no I was just being sexist oh pink must be a you must be one of these chicks I see all the time yeah there's a lot of chicks in this world Greg, you only make up exactly 50% of the population I don't think that's true that's not that's not a real stat I appreciate you trying though I appreciate you trying to bring me some science information but I don't think that was real so we're going to pop the rest of these trophies now Tim okay and then all we got to do is go walk on the moon is Dark Side, you just got the um mini kits lost yeah do you remember Andy Muschietti I do I met him once at a VidCon in",
            "start": 1693.64
        },
        {
            "text": "rest of these trophies now Tim okay and then all we got to do is go walk on the moon is Dark Side you just got the um mini kits lost yeah do you remember Andy Muschietti I do I met him once at a VidCon in Epic Meal Time's room it was it was weird we got weird lives we do we have very bizarre lives if you didn't know ladies and gentlemen ah Doctor how we doing we're fine I got to sync to the PSN which takes forever of course my order trophies there I got to find all these collectibles in the order as well pain in the butt you don't find any of this on Nintendo consoles no you don't you you just get to play games and be done with and be like oh man that was good man yeah complete with Okay good all right yeah so Dark Side on the moon it's all we got to do and then this will be done until Suicide Squad stuff comes out all right how much percent you at though uh 69 no I'm way past 69 I've been 69 forever I'm way past 69 um got to find the Moon now there when's the Batman Forever DLC coming up",
            "start": 1748.48
        },
        {
            "text": "Squad stuff comes out all right, how much percent you at though? Uh, 69 no, I'm way past 69. I've been 69 forever; I'm way past 69. Um, got to find the moon now. There when's the Batman Forever DLC coming up? Never. They like to forget that that ever existed. How funny would it be if they did that though? That'd be awesome if there was just all of a sudden Jim Carrey's Riddler popped up. I'd be very, very proud of that. I'd be very, very proud. Comes in do ice; I'm counting on it. Walk outside, be on the moon. That's not how you get outside. No, it's not. I don't... remember that. Be a bad designed warship here we go. Oh, that's not well designed either. They're just all always getting sucked out and dying. There we go, there we go. That's it, ladies and gentlemen. DLC is done; I have all my trophies again. Dark side looks like a badass; he's kind of cute. Look at him smff like a... a he's floating around; he's flying being a badass doing that dark side. That's kind of weird, ladies and gentlemen. That is the Bizarro DLC.",
            "start": 1792.96
        },
        {
            "text": "looks like a badass he's kind of cute look at him smff like a a he's floating around he's flying being a badass doing that dark side that's kind of weird ladies and gentlemen that is the Bizarro DLC for Lego Batman but more importantly again can clear my mind my put my mind at rest I have all the trophies I can have in Lego Batman 3 I can come back later get that Suicide Squad when it's out what do you think of the Lego games what's the last one you played let us know in the comments then for all these cool let's plays keep coming back every day to youtube.com/ kind of funny games not kind of funny would just drop you in like where we do the reacts and the game over greggy stuff there'll be other stuff there yeah you go to kindoffunnygames.com then everything's there it's easier everything one place",
            "start": 1844.72
        }
    ]
}