{
    "id": 591,
    "video_id": "OMgqRC4jwhw",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty",
        "Felicia Day",
        "Portillo"
    ],
    "title": "Felicia Day (Special Guest) - The GameOverGreggy Show Ep. 61",
    "description": "Special guest Felicia Day wants to know our travel routines, Nick Scarpino explains why Batman Vs. Superman should be two movies, Colin Moriarty discusses the lines of freedom of speech, and Tim Gettys brings up how much is too much when it comes to PDA. (Released 01.30.15)\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get you PC here www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1423209606,
    "duration": 6781,
    "transcript_chunks": [
        {
            "text": "what's up everybody Welcome to the GameOverGreggy Show I'm one of your hosts Greg Miller alongside the producer Nick Scarpino first down over there the referee in the middle Colin Moriarty is this awkward no we'll explain why it's only awkward because I gave the first down like an idiot so loud it is really loud well imagine how loud it was though when we were filming this in the park for our video that we're doing uh Nick made me do it like 15 times at full blast and it was like hurting my own ears there was these guys like sitting around eating lunch near us and they all just left yeah did anyone in the park think I wanted to mistake you for a legitimate referee and was like come over here I I I don't have a flag so I don't think oh shoot uh sir who runs the camera go get the go get the flag Portillo he loves you I'm so jealous he was in my lap for a long time thank God there's already a lot back over here the P let",
            "start": 2.82
        },
        {
            "text": "the go get the flag I made you a flag Portillo he loves you I'm so jealous he was in my just for the record he was in my lap for a long time thank God there's already a lot back over here the P let him host and then over here star stasan screen Felicia Day oh my God wa I didn't expect it to be see I made the flag for you thank you this is perfect oh P he really wants it think anything that comes to this table is his if it's a cardware box it's a Bark Box if it's anything that looks like a toy it's a toy he was drinking my latte earlier so he has very good taste in coffee exactly yeah but you know anything that the light touches is his he thinks Prett sure thank you so much for coming by this is awesome for having me this is very exciting this is a nice studio and everything you're giving us a lot of credit thank you very thank you it's it's a nice spare bedroom I called it a studio okay I know we're doing our best it's only week to listen I know all about like my whole career is shot",
            "start": 77.0
        },
        {
            "text": "us a lot of credit, thank you very much, thank you. It's a nice spare bedroom; I call it a studio. Okay, I know we're doing our best; it's only week to listen. I know all about like my whole career is shot out of my garage, so yeah, we're all the up-and-coming YouTube generations. We do yeah, garage shooters. Yeah, uh, if people don't know you, which would be crazy, what's the easy way to describe yourself? Never assume you make an ass out of you and me; damn, damn boom! Hey, can we is there a flag on that play? Did did you co—is there a flag on that play? Yes, I invented that. So great, I copyrighted it. Um, what did you say? Who the hell are you? Oh yeah, run us to the highlights for the for the 1% that doesn't know you, f yeah, Know believe me. Uh, it's uh, I'm an actor; I started as an actor and uh lots of things called you know Buffy and all that stuff, and then I I started writing a comedy show called The Guild about seven years ago. And can you believe it's that long ago? That's I try to we old yes we are. I just",
            "start": 119.12
        },
        {
            "text": "you know Buffy and all that stuff and then I I started writing a comedy show called The Guild about seven years ago and can you believe it's that long ago that's I try to we old yes we are I just turned 35 and I'm like God I might as well I mean I don't even know what day it is it's it's almost my birthday right now I have no children you want to talk about IRAs I'm right here IRAs what how do you call those wait what IRAs isn't that a retirement thing we should be looking at IRAs I thought you said Iris I thought you're I was like like Iris West what do we I was like Iris yeah know I don't have an IRA I have like two 401ks though if that helps I don't know yeah anyway uh and then have real jobs anymore exactly healthcare and three years ago I started a company called Geek & Sundry it's a web series company with YouTube and then last year or like six months ago I sold the company to Legendary Pictures Entertainment and now I work with them and I am producing and developing other bigger projects so",
            "start": 162.88
        },
        {
            "text": "company with uh YouTube and then last year or like six months ago I sold company to Legendary Pictures and now I work with them and I am producing and developing other bigger projects so so are you in house with them are you like yes we are in house which is cool they also have Nerdist and a couple other smaller web series companies and we're all like under one hat and uh they're building out like the whole thing how it's going to happen and it's just really cool to work with people who make stuff that I really admire and uh be able to you know keep doing the YouTube stuff and then hopefully be able to do more bigger stuff like TV and stuff yeah so I'm happy for now all why why did you leave me I've had him for 10 years Felicia he has to come back sometimes and pay the piper Show daddy my lap smells so much better it's true your lap smells like well we won't go there dookie oh no see yesterday okay so here's the thing Nick and Colin you've been talking about what's Colin's",
            "start": 204.16
        },
        {
            "text": "daddy my lap smells so much better it's true your lap smells like well we won't go there dookie oh no see yesterday okay so here's the thing Nick and Colin you've been talking about what's Colin's wearing you dog's dying you've been talking about what's col oh we actually want to call this out we want to talk about whistle into the microphone if this if you are an MP3 listener on the band camp or whatever just the podcast on iTunes you have no idea what the hell is happening so Callary right now is wearing for those of you who are just listening to this a referee costume I would say almost 90% Canon referee costume definitely can we nailed it he looks like an NFL referee that hat looks like it cost 99 Cents it cost it $299.99 from Easy Money that hat was the hardest get easy money hardest thing to get that hat uh because it's very hard to find a non-descript white hat with no logo on it try that and we found it at a corner store that was two blocks away so really hard not not hard at",
            "start": 248.76
        },
        {
            "text": "thing to get that hat uh because it's very hard to find a non-descript white hat with no logo on it try that and we found it at a corner store that was two blocks away so really hard not not hard at all not hard all to do was walk out of the house I had to I had to the nice lady over there I think her name is Rada she was a nice Rada oh my God is her sister Hilton Sheridan actually to the Rada Fortune but uh she I'm like she had a black hat and I'm like oh I think the referees wear a white hat and who who are the ones that wear black hats like all the other officials officials not the not the not the on alternate universe referees theyt their stripes too uh so I'm like do you have any of these white hats and she goes let me make a call takes out a a like 1987 card holder that like creaked as she opened it and you know like the a Rolodex called was it a Rolodex that it was I don't know it's no no this was legitimately like a like bus cards book of business cards that had little plastic",
            "start": 291.32
        },
        {
            "text": "as she opened it and you know like the a Rolodex card was it a Rolodex that it was I don't know it's no no this was legitimately like a like business cards book of business cards that had little plastic sleeves in them that were so old they were yellow yeah and she takes out a card and like dials up on her rotary phone and this is the Hat guy he'll bring a white one for you tomorrow and sure as **** first time meanwhile still waiting on the delivery of the referee costume from Amazon right still waiting on that and we have four hot dog costumes that are I think so you know where to go every single time you have a need you go to Easy Money yeah well they they she then gave him a business card that said if we don't have it you don't need it yeah that's what it says on the top of their there I go there I spend I've spent thousands of dollars at Easy Money over the last five years it's like no doubt about it it's just just on booze have you ever read there's a book called uh Mr",
            "start": 332.96
        },
        {
            "text": "there I go there I spend I've spent thousands of dollars at Easy Money over the last five years it's like no doubt about it it's just just on booze have you ever read there's a book called uh Mr. Penumbra's 24-Hour Bookstore or something like that it's set in San Francisco and it's a guy who I think used to work for Google but he wrote this book a couple years ago and it's one of the best books ever and it's about like this weird hidden bookstore in the middle of San Francisco that has all these TOS that um have secrets in them basically the secret of life interesting and it's really it's one of my favorite books of the last several years and it reminded me of that because you go in and it's like the secret world you go in this is not quite that romantic not that awesome no this is more like a secret world if most of it were just beef jooky um in Russian candies and Russian candy and actually very uh cheap alcohol they actually have really good on I mean you're kind of **** talking",
            "start": 372.28
        },
        {
            "text": "a secret world if most of it were just beef Stroganoff um in Russian candies and Russian candy and actually very uh cheap alcohol they actually have really good on I mean you're kind of joking but at the same time save me many a dollar on bourbon you're a really big fan I walk in here and you know not to disclose like the rest of your abode but um you have a quite a lot of bourbon yeah a lot of bourbon my brother is really really into bourbon and whiskey and whenever we stream on Twitch he basically has to shut him up because he's talking about what he um I can't even remember the things that he talks about but they're a lot about whiskey how did you get into it uh I was diagnosed falsely with celiac disease like four years ago so like so I and then I went on for like two years before getting a getting it double checked and realizing they were wrong at that point I'd already given up beer because I thought I had to and so I went to bourbon cuz with the exception of Maker's and a few",
            "start": 407.72
        },
        {
            "text": "a getting it double checked and realizing they were wrong at that point I'd already given up beer because I thought I had to and so I went to Bourbon cuz with the exception of makers and a few others it's it's not weeded um and then I just fell in love with it that way yeah so it was actually kind of serendipitous that I was false diagnosed with celiac even though it ruined the rest of my life for like years no you got skinny maybe uh no no well I was skinny at the time and then I and then I blew back up you know look like I'm a little pregnant it's all right um you got your you got who pregnant I look like I'm pregnant every oh God I was about say no no didn't get anyone pregnant hope not not that I know uh be safe on that one there's anything wrong with that there's nothing wrong with you there's wrong not there's anything wrong with getting someone pregnant kind of the circle of life I guess you dude what a I mean it's like the Pillsbury Doughboy you could be giving birth to",
            "start": 450.04
        },
        {
            "text": "with you there's wrong not there's anything wrong with getting someone pregnant kind of the circle of life I guess you dude what a I mean it's like the Pillsbury Doughboy you could be giving birth to that yeah because you aren't having the the wheat no no I'm not uh but now you know so I went back and I got it all tested then I the first thing I did when they're like oh we were wrong well first I was like I was really mad at the doctor and got really mad at him I was on the phone and then I went and eat a cheeseburger so yeah yeah you did you did which which really just kind of hurt you at the end yeah well it is what it is the doctor didn't give a **** what you were putting your mouth after you left the only ironic thing about it was that at that 2-year point I was actually starting to become accustomed to not eating gluten like I was actually still eating gluten like all the time as Greg could a test but I'd feel really guilty about it and then I'd go like a week or two",
            "start": 485.72
        },
        {
            "text": "to become accustomed to not eating gluten, like I was actually still eating it all the time as Greg could attest, but I'd feel really guilty about it and then I'd go a week or two without it, I was going to say he'd go on these giant gluten purges where it's only eating gluten-free pizza and only doing that, and then all of a sudden he'd be like \"let's get a freaking Chicago-style pie\" - if you really had Celiac, you'd really pay for that, that's what I'm saying. Like I've had, I mean everyone that listens to the show knows at this point but I have serious colon and stomach issues, so they just assume that that's what it was at some point and they were wrong. We can talk about health issues I have, so many of them, and I went to anyway it's boring, it's like we should wait 30 years and go to the cafeteria and talk like \"oh I have a thyroid disorder\", you know what you do for the thyroid disorder and the acid reflux, yeah when I get my hip replacement",
            "start": 520.52
        },
        {
            "text": "like we should wait 30 years and go to the cafeteria and talk like oh I have a thyroid disorder you know what you do for the thyroid disorder and the acid reflux yeah when I get my hip replacement that's what I know I'm I'm going all the way down can I can I film that when you get the hi yeah absolutely you can fil whatever you want I wanted to fil Our Lives depend on it so to turn us a little bit back on the reason he's dressed as a referee is dress referee because we are taking part in the uh AdBlitz contest on YouTube so if you go to youtube.com/AdBlitz our spot is live right now as of the posting of this commercial yeah Veronica Belmont stars in it Pont is in it um and flag there's no penalty okay there's no penalty thought I said something wrong um so yeah please go go go to youtube.com AdBlitz and find our spot and vote for it and uh if you hated it let let Greg know please do it was my idea was it your idea yeah so that's I think I start I started with the Colel I started",
            "start": 551.84
        },
        {
            "text": "adBlitz and find our spot and vote for it and uh if you hated it let let Greg know please do it was my idea was it your idea yeah so that's I think I start I started with the Colel I started write a paragraph there's not going to be one thing on YouTube that's negative about your spot okay not one probably not one you are like you are like YouTube like like the president of YouTube so I'm sure you can make that happen no no no I'm like the Jester that you kick on the way in and out of YouTube know about that you're like I was going to say the Kim Kardashian of YouTube but I don't know that's a I don't know if that's a compliment at all no no I'm not really a YouTube uh star I mean I'm not like Gracie help you know there's you're you're like everywhere I'm a little bit everywhere which is good and bad you came in super starred him already and then you did the Geek and Sunny which became this big thing on YouTube yeah that's way yeah it was kind of reverse yeah I'll never yeah that's",
            "start": 594.92
        },
        {
            "text": "good and bad you came in super starred him already and then you did the geek and sunny which became this big thing on YouTube yeah that's way yeah it was kind of reverse yeah I'll never yeah that's fine that's fine no don't worry about it we did the same thing we're like Hey we're really cool video game people on IGN they're like **** IGN we're big on YouTube now yeah but that's good you guys have like a f we say **** no really did you no we we left on very good terms we love IGN shout out to Jesus Christ what it was a joke they know how many videos have we put up talk about Bri do we have to burn this week C how many how many how many bridges are you going to fire bomb for us as many as I need to number one on be these guys are youtube.com/ ad Blitz and it's just going to be me and you left you're going to be left with just me that's fine that would be a cool Superman and Movie Taco Bell talk show we do that would be dope actually all right if you didn't know ladies and gentlemen",
            "start": 636.6
        },
        {
            "text": "left you're going to be left with just me that's fine that would be a cool Superman and Movie Taco Bell talk show we do that would be dope actually all right if you didn't know ladies and gentlemen This is the GameOverGreggy Show each and every week four sometimes five best friends gather on this table each bring a random topic of discussion for your amusement if you like that you can get the shows early by going over to patreon.com kindof funny and subscribing so you can get them each and every Friday if you don't want to give us any money that's totally cool we break it out topic by topic day by day over on youtube.com/ gameovergreggy before the whole thing posts for free on YouTube and iTunes which has been running smoothly congratulations so SM had so many we had so many problems so many bumps and stuff they all filled out now so you should go review the bumps five stars the bumps are filled all right what was the there were bumps with iTunes yeah just uh you know like",
            "start": 673.6
        },
        {
            "text": "so many bumps and stuff they all filled out now so you should go review the bumps five stars the bumps are filled all right what was the there were bumps with iTunes yeah just uh you know like cuz we launched a new podcast recently and so we had to get it approved and we had to get them folded together and all that it's a whole RI roll it's a RI roll but we're good now so give us them five stars four stars if you're mean rate it what was that what did you what what was that lean in you just said the four stars if you mean yeah that's how the pure one does when you Le forward like that it was like a whole it was like the birds the whole pigeons all the pigeons on your shirt just like went T my face and I almost screamed inside yeah the one by your top button looks like it was flexing oh he is he's flexing he's ready Tim we've never talked about your close call with this pigeon shirt of course he introduced this to YouTube he was the first man to go to Target and find the shirt and wear",
            "start": 709.16
        },
        {
            "text": "is he's flexing he's ready Tim we've never talked about your close call with this Pigeon Shirt of course he introduced this to YouTube he was the first man to go to Target and find the shirt and wear it on show is anybody made a freaking comment I mean I was kind of like throwing it out but see that I don't know about this Pigeon Shirt but like these are these are good together there's no beef here there is beef it was the same shirt though cuz there's a couple people i' sing yeah Jimmy Wong oh Jimmy Wong they all know the shirt they have the shirt did they copy you or is it just I'm going to assume they copied me like that is the only true we know that Jimmy Wong is a fan he's a he's a friend of the show he probably did really copy you yeah and then Miranda Sings copied him yeah cuz she's a fan too I'm going to well no no I'm saying she coped we some someone said something about assumptions I don't remember what it was though youum stuff everything's awesome why don't you have",
            "start": 746.4
        },
        {
            "text": "a fan too I'm going to well no no I'm saying she coped we some someone said something about assumptions I don't remember what it was though you're stuff everything's awesome why don't you have **** all over your shirt uh I have **** everywhere else okay he actually I usually like them around here sorry MP3 listener come watch the YouTube video hey you're missing find out where lik **** my shirt has parrots all over it just to be clear for the people who are orally affiliated with this WOW orally affiliated yeah you're going to have to tone down that smart talk a little bit or orally orally that's ear wise it's fun word to say no no I forget what's the story you are super smart that was another thing yeah you're insanely I mean we're all smart yeah you're like number one smart something I remember the first I have a math degree the first video I ever saw of you was you and your girlfriend Christine who you met earlier my girlfriend not just some girlfriend she introduced me to you a while back",
            "start": 790.4
        },
        {
            "text": "I remember the first video I ever saw of you was Christine, your girlfriend at the time, who introduced us a while back. It was the video where you took a competitive SAT or something. No, no, okay, first of all, that didn't show off my brain skills because I did beat it, okay? Yeah, that's okay, I did a uh uh Kev Jumba, do you know him? Oh yeah, so he uh is a friend of mine and and he did an episode of my show, which was called a flog, where I would just go and do a wacky thing every week. But it was too much work by myself, so I couldn't do it anymore. We did ballroom dancing on your show, and then I'll go on your show and I have this idea for this SAT thing that fits your show better, so I was like sure let's go take an SAT and you know that was an idea yeah everyone's favorite thing",
            "start": 834.96
        },
        {
            "text": "and then I'll go on your show and I have this idea for this SAT thing that fits your show better so I was like sure let's take an SAT and I you know that was an idea yeah everyone's favorite thing to do is yeah I'll tell you one thing right now I would rather be doing than this show is taking the SATs yeah do you remember taking them yeah they were six hours long oh twice yeah yeah did you fail the first one no we don't fail the SATs you just get a low score no I think I took it twice I think the first time I me I'm not I'm not sure this man's we all well we all took the SAT when it was still 1600 points it's now 2400 now there's an entire essay component literally it's a completely different test so I did not do well going in interesting I would have done better if that writing component was still there I took the first time I took it I think I got a low score and I was like this is deplorable I'm better than this no I like I'm going to study",
            "start": 871.6
        },
        {
            "text": "it if that writing component was still there I took the first time I took it I think I got a 10 something and I was like this is this is deplorable I'm better than this no I like I'm going to study my ass off I'm actually going to take prep courses I'm going to do all the things I did none of that I went straight back into the test and I got 1250 no further prep work and I was like I'm I'm not doing this **** that's pretty good 1250 is it was good enough to get me into a decent UC so I was like well this is I was going for film anyway so yeah exactly eventually like it was a waste of time well I decided it was a really good um it was a good activity to go and take a SAT cold after not having been in school for over a decade and that wasn't a good idea so I'm in there and I'm literally in there with a bunch of U like 17-year-olds mhm familiar yeah yeah we were in a SAT prep thing and they were literally giving us a trial sat and I'm sitting there at 7:30 in Pasadena I'm like what am",
            "start": 921.04
        },
        {
            "text": "there with a bunch of U like 17-year-olds mhm familiar yeah yeah we were in a SAT prep thing and they were literally giving us a trial sat and I'm sitting there at 7:30 in Pasadena I'm like what am I doing with my life um and then when I look at the test it's completely different from the old SAT like they're all still multiple choice and all it's still multiple choice but all the the categories are pretty much different so I had to literally learn I had to learn how how the test went while I was taking the test so um having having a math degree that did not do me any good 10 years after ever using math again yeah that's the problem so it turned out that I nailed the essay in the English part I almost got perfect scores in those but I really I really bombed the math which was really embarrassing and my mom called me up and was like I'm so disappointed you have a math degree I'm like I haven't done math no I haven't done anything now what basic algebra you do not do after you graduate",
            "start": 955.92
        },
        {
            "text": "and my mom called me up and was like I'm so disappointed you have a math degree I'm like I haven't done math no, I haven't done iPhones now, what basic algebra you do not do after you graduate okay, I'm s get out yeah so Kevin beat me a lot in that because he's 21 and he recently remembers exactly but I still did beat him to be honest with you what was the final score I got like a 12 something I mean it was not good or the the sa I got almost a perfect score okay and then I got oh you know near perfect on the English and I did horrible on the uh on the math and he did really well on the math and failed everything else so I still eak out over him but I pity any child or teen or young adult who has to go through that we said it multiple times don't go to school anymore quit school don't go to college have we said this yeah you fall back on the YouTube in the Patreon, go straight up to YouTube don't do that um you know actually what you can rely really on is just tweeting just tweet",
            "start": 998.52
        },
        {
            "text": "go to college have we said this yeah you fall back on the YouTube in the patreons go straight up to YouTube don't do that um you know actually what you can rely really on is just tweeting just tweet constantly it'll all work out you think M pictures you think Michelangelo learned how to turn sand into marble in school no I did it out in the streets physical impossibility you read biography or just making it up making it okay good that's what I do around here streets of art school is true story the night before my ACT I stayed up till 3: in the morning playing Ocarina of Time for the first time so there you go go that's that's one you can't put down no yeah it fantastic did you do well on your on your act I don't know I did well enough I went to missou so it all worked out doesn't matter exactly best journalism school um Felicia we've been talking a long time but usually the guest goes first so you get to go first what is what is what's the topic You' brought to this game I mean I",
            "start": 1045.12
        },
        {
            "text": "exactly best journalism school um Felicia we've been talking a long time but usually the guest goes first so you get to go first what is what is what's the topic You' brought to this show I mean I didn't really you guys have some really smart topics and I didn't really come prepared but I do want to I I I thought i' maybe talk about all of our the way that we travel cuz I love traveling and I'm here traveling I'm doing a convention um and I also what convention is happening right now uh it's a Supernatural convention so Supernatural the show has its own conventions which is kind of unique there's some a few other shows that have their own conventions I got roped into a Todd Stashwick panel today with Jensen Ackles and it was going on I'm like why is everybody talking about Supernatural today why is that because I follow Todd Stashwick and then I'm a big Smallville fan so when you start",
            "start": 1086.56
        },
        {
            "text": "with Eckles and it was going on I'm like why is everybody talking about Supernatural today why is that because I follow Todd Stashwick and then I'm a big Smallville fan so when you start I got to remind everybody he's Jason Teague I don't know what this small this Supernatural business is he's L's boyfriend Jason Teague and I'll be damned if he's remembered as anything else well no he's yeah I would say that Supernatural did like a season that's it has an amazing fan base like a huge huge huge huge fan base and I guess you know that's it works so I'm here doing that and um and just going to San Francisco I haven't been here in a while but it's like the minute I hit a city and I don't know I thought it was interesting like how do you find the best of a city like how do you guys travel best because I I do bake okay so this is I look it up I I find the best coffee then I find the best bakery then I find the best cocktails then I look and see one Arty thing that's that's how when do",
            "start": 1125.12
        },
        {
            "text": "best because I I do bake okay so this is I look it up I I find the best coffee then I find the best bakery then I find the best cocktails then I look and see one Arty thing that's that's how when do burritos come into this no burritos no burritos well if you're traveling you do not want to fart on the plane you do not want to have all that gas in you great point right especially if you're yeah but burritos overr internet Superstar we all are now exactly um yeah you don't want people knowing that you don't want people taking pictures of you farting stuff yeah yes you don't how are they going to know I ferally I'm like the you see the drape kick up over here like oh we got it's like a ghost back there what you okay I'm great I'm the complete opposite of you when I travel when I go to places I like to look for the nearest Starbucks that's my comfort area once I know that's there I will get a little bit more adventurous and I will venture out to other places but I just need to know that",
            "start": 1162.12
        },
        {
            "text": "I like to look for the nearest Starbucks, that's my comfort area. Once I know that's there, I will get a little bit more adventurous and I will venture out to other places, but I just need to know that there is something that is consistent in my life at all times, and that's a Starbucks. This is true, though, there's been so many times I've been with him, and then the first thing we do is try to find a Starbucks, like we'll be in Seattle for four days or something, and I'm like, \"I gotta find a Starbucks.\" What I don't know why what do you not like coffee? Like are you okay? Do you... can you... do you consider yourself an epicurean? No, okay. I do definitely so you're like, \"For you, don't know what that means?\" Have no idea what that means. Oh my God, but you know I consider myself like... like you feel like I consider every meal this should be my last meal if I'm going to have the calories then I want them to be excellent calories okay or I won't eat that, it has to be epic. It's probably an eating disorder is that where the",
            "start": 1209.4
        },
        {
            "text": "meal this should be my last meal if I'm going to have the calories then I want them to be excellent calories okay or I won't eat that have to be epic it's probably an eating disorder is that where the Epic comes from epic epic Ian I don't know I'm going to assume yes Kev can we look that can we get a ruling on that Kev don't worry about it no he's saying no ring can we you're in the wrong house especially with these two to pitch this around cuz every drive home when we're coming to do the show is always they always want to go to Taco Bell or they want to stop at the Burger King and not only hold on not even the Burger King Felicia the Burger King that is attached to the gas station which is attached to a Starbucks you were too old for this your is just a cesspool of tumors right now your prostate is throbbing and full of bile I've never thought of my prostate as something that can throb but I guess it does um yeah yeah I don't sleep well at night most",
            "start": 1245.44
        },
        {
            "text": "Greg says his prostate is throbbing and full of bile, I've never thought of my prostate as something that can throb but I guess it does. Um yeah yeah I don't sleep well at night most the time. So much salt really you Sal, I'm Italian though. Oh yeah oh no he's Italian he knows salt he loves salt we put salt on everything worse than anyone at this table I think. Oh okay I thought you were my ally in dietary restrictions. Oh no no no no no no no definitely not you're want Ally it's it's Greg yeah Greg Greg's the one who's Greg's the quitter I'm not I'm still fat you look W you see there's a jiggle though let's not lie there's a there's an a as much as but it's not it's not uh fat that's jiggling Greg it's just the excess skin from when he used to be fat now that is wof you are making me mad this all the time this is he's been trying to take the presidency of Team fat for me and I won't allow it like it's not true you just need a BMI index you get one of those like big tweezers.",
            "start": 1285.6
        },
        {
            "text": "me mad this all the time this is he's been trying to take the presidency of Team Fat for me and I won't allow it like it's not true you just need a BMI index you get one of those like big tweezers and you go burp tweez burp you're doing a pretty good job already I you can just burp him I guess and then we'll know I had a BMI test the first time I signed up for 24 Hour Fitness and that's exactly what it sounded like right it a lot of people are why are you making that noise Greg I enjoy good food though like you that's that's the point I when they go to the Burger King I sto no but for real like if you were in Thailand tomorrow and you're like I'm on an exotic vacation you would literally go cuz I was in Thailand in Bangkok and I'm like what **** would go to the Burger King here so oh I would that's the **** I probably would here's the deal though my wife on on the other hand when she travels is like you she like she buys the book I forget what the books are called but they're like",
            "start": 1330.72
        },
        {
            "text": "that's the thing I probably would here's the deal though my wife on the other hand when she travels is like you she likes she buys the books I forget what they're called but they're like the travel books she will look at up she will talk to all of her friends she will not plan out every aspect of it but she will have options for every time to do things right and so we actually did go to Thailand for my honeymoon which was amazing and I knew nothing it was a completely new experience for me I didn't see a Starbucks it was that was I was okay with it after day three um and I did end up going to a Mega Mall though and that was amazingly insane the mega malls they are insane you guys don't even know them all people are like the shopping's crazy in Thailand I'm like I'm from LA I love shopping you do not understand what how it's like Blade Runner compressed into like an endless FPS of shopping specifically for iPhone covers like that's literally what like there's a floor for",
            "start": 1373.6
        },
        {
            "text": "shopping you don't understand what it's like Blade Runner compressed into like uh an endless FPS of of shopping specifically for iPhone covers like that's literally what like there's a floor for iPhone like just iPhone covers and the next floor is Maserati and you're like what is happening in this mall and literally you're like I don't know how far up it goes I might never Escape yeah but I'm fine with I was fine with that we actually spent I think we spent a whole day in one of those malls and we saw a movie which was cool yeah that's actually one of the other things I I started liking to do was when I was in a foreign country seeing a movie there are the experiences different there because I've actually never done that very different very different in Thailand they actually they make you stand and you they sing the the national anthem like they're well in Thailand there's pictures of the king everywhere which is like that's cool except then you start thinking that's kind of",
            "start": 1412.68
        },
        {
            "text": "make you stand and you they sing the national anthem like they're well in Thailand there's pictures of the king everywhere which is like that's cool except then you start thinking that's kind of creepy yeah it's a little creepy so so they did that I I ended up uh the only movies that were that kind of fit with our time frame was uh I think it was either a Twilight movie or Red Dawn and my wife's like I'm not seeing Twilight so we went and saw the remake of Red Dawn in Thailand and it was laughable how the audiences there they were literally laughing they were like this is the stupidest **** thing I've ever seen in my life and I'm like I've never I've never I'm not I've never been embarrassed to be an American before because I God damn it we're American right but I'm like I can't I'm almost embarrassed that our country exported this and let other people who don't know that it's don't get the tone of it like watch it that Keanu Reeves movie did you laugh in that what was the the",
            "start": 1448.8
        },
        {
            "text": "I'm almost embarrassed that our country exported this and let other people who don't know that it's don't get the tone of it like watch it that Keanu Reeves movie did you laugh in that what was the latest John Wick, John Wick did you laugh in that cuz I laughed out loud at a certain point like these guys all went and saw it and said it was I liked it too but everyone was like oh it's amazing you're going to love it and I by about the 300th time you shoot someone in the temple I was like this is this is ridiculous I can't get into I'm like I was getting tired yeah I was TI I was like so many people now have to apply for disability or something or they're dead I mean they're dead yeah the old Temple's not working Colin you were one who always got **** for when you'd go to Germany or Japan you'd find a Burger King or McDonald's or yeah I mean this was the thing was that I don't have time for",
            "start": 1485.44
        },
        {
            "text": "not working Colin you were one who always got **** for when you'd go to Germany or Japan you'd find a Burger King or McDonald's or yeah I mean this was the thing was that I don't have time for shenanigans when I'm overseas see see I'm there to to work right so we go to you go to England or you go to Germany Japan whatever you're working you go well I was I used to be senior editor at IGN so I have to like work the convention Stu like that now we can just travel like men of leisure and that's fantastic but in a carriage with an escort yeah yeah exactly I've never I've never been overseas not for work like ever I've been overseas many times now but like never not for work and people in Cologne especially would make fun of me because I'd go to Cologne we go to Frankfurt and then you come to Cologne and and you know the dome's right there and you know you're staying in your hotel and you're going back and forth between the convention center and in the train station if you guys can",
            "start": 1526.68
        },
        {
            "text": "to Cologne and, and you know, the dome's right there, and you know you're staying in your hotel and you're going back and forth between the convention center and the train station. If you guys can picture it, if you've been there, there's a train station with all these EXA... and there's a Pizza Hut there, yes, there is. And I would just go to the Pizza Hut over and over and over again when I'm in Germany. I don't have Celiac. You have pizza poison, that's probably what threw off my test. To the point where like towards the end of like one of my trips there, the guy was they were like basically laughing at me when I like... people that work there like go there. I'm like just give me the goddamn pizza so I can get the hell out of here. I don't have time to search your restaurant. Have one sausage the whole time. No, no. I did like when you get there, you have you have your meal but literally there is a time crunch when you're in these things and I and I but in Japan I'm a little more crazy I'm",
            "start": 1563.04
        },
        {
            "text": "the whole time no no I did like when you get there you have you have your meal but literally there is a time crunch when you're in these things and I and I but in Japan I'm a little more crazy I'm a little crazier with it because I I like Japanese food as long as there as long as we don't have to play the Is There Seafood uh game well that's that's I was say which is a a fun game but not fun when you have to eat this I love that game we us well my my first year we went to Tokyo Game Show I've never been to Japan what would you love it someone hired me to go to Japan for something nonsexual for the love of God please well that I was yeah that just cut me off at the knees there um I was going I was going to I was going to tell them if there can't be sexual favors but um no when you go to Tokyo we we couldn't read any of the descriptions of any of these and they have these amazing bakeries like you go to the train stations in Europe and in Tokyo and actually play everywhere else other than",
            "start": 1597.0
        },
        {
            "text": "we couldn't read any of the descriptions of any of these and they have these amazing bakeries like you go to the train stations in Europe and in Tokyo and actually play everywhere else other than the United States well I guess San Francisco kind of they have these big train stations where they have amazing like bakeries and and you know in Tokyo they've got like uh soba shops and Sushi shops and all that stuff um but we didn't know any of the stuff and so we would go to get morning pastries and would always play the game which was \"There is Fishing\" it and one person would always lose and they would lose hilariously like it's not just a little dollop of salmon it would be like cod inside something looks like like a sweet C inside the banana nut muffin it was and it was disgusting but eventually yeah I mean that's the crazy part about Tokyo is that even if you go to McDonald's it's actually worth it to go to a McDonald's in Tokyo just to see the difference that's why I like McDonald's",
            "start": 1634.8
        },
        {
            "text": "yeah I mean that's the crazy part about Tokyo is that even if you go to McDonald's it's actually worth it to go to a McDonald's in Tokyo just to see the difference that's why I like McDonald's is because everywhere has something slightly different like in Hawaii they have like pineapples and stuff and I'm like I want to know what's up I want to know what's different they have the lobster roll at McDonald's do they really yeah that's F okay Texas has a bunch of Chicago did BR for a while what was the was that that's where they had it was McDonald's and Tokyo where where Altano ate that that like black Bun was Burger King's black bun yeah I was there I was the only one I refused to eat it cuz everyone's like oh just try I'm like no you guys are going to have lots of regrets when you have this for like I guarantee you and I was I was sitting there like there's footage of it too and they never use it just like with a **** eating Whopper and watching them",
            "start": 1675.04
        },
        {
            "text": "like I guarantee you and I was I was sitting there like there's footage of it too and they never use it just like with a ** eating GRE gretzky on my face just eating a Whopper and watching them like choke down this squid in *** black cheeseburger I was like you guys **** up oh that bun that bun I saw pictures of that bun that is disgusting no light can escape its surface a few guys I think like Matts and a few other guys were like I can't eat this like I was like well I'm enjoying my Whopper we could have went to like Moe's Burger too or something if you really wanted to but you wanted to come here and here we are we were in Akihabara too m know and there's good you know there I think two hours later we all went and got Sushi or something like that but that's I think there's a yeah I mean as far as travel you got to make that distinction are you going for work are you going for leisure well that's the thing for three three or four years straight all I did was travel like with the Guild",
            "start": 1707.64
        },
        {
            "text": "Far as travel you got to make that distinction are you going for work are you going for leisure well that's the thing for three three or four years straight all I did was travel like with The Guild basically The Guild was built on going to conventions that me people in in person selling DVDs that supported us for so long and then when Geek and Sundry started I had to go and you know educate everybody about my new company introduce the new stuff so I would travel not you know two or three times a month I would be on the road and I never went anywhere cool and people would invite me to places like hey come tour you know uh The Magic: The Gathering headquarters or hey come to Lucasfilm and tour the archives and people would offer me the coolest things that I never would take them up on it and then I just turned around and I'm like what am I doing I have all these great opportunities but I'm never taking time for myself so my new resolution this year was to no matter what I no matter where I go",
            "start": 1742.56
        },
        {
            "text": "I just turned around and I'm like, \"What am I doing? I have all these great opportunities, but I'm never taking time for myself.\" So my new resolution this year was to no matter where I go, go do something see anybody I know in the city and do one thing that's really fun. That's why I'm here - cuz I just want to take extra time off, you know? One day a week, just one extra day. Yeah, we were invited to go to RTX, which is the Rooster Teeth Expo in Austin. It's my hometown, it's amazing. I've been there twice, fortunate enough to be there twice. At RTX, we actually went - I took my wife, we stayed the extra day and it was so worth it. Yeah, just even for wandering around and like, there's like Frank's Hot Dogs",
            "start": 1780.48
        },
        {
            "text": "and at RTX we actually went I took my wife we stayed the extra day and it was so worth it yeah I mean just even for wandering around and like there's like what's the hot dog place like Frank hot dog something oh my God just finding that place and you're like well this is amazing and there's a Starbucks on every other block so it's fun there is they're all over there are excellent coffee alternatives to Starbucks as well in Austin so it's got it so now so for San Francisco on your list of things where did you go for best cocktail uh for cocktail I did not get uh I did not get a cocktail this time I can't remember the last time I I was here last last time and I did get some crazy I I only drink rum because it's the only thing that doesn't give me hangover really interesting that's a great Runar we were just there a few weeks ago what was it let's go next time up here the one right the place that looks like Disneyland the Pirates of the Caribbean Bar pirate place P going to drive me",
            "start": 1820.44
        },
        {
            "text": "Runar we were just there a few weeks ago what was it let's go next time up here the one right the place that looks like Disneyland the Pirates of the Caribbean Bar pirate place P going to drive me crazy I want to go so bad Smuggler Co Smuggler Coes right yeah yeah smugg yeah that's a rum bar looks like a it looks like the hull the inside of an old Smuggler can I go yeah oh my God we have to go next time we've we've been really blessed to be have be good friends with a guy named Eric Castro who owns he helped open Rick house in the city which is like considered the best cocktail bar in San Francisco and uh uh he worked at Bourbon and branch which is another great place and he owns a place in San Diego and a place in New York City and he just knows he is the mayor of the of the world like of just drinking he's just a man like literally he's so funny and he's so cool and he's so gregarious and and humble and stuff like that but he knows everybody the story I was telling these guys",
            "start": 1858.96
        },
        {
            "text": "like of just drinking he's just a man, literally he's so funny and he's so cool and he's so gregarious and humble and stuff like that but he knows everybody the story I was telling these guys the other day was I was at a place in the Mission which people should go check out, that's where I went this year, this time had two hours and I went to the Mission, the Mission's awesome it's really eclectic and there's a place called ABV which is like a really good bar high-end cocktails good food and I just tweeted out I'm like at ABV uh enjoying myself took a picture of the food with my girlfriend 10 minutes later the owner who I had met before at Eric Castro's wedding comes up and he's like he's like shots from Eric Castro and I was like what he's like you saw your tweet he's like like he just knows everybody he really does it's it's it's very impressive and intimidating a little bit a great guy well I want to go there next time so this year",
            "start": 1894.72
        },
        {
            "text": "you saw your tweet he's like, like he just knows everybody he really does it's it's it's very impressive and intimidating a little bit a great well I want to go there next time so this year this this time I only have one I mean I'm here and I have to leave tonight or they would have been my cocktail hour but I have to fly out tonight for something for tomorrow but today I went to the Mission and I had I found this amazing coffee Ritual Coffee I went to Adam Savage and I visited his uh cool colle you know saw him and he has a cool collection of amazing things okay um that he's made and collected over the years so I made time for that and then I did this so that's a good day no you did well exactly good day the day is getting worse now that you hear about it so it started out really strong and now it's okay every call Every Mountain has another side y right you go you hit a peak and eventually you got to go back at ComiCon this year go to Eric Carle's bar Pite Provisions we're",
            "start": 1926.52
        },
        {
            "text": "strong and now it's okay every call Every Mountain has another side y right you go you hit a peak and eventually you got to go back at ComiCon this year go to Eric Castro's bar, Pite Provisions we're going to do a meet greet there going to do M you should come for that pite is polite is I think the best bar I've ever like just ever it's at 30th in Adams in San Diego it's not in Gaslamp no it's all right oh that's nice and that's how you know that's how you know it's awesome because that place is always packed out and you have to like you have to like deliberately try to go there you know it's not like a place you would just pass by and whatever I'm always down there five days it's awful I mean it's great and then awful and great and then awful and great and awful I take like a disco nap between uh 6:30 and just go nap yeah I go to bed at 6:30 p.m. and wake up at 8:00 so I can go dancing until oh I like that it actually works been living my life that way entire time I just didn't know",
            "start": 1966.28
        },
        {
            "text": "I go to bed at 6:30 p.m. and wake up at 8:00, so I can go dancing. It actually works; I've been living my life that way the entire time. I just didn't know I'd had a lot of years to get like my Con schedule down, especially ComiCon. What is your Comic-Con schedule like when you get are you just busy stacked? It's ridiculous. Well, we have an event site open all the time and now this year with Legendary, I mean hopefully it'll just be the same or bigger. Um, but we always have our event set open for panels and uh board games and I uh my idea when I started G was to have like a community gathering thing so you know at ComiCon like the best party you can't get in unless you're on a list and I thought that was kind of a **** party exactly, you have to be on the stupid list it's the worst. And it's just like hey I got to pose like a Hollywood lady uh but I wanted an open party so everybody could come do you",
            "start": 2000.96
        },
        {
            "text": "was kind of party exactly you have to be on the stupid list it's the word and it's just like hey I got to pose like a Hollywood lady uh but I wanted an open party so everybody could come do you like a lady I was posing like man but I guess yeah like Superman so we have sorry um so we have our part is open to the public so um and we always get the best DJ who does like Sailor Moon remixes and he plays like something for the 8s me over I'll be there amazing you have to come I yes you you have to come there's no list but uh anyway so that's what I do I'm at my event site and then I go do press stuff and then I go to other people's things and do interviews and do like two or three panels and it's kind of insane awesome so then the only way I can have a fun time is to take a disco nap and sleep but instead of eating basically that's the I don't know if I can do that the TR you're such a Hollywood actress that's exactly what I want to be I want that it's a good look it's funny",
            "start": 2041.48
        },
        {
            "text": "nap and sleep but instead of eating basically that's the I don't know if I can do that the TR you're such a Hollywood actress that's exactly what I want to be I want that it's a good look it's funny cuz like this is going to be a whole new world for us what are you going do what are you going do going everything as usual like still doing panels everywhere that was the thing is like we've been juggling the two jobs for so long that it was a mix of all right I'm covering this for IGN like ComiCon I do the live show and I host live show and then I would go do panels and host panels so now I'll probably get freelance to do a live show for someone else I imagine and then do panels will you do something for you guys oh yeah we'll bring all our stuff down and try to do the show with a bunch of different people oh that's cool and probably yeah I mean like we have a panel for instance a PAX is fun and like I I think it's just going to be a different world for us especially Greg's kind of",
            "start": 2084.48
        },
        {
            "text": "of different people oh that's cool and probably yeah I mean like we have a panel for instance a PAX is fun and like I I think it's just going to be a different world for us especially Greg's kind of already gotten into the world where he didn't have to really stress out the entire time he like something like E3 yeah well I I actually really I told Greg at had E3 this past year because I was on the live show with him for IGN for a really long time I'm like this **** is hard you know like yeah for a long time Colin's like you don't even know anymore what it's like man I write I write I mean you you still don't know what it was like like like like writing an E3 is way harder than what you were doing but I I wrote an E3 for five years I know that I know that but what I was what I was saying was that you you weren't in that world anymore in terms of the the hierarchy of difficulty and wanting to kill yourself at E3 starts at writing and and then underneath was what you were doing",
            "start": 2122.76
        },
        {
            "text": "was that you weren't in that world anymore in terms of the hierarchy of difficulty and wanting to kill yourself at E3 starts at writing and underneath was what you were doing but certainly it wasn't what we were doing I think it starts in off-screen footage you guys will never know what it's like to haul around a camera shooting off-screen footage that I don't really feel bad about because I like my days at E3 and that's why I used to explain to people when they'd be like \"I've been a ton of E3s\" and they were like, \"Oh, you don't like E3.\" I'm like, \"E3 is the worst week in my life. I hate it.\" You know? And I'm like, \"Why?\" I'm like, \"I'm literally working 18 hours a day for four days.\" Like, lit. Yeah, that's my Comic-Con except and then I go to Dragon Con 'cause I try to go every year there and that's the one I'm like, \"Oh, this is my party right? This is just a byproduct of me you know the thing I have to do for them to find out that's for us yeah it's so fun\"",
            "start": 2154.84
        },
        {
            "text": "year there and that's the one I'm like oh this is my this is my party right like this is just a byproduct of me you know the thing I have to do for them to find out that's for us yeah it's so fun do you so you guys are going to go all the cons yeah we're still hanging in there yeah and it's going to be a totally different world because we're going to be able to not we don't that's that's what I'm so excited about to experience it with the four of us in the sense that we don't have to do anything like we can actually like like we have like our panels and things that we want to do and people we want to meet but there's not like a rigorous like I got to this game and then I got to go write about do this video Blah Blah Blah like oh it's going to be it's a whole another world so I'm I'm interested to see E3 this year like what that's like you guys can customize like whatever it's your interpretation versus like what you feel you have to do that's kind of the fun part of being a Creator",
            "start": 2190.08
        },
        {
            "text": "to see E3 this year, what that's like. You guys can customize it, whatever your interpretation is versus what you feel you have to do - that's kind of the fun part of being a creator without a lot of rules over your head. Then you're more unique and people know, \"I'm going to go to them for this thing.\" Versus, like, I can get that report on the new Nintendo anywhere. Yeah, we're not news anymore, which is great. But now we interpret everything - whatever that's cool. But yeah, like, well, I'll give Greg a lot of credit because he and I have been doing on-camera stuff for a long time together. We did Podcast Beyond: Unsung Heroes for a long time. Yeah, Greg, you're really the unsung hero appr call. I'm just the unsung hero - yeah, that's out there, just out there cracking the stones. I'm G to wear you need that as a t-shirt, \"Unsung Hero\" - just like yeah, that's what I mean when I think of Greg, that's the first thing I always",
            "start": 2222.96
        },
        {
            "text": "out there just out there cracking the stones I'm G to wear you need that as a t-shirt unsung hero just like yeah that's that's I mean that I mean when I think of Greg that's the first thing I always think about is how unsung he is yeah uh but but uh no I give him a lot of I give him a lot of credit because I mean we've been doing video we did podcast beyond for years together and we've been doing video together for a long time but I've never had to be the host or the guy that's always on I'm usually the color guy and then when we really when we did that either what oh nothing you're flavor you're the flavor gu flavor let's use flavor let go flavor that's a not a thing a color commentator it's totally you guys are making this weird I don't know anything about sports you guys are making this totally weird you're making it weird wait you're trying to make it about race is that what you driving I I don't know sportsing I gave him a look and I was like what is that weird you bird shirts",
            "start": 2260.76
        },
        {
            "text": "totally weird you're making it weird wait you're trying to make it about race is that what you driving I I don't know sportsing I gave him a look and I was like what is that weird you bird shirts the color the color guy the color commentator in sports is the is the guy like so like on Monday Night Football Mike Tirico is the is the Greg know about it and Jon Gruden is the Colin the guy that like kind of oh you'd love Jon Gruden Jon Gruden's cool really yeah he's fun he he is this real definitive way of talking he nobody loves football as much as Jon Gruden you you don't care about football but youd love I like passion you love the passion passion stole the words for so yeah like I I appreciate you know I appreciate like being Greg color guy for a while and then now we kind of you know in E3 we kind of did it together whatever you were still hosting with D I was like man this **** really is exhausting so I give I give you a lot of props and now we're doing colon and Greg live where",
            "start": 2302.08
        },
        {
            "text": "E3 we kind of did it together whatever you were still hosting with D I was like man this **** really is exhausting so I give I give you a lot of props and now we're doing Colin and Greg live where I it's basically reverse podcasting, but where I actually host it, and it's just about everything. It's like, man, this is tough, you know? So I I give you a lot of credit. It's not it's not as hard as writing for 12 hours a day, but it's uh so you got one prop, it's hard, you get you didn't get all the props fine, I can deal with one thing yeah, I mean Greg's unsung hero don't you know that Greg's an unsung hero? I got one note, I've never heard I've never heard anything so ridiculous in my life. It's not it's not the whole refrain, it's just a whole throw a flag on that yeah, I like every time you throw then four minutes later Kev gets to crawl over there and no he's fine. I want I'm not going to we need to teach Portillo how to fetch that and bring it back to us, it's probably too heavy for one of my",
            "start": 2345.32
        },
        {
            "text": "then four minutes later kev's got to crawl over there and no he's fine i want i'm not going to we need to teach Portillo how to fetch that and bring it back to us it's probably too heavy one of my topics now that these guys they really didn't know what color being a color guy was or color commentator is like we got to do color commentation for one of the uh for color commentating for one of our Topics in a future episode who's your favorite color commentator wow that's going to be a deep cut for the people who don't know what color commentator is you yeah feel cut ah Nick yo what's your topic uh interesting topic today oh good my unlike my normal topics that come from the community remember please keep giving me those topics they're all great did you just like bash the community I think i did by i think i did by accident that's not what i me buddy i did good thing i was staring at this dog or been insulted for their sake were you just going to punch me in the face just right",
            "start": 2381.48
        },
        {
            "text": "I think I did by accident, that's not what I meant my buddy. I did good thing I was staring at this dog or been insulted for their sake. Were you just going to punch me in the face? Just right in the nose, yeah I'm good at that okay verbally okay. For those of you listening we're staring intently into each other's eyes. I'm going to go back to the dog, creeping me out. I'm going back to the dog, back to the dog day. Go back to the dog, uh no. Remember if you have a topic for the show all the interesting topics and I apologize for my earlier comment, uh please send them to Nick Scarpino. Be you out last night for your birthday? Let me just let me just explain what happened to me last night, thank you. I got really drunk last night, 35. You're you're in a different age category when you do polls in magazines. I don't know if that's good or not. I think that's bad like 35 something the 34-35 to 50, 35 to death like I'm like an ARP guy. I got to start getting that no no it's pre-ARP it's like uh",
            "start": 2418.6
        },
        {
            "text": "in magazines I don't know if that's good or not I think that's bad like 35 something the 34-35 to 50, 35 to death like I'm like an ARP guy I got to start getting that no no it's pre-ARP it's like uh midlife crisis M does this mean you have to start paying attention to the guy who runs the commercial on Virgin America flights where he's like are you saving for retirement he's got the giant Domino thing or if you're started now you know what I'm talking about you fly a lot of yeah let's go for the record I I literally did read something cuz my dad was like you need to start some kind of saving I was like whatever and I looked online and it says you should you have to start saving when you're like 21 in order to actually make your retirement like I'm screwed yeah I mean you're not no well or you have to be wildly successful like you have to do it's all downhill from here like I'm realistic yeah you're just going to keep working till the day you die that's it they won't want me anymore",
            "start": 2458.56
        },
        {
            "text": "or you have to be wildly successful like you have to do it's all downhill from here like I'm realistic yeah you're just going to keep working till the day you die that's it they won't want me anymore I always assume that I'll just be like a like a crossing guard when I'm like 80 or 90 you know that's not school crossing guard's like just earn a little extra cash when there's no kids you just sit on the lawn chair wait really yeah I want no phone nothing I want to be the girl the woman who owns like a little Shack and Biz and she like just lets her hair grow down to here and wears you know a moo-moo and her bre you know breasts down to here and it doesn't matter and she owns like a cafe and she's friendly with everybody and one day she just has a cancer she's like well time to go and walks into the sea damn damn that's intricate yeah that's my there been thought put you are way more adventurous than any of us are cuz my second option was Starbucks just working at the Starbucks like you",
            "start": 2503.24
        },
        {
            "text": "into the sea damn damn that's intricate yeah that's my there been thought put you are way more adventurous than any of us are cuz my second option was Starbucks just working at the Starbucks like you know getting all the free uh turkey bacon sandwiches that I can eat is it real turkey bacon I don't think so we can only it's La stop spoiling my home for me I'm sorry your your your Envision of your future is valid go what is your topic my topic is there was a rumor last week or two weeks ago at this point I guess three weeks ago I think actually three weeks ago that uh Superman vs. Batman: Dawn of Justice was going to be split into two movies right now that has since been debunked but how do we feel about that I was excited about it I flipped out we it broke while we were on Colin and Greg live Our Daily Show on twitch.tv kind of funny games and uh yeah I flipped out I thought that was a brilliant idea because at first I was really mad at first I was really mad because I was like",
            "start": 2540.12
        },
        {
            "text": "live Our Daily Show on twitch.tv Kinda Funny Games and uh yeah I flipped out I thought that was a brilliant idea because at first I was really mad at first I was really mad because I was like was this the plan all along and if it wasn't the plan then this is going to be a garbage pile and on top of that am I going to have to wait a long time to get part two but the original rumor Felicia Day was that part one would be out this October and and then they' keep the March part for part two at which point I was like I'm in whatever that's not if I'm getting four hours of Batman Superman I'm in yeah that was the that was the one reason why I was excited for it was that they were actually going to give us stuff earlier and just more stuff so we weren't really losing anything right whereas before if it was just splitting into two movies I'm not down with that that' be like sure yeah if you're breaking off the only thing I want split into two movies is Fast & Furious 7 Jesus shut up",
            "start": 2586.64
        },
        {
            "text": "if it was just splitting into two movies I'm not down with that that be like sure yeah if you're breaking off the only thing I want split into two movies is Fast and Furious 7 Jesus shut up about this I I want Furious 7 part one and then Furious 7 part two I'm going to throw this out there stop derailing your own topic not even where we're going to go with that but what about Furious 7 Furious 8 part one and Furious 8 part two like could we just keep getting two-part Fast and Furious movies for the rest of our lives up till like 20 and then we can reset a whole new cast culture need that oh you're again you're at the wrong guy to argue that way here's the deal there are great series like The Godfather um Star Wars and then there's Fast and Furious and Fast and Furious really if you look at it as a whole is more of an accomplishment than Lord of the Rings more of an accomplishment than those Harry Potter movies it is just it is",
            "start": 2620.44
        },
        {
            "text": "Fast and Furious really if you look at it as a whole is more of an accomplishment than Lord of the Rings more of an accomplishment than those Harry Potter movies it is just it is it is like the Apex of what human can I ask you a question Felicia yeah do you like cars what's the Fast and Furious about cars no no no no no no what what's it about Nick it's about family Tim exactly it's about family and it's about love okay they should split the Superman Batman movie because there there's too much stuff happening in there we're into a Spider-Man 3 conundrum where there are too many characters they've already talked about Cyborg Wonder Woman Batman Superman Luthor you did you like Superman that was kind of Man of Steel it was a terrible movie I said it was and I you understand I'm a big Superman fan I got that guy there I got the Superman stuff around the house you might have seen I have a little Shrine out there that scene a little Shrine where he's like you know go",
            "start": 2661.64
        },
        {
            "text": "I'm a big Superman fan, I got that guy there, I got the Superman stuff around the house you might have seen, I have a little shrine out there that scene a little shrine where he's like, \"You know go get the dog dad,\" except I'm going to be infuriated we're getting serious, you got to, you got can I have it, yeah I got to, I got to get into the microphone for this, I got to start talking, um anyway so I was infuriated you because it was dumb right like this is your chance Clark to be a man too many IHOPs right, yeah so anyway I not enough never enough in my opinion okay well we've already been another fine dining establishment, IHOP, confused, I don't know about this Wonder Woman thing what don't you know about it just in general you're just not just in general I just don't I I'm I'm suspect the whole here's the problem with Batman versus Superman is that I know to be wary and I know that I was let down by Man of Steel but I can't stop getting excited cuz this is like Felicia, this is all I've",
            "start": 2707.16
        },
        {
            "text": "Here's the problem with Batman vs. Superman is that I know to be wary and I know that I was let down by Man of Steel but I can't stop getting excited cuz this is like Felicia, this is all I've dreamed about since I was a child - a Superman movie that has Batman in it live-action version. And when they showed the teaser trailer at ComiCon, when I watched it on a bootleg version on my phone, and then they had her as Wonder Woman, and Superman is like, \"What? This is actually happening! This is finally happening!\" But then they started talking too much, and Cyborg is going to pop up in it, that's what I'm saying. It's becoming The Expendables of the DC Universe exactly, and like you're not going to have enough time to flesh any of these characters out. So the idea to break the movie into two parts, I was okay, I was like, \"All right, that's better.\" We all saw what happens when you put too many people in a movie; they all start doing things I don't know what's",
            "start": 2745.16
        },
        {
            "text": "the movie into two parts i was okay i was like alright thats better we all saw see we know what happens when you put too many people in a movie they all start doing things i dont know whats happening X-Men that last X-Men movie good X-Men you know what im going to give you that because i mean The Hobbit should never have been that long right i mean ever and so thats why and then Hunger Games Twilight it should all be three thats there three books you you fit it in fit it in guys thats that one exception i think in my brain where no no definitely not Twilight really part two was good part part part two was better than of Twilight yeah the last Twilight was the best thing ive ever seen with the the fight the the fight exactly yes i remember watching this did you see did you see this yes the final Twilight Saga told me all about the movie and the book long long before that and we got to this point i was like holy **** i dont remember you telling me this is hot",
            "start": 2778.76
        },
        {
            "text": "see did you see this yes the final Twilight Saga told me all about the movie and the book long long before that and we got to this point I was like holy **** I don't remember you telling me this is hot this is awesome I'll never forget cuz I didn't read the books I didn't see like I think I just walked into the fourth movie cuz someone made me and I was with my friends and everyone in that theater at the end when they like went off book okay okay I mean oh my God people were crying and stuff and I was like this is this is amazing my favorite part about this podcast so far is that Felicia Day on and she makes these incredibly intelligent and articulate like arguments against something and then we just **** shoot right past that and just evangelize it so much better than being serious I guess it's fun um I was going to say that the last Hunger Games that came out we were when we were down in La we had we had to kill some time actually wasn't bad I didn't mind that it was",
            "start": 2813.08
        },
        {
            "text": "serious I guess it's fun um I was going to say that the last Hunger Games that came out we were when we were down in LA we had we had to kill some time actually wasn't bad I didn't mind that it was a two-parter cuz there was a little bit more of a story to tell there and it was more action but are you part of the crew that slept through this movie I am thank you I did we went there right we drove we drove down uh podcasted on the way there in this van got to Davey Johnson's House Lee Everett in The Walking Dead podcasted with him slept over Woke up had a meeting with YouTube then we were supposed to go to Kevin Smith's house podcast with him his name dropped much sorry they're all on the floor everyone can watch that right now on youtube.com/ kind of funny and then we were going to drive back day book.com we'll be talking about later yeah we have to talk book still we drove all the we were going to drive back but Kevin kept pushing it back so we had to like all of a sudden we weren't leaving at",
            "start": 2847.52
        },
        {
            "text": "we'll be talking about later yeah we have to talk book still we drove all the way we were going to drive back but Kevin kept pushing it back so we had to like all of a sudden we weren't leaving at like 5: anymore we're were going to have to leave at like 2: in the morning or whatever so we Colin and I tried to sleep in the van it was too hot then we're like all right let's just go to a movie went to a movie and I only paid to see The Hunger Games to sleep in the theater cuz Christine got so mad when she found out I watched it without I'm like honey I just slept you don't understand you weren't there basically renting a couch exactly I was like this is the best option like robbed by you were sleeping it be just like well that happened was good enough that's what I was actually thinking I was so tired on Thursday because my plane got me delayed and I was like my hotel room was not ready and I was like can I just sleep in the car can I do that or would it be nice for just have a nap Lounge",
            "start": 2886.32
        },
        {
            "text": "on Thursday because my plane got me delayed and I was like, \"my hotel room wasn't ready\" and I was like, \"can I just sleep in the car? Can I do that?\" or would it be nice to just have a nap lounge? I bet they have in Japan a place where you can rent a nap right; they do have little pods that you can rent on an hourly basis. I want that here; people would freak out here, though. What about heroin? You'd either open it up and in San Francisco it would just be like heroin, just... looking at it or an opium den, which I still think opium needs to make a comeback. What's up? So, so it's a romantic have I sold you on why they should split [them] absolutely okay good see listening Jason Snider. I think the problem is like every time they split these movies like uh The Hobbit gave it all a bad name; it shouldn't have been three movies no The Hobbit you can't do three huge books in three movies and then be like one tiny book in three movies",
            "start": 2917.88
        },
        {
            "text": "these movies like uh The Hobbit gave it all a bad name it should not have been three movies no The Hobbit you can't do three huge books in three movies and then be like one tiny book in three movies like that's unreasonable yeah it's it's that's like an assistant really moving slowly like I need a week and a half to alphabetize I'm like you did one letter in an hour you need to you know hurry up let's hurry it up you're clearly milking this out uh they did it with Harry Potter they did with the seven Harry Potter films and I actually liked that cuz I'm a huge Harry wasn't that the first that was probably the first one but that made sense because that book was 750 pages long or something like that and everyone at that point was like give me as much Harry Potter as you possibly can the ride this is the last time we're going to see this they're not going to make another one for a really long time if ever um no they are thank God good job JK um wait is she writing another book she has",
            "start": 2959.2
        },
        {
            "text": "this is the last time we're going to see this they're not going to make another one for a really long time if ever um no they are thank God good job JK um wait is she writing another book she has written another book is it was a prequel and they're making another movie it's a prequel uh it is the book that she's written is about they're doing it in three parts right and it's only a tiny book right are they I'm pretty sure oh my God I didn't know that now you got what you wanted control that is out of control um no the book is about uh one of the characters one of the books in the in the movie it's about that character though it's it's meta um um Taggart yeah I think if they so anyway if they were saying that if they came out and said hey we're dying as a you know Warner Brothers is not doing well we're going to split these two movies out that's clearly why they would have done that but I I don't know they were going to call the first one Enter the Night right how dope is that and then the",
            "start": 2997.0
        },
        {
            "text": "we're going to split these two movies out that's clearly why they would have done that but I I don't know they were going to call the first one Enter the Night right how dope is that and then the second one Dawn of Justice holy crap I don't need to know anything else I would buy tickets to those movies do you think okay is it going to be like five years where basically movies are just eight hour TV shows do you know what I'm saying like that's I'm okay with that my problem with that though is the how long it takes in between the Justice League and that's why this was cool to me is that 6 months apart you'd be getting two movies I'd be fine with that if things were always like that but like it sucks when you get something like for example uh Days of Future Past you watch it and it's like okay we're not going to get the next X-Men movie for freaking like two three years yeah but if you think about like what if Daredevil on Netflix they poured you know eight times as much money into it but they did",
            "start": 3033.92
        },
        {
            "text": "going to get the next X-Men movie for freaking like two three years yeah but if you think about like what if daredevil on Netflix they poured you know eight times as much money into it but they did eight hours of content which would be like eight one hour movies would be the equivalent of a movie every four year you know what I'm saying like the expense is being able to write it all and then produce it all at once but once you have a script then you break it down like they do that for Game of Thrones they write all the scripts down basically Game of Thrones is an 8 Hour movie or 10 hour movie however many episodes I think it's eight or 10 yeah so that's a 10-hour movie they shoot and then they break it down and then they they shoot they block shoot wherever they have to go like Iceland and Morocco and all that stuff so why when I think it's only a couple years difference for everything just changing to that model you what I'm saying yeah I'd love that TV's kicking the crap out of",
            "start": 3071.92
        },
        {
            "text": "and Morocco, and all that stuff, so why when I think it's only a couple years difference for everything just changing to that model you know what I'm saying yeah I'd love that TV's kicking the crap out of movies right now that's the whole thing and that's why like I was getting this argument that the best live-action interpretation of Superman in my lifetime is Smallville, now granted tons of bad Smallville episodes, God so many of them entire seasons that were just trash but the good ones were so great and set up such an awesome storyline and lineage and like you know I feel like I know that version of Clark whereas this one right you watch Man of Steel it's like why didn't you go over there and save him so it's like it takes so much effort to make like so many cooks in a two-hour movie like that script gets just like worked over like a bad bad dough and then if you have to do 22 hours it's too fast to actually get any depth that's why like the 8 and 10 hour episodes are like the golden",
            "start": 3106.6
        },
        {
            "text": "that script gets just like worked over like a bad bad dough and then if you have to do 22 hours it's too fast to actually get anality that's why like the 8 and 10 hour episodes are like the golden spot cuz you can actually do them well are you sleeping no I smelled something you smelled sleeping what what just happened someone called the hospital she's having a stroke listen I smell toast yeah I smell I actually smell something too but it's not it's not sleep I don't know what sleep smells like I a question maybe I had that like flash of panic like you're boring that's it no no no it's cuz you said at some point you said blah blah blah too fast and Tim mugged the camera for Too Fast Too Furious yes oh that was it I felt that I felt AEG there was a disturbance in the force before it too what happened forget it forget it forget it somebody will tell us you're dropping gems but I didn't want to interrupt you I'm looking at the camera pet your dog's ass that's fine too many cooks yeah too",
            "start": 3142.28
        },
        {
            "text": "happened forget it forget it forget it somebody will tell us you're dropping gems but I didn't want to interrupt you I'm looking at the camera pet your dog's ass that's fine too many cooks yeah too many cooks exactly you said too many cooks and I went and I was going to sing but I'm like I'm interrupting or always interrupting yeah no never interrupt that's rude so what did you come down with you it should be split I'm trying to figure out sleep smells like I don't know I'm so confused I'm never going to forget about this I've been put off that over I'm going to write that line down cuz that's going to show up again into something wait are you sleeping I smell something uh here's the thing here's the thing about splitting the movie up into two first of all we we did that on Colin and Greg live it was somewhat obvious to me and I think even to you that that was fake it was but the here's the thing there's just the bottom's gonna fall out of the superhero thing at some point it's gonna happen and like",
            "start": 3192.64
        },
        {
            "text": "Obvious to me, and I think even to you, that was fake. It was uh, but here's the thing: there's just the bottom's gonna fall out of the superhero thing at some point; it's gonna happen, and like whether or not it happens in a few years or in five years or in 10 years, I think splitting something like Batman vs. Superman into two or three is risky because it's going to cost them more money on the backend. Here's an example: uh, The Hobbit is a really good example of a movie that actually made less money the more the longer it went on, and I'm sure that if they can go back and look at it in terms of profit margin, they probably might have preferred to do one or two movies on that and really blow it out. Movie sales are down uh, the last decade 25%, so uh, and movies are more expensive than ever to make, so there's just a lot of like weird financial reasons, clear financial reasons that they want to split the movies up, and really few reasons it seems that would have.",
            "start": 3230.96
        },
        {
            "text": "more expensive than ever to make so there's just a lot of like weird financial reasons clear financial reasons that they want to split the movies up and really few reasons it seems that would have anything to do with the subject matter and being true to the subject matter The Hobbit was a great example right the hobbit's shorter than two towers but two towers got a three-hour movie and The Hobbit got a 9 hour movie you know that was obviously a financial decision if if those movies were made today they'd be like **** 25h hour five part movies each you know what I mean um the funny thing is is what the super like I'm really interested to see how Batman vs. Superman does Super the last Superman no one super there hasn't been a good Superman movie in a long time like um and I'm not sure we've talked about this many times I'm not sure about the cultural relevance of Superman Batman's really super relevant so I think that that's going to bring a lot of people in that's why first yeah and",
            "start": 3269.92
        },
        {
            "text": "talked about this many times I'm not sure about the cultural relevance of Superman Batman's really super relevant so I think that that's going to bring a lot of people in that's why first yeah and I I I wonder I I I keep we keep talking about this over and over again but I really wonder what is going to be the movie that bombs that's that this whole thing is going to fall apart like a house of cards like I'm really what I worry is it's going to be Wonder Woman and then everyone's going to say you can't do a woman superhero no because guys write this a shitty movie basically I mean I I have a lot of hope I I want that to be good I want DC to to to you know pull themselves up by the bootstraps and start making awesome movies that's why I'm excited for this I think it's going to do well I think they're smart to put Batman out first like to to lead with Batman because he is what like the the biggest SEO on in on the planet right search thing on YouTube yeah for first hero for first",
            "start": 3304.56
        },
        {
            "text": "I think they're smart to put Batman out first, like, to lead with Batman because he is what, like, the biggest SEO on YouTube, yeah, for the first hero, for the first superhero. So I mean, and I love Batman; I will always watch any Batman movie, whether or not it's good, in case, in point, Batman Forever is on my Netflix queue right now; I will probably watch that tonight. Hell yeah, that was the \"Cliff\" one, no, no, Batman & Robin. Batman & Robin gets a bad rap; no, Batman Forever was a fine movie. Sorry, Batman and Robin's on my Netflix C, and that's when, uh, what killed the dinosaurs? The Ice Age came out of nowhere. Why did he say that? I don't know; not motivated line. I just, I'm looking around like this; I, I don't, I'm just trying to figure out because I'm not really in you know as we know I'm not really in the comic books or superheroes or anything like that and I wonder I'm looking around and it's kind of in our our nerd culture a lot.",
            "start": 3343.04
        },
        {
            "text": "because I'm not really into comic books or superheroes, and I wonder if we can keep aiming at this small group of people and are they going to continue to receive it? You know, we were looking at the ratings for stuff like Arrow and that's not good. Like, the ratings are good for CW but they're not good ratings like for say NBC or something like that. I wonder if you can keep aiming at this small group of people and are they going to continue to receive it? You know, we were talking about Gotham, like Gotham was supposed to be this big thing and then like I've not heard anything really positive about it. Well, they picked it up, it's doing well, yeah, like you know but I mean critically I've not heard I've heard actually a lot of bad things about Gotham seems like in the very beginning there were a lot of people yeah I I dropped off after that",
            "start": 3390.76
        },
        {
            "text": "yeah like you know but I mean critically I've not heard I've heard actually a lot of bad things about Gotham seems like in the very beginning there a lot of people yeah I I dropped off after Bane man I was like I'm good that was not great, man there's some really good bad guy characters really it's about not even Mega Man the beginning of bad guy characters in the Batman universe if you if you ignore Jim Gordon it's better he they just don't give him very good story lines yeah that what I was even why would make Bane so you know that that's like a that's a that's a that's a big problem he like just put a giant X through it on the board he like I'm intrigued by it because I know that like we we live in I don't want to say an echo chamber but like just a group of people millions of people that really enjoy this stuff and they love it and they love it and they love it but I I I wonder just like with anything else when it hits critical mass and there's so much of it it will inevitably",
            "start": 3422.6
        },
        {
            "text": "that really enjoy this stuff and they love it, but I wonder just like with anything else when it hits critical mass and there's so much of it, it will inevitably fall apart. Like I want to see how it happens and when it happens, it's going to happen. You keep pushing out these movies, two three parts, just like you announce your movie slate for 2021 - it's insane, it's insane. Like I've never seen anything like it. You know, this show can't last forever. I don't think it's going to be a hard bubble burst, but there is a point where we are sort of going away from the traditional movies, which sucks for me to say because I love movies above all. But like, going back to your point, I like what the BBC does right when they put out something like Sherlock, where it's three one and a half hour episodes - they feel like their own movie but they are TV, and you really can't put them in an category that we use or",
            "start": 3459.68
        },
        {
            "text": "when they put out something like Sherlock where it's three one and a half hour episodes they feel like their own movie but they are TV and they you really can't put them in an category that we use or metric that we use to categorize like our entertainment in the United States but they're awesome and they work and they feel fresh and new and so you know if they were to do it's just the model of film the film distribution is is still trying to figure out where it's going to be in this new media age and once it does I mean like you always say it'll probably just be online and then it'll be I guess cheaper to distribute and cheaper digital stuff I don't know I'm still going to go see the hell out of that I'm just waiting for the fifth Spider-Man reboot I think that that's going to be the one they're going to reboot it and literally the next year they're going to reboot again like just a younger like three years younger cuz then one one day we'll get Spider-Man and it'll just be Tobey",
            "start": 3494.84
        },
        {
            "text": "one they're going to reboot it and literally the next year they're going to reboot again like just a younger version, three years younger. cuz then one day we'll get Spider-Man and it'll just be Tobey Maguire and Andrew Garfield, see Punk Spider-Man, they just released did you see that Spider-Man? yeah they literally it was something either part of a card game I saw it on io9 or something like that and it was the worst thing I've ever seen he's wearing like cut off jean shorts okay and has like a punk mohawk nice Probably sounds like one of the great '90s toys we used to get, it was Spider-Man, it's like whatever **** it put him out I don't know I I want I just want to see how this all shakes out, nothing's immune to Market forces like the the you know we're you're kind of almost seeing it a good example is like Call of Duty and Assassin's Creed versus Grand Theft Auto like Call of Duty is plateauing now you know like and it's going to plateau and then inevitably if you keep reducing this",
            "start": 3531.48
        },
        {
            "text": "a good example is like Call of Duty and Assassin's Creed versus Grand Theft Auto like Call of Duty is plateau now you know like and it's going to plateau and then inevitably if you keep reducing this **** every year it's going to fall people are eventually going to become disinterested in Call of Duty might not be next year the year after but eventually that shit's going to fall off a cliff sure the same thing's going to happen with Assassin's Creed because they keep shoving it down everyone's throat I mean Grand Theft Auto is a different story because Rockstar will sit there for 5 years and make the game then it's a big deal right now that people have lived through is Guitar Hero Rock Band where those came out and everybody yeah and everybody loved and loved them and then like one day it was over and everybody's like we are done stop you know what I mean and they were like all right we're done too and everybody was just closed up Sho and it didn't matter anymore DC",
            "start": 3566.8
        },
        {
            "text": "like one day it was over and everybody's like we are done stop you know what I mean and they were like all right we're done too and everybody was just closed up shop and it didn't matter anymore, the thing with Rockstar or Rock Band and Guitar Hero which was really interesting was everyone loved it or whatever and I think a lot of assumptions were that oh well this group of people get out of it another group of people will pick it up younger people people that weren't familiar with it eventually it really did imp like we saw that before our very eyes that whole thing just imploded and maybe you want like Nick was saying maybe you want to see something as catastrophic or as sudden or even as recognizable or identifiable as what happened with that but I think you'll see something like I I just think you're going to one of those movies that they announced one of those Marvel DC movies is going to be a disaster, I know it and like I don't know which one it's going to be",
            "start": 3603.52
        },
        {
            "text": "I just think you're going to one of those movies that they announced one of those Marvel DC movies is going to be is going to Crash, I know it and like I don't know which one it's going to be and and suddenly people and I don't think I don't think the trailer looks good no I mean really I thought it looked fun I just have no attachment to anybody in the Marvel universe so I watched I was like oh Paul Rudd sure Michael B. Jordan why not I they put I won't see it till it's day and Day digitally so it doesn't matter yeah I mean I I just think I don't know what it's going to be I just think the margins have to be so small when you spend this much money to market a movie and make a movie and pay the stars and stuff like that like they can't afford hits like where they're going to where they're going to eat it like over and over again on these movies like they did with you know they make most their money overseas anyway that's true so they don't care about Americans no I mean you're seeing you're",
            "start": 3635.8
        },
        {
            "text": "to eat it like over and over again on these movies, like they did with you know they make most their money overseas anyway that's true so they don't care about Americans no I mean you're seeing you're seeing that with the Transformers and stuff too uh you know emerging markets and stuff are becoming very important for American entertainment uh you know sales globally obviously I just I'm just so super curious to see what happens and like what is too much because too much I love period pieces and I love you know all this weird stuff but I don't need product placement every two seconds like I do imagine if you just have to wait for a show's six seven eight episodes and maybe a movie every year right and it's awesome because of that like you want more of it because of that eventually it's got to go away and it's not even that exciting as it used to be anymore right like to me tell me about it I mean I I mean I you know what I mean like when you",
            "start": 3670.6
        },
        {
            "text": "because of that eventually it's got to go away and it's not even that exciting as it used to be anymore right like to me tell me about it I mean I I mean I you know what I mean like when you get something it's the same thing with Mad Men like they they split Mad Men into the final season into you know into two parts and that sucked but at the same time like I really want that show to come back if they shove the 24 episode Mad Men season down my throat I'd probably be like Jesus Christ like enough with the Mad Men already you know enough with the Mad Men so I'm just saying there's such there's such a thing is too much of a good thing for even the things we love the most that's why I love you know football I love football and I love hockey right but when hockey's not on it makes you want hockey right when there's always a superhero movie in the movie theater I bet you people are going to start to get fatigued by it and we're going to see what happens you know maybe people will",
            "start": 3707.84
        },
        {
            "text": "want hockey right when there's always a superhero movie in the movie theater I bet you people are going to start to get fatigued by it and we're going to see what happens you know maybe people will read more books I hope so speaking of books Nick way what hey Felicia you have a book coming out I do have I forgot we were going to try to work it into your travel topic and you can read books when you travel you do hi felici book.com what's your book all about it's an autobiography it's about me yes so it starts off in Austin Texas it no it starts off with me as a kid like a very small kid home school kid strange weird kid uh lots of weird stories I spent a year writing this thing so uh talking about yourself for a year is like I'm over you but hopefully other people are not over me um a lot of it is about how I I started making the Guild about the internet about how I grew up on games um started a company like it really just uh it's all the things that kind of make me weird and hopefully",
            "start": 3740.28
        },
        {
            "text": "it is about how I grew up on games, um started a company, like it really just uh it's all the things that kind of make me weird and hopefully encourage other people who are weird to just Embrace who they are, I mean that's the kind of core of what it is and uh I'm really excited for it, it's going to be out in August, I'm going to be doing a book tour so obviously traveling quite a bit and um yeah you know it's I don't know if you guys journal or or obviously you're really creative but um the thing about you know creativity is that you you just have to be brave enough to be able to do it and a lot of my struggle over the years was just figuring out how how do I actually put myself out there or not feel like I'm just this weirdo in life um so yeah that's the core of it and I'm you know I'm excited to to get it out there it's it's something I've been working on for so long it's like I can't wait can I ask because I always thought if if and",
            "start": 3779.84
        },
        {
            "text": "so yeah that's the core of it and I'm you know I'm excited to to get it out there it's it's something I've been working on so long it's like I can't wait can I ask because I always thought if if and I know Tim Gettys' probably think the same thing if you were to write your own autobiography would you in and to what degree to what length would you embellish Tim oh I mean I would be pretty accurate you would yeah I would probably there would be lots of saving children and burning burning buildings when I was in kindergarten no that's not true I in high school I saved an entire Kindergarten class from these seals in Santa Cruz wait what it's not true but oh okay if I tell it enough people will think it's true and eventually I'll think it's true and then yeah and then it'll happen so were you that's my question for you though real the real question was how when you were recalling these was it hard to be blatantly honest with yourself and hard to retell these yeah tell you're exposing yourself yeah",
            "start": 3822.28
        },
        {
            "text": "Felicia Day (Special Guest) - The GameOverGreggy Show Ep. 61: \nquestion for you though real the real question was how when you were recalling these was it hard to be blatantly honest with yourself and hard to retell these yeah tell you're exposing yourself yeah yeah yeah I mean I had you know I write a lot I mean I wrote The Guild and I wrote other screenplays and things like that but I've never you know when you're talking about yourself you really have to sort of zoom out and be like who am I and how is this useful for other people without just being like look at look at me like I need try trying to shape your whole journey and life and and make it useful for other people versus like narcissistic which obviously looking at herself feels oh my God this woman um but really the process of writing it was really therapeutic because um you know I've dealt a lot with anxiety and depression I didn't want to put it in there and I was like let's just make myself look amazing like I'm doing an interview and I'm like this is not useful to anybody so yeah",
            "start": 3863.24
        },
        {
            "text": "a lot with anxiety and depression I didn't want to put it in there and I was like let's just make myself look amazing like I'm doing an interview and I'm like this is not useful to anybody so yeah let's brag a little bit went from one success to another amazing you'll never be like me don't try the more I you know and the more you talk about things that are real because you know there are a couple people who like what I do and if it you know you when when you're separated if you're a fan of somebody you don't know their journey and if you understand their Journey it makes you you feel like it's possible for you to follow your dream and uh and really embrace you know doing something that seems scary um but if you unless you do something scary you're not going to accomplish you know your dream you can't by definition so um it is really hard but I I think everybody should do it like whenever anybody asked me how do you deal with anxiety I'm like the first thing I started doing was",
            "start": 3902.8
        },
        {
            "text": "dream you can't by definition so um it is really hard but I I think everybody should do it like whenever anybody asked me how do you deal with anxiety I'm like the first thing I started doing was journaling and whenever I get like really anxious like oh my God the nuclear war is going to happen I'd be like okay why is this not logical why is it not logical so Colin started taking notes I was going to say you and Colin have a lot uh Colin's wound pretty tight Colin really wanted Red Dawn to take place when he was a kid my movie it was my fantasy really oh my God that's all I'll say I'll be getting you a Mol skin for your birthday well that's exciting I I can't wait to read this I'm thank is it up for a pre-order now yeah you can go for pre-order Fayebook.com it's coming out in August uh I have a new cover coming out and all that stuff and yeah I'll be going on tour it' be really fun I I'm a huge reader so having my own book I'm just I want to be in an airport and see my face",
            "start": 3938.28
        },
        {
            "text": "I have a new cover coming out and all that stuff, and yeah, I'll be going on tour. It's gonna be really fun. I'm a huge reader, so having my own book is just... I want to be in an airport and see my face, that's like my dream. I know that's the only like thing I'll let myself sort of fantasize about; it's a good fantasy, that's awesome. I want to see my face on the side of a bus, I don't know why. You never see any movies... I want to see mine on a milk cart. Oh my God! One day, Greg, one day you'll be kidnapped. Don't worry, thank goodness I've never trusted this Kevin fellow. No one's going to kidnap Greg, Unsung, so no one's going to know that they... yeah, that's the problem. I just want my moment in the sun for someone to recognize all the things I've accomplished and celebrate, man. Write a book; I'm interested in your book. That was the most like... oh, yeah, yeah. That felt like a topic change, yeah. I was like, \"I'm not ready to change the topic yet,\" I'm not ready, no. Nick, I have one question for you about your book: so when",
            "start": 3981.44
        },
        {
            "text": "was the most like oh yeah yeah that felt like a topic change yeah I was like I'm not ready to change the topic yet I'm not ready no Nick I have one I have a question for you about your book so when you're going through and it's about you and you're doing these things yeah how when you're writing like I'm assuming there's quotes in there from other people how uh I you ever think about when you tell somebody's story and then you know like he didn't say exactly this but it was this is the line of reason the best that you recollect and there's always that thing like this is the way I remembered it this is not and you try not to be like talk s*** about people you have to reach out to people to and be like hey you're my book we're still in the process of doing that but you know I mean really I only make fun of myself I mean like there's so many stories about me especially with Cing and create The Guild like I'm an idiot like I don't know why I'm here it's all just like with this",
            "start": 4021.92
        },
        {
            "text": "really I only make fun of myself, I mean like there's so many stories about me especially with Guild Wars and creating The Guild, like I'm an idiot, like I don't know why I'm here, it's all just like this exactly. And if you're in the internet world, you just have to jump in. If you knew, if you look back and be like okay this is what you're going to have to do, I'd be like peace out, I'm just going to commercialize it, goodbye. Yeah, people tried to tell us it was going to be hard when we quit and you'd be busy but we thought we'd have a lot of free time, oh no, I I I thought I was going to take naps at times, I didn't realize it was going to be like this, oh no. But the cool thing is actually a whole thing I talk about a lot, like if you are your own boss in a sense, like you never turn it off especially if you're anxious because it's like this is all on me, I've got to mean if I stop the whole train stops, I'm just like you know so that's kind of a balance",
            "start": 4057.08
        },
        {
            "text": "never turn it off especially if you're anxious because it's like this is all on me I've got to I mean if I stop the whole train stops I can't stop I'm just like you know so that's kind of a balance you have to sort of insist like the whole travel story like I'm insisting that I do one day extra for myself and like I never would have done that two years ago it would be crazy crazy crazy **** crazy that's a chapter name crazy crazy crazy crazy **** that was my alternate title it's like it's on the dust jacket like about this crazy crazy **** picture like Colin yes what's your topic uh before we start I I uh someone referee's got something to say someone tweeted at us uh I just thought this was interesting what right now they're tweeting they know we're here they know just this was just a general tweet uh if you everday on the show today it was it's from Marcel Forge official m117 um that doesn't sound like a real name are you guys done I apologize Crossing I apologize you get",
            "start": 4092.08
        },
        {
            "text": "just a general tweet uh if you everday on the show today it was it's from Marcel Forge official m117 um that doesn't sound like a real name are you guys done I apologize Crossing I apologize you get caught up in the cross talking uh anyway uh he sent us he sent I don't know if you guys saw this or he tweeted at you guys said what he sent us analytics for the GameOverGreggy Show oh I saw that I did see that uh my topics are the least popular and what and uh let's wait hold on what does it say I love cruel internet comments that are meant to be helpful like oh no hair looks really bad lately he had a 5 hour shift at work and he was bored so he went through all of our videos and compiled stats on average number of views and this that and the other and how how many of our topics for each of us have gotten over 20,000 views or something like that or something what it's it's sweet I like it it's dope I want do hard stats because you aren't the bottom Knicks are the most popular because",
            "start": 4135.72
        },
        {
            "text": "us have gotten over 20,000 views or something like that or something what it's it's sweet I like it it's dope. I want to do hard stats because you aren't the bottom Knicks are the most popular because of the community Gregs are the second most popular no Tims are the second most popular Gregs are the third most popular mine are the least CU. I like to talk about sex a lot and people like sex but the difference isn't that big like the average the average uh for instance Nick's average topic views are 22,538 buttressed heavily of course because the why we quit IGN episode is a 203,000 well of course they the dirt they went the dirt uh so there there's something about that uh Tims are 20,43 uh Greg's are 19,948 mine are 17,229 so not terrible it's not a huge the thing is I feel like somewhere along the lines like in in the early episodes of the show it was very much our own topics but then somewhere on the line it's kind of like we talk about it it's like oh who should do what and like whatever",
            "start": 4184.08
        },
        {
            "text": "the lines like in early episodes of the show it was very much our own topics but then somewhere on the line its kind of like we talk about it its like oh who should do what and like whatever so its also you dont have enough to sample yet really yeah exactly well I mean cold cuts a fair amount not a popular topic Im pissed about that one me too cold cut should have been the most popular that was the least popular topic youve ever had cold cuts my most my most viewed topic was New Years resolutions my least viewed topic was cold cuts Greg's was the most viewed was Batman had sex with Catwoman which was mostly because of Tim's uh headline you think or because of the idea girl was it its called Sex It says Catom that's got to be a typ uh least view topic uh 12,712 views too lazy to check how did he find the views on it but he wasn't able to see what the top is caught during sex uh 59,500 which is the Aisha Tyler one one of the four topics what is love which I thought was a",
            "start": 4230.72
        },
        {
            "text": "to check how did he find the views on it but he wasn't able to see what the top was caught during sex uh 59,500 which is the Aisha Tyler one one of the four topics - what is love which I thought was a really good one 12.8% of that and Nick was most popular we quit IGN which was 203,000 and his least popular was Pie vs Cake 11.9% again because that's a good debate no it is where do you come down on that boy oh boy we've already established you sleep instead of eating I kind of like k no I'm not that's my problem I'm a sweets addict but I shouldn't have sugar because I have this sty you know whatever it's a deal uh I I'm more of a I'm more of a cake person all right okay okay I'm more of a cake that's okay for me it goes cupcakes then pie then cake cuz I put cupcakes in their own category we don't have to get into this you can watch the to I like a good Quiche which I read somewhere is the least efficient format of food ever like intaking calories is just useless",
            "start": 4271.0
        },
        {
            "text": "own category we don't have to get into this you can watch the To I like a good Quiche, which I read somewhere is the least efficient format of food ever - like intaking calories is just useless with the most calories with the least amount of energy output, like it's the worst and they're so good yeah they are they're flaky anyway the real topic was uh freedom of speech now this was a this was a topic that I was thinking about not so much with what happened in France although I think that catalyzed it but more generally about what we feel that means and if there's any restrictions on freedom of speech so for instance uh we were talking about Hotline Miami 2 uh the other day about how in Australia the game is just not going to come out because of a scene that depicts rape um or sexual assault of a woman um and we were saying on the show no matter the context of it the context in the game by the way for people haven't seen it is that it's a movie being shot and they're actors but regardless like",
            "start": 4321.68
        },
        {
            "text": "um and we were saying on the show no matter the context of it the context in the game by the way for people haven't seen it is that it's a movie being shot and they're actors but regardless like it's that's the topic and in Australia they're not going to let the game be released they were not even going to give it a rating and we were talking about how even though that's terrible um in real life obviously there's all sorts of crimes and and and just an endemic disrespect of of people over the world in many different ways that nothing should be off limits for art or entertainment and I agree with that um but do you guys think that there's any limit whether it's in good taste or legally to freedom of speech um or if do you think that like anything goes and I guess I was I was watching a Bill Maher thing today and I don't agree with Bill Maher on a lot of things I mean I'm on the different side of the political spectrum from him I think on many in many ways but um I do agree with him when",
            "start": 4366.04
        },
        {
            "text": "Mara thing today and I don't agree with Bill Maher on a lot of things, I mean I'm on the different side of the political spectrum from him. I think in many ways but um I do agree with him when he was saying like that people are so upset about the things people say, like a lot of a lot of freedom of speech is curtailed when people are their feelings are hurt basically it's like not even offensive it's just like I don't want you to say this or I don't want you to say that because it hurts my feelings or I'm sensitive about a certain issue and to me I think that that's outrageous. So um what do you guys think of all this, that's my topic freedom of speech, you is good, I I come down with Colin, I think on most the I come down with wow I come down with Colin on most of this topic in fact yeah like we were talking about the Hotline Miami thing of just like there's going to be stuff up said and done all the time and I think it's up to it should you should be as artists.",
            "start": 4405.4
        },
        {
            "text": "yeah like we were talking about the Hotline Miami thing of just like there's going to be stuff up said and done all the time and I think it's up to it should you should be as artists and creators allowed to create that content but then it's up to the audience to decide if they want to support it or not and then have it play out that way you know let the market dictate what is and isn't acceptable would be my way now in terms of just freedom of speech in general like yeah I mean that was all you know from It's Always Sunny that weird thing like people shouldn't be **** if you're being an a**hole in the middle of the street screaming obscenities at somebody right like I would like them to stop you you know what I mean not because you're saying mean things to them but you're disrupting the situation and scaring people and turning them off to this that and the other but where's the where's the limit there yeah I know right that's the problem I mean as somebody who um has",
            "start": 4444.72
        },
        {
            "text": "disrupting the situation and scaring people and turning them off to this that and the other but where's the where's the limit there yeah I know right that's the problem I mean as somebody who um has intermittently gotten a lot of hate on the internet oh you're at the table full of people who at the internet don't worry about it and Tim generally the people who literally are hanged all the time with absolute disgusting hate and just like harassment like it is really tricky like nowadays you you know because if it's one person saying I hope you die and I hate what you do and I'm going to rape you and all those things like okay that is I mean that person is obviously disturbed but how do you curtail that behavior but then when it's like a whole group of people together doing it I mean it is sort of it's this weird online world where how do we actually restrict things for the better and not for the oppression of people's rights because I'm all for you know people's uh freedom of expression",
            "start": 4482.08
        },
        {
            "text": "of its this weird online world where how do we actually restrict things for the better and not for the oppression of people's rights because I'm all for you know people's uh freedom of expression I mean I I go to art galleries and see like oh that's really crazy that's her pubic hair like you know really weird I want to go to those art galleries exactly you do not want to say anyway but uh obviously art is meant to change the way we think about the world right and you know we all are enveloped in a sort of worldview where we think oh this is the way the world works and art comes in and disrupts the way we think that things should be and hopefully it changes our mind about how we see other people how we deal with certain topics so if if we don't go into an uncomfortable area then we never grow or at least get the opportunity to think uh differently whether we do or not it's better to be exposed and choose for yourself right but well now it's almost like we're coming on two different",
            "start": 4521.32
        },
        {
            "text": "grow or at least get the opportunity to think uh differently whether we do or not it's better to be exposed and choose for yourself right but well now it's almost like we're coming on two different things right freedom of speech and freedom of expression expression for art and Hotline Miami and even hatred right like all right go make your product do your will but freedom of speech of people who do go on the internet and call us names or call yeah that's not see this is what I was thinking about when Felicia was saying this was like to me the difference is like if someone tweets at Felicia like I'm going to kill you right yeah um which doesn't happen all the time I mean not like other people I know but yeah it it has happened many times of course like that to me isn't a freedom of speech issue because that's a direct threat that's a threat like as opposed the difference is like saying like um I'm going to kill you right that's a threat or I'm going to make a piece of art about",
            "start": 4563.88
        },
        {
            "text": "speech issue because that's a direct threat, that's a threat, like as opposed to the difference is like saying, \"I'm going to kill you,\" right, that's a threat or I'm going to make a piece of art about killing someone, yeah, those are two different things, yeah, like you know what I mean and like I guess that's like what I'm saying is that the direct threat especially against women online is like insane and that that stuff needs to be criminalized it's unacceptable you know anything like we've all I think Felicia gets it worse than any of us by far simply because of our gender and that's unacceptable we all are receivers uh especially Greg and I think no you guys everybody gets it online no but no but it's it's not even a question yeah no I mean if you're female you get it worse terrible I never write about the things that even happened to you and it's it's it's awful you know and and like the I'm sorry okay I was going to say and like like you read about me that kind of stuff",
            "start": 4599.08
        },
        {
            "text": "write about the things that actually happened to you, and it's awful, you know, and like I'm sorry, okay? I was going to say, and like, you read about me, that kind of stuff is different because that's actionable, you know what I mean? Like, that's something that's restraining order-ish. Me, I know, but it's interesting that the people who will defend the right for Hotline Miami to be released and hate on it are the first to line up to castigate people who are making games that make you think in a different way. That's the weird part to me. Like, I'm fully on yeah, release all those, but don't sit there and mob people who are making something that makes you think the opposite direction. It's that's the weird part of the current culture, that's very bizarre to me. We always talk about it on this show, and you know, a million other times, the vocal minority that steps up and talks about this so many people",
            "start": 4636.08
        },
        {
            "text": "of the current culture that's very bizarre to me we always talk about it on this show and you know a million other times the vocal minority that steps up and talks about this so so many people enjoy all of our content enjoy it and bounce like they watch the video and they're done they watch The Guild on Netflix like great leave and then there's the people who don't like it and they're the ones who are motivated the most to talk about it right and that's the problem of then making it sound like the minority is the majority it's like the Janet Jackson \"wardrobe malfunction\" was like four people or something exactly they all called the FCC over and over oh and so it's literally yeah a mountain out of a molehill kind of thing that sucks that that's how it gets all spun around and changed up anyway I interrupted you you were saying something smart no it's it's it no to me it's I I just I'm really interested in the whole idea because you know Bill M was basically saying and he made an interesting point he he",
            "start": 4677.84
        },
        {
            "text": "you were something smart no it's it's it no to me it's I I just I'm really interested in the whole idea because you know Bill M was basically saying and he made an interesting point he he said and this I think comes down you can look at this in two different ways he was saying that people that he was talking about Rush Limbaugh, who's like very controversial talk radio guy he's been around for 25 years or longer and he's you know makes he's just hugely popular hugely Rich uh big listenership and he was saying like I'm not a fan of Rush Limbaugh but the people that make websites attacking him and trying to get his advertising pulled are not Advocates of freedom of speech and I thought that that was an interesting thing because a lot of people would say and I would actually agree with both sides saying like well it's their it's them exercising their freedom of speech by getting him basically financially yeah you know being like Oh I'm going to I don't like what",
            "start": 4712.28
        },
        {
            "text": "saying like well it's their it's them exercising their freedom of speech by getting him basically **** you know like like financially yeah you know being like Oh I'm going to I don't like what you're saying now I'm going to screw you um but at the same time he's writing in a sense that like people are so about what Rush Limbaugh says they make it their mission to silence Rush Limbaugh and isn't that isn't that the core power of freedom of speech though isn't that isn't that what we all hope will happen is that the good will overtake the the seemingly bad or whatever the you know the majority of people think is bad like what about a radical like if you go to the extreme like what about a really radical Muslim like uh you know uh person who's in inciting violence or whatever like there's very few people like that's freedom of speech too no that's Freedom when you're inciting violence you're inciting violence now that's when that's when you start going over I mean it's a crime right",
            "start": 4751.92
        },
        {
            "text": "few people like that's freedom of speech too no that's Freedom when you're inciting violence you're inciting violence now that's when that's when you start going over I mean it's a crime right like the stuff that happened in France it's a crime those people were I mean they're dead which is good all of them are dead did they find all of them finally I think that one girl is still right yeah I don't know I mean yeah she actually snuck back in I think to like Siri or something yeah I thought I thought I read something like one of them actually like got away but it's not good that they're dead I wish they caught them alive well that would have been well I don't know it depends because then then we get into the spectacle of like what we had with like Saddam and I don't think you really wanted that um I don't know I'm not going to I don't want to go deep into the rabbit hole into terrorism don't go in there it's just a it's a mess let's talk more about s but yeah um but no I mean just to",
            "start": 4790.04
        },
        {
            "text": "that um I don't know I'm not going to I don't want to go deep into the rabbit hole into terrorism don't go in there it's just a it's a mess let's talk more about s but yeah um but no I mean just to kind of dial it back down to to something that you know we do on a daily basis is we cultivate positive freedom of speech on our sites right and and and on our channels and on everything we do and that's the only real thing you can do there's always going to be people and it is their right to come up and be like I don't like Tim's Pigeon Shirt it's disgusting he's worn it way too much I I try to only wear it when there's guests it really looks it doesn't it really look clean but but you know what if we if we are good decent human beings when we are putting positivity out into the world there will be a wave an overwhelming wave hopefully of people that will say Tim is a I love that shirt allowed to wear it whenever and there is I think probably is some sort of Michael plan for you to take",
            "start": 4824.84
        },
        {
            "text": "will be a wave an overwhelming wave hopefully of people that will say Tim is a I love that shirt allowed to wear it whenever and there is I think probably is some sort of mical plan for you to take over the world but I'll read your book 10 years from now and your biography where you're saving your your kindergarten yep exactly but that's the thing I you can't you can't have freedom of speech without the bad yeah you you have to allow people like Russ and B to speak um and it's it's it's a fluid thing it's not it's not an like I I feel like with these issues what breaks your brain is that you think that there's going to be you know an end game to it where finally we all win it's not the way it works our our entire civilization is a fluid thing like like like a river or like anything else that flows flow you know I mean it's it's always going to be ups and downs it's always going to be Peaks and valleys right we're always going to have great you know moments in our history that we",
            "start": 4865.56
        },
        {
            "text": "that flows flow you know I mean it's it's always going to be ups and downs it's always going to be peaks and valleys right we're always going to have great you know moments in our history that we can all be proud of and then we're going to have moments that like just happened in France where someone said you know they did something that was controversial and there was a severe repercussion for it and who's right and who's wrong we have to figure that out and we have to move forward yeah I just feel bad for people who are always outraged and they're always angry they always feel put upon and like I live with so much anxiety in my life and I know that I spent too much time in my life dwelling in a negative like worldview and like having tried you know made an effort to let go of that it's so much better to not like you're disenfranchising me you're you're oppressing me you're trying to suppress being like fighting so hard when in fact you can make a choice to be",
            "start": 4904.64
        },
        {
            "text": "to let go of that it's so much better to not like you're disenfranchising me you're you're oppressing me you're trying to suppress being like fighting so hard when in fact you can make a choice to be like I don't like that but I have a lot of things I enjoy and I'm going to concentrate on that like that's what I honestly for the people who are not violent or just negative all the time I'm like I actually I feel like there's a better way you would be happier if you didn't do that well they and they would and that's the thing too is like it's it's harder it's easier to criticize than it is to create right but we choose every day all four of us create things and we combat sort of any sort of uh negative energy or or negative sentiment out there with positive content with you know instead we build that audience around that positivity and the same thing on Twitter right where it's like you know last year in that time where I was like like kid I was you know calling out some troll",
            "start": 4941.92
        },
        {
            "text": "we build that audience around that positivity and the same thing on Twitter right where it's like you know last year in that time where I was like like kid I was you know calling out some troll showing the world how terrible it feels so good for a second and somebody respond and they're just like hey man like it's I understand it sucks you get all this hate and this but you know understand for that one guy there's a thousand people that would love to get one positive comment from you that's when like when Twitter introduced the mute button right I like oh yeah oh my God it's so good just cultivate your feed now yeah go ahead and yell on your your Phantom Pain vacuum where I you never know that I don't even know oh I still I still never use mute I just block people out right no they gives them power no they want to be blocked the worst they want like I got it I'm going to create another account guess what they don't know if they're muted or not that's the great part yeah no I",
            "start": 4982.68
        },
        {
            "text": "it gives them power no they want to be blocked the worst they want like I got it I'm going to create another account guess what they don't know if they're muted or not that's the great part yeah no I know that I just I I like you know I got to be passive aggressive in my own way like can't let go the negativity but to me no to me I don't know I just think I just think it's very interesting because I want us to get we were talking about games specifically with Hotline Miami to obviously a very traumatic thing happens at the beginning of that game regardless of the context we don't know and but it's it obviously is in real life a disgusting sort of thing but we would never question something like that existing in a movie or a book or a TV show ever so like my whole point was like people Australians especially should be really angry that that a government entity thinks that they have the right to tell them that they can't do like you know play a game because of something that someone did",
            "start": 5016.92
        },
        {
            "text": "especially should be really angry that a government entity thinks they have the right to tell them they can't do something, like play a game, because of something someone projected their own offended posture onto them. That's the kind of stuff that really bothers me. There's nothing actionable about the threat Bill Maher brought up another thing about Holocaust Denial in Europe, which is illegal in most European countries - a legacy of post-1945 Europe and how ashamed especially Germans and Austrians were about what happened. So like even going \"the Holocaust never happened\" you can go to jail for that. You know, and he's saying it's silly, it's like you can't just project your own obvious knowledge that the Holocaust happened - there's a story I mean you don't have to be a history major like me to know that the Holocaust happened there's plenty",
            "start": 5051.24
        },
        {
            "text": "like you can't just project your obviously the Holocaust happened there's plenty of evidence that the Holocaust happened but if someone's going to run around and be like no the Holocaust didn't happen it's amazing how people they did a study where if somebody believes something doesn't matter if you show proof to them and I see this every day on the internet like they will deny it and you form your brain around a truth and most people cannot change that truth and that's what art is for to maybe bash down little exactly but it's so much harder to convince somebody and the problem is I mean I'm not saying you should censor people that's absolutely but at the same time like I guess they're trying to avoid the fact that you have sort of a Zeitgeist or an uprising of people just forgetting I mean look at our textbooks people are trying to",
            "start": 5090.16
        },
        {
            "text": "but at the same time like I guess they're trying to avoid the fact that you have sort of a Zeitgeist or an uprising of people just forgetting I mean look at our textbooks people are trying to take things out so that people don't learn and you grow up with a worldview you can't be changed climate deniers and creationism and all this stuff that people are trying to put in books and sort of erase parts of history or whatever um you you sort of fall in the trap where we forget where we come from I don't know I'm I'm not defending no no I you're I understand what you're saying because it's funny because we were talking about climate denial, the climate change denial the other day too how silly it is because the evidence shows it but if someone wants to run around and say like oh the Earth's 5,000 years old it's like well clearly it's not but I guess I but I guess that I guess that's your right to feel that way and you know you know what I'm saying like I I just I feel like the Free",
            "start": 5123.84
        },
        {
            "text": "years old it's like well clearly it's not but I guess I but I guess that I guess that's your right to feel that way and you know you know what I'm saying like I I just I feel like the Free Society the freest Society is one where you know is the more libertarian Mantra of just saying like just do onto others kind of like you know don't hurt anyone physically but if you want to run around like you can say someone yelling in the street it's like who cares like yell in the street I guess like if you're bothering someone if you're outside someone's window and they're trying to sleep then maybe that's a different story but we can't I agree with what you're saying in terms of the the the there's just people out there that are offended by everything everything and you could find them I I I I got to say like I love going on Twitter when there's something potentially offensive and just going to the same people over and over again just like how morally outraged they are and like how",
            "start": 5158.6
        },
        {
            "text": "I got to say, I love going on Twitter when there's something potentially offensive and just going to the same people over and over again just like how morally outraged they are and like how like it's like shut up like this is like this is the world you live in like where Pagan Min in Far Cry 4 is going to ruin your whole week, you know, because he has 'cause he's got his hand on a on a guy's head with a grenade, you know. Oh my God, I couldn't that's terrible, it's a terrible thing, I can't I can't think of anything worse than that so it's like so freedom of speech to me is like a very open-ended question but I think that we should always air on the side of true freedom of speech like the guys that protest the totally tasteless Westboro Baptist Church, the guys that protest uh the funerals of Marines and and soldiers that come home that are dead and it's like totally it's like wildly offensive you know like the things they do they've been doing it for 10 years but oh",
            "start": 5194.88
        },
        {
            "text": "The Westboro Church goes way back but yeah it became it came to prominence obviously yeah I just remember covering it you know for newspapers um don't you think when people are that horrible like it almost pushes people who might be on the fence to be like no like it's almost with especially even gaming like you have such bad behavior on such an extreme that it's more people are like oh no don't you know I'm not I don't want to side with them I mean in movies you don't have that sort of extreme so you can't criticize you know Cinema universe as much because there isn't the Extreme as much I don't know well you hope is it becomes part of gaming in particular becomes part of everyday culture like when all the",
            "start": 5236.48
        },
        {
            "text": "you know Cinema universe as much because there isn't the Extreme as much I don't know well you hope is it becomes part of gaming in particular becomes part of everyday culture like when all the old people who haven't played games dies and it's everybody who's ever been raised in a world of games then it's just going to be games you're right you know t uh what's your name Nick Nick Loves movies but he's never like I'm I'm a movie goer that's how I Define myself as a movie goer right like we're Gamers though because still our things none of the above I you know not cile what's that other thing you are oh god oh man what is it he was going to say pedophile I didn't know that was those weren my words what the abuse the abuse I take week after week at this table Epicurean I'm epep but I'm going to put I'm going to put it this way like we were talking about Westworld right like probably the most offensive people in the entire country in terms of just there's complete agreement with them",
            "start": 5274.8
        },
        {
            "text": "to put I'm going to put it this way, like we were talking about Westboro right, like probably the most offensive people in the entire country in terms of just there's complete agreement with them but like you can't it's like introducing attacks right, like once you introduce the tax it never goes away, in a ref outfit, right now I know what you like flag on jerks, once you introduce like the problem with the income tax for instance in 1916 was or you know in the 19s was they introduced it at 1% and now we have an income tax that's way higher because you introduced it so the idea of the tax was there and it never went away and it got worse and worse, you introduce censorship yeah against the Westboro guys for instance or the KKK or whatever other wildly offensive groups out there and suddenly people are going to interpret over time to be like well that's offensive actually too and that's offensive and it that's your point to begin with you know just like you never introduce new tax to begin because",
            "start": 5321.16
        },
        {
            "text": "are going to interpret over time to be like, well, that's offensive actually too, and that's offensive. It's like you never introduce new tax to begin because once you introduce something, it never goes away. So let the Westboro church guys go crazy; let the KKK and the neo-Nazis go crazy. At least you know they're there, and everyone hates them anyway, so they're not living in secret. You know that these maniacs are there. You ignore it right? It seems like that's the easiest way. Everybody's doing it for attention right? Like when we mute somebody, and then they just yell and yell and yell, and if they never get a reaction from us, then they just disappear, and it's like whatever. Same thing with them; I always love the people who come with their own signs and sit in front of them or the signs of the you know the left that's you know make fun of them and all like well there you go you know",
            "start": 5359.48
        },
        {
            "text": "people I always love the people who come with their own signs and sit in front of them or the signs of the you know the left that's you know make fun of them and all like well there you go you know what I mean like just ignore it just go don't worry about it we don't need to sit here and go crazy are you saying if I'm hearing you right that it's better err on the side of like being more liberal with our with our policies toward freedom of speech than it is to be more conservative yeah absolutely abs like absolutely because like I I really do feel like once you start checking the boxes and getting and censoring more and more things it's hard to uncensor something so you might as well just err on the side of just saying like well as long as you're not hurting anyone like physically literally hurting someone or like we were talking about before with Felicia Day threatening someone in a way that's actionable which I think any threat probably is then who cares people tell me they hate me all the time",
            "start": 5396.88
        },
        {
            "text": "hurting someone or like we were talking about before with Felicia Day said someone in a way that's actionable which I think any threat probably is then who cares people tell me they hate me all the time people say awful stuff to me every day on the internet that's their right I'm not going to I'm not going to dispute their right to say that to me because it hurts my feelings you know and I think there's a lot of people need to realize that art doesn't care about their feelings you know at the end of the day like that's not what art exists for it's not what a movie exists for it doesn't mean it's not everything's there to massage your ego and give you a trophy and make you feel good about your life you know what I mean and well you just have to say it I mean like I know a lot of creative people have quit Twitter and things like that cuz it's just like this is not helping me create I mean because when you have other people out there",
            "start": 5427.88
        },
        {
            "text": "quit Twitter and things like that cuz it's just like this is not helping me create I mean what I do my best creation when I'm not on the internet I mean because when you have other people out there you're then you're thinking I want to externally validate and please everybody else and I don't know exactly what I want to say as an artist and it is very hard to have those ears all in your and then you're kind of looking at your create you can't create from your heart you're creating from external places which is they didn't like this before so what do I how do I yeah yeah well that's what I always loved about you know Twitter to me was it's been a different experience for me because I think maybe just the unique experience in gaming maybe in just in our sphere is that I I love the people that are out there that have stuck with us and that we've that have come to appreciate appreciate us as a group and individually and love us whatever because I've been outspoken and very different",
            "start": 5459.52
        },
        {
            "text": "that are out there that have stuck with us and that we've come to appreciate as a group and individually, and love us for whatever reason. Because I've been outspoken and very different than a lot of the echo chamber in gaming - like I'm very openly conservative, and I'm a Republican, and all those kinds of things, and I just say it; I don't care. And like, the people that are like me, I've never censored myself in front of people, I never said what people wanted to hear, and I think that really rubbed a lot of people the wrong way - a lot of people judge me based on my politics, and then a lot of people also appreciate that you're different, and that you don't censor yourself, and those are the people that I think have come along with us because they appreciate kind of the more outspokenness of it. That I'm not trying to be something for everyone; I'm trying to be me, and you either take it or you leave it, and that's totally fine - I'm not offended if you leave it, and I",
            "start": 5497.0
        },
        {
            "text": "more outspokenness of it that I'm not trying to be something for everyone, I'm trying to be me and you either take it or you leave it, and that's totally fine. I'm not offended if you leave it, and I hope you do take it, you know what I mean? Like, it's you have to respect everybody who has a belief system that they put forward that's not based on negating other people's experiences - that's the problem from any side is like my agenda is to invalidate what you believe. No, my agenda is to put forth what I believe in a positive way and go forward positively, that's what everybody should do, yeah. The only rule, absolutely. And I always love when people just don't like to be challenged - I live every day of my life being challenged because I'm a unique kind of individual in that industry, you know what I mean? But people always make assumptions about me",
            "start": 5525.04
        },
        {
            "text": "love when people just don't like to be challenged, I live every day of my life being challenged because I'm a unique kind of individual in that industry, you know what I mean? But people always make assumptions. We've had we've seen it before where it's like, \"Oh, he's you know, he must be against gay marriage.\" It's like, no, I'm actually for gay marriage, and like, I'm like, \"He must be pro-life,\" and I'm like, \"No, I'm Pro-Choice.\" You know, like, all these kind of things. So you're basically just judging me, like, and trying to almost... you know, judge exactly it's like, well, do that if you want, but you I'm not going to be put into a box by the way people feel about it, damn it! What pigeon hole you start rubbing your shirt showing off? Did you really do that? He did. He did. So anyway, I thought that that was a fun conversation we could have had about freedom of... it was a fun conversation, provoking yeah no problem and hopefully it'll increase my numbers a little bit maybe maybe not I don't",
            "start": 5564.52
        },
        {
            "text": "was a fun conversation that we could have had about freedom of speech it was a fun conversation provoking yeah no problem and hopefully it'll increase my numbers a little bit maybe maybe not I don't know down uh down again and again we really do appreciate all you guys out there thank you for thank you for sticking with us even though you don't agree with everything we say Yeah Tim yes you're the final topic bringing home the final topic for the day is public displays of affection AKA PDA love them or hate them I don't like when other people do them however I'm in a very loving relationship with my wife and uh I when it when I want to snuggle with her I don't care where it is if I'm at Starbucks and the line's long and like she's standing in front of me I will just put my nose up against her snuggle in and show some affection what yeah what are we defining as PDA like grabbing her ass and there that that's stuff happening",
            "start": 5604.04
        },
        {
            "text": "She's standing in front of me, I will just put my nose up against her, snuggle in, and show some affection. What, yeah? What are we defining as PDA like grabbing her ass and there, that's stuff happening too, oh at the Starbucks like I will I'll slide a hand up front. I'm just joking, um so where's the line drawn like what is acceptable what's not what scenarios change that like my thing is if there's children present there's like a three-foot rule you need to be 3 feet away from the person when there are children present. Teach all of the children in America that kissing is bad; they have eyesight unless they're like myopic, yeah no no no no no no from your significant other, yeah you need to be 3T away from say like away kids need to grow up so they so they grow up knowing that touching is bad and like they would be ashamed of their bodies. You should not touch each other have grown up Catholic it'll be perfect I'm joking about that.",
            "start": 5647.08
        },
        {
            "text": "grow up so they so they grow up knowing that touching is bad and like they would be ashamed of their bodies you should not touch each other have grown up Catholic it'll be perfect I'm joking about that but what I'm saying is you should be very mindful when there's children around I feel like even like those kids definitely nothing beyond beyond beyond beyond kissing and it has to be like a peck kiss sure and what's beyond kissing by the way um Extended kissing yeah you should be making I mean so you are not okay making out in public I mean there's rare exceptions at a bar when you're just you're just getting you're just like all drunk no I'm not I'm just saying I'm not going to fault somebody at a bar 12:30 in the evening I almost said afternoon fault you at 12:30 in the afternoon the evening that's fine you're you're it's some Club I don't go to the clubs I don't know what they're like I assume they're like and it's like lights and stuff and there's foam coming I've only watched",
            "start": 5694.64
        },
        {
            "text": "evening that's fine you're you're it's some club I don't go to the clubs I don't know what they're like I assume they're like and it's like lights and stuff and there's foam coming I've only watched The Real World: Las Vegas and I assume it's like that and that would be fine exactly whatever but like yeah like no at Starbucks no you're not no don't tongue kissing you know what i' I would rather anybody do okay this is my pet peeve that I see so a lot I would rather see people tongue kissing and dry humping than a guy doing this to a girl you know the old \"neck grab\" it's like a like a Vulcan neck pinch like of ownership it's kind of like a yoke I see guys doing that all the time yeah no especially I see this a lot when a girl is at a bar and like another guy would come up to her hit on her talking to it he these hey like this and you're or or walking like this like she's in a yes really weird I've seen I see this a lot if you haven't noticed it just look that seems a little my girl",
            "start": 5740.36
        },
        {
            "text": "her talking to it he these hey like this and you're or or walking like this like she's in a yes really weird I've seen I see this a lot if you haven't noticed it just look that seems a little my girl exactly it's a weird dominant thing that guys do and I'm like don't that is really weird I just consider like an oxen with the thing on his sure sure sure um I would rather see dry humping than that okay I mean I'd rather see dry humping just period I'm a fan of Dr. the last time you saw dry humping in public well okay so the reason I bring up this topic is I have this friend and this friend just like his his ideas of what is acceptable it just really Kevin I mean I'm not going to he's the one noing like an idiot or deny this but it's just like what goes through his head like his needs and his desire I almost spit and his whatever he wants at that moment which let me tell you whenever his girlfriend is present is that is just it's ridiculous like the it's grody is the only term you can use to",
            "start": 5782.64
        },
        {
            "text": "I almost spit and his whatever he wants at that moment which let me tell you whenever his girlfriend is present, it's just ridiculous. Like the only term you can use to describe this is \"groby\". It's it is it is like on the businesses they just like No Limit, especially if they're driving now they're driving with you in the car. So here's the thing I'm with them constant son he's like but but it's one of those other things where even if it wasn't me if it was someone else I don't think it would be a different story. Like if it was if it was Tim, if it was Nick, if it was Colin - if there's anyone we will never send Kevin and your girlfriend to pick you up together no. Here's the thing he's he's not nasty well let me take that back I was going to say he was what is going on he pretty nasty but he's he's a good good guy very respectful super like it's not like it's bad you know what I mean it's not like she doesn't want it like when like when you're chained into what'll feed",
            "start": 5830.96
        },
        {
            "text": "nasty but he's he's a good good guy very respectful super like it's not like it's bad you know what I mean it's not like she doesn't want it like when like when you're chained into what'll feed you going consensual on but here's the thing there's been multiple times where we've been at you know nice little Vietnamese restaurants maybe Thai restaurants just all these different things you're at a restaurant yeah but at no point does it matter the cuisine does I'm specifically saying it happened at these two places and I'll just hear lick my tongue e what the **** wait what your friends are disgusting and I'm like why would you do that like just your friends are disgusting to the best thing is that reaction wait wait I just want to see if she would do it well here's the thing the first time this happened you disgusting you're disgusting but then but it's one of those things where it's like the second time she licked his tongue she did not do it not how you lick a tongue how has that even",
            "start": 5874.88
        },
        {
            "text": "drun this you disgusting you're disgusting but then but it's one of those things where it's like the second time she licked his tongue she did not do it not how you lick a tongue how has that even happened is it like a Pokémon yeah but it's you know it's one of those things where he Greg might be a good nickname for him and it's like it I just con how she feel about it she I mean she's she's still with him and like they've been together a long time too together yeah like three years two and a half years does she seem reluctant to do these things or definitely very reluctant so does she she has different she has a different level of P he's forcing her to do things that she's uncomfortable with no no no no no maybe yes you know what we should probably talk to her about that but no no no weal she she understands what she's getting into and it's if she she loves him enough to do these things it's like when CH watches WrestleMania with me she doesn't want to watch WrestleMania but it's very",
            "start": 5929.08
        },
        {
            "text": "She understands what she's getting into, and it's if she loves him enough to do these things. It's like when CH watches WrestleMania with me; she doesn't want to watch WrestleMania, but it's very similar to that because there are lines where she'll be like \"no\" and he'll be like, \"all right, see?\" Like, yeah, you guys are carrying this whistle around, and just whenever you see something not acceptable, yeah. Oh, I'm blowing the whistle a lot. This is like Pandora's box of PDA again. I was picturing a tongue licking another tongue, and just dry heaving inside at the restaurant. Please don't lick my... there's a lot of fish paste in those things. My tongue in yours; each other. You can't... I don't want this beard by default. If one tongue's licking the other tongue, the other tongue is licking the other tongue. I don't think you can lick a tongue that's moving; the tongue that's moving is the one doing the licking, and the other tongue could be stone or anything else; it doesn't.",
            "start": 5980.8
        },
        {
            "text": "the other tongue is licking the other tongue I don't think you can lick a Tong the tongue that's moving is the one doing the licking and the other tongue could be stone or anything else it doesn't matter you know I'm an epicene see this is what I'm talking about when I I'm never having sex again go internalizing the PDA question I immediately thought of you know Christine and I and like that's just like like you know walking back from breakfast today like holding hands like rubbing her back or something like that her rubbing my back or whatever like I was ready **** lose it at the post office today she calmed me down rubbed my back not like a you know like a massage just like you know a little little much affectionate touching that you wouldn't do with a friend right okay I think but I mean not there's not like making out making out there that this is an issue PDA are an issue of taste right that's it not the taste of a tongue looking another tongue by the way but just taste level well it's",
            "start": 6024.76
        },
        {
            "text": "there's not like making out, making out there that this is an issue PDA are an issue of taste right that's it, not the taste of a tongue looking another tongue by the way but just taste level well it's taste level or expressing dominance over your partner sure do you know what I'm saying cuz girls would do the same thing she's they're like come up and just grope you to like establish like this is mine you know girls and guys more guys would probably do it but yes i' girls do it a lot exactly yeah this is my territory it's like peeing on a fire hydrant it's very insecure exactly insecure on either part uh but to me like I draw the line you know I think Cheryl is more comfortable with PDA than I am and I I like I just try to like think about what I would want to see and then I try to put that into the world so like holding hands is fine I don't need to see anyone kissing each other I don't need to see like anyone doing it's fine if you want to do I'm not saying you're going to get thrown",
            "start": 6065.52
        },
        {
            "text": "the world so like holding hands is fine I don't need to see anyone kissing each other I don't need to see like anyone doing it's fine if you want to do I'm not saying you're going to go get thrown in jail for doing it I'm just saying like what in the confines of good taste I think that like you know there should be no vulgar physical contact of any kind like a tongue licking another tongue like exactly no one goes out to a nice Thai restaurant expecting to see that where do you come where do you come down on just an occasional tush grab like a little it's funny like if you're it's but I understand what you're saying you know what I mean like cuz sometimes I do it I don't I don't do it on purpose I have developed this habit over the seven years of being with my wife where with my hands on her lower back every once in a while I'll give it just a little squeeze Hong Kong just a you a little like a understand know about no one",
            "start": 6109.04
        },
        {
            "text": "the seven years of being with my wife where with my hands on her lower back every once in a while I'll give it just a little squeeze Hong Kong just a you a little like a understand know about no one can see your hand but you're just giving me the full the full-on impression give you the bus Nick's been KN to grab my ass from time to time too I think he just maybe likes butts and that's grab my friend's boobs they're great i' be like what did that feel like like you a not you know I don't do that in Starbucks but everyone wants you should grab your friend butts like butts are great they're hilarious what we sit on they beg to be pinched a little bit watch Bon what was that what was it oh yeah the the body mass index I feel like high school has a very different interpretation of this like high school kids oh high school there's no rules rule no rules because recently I haven't been around high schoolers I I haven't um not by choice but the Recently I was at this bus stop and um I hope it's",
            "start": 6146.04
        },
        {
            "text": "school kids, oh high school, there's no rules, rule no rules because recently I haven't been around high schoolers, I, I haven't um not by choice but the Recently I was at this bus stop and um I hope it's not by choice Tim by the way any watch an hour ahead by the way oh this thing's just totally off it's in Spanish the date's not right it's total that is it just an hour off no it's everything off yeah it's just off it's just why do you do that the way I like to live my life and also he just got into a conversation with you it's a conversation piece if you didn't notice Tim is all Conversation Pieces what's wrong with your haircut why does your shirt have pictures on it why doesn't your watch work you're really smart people like to talk a schw are your assets exactly oh I know that I know how to use that to the bank anyways I see this guy and well this girl jumps up on him there's like the straddle he's pulling her and they're just making out at a Daily City BART station which is",
            "start": 6186.64
        },
        {
            "text": "to use that to the bank anyways I see this guy and well this girl jumps up on him there's like the straddle he's pulling her and they're just making out at a BART station which is like there's many bus stops there there's a lot of people there and I'm just looking at them like wow but you understand that in high school yeah like you figure you're finally not under the supervision of your teacher or your parents so it's if you're getting nasty at the BART station you got to do it that's how you make again i' I've been there I've thought about it I've never done it at the BART station but bucket list yeah oh exactly that's true love the reck that's that's a good point though it does bring you back to being 15 16 17 and like you just have to and while my dad's upstairs like that was like literally like my that was like literally my life when I was like 16 17 with my girlfriend jackets just meant that people couldn't see you at all yeah you know",
            "start": 6229.68
        },
        {
            "text": "oh my dad's upstairs, like that was literally my life when I was 16-17 with my girlfriend. jackets just meant people couldn't see you at all. yeah, you know what I would do if I had a kid and they were 15? I'd buy them an apartment next door and be like \"there you go, no way, really the coolest mom ever\". I'd totally be like \"there you go\", just don't become a heroin addict or get pregnant. yeah, see because I feel like being 15 takes all the fun out of it. I was ready to get out at 14, I was like \"well here's boarding school, no we don't have money, okay well here's an alternative thing\". I found an apartment and I'm like you know I'm 14 or 15, I feel like it would've been fine just living... wait are you a sibling? I have a younger brother. yeah, so you're the oldest, I think that's the difference. I'm just a year older, yeah it's weird. well for me I had an older brother and he was that person and I was like \"I'm sitting here forever\", I got",
            "start": 6272.28
        },
        {
            "text": "okay so you're the oldest I think that's the difference I'm just a year old yeah it's weird well for me I had an older brother and he he was that person and I was like I'm sitting here forever I got it all figured out they're already focusing on him cuz he's the one that's **** up all the time and going to chill and sneak girls in the back door Nick Scarpino was **** up oh yeah that picture Nick Scarpino sent us by the way oh my God was just my brother I love him to death but he was the one he's taught me so much more about like so much about life good and bad which I think is very important right he was the one that made a lot of mistakes that I didn't have to make I chose to make them of course because we all do we're stupid I'm like I've seen my that have a severe repercussion I'll try it nope same repercussion um but yeah he took a lot of heat from my parents and so when I was growing up my parents were like all right we've been down this road with your brother like if you",
            "start": 6310.56
        },
        {
            "text": "try it nope same repercussion um but yeah he took a lot of heat from my parents and so when I was growing up my parents were like all right we've been down this road with your brother like if you we're going to go out of town we put alcohol in the house don't go anywhere if you're going to have friends over have them sleep here like don't do it but we know you're going to do it cuz you're a **** anyway does that take out the fun of it do you just do it just because it's like you you're told not to no cuz I did other things too like I smoked cigarettes and I did like you know you you'd go and experiment with different things but then once you had that party house and me like it's awesome like your friends are like dude party at Nick Scarpino's house right now I'm like that makes me feel like I am in like you know Can't Hardly Wait or something other cool movie from my my childhood um Aaron Carter music video yeah the Backstreet Boys were playing that's not it the back to school concert where Oingo Boingo was playing that's that",
            "start": 6344.12
        },
        {
            "text": "like I am in like you know Can't Hardly Wait or something other cool movie from my my childhood um Aaron Carter music video yeah the back to school concert where Oingo Boingo was playing that's that was of I wanted to throw that party so badly they're playing dead man's party so good the only Oingo Boingo song anyone knows Weird Science oh did they wear science I take it all back Colin extra points if you can get this what's their full name okay Oingo boingo's full name yeah oo Boingo is they they eventually Boingo the oo Boingo to Boingo but they were something before I don't know it was something weird like the like the something nights of the oo buo oh yeah that might that that might sound Vaguely Familiar all I know is that the singer did all of Tim Burton's yeah Danny Elfman Dany Elfman yeah okay awesome that's who's Jenna Elfman's Uncle no way yeah really or wait daughter-in-law something they're's a they she married uh she married somebody in his family okay wow interesting",
            "start": 6379.92
        },
        {
            "text": "Alman, yeah okay awesome that's who's Jenna Elfman's Uncle no way yeah really or wait daughter-in-law something they're's a she married uh she married somebody in his family okay wow interesting that's all I know that good yeah that was the Dynamite Drop in I I thought we were losing you we were losing you with BoS and then there was no I really spaced out I was like I don't know bands it's really I don't really know bands either I just know bands that appeared in '80s movies cuz I love '80s movies a lot all right all right I think we got a lot done here today whether it be Pa Fe freedom of speech Felicia Day's book which is available at Ficbook.com it's good please preorder it means a lot it's a good URL yeah it is yeah we were like well Ficday.com was already taken yeah jerks I mean I took it oh yeah I I tried to get a Snapchat the other day finally I was like no you're way too late on that I bet so late but I I still don't I don't like it is that an old thing to say I mean",
            "start": 6422.48
        },
        {
            "text": "mean I took it oh yeah I I tried to get a Snapchat the other day finally I was like no you're way too late on that I bet so late but I I still don't I don't like it is that an old thing to say I mean that's not an old thing to say there's too many **** things do I can't do it all we we are late on I mean I'm I Snapchat's a whole thing man it's but if you nail it it it'll get na it it Nails you good yeah I tried to get Snapchat yeah when I couldn't get GameOverGreggy was like all I'm not going to do this I didn't either well no I did it a while ago I I probably somebody had already got my which is like what yeah so and then the same thing happened on Tumblr and I tried to get my name there and the girl tried to charge me $10,000 like you know Screw you so I got this The Guild wasn't that successful today and so I have this Foolish Today on Snapchat but I'm like I'm not I'm not going to put effort into that yeah try underscores cuz underscores are just what the cool",
            "start": 6467.44
        },
        {
            "text": "that successful this foolish today and so I have this foolish today on Snapchat but I'm like I'm not I'm not going to put effort into that yeah try underscores cuz underscores are just what the cool people do really I think underscores are terrible they are terrible awkward remember when you tweet @Nick_Scarpino Nick Scarpino Carvin copy all tweets to @Nick_Scarpino as well genius that got everything he got the .com he got the only thing he didn't get was was YouTube he's a really nice guy here here this is this is you're going to have to take some logic leaps with us all right stick with me so yeah Nick's always had this thing about having the underscore and there's this other guy named @Nick_Scarpino who has everything he worked at Google forever and he had he's techy and so whenever people would tweet topics at us they'd accidentally tweet this Nick Scarpino who works at Google and he'd respond he had fun he'd talk about the show every so often and keep on going yeah yeah then now here's",
            "start": 6508.56
        },
        {
            "text": "Nick Scarpino leaves Google to go work at Portillo's, which is my favorite restaurant where I grew up at, and that this dog is named after what the hell and it's like out of all the weird threads in our lives this guy we only know because people mistook him for Nick Scarpino now goes to work instantly bested me again here's what you need to do okay you need to go legally change your middle name to underscore oh my god oh **** and then but just the underscore yeah or do I spell it uh I think you'd have to",
            "start": 6550.12
        },
        {
            "text": "to this is what you need to do okay you need to go legally change your middle name to underscore oh my god oh **** and then but just the underscore yeah or do I spell it uh I think you'd have to spell it okay so you go Nick Scarpino would be your official name yeah and you would best him in every way yeah and it would be cool I like that I like that a lot Tim let's get on this starting Monday I'm now going by would you just call me underscore then yeah that would be your nickname and can we make a lot of cool references like this underscore is my life oh what I don't know really it's endless it's endless a possibility you're a genius that's why you're like a superstar and we are just sort of crowded around you because you have this amazing light it's probably my is that what sleep smells like no it's it's I'll never forget that the horror I had just for a second I was like what what I do",
            "start": 6590.12
        },
        {
            "text": "separated from you because you have this amazing light it's probably my is that what sleep smells like no it's it's I'll never forget that the horror I had just for a second I was like what what I do really awkward I am I asleep and it was his fault it was his it was his take to the camera that I felt the it no I felt something I felt I feel things not in a weird way but I could tell there was something going on behind my back as an actor you always have to be aware of what's going on behind you so you don't miss stuff so I was like I know what's going on over here and then you looked innocent you looked like you wanted to be innocent then I was like it was I didn't do anything so you feel things like mentally as opposed to Kevin who who who feels things with his tongue only his tongue he's like he's like P Kevin it's I know you seriously it's hot oh don't cry come on it's hot Kevin come on he's breaking down you're doing God's Work Kevin ladies and gentlemen that's the GameOverGreggy",
            "start": 6633.92
        },
        {
            "text": "he's like he's like P Kevin it's I know you seriously it's hot oh don't cry come on it's h Kevin come on he's breaking down you're doing God's Work Kevin ladies and gentlemen that's the GameOverGreggy Show each and every week four sometimes five best friends gather on this table each bring a random topic of discussion for your amusement if you like that you can get the show super early on Friday over at patreon.com kindof funny or you can go buy it on bandcamp Vimeo all those things if you don't want to give us any money no big deal you can go to youtube.com/ kindof funny Monday through Thursday where we break the show out topic by topic before posting the entire thing as a video and MP3 on podcast Services yeah so go to iTunes and search for Kinda Funny both of our podcasts will come up there Felicia Day thank you so much for gracing us with your this has been amazing thank you it was really fun I'm going to steal your dog okay that's fine don't worry everybody everybody threatens",
            "start": 6675.68
        },
        {
            "text": "there Felicia Day thank you so much for gracing us with your presence this has been amazing thank you it was really fun I'm going to steal your dog okay that's fine don't worry everybody everybody threatens to take Veronica Belmont's dog many a times she's got a pretty cute dog I know she does yeah her dog is pretty awesome except he's old so Downer how old is the dog he's at least 13 and he can't get up and off the ground very easily and he's deaf and is 10 this summer and he's going blind oh no that's why he likes me he's what sleep smells like uh go pre-order the book Felicia Day has a book.com subscribe to Geek and Sundry yes uh watch The Guild on Netflix or yeah or the YouTubes and I have my own channel Fich Day Twitch everything I'm everywhere and I'm inside you wow well there you go you heard that's the reason to subscribe right there ladies and gentlemen until next time it's been our pleasure serving you",
            "start": 6716.68
        }
    ]
}