{
    "id": 604,
    "video_id": "zrSSn5RUiPg",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "All Items On High! - Smash Bros. Wednesdays",
    "description": "ALL ITEMS ON HIGH!\n\n\nWe quit our jobs, please support us here: http://www.patreon.com/kindafunnygames\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/Tim Gettys",
    "published_at": 1423684801,
    "duration": 867,
    "transcript_chunks": [
        {
            "text": "What's up everybody? We are Kinda Funny Games. And this is another Let's Play here on Smash Brothers Wednesday. I'm Greg. That's Tim. That's Colin. That's Nick. That's Portillo. Tim. Yes? We've been trying to shake up the Smash Bros Wednesdays. What are we doing today? All items on high. Things are getting nasty. I don't like this. How do you pick up items? A. It's been a while for a lot of people here. How do I throw them? L and A together. Ohh. Pressing Z at the same time. But yeah, it's gonna be fun. It's gonna be something right, it's gonna be in Garbage Mode. We're back to Day, day day! The main stage character though see. Hey man! When you invent Coke, that's what you make. You know. When you invent Coke, that's what you make. Invents itself.",
            "start": 0.12
        },
        {
            "text": "You make. You know. When you invent Coke, that's what you make. Invents itself. That's a really great way of putting it Greg. You know what guys? I'm a wordsmith. Trace who did what now? Travis Scott. He's a musician. All right. Oh, that wasn't good for Paul, I'm telling you that much. These items are so far. What? Not treating Colin too well. What the hell was that all about? I think, that was like an eighty Yeah, you just got warp-starred, bro. I just picked up what looks to be a bugle. Like, the food. Yeah, if you get it, it does actually look like that. What, what is it? If you, hold on, got that one thing killing me. What is it? It's a thing where if you get three of them, and then you have the one inch larger. What is happening to me? You're dying, man. NO.",
            "start": 35.59
        },
        {
            "text": "them, and then you have the one inch larger. What is happening to me? You're dying, man. NO. I don't like that. See, here's the thing. What the hell is that thing? Items are really cheap in this game. They're bullshit! You just use them, all you gotta do, uh-oh. Okay. Oh no, I got shrunk! Yeah, why am I small now? What, who did this to me? Got lightning bolted. Who plays like this? What kind of savages? What kinda bullshit is this? Oh, fucking Jesus, wow. That was a good one. I'm getting destroyed. Some sort of Poké Ball. Good news, I got two Bugles. oh, still out of three? That thing looks like it's going to explode. You got some Final Smashes up in this? I don't remember how to use Final Smash by the way. Once I get it, just close to somebody and it'll be. Yeah. Well now it's gone. Good.",
            "start": 75.33
        },
        {
            "text": "\"explode. You got some final smashes up in this? I don't remember how to use Final Smash by the way. Once I get it, just close to somebody and it'll be. Yeah. Well now it's gone. Good. Well not necessarily get close to somebody, well for you yeah. Everybody look out. Yeah, I'm in my little little super. I'm in my little Super Smash Bros. mode. And I'm not really here to . Yeah, you're really, oh, you nailed me. This is a shitty-ass Final Smash. At least it's better than the one in Brawl. Oh, you... Oh, wow. What's wrong with the Diddy Kong? Why can't we just leave- The smasher. Why can't you just leave Kirsten Dunst alone? I didn't know her name. Kirsten Dunst? Yeah. Kirsten. Kirsten. Kristen. Kristen Stewart? It's Kirsten. I said it right, and Greg was like, you don't know her name. But you guessed yourself, didn't you? But you weren't sure.\"",
            "start": 112.44
        },
        {
            "text": "I said it right, and Greg was like, you don't know her name. But you guessed yourself, didn't you? But you weren't sure. Gee. Sounds like whiplash. It's a great scene in the You know a movie, we don't talk about enough, is Eight Pounds with Will Smith. We don't We don't talk about that nearly enough. We don't talk about Will Smith enough. Hashtag at Eight Pounds, Smith. We don't. Did you guys see Will Smith today on the Jimmy Fallon show? No. Doing his whole. The beatbox performance, it was amazing. Uh-oh, Oh, Tim! No. You just escaped. Dude, Nick. Ay yi yi. You just upped Dedede out? Yeah. Oh, I'm out. Look at this, look what's happening. This is the most annoying thing, saw you. I'm so scared of playing like this. I'm so scared. I don't go into it with any confidence, I don't even know what the hell is going on",
            "start": 173.54
        },
        {
            "text": "I don't go into it with any confidence, I don't even know what the hell is going on, With the items? It's a god damn fucking madhouse in here. Go, go, go. Hook it up. Look at that. Oh, oh no. What, the hell? What was that thing? Pokémon, they're all Pokémon. No, not all of them. Why are the Poké Balls so damn powerful? Yeah! Aw, that was the worst. Oh, great. Oh, Nick's still got a life left one life to live. One shining moment! What, how do you? Smash that Did a lot of damage there, unfortunately, oh God. Nick, Nick, you are a crazy man. Oh, what? Who got it? Greg. How did Greg get it? Do I just hit B? Yeah. Like, what? Like. On the ground, you just hit B. Oh, okay. You missed it. You did it in the air. Oh, no!",
            "start": 226.39
        },
        {
            "text": "How did Greg Gettys get it? Do I just hit B? Yeah. Like, what? Like. On the ground, you just hit B. Oh, okay. You missed it. You did it in the air. Oh, no! Jesus, I was like, wait, who's this guy? Ha ha ha! I don't even know who he is. Oh, I think he's a Xenoblade- Tim Gettys, that was you? He's probably poking me, huh? How'd you get the? Oh, one of the- Assist trophy. Okay. Well- got in there and did it. That's that's that was something. Yeah! So, Samus is a special lady. Gotta do one more? She's a special woman. Maybe two more. Yeah, yeah, yeah. Whoever's first to two. Remember, you gotta win. Yeah, we're bringing back the champion series. Oh, we're back in the championships? I was not told that. I feel like we haven't played this game. I would've played harder. In a million years. It feels like it's been a long time. But I'm excited about it. Okay.",
            "start": 284.86
        },
        {
            "text": "All right let's see, let's switch it up, who am I going with? We're doing this still thing with these dumb items? Oh yeah. Who plays like this? In the comments why do you play like this, you play like this. It's actually kind of fun. Umm. If you're a glutton for punishment. Hello pret- . I'll actually choose Garrodon too. Not. Game! Sociopathic penguin killer. Damn. Wait he's a, he kills penguins? Maybe, but he's a penguin killer. So he just kills himself? He's a psychopath. I really hope I'm in this shot. I think I am. Great. I hope so. We'll live dangerously, like we did before with the cord. That worked out in every respect. . Oh, whoa, whoa, whoa, whoa, whoa. Greg, get away from me with that giant lollipop. It shoots tornadoes, Greg, shoot the tornado. Yeah, just like hit B and you'll do your special, shut up. I said I'm a,\n\nNote: I corrected \"garados\" to \"Garrodon\", assuming it's a reference to Garrodon, a character from the Super Smash Bros. series.",
            "start": 327.88
        },
        {
            "text": "Lollipop. It shoots tornadoes, GameOverGreggy, shoot the tornado. Yeah, just like hit B and you'll do your special, shut up. I said I'm a, Shut up. You did it in the air like a lunatic. You gotta stop yelling at people because people think you're serious when you do it. Me? Yah. Maybe people should start taking you seriously. Oh, god, oh god. Oh there's a present guys, I want it. Give the penguin the present. Give him the present. I want a jetpack. What? What do I do with this? God. What just happened? I can't even focus on this game. Guys, someone has to comment and let me know what just happened, because I have no idea. Yeah. What am I supposed to do with this man? Hit things with it. I think I'm shooting tornadoes, what about you? Oh, I can fly with it. Yeah. Pokémon, here we go. What's up GameOverGreggy? Yeah, you stepping to me? Is that okay? Oh! Wow. Man.",
            "start": 371.09
        },
        {
            "text": "All Items On High! - Smash Bros. Wednesdays\nabout you? Oh, I can fly with it. Yeah. Pokémon, here we go. What's up Greg? Yeah you stepping to me? Is that okay? Oh! Wow. Man. Oh, this is good. Don't mind me. Just a penguin. Just a penguin. Oh my God! What was that? Just a penguin. A bomb. It was another penguin, guys. A bomb bomb bomb bomb bomb. I like it when the dunces go. Why am I stuck on the fucking thing? That isn't- Goodbye. I was like, I was stuck on the thing. Yeah. Whatever. Baby. Oh nice, I'm iced. No, that's gonna kill me. Oh, my god Greg. Give it up, you've lost. No I want it. I want the Poké Ball. You got to catch them all. Blender Man, there's Blender Man. I love it. That was awesome. Fuck you Greg. Fuck you Colin. I'm going back to a real system. Shit, who got that? This is the stupidest Final Smash of",
            "start": 411.47
        },
        {
            "text": "That was awesome. Fuck you Greg. Fuck you Colin. I'm going back to a real system. Shit, who got that? This is the stupidest Final Smash of all time. This is kind of boring. Best final smash ever. Oh, come on, you're still in it. Get that, get that top. Get it King, get it. What is this? Oh, are these or whatever they're called. The god damn fucking nightmare, the Nintendo nightmare. Nintendo is actually kind of a messed up place, if you think about it. Oh no, oh no. Ted, you killed yourself? What? What? Here's my boy! What even happened there? I had a Gust Bellow I was going to blow him away. And you blew yourself instead. What do we do now? Do you one on one it? Yes. Decide who the victor is? The one on one. The old one on one it. The old pickle. You're going to get your tickle",
            "start": 485.13
        },
        {
            "text": "pickled. Damn it. I fucked that up. You're gonna get your Tickle Pickle. That's sounded really dirty. All right, here's the thing, last week you kicked my ass when I was Lucina and I was sitting here talking shit. So now I gotta, I gotta bring it back because I fight for my friends. Is she your friend? I fight for freedom! Fight for my- She is my friend. Just click your name. Come on. Here we go. Bionic, bionic This is for the championship. Portillo, don't distract him. Portillo, don't distract Colin. Green, Greens? Now, this is an interesting world, cuz it's two games merged in one. Of course, it's Pokémon Crystal on the right. Uh-huh. And then Mario Sunshine here on the left. Dammit. Oh God. Now Day to Day just tossed out a child. Out of where? And she farted. Get that Pokeball, get that Pokeball! This is of course the girl from Child of Light. Get that Pokeball!",
            "start": 555.91
        },
        {
            "text": "Child. Out of where? And she farted. Get that Pokéball, get that Pokéball! This is of course the girl from Child of Light. Get that Pokéball! She's doing her, she's doing her RPG stuff. Now that guy is over there. Now you got Iceman. I'm a penguin, you fool! Colin's got like, people. He's got like teams of people working. Colin's got a posse. Get that Booby Ball. Why are you giving him it? Party. Do your thing. Boom. Stated there. It's a game. You don't have to play if you don't want to, cuz you're a dog. What if he did play? He'd probably be really good. Shit. He's like an idiot savant. Just wreck shop with it. Ooh,. I caught him, he thought about going in the air and belly flopping on them. I thought about a lot of things, Greg. Man, you got conned right there. I don't think I'm going to kill him at",
            "start": 598.38
        },
        {
            "text": "All. It's, I, I, I'm at a disadvantage when I, when I have to play with multiple, with multiple people. Well without multiple people I should say. Get that Smash. There you go Kyle. We kind of kicked him right into the thing he is going to kill you with. Good job Kyle. Now get up there and hit that thing. There you go Kyle. Because this game's stupid. This Final Smash Up's stupid. I did that on purpose. Aw, I like that you're playing fair. Oh, what? Colin's like fair trade coffee. He's fair. Oh, my God. Oh, no. These 3D items man. There's so many of them on screen right now. Paul's getting them all too. Oh, no, get the Galaga. There you go. That thing fucks your shit up. Yeah, it will kill you. Aw man. Hit that poker chip that blue one. Get out of there! Get that laser gun. He's already got a laser gun! Oh my god. Oh no it's, the King. Double drill. Yeah.\n\nI corrected phonetic mistakes and spelling errors, especially for names (e.g., \"Kyle\" instead of \"Collin\"), games (e.g., \"Galaga\" instead of \"Gallaga\"), and brands (none in this chunk). I also capitalized proper nouns like game titles (\"Smash\", \"Final Smash Up\") and host names (\"Colin\").",
            "start": 652.85
        },
        {
            "text": "All items on high! We hit that poker chip, that blue one. Get out of there! Get that laser gun. He's already got a laser gun! Oh my god... Oh no, it's the King. Double drill. Yeah. Yep, yep. Day to day... Yeah. Get that pow, get that pow, get that pow. Running defense over there. Oh, man. Oh, no. Dedede's own spike ball, you used against him. Using Dedede's own weapons against him. It's a present. That all about. That lady isn't even phased by that thing. Oh, that's from the original... that unreleased Mega Man game, actually. Yeah. What the hell is it called? I can't remember it. Unreleased Nintendo game. It's some like Japanese launch game that never got here, that I like have never even heard of. Oh my God, Dedede! That's it, you're my boy. Damn, he feels revenge for ya'. He's got that Tanuki tail now. You got that Tanuki tail.",
            "start": 698.82
        },
        {
            "text": "That was actually really cute, Tim. Uh-oh, uh-oh, uh-oh. Old punching bag, man. Where, where's the Poké Ball? He is, I think he came out of the Poké Ball. Yeah, Sandbag's one of the most famous Pokémon, surprised you didn't know that. Sandbag and Mr. Sandwich Bag. You put him out there and then Pikachu's just tires himself out punching it. Shit. Yeah, yeah. Once I ate the chicken I felt like I needed it. Here's the thing, I keep winning with her, but in shitty ways. I should be dominating with her, but I'm not. It's the items, man, they're the x-factor. I feel like day-to-day's too. Too slow to play one on one. I don't know really how to use them without- The chaos is what. See, it's the chaos that Day to Day drives in.",
            "start": 770.84
        },
        {
            "text": "without - The chaos is what. See, it's the chaos that Day to Day drives in. It thrives in the chaotic and uncertain situations. He's really the Bane of Smash Brothers. What everyone's focusing on is the- He is the Bane of Smash Brothers. No one cared about Day to Day, until he picked up the hammer. You sure? Yeah. Ladies and gentlemen, that's another Let's Play Here on YouTube/KindaFunnyGames. Remember each and every day, we put up a brand new one. Every Wednesday, it's Smash Brothers. Everyday is Wednesday which is a nightmare. It's like. A complete nightmare. It's all, it's all Smash Brothers, and you're always- So many days You can never get to your favorite coast for the weekend. The weekend is always an endless runner. For the weekends I would like that cuz I like to work",
            "start": 803.23
        },
        {
            "text": "You can never get to your favorite coast for the weekend. The weekend is always an endless runner. For weekends, I'd like that 'cause I like working with you guys. And that would mean we get to work together every day until one of us goes crazy. I'm getting pretty crazy. Yeah. I think today's the tiredest all of us have been. Yeah. When it comes to, like, we have a lot more to do. So much more. It's not bad. Whatever, we'll be all right. Ladies and gentlemen, thank you for your support. Until next time, it's been our pleasure serving you.",
            "start": 832.98
        }
    ]
}