{
    "id": 989,
    "video_id": "72n81hjlZO0",
    "show_name": "Gameplay",
    "hosts": [
        "Nick Scarpino",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "Shantae PS4 - Kinda Funny Plays",
    "description": "Colin and Nick play Shantae on the PS4.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1435950000,
    "duration": 1094,
    "transcript_chunks": [
        {
            "text": "Greetings and salutations, welcome back to Kinda Funny Games. My name is Colin, this is Nick. Today, Nick, we're going to play a game called Shantae: Risky's Revenge Director's Cut. I feel like Tim should be in this because this looks more like a Disney Princess game, uh, which is right up his alley. It is right up his alley, but you know what? He's not here, so F him. I mean, he's in the other room. F him. He's in the other room. Otherwise, he can go and F himself with his perfect little effing hair and that tight little effing thighs of his. He has tight, tight thighs. I know that. Jesus, they're tight. Um, so Nick, to catch you up, there's a few things you should know about this game. I haven't played this one yet, so this is uh, Risky's Revenge that originally came to uh, DSi, is that why it's in 4:3 with the exactly back in like 2010, and then it was, you know, so it came to PC, um, last year, I think, and now it's coming, it's on PS4, playing on PS4 right now. Oh God, so uh, the reason that I wanted to play",
            "start": 0.08
        },
        {
            "text": "the exactly back in like 2010, and then it was, you know, so it came to PC, um, last year, I think, and now it's coming, it's on PS4, playing on PS4 right now. Oh God, so uh, the reason that I wanted to play this with you and that I thought it would be a lot of fun, even though I'm just like not doing very well, um, but I'm trying to talk, is that it's a WayForward game, and I have a great deal of respect for WayForward. Why is that? Uh, WayForward is uh, a studio with a lot of like an old school kind of pedigree. Okay. And uh, this game, believe it or not, was produced, you know who produced and directed this game? It's someone you might know. Mark Bozon's brother. No way. Matt Bozon. Matt Bozon. The Bozon family, multifaceted indeed, because Mark can write. Mhm. He can, he can, he can write like crazy. Now he works at Apple. Now he does indeed, probably not writing. Um, so I wanted to just show this game off because I thought it was fun. So Shantae is a character. Shantae originally came out, the original Shantae in like 2002 was a",
            "start": 39.84
        },
        {
            "text": "now he does indeed, probably not writing. Um, so I wanted to just show this game off because I thought it was fun. So Shantae is a character. Shantae originally came out, the original Shantae in like 2002 was a Game Boy Color game, and ever since then, she's kind of been like an obscure but beloved character, like a cult classic kind of character. She attacks with her hair, as you see there. So there's this gentleman here. What's he doing? Should we try to talk to him or nah, just punch him. Hi, Shantae. Shantae. Oh, he's trying to get in those. He's trying to get a little extra something something. You think so? I mean, look at his arms. No guy that wears a muscle t-shirt and a headband is not trying to have sex with you. Just want you to know that. That's **** up. Like, why is she stand like, so what does she want me to, what did he, what did he just say to me? I wasn't even paying attention. We can't go without Sky's egg. Didn't you take a swim for it yesterday? Thank you for the tip. So I get",
            "start": 86.56
        },
        {
            "text": "what does he want me to do? What did he, what did he just say to me? I wasn't even paying attention. We can't go without Sky's egg. Didn't you take a swim for it yesterday? Thank you for the tip. So I get, let's just go down here. Oh, now normally you would die. Exactly. But this is a kind of a, this is kind of like a Metroidvania-style game. Okay. So we'll see if we can swim around. I don't know if I can. Can I go underwater? I'm pressing all the buttons. X would be the jump, obviously. I don't want to jump. Circle looks, that's cool. Can you keep going? Can you go all the way under there? Go all the way under. You dive down. How, how, how would one do it? That's the question. How would one do it? That's an interesting question. I'm not sure we can answer it. I'm trying to figure it out. What would you think? All right, so I'm in the water here. I would think you would use that, that buoyancy to go underneath the rest of the bridge. Try. Let's try. Nope, not working. Can't do that. Not working. Square button, nothing. Triangle, nothing.",
            "start": 129.8
        },
        {
            "text": "the water here. I would think you would use that, that buoyancy to go underneath the rest of the bridge. Try. Let's try. Nope, not working. Can't do that. Not working. Square button, nothing. Triangle, nothing. Circle, nothing. X button lets me jump. The triggers don't do anything. The D-pad just moves me around. The analog sticks don't do anything. This can't possibly be the place that I need to be. Okay. Can I go back in? Can I, oh, okay, I can maybe go that this way. All right, so let's see. Can we, can I, so now I can't jump up there. These people are just, look at this fish. Look at him. What a dumbass. All right, there we go. So we're going this way. There's got to be something. There it is. There it is. It's how we miss that. Well, what I'm concerned about is that the guy's like, did you, you went swimming for it yesterday. Well, that would indicate to me, you stupid son of a ****, that I have to go into the water and swim for it. But thank you for that useless Castlevania-style tip you gave me. Not even useless, misdirecting.",
            "start": 168.44
        },
        {
            "text": "that would indicate to me, you stupid son of a ****, that I have to go into the water and swim for it. But thank you for that useless Castlevania-style tip you gave me. Not even useless, misdirecting. That was just straight up misdirection. Arms Milady. I'm going to call him Jason McArms. The animations are really cool, by the way. I like how she puts her arms down. I like, I like the uh, the, the uh, rippling of the pants as the wind hits it as she falls. Why does she stand like that though? That's my question for you. Why is she all hip-hop? She's 100% hip-hop. Tell, can, can you tell her next time you see her, maybe be 90% hip-hop? Sure. Leave 10% for God. I'll uh, yeah, sure. I can, I can let, next time I see Shantae, I'll definitely let her know about, you know, next time she blows up your cell phone, just be like, Nick's got a little problem with the way you're standing. Your, your idle screen is a little not idle, you know what I mean? Oh, no, no, no. Usually that kind of stuff would happen if you didn't touch the, the",
            "start": 216.64
        },
        {
            "text": "got a little problem with the way you're standing. Your, your idle screen is a little not idle, you know what I mean? Oh, no, no, no. Usually that kind of stuff would happen if you didn't touch the D-pad for like 30 seconds, right? And she would be like, she'd be like, what are you doing? What's happening? Why aren't you controlling me? Look at this **** son of a ****. Hey, bro. Atkins. All these bats. He probably is on an Atkins diet. He doesn't mean, he probably eats a lot of fish. That's probably true. Seen a loaf of bread in decades. He's like, all I have is this fish. I don't know how I'm fat. I get the good Omega-3s. All right, so we're going, should we go in here? See what's going. Not, oh, who the hell is this? He's telling some sorry story. I do like this new like slick art that they put over it. The stuff new. Oh, it has to be. I mean, I couldn't imagine that that would look like that on DS, but maybe, maybe not. I mean, it's just the JPEG, right? Sure. I'm not, I don't know for sure. All I know is that I like this",
            "start": 260.04
        },
        {
            "text": "oh, it has to be. I mean, I couldn't imagine that that would look like that on DS, but maybe, maybe not. I mean, it's just the JPEG, right? Sure. I'm not, I don't know for sure. All I know is that I like this character, particularly the parrot. Oh, I didn't recognize the parrot. I was too busy looking at her chest. That's really not very nice to say. I apologize, everyone. I meant what she's wearing because her ensemble is very stylish. It is very stylish. Yes. My War Bird hatchlings literally flew the coop, all besides Wrench here. Wrench is the pirate, or the parrot, not a pirate. Do you have my egg? Yes, there's my boy. I just want to fight some ****. Yeah, can, what's up? Hey, Shantae. Yo, you better have, oops, it's time. Who is this? What's with the, the mad scientist here? Yeah, who is this gentleman, this young man? I like how there's like no room for text at all on the screen. Yeah, as usual, we'll kick off the festivities by cracking open a fossilized treasure and offer the contents up for auction. That sounds like a great",
            "start": 302.4
        },
        {
            "text": "there's like no room for text at all on the screen. Yeah, as usual, we'll kick off the festivities by cracking open a fossilized treasure and offer the contents up for auction. That sounds like a great idea. This year's mystery object appears to be encased in solid stone, but feels quite hollow. Should I smash it open? Yeah, dude, smash it. Why would you do that? It's, it's a priceless artifact. I think you should smash the **** out of it. Smash it. Genie, Genie in a bottle, like Christina Aguilera. Yeah, exactly like her. In fact, I believe that's where she took some of her costume cues from. Early Aguilera, for sure. Remember early Christina, Christina Aguilera? Yes, I do. Yeah, yes, I do. Who could forget? I remember early Christina Aguilera coming on the scene right after early uh, Britney Spears. It was like 90s-ish. What on scene? And you were like, what is happening? Don't tell me. I just want to experience it. Then a little bit later, uh, who's the Latin girl? Shakira. Shakira. Oh yeah. Oh my God. And you would have next-level a lot of theoretical",
            "start": 358.32
        },
        {
            "text": "were like, what is happening? Don't tell me. I just want to experience it. Then a little bit later, uh, who's the Latin girl? Shakira. Shakira. Oh yeah. Oh my God. And you would have next-level a lot of theoretical discussions in your brain at night as to which one of those women you would like to share your bed with. And who was your choice out of those three young women? To be perfectly honest, if I'm being 100% honest with myself right now, I gave it to Britney at the time. At the time. Yeah, there was something about Britney, wasn't there? That school-out, that schoolgirl outfit. It was the, it was the fact that it was, it was an age of innocence for me in a lot of ways. I did not know a person could fall from grace so, so far. But Brit, oh my God, she fell. Remember when she hacked all her hair off and like was caught in the hotel room like duct taped to the ceiling? No one even knows how she got up there. I made that last part up. She went crazy for a while. Who was the guy that she married for a little",
            "start": 405.16
        },
        {
            "text": "was caught in the hotel room like duct taped to the ceiling. No one even knows how she got up there. I made that last part up. She went crazy for a while. Who was the guy that she married for a little while? Kevin Federline. Kevin Federline. K-Fed, right? K-Fed. And then he got really fat and tried to be a rapper. And now he's just a really good dad from what I hear. I, I'll, you know, I don't hear anything to the contrary. Where do you hear, where are you hearing this? Mostly The Superficial.com, which is my favorite website on the planet. Is that a real website? It is very much a website. So it's like a gossip website. Yes. Uh, but the guy that writes for it is singularly unique talent. He's really funny. It's just one person. I believe it's one guy. He doesn't update that much. Most of the time, most of his uh, his updates are galleries, and I think those are contributors. But for the most part, all the captions are written by him. You can tell he's got a very distinctive style. It sounds like a Perez Hilton kind of, it's",
            "start": 450.64
        },
        {
            "text": "are galleries, and I think those are contributors. But for the most part, all the captions are written by him. You can tell he's got a very distinctive style. It sounds like a Perez Hilton kind of, it's very Perez Hilton. It's a little bit more highbrow than TMZ, uh, or the Egotastic, which I think both of those have become pretty much porn-y at this point. Sure, sure, sure. Oh God, what is this? What is this? Whoa, Lock and Load, men. Oh jeez. Well, who are those little, little pirates? Pirate gentlemen. It's time for Risky's Revenge. So let's attack aggressively. All right, do I have to fight this thing? I don't think he wants you to dance with him. Get up in that. Get up in that, guys. Girl. Oh, that's how, oh, okay. Well, why would you have that barrel in your, in your mouth? Doesn't make sense. Oh God, is he jumping? I feel, oh God, we should also press that we can't hear what's happening. No, I can't hear anything. Not really paying attention to anything that's going on. We probably could turn the TV up, but why would I want to do",
            "start": 488.2
        },
        {
            "text": "we should also press that we can't hear what's happening. No, I can't hear anything. Not really paying attention to anything that's going on. We probably could turn the TV up, but why would I want to do that? I don't know. Kevin, can we turn the TV up a little bit? I'm on camera right now. That was pretty awesome. Kevin was like, are your fingers **** broken? I'm sorry. In the same sentence. Yeah, yeah. I'm tired. Cause he realized that that was, that was disrespectful. The remote control is right in front of you. Kevin, I can't, I can't, I don't know. It's upside down. There's a whole, there's no audio. Okay, that troubles me a little. Did you try these? Is there audio in there? There's half a second of delay though. It's fine. We've gone this far without needing audio. There's another scantily clad person. I think that's their style. I feel a little bit bad. Well, it looks like it's a warm climate. It is a tropical climate. You can tell by the, the, the tree behind her with the coconuts. What are they called? Pine trees? Nope.",
            "start": 537.76
        },
        {
            "text": "their style. I feel a little bit bad. Well, it looks like it's a warm climate. It is a tropical climate. You can tell by the, the, the tree behind her with the coconuts. What are they called? Pine trees? Nope. Palm trees. Palm trees. Excuse me. This guy again. Yeah, who is this man? He doesn't even have a face. Yeah, he does. It's fine. Kevin, at this point, it's, we're almost done with this. Let's play. So you can just, you going to **** off? No, I don't want you to. You're dismissed. You're dismissed. I don't like being dismissed. I'm, I'm going to go. You're dismissed. Just check on that Leather Man. Make sure you get it. Should be coming today. I'm glad. Who, look at this **** guy. Where's your nose, bro? Bro, where's your nose? Jesus. Oh my God. You know what I mean? Buck tooth, overweight, gray hair, probably bald, bad jeans. He the mayor. He's the mayor. This guy's the mayor. Clearly the election was rigged. I'm going to go out on a limb and say that they did not elect this guy, or he was unchallenged. Yeah, there's something some",
            "start": 591.16
        },
        {
            "text": "the mayor. He's the mayor. This guy's the mayor. Clearly the election was rigged. I'm going to go out on a limb and say that they did not elect this guy, or he was unchallenged. Yeah, there's something some ballot stuffing going on. Yeah. Mhm. I'm just going to leave it there. Yeah, some got stuffed. And that's my final word on the matter. I'm not even paying attention to anything you're saying, you doofy looking ****. Get off the screen. Yep. Now Portillo is coming in here. Get out of here, Portillo. No one likes you, Portillo. I like you, Portillo. Come here, buddy. Come here. Come here, buddy. Hi. Hi. What is it about the lamps? Second, there's so much exposition in this game. Yeah, it's a lot. I did not expect it. I'm, I just got to go. Just let me do what I got to do, please. So we're going, there's some birds. There's a little island in the background. There's a fat guy that's on the Atkins diet. I'm back in here. Oh my, look at this woman. Look at her. Let's take a, she's something. Oh, she doesn't have, she doesn't have JPEG. He want",
            "start": 640.96
        },
        {
            "text": "in the background. There's a fat guy that's on the Atkins diet. I'm back in here. Oh my, look at this woman. Look at her. Let's take a, she's something. Oh, she doesn't have, she doesn't have JPEG. He want to go, he wants to go your lap. Do you want to come to his lap? You know, I prefer you did right here. Who, who's this? You've got to accessorize. Get some silky cream for that hair. Gives your hair a full body and repairs split ends. I, I get my hair is that looking so good. I just want to find like something to really so we can adventure a little bit. Yeah, I'd like to go out and adventure with you if that's a possibility. Uh oh, is that a boss battle? No, I'm good. What, look at that guy. This guy up here. Yeah, or this, this, that dude. This guy, the Jawa. What's going on with him? I don't want to say anything to you. I realized I can press Start to just skip everything. Yeah, let's do that from now on. So let's see, we can go up here. Oh, what's up, lady? I don't know. I'm just with those hips. There's that guy again. What is the",
            "start": 692.36
        },
        {
            "text": "I can press Start to just skip everything. Yeah, let's do that from now on. So let's see, we can go up here. Oh, what's up, lady? I don't know. I'm just with those hips. There's that guy again. What is the, no, smash me. What does that mean? I think he's protesting. What are you protesting, sir? Well, I don't think he wants to fight anymore. I don't think he wants to be a warfaring clan anymore. I think he'd like a normal job with an honest pay. You know what I mean? Sure. I respect that. I respect the **** out of that man. I'll tell that right now. Now, okay, so now I'm in the, so I'm back in the foreground. Can I go in the background? Oh, so there's more to be had here. This guy is just standing here looking like a drone. He's, okay, so, yo, old out there. I won't let you leave before visiting the save guy. He's back in Scuttle Town Square, left. Save smart. Okay, you got to save first. So let's, let's do that. Scuttle, what is it? Scuttle Town Square. Why can't I, you got to go up to go out. Yeah, I don't like that. There, there you go.",
            "start": 743.56
        },
        {
            "text": "Town Square, left. Save smart. Okay, you got to save first. So let's, let's do that. Scuttle, what is it? Scuttle Town Square. Why can't I, you got to go up to go out. Yeah, I don't like that. There, there you go. Right there. This is in Scuttle Town Square, is it? Is save guy, kid. All right, I'm going to go in here real quick. Thanks for that. Thanks for that. That, is this guy? Yes, we found him. Save complete. Bye, old man. How can he see over that desk? He can't. I can't. All right, so now let's go talk to this son of a **** again. Let us out, home slice. Oh, just walk. I don't have any time to talk. No, I don't care about anything you any say. You guys look like, oh, Lilac Fields, mildly stupid human beings. The game's fun. I enjoy it. Does this game interest you at all? It does. It looks fun. I don't think I have the skills to go here. And this is where I think the Metroidvania kind of like backtracking comes into play. Yeah. How does it control? It feels fun. Yeah. Left or right on the D-pad. X to jump. Or you can press down and",
            "start": 794.32
        },
        {
            "text": "go here. And this is where I think the Metroidvania kind of like backtracking comes into play. Yeah. How does it control? It feels fun. Yeah. Left or right on the D-pad. X to jump. Or you can press down and jump to jump down through platforms, you know, platforms. It feels fairly Square to attack. Uh, solid. Like you're not sliding around at all. No, very solid. It's good. What is that big thing? Greetings, stranger. I'm what they call a warp pedestal. It's my job to zap folks from place to place. I like to help you out. Okay, that's nice. Fair enough. That's useful. It's quick travel. That's very useful. Tom Happ, maybe you should be watching that. Put that in Axiom Verge too. Axiom Verge didn't have quick travel, right? I know it, it didn't. Well, did it? It did though. It had like a rail system, one of the big things that would take you across the world. But it needed a quick travel. I'm still waiting for it to come to Vita before I really, really, I play, I played for almost 10 hours, but you didn't beat it yet. No, I, I want to play it",
            "start": 853.2
        },
        {
            "text": "you across the world, but it needed a quick travel. I'm still waiting for it to come to Vita before I really, really, I play, I played for almost 10 hours, but you didn't beat it yet. No, I, I want to play it on. I, why are you here now? How did he get over here? It took us 14 minutes to get over there. He knows something we don't. Special about this guy. This guy, this guy is doing it. That dude in the background. Hello, I'm a tough guy. Look at me back here. All right, let's see. Oh yeah, I like the uh, the jumping in between. I think it's kind of cool. It gives that parallax scroll an added dimension. You're actually going to go back there and handle your business. It's pretty cool. It's, it makes the game, this reminds me of Castlevania II. It, it uh, gives the game a little bit, yeah, added dimension, pardon the pun, but also it can be a little confusing. Probably no ****. It reminds me, Mutant Mudds uh, on 3DS does this too. On Vita. Oh my God, who's that? I feel like, is there like a beat that we're not hearing? That's why everyone's",
            "start": 897.6
        },
        {
            "text": "can be a little confusing. Probably no ****. It reminds me, Mutant Mudds uh, on 3DS does this too. On Vita. Oh my God, who's that? I feel like, is there like a beat that we're not hearing? That's why everyone's dancing. I don't know. Hey, Snack Attack. Who's this? Who's this lady? You stole me a brain. You know what the **** does that mean? Rottytops. Yeah, well, something, something. We've been doing a wagon tour sampling the local cuisine here. You have got to try one of these. It's a dog. Eat it. Just eat it. I won't tell anyone. I won't tell if you don't tell. This is someone's pet. Put it back where you found it. He, yeah, everyone's like moving very dramatically in this world. Very dramatically. They're moving like they're on E or some sort of other illicit. I don't know how I feel about it. Feel, but I don't know. This is not my world. This is Shantae's world. What Shantae wants, Shantae gets. All right, I'm skipping this whole thing. I don't feel like talking to you anymore. But can I go in your wagon? I can't. And there's, you have a",
            "start": 946.92
        },
        {
            "text": "my world. This is Shantae's world. What Shantae wants, Shantae gets. All right, I'm skipping this whole thing. I don't feel like talking to you anymore. But can I go in your wagon? I can't. And there's, you have a skeleton horse. So I got to go now. No, I can't go out this way. Nick, have we seen enough of Risky's Revenge? I think we have. I think this is a good sampling of it. We got a good sort. It's a fun little game. Cross-section of it. You know what I mean? I'm enjoying it very much. I think it's an a very, uh, it's a very interesting game indeed. This was fascinating. Only you would know about this game and want to introduce me to it. Yeah, I feel like, I feel like the people out there should be introduced to Shantae if they're not already familiar with her. This particular game can be found, I think it was on DSiWare, but I'm not sure. And then it came out on iOS. It's on PC. It's now on PlayStation 4. I think the trophy list indicates it might be coming to Vita, but I'm not sure. I feel like it, a lot of things might not be",
            "start": 999.48
        },
        {
            "text": "I'm not sure. And then it came out on iOS. It's on PC. It's now on PlayStation 4. I think the trophy list indicates it might be coming to Vita, but I'm not sure. I feel like it, a lot of things might not be coming to Vita now that we're maybe going to come to Vita. Um, but we'll wait and see. But in the meantime, you can play it on iOS. You can play it on your DSi. You can play it on, um, your PS4 and your PC if you so desire. So this is Shantae: Risky's Revenge. And we are Kinda Funny Games. Thank you for joining us. We hope you had a nice time and got introduced to a game you might not have heard about or maybe just wanted to see a little bit of. Here's that gentleman again. He's protesting in the woods now, sir. No one is here to hear your protest. No one's, no one's fighting you, bro. We're not touching you. Go get a job. Yeah, now because now I feel like he's pushing it. Yeah, go get a job now. I want to fight him. No, can't fight him. All right, thanks for joining us. I'm Colin. That's Nick. We'll see you next time.",
            "start": 1041.16
        },
        {
            "text": "get a job. Yeah, now because now I feel like he's pushing it. Yeah, go get a job now. I want to fight him. No, can't fight him. All right, thanks for joining us. I'm Colin. That's Nick. We'll see you next time. Goodbye.",
            "start": 1078.4
        }
    ]
}