{
  "id": 1061,
  "video_id": "88W_5NKSzfY",
  "show_name": "The GameOverGreggy Show",
  "hosts": [],
  "title": "Awesome Joker Fan Theory - The GameOverGreggy Show Ep. 86 (Pt. 2)",
  "description": "Tim Gettys asks Greg to explain an awesome Joker Suicide Squad Batman v Superman theory.\n\nHere's Angry Joe's take: https://www.youtube.com/watch?v=wEY6dv5AKMU\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1438066801,
  "duration": 1487,
  "transcript_chunks": [
    {
      "text": "Today's episode has been brought to you by Loot Crate, the subscription box for the gamer, geek, and/or nerd in all of us. For less than $10 a month, you get six to eight items of gamer and pop culture licensed gear, apparel, collectibles, unique one-of-a-kind items, and more. Make sure you head over to lootcrate.com/kindafunny and enter the code KindaFunny to save $3 on any new subscription. Remember, you only have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate. And when that cut off happens, man, that's it, it's over. So go to lootcrate.com/kindafunny and enter the code KindaFunny to save $3 on your new subscription today. It's a circus of values, Tim. Yeah, what's your topic? My topic, Greg, earlier today at lunch, we were talking, we were eating, we're doing all this stuff. You brought, do all those things at lunch, things at lunch, yes. And uh, you brought up this Joker fan theory, right? Going on about The Suicide Squad movie and about the DC Universe as a whole, yes.",
      "start": 0.04
    },
    {
      "text": "stuff you brought, do all those things at lunch, things at lunch, yes. And uh, you brought up this Joker fan theory, right? Going on about The Suicide Squad movie and about the DC Universe as a whole, yes. Mm, and how the Joker fits into it and who he might be and all this stuff. It sounded really interesting and I don't know anything about it, okay? 'Cause I was working during lunch. It's also something I do. That's, you're using the word working liberally. You're working liberally. I want you to explain this to me. All right, so ladies and gentlemen, if you didn't know, I'm a big DC Comics fan. We've, this is third week in a row where we've had some a DC Comics movie topic, which makes me incredibly happy with my life. But what happened is uh, last week on Reddit, a user posted a theory about who Joker was in the Cinematic Universe and people tweeted at me a whole bunch about it. Have you read this? Have you read this? And I was like, it sounds interesting. I read, I'm like, it's interesting, I like it, but whatever. And",
      "start": 57.48
    },
    {
      "text": "Universe and people tweeted at me a whole bunch about it. Have you read this? Have you read this? And I was like, it sounds interesting. I read, I'm like, it's interesting, I like it, but whatever. And then Angry Joe did a video about it today. Shout out to Angry Joe, go watch it, where he went through and showed his friend about it. And when I saw like that, I'm like, well, I should present it to my friends too. You guys, of course, and of course, the best friends watching. So we are the best friends you've ever had. Hey, Greg, I'm your friend. So it's Colin and Tim and Kevin. Tim, well, don't throw Kevin there. We don't need to include Kevin. We're being nicer to each other. We talked about that. We're being nice to each other. We never said anything about Kevin. If this was a cigarette, I'd take a drag and I go looking at him like that, right in his crotch. He'd burn his crotch. Oh my God. All right, so we, we're starting here and there will, I'm going to eventually move into one spoiler for Batman: Arkham Knight, one spoiler for Batman.",
      "start": 98.16
    },
    {
      "text": "him like that right in his crotch. He'd burn his crotch. Oh my God. All right, so we, we're starting here and there will, I'm going to eventually move into one spoiler for Batman: Arkham Knight, one spoiler for Batman. It's not be read in here, but I will get to it soon. We will do the whole head pat thing where I turn it on, give you my Arkham Knight spoiler, and then head tap it off. Nope, that's now you're confusing them. Maybe they just turned it off, they don't even know what that means. So this one comes from fan theories over on Reddit. JasonDG169, all right. Um, 69, 69, 69. Jesus. Go, let me preface this by saying this theory has been around for a while and I just want to go a bit more in depth. Also, I love, love the Joker's look, so this theory is not some excuse because I dislike the design. The Joker we're going to see in Suicide Squad is Jason Todd. Everybody familiar with Jason Todd? Yes, you. Rick Todd's brother, second Robin. Sweeney Todd's brother, second Robin. He took over after Dick Grayson in traditional canon.",
      "start": 136.44
    },
    {
      "text": "in Suicide Squad is Jason Todd. Everybody familiar with Jason Todd? Yes, you. Rick Todd's brother, second Robin. Sweeney Todd's brother, second Robin. He took over after Dick Grayson in traditional canon. Killed by The Joker, beaten with a crowbar. When was he, when was he The Demon Barber of Fleet Street? I hate you. I'm making Broadway jokes now. Sad as I get them all. Johnny Depp jokes. Uh, beaten with the death by the, by The Joker and Death in the Family. He came back and he was Red Hood, running around doing that thing and stuff. Um, I know what you're thinking, that's kind of lame. The Joker is The Joker, not Jason. My theory consists of number one, the newspaper with the 'you let your family die'. We saw this in the Batman v Superman trailer, right? Where we looked at it and said, oh, well, it's, you know, somebody writing in because the Wayne, the Wayne building got destroyed in Metropolis and those people die. Of course, it would make sense if Jason's doing that, calling out the fact that number one, he's a failing.",
      "start": 185.6
    },
    {
      "text": "riding in because the Wayne, the Wayne building got destroyed in Metropolis and those people die. Of course, it would make sense if Jason's doing that, calling out the fact that number one, he's a failing. And then that beyond that, and it was also, it looked like it was the Joker writing, right? It looked like that's that, that scrawled out, messed up, scratched out Joker writing. Next piece of evidence, the Robin suit in the memorial inside the Batcave. Another part of the Batman v Superman trailer. That Robin suit that says 'Ha haa, jokes on you'. And then this Joker looks very odd and completely different from what we're used to. It is probably just a design choice, but it could be because Jason is the Joker and does things his way. This theory now goes into a whole bunch of in-depth, but it, we'll just go around because you don't need to do it, right? Jump around a bit. What I like about the theory is there's a whole bunch of interesting things in it. The Robin suit inside the memorial Batcave, 'Ha haa, jokes on'.",
      "start": 236.0
    },
    {
      "text": "because you don't need to do it, right? Jump around a bit. What I like about the theory is there's a whole bunch of interesting things in it. The Robin suit inside the memorial Batcave, 'Ha haa, jokes on you, Batman'. What's interesting about it is that looks like it would be fresh, right? That like, why would Batman, Batman always has the suit up for Jason Todd in, in, in the glass case that, all right, this is, you know, we're going to honor Jason's memory, this Robin who passed away or whatever, beaten to death. Um, this would imply that he, I don't think he would keep it up if it was defaced from the get-go. So was, is it toac in this movie? Is it toed in the timeline we're dealing with, right? And if so, how would the Joker know how to get in there when Joker then know that Batman is Bruce Wayne? Is it not that I know anything about, possible that it's a reminder of his hatred or like how he's, that's the target and so that's always been the condition of the super. It's very possible that that's the case. It just",
      "start": 271.16
    },
    {
      "text": "know anything about, possible that it's a reminder of his hatred or like how he's, that's the target and so that's always been the condition of the super. It's very possible that that's the case. It just seems out of character from what we've ever seen before. It does seem like a disrespecting Jason more than disrespecting Batman, but it could be a motivational factor. I agree with that one. That is, that's, that's how I wrote it off my head, that it was there to keep him motivated. Yeah, I don't think that's too crazy to to assume. I, I would think it, I wouldn't imagine that that was a fresh thing that just happened. Sure. Next, the 'you let your family die' thing in the newspaper. I like, I, that makes sense to an extent, 'cause why? Because, you know, very few people outside of us refer to their, their co-workers as family, right? I don't think that's a normal thing. And so unless there's Dominic Toretto, does it? It's true. There's been theories, of course, that the girl Bruce is running up to in the trailer is actually his",
      "start": 309.08
    },
    {
      "text": "family, right? I don't think that's a normal thing. And so unless there's Dominic Toretto, does it? It's true. There's been theories, of course, that the girl Bruce is running up to in the trailer is actually his daughter. Maybe then his wife dies in the building. May, you know what I mean? Uh, there's been theories that may, yeah, the paper with a scrawl on it is just some deranged family member blaming him for the death. But why would you blame what? He opened a Wayne Enterprises building in Metropolis, so now he's liable for everyone getting crushed by a bunch of superpowered heat vision dudes? That doesn't make much sense. Jason using it against him would make sense, especially with the same kind of scrawly handwriting, right? This is interesting because without knowing this theory, at least those two things you said, I didn't think of it the other way. Yeah, I thought of it this way, right? Like from the get-go, like I didn't think of it being the family dying in the building. I thought of it as some Joker ****, yeah.",
      "start": 345.8
    },
    {
      "text": "I didn't think of it the other way. Yeah, I thought of it this way, right? Like from the get-go, like I didn't think of it being the family dying in the building. I thought of it as some Joker ****, yeah. Yeah, okay, okay. So why, how, but again, how would Joker know that Bruce is Batman? Or is Joker is writing to Bruce Wayne and saying, 'Ha, you let your family die'? See what I mean? Like, what's his motivation there? Like, that's the thing is like, I can make a million assumptions and reasons for all these things and like, oh, that, but I don't have the motivation for them. Well, maybe the Joker knows, but he's the Joker, so he's not going to tell anybody. You know, there's been storylines like that, like even the current Batman run where he knows it's Bruce Wayne, but he's not telling people 'cause that's not what it's about. Yeah, yeah, exactly. Would I have another qu, I have a question. If Robin suit with Joker's text is on, is in the, the capsule in that's in the Batcave, presumably, wouldn't, if, if the suggestion is that",
      "start": 383.6
    },
    {
      "text": "about, yeah, yeah, exactly. Would I have another qu, I have a question. If Robin suit with Joker's text is on, is in the, the capsule in that's in the Batcave, presumably, wouldn't, if, if the suggestion is that that's fresh, then Joker somehow broke in to do that, right? Then wouldn't he know that Bruce Wayne was Batman? Yes, this is what we're talking about. No, I know. So like, but I guess I'm just not understanding necessarily why wouldn't he just blow that up? But he's the Joker. Yeah, like that's not the point. I guess that's, I mean, that's the thing is like, I, in that would be like a huge, that would be a big, that I feel like, I feel like on this, we're getting one of the reasons why I, I don't think that this stuff is a reality is because there's just, this is too hard to tell in a story that's really about Batman v Superman and Lex Luthor. But here's the thing I think we're all overlooking in a lot of ways, and I think I overlook too, and that the theories makes very, very interesting is the fact that, yeah,",
      "start": 421.24
    },
    {
      "text": "versus Superman and Lex Luthor. But here's the thing I think we're all overlooking in a lot of ways, and I think I overlook too, and that the theories makes very, very interesting is the fact that, yeah, this is a lot to tell in, to drop into Batman v Superman, da da da da. What is if the Joker is not established? What if, I mean, like, 'cause here, like, let me, I mean, like, let me, so you see, let me go. He's new. Here's the way the theory, here's the way the theory is built on, right? That if Joker is Jason Todd, right? And this is where I'm going to pat my head and give you the Arkham Knight spoiler here, so stick out of it for a second. All right, I'm going to rub my tummy. Arkham Knight, of course, does this thing. If you, you've beaten it now, right? Uh, no, I'm not to the end, but I know what happened, so you can, okay, cool. And so you've beaten it. I'm talking where I'm going with this. They have the whole great flashback scenes of Joker torturing Jason Todd and making him crazy and making him fall in line and think like",
      "start": 466.64
    },
    {
      "text": "and so you've beaten it. I'm talking where I'm going with this. They have the whole great flashback scenes of Joker torturing Jason Todd and making him crazy and making him fall in line and think like the Joker, reprogramming him, exactly, reprogramming him to be this, you know, killing machine out to stop Batman, to do all these different things. What's awesome is at one point, you know, he brands Jason Todd, puts a J underneath his tear, which Leto's character has. Leto's Joker has a little branding J on his face, which now, as **** up as the rest of the **** is on him, whatever, no big deal, right? But like, the theory goes into the interesting points of like, the branding, interesting. Obviously, his teeth are all **** up, right? And we think it's just because he wants to have grills or whatever. What if he got his teeth **** beat the **** out of him with a crowbar, then put his on there? The damage, ****, all the stuff written on him is this young kid re-released into the wild, totally out of his",
      "start": 507.8
    },
    {
      "text": "he got his teeth **** beat the **** out of him with a crowbar, then put his on there. The damage, ****, all the stuff written on him is this young kid re-released into the wild, totally out of his, out of his mind. Now, the story, I'm going to unpack my head now. Okay, so let's not talk about, let's not talk about the Batman: Arkham stuff anymore. Okay, I'm un-patting my head now. We're done with the Arkham Knight spoiler there. The theory that goes into this, right, is the fact that in this world, Batman v Superman, let's say Batman beat Joker already. He didn't kill him, obviously, but his story wrapped up and we, he knows he's dead. Joker's dead. You know, we saw the body. I know how this is, da da da da da. And then he gets the paper and opens it up and 'your family's dead' and that Joker scrawling. He's like, 'What the ****?' You know what I mean? Because it looks like Joker's handwriting, right? I think they could easily be reintroducing here Joker and he's like, 'I know Joker's gone. What are you **** talking about?' And",
      "start": 547.6
    },
    {
      "text": "you know what I mean? Because it looks like Joker's handwriting, right? I think they could easily be reintroducing here Joker and he's like, 'I know Joker's gone. What are you **** talking about?' And then he sees him and knows it's Jason Todd. That this is something that happened, that this is how it's bridled out from just a sheer storytelling perspective. It's, it's kind of, that would be an interesting and almost brilliant move because then you would be, you would essentially be taking away the number, the, the biggest uh, uh, chance for criticism that movie he's going to have, which is 'The Joker wasn't as good as Heath Ledger', right? But if it's a different Joker, if it's literally a different character altogether playing the quote unquote Joker, like similar to Beyond, right? Where they had the Joker was in Batman Beyond, but it wasn't the Joker, it was like a new gang of Jokers, right? Right. So what's that? Nothing. Am I wrong? No, you're right. I haven't watched Batman Beyond too much, but I know they had a",
      "start": 589.0
    },
    {
      "text": "Batman Beyond, but it wasn't the Joker, it was like a new gang of Jokers, right? Right. So what's that? Nothing. Am I wrong? No, you're right. I haven't watched Batman Beyond too much, but I know they had a younger Joker that was, they were just, they were like, 'Hey, we want to be the Joker. We're taking up the mantle of the Joker.' So in this case, it would be actually pretty fascinating to watch that because then people really, the argument of like, 'He's not as good as Heath Ledger's Joker' would kind of go away because you're saying essentially it's not the same character, it's someone playing the Joker. Playing or someone playing a character playing The Joker, if that makes sense. But I have a question about this. Sure. And we have to talk about Arkham Knight again, so I'm going to tap my head, my fluffy hair. I have to. Um, it is, it's getting a little spikes on the sides. I don't, I don't care, I like it. Oh, thanks. Yeah, it is what it is. Uh, if that was true, specifically the branding, then that means Arkham Knight is canon.",
      "start": 624.8
    },
    {
      "text": "um, it is, it's getting a little spikes on the sides. I don't, I don't care, I like it. Oh, thanks. Yeah, it is what it is. Uh, if that was true, specifically the branding, then that means Arkham Knight is canon. I'm not saying it's the exact same thing, but, but I'm saying is, I mean, is it possible that art like that, that it's this, the well is so deep that these game, specifically Arkham Knight and the Arkham Knight himself as a character, which they just made up, yeah, is then the Joker in this and so that's canon? That's almost a necessary prerequisite for understanding this movie, right? Like that theory would suggest that if, if these characters are the same, no, because they've already, they've already, are we still in spoiler? I can't remember. We've already tapped their head. Um, no, because I mean, that was one of the, that was one of the thing issues I had with the game was that it was actually, I liked it better when he was Red Hood. I like, I liked that storyline better. Like it was basically the exact same story, but",
      "start": 660.28
    },
    {
      "text": "that was one of the thing issues I had with the game was that it was actually, I liked it better when he was Red Hood. I like, I liked that storyline better. Like it was basically the exact same story, but they just instead of like making him Red Hood, they made him Arkham Knight, which you're like, okay. And you saw it coming from the second you saw him in that chair, that very first flashback, you're like, well, really? But I guess I don't understand the relevance of the branding then in Arkham Knight if they're not connected. Well, because it's just like a nod. It's not so much like a, it's in the literal same continuity, but it's more just like, oh, I'm going to take that aspect, that aspect. Like in the same way that, you know, in the original storyline, Jason Todd gets beat, but he gets beaten a bunch of different ways depending on what the thing is, but it all comes from that original source point. So like this, it could just be like getting inspiration from it and like, you know, going from there. Yeah, plus, you know, it's",
      "start": 702.08
    },
    {
      "text": "on what the thing is, but it all comes from that original source point. So like this, it could just be like getting inspiration from it and like, you know, going from there. Yeah, plus, you know, it's just too complicated. That's, that is my big thing. Sorry, we're done, we're done with the Arkham Knight part. That's the big part is that it is really complicated. And I think, yeah, but I, I think if you do it where Batman v Superman is two, three nods that are setting Bruce even more on edge of, he gets this thing, 'What the ****?' He comes home to the cave and the, the Jason Todd statue is been defaced. You know what I mean? Like his suit's got 'Ha haa, jokes on you, Batman' written on it. That's the Easter egg in that movie, not even showing Leto ever in that movie. That's setting up Suicide Squad of like, 'There's a new Joker in town'. Meanwhile, from what we've seen, right, this Joker that apparently has enough money for his own Lamborghini and all this crazy stuff, which you assume Jason Todd had a trust fund or",
      "start": 741.2
    },
    {
      "text": "a new Joker in town. Meanwhile, from what we've seen, right, this Joker that apparently has enough money for his own Lamborghini and all this crazy stuff, which you assume Jason Todd had a trust fund or whatever. You know what I mean? Like, it's a weird theory that your, my first reaction, Joker just steals **** whenever he wants. I'm just putting that out there. He steals custom cars, he does whatever he wants. He's a Joker. I know he does whatever the **** he wants. But what I'm saying is this, I mean, they're trying to ground it, make it more ground. You think that if you were like, 'Wait a minute, Jason Todd's The Joker. Maybe I should cancel Jason Todd's trust fund.' Or may, maybe I should have done that when he was dead. Yeah, when he died. Yeah, the one, my sticking point is still what I was saying before, even though we had established the why wouldn't Joker just, it's the same, it almost reminds me of Dark, The Dark Knight Rises, where like, they tried to ruin Wayne specifically, you know, like Wayne",
      "start": 783.28
    },
    {
      "text": "Enterprises, even though Bane didn't necessarily know it, it was a whole weird happenstance about the bomb and stuff like that. But like, to, to acquire the weapon, I guess. But we're you, why they, why would they just ruin him, you know what I mean? Or out him? Well, no, because he wants to **** with him. He forgot about him. You left him abandoned. You let him, you let this happen to him. Yeah, that makes sense because you, he was like, he couldn't save him and because of that, he was tortured almost nearly to death. And so there's retribution to be had, which I, I can appreciate. I like this. I, the more and more you start explaining to me, the more I'm like, I hope they go in this direction because it would really set the series apart from the Joker movies that we've seen before. In addition to that, I mean, what does",
      "start": 819.0
    },
    {
      "text": "explaining to me, the more I'm like, I hope they go in this direction because it would really set the series apart from the Joker movies that we've seen before. In addition to that, I mean, what does this lead up to the Batman standalone movie where he would, whatever character he is, whether it's Red Hood or whatever, be in that, be the bad guy? And like, I love that. That sounds really cool. People have called that too, that like, and this, this is something we've seen from the first uh, image that when David Ayer put out that uh, photo of uh, Jared Leto, like there's a, it looks like a wing thing on his arm, which originally people were like, oh, it's like because he's already killed Jason Todd, he put that there. And now people are thinking maybe it is a nod to him being, having been Robin or whatever. I don't know. Could explain the tattoos too, 'cause if someone was to tattoo you, maybe they would do that as, as just a screw with you, right? Over your body. That's not even, yeah, it's not even a thing that he's doing.",
      "start": 862.48
    },
    {
      "text": "it's something Joker did. Well, that would be interesting. Yeah, but I agree, like that, my first reaction to it was, 'Funny fan theory, sure.' Then it was like, 'Well, yeah, if they, if it was, because when you hear it, you think it's all going to have to be in the same movie or it's all going to be in Batman v Superman or it's all going to be in Suicide Squad.' But if you parcel it all out and make in a giant lead-up to the Batman, you know, see, that makes sense. I mean, 'cause that is what Marvel did with the Avengers movies, you know, leading up to Avengers. Yeah, it's all the little bits and pieces. Like you hear Ant-Man mentioned, you hear all this stuff. And then when it happens, you're like, 'Oh, yeah.' Like, it just kind of feels right. This, I forget. So originally when I said that I don't think they'd do that because it's too, it's",
      "start": 899.68
    },
    {
      "text": "you hear all this stuff and then when it happens, you're like, 'Oh, yeah.' Like, it just kind of feels right. This, I forget. So originally when I said that I don't think they'd do that because it's too, it's too hard of a story to tell in Batman v Superman. I forget, we're going to see Joker mainly in Suicide Squad, right? Uh, so they'll start, yeah, I mean, that's, it's a brilliant idea of like, to, to sort of retell his backstory throughout those movies leading up to that, that standalone Batman movie. Could be cool. But is it possible that Leto's also in Batman v Superman in some respect? Sure, I'd be interested. I kind of doubt he's going to be, but like, actually in it. Like, I'm sure just these nods, nods and references to the Joker and all that stuff, but I don't think he'll be in it. But I mean, that'll be the, I mean, that'll be a giveaway, I guess. Well, I don't know. You imagine they'd have to confirm at some point early on that, you know, 'How can you even trust that Batman? He killed that Joker guy,' or whatever. And",
      "start": 940.36
    },
    {
      "text": "that'll be a giveaway, I guess. Well, I don't know. You imagine they'd have to confirm at some point early on that, you know, 'How can you even trust that Batman? He killed that Joker guy,' or whatever. And then I don't know, all this starts happening. He killed the Joker guy again. In this theory, he was, got it. Yeah, I mean, original, well, I mean, we have to assume that Joker, we have to assume that Batman has been out of, out of commission for a while, right? Like, they're still talking to him as the vigilante. Like, he's the older Wayne. We're assuming he's kind of coming back into, into, I'm, I'm, I haven't, that's been very confusing when you hear and look at this stuff. Is he out of practice? Is he still going? I'm not 100% sure. Okay, yeah, I mean, that, that to me would be, that's the sticking point to me, 'cause hasn't been the Batman for a while. If it really is The Dark Knight story, The Dark Knight Returns story, where he's been gone from the public eye for 10 years or 15 years, um, then yeah, that would be a dead giveaway.",
      "start": 976.84
    },
    {
      "text": "the Batman for a while if it really is The Dark Knight story The Dark Knight Returns story where he's been gone from the public eye for 0 years or 15 years um then yeah that would be a dead giveaway that this Joker is new because presumably then he the other Joker is dead or has died or is gone or is you something like that okay there's no way the Joker stays in prison for 15 years I mean I know we all kind of want it and assume it but like have they even hinted at all that that is the story they're going with where it's him kind of being watching the trailer it's like it's not clear that Batman is just starting now no no no no he's not he's definitely not starting now but my what I'm what I'm questioning is whether or not they are doing and this is solely because of the suit that that that unbelievably awesome homage to The Dark Knight Returns where he has to in order to fight Superman he has to make the like get the big electrified suit um that was what and the gray in his hair and",
      "start": 1018.64
    },
    {
      "text": "unbelievably awesome homage to The Dark Knight Returns where he has to in order to fight Superman he has to make the like get the big electrified suit um that was what and the gray in his hair and the fact that he's a bit older and the fact that like you know some of the some of the dialogue with him and Jeremy Irons about like what turns men cruel yeah um I I just may and that's me just maybe bringing my own stuff to it and hoping that they tell that story there's enough this is a problem with the trailer and I I I mean obviously the comments will for sure correct me if I'm wrong I just haven't seen it spelled out on any of the fronts if he stopped there's a lot there's definitely a ton of imagery in there where I could easily again make the C I mean he walks up you know when he's going to and drags the **** thing off the top of the Bat-Signal as if t on like it's been it's been out of use forever you know what I mean like the spinning suit could easily be another thing of like that",
      "start": 1060.8
    },
    {
      "text": "and drags the **** thing off the top of the Bat-Signal as if t on like it's been it's been out of use forever you know what I mean like the spinning suit could easily be another thing of like that when Jeremy Irons who I'm I'm sorry and I when Jeremy Irons is who I assume is Jeremy Irons because it's right before he's walking up to what looks to be a ramshackle Wayne Manor you know what I mean like I'm not 100% sure if yeah he's in the cave for the first time and forever if he's in the first time forever and then he finds haha Batman jokes on you and he's maybe Joker's stolen a whole bunch of **** cuz he is Jason that seems more likely to me I was just going to say I love that meme that's going around with h with that shot of him pulling off the the thing off the B the Bat-Signal where he's like Batman is calling Batman or you know shit's you know shit's getting real with Batman's calling Batman that's awesome that's awesome no but that's the thing is like when you start you",
      "start": 1095.08
    },
    {
      "text": "where he's like Batman is calling Batman or you know shit's you know shit's getting real with Batman's calling Batman that's awesome that's awesome no but that's the thing is like when you start you know I don't know I try not to **** around with it too much because I want it's going to be so hard for me to be surprised by anything in this movie because I'm going to devour everything that comes out so I try to stay away from but once you start falling down like I thought the theory sounded totally preposterous and then when you stop and think about it from a storytelling perspective and if there is time off and there is that like it could actually be that you know what I mean but if it is that let's let's assume for one second that it is that yeah I think that's kind of cool I would be like if it's that it's awesome and it totally makes sense to what you're saying is like the fact that yeah you know you don't have to worry about living up to Heath Ledger because this isn't trying to be",
      "start": 1131.92
    },
    {
      "text": "like if it's that it's awesome and it totally makes sense to what you're saying is like the fact that yeah you know you don't have to worry about living up to Heath Ledger because this isn't trying to be Heath Ledger's what they did with Star Trek where it's like well let's kind of reset it a little bit here you know I just wish they focus on some different enemies though you know that's you know that's what Suicide Squad's for Captain Boomerang yeah with yeah with all those classic Captain Boomerang, Rick Flag Jr. uh like where it's like I wish that like there shouldn't be a worry about about Heath Ledger's Joker cuz they they should leave that character alone you know what I mean like at least in respect to the Batman core movie is not so much Suicide Squad I mean he's necessary there that's fine but like just explore some of these other characters you know like we should really there should like what what's up about the Riddler like one of these other characters like just why ises it why are we going back",
      "start": 1166.6
    },
    {
      "text": "explore some of these other characters you know like we should really there should like what what's up about the Riddler like one of these other characters like just why ises it why are we going back to that well again we just went back we just had that well not too long ago and it was really good so just leave it alone but it's important because they're Universe building here like this is the starting point and like The Joker Is So connected to so many of these things they should end there but it's like yeah but not start there yeah you the Joker is the Yin the Batman's Yang like you in order if you want to really tell a good a true Batman story and you're going to do that over a span of a few movies The Joker has to be in that to some degree whether in the beginning and not the end the thing about it I mean I understand what you're saying too but the point is like this would be a defin this would be a brand new take on the Joker which is really fascinating cool take yeah absolutely",
      "start": 1206.72
    },
    {
      "text": "thing about it I mean I understand what you're saying too but the point is like this would be a defin this would be a brand new take on the Joker which is really fascinating cool take yeah absolutely I'm just saying that like I don't just as a cursory kind of Batman fan who just really likes the character and stuff like I'm not enamored at all with this Batman Joker like relationship at all like I I'm much more enamored like with like it's it's cool to have the guy that like wants to watch the world burn kind of thing but it's like I want characters that like are just crazier and you could tell like a different kind of story I'm not saying they can't do that with a different kind of Joker but if they want to if they want to ultimately go to that yin-yang kind of relationship with them like they should end on it they shouldn't begin on it because it's then like where is he just going to be the bad guy in **** three Batman movies like that would be lame as hell but me also we've got",
      "start": 1244.32
    },
    {
      "text": "they should end on it they shouldn't begin on it because it's then like where is he just going to be the bad guy in **** three Batman movies like that would be lame as hell but me also we've got like Justice League coming up right so you know who's going to be the big bad guy in that Darkseid Brainiac you giant thing and so you have to get through these s smaller characters like I can't wait for the day where they actually decide to go Brainiac like that's going to be really cool and that story even though we've seen it will be awesome to see on the big screen right Brainiac comes to collect the last Kryptonian for his managerie of you know aliens and decides that he's going to destroy Earth in the process yeah it's cool Darkseid that's going to be awesome right but like those are epic epic epic characters that you have to build up to and if you do it right they'll be cool movies um but I think that that to be to get to that step the number one thing they have to do is they have",
      "start": 1278.64
    },
    {
      "text": "epic epic characters that you have to build up to and if you do it right they'll be cool movies um but I think that that to be to get to that step the number one thing they have to do is they have to they got to get they got to get over the the stigma that is the Joker right now because that's really going to be the that's going to be the point of comparison sure I I I respect that I respect that in the grander DC Universe but we're talking about like a new Batman Trilogy for instance or these Standalone Affleck movies that are coming I just don't understand where do they end then you know like Darkseid's not going to be in Batman no so like it's it's like that's when so you end with the Riddler you end with Mr. Freeze or something like that I'm just saying like why wouldn't you start like like you work your way through a game to get to the last I don't think they're they don't look at it as a Trilogy anymore like Dark Knight Trilogy was a Trilogy this is a movie in a series that has",
      "start": 1314.24
    },
    {
      "text": "like you work your way through a game to get to the last I don't think they're they don't look at it as a Trilogy anymore like Dark Knight Trilogy was a Trilogy this is a movie in a series that has a bunch of other I think to them there's no end you know what I mean so don't paint yourself in a corner but get out the things people want and that movie goers want to go see and do things people look at Iron Man as a Trilogy yeah you know I mean the way I mean like this theory is cool right and it but and the only way it could be possibly cooler right is if they set it all up or whatever and whenever whether it's it's not going to be Suicide Squad obviously cuz I don't even know Suicide Squad's super interesting in this Theory because I always thought Suicide Squad was The Suicide Squad going after Joker you know what I mean because if it's not I'm not 100% sure how he interacts which is fascinating and awesome and interesting you know what I mean if it's setting up Batman's Standalone",
      "start": 1348.28
    },
    {
      "text": "after Joker you know what I mean because if it's not I'm not 100% sure how he interacts which is fascinating and awesome and interesting you know what I mean if it's setting up Batman's Standalone to be him chasing down the Joker he beats him and then the after credit scene What if after credit scene credits go black things people are sitting around and talking and then the purple suit walks in and the purple hat and he's like then his Joker and he's just like now who who been impersonating me or something but it's Jack Nicholson how **** awesome would that be I mean that would be amazing that that would probably break the internet they managed to keep that a secret just passs back in and you're like wait a minute you fell 800 stor it's not the **** '89 it's just an old we need an old Joker if somehow they tied the '89 Batman into all this get the Penguin back in there too done I'd be like done I got it's so funny um oh you got to watch that uh I brought it back for you yeah I'll",
      "start": 1383.68
    },
    {
      "text": "old Joker if somehow they tied the '89 Batman into all this get the Penguin back in there too done I'd be like done I got it's so funny um oh you got to watch that uh I brought it back for you yeah I'll watch it you got to watch that documentary cuz it's really I'm now I'm in Ken Burns land but you like I think you like this cuz it builds into a I like I definitely will like it they talk they talk a lot about that too like who Superman gonna fight and there's all there's that famous like you know he like Kevin Smith's original uh screenplay was about him fighting Brainiac and that was it it would be interesting it's actually those are out there floating I've often thought about going out there have you read them yeah um I want to read them I might start actually reading those on on this next trip uh cuz it sounds print them off and and have half glasses and sit there on your thing and read I'm going to them I'm going to put the two little brackets in like they do with real scripts that",
      "start": 1426.28
    },
    {
      "text": "trip uh cuz it sounds print them off and and have half glasses and sit there on your thing and read I'm going to them I'm going to put the two little brackets in like they do with real scripts that is the stupidest thing on the planet because the second you opened it the brackets come out and the thing just falls apart so I'm going to do all that it's gonna be really fun all right good I'm looking forward to that cool good great",
      "start": 1464.0
    }
  ]
}
