{
  "id": 1071,
  "video_id": "estBr7jf-eE",
  "show_name": "The GameOverGreggy Show",
  "hosts": [
    "Greg Miller",
    "Tim Gettys",
    "Nick Scarpino",
    "Colin Moriarty",
    "Portillo"
  ],
  "title": "Cheating on Your Spouse and Fan Theories - The GameOverGreggy Show Ep. 86",
  "description": "Nick Scarpino tells the story of our horrible United flight to SGC, Tim Gettys asks Greg to explain an awesome Joker Suicide Squad Batman v Superman theory, Colin Moriarty gives his take on the Ashley Madison hack, and Greg Miller wants to know what experience we would want to relive. (Released 07.24.15)\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1438326000,
  "duration": 6329,
  "transcript_chunks": [
    {
      "text": "Today's episode is brought to you by Loot Crate, the subscription box for the geek, gamer, and or nerd in all of us. For less than $20 a month, you get 6-8 items of gamer and pop culture licensed gear, apparel, collectibles, unique one-of-a-kind items, and more! Make sure you head to lootcrate.com/kindafunny and enter the code kindafunny to save $3 on any new subscription. Remember, you only have until the 19th at 9pm, that's Pacific Time, to subscribe and receive that month's Loot Crate. And when that cutoff happens, that's it. It's over. Too bad, Charlie. Or whatever your name is. It doesn't have to be Charlie. I don't know. So go to lootcrate.com/kindafunny and enter the code kindafunny to save $3 on your new subscription today. What's up everybody, welcome to the GameOverGreggy Show. I'm one of your hosts, Greg Miller, alongside the producer slash seducer, Nick Scarpino. Hi. Daaaaaaamn, producing's on point. Put that out there. I have to make up for the shorts.",
      "start": 0.0
    },
    {
      "text": "Over Greggy Show. I'm one of your hosts, Greg Miller, alongside the producer slash seducer, Nick Scarpino. Hi. Daaaaaaamn, producing's on point. Put that out there. I have to make up for the shorts. Beard's on point. Oh, you're wearing shorts. I'm trying to be sexy in salmon colored shorts. It's a tall order. We just got back from SGC. Frisco, Texas. Frisco and Plano. We hit Plano for a little bit. We were in Plano quite a bit. The IHOP. The IHOP was in Plano. Shout out to Plano, Texas. You know what's funny is that, you know, people obviously give different cities crap for different reasons, right? I give Riverside crap. We had some fun in Plano, Texas. We had a lot of fun in Frisco. So I can understand that living there is different than just visiting, because we obviously hit all the hot night spots like IHOP, Denny's, Torchy's Tacos. Yes. In a very different category than the last two. Very different. Very good. If you have a Torchy's in your town and you haven't tried it yet, what",
      "start": 58.16
    },
    {
      "text": "night spots like IHOP, Denny's, Torchy's Tacos. Yes. In a very different category than the last two. Very different. Very good. If you have a Torchy's in your town and you haven't tried it yet, what are you waiting for? Pause this. Go get tacos. Come back. Watch the rest of it with tacos. Great time to tell you we're sponsored by Torchy's Tacos. We're not. So no, don't give any free advertising. But it was fun. No, it was a great time. But what I was going to say is you slowly devolve into a 20-something on spring break. Because it started, we got there and you were dressed and you were beaten by life. You were an old Nick Scarpino. You'd seen some things. And then you switched into the shorts when it got super hot. Then the t-shirt was all the time and it was loose and it was fitting. Then you got that Omega 64 hat and this was the completion. He didn't bend the brim at all. He just put on the hat. So I asked Tim, because Tim, as you know, is my consultant for all things on life. I",
      "start": 116.24
    },
    {
      "text": "you got that Omega 64 hat and this was the completion. He didn't bend the brim at all. He just put on the hat. So I asked Tim, because Tim, as you know, is my consultant for all things on life. I have to put everything through him first before I actually put it on my body. It's the only way to put things, yeah. And I said, Tim, those hats... Exactly. We saw the Mega 64 guys. We were in the same signing room as they were. We're friends there. And we're friends of theirs and we've hung out with them before. And so I noticed there was something these dope Mega 64 hats and I'm like, hey, I want one of those. Fully willing. There it is. There it is. Look at him. Look at how young he looks. Nick, did you go to Panama City? Did you go to Panama City? Call me Nicky. I want to be called Nicky. I never heard him say that. He was doing that. And then it was our calling him Knuckles and it was weird. See, now you look at me. Don't do that. I got one of these dope hats. Well, actually, they were",
      "start": 154.24
    },
    {
      "text": "never heard him say that. He was doing that. And then it was our calling him Knuckles and it was weird. See, now you look at me. Don't do that. I got one of these dope hats. Well, actually, they were kind enough to give us a few of these, which is nice. I was going to purchase one from them, but don't call them that now because they gave it to me for free. We'll put that here. Actually, I'll put it on Superman. Okay. Superman. And then something weird happened. We were in the VIP lounge and they had smartly hooked up a few gaming systems. Now, I don't know if you guys are familiar with this particular system, but it was the N64. Oh, the fun machine they called it. And the first game we played was a little game called GoldenEye, which I have said before, and I'll say it again, I'll wreck any of you at GoldenEye. Having said that, I lost very badly at GoldenEye the first and only time we played it. And I was like, I'm not doing this again because I want to remember how good I used to be",
      "start": 196.16
    },
    {
      "text": "of you at GoldenEye. Having said that, I lost very badly at GoldenEye the first and only time we played it. And I was like, I'm not doing this again because I want to remember how good I used to be at this game without sullying that right now. Then we consider it sullied, Nick. Then we picked up Mario Kart. Now, here's the funny thing about Mario Kart, Tim. I've always told you, we played Mario Kart before and let's play some kinda funny games. And I've often told you that if we ever picked up the Mario Kart 64, that I would eat your lunch. Let's quote what you said. I thought there was a different word he said at the end, but instead of lunch, no, we do. Yeah, that's what I'm saying. Like a cupcake. Y'all listen to too much Nicki Minaj. We get in the room and the last day, I don't know if you noticed this or not. It went from all of us forgetting really that the game was way slower and the controllers, by the way, were broken. I didn't realize that the N64 controllers, like the",
      "start": 231.28
    },
    {
      "text": "if you noticed this or not. It went from all of us forgetting really that the game was way slower and the controllers, by the way, were broken. I didn't realize that the N64 controllers, like the analog stick, just no one of them literally like you turn the side. The green one was a little messed up. But having said that, I don't think any N64 controllers in existence. Like that is their default. Their default is broken. I remember. I always remember things a lot more fondly, I think, than they were in the light of the day. But I got better at it. I got better at it. And toward the end, I was like, I'm actually remembering one match. I won one match and battle mode. Most would say that it was the best. Actually, a lot would say actually everyone in that room said that it was the best match they've ever seen of Mario Kart before. And we were playing against the nice people from Rooster Teeth. And Tim was in it. And Tim was noticeably getting mad at me that I was achieving a level of",
      "start": 270.72
    },
    {
      "text": "they've ever seen of Mario Kart before. And we were playing against the nice people from Rooster Teeth. And Tim was in it. And Tim was noticeably getting mad at me that I was achieving a level of greatness in this game in such a small period of time because, Colin, you have to understand, it had gone from me forgetting completely how to play to almost a level of that one could consider masterful. And I will say my block fort, if done correct, no candy friend. I'll tell you that right now. Over here, the pride of Long Island, Colin Moriarty. It's good to be here with you today. You were at SGC. You never broke from just being Colin. You never put on shorts. You never put on a funky hat. No, I barely left the hotel room. Yeah. But we had a good time. You did put on a funky hat. I did have a funky hat. Oh, Grimecraft's hat. Yeah, Grimecraft. Shout out to Grimecraft, our new best friend. No, we had a good time there and did our meet and greets and our panel. Thank you all who came out.",
      "start": 309.36
    },
    {
      "text": "a funky hat. Oh, Grimecraft's hat. Yeah, Grimecraft. Shout out to Grimecraft, our new best friend. No, we had a good time there and did our meet and greets and our panel. Thank you all who came out. Thanks for supporting us. Crazy turnout. I enjoyed it very much. It was fun. Then I just stayed in the hotel room, played SteamWorld Dig on my Vita. Did you beat it? Almost. Yeah. Yeah. Longer than I thought. You thought you were going to beat it on the plane, but then you fell asleep. I fell asleep. A lot of this is what I saw. We were across the aisles and we were across the aisle from each other. And I looked over and the best was you were still holding it, but you were like this. Looking out at me the entire time. But your iPad was on for a while. You literally blinked at something. You're probably like, you're reading about fucking, I don't even know, the goddamn nuts and bolts on a cat, big old tractor trailer. And you looked over to think about it. I was so jealous of you, by the",
      "start": 351.92
    },
    {
      "text": "probably like, you're reading about fucking, I don't even know, the goddamn nuts and bolts on a cat, big old tractor trailer. And you looked over to think about it. I was so jealous of you, by the way, because I looked back on the plane. You were asleep like an angel. You really were. It was perfect. There was no, no, you were peaceful. You were calm. You were serene. And then that was the complete antithesis of the dude that was next to me who was sleeping. So I had a guy, like one row up that I was just staring at. And he had one of those giant neck braces on that not, it wasn't like a medical condition. He put it on so that he could sleep. And he was snoring so loudly that the only thing that actually I could do to not kill him was focus on the guy next to me who was doing this every five seconds. And I was like, do you need a tissue? That's so fucking annoying. Isn't it? God damn it. And his wife was there. I'm like, how did your wife, like, she must have tuned it out by now. But",
      "start": 390.48
    },
    {
      "text": "seconds. And I was like, do you need a tissue? That's so fucking annoying. Isn't it? God damn it. And his wife was there. I'm like, how did your wife, like, she must have tuned it out by now. But if I did that next to my wife, my wife would be like this, go to the bathroom and don't come back until those flight lanes. Don't come back. Because you're pissing me off. Yeah. It got to the point where I was trying to finish my Anne Rice novel that Colin so astutely pointed out. It's taking me seven months to read. And I'm like, I'm going to finish this on this plane because I'm so tired. This damn thing's heavy. It's not as good as I want it to be. It's taking way too long to read. And I'm trying to finish the last 10 pages. You know when you get to the last 10 pages of a book or anything you're like, and it's actually good. You're like, I need to just don't screw this ending up for me. Like savor it. And that last, I have this weird thing where like the last paragraph I have to read",
      "start": 435.52
    },
    {
      "text": "you're like, and it's actually good. You're like, I need to just don't screw this ending up for me. Like savor it. And that last, I have this weird thing where like the last paragraph I have to read perfectly in order to like finish the book out well. And so I had to put on my headphones and I put the sleep machine on. Oh yeah. Which actually sounded like the airplane we were in, but just in my ears. And I finished the book. No, I couldn't sleep on that plane. There was just too much stuff. I mean, I blame United. I blame United for that man that sat next to you. I believe United for like the two hour delay in the plane, trying to get there for my bagel at Starbucks before I got on the United plane, being a little stale. Mine was like fluffy. Not being able to toast it. Yeah. We had a very bad experience. Yeah. Yeah. Straight up United sucks. Every fucking hate you. It's one of the things where how's that? Is that, is that easy enough for everyone to understand? Everybody except Nick",
      "start": 477.6
    },
    {
      "text": "bad experience. Yeah. Yeah. Straight up United sucks. Every fucking hate you. It's one of the things where how's that? Is that, is that easy enough for everyone to understand? Everybody except Nick has good taste in as a Virgin America fan boy. And so it's like, we saw, you know, it feels like whenever you you're like, oh, well, you know, the version is just so good. Everything else just must not be every, every else sucks. It sucks. Sucks sucks. It's terrible. You know, it's boarding process. Doesn't make any sense. Everyone there is bitter and hates their life. Southwest is terrible. Yeah. I'm going to give a shot. Cause Virgin America showed up. Yeah. It was the premier airline for a while. The thing about United is that statistically it showed like they are bad. They're a bad airline, you know? And they have like whole Twitter account, like popular famous Twitter accounts. It's like focused on them. Maybe not super popular, but I see them pop up every once in a while where it's",
      "start": 515.6
    },
    {
      "text": "you know? And they have like whole Twitter account, like popular famous Twitter accounts. It's like focused on them. Maybe not super popular, but I see them pop up every once in a while where it's like, you know, people are just, they just people bitch about United all the time. And the catch is that United will reach out to you. If you tweet at them, I don't tweet at them because I don't want them to talk to me where they were like, oh, we'll give you a voucher or whatever. And it's like, but that requires me to fucking fly United again. You understand what I'm saying? Cut me a check for a hundred dollars to cash. They're so bloated and they're just, I don't have good experiences on them. Typically. Sometimes it's fine. I, I interestingly, when I fly them internationally, I have fewer problems when I fly them domestically. But they just getting to Texas, we were on the plane. They don't talk to you. They'll tell you what's going on. They tell you to get off the plane. Then they",
      "start": 560.8
    },
    {
      "text": "problems when I fly them domestically. But they just getting to Texas, we were on the plane. They don't talk to you. They'll tell you what's going on. They tell you to get off the plane. Then they tell you to get back on the plane, all this shit's happening. Then on the way back, they just arbitrarily delay the flight, but then don't update the boards that the flight's delayed at all until they say something. They just, the problem is that airlines is zero sum, like flying airlines zero sum game, you go for the cheapest thing there is. So there's no, there's very little brand loyalty with airlines. There just is. And, and, uh, so no one pays for like the, you know, their consumer crimes as it were. But I think United is just, it's just trash. Like it's just, it's just a bad airline. It's a product of its own success, right? Cause it's so big that inevitably it's just acceptable that they have 0% of their flights just that are fucked up. Like to put it in context, we're bitching. I",
      "start": 590.64
    },
    {
      "text": "a product of its own success, right? Cause it's so big that inevitably it's just acceptable that they have 0% of their flights just that are fucked up. Like to put it in context, we're bitching. I was, I was particularly tired. This has been our like what, fourth convention or third convention that we've had in a few weeks. We've had, this is convention season. So right now we're in the stretch of four cons in five weeks. This is our second and they were back to back and they're all fun, but they do take a toll out of you. So by the time I got to the United terminal and I already had three text messages from United telling me that the flight was delayed by a half hour, then an hour. Um, I was already pissed off. And then you just get there and you can tell it's not the, it's not their fault. It's just the people that work for the airline have to deal with people who are pissed off all the time. And so after a while they just become just robots, robots. Yeah. They just have to get",
      "start": 633.2
    },
    {
      "text": "fault. It's just the people that work for the airline have to deal with people who are pissed off all the time. And so after a while they just become just robots, robots. Yeah. They just have to get, they have to just get you on the plane because that's their job. And like, you know, once you got to the flight, the flight attendants were really nice and then the pilot did his job correctly. Everyone did the job correctly. Nobody died. Um, but getting there, that was the, that was where if it hadn't been for you guys, I probably would have lost my shit. The hat though, the Mega 64 hat also kept you balanced because it reminded you of being young at spring break. Beautiful babes running around. That's true. No, I met the flight to Texas. I would have lost my shit if you guys weren't on there. That was because you had the promise of the hat. I mean, understand what happened on the flight to Texas, right? We got on the plane on time. Then they were like, the pilot isn't here yet. Right.",
      "start": 673.76
    },
    {
      "text": "That was because you had the promise of the hat. I mean, understand what happened on the flight to Texas, right? We got on the plane on time. Then they were like, the pilot isn't here yet. Right. He's coming from a different flight. All right. Uh, so they back, they back to back these pilots so that he has to land basically parachute out of the plane as it's rolling and run over to the other plane. That's how quickly he has to get there. Right. Which by the way, does not instill confidence that the guy might've just gotten out of a six hour cross country flight and is now flying me other four hours. Like, thanks for that. Yeah. So they, they, you know, the pilot just doesn't show up, which is again, and again, this is not personnel issues. It's it, it is some way. That's the thing I'm saying is that it's someone's fault that United sucks. It's not necessarily, it's not the flight attendants or the pilots or the people on the ground you interact with. But I do hate that when someone's",
      "start": 711.2
    },
    {
      "text": "is that it's someone's fault that United sucks. It's not necessarily, it's not the flight attendants or the pilots or the people on the ground you interact with. But I do hate that when someone's like, well, it's not, it's no one's fault. I'm like, no, it is definitely someone's fault. Uh, but so the pilot, the pilot is, is, you know, late. Then they're like, Oh, the navigation computers are all fucked up. Then we just sit there for literally like an hour every few minutes. They're like, five more minutes, five more minutes, five more minutes. Then eventually they're like, all right. Um, we, we got to get new parts. So then they get the new parts and they're like, all right, everyone can just get off the plane and everyone starts getting off the plane. Then they're like, we have to deboard you. So then they start the guy at the desk is pissed off. No, the guy, you have to get back on the plane, get all your stuff. Well, no, no, that, that's, that's not, I'm not even there yet. Then",
      "start": 747.92
    },
    {
      "text": "you. So then they start the guy at the desk is pissed off. No, the guy, you have to get back on the plane, get all your stuff. Well, no, no, that, that's, that's not, I'm not even there yet. Then they, then they were like, you have to, the guy's like one-on-one scanning things. And then they're like, fuck it. The plane's just broken. Then they just automatically take everyone off. Like the plane, like the tickets or whatever, just like on mass, like just remove everyone from the list. Then they tell you to get back on the plane to get your stuff. Then when we're getting back on the plane, most people had already gotten off of their stuff. And they're like, no, the computer's fixed. Get back on the plane. The pilot, it's a fucking here, the pilot, he was like, it's fixed. Like he was telling the person who was like trying to get, there was like one poor woman who was like trying to manage the situation, which we, you know, people were getting irate at this point at a certain point",
      "start": 782.24
    },
    {
      "text": "the person who was like trying to get, there was like one poor woman who was like trying to manage the situation, which we, you know, people were getting irate at this point at a certain point, you're just like, you start to feel like you are just a piece of fucking meat, a cattle that is just being herded in and out of this, this, the slaughter, you know? And this poor woman was just trying to keep it straight. And the pilot was like, it's fixed, get him back on the plane. We can go. And she's like, yeah, he's like, it's fixed. And then finally I saw in his eyes, the same rage of my eyes, the pilot was just like, fuck it. And got like, just went into the cockpit and was like, we're taking it away from the gate. We saw the pilot talking briefly. And he looked like fucking infuriated. Like he's like, you know, he was not having it. He was not having it. So it's like, there is a level where, and yeah, so then everyone gets back on the plane, everyone's pissed. And then on the way back",
      "start": 812.4
    },
    {
      "text": "he's like, you know, he was not having it. He was not having it. So it's like, there is a level where, and yeah, so then everyone gets back on the plane, everyone's pissed. And then on the way back to California, they delay the plane by an hour for what seems like an arbitrary reason, but it's because the plane hadn't arrived yet. I don't think so. It's just a total semantic, you know, like thing, but it's like, it's a logistical problem. They have just logistic, like a lot of logistical problems. And, and then my, my, my favorite thing. And I remember saying this to Greg, because they were almost making people feel guilty because they always ask you to check your bags and then there's always room. We arbitrarily take people's bags and like, we're now I'm like, there's like so much room left in the bins, but then they're like, we have to hurry up because people have connections. And I'm like, yo, motherfuckers, you delayed the plane an hour. That's not our fault. You know? So don't",
      "start": 854.88
    },
    {
      "text": "left in the bins, but then they're like, we have to hurry up because people have connections. And I'm like, yo, motherfuckers, you delayed the plane an hour. That's not our fault. You know? So don't like try turning it like flying United is always, it's always a fucking adventure. And by adventure, I mean, it's a misadventure and I don't, and I don't, I don't like that airline. There's just something. I would never voluntarily fly that airline unless that was literally the only way I can get to where I'm going. And that is a rare, rare case. You know, I just, it's just too much. The one, the one good thing I'll say is the, I was pleasantly surprised with the leg space on the flight back. Seriously. Like I was like, Holy shit. Like I was upfront. Yeah. The rest of the seats weren't like that. No, I was like, but I got a special, like I switched out cause they put gave me a middle seat and I was like, no, I'm not doing that. So I went and talked to them and I was trying to get an aisle",
      "start": 885.84
    },
    {
      "text": "No, I was like, but I got a special, like I switched out cause they put gave me a middle seat and I was like, no, I'm not doing that. So I went and talked to them and I was trying to get an aisle, but they only had a window. I took that. Thankfully I did. Cause I did get the leg space. I think it was an emergency exit or whatever. Um, so I was okay with that. But besides that, it was just like, it was a joke of how far we've come in airplane technology to get on this airplane that doesn't have a fucking screen. It doesn't have a power plug or USB or something. And I understand this is a first world problem, but at this point it's like, this is not a flight to LA. This is a freaking flight to Texas. There's hours going into this shit. I want to see the little picture of my airplane and how far it is from my destination. You know, I want to know, not this fucking garbage. And then all of a sudden it's like, one of my least favorite moments of airplanes is before you take off and when",
      "start": 924.16
    },
    {
      "text": "far it is from my destination. You know, I want to know, not this fucking garbage. And then all of a sudden it's like, one of my least favorite moments of airplanes is before you take off and when you land and can't get off the plane. Oh yeah. Those are the worst. Oh my God. No, that was the best. And here's why, because inevitably, and I look forward to this because no matter how much rage I have, no matter how angry I get at the very core of my fucking being, Colin Moriarty gets madder and he, there's nothing that pisses him off more. I'll stand by this. Then when people, where the second the plane hits the terminal, get up and run as fucking like as far as they can, just to try to skip 10 people ahead to get off the plane. And Colin goes like this, I forget what you say, but it's something to the extent of like etiquette. You're like, there's no, you guys forget how to get off the plane. Is that what you're doing? Airplane etiquette. You're just slowing down every route. So when we",
      "start": 964.32
    },
    {
      "text": "to the extent of like etiquette. You're like there's no you guys forget how to get off the plane. Is that what you're doing? Airplane etiquette. You're just slowing down every route. So when we landed in Cal in San Francisco last night I looked at Greg and I just got up and stood like right immediately just stood right in the middle of the thing. I'm like no one's getting past this this this lane. This is like like no one's getting past this. We're all getting off before you. Yeah. Like that's someone's got to someone's got to draw a line. And there was a girl behind me that was ready to go. And I'm like no, sorry. This is the airplane etiquette. This is how we get off the airplane. This is what separates us from animals is that we understand etiquette. Here's how it happens. The people in the first row get off then the second row then the third row then the fourth. We don't play these fucking games. You're going to wait. If you're in the 10th row you get off after the",
      "start": 1011.92
    },
    {
      "text": "people in the first row get off then the second row then the third row then the fourth. We don't play these fucking games. You're going to wait. If you're in the 10th row you get off after the 11th row gets off. What about when they come over and they do the whole like we have people who are really close in connection. But here's the thing. I want to see tickets because then everyone just gets up and like Oh yeah. I'm like yeah. All right. Yeah. You I know I know you're not going to see what the fucking carousel in 10 minutes. You don't have a Ken actually get the fuck out of here. I've seen one flight one flight I was on where the stewardess was like ladies, gentlemen, I'm so sorry to have to ask you this, but there are two people on this flight that have connecting flights that leave like within they're going to leave within 20 minutes of us touching down. Can you please stay seated and let them get off the plane first. And I'm like there's no there's no way that's",
      "start": 1047.84
    },
    {
      "text": "that leave like within they're going to leave within 20 minutes of us touching down. Can you please stay seated and let them get off the plane first. And I'm like there's no there's no way that's going to happen. There's no way that's going to happen. And she reminded us again as we landed and then we parked at the terminal and she sure shit. Two people got up grab their stuff left. And then everyone else got up and like filed out. That makes sense. No. And that's what it should be. I'm fine with that. But to Colin's point in your if you're in the 30th row how far do you think you're realistically going to get before you get mobbed? People just pour out into the aisles. You get three four what? And then they're like this to me. They're like right here. There's always some asshole that's sitting right there with his bags and hitting me on the side of his bags. And I just want to punch him in the foot. But understand that that I understand that. I like when I got up everyone",
      "start": 1081.76
    },
    {
      "text": "that's sitting right there with his bags and hitting me on the side of his bags. And I just want to punch him in the foot. But understand that that I understand that. I like when I got up everyone else was getting up too. It's just like I was getting up and standing there and I'm like like we are going to get off this plane like human beings in an orderly fashion to get off this plane the way it is intended to get off. You know? Yeah. Everyone no one likes flying. Everyone hates the airport. Everyone hates the airplane. I fly we all fly way more than normal people you know way way more. And we know like what it's like to be in an airport and stuff. So little things like that make it go smoothly and make everyone happy. I don't like that shit. Like where here's the it's the essence of an entitled posture where it's like I don't care who I'm inconveniencing or who I'm bothering. I'm getting off this plane. And I'm like yeah. And I'm like we are all in this together. We",
      "start": 1122.0
    },
    {
      "text": "of an entitled posture where it's like I don't care who I'm inconveniencing or who I'm bothering. I'm getting off this plane. And I'm like yeah. And I'm like we are all in this together. We are going to do this as normal people do this. You know what I mean? And if you have a connecting flight or something like that and you make that known fine. But I guarantee you the people that were behind me that were trying to rush up that plane had no connecting flight. No they wanted to go. So so it's like just wait with everyone else. Why are you five more minutes? That's all you got to wait. It's too much man. Like there's too much for me. It sucks too. Like when I'm in the aisle seat and then the people that are in the middle and window seat are like getting fidgety. Oh that was happening to me bro. Be cool. There is relax 30 aisles or 30 things in front of us. No one is getting off yet. Just chill. Like what you want me to stand to do that awkward thing. You can't really stand like",
      "start": 1154.24
    },
    {
      "text": "to me, bro. Be cool. There is relax 30 aisles or 30 things in front of us. No one is getting off yet. Just chill. Like what you want me to stand to do that awkward thing. You can't really stand like your full body length unless you're Nick. And it's just like super weird to like have to like do that whole thing. What why why are we doing all this? But going back to what I was saying is my least favorite things are is that five minutes. Cause that five minutes feels like an hour when you're waiting for all this. I sit with my legs crossed and just chill and relax. I'll re I'll read I'll just keep reading them and people will look at me. I'm like what do you want to do? But the worst thing is the heat. It's like Oh they turn the AC off. Everything's off. So it's like the heat and the cold. When you're in the air it's freezing cold. But that first 15 minutes before you get off the ground is just so hot. You're in this oven of death and hell. I hate it so much. But then on this",
      "start": 1191.04
    },
    {
      "text": "cold. When you're in the air it's freezing cold. But that first 15 minutes before you get off the ground is just so hot. You're in this oven of death and hell. I hate it so much. But then on this United flight they gave me a little AC and then they decided to give me a lot of AC. That was when shit got real. And the funniest thing that happened this entire trip was Nick Scarpino going they're trying to air condition us to death. It was like doing the fog thing. It looked like a joker gas. It was ridiculous. The uh I don't know. I just when when you see things on like consumerist and someone it's like Oh EA is the worst company in the world. I'm like are you kidding me? Like like there are companies like United that just seem to have a blatant disregard for like anything at all. And and I it's not so much the delays and the logistical things that bother me the most. It's like the lack of communication you know like beyond don't keep stop saying five minutes over and over",
      "start": 1227.04
    },
    {
      "text": "And and I it's not so much the delays and the logistical things that bother me the most. It's like the lack of communication you know like beyond don't keep stop saying five minutes over and over again. Like just tell us what's happening and be honest with us and maybe be nice and friendly with us. And that goes a long way you know like but don't like get me on an airplane and then tell me the pilot's not there yet. And then that was and then the navigation computer's broken and then get off the plane. They go back like what's wrong with it. My favorite thing was when they're like it's just five or 10 or 20 minutes. What? No that's not a sentence. Like that's just your time. The thing that the thing that gets me most are right. I'm sorry. Well we'll keep I guess this is this turned into this topic which is great. It's been hijacked. This is this topic uh is when they tell you you got to bag check right? You guys I'm sorry. We're going to have if you're in row you",
      "start": 1277.44
    },
    {
      "text": "turned into this topic which is great. It's been hijacked. This is this topic uh is when they tell you you got to bag check right? You guys I'm sorry. We're going to have if you're in row you know boarding groups four or five you're going to have to bag check. Now the I don't mind doing that on smaller flights when it's a smaller plane. And I know that I got a big bag or whatever but the reason you have to bag check is because they charge for bags now. Now back in the day the reason that this happened if you remember correctly was because there was a gas crisis right? Like the price of of of crude oil shot up like crazy excuse and all of the airlines started merging or going out of business. And so in order to salvage the airline they were like we have to unfortunately start charging for bags. Right. But the problem is just like taxes when they introduce taxes you can't get rid of it. Once your company gets used to charging that extra fee and they make that",
      "start": 1316.8
    },
    {
      "text": "start charging for bags. Right. But the problem is just like taxes when they introduce taxes you can't get rid of it. Once your company gets used to charging that extra fee and they make that much more money it never goes back. So like that's the only reason why I appreciate Southwest is because they will give you that free bag because they know on some level that it makes the flight just that much more bearable. You can check your bag for free. The ironic thing about that though is that Southwest has that and then literally literally the worst seating order situation imaginable. But you own your own destiny. Do you want to wake up at six in the morning and check in the day before Colin? It's a fucking free for all. Southwest is like United's bad because they have those like the five things like the five zones. And it's not the zones that matter. It's not they give you a place to stand for the zones. Right. See everyone has zones or groups or whatever. Sure. But like you",
      "start": 1352.8
    },
    {
      "text": "five things like the five zones. And it's not the zones that matter. It's not they give you a place to stand for the zones. Right. See everyone has zones or groups or whatever. Sure. But like you don't give them a place to just collect and get mad at each other. And then the situation you just say like we're loading zone one and then we're loading zone two. You don't like have these little coordinates but Southwest where it's like one through 30, 31 through 60. And then you have to talk to people like what number are you? And they're like seven. And I'm like and then the guy like you know there's no room and the guy's like but I'm six and you're seven. And I'm like who fucking cares? Just get behind me. Like is it really going to make a big dip? Like it is like a it is like the fucking Lord of the Flies. Yeah it really is. But but it's annoying because you know that that's not the most efficient way to load a plane right? Like none of these are the most efficient",
      "start": 1391.44
    },
    {
      "text": "the fucking Lord of the Flies. Yeah it really is. But but it's annoying because you know that that's not the most efficient way to load a plane right? Like none of these are the most efficient way. They're all based on how much money they can charge. So like loading all of these people that are that are you said have these premiere statuses these gold statuses that pay or that that fly it's all just bullshit incentivizing. If they really wanted to load a plane first they probably load from the back front. Well this is what Greg and I were saying. There's in my mind there were there were two obvious ways to load a plane back to front or or windows than middle seats than aisle seats. Right. Right. And I looked it up just briefly. It's just anecdotal but there was a study where it's saying that style is 40% quicker loading the window seats first then loading the aisle the middle seats then loading the aisle seats. That's like the way that they should do it for it to",
      "start": 1423.36
    },
    {
      "text": "it's saying that style is 40% quicker loading the window seats first then loading the aisle the middle seats then loading the aisle seats. That's like the way that they should do it for it to maximize time. But you can like pay to get on the plane first and stuff like that. So they'll just they don't care. They don't care. And there's no like I fucking swear to God like I can't figure it out but it doesn't seem like there's any rhyme or reason to the way anyone gets on a plane. Like how are you group five? But we were group like three together. Like like there's just weird things where I'm like what is what is going on here? Yeah. You know like that's the problem I think with this most airlines and why the airlines that do things really well even if there are every airline has delays and logistical problems but Virgin America is just a good experience. You know I'll pay for that experience because I know it's not going to stress me the fuck out you know or JetBlue is",
      "start": 1460.08
    },
    {
      "text": "delays and logistical problems but Virgin America is just a good experience. You know I'll pay for that experience because I know it's not going to stress me the fuck out you know or JetBlue is another great experience where it's like I'm not going to like stress out with this like these and these airlines rose up you know out of the ashes of airlines that suck you know like they're they came they came about because airlines are generally big megalithic impersonal. They don't care. No they don't give a shit. And that's the problem with and that's what I was saying. Like people go online they'll go on kayak or something and they'll be like all right what's the cheapest fucking flight from here to there. And they'll take that flight. Right. If we had more brand loyalty and I understand that that's not a commercial reality for a lot of people then these kinds of things would be fixed like that. But since you you could only fly you know it's just cheap to fly to",
      "start": 1493.84
    },
    {
      "text": "and I understand that that's not a commercial reality for a lot of people then these kinds of things would be fixed like that. But since you you could only fly you know it's just cheap to fly to Dallas from here on United or it's well we went to Kentucky. We had to fly United cause I was the only guy that went to town or whatever. It's like okay like no but a perfect perfect case point right? We're booking our flights for Rooster Teeth Austin. And I looked and there was United flight that was $40 cheaper. And Virgin. And I'm like you know what? This is where this is where I this is where I this is my last stand here. This is where I draw the line on the sand. I'm going to just pay them the extra $40 to have a nice terminal to have that that extra little nicety that Virgin seems to have that the the the good people at United have had beat out of them over the last 20 years. I like how you even looked man. I have if I know Virgin fly somewhere I don't even look at",
      "start": 1528.48
    },
    {
      "text": "seems to have that the the the good people at United have had beat out of them over the last 20 years. I like how you even looked man. I have if I know Virgin fly somewhere I don't even look at the reason we flew. The reason we flew this way is because this was you know Screw Attack was nice to fly us out. They flew us out before I think Virgin was flying to Love Field that Dallas Love Field. And like that was a game changer. You know what I mean? Like if the version goes there I don't care what the price difference is. Now granted we have the credit card and the priority and all that stuff but it's like even without that. Yeah. Yeah. Now I'd be all over it. You got to have some loyalty. You got to stand for something. It's it is just the most frustrating thing in the world. I feel like we had a especially especially bad couple of days right. With the airplanes and stuff. And yesterday we were on the little the tram that takes the park breaks down. So we finally land. Oh",
      "start": 1566.32
    },
    {
      "text": "like we had a especially especially bad couple of days right. With the airplanes and stuff. And yesterday we were on the little the tram that takes the park breaks down. So we finally land. Oh we're excited for this trip to finally be over. And we go down to get bags all the bags come off the carousel because we had to check them because we have equipment or whatever. Now all the bags check them. That was the funny thing is when I got they were like if you're there's no way there's not going to be any bin space left. And I get there and there was so much bin space left that you could have fit more human beings on the plane in the bins. And I'm like gee I'm almost like wondering if they've ever heard of this thing called a walkie talkie where I'm like just give the person in the plane like an ability to talk to you and be like Oh no we're good. Don't worry about it. Just get more people on the plane. So these people can be on time for Christ's sake but no they're using",
      "start": 1598.88
    },
    {
      "text": "plane like an ability to talk to you and be like Oh no we're good. Don't worry about it. Just get more people on the plane. So these people can be on time for Christ's sake but no they're using telekinesis to try to figure out if there's been space left. And like no I don't think there is any things in the bins. So we lay in there we get there all the bags come off the carousel except the tripod that the camera's on. So we have to go over there talk to them. They're calling it radioing over. Even the lady radioing to United baggage people is getting all upset because they're not understanding the simple thing she's trying to say. Then it finally pops out really great. We'll all go to Nick's car. We have Grime Craft not take his Uber. You can we'll give you a ride. We're all bros. We get up there. We get on the air tram that we realize around the wrong air tram step off wait for the next air tram. Never comes like all right we'll get on the other air tram. It'll just",
      "start": 1640.8
    },
    {
      "text": "bros. We get up there. We get on the air tram that we realize around the wrong air tram step off wait for the next air tram. Never comes like all right we'll get on the other air tram. It'll just go. It'll be a little bit longer. We get on that air tram and look at the map. It's like well no that's gonna be way longer. Get off at the next stop. Get on the right tram. It goes like three stops. Then it's like it goes all the way to the stop before the one we're supposed to be at. And then stops. And it's like and then after maybe five minutes someone comes over the this is temporarily out of service. I'm sorry. No update. Yeah. It didn't say leave. It didn't say they were just like that's it. So we get off. We walk down we walk over get to Nick's car drive over to Tim's house to break up and switch out. So Colin and I'll go with Tim with the bags to bring back to HQ. You'll take Grimy home. And I'll take poor poor Grime Craft who has been in our car that been with us at",
      "start": 1677.36
    },
    {
      "text": "to break up and switch out. So Colin and I'll go with Tim with the bags to bring back to HQ. You'll take Grimy home. And I'll take poor poor Grime Craft who has been in our car that been with us at this point for an extra hour and a half. And he's just like that. I was like that $40 Uber ride would have been worth it. He's like I know it's I'm having fun. I get a good time. We get there. Tim's car's gone. My brother took my car without telling me. So there was no way to get back to Greg. So then Nick had to drive us all completely out of his way to Greg's house. And my Lord it's uh it's clear. It should be clear that by this point this stuff wasn't United's fault somehow. I was looking things up because I know I've read this before. So in 2013 it says this was like based on 2013. Says Virgin America headquartered in Berlin game California did the best job on baggage handling and had the second lowest rate of passengers United seats due to overbookings. United United",
      "start": 1714.64
    },
    {
      "text": "on 2013. Says Virgin America headquartered in Berlin game California did the best job on baggage handling and had the second lowest rate of passengers United seats due to overbookings. United United airlines whose consumer complaint rate nearly doubled last year had the worst performance. United has merged with Continental Airlines but as rough spots and integrating the operations of the two carriers. That was in 2013. Then last year it said that it's on time. A rivalry was a little over 75%. So can you imagine paying and there were airlines like Hawaiian Air and Alaska that are in like the nineties. So can you imagine paying all this money and then just one out of four times they're just going to just like no I don't have to imagine it. It's one out of every four times. I'm like this ah United it's any time. Honestly it's anytime I'm not on Virgin America I have some fucked up experience. Like something's late delayed whatever. It's not that Virgin's perfect. I've had a",
      "start": 1757.28
    },
    {
      "text": "ah United it's any time. Honestly it's anytime I'm not on Virgin America I have some fucked up experience. Like something's late delayed whatever. It's not that Virgin's perfect. I've had a couple little issues but they're always little things. They're they handle them. Well that's always the it's delayed. Here's why it's delayed. Here's when it's going to be fixed. Thank you Virgin. The socks but thank you. When we were at IGN like everyone had such a freaking boner for United because everyone's like oh man we've been flying it for years. So we have all these like points and shit. I'm like but you have points for something that's horrible. It sucks. Like no one wants to be a special member of United. I don't want to get on that plane early. I'm just going to be on it for three more hours. That's true. But if you are premier like that you do have some good perks. Like they have that other the whole other security line that you can go through which is nice. But you",
      "start": 1789.6
    },
    {
      "text": "three more hours. That's true. But if you are premier like that you do have some good perks. Like they have that other the whole other security line that you can go through which is nice. But you know at the same time yeah if you're not if you don't spend thousands of dollars in the airline they treat you like the bottom of your shoe where they're like ew I don't want to interact with you. I don't want to give you anything and everything's going to cost you twice as much. The Economist which is a great magazine says the United merger is a grand and it's citing it's citing someone talking about this. So he says United merger is a grand example of a consumer sinkhole a merger that proves to be not just an one-time event but an ongoing disaster for consumers and shareholders who suffer for years after I wasn't the only one who had noticed the airlines descent since 2011 United has piled up a mountain of consumer complaints. According to one report only Spirit Air which",
      "start": 1828.24
    },
    {
      "text": "suffer for years after I wasn't the only one who had noticed the airlines descent since 2011 United has piled up a mountain of consumer complaints. According to one report only Spirit Air which is notoriously bad. I'm throwing that in there. Spirit Air is like the Ryanair of the United States right? Like you get charged for like everything. It has more complaints it says and has repeatedly tallied some of the worst quality rankings in the nation trailing even discount airlines like Frontier and AirTran. A website named united.com collected these complaints. United tried to sue it out of existence. And what they're basically saying is like it just it's just the nature of how big they are and how bloated they are. I think. And the the the the the funny thing I say about Virgin I think I've told the story before that I flew Virgin literally the first week Virgin America literally the first week they existed to LA. This was in in the spring of 2008. And uh my plan was",
      "start": 1860.32
    },
    {
      "text": "I think I've told the story before that I flew Virgin literally the first week Virgin America literally the first week they existed to LA. This was in in the spring of 2008. And uh my plan was delayed four hours out of San Francisco and I was just going to LA and uh the pilot like they had a whole scheduling fucking snafu like where the pilots and the flight attendants like had no idea where they're supposed to be. And she was like all sorts of fucked up things. And I remember the story specifically that I've told is that they had problems with their jetway and stuff. And then we're like openly like like saying like that they feel like their competitors were fucking with their jetway and stuff. And I was like what the fuck? And even at that time I was like I'm never flying Virgin American and these guys suck. And for like a year and a half like I didn't and then like they started getting their shit together. And that's the kind of the point of these particular stories is",
      "start": 1900.8
    },
    {
      "text": "American and these guys suck. And for like a year and a half like I didn't and then like they started getting their shit together. And that's the kind of the point of these particular stories is that it just seems like they're not United just can't get its shit together because I know United is considered awful. You know like it's considered a bad airline and that doesn't just happen for no reason. No one talks about Delta. No one talks like that. And I'm sure Delta is not very good or but no one taught like United just seems to be synonymous in many ways from what I've just read anecdotally on the internet or on Twitter and stuff with just like a really bad customer experience for a lot of people. And I would never voluntarily fly them unless like I ha I absolutely had to fly this airline. Like I was like Kentucky's a good example. Like we just couldn't figure out another way to get there. Right. Right. Yeah. We thought about a train but even but remember even when we went to",
      "start": 1932.08
    },
    {
      "text": "Like I was like Kentucky's a good example. Like we just couldn't figure out another way to get there. Right. Right. Yeah. We thought about a train but even but remember even when we went to that's a great example. Even when we flew United and and went to Kentucky and had a fine flight there then they lost our luggage. You remember that? Yep. How can I forget? Like I was like what the fuck? You know they I remember we were with Sin and we were with Cheryl and they just lost their luggage. Didn't when they rolled up didn't they almost give Sin the wrong bag too. He wasn't paying attention. So it's always something you know what I mean? It's even to get we get off and we're like all right that was fine. We got here on time. We're in Louisville and then we go and get our bag. And they're like just two of our bags just aren't there. It's like Oh okay. The only good thing about this whole experience and being stuck on that United flight forever was Crime Craft. Crime Craft",
      "start": 1970.08
    },
    {
      "text": "they're like just two of our bags just aren't there. It's like Oh okay. The only good thing about this whole experience and being stuck on that United flight forever was Crime Craft. Crime Craft was amazing. That's where we met him. Good things. There was that. And then there was the world's cutest dog was on that flight. Also every time I saw that dog I was like okay I'm okay. I can make it another hour. I was right here. You assaulted me and play him out like that. Well there was a younger cuter dog. He was a puppy. He was a puppy. He was good. Cutest puppies. Fun. If you didn't know ladies and gentlemen this is the GameOverGreggy Show each and every week for sometimes five best friends gather on this table. He's bringing around a topic of discussion for your amusement. If you like that head over to Patreon.com/kindafunny where you can get the shows early each and every Friday. But if you don't want to give us any money it's no big deal. Head over to",
      "start": 2006.88
    },
    {
      "text": "If you like that head over to Patreon.com/kindafunny where you can get the shows early each and every Friday. But if you don't want to give us any money it's no big deal. Head over to YouTube.com/kindafunny where we put it up day by day topic by topic until we post the entire thing is one big video and MP3 for your amusement on YouTube and podcast services around the globe. So I'm just reading this. It says I'm reading I'm reading the street.com. This is interesting. This is very interesting. It says what's wrong with United Airlines a little bit of everything. And the story says uh beleaguered United poses the airline industry's biggest question. What's wrong with United. No one seems to be able to answer it with certainty. United has generally disappointed since its 010 merger blah blah blah. It says now United is under the microscope but no one has isolated a single cause for its continuing underperformance. Rather. It seems to be a multitude of",
      "start": 2044.8
    },
    {
      "text": "since its 010 merger blah blah blah. It says now United is under the microscope but no one has isolated a single cause for its continuing underperformance. Rather. It seems to be a multitude of problems are to blame. The airlines pilots have been the most vocal critics and a letter to members in April leaders of the airlines Newark pilot domicile called on CEO Jess Smith who we found in the uh the magazine to step down. They blame problems in intercompany communications bad morale excessive outsourcing and chronic information technology issues from driving away premium passengers quote Delta and American get the suits. We get the flip flops and backpacks. They wrote is that is that it's fucked up man. Yeah. It's like I mean you you know you want it you're any kind of customer I would assume but aviation consultant Bob Mann said he wonders whether executives know what they're doing. What's wrong whether they have done something and are waiting for a response or",
      "start": 2079.28
    },
    {
      "text": "customer I would assume but aviation consultant Bob Mann said he wonders whether executives know what they're doing. What's wrong whether they have done something and are waiting for a response or whether they just they don't know and are just struggling. So it's a it's a question. It's an open-ended question. We you know it's it sucks to have to beat up on United so much but it's just like that's kind of it seems like in other words it seems like that's a reputation they've actually earned with a lot of people. Anyway my digress. Tim. Yeah. What's your topic? My topic Greg early today at lunch we were talking we're eating we're doing all this stuff. We do you brought up those things at lunch. Yes. And uh you brought up this Joker fan theory. Going on about the Suicide Squad movie and about the DC universe as a whole. Yes. And how the Joker fits into it and who he might be and all this stuff. And it sounded really interesting. And I don't know anything about it",
      "start": 2112.64
    },
    {
      "text": "Squad movie and about the DC universe as a whole. Yes. And how the Joker fits into it and who he might be and all this stuff. And it sounded really interesting. And I don't know anything about it because I was working during lunch. It's also something I do. That's you're using the word working with you're working with Bradley. I want you to explain this to me. All right. So ladies and gentlemen if you didn't know I'm a big DC Comics fan. We've third week in a row where we've had some a DC Comics movie topic which makes me incredibly happy with my life. But what happened is uh last week on Reddit a user posted a theory about who Joker was in the cinematic universe. And people tweeted at me a whole bunch about it. Have you read this? Have you read this? And I was like eh it sounds interesting. I read it. I'm like eh it's interesting. I like it but whatever. And then Angry Joe did a video about it today. Shout out to Angry Joe go watch it where he went through and showed his",
      "start": 2150.08
    },
    {
      "text": "interesting. I read it. I'm like eh it's interesting. I like it but whatever. And then Angry Joe did a video about it today. Shout out to Angry Joe go watch it where he went through and showed his friend about it. And when I saw it I'm like well I should present it to my friends too. You guys of course. And of course the best friends watching. So we are the best friends you've ever had. Hey I'm your friend. So it's Colin and Tim and Kevin. Well don't throw Kevin. We're being nice to each other. We talked about that. We're being nice to each other. We never said anything about Kevin. If this was a cigarette I take a drug and I go ah flicking Adam like that. Right in his crotch. Oh my God. All right. So where we're starting here and there will I'm going to eventually move into one spoiler for Batman Arkham Knight one spoiler for an right. And I'm it's not going to be read in here but I will get to it soon. We will do the whole head pat thing where I turned on give you",
      "start": 2188.8
    },
    {
      "text": "one spoiler for Batman Arkham Knight one spoiler for an right. And I'm it's not going to be read in here but I will get to it soon. We will do the whole head pat thing where I turned on give you my Arkham Knight spoiler and then had tap it off. Nope. That's now you're confusing them. Maybe they just turned it off. They don't even know what that means. So this one comes from fan theories over on Reddit Jason dash G one six nine. All right. Um six six nine 69. Oh Jesus. Let me preface this by saying this theory has been around for a while and I just want to go a bit more in depth. Also I love the Jokers look. So this theory is not some excuse because I dislike the design. The Joker we're going to see in Suicide Squad is Jason Todd. Everybody from the Jason Todd. Yes. You break Todd's brother. Second Robin Sweeney Todd's brother. Second Robin. He took over after Dick Grayson in traditional cannon killed by the Joker. Right. Beaten with a crowbar. When was he? When was he the",
      "start": 2228.96
    },
    {
      "text": "brother. Second Robin Sweeney Todd's brother. Second Robin. He took over after Dick Grayson in traditional cannon killed by the Joker. Right. Beaten with a crowbar. When was he? When was he the demon barber of fleet street? I'm making Broadway jokes now. No I know. It's good. Johnny Johnny. Johnny depth jokes. Uh being the death by the Joker in a death in the family. Then he came back and he was Red Hood running around doing that thing and stuff. Um I know what you're thinking. That's kind of lame. The Joker is the Joker not Jason. My theory consists of number one the newspaper with the you let your family die. We saw this in the Batman V Superman trailer right? Where we looked at it and said oh well it's somebody writing in because the way the Wayne building got destroyed in Metropolis. And those people die. Of course it would make sense if Jason's doing that and calling out the fact that number one he's a failing. And then that'd be on that. And it was also it looked",
      "start": 2275.36
    },
    {
      "text": "Metropolis. And those people die. Of course it would make sense if Jason's doing that and calling out the fact that number one he's a failing. And then that'd be on that. And it was also it looked like it was the Joker writing right? It looked like that that that scrawled out scratched out Joker writing the next piece of evidence the Robin suit and the Memorial inside the Batcave. Another part of the Batman V Superman trailer that Robin suit that says ha ha ha jokes on you. And then this Joker looks very odd and completely different from what we're used to. It is probably just a design choice but it could be because Jason is the Joker and does things his way. This theory now goes into a whole bunch of in depth but we'll just go around because you don't need to do it. Right. Jump around a bit. What I like about the theory is there's a whole bunch of interesting things in it. The Robin suit inside the Memorial Batcave ha ha jokes on you Batman. What's interesting about it",
      "start": 2320.96
    },
    {
      "text": "around a bit. What I like about the theory is there's a whole bunch of interesting things in it. The Robin suit inside the Memorial Batcave ha ha jokes on you Batman. What's interesting about it is that looks like it would be fresh right? Like why would Batman Batman always has the suit up for Jason Todd in in in the glass case. They all right. This is you know we're not honor Jason's memory. This Robin who passed away or whatever beaten to death. This would imply that he I don't think he would keep it up if it was a defaced from the get go. So what is it defaced in this movie? Is it defaced in the timeline we're dealing with? Right. And if so how would the Joker know how to get in there? Joker then know that Batman's Bruce Wayne. Is it not that I know anything about it. It's possible that it's a reminder of his hatred or like how he's target. And he so that's always been the condition of the suit. It's very possible that that's the case. It just seems out of character",
      "start": 2357.04
    },
    {
      "text": "possible that it's a reminder of his hatred or like how he's target. And he so that's always been the condition of the suit. It's very possible that that's the case. It just seems out of character from what we've ever seen before. It does seem like a dis disrespected Jason more than disrespected Batman but it could be a motivational factor. I agree with that one. That's that's that's how I wrote it off in my head that it was there to keep him motivated. Yeah. I don't think that's too crazy to assume. I would think I wouldn't imagine that that was a fresh thing that just happened. Sure. Next. The you let your family die thing in the newspaper. I like that makes sense to an extent. Cause why? Cause you know very few people outside of us refer to their their coworkers as family right? I don't think that's a normal thing. And so unless there's Dominic Toretto does. It's true. There's been theories of course that the girl Bruce is running up to in the trailer is actually his",
      "start": 2391.68
    },
    {
      "text": "right? I don't think that's a normal thing. And so unless there's Dominic Toretto does. It's true. There's been theories of course that the girl Bruce is running up to in the trailer is actually his daughter. Maybe then his wife dies in the building. You know what I mean? Uh there's been theories that maybe the paper with the scrawl on it is just some the range family member blaming him for the death. But why would you blame what he opened to Wayne Enterprises building in Metropolis? So now he's liable for everyone getting crushed by a bunch of super powered heat vision dudes. That doesn't make much sense. Jason using it against him would make sense especially with the same kind of scrawling handwriting. Right? This is interesting because without knowing this theory at least those two things you said I didn't think of it the other way. I thought of it this way like from the get-go. I didn't think of it being the family dying in the building. I thought of it as some Joker shit.",
      "start": 2431.2
    },
    {
      "text": "things you said I didn't think of it the other way. I thought of it this way like from the get-go. I didn't think of it being the family dying in the building. I thought of it as some Joker shit. Yeah. Yeah. Okay. Okay. So why how would but again then how would Joker know that Bruce is Batman or is Joker's writing to Bruce Wayne and saying you let your family die. See what I mean? Like what's his motivation there? Like that's the thing is like I can make a million assumptions and reasons for all these things and like Oh but I don't have the motivation for them. Well maybe the Joker knows but he's the Joker. So he's not going to tell anybody you know there's been storylines like that. Like even the current Batman run where like he knows it's Bruce Wayne but he's not telling people because that's not what it's about. Yeah. Yeah exactly. Would I have another question? I have a question. Lay it on me. If Robin suit with Joker's text is on is in the capsule and that's in",
      "start": 2465.44
    },
    {
      "text": "people because that's not what it's about. Yeah. Yeah exactly. Would I have another question? I have a question. Lay it on me. If Robin suit with Joker's text is on is in the back cave presumably. Wouldn't if if the suggestion is that that's fresh then Joker is somehow broke in to do that. Right. Then wouldn't he know that Bruce Wayne was Batman? Yes. As we're talking about. No I know. So like I guess I'm just not understanding necessarily why wouldn't he just blow that up? He's the Joker. Yeah. Like that's not the point. I guess that's what I mean. That's the thing is like in that would be like a huge that would be a big secret. I feel like I feel like on this we're getting one of the reasons why I don't think that this stuff's a reality is because there's just this is too hard to tell in a story that's really about Batman versus Superman and Lex Luther. But here's the thing I think we're all overlooking in a lot of ways. And I think I overlooked",
      "start": 2506.08
    },
    {
      "text": "just this is too hard to tell in a story that's really about Batman versus Superman and Lex Luther. But here's the thing I think we're all overlooking in a lot of ways. And I think I overlooked too. And that the theories makes very very interesting is the fact that yeah this is a lot to tell and to drop into Batman V Superman dah dah dah dah. What if the Joker is not established? What if I mean like cause here let me I mean like let me let me go and here's the way the theory here's the way the theory is built on right. That if Joker is Jason Todd right. And this is where I'm going to pat my head and give you the Arkham Knight spoiler here. So stick out of it for a second. I'm going to rub my tummy. Arkham Knight of course does this thing. You you've beaten it now right? No I'm not to the end but I know what happens. So you can. Okay cool. And so you've beaten it. You know what I'm talking about where I'm going with this. They have the whole great flashback",
      "start": 2547.84
    },
    {
      "text": "No I'm not to the end but I know what happens. So you can. Okay cool. And so you've beaten it. You know what I'm talking about where I'm going with this. They have the whole great flashback scenes of Joker torturing Jason Todd and making him crazy and making him fall in line and think like the Joker. Reprogramming him. Exactly. Reprogramming him to be this you know killing machine out to stop Batman to do all these different things. What's awesome is at one point you know he brands Jason Todd puts a J underneath his tear which Leto's character has. Leto's Joker has a little branding J on his face which now is fucked up as the rest of the shit is on and whatever. No big deal. Right. But like the theory goes into the interesting points of like the branding's interesting. Obviously his teeth are all fucked up. Right. And we think it's just cause he wants to have grills or whatever. What if he got his teeth fucking beat the shit out of him with a crowbar then put his on there.",
      "start": 2587.36
    },
    {
      "text": "his teeth are all fucked up. Right. And we think it's just cause he wants to have grills or whatever. What if he got his teeth fucking beat the shit out of him with a crowbar then put his on there. The damage shit all the stuff written on him him is this young kid re-released into the wild totally out of his out of his mind. Now the story I'm going to unpack my head now. Okay. So let's not talk about let's not talk about the Batman Arkham Knight stuff anymore. I'm unpacking my head now. We're done with the Arkham Knight spoiler there. The theory that goes into this right. Is the fact that in this world Batman V Superman let's say Batman beat Joker already. He didn't kill him obviously but his story wrapped up and we he knows he's dead. Joker's dead. You know we saw the body. I know how this is. And then he gets the paper and opens it up and your family's dead. And that Joker scrawn. He's like what the fuck? You know what I mean? Cause it looks like Joker's handwriting",
      "start": 2625.84
    },
    {
      "text": "I know how this is. And then he gets the paper and opens it up and your family's dead. And that Joker scrawn. He's like what the fuck? You know what I mean? Cause it looks like Joker's handwriting right? I think they could easily be reintroducing here Joker. And he's like I know Joker's gone. What are you fucking talking about? And then he sees him and knows it's Jason Todd that this is something that happened. This is how it's spriteled out from just the sheer storytelling perspective. It's kind of that would be an interesting and almost brilliant move because then you would be you would essentially be taking away the number the biggest chance for criticism that movie's going to have which is the Joker wasn't as good as Heath Ledger. But if it's a different Joker if it's literally a different character altogether playing the quote unquote Joker like similar to Beyond right. Where they had the Joker was in Batman Beyond but it wasn't the Joker. It was like a new gang of",
      "start": 2667.6
    },
    {
      "text": "a different character altogether playing the quote unquote Joker like similar to Beyond right. Where they had the Joker was in Batman Beyond but it wasn't the Joker. It was like a new gang of Jokers right? Right. So what's that? Nothing. Am I wrong? No you're right. I haven't watched Batman Beyond too much but I know they had a younger Joker that was they were just they were like Hey we want to be the Joker. We're taking up the mantle of the Joker. So in this case it would be actually pretty fascinating to watch that because then people really the argument of like he's not as good as Heath Ledger's Joker would kind of go away. Cause you're saying essentially it's not the same character. It's someone playing the Joker playing or someone playing a character playing the Joker. If that makes sense. But I have a question about this. Sure. And we have to talk about Arkham Knight again. I'm going to tap my head. My fluffy hair. I have to cut. It's getting a little spikes on the",
      "start": 2702.72
    },
    {
      "text": "that makes sense. But I have a question about this. Sure. And we have to talk about Arkham Knight again. I'm going to tap my head. My fluffy hair. I have to cut. It's getting a little spikes on the sides. I don't care. I like it. Oh thanks. Yeah it is what it is. If that was true specifically the branding then that means Arkham Knight is canon. I'm not saying it's the exact same thing but I'm saying is it I mean is it possible that art like that that it's this the well is so deep that these games specifically Arkham Knight and the Arkham Knight himself as a character which they just made up is then the Joker in this. And so that's canon. That's almost a necessary prerequisite for understanding this movie. Right. Like that theory would suggest that if these characters are the same. No because they've already they've already are we still in spoiler line? I can't remember. Yeah we we have already tapped our heads. No because I mean that was one of the that was one of",
      "start": 2734.16
    },
    {
      "text": "No because they've already they've already are we still in spoiler line? I can't remember. Yeah we we have already tapped our heads. No because I mean that was one of the that was one of the issues I have with the game was that it was actually I liked it better when he was Red Hood. I liked I liked that storyline better. Like it was basically the exact same story but they just instead of like making him Red Hood they made him Arkham Knight which is completely absurd. You were like well okay. And you saw it coming from the second you saw him in that chair. And that very first flashback you're like well you heard it it was both true. But I guess I don't understand the relevance of the branding then in Arkham Knight if they're not connected. It's just like a nod. It's not so much like a it's in the literal same continuity but it's more just like oh I'm going to take that aspect that aspect like in the same way that you know in the original storyline Jason",
      "start": 2781.04
    },
    {
      "text": "not so much like a it's in the literal same continuity but it's more just like oh I'm going to take that aspect that aspect like in the same way that you know in the original storyline Jason Todd gets beat but he gets beaten a bunch of different ways depending on what the thing is but it all comes from that original source point. So it was like this it could just be like getting inspiration from it and like you know going from there. Yeah. Plus you know it's just too complicated. That's that is my big thing. I'm sorry. We're done. We're done with the Arkham Knight part. That's the big part is that it is really complicated. And I think yeah but I think if you do it where Batman V Superman is two three nods that are setting Bruce even more on edge of he gets this thing what the fuck? He comes home to the cave and the cave the Jason Todd statue has been defaced. You know what I mean? Like his suit's got haha jokes on you Batman written on it. That's the Easter",
      "start": 2811.68
    },
    {
      "text": "what the fuck? He comes home to the cave and the cave the Jason Todd statue has been defaced. You know what I mean? Like his suit's got haha jokes on you Batman written on it. That's the Easter egg in that movie. Not even showing Leto ever in that movie. That's setting up Suicide Squad of like there's a new Joker in town. Meanwhile from what we've seen right? This Joker that apparently has enough money for his own Lamborghini and all this crazy stuff which you assume Jason Todd had a trust fund or whatever. You know what I mean? Like it's a weird theory that my first reaction to Joker just steal shit whenever he wants. I'm just putting that out there. He steals custom cars. He does whatever he wants. The Joker. I know he does whatever the fuck he wants but what I'm saying is this I mean they're trying to ground it make it more ground. If you were like wait a minute Jason Todd's the Joker. Maybe I should cancel Jason Todd's trust fund or maybe I should have done that when",
      "start": 2853.52
    },
    {
      "text": "I mean they're trying to ground it, make it more ground. If you were like, wait a minute, Jason Todd's the Joker. Maybe I should cancel Jason Todd's trust fund or maybe I should have done that when he was dead. Yeah. Anytime. Yeah. The one that my sticking point is still what I was saying before, even though we had established the, why wouldn't Joker just, it's the same. It almost reminds me of the Dark Knight Rises where like they tried to ruin Wayne specifically, like Wayne Enterprises, even though Bane didn't necessarily know it was a whole weird happenstance about the bomb and stuff like that. But like to acquire the weapon, I guess, but why wouldn't they just, why wouldn't they just ruin him? You know what I mean? Or out him? Well, no, I mean, because he wants to fuck with him. Forgot about it. You left him abandoned. You let this happen to him. You left him for dead. Yeah. That makes sense because he was like, he couldn't save him. And because of that, he was tortured almost",
      "start": 2888.56
    },
    {
      "text": "about it. You left him abandoned. You let this happen to him. You left him for dead. Yeah. That makes sense because he was like, he couldn't save him. And because of that, he was tortured almost nearly to death. And so there's retribution behind it, which I, I can appreciate. I like this. I did the more and more you started explaining to me, the more I'm like, I hope they go in this direction because it would really set the series apart from the Joker movies that we've seen. In addition to that, I mean, what does this lead up to? The Batman standalone movie where he would, whatever character he is, whether it's Red Hood or whatever, be the bad guy. And like, I love that. That sounds really cool. People have called out too, that like, and this, this is something we've seen from the first image that when David Ayers put out that a photo of Jared Leto, like there's a, it looks like a wing thing on his arm, which originally people were like, oh, it's like, he, cause he's already killed",
      "start": 2933.6
    },
    {
      "text": "image that when David Ayers put out that a photo of Jared Leto, like there's a, it looks like a wing thing on his arm, which originally people were like, oh, it's like, he, cause he's already killed Jason Todd. He put that there. And now people are thinking, maybe it is a nod to him being, having been a Robin or whatever. I don't know. Could explain the tattoos too. Cause if someone was to tattoo you, maybe they would do that as, as just to screw with you. Right. That's a great point. Yeah. That's not even, yeah. It's not even a thing that he's doing. It's something that did well towards just like the J. Mm. Mm. Be interesting. Yeah. But I agree like that. My first reaction to it was funny fan theory. Sure. Then it was like, well, yeah. If they, if it was, cause when you hear it, you think it's all gonna have to be in the same movie or it's all going to be in Batman V Superman, or it's all going to be in Suicide Squad. But if you parcel it all out and make it in a giant lead up to the",
      "start": 2969.84
    },
    {
      "text": "it's all gonna have to be in the same movie or it's all going to be in Batman V Superman, or it's all going to be in Suicide Squad. But if you parcel it all out and make it in a giant lead up to the Batman, you know, see that makes sense. I mean, cause that is what Marvel did with the Avengers movies. Yeah. Leading up to Avengers. Yeah. It's all the little bits and pieces. Like you hear, and then mentioned, you hear all this stuff. And then when it happens, you're like, oh yeah. Like it just kind of feels right. This is I forget. So originally when I said that, I don't think they do that because it's too, it's too hard of a story to tell in Batman V Superman. I forget. We're going to see Joker mainly in Suicide Squad. Right. Uh, so they'll start. Yeah. I mean, that's a, it's a brilliant idea of like to, to sort of retell his backstory throughout those movies leading up to that. That's standalone Batman movie. It could be cool. But is it possible that Leto is also in Batman V Superman",
      "start": 3006.08
    },
    {
      "text": "of like to, to sort of retell his backstory throughout those movies leading up to that. That's standalone Batman movie. It could be cool. But is it possible that Leto is also in Batman V Superman in some respect? Sure. I'm interested. I kind of doubt he's going to be, but like actually in it, like I'm sure just these nods, nods and references to the Joker and all that stuff. I don't think he'll be in it, but I mean, that'll be, I mean, that'll be a giveaway. I don't know. You imagine they'd have to confirm at some point early on that, you know, how can you even trust that Batman? He killed like Joker guy or whatever. And then I don't know all the starts happening. He killed the Joker guy again in this theory. He was, yeah. I mean, then the original, we have to assume that Joker, we have to assume that Batman has been out of, out of commission for a while. Right? Like they're still talking to him as the vigilante. Like he's the older Wayne. We're assuming he's kind of coming back into",
      "start": 3043.12
    },
    {
      "text": "assume that Batman has been out of, out of commission for a while. Right? Like they're still talking to him as the vigilante. Like he's the older Wayne. We're assuming he's kind of coming back into, into it. I haven't. That's been very confusing when you hear and look at this stuff. Right. Is he out of practice? Is he still going? I'm not a hundred percent sure. Okay. Yeah. I mean, that, that to me would be, that's the second point to me. Cause if he hasn't been the Batman for a while, if it really is the Dark Knight story or the Dark Knight Returns story where he's been gone from the public eye for 10 years or 15 years, um, then yeah, that would be a dead giveaway that this Joker's new. Cause presumably that and the other Joker's dead or has died or is gone or is something like that. There's no way the Joker stays in prison for 15 years. I mean, I know we all kind of want it and assume it, but like, have they even hinted at all that that is the story they're going with where it's him",
      "start": 3077.28
    },
    {
      "text": "no way the Joker stays in prison for 15 years. I mean, I know we all kind of want it and assume it, but like, have they even hinted at all that that is the story they're going with where it's him kind of being on it? No, it's, it's, that's the problem. Watching the trailer. It's like, it's not clear that Batman is just starting now. No, no, no, no. He's not, he's definitely not starting now. But my, the, what I'm, what I'm questioning is whether or not they're doing, and this is solely because of the suit that, that, that unbelievably awesome homage to the Dark Knight Returns where he has to, in order to fight Superman, he has to make the, like get the big electrified suit. That was what, and the gray in his hair and the fact that he's a bit older and the fact that like, you know, some of the, some of the dialogue with him and Jeremy Irons about like what turns men cruel. Yeah. I just made, and that's me just maybe bringing my own stuff to it and hoping that they tell that story.",
      "start": 3122.56
    },
    {
      "text": "of the, some of the dialogue with him and Jeremy Irons about like what turns men cruel. Yeah. I just made, and that's me just maybe bringing my own stuff to it and hoping that they tell that story. There's enough, this is a problem with the trailer. And I mean, I mean, obviously the comments will for sure correct me if I'm wrong. I just haven't seen it spelled out on any of the fronts. If he stopped, there's a lot, there's definitely a ton of imagery in there where I could easily again, make the case. I mean, he walks up, you know, when he's gonna, and drags the fucking thing off the top of the bat signal as if it hasn't been there for a long time. Like it's been, it gets bent out of use forever. You know what I mean? Like the spinning suit could easily be another thing of like that when Jeremy Irons, I'm sorry, when Jeremy Irons is, or I assume it's Jeremy Irons, cause it's right before he's walking up to what looks to be a ramshackle main Wayne Manor. You know what I mean? Like, I'm",
      "start": 3156.32
    },
    {
      "text": "Irons, I'm sorry, when Jeremy Irons is, or I assume it's Jeremy Irons, cause it's right before he's walking up to what looks to be a ramshackle main Wayne Manor. You know what I mean? Like, I'm not a hundred percent sure if yeah, he's in the cave for the first time forever. If he's in the first time forever and then he finds, haha Batman jokes on you. And he's maybe Joker stolen a whole bunch of shit cause he is Jason Todd. That seems more likely to me. I was just gonna say, I love that meme that's going around with, with that shot of him pulling off the, the thing off the bat, the bat signal where he's like, Batman is calling Batman. You know, shit's getting real with Batman's calling Batman. That's awesome. No, but that's the thing is like when you start, you know, I don't know, I try not to fuck around with it too much. Cause I want, it's going to be so hard for me to be surprised by anything in this movie because I'm going to devour everything that comes out. So I try to stay away",
      "start": 3189.2
    },
    {
      "text": "to fuck around with it too much. Cause I want, it's going to be so hard for me to be surprised by anything in this movie because I'm going to devour everything that comes out. So I try to stay away from, but once you start falling down, like I thought the totally preposterous and then we stop and think about it from a storytelling perspective. And if there is time off and there is that, and like, it could actually be that, you know what I mean? But if it is that let's, let's assume for one second that it is that, yeah, I think that's kind of cool. I would be like, that's smart. If it's that it's awesome. And it totally makes sense to what you're saying is like the fact that, yeah, you know, we don't have to worry about living up to Heath Ledger cause this isn't trying to be Heath Ledger. It's similar to what they did with Star Trek where it's like, well, let's kind of reset it a little bit here. Yeah. You know",
      "start": 3228.64
    },
    {
      "text": "It's similar to what they did with Star Trek where it's like, well, let's kind of reset it a little bit here. Yeah. You know, I just wish they focused on some different enemies though. You know, that's a, you know, that's what Suicide Squad's for. But yeah, with all those classic, classic Junior Boomerang, like where it's like, I wish that like, there shouldn't be a worry about, about Heath Ledger's Joker. Cause they should leave that character alone. You know what I mean? Like at least in respect to the Batman core movie is not so much Suicide Squad. I mean, he's necessary there. That's fine. But like just explore some of these other characters, you know, like, well, I mean, they're sure like what's, what's up with the Riddler or like one of these other characters, like just why is it, why are we going back to that well again? We just went back. We just had that well not too long ago and it was really good. So just leave it alone. It's important because they're universe building here.",
      "start": 3261.52
    },
    {
      "text": "are we going back to that well again? We just went back. We just had that well not too long ago and it was really good. So just leave it alone. It's important because they're universe building here. Like this is the starting point and like the Joker is so connected to so many of these things. They should end there, but it's like, yeah, but not start there. Yeah. You need to have this to introduce everyone else. The Joker is the yin, the Batman's yang. Like you in order, if you want to really tell a good, a true Batman story, you're going to do that over a span of a few movies. The Joker has to be in that to some degree, whether it's a side character in the beginning and not the end. I mean, I understand what you're saying too, but the point is like, this would be a definite, this would be a brand new take on the Joker, which is really fascinating. Absolutely. I'm just saying that, like, I don't just as a cursory kind of Batman fan who just really likes the character and stuff, like",
      "start": 3298.56
    },
    {
      "text": "be a brand new take on the Joker, which is really fascinating. Absolutely. I'm just saying that, like, I don't just as a cursory kind of Batman fan who just really likes the character and stuff, like I'm not enamored at all with this Batman Joker, like relationship at all. Like I I'm much more enamored with, like, it's cool to have the guy that like wants to watch the world burn kind of thing, but it's like, I want characters that like are just crazier and you could tell like a different kind of story. I'm not saying they can't do that with a different kind of Joker, but if they want to, if they want to ultimately go to that yin yang kind of relationship with them, like they should end on it. They shouldn't begin on it because it's then like, where is you just going to be the bad guy in fucking three Batman movies? Like that would be lame as hell. But I mean, remember also we've got like Justice League coming up, right? So, you know, who's going to be the big bad guy in that dark side",
      "start": 3332.24
    },
    {
      "text": "three Batman movies? Like that would be lame as hell. But I mean, remember also we've got like Justice League coming up, right? So, you know, who's going to be the big bad guy in that dark side Brainiac. You have to get through a giant thing. And so you have to get through these slower, sort of smaller characters. Like I can't wait for the day where they actually decide to go Brainiac, like that's going to be really cool. And that story, even though we've seen it will be awesome to see on the big screen, right? Brainiac comes to collect the last Kryptonian for his menagerie of, you know, aliens and decides that he's going to destroy Earth in the process. It's cool. Dark side. That's going to be awesome. Right. But like, those are epic, epic, epic characters that you have to build up to. And if you do it right, they'll be cool movies. But I think that to get to that step, the number one thing they have to do is they have to get, they got to get over the stigma that is the Joker right",
      "start": 3367.76
    },
    {
      "text": "And if you do it right, they'll be cool movies. But I think that to get to that step, the number one thing they have to do is they have to get, they got to get over the stigma that is the Joker right now. Because that's really going to be the, that's going to be the point of comparison. Sure. I respect that. I respect that in the grander DC universe where we're talking about like a new Batman trilogy, for instance, or the Stan and one half like movies that are coming. I just don't understand where do they end then? You know, like the dark side is not going to be in Batman. No. So like, it's like, so you end with the Riddler, you end with Freeze or something like that. I'm just saying like, why wouldn't you start like, like, oh, you went work your way through a game to get to the last. I don't think they're true. They don't look at it as a trilogy anymore. Like this is Dark Knight trilogy trilogy. This is a movie in a series that has a bunch of other, I think to them there's no end.",
      "start": 3400.0
    },
    {
      "text": "I don't think they're true. They don't look at it as a trilogy anymore. Like this is Dark Knight trilogy trilogy. This is a movie in a series that has a bunch of other, I think to them there's no end. Correct. You know what I mean? So don't paint yourself in a corner, but get out the things people want and that movie goers want to go see and do things. Like people don't look at Iron Man as a trilogy. Yeah. You know, I mean the way, I mean like this theory is cool, right? And the only way it could be possibly cooler, right. Is if they set it all up or whatever and whenever, whether it's, it's not going to be Suicide Squad, obviously, because I don't even know Suicide Squad super interesting in this theory. Cause I always thought Suicide Squad was the Suicide Squad going after Joker. You know what I mean? Cause if it's not, I'm not a hundred percent sure how he interacts, which is fascinating and awesome and interesting. You know what I mean? If it's setting up Batman's standalone to be",
      "start": 3436.64
    },
    {
      "text": "what I mean? Cause if it's not, I'm not a hundred percent sure how he interacts, which is fascinating and awesome and interesting. You know what I mean? If it's setting up Batman's standalone to be him chasing down the Joker, he beats him. And then the after credit scene, what if after credit scene credits go black things. So people are sitting around and talking and then the purple suit walks in and the purple hat. And he's like, then it's Jack Nicholson. How fucking awesome would that be? That would probably break the internet. And they managed to keep that a secret. And you're like, wait a minute. You fell 800 stories. It's not the 89, but it's just an old, we need an old Joker. If somehow they tied the 89 Batman into all this, get the Penguin back in there too. Done. I got, it's so funny. Um, oh, you got to watch that. Uh, I brought it back for you. You got to watch that documentary. Cause it's really",
      "start": 3468.8
    },
    {
      "text": "into all this, get the Penguin back in there too. Done. I got, it's so funny. Um, oh, you got to watch that. Uh, I brought it back for you. You got to watch that documentary. Cause it's really, really fast. I'm now I'm in Ken Burns land, but I think you'd like this. Cause it builds into what I will like. I definitely will like it. They talk, they talk a lot about that too. Like Superman going to fight. And there's other, there's that famous, like, you know, like Kevin Smith's original screenplay was about him fighting Brainiac. And that was, it would be interesting. It's actually, those are out there floating. I've often thought about there and have you read them? Yeah. Um, I want to read them. I might start actually reading those on this next trip. Uh, cause it sounds pretty often and have half glasses and sit there on your thing and read them. I'm going to put the two little brackets in like they do with real scripts. That is the stupidest thing on the planet because the second you",
      "start": 3515.44
    },
    {
      "text": "half glasses and sit there on your thing and read them. I'm going to put the two little brackets in like they do with real scripts. That is the stupidest thing on the planet because the second you opened it, the brackets come out and the thing just falls apart. I'm gonna do all that. It's gonna be really fun. All right, good. I'm looking forward to that. Cool. Good. Great. Colin, what's your topic? Uh, so today people aren't going to see this for over a week if they're watching on YouTube, but today the, um, the site Ashley Madison was, uh, hacked and Ashley Madison is a website, a website of, of, uh, ill repute to some people that is designed to, um, to facilitate the cheating of, on spouses, like without, you know, I don't want to say without repercussions, but kind of doing discreetly. So you're basically finding, you're looking for people that are looking to cheat on their spouses and you're cheating on your spouse and you like set up a rendezvous. So it's like a dating site with",
      "start": 3548.88
    },
    {
      "text": "So you're basically finding, you're looking for people that are looking to cheat on their spouses and you're cheating on your spouse and you like set up a rendezvous. So it's like a dating site with, you know, kind of a more prerequisite is being married. Yeah. I mean, essentially, I mean, I'm not so my assumptions anyway, I want to talk about a grander thing because it peep. So that's what I was hacked in these hackers claim to have, and by now maybe this has already settled itself out in some way or another, but that's not really the point. The hackers claim to have 37 million people's information like names, credit card information and stuff. What's really damaging on like other websites, like where our healthcare provider gets hacked and they have your social security number or something, which is, these are all tragic things. What's interesting here is that this is a hack in which people are being held ransom for their impropriety and their immorality. And I was curious what you",
      "start": 3594.0
    },
    {
      "text": "which is, these are all tragic things. What's interesting here is that this is a hack in which people are being held ransom for their impropriety and their immorality. And I was curious what you guys think about a, the site existing, because I remember the site being a big deal a few years ago when it came out. And b, what you think about the celebratory nature of some people on the internet today and a lot of people on the internet that are like, that are like egging this on and want, and want these people to pay and stuff like that. And I tweeted out this morning that on one hand you live by the sword and you die by the sword, right? Like if you're going to do this kind of thing, then it's almost poetic in a way that you would be outed in some spectacle. Right. But I then tweeted and I said, I know this is not gonna be a popular point of view, but I just don't think these people deserve this. You know, like it's mostly because it's no one's business that this is happening. Like",
      "start": 3627.04
    },
    {
      "text": "I said, I know this is not gonna be a popular point of view, but I just don't think these people deserve this. You know, like it's mostly because it's no one's business that this is happening. Like they're not doing anything illegal. They're not, they're not breaking any laws or committing any crimes. They're not stealing. They're not murdering. They're not assaulting. These are consensual adults that are breaking the vows of marriage, but we cannot police immorality. And so I'm curious, like what you, what your guys take is on this situation because I don't, it's weird for me to feel bad for people that are, that possibly might get outed for being immoral, but you can't do this to people. You know what I mean? Like you, like, I just don't, I don't like, everyone has skeletons in their closet, everyone. And like, and they're not necessarily, they're not necessarily awful things, but there's just things about you or about your, your sexual life or all these things that you don't want",
      "start": 3657.6
    },
    {
      "text": "everyone. And like, and they're not necessarily, they're not necessarily awful things, but there's just things about you or about your, your sexual life or all these things that you don't want people to know. And it's, and it's no one's business. You know what I mean? And so I don't personally celebrate the culture of just fucking raising, and I mean, R A Z I N G of like, you know, raising the internet and just like burning everything to the ground and fucking just embarrassing anyone you can and outing anyone you can and just random fucking people that did nothing to you. Like, so what's your take on a, the website existing, Ashley Madison and B, what do you think about these people kind of being held hostage by this, this hacker group? That's, that's my thing is the thing that I always find fascinating about this, the same thing with what happened when all those, the cell phone pictures came out of all the celebrities, right? Which is, uh, the dialogue always seems to be about",
      "start": 3704.32
    },
    {
      "text": "find fascinating about this, the same thing with what happened when all those, the cell phone pictures came out of all the celebrities, right? Which is, uh, the dialogue always seems to be about whether or not they should store these pictures or send these pictures to each other and less about, it's more about that and less about why are we not trying to figure out and go after the people that have broken federal laws to hack into servers. Like at the end of the day, um, if it's a legal site and you choose to use it, sure, it's immoral, but if there's no law being broken, like you can't be prosecuted. The question is more how, why, why is it okay that people are allowed to hack into a private business and screw with its clientele and get away with it? Cause I'm like, have they caught those people from the cell phone bags yet? Like, has anything been done with that? Is it just an, I don't know. I think they did. I think they got, I think someone got arrested for that. I hope so. Um",
      "start": 3740.32
    },
    {
      "text": "people from the cell phone bags yet? Like, has anything been done with that? Is it just an, I don't know. I think they did. I think they got, I think someone got arrested for that. I hope so. Um, it's just one of those things like that, that always, that always, uh, makes me a little sad about society today where, you know, we live in a country where whether or not you're moral or immoral, you're still protected by the law. Um, and that doesn't necessarily always, uh, transfer over to the court of public opinion where people just decide that you're guilty because you've done an impropriety, um, and that you deserve your privacy. You deserve to allow someone else to break a law so that you could be shown for what you are, which that when you start going down that road really represents the fundamental decline of modern civilization. You cannot let that happen. Like, sorry, we are protected by laws, whether or not we decide to do ridiculously disgusting and immoral, immoral things. Um",
      "start": 3784.24
    },
    {
      "text": "fundamental decline of modern civilization. You cannot let that happen. Like sorry we are protected by laws whether or not we decide to do ridiculously disgusting and immoral immoral things. Um as long as we're not hurting anyone else or breaking the law, we are allowed to do that in this country. That's what makes it. That is one of the great things that makes this country amazing. Um so I just think I think it's always it's a little sad when you when you when you hear those stories cause you know the second you see that you're like no one's going to talk about the guys that are going to get arrested seven months for this after the FBI figures out who they are. They're just going to talk about the one guy that may or may not have had the consent of his wife to go on this website and do this or might've just been single and looking for someone to go on this website and and hang out with or have sex with or have some whatever sort of relationship he wants to have behind",
      "start": 3826.24
    },
    {
      "text": "and do this or might've just been single and looking for someone to go on this website and and hang out with or have sex with or have some whatever sort of relationship he wants to have behind closed doors. Um I don't think that's true though. I mean, I feel like there's like a lot of emphasis put on the people doing this and it being wrong. Sure. Always. You know, that doesn't make news when they get arrested, obviously. What makes more news is that I mean, we had no idea if those people from the celebrity picks got arrested. I remember seeing stuff like that and like there was so much articles about all that stuff. Like it definitely does make news. Like that is that is as big a news and it's not as big a news. Like why is it even something to be debated? Like it's wrong that people got their personal information put out there that they that they well, we're debating right now. There it is. There is a debate. There are people saying that these guys should be burned. But to",
      "start": 3863.28
    },
    {
      "text": "got their personal information put out there that they that they well, we're debating right now. There it is. There is a debate. There are people saying that these guys should be burned. But to Tim's point where Tim's I think what Tim's kind of getting at is that there is an imbalance between a situational imbalance that I don't think is is uneven. And what's ironic about it and we talked about it today on Colin and Greg Live is that what Gawker did last week when they outed that the CFO of Condé Nast and were completely complicit in his blackmailing and protected their source and outed this family dude out of context, a guy who by the way, denied that this should ever even happen. They just published a story. Anyway, everyone you almost unanimously was up in arms about the way they treated that guy, right? They just found a random person who is not a public figure. He's not a politician. He's not a guy who's out there being like I'm against blah blah blah. And I'm for",
      "start": 3898.08
    },
    {
      "text": "they treated that guy, right? They just found a random person who is not a public figure. He's not a politician. He's not a guy who's out there being like I'm against blah blah blah. And I'm for family values. And they caught him doing this. He's just some dude, right? Who happens to be a CFO and he's probably rich and who cares, but they found him and they they they they possibly ruined him. Right. And there's real life consequences for that man now regardless always forever whenever anyone Google's his name, it's over for him, you know, in that regard. And everyone was unanimously rightfully so upset about that. And then I wake up today and there's and it's not everyone cause some people are a lot of people are you know, there's a split, but people are like fuck these guys. And they deserve to be out. And then something like whoa, what is the difference here? There's no difference. Like there's no difference here. These people went to a website where they thought",
      "start": 3933.52
    },
    {
      "text": "guys. And they deserve to be out. And then something like whoa, what is the difference here? There's no difference. Like there's no difference here. These people went to a website where they thought they were protected. And to your point, we don't know the individual stories. I'm sure there are some scumbags out there. Guys with 10 kids who have three families who are getting in there trying to do horrible things and offering women money for sex. Like that's that's that's deplorable. And sure. And I don't agree with that. And I hope people don't choose to do that, but it's still legal. Exactly. And to that point, I even went a step further and I said this for a person who's on the internet or like doesn't have a a an internet presence with their names out there now associated with with Ashley Madison. And this is so people are going to associate these things forever. I'm like is it really right to color a random person on this site who might be cheating on his wife or she's",
      "start": 3972.4
    },
    {
      "text": "with Ashley Madison. And this is so people are going to associate these things forever. I'm like is it really right to color a random person on this site who might be cheating on his wife or she's cheating on her husband or whatever's going on? Is it really right to paint that person in that light only as if they've done nothing else with their lives? I know people that have cheated on other people and I know people that have been cheated on, you know? And I know that on both sides of those things, there are victims and it's wrong and it's fucked up. It's a fucked up situation. It's awful. But I know that people that I know people that have done that stuff that are actually good people and they make like a bad mistake or they make a bad choice. And I just feel like this is almost zero sum game of like well, the internet's going to fucking get you now. You know, I don't like that shit. It's awful. It's an awful thing. You can't the one I you know I I cited earlier with like you",
      "start": 4010.32
    },
    {
      "text": "game of like well, the internet's going to fucking get you now. You know, I don't like that shit. It's awful. It's an awful thing. You can't the one I you know I I cited earlier with like you know live by the sword, but die by the sword which is a biblical thing. And there's another biblical saying which is you know he who is without sin cast the first stone, right? Like you know as in which basically means like if you feel like you can judge this person then fucking do it, but you better be without sin yourself. And everyone not that I'm a biblical person or a religious person, but I do believe you could find a lot of morality especially in the new Testament. And that resonates with me. Like like I said, we all have things that we don't want people to know about us that are not necessarily bad or wrong. They're just embarrassing or they're you know whatever they are. They're not commonly upheld as okay. It's just it's just there's just they just don't want",
      "start": 4046.08
    },
    {
      "text": "that are not necessarily bad or wrong. They're just embarrassing or they're you know whatever they are. They're not commonly upheld as okay. It's just it's just there's just they just don't want them out there. Yeah. It's personal. It's just personal. And you know think about there's 37 million people that have used the site or 37 million. You said that number earlier and like Holy shit. So not cumulative right now, but 37 million over the time. Right. And that's so insane. It is insane. But like there's people that are probably lapsing their marriage and got back together. There's probably someone on there that cheated on their own old spouse and are with someone new now. And they're going to get outed. It's like it's going to cause massive complications. Why do people want to cause fucking chaos? Because that's what it is. It's just fucking chaos, you know? And I like why? And what's so weird about it to me is that the hackers are like I was telling Greg this the",
      "start": 4082.32
    },
    {
      "text": "to cause fucking chaos? Because that's what it is. It's just fucking chaos, you know? And I like why? And what's so weird about it to me is that the hackers are like I was telling Greg this the hackers part of their manifesto as far as I understand is the site said that you could pay $19 to scrub yourself from the site completely. And but but in fact, they've been saving everyone's data anyway. And to punish the site, they're going to release those people's names. That's basically it. And they said the only way to stop it is if the site is erased from existence completely. I'm like that doesn't even make any sense. Like so because the website wasn't protecting wasn't letting people to delete their information even though you the website had clearly no intent of releasing that information, you're going to steal it and release it. Right. And I'm like okay, that just simply doesn't make any sense. That's just straight anarchy. It's just anarchy. I mean these people just",
      "start": 4117.68
    },
    {
      "text": "information, you're going to steal it and release it. Right. And I'm like okay, that just simply doesn't make any sense. That's just straight anarchy. It's just anarchy. I mean these people just derive a sense of fulfillment and pleasure from seeing other people quote unquote be punished for their indiscretions. And for them to get headlines and stuff. Like people are talking about them. Yeah. I mean there's there's a there's a there's some sort of validation in this right. And I don't I and it's unfortunate. And like look, the sad thing is that people that can that have the intellect to be able to do this could do so much more with that talent. And you spend your nights and weekends trying to figure out how to hack a porn site or a hookup site, do something better with it, man. Like why why again, it's it's what we always say here. Why live in the negative? What are you doing that? What are you trying to prove with this statement other than you know how to be really",
      "start": 4154.56
    },
    {
      "text": "Like why why again, it's it's what we always say here. Why live in the negative? What are you doing that? What are you trying to prove with this statement other than you know how to be really nasty and makes one's life terrible. And like how's that going to make life ever better? How is that gonna make the world better? Yeah. It'd be really interesting to hear the people that did it like why they did it. Because if their reason is like outing these people because they believe that that's wrong and think that what possible good reason could there be for doing it? Well that's what I'm saying is not a good reason. I mean just like the reason they're doing it being like they believe that the adultery is wrong and like these people need to learn from like be punished for whatever. And it's if that's the reason they did it it's like man that's that's scary. That's like some God complex shit. Yeah. I mean it's messed up. And then the hope is that they they soon realize that",
      "start": 4192.32
    },
    {
      "text": "it's if that's the reason they did it it's like man that's that's scary. That's like some God complex shit. Yeah. I mean it's messed up. And then the hope is that they they soon realize that hacking is illegal and they get to go to jail for a while. So is it I don't really just know the technicalities of all this stuff, but there's no legal ramifications of cheating on if you're married. No it's not it gets a lot of cheats. Okay. Unless I mean the only ramifications is if you have a prenup then you'd be then you'd be liable for that and you'd have to pay or do whatever whatever your prenups say. But if there's no prenup then it's just you're just mean. You generally can't legislate morality. And we and we talked about that today too on Conte Greg that there are total examples of us legislating morality, but generally you you you know for instance, civil rights act, but like that's and but and there so there are certain examples and righteous I think right.",
      "start": 4226.32
    },
    {
      "text": "of us legislating morality, but generally you you you know for instance, civil rights act, but like that's and but and there so there are certain examples and righteous I think right. Right examples, but you can't go into someone's bedroom necessarily. I mean it's the same example we use. It's kind of congruent with the idea of like if two consenting adults want to get married regardless of their gender, let them get married. Who fucking cares? It's the same thing. Like we can't legislate those kinds of things. That's just we have to support that. And if someone wants to you know we have a 50% divorce rate in the United States. We yeah 47 million people have used this website. I a lot of people are cheating I'm sorry 37 million people. A lot of people are cheating on their spouses right. Or on their significant it was awful thing to do, but it's just the reality of and I don't even say the modern world this is as old as fucking relationships. So I'm not",
      "start": 4263.36
    },
    {
      "text": "on their spouses right. Or on their significant it was awful thing to do, but it's just the reality of and I don't even say the modern world this is as old as fucking relationships. So I'm not justifying it. I'm not saying it's right at all. I'm saying that man this is this is incredible. Like that that people feel like they have the right to just inject themselves into people's private lives. Because you know even if you know I was talking to Cheryl about this actually about something unrelated where I'm like John F. Kennedy was having affairs and everyone knew everyone knew that like it was fucking obvious, but no one reported on it, you know, because it was like well like what is that really? Why like it was before sensationalist media really. I mean there's always been sensitive media, but it's just like there was a line drawn in the same reason why people didn't necessarily generally take pictures of FDR below the waist, you know, because like he was he was",
      "start": 4292.64
    },
    {
      "text": "been sensitive media, but it's just like there was a line drawn in the same reason why people didn't necessarily generally take pictures of FDR below the waist, you know, because like he was he was handicapped, right. You know, he had polio and and he couldn't really walk and he was in a wheelchair all the time, but they were like well what is that that makes them look powerless and helpless and it makes us look weak. And that's not the story. The story is what the man is going to do. The man can still wield a pen and the man can still speak and orate. And so like what what is the big deal? And I just feel like there's not enough respect for those kinds of things. Everyone's always kind of looking for a scandal, but they're not looking for the news, you know? Right. And the news would be for instance with the Condé Nast CFO is he was a public figure that was openly advocating for the eradication of gay marriage and for family values. And then it's it comes out that he",
      "start": 4336.16
    },
    {
      "text": "be for instance with the Condé Nast CFO is he was a public figure that was openly advocating for the eradication of gay marriage and for family values. And then it's it comes out that he was soliciting a gay prostitute. That is a story. Right. But to just ransack a person's fucking life you know who did nothing to you. Which is and by the way, I don't know the full specifics on this guy, but the fact that he has one he chooses to go out there and and and have that experience does not necessarily mean that that that he's living in sin or hiding from that you know there's a lot. It makes a lot of assumptions like it makes a lot of assumptions like why does he know? And he's this you know he's been gay all along and he just got me. No no maybe that's true. Or maybe that's just an experience that he wants to have once a month you know? And his wife's like go for it. Cause I can't give that to you because clearly I'm not gay. Like I'm not a guy. You never know.",
      "start": 4367.44
    },
    {
      "text": "that's just an experience that he wants to have once a month you know? And his wife's like go for it. Cause I can't give that to you because clearly I'm not gay. Like I'm not a guy. You never know. It's just it's unfortunate. It really is like and Tim to answer your question, I mean I think there are certain there is certain court precedents where if you have cheated then you that gives you some sort of advantages or disadvantage in the actual divorce. In civil suits. In civil suits, but it's not against the law. So for instance, the judge will be like was there an impropriety? Yes. Okay. Well then you know I'm granting this person's due. Cause I think divorce has to be mutually agreed upon decision. And so oftentimes if someone says look, I think it's a statewide thing. I'm not quite sure. Hopefully I'll never have to go through it. But I think in certain States if there's an impropriety and the impropriety could be proven then that has ramifications, but it's all",
      "start": 4407.84
    },
    {
      "text": "I'm not quite sure. Hopefully I'll never have to go through it. But I think in certain States if there's an impropriety and the impropriety could be proven then that has ramifications, but it's all civil. You're not no one's going to jail. No one's paying you know you're paying, but you're paying probably an alimony or something like that or spousal support. Yeah. Hopefully again hopefully I never have to know, but luckily I think I paid that $19. So my my Ashley Madison is just erased. It's gone. I always thought that what's funny is I've come across that site and I think we all have at some point you've seen you've seen the logo. This is what's interesting to me. It's like a hot chick in like lingerie. Meet other people. I'm like have you ever heard of this thing? Really? Man. All right. It was a big story when it came out because a lot of people are like can like what is the deal with this? But I thought it was one of those. I thought it was just a dating site. Cause",
      "start": 4448.48
    },
    {
      "text": "All right. It was a big story when it came out because a lot of people are like can like what is the deal with this? But I thought it was one of those. I thought it was just a dating site. Cause it's one of those like ridiculous amounts of porn popups that when you're searching porn on your PC you're hoping to God doesn't have a virus. And then inevitably every five days I have to call Kevin and be like Kevin Kevin it happened again. Kevin the computer's talking to me again. I think it's a bot, but it knows my zip code. But I've seen those. I've seen it. And I'm pretty sure I remember in my brain. I think it's a girl in like laundry and she's like Hey do you want to meet other people? And it's one of those things where you put in like you know you always get maybe like 90% of the way through before they ask for your credit card. And you're like nah I'm not doing this, but apparently there's 37 million people that have well just to see like that was like Oh this is",
      "start": 4483.68
    },
    {
      "text": "the way through before they ask for your credit card. And you're like nah I'm not doing this, but apparently there's 37 million people that have well just to see like that was like Oh this is these are the people that you can see in your area. And you're like well I'll see what's going on there. This is before I was married. I've never done that. Well you guys I knew you guys have a different now though. You guys everyone has uh you guys have tons of apps that you can just be like I'll swipe to the right. And I see 30 checks that I've worked with. And Oh look at that. That's them in a bikini. Oh that's them wanting to hang up. Oh I'm in their house right now. Oh God. Did I did I? Oh God. Here's the crazy thing about this is that about Ashley Madison specifically is that I re I remember so clearly when the website came out and this must've been it wasn't too long ago like three or four years ago. I feel like maybe maybe maybe it wasn't maybe the time's a",
      "start": 4521.84
    },
    {
      "text": "is that I re I remember so clearly when the website came out and this must've been it wasn't too long ago like three or four years ago. I feel like maybe maybe maybe it wasn't maybe the time's a little off, but I remember that being a big story in the news cycle for a while about like should this website exist and all this kind of something like the market clearly demands it. Now the the same with it's the same to me as Craigslist, right? Where how is it different than like escorts advertising on Craigslist or uh back is back back page. The back page is the other one. Have you heard of this similar? It's the same thing, but it's like it's Craigslist. It's the thin veil of Hey you can get a job on this website, but then you click like like personals and it's just it's escorts. It's basically an escort. And it's them finding it's and it's them saying like that the ironic thing is that it's them saying like it's a safe place for a spouse. Like people that are married",
      "start": 4554.16
    },
    {
      "text": "It's basically an escort. And it's them finding it's and it's them saying like that the ironic thing is that it's them saying like it's a safe place for a spouse. Like people that are married they'll find other people that are married or whatever and just go away with it. And it's uh it sucks that like it sucks. I mean it's it is what it is, but it sucks for them that their their whole security has been broached. Like the company is I'll be really interested to see if the company can even survive because what what they're saying so it's on Krebs on Security is the guy that I think broke the story or one of the guys that wrote on it and Krebs is guy that used to write I think still writes for the Washington Post and he's a an expert in online security. And he always like when Target was hacked and all these things like he's always the guy that has like all of this shit about it. Right. Really really smart dude. And his website always comes up when bad shit like this",
      "start": 4585.2
    },
    {
      "text": "Target was hacked and all these things like he's always the guy that has like all of this shit about it. Right. Really really smart dude. And his website always comes up when bad shit like this happens. And uh he was saying like I think it was on the site. He was saying like they were preparing for a $300 million IPO this year. And I was like Oh my God you probably heard the screams and cries out of that office. I'm like all of the people that have been there for a while. And we're all going to get a piece of that pie being like fuck fuck fuck. Like we were so like we were so close and now we're going to be $300 million. We're going to go bankrupt. Yeah. I think it's probably over for them. And and I and it's if if even one person has something bad happened to them because of that there's going to be a huge cost. But the ironic thing Krebs was saying was that the security their security is really good and they have a guy that so they like they had these like",
      "start": 4620.4
    },
    {
      "text": "of that there's going to be a huge cost. But the ironic thing Krebs was saying was that the security their security is really good and they have a guy that so they like they had these like internal surveys that they released like the hacker found all these internal servers they were giving and their director of security was like this is a big problem if this happens. Like he like he knew he was like he's like if he's like what is the biggest concern of happening that you know to Ashley whatever the fuck it's called. And that was like it was like if we if our if we're compromised it's a huge fucking issue for us. But what they think is that someone that was like contracting or internal there like did it figured it out and did it. But that's that's the same with any site right? Like that's the same with any social media site any set that's that's collecting mass amounts of data and has a quote unquote expectation of privacy behind those. Once you get behind those",
      "start": 4653.52
    },
    {
      "text": "right? Like that's the same with any social media site any set that's that's collecting mass amounts of data and has a quote unquote expectation of privacy behind those. Once you get behind those closed doors what I what I have never been able to and I'm not saying this is right or wrong and I don't judge people for doing this, but I have never been able to bring myself to put that credit card info in to any site like that before you know like I've never I've never even back in like the early two thousands when like hunting for porn on the internet was like Mad Max where you were like water you know like I found it and then Oh someone's going to charge for it. And I met you know I never felt the need to do that. So like I can't imagine. I there's just some part of my brain that's so paranoid about that of like there being any sort of paper trail to the sick twisted thin like things that are in my brain even though I know that with beyond a shadow of a doubt like",
      "start": 4687.12
    },
    {
      "text": "that's so paranoid about that of like there being any sort of paper trail to the sick twisted thin like things that are in my brain even though I know that with beyond a shadow of a doubt like easily people could discover the twisted shit that I've endeavored on. But that's different though. I mean I I would never cheat on my wife but if I was going to like why would you put your credit? You know I would not do it. Don't do that. Anywhere. There's a click remember me button. I remember my information on your past your your credit card information and stuff like that. It's the same with Facebook. I've ever seen like you see all these massage parlors all around San Francisco right? Yeah. And I'm fascinated by these things because like they're still in business. People still go to them. The cops know about this. They know that these are like places where guys go to get sexual favors yet they're still here. So that what that tells me is that at any given point if you go",
      "start": 4722.24
    },
    {
      "text": "go to them. The cops know about this. They know that these are like places where guys go to get sexual favors yet they're still here. So that what that tells me is that at any given point if you go into one of those things you might get arrested. So why would you do that? Like maybe maybe it's out of desperation. Maybe it's at a loneliness. I'm not again I'm not judging but get that part of your brain get paranoid. Cause it'll only serve you well. I think. Yeah. I'm reading Ashley Madison's Twitter account right now. And they they've gone silent ever since they released their shirt but it's like are you stay at home? Dad's more likely to cheat. And then they just have all these things globally. 39.4% of men and 40.9% of women watch porn five to seven times a week. Ashley madison.com is one of the largest dating sites where in Mexico are the cheating hotspots and they have a map of all the places where people are cheating. Great. What's the last what's the last what's the",
      "start": 4761.6
    },
    {
      "text": "is one of the largest dating sites where in Mexico are the cheating hotspots and they have a map of all the places where people are cheating. Great. What's the last what's the last what's the last week they done? Like here's our statement. They have a statement. They have a statement from Avid Life Media and then an update from Avid Life Media. And then another update actually that's kind of more recent. Let's see what it says. We're giving into demands and closing down the site. We were recently made aware of an attempt by our unauthorized unauthorized party to gain access to our systems. We apologize for this unprovoked and criminal intrusion in our customers. Information. At this time we have been able to secure our sites and close the unauthorized assets points. We are working with law enforcement agencies blah blah blah. Contrary to current media reports and based on accusations posted online by a cyber criminal the paid delete option offered by Ashley madison.com does",
      "start": 4801.6
    },
    {
      "text": "law enforcement agencies blah blah blah. Contrary to current media reports and based on accusations posted online by a cyber criminal the paid delete option offered by Ashley madison.com does in fact remove all information related to a member's profile and communications activity. The process involves a hard delete of a requesting user's profile including the removal of posted pictures and all messages sent to other systems users email boxes. This option was developed due to specific members requests for such a service and design based on their feedback as our customers privacy is of the utmost concern. As we are now offering our full delete option free to any member in light of today's news to right now. So they went from 37 million to one the one dude that didn't get that email. He's not checking his Twitter. It's like I'd be super interested to see what the activity on the site is today compared to a normal day because they're probably getting hit a lot on the front but",
      "start": 4834.08
    },
    {
      "text": "He's not checking his Twitter. It's like I'd be super interested to see what the activity on the site is today compared to a normal day because they're probably getting hit a lot on the front but then like on the back are they like are people like and it's still using it? Are they like are people people are freaking. This is the thing is that people there are millions of people out there that are freaking the fuck out today. Oh yeah. And like and that's the point I'm trying to make. Like are they bank robbers? Did they murder someone? Did they hurt someone? No they I think they hurt someone but emotionally maybe but like no they cheated on someone. It's like and that's what I'm saying. Like now like they feel like their whole world's crumbling and do they deserve it? I think it's an open-ended question but I think maybe probably not. Not as a collective group of 37 million people. Certainly not. No I mean yeah maybe sure. I mean again you can't you cannot",
      "start": 4869.12
    },
    {
      "text": "I think it's an open-ended question but I think maybe probably not. Not as a collective group of 37 million people. Certainly not. No I mean yeah maybe sure. I mean again you can't you cannot bring deserve into it. Yeah. Deserve is the wrong word. You just can't bring that into it. It's wrong. What happened to these people? I don't care what they're doing. I don't care what they're doing to those palaces. We can't judge that. You can't sit here and judge but the world loves the train wreck. I mean that's the whole that's why this is so popular. This is I mean this goes back to thank you. This goes back to Scarlet Letter. Yeah. Scratch. You know what I mean? Like oh it's not it doesn't affect me. So fuck it. You know make a bunch of funny tweets about it and do all this different stuff. Oh a whole bunch of nude photos of these celebrities have leaked. Well that's their fault for being hot and famous. I'll read them and look at them and not care. You know what I mean?",
      "start": 4901.2
    },
    {
      "text": "stuff. Oh a whole bunch of nude photos of these celebrities have leaked. Well that's their fault for being hot and famous. I'll read them and look at them and not care. You know what I mean? Like until it comes until you're on the receiving end and it's your personal privacy being horribly horribly violated. Yeah. A lot of people think it's okay. It sucks. It's not okay. We should be better to each other than that. And if you've got you know if there's something out there that you just don't agree with just don't don't engage with it. You know how we're not going to ever if I if I have my if I can ever you know make this happen ever ever take a United flight again. I just don't want I'm not saying that to be a funny my normal funny self right? Kevin. Kevin is carried sleeping over there. I'm saying that that's how you affect positive changes. You don't engage with these things that you feel are wrong. That's the only way you can do it. You can't go out there. You",
      "start": 4932.64
    },
    {
      "text": "sleeping over there. I'm saying that that's how you affect positive changes. You don't engage with these things that you feel are wrong. That's the only way you can do it. You can't go out there. You can't if you're going to break a law to prove something's wrong then you've you've lost. You did the worst sin. Sorry. That's my opinion of it. Okay. Final topic. Is it me or you? It's you. Okay. First off for the final topic I want to thank all of June's Patreon folks. Thank you so much for supporting us at patreon.com/kindafunny. It allows us to do all of this crazy stuff. My final topic here today this came to me last night in a fever dream. I don't know if I had a fever but I had a dream. Did you do one of these? And I looked over and Christine's body had Portillo's head and I was like I'm so dreamy. It's perfect. Finally. Get the loop. Why'd you got to take it to it? I don't know. I'm sorry guys. You're just a monster. My filter's gone. Have you noticed that? No. I",
      "start": 4971.36
    },
    {
      "text": "I was like I'm so dreamy. It's perfect. Finally. Get the loop. Why'd you got to take it to it? I don't know. I'm sorry guys. You're just a monster. My filter's gone. Have you noticed that? No. I never noticed. It's so funny because I remember the I remember the first time someone left a comment on one of these videos like wow Nick's swearing a lot more now. And now I think people have just accepted the fact that I'm deranged. Yeah they get it. They know who you are. Nick Scarpino. I also want to give a quick shout out to Kevin who looks like he just came from the Bahamas where he learned Capoeira. What's Capoeira? It's the art of fighting by on the beach by swinging your legs around in little tiny shorts. Eddie Gordo. Eddie Gordo did it. Tekken 3. Okay. Did you know that Scorpion and Sub-Zero are brothers? I did Greg. Just letting you know. My topic is I want to know and we've done things similar to this but it's very specific. What you'd want to go back and experience",
      "start": 5010.96
    },
    {
      "text": "and Sub-Zero are brothers? I did Greg. Just letting you know. My topic is I want to know and we've done things similar to this but it's very specific. What you'd want to go back and experience again for the first time. If and so like and I don't mean like go back and like right now like you forget what chocolate ice cream tastes like and somebody gives you chocolate ice cream. I mean go back to the first time you had chocolate ice cream if that's your answer. You know what I mean? And why and all that different stuff. And mine's long. It's not even one event but I want I would love to it's just your entire teens. I would love to live life again to this point. No I was thinking I had a dream about WWF attitude era. And like watching that and I forgot what it was about the rock and mankind or whatever but and then I woke up in the middle of like 3 AM or whatever from this dream. And I was like shit I would love to go back and rewatch that stuff. Cause it's one of those",
      "start": 5058.24
    },
    {
      "text": "and mankind or whatever but and then I woke up in the middle of like 3 AM or whatever from this dream. And I was like shit I would love to go back and rewatch that stuff. Cause it's one of those things now you know I just got that attitude era book out there that John Robinson our friend wrote former IGN colleague former ESPN writer wrote about the attitude era and all this different stuff. And when you watch like WWE network and now the video games they all keep making callbacks to that. And it's the number of times you've seen man can't mankind thrown off the top of the hell in the cell right? The number of times you've seen DX crop do a crash job. The I quit match between rock and mankind you know stone cold douse Mr. McMahon with the hose or whatever and hit him in the head with a bed pan and all this dumb stuff. Like I remember watching that in my bedroom on the tiny like 17 inch TV you know what I mean? And like staying up late to watch the rock and sock",
      "start": 5103.2
    },
    {
      "text": "in the head with a bed pan and all this dumb stuff. Like I remember watching that in my bedroom on the tiny like 17 inch TV you know what I mean? And like staying up late to watch the rock and sock connection win the tag titles like cause it got delayed by the Westminster dog show or some dumb shit like that. You know what I mean? And like all these like really really like awesome moments in pivotal in terms of the WWE history. You know what I mean? I'm using that in quotes it's entertainment obviously but like I feel like a comic book right? Like I we were landing yesterday and I had caught up on all the books I wanted to read on the plan. So I was like I'm gonna reread kingdom come. So I started rereading kingdom come and like that's still as awesome and as amazing and you pull something new from it watching it you know what I mean? Whereas like those moments that like when you're the WWF WWE right? Like you're putting out how many hundreds of hours of programming a",
      "start": 5139.84
    },
    {
      "text": "pull something new from it watching it you know what I mean? Whereas like those moments that like when you're the WWF WWE right? Like you're putting out how many hundreds of hours of programming a month let alone over two decades or whatever that like all that stuff kind of gets lost. You know what I mean? These like really really stand out amazing. You remember those moments to think back and like to be able to go back and sit there and as a kid be a kid again and watch that stuff and have those legitimate reactions and enjoy that program start to finish in such a way where you knew all those characters and everybody's in their prime. You know what I mean? Like cause like even undertaker popped up last night. I think it was a none of you know right? Which pay-per-view is last night? Summer Slam. No I was going to say backlash. WrestleMania. It wasn't that either. It was one of the little battle something that's right. No battle battle in the Bronx. Battle of the Thrill of",
      "start": 5176.96
    },
    {
      "text": "Summer Slam. No I was going to say backlash. WrestleMania. It wasn't that either. It was one of the little battle something that's right. No battle battle in the Bronx. Battle of the Thrill of the Middleborn. It doesn't battleground. Yeah. That's it. He showed up to and he was like you know facing down Brock Lesnar or whatever. And then they gave him a bunch of tombstones or whatever. The stupid YouTube video was just him showing up. I don't know why WWE is doing that. I'm not going to go subscribe to the network again. Anyways but he shows up and he's all like he's got a gun on him and stuff. And it's like oh cool. Undertaker's back. But it's like even now it's not what it was then. You know what I mean? When he was the fucking leader of the ministry and they're kidnapping and crucifying people. You're like oh this is fucking awesome. Like those moments. And like you read these books now and it's like history for that like you know that form of entertainment and",
      "start": 5219.28
    },
    {
      "text": "and crucifying people. You're like oh this is fucking awesome. Like those moments. And like you read these books now and it's like history for that like you know that form of entertainment and stuff. And it's like man I was it was one I think it's one of the reason I like it so much is that it was one of those times when you were in the prime of something and I you I didn't know it as a kid. You know what I mean? Like you're watching it and you're I'm not thinking about the fact that I'm throwing kid around. I mean I mean I'm in high school I'm watching it. I'm not thinking about the fact that I'm going to outgrow this again. Like I did before. It's going to never be able to be this good again because they're going to step in and try to do all this different stuff. You know what I mean? Like on top of the programming being so good going to live events with my friends going like how fucking great no mercy is and W or you know WrestleMania 000. You know what I",
      "start": 5250.32
    },
    {
      "text": "know what I mean? Like on top of the programming being so good going to live events with my friends going like how fucking great no mercy is and W or you know WrestleMania 000. You know what I mean? The fact that like you didn't know you're playing the best wrestling games we'll ever get. They'll never get that good again. It was like fuck. I'd love to go back and be able to do all that again. You know what I mean? Like just to experience that again like that part of that. I'd like to experience. I mean I always say this. I'd like to experience that basically the entire decade of the eighties again. And by that I don't mean like as a kid just because that was that was that was the last time when people would make something like because we were so shut off when you think about you we were so closed off from the rest of the society. We didn't have the internet. You basically just had whatever was in you know the 0 mile radius of your town your school and any of the",
      "start": 5289.2
    },
    {
      "text": "you we were so closed off from the rest of the society. We didn't have the internet. You basically just had whatever was in you know the 0 mile radius of your town your school and any of the local places that you you know had had hobbies with but you didn't have anything else. And so when you see a movie like like Breakfast Club and you you you you have that realization that there's someone else out there that thought the way you thought or had a similar experience to what you're going through right now. And then you understood that the world was just a little bit smaller and that there were a lot more like minded people out there that had a certain magic to it. Nowadays you get you know you can check Twitter and get lists for 15 things that you know you experienced in high school and you're like shit I did all those right. And so you know that everyone is exactly the same. We're all going through the same things. But the eighties just had a certain magic to",
      "start": 5325.6
    },
    {
      "text": "high school and you're like shit I did all those right. And so you know that everyone is exactly the same. We're all going through the same things. But the eighties just had a certain magic to them right. And if I could go back and and and watch Back to the Future again if I could go back and stand in that line at the Tyler mall for two hours before the 1989 Batman movie and then even immediately it was like opening day. I mean I was a kid. So I was like when we go to the first showing my parents were like we don't want to see this movie with you. We're just gonna drop you off. We'll come back and pick you up. And I just waited there by myself. And I remember like the feel of the brick like that. They used to make these like movie theaters in my town. Maybe I'm sure there were some other movie theaters like that. But like the sides of them would be like really coarse like rock almost. And so you'd like lean against me like ah pebbles and stones. They were like they",
      "start": 5365.76
    },
    {
      "text": "some other movie theaters like that. But like the sides of them would be like really coarse like rock almost. And so you'd like lean against me like ah pebbles and stones. They were like they had like grooves but certain like like it was like malls like so it kept kids you know like when they when they put those spikes in the places for birds not the way yeah equivalent for teenagers. So like if you touch it you can't you just can't lean against the wall. They want you to keep moving around. But I remember the feel of those on my hand. And I remember waiting and just fantasizing about what this movie was gonna be like and not even having an expectation of it blowing my mind not even knowing that I should have that expectation like we have now where we go into movies and we're like I'm gonna compare this in the back of my brain my subconscious to 18 other movies that I can think have the exact same plot have the exact same graphics and are exactly the same. Yeah.",
      "start": 5405.12
    },
    {
      "text": "we're like I'm gonna compare this in the back of my brain my subconscious to 18 other movies that I can think have the exact same plot have the exact same graphics and are exactly the same. Yeah. Back then I was just like I've been following this movie for in magazines for the last six months and I can't wait to see it. And then I sat and saw it and I was like I mean that blew me. I just blew me away. I'm like I it was one of the only times in my life where I'm like my I didn't even have an expectation that this was going to be great. But it was so far beyond anything I could have wanted it to be that like I immediately I think I saw it again that day. Damn. Like I'm like I maybe it was I think it was the next day. There's no way Alain Scarpino would have been like I'm here. I'm picking you up. You're going home. You need to pass it. I think I made her take me back the next day. I saw that movie in theaters three times. I kept seeing it even though and I always say this to",
      "start": 5437.52
    },
    {
      "text": "picking you up. You're going home. You need to pass it. I think I made her take me back the next day. I saw that movie in theaters three times. I kept seeing it even though and I always say this to the last 30 minutes of that movie because it was shot on film. And I think they call it improperly or depends on I guess the projection but was so dark. You couldn't tell what was happening most of the time. But I didn't care. Yeah. Because occasionally I'd catch a glimpse of bat the bat suit and I'd be like that is the coolest thing on the planet. I've seen the movies forever. It's you know a lot of people I talked to a lot of guys that are meet and greet. A lot of the younger guys and younger best friends were like you're kidding when you say the 89 Batman is the best Batman right? And I'm like no I'm not kidding. But you have to also put in context there was nothing else like that. Yeah there just wasn't like there was no bat. There was no live action Batmobile. The only thing",
      "start": 5475.68
    },
    {
      "text": "I'm like no I'm not kidding. But you have to also put in context there was nothing else like that. Yeah there just wasn't like there was no bat. There was no live action Batmobile. The only thing we'd had before that was the Adam West series that was like you watching it. You're like are they fucking serious with this? Like what's well that's how the 90s 89 one feels though to you now. Yeah but to me it was it was a it was a stark dark and gritty dark gritty noir film that took flares of that series right? It took flares of the original camp of the comic book and integrated it into this kind of twisted messed up world like where the Joker is a psychopath that kills people. He fries people but he does it in so sort of a comic way. It's very Tim Burton. It's it's his style. It's very Tim Burton. Very much so. But when I was a kid I was like this is it. This is the best stuff we're gonna get. It's never gonna get any better. And like I mean just when you're a kid you",
      "start": 5506.88
    },
    {
      "text": "very Tim Burton. Very much so. But when I was a kid I was like this is it. This is the best stuff we're gonna get. It's never gonna get any better. And like I mean just when you're a kid you don't focus on the whole. You're not like oh the nuances of the cinematography like that scene was a little under. So you go like this. The Batsuit looks awesome. That's it. That's the best thing that it's the best thing in the world. It's the best thing that ever needed to be because look at the Batsuit. And people could sit there and tell you like oh wait with the story made no sense. You're like but the Batsuit like look at the Batsuit. That's all I had when I was good. That was great. I didn't really you know it's funny that I didn't realize they were making it. Tim Burton was tapped to make a Superman Lives. I don't remember being widely publicized. I just wizard magazine all the time brother. You had to be reading the trades as I call them back in the day. But um yeah so",
      "start": 5542.0
    },
    {
      "text": "to make a Superman Lives. I don't remember being widely publicized. I just wizard magazine all the time brother. You had to be reading the trades as I call them back in the day. But um yeah so that's me. I think just I think being able to see those those amazing films from the eighties again and experience them for the first time. Cause they're just those are the experiences that you left with. And then when when it was late at night you know and you're a kid and you're trying to go to sleep you don't go to sleep. You let your brain drift and you let your brain do like that. You ever you ever do that. You let your brain do that sort of fanfic where you're like oh what if what if they did this? This would be cool. And like this you know and you just imagine all of the amazing things that that series inspires in you. Um and that used to happen to me like every month in the summertime. It was amazing. Colin. I don't know. I think it's more situational for me. I think",
      "start": 5576.8
    },
    {
      "text": "things that that series inspires in you. Um and that used to happen to me like every month in the summertime. It was amazing. Colin. I don't know. I think it's more situational for me. I think that I remember I remember seeing Batman in the movies too. I was really young. I remember seeing Batman Returns and falling asleep which is funny. And uh being so disappointed. So it's just so late. Um I remember seeing a lot of those movies and kind of wishing yeah that you can TMNT. When I first saw that in the theater with my brother I was like it was like blown away. And even TMNT too. I remember that that fight when they're fighting in the foot soldiers in the lobby of that building with the yeah. I'm like I'm like it was I was like this is insane. Um those are really well done films. The first two turtles movies are great. Um but uh I was thinking more about uh toys and I think I brought this up before but I I I often have and I don't say often but every once in",
      "start": 5610.0
    },
    {
      "text": "films. The first two Turtles movies are great. Um but uh I was thinking more about uh toys and I think I brought this up before but I I I often have and I don't say often but every once in a while I have like or I have a lot of I have a few kinds of dreams that I have a lot. One of the cycles of my dreams that I have a lot is that I'm trying to get somewhere and I can never get to where I'm going. Like that's a dream I have constantly. That was a couple of days ago when we that's my life. Um but uh like I have dreams where I'm just I'm trying to go to class but I can't find the classroom. I'm trying to get to work but I can't find my office or whatever it is but I have a dream every once in a while of being in Child's World, which is a toy chain that doesn't exist anymore. And I remember they had a G.I. Joe spread the likes of which I'll never forget. And ever like you walked in there was all you know a bunch of aisles the games aisles and all these kinds of",
      "start": 5649.04
    },
    {
      "text": "anymore. And I remember they had a G.I. Joe spread the likes of which I'll never forget. And ever like you walked in there was all you know a bunch of aisles the games aisles and all these kinds of things. I remember like there are G.I. Joe aisle was just it was just it was awesome. And it and it was it was just carded G.I. Joe after carded G.I. Joe. And I remember like it's muscle memory like going through them you know like looking for what you know like popping through them for like who you're like and then grabbing like seven of them even though you can only have two of them. And then you have to figure out like what you need for your collection or what you want or what you think you're not going to find. Again you're kind of like doing like algorithmic math in your head to be like when does the last time I saw this like am I going to get it again? And I'm like you know I'm like six years old seven years old doing this. My mom's like can we just fucking leave",
      "start": 5686.96
    },
    {
      "text": "to be like when does the last time I saw this like am I going to get it again? And I'm like you know I'm like six years old seven years old doing this. My mom's like can we just fucking leave please? Did it bother you when you'd find like you'd find Snake Eyes but it wasn't the OG Snake Eyes. It was like desert Snake Eyes. What the shit is this? This is not canon. I remember these weird things that like I wish I don't know why I like it's just it's just nostalgia. I remember getting Desert Scorpion which was a a bad guy like a Cobra G.I. Joe in Service Merchandise. You remember that Service Merchandise? I remember service and it was like a random store and they had like just a small toy section but they had like this really rare G.I. Joe. And I remember finding I remember finding we have this store on the island called Meat Farms which is like which is like it's just produce. And it was a precursor to Ashley Madison. Exactly. And I remember getting Range Viper and",
      "start": 5722.64
    },
    {
      "text": "finding we have this store on the island called Meat Farms which is like which is like it's just produce. And it was a precursor to Ashley Madison. Exactly. And I remember getting Range Viper and Frag Viper that day at a store. And there were two you know Viper types and Frag Viper. I'm so upset that I missed out on G.I. Joe. You should have you have all people would have just been like you would have buried yourself in it. This sounds awesome. And Frag Viper had um almost like a highlight looking thing that would shoot grenades. And he came with little grenades. You can attach them to his backpack. And I remember I remember clearly I don't know why I remember this. I must've been like six years old seven years old. I just had him and I was like jumping in like along the milk things or whatever. Remember like there's like little holes that that uh you know for like ventilation and his grenade one of his grenades fell off and into it. And I remember being like so",
      "start": 5753.68
    },
    {
      "text": "milk things or whatever. Remember like there's like little holes that that uh you know for like ventilation and his grenade one of his grenades fell off and into it. And I remember being like so fucking upset that I lost one of his grenades. Like there's little things like that. Like I just remember that I'm like embedded in my brain. I was really like I remember the first time I came to California when I was young and I got a Flak Viper which was a a guy with a huge backpack that with missile like a huge missile launch around his back. I just remember these moments. That's when I also saw Three Ninjas for the first time. And uh so this was like summer 9. I remember on that flight I brought my Super Mario World instruction manual and that's like all I brought with me. And I just like it was like I'll be fine. I'll be fine. And I remember we were on a plane where the I don't know. You you probably remember this. You guys probably remember this where the old planes",
      "start": 5789.92
    },
    {
      "text": "I just like it was like I'll be fine. I'll be fine. And I remember we were on a plane where the I don't know. You you probably remember this. You guys probably remember this where the old planes where the seats faced each other in the middle. And we had we were sitting across from like my siblings were sitting across from some of these other like just guys. And I remember them playing cards and stuff like that. There's just a lot of like there's just a lot of random kind of innocent memories. I don't. And again I've said it before. There's no innocence today. There's none. Yeah. Cause everything's too interconnected. Everything. You can have any information you want. You have a device with all the information in the world on it at your fingertips at all times. So there's just like these things where it's like in that moment in Meat Farms with fucking uh you know Frag Viper in my hand jumping around. I'm like that was that was in that moment. I was always doing in that",
      "start": 5823.68
    },
    {
      "text": "these things where it's like in that moment in Meat Farms with fucking uh you know Frag Viper in my hand jumping around. I'm like that was that was in that moment. I was always doing in that moment today. They'd be like you know on their phone and all these kinds of things. I'm just like that's not that's not exciting or nostalgic. You're gonna be nostalgic about that. You know they will though Colin and that's the thing is it's like we do this all the time where we sound like the old people that were like ah these kids have these things. You're not though. No not yet. But these kids are going to have these memories in the same way. I have memories of and we have memories of texting and having to you know like who's the best texture with a T nine bullshit. Like we have memories of that. But these people are going to have memories of whatever the hell they're doing. Now. Stan little kids. I have so many. When you first brought that up like the first moment that came",
      "start": 5859.12
    },
    {
      "text": "of that. But these people are going to have memories of whatever the hell they're doing. Now. Stan little kids. I have so many. When you first brought that up like the first moment that came into my head was the first time I played Super Mario World because that was there was a lot of video games I played before that um specifically the Mario games. And I remember there was a very specific moment in the first level when the giant Bullet Bill comes and it everything was really weird and like stop for me. I'm like this is perfect. This is perfect. And like from then on I was like I knew that that they perfected Mario and I'm like Holy crap this thing that I loved is now perfect. Um and moments though I think that overall I think a lot of my the things that I wish I could experience again like go back into those moments. A lot of them were friends based and like um trying to think like merchandise based. It was always just like the things that like it was opening the",
      "start": 5900.32
    },
    {
      "text": "again like go back into those moments. A lot of them were friends based and like um trying to think like merchandise based. It was always just like the things that like it was opening the Pokemon card booster packs like going to the card store and then not knowing what's in there not knowing what's in it really wanted this one card. And it's it's that moment. It wasn't just you opening it. It's your friend opening it and seeing who got the best ones and like talking shit and like trading and all that stuff. Like it's that whole experience which also included getting Slurpees and the way on the walk and what you guys talked about on the way to it let's pop into Blockbuster and do the walk around the store and see what's there. But it was all about the Pokemon cards. Yeah. And uh I think on top of that scooters Razor scooters like that being such a fad at that moment but it felt like it was going to last forever. You know like my entire world revolved around that wasn't",
      "start": 5944.0
    },
    {
      "text": "I think on top of that scooters Razor scooters like that being such a fad at that moment but it felt like it was going to last forever. You know like my entire world revolved around that wasn't going to last forever. No but that's the thing though. Not when I was 11 and it was like rollerblades are going to last forever. Okay. That too like rollerblades all those things like he was still using rollaways. No really the back to roller skates. No. Well no I don't. I just don't use them. Like oh he leaves. That was one of those interesting things but it was one of those things where it was so interesting. Cause to me I was the demographic for that. Like I was the kid playing Tony Hawk's Pro Skater that was just obsessed with wheels but we'll let anything I'm into it at that moment you know? And it was cool to have them. And it was like how many stairs can I jump off on my fucking Razor scooter? Can I do more tomorrow? And that you're with all your friends you're doing",
      "start": 5986.48
    },
    {
      "text": "you know? And it was cool to have them. And it was like how many stairs can I jump off on my fucking Razor scooter? Can I do more tomorrow? And that you're with all your friends you're doing all this shit. And it's like that those moments I will just never forget. And I wish I could just have them again. Like you tell them about all the wrestling and stuff. It's like that's what it is to me. Like the Mario World thing. That was a very specific moment. And I try to think of movies and I'm trying to think of something more recent that like really hit me in like a this is fucking special. And I can't believe I feel this way. And this is not a joke. This is a completely real answer. The end of Fast Six like when all that I mean my love for that franchise has been such a joke and it's like so much bigger than it actually is but it's kind of like you know we are it's entertaining to us that we make a huge deal. We love loving the series just as much as we love this series you",
      "start": 6023.04
    },
    {
      "text": "like so much bigger than it actually is but it's kind of like you know we are it's entertaining to us that we make a huge deal. We love loving the series just as much as we love this series you know? And I feel like after Fast One two three all the different bullshit going on like four brings it all back. And then five was like Oh my God this is actually good. Yeah. It's almost that in itself was a joke. We're enjoying this. We're like wait no we actually like this thing that we used to joke. Right. Right. And then Tokyo Drift was always the this mega joke to me that I actually enjoy that movie. And I love Han and Han was always the random thing that I held onto and I would always joke about him. And it was a joke you know here's the random thing that I like. And then all of a sudden like I constantly joke that in Fast Four or Five and Six that they were going to finally bring it back to Tokyo Drift. This is all going to happen. And then they bring it back in the",
      "start": 6060.48
    },
    {
      "text": "all of a sudden like I constantly joke that in Fast Four or Five and Six that they were going to finally bring it back to Tokyo Drift. This is all going to happen. And then they bring it back in the most genius amazing way that no one saw coming at the end of that movie and the post credit thing that now Fast and Furious has post credit scenes. What? And the theater erupted man like everyone was there for the same reason. They love this stupid thing just as much as we all do. And all of a sudden the filmmakers it was like the perfect thank you for us putting up with their bullshit. And I'll never forget the entire row of IGN people just standing up and being like screaming. People were screaming at the fucking like no no fucking way. Holy shit. It's like that's fucking awesome. Yeah. I'd give anything to go back to that. You weren't even there. It's so sad. You had to watch it with your wife. I was I took you a drift for by the way it was the first time I watched a movie",
      "start": 6104.96
    },
    {
      "text": "Yeah. I'd give anything to go back to that. You weren't even there. It's so sad. You had to watch it with your wife. I was I took you a drift for by the way it was the first time I watched a movie and one of the one of the movies in the series. And I was like shit I actually really liked this. This is actually an entertaining movie. Um I want to point out that um if anyone if if it were ever a doubt that we were all nerds this is the topic we should point people to. Cause not one of us defaulted to a sexual experience. Not one of us was like I would like to go back and experience the first time I had sex. Because sex is awesome. Every time you have it. That's awesome. We aren't jaded when we talk about sex. That's true. That's true. But that ain't coming back. Wrestling will never be as good as the Attitude Era but sex tomorrow will be as good as sex. The women that would have sex with me few and far between. So we we those are precious moments as well. You know",
      "start": 6145.52
    },
    {
      "text": "will never be as good as the Attitude Era but sex tomorrow will be as good as sex. The women that would have sex with me few and far between. So we we those are precious moments as well. You know that's what I'm saying. Like the first yeah I don't know. I mean that was you had to fight for it back then. Now it's just come so easy. We got that internet fame. It's like I get my wife once a month. Ladies and gentlemen that's The GameOverGreggy Show each and every week. Four sometimes five best friends gather on this table. Each bring a random topic of discussion for your amusement. Too busy apologizing to your wife. So glad my wife doesn't watch this show. My sister-in-law does. She every time I say something stupid she'll text me like why why do you tell people that? That's not right. It's not accurate. If you want the show early you can head over to Friday. What do you head over to patreon.com/kindafunny each and every Friday to get the show early for a couple",
      "start": 6200.32
    },
    {
      "text": "right. It's not accurate. If you want the show early you can head over to Friday. What do you head over to patreon.com/kindafunny each and every Friday to get the show early for a couple of bucks. But if you don't have them to give them to us no big deal. Head over to youtube.com/kindafunny where we break out the show topic by topic day by day until we post the entire thing for free as an MP3 and big old video video video. So we wrapped up SGC. Now it's off to VidCon. If you're hearing this on Friday or Thursday night on Patreon come to the SoCal meet and greet at Porto de Buena Park. You're hearing this after the fact on YouTube. I'm sorry. You missed us in Buena Park. Follow us on YouTube. This is why I have a love hate relationship with all of us is that I've been slowly but steadily gaining weight because we've been going to these conventions because it's fun. Cause they're fun. I mean it's me people. We inevitably have amazing food everywhere we go. Yeah.",
      "start": 6237.92
    },
    {
      "text": "slowly but steadily gaining weight because we've been going to these conventions because it's fun. Cause they're fun. I mean it's me people. We inevitably have amazing food everywhere we go. Yeah. But I swore I was like I'm not going to overeat next week. I'm not going to drink. I'm not going to overeat. I'm going to try to work out two or three times and I'm going to count my calories. And then I saw your tweet Saturday. Yeah. Two o'clock PM. Yes. We're going to Porto de Los. And it just like a blast of memory that that Italian beef with you can get cheese with a nacho cheese on top of it. I'm like that Saturday is the first time we're going to we're going Wednesday probably Thursday or Friday Wednesday we're going to Buena Park until next time. It's been our pleasure to serve you.",
      "start": 6278.72
    }
  ]
}
