{
    "id": 1024,
    "video_id": "o0HTfi4d3ik",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "What Is The Best Season - The GameOverGreggy Show Ep. 84 (Pt. 2)",
    "description": "Colin Moriarty discuss his favorite and least favorite seasons.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1436857200,
    "duration": 1216,
    "transcript_chunks": [
        {
            "text": "Colin what's your topic? Well, the last two weeks I went for some heavy-hitting topics. So, which was uh the Confederate flag and then gay marriage. So, this time I thought I'd bring a little more uh levity to the situation. Perhaps Eugene levity. Eugene Levy. Uh American Pie. Still got it. American Pie. So, uh I want to just talk about you know this will be a quick one. What is your favorite season? So, you have only four options. Summer, spring, fall, and winter or solstice. Or solstice not which is not indeed a season. Or autumn. Autumn. Autumn. If you're in in Europe if you're in autumn's so weird because it's spelled all weird. It bothers me. Always has bothered me. And I will never forget it because in a second grade spelling test I messed it up. That's That was the one that got you. Silent N. Yeah. Yeah. I'll get you every time. Uh my favorite is fall. I love fall. I love everything about fall. I like that it's like granted we live in San Francisco now so we",
            "start": 2.85
        },
        {
            "text": "one that got you. Silent N. Yeah. Yeah. I'll get you every time. Uh my favorite is fall. I love fall. I love everything about fall. I like that it's like granted we live in San Francisco now so we have no seasons, but I like San Francisco because it's almost always fall, you know? I mean, the weather here is usually fall, but I like fall in a real part of the country because leaves change and it's pretty. It gets to be sweatshirt weather, which is awesome. It's Halloween, my favorite holiday. Uh there's good food of course with your Thanksgiving getting mixed in there and stuff too. Football's back. You got to go back to school which sucks. I won't lie to you. All the good games start coming out though. You know what I mean? That starts. But it's just the the smell of fall in for me the suburbs of Chicago or Missouri or whatever. But like like that feeling of fall. Fall has a feel that that you know chill in the air. You go out and you pick your pumpkins. You're doing all this. You",
            "start": 59.36
        },
        {
            "text": "suburbs of Chicago or Missouri or whatever. But like like that feeling of fall. Fall has a feel that that you know chill in the air. You go out and you pick your pumpkins. You're doing all this. You go out and you pick your pumpkins at a pumpkin patch. You ever heard of this? Oh yeah. All right. You pick your pumpkins. You make them. You put them on the stuff. The colors are nice. I mean, even for like when you're drawing stuff in school, you got your browns and your oranges and your reds. You're making You're making your turkeys with your hands. You're making the turkeys with your hands. Yeah. Fall's the best. I don't know, man. I think anyone that doesn't say summer is crazy. You're stupid. It's too hot. I mean, some Okay. Except it's not. If you're born and raised in San Francisco, even today was too hot. Today is a hot day. I don't like today. But I don't blame the summer for that. I I blame global warming and other things that I understand. Obama, but it's not Obama's fault.",
            "start": 95.04
        },
        {
            "text": "even today was too hot. Today is a hot day. I don't like today. But I don't blame the summer for that. I I blame global warming and other things that I understand. Obama, but it's not Obama's fault. Summer is the right answer because you're not in school and forever that'll be a big deal to me. I don't care that I'm a grown ass man now and I don't actually get summers. Sure. It's one of those things where I see all the kids out there, all the little boys and girls touching each other and stuff getting their boba tea and all boys and girls touching each other. Maybe it shouldn't go there anymore as a they are all like they do the thing where they're like one hands in each other's pockets and they're walking like penguins when it's like they they can't holding hands isn't enough. They need to be literally wrapped around each other and like walk in synchronization. Yeah. I'm not down with that because I was always way taller than them and it's just like it's weird to get like the motion",
            "start": 129.68
        },
        {
            "text": "to be literally wrapped around each other and like walk in synchronization. Yeah. I'm not down with that because I was always way taller than them and it's just like it's weird to get like the motion right with your steps. I appreciate that. Sure. But uh anyway, these are summer problems, you know, and I appreciate that a lot. And when is Coke best? Yeah, that's right. Summer. What does summer mean? No, it's the best in the airplane. We've covered this. When you're in an airplane and you get a can of Coke, that's the best Coke you'll ever have. No, it's the best at the fountain beverage place. If you're if you're terrestrial and you're on the ground, the best Coke you'll get are little aluminum bottles with the twist off caps. Those things are manufactured from magic. Yeah, there's nothing. I just love Coke. But anyways, summer's great cuz you're not in school. E3 happens. All these great things happen. E3 happens. It gives you blue balls. Yeah, but it's like it's a good jump off",
            "start": 163.84
        },
        {
            "text": "I just love Coke. But anyways, summer's great cuz you're not in school. E3 happens. All these great things happen. E3 happens. It gives you blue balls. Yeah, but it's like it's a good jump off point for you to get excited about **** I like getting excited about **** I guess. But I mean like summer too hot. I enjoyed a good summer as a child. You know what I mean? I'm off school, which is amazing. Of course, that's the big pro. Too hot. Con. and there are no games theoretically there now it's different but when we were growing up dead zone nothing's happening you figure in the fall all the games are popping off you're getting Smash Brothers you're staying over at your friend's house every Friday through Sunday you come back you go to school you didn't do your homework you you know you're having those kind of events things are happening there I think the the forcing people to be together and go to school or whatever is then making it where you can blow off steam on the weekend",
            "start": 199.6
        },
        {
            "text": "you're having those kind of events things are happening there I think the the forcing people to be together and go to school or whatever is then making it where you can blow off steam on the weekend together that much more exciting on Tuesday you're thinking about the Friday night party or event or movie you're going to. Whereas with the summer, what somebody's living in your house on your couch forever. But I mean, that's I love that it's someone living with you and all of a sudden you become nocturnal and none of this heat stuff matters because you never see day and it's the best. I love summer. I want it back. I'm surprised you say that because last time we were in LA, we were in North Hollywood for doing the Kevin Pereira thing and it was so hot that all three of you were like, I'm melting. It's so hot. And Tim, you were the worst. You were like, \"Yeah, this heat **** is bad, bro. It's hella bad.\" I know. It's hella bad. And Kevin was like, \"I'm sweating, but I'm always",
            "start": 239.12
        },
        {
            "text": "I'm melting. It's so hot. And Tim, you were the worst. You were like, \"Yeah, this heat **** is bad, bro. It's hella bad.\" I know. It's hella bad. And Kevin was like, \"I'm sweating, but I'm always sweating, so there's no real difference.\" Kevin just is it must his His world is different than ours. His natural state is just sweating. Yeah. Um which I I respect that about you, Kevin. You're honest about it. You're open about it. And that's good. Um it for me it depends on where I'm at geographically because if I'm in Southern California, summer is my favorite. I love the heat. I like wearing flip- flops and shorts. I like being tan. I like going to the beach or being by the pool. I like all the activities that a hot sunny day represent including barbecuing. Love barbecuing. Having said that, you can still barbecue in the fall. Yep. Depending on where you're at. And sometimes it's even more fun cuz it's cold outside and you're drinking and barbecuing. You go inside. Um but up here, I",
            "start": 279.92
        },
        {
            "text": "you can still barbecue in the fall. Yep. Depending on where you're at. And sometimes it's even more fun cuz it's cold outside and you're drinking and barbecuing. You go inside. Um but up here, I got to go with the fall. I love the fall up here. Um you actually feel the season. There's that one day. There's always that one day where you're like, \"Oh, it's chilly. It's the fall.\" Yeah. I just felt it. I like that. I like that a And I also love uh I like any I like sweater weather. I like I like being able to layer up. Yep. I like having to wear a jacket for the longest time. Uh when I when I first moved up here, I didn't have a jacket because I didn't own a jacket like a big coat in Southern California. There was no reason to. If it was slightly chilly outside, you just dealt with it cuz like you know in Irvine or Orange County, unless you're by the beach by the beach and you need a sweatshirt or you know you wrap a blanket around you or whatever if you're going to fall asleep on the",
            "start": 322.88
        },
        {
            "text": "like you know in Irvine or Orange County, unless you're by the beach by the beach and you need a sweatshirt or you know you wrap a blanket around you or whatever if you're going to fall asleep on the beach and you know nice romantic evening with yourself. Um, but yeah, I mean, you know, spent so many years in in in SoCal in like a Newport Beach where you're just it's just the day the day was just about kind of getting up and throwing flip-flops on and just going out and just hanging out. Man, I love them. That's one of the things I like least about summer. Really? Why do you not like flip flops? Because my feet just aren't used to it. Every single time I wear flip flops, it breakes. I get **** cuts and **** blisters. It's like, dude, I don't understand. You're walking around all flippity floppy. You got to spring for good flip flops is your thing. You're buying that shitty dollar store. No no no. How about the rainbows? You got the rainbows. You have to you have to break in. You",
            "start": 356.4
        },
        {
            "text": "floppy. You got to spring for good flip flops is your thing. You're buying that shitty dollar store. No no no. How about the rainbows? You got the rainbows. You have to you have to break those in with your feet. Like your feet have to get used to that and they have to develop a little bit of a callous cuz the rubbing. The first time I went back to flip-flops in a long time. I got the blisters also. Now I just my feet are normal cuz I bring them with me everywhere I go. So like I brought flip-flops with me to Momo Con. I'll bring them with me to San Diego Comic-Con for if I'm just going out of the hotel, walking to Starbucks and coming back and I don't you know no one's going to judge me. Alexis isn't going to see me be like, \"Why are you wearing flip flops with jeans? It's disgusting.\" Says every single time in the entire world. She hates it. And so if you guys are out there jeans, right? Yeah, she does. Yeah, it's Alexis. This is what to her, this is what",
            "start": 393.84
        },
        {
            "text": "jeans? It's disgusting.\" Says every single time in the entire world. She hates it. And so if you guys are out there jeans, right? Yeah, she does. Yeah, it's Alexis. This is what to her, this is what causes war and famine. Okay. Okay. Just poor fashion choices. Um but yeah, I mean I that that will forever be me. And also, you know, I grew up in in a really really hot uh part of Southern California. It was like the Inland Empire, which is the dry desert. And so you're talking about heat that's 105, 110 sometimes in the summer. And so you have to be in a pool. So you'd be like you'd set the barbecue, jump in the pool, and then kind of get out, check it, make yourself a cocktail, come back into the you know and then like I' I've said before, if your parents are out of town, this is what you do. You set the air conditioning as low as humanly possible. And you make the entire interior of the house an ice box so that when you come back in, you immediately cool off. And then you get a little",
            "start": 426.0
        },
        {
            "text": "You set the air conditioning as low as humanly possible. And you make the entire interior of the house an ice box so that when you come back in, you immediately cool off. And then you get a little chilly and you want to go back out into the heat thus ensuring that when your mom comes back and sees that bill, she screams at you for 10 days straight. You got to you got to be That's the thing, man, with with the heat and and the air conditioner is like I remember with the air conditioner and the heater in my house, I knew the sound of my dad pulling up the street and getting in and I would like **** run all the way like down the hallway down the stairs like to the thermostat and like turn it back to where it was and then run back upstairs and he would still know. Yeah. Like he would walk he would walk in and be like, \"It's too hot in here.\" Like if it was the winter or whatever. I'd be like I'm like he's like you playing with the heater or whatever and I'm like no I'm not. He's like",
            "start": 462.8
        },
        {
            "text": "he would walk in and be like, \"It's too hot in here.\" Like if it was the winter or whatever. I'd be like I'm like he's like you playing with the heater or whatever and I'm like no I'm not. He's like you playing with the heater? You know what I mean? I'm like, \"Yeah.\" And he's like, \"What'd you have it on?\" I'm like, \"I had it on 67.\" And he'll continue to look at you and be like, \"It was 70.\" You know and he's like, \"Come on. Come on. The **** out of here.\" Yeah. Yeah. He knew you. He knew you. For me, it was the opposite. It was the AC. And so, like, my parents had one air conditioning unit, but it was one of those older air like now they have like one that is smart enough to air condition whatever part of the house you're in. So, if you're like I'm just downstairs. You hit downstairs and it won't bother wasting the space cuz that's a pretty considerable expense if you got a two-story house like we grew up in, right? you're just you're air conditioning the entire square footage",
            "start": 496.56
        },
        {
            "text": "and it won't bother wasting the space cuz that's a pretty considerable expense if you got a two-story house like we grew up in, right? you're just you're air conditioning the entire square footage of the upstairs. You don't really need that cuz you're not existing up there. And so if id have had that when I was a kid, it would have given us a little break. But I mean, we used must have caused I must owe my parents thousands of dollars in air conditioning bills. And we're talking about a two a two-story house that's pretty big in Riverside. And so and my brother and I were **** We would keep it on constantly. I mean, cuz we liked going to bed with it freezing. I would go to bed with it freezing where almost you could almost see my breath. And then I would put like five blankets on my bed. And my mom's like, \"Why are you doing this?\" Sounds like it's how I like to sleep. Something about it, man. It's just like just feels right. Even now when I go to hotels, like, you know, we said the",
            "start": 529.6
        },
        {
            "text": "And my mom's like, \"Why are you doing this?\" Sounds like it's how I like to sleep. Something about it, man. It's just like just feels right. Even now when I go to hotels, like, you know, we said the hotel in in San Diego, I the first thing I do, I drop the bags. I feel the temperature. It's no matter what, it's too hot and too humid. I crank the AC down to like 65, maybe 6. That's it. Yeah. Hotels are something special just cuz you just get to go and just get We talked about this, but the showers and the So, what's the first thing you guys do when you go into a hotel room by yourself? Beat it. You just beat that thing like a Do you The door's not even closed. Mark the territory. No, it's usually go to the bathroom. I explore. Yeah. Yeah, I do a little exploring. You just opening things up. Yeah. Just, you know, see what's what it what it is. Yeah. I I immediately shed clothes. I'll be honest with you. Like I walk in and I just like cuz usually usually it's after a significant portion",
            "start": 563.36
        },
        {
            "text": "Yeah. Just, you know, see what's what it what it is. Yeah. I I immediately shed clothes. I'll be honest with you. Like I walk in and I just like cuz usually usually it's after a significant portion of travel. Wow. And you feel so confined that you're like I've been in these shoes and these pants and these underwear for so long that I just want to like just take it all off for a second and just be the way God intended us to be. I don't think I've ever said to myself I've been in this these underwear for so long. You know what? I mean, like when you're on a plane, you're you feel just physically cramped and then you get the You get the back sweat going back uh the sweat and the grundle and then somebody right in front of you coughing with their mouth open for no **** reason. Ah, you just want to be like you do the column where look the disapproving look up and down. Yeah. And they're not getting it. Yeah. You know what I mean? I totally I'm right there with you. And so Yeah. And",
            "start": 599.6
        },
        {
            "text": "just want to be like you do the column where look the disapproving look up and down. Yeah. And they're not getting it. Yeah. You know what I mean? I totally I'm right there with you. And so Yeah. And then you got the cab ride in where the guy's like, \"You only take cash.\" And like no, it's illegal for you to say that. And it's a whole rigmoral. And then when you get to the hotel, then that you got to wait in the line of the thing and the person's like, \"I don't have you here.\" You're like, \"No, it's Scarp. Scarp. S A. Give me the thing. Give me the thing.\" And you type it in yourself. And then you finally get up and maybe your card works. Your room's not ready yet. Or the room's not ready yet. The room's not ready is the worst. But finally, you get there and the room's ready. You walk in, you you you just drop the bag and you close the door and it's silence. And you just turn the AC down as far as humanly possible and just in one foul swoop just and your just clothes come off and you",
            "start": 632.72
        },
        {
            "text": "you you you just drop the bag and you close the door and it's silence. And you just turn the AC down as far as humanly possible and just in one foul swoop just and your just clothes come off and you just you just sit there. Maybe you go to the bathroom. That's probably the number one thing I do after that. Yeah. Is I just sit on the toilet, see what happens. Sometimes the worst is when you're with people and they're like, \"Okay, meet back downstairs in 5 minutes.\" You're like, \"No.\" So, you mean every single time we ever Every time we go anywhere, it's like, \"Me back downstairs in 5 minutes.\" I was like, \"I need at least 15 minutes to decompress.\" But it's this weird pressure and we do this to ourselves where I feel like we do that because we feel like everyone else wants to do that. But we all know we none of us want you can know that. You can know that whenever we travel together, I don't want to see you guys at all. That's fine. I'm just going to stay in my room and you guys just",
            "start": 665.44
        },
        {
            "text": "we all know we none of us want you can know that. You can know that whenever we travel together, I don't want to see you guys at all. That's fine. I'm just going to stay in my room and you guys just let me know when we have we go to SGC next week. We'll all come in and just immediately go into the rooms. We're sharing rooms again. We'll go and just get naked together lay on the beds poop whatever we need to do. Hold on. Together or like in one room? Well, there's two rooms of two people. Oh, okay. Yeah. Okay cool. Nick and I have a good time when we we do we chat like I we now remember we got to correct it. This time when we get there to check in, we ask for adjoining rooms. Yes. So we can have the door open. That'll be really good. Middle of the night water balloon fight. I need Yeah. Big old fire ants. It's gonna be fun. Before we move on, I just want to say I I respect Did you pick one? This the summer coming from where I come from is just way too **** Exactly. Human and",
            "start": 700.72
        },
        {
            "text": "Yeah. Big old fire ants. It's gonna be fun. Before we move on, I just want to say I I respect Did you pick one? This the summer coming from where I come from is just way too **** Exactly. Human and **** Uh Long Island summers are just awful. Just **** awful. I I don't I don't get it. I don't I The summer it it the summer also meant something when I was younger and it doesn't mean anything anymore. That's the other thing. It just doesn't mean anything. It's a very nostalgic time. I remember, you know. How does it not mean anything anymore? How does the summer not mean anything? mean to you or do you mean in general? Well, if it doesn't mean anything to me, it doesn't mean anything to anyone. Okay. You see, I thought you were just making the declarative statement that summer was now meaningless to the world. You were going to say with internet or some connection. I don't know. No. Well, the the internet might have something to do with that more generally. I feel like the summer",
            "start": 736.88
        },
        {
            "text": "meaningless to the world. You were going to say with internet or some connection. I don't know. No. Well, the the internet might have something to do with that more generally. I feel like the summer just doesn't have any re resonance with me after. It wasn't even like in college. My first two years in college, I went home. So, it even meant something then. But at those last years I was in college, I stayed in Boston. So, at that point when I was 0 1 like summers were just they didn't have any meaning. I was in class and all that kind of stuff and just like taking weird things once I got to IGN and I was out of a college town cuz I worked at the trip you know after college where it was still the economy is based on Missou and I got like here I would it would be middle July and I'd be like all right you know people aren't in school right now like that's not happening you know I mean you totally lose sight all that it's weird because then you get old and your summers go away but what",
            "start": 770.88
        },
        {
            "text": "all right you know people aren't in school right now like that's not happening you know I mean you totally lose sight all that it's weird because then you get old and your summers go away but what what's been super weird for me is the fact that at IGN it we didn't have summers but we got winter break still none of my other friends that had real jobs had winter break. Yeah. So we'd get like two weeks off sometimes more depending on what was going on. And uh it's weird that now now it's gone. Now we have no breaks ever for the rest of our lives. We can we can theoretically take whenever we want. Let's take a six month sabatical right now. Yeah we could take summer. Can I can I ask for us to have summers? I feel that'd be pretty dope if we had summers off. Maybe when we have more people working for us. That might be slightly detrimental to the uh success of our business. But Kevin could just take over. Yeah you'll be fine right? Kevin you're okay for three months on your on your",
            "start": 804.32
        },
        {
            "text": "working for us. That might be slightly detrimental to the uh success of our business. But Kevin could just take over. Yeah you'll be fine right? Kevin you're okay for three months on your on your own right? Just go to you just do all the parts. Yep. Just put all the mics by you be like, \"Oh, I'm Greg Miller.\" More and then go over next like I disapprove of everything that you're saying and then be like this. What? No. Hella. And then when you get to Sounds like you're Sean Finnegan. Now your Sean Finnegan's becoming your Tim Gettys. No, the Tim Getty has always been like, \"What? No hella.\" It's always been Tim, right? Always been Tim. It's pretty spot on. Uh so I will say spring is garbage. No one cares about spring. So it really comes down So it really comes down to So it really comes down to fall and winter. Now I respect the fall because the fall is when hockey comes back. It's when football come back comes back like Greg said. Uh it's tolerable. I like playing outside during",
            "start": 842.48
        },
        {
            "text": "down to fall and winter. Now I respect the fall because the fall is when hockey comes back. It's when football come back comes back like Greg said. Uh it's tolerable. I like playing outside during the fall. You don't feel like you're going to **** die and have a heat stroke. Uh but I my answer is definitively winter. Wow. Um and I I think winters with snow like New York winters are pretty bad but Boston winters are atrocious. They're the worst. Um there's just something and I'm not even being trying to be Colin like who didn't see this coming. Colin chooses win. The winners in Boston are like going north of the wall, dude. It's **** horrible over there. Yeah I know. It's terrible. And uh there's something amazing about it just being dead, you know what I mean? Like everything is just dead, you know? And you go outside and it's just there's no plants, no animals. People are dressed up like Eskimos walking around. You can't. It's the ice climbers. The ice climbers. Exactly.",
            "start": 880.8
        },
        {
            "text": "is just dead you know? And you go outside and it's just there's no plants, no animals. People are dressed up like Eskimos walking around. You can't. It's the ice climbers. The ice climbers. Exactly. Reminds you of them. It does remind me of them and it makes you sad. So I I But here's the thing. Here's the reason. But here's But here's the real reason why I like winter. Winter always inspired me. It was always when I wanted to write. It was always when I wanted to read. You I like I had a skylight in my room growing up and I remember like it would be like covered in snow and I'd like open it to get the snow off and then it would fall and there was like a tree that was like over my skylight that was like dead and stuff. And then you look I look in the backyard and it was just covered with white and like I there's something about that that brought out a lot of creative energy in me. So like I always I always liked winter for those reasons. Like I was like this is when I want to play",
            "start": 927.28
        },
        {
            "text": "white and like I there's something about that that brought out a lot of creative energy in me. So like I always I always liked winter for those reasons. Like I was like this is when I want to play games. This is when I want to immerse myself in some fiction. This is when I want to kind of just stay inside in front of you know our our fireplace or in front of our our wood burning stove and just kind of like read a book or something. I I like winter because it's the great excuse to not go outside. But when you do go outside during the winter then you know you do funny things. And you know, we used to uh in our in our neighborhood, we used to build uh uh and by we, I really mean was it was instigated by my friends Mike and Brian would build things like huge snowmen in the middle of the road, which then people would have to like run over to get over them or whatever. And and and there's just a weird rule set to winter, you know, like there's just to just be a hooligan. Is that what you",
            "start": 964.8
        },
        {
            "text": "which then people would have to like run over to get over them or whatever. And and and there's just a weird rule set to winter, you know, like there's just to just be a hooligan. Is that what you guys used to do when you No, we just thought it was funny. I I'll never forget we built this huge snowman in the middle of the road and a school bus just **** like **** ran over. This is hilarious. Um, but it's like when there's like you're wishing that there's no school and yeah, I'm playing tons of hockey. I'm going out to the ponds and playing hockey and hoping I don't fall in, which would happen sometimes because the ice wasn't ready. And uh, you know, all these I don't know, there's just something special about winter. I don't think you can deny that how special winter is. Now, I understand spring is when things are re, you know, reborn, but that's not exciting to me. What's exciting spring is exciting. The first time you can put your windows down, you're driving around. I guess I",
            "start": 1001.28
        },
        {
            "text": "spring is when things are re, you know, reborn, but that's not exciting to me. What's exciting spring is exciting. The first time you can put your windows down, you're driving around. I guess I love San Francisco. San Francisco is spring all the time or fall all the time, which is nice. everything at all times. Yeah, winter. I do want to give a shout out to hot chocolate though in terms of winter. There's up there's ups and there's pros and cons for each one of these seasons. But yeah, winter I I no winter I can't stand really. Yeah, it's gross. It's disgusting. And it's Chicago, so it's **** snows out of the blue. It's so **** cold. Salt trucks go by. Everyone's got that **** gray film on their cars just from trying to survive in this forever. Oh, it's 4:30 in the afternoon. Pitch **** black outside. This is fun. What a great **** place to live. I like short days. Yeah. So depressing. You leave school, it's already dark. You're like, \"Oh my god.\" Yeah. I'm the opposite of",
            "start": 1033.92
        },
        {
            "text": "**** black outside. This is fun. What a great **** place to live. I like short days. Yeah. So depressing. You leave school, it's already dark. You're like, \"Oh my god.\" Yeah. I'm the opposite of that one. I like I like when the days are long. I like to I like to feel like the day time is and like an 8:30 sunset. That's great. I I Why? Why? Like what what is I I don't understand. You're not It's not like Greg goes outside. See, this is the the random the thing that I really need to know about this is that it's not like Greg's an outdoorsman. He's not like hiking, you know? So like what what benefit are you are you getting from a long day, you Yeah. Well, the long days are significantly better in the weather wise. So, again, the windows can be open. There can be a breeze. You hear birds chirping. If you if we're back to being again, you're not an outdoorsman now either. If we're back to being kids, you can go play in the yard. You can still ride your bikes. That was my thing. The",
            "start": 1071.44
        },
        {
            "text": "chirping. If you if we're back to being again, you're not an outdoorsman now either. If we're back to being kids, you can go play in the yard. You can still ride your bikes. That was my thing. The longer days meant that I could stay at Kevin's longer before I had to go home cuz the bus would be like my mom didn't want me taking the bus in the dark and all that **** So, it was always weird because it's longer in the summer, right? Like the days are longer in the summer. Yeah. So, I was a little thrown off by that because I was like, \"Fuck, I wish that the days were longer in the the winter time because the summer I can **** stay forever because I don't have school or anything so I can sleep over for the entire months.\" But, uh, I wanted the winter to be longer so that on like random school nights and **** I could stay out longer. It was hard, man. Life's so hard when you're a kid. Life's really hard when you're a kid. Yeah. To me, to me that that is a good point because when I",
            "start": 1109.04
        },
        {
            "text": "school nights and **** I could stay out longer. It was hard, man. Life's so hard when you're a kid. Life's really hard when you're a kid. Yeah. To me, to me that that is a good point because when I was a kid, the night time was when I had to come back in because apparently to my mother the night time represented death. Castlevania basically. Yeah, exactly. So, she was always like, \"You can do whatever you want, but you have to get in before the sunset.\" And I'm like, \"All right.\" I tested a couple times. I didn't die, but I got her wrath. Um, it's like the light you're like chasing the light. The lights following you and getting darkness is coming right by. Like Chronicles are um Yeah. I don't know. I mean, I I used to love and I used to be very very nocturnal when I when I got married. My wife loves it the sunshine mostly because I think it does it actually affects your mood as well. Like the sunnier it is outside, the more you go outside, the happier you're going to be. I mean, I",
            "start": 1145.04
        },
        {
            "text": "My wife loves it the sunshine mostly because I think it does it actually affects your mood as well. Like the sunnier it is outside, the more you go outside, the happier you're going to be. I mean, I think that's just the way it works. Vitamin D. Yes. Science. Um, but yeah, I also just again coming from SoCal, like the longer the day, the more the longer the barbecue can last before it goes night. And night's when the party really begins, right, Kev? Kevin's wearing a How to Train Your Dragon shirt right now. And I like that. I like that a lot. Limited run, he says.",
            "start": 1180.88
        }
    ]
}