{
  "id": 988,
  "video_id": "OVaqTmdA9NM",
  "show_name": "Gamescast",
  "hosts": ["Greg Miller", "Tim Gettys", "Colin Moriarty"],
  "title": "Reviewing E3 2015 - Kinda Funny Gamescast Ep. 25",
  "description": "We discuss who \"won\" E3 2015, so many games got overlooked at this years E3, Greg got to actually play No Man's Sky, and we explain why Fallout 4 didn't get our game of the show. (Released 06.26.15)\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
  "published_at": 1435928401,
  "duration": 5512,
  "transcript_chunks": [
    {
      "text": "what's up guys welcome to the first ever episode 5 of the Kinda Funny Games Cast. Wow, we're quarter of a century. If each episode was a year, I know gone. So you know the annual podcast. It is the Kinda Funny Games Cast. It's hard to believe we've seen so much. We so we're coming back from E3. This shit's crazy. I can't even believe it. We're we're 5 now. We're a whole new person. It's awesome. As always, I'm Tim Gettys. I'm joined by the coolest dudes in video games, Colin Moriarty, Greg Miller. I like that name and I like that that name is starting to be a thing. Yeah, people said it to us a lot. I like that the co I like to know that the dumb **** that I say yeah resonates eventually and somebody cares going to resonate with someone. Yeah, someone out there usually cares before it was just Kevin and Alfredo. Yeah, look at Kevin he's just sitting there moping around doing his look how happy he is. All right, don't nobody can see him so don't waste time on him. Yeah, before we get into this",
      "start": 0.31
    },
    {
      "text": "Kevin and Alfredo. Yeah, look at Kevin he's just sitting there moping around doing his look how happy he is. All right, don't nobody can see him so don't waste time on him. Yeah, before we get into this whole thing I I do have one thing to to ask you guys here we go good we're finally getting to the brass tax yeah brass tax is of of the Kinda Funny Games Cast. I find it surprising that people are so vocal about the whole first and last episode whatever they know I hate it but it's because you hate it. I swear that if you never brought any attention to it no one would have ever said anything about it. There'd be some people that like it just because they feel like they're in on a joke or something. Yeah, I I just do it you know mean at this point I just do it because I been doing it and that's how I do things right yeah but my Lord there's some people out there I since we've started Kinda Funny I don't think there's ever been something people have been meaner to me about meaner they're mean",
      "start": 54.08
    },
    {
      "text": "I do things right yeah but my Lord there's some people out there I since we've started Kinda Funny I don't think there's ever been something people have been meaner to me about meaner they're mean about it how mean people I mean people I mean I'm not sure if they're joking or not but there's a lot of people that are just like it's so **** stupid it's insulting to me I'm like good Lord you know the rule though you have to know the rule you complain about something that's totally inconsequential I'm just going to do it even more like someone today was complaining that I used the word extraordinary too much so I don't know if you saw the tweets I just kept sending him tweets about how extraordinary he was and stuff like that that's amazing that's just the way it's got to go I'm sorry you know don't be mean to your complaints save your complaints for the you know the audio is bad or something wrong the video or that there's late you know like we **** a lot we make enough real mistakes",
      "start": 91.16
    },
    {
      "text": "don't be mean to your complaints save your complaints for the you know the audio is bad or something wrong the video or that there's late you know like we **** a lot we make enough real mistakes that we don't need to hear about the BS ones yeah exactly it's just interesting to me because it's one of those things that I think it's that important enough to have an opinion about no and I don't really care either I just yeah but I I think it's weird it's not like I like it it's not like it's a thing that I'm proud of that I'm like oh I think this is really funny like it's just something I do you know it's like the word rigal doing your thing I'm going to do my thing I'm going to do me don't worry about the haters yeah ladies and gentlemen if you didn't know this is the Kinda Funny Games Cast it's like the GameOverGreggy show but we're talking about video games and it comes out every week Monday through Thursday over on youtube.com/ kindof funny games breakouts they'll come to you",
      "start": 132.4
    },
    {
      "text": "cast it's like the GameOverGreggy show but we're talking about video games and it comes out every week Monday through Thursday over on youtube.com/ kindof funny games breakouts they'll come to you they're free and it's good but if you want the whole episode early you can go to patreon.com kindof funny games and you can get it it'll be great it's a dollar can do a whole bunch of other cool stuff is this one worth a dollar this one will be worth the dollar let's not g yet we don't know yet always says ahead of time if we got a lot of good topics on this one that I'm actually really excited about because one of them I'm just giving a little preview of topic three it's going to be No Man's Sky cuz Greg got to play it right I've touched it I've played it I've L questions about that I haven't talked to you about it cuz I wanted I wanted not really I mean you gave me a quick update but like I was wait you want to get you want to get in the Weeds about it you want the No Man Sky mud between",
      "start": 172.52
    },
    {
      "text": "talked to you about it cuz I wanted I wanted not really I mean you gave me a quick update but like I was wait you want to get you want to get in the Weeds about it you want the No Man's Sky mud between your toes man and you want me to put up my mouth and spray on your face and uh that's a nice segue this episode is brought to you by Loot Crate you if you classify yourself as a geek gamer or pop culture nerd then this is the subscription box for you for less than $30 a month you get 68 items of gamer and pop culture licensed gear apparel Collectibles unique one of kind items and more I'm sure you're very familiar lot gr's been very nice to us they're awesome they've been very nice they've been awesome the new Cyber crate just got here Kevin tore it apart Optimus Prime he took it from you he didn't let you have it he then gave it to me though he gave it to me he's a good dude hard I believe you guys are the same size oh my God so make sure to head to loot cr.com kfam is a fat joke you",
      "start": 212.16
    },
    {
      "text": "he didn't let you have it he then gave it to me though he gave it to me he's a good dude hard I believe you guys are the same size oh my God so make sure to head to loot crate.com kfam is a fat joke you have different bodies and enter enter the code KF games to save $3 on any new subscription every month there's a different theme and all items are created around that theme so basically lot crates like a friend who knows what you love and surprises you with an awesome present every month I like that I like that bit that they put because it's like that makes sense that's way Bo you're good at boiling it down you have until the 19th at 900 p.m. Pacific to subscribe and receive that month's crate and when the cut off happens that's it you're never getting that crate again guys my God so you better get on that so go to lot crate.com kfam and the code KF games to save $3 on your new subscription today bamk are done all right thank you CR for your support as I said this is our first post E3",
      "start": 253.72
    },
    {
      "text": "get on that so go to loot crate.com kfam and the code KF games to save $3 on your new subscription today bamk are done all right thank you CR for your support as I said this is our first post E3 Games Cast thank God stretch our legs so many people have questions so many people want to know different things E3 we played different games we saw a bunch of **** there was a lot of announc godamn no we we did a lot of if you guys saw we did a Games Cast for every press conference except for Square because I was butting up against us doing the actual show GameSpot cross Kinda Funny not to be confused with NX yeah that's higher NX is high GameSpot cross's on here he's low yeah um so we did a lot of stuff we did a game of the show thing which we gave to Horizon right and uh that game looks amazing but something that we didn't do on Gamescast and everybody I got maybe 20 tweets but I'm GNA give a shout out specifically to Nicholas Salazar at th Nicholas Sal oh no the Nick Salazar big fan I",
      "start": 291.0
    },
    {
      "text": "but something that we didn't do on Gamescast and everybody I got maybe 20 tweets but I'm GNA give a shout out specifically to Nicholas Salazar at th Nicholas Sal oh no the Nick Salazar big fan I see his name a lot he's a good dude he wants to know who One E3 also what the hell's going on with Nintendo that's a side side thought good things the gamer E3 yes good answer Greg so the thing there we're not going to do that **** because obviously the game obviously we won and but to be fair I think that this year more than the last couple seriously we won yeah totally there's going to be so many games that are playing like I am stoked and every single person I talk to they're excited about different games and that's really cool even Nick like he saw things like Gang Beast which has been around for a long time for people paying attention but for someone like Nick he's just looking at he's like I can't wait that game really looks hilarious it's yeah a lot of fun I'm excited to finally coming",
      "start": 337.44
    },
    {
      "text": "for a long time for people paying attention but for someone like Nick he's just looking at he's like I can't wait that game really looks hilarious it's yeah a lot of fun I'm excited to finally coming to console which reminds me I got an email double fun yes I'm excited about that I'm going cross my fingers this whole show to so I don't forget to you do it okay good long lot of show I know yeah yeah just you know seeing how long you actually hold out anyway so we discussed what our game of the show was but that's a different question than who won you know typically that comes down to the big three Nintendo Microsoft Sony which one of them won first off before we even get into this do you think that's the same do you think that we can judge this on the same scale in 2015 or change that like do you think that that's still the right way to judge who won E3 yeah I guess I mean I think it's all in the eye of the beholder right like we talking talking Colin and Greg live about how you know",
      "start": 382.36
    },
    {
      "text": "do you think that that's still the right way to judge who won E3 yeah I guess I mean I think it's all in the eye of the beholder right like we talking talking Colin and Greg live about how you know **** to give or in the eye of a holder for instance I don't have any **** to give but that's in my you know that's for me some other person might have a lot of **** to give I found some **** today during col Greg life take that as you will yeah um I think that I The more I've marinated on this the more I've come to different conclusions than my immediate reaction which was that Sony one um and I thought that because Sony and I still think that in a sense because Sony's games just speak to me more I mean we're very open about that so when I see games like The Last Guardian or Horizon or Final Fantasy 7 remake which I know a lot of people think is coming out other the consoles and might but they're they said as of today like they're only making it for PlayStation 4 they're not even",
      "start": 425.52
    },
    {
      "text": "Final Fantasy 7 remake which I know a lot of people think is coming out other the consoles and might but they're they said as of today like they're only making it for PlayStation 4 they're not even worried about the other consoles and stuff like that yet so you might never see that on anything else who the hell knows but you know we'll call that a multiplat but there are games you know and and announcement at that at that um that particular conference that just spoke to me on a level of a gamer it's not to say Microsoft didn't because I'm really excited about Gears 4 for instance and obviously in a f game recor makes me really excited but I think that if you look at who won from a paradigm shifting place in terms of coming into their own in terms of changing perception and Microsoft probably won you understand where I was coming from because I think that the Microsoft's doing all the right things now Microsoft and Sony's still doing the right things but Microsoft it's fresh and and",
      "start": 462.72
    },
    {
      "text": "won you understand where I was coming from because I think that the Microsoft's doing all the right things now Microsoft and Sony's still doing the right things but Microsoft it's fresh and and exciting for Microsoft because they just hadn't been doing the right things for a while ever since they rolled out Xbox One it really took them a while to like you know catch their their footing after they kind of stumbled and fell um but backwards compatibility I've said a lot for a while now since it was announced is the biggest announcement of the show I think that's a consequential a hugely consequential announcement I like that they took aim at Sony specifically in that announcement um by saying we're not going to make you pay for your games that you already own um of course this is a thing that has to have publisher cooperation and it's not going to be everything immediately but it could it be everything eventually giving Xbox One potentially a thousand new games you know um which is huge",
      "start": 500.44
    },
    {
      "text": "has to have publisher cooperation and it's not going to be everything immediately but it could it be everything eventually giving Xbox One potentially a thousand new games you know um which is huge it's **** huge and it's a pro consumer move I think it's a very popular move for a console that's already cheaper than this competitor so I think Microsoft might have won E3 depending on how you look at it and if you look at it from that perspective and look at it from changing minds and closing the Gap with PlayStation then certainly they probably did win because the other stroke of Genius as we talked about before is that they showed games much like Sony did that are a ways off with the exception of Halo and Tomb Raider in other words they showed games like Recore that are next year uh Gears 4 you know doesn't have a date yet but then they show gears and they you know Gears remake and they show uh Halo and they show Tomb Raider and they show the the rare collection and all these kinds of",
      "start": 534.72
    },
    {
      "text": "4 you know doesn't have a date yet but then they show gears and they you know Gears remake and they show uh Halo and they show Tomb Raider and they show the the rare collection and all these kinds of things things that are immediate The Tide is changing for Microsoft Sony should be worried about what's happening over there because son's games are all still in the future we're going to talk about No Man's Sky in a little while No Man's Sky is effectively a PlayStation exclusive for now anyway and I'm still not super convinced that that's going to be on anything else except for PC but we'll see right cuz someone's putting so much time and money into that game I I don't know what the publishing deal is but I don't think I don't necessarily think that that is 100% coming to other consoles but let's assume that they treat that as an exclusive and it comes out this year well they have that and Uncharted collection and that's it and Microsoft has Tomb Raider rare collection the Gears remake",
      "start": 569.04
    },
    {
      "text": "let's assume that they treat that as an exclusive and it comes out this year well they have that and Uncharted collection and that's it and Microsoft has Tomb Raider rare collection the Gears remake Halo 5 and Forza 6 it's a substantial substantial exclusive lineup um and I keep saying as we said on Colin and Greg today Greg that I hope Sony doesn't announce anything for for this fall because I just want to see how it plays out with nothing as an industry fan and analyst you want see right now I mean the big thing is Microsoft's moving all pieces into position and they're getting ready to start this war right to really unleash the troops here and that's what E3 was and why when we did the initial conversation afterwards where I was like I don't know if it's as cut a dry that Sony W that was what I was saying and you were right I was wrong about that I love you uh well this goes back to my point before of like Colin's the kind of guy who doesn't entrench himself in his opinion he",
      "start": 603.52
    },
    {
      "text": "was what I was saying and you were right I was wrong about that I love you uh well this goes back to my point before of like Colin's the kind of guy who doesn't entrench himself in his opinion he will sit there evaluate and change when evidence is brought up is the fact that yeah they put all these pieces in place of like we have this year covered and we have next year covered and then hey Sony's been showing you Morpheus forever and you think it's neat but not that cool but here's Hollow lens here's a hollow one Hollow lens demo that matters enough to for everybody to go that looks really cool I'd like to know more about that and then we'll move on to back to games and do all these different things and they've set it up to see yeah if there is nothing really for Sony this fall if it is No Man's Sky and it is Uncharted and that's it what does that mean the Gap is going to close I think significantly in terms of what the lead is and how that's going and then it'll get to be a smaller",
      "start": 647.64
    },
    {
      "text": "No Man's Sky and it is Uncharted and that's it what does that mean the Gap is going to close I think significantly in terms of what the lead is and how that's going and then it'll get to be a smaller Gap and you'll see Microsoft start pulling ahead next year yeah I mean I think that and this is the thing as as an industry analyst as someone who just loves numbers and loves the way the business side of the games work and often the stories behind the games we've said many times much more interesting than the games themselves and I still believe that I feel like it might not matter and that's why I want to see what happens because now we're going to have it it's it's going to it's not **** academic at that point it's going to be on the market right No Man's Sky I still I mean they say they're going to have data information soon I presume that means it's going to come out this fall I don't know that that for sure we know we're getting Uncharted collection this fall from Bluepoint but Sony",
      "start": 685.68
    },
    {
      "text": "going to have data information soon I presume that means it's going to come out this fall I don't know that that for sure we know we're getting Uncharted collection this fall from Bluepoint but Sony has sold 25 million or so PlayStation 4s with no games with no exclusive you need need need need exactly there's nothing on the console with the exception of I would say Bloodborne is probably its strongest exclusive and that's not a game that's like moving un exactly and then you have infam good games like Infamous get with art until dawn and Uncharted collection and that's it yeah so it won't be an academic exercise at that point at that point we're going to see if it really does matter because so far it has not mattered at all and that's and that's that's the amazing thing about it and maybe son's I'm sorry interrup maybe son's looking at it and saying well we have Fallout they've known about that for a long time no doubt sure you know we have Fallout coming out and so does Xbox One and we",
      "start": 724.72
    },
    {
      "text": "I'm sorry interrup maybe son's looking at it and saying well we have Fallout they've known about that for a long time no doubt sure you know we have Fallout coming out and so does Xbox One and we have Call of Duty and we have Battlefront we have all these games it doesn't really matter you know and and and I wonder I wonder you know obviously NAU dog does whatever they want so I'm sure that they would have liked to have that game this fall but you know I I I still I want to see it play out because I just don't know if it's going to matter if it doesn't matter that Microsoft's in **** huge trouble you know and that's and that's the thing that I want to see if that plays out or not the fact that Sony's done so well right now with no true exclusive of their own I think really we're you know you and I have done this beat for a long time and we cover the **** out of the first parties right if the fact that Sony has done so well right now and if nothing changes this fall because of it",
      "start": 767.8
    },
    {
      "text": "you and I have done this beat for a long time and we cover the **** out of the first parties right if the fact that Sony has done so well right now and if nothing changes this fall because of it I think that speaks so much to their third party team that Adam boy LED team and the fact that you know oh Batman Arkham Knights out and where do you get the exclusive Batman console it's a PlayStation 4 Destiny was a PlayStation for and granted we've talked before those numbers didn't seem outrageous that they were moving units that way but it's getting it's the it's the inverse of what last year was where or I'm sorry last generation was where it was every time you saw something it would go boom and be the Xbox 360 logo and people like oh that game is going to be on Xbox 360 I'm going to play it on Xbox 360 whereas right now it seems like it's a PlayStation 4 ideal yeah and the fact that uh you know you see Battlefront and that seems very PS4 heavy like Sony is pushing that game I think",
      "start": 805.28
    },
    {
      "text": "it on Xbox 360 whereas right now it seems like it's a PlayStation 4 ideal yeah and the fact that uh you know you see Battlefront and that seems very PS4 heavy like Sony is pushing that game I think that's a big big thing there where you're right it's like last gen was Xbox this gen is PlayStation and that's crazy because to the general consumer that's what matters yeah like there's they see this and they don't give a crap if it's on both systems or not they just know oh it's on this system I need this system so yeah yeah I think I I think that it's all about perception I don't usually there's a clear-cut winner it's typically been Sony I think we can all agree on that the last two years or so with the exception of this year because the really the more I marinate marinate on it and that's what I was saying was I'm like well what was the point of the conference you know if the point was to move the needle significantly then Microsoft wins yeah if the point was to show me games that I",
      "start": 839.72
    },
    {
      "text": "what I was saying was I'm like well what was the point of the conference you know if the point was to move the needle significantly then Microsoft wins yeah if the point was to show me games that I want to play then then Sony wins I I think so again it is it is super perception heavy the the other winner of course is Bethesda right now I was really impressed with Bez's showing first of all Doom looks **** awesome and I love that they're just calling it Doom um it looks great some people were complaining about it's too violent it's too bloody I don't give a **** the thing I love about the game I'm I don't give a **** about the thing I love about the game is that it's there's zero pretention about it there's no story it doesn't give a flying **** why you're doing what you're doing it's a game you know and a lot of people feel like they can't make games like that anymore and that's not a inconsequential game it is making the game and but does is publishing it it's a huge studio",
      "start": 878.32
    },
    {
      "text": "it's a game you know and a lot of people feel like they can't make games like that anymore and that's not a inconsequential game it is making the game and but does is publishing it it's a huge studio and a huge publisher putting this game out and it's just like it's just Doom you know and and and I I think that's pretty cool obviously they'll have context but you know I don't think it's going to be a very story heav story heavy Affair and then obviously Dishonored 2 looks cool and I feel bad that the game leaked the day before but it is what it is and then obviously Fallout 4 is going to blow everyone away and people still think I'm overestimating how well that game is going to do and I think you're I think you I think you're going to be if you're if you're really surprised why say Tomb Raider might be in trouble that it's coming out the same day Fallout 4 is you'll know in November why it's why it's going to be in trouble because that game is GNA **** trounce everything around it so",
      "start": 916.52
    },
    {
      "text": "might be in trouble that it's coming out the same day Fallout 4 is you'll know in November why it's why it's going to be in trouble because that game is GNA **** trounce everything around it so um you know I I feel I like Bethesda stance because I just don't think they're going to do this again and that and I'd be really interested to see if they do there's no reason for them to do it again all their games will be out with the exception of maybe Doom by that point right if they do it again it'll be farflung it'll be the same thing all the stars align that oh hey we have four three four great titles we need to talk about why this happen Scrolls I'm assuming the next time there is one there it'll be there yeah exactly they don't they're not Fierce about annualizing as we talked about in our pre-show before the conference but Bethesda seems to be mostly focused on building games internally and Publishing them much like Ubisoft so they have their work cut out for them because they just",
      "start": 951.88
    },
    {
      "text": "our pre-show before the conference but Bethesda seems to be mostly focused on building games internally and publishing them much like Ubisoft so they have their work cut out for them because they just don't have that many studios. Ubisoft has a lot of studios that are things you've places you've never **** heard of and cities you've never heard of around the world that make all these games right. Ubisoft Sofia I think was the one that made Assassin's Creed on Vita right so it's like all these random Studios. Bethesda has a smaller group of Studios that are bigger names I think like ID for instance or Bethesda Game Studios which are the RPG makers and I think that they just give them time to make games. I don't think Bethesda's ultimate goal or you know ZeniMax's ultimate goal is to become yay. I think their their whole thing is like we make premium games that are going to sell 10 million copies yeah and um you know but Fallout 4 will easily sell 10 million copies uh Doom is probably good",
      "start": 986.32
    },
    {
      "text": "I think their their whole thing is like we make premium games that are going to sell 10 million copies yeah and um you know but Fallout 4 will easily sell 10 million copies uh Doom is probably good for five if not more depending on how good it is. Dishonored will do a few million so like they're ultimately trying to get to that point where like we make a premium product um which tells me that you know they put everything into this particular showing and the stars did align and you will not see them at E3 next year um at least in a conference sort of way so I think that they're huge winners because they made such a huge splash um and then I think everyone else did okay. I think there's some losers. I certainly think Nintendo is is probably the major loser. Uh I don't I don't I don't know if you guys necessarily agree with that. I think it's as clear as the day is long personally they're taking it on the chin hard right now because it was what people wanted. I thought it was an entertaining",
      "start": 1026.44
    },
    {
      "text": "guys necessarily agree with that. I think it's as clear as the day is long personally they're taking it on the chin hard right now because it was what people wanted. I thought it was an entertaining conference which is the opposite of EA and now granted EA didn't speak to me in terms of games you know what I mean P comes out and stuff and I understand that I'm maybe not the target audience for that but overall it just wasn't super entertaining or as at least Nintendo I thought had the initials and the jokes and whatever and I think it speaks again to what I always say is that I don't think what Gamers want Nintendo to be. I don't think Nintendo wants to be that so I don't know but yeah Nintendo definitely is the one like he always saw we were talking about the day after we were finally able to look at the coverage that it wasn't just us it was like people in the internet in general like this wasn't good yeah but I think the difference there though is like you're saying that the EA",
      "start": 1063.96
    },
    {
      "text": "able to look at the coverage that it wasn't just us it was like people in the internet in general like this wasn't good yeah but I think the difference there though is like you're saying that the EA conference and we talked about this a couple times last week but who was that geared towards like who is the audience when you're that expansive I don't know if you I mean that's the whole thing is like and that's why they had to be hey everybody who wants to talk about mobile 15 minutes until Battlefront like we know why you want to watch this exactly but even then it's like who is the audience for the the mobile stuff like I don't think that there needs to be a press conference talking about these games like the audience is on their phones they're not watching E3 you know what I mean like I don't understand the the need to like talk about the new Madden and all the new sports stuff the people that are going to play those games know that they're coming and we don't need to hear about the",
      "start": 1095.64
    },
    {
      "text": "don't understand the the need to like talk about the new Madden and all the new sports stuff the people that are going to play those games know that they're coming and we don't need to hear about the features and stuff if people want to hear the features they'll go to IGN they'll go to Gamespot they'll figure it out right wasting the time of the press conference seems weird to me because it just bogs it down whereas Nintendo stuff it's like maybe it didn't speak to us because it wasn't the games we wanted but I mean I'm all the Animal Crossing stuff I'm sure the people that love Animal Crossing were like **** yeah you know seeing Star Fox I was like **** yeah I have my issues but it's like still it's Star Fox you know Mario Maker I'm sold all the Japanese games not necessarily my thing and even the Fire Emblem stuff I'm like I love Fire Emblem but I don't want this okay well then you be a hypocrite cuz you can't say that about the Japanese games and then be like if you want to know",
      "start": 1132.24
    },
    {
      "text": "and even the Fire Emblem stuff I'm like I love Fire Emblem but I don't want this okay well then you be a hypocrite cuz you can't say that about the Japanese games and then be like if you want to know about Madden though go to IGN like these what these conferences show your portfolio no but but what I'm saying is like there's a difference between EA and Nintendo in the fact that the the Madden stuff it's like they're they're aiming at nobody really like even those people those people don't need to hear the new updates and stuff they're going to buy the game mhm these Japanese the people that are the Japanese games they that is an audience that does that is the right place to tell them that information I don't know if I fully agree I I'm with you I understand what you're saying I think EA was a was a ve was by far the most traditional E3 press conference right we've seen all the first parties move away from that you've seen Ubisoft I mean now it's been years it's you think traditional",
      "start": 1171.04
    },
    {
      "text": "was a was a ve was by far the most traditional E3 press conference right we've seen all the first parties move away from that you've seen Ubisoft I mean now it's been years it's you think traditional Ubisoft you think Aisha Tyler but that was a deal when they moved away and had her and you know what I mean like Mr caffeine Mr I wonder what that would look like no like you know EA was very like here's your next talking head here's the next game in our portfolio here's what it's doing feature with I understand I I think that there's two things that are worth noting about well who are the mobile announcements and the sports announcements for right they're for USA Today they're for the New York Times they're for the Wall Street Journal they're for all these newspapers and mainstream coverage and they're also for their stockholders right exactly you know so that's why that's where E3 gets really complicated and why Sony for instance does a really convoluted kind of thing where they do a",
      "start": 1207.56
    },
    {
      "text": "and they're also for their stockholders right exactly you know so that's why that's where E3 gets really complicated and why Sony for instance does a really convoluted kind of thing where they do a lot of conferences at TGs and stuff like that in Japan where they usually have two conferences because you know they or just speak multiple times because they're speaking in a lot of different audiences so at E3 yeah you want to speak to us but we're not the only people they're speaking to and frankly EA finds a write up in the Wall Street Journal 50 times more valuable than they do a write up in in IGN guaranteed you know like it's just it's just so like public perception yeah exactly because like you said IGN's audience for instance already knows about all these games and they don't care really like they they're gonna buy Madden you're gonna buy fif you're gonna buy FIFA doesn't matter like what it's what it's reviewed but a write up for a casual audience that reads Wall Street Journal at",
      "start": 1243.84
    },
    {
      "text": "like they they're gonna buy Madden you're gonna buy fif you're gonna buy FIFA doesn't matter like what it's what it's reviewed but a write up for a casual audience that reads Wall Street Journal at the dinner table uh after you know eating you know drinking CFE and eating dessert or whatever with their family that's a pretty big thing for them so they have to aim at those kinds of things the other thing that EA had that's that Nintendo frankly did not have were Bombshells right they showed Mass Effect for the first time which is huge and Mass Effect Andromeda then in the middle they show Mirror's Edge which is huge and then at the end they show battle for which is huge and all those games are going to sell when you go back and you look at EA and you talk about tent poles and stuff like that that's when I was like oh yeah those that was cool it just in the the moment to moment of just like oh what are you talking about I don't care about PLS versus but I'm sorry to interrupt that was",
      "start": 1278.48
    },
    {
      "text": "that's when I was like oh yeah those that was cool it just in the the moment to moment of just like oh what are you talking about I don't care about PLS versus but I'm sorry to interrupt that was the Nintendo is that I mean I thought Star Fox was so obvious that I predicted Not only would it be at the at the conference but it would be shown first because that was obvious right and then other than that nothing like literally nothing and I don't think Star Fox looks good at all and Star Fox isn't going to sell news flash you know so the more I thought about that conference more I'm like this is weak but it wasn't until I really started reading NeoGAF and all these places where I'm like people **** hated that conference like I like I couldn't usually every all the Nintendo fans hate me right yeah I say something about Nintendo they're all mad at me but I'm like Jesus Christ like they're finally Maybe seeing that this company is like a wreck you know um and the one thing I felt bad about",
      "start": 1309.68
    },
    {
      "text": "yeah I say something about Nintendo they're all mad at me but I'm like Jesus Christ like they're finally Maybe seeing that this company is like a wreck you know um and the one thing I felt bad about with Nintendo frankly was what everyone's expectations were they're in the space in between right now I don't know what the **** you want them to do you know they cannot talk about their next console yet and they said they weren't going to and they have to ride it out and get some games out but they're not going to talk about the next big Mario game and they're not going to talk about Zelda because guess what they're going to talk about those things when they're ready to talk about them and they're probably associated with NX you know I think I'm I'm I'm becoming more I'm becoming more and more I thought was crazy but I'm becoming more and more uh certain that this new Zelda game is the Twilight Princess mhm in terms of it'll be like a legacy game and it'll be on the next system as well",
      "start": 1343.2
    },
    {
      "text": "I thought was crazy but I'm becoming more and more uh certain that this new Zelda game is the Twilight Princess mhm in terms of it'll be like a legacy game and it'll be on the next system as well yeah yeah it's interesting I mean I think that's the I've been thinking about this a lot in terms of the Nintendo Direct because of course I want them to win I want them to be good and it's like I just can't say that they did based on what they showed and I was thinking like what could they have done to fix it and it's like I don't think there's anything like I really don't think there's any announcements they could have made like even if they came out with a Metroid Prime and a a new Mario and all this stuff it's like at the end of the day it still would have been all right like it would have been the equivalent of va where it's like you had those yeah there's those couple big things but besides that overall people are still going to look down on it and be like whatever and I think that the",
      "start": 1376.4
    },
    {
      "text": "the equivalent of va where it's like you had those yeah there's those couple big things but besides that overall people are still going to look down on it and be like whatever and I think that the fact that they didn't show those things shows that they know that they're in the transition period and maybe it's a good thing we didn't see Mario Galaxy 3 or whatever the hell that would be because it's showing that it's like they they're not going to like keep trying to fail they're going to wait for the NX or hopefully whatever that is take their lumps and keep going yeah you know and like that to me that's a win you know what I mean doesn't mean they win the three but it definitely means like it's I think that that conference it was good for me because it's like there are games that I can't wait to play from that show that's all I needed I wish there was a surprise and there wasn't and because there was no surprise it was a shitty conference Muppets were surprising that was quite the",
      "start": 1412.4
    },
    {
      "text": "wait to play from that show that's all I needed I wish there was a surprise and there wasn't and because there was no surprise it was a shitty conference Muppets were surprising that was quite the surprise yeah it was surprising and that haunted my dreams for the next few nights but yeah I think that I feel bad for Nintendo because there's a few things right a no game company would get away with the **** they've been showing the last couple years if they weren't Nintendo and that's and that's an obvious thing that you have to say right they're getting by on Legacy purely at this point but they've earned it so I don't really get necessarily mad about that because I know that they are again in the space in between and like they just have to figure out and I'm sure are figuring out what they're going to do I think Nintendo returns to E3 in a major way and a live way next year um with the debut with a new console and I or whatever it is who the hell really knows what it is piece of",
      "start": 1447.88
    },
    {
      "text": "they're going to do I think Nintendo returns to E3 in a major way and a live way next year um with the debut with a new console and I or whatever it is who the hell really knows what it is piece of Hardware something um Google Glass Google Glass and but again just hearing you know Aada apologized on Twitter you know for like that showing then Reggie comes out and says like he wasn't really apologizing all this stuff and I'm like no I think he was apologizing then they say really backwards things like oh VR is not fun and it's boring I'm like are you out of your mind you know like just stop talking recede into the background and figure everything out because day by day you're losing people when people start feeling like I feel I've felt about Nintendo for a long time and that seems to be a really common thing now you know I don't care how much money you have in the bank and I don't care how popular you are you're in a lot of trouble and you know you better figure your **** out and I",
      "start": 1483.4
    },
    {
      "text": "really common thing now you know I don't care how much money you have in the bank and I don't care how popular you are you're in a lot of trouble and you know you better figure your **** out and I want Nintendo to just go away you know just be quiet trickle out these other games you just need to get out like Yoshi and all these other games and just come back and shove your boot in everyone's ass next year you know what I mean and they're just not going to do it you know I know in the back I I expected them to do it with Wii U yeah I know everyone did and and I I thought like cuz we had such a bad had it was there and it sold very respectively and game sold but it was just a joke you know by the end and I I knew that they knew that and when they revealed project Cafe and all these kinds of things I was like yes yes like show us what you can do and get us back and make us excited again and the Wii U is a a rush to Market ill-conceived yeah underpowered console I'll never forget that",
      "start": 1525.72
    },
    {
      "text": "of things I was like yes yes like show us what you can do and get us back and make us excited again and the Wii U is a a rush to Market ill-conceived yeah underpowered console I'll never forget that E3 when they unveiled the the Wii U and everyone no one knew it was going going into it yeah but it it was the bad no one knew where it was whereas going into it it was the good no one knew where it was and everyone was just like oh it's rumored to be called just the Nintendo Entertainment System they're fixing the problems they're doing all this stuff and I'll never forget when uh our Nintendo guy at the time got to see like the pre- showing thing and he walked up to me he just shook his head he's like it's not what you think it is it's not and I was just like **** I just remember my stomach dropped I'm like God damn it yeah because it became clear that they had been this you know Nintendo takes R&D seriously like any hardware manufacturer but they what they take really seriously with",
      "start": 1568.04
    },
    {
      "text": "dropped I'm like God damn it yeah because it became clear that they had been this you know Nintendo takes R&D seriously like any hardware manufacturer but they what they take really seriously with R&D is innovation right the analog stick the rumble pack the little discs motion control little discu you know anything like but there was reasons for them to do things like that right and the d-pad I mean like it's all shoulder buttons like it goes on and on and on and on but eventually Innovation stops becoming Innovation that everyone wants and Innovation becomes gimmicks that no one wants and the Wii U is and was such an overt look at tablets we have to do something with tablets you know and it's like no man like can game can will the GamePad serve your games no it clearly doesn't um will it even be remotely in the same league as the tablets that are on the market not a not no no no prayer and that's why I just I hope against hope man that they and I I feel like it's",
      "start": 1613.8
    },
    {
      "text": "doesn't um will it even be remotely in the same league as the tablets that are on the market not a not no no no prayer and that's why I just I hope against hope man that they and I I feel like it's possible but unlikely that they really just knock it out of the park like I don't they have to know you know that that they are they are on borrowed time now until until and I I know that people think I'm crazy when I say that because they have so much money and so much prestige in these IP I'm not saying Nintendo is going to go out of business I'm saying their Hardware business is on borrowed time you know they need to come out with something that will compete with PS4 and Xbox One which will be on the market until 2020 if not beyond that so like they have to figure it out they have to figure it out and I want them to figure it out and I say as we said and Greg the way they're going to figure it out is to get out of hardw and make your games I think NX is going to be continue on this",
      "start": 1660.6
    },
    {
      "text": "it out and I want them to figure it out and I say as we said and Greg the way they're going to figure it out is to get out of hardw and make your games I think NX is going to be continue on this Innovation route and so then the question is going to but the question is is I mean like if they come out and they do what we keep asking for where we keep saying we want a handheld slome console that that you know basically imagine if you could just take the Wii U tablet with you right and play games on the go if they go that way and they the DS is over and this is our handheld is this which which is also it's the n and then the x is the Home console but it's all the same thing and that's NX that's the Innovation we' want you know what I mean if they go that way and they they take the ideas they have of we want to keep changing what gaming is we want to change what Nintendo is but we want to talk to the gamer again that's where it gets different right now I think they still tried with Wii U",
      "start": 1705.44
    },
    {
      "text": "have of we want to keep changing what gaming is we want to change what Nintendo is but we want to talk to the gamer again that's where it gets different right now I think they still tried with Wii U to be a toy guy we're still going to make you toys and stuff and they have to decide real quick if they want to keep going down that route which I do think ends in a dead end where they have to just put their games on everything which wouldn't be the worst thing in the world I mean that's it would be ideal said before and I hope that happens like because I I love Nintendo at this point for their games not for the system it's on right like no matter what happens I love my Wii U for the games that are on it and when the the generation ends and Wii U finally like actually dies I'm going look back and be like wow I enjoyed this **** out of enough games on that thing that made it totally worth it to me but I don't love it because the Wii U God knows I don't love it because the Wii U right you",
      "start": 1745.88
    },
    {
      "text": "and be like wow I enjoyed this **** out of enough games on that thing that made it totally worth it to me but I don't love it because the Wii U God knows I don't love it because the Wii U right you know but I hope that that happens one day as much as that hurts me to say because I don't when you just said like what we all want for this to be this portable SL console thing the more I think about it the more I'm like I don't know if that is what I want anymore you're a piece of garbage I mean we almost had him reie was listening yeah yeah yeah yeah but I mean if they're going to go the hardware route that is what I want for sure like that just makes sense but then again if they do that then it will still be not as powerful as the other consoles they'll still be that you don't need that why do you care why do you need that there needs to I I do think that there needs to be parody and there's no excuse for them if they're going to launch a console three years after the other ones that",
      "start": 1781.28
    },
    {
      "text": "do you care why do you need that there needs to I I do think that there needs to be parody and there's no excuse for them if they're going to launch a console three years after the other ones that it shouldn't be more powerful than those consoles and that's the thing that people should be excited about you have to make a device that people want to make games for you know and I don't know why that's so lost on people I don't care that the 3DS is underpowered and the games look like complete garbage on it and and that's just the fact of the matter you know I I'm I never I'm ceased like to be amazed when I see a new 3DS game and I'm like Jesus Christ you know I don't care about Graphics but I look at it from a perspective of is a game develop going to be excited to make a game on 3DS probably not is a game developer excited to make a game on Wii U no you know and do they make it do they make it uh easy to do that no they need to make a game they need to make a console that engenders the",
      "start": 1821.44
    },
    {
      "text": "not is a game developer excited to make a game on Wii U no you know and do they make it do they make it uh easy to do that no they need to make a game they need to make a console that engenders the support of third parties or they will not survive you know it's just or and by they I don't mean Nintendo I mean their console will not survive and that's obvious I mean they had a they got into into bed with with bit like Platinum for instance and bring Bayonetta and the wonderful 101 over and stuff like that like certain games are just never going to happen unless they start paying for them and I can't imagine those games are profitable maybe they were they have to make something that gets people excited on the developer side and they burned so many bridges with with developers at this point look at Zombie U like like Zombie U was made by Ubisoft they wanted to make a sequel they didn't because it didn't sell very well and now they're bringing it to Xbox One and PS4 it looks like which is",
      "start": 1858.92
    },
    {
      "text": "at Zombie U like like Zombie U was made by Ubisoft they wanted to make a sequel they didn't because it didn't sell very well and now they're bringing it to Xbox One and PS4 it looks like which is unbelievable and weird you know yeah because they want to extract more money out of it because they're not excited anymore they took games like Rayman and were like uh we're going to delay Rayman because we need to get it on the other consoles you know like we're not releasing it now yeah we it's ready to go it's done on Wii U we're not releasing it like that's incredible that's incredible stuff because they know they can only make one introduction with their game it doesn't matter what consoles it's on I fear for Nintendo in the sense that they're going to keep trying to go down this road and then they're going to find themselves in financial problem in financial trouble but they do have a lot of money they have valuable IP and they're doing things like you know a theme park integration and",
      "start": 1898.56
    },
    {
      "text": "they're going to find themselves in financial problem in financial trouble but they do have a lot of money they have valuable IP and they're doing things like you know a theme park integration and stuff like that which is awesome and at the end of the day they own Mario, they own Donkey Kong, they own all these like all these valuable IP and we're seeing a different Nintendo now with their cooperation with DNA and Nintendo that I would never and that's why I'm so confident in saying that not confident but more comfortable saying maybe they will stop making Hardware at some point because if you asked me six months ago if they were going to put their **** on cell phones I would have been like you're out of your mind of course they're not going to do that and not only they're doing that they they got in bed with another company because they admitted which is amazing that they don't know how to do it I mean that's a this is a different Nintendo that we're seeing now so they I mean the",
      "start": 1933.2
    },
    {
      "text": "they got in bed with another company because they admitted which is amazing that they don't know how to do it I mean that's a this is a different Nintendo that we're seeing now so they I mean the Skylanders integration I thought was a big step forward too is I mean that's huge yeah you know that's the thing is like people **** on the the direct but it's like I mean that was a huge announcement not for us but for the industry and for all like what's happening right now that's a huge deal for the imbros they all they're going to care about there's a whole ton of them yeah we'll see man I I'm you know the thing that thing that never changes for me with Nintendo is I'm always rooting for them yeah I'm never surprised when they **** it up but I'm always always always rooting for them because at the end of the day a strong Nintendo and a healthy Nintendo is good for games and good for Innovation and drives everyone to make better games and I do believe there will be a time again when",
      "start": 1963.64
    },
    {
      "text": "at the end of the day a strong Nintendo and a healthy Nintendo is good for games and good for Innovation and drives everyone to make better games and I do believe there will be a time again when everyone looks at Nintendo and says like they make the best games and that's all that matters cuz they do they do make the best games that's the whole thing I don't think people look at them now and don't say that I personally think people look at Studios like Naughty Dog, I think people look at Studios like Bethesda Game Studios, I think people are looking at CD Projekt Red, I think people are looking at all over not at Nintendo anymore personally you know and not looking at and not looking at Nintendo Studios and being like you know looking at Rockstar looking at whoever and being like they make the best games looking past Mario Golf World Tour come on guys sort the **** out kids all right so going out going back to it before we close out the topic so who won E3 the gam if we had to choose",
      "start": 2000.0
    },
    {
      "text": "the best games looking past Mario Golf World Tour come on guys sort the **** out kids all right so going out going back to it before we close out the topic so who won E3 the gam if we had to choose one besides the gamers like I do we all agree Sony I agree Sony and that it spoke to me more but I I still think Microsoft makes a very the thing is like Microsoft Rises to the top in my mind just cuz Sony was a great conference but then it's the same thing like some of those games didn't speak to me so and I the majority of them did but Microsoft I felt was the one that had like oomph to it you know what I mean and Beth I'm not counting I mean Fallout was amazing Fallout's going to be amazing I can't wait for Fallout but in terms of who won I think it comes down you start talking about first party is where it comes down to yeah exactly I I that's what I was saying earlier it's like do we still is that the scale is it those three but I think it is the scale is outdated it's one of those",
      "start": 2034.36
    },
    {
      "text": "party is where it comes down to yeah exactly I I that's what I was saying earlier it's like do we still is that the scale is it those three but I think it is the scale is outdated it's one of those things that this none of this makes sense and it's just us all yeah jerk jerking ourselves off talking about this saying what we want it's so weird for me to to think about it though that we're in a world where Final Fantasy 7 HD or not HD remake was announced and it's not like oh Sony **** W that's to me and like it shows how strong it has been but it's it's been hasn't been too long like that's the thing is I feel like that announcement any other year I feel would have been a much bigger deal than people are making it out to be not to say they're not because obviously if you look at the Internet it's like the number one freaking thing everywhere but it's like it's really weird talking to you guys and and feeling like I need to keep bringing it up you know it's because it's so far off I",
      "start": 2073.92
    },
    {
      "text": "it's like the number one freaking thing everywhere but it's like it's really weird talking to you guys and and feeling like I need to keep bringing it up you know it's because it's so far off I mean that's the thing is that this is just a very it's a very premature announcement that really had no business being made to be very honest with so it's like that that's the one thing that's yeah that's to me that's the one thing why I'm not excited about it's the same reason why I'm not excited about Kingdom Hearts or Final Fantasy 15 cuz I know they're nowhere near being done so it's just like and Final Fantasy 7 is way behind those games Final Fantasy 7 also I think had you saw it at PSX and like the way everyone built and started like that was when holy **** are they about to oh it's the PC thing and so we already had that tease and like this was still like what's happening exactly and then it was over you're like oh cool and it was like yeah oh clearly not anywhere close to being a",
      "start": 2112.72
    },
    {
      "text": "PC thing and so we already had that tease and like this was still like what's happening exactly and then it was over you're like oh cool and it was like yeah oh clearly not anywhere close to being a real game yet you know what I mean it's like all right cool that's a great announcement I'm glad but it wasn't like it ended and they went into a demo and like you know this is what's gonna be happening next year and like that yeah you know what I mean yeah they're building I mean they're they're they're entering production which is a bad I mean it's great they have to enter production at some point but the it's it's bad if you want to play the game anytime soon especially remaking a game like that it's going to take time and and effort and and and massaging that just so you know like oh yeah finesse it's a great word for it they have to treat it with great care and I think there's going to be a lot of problems making this game I I got I like I I think it's exciting but I think this game",
      "start": 2146.64
    },
    {
      "text": "finesse it's a great word for it they have to treat it with great care and I think there's going to be a lot of problems making this game I I got I like I I think it's exciting but I think this game is going to go through a lot of problems because they're going Cyberconnect will try to change things well and I don't think it's and I don't think that's going to resonate Cyber Connect yeah we're gonna we're going to keep that for a topic maybe next week I'm trying to figure out how to how to best do it because Greg's not so much a I'm I'll go play Batman when you guys talk about it do that but uh I definitely want to talk to you about what you think they should change how they're going to change it and if that's such a big deal or not but whatever it's a huge deal if they try to change anything but yeah we'll see we'll say that for next time um continuing on with E3 Gry Fox at Gray Kitsun wants to know good gear reference what were games you thought were ignored at the show or didn't",
      "start": 2182.0
    },
    {
      "text": "but yeah we'll see we'll say that for next time um continuing on with E3 Gry Fox at Gray Kitsun wants to know good gear reference what were games you thought were ignored at the show or didn't get enough attention because of all the other Big T that were there now this resonated with me because I'm a big fan of a lot of little things so it's like games like Amplitude get me super excited they're not the biggest games you know but they're ones that I'm going to SN a lot of time into and I remember walking around the show floor and looking around just being like tons of things that I was like oh **** that's playable oh **** this is here and like no one even talked about it like Ratchet and Clank comes to mind yeah that game looks so good Pi a couple weeks ago we saw the trailer and it was just like oh crap this looks good it was playable on the show floor and I was like how the hell is this no one's talking about it oh it's because they wore out their welcome the damage is done stop",
      "start": 2216.08
    },
    {
      "text": "just like oh crap this looks good it was playable on the show floor and I was like how the hell is this no one's talking about it oh it's because they wore out their welcome the damage is done stop making Ratchet and Clank games no no no no no it don't reboot it now and think that we won't notice what's happening no that looks good and then also saw Journey on PS4 which they've shown like 10 million times it's really interesting like where is that like why is that not just it's out yeah I know right that's the thing we've heard about that game forever it's like okay do it pooper get off the pot um so I'll tell you a game I'm a fan as these small games too a game that I was surprised I didn't think about forgotten all about Metal Gear Solid the Phantom Pain Metal Gear Solid 5 the phantom Pain the game that I said it was currently my game of the year like I got I was on there people started tweeting me like hey you're going to give one of Awards to mle Gear Solid 5 and I was like oh",
      "start": 2256.28
    },
    {
      "text": "Pain the game that I said it was currently my game of the year like I got I was on there people started tweeting me like hey you're going to give one of Awards to mle Gear Solid 5 and I was like oh right Middle Gear Solid 5 is here and it's not out yet you know what I mean it's just like you want to talk about the how how E3 works is that there's no trailer reveal at any of the press conferences there's a giant demo on Jeff Key's YouTube stage just like where Telltale went to go talk about The Walking Dead spin-off for Michonne and nobody **** heard it you know what I mean like nobody heard it cuz there was so much noise so many big events so many pre-shows so many post shows that like you had to be dialed in at that one moment to get into we watched the trailer we did the rewind for it and we had a great time talking about it right but that didn't resonate to me as a e3 game of the show and now granted it's cuz I'm spoiled I already played it I put two days into it but it's not it",
      "start": 2300.0
    },
    {
      "text": "and we had a great time talking about it right but that didn't resonate to me as a e3 game of the show and now granted it's cuz I'm spoiled I already played it I put two days into it but it's not it wasn't even on my radar in terms of e3 I didn't hear a lot of people talking about it people did eventually start talking about the demo but it was your embargo was up before E3 you're you did a trailer you're not on the stage you have the booth but it's like booths aren't really what E3 is to us you know me3 the stage demos it's the press conferences it's these different things I was surprised yeah that there you didn't feel a presence of it and a big part of that I think is the fact that Kojima wasn't there you know what I mean they didn't have him there if things weren't South with them right now you have to imagine he comes out on the Sony stage and talks about Metal Gear and shows a demo and does something cool to get everyone excited about it but the fact that it was like sectioned",
      "start": 2342.96
    },
    {
      "text": "now you have to imagine he comes out on the Sony stage and talks about Metal Gear and shows a demo and does something cool to get everyone excited about it but the fact that it was like sectioned off it was to me forgotten that's why I didn't think of to give it an award and after the fact I started going back and forth in my head I'm like well I've set it to my game of the year so far so I think that's a good enough nod for it and it's just like yeah like I want to give it to things that caught me off guard or I didn't see coming like E3 that excitement and that oh my God something brand new and Metal Gear has been around a bit you know what I mean like let's get out there and do something MH and a lot of people called me out uh not called me out but a lot of people had questions I should say and brought up the original tweet I did from Kojima St or I'm sorry Konami La Studios down there when I was playing Metal Gear right cuz I tweeted out that on this day I can talk about single",
      "start": 2380.84
    },
    {
      "text": "say and brought up the original tweet I did from Kojima St or I'm sorry Konami La Studios down there when I was playing Metal Gear right cuz I tweeted out that on this day I can talk about single player and on this day I can talk about middle gear saw it online and it was like the Tuesday of e3 right and so that day during the shows or the live streams people were hit me up like what's going on why are you talking about it I was like cuz they didn't show anything and here we are E3 and did they show anything I don't know I didn't get a chance to watch all these things they're doing on the YouTube stage but for us it was one PowerPoint slide that said how many players are in a map so I really have nothing to say because I have no idea what the hell Metal Gear Solid online's all about like I know Phantom pan looks great and that looks awesome but online I still don't know what's happening I want to give a shout out to a game that I think got appropriate amount of of coverage and and was",
      "start": 2416.08
    },
    {
      "text": "know Phantom pan looks great and that looks awesome but online I still don't know what's happening I want to give a shout out to a game that I think got appropriate amount of of coverage and and was playable which is Mario Maker um I think that I didn't get a chance to go over and play it that game looks **** awesome and I can't wait to play it so I'm glad that um that that seemed to be like the star one of the stars of the show just generally not even nintend yeah certainly yeah it was one of your games of the show it bothered me in the Nintendo Direct how they were manhandling all those documents but other than that it was good um here's the original way we laid it out like pulling in strong like all right pulling out of your pocket like oh by the way there it is sorry forgot that we got the original document Jesus Christ what are you guys thinking um but yeah that game looks awesome so I I want to give a shout out to that uh there were a few games that I was surprised I didn't",
      "start": 2448.32
    },
    {
      "text": "got the original document Jesus Christ what are you guys thinking um but yeah that game looks awesome so I I want to give a shout out to that uh there were a few games that I was surprised I didn't see more about I didn't go I didn't do like a deep deep dive but a few games that came to mind one of the games I was surprised that I didn't hear more about was Rigs oh yeah um Rigs is made by Guerilla Cambridge so a St a first party Sony studio um which is it's like a three on three Arena combat game for Morpheus and I was surprised that it had like a very um uh noticeable and big placard on the show floor and it was upstairs you had like go upstairs and play it and stuff like that and it was I was surprised I didn't read more about that game uh I played Alienation House Mark's new game for PS4 behind closed doors and it's **** awesome so I can't wait to play that um but I didn't really see anyone talking about that I think mostly because it wasn't on the floor and it was in like",
      "start": 2485.6
    },
    {
      "text": "for PS4 behind closed doors and it's **** awesome so I can't wait to play that um but I didn't really see anyone talking about that I think mostly because it wasn't on the floor and it was in like pre-alpha and it was a little rough but Rocket League not getting the attention it deserves Rocket League see nearly enough Rocket League gave Rocket League one of my my placards for game of the show uh love that game can't wait to play it um yeah so I mean there was a few of those uh out there but actually the biggest Miss for me in terms of its appearance on the floor but not in playable form and nothing to see of it was Persona 5 which is why I think that it's not coming out this year I don't care what they say so and let's let's bring this nugget up too cuz this **** driving me crazy as well we had been saying for a while like don't expect it in  2015 don't expect it in  2015 in North America and so then some kid had tweeted me like hey what what do you think the chances are and I",
      "start": 2525.44
    },
    {
      "text": "as well we had been saying for a while like don't expect it in  2015 don't expect it in  2015 in North America and so then some kid had tweeted me like hey what what do you think the chances are and I responded and did like the quote tweet and I'm like not a chance not a chance this come North America in  2015 and then that day Atlas updates their website to say it is coming in  2015 and they put out a statement of it is coming in  2015 and everybody's tweeting at me saying I'm wrong January 1st  2016 everybody take a **** photo of how many hours you I want your on one of the the little wind up cameras I want a photo of your screen showing your game time in Persona 5 because it will be zero hours in zero minutes like I understand that it's there's a light for in the end of the tunnel here that all of a sudden the website says  2015 Atlas says  2015 I'm sure they're aiming for  2015 I'm telling you they won't hit  2015 in North America take it to the bank boom I won't I won't be quite that",
      "start": 2561.8
    },
    {
      "text": "that all of a sudden the website says  2015 Atlas says  2015 I'm sure they're aiming for  2015 I'm telling you they won't hit  2015 in North America take it to the bank boom I won't I won't be quite that confident anything fired up I I still I just was surprised I was surprised by the Bold assertion as well considering they've not shown anything yet they've showed like a trailer looks great but I mean they it's not g Hands-On or whatever and I still think their primary Market is not the West so they don't you know I think there's you know John Harden who's our friend over at Atlas who does all their PR did reiterate that they think it's going to come out in  2015 but I just I just don't see it happening but I hope it's true pgs they come out and they're like look at this huge thing release date worldwide and I'll be like oh man Humble Pie and I'll eat it up but I just know I'm being told I'm wrong when you don't have a confirmation the website saying  2015 is not being in your hands yeah",
      "start": 2605.12
    },
    {
      "text": "worldwide and I'll be like oh man Humble Pie and I'll eat it up but I just know I'm being told I'm wrong when you don't have a confirmation the website saying  2015 is not being in your hands yeah and remember that a lot of times you know for various reasons and I'm not saying Atlas would do this but you know for a lot of reasons Publishers say release dates and then have every intention of can't or delaying it so that which was exact what happened with Batman Y um which was obvious this the day as long where they were like Batman's coming what what was the original date like November November and they're like oh never mind we need eight more months it's like I'm pretty sure I'm pretty sure you knew you needed those eight months but all right I believe you um so yeah that was actually the biggest thing that was missing on the show for me because I expected it to be there first of all I expected it to be at Sony's conference and second of all I expected it to um have a more substantive",
      "start": 2647.6
    },
    {
      "text": "biggest thing that was missing on the show for me because I expected it to be there first of all I expected it to be at Sony's conference and second of all I expected it to um have a more substantive if it was coming out this year they would have had something on the show for but they're probably wary about first of all they it's probably not localized second of all uh they're probably wary of spoilers and all those kinds of things I still am confident that it comes out this year in Japan but I just don't you know same thing with Tails another another RPG series you identify and focus on your whole Market first and then you worry about localizing later the studio has enough to worry about they have been making this game for a very long time so you have to assume it's almost done yeah but maybe not I I I I don't know you know all I know is that Catherine came out in  2011 Never released anything since then and uh I'm excited to see more but yeah so that was the biggest thing that I was",
      "start": 2682.12
    },
    {
      "text": "maybe not I I I I don't know you know all I know is that Catherine came out in  2011 Never released anything since then and uh I'm excited to see more but yeah so that was the biggest thing that I was surprised about wasn't there cuz they had like a placard for it and you know nice signage and St like that yeah bags and and all that but nothing for the actual game and so that told me that it's it's still far off but maybe I'm wrong we'll see hashtag Colin is never wrong never ever um there's a ton of Tim games that obviously for probably the right reasons didn't get love but uh like Tony Hawk's Pro Skater 5 it was weird to me how little that game was talked about in the sense of like where was it again it was the Jeff Keeley thing the gameplay World premiere of it was on Jeff Keeley's show that no one saw BEC well not no one saw but everyone was busy watching all these other things cut to the tube filter article where they're like the YouTube stream did million views but the people that",
      "start": 2715.08
    },
    {
      "text": "no one saw BEC well not no one saw but everyone was busy watching all these other things cut to the tube filter article where they're like the YouTube stream did million views but the people that saw that didn't see whatever else was happening there's too much happening at once so that game just got drowned out completely having said that from the little I saw I am worried about that game but you're missed your Tony H I can't wait for it it's going to be I know it's going to be good enough yeah I know that good enough it is not going to be great okay but it will be good enough and that's exciting to me but man o it looks rough but it does look like Tony Hawk it just weird to me that they're like oh it's classic it's Tony Hawk's Pro Skater and I'm like then why does it have a bunch of this shitty features from Thug   yeah guys come on um then Yoshi's willly world it's almost unfair to bring up because that's that game's bened 3 it feels like forever and I've seen it so many damn times",
      "start": 2762.2
    },
    {
      "text": "shitty features from Thug   yeah guys come on um then Yoshi's willly world it's almost unfair to bring up because that's that game's bened 3 it feels like forever and I've seen it so many damn times but and it's also out like month yeah it's coming out in June and July in AU in UK and then October for the us because we speak such a different language yeah I mean Yoshi man he's a tough guy to really connect to you know uh but that game looks awesome and I've seen a couple of the reviews go up now and it's not looking too great no really I mean it's like sevens and that's my problem is Yoshi's Ro world could have been a nine you know it could have been like it looks cute but it's actually challenging it's actually really like good and it's not so it's Kirby epic it's another Yoshi game and it's like I love Yoshi so it's the year of the Yoshi it is the year of the it's always the year of the Yosh the Perpetual year of the Yosh in my life um but that game every time I play it I'm like man",
      "start": 2802.32
    },
    {
      "text": "like I love Yoshi so it's the year of the Yoshi it is the year of the it's always the year of the Yosh the Perpetual year of the Yosh in my life um but that game every time I play it I'm like man it's good it's solid um It's upsetting to know that it's not as great as I it would be but the last one would be Transformers Devastation right yeah oh my God Platinum Games probably biggest surprise for me of e3 besides Final Fantasy 7 HD um I it blew me away cuz my God seeing a screen screenshot of that game I'm like this is made up this looks like this is like a dream I had and then seeing the gameplay of it I'm like this is utterly ridiculous how much this is just an thing I saw in my imagination years ago and I'm now going to be able to play it that's awesome that's awesome like it's the Transformers games where you just get to play with your action figures and bang them together and make a lot of noises yes thank you Platinum Games making it will that game be a 10 out of 10 uhuh no",
      "start": 2848.88
    },
    {
      "text": "Transformers games where you just get to play with your action figures and bang them together and make a lot of noises yes thank you Platinum Games making it will that game be a 10 out of 10 uhuh no chance in hell am I going to **** love it oh yeah I thought it was weird uh this is talking about things that we thought were underappreciated or whatever I think E3 overall the booths were really oddly set up this year like did you get too much of a chance to walk around the show floor I walked around our show floor a fair bit West Hall South Hall I just ran to like my appointment there like I thought that Sony's Booth Sony Nintendo and Microsoft they always kind of have a similar like layout year to year overall and they're always good it's always like well conduced to seeing all their their offerings the smaller Indie titles and the like different demo kios Nintendo's very focused here was the five games you're going to play there's 10 million um stations for each one that's what",
      "start": 2893.08
    },
    {
      "text": "their offerings the smaller Indie titles and the like different demo kios Nintendo's very focused here was the five games you're going to play there's 10 million um stations for each one that's what you're doing Xbox is a little bit in between where it's like there's the Marquee titles but then there's also the the little ones but then when you went over to the other Hall and it's all the different like the third party things it was a **** **** show it usually is over there though but it was like more so than normal like Activision's Booth it was just the Destiny Booth like it was just Destiny everything else was behind closed doors and I was like what like cuz usually they have a whole like usually the third party boots are the cheating way to not have to wait in line to play the games you want to play at the first party boots you just go over there and just kind of like there's no line for him you know this year was just like oh they're just not here and of course EA has its",
      "start": 2938.16
    },
    {
      "text": "games you want to play at the first party boots you just go over there and just kind of like there's no line for him you know this year was just like oh they're just not here and of course EA has its crazy ass like they take up a giant giant thing with like freaking Rave going on half the time you don't know what's going on um so I thought all all that was pretty interesting but a big thing that I think it's being talked about enough granted not much to talk about Kingdom Hearts 3 like we got a Gameplay trailer that showed a fair amount of gameplay a lot of new stuff we got the new Tangled world we saw a new Hercules place and I'm just like this looks **** awesome I hate that that trailer ended and it said what do do you remember what it said it said like still in development or something I'm just like **** you guys like come on I mean that game is so far off man but it looks so good and I'm happy they showed that cuz they could have just shown another CG trailer or another you",
      "start": 2977.96
    },
    {
      "text": "I'm just like **** you guys like come on I mean that game is so far off man but it looks so good and I'm happy they showed that cuz they could have just shown another CG trailer or another you know just quick tease here's Kingdom Hearts 3 again it's happening Goofy does some **** but it's like they actually show got the date wrong but they showed gameplay that I was like oh this is why I'm so excited about this game and it's been interesting that people haven't been talking that much about it and I think it's because Square's conference happened at a weird time and it happened the day after they announced Final Fantasy 7 Square's conference was weird to me it was it was totally unnecessary actually I'm surprised that they actually let loose on the Final Fantasy 7 thing at Sony's but play I'm sure there a deal maybe a publishing deal or some some money being exchanged but yeah that was weird square square didn't need to have a conference I mean that was and that the way the reason",
      "start": 3017.8
    },
    {
      "text": "I'm sure there a deal maybe a publishing deal or some some money being exchanged but yeah that was weird square square didn't need to have a conference I mean that was and that the way the reason Square wants to be a legitimate Western publisher western style publisher right like we have we're publishing Tomb Raider you know like which all people we have Hitman and all and I'm like I respect that yeah but slow your rooll a little bit and finish some of the games that you have in the pipeline so I don't ever have to **** look at them in E3 again that would be like where I would start you know Final Fantasy 15 not convinced it'll be out by E3 next year Kingdom Hearts no chance in hell you know so get used to seeing Kingdom Hearts for the next two or three years at E3 and get used to seeing Final Fantasy 7 remake in perpetuity yeah I mean honestly I would be shocked if we saw that game again even at next E3 you know and they already said that they're they're showing they're more will",
      "start": 3057.44
    },
    {
      "text": "Final Fantasy 7 remake in perpetuity yeah I mean honestly I would be shocked if we saw that game again even at next E3 you know and they already said that they're they're showing they're more will be revealed in the winter or something it was super might something at TGs or something they made it sound like a TGs they're gonna show something that's not the winter but yeah but they said there was some really weird phrase they said what the **** yeah they they were G get get more info soon but I would not be surprised if we didn't even hear another update on that game for maybe even past next D3 yeah they need to go dark for a little while and that's that's the thing that's frustrating to me about so squares Japanese stuff is that you know when I saw that they were patching Final Fantasy 15's demo I'm like why are you patching it make the game that's where they make the they fix things there that they can apply to the game Colin so they can see show that they're listening to your",
      "start": 3093.64
    },
    {
      "text": "15's demo I'm like why are you patching it make the game that's where they make the they fix things there that they can apply to the game Colin so they can see show that they're listening to your feedback they well I loved that when they were like they remember we we did it on Colin and Greg I think where it was like here's all the feedback and one of them of course was the awful voice acting but the it's unbearable that voice the blonde guy's voice I'll never get over how bad that was if I never have to hear I I I I suspect he will not be in the final game um but I appreciate that they did that and they're like here's what you guys said and here the is here's the advice we're taking in as we continue to build the game that's great good team working on a very talented team working on this game as they have been for a very long time uh but I didn't expect them to update the demo take pretend the demo doesn't exist and just walk away from it and go back and work on the game using the",
      "start": 3137.48
    },
    {
      "text": "game as they have been for a very long time uh but I didn't expect them to update the demo take pretend the demo doesn't exist and just walk away from it and go back and work on the game using the advice you got from the demo you know and I'm sure they're doing that as well but to me it's just like Jesus God Almighty just stop already stop teasing it and I feel like they're updating the demo because they're like the game's still 18 months off or something like that you know I mean yeah yeah it's like I'm holiday I'm I'm shooting holiday  016 at this point is what they probably hope you know um so that it's just they're just Square's just weird they're just a weird company I don't I'm also shocked that they didn't release the Kingdom Hearts Collection on PS4 didn't they announce it on PS4 no they they never announced that not not the E3 I'm saying they announ they no Kingdom Hearts they did the 1.5 HD Remix and  .5 I know on PS on PS3 still nothing on PS4 and it just makes too much",
      "start": 3179.16
    },
    {
      "text": "no they they never announced that not not the E3 I'm saying they announ they no Kingdom Hearts they did the 1.5 HD Remix and  .5 I know on PS on PS3 still nothing on PS4 and it just makes too much sense to be like here's all of it in PS4 PlayStation now though PlayStation now though with the power of the cloud uh every game is available on Vita um if I hear that one more time I kill myself um yeah they're just a weird they just weird they have to go dark for a little while they have exciting games in the pipeline especially from their Japanese Studios and it's cool that they're like starting to work with other Studios too like cyberconnect I didn't even know Square had a relationship with them so um that's cool that their internal teams who probably have no interest in here's the thing about Final Fantasy 7 that I never really thought that I never really thought too deeply about is over the over time they certainly knew that everyone wanted a remake of this and my it reminded me of",
      "start": 3229.72
    },
    {
      "text": "Final Fantasy 7 that I never really thought that I never really thought too deeply about is over the over time they certainly knew that everyone wanted a remake of this and my it reminded me of when Romney or no when McCain ran for president and he ended up with Palin as the running mate and you know that he asked like 10 other people but they but they all said no and so you have to imagine I mean no disrespect to cyberconnect because they're totally a fine Studio but you have to assume that's not where they started yeah and everyone and everyone they went to was like you know it's probably a lot of money it's probably it's probably great work to have and you're going to have three or four year relationship with square and they're going to pay your bills and that's great but it's it the pressure to remake that game is probably absurd yeah it doesn't even make sense and so like cyberconnect getting it is fine but I'm like I don't know when I heard that that was the rumored Studio I'm",
      "start": 3274.6
    },
    {
      "text": "pressure to remake that game is probably absurd yeah it doesn't even make sense and so like cyberconnect getting it is fine but I'm like I don't know when I heard that that was the rumored Studio I'm not even sure if they've ever confirmed that or not um when I heard that they weren't doing internally I was like well that's trouble it's not necessarily trouble I was just hoping for like level five or something like that but if we're not going to go in that direction then best of luck to you because people are going to be scrutinizing the **** out of that game you know and that's why I think so so it reminded me of Palin where I'm like she was like the 10th Choice clearly and they didn't her and they got to that point they're like whatever we'll just take whatever we can get I just wish I was there for that year 18-month conversation with they like please make this game so we can just tell everyone to shut the **** up you know and and and uh they finally found their match but I",
      "start": 3309.92
    },
    {
      "text": "I was there for that year 18-month conversation with they like please make this game so we can just tell everyone to shut the **** up you know and and and uh they finally found their match but I don't think they started with cyberconnect you know I think they started higher on the food chain and and went from there but maybe not and I would have loved to see frankly I would have been excited to see a western Studio attached to that game I thought that would have been really bold but and and when they showed the trailer I'm like the the way the verbiage and stuff like that on the words was very Japanese scenario for instance which is a way to say you wrote the story um in Japanese gaming but I was hoping that it was going to be like a western Studio that did it just to just to do a little bit of a different spin but you can tell that that was a Japanese game Capcom Vancouver no hopefully they working on Mega Man that would be nice damn Tilla with the Scurry he's he got that run on",
      "start": 3345.04
    },
    {
      "text": "bit of a different spin but you can tell that that was a Japanese game Capcom Vancouver no hopefully they working on Mega Man that would be nice damn Tilla with the Scurry he's he got that run on he's doing something all right so Greg yeah you get to play a little game called No Man's Sky I did get to play No Man's Sky I got questions for you lay them on me what the hell is that game it's **** awesome we Lo weal if you remember the yeah it's funny well you said that CU you were you were a little disenchanted with it the the PlayStation post show after we came when we sat down and did the what do we call the games cast post show for Sony uh yeah I came out and we got to that point and I said I'm sick of seeing this demo what the **** is this game I'm sick of seeing we're going to climb into the spaceship we're flying around we went to this planet now we're down here now we're doing this all right demo over and you're like what the **** is happening what am I doing here what's the",
      "start": 3383.04
    },
    {
      "text": "into the spaceship we're flying around we went to this planet now we're down here now we're doing this all right demo over and you're like what the **** is happening what am I doing here what's the momentto moment gameplay and so yeah on Thursday after E3 I got to go there and that would have if we had seen that in the regular week that for sure would have gotten one of my faces and I would have made an argument for game yeah for sure damn that good dude I mean it's I mean if we want to start in a very try to get to a sense it's Minecraft in space which is you know awesome it's open World Minecraft in space you know what I mean the whole galaxy everything else this the point of the game is that you're trying the everyone's trying to get to the center of the universe there's something there we don't know what or whatever um and the way you're doing that is everybody starts with a small ship and then you go and you harvest resources to BU you make your ship better to make your suit",
      "start": 3424.8
    },
    {
      "text": "there we don't know what or whatever um and the way you're doing that is everybody starts with a small ship and then you go and you harvest resources to BU you make your ship better to make your suit better to make better guns and then you're you know using that hyperdrive let's get closer to the center you start jumping out you know cuz he did the thing right where you pull out and you see all he's like all these are Suns that have planets rotating da d d like you do all that and so it becomes this game of how do you want to play and what do you want to be in this world and you can be the Explorer you can you know be going trying constantly to get closer to that you can be the traiter you can be the fighter you can be the guy who's running Freight you can be the guys just gaming the system and going from going to part you Galaxy a yeah this is this cuz they were talking about they have testers who are playing right who aren't even landing on planets what they're doing is going to",
      "start": 3461.6
    },
    {
      "text": "and going from going to part you Galaxy a yeah this is this cuz they were talking about they have testers who are playing right who aren't even landing on planets what they're doing is going to different galaxies going to the trading shops that are like on the space stations right buying element a at a really cheap rate because this galaxy sells it cheap then going to another galaxy buying element B because it's super cheap there then going to galaxy C where they combine them and then sell this thing at an inflated rate making money hand over fist doing that and that's all they're doing and so that's the thing and like Colin said it when we were talking about and like what I got out of it right is that it feels a lot like online in a way right where there is an economy growing here and there's all these different people and you know they were talking about it like you know all right this is you know you can jump in there and you can get this resource and you can come out and this",
      "start": 3500.12
    },
    {
      "text": "there's all these different people and you know they were talking about it like you know all right this is you know you can jump in there and you can get this resource and you can come out and this planet's rich in this resource you can go down there you can spend all your time harvesting and getting what you want and then fly out but there could be a pirate just waiting out there who isn't ever in the mood to go Harvest and will shoot you down or try to shoot you take your stuff and get get it back and would the pirate be a person this is the question y y I don't understand how multiplayer Works in this game and it was one of those things I didn't ask in the demo just cuz I was caught up in everything else but talking about I'm like oh I'll look at previews after the fact and go look I Googled around before this Gamescast and there's not even a definitive answer and what they were saying in  014 is that there is traditional multiplayer in it but it might not it won't be ready for",
      "start": 3538.24
    },
    {
      "text": "Googled around before this Gamescast and there's not even a definitive answer and what they were saying in  014 is that there is traditional multiplayer in it but it might not it won't be ready for launch but that was in  014  015 Kevin correct me if I'm wrong the way they were talking in this demo made it sound like it's going to be a real thing you have somebody there playing he's shaking his head yeah and so that's what I'm unsure about cuz like it's it there's definitely multiplayer in the sense of that asynchronous thing of I get to a planet I'm the first person there and I scan it and I because this is the Explorer track right where maybe I don't want to even give a **** about the center of the Galaxy I just want to explore planets and have a good time get resources build a better craft build a better suit build a better gun and then I'm just exploring different planets I land there if from the first person there I scan it it'll say you found this animal on top of the you",
      "start": 3574.6
    },
    {
      "text": "craft build a better suit build a better gun and then I'm just exploring different planets I land there if from the first person there I scan it it'll say you found this animal on top of the you know whatever creature you found this planet go to one of the upload link posts go there upload that to the world then I get to name the planet I get to name the animal I get to do all these different things you know what I mean so then filter into your world so if you ever get to that planet it's there but they talked like he it said something along to the effect of like you could have not a gang but you could have like a roving band of guys which makes it sound like okay so there is realtime multiplayer right there but unclear and I haven't been able to figure something out online that's a failure on my I did a brief like scanning of a couple articles and I saw people make reference to that this is not an MMO even though people think that it is it's more of a single player game with",
      "start": 3610.24
    },
    {
      "text": "a failure on my I did a brief like scanning of a couple articles and I saw people make reference to that this is not an MMO even though people think that it is it's more of a single player game with asynchronous options yeah it's this weird thing and that's the and it it's you know like I said I was down on down on it just cuz I was sick of seeing the same demo I get the game's beautiful I get there's a lot to do what does that mean you know what I mean and it wasn't until we were on the planet shooting things collecting them going in and seeing like the the their periodic table filled out of what they've discovered and what they have and how this works into that I was like oh okay you know what I mean like that and I assume that's how this multiplayer is going to be too how it's got to click where I have to see what's happening to figure out what's going on so was there combat yeah combat you're fighting other people well in the demo yes I'm fighting at AI yeah what it was is",
      "start": 3645.72
    },
    {
      "text": "to click where I have to see what's happening to figure out what's going on so was there combat yeah combat you're fighting other people well in the demo yes I'm fighting at AI yeah what it was is you know you land on the planet there's going to be peaceful animals and sometimes there's going to be hostile animals and you shoot them and whatever even if it's peaceful you can shoot a whole bunch of stuff but every planet has like space cops on it like there space cop Outpost that are like robot probes or whatever right so they they you have like a GTA wanted level right where it starts ticking up of like hey you're really **** up this planet why are you killing all and they'll come out you kill them and then it goes up more and then you try to get out but in that Galaxy now you have a wanted level and so there's space stations out there with these orbs that are coming out or not orbs you know uh in that system you mean right what did I say in the Galaxy because there's only one",
      "start": 3684.32
    },
    {
      "text": "a wanted level and so there's space stations out there with these orbs that are coming out or not orbs you know uh in that system you mean right what did I say in the Galaxy because there's only one galaxy in the game right no it's well I mean how do you no no I guess yeah I guess the system is what you're saying right but I what Kevin they didn't I just want to make sure I'm understanding the terminology well I mean you know I'm not Mr space so well you're trying to get to the center of the Galaxy that's the part of the game yeah yeah so then the systems all the different planet system clusters around the Suns cuz I was wondering if they were multiple galaxies and I was like the game is unfathomably big but it's still Suns or whatever so yeah it still is unfathomable that's the whole problem but yeah if you jump to another system around another star then yeah you're fine and that you that you drop you new wanted level there or whatever but there yeah there's other there's dog",
      "start": 3719.84
    },
    {
      "text": "problem but yeah if you jump to another system around another star then yeah you're fine and that you that you drop you new wanted level there or whatever but there yeah there's other there's dog fighting there's other ships to shoot down there's people to run from there's all this stuff so do you have a health bar yes what happens if you die you if you you go back to the last time you save SL uploaded your stuff so like if I landed on a plan Planet I discover a creature but I kill a whole bunch of stuff and get shot to death and I'm going to respawn at the space station out there having not discovered that stuff cuz I didn't uploaded before I die and I'd lose all the resources from last upload sync point or whatever you want to call it you go ahead I does it seem like there is an actual game campaign is there a campaign mode he's nodding his head yes I think there's a campaign as much Minecraft as a campaign I mean there's more drawn out goal of something's in the center of the",
      "start": 3756.2
    },
    {
      "text": "game campaign is there a campaign mode he's nodding his head yes I think there's a campaign as much Minecraft as a campaign I mean there's more drawn out goal of something's in the center of the Galaxy everybody's being drawn towards the center the Galaxy but they were saying like when they launch it they're going to go very minecrafty in we like on version one like when Minecraft originally came out you remember there were were no wiks there were no ingame guides to how what do these two things do they want they want this to be a game for explorers they want you to get out there get into this world and you and I have a real conversation whether it be through the internet or in person of I element whatever and element whatever and I put them together and made element to ever you know what I mean like they wanted to be like there's this movement behind it that you're finding stuff and then later on they want to start rolling out updates like that and make it a bit more clear but they",
      "start": 3794.28
    },
    {
      "text": "I mean like they wanted to be like there's this movement behind it that you're finding stuff and then later on they want to start rolling out updates like that and make it a bit more clear but they want it to be the wild west when the game first comes out which is cool and that's the whole thing too you know they're asking about people ask them all the time about this or that and like you know they talking about like a uh vehicles for on you know like there's no like moon rover or whatever and he's like yeah there is no Rover right now but that's something you know we'd love to add later on down the line like they see this evolving like Minecraft when they talk about it now I'm throwing Minecraft around a lot in the demo they did not throw Minecraft on around a lot for the record let me ask you this let's play detective a little bit because we're trying to figure out like the Readiness of this game yeah this game is it's impossible to make a vertical slice for this game so that's",
      "start": 3832.28
    },
    {
      "text": "me ask you this, let's play detective a little bit because we're trying to figure out like the readiness of this game. Yeah, this game is it's impossible to make a vertical slice for this game. So that's that's one that's one clue that they kind of glossed over at the conference but didn't really like he was like we're playing the game organically. We're going to find like hey, I'm going to jump to here. I don't know what I'm going to find. So you've played a lot of games, you and I have done a lot of demos and know a lot about the games industry. How what is the level of polished on the game right now? What in other words what are the load times telling you? What is the interface telling you? What's the polish telling you? Sure, sure, sure all about about the game what what was locked off of anything these should indicate when this game is going to come out. Yes, all the things you just listed were giving me a thumbs up. Low times weren't atrocious there. I mean there there was one where he's like what did he",
      "start": 3865.88
    },
    {
      "text": "indicate when this game is going to come out. Yes, all the things you just listed were giving me a thumbs up. Low times weren't atrocious there. I mean there there was one where he's like what did he say this is we were loading and he's like this is taking 5 seconds right now when it ships it's going to take seven like that's how it's going to be. I think it was the hyper drive jump or whatever. Um that looked great. I didn't jump I didn't have like we were there passing the controller around so there wasn't a lot of menu stuff. Interface wise though it looks locked like it's one of those things like it felt like this what I was playing could be released and I would pay money for it and be happy with it. You know what I mean to run around like CU like the thing we were doing right and we've talked about in the other show I know is like there's real it's like Red Faction. There's real you know you're damaging the terrain you're shaping the planet so like I jumped into a basically a giant",
      "start": 3898.88
    },
    {
      "text": "about in the other show I know is like there's real it's like Red Faction. There's real you know you're damaging the terrain you're shaping the planet so like I jumped into a basically a giant crater hole right and it's like well how do I get out of here and Grant that I had a jetpack so I could just go up and fly out but I also then just took my G gun secondary function which he had upgraded obviously do a crazy thing where I'm just shooting out bombs and they're just taking out huge chunks of ground so I just made you know a tunnel up by aiming a little bit not tunnel up you know what I mean like a slope up or whatever and like all that was running great no falling through the world you know what I mean like textures are there it looks great like I think at the very least I feel like we're getting really close to a giant beta like hey everybody let's try this game out you know what I mean I wonder if that's the announcement I wouldn't be surprised if that was their thing where",
      "start": 3935.24
    },
    {
      "text": "we're getting really close to a giant beta like hey everybody let's try this game out you know what I mean I wonder if that's the announcement I wouldn't be surprised if that was their thing where they're like hey everybody November, October, November No Man's Sky open Beta or PlayStation Plus beta or whatever leading up to our 2016 release and they run with that for a while. Yeah, I wonder if that's that's that's an interesting point. I wonder if that's I never thought of that. Yeah, you yeah you're right yeah you're right that game demands a beta doesn't it? Yeah, I want so any word on because this is still a confusing thing to me and I'll look at it again actually can you go on on go to No Man's Sky Wiki like just it's Wikipedia page sure because one of the questions I have for you about this as well is to clear up some confusion that I have personally about the way the game's talked about is this game coming to other consoles do we know anything about that Sony's treating it like it's a first",
      "start": 3971.72
    },
    {
      "text": "is to clear up some confusion that I have personally about the way the game's talked about is this game coming to other consoles do we know anything about that Sony's treating it like it's a first party game right and they've said that in the past as well that they're they're treating it as if it's their own game are they publishing it like who's paying for this **** game and is and is hell I'm asking you I'm like interrogating you but you you had time with the game yeah is Hello Games still a very small studio because they were they were like no more than 1 15 people I think at the most when they were making Joe Danger so they're still small so like how are they making a game like that like there there's so many qu I don't understand how they're making this game so wait hold on it says it says the game will be released simultaneously for PlayStation 4 and Windows yeah so platforms is is only marked as Microsoft and Playstation 4 on the Wikipedia page um I just still feel and I I",
      "start": 4013.28
    },
    {
      "text": "it says the game will be released simultaneously for PlayStation 4 and Windows yeah so platforms is is only marked as Microsoft and Playstation 4 on the Wikipedia page um I just still feel and I I know like I don't want to treat it like it's real exclusive it's on PC it's not really but unless you play you know a lot of Xbox games are on PC I think that's a reasonable way to treat exclusive there something tells me Sony's like all in on this game and they just haven't said anything yet mhm you know but I don't they've just spent so much time on it you know yeah um but I'm wondering if the beta is sooner I wonder if the beta's like in August and I wonder if the game comes out this fall you know that would be crazy that would be super nuts and its state of readiness that you were talking about I mean it just seems to be optimized for a controlled thing yeah I mean of jumping around you know I mean it's still presal generated right and he was talking about like you know you're we asking",
      "start": 4052.4
    },
    {
      "text": "about I mean it just seems to be optimized for a controlled thing yeah I mean of jumping around you know I mean it's still presal generated right and he was talking about like you know you're we asking what if you warp into a system and warp into a like Destroyer or whatever and he's like that shouldn't happen but it did just happen during one of our other demos where a star destroyer came in and crushed me and it's like that's not how it's supposed to happen but it can happen that way so all right two more other questions for you sure I'm I'm on the Verge article who it's funny because they I came to you guys and I tweeted actually as soon as we finished like I finally played it and I'm I'm now a Believer and they had that was a headline of the story which always made me laugh um what is the cost and is it a retail game ooh good question I don't think it's a I don't think it's a retail game I think it's $40 $40 really I do yeah yeah they don't have any see can you can you go",
      "start": 4095.08
    },
    {
      "text": "cost and is it a retail game ooh good question I don't think it's a I don't think it's a retail game I think it's $40 $40 really I do yeah yeah they don't have any see can you can you go **** up at once and didn't ask about multiplayer can you go back to Hello Games or can you go back to the Wikipedia page and look at Hello Games' staff size sure none of this makes any sense you know like from like like that's what I'm so confused about like it sounds like a game you can put on a disc and get 60 bucks for I don't think it's got the cache to it is the problem I I think Sony and Hello Games has to look at it and be like it's it we're trying to do Minecraft again and again I'm the only one throwing around Minecraft like that they didn't yeah they have 10 employ I don't understand how they must have a million contractors of this game I can't imagine I have so many questions about this game that's why I'm so impressed about it at one point I'm like I don't really care about it",
      "start": 4126.0
    },
    {
      "text": "how they must have a million contractors of this game I can't imagine I have so many questions about this game that's why I'm so impressed about it at one point I'm like I don't really care about it or I didn't a lot of people are crazy about we were still gen everyone's like oh No Man's Sky mik I don't really know what it is now that I have an idea of what it is and and how it plays and and the way it sound sounds like right up my alley so I hope no I mean like it's totally I mean for it's Space the game you know what I mean like let's go explore space let's just hang out and that's what I I was saying to you guys I pointed Kevin and the Hello Games guys have like it totally seems like the perfect game to wind down with every night sit down and maybe only play for an hour maybe only play for 30 minutes and you're just going to go chill and find a new planet and harvest whatever resource you know is in this galaxy that you or whatever this uh system that you need it sounds interesting",
      "start": 4174.64
    },
    {
      "text": "for 30 minutes and you're just going to go chill and find a new planet and harvest whatever resource you know is in this galaxy that you or whatever this uh system that you need it sounds interesting it's definitely such a unique game to the point where where I'm like what the hell is this and then once now I think we're finally past that point of not knowing like it's no longer just the demo now that you've seen this and now that we know that there what the game is I think people need to stop asking what is it and you know what I mean getting so hung up understand that frustration I know me too and that's the whole thing is like I it definitely strikes me as a game that you need to play cuz once I sat down and played like the best part two we we with our friend Shawn and Sean Norton and we were running around playing in this world or whatever right and he was like coming up on an like and he shot at it and we're like what are you doing he's like I just it's I was trying to see if I",
      "start": 4211.12
    },
    {
      "text": "we were running around playing in this world or whatever right and he was like coming up on an like and he shot at it and we're like what are you doing he's like I just it's I was trying to see if I could get my gun up and it's cuz your gun doesn't default to being up your gun defaults to being down you are there to explore research catalog this planet right cuz you're building out your little Encyclopedia of everything you've come into contact so good exactly and it's like it's the the journey here isn't to shoot and blow the **** out of everything right it's to **** hang out run around fly around dinosaurs yeah find some cool ass space find Space dinosaurs no well I didn't not like dinosaurs I found I found a giant creature that looked like an armadillo like he was coill killed a whole bunch of them got chased off by the space cops see I like this I killed arillo got chased by the space cops got my little ship took off you know what I mean like flew off into space cool yeah",
      "start": 4250.12
    },
    {
      "text": "a whole bunch of them got chased off by the space cops see I like this I killed arillo got chased by the space cops got my little ship took off you know what I mean like flew off into space cool yeah it's cool it's really really really cool and you said that your ship is dynamic right so you can make you can technically make a death star that's the well they didn't they they were dancing around how big cuz we were of course we you know they're nice British chaps and we were a whole bunch of American Americans and we're like he's like yeah you know you can blow chunks out of the planet and stuff like can we build a nuke and he was like what like we escalated like how big we can like how big can we do this can we nuke the planet like and then Sean's like what about a death star and he's like all right guys slow down a second you know what I mean like I'm not sure what the limits are going to be and how far you imagine that guy that just makes the **** Death Star just **** coming",
      "start": 4288.76
    },
    {
      "text": "like all right guys slow down a second you know what I mean like I'm not sure what the limits are going to be and how far you imagine that guy that just makes the **** Death Star just **** coming through syst a system just blowing up everyone's flash like renaming everything oh my God I love that all right guys final topic of the day again sponsored by Topps the trading cards yes trading cards interesting Topps Star Wars card Trader is the official Star Wars digital trading card app available now exclusively on the App Store and Google Play open trade and collect cards entirely online no cardboard foil or gum in sight collect from 30 years of officially licensed Star Wars trading cards from the Vintage era through to today with new cards being released every day get the first cards from Star Wars the Force Awakens the recently announced new characters are available in the vintage vintage inspired Star Wars 77 designs Star Wars card Trad is currently the only place to get Star Wars",
      "start": 4326.2
    },
    {
      "text": "Star Wars the Force Awakens the recently announced new characters are available in the vintage vintage inspired Star Wars 77 designs Star Wars card Trad is currently the only place to get Star Wars the Force Awakens merchandise that's interesting I'm really excited that like leaked images of merch are starting to come out online yeah it's cool it's exciting we're getting close yeah we're getting real close what is it like six months out five months out almost five yeah W that's crazy yeah it's happening guys um they have fan favorites like Darth Maul Yoda Chewbacca Grandma talking Taren and deep Cuts Like the rancor keeper Squid head AA Sakura do you know who that is no Squid head is re right I don't know just say squid head and josta new and Max REO and Max Rebo nice that's my dude's W it doesn't say I don't know if W's there we can't confirm nor deny but I'm gonna I'm going to hope they don't even give me a trading card now so head on over to topps.com Kinda Funny Topps has two PS so to",
      "start": 4368.8
    },
    {
      "text": "doesn't say I don't know if W's there we can't confirm nor deny but I'm gonna I'm going to hope they don't even give me a trading card now so head on over to topps.com Kinda Funny Topps has two PS so to pps.com ofun cards and start collecting today tos.com yeah you guys are cool I want to check those out I want to see if there was a w on the someone tweeted me let me know if there's a w so do you want him like in his original form or now that he's a horse I don't know if that's Canon Greg all right so we're gonna lead off with a question from Jack Lundquist kadal 3 on Twitter now as always if you have questions for us to answer go to the forums kindafunny.com forums there's a Gamescast topic you can leave your things or tweet at me and we'll do some stuff leave your things leave all of your things uh okay he want he says talk about why Fallout 4 didn't get mentioned at all for game of the show now a lot of people were tweeting me about this CU I left it a little nebulous at the end",
      "start": 4414.12
    },
    {
      "text": "your things uh okay he want he says talk about why Fallout 4 didn't get mentioned at all for game of the show now a lot of people were tweeting me about this CU I left it a little nebulous at the end we'll discuss this next time we'll discuss this next time gentlemen go we don't like Fallout 4 we don't like Bethesda we hate Todd no we love we love Fallout we love but the the thing about it and I I hinted at this with my Metal Gear thing is that E3 is about surprise es and what happened at the show and Fallout Force trailer came out a week before E3 we knew it was coming it was telegraphed we were told it was going to happen and so then when we got there and we watched the trailer it was more Fallout which is all we wanted right like it was a better looking Fallout with new mechanics of Fallout and it was Fallout and so like when we get to and like it's hypocritical I guess like even a word Uncharted and I was like Uncharted demo blew me away fallout's demo blew me away I guess that's",
      "start": 4468.68
    },
    {
      "text": "and it was Fallout and so like when we get to and like it's hypocritical I guess like even a word Uncharted and I was like Uncharted demo blew me away fallout's demo blew me away I guess that's the thing we're talking about being blown away in two different contexts Fallout blew me away in the fact of oh they added the system oh my God I'm going to do this oh my God so many hours oh we get to talk the voices that's red that's red that's rad Uncharted blew me away in the fact of like look at the graphics look at the my heart's racing watching like it was like it was a fullon here's 20 minutes 30 minutes of the game this is straight gameplay this is what it looks like whereas Fallout jumped all around and showed us different slices of it which is great and awesome but Uncharted showed me something that was this Horizon you know killz on killz on Horizon kill Horizon gorilla's Horizon you know showed us a giant chunk of the game and this is how it's going to play and this is it moment to",
      "start": 4512.92
    },
    {
      "text": "that was this Horizon you know killz on killz on Horizon kill Horizon gorilla's Horizon you know showed us a giant chunk of the game and this is how it's going to play and this is it moment to moment I guess it's a shitty answer but I mean we're not journalists or whatever were critics we critics I guess but you know it was excitement I was excited about these games Fallout like I went and got my pit boy Edition as soon as I could you know what I mean like I'm excited for Fallout but I feel like I know what I'm getting with Fallout it's like Batman I was excited for Batman I was ready for Batman but I know what I'm getting with Batman you know what I mean does that make sense am I put way that's the way I feel to feel about it too I mean I'm I'm **** jazzed about Fallout 4 but we had known you know it first of all was obvious it was going to be shown we've been talking about it since January I know we've been talking about it for a very long time and it's exciting I'm very excited",
      "start": 4549.24
    },
    {
      "text": "you know it first of all was obvious it was going to be shown we've been talking about it since January I know we've been talking about it for a very long time and it's exciting I'm very excited about it I was just I mean honestly I'm way more excited about Horizon honestly than I Fallout because I just feel like it's something new and different and exciting from this studio um so that's why I chose it um yeah I understand why that's confusing doesn't mean I'm I'm I'm **** super Jazz about Fallout 4 you know I'm going to play the **** out of that game we all are so um yeah that explains it I'm more excited about Horizon I think it looks new and it's different it's a new idea no offense to Bethesda it's Fallout 4 is certainly not a new idea um it's more of an idea we love and I think that uh Horizon is a new idea from a studio that we didn't think was going to do something like this even though it was long rumored um and here it is yeah you know and I'm super excited Horizon looks",
      "start": 4588.92
    },
    {
      "text": "uh Horizon is a new idea from a studio that we didn't think was going to do something like this even though it was long rumored um and here it is yeah you know and I'm super excited Horizon looks **** rad you know yeah I mean E3 definitely is about the surprises and those moments where you're like oh crap or like you are proven wrong or like all these different things I think for me I I gave it to Mario Maker Horizon and uh Cuphead Cuphead I knew nothing about that game I saw this I'm like fell in love with it I can't I've watched that trailer maybe 10 times since E3 just cuz I'm like whoa this looks amazing Mario Maker we've known about it for years at this point and I've always been like it's going to be cool it's going to be fine but then seeing what they did at the Nintendo World Championships I'm like man this game is going to be awesome and they turned something that was like oh yeah it'll be fine too I need this game now yeah you know so that's why I got that for me and then",
      "start": 4620.6
    },
    {
      "text": "I'm like man this game is going to be awesome and they turned something that was like oh yeah it'll be fine too I need this game now yeah you know so that's why I got that for me and then Horizon was the game that came out that was like this looks great and we didn't even know know about it yeah Fallout it's like again I'm not a Fallout guy so I wouldn't have personally given it but at the same time it's like yeah their presence at the Bethesda conference and you know the Microsoft conference too it's like everyone in the room shut the **** up for that that was what they were there for but it wasn't a surprise and it wasn't there was nothing about it that people were like I can't believe they did that it was all this is exactly what I want follow four is similar to me is in the similar boat with me as middle Gear Solid where middle Gear Solid I already know how short list for Game of the Year and I imagine Fallout 4 will be as well and I imagine Fallout 4 is going to win so it's",
      "start": 4660.32
    },
    {
      "text": "boat with me as middle Gear Solid where middle Gear Solid I already know how short list for Game of the Year and I imagine Fallout 4 will be as well and I imagine Fallout 4 is going to win so it's like they're not the underdog you know what I mean Uncharted I I was like okay more Uncharted I like more Uncharted I left that demo being like that was awesome that was unexpected you know what I mean that's the Mario Maker thing was like you went into it knowing it's going to be good but came out of it like **** that was great it's that it's a shitty thing I guess but once you know once you're on top you have to figure out how to keep outdoing yourself and fall it's outdoing itself but not in the way of like that's totally not what I I was like that's what I expected look like and I can't **** wait to spend 100 hours with it mhm make bad decisions fight ghouls my favorite decisions we my pit boy every time I stream it oh Lord all right Luke Williams at Leroy 3707 it wants to know",
      "start": 4700.8
    },
    {
      "text": "**** wait to spend 100 hours with it mhm make bad decisions fight ghouls my favorite decisions we my pit boy every time I stream it oh Lord all right Luke Williams at Leroy 3707 it wants to know what you guys think about Batman oh I have no opinion on it right now I haven't played it yet I've been playing I'm four and a half hours into Batman Arkham Knight right now and this will be spoiler-free um I streamed the first four hours last night and when I shut it off and was closing down the things that stood out for me were beautiful I'm playing on PlayStation 4 so I don't have any these PC problems sorry I'm in the PlayStation 4 Master race you might have heard of it beautiful beautiful beautiful beautiful R CL uh his grandfather actually uh beautiful game uh stories what did I could say today that you oh it's awesome it's a great story but I said something today that you fasinating fascinating it's a fascinating story like wait till you play it cuz like it's this is what I'm talking",
      "start": 4735.56
    },
    {
      "text": "today that you oh it's awesome it's a great story but I said something today that you fasinating fascinating it's a fascinating story like wait till you play it cuz like it's this is what I'm talking about too it's like what I think Arkham Origins did so well I'm just like here's the real story you're like oh **** and like that was the thing of like I got to play this I got to know everything that's happening and I was doing the stream and it was like I wanted to know more so here's where we get into a negative where I just played the story and I'm just going through the story running through the story I'm not doing the side missions that are popping up because I'm like number one I'll get to them later when I feel like it and number two I'm going to do new game plus with it and I'll Max them all out there because of the cover you know they they're saying I think it carries over and even if it doesn't let's do it then but I'm running through the story and I know when we read the",
      "start": 4777.08
    },
    {
      "text": "Max them all out there because of the cover you know they they're saying I think it carries over and even if it doesn't let's do it then but I'm running through the story and I know when we read the Gamespot review that was the seven compared all the nines and tens it was getting right one of the negatives they put were the four Batmobile segments I was like what a weird thing to do and then last night running through the story ignoring everything else I was like yeah I don't I don't want to do these Force Batmobile segments you know what I mean cuz like last night I'm playing and I'm doing the story and you're in the Batmobile and you have to engage all these different tank vehicles that keep coming up to you and you have to do it at a number of different points as you're running and it it felt like it was just like okay okay I'm getting into being back oh am I in the car again and I'm not only am I in the car I'm playing World of Tanks and I like I don't want to do this like this",
      "start": 4809.0
    },
    {
      "text": "it felt like it was just like okay okay I'm getting into being back oh am I in the car again and I'm not only am I in the car I'm playing World of Tanks and I like I don't want to do this like this isn't Batman sliding cuz you're sliding and strafing and blowing up these things and they're trying to shoot you but it's like there's it's not even that fast of a it's not fast-paced action it's not from the fast-paced action genre so you're skating around blowing them all up and it's like all right whatever but it's like I just want to be Batman it's about being Batman and putting in the car being the Batman doesn't work for me and I was like I'll have to figure out if that balances out later on today when I woke up and played for like another 45 minutes or whatever I just did side quests and those were the missions that number one made me feel like Batman I'm I'm doing the combat we all know and love I'm sneaking up on guys I'm like oh great number two it was let's use the Batmobile to",
      "start": 4846.24
    },
    {
      "text": "those were the missions that number one made me feel like Batman I'm I'm doing the combat we all know and love I'm sneaking up on guys I'm like oh great number two it was let's use the Batmobile to get around the city let's to from point A to point B that feels awesome driving the Batmobile just as a Batmobile feels great and then there's these missions where you have to take out like armored cars in the city and those kind of were springing up today as I went so I'm like going to somewhere else and it's like oh no it's Batman I'm like oh **** you I'm like driving these guys off the road I'm slamming them that Batmobile combat was real fun and then when I went and did some of the side missions that had me do the tank thing I wasn't as like this **** again cuz it's like I knew what I was getting into the pacing felt better it's you know it's a sandwich there and not just a piece of meat if that makes sense like you know what I mean like there's more adding to it it was it",
      "start": 4881.76
    },
    {
      "text": "what I was getting into the pacing felt better it's you know it's a sandwich there and not just a piece of meat if that makes sense like you know what I mean like there's more adding to it it was it was takeaway so I have to go through tonight I'm going to do more story obviously hopefully if I start burning out then I'll start going to side missions and doing that stuff at thinka surus thinky saurus thinka surus Daniel Thompson he wants to know what your thoughts are on the new South Park which I think is one of the biggest surprises huge surprise yeah another game that gets or another announcement that's getting overlooked because there so much other stuff but yeah you want to talk about a game I never thought we'd get you know Matt and Trey were so down in that game when I interviewed them at Comic-Con to host that panel with them that I was like probably never going to see this again and then for them to come out and like we're doing it again it's superhero themed I was like oh my",
      "start": 4916.52
    },
    {
      "text": "at Comic-Con to host that panel with them that I was like probably never going to see this again and then for them to come out and like we're doing it again it's superhero themed I was like oh my God I cannot wait for this game however it's then weird that it's not with Obsidian it's with Ubisoft San Francisco it's like okay like these how far out is this game going to be what's happening with any of this yeah it's got to be a ways out I I think the infrastructure is there the engine's there it'll run better on PS4 and Xbox One which is certainly where this game's going to live and I think with all of that done since the that's what we were saying is like the South Park's not going to be about visual Fidelity they achieve the visual Fidelity of the cartoon that's as good as it's going to get so they don't have to worry about that anymore now they can just make the story and the new assets that they need to make I'm **** jazzed man like I I thought Stick of Truth was first of all one",
      "start": 4953.4
    },
    {
      "text": "so they don't have to worry about that anymore now they can just make the story and the new assets that they need to make I'm **** jazzed man like I I thought Stick of Truth was first of all one of the most surprising games I'd played in years and um that game was in development hell forever it's Publishers as everyone remembers it was in trouble that game was in a lot of trouble and they got it out and it was **** awesome and if it wasn't for a couple other games like Child of Light in a couple that was like the best game that year Shovel Knight that would C probably my third faor probably my third favorite game of the year and I'm not even a South Park Fan I haven't watched South Park regularly since 2000 or 2001 yeah I hadn't laughed that hard at a game ever I was like hysterical the entire time I was I was like this is brilliant this is brilliant I forgot that I love these characters South Park has not run its course um I was wrong about that I I didn't think it did even when",
      "start": 4987.88
    },
    {
      "text": "entire time I was I was like this is brilliant this is brilliant I forgot that I love these characters South Park has not run its course um I was wrong about that I I didn't think it did even when I was a kid I was just like I don't really want to watch this anymore um I don't know I I was I was hugely surprised by it too Money Talks I'm sure and yeah um once Ubisoft saw the figures they were doing and you have to still imagine they're trying to put the original out on yeah makes sense make it run better and stuff like that but man what yeah I would I would venture to say I have I platin up the Stick of Truth and um I would venture to say I would do it again if it was on PS4 wow U cuz it's not a hard PLA and the game's like 10 hours long and it's like super **** fun so if they do another game like that a weekend game basically yeah I'm in I'm totally in that was a that was that was a genuine I would have never a million years's guess surprise based on the way they talked",
      "start": 5028.0
    },
    {
      "text": "do another game like that a weekend game basically yeah I'm in I'm totally in that was a that was that was a genuine I would have never a million years's guess surprise based on the way they talked about the original and not that they thought the original was bad they just didn't have fun making want to do it yeah the ghost six wants to know do you think Sony will hurt due to the lack of exclusives in 2015 or the marketing for Battlefront and or do you think the M marketing for Battlefront and Call of Duty will make up for it so we talked about it yeah we talked about this earlier I don't I don't know how Greg feels about it but I I I think this the the deal with Call of Duty for instance like the Activision deals are too little too late I don't think it matters I think that's actually a waste of Sony's money um mostly because I think that Xbox has already engendered that community and that Community exists and if anything that Community is plateauing and is going to start truncating",
      "start": 5064.72
    },
    {
      "text": "waste of Sony's money um mostly because I think that Xbox has already engendered that community and that Community exists and if anything that Community is plateauing and is going to start truncating soon so um and I'm interested to see how that all shakes out again as a as a pundit of the industry as a as a studious person of the industry I want to see how it plays out and I hope that they have no exclusives because I just want to see how it plays out the Destiny d did not work out like as well as people thought it it did for them but it did do that thing where it I think a lot of people associate it with them you know what I mean I think I do think they have mind share on that game that that's a PlayStation thing because the exclusives they have well I mean it's it's crazy to look at someone like Alfredo who is an Xbox guy he's an Xbox and he still is when it comes to Destiny like he plays his Xbox version is his main one but he has a PS4 character that he cares about and like",
      "start": 5098.2
    },
    {
      "text": "at someone like Alfredo who is an Xbox guy he's an Xbox and he still is when it comes to Destiny like he plays his Xbox version is his main one but he has a PS4 character that he cares about and like that's crazy to me is that like that game did do something to hardcore Xbox people I think Xbox is going to close the gap I think I'm not in a I don't think it's going to be they're going to pull ahead I don't think they're going to match Sony's numbers but I think they are going make a dent this fall winter Nema mortson asks what's the difference between being a D3 with kinda funny in IGN was a lot more tiring and kinda funny yeah you know what I mean like you know we finished day one and I said it's like we just finished day three that's how tired I was just because you know we I kep saying to people we are trying to put on the same show here we put on there for all intents and purposes right like we're still bringing same caliber of guests same workload except that we're also",
      "start": 5131.48
    },
    {
      "text": "saying to people we are trying to put on the same show here we put on there for all intents and purposes right like we're still bringing same caliber of guests same workload except that we're also there's no support team you know what I mean like it was like you know booking everybody's running around calling their own their contacts Kevin's screaming in the other room and trying to get us we're all talking to each other on ifbs and it's like there's no one to throw to that isn't one of us and so you are we're all trying to manage where everybody is and stuff yeah it's you know I've said this a million times now to you guys but it was just more to me it was more everything it was more hard it was more fun it was more uh rewarding it was more challenging it was all of these things at once but it it was just interesting it's interesting being able to not have to I mean you still have to think about what you're saying but you can just be a little bit more open and honest and definitely",
      "start": 5171.4
    },
    {
      "text": "but it it was just interesting it's interesting being able to not have to I mean you still have to think about what you're saying but you can just be a little bit more open and honest and definitely casual you know being able to like have fun and just be us I think that's the coolest part of it is that this E3 was it might have been the first time ever that people were allowed to on that level thanks to Gamespot giving us that stage on a huge stage on the show floor E3 be able to just be dudes yeah you know what I mean just hanging out and like just letting people know our opinions on Stu out yeah and it's like and that was really cool and being able to have Chloe and Alfredo there too like it was it was fun you know it was fun that at any moment all of us were doing something to create this show and to create this thing and um that we didn't really need to worry too much about all the the hierarchy of stuff because we are the hierarchy um that's not to take away from IGN at all it's",
      "start": 5208.04
    },
    {
      "text": "show and to create this thing and um that we didn't really need to worry too much about all the the hierarchy of stuff because we are the hierarchy um that's not to take away from IGN at all it's very different like I wouldn't even be able to compare this year to our previous years our previous years each one of us had a very stratified role we had one thing we had to do do it hard you know do it hard here it's like we have 10 million things to do do them all hard at once with each other staring to each other's eyes yeah do hard as many times as you could each day yeah yeah and so I overall I mean it's I can't wait for next year I think next year's going to be totally different than this year yeah that's exciting you know like we keep saying with everything that we do is kinda funny it's like it's never going to be like this again and it's like it's never going to be like that again this was a unque experience I like that yeah I like that a lot um last question final question",
      "start": 5253.0
    },
    {
      "text": "it's like it's never going to be like this again and it's like it's never going to be like that again this was a unque experience I like that yeah I like that a lot um last question final question everybody Pell 14 okay is that is that it I don't I get I need a reading from you Kevin pello pepo maybe Pella Pella sounds good anyways uh do we need the EA Ubisoft Bethesda Square type companies conferences annualized or just for great events like Fallout 4 now we talked about this a bit let's take Bethesda out of it because Bethesda is going to do just presumably we don't know that for sure but I can't yeah Square EA Ubisoft now Square hasn't always had one sometimes it does sometimes it doesn't EA Ubisoft essentially always have right I don't think yeah at least in recent memory do you see a world where One of Them Bows out one of those two no yeah they have so many games going they always have that you know Gatling gun of announcements and things to talk about like it is you know like",
      "start": 5298.48
    },
    {
      "text": "a world where One of Them Bows out one of those two no yeah they have so many games going they always have that you know Gatling gun of announcements and things to talk about like it is you know like we're saying maybe it isn't for us maybe is it is for Wall Street Journal maybe it's for their investors like they have things they need to talk about to people but see the thing there is like you look at uh Activision right and I mean they they haven't had a press conference for did they ever I don't even remember I feel time yeah but like I don't think they ever did a a press conference that I can remember they don't need to but it's like why do they not need to but EA or Ubisoft does you I feel like a big part of Activision's business model is the license games and that's gone that's dried up in a lot of way and there's still I'm not saying there's none but I'm saying it's not like it was before where there was like a Spider-Man game every year and there's this that and the other thing",
      "start": 5350.8
    },
    {
      "text": "up in a lot of way and there's still I'm not saying there's none but I'm saying it's not like it was before where there was like a Spider-Man game every year and there's this that and the other thing right like it's Skylanders it's the Blizzard stuff I don't know if you want to include that in there it's Call of Duty right and like Call of Duty can get feature somewhere else Skylanders will pop up somewhere else Skylanders is one of those games that doesn't speak to the E3 audience necessarily you know what I mean like in the same way Disney Infinity doesn't need its own conference right like when there's a cool Star Wars time you bring it in there and you try to make a big deal about it but in general Skylanders doesn't need to come out and be like hey no it's triple swap where you take the base in the mid section in the head of a guy and you make shark Tater man no you don't need you know what shark Tater man yeah that shark head Tater midsection M legs got it cuz you're aware this",
      "start": 5390.56
    },
    {
      "text": "the base in the mid section in the head of a guy and you make shark Tater man no you don't need you know what shark Tater man yeah that shark head Tater midsection M legs got it cuz you're aware this was the big upgrade to Skylanders a while back yeah you're not are you I know yeah Steve buts loved it yeah yeah um my my assumption is that Activision I mean all the Publishers get in the bed with the first parties but I feel like Activision does it strategically in a way where they actually make money on E3 and I think that that's that's a a thing where you know that's just a Bobby codic bit their business you know yeah so I think when they appear at Sony's confererence Sony's probably paying them you know and so they don't have to worry about anything else I think that to them they're like well we'll show our games um where it makes sense and we don't need to show everything and then you don't have redundancies like Ubisoft and EA does and I think a lot of it has to do with the fact",
      "start": 5421.52
    },
    {
      "text": "well we'll show our games um where it makes sense and we don't need to show everything and then you don't have redundancies like Ubisoft and EA does and I think a lot of it has to do with the fact that Activision is just really way bigger so um it's weird though it's like Activision doesn't want to make money you know yeah that's pretty much Activision I mean just I mean if they wanted to make money there's a simple way to to do it his name is Crash Bandicoot ladies and gentlemen thank you so much for joining us for the kinda funny games cast last ever episode 25 yeah don't give me **** for that or don't do give me **** for that you know what you live your life you you do you I'll do me and we'll just appreciate each other as Mutual frienders doers sure whether we're friends whether we're enemies whatever it is let's just do it it'll be fun thank you I love you",
      "start": 5463.24
    }
  ]
}
