{
  "id": 1012,
  "video_id": "Q9LgusIRpsI",
  "show_name": "Community",
  "hosts": ["Greg Miller", "Tim Gettys", "Nick Scarpino", "Colin Moriarty"],
  "title": "Thank You, Howard Clarke!",
  "description": "Thanks for your three months of support on http://www.patreon.com/kindafunnygames!",
  "published_at": 1436845979,
  "duration": 340,
  "transcript_chunks": [
    {
      "text": "Thank you, Howard Clark, for all of your support on patreon.com, Kinda Funny. Howard Howard Clark sounds like Howard Stark, which is Tony Stark's father from Game of Thrones. Let's read about him. We're opening up your Twitter to find out more about you, Howard Clark. Goddamn it, Howard 1 and likes Last of Us in Naughty Dog and Uncharted 4, but there's no information. There's nothing for me to weave and now I have to make things up. Pictures, let's look at his pictures. What the **** is that? Holy, it's a prostate exam video game. It would look like it's probably teaching people how to examine prostates. ****, do you think that anyone ever when there's no one left in the building just like does the has a quick bang job on it? Real quick bang job. You want to do a little bang job on the prostate? The prostate, like if you caught someone doing that to the prostate, doline, I like it. SE bladder, the 015 soccer joke. Yeah, we don't get it. Soccer joke, I guess whatever he just resigned anyway, that's probably the joke.",
      "start": 0.16
    },
    {
      "text": "Like if you caught someone doing that to the prostate, doline, I like it. SE bladder, the 015 soccer joke. Yeah, we don't get it. Soccer joke, I guess whatever he just resigned anyway, that's probably the joke. Hey, he retweeted Nick. Everybody planning Kinda Funny live nearly drove me crazy. The show itself, it was awesome. I wrote that tweet. It's a good tweet. Sounds like me though. I write good tweets except for when I don't. That's what happens. Um, let's see what else is there to talk about, Greg, because you see Howard Clark, there's a fundamental blunder that he made, which is that you have to have details in your Twitter account. I need to know more. I can't piece to together. I'm no **** gumo over here. You understand what I'm saying? I got time for that. I don't got the patience for it. You don't. Yeah, I think it's kind of weird that Howard Clark thought you were a gum shoe. Well, my assumption is that that's what his assumption was. That was always the best part of Where in the World is Carmen San Diego?",
      "start": 45.32
    },
    {
      "text": "Think it's kind of weird that Howard Clark thought you were a gum shoe. Well, my assumption is that that's what his assumption was. That was always the best part of Where in the World is Carmen San Diego? The game show is one when Chief would come on. What up, Gum Chief was the best. She didn't say what up, but Double Trouble was my favorite enemy. Who was your favorite bad guy? I don't think I remember him honestly. Oh my God, I used to get so excited when they reveal who the bad guy was and the like Carmen San Diego had like a bunch of like minions or like henchman and they would always who it was in the beginning. It was it was fun. Did they ever catch her? Yeah, sometimes. Yeah, you'd win an awesome computer if you if you caught her. If you caught Carmen San Diego, where the is San Diego? Nashville to Norway, RKO. Do you think that was real? No, there you go. Oh, there you go. He's retweeting all sorts of nice things about us. I appreciate Anderson has a Twitter. Click on that. Hold on, we're looking at the things.",
      "start": 94.72
    },
    {
      "text": "RKO, do you think that was real? No, there you go. Oh, there you go. He's retweeting all sorts of nice things about us. I appreciate Anderson has a Twitter. Click on that. Hold on, we're looking at the things you retweeted from us. We don't no, no, it doesn't have to be can care about us. So what's up with Julian Anderson? Hold on, how did how did this tweet perform for me? Not as well as Colin's. I know they can't hear me. Kevin, my tweets are through the roof, through the roof. I'm glad you see good. You see you see Julian Anderson. We're looking there you're there you're there Julian Anderson. She's a mum actress. What if we did this and she was following she looks fantastic. What if we had come through and she was following Tim? I call her her with Mads Killian in that picture. Who's that guy? That's the guy he was L Shifra from uh James Bond. Yeah, okay, he's a badass. He's a really cool. Yeah, he looks like a great like character actor. He's a yeah, he definitely is. He's aiing Nordic of some sort. I can't remember.",
      "start": 135.0
    },
    {
      "text": "Was L Shifra from uh James Bond. Yeah, okay, he's a badass. He's a really cool. Yeah, he looks like a great like character actor. He's a yeah, he definitely is. He's aiing Nordic of some sort. I can't remember. Maybe he's even oh, she was on Hannibal. He's from Hannibal. He's from Hannibal. Okay, she's so cute still. MH man, like she got better looking somehow. I think yeah, don't **** shake your head at me, Kevin. Okay, Kevin, why you shaking your head at her? Okay, Google talking to my Google watch. It's me, Kevin. You want Google check. Do I have any friends yet? No, find Google. Greg, does it make you feel okay that you are close in Twitter followers to the Jillian Anderson? Yeah, I should be cring her though. That's really what's upset. She was on the **** Xbox, but that's the whole problem is like my audience is all on the internet. Swallow this apple core and choke yourself out, my friend cuz we will never do anything cooler than the Xbox. I'm aware we won't ever do anything cool in the swallow this apple core and",
      "start": 175.84
    },
    {
      "text": "On the internet, swallow this apple core and choke yourself out, my friend cuz we will never do anything cooler than the Xbox. I'm aware we won't ever do anything cool in the swallow this apple core and choke yourself out, my friend. Oh good lord, burrito tonight. Okay, I'll allow it. Thank you, Howard Clark, for this window into our own Insanity. Thank you for your support over on Patreon. Uh, it's our pleasure. I know we were we were slower to get these videos out then we wanted to be. Thanks for hanging in there with us, but update your goddamn Twitter. We need to have give me some substantive facts and or opinions that I can riff off of. We don't even we don't even know if Howard Clark's real name. I know who could ever sounds like a fake name. How C30? No, nope. Portillo, he loves you. Oh, he loves us. Oh, I hate you so much. I know you're **** with me and I hate you so much. It's getting faster. I'd give him some water, but you let Nick take it all from me. I didn't let anything happen. You almost knocked",
      "start": 223.8
    },
    {
      "text": "I hate you so much. I know you're **** with me and I hate you so much. It's getting faster. I'd give him some water, but you let Nick take it all from me. I didn't let anything happen. You almost knocked it into Tim's laptop. I only have this much left. I'm sorry guys. Why you drink so much water? We need we need Tove. **** you drink so much water. You both so much. That's going to be hard for him to get to really here. Get you got to understand he's like this thing is out now. He's down. He's sleeping. He's asleep. Get in there. Get in there, buddy. Tip it him. I'm tipping this thing could become a **** death mask of water at any point with him. You going to say shove it his his his snout in it and we'll see what happens. We'll see. Thank you, Howard. Thanks, Howard.",
      "start": 284.4
    }
  ]
}
