{
  "id": 1029,
  "video_id": "TanzjsdoEzY",
  "show_name": "The GameOverGreggy Show",
  "hosts": [],
  "title": "Netflix - The GameOverGreggy Show Ep. 84 (Pt. 3)",
  "description": "Nick Scarpino brings up his Netflix habits.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1436943601,
  "duration": 1863,
  "transcript_chunks": [
    {
      "text": "Nick, yes, what's your topic? Uh, my topic today is Netflix. Hey, and so recently, here's what's been happening. I go home, the old habits die hard, right? Um, I go home and I immediately turn the TV on. Yeah. Um, and there's nothing on. Sure. Never, there's never anything on. Uh, my wife leaves it on MSNBC, so more often than not when I'm eating dinner, I just end up watching news, which is good. It's, I mean, I'm a little more informed than I was even a month ago, but now I sort of gravitate toward just immediately turning my PS4 on and going over to the Netflix app and just keeping that on and just kind of blading through and seeing what else is there. So I'm wondering what your guys's habits are in regards to Netflix. Has it become a staple in your life? Is it because Hulu is nipping at its toes? Like Hulu is trying to get as much content as humanly possible, uh, but Netflix really is that to me, is this, is this synonymous? It's synonymous with cable, it's synonymous with the HBO. It is sort of the thing one",
      "start": 2.85
    },
    {
      "text": "is trying to get as much content as humanly possible, uh, but Netflix really is that to me, is this, is this synonymous? It's synonymous with cable, it's synonymous with the HBO. It is sort of the thing one of my go-to systems. Yeah, I mean, for, I mean, like for me, what you, where I am with Netflix right is constant disappointment. I feel like, yeah, is that I turn it on, I have built out my list and I only watch TV or I only watch anything that speaks at me when I'm extremely tired, I can't, don't want to play a game or when I'm going to eat something, you just want to have something on while you eat, right? And so right, right now we're in a great time for video games, so when Christine and I sit down to eat, we're looking for something 30 minutes or less, want to be committed to a movie here, everything else. So then it's mainly what do you want to watch? I don't want to, you go back around, you like I want to watch It Follows. It Follows isn't on there. I thought it was, some kid tweets me about The Bridge, that",
      "start": 53.76
    },
    {
      "text": "then it's mainly what do you want to watch? I don't want to, you go back around, you like I want to watch It Follows. It Follows isn't on there. I thought it was, some kid tweets me about The Bridge, that documentary about the Golden Gate Bridge and I was like, I've been waiting for that and he said he watched it on Netflix. I was like, yeah, can't find it. Of course he's in Canada or whatever. I'm like, goddamn. And so it's just like I have all these things on there I never really want to watch. I settle a lot on things to watch. Once in a while there will be like that the morning the other day where I was like, all right, let's watch the Chic, watch the Chic document, like that was great, that's awesome. But Christine's not a big documentary person, so I don't watch a lot of, I have to try to figure out when I'm watch these documentaries by myself. This, I watch this shit, by the way, it's good, it's depressing, yeah, but good, yeah. Um, I feel like that's, that's kind of where I'm at too is that every day I go home and",
      "start": 91.48
    },
    {
      "text": "watch these documentaries by myself. This, I watch this shit, by the way, it's good, it's depressing, yeah, but good, yeah. Um, I feel like that's, that's kind of where I'm at too is that every day I go home and we go and I, and I, I, I kind of log on to Netflix and I blade through all the options and inevitably I spend more time adding things to my queue that I never intend to watch than I do actually watching anything with the exception of I was, we were in Santa Cruz last weekend for the 4th of July and I walked onto the boardwalk and I was like, oh right, this is where they show Lost Boys. I wonder and I, I looked at it, it was very fascinating to me to, to see the the boardwalk and then immediately jump on Netflix where Lost Boys was. I remember cuz I put on my queue. I was like, oh, it's on my queue, watched it two days later and was like, this is really cool to see how they photographed the boardwalk and how they made it bigger and how they made it a little bit more like they made it feel that have that",
      "start": 123.68
    },
    {
      "text": "it two days later and was like, this is really cool to see how they photographed the boardwalk and how they made it bigger and how they made it a little bit more like they made it feel that have that sense of mystery at night and like there was all these things happening in reality. The boardwalk's just kind of, it's not that big, it's a disaster. It's a disaster and it's mostly just, um, things that shouldn't be frozen and refried. God, why is it a disaster, dude? It was like, so this, not to go too much on a tangent, but this weekend in Santa Cruz was just, so we didn't go with Nick, me and my friends went separate of him and I'm surprised we didn't cross paths at some point, but it, so many people down there, seen each, so many fucking people go on this damn beach. It was like shoulder-to-shoulder just people, but what I didn't understand is every single group had a tent. Yeah, that was weird and I remember when I was a kid having a tent meant that you were a quitter when you went to the beach in",
      "start": 159.0
    },
    {
      "text": "just people, but what I didn't understand is every single group had a tent. Yeah, that was weird and I remember when I was a kid having a tent meant that you were a quitter when you went to the beach in Southern California. If you had a tent it meant that like what are you doing on the beach? Get off the beach. No one had tents. All you did was you brought a blanket. If you were a family, you brought a big blanket that inevitably that inevitably got way too much sand in it and became the bane of your existence from that point on until the next time you went to the beach where you're like just you're constantly shaking this damn blanket out. Yeah, had that, a cooler and like your parents would have the chairs because for some stupid reason your parents never bought four chairs, they just bought two for themselves, the selfish bastards and so you'd always be like, well, I guess I'll just sit in the fucking sand and you would just sit down, right? Or they' be like, go play in the ocean. You go play in the",
      "start": 199.28
    },
    {
      "text": "themselves, the selfish bastards and so you'd always be like, well, I guess I'll just sit in the fucking sand and you would just sit down, right? Or they' be like, go play in the ocean. You go play in the ocean, come back and you sit in the mud because at that point you would sit in the sand, it become, it become kind of wet dirty sand. Um, but we go to Santa Cruz and I'm like literally in shock. It is wall to wall, well there's no walls, but like every square foot foot of the beach was covered in a gigantic tent and so people got there early in the morning and put a fucking huge tent up and never saw the sun. So for someone who doesn't go to the beaches and wasn't raised at the beaches, you're saying tent, do you mean like a camping tent? Do you mean like a raised top tent? There was camping tent, there was just giant umbrellas that were like unnecessary. There was these weird like greenhouse looking things that were just like, like everything was translucent. I'm like, why, like what's the point of this",
      "start": 234.36
    },
    {
      "text": "was just giant umbrellas that were like unnecessary. There was these weird like greenhouse looking things that were just like, like everything was translucent. I'm like, why, like what's the point of this thing? Like what are you shielding yourself from? Do you know when you go to a street fair, yes, and there they put the big canopies up that are like, you know, like, like I do for tailgating. Yeah, yeah, exactly. So there was, it was just all that. Okay, maybe like one dude had an umbrella and he was like the, he was the outcast. Everyone's like, get out of here, po. But it was crazy cuz I'm like, it's, it's not that sunny. It was, but it wasn't like, it wasn't strikingly hot, so you didn't need to escape from the heat. It was a really weird weekend. It was very like San Francisco in weather where it was like very foggy looking, but it was hot, but then all of a sudden it start raining a little bit, but it's like what I don't understand how to comprehend what's I'm feeling right now, but it was like it was warm enough",
      "start": 269.24
    },
    {
      "text": "looking, but it was hot, but then all of a sudden it start raining a little bit, but it's like what I don't understand how to comprehend what's I'm feeling right now, but it was like it was warm enough to go into the ocean. Mind you, my entire group did not go into the ocean. It was just me and Kevin, we had a great time. Glad you, but it was really cold and then sharks came and we're like, well, fuck. And they made everyone fucking leave the ocean. I'm like, was there a panic? Thanks. I mean it was less of a panic and more of a, oh, is that boat telling everyone to get out cuz there's sharks? I think there's sharks. Is there sharks? I think there's sharks. Oh, cool. And everyone starts saying, I think they're sharks. That was it. No, that's, yeah, it was like it was not not like the movies and we had just watched Jaws 3, which is a classic. Why watch Jaws? It was on TV and we were just watching it, but like have you seen Jaws 3 long, Jaws 3D which ends with the shark, it's a jpeg of a shark coming towards them and they",
      "start": 310.04
    },
    {
      "text": "3, which is a classic. Why watch Jaws? It was on TV and we were just watching it, but like have you seen Jaws 3 long, Jaws 3D which ends with the shark, it's a jpeg of a shark coming towards them and they stretch the jpeg's mouth so it kind of like it warps, it doesn't even like it's not even a separate image and it just comes, it hits the glass, the glass explodes and it's the cheapest looking like everything flying in the screen and all of a sudden this shark teeth just kind of like come like God damn it, I hate this and I didn't even get to see that in real life. It was just people like little tugboat thing going by like with a megaphone, they didn't even say anything, it just kind of held it up and everyone just knew we should exit the water. All four people that were in the all of were wearing rash cards and Kevin, yeah, it was kind of weird. I me honestly, we went to, we went to the most touristy part of the beach apparently there like the sebrite which is a nicer beach that I walked by and I was",
      "start": 345.16
    },
    {
      "text": "cards and Kevin, yeah, it was kind of weird. I me honestly, we went to, we went to the most touristy part of the beach apparently there like the sebrite which is a nicer beach that I walked by and I was like, okay, this looks a little bit more like what I'm used to where it's people are grilling, they're barbecuing, they're hanging out, there's not a lot of umbrellas and they're waiting for the sun to go down to watch the fireworks which beach snob, I'm not a beach snob, it's just to me the the experience of growing up around the beach and going to the beach holds a special place in my heart and that's you're supposed to be really uncomfortable. You just when I was a kid that's just what that meant to me was, hey, we're going to the beach and I'm like great, this is combining three of the things that I like least in the world. One, taking my shirt off, yeah, two, being baked by the sun which inevitably is going to lead to a wicked, wicked sunburn and in the weirdest places by in the weirdest places and",
      "start": 390.16
    },
    {
      "text": "I like least in the world. One, taking my shirt off, yeah, two, being baked by the sun which inevitably is going to lead to a wicked, wicked sunburn and in the weirdest places by in the weirdest places and then three, being covered in sand while I'm shirtless eating cuz I would just eat constantly. You're at the beach like, well, I went in the water, that's the one thing I can do. The other thing I can do is go get 15 chip witches and just smother them, smother my face in them. Are you familiar with the chip witch? It's the, it, it, the its it bar ice cream sandwich. It's like an ice cream sandwich with the with the little chocolate chips around the side. I used to get those all the time or the frozen banana which my wife and I got this last night. I was like, I, for let's get a frozen banana. But yeah, when I was a kid I had such a, I had such a, uh, I was so hung up on my body image that I was like, I don't want to take my shirt off, but I do want to eat and so I would be just like I would be contributing to the",
      "start": 426.64
    },
    {
      "text": "a kid I had such a, I had such a, uh, I was so hung up on my body image that I was like, I don't want to take my shirt off, but I do want to eat and so I would be just like I would be contributing to the problem cuz I would just eat constantly and be like I especially don't want to take my shirt off now and then the back of my ears, my neck would just be char broiled and the rest of my body would be like paper white, paper white. Yeah, man, Santa Cruz was weird because like I've grown up going there so I went there a bazillion times. I haven't been there in like probably 10 years at this point and it was the same place I remember but with a lot of just different things, main thing being I'm now an adult so all things I wanted to do when I was younger it was just like, oh, I can do those things. So all those deep fried Twinkies that I always just looked at was like, man, one day I by today was that day and we got to walk and me and Kevin, oh man, it was just like I want Dipping Dots. I'm going to get the",
      "start": 466.0
    },
    {
      "text": "deep fried Twinkies that I always just looked at was like, man, one day I by today was that day and we got to walk and me and Kevin, oh man, it was just like I want Dipping Dots. I'm going to get the extra large Dipping Dots. I think I want to buy one of those, but I'm not going to get it yet cuz I want to keep walking cuz maybe they're deep frying something else I want to get. I'll tell you this and you were smart, did you see at that same Twinkie sand they had the deep fried Twinkie and the deep fried Oreo and the deep fried peanut butter and jelly sandwich? Yeah, we saw that that was ridiculous. God bless you like that it was just amazing. Now what upset me about Santa Cruz is they have a haunted house, MH, and it's a classic. I remember this ride from from my younger days and it it meant something very special to me. They remodeled so they completely changed the ride. I had to wait in line. We waited in like like 45 minutes. There was way too many people at this goddamn place. It was upsetting get on",
      "start": 501.44
    },
    {
      "text": "special to me. They remodeled so they completely changed the ride. I had to wait in line. We waited in like like 45 minutes. There was way too many people at this goddamn place. It was upsetting get on the ride. First couple rooms you go through I'm like, oh, it's a haunted house. Like I'm an adult so this isn't as cool as it used to be, but you know it is what it is. Then all of a sudden they get to another room I'm like, oh, it's the Santa Cruz haunted house. They remodeled it. They obviously were on a budget. They obviously just went to the like the place the the warehouse, yeah, and they're just like I'm just going to what can we get on sale because all of a sudden a velociraptor pops out and I'm like what the fuck and then there's just an alligator kind of chilling and he's just doing shit. I'm like what the fuck animated is just sitting in the corner. We get into another room and there's just this like devil looking thing and I'm like that's not even a haunted house thing like that's just a",
      "start": 537.44
    },
    {
      "text": "what the fuck animated is just sitting in the corner. We get into another room and there's just this like devil looking thing and I'm like that's not even a haunted house thing like that's just a fucking devil and then it's The Walking Dead all of a sudden I'm like, all right, you guys, you're not even trying. You're not committing to this is not a haunted house, this is just a fucking disaster. It was it was very upsetting. Yeah, it was an interesting weekend for me too, but um it was cool to see and again it was cool to then go back and and see how they like why they chose that specific area and how they were able to make that whole thing look a lot better and a lot bigger because you watch you go back and watch a movie that like Lost Boys and that the boardwalk looks huge and like all these stores are supposed to be in and all that stuff in reality all it is is shop after shop after shop of things that shouldn't be fried are that are fried which is pretty amazing. Colin, how do you use Netflix say",
      "start": 576.92
    },
    {
      "text": "supposed to be in and all that stuff in reality all it is is shop after shop after shop of things that shouldn't be fried are that are fried which is pretty amazing. Colin, how do you use Netflix say what the hell was the topic? Uh, also did ptil drink any of this water? No, he didn't, he didn't. So, uh, Netflix is is like I don't know, it's one of those things that is a great idea. They persevered. I gave them a lot of credit. I was just talking to about them with the other day with someone is that all signs should have pointed to them being extinct by now yet they figured out a way to revolutionize, uh, the way we watch films again and and they're much in a way they're kind I don't want to compare them to Apple necessarily because they're definitely not nearly Apple but they're Apple like in the sense that they revolutionized a way to watch movies 15 years ago and then did it again, um, and stayed relevant because I was talking to someone like remember when Blockbuster was like kind of beating",
      "start": 617.36
    },
    {
      "text": "sense that they revolutionized a way to watch movies 15 years ago and then did it again, um, and stayed relevant because I was talking to someone like remember when Blockbuster was like kind of beating Netflix for a while and they were doing their mailing thing you could just go into any store and like just trade out movies. I was like I was very loyal to Netflix at that time, you know, you know dance with the one that brought you and all that. Uh, you were loyal to Netflix or Blockbuster to Netflix, okay. Um, but uh they figured out a way to to persevere and and I can't believe that they only charge $8 a month. I have no idea like how they make money. Well, they I think I guess they tried I think they raised it. It used to be $7.99 now it's $8.99 right or something like that. I still pay $7.99 for you. Yeah, grandfather. Um, but uh I'm not a grandfather. I I don't I don't have any kids. You're ruining cev we want us to make him think the video froze we like doing pregnant pauses. Um, so I I like using",
      "start": 661.08
    },
    {
      "text": "you. Yeah, grandfather. Um, but uh I'm not a grandfather. I I don't I don't have any kids. You're ruining cev we want us to make him think the video froze we like doing pregnant pauses. Um, so I I like using Netflix but I agree in the sense that it's it's a lot of volume and not a lot of things that I actually want to watch and the biggest problem with Netflix is that it's just unsearchable. So like it's just re there's a a great website that it's called it's like streaming catalog.com or something I don't know what the fuck it is but it's like a place where you can go and it's just like it it's somehow gotten into Netflix's API or whatever where it's like here's everything on Netflix, MH, you know and I'm like why doesn't Netflix do this is really weird with a lot of their stuff. I mean I have a lot of issues and I just personally don't like streaming programs like that but Netflix is interesting in that they don't release any stats they don't leas what their catalog is they won't let you know",
      "start": 694.76
    },
    {
      "text": "of issues and I just personally don't like streaming programs like that but Netflix is interesting in that they don't release any stats they don't leas what their catalog is they won't let you know what the most popular things are you can't search by popularity search by like all these things that are kind of we are so used to because we've used things like Amazon for so long where it's like that's how you filter things you use iTunes that's how you filter things and then you get to or even YouTube all this stuff Netflix is just kind of like it really is tailored to getting people to just constantly put things in their queue to feel like they're getting more value than they actually are. Yeah, I mean there's certainly a you know they are masters of UI in a sense cuz Netflix especially on PS4 I think is like really really well done so they know what they're doing they Rel these things out because probably they're looking at statistics saying like this is just the way we can maximize the",
      "start": 741.0
    },
    {
      "text": "I think is like really really well done so they know what they're doing they Rel these things out because probably they're looking at statistics saying like this is just the way we can maximize the amount of money we make but it's annoying that I have to use like a third party site that's like basically hacking into their API to figure out like what the fuck is on the goddamn service like I like it's annoying when it's like here's the documentaries and here's 10 documentaries and I'm like you don't have just 10 documentaries so why can't I see all of them I don't understand and here's where and here's where Netflix is kind of getting nipped in the butt a little bit is that Amazon, Amazon Prime to me is a superior service and they have fewer things available for free but what they do have is kind of a more searchable and organic way to look at things where I can just pay for anything that that they you know like so it's like yeah we're not streaming this but you can pay us for it and",
      "start": 778.32
    },
    {
      "text": "is kind of a more searchable and organic way to look at things where I can just pay for anything that that they you know like so it's like yeah we're not streaming this but you can pay us for it and at least I I like that kind of thing where it's like Amazon just has everything and then you look through it and you're like okay I'm looking at the Batman movies it's $3 to rent the Batman movie or $4 all right whatever I've spent a lot of money on Amazon just for that reason too where you go through Netflix like no this looks good you jump over to Amazon new releases okay I've bought movies there right cuz it's I use rationalizing your head of like well it's 10 bucks but if I would have seen in theaters it would have been 13 plus this that you know what I mean so whatever fuck it. Yeah, I mean that's I'm I'm kind of I'm on the fence on that too because more often than not I'm like oh you know what I really want to watch and I go first search Netflix to make sure I can get it for free",
      "start": 815.24
    },
    {
      "text": "mean that's I'm I'm kind of I'm on the fence on that too because more often than not I'm like oh you know what I really want to watch and I go first search Netflix to make sure I can get it for free. It's not there immediately go to Amazon it's there it's $3. Yeah, now you know you can't buy it in app you have to go which is so weird that they do this yeah on on the PlayStation and I'm I think I'm getting this WR on the PlayStation Amazon Instant you can buy things right there your credit card on your Xbox you can't on your I phone I iPad app you can't and then if you go through the Amazon app on iPad like the Amazon storefront you can't buy it there either it's super weird you have to go in through the Brows Amon weird that's I think a big problem I have with Amazon is the whole needing to get like their player sucks and you have to use all that like third party shit and like that's the same issue I have with their music service where you need Amazon downloader to download they just",
      "start": 848.24
    },
    {
      "text": "get like their player sucks and you have to use all that like third party shit and like that's the same issue I have with their music service where you need Amazon downloader to download they just complicate things whereas Netflix is just this one place like get it so all the places have their pros and cons and overall I'm not a big fan of the streaming stuff if I want to watch a movie like that bad I'll go to Amazon and try to get the Blu-ray of it. You're crazy but that's nuts you're old. Yeah, I am but it's just just too long to wait by that time I'm like by time it comes I'm not going to want to watch Prime now they're essentially like time warping they like they're sending me things before I order you see like this I think I'll get um the movie Win starring Matthew oh it's right here. Yeah, that exactly. Yeah, I mean but that's the beauty of like that's the beauty of Amazon Instant like instant video is that it's first of all you're not paying for it like you pay for Prime which is a",
      "start": 889.32
    },
    {
      "text": "yeah, that exactly. Yeah, I mean but that's the beauty of like that's the beauty of Amazon Instant like instant video is that it's first of all you're not paying for it like you pay for Prime which is a totally different product and you're just getting the shit for free which is something like I really respect out of them. I respect the shit out of Amazon for that. It's like Prime is a brilliant way to be like it's basically just free shipping for your products but we're going to give you all these acut there's all these cool things so if you have Prime you get free streaming of movies. Yeah, they have a whole library of stuff they have a t I watch watch very vared like so here's the thing so at IGN I had a show called What To Watch where I would tell people like what where to find that's streaming and it was such a complicated show to figure out because the way that licensing works with all this stuff it's like things will be on Netflix for uh a month and then take it off but they don't",
      "start": 924.48
    },
    {
      "text": "and it was such a complicated show to figure out because the way that licensing works with all this stuff it's like things will be on Netflix for uh a month and then take it off but they don't make that clear anywhere so like it's it was always super hard to figure out where things are but Amazon always had it like no matter what that was my go-to of like all right I can reliably know that it'll be there and there's a 50% chance it's free yeah what's what's cool about it too is that what I really like about it and what and this is what I like about Amazon I kind of wish Netflix would do this too is just Netflix would just ingest everything and be like we have Netflix we have like a Netflix streaming thing where you pay a subscription and we give you you know a bunch of **** for free but we also have everything that's not free and you can just pay us for it like if Netflix did something like that and I think that they will eventually do something like that that would be way smarter",
      "start": 958.52
    },
    {
      "text": "we also have everything that's not free and you can just pay us for it like if Netflix did something like that and I think that they will eventually do something like that that would be way smarter because and then maybe you get a discount depending on the rate of your you know of your plan and stuff like that because what's cool about Amazon Prime like I said is that I watched like I I'm in season six of The Good Wife now I've watched that whole series for free you know and that's it's $40 a season to buy it you know so it's cool and like I like that they have like a bunch of PBS **** so like I'm really into Nova and Frontline I think those shows are **** phenomenal and they'll have they have seasons of Frontline and Nova going like way back and you can buy all the episodes and then they'll have just like sporadic ones for free to kind of like give you a little bit of you know Taste of the drug before you buy it but I like that but I like that you know you know we're you know as a",
      "start": 994.04
    },
    {
      "text": "have just like sporadic ones for free to kind of like give you a little bit of you know Taste of the drug before you buy it but I like that but I like that you know you know we're you know as a kid maybe or as a college student I wouldn't have been able to do this but as someone who has like a salary and like you know a little bit of disposable income in his life it's cool that like if I want to go on there and be like you know what I want to just see this 30 for 30 here's $3 whatever you know and Netflix doesn't give me that option Netflix is like these are the 10 30 for 30s that we have they're from the **** first season you saw them four years ago so you're probably not interested in them right Netflix to me I like it's one of those things the same reason why I like having cable it's like I like it that it's just there like the fact that I have cable and like 0 channels it's just I just like that it's there I don't use it do God forbid I would never use cable but I'm okay but but like",
      "start": 1028.64
    },
    {
      "text": "like it that it's just there like the fact that I have cable and like 0 channels it's just I just like that it's there I don't use it do God forbid I would never use cable but I'm okay but but like I I just like that it's there and once once a month I'll just go on and like look for something to watch but it just makes me comfortable that it's there that's the way the way I feel about Netflix where I'm like I don't really use it I just I don't use my Q anymore or anything like that and the reason I don't use Netflix more is because it's unsearchable it's just showing me the same **** over and over again when you're when you're dedicating 10% of your real estate to things I'd already seen asking me if I want to watch it again that's a big **** problem to me yeah so Amazon has ways around that and I like so I think Amazon Instant Video is actually a superior Superior Service both free and paid because it's a fusion of both interesting the one the one place obviously Amazon doesn't",
      "start": 1060.64
    },
    {
      "text": "that and I like so I think Amazon Instant Video is actually a superior Superior Service both free and paid because it's a fusion of both interesting the one the one place obviously Amazon doesn't have them beat or at least in the public reception is is in the original programming Market and so that's that to me is that to me is another one of those things with Netflix like you're talking about how they should have died out you know they reinvented themselves well they've also reinvented themselves again because at first they were a you know disc delivery service right you didn't have to leave your home you could just order it and a day later it be there then it became streaming they were Kings of streaming now they're starting to compete with HBO on the original programming front if not our strong competitors and the same with HBO right you don't really necessarily know how many people are watching their shows either and they don't want you to know that because then that that creates",
      "start": 1095.08
    },
    {
      "text": "strong competitors and the same with HBO right you don't really necessarily know how many people are watching their shows either and they don't want you to know that because then that that creates that artificial competition which then creates an artificial value for whatever you're watching so as far as I'm concerned Orange Is the New Black gets as many views as Game of Thrones we probably we know for sure that's probably not the case but no one could tell you right yeah um so that is that's very fascinating to me because there's every day I listen to news or I read news about uh uh shows that are being greenlit and they're being green lit more and more by by places like HBO by places like Netflix and like Hulu um and I just realized finally like maybe a couple months ago I'm like I'm so out of touch with what's happening on network television oh that I probably know more about about what's happening on Hulu than I do about NBC like what shows are getting greenlit on NBC and that's very",
      "start": 1128.56
    },
    {
      "text": "so out of touch with what's happening on network television oh that I probably know more about about what's happening on Hulu than I do about NBC like what shows are getting greenlit on NBC and that's very telling and I have to imagine that if I'm that way what's a person who's growing up now like who what does a 14-year-old's habit are they do they even give a **** about any of that stuff or they straight up just YouTube and downloading stuff legally yeah I know I mean I feel like for us specifically like I feel we're we're super in tune with what's happening on Hulu and Netflix and stuff but I think the normal person isn't they're not yet it's not a mainstream thing yet I don't think but I think it will be and actually I don't think it ever will be I think they'll just be a there'll be kind of an equilibrium that it all reaches right right now like a lot of viewers are are dissatisfied with traditional mainstream television because we've been fed sort of the exact same thing over and",
      "start": 1163.52
    },
    {
      "text": "of an equilibrium that it all reaches right right now like a lot of viewers are are dissatisfied with traditional mainstream television because we've been fed sort of the exact same thing over and over again we are craving those original series like um Game of Thrones or True Detective or Ballers what's up yeah great show um just because they're giving a slightly different experience they can experiment with them they don't have to be the same sort of boring model that we've seen over and over again um and Hulu is now Hulu has become the place where um when the shows came don't have a market on mainstream TV they get picked up by Hulu so it's like Community went over to Hulu for a season right Arrested Development Community went to Yahoo oh Yahoo I'm sorry similar similar thing right where it's like well we can't exist on NBC because we can't afford to charge the ridiculous ad rev that each one of these shows needs to sustain itself so go over to Yahoo or go over to Hulu so it's going to",
      "start": 1199.2
    },
    {
      "text": "like well we can't exist on NBC because we can't afford to charge the ridiculous ad rev that each one of these shows needs to sustain itself so go over to Yahoo or go over to Hulu so it's going to be really interesting to watch to see what people's idea of a television show is in the next 5 to 10 years because it's just going to be content similar to kind of what we're doing now now right but I don't know I digress I mean yeah I mean the only thing I would say to that is that Netflix is investing in original programming and I appreciate it but there's really only two shows of any consequence on Netflix you know what I mean so it's like and by that I mean by by that I mean that there's shows people like but there are shows like me equality shows like like Game of Thrones or not Game of Thrones House of Cards and to a lesser extent Orange is New Black that's basically all that is relevant in terms of high quality right they need to so they need to do they need to do better than that I feel",
      "start": 1237.68
    },
    {
      "text": "House of Cards and to a lesser extent Orange is New Black that's basically all that is relevant in terms of high quality right they need to so they need to do they need to do better than that I feel like they're already making waves though with that right like this season or this season whatever Jesus the last three four months have seen Unbreakable Kimmy Schmidt which was awesome which is a great comedy that yeah it's totally it it's one of those that'll get I mean not I'm sure in some respect and now that Grace and Frankie thing which is Big talent I don't think the show is like amazing right no no I'm not saying that because they have Daredevil which is big but again but again on quality they have like things that like make the only show that they have that has made significant Buzz with like TV types where it was nominated like in a legitimate categories was and so and so they can have like all the fluff like Daredevil is the fluff that people like like the pulp stuff and that's",
      "start": 1277.44
    },
    {
      "text": "like TV types where it was nominated like in a legitimate categories was and so and so they can have like all the fluff like Daredevil is the fluff that people like like the pulp stuff and that's great but yeah they need more serious stuff and Amazon's credit I actually like their system of original programming better because what they did was like we just made 14 Pilots or whatever which one should we make you know which one of these like watch them all I thought I thought um uh Man in the High Tower is that the one yeah I thought that was actually awesome and and that was one of the ones and that was the one they they picked up it fell apart of the end yeah that was the thing uh but Transparent supposed to be really good that's the one with Jeff Transparent must to be excellent so I like I I only bring this up because to your point you're like they competing with HBO and I I don't HBO is premium premium premium premium content you know what I mean and I don't think",
      "start": 1314.48
    },
    {
      "text": "so I like I I only bring this up because to your point you're like they competing with HBO and I I don't HBO is premium premium premium premium content you know what I mean and I don't think that they have the money to do that kind of stuff on a regular basis and I don't think that they have uh they just haven't done it yet and so they're need they're going to need a Game of Thrones kind of style and I'm not saying a high fantasy show I'm just saying a Game of Thrones style yeah like toila and they almost are there with House of Cards they should have ended House of Cards already but House of Cards was their first thing that made waves that was like this is **** good but as we learned on Colin and Greg live Daredevil was watched more than House of Cards so Daredevil is that a fact yeah remember we did that they they did some people did a study like statistics like way more but like way more people watch Daredevil but Daredevil is not a show that's going to that's going to Garner a ****",
      "start": 1352.88
    },
    {
      "text": "we did that they they did some people did a study like statistics like way more but like way more people watch Daredevil but Daredevil is not a show that's going to that's going to Garner a **** single nod of any sort of any sort of award show it's the kind of stuff that you know you need to have your your your pillars that attract more talent and it's kind of like a you know like kind of building yeah that and that's that's the question is which one shows is going to bring in subscribers right it's different if you're like uh people are fairly interested in Daredevil but is that a quote unquote system seller is that a quote unquote like oh **** I need to watch that so I'm going to I'm going to subscribe now I'm going to sign up for Netflix right where Orange is the New Black I feel is on that caliber at least has that amount of Buzz they did like Arrested Development I mean that was one of those big moves of whether or not people talking about name grab name gra yeah exactly I'm talking",
      "start": 1388.64
    },
    {
      "text": "caliber at least has that amount of Buzz they did like Arrested Development I mean that was one of those big moves of whether or not people talking about name grab name gra yeah exactly I'm talking about like getting people to subscribe like I'm sure and we'll never know cuz they're never going to release the stats but I'm sure they saw a huge boost in subscribers for that I'm sure they did I wish they picked up Jericho I remember when that was forever man that they were going to pick up Jericho and they were talking about it but they well and that's the question is it'll be really really fascinating where like for instance Yahoo with Community right where Yahoo brings back Community and they do the final season there right that's how that went I mean it's the final season so far it's they ended it on in a way that Mak did you watch I didn't watch it I just read about it a lot it'll be fascinating when that starts to happen with Netflix where they start bringing over TV that quote",
      "start": 1423.56
    },
    {
      "text": "they ended it on in a way that Mak did you watch I didn't watch it I just read about it a lot it'll be fascinating when that starts to happen with Netflix where they start bringing over TV that quote unquote is about to die and they they revitalized It With Their audience yeah but Arrested Development was weird Arrested Development was one of those like kind of thrown together things that didn't work out the way they wanted it to was my understanding that scheduling issues with all the actors why people are green screened in andun the same **** is the same thing I'm just in the sense that that show has so much real world politics in it of who's still on the show that's like but it's also different that like Arrested Development was dead for years yeah it you know and so like they just brought it back out of the Dead which I think was a bold move and and they tried which I appreciate I think the the you know the bigger thing is we were talking about today on Colin and Greg was that you",
      "start": 1456.6
    },
    {
      "text": "it back out of the Dead which I think was a bold move and and they tried which I appreciate I think the the you know the bigger thing is we were talking about today on Colin and Greg was that you know Netflix and Amazon both considered picking up Hannibal from NBC and they both passed um which is showing which is showing me that these shows on TV are just too expensive for them and that's why and like that's why I think that they probably passed on a lot of stuff you know Jericho might have just been too like even a show like Jericho which is very beater is probably too expensive for them to make like they so they have to figure out like a either like go all in and spend a lot of money like they did on House of Cards or you find a hit like Orange is a New Black which they clearly didn't spend as much money on but and I'm sure that they did not expect the return they got on it in other words it's going to be a mixture of like investment in like shit products or things that they're really",
      "start": 1492.12
    },
    {
      "text": "as much money on but and I'm sure that they did not expect the return they got on it in other words it's going to be a mixture of like investment in like shit products or things that they're really confident in and then hoping that one of these shows like um like the new one with the the the old people Frank yeah like like that they hope that they you know they invest in in people like Jane Fonda or whatever that will bring people over and then they like the show itself it's it's going to be huge the thing is that they have very little room for risk because they're not they're not a cultivator of talent and they're not a cultivator of original IP only not they're not like any of these other networks they have to worry about their main business well but no I would argue the opposite right where they have they can take as many risks as they want because their main business is a bunch of people who forgot they still subscribe to Netflix and use it occasionally and be like oh wait yeah I",
      "start": 1530.84
    },
    {
      "text": "where they have they can take as many risks as they want because their main business is a bunch of people who forgot they still subscribe to Netflix and use it occasionally and be like oh wait yeah I still pay $8 a month for that and they're taking all that money and going cool how do we capitalize that how do we take risks like House of Cards House of Cards cost them a lot of money I mean it costs a lot of money to get uh uh David Fincher and his whole crew in to actually shoot the pilot and develop the look of it uh all the writers and all the actors what's his name Kevin Spacey and Robin Wright like those those people are aless actors they charge a lot of money for that now maybe they took a little bit of a uh Less on the on the front end for that thing um just to be able to do something cool and and and do something experimental but that but you're absolutely right they do need to re-evaluate sort of where the market is they can't pay people millions of dollars per episode and expects to be",
      "start": 1569.2
    },
    {
      "text": "and and do something experimental but that but you're absolutely right they do need to re-evaluate sort of where the market is they can't pay people millions of dollars per episode and expects to be around for a long time but that that I guess maybe is the core of what I'm talking about is where is that going to be 10 years from now is the like television costs so much money to make right now but is as people's expectations of quality um kind of they don't decrease but they change right like my expectation of quality is no longer Game of Thrones now it's it's it's a broad spectrum of what I find entertaining all the way from you know Game of Thrones down to uh like you know something like a Trailer Park Boys something like that which Netflix keeps beating me over the head to watch and I refuse to watch it because at this point it's recommended it for me every single at every turn you're like want I'm not going to watch it um it's hopeful I mean ultimately my my hidden agenda is",
      "start": 1603.32
    },
    {
      "text": "I refuse to watch it because at this point it's recommended it for me every single at every turn you're like want I'm not going to watch it um it's hopeful I mean ultimately my my hidden agenda is hopefully one day we get something on Netflix I think that'd be cool I mean that would be cool I think there's something you said though about the fact that I feel like in this day and age people look at Netflix and HBO as the exact same thing in terms of original programming because you guys watched Ballers why because HBO made it well and The Rock but what I'm saying is it's like it's you guys knew you could or Silicon Valley like why would you watch these things it's just you believe in HBO and telling you new thing try it see if it's for you and I feel like Netflix has that same **** where it's so many people I know watched Unbreakable Kimmy didn't give a **** about superheroes was like I'm going to try it because it's the new Netflix thing there free and every I know everyone's going",
      "start": 1643.28
    },
    {
      "text": "it's so many people I know watched Unbreakable Kimmy didn't give a **** about superheroes was like I'm going to try it because it's the new Netflix thing there free and every I know everyone's going to be talking about it so I might as well get Bard and see what so it's going to be interesting to see the next couple years and and how far down they go and when people stop caring I feel like HBO is a little bit better though at making their content and event we like especially since they do still have really are they well especially if you if you have the service on cable and you go there they are so good about promotion like every show ends with a promotion for the next Big Show or like every time watch into the next one yeah like you'll start Game of Thrones but it'll be a baller like like it'll just be a preview for baller before you watch Game of Thrones that's why I know Ballers because when I watch Game of Thrones it does that but I mean Netflix I would not say is bad at promotion",
      "start": 1682.68
    },
    {
      "text": "it'll just be a preview for baller before you watch Game of Thrones that's why I know Ballers because when I watch Game of Thrones it does that but I mean Netflix I would not say is bad at promotion like no no they're not bad it's just it's just because they don't have the Standalone service because you're not just tuning in and having that stuff programmed for you you don't feel that same same sense of cohesion as you do with HBO where HBO seems like it's one person programming for me whereas Netflix is seems like it's an algorithm that consist justce right that's the whole thing it's like I didn't know I didn't know Kimmy Schmidt was coming up until I turned on Netflix one day to watch something else and it was at the top like you should try this oh okay cool but I mean it wasn't back to an event like that's the opposite right like I knew Ballers was coming I knew Ballers I mean for weeks and months that Ballers good too EP it's getting better it's enjoyable all right it's like",
      "start": 1720.88
    },
    {
      "text": "to an event like that's the opposite right like I knew Ballers was coming I knew Ballers I mean for weeks and months that Ballers good too EP it's getting better it's enjoyable all right it's like Entourage where you're like oh Entourage and you watch it you're like great I like guys more than I like dour I like The Rock and Rob Cordry more than I like Dage guys I like dour just because it was this is a separate topic don't even go down that I got good news though your topic was good and it was sponsored by Squarespace yay I won I W everyone Squarespace provides simple powerful and beautiful Squarespace provides simple powerful and beautiful website that look professionally designed regardless of skill level no coding required not only does Squarespace provide you with in intuitive and easy to use tools to create your own website with Squarespace also has state-of-the-art technology powering your site to ensure security and stability and you know you can trust in Squarespace for your",
      "start": 1754.56
    },
    {
      "text": "to use tools to create your own website with Squarespace also has state-of-the-art technology powering your site to ensure security and stability and you know you can trust in Squarespace for your website needs when millions of people and some of the most respected brands in the world trust in them too just like we do we do you built it definitely one of the most trusted brands in the entire world to this audience we are it goes Intel than us than other brands that I can't remember Intel and a Spider-Man comic I don't think so that's true we are Square spider verse 3 everybody pick it up look for the Kinda Funny sweatshirt Squarespace gives you 24/7 online support and a beautiful website for only $8 a month you can even get a free domain if you buy Squarespace for the year so what are you waiting for start a trial with no credit card required and start building your website today when you decide to sign up for Squarespace make sure you use the offer code Kinda Funny to get 10% off",
      "start": 1798.04
    },
    {
      "text": "waiting for start a trial with no credit card required and start building your website today when you decide to sign up for Squarespace make sure you use the offer code Kinda Funny to get 10% off your first purchase and show your support for us Kinda Funny we thank Squarespace we do thank you very much yeah go to kof funny.com if you want to see it in action or just go to ky.com if you want to see fun content you just want to go to C",
      "start": 1837.88
    }
  ]
}
