{
  "id": 1026,
  "video_id": "tD51tshCLic",
  "show_name": "Gameplay",
  "hosts": ["Greg Miller", "Tim Gettys", "Nick Scarpino", "Colin Moriarty"],
  "title": "Rocket League Tournament - Kinda Funny Plays",
  "description": "Kinda Funny has a Rocket League tournament!\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
  "published_at": 1436986803,
  "duration": 1560,
  "transcript_chunks": [
    {
      "text": "What's up everybody? I'm Greg Miller and this is the Pride of Long Island Colin Moriarty. Good to be here with you today Greg. It's good to be here with you Colin. Colin yes. At E3 you gave one of your Kinda Funny approved awards to Rocket League. Indeed Rocket League is finally out. Free to play on that their PlayStation Plus right now for the PlayStation 4. It's on PC too. Although, God only knows why you'd go there to play it. I don't know what kind of psycho does that. Today, we're going to play some of it. I was off at Comic-Con. You have been playing your balls off with it. I played Yeah, many a game. Are you amazing? No, not at all. There are a lot of amazing people on the internet. I've been watching the Reddit videos and people doing stuff. They're doing amazing stuff. Yeah, there's very good people out there. I I I go online and I win like one in every two and a half games, I would say. Okay. So, I'm not I'm not terrible. Yeah. But I'm losing more than I win. But I",
      "start": 0.08
    },
    {
      "text": "there's very good people out there. I I I go online and I win like one in every two and a half games, I would say. Okay. So, I'm not I'm not terrible. Yeah. But I'm losing more than I win. But I play strictly one-on-one, which is not That's weird. Yeah, I like it like that. It's totally like I like it like people play, you know, you play two on two, three on three, four, and four. And you were saying yes, it's free on PS+ this month in July. Uh you can buy it on PC and you can actually play with PC gamers and vice versa on your PS4. Uh so it's pretty cool that way. No, it's just a soccer game with an RC car and it's really fun. So, what we're doing here, ladies and gentlemen, is the Kinda Funny invitational. The only people who are invited, we're calling me, Tim, and Nick. So, we're playing two sides of the bracket. You verse me, cuz you played a lot of it. I played a little bit of it. And then Nick and Tim, who have never played it. So, whoever wins this will go on to destroy them",
      "start": 32.88
    },
    {
      "text": "two sides of the bracket. You verse me, cuz you played a lot of it. I played a little bit of it. And then Nick and Tim, who have never played it. So, whoever wins this will go on to destroy them and win. Indeed. All right. So, here we go. So, I'm obvious you can see it already. I'm orange Collins blue. All right. You ready? Uh, I think so. Which how do I turbo again? Nope. I'm not ready. One nothing. It's turbo with circle. Yeah, this is why oneonone sucks. Uh, it's uh Yeah, it'll be, you know, R to go L to break and go backwards. Circle to uh boost if you have if you have boost. Triangle to change your point of view. You can use square to kind of like and so you're you were telling me beforehand you basically have to do it like this. Yeah, you have to. I mean, if you're playing one-on-one, you have to do it like this. Otherwise, it's just an automatic score. So, now here's my problem with Rocket League. I love Rocket League. We've known about So, you don't have any problems with",
      "start": 68.48
    },
    {
      "text": "you have to do it like this. Otherwise, it's just an automatic score. So, now here's my problem with Rocket League. I love Rocket League. We've known about So, you don't have any problems with them? Well, no, no, I'm getting to it. We've known we've loved Rocket League for a long time, right? I went to Comic-Con the week it came out, right? I'm way behind everybody. I will never I will never be good at Rocket League. I will never have fun. Well, you just scored. Yeah, but that's I mean, I don't I I have a feeling if now I feel like if it would have if I would have been here when it came out, if I would have had time to play it and get good at it, I would have been great. But we got four con conventions in five weeks, Kyle. Like, there's no there's no time to get good at you guys are the fools that have to go to all the or want to go to all these things. I'm just going to stay back and play Rocket League. Now, I'm not, you know, I'm I I enjoy I enjoy the game quite a bit. Oh, god. Hit",
      "start": 107.12
    },
    {
      "text": "that have to go to all the or want to go to all these things. I'm just going to stay back and play Rocket League. Now, I'm not, you know, I'm I I enjoy I enjoy the game quite a bit. Oh, god. Hit the post. Oh, no. Cool. Um the the game is just it's just pure fun. Yeah, it's a lot of fun. That's the thing. I think maybe that'll be what it'll actually come down to. I think I might have thought about I'm going to play it online a lot and d I think really it'll just be I play with my friends here and there. You know what I mean? And I know that Kinda Funny over on uh kindafunny.com/forums, we're trying to get the we have a guy over there getting the Rocket League league set up, but I don't that that I'm concerned about how much I'm going to get to play. Yeah. One of the things I'm one of the things I'm concerned about with with or one of the things I really want them to add with Rocket League and I'm surprised they didn't do it. Maybe they'll do it. Um I'll maybe talk to Jeremy and",
      "start": 138.88
    },
    {
      "text": "the things I'm concerned about with with or one of the things I really want them to add with Rocket League and I'm surprised they didn't do it. Maybe they'll do it. Um I'll maybe talk to Jeremy and just see what their plans are is I'm confused why there's no online league functionality. You can play League single player. Yeah, you have a And I did I played like a 36 game season. Um and it was fun. I went 35 and1 or something like that. **** I actually lost my first game and then didn't and then didn't lose any of the other ones. Um, but it's one of those it's one of those games where I'm like this would be a lot of fun to play online with your friends. Like you can organize a league like you can with Madden for instance. Yeah. Um, and you just can't you can't or NHL is a really good example with the EA CHL. EA SHL rather. Um, but you just can't do it. **** So, the reason I love the one-on-one game and why I think the one-on-one game in Rocket League is a little underrated",
      "start": 173.76
    },
    {
      "text": "example with the EA CHL. EA SHL rather. Um, but you just can't do it. **** So, the reason I love the one-on-one game and why I think the one-on-one game in Rocket League is a little underrated, frankly, is because it's a like everything that happens is your fault. It's either you being great or you screwing it up. I was saying on Colin and Greg live this morning that like I I beat a guy eight nothing or 8 to and I scored both of his goals as well. Oh, don't ah now I you can start seeing what my my game my strategy is. I think if you're paying close attention. Uhoh. Which is like in I intentionally hit the ball wide and then you wait for the rebounds. Uhoh. Uhoh. Uhoh. You're right on the doorstep. No, you put it was going off the top of the bar. So, you have raw you have raw ability here. Okay. I like I like the way you talk. I'm a little distracted, you know? I'm not playing quite up to snuff, but you could use the same excuse yourself. You know what I mean? Oh **** Uh-oh.",
      "start": 210.0
    },
    {
      "text": "here. Okay. I like I like the way you talk. I'm a little distracted, you know? I'm not playing quite up to snuff, but you could use the same excuse yourself. You know what I mean? Oh **** Uh-oh. It's weird. Like I I I still have to finish Batman. Yeah. And I would sit down like three days in a row since this has come out and like, \"All right, I'm going to beat Batman today.\" And I play Batman for like literally, 0 minutes a day. I don't want to play Batman anymore. And then I just play this for **** hours cuz it's just so fun. Oh man, you're That's going in. It's alive. Uhoh. If I can just get Oh, I put it in. Oh, you Jeremy Dunham. That crossed the whole ball has to cross the bars. Does it really? Okay. All right. Oh, yeah. Oh, I'm also not crazy about how they split the screen. You probably could change it. I feel like I've played where the screen can be horizontal. Did when they came by for the demo, did we do it that way? I could have sworn we did, but I'm sure it's just I'm",
      "start": 262.32
    },
    {
      "text": "probably could change it. I feel like I've played where the screen can be horizontal. Did when they came by for the demo, did we do it that way? I could have sworn we did, but I'm sure it's just I'm sure I'm sure it's just my fault. Jeremiah, this is the first time I've played with another person in in in real life. You've been alone in the house for I have some time. It's been awesome. It's been fantastic. It's your dream. Now, here's the thing. Are you playing with ball cam or are you playing with like a normal camera? No, I'm playing normal cam. Uh oh. That's how mama raised Greg Miller. **** you. Put it for you. See, that's what I do all the time. Now, Your hands are so sweaty right now. My hands are very sweaty now. These tense moments, guys. It's fun to watch the way people play these particular setups as well. Yeah. Cuz I try to let I let go at the at the last second. Yeah. And then Oh, go. There's a trick I realized against the computer when you're playing the season mode.",
      "start": 310.48
    },
    {
      "text": "these particular setups as well. Yeah. Cuz I try to let I let go at the at the last second. Yeah. And then Oh, go. There's a trick I realized against the computer when you're playing the season mode. Yeah. is if you go full bore like towards the ball like straight on like that when you're starting straight on and then you let go of the circle like right before the so you can see that there's two like turbo boost things here um the ball will like arc in every time and if you if you actually yeah if you if you go full if as long as the no one's in front of you if you if you um Oh if you hit it full boore control if you hit it at full bore full speed Yeah then Um, what ends up happening is that it will like go over the net every time. So, there's little tricks like that that I'm learning slowly. **** Damn it. Nice job. That was really well played. Really well played. It's waiting. So, how you got to play it? It's a good game. Yeah, it's really good. Can't believe they're giving it away",
      "start": 351.28
    },
    {
      "text": "**** Damn it. Nice job. That was really well played. Really well played. It's waiting. So, how you got to play it? It's a good game. Yeah, it's really good. Can't believe they're giving it away for free on PS+. It's Power Shu Yoshida. It is the I mean it's specifically the power shua that I think she called to Dunham. He's like you want you want hey about to put out a great game. What do you say we give it away for free? And Dunham said hey she was like yeah can we please get back to business here? We said USP on Twitter. M what I've learned too is the the appropriate use of the break. Yeah, I have not learned that. Especially if you're using ball cam, which I ball cam is pretty essential when you're playing defense. **** I was trying to make a big move there. That's going to hurt. See, like right there, like now that you're playing offense, ball cam is so detrimental. Uh oh, you're going to have to tie it up. I think I'm going to destroy at least. So if you go full if you use",
      "start": 409.24
    },
    {
      "text": "See, like right there, like now that you're playing offense, ball cam is so detrimental. Uh oh, you're going to have to tie it up. I think I'm going to destroy at least. So if you go full if you use your whole So sweaty. Why is it so hot? We're going to go We're going to go over. No, I don't like Don't say **** like that. That immediately leads to not going to overtime. That means some garbage goal from Garbage City USA comes through and everybody's like, \"Shou. Oh shit.\" Oh no. So that's what I'm saying. If you get too aggressive, there's nothing stopping anyone from scoring on you. All right. Over. I can't tell if you're letting me just hang in there or what, but I appreciate the game we're playing. No, it's fun. I told you I'm not that good. But I, you know, I felt like I felt like I was so bad on Monday night that I should just I think you were playing as like the designers and stuff. I was. I said that. I think I understand the game a little bit better than you. The way I'm",
      "start": 464.0
    },
    {
      "text": "I was so bad on Monday night that I should just I think you were playing as like the designers and stuff. I was. I said that. I think I understand the game a little bit better than you. The way I'm like letting the ball play. I was I was wondering playing it how much like a knowledge of soccer or hockey would really help. Hockey. I feel like this game is very hockey like in the way that when I play like two on two or three on three, the way I'm like just scaling into the into the slot waiting for a pass. Oh, shoot. No, it's fine. I was I was just driving to the hole. See what you would do. It's just still a dead ball in the center. It's like I don't I had to knock you off of it anyway. Playing a little D. Got to play a little D. Leaving till there's a win. Got to play a little D. I like So, I tweeted out the other the other day, what I'm curious about with this game is if it's going to if it's going to create a culture of goalending for some people. **** Good job. Yeah. Like, I was",
      "start": 512.4
    },
    {
      "text": "I tweeted out the other the other day, what I'm curious about with this game is if it's going to if it's going to create a culture of goalending for some people. **** Good job. Yeah. Like, I was looking at the statistics. Good game, by the way. You gave me a run for my money. If if people are going to master being goalies in this game, cuz I there's a a tutorial where you can learn how to shoot and all that kind of stuff. There's a tutorial where you can learn how to play goal. Yeah. And I was like, \"Man, this is tough.\" But then I was looking at people's stats and there are people with like a thousand saves already. I was like, \"Geez, I have like 17 or something like that.\" All right. Well, now I got to switch over to Nick and Tim. Nick and Tim, you're up. Of course, ladies and gentlemen, you play this game a lot, you'll unlock the Team Fat flag. Very important. That's our It's our thing if you didn't know. All right, Nick, we're doing this. This is insane. I'm coming for you. Okay",
      "start": 570.0
    },
    {
      "text": "you play this game a lot, you'll unlock the Team Fat flag. Very important. That's our It's our thing if you didn't know. All right, Nick, we're doing this. This is insane. I'm coming for you. Okay, we have to use analog stick to move. Oh, suck on that. Oh, man. No. Oh right in. All right. All right. Hold on. So it's worth Tim. You're you're playing as Moriarty IGN, right? Yes. So it's important to say that. So you're blue. I'm playing as guest one. I'm Moriarty IGN repping the blue. All right. Get it. Yeah. Get it, son. All right. I see what's up. I see what's up. You got that accelerator. Yeah. Oh, right off the post. Yeah, that's that good **** That good dig. All right. Oh. Oh, he's jumping around like a goddamn No **** Oh, I'm out of I'm out of boost. No, no, no, no. I like how it blows us backwards. I know. I like how I had to like slide that one in. Totally unnecessary. Completely unnecessary. All right, you guys can skip that by one. Okay, things are about to get real, Nick. I",
      "start": 604.96
    },
    {
      "text": "us backwards. I know. I like how I had to like slide that one in. Totally unnecessary. Completely unnecessary. All right, you guys can skip that by one. Okay, things are about to get real, Nick. I can feel it. Going on hard D right now. Hard D. What's that even mean? Oh, your D wasn't hard enough, Nick. Classic Nick. Damn it. Oh my god. No. No. Yes. This is a battle of attrition. Look how bad we are. Oh, I went back when I should have gone forward. I almost I almost saved it. If I could sideswipe, that would be amazing. D reminds me a lot of uh Twist of Metal. Oh no. Damn. 401 46 seconds. You got to step it up here. I'll play D for a sec. I don't care. Don't go easy on me. Oh god. Oh no. No. No. No. No. How many players can play this? Eight. Up to eight. Oh, this is going to be chaos. What do you guys think? I like it. It's fun. Oh god. Oh. Whoa. What the **** Oh man. God damn it. Suck on it. No. Now, Nick, you might want to consider getting out of the uh going in and out of using",
      "start": 692.08
    },
    {
      "text": "do you guys think? I like it. It's fun. Oh god. Oh. Whoa. What the **** Oh man. God damn it. Suck on it. No. Now, Nick, you might want to consider getting out of the uh going in and out of using the triangle button to go in and out of uh mode that tracks the ball for you if you lose it. Gotcha. This one's intense. I do not want you to get this. Oh god, what are you doing? You're crazy. Going **** into it. No. All right. Damn it. So, this is the kind of game you guys want to play. Yeah, this is Oh, no. No, no, no, no. Oh, god. It's a little hard to control. It's hard. So, but I think that's the point. Well, the the point is like so the person in orange is using free mode and Nick you. So Nick is and and Tim you're using the ball cam. Yeah. And so the ball will always stay centered. Yeah. I'm a big fan of ball for you. But if it's easy to miss the ball that way if the ball changes trajectories. So you you want to strategic use of the button out is actually pretty important. Like I",
      "start": 776.32
    },
    {
      "text": "I'm a big fan of ball for you. But if it's easy to miss the ball that way if the ball changes trajectories. So you you want to strategic use of the button out is actually pretty important. Like I use I typically use the triangle but like ball cam on defense. That makes sense. No. Oh my god, it bounced right over me. All that scoring in the beginning and then nothing. Well, we got a little more uh aggressive. **** **** **** At least you didn't score yourself like I was. All right. Oh, you **** You **** Oh no. Oh my god. What are the uh little circles that we got going? I think that's your boost. The boost on the ground. Yeah. Yeah. That builds up your boost meter in the bottom right corner. Oh my god. It's like this is hard enough if you weren't here. I know. Damn it. Oh, you dick. No. No one goes out. It happens. It does happen, man. It does happen. That was the vehicle equivalent of talking **** Yeah. There she goes. Yeah. Thanks. Thanks for that. We got more. Yeah, we",
      "start": 880.64
    },
    {
      "text": "No. No one goes out. It happens. It does happen, man. It does happen. That was the vehicle equivalent of talking **** Yeah. There she goes. Yeah. Thanks. Thanks for that. We got more. Yeah, we have 45 seconds. Damn it. Jeez. Six to one. It really is whoever hits that power first. If you hold down R, in circle before you even start moving, you'll both be at the ball at the same time. Oh, really? And that's just the way Yeah, that's the way most people play. So, the ball just bounces in weird places. It is more like a real tip off. Makes sense. One more. Damn it. I am not great at this. Jesus. When does this end? I concede. You got 30. You got 34 seconds. I got 34 seconds to come up. Six. I want one more. **** Where'd it go? So, it's those **** where is it moments where you hit the triangle button on the wall and then it'll show you that. God damn it. This is hard to play. It is. You'll get used to it. Yeah. Well, okay. Oh god. No. No. No. Damn it. Okay. Good. Good. Winner. winner",
      "start": 963.12
    },
    {
      "text": "button on the wall and then it'll show you that. God damn it. This is hard to play. It is. You'll get used to it. Yeah. Well, okay. Oh god. No. No. No. Damn it. Okay. Good. Good. Winner. winner as always. Blue team wins. All right. So, that's how you do it. Oh, we got the Team Fat sticker. Finally, the Team Fat player. Nice. That's so funny. We unlocked it right here on this video. There you go. Sweet. So, now I take on Greg. No, me. Oh, I take on Colin. I'm going to win. You ready, Tim? Yep. Oh, I hit the post. Where'd it go? Oh, are you not playing? I'm good. I'm good. I'm good. Oh god. I was trying to use the D. Oh no, you can't use the All right. All right. I don't really see the use of the jump. Oh, I guess the jump gives you velocity on your shots. Oh, see? Yeah. Oh, clear it out of the center. So, this is the uh the broke ass championship. I'm going to call it. Oh god. Oh yeah, there we go. No, no, no, no, no, no. I jumped too soon. Did you get a save? Okay, here we go. There",
      "start": 1038.32
    },
    {
      "text": "the center. So, this is the uh the broke ass championship. I'm going to call it. Oh god. Oh yeah, there we go. No, no, no, no, no, no. I jumped too soon. Did you get a save? Okay, here we go. There we go. **** Come on. Oh, it's getting **** **** **** **** **** **** No. That was good. I'll give you that. Flying my Team Fat flag. All right. So, what do you think of the game having never played it? I like this a lot. It's fun. Reminds me of um It's very silly. I dog **** **** Yeah. And just like it's just a silly kind of multiplayer game. The thing and I was telling you about this the thing about this game is that there are people I mean we are I am you know you've never played the game before and I'm I certainly don't play it at a high level. There are people that go in. No no no a um there are people that play this game at an extraordinarily high level. Um people are crazy. But I I I find the sanctity of the one-on-one game. Yeah, I like it. Smash Bros. Yeah, exactly.",
      "start": 1121.88
    },
    {
      "text": "no no a um there are people that play this game at an extraordinarily high level. Um people are crazy. But I I I find the sanctity of the one-on-one game. Yeah, I like it. Smash Bros. Yeah, exactly. Like people love playing a two on two, three on three four and four, and I respect that, but it's not the way I want to play. No, **** you. That was **** That was **** What happened here? Oh, you missed it. I see. I do have that turn to get the shot on on down. Pretty nice. But I'm always just expecting to run into someone in the middle. God. Oh, hit the post. Uhoh. Got to play a little defense here. Oh **** Oh god. You beat me to it. No. Come on. I was trying not to do like a little header. There we go. Oh god. Oh, I hit the post again. Oh no. I thought I had that one. Oh. Oh yeah. You're jumping around and **** God, I'm stuck. This isn't good. No. No. Oh, got the crossbar. I hit I played I played three post there pretty well. Three iron or whatever the **** you call it. All",
      "start": 1194.88
    },
    {
      "text": "jumping around and **** God, I'm stuck. This isn't good. No. No. Oh, got the crossbar. I hit I played I played three post there pretty well. Three iron or whatever the **** you call it. All right. Gor Bombay's game. Oh, **** Yeah. Again, this game's challenging enough without you. Oh, no. Damn. It's one of those games where you just have to sit with it. And we we explained at the beginning when Greg and I were playing it that we have wide array of experiences with the game. So, the you know, your quality of play is fine considering this is the first time you've ever played the game. I've played it at many events and and I've spent a lot of time with it this past this past week. So **** But I love the the thing I love the most about the game is the Oh sh Oh, the thing I love the most about is the angular nature of it. Yeah, it's cool. Um that like you can see how beastly the game gets when you play with multiple people because like you can really just set the ball up for other",
      "start": 1277.8
    },
    {
      "text": "about is the angular nature of it. Yeah, it's cool. Um that like you can see how beastly the game gets when you play with multiple people because like you can really just set the ball up for other people and and play positions. Yeah, the jump and the aerial **** is really robbed. I was robbed. Are you upset? Super excited. What do you think of it, Nick? It's good. So, yeah, the using the X button is like a strategic way to kind of make the ball go a little faster. Oh, you son of a **** No. No. Oh, you're good at that. You got that little butt kick. Yeah, you got to use the every part of the car. Like using every part of the deer, every part of the bison. Can we scoot over to your right a little bit? Looks to your left. No, your right. You guys, right? Not a good time. Oh god. Yeah. No. The wrong stream there. I did the same thing when I was playing Greg. I use that as an excuse. He almost beat me. Oh my god. No. I'm sorry. I don't mean to be laying it on. Did I miss that? I Let's",
      "start": 1332.8
    },
    {
      "text": "The wrong stream there. I did the same thing when I was playing Greg. I use that as an excuse. He almost beat me. Oh my god. No. I'm sorry. I don't mean to be laying it on. Did I miss that? I Let's Let's look at the replay here. How come you hit it first? I just got to it first and then I just hit it from a certain side where it went right over you, I guess. Oh, all's fair in Rocket League. Oh. Oh, that's going to bounce right in the middle. Oh god. **** **** **** **** **** I don't have any boost. Getting there real slow. Oh no, that was awesome watching flipped over. I don't want to see that. The replays aren't good. All right, my last 47 seconds left. Can you break the shut out? Oh, straight up. Little D there. A little defense. Oh, I thought you were going to kick it. I was trying to anticipate. Oh no. Oh no. Oh no. A you broke my shut out. 0 seconds left. Had no boost. That's all that matters. That's it. I'm I'm a victor in my heart. I've lost for games this bad online",
      "start": 1389.6
    },
    {
      "text": "to anticipate. Oh no. Oh no. Oh no. A you broke my shut out. 0 seconds left. Had no boost. That's all that matters. That's it. I'm I'm a victor in my heart. I've lost for games this bad online before and that was all I really cared about was not being shut out. No one's ever shut me out. That's all. You can't shut out. No that's all the only We've all tried. You have to have your little points of pride. I'm just It's impossible. Oh god. He blew me up. Blew you the **** up. Yeah. So if you run into It's called demolition I think. If you run into someone at a fast enough speed you can destroy their car. Well had I known that it just happens for a few seconds though. It's not really that useful. Oh is that Oh I thought that was just going to naturally go in. That would have been awesome. Yeah this jumping mechanic's cool. That's it. That's Rocket League. Well well played sir. Thank you. Good game. You did okay I guess. Thank you. All right so that's Rocket",
      "start": 1479.92
    },
    {
      "text": "awesome. Yeah this jumping mechanic's cool. That's it. That's Rocket League. Well well played sir. Thank you. Good game. You did okay I guess. Thank you. All right so that's Rocket League. You can find it uh on PlayStation 4. It's free in the month of July for PlayStation Plus members. So you can just get it totally free of charge. If you had on PC you can buy it there too on Steam. Uh it's by Psyonix down in San Diego. And uh we really enjoy the game. And we're not just saying that cuz our good friend Jeremy Dunham is one of the people that developed the game. We really actually do love this game very much. So play it. Rocket League, PS4, PC. Enjoy. We hope you like this let's play. We'll see you next time. Kinda Funny Games. Bye.",
      "start": 1521.68
    }
  ]
}
