{
  "id": 1019,
  "video_id": "xUX1uX67hsw",
  "show_name": "Reactions",
  "hosts": ["Greg Miller", "Nick Scarpino", "Portillo"],
  "title": "Batman v Superman Comic-Con Trailer - Kinda Funny Reacts",
  "description": "What does the Internet's biggest DC Fanboy think of the Comic-Con trailer for Batman v Superman: Dawn of Justice? Let's find out!\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1436819589,
  "duration": 1383,
  "transcript_chunks": [
    {
      "text": "What's up everybody? I'm Greg Miller and this is the producer SL Seducer Nick Scarpino. Yo, Nick, we're tired. We were at Comic-Con, but while we were at Comic-Con something big happened. Batman v Superman: Dawn of Justice official trailer. It's super long. We want to talk about it. Everybody out there kept tweeting me wanting responses, but we were too busy partying it up at Comic. We lived, we lived in Comic-Con, but let's talk about this trailer. All right, yeah. Well, first of all, thank God that they decided to actually put the HD version of this. Thank you, Zack Snider. Thank you, Warner Brothers for doing that. These people in their Hall H premieres, I get it, you know, I I understand it. I I talked to Tim about this a little bit um cuz they they also released a Suicide trailer or they showed a Suicide Squad trailer and they also showed the Deadpool trailer, right? And both of those I had to unfortunately suffer through the shaky cam where like, you know, it was on this part of the screen and then it would blink",
      "start": 0.12
    },
    {
      "text": "and they also showed the Deadpool trailer, right? And both of those I had to unfortunately suffer through the shaky cam where like, you know, it was on this part of the screen and then it would blink out for a second and come back on this part and someone would inevitably stand in front of it and pick their nose for a couple seconds. Um, Tim's Tim's concept behind that is that actually adds the it heightens the the like hype up it which I I have to agree with. It's my main thing is I want to make sure that people who wait in overnight in line for H are getting rewarded with something. It's honestly one of those things like I can live without all these exclusives. I don't mind. I want to see them, you know what I mean, obviously and that's why I'll go watch bootlegged footage, but I don't really usually too much that they put it on HD. No, I'm not I'm not I'm not bitching, but I I am saying, you know, Zach Schneider if you're watching, I'm sure I'm sure you are sure you're watching right now um that",
      "start": 35.24
    },
    {
      "text": "too much that they put it on HD. No, I'm not I'm not I'm not bitching, but I I am saying, you know, Zach Schneider if you're watching, I'm sure I'm sure you are sure you're watching right now um that thank you for this. This is awesome and this trailer is so good. I watched it five times because it is an HD and I can hear the audio and I can hear the dialog. I can see the definition in the suits and I can tell that's the Robin suit. I mean, I'm probably going to watch it two or three more times before the day out. No, what what was exciting about this for me is that just last week I put up a video where we were talking about superhero movies over on GameOverGreggy show, right? And I laid out a little bit of my whole thing about what I think DC is doing in their Universe how Man of Steel underwhelmed me the first time I saw it because of my high expectations then when I saw it again with Lowered Expectations with sounds terrible I started to get like okay wait this is their take on it it shouldn't",
      "start": 71.24
    },
    {
      "text": "the first time I saw it because of my high expectations then when I saw it again with Lowered Expectations with sounds terrible I started to get like okay wait this is their take on it it shouldn't be so hard and see the trailer here it's still that and see suicide it's like they're building in this realistic world of what it would be like if these heroes and villains started popping up, right? And so for me to have that belief that's where I've been giving them a lot of slack and be like I think you're doing something I think you're building something with the DC Universe I'm excited to see where it goes and the rest of the internet has been against me saying no Mana steal suck this is going to suck too and you watch this trailer and this trailer is awesome yeah this trailer let's let's start at the beginning of the trailer here where we're where it starts it's black screen we hear Holly Hunter um as US senator talking about kind of where the world is now, right? We don't know we",
      "start": 110.84
    },
    {
      "text": "start at the beginning of the trailer here where we're where it starts it's black screen we hear Holly Hunter um as US senator talking about kind of where the world is now, right? We don't know we don't know what Superman is. We have to get to the bottom of it's not like it's not his fault we just have to figure out what this guy stands for because we don't know and and it seems from some of the dialogue in the trailer that not even he knows, right? He still has that conflict of of of conscious where he's trying to figure out is he going to be the man his father thinks he can be or is he going to go some other direction with it, right? So there this is the trailer obviously speaking we don't know he might become 100% resolved toward the beginning of the Le we don't know but you bet you you assume he won't be cuz there are these two Waring factions over him he's to to Superman he's Clark Kent he's just this guy who has these powers and all these different things he knows that he was you",
      "start": 145.36
    },
    {
      "text": "assume he won't be cuz there are these two Waring factions over him he's to to Superman he's Clark Kent he's just this guy who has these powers and all these different things he knows that he was you know responsible in way for all these deaths and now he has part of the world that thinks he's a God and a savior and he's going to fix all their problems and another part that thinks he's the devil, right? Um, so we see a beautiful shot of him obviously like dropping down in front of a in front of the the Senate Capal the capital building and uh you know there protesters out there and then we see uh him basically walking into the courtroom and his testim give his testimony on what happens um but the more interesting of the aspects and this and this is where I think that they're starting to do their their grand plan or however Grand is starting to actually unfold and it's starting to sell the out of me was that we see the shot of Zod well we don't see the shot of Zod we don't see Zod in this",
      "start": 178.88
    },
    {
      "text": "their grand plan or however Grand is starting to actually unfold and it's starting to sell the out of me was that we see the shot of Zod well we don't see the shot of Zod we don't see Zod in this until later in the trailer but we see the lasers that Zod shot out into one of the buildings yeah it's them battling with their heat vision cut to the opposite shot of that like what was happening on the outside of it and we see an older grizzli sort of worn down Bruce Wayne an adult Bruce Wayne who's clearly Metropolis on business during this, right? And he's staring in Terror at this thing that even though we know he's been the Batman for so long his brain can't Poss like can't quite comprehend we get that shot and anyone who it was doubtful that Ben Affleck could be a good Batman from this trailer alone I'm not saying he's going to be the best Batman on the planet he sold me on this and he sold me on the fact that he is an older Bruce Wayne and he is The Dark Knight Bruce Wayne well you're",
      "start": 216.16
    },
    {
      "text": "alone I'm not saying he's going to be the best Batman on the planet he sold me on this and he sold me on the fact that he is an older Bruce Wayne and he is The Dark Knight Bruce Wayne well you're talking last night I thought at dinner that was really really interesting cuz you're such a filmaker guy and you know you know you look at shots differently than I do, right? Is that yeah the trailer shows the Zod Superman battle from the ground and obviously it's meant to bring the whole I guess battle in general was meant to bring up for us feelings of 911, right? And that's what we're seeing here is like this building tumbles and people are running and Batman's the only one running in but you talked about it last night of you know from you've been hot and cold on Ben Affleck before I of course loved him cuz I'm a Kevin Smith kid but you've been hot and cold on him before but you said you said that in that one look he had Terror and rage and you know all these different emotions in his eyes",
      "start": 257.0
    },
    {
      "text": "loved him cuz I'm a Kevin Smith kid but you've been hot and cold on him before but you said you said that in that one look he had Terror and rage and you know all these different emotions in his eyes yeah he sells this the look where he's he's he's uh embracing a kid he we presumably he saved from Wayne Tower and as it's coming out we're see we see the emblem of Wayne Tower destroyed next to him um and he's staring up and and it really does sell the fact like those those first few moments we' seen in the trailer for me cell like I think he did a phenomenal job of just getting across all those complex emotions in one look of like you know and maybe I'm bringing a lot of my own history with Batman to this but you know I can imagine the first time you you you've seen Superman or something a being of this caliber and you've only ever encountered Psychopaths until this point but they're hum yeah you know they're they're Geniuses and they put you through the ringer but they don't",
      "start": 293.96
    },
    {
      "text": "a being of this caliber and you've only ever encountered Psychopaths until this point but they're hum yeah you know they're they're Geniuses and they put you through the ringer but they don't have laser beams that they shoot out of their eyes, right? They can't fly like gods and so to in that one look for me he got across the fact that this is something wholly different that now he has to deal with and he only he can deal deal with it sure that was you know we get we set up in very very very very uh Quick Cuts and very very good imagery the fact that he is still very much the Batman with you know while everyone else is running away he is not even hesitating for a second to run into that cloud of chaos and save whomever he can save presumably like there might be one or two people that he can he can help out um and so we go and we get this whole world set up of he's talking to ALF the new Alfred which is Jeremy Irons which you know I saw the casting news on that a while back yeah but",
      "start": 336.68
    },
    {
      "text": "can he can help out um and so we go and we get this whole world set up of he's talking to ALF the new Alfred which is Jeremy Irons which you know I saw the casting news on that a while back yeah but seeing him as Alfred and hearing that voice yeah he's doing great he's like so like Michael Kane's like the consiliary for uh for when it's peace time you know like if if if we're putting this in terms of um of The Godfather like Robert Deval's character was like the the peace time consiliary but when they needed a wartime consiliary they had to go outside they had to get someone else, right? And this is like to me the Jeremy Irons character is a little bit more hardcore he's a little bit just from what we saw I got a lot of I don't know if you've read it I got a lot of uh feels for Batman Earth One no read and there you know there Alfred is a former military dude and like helps Batman and beats the out of Batman at one point and does all this stuff he's there to fight he knows how to",
      "start": 379.12
    },
    {
      "text": "Earth One no read and there you know there Alfred is a former military dude and like helps Batman and beats the out of Batman at one point and does all this stuff he's there to fight he knows how to role they they mentioned that briefly in a couple of the episodes of the original animated series they were like works for like you know he worked for the British secret service yeah it's like okay and then he wore tuxedo the rest of his life for the rest of his life he's just going to go work for Thomas Wayne but you don't know I mean obviously there's obviously backstory there that fleshed out really cool but I thought it was like you know what we've been leading up to the whole time in hypothesizing K on theories of like why would he do this, right? Like why would Batman be against Superman and we had the idea of him being in Gotham watching everything go to hell but it turns out he was in Metropolis seeing that at Ground Zero yeah seeing those two fight and and you can imagine and it's",
      "start": 419.68
    },
    {
      "text": "and we had the idea of him being in Gotham watching everything go to hell but it turns out he was in Metropolis seeing that at Ground Zero yeah seeing those two fight and and you can imagine and it's and this is the cool thing about it is like we're seeing shots in this obviously that are very very comic bookes right you're going to see Batman and for the first time in a Batman movie we're going to see Batman do stuff that Batman should do, right? Uh there's a few shots that stand out in my brain on this one that that really really really like Hit me hard one of them was the shot where you know the the people the woman's reaching up into the Stars house that's flooded all around and it cuts to the reverse of her and we the camera pans up and you just see Superman in the clouds with the sun behind him like well get down here Superman what's taking so what you do what are you hesitating on brother water is not receiving why are you taking this Glory shop there's like a million people",
      "start": 452.64
    },
    {
      "text": "sun behind him like well get down here Superman what's taking so what you do what are you hesitating on brother water is not receiving why are you taking this Glory shop there's like a million people behind us we help come on hurry up buddy um so that was beautiful but the other shot that really really really sold me and T told me that there is a Batman making this movie was was when they showed them fighting and all those fight scenes were awesome and he kind of Moves Like a tank where he's like when he's smashing on him but the one that really got it for me um was when Superman looks and he shoots the lasers and we sort of follow Vision I was going to give you the first I was letting you go the first time then you did it for Zod again I just want to let know the heat vision he takes he shoots the heat vision out of his eyes yeah are they called eyes or they called something different on Krypton on Krypton they're called neox neox so he shoots the heat vision out of his neox by his",
      "start": 493.0
    },
    {
      "text": "shoots the heat vision out of his eyes yeah are they called eyes or they called something different on Krypton on Krypton they're called neox neox so he shoots the heat vision out of his neox by his going ad um well and we follow we follow the beams as they're about to smash into Batman and the second before they do he grapple hooks away and that's to me I'm like thank you like I know that no normal human being can do this but the Batman can Course and there was the shot I didn't see I I basically I was getting ready to go host a Comic-Con panel when the trailer dropped and I stopped in my tracks and watched it in my hotel room on my iPhone and then turned off all the lights and watched on my iPhone again and then I was like all right now I can go on the big screen we just watched it on right like I didn't catch before the shot where he basically right out of like Arkham Knight which we just played right or the Arkham series coming in like gliding in with his cape and just kicking",
      "start": 529.72
    },
    {
      "text": "right like I didn't catch before the shot where he basically right out of like Arkham Knight which we just played right or the Arkham series coming in like gliding in with his cape and just kicking through the glass like super on top of the glass no not not even that one there's a shot of him like coming at the camera break through but it's a quick cut yeah see that's and and that's that gives me so much hope I mean granted yeah I don't know if this is going to be on the same level as Dark Knight like as far as the impact and great film making and all that stuff but this has this is GNA have those wild moments for this is gonna have the moments where Batman you know the iconic shots of like Batman coming up into like the moon behind him right where he's raising the backat cape and he's actually making the symbol and all those things um we've got some obviously a lot of imagry from Frank Miller's Dark Knight Returns um that you can't even the suit and the people have drawn",
      "start": 564.48
    },
    {
      "text": "and he's actually making the symbol and all those things um we've got some obviously a lot of imagry from Frank Miller's Dark Knight Returns um that you can't even the suit and the people have drawn comparisons between that shot where he's about to grapple hook off um and you got the lightning bolt in the back in the cover of the dark so there's a lot a lot of of detail being paid in terms of like in terms of like fan service and nailing the characters I think it's all in that when at the very end lands on the Batmobile tears off the doors and Batman just stands up doesn't even make eye contact right away stands up and does that thing yeah I know right like I got something else up my sleep for you dud this ain't it this ain't it I mean you that that to me has to be probably like if I had if I had a guess that would be like Midway through maybe the first time they encounter each other, right? And he leaves alone chasing around oh yeah because then he gets he goes and gets the",
      "start": 603.08
    },
    {
      "text": "if I had if I had a guess that would be like Midway through maybe the first time they encounter each other, right? And he leaves alone chasing around oh yeah because then he gets he goes and gets the freaking electrified tank suit um that is so well done and looks so good in these shots that I can't I just I need to see this Im so let's bring up the let's bring up some of the questions I've seen raised already okay uh Wonder Woman we see her basically knocked into something and like kind of do one of these like Shake It Off moments and try to go back out is she fighting someone or is she trying to break up the fight you think I don't know that's a really good question I mean we don't see we have to break it down from as far as plot structure there's there's three things going on here, right? There's the The Duel between bat Superman Batman and Superman obviously that's the title there's the uh the complexity of Superman fighting the US government and then there's the Wild Card which is",
      "start": 642.08
    },
    {
      "text": "there's the The Duel between bat Superman Batman and Superman obviously that's the title there's the uh the complexity of Superman fighting the US government and then there's the Wild Card which is the Lux Luther character who looks to influencing Holly Hunter character that's getting in her head you imagine Lex Luther should be right playing the power the the the powerful uh corporate Giant and manipulating politic politicians for his own do right for his own gain now and that's one of the things that I like about this a lot of people gave uh uh Jesse Eisenberg a lot of for the wig or whatever it is presumably It's A Wig because spoilers he's supposed to be bald I've seen him bald already yeah I mean and it looks like I'm wrong because in in he on kinda funny when I did the reacts to all the Entertainment Weekly things I was saying that looks like like it's going to be in the very beginning and then it's not going to be how he went bald and now in this trailer there's a bunch",
      "start": 678.08
    },
    {
      "text": "to all the Entertainment Weekly things I was saying that looks like like it's going to be in the very beginning and then it's not going to be how he went bald and now in this trailer there's a bunch of shots of him in that wig, right? So it looks like he is going to be have hair for a good part of it until either we see him you know up against the Kryptonite either he gets radiation poisoning from that an experiment goes arise something with Batman and Superman fighting get him or he's just bald the entire time and he's wearing the wig because that's what Lex Luther used to do remember in the original in the Donner films he because Jee Hackman didn't want to shave his head yeah I remember I remember why he had that but uh uh you know so there's a lot of things going on here so we don't know where Wonder Woman Kind of fits in with that now and that is the wild card for me is that when you start listing off all of those characters I'm like I don't I can't IM granted I'm not a Hollywood",
      "start": 716.0
    },
    {
      "text": "where Wonder Woman Kind of fits in with that now and that is the wild card for me is that when you start listing off all of those characters I'm like I don't I can't IM granted I'm not a Hollywood screenwriter but I can't immediately see how they're going to organically fit her into the story sure given that we have the two biggest Titans fighting um and you know you might I'm this is no knock against Wonder Woman but she's not Superman she's not Batman but she's not on that caliber of of character I'm sorry as far as the stories are concerned like that story is going to be a lot more uh uh impressive to watch than kind of shoehorning her in so I hope she's there in a way that makes I think she's there to have those Hulk moments of Av the original Avengers I don't think she's going to be overused I I I mean I think from what we've seen there's it looks like Diana Prince in her white dress shows up with this cocktail thing with Bruce they she knows that he's Batman he knows that she's",
      "start": 752.12
    },
    {
      "text": "overused I I I mean I think from what we've seen there's it looks like Diana Prince in her white dress shows up with this cocktail thing with Bruce they she knows that he's Batman he knows that she's Wonder Woman recording Entertainment Weekly already at that point so they've already had some kind of introduction back here we don't know oh didn't know that I would imagine I mean if I'm and I'm not a Hollywood script writer obviously cuz my movies would be so your mov would feature only Portillo it would just be you would reenact gone with a woman P show them to Hope Portillo no he's like chew toy in his mouth is per I wouldn't I mean it's one of those where I can totally see it be that she showing up in the beginning of the movie to try to play Both Sides like I I'm here to meet Superman this other being that has powers on my level you know what I mean and I'm then I'm I I don't know how she gets involved with Batman but maybe they're all together in the first thing they I know how",
      "start": 789.36
    },
    {
      "text": "this other being that has powers on my level you know what I mean and I'm then I'm I I don't know how she gets involved with Batman but maybe they're all together in the first thing they I know how she gets involved whoa do Justice League style then there's the middle section of them her trying to talk Batman down at this event and then I think yeah it's her trying to break up the fight that we see at the end POS I think she would I wouldn't even be surprised if she's been clued into what Luther's really up to and like how that's skewing everything and and that's the thing I mean we have to we have to in order for this to really work in my brain that fight is not the main focus of the film that fight happens halfway through the film maybe it goes into the third Act of the film where they have to fight the real problem which is Lex Luther, right? Or they have to fight whatever Lex Luther has put um uh in in the works so that we can set that up for the actual Justice League see I think",
      "start": 829.8
    },
    {
      "text": "have to fight the real problem which is Lex Luther, right? Or they have to fight whatever Lex Luther has put um uh in in the works so that we can set that up for the actual Justice League see I think that's the bigger thing is I I I wouldn't be surprised if the fight takes place you know second to third act where that that's the big finale it's lead up to like the of like whatever Luther's really been working on to then jump off to the next thing Aquaman being tortured or whatever that's that's possibility um but taking a step back how do we feel I mean there's a lot of stuff in this and one of the big things we haven't talked about yet is is seeing the Robin suit and seeing the The Joker letters written all over it I jokes on you yeah jokes on you I mean that I mean obviously they're clearly tying that in with the with the Suicide Squad we and we obviously at this point we've seen Jared Leto as the Joker and we can talk about that he'll have to wait for our reacts on that for when we",
      "start": 864.64
    },
    {
      "text": "tying that in with the with the Suicide Squad we and we obviously at this point we've seen Jared Leto as the Joker and we can talk about that he'll have to wait for our reacts on that for when we talk about it with when I talk about with Tim but spoilers I thought it was really good yeah yeah um so I think that they're going to nail The Joker character and this world for the first time to me is starting to be really fleshed out I'm really starting to get a sense that this is the DC expanded universe or whatever they're calling it well what's cool is that when I'm blanking on his name who's the guy in Suicide Squad in charge of it all uh Will Smith no not no no not the not the character the director of oh uh uh follow him on Twitter tweets images all the time we're both up you open your IMDb anyways when he tweeted out uh the Jared Leto photo and said you know happy holidays from The Suicide Squad back then Zack Snyder responded with hahahha jokes on you and somebody screencapped that",
      "start": 908.08
    },
    {
      "text": "anyways when he tweeted out uh the Jared Leto photo and said you know happy holidays from The Suicide Squad back then Zack Snyder responded with hahahha jokes on you and somebody screencapped that and tweeted that at me and I was like David a there it is uh sorry Mr I know you're watching this as well yeah he he and Zach right now I imagine just be like I don't care what anyone else thinks what do Greg and Nick think of the trailer the big Superman fan on the internet the biggest movie fan on the internet knocked out of the par knocked out of the park great trailer um so I like that there's that interaction you know what I mean and and I've only seen I saw the shaky Suicide Squad trailer once is Batman in that I thought I saw one frame of Batman there there actually I think there's a couple frames if I'm not mistaken I watched it on Tim's iPhone but that's bigger than my TV so I should know um yeah there's the shot where he's on a cop car like okay cool and so that's I mean that's",
      "start": 949.48
    },
    {
      "text": "frames if I'm not mistaken I watched it on Tim's iPhone but that's bigger than my TV so I should know um yeah there's the shot where he's on a cop car like okay cool and so that's I mean that's another great great great decision because that's something that necessarily um even Marvel hasn't done yet right like Marvel hasn't done a movie where uh you it's about side characters and then all of a sudden Iron Man's just there like you know what I mean and then Captain America's just there for like as a side character right right he's like a couple shots yeah you know what I mean like that's and they will eventually they'll get to that place where they're they're having these characters the importance of the characters is not going to be as important cuz I brought up all the other characters with them but that's really really really ballsy to have um thought I muted this already I just want to make sure as it goes I haven't missed anything yeah that's it's really ballsy to make the",
      "start": 987.44
    },
    {
      "text": "with them but that's really really really ballsy to have um thought I muted this already I just want to make sure as it goes I haven't missed anything yeah that's it's really ballsy to make The Suicide Squad and throw Batman in for a few shots or have him be like he was in the animated movie where it's like he's not the main focus but he is still helping to drive along the plot and help them out a little bit yeah um having said that the interesting thing is and I'd have to wait till The Suicide Squad movie uh this trailer actually gets released so I can see the visual of it but the aesthetic of it looks starkly different than this movie it's way more hardcore it's way more gritty it's way the whole point of like where I'm like I think I think that when you appe when you take how dark and how everything else is going to be you know how real in quotes they're trying to make the DC Universe compared to the Marvel Cinematic Universe you need that you need that different thing now the big",
      "start": 1024.28
    },
    {
      "text": "how everything else is going to be you know how real in quotes they're trying to make the DC Universe compared to the Marvel Cinematic Universe you need that you need that different thing now the big thing we haven't talked about from this trailer what do you think is happening with the Superman Army and desert suit Batman see I don't know I see that was one of those things where I'm like like we see that God damn I wish I want I want those back muscles so badly he's just pulling the tire are you kidding me I'm just hey Tim can we get a tire can you get me tire we don't have anywhere to put the tire don't get the tractor tire we can put it right there we can put it right by Kevin where you going to pull it well Kevin can sit outside I'll pull it down the street so that Johnson can that I would love to see I would love to see you pull us down that would I would get it about a half a foot and die probably um I also like the minor updates to the to the uh to his costume by the way we",
      "start": 1058.52
    },
    {
      "text": "I would love to see I would love to see you pull us down that would I would get it about a half a foot and die probably um I also like the minor updates to the to the uh to his costume by the way we were talking about earlier God that shot's beauti all right now now I'm distracting you my questions uh what was your question I want here's my here's my prediction for maybe why everything's getting totally crazy right I wouldn't be surp the Superman Army everybody wants to talk about right these guys who have the Superman logo on their side they kneel when Superman comes into the one frame and walks by right and then they we're showing them beating the out of desert Batman that was them interesting I didn't I I didn't I didn't catch it let's well if you you cannot get distracted by the rest of the trailer I can God Dian Lane's so good so good I love Dian Lane these people are just like random what they're like people are like random what well like the the the marig people I just assume",
      "start": 1095.44
    },
    {
      "text": "of the trailer I can God Dian Lane's so good so good I love Dian Lane these people are just like random what they're like people are like random what well like the the the marig people I just assume are random like uh uh people that are like praying to him right like that's oh I still I still think those are yeah some some some group he saved right or something like that or maybe it's maybe he just saved a Halloween party saved maybe Halloween he was like so there's clearly something happening right we've got the body of Zod that's being wheeled down a military um installation install which I think again probably this here's here's the Superman guys genu flecting I so you want here's what I'm going to tell you as I think is happening these Superman dudes with the Army patch right who I believe are the ones Bea out beaten up on Batman are all connected with Luther and connected with Zod I think Luther has made an army of Superman enforcers that he's trying to pass off as Superman's",
      "start": 1133.8
    },
    {
      "text": "believe are the ones Bea out beaten up on Batman are all connected with Luther and connected with Zod I think Luther has made an army of Superman enforcers that he's trying to pass off as Superman's armed guard to get the government involved so you think he's doing that in order to kind of stoke the fire with the government totally we have now he's taking over the world we have to we have look what he's doing out here in the desert or whatever you have to give body you have to tell me how to I'll reverse engineer it and make something powerful I bet he stolen Zod's body I would think but yeah well I don't know those were military people that were Wheeling it yeah but but I'm say yeah see these are all the Superman guards shooting at Batman as he kicks the sh they are the Superman guards see so I'm saying that this is Luther's grand plan one of them at least he's got this installation he's got these Superman guards he's got Zod's body and he's trying to convince the government that",
      "start": 1177.16
    },
    {
      "text": "see so I'm saying that this is Luther's grand plan one of them at least he's got this installation he's got these Superman guards he's got Zod's body and he's trying to convince the government that Superman is out to kill everybody and this is his private military and probably these guys you know they genu when the Superman shows up that Superman I'm saying that's Superman's first time ever showing up they think that they're working for Superman they don't know they're working for Luther they think they're working on the orders of Superman to make this new world government kind of thing that makes sense that's great I mean if that's Thea and that's that's the thing if that's the case I'm 100% behind it yeah that's I like that they're going more you know I like that you can tell that people that that are either writing this movie or or uh making this movie watched the Superman animated series and watch that Luther and and know that Luther is not necessarily someone who's going to go",
      "start": 1209.88
    },
    {
      "text": "that that are either writing this movie or or uh making this movie watched the Superman animated series and watch that Luther and and know that Luther is not necessarily someone who's going to go out there and and make uh an island of his own made of kryptonite he's going to he's he's more the kind of guy that's going to um you know be behind the scenes making sure that he stays in power regardless of you know what's going on yeah sorry not I am oh that's that's sh make there's nothing else I missed here now what we last parting thoughts a lot of people gave him for the red the red capes are coming the Red Cap coming suck a dick you know what I mean like internet in General's a bunch of jerks and I like that was my thing is like somebody and like I don't mean to be like if you didn't the Jesse Eisenberg's portrayal I I thought it was fine like I'm totally fine to see this but like a lot of people were like this is exactly what I was afraid of like he's like social network Lex Luther",
      "start": 1247.68
    },
    {
      "text": "Jesse Eisenberg's portrayal I I thought it was fine like I'm totally fine to see this but like a lot of people were like this is exactly what I was afraid of like he's like social network Lex Luther I'm like okay cool but I we didn't like it when he was Richard Donner Lex Luther Kevin Spacey yeah exactly so I mean like let's let him have new motivations I I and I know that I always get on this bandwagon where I you know this The Joker photo pops up my first impression is I don't like this then I have that reaction of but don't be like everybody else like it a shot see it in context you have 75 years of The Joker as you liked them let's let somebody do something cool with them like that's the biggest thing for all of us is not to KN Joker action freak out and also let's remember if they did if they were to just make the exact same Joker over and over again and the exact same Lex Luther over and over again it wouldn't be any better it wouldn't be as impactful as if you got to give",
      "start": 1287.88
    },
    {
      "text": "did if they were to just make the exact same Joker over and over again and the exact same Lex Luther over and over again it wouldn't be any better it wouldn't be as impactful as if you got to give people the leeway and and and the the string to go out and try something new and try something cool and make it their own otherwise it won't be unique and it won't be good yep yeah ladies and gentlemen what did you think of the Comic-Con trailer for Batman v Superman dawn of Justice let us know in the comments and please share this video with your friends so they can come tell us why we're wrong about Lex Luther and of course keep coming back here to youtube.com/ kindof funny for all your comic book movie news well not news but like needs us follow your needs us yelling about comic tril put it in your body put us in your body Kinda Funny put us in your body",
      "start": 1327.88
    }
  ]
}
