{
  "id": 999,
  "video_id": "ym_kUrlcZEY",
  "show_name": "Gamescast",
  "hosts": [],
  "title": "What Games Should Be Annualized? - Kinda Funny Gamescast Ep. 26 (Pt. 3)",
  "description": "We discuss which game series should be annualized.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
  "published_at": 1436360401,
  "duration": 916,
  "transcript_chunks": [
    {
      "text": "All right topic number three comes from Patreon from our boy John Yuling. I don't know how to spell or pronounce U H L I N G. I'm gonna go Uling. Euling. Yeah, I would say. All right cool. John Euling, it's a long one. Shua spoke about not being a fan of annualized series at Dice 2015. However, there's no denying that companies like Activ and Ubisoft make a lot of money doing so. I.E. Call of Duty and Assassin's Creed. Despite being money makers, the rush to make yearly deadlines and corporate obligations brings into question the quality because of bugs as we've seen with Assassin's Creed Unity or a perceived lack of innovation or stale gameplay and story from previous editions like Call of Duty Ghost. Are there any series that you envision being on the cusp of annualization which your beloved series of games would you love to see annualized with the caveat that its normally extremely high standards may take a hit in order to reach the yearly quota for example instead of 9 to 10 scores every three",
      "start": 8.24
    },
    {
      "text": "games would you love to see annualized with the caveat that its normally extremely high standards may take a hit in order to reach the yearly quota for example instead of 9 to 10 scores every three years it would generally get sevens to eights with occasional sixes and nines for stale excellent in iterations. I think that's actually a good way to look at it. Thanks and keep up the great work. PS to Greg Mi Z zou there you go. Is anything on the cusp of annualization? I mean no, right? I mean what would we think would be on the cusp? You figure I'm thinking like the Assassin's Creed model, right, where it's different switching off. It seemed for a while that they were trying to do that with Arkham, right, and it wouldn't have been annual annual but when they brought WB Montreal into the fray people were like oh now we're going to start getting an Arkham game every year every two years or whatever or DC game you know what I mean like even if it wasn't Batman exactly exactly exactly and now they're now WB",
      "start": 51.24
    },
    {
      "text": "oh now we're going to start getting an Arkham game every year every two years or whatever or DC game you know what I mean like even if it wasn't Batman exactly exactly exactly and now they're now WB Montreal of course this week was announced that they're that these things are out there hiring for a new IP so we'll see what that means exactly. Um but on the cusp I mean you have to talk about a franchise that's super successful and most people are smart enough now I feel to know that that's what he's describing it was it Tom John Ying what John's describing there is the fact the matter if you go to this annualization scale you start to lose quality you start to tire out the audience yeah and so how do you make that work I really feel like and Colin you can correct me if I'm wrong Tim obviously too I'll allow it for once Assassin's Creed feels like the last franchise that kind of jumped on that annualization train and now it's like we're out of the station you can't I don't think you can",
      "start": 97.04
    },
    {
      "text": "too I'll allow it for once Assassin's Creed feels like the last franchise that kind of jumped on that annualization train and now it's like we're out of the station you can't I don't think you can pull that off again and do it mhm. I mean it's interesting because I feel like we're in a a Renaissance of the annualization thing it's a very different type now it's way more important but back in like even the PS2 era there was so many games that they were annualized like in addition to the Madens and stuff like that like Tony Hawk Need for Speed like these games just happened every year you know um and then eventually that kind of that style died out for a bit and then it did come back with Call of Duty and Assassin's Creed Guitar Hero and like oh yeah exactly Guitar Hero Rock Band and all that so I don't know do you have any good examples no I mean where my mind go where mind went in terms of recent is Assassin's Creed I don't see anything jumping aboard that because I don't think that the model",
      "start": 134.12
    },
    {
      "text": "know do you have any good examples no I mean where my mind go where mind went in terms of recent is Assassin's Creed I don't see anything jumping aboard that because I don't think that the model is necessarily sustainable I do would disagree with what he's saying that you exchange quality uh for regularity because that doesn't necessarily have to be true and I think Call of Duty is actually an example of that being true um Activision has the means to have three Studios plus basically every one of their other Studios jump in and out to help with Call of Duty in such a way that the same Studio isn't responsible for the game every year because that would not be possible so Call of Duty is on a three-year Dev cycle which is normal for a game three years is a normal is a normal cycle for for the creation of a game so um you don't necessarily have to sacrifice it if you have the means in which to create top tier AAA games which they which whether you like dislike or like Call of Duty",
      "start": 176.32
    },
    {
      "text": "for the creation of a game so um you don't necessarily have to sacrifice it if you have the means in which to create top tier AAA games which they which whether you like dislike or like Call of Duty they're not bad games yeah. Um not even not even remotely are they bad. Um they I've said before and I'll say it again Call of Duty has the best gun play of any game like they've just totally nailed it why like why companies don't just copy the way Call of Duty feels is you know totally beyond my understanding but um what he is right about is the staleness factor and I think that that is the big concern with a lot of Publishers because Call of Duty sales are not lowering but they are plateauing and what people have seen I think in the industry over the last two years or so is a great example of what happens when you leave and disappear and then reappear with the game and that game is Grand Theft Auto 5 and which essentially was annualized it was annualized and it was was being done by a lot",
      "start": 215.24
    },
    {
      "text": "what happens when you leave and disappear and then reappear with the game and that game is Grand Theft Auto 5 and which essentially was annualized it was annualized and it was was being done by a lot of the same teams too and I think that they were extracting as much out of they that they could out of that engine and they saw great commercial and financial success but what they didn't see is what they saw with Grand Theft Auto 5 which was a ubiquitous crossover game Grand Theft Auto phen exactly Grand Theft Auto 3 and Vice City and and San Andreas were great games and people enjoyed them outside of the gaming realm mostly because PS2 was so was selling so well by the time San Andreas came out over 100 million PS2s were out there so it was it was it was volume right and that's why people learned it with GTA 4 when GTA 4 came 2008 there were not that many consoles out there there were maybe 40 million at that time yet GTA 4 was a phenomenon that pushed Hardware what Rockstar saw was like",
      "start": 258.28
    },
    {
      "text": "it with GTA 4 when GTA 4 came 2008 there were not that many consoles out there there were maybe 40 million at that time yet GTA 4 was a phenomenon that pushed Hardware what Rockstar saw was like this is the way we should be doing things making big meaty games that we can stand behind we invest a lot of money in the front we get a lot of money behind it uh and then we get a lot of money back afterwards plus we make really meaty DLC which they did with the ballad gay Tony and the loss in the dam which were great pieces of DLC they do this for five I think they will I think that they're just focusing more on GTA 5 but then but then they just went quiet again mm and then they came back and they made all of their money back in one day from the development of Grand Theft Auto 5 plus hundreds of millions of dollars presumably in profit in a very short amount of time and that probably raises the bells that UB solved in Activision being like we don't have to support all these Studios Rockstar",
      "start": 297.4
    },
    {
      "text": "millions of dollars presumably in profit in a very short amount of time and that probably raises the bells that UB solved in Activision being like we don't have to support all these Studios Rockstar North is the studio that's making these games and we can just support a three or four or 500 person team plus our our satellite teams and our PR people and and our home office and all that kind of stuff and then make a lot of money on the back end if we're moreid and so I think what we're seeing is not necessarily a Renaissance of annualization but the exact opposite which is the reconsidering of annualization that has happened for probably the last 10 years or so and a way that they can pull back the Reigns a little bit and be like we can be smarter with our money by investing more in the front and getting more in the back because this is more of an event and that's why Call of Duty is plateauing it's not that the sales aren't going down but they're not going up and that should be a",
      "start": 337.28
    },
    {
      "text": "front and getting more in the back because this is more of an event and that's why Call of Duty is plateauing it's not that the sales aren't going down but they're not going up and that should be a worrying sign because a lot of these Call of Duty games are already in development um but see I think that's that's the way they look at it though is it's like they're not putting all their eggs in that basket that's just another thing they do so it's like whereas you know GTA that's that's it like they they just do that and that's their event or whatever but then it's like with this I feel like with Call of Duty and Assassin's Creed like obviously Ubisoft makes a ton of different games you know so it's like they can annualize they have they have this cash cow the reliability to get the money here but then have the other things to get the money there and there you know and it's just like there's not too many uh devs that have that kind of reach but Ubisoft stop acting they are you know sure",
      "start": 373.88
    },
    {
      "text": "here but then have the other things to get the money there and there you know and it's just like there's not too many uh devs that have that kind of reach but Ubisoft stop acting they are you know sure but I think that Assassin's Creed is the canary and the coal mine I think because Assassin's Creed's big and it's going to be profitable and it's going to do well this year and it looks fun I'm not going to play it but it looks fine the the but here's the thing is that I think demonstrably if not anecdotally uh excitement for Assassin's Creed is going down and they're locked into this now and the series is clearly coming to an end as well because it has to I mean they're getting to almost to Modern Day the game the game has to wrap up at some point then we go to space yeah right they probably will I think that analizing Assassin's Creed was actually a huge mistake because Assassin's Creed in my opinion I want to put that in my opinion was never good enough to justify it being out every",
      "start": 408.52
    },
    {
      "text": "will I think that analizing Assassin's Creed was actually a huge mistake because Assassin's Creed in my opinion I want to put that in my opinion was never good enough to justify it being out every year and so there's like two tiers of Assassin's Creed games the ones that people accept and then the ones that are like the inet right that people like well Brotherhood wasn't really an Assassin's Creed game I'm like well it was an Assassin's Creed game you know um what would have Assassin's Creed looked like if there were only four of them and they were **** awesome you know people stopped and focused and let's see what we can do with this push the boundaries exactly and like I think Ubisoft yeah they make money and and they they I appreciate their cander and saying like we make these games every year because the market demands them every year and that's true but what could Assassin's Creed sell 15 million or 20 million copies if it disappeared and is that a relevant thing to ask",
      "start": 447.36
    },
    {
      "text": "games every year because the market demands them every year and that's true but what could Assassin's Creed sell 15 million or 20 million copies if it disappeared and is that a relevant thing to ask yourself because then you don't have all these dueling Studios that you own that can be making other games doing the same thing and I think that Ubisoft might be taking a hint at this because I was surprised to not see Watch Dogs 3 this year which is clearly in development and I'm not saying it's coming out this year but I'm surprised I didn't see it at E3 and this might be showing a more careful approach to these games a more judicious use of assets and resources which I think Sony is really good at doing um which is why you will never see an annualized they only have one annualized game which is MLB um and that is a studio Sony San Diego that is totally dedicated to that game um and this also brings up a point that I brought up to rammer at EA Sports when we were talking about NHL 16",
      "start": 485.76
    },
    {
      "text": "is MLB um and that is a studio Sony San Diego that is totally dedicated to that game um and this also brings up a point that I brought up to rammer at EA Sports when we were talking about NHL 16 which was are these games eventually not going to be annualized too in other words are you going to make a platform we often talk about it with Gran Turismo which I think would be a game as platform and I think we're going to see that um and he was like that is the you know I I'm paraphrasing but he basically said in the interview like that is kind of what we think is going to happen and so I think the annualization thing is collapsing I don't think you're going to see it it's not like it's not an earthquake that's going to bring it all crumbling down now you're going to start seeing diminishing returns because there are more games to buy there are better quality games to buy and when something like um uh what's a good example like Uncharted 4 is a great example when Uncharted 4 comes out well",
      "start": 520.28
    },
    {
      "text": "because there are more games to buy there are better quality games to buy and when something like um uh what's a good example like Uncharted 4 is a great example when Uncharted 4 comes out well it's been four years since we saw Uncharted you know and that means something to me I'd be less excited about Uncharted 4 if I or if it was really Uncharted six and I just played three or four and five you know last year and two years ago same thing with Fallout right we all flipped out to finally have Fallout 4 announced and know something about Fallout well because it's been gone forever we're excited to see it again whereas Assassin's Creed like when Kotaku will leak Assassin's Creed you're like all right well I don't need to read it because I knew this was coming excited where's it going to be exactly where is it what's the time all right cool done and there is a big difference in like there's a strata of between the the developers and and really the Publishers that seem to treat their IP",
      "start": 556.68
    },
    {
      "text": "exactly where is it what's the time all right cool done and there is a big difference in like there's a strata of between the the developers and and really the Publishers that seem to treat their IP with greater care and I think Bethesda is a great example of that and then the uh the stakeholders that are that are trying to make as much money as as much as humanly possible as soon as humanly possible just Activision and I'm not saying one is better than the other but I'm saying that people feel much more positively about Bethesda than they do about Activision because Bethesda doesn't shove their games down people's throats every year um Bethesda could easily take the engine for Skyrim could have taken the engine for Skyrim given it to three different Studios and been like you make Elder Scroll six you make Elder Scrolls seven you make Elder Scrolls eight your game comes out 2015 your game comes out 2016 your game comes out 2017 they could easily do that they are **** students that",
      "start": 593.24
    },
    {
      "text": "Scroll six you make Elder Scrolls seven you make Elder Scrolls eight your game comes out 2015 your game comes out 2016 your game comes out 2017 they could easily do that they are **** students that fall all over themselves to make a **** Elder Scrolls game or a Fallout game but they don't do that you know they did that with New Vegas and New Vegas was a game that took two years or three years I guess to make and it was awesome and then they just disappeared you know you have to kind of hit and run like that to to treat your IP with care I think Ubisoft is certainly is certainly starting to bend the curve towards Activision in a way that makes me a little bit uncomfortable because I still think that they're the most real regular AAA publisher out there um I think you can learn a great deal by by the more judicious use of IP uh that you see from something like Microsoft with Halo or Gears I don't know it's it's a d it's a dangerous game to play to oversaturate and annualize things",
      "start": 628.64
    },
    {
      "text": "deal by by the more judicious use of IP uh that you see from something like Microsoft with Halo or Gears I don't know it's it's a d it's a dangerous game to play to oversaturate and annualize things in the aleaa space I do think that there's room in the A space to annualize games um yeah this question of like what should be annualized and whatever I think it's anything I think it's when we get away from story and you talk about gameplay it's like you always talk about Castlevania right if they were to put out scrolling Castlevania every year you'd buy them they did and and that's the thing is that they did so we saw it we saw an action and it was **** awesome it was glorious you know it was a glorious time to be a DS owner and a GBA owner but then they stopped and and and whatever and so there are games that exist outside of the aleaa realm that could be annualized because it is about gameplay the experience is gameplay the experience is not necessarily story Mario games that's how",
      "start": 663.76
    },
    {
      "text": "there are games that exist outside of the aleaa realm that could be annualized because it is about gameplay the experience is gameplay the experience is not necessarily story Mario games that's how I feel about them and it's like it's I say that and then everyone **** about at the same time oh there's too much Mario but it's like whatever dude it's an annualized game like cool just keep giving me it with Mario Maker we'll see that yeah I mean for me I mean like just to Rattle off things of course Patapon for me because I'm just playing that for the fun so do that right so Patapon uh I would think about Shovel Knight as a recent example Hotline Miami Rogue Legacy I would love a Rogue Legacy every year you know what I mean with a new dungeon New Castle to go down and take every down and do stuff like that like those games where it's like I don't give a flying **** about the story I'm just here to play and have fun playing that's what I want just give me that yeah cheap games that",
      "start": 701.44
    },
    {
      "text": "do stuff like that like those games where it's like I don't give a flying **** about the story I'm just here to play and have fun playing that's what I want just give me that yeah cheap games that are cheap to make with low overhead that only have to sell $100000 units to become profitable at $20 a piece is really the way to go and I think that that's totally possible but again it conf it conflicts with the annualization as a platform as opposed to annualizing a product and and I think that this is a conundrum that needs to be overcome by some Brave publisher and I still think that the publisher that can do it and and I think might do it first is EA um because I think they have to do the math to say like we don't really need all of these Studios making these games every year we can we can take EA Canada to have them spend three years on a beautiful hockey game that we can then support after that and they don't need to worry about getting these things in a box they make people don't",
      "start": 735.76
    },
    {
      "text": "take EA Canada to have them spend three years on a beautiful hockey game that we can then support after that and they don't need to worry about getting these things in a box they make people don't appreciate how hard it is these guys get a lot of **** it is really **** hard to make a video game and they're making a game in nine months nine months same with the Madden team all these sports teams it's you know yeah San so do San Diego the guys do Madden the guys do FIFA that like people like to **** on EA but the fact of the matter is like those those games are really hard to make it's just unfortunate that those developers are put in that position where they have to make sacrifices as they did with NHL 15 uh last year which was **** awful on uh PS4 and Xbox One in terms of feature set because they didn't have time so imagine a world where EA Canada had time and they can support a product for years and not have to worry about churning games out on an annual basis it seems like",
      "start": 777.76
    },
    {
      "text": "set because they didn't have time so imagine a world where EA Canada had time and they can support a product for years and not have to worry about churning games out on an annual basis it seems like the annualization thing is like I said certainly going to collapse not necessarily due to financial pressures but due to the the the kind of the dir of creativity when you have that kind of pressure and I think Rockstar is the proof in the pting man like they Grand Theft Auto is is a **** phenomenon because they do not **** with it and they treat it with care and they could so easily **** with Grand Theft Auto like I just said with Bethesda and that and the engine for Skyrim and the engine for Fallout 4 they could have been like here you go make a Grand Theft Auto game you have two years you know Grand Theft Auto Chicago Las Vegas yeah and they just don't do it and and they **** make an enormous amount of money you know so I don't know it's a complic question it's a good question",
      "start": 818.0
    },
    {
      "text": "you know Grand Theft Auto Chicago Las Vegas yeah and they just don't do it and and they **** make an enormous amount of money you know so I don't know it's a complic question it's a good question though very good question thank you so much man all right Yuling John Yuling hey everybody it's me Greg Miller and I wanted to let you know Comic-Con is coming up and kinda funny is going to be there so if you're at San Diego we have a bunch of stuff you can come do with us and you don't even have to have a Comic-Con badge on Thursday we're going to polite Provisions we're doing a meet and greet there 5:00 p.m. you don't need a Comic-Con badge you do need to be 21 don't blame me those are the drinking laws in the United States of America Friday we're doing the GameOverGreggy show at Petco Park is part of geek and sunry Studio stage no Comic-Con badges required we're doing that at 300 p.m. and then I'm moderating a whole bunch of Comic-Con panels if you do have a Comic-Con badge so come",
      "start": 858.88
    },
    {
      "text": "is part of geek and sunry Studio stage no Comic-Con badges required we're doing that at 300 p.m. and then I'm moderating a whole bunch of Comic-Con panels if you do have a Comic-Con badge so come hang out with me in the convention center all the details are up on kindafunny.com news so head over there for the full Rundown",
      "start": 898.36
    }
  ]
}
