{
    "id": 117,
    "video_id": "_yKPqSJpv1Y",
    "show_name": "Gregway",
    "hosts": [
        "Greg Miller",
        "Portillo"
    ],
    "title": "Where You Should Start with Comics  - Gregway Episode 5",
    "description": "Looking to get into comics? Here are Greg's fan-based picks -- but be sure to leave yours so he knows what to pick up.\n\nSUBSCRIBE/LIKE/SHARE\n\nLeave your questions for Greg in the comments and check back every Wednesday and Friday to see what he's saying.\n\nSubscribe to Greg's channel: http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nOur Merch Store is live: http://www.districtlines.com/gameovergreggy\n\nThe Vlog playlist: http://www.youtube.com/playlist?list=PLOlEpGVXWUVv1g9oZi6O95CwRHQd0ulT6\n\nSubscribe: http://www.youtube.com/user/GameOverGreggy\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy",
    "published_at": 1377694837,
    "duration": 531,
    "transcript_chunks": [
        {
            "text": "What's up, everybody? Welcome to another Gregway. Every Wednesday and Friday, I answer a question submitted by you either through video response, Twitter, or comments on these Gregway videos. Then I post them every Wednesday and Friday. Have I said Wednesday and Friday enough? Subscribe. Today's question comes from Ash. Ash says, \"Greg, what comics would you recommend for someone who is new to comics like me?\" Woo, Ash, that's a huge question. I don't even know much about you other than your name is Ash. See, comics are just like games right now, and that's why I love them. Like I love games, there is a comic for every mood you are in. I always talk about the fact that, you know, when I talk about games that I'm a story horror, right? It's the same with comics. If you want comics just about people's daily lives and what they're doing, those exist. If you want comics about people fighting giant lizards, those exist. If you want more and more Walking Dead stuff, of course, they're still making that. So without knowing",
            "start": 0.16
        },
        {
            "text": "what they're doing, those exist. If you want comics about people fighting giant lizards , those exist. If you want more and more Walking Dead stuff, of course, they're still making that. So without knowing you, I was going to take some shots in the dark here about stuff I really like. But of course, if you want expert opinions, remember my day-to-day job is not reading comics. I just get to read what I want to for fun. What I hear is great, but where I get all my comic news is IGN, of course. I like IGN quite a bit, but Joey runs a dynamite team over there that reviews everything every week and can really keep you looped in. And most of the time I just end up texting him if I want to know something's like new really good. I know it's new if I see something new that I think would be interesting. I usually anyways read IGN. So we'll start with the fact that I'm a huge Superman fan. Bam , right there. There he is, the Man of Steel. And for me, my favorite Superman story recently that you can go out and get really",
            "start": 40.52
        },
        {
            "text": "read IGN. So we'll start with the fact that I'm a huge Superman fan. Bam, right there. There he is, the Man of Steel. And for me, my favorite Superman story recently that you can go out and get really easily is Superman Last Son. I'll put it up like I usually put my graphics up there. Uh, what's cool about Superman Last Son, of course, is that one of the writers on it, of course, Jeff Johns there doing it, but it's Richard Donner is the real story. Richard Donner directed, uh, the first Superman movie, the first Christopher Reeve movie. Uh, obviously he made some of Superman 2. It's a it's a long, long thing if you really want to get into it. But what I like the most about it is that for for me, comics are cool and I like ongoing comics fine, but this is the whole problem we get into, right, with people like yourself, Ash, who are, I want to get into comics, but how do I jump into a comic series if it's at issue 22? How do I jump into a series if it's at 122? How do I catch up with what's happening? I like story arcs",
            "start": 76.4
        },
        {
            "text": "Ash, who are, I want to get into comics, but how do I jump into a comic series if it's at issue 2 2? How do I jump into a series if it's at 122? How do I catch up with what's happening? I like story arcs that are self-contained and you really just need to come in with a base understanding of who it is, right? What's awesome about Last Son is that it's picking up with what I like. Uh, Clark and Lois are married. Uh, Superman Superman, we get all of these things. You don't need to know it. It's honestly, you could read it and knowing it's from Richard Donner, you could just see it as a sequel to the Superman movies he already made. It reads very much like, okay, guess what, this is going to be the a sequel to Superman 2 or sequel to Superman one or it could just spiral out in there and you don't have to know too much about it. Now granted, there's things like the Kents are still alive in it, but it reads excellent even if you don't know much about Superman other than the fact that he always loves Lois, right?",
            "start": 118.64
        },
        {
            "text": "too much about it. Now granted, there's things like the Kents are still alive in it, but it reads excellent even if you don't know much about Superman other than the fact that he always loves Lois, right? It's a great place to jump in. Uh, Zod comes back. Uh, there's a new Kryptonian son who shows up that Clark and Lois adopt. They name him Christopher, of course, for Christopher Reed and then they get get to go out as the shenanigans happen when more Kryptonians show up and what exactly is going to happen to Metropolis, to the world, to Christopher with Zod back in town. Another one I'm going to toss out to you is Injustice Gods Among Us. Yes, it's a tie-in to the video game that already came out earlier this year, but the reason I like it is that it's telling an awesome alternate history of the DC Universe online or I guess just not DC Universe on the DC Universe telling an awesome alternate take on the DC Universe, right, where what would happen if Superman decided he knows better than everybody else",
            "start": 157.8
        },
        {
            "text": "online or I guess just not DC Universe on the DC Universe telling an awesome alternate take on the DC Universe, right, where what would happen if Superman decided he knows better than everybody else and he's going to rule the world in his image be on top of everything . Uh, what's cool about it is that since it's a digital comic book, most time you can buy it collected in books now, but you can just go to Comics Aly and download them there for 99 cents every Tuesday. Since it's a digital book, since it's just basically taking the sandbox of the DC Universe or the play box of the DC Universe and taking different things out and doing with them, they get right to the action. Every issue something crazy is happening in it and that is like that instant gratification, you know what I mean? Here's 99 cents, here's an awesome little story about Superman, about Nightwing, about Batman, about whatever you get to jump in and see all these crazy relationships kind of evolve and change and where's it all going? If",
            "start": 201.52
        },
        {
            "text": "an awesome little story about Superman, about Nightwing, about Batman, about whatever you get to jump in and see all these crazy relationships kind of evolve and change and where's it all going? If you've played the game, you know, but the game, this feels bigger than the game, you know what I mean? I played the game, I loved the story mode, thought it was great, but I'm still interested week to week to find out what is going to happen, how are we going to get to that point. It's cheap, it's fun, you should read it, Ash. Now for my money, the best ongoing comic in the new 52, of course, DC Comics rebooted the whole DC Universe, made this new 52 thing and they made it so that people like you, Ash, could jump in, read comics, understand what was happening a bit better. Uh, the best ongoing one and where you should start with issue one and just keep on reading is Batman by Scott Snyder. Uh, just an amazing, amazing book. Now the funny thing about it, of course, is that here in the new 52, the the Batman, the Bat books are",
            "start": 239.84
        },
        {
            "text": "with issue one and just keep on reading is Batman by Scott Snyder. Uh, just an amazing, amazing book. Now the funny thing about it, of course, is that here in the new 52, the the Batman, the Bat books are the ones that changed the least, right? Bruce Wayne still Bruce Wayne, he still had all the Robins, he still has a son named Damen. These things didn't really change when they rebooted the universe, whereas like, you know, by comparison, Superman, man, his powers evolved over time, parents are dead, him and Lois have no connection anymore. They went from being married to nothing. Bruce Wayne still pretty much Bruce Wayne and whatever. If it ain't broke, don't fix it. These books are great and you should jump in and read all of them. Uh, fascinating story with the Owls, the Court of Owls. It's you don't know anything about it because they invented it for this, I think. Don't flame me on the internet and it's fantastic. You should read it. Then he gets to the Joker stuff. So good, so good. Read it, Batman, Scott Snyder. So I'm",
            "start": 278.72
        },
        {
            "text": "about it because they invented it for this, I think. Don't flame me on the internet and it's fantastic. You should read it. Then he gets to the Joker stuff. So good, so good . Read it, Batman, Scott Snyder. So I'm throwing out a lot of superhero stuff. Maybe you don't care about superheroes. Again, you gave me no context, Ash, so I'm just trying to do the best I can. I'm telling you what I love about comics, the comics I pick up every week. Uh, a big one here that has nothing to do with superheroes, right? Little Depressed Boy. This is from Image. Um, it was monthly for a while. Now they've kind of backed off until they can get on a really good monthly schedule, but there's so much good stuff out there already. If you're just jumping in, go pick up these books and do it basically. Uh, Little Depressed Boy is this, you know, I don't know, 20 something, right, depressed kid. Uh, he looks like a doll for some reason. They never really really explained that, but, uh, every nobody sees him as the doll, they see him as a person. He gets in",
            "start": 317.08
        },
        {
            "text": "don't know, 20 something, right, depressed kid. Uh, he looks like a doll for some reason. They never really really explained that, but, uh, every nobody sees him as the doll, they see him as a person. He gets in relationships, he has love interests, he has friends and stuff like that. Uh, Donald Glover shows up, Childish Gambino, but it's just about trying to make your way in life, right? Being uncertain and having a job you don't really like necessarily and having people in your life you don't necessarily like and falling in love at first sight and then having your heartbroken without ever actually having a relationship with that person, right? Like that's something I think we can all connect with. You start in your head playing out this scenario of this is going and then things deviate and then when he get his life gets back on track and something else happen. It's just a fun not it's fun, it's it's sentimental read, right? It it hits you in the feels, makes you feel something, check it out. And then rounding out",
            "start": 352.52
        },
        {
            "text": "life gets back on track and something else happen. It's just a fun not it's fun, it's it's sentimental read, right? It it hits you in the feels, makes you feel something, check it out. And then rounding out my five picks for you to jump in if you just jumping into comics, again, not a superhero one, also not that original of an idea, The Walking Dead. Yes, I know The Walking Dead is everywhere here, but guess what, it's it's everywhere for a reason, right? Because it's fantastic. Robert Kirkman tells such an awesome story and you know the point of the comic books, I like comic books more than the show. Uh, I think I might like the game a bit more than the comics, but that's not playing by the same rules at all, right? That the game can be these 10-hour experiences where I get to know one character over and over and I get to play as them and I am them, whereas here I'm reading about people's exploits, it's a little less, uh, this is more like I turn the page, I'm like, ah, but like the game, I'm like, what do I do?",
            "start": 392.08
        },
        {
            "text": "and I get to play as them and I am them, whereas here I'm reading about people's exploits, it's a little less, uh, this is more like I turn the page, I'm like, ah, but like the game, I'm like, what do I do? What what is my choice going to be beside the point. Walking Dead is a huge hit right now, you know, obviously TV show, the game, the books and it's that way for a reason because they're just excellent. The in the books I like a lot. I like the characters way more than I like them in the TV show, right? Like Andre in the books, love Andre in the TV show, hate. Um, this is really the way you should experience their story and I think reading the watching the TV show is fun and all, but the books are so good and they're still going, right? That's the other thing too. If you want to be cool, people are going to be watching this Walking Dead TV show for as long as it's on, you read the comic books, you have the inside track on what's going to happen, you look really cool to all those people and they're like, oh, oh",
            "start": 431.8
        },
        {
            "text": "watching this Walking Dead TV show for as long as it's on, you read the comic books, you have the inside track on what's going to happen, you look really cool to all those people and they're like, oh, oh man, I wonder is this Tyrese guy going to be cool? You can be like, let me tell you something, Tyrese is awesome. So again, those are my expert fan opinions. I'm not a professional in the realm of comics. Make sure you check out all of Joey's coverage over at IGN comics for up-to-date stuff on stuff I haven't even heard about. I just bought all the Hawkeye books the other day, still haven't read them, but they seem like they're good. I hear really good things. Uh, let me know of course what you like. I I love comic books. I want to read more comics all the time. Make sure you tell me in the comments below, tweet at me what books I should be reading, uh, and then we can talk a little bit more about what you thought of my recommend, Ash. So please leave a video response when you start reading, let us know what",
            "start": 469.48
        },
        {
            "text": "at me what books I should be reading, uh, and then we can talk a little bit more about what you thought of my recommend, Ash. So please leave a video response when you start reading, let us know what you think of them. Ladies and gentlemen , Ash isn't the only one going away with some homework. I want you to leave your questions as video responses, as comments, as tweets to me and then we can have this conversation on [Music] Gregway.",
            "start": 503.28
        }
    ]
}