{
  "id": 114,
  "video_id": "La9ramWCvTs",
  "show_name": "Gregway",
  "hosts": ["Greg Miller"],
  "title": "The Ben Affleck Batman Support Group: Gregway Ep. 4",
  "description": "Ben Affleck is Batman in the new Batman vs. Superman movie? let's discuss before we freak out, Internet.\n\nSUBSCRIBE/LIKE/SHARE\n\nLeave your questions for Greg in the comments and check back every Wednesday and Friday to see what he's saying.\n\nSubscribe to Greg's channel: http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nOur Merch Store is live: http://www.districtlines.com/gameovergreggy\n\nThe Vlog playlist: http://www.youtube.com/playlist?list=PLOlEpGVXWUVv1g9oZi6O95CwRHQd0ulT6\n\nSubscribe: http://www.youtube.com/user/GameOverGreggy\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy",
  "published_at": 1377226898,
  "duration": 2519,
  "transcript_chunks": [
    {
      "text": "Hello people of Gotham, it's me, Greg Miller. Uh, the internet is freaking out right now, so I figured I'm sick of reading your tweets about it. I'm sick of seeing, uh, everyone freaking out without talking about it. So I'm going, we talk in a support group about the fact that Ben Affleck has been announced as Batman in Batman versus Superman, whatever they call this. Man of Steel follow this is just a simple chat. I'm, I'm basically taking the Twitter feed that I already have, the comments here on YouTube and putting them into this here video. Just instead of having to sit here and read everybody's comments, not have a dialogue, have to answer everybody one by one, I figured we should all come together. Let the healing begin, if you will. You know, even not the healing, and that's what I'm saying. I'm very upset. It caught me off guard, obviously, that all of a sudden this was going to happen, that people, oh my, here's Ben Affleck and everybody's going to freak out about it. And like, first off, let's not forget Ben",
      "start": 5.84
    },
    {
      "text": "It caught me off guard, obviously, that all of a sudden this was going to happen, that people, oh my, here's Ben Affleck and everybody's going to freak out about it. And like, first off, let's not forget Ben Affleck was in Mallrats. Mallrats is one of the greatest movies ever seen your whole goddamn life. Let's not forget that he's great in that. He's great in, he's great in this, Argo, The Town. Everybody likes him in these movies, but all of a sudden, oh, let's all freak out. Let's have a big problem about it. Ladies and gentlemen, Ben Affleck going to be Batman, let's hold your horses, is what I'm saying, right? Ben Affleck's been good to us for a long, long time. I like that about him. He's been a good guy. He's been in these Kevin Smith movies. We should give him the benefit of the doubt , shouldn't we, before we flip out? And this is the whole thing, internet doesn't do this. They, they've been good about it on the Twitter there. Of course, of course, tweet me at GameOverGreggy so we can discuss this together.",
      "start": 49.52
    },
    {
      "text": "We flip out and this is the whole thing, internet doesn't do this. They, they've been good about it on the Twitter there. Of course, of course, tweet me at GameOverGreggy so we can discuss this together as, as one people. Uh, people, you know, it's been quick on the Twitter to point out, right , that of course people freaked out about Heath Ledger being the Joker. I, I was like, I thought it was a weird choice, right? And then, but more importantly to me is the fact that I remember distinctly, and some people are calling on the Twitter about this, that I remember distinctly my parents and my next door neighbor whipping out when they named Michael Keaton Batman. Now granted, I was a little kid at the time. I didn't truly understand why people would freak out about this, right? Like Michael Keaton, sure, Mr. Mom is whatever he kept calling him. I knew him is Beetlejuice. I was a big Beetlejuice fan. I thought, okay, Beetlejuice gonna be Batman. It wasn't as weird to me, but he was a comedic actor up to that point, right? So,",
      "start": 86.48
    },
    {
      "text": "He kept calling him. I knew him is Beetlejuice. I was a big Beetlejuice fan. I thought, okay, Beetlejuice gonna be Batman. It wasn't as weird to me, but he was a comedic actor up to that point, right? So now we got Ben Fleck, Ben Affleck's been announced as Batman. None of you have seen a screen test. None of you have seen anything and you're all set to just massacre this poor young man that we know as a guy who likes to, you know, uncomfortable places. I'm not, I'm not sold on it yet. I can't figure out how what framing like this is all very fly by night. It's all very, I'm reading your comments here on YouTube, of course. I want to, I want you to be part of this to preach it. See, there you go people right there, KM16, he knows what's up. This, this the whole point here is that we're here to talk this out. I want you to comment on the YouTube video here, obviously. I can see your comments live. Then make sure you're tweeting me at GameOverGreggy. We're having an open discussion here. It's just a bunch of, bunch of",
      "start": 125.52
    },
    {
      "text": "You to comment on the YouTube video here, obviously. I can see your comments live . Then make sure you're tweeting me at GameOverGreggy. We're having an open discussion here. It's just a bunch of, bunch of nerds dealing with this thing that apparently is a big deal to everybody. I'm, I'm not, I'm, I'm, you know, I'm not really a freaked out about it. I'm not mad about it. I like, I like Batman right now for Batman, the best New 52 ongoing monthly what going on, best thing New 52, I'm sorry, best thing DC Comics is doing, of course, the digital stuff, Smallville, Injustice, we all know this. I preach this all the time on Twitter on Beyond. Uh, but in terms of New 52 Batman, Scott Snyder fantastic. Let's see a little bit more though. All right, let's see what we got people here. Uh, The Movie Rewind says, I still want to see Ben Affleck direct a Batman film. Okay, that doesn't matter now. Here we, here we go. And Capner says, John Hamm would have been a super your choice. Here's what I was saying from moment one when this got",
      "start": 161.8
    },
    {
      "text": "Ben Affleck direct a Batman film. Okay, that doesn't matter now. Here we, here we go. And Capner says, John Hamm would have been a super your choice. Here's what I was saying from moment one when this got announced when I, I did a video for IGN at Comic-Con about this, right? You've heard my thoughts on this movie. I've beaten the drum over at IGN about it is that I wanted it unnamed in this, right? Like I wanted somebody I didn't already associate with being, uh, you know, the guy who likes to screw uncomfortable places in the back of a Volkswagen like they did that in that Mallrats, you know, and that's the thing. Ben Affleck comes with so much baggage. I'm, I, for the most part, I think I like most of his baggage, right? I like Mallrats, I liked all these other things. People really quick to throw out this Daredevil thing. Remember, of course, ladies and gentlemen, you have a director on a movie. It's not like these actors walk on set and they're just like, I'll do whatever I want. There's a writer, there's a director.",
      "start": 203.16
    },
    {
      "text": "Thing . Remember, of course, ladies and gentlemen, you have a director on a movie. It's not like these actors walk on set and they're just like, I'll do whatever I want. There's a writer, there's a director. People are, people are telling them how to act. We already, and that's I guess that's what's not pissing me off. I'm not really mad about this at all. Today is the internet's quick to judge and throw, uh, Daredevil in Gigli and all these things in Ben Affleck's face. Ben Affleck, yeah , sure, he's made bad movies. I've made bad videos. Like we've all made bad things, right? We didn't set up to try to do that and it's not a one man production. Like I'm saying, he had people telling him what to do, telling him what they needed from him. And when they did all of this, right, that okay, sure, those projects weren't great, but like, come on now, we're really gonna, we're really going to give Ben Affleck the business over that. We're not, we're, we're going to forget about The Town. We're going to forget about Argo. We're going to",
      "start": 242.12
    },
    {
      "text": "Like, come on now, we're really gonna, we're really going to give Ben Affleck the business over that. We're not, we're, we're going to forget about The Town. We're going to forget about Argo. We're going to forget about Mallrats. We're going to forget about Phantoms, the bomb in Phantoms. Yo, so like I said, when they announced this Batman Superman movie, the first thing I said is that I wanted an unknown, somebody I didn't know. Well, I should say, right? Like Henry Cavill, not, not or Henry Cavill, not a full-on unknown. He's been in other movies, but I didn't know him well. I didn't already associate him with characters. Now, the interesting thing for me, of course, in all this is that for Ben Affleck specifically, I thought he made a great George Reeves when he did the Superman movie, Hollywoodland, right? All about, uh, George Reeves, Adventures of Superman, the character there, then going on to, you know, die, get murdered and nobody know what's happening, all these crazy stories about it. For me, that was a great role for",
      "start": 283.24
    },
    {
      "text": "George Reeves, Adventures of Superman, the character there, then going on to, you know, die, get murdered and nobody know what's happening, all these crazy stories about it. For me, that was a great role for him and again, he was awesome in it. Like you're going to look, you know, watch that movie and tell me he wasn't great in it and now you tell me he can't be Batman based on nothing. First off, he's got a good jaw. That's what we define Batman, especially when you look at like Batman in like Arkham Origins, Arkham City, Arkham Asylum, right? That Batman is a is a bulky big Batman. He got a good jawline. That's what Ben Affleck got. We're going to see that here. We already know he's a good actor. We'll soon hear his Batman voice and he's, you know, going to be this older Batman. That's the big point about this movie, right? They keep making references that it's going to be like Dark Knight Returns and that he's going to come back and you know, kind of give Superman the business, tell them what this that and the other.",
      "start": 322.2
    },
    {
      "text": "They keep making references that it's going to be like Dark Knight Returns and that he's going to come back and you know, kind of give Superman the business, tell them what this that and the other. I think everyone's, my whole point of this video, try to get us all together so we can talk this out, so I can hear your concerns, so we can talk about the fact and I, let's also sign off the fact, I'm not saying Ben Affleck is going to be good. I'm just not saying he's bad. I haven't seen anything. I trust, I believe, I mean, I think first off, Henry Cavill is an awesome Superman, right? All my problems with the movies, that's fine, but as far as as being Superman, he was a great Superman. Like you tell me Ben Affleck can't be a good, great Superman, I'm not going to buy it. So let's see what we got here. Uh, I Do Extreme says, Ben is an excellent actor who has taken part in some good and some terrible movies, right? Just like every actor. You know, I, I, you over on Up At Noon over on IGN, which you subscribe to, go",
      "start": 361.84
    },
    {
      "text": "Extreme says, Ben is an excellent actor who has taken part in some good and some terrible movies, right? Just like every actor. You know, I, I, you over on Up At Noon over on IGN, which you subscribe to, go to ign.com every day. I host this show called Up At Noon and I had Dennis Dyack on, right? And he was talking about Shadow of the Eternals, of course, he made Eternal Darkness, he made Metal Gear Solid Twin Snakes and he was talking about , I've made good games and then we, I talk about X-Men Destiny and I talked to, not on camera, but we talked a little bit personally about Too Human. He said, I've made some bad games. Show me a developer that hasn't made a bad game, right? And I'm not talking, you, you, you're immediately flip around be like Naughty Dog. It's like, no, I mean like the, the people on their staff, right? They've, they've made games, they've been part of games, they didn't pan out. It happens. I'm not quick to judge Bing that. Let's see what we got here, more comments. Okay, yeah, right here, Dr. Clyde the Merer, I",
      "start": 396.88
    },
    {
      "text": "They've made games, they've been part of games, they didn't pan out. It happens. I'm not quick to judge Bing that. Let's see what we got here, more comments. Okay, yeah, right here, Dr. Clyde the Merer, I can't read that. He says, if they follow the Dark Knight Return storyline, I don't, I hate this casting. Remember Dark Knight Returns, of course, an older Batman, he's much older Superman, Ronald Reagan, all that stuff. Basically, Batman has to come out of retirement, try to set everything straight and that kind of Batman could be well played by Mr. Affleck. I think personally, I'm not, oh, Theo says, bring out Patillo. Like you knew Patillo wasn't in my life this whole time. Oh my God, the crazy dog eyes. What do you think, what do you think of Ben Affleck, Patillo? Oh, you're like Ben, aren't you? Everyone likes Ben. I understand what's going. Let's see what we got here. The Movie Rewind, I knew people would be immediately pissed. He's a fine actor. It is an INSP, oh, is it an inspired casting choice? No, but I'm fine with it. That's",
      "start": 434.96
    },
    {
      "text": "What's going. Let's see what we got here. The Movie Rewind, I knew people would be immediately pissed. He's a fine actor. It is an INSP, oh, is it an inspired casting choice? No, but I'm fine with it. That's interesting, right? That's a good point. I, I again, I would have liked someone I didn't know. So like, and like that's the know thing with Christian Bale, right? Christian Bale had done American Psycho and I knew him from that and then when he got cast as Batman it was like, okay , like that's fine. Like I didn't, you know, I didn't know enough about him. Like where is Ben Affleck and I maybe this is the weird thing, right? When people watch videos from me or listen to podcast for me, I always talk about the fact that if you listen to them or watch them, you're my friend, right? You know more about me than a lot of my family members do. Uh, I feel that I have that same fan relationship with somebody I've never met with a, I think thanks to being such a huge Kevin Smith fan. Like I grew up being a Kevin Smith fan and so in",
      "start": 476.04
    },
    {
      "text": "Members do. Uh, I feel that I have that same fan relationship with somebody I've never met with a, I think thanks to being such a huge Kevin Smith fan. Like I grew up being a Kevin Smith fan and so in doing that, I watched all the commentaries. Like Mallrats is my, you know, my second favorite movie of all time behind Ghostbusters and watching the comment on that disc makes you feel like you know Kevin Smith and Jason Mewes and, uh, Ben Affleck, right? Because they had a picture and picture. I'll never forget this is like prove what DVDs were to me, picture and picture and them joking around being friends and you're kind of in that relationship with them, right? You're listening to them, you're not responding to him, similar to podcast nowadays. But I always thought Ben got such a bad rap first and while we're talking about Kevin Smith films, Jersey Girl is a good movie. I enjoyed Jersey Girl. I think Jersey Girl gets a bad rap, of course, came out Gigli time frame and all that other stuff. Still, I liked what they",
      "start": 515.16
    },
    {
      "text": "Talking about Kevin Smith films, Jersey Girl is a good movie. I enjoyed Jersey Girl . I think Jersey Girl gets a bad rap, of course, came out Gigli time frame and all that other stuff. Still, I liked what they were doing with it. I think that made sense. It was, it was, it was a good film, you know what I mean? Um, it wasn't what people expected. So I found myself torn, right? I like this Ben Eck fella. I think he's a fine actor. I'm excited for this movie. Again, I had problems with Man of Steel, but I like, I like Henry Cavill. I like the idea of, I'm hoping for Lex Luther, obviously Michael Rosenbaum should be cast, but Ben Affleck, it's an interesting choice. I, I, I understand people on Twitter stumbling around like they got punched in the face. Let's see what some people are on Twitter saying. There's been a lot, there's been a lot of tweets going back and forth. People still, I know Justin Davis, one of my friends, he doesn't know what's up. Sean Norton, he doesn't know what's up. People are still freaking out about everything.",
      "start": 561.16
    },
    {
      "text": "A lot of tweets going back and forth. People still, I know Justin Davis, one of my friends, he doesn't know what's up. Sean Norton, he doesn't know what's up. People are still freaking out about everything here. There's already a Ben Affleck Batman account says, hi, I'm Batman. That's funny. Um, Rich George from says, Twitter's all sorts of fun right now. Uh, lot, a lot of sarcasm. We're past the point right now where everybody's like, Mike Drucker tweets a conversation between Warner Brothers and Zack Snyder. Warner Brothers exact quote, what if we cast Ben Affleck as Batman? Zack Snyder quote, and what if he uses a gun? Warner Brothers exact perfect. Yeah, man. Yeah, geez. Yeah. Okay. Gary Whitta nailing it. Love Gary Whitta. You should follow Gary Whitta at Gary Whitta. He says, guys, I just got off the phone with the president of show business. He asked me to tell you all to chill the out. I think that's the main thing. I don't mind. I'm, you know, I definitely didn't expect my Thursday night to be talking about Ben Affleck as Batman, but I",
      "start": 608.2
    },
    {
      "text": "Business. He asked me to tell you all to chill the out. I think that's the main thing. I don't mind. I'm, you know, I definitely didn't expect my Thursday night to be talking about Ben Affleck as Batman, but I didn't, you know, I don't understand the hate . I guess every and like the people who keep bringing up Daredevil, lots of Daredevil tweets when this announcement went out. It's like, okay, we get it. Daredevil wasn't a great movie. I didn't, you know, I thought it was not a great movie. I enjoyed myself fine, you know, wasn't a good movie. Ben Affleck didn't make that movie all by himself. A lot of people helped him on that, on that journey. So let's not cast him on it. Uh, a lot of jokes about Matt Damon being Robin, of course. Yes , yes, yes. Nightwing 1994, Mark Hill confirmed as knocker, of course, knock knocker, a blunt man and chronic villain who shows up in Jay and Silent Bob Strike Back played by Mark Hill. Uh, I think it's high time for a Batman with a Boston accent. I'm not hockey mask internet, calm down. There are many",
      "start": 663.88
    },
    {
      "text": "Man and chronic villain who shows up in Jay and Silent Bob Strike Back played by Mark Hill. Uh, I think it's high time for a Batman with a Boston accent. I'm not hockey mask internet, calm down. There are many worst things in the world. Well, sure, there's worst things in the world, but it wouldn't be the internet if we didn't have fun and get crazy about nerdy stuff, right? Telling you though, we got to give Ben Affleck a chance. That's what this is all, yeah, well, that's what Edgar's saying. Edgar's saying, I think he's a little bit behind what I'm saying, but he's saying Henry Cavill was also an unknown, right? That's what I'm saying. I love unknowns. I kind of wish there would have been an unknown here and that's, but I get, you know, I say all that, right? And when I watched Superman Returns for better Awards and Kevin Spacey was like Luther, I didn't get all like, oh, I didn't get hung up on the fact that's the guy from American Beauty, that's the guy from, you know, I mean, he was Lex Luther. I think that's",
      "start": 706.12
    },
    {
      "text": "And Kevin Spacey was like Luther, I didn't get all like, oh, I didn't get hung up on the fact that's the guy from American Beauty, that's the guy from, you know, I mean, he was Lex Luther. I think that's what people are forgetting. First off, Ben Affleck, like charming smile and a good looking man, you're telling me he's not going to make a good Bruce Wayne and Bruce Wayne's got to go out there and try to flirt with Lois Lane and do all this other stuff. He's gonna look good and he's gonna and I think he's gonna fill up the suit nice too. Christian Bale, he was, he was a, he was a, you know, athletic dude, thin dude, but not like ath le buff. Go watch Hollywoodland if you haven't. I hope it's not Netflix. It probably is that Netflix interest, you know, immediately. That's what I'm trying to, here we go. So finally somebody take point, uh, is Mahaw says, my God, that is such a bad idea. They had a chance to revitalize all of their franchises and they go for an older Batman stupid. Robert Downey Jr. is how in his 50s now.",
      "start": 750.16
    },
    {
      "text": "Take point, uh, is Mahaw says, my God, that is such a bad idea. They had a chance to revitalize all of their franchises and they go for an older Batman stupid. Robert Downey Jr. is how in his 50s now, right? Like and nobody has a problem with him is Tony Stark because he nails Tony Stark. If we're going to take this universe in a different way and this is the problem with everybody who had a problem with Man of Steel for like spoilers, The Killing, right? Like the fact that like the people died and this happened, you can't have it both ways. The the same people who were saying that Superman was boring, right? That oh, he's invincible and nothing can hurt him and y ya Y and he's always he's a boy scout y. So they go the different direction, try to make super he's like, that's not what Superman would be. You can't have it both ways, right? So here's what I always talk about when I talk about comic book movies and then the difference between a comic book fan and maybe just a fan at large, right? For comic book",
      "start": 785.16
    },
    {
      "text": "Have it both ways, right? So here's what I always talk about when I talk about comic book movies and then the difference between a comic book fan and maybe just a fan at large, right? For comic book fans like myself, you know, I, we have all these books over here, right? And in them we take, we can take it that if you grab the Dark Knight Returns, that doesn't mean that the current Batman doesn't exist anymore. I'm DC does a really great job of putting out all these different animated movies that don't tie into each other. There standal in movies. You pick one up, you watch it, you're like, okay, that was really cool, that was cool story. I'm done. That's what I like about graphic novels, right? The ones that I think are really cool aren't the ones that are just ongoing, ongoing, ongoing. It's when you can take a, you can take an ongoing story arc from an artist and of course writer, bundle it in one book and give it to somebody and say, you know, Long Halloween, this is great. Now with with Snyder, right? Like Court",
      "start": 826.96
    },
    {
      "text": "You can take an ongoing story arc from an artist and of course writer, bundle it in one book and give it to somebody and say, you know, Long Halloween, this is great. Now with with Snyder, right? Like Court of the Owls, this is great or not or whatever it was, uh, and they get that, they read that, they're done. They don't have the, it doesn't work for the scenario, but stick with me, right? That you can take the story self-contained, read it and be done. I don't like, are we really that sad that if they're going to cast a like's a bit older and they're going to make the universe a bit older and have no like, so what? Like at tops we're going to get like what, jeez, three or four movies out of it. I don't think from what we've seen so far, the DC's got it in them to do like the whole Avengers Universe kind of thing. Obviously Marvel had that stuff laid out way better than DC's laid the stuff out. Uh, I think you're looking at you have Man of Steel, we have Batman Superman, we're going to get a Justice League movie",
      "start": 870.2
    },
    {
      "text": "Obviously Marvel had that stuff laid out way better than DC's laid the stuff out. Uh, I think you're looking at you have Man of Steel, we have Batman Superman, we're going to get a Justice League movie and then what, maybe another, maybe a Batman, maybe a Superman, maybe another Justice League and by then I think you have to start worrying about about rebooting franchises and doing all these stuff. How many Avengers movies are we going to get, right? Keep in mind too that Downey's only signed down for a few more. You can go to ign.com to read all about the official movie stuff. Remember, I'm just a fan. I'm no expert here about the movie stuff. I know about the comic stuff and I know about my opinion on the matter. Uh, but Robert Downey Jr ., he's not going to be around much longer. He's only got a few more movies in him and then he's going to he out first off because he's old, second because it'd be too expensive. Why do we care? It's going to be replaced, right? This is another thing, right? Like people get Bond",
      "start": 913.4
    },
    {
      "text": "In him and then he's going to he out first off because he's old, second because it'd be too expensive. Why do we care? It's going to be replaced, right? This is another thing, right? Like people get Bond movies that way. They get the fact that okay, Bond just keeps recycling over. There's a new Bond every time. It's no big deal. The movies keep going. Hopefully we get that way where kind of where we have comic movies that can stand on their own where you give me this comic book movie , there it is, that's what it was great and I can see another Batman movie in a few years and not be like, I don't understand, didn't bam throw him in a hole and have a really stupid thing on his face and just make a terrible, terrible Batman movie. Let's see what else is happen in the comments. Yeah, here's another thing, AK Flash 23, let's be real, we would watch watch it even if Shu Yoshida, the president of Sony Worldwide Studios was Batman. That's the other great point today on Twitter, right? This gets an S. A lot of people, I",
      "start": 947.04
    },
    {
      "text": "23, let's be real, we would watch watch it even if Shu Yoshida, the president of Sony Worldwide Studios was Batman. That's the other great point today on Twitter, right? This gets an S. A lot of people, I won't be seeing that movie. I won't be doing shut up, you're totally going to go see it. I have no interest in Thor 2, whatever, Dark Mirror, Dark Tower, Dark whatever the hell he's fighting and I didn't like, I thought Thor one was all right, right? I'm still going to go see Thor eventually. I'm still going to get out and see Thor. Like that's going to happen. Let's not be so quick to judge here and do all this stuff. Uh, Alexandro Contesta says, I think it's a commercial choice, nothing else. I, I mean, I wouldn't, it might be that. Yeah, we need, we want a Warner Brothers like we want a big name to be Batman, but like I don't know if it's like the biggest commercial choice in the world, maybe though, who knows? Oh, okay, so I just called people out, right? I'm like, you know, you're going to go see this movie. Highball Comics says, I",
      "start": 986.68
    },
    {
      "text": "If it's like the biggest commercial choice in the world, maybe though, who knows? Oh, okay, so I just called people out, right? I'm like, you know, you're going to go see this movie. Highball Comics says, I will not see this opening weekend in a theater at all. Well, I'm glad Highball Comics, you took the high road and said you won't see it opening weekend. Oh man, at least you'll go see it, you know, the Tuesday afterwards. You're going to see it opening weekend because it's gon, well, if it's good, right? Again, I want to make sure we're, we're being clear here. I'm not saying Ben Affleck awesome. I'm not saying Ben Affleck sucks. I'm not saying the movie is great, the movie sucks. I'm saying we don't know anything yet. Let's give them a little bit of rope here. Let's see what they can do with this thing. Let's not be these guys on the internet who just like, no, I don't want, I don't want that. Go a little bit down. Yeah, see, uh, Andrew Kish, I'm okay with this too. Uh, The Paz ask Colin, Colin's not here. He's in Germany. Matt",
      "start": 1026.8
    },
    {
      "text": "Guys on the internet who just like, no, I don't want, I don't want that. Go a little bit down. Yeah, see, uh, Andrew Kish, I'm okay with this too. Uh, The Paz ask Colin, Colin's not here. He's in Germany . Matt Damon as Nightwing. If they bring Matt Damon in for Nightwing a Robin, then that is that they are making, they are making Batman and Robin too and I don't think they're going to do that. More Comas rolling in, lots of stuff. Let's see what we got going on here. I mean, Booya Radishes, could Ben Affleck direct the Justice League if his Batman does good? Yeah, right. Okay, sure, why not? You can also get a cooking show if he starts learning how to cook too. See what's happening on Twitter. Remember, tweet me at GameOverGreggy, be part of the show. Yeah, see again, Jamie agrees with me. Ben Affleck like has the jaw for Batman. L I'm curious to see how he interprets the character. Uh, what Raymond Glo gold, it's not that he's older, it's that he's just not that great. Why do we hate Ben hler? What I mean, like he's made bad movies",
      "start": 1068.04
    },
    {
      "text": "L I'm curious to see how he interprets the character. Uh, what Raymond Glo gold, it's not that he's older, it's that he's just not that great. Why do we hate Ben hler? What I mean, like he's made bad movies, sure. Everyone's ba George Clooney was in Batman and Robin period. Everybody's fine with him. We're not, we're not telling him he's terrible. He says, I love Holeck as a director, but he's not a great actor. I disagree, sir. I think Ben Affleck is good in The Town, Argo can watch these movie. I'm maybe I'll run to Argo tonight. Sean Black says, time for an impromptu conversation with Colin. We're having it right now, Sean. You probably should be paying attention to links I put up. I'm going to Tweet it again real quick. So talk once your stuff, of course, follow me on Twitter at GameOverGreggy. Um, then watch all the dumb shows we do. Uh, I do Up At Noon. You subscribe to GameOverGreggy on Twitter, obviously. Up At Noon goes live every Monday. I posted there Tuesdays and Thursdays, conversation with Colin Wednesdays and Fridays,",
      "start": 1124.32
    },
    {
      "text": "Shows we do. Uh, I do Up At Noon. You subscribe to GameOverGreggy on Twitter, obviously. Up At Noon goes live every Monday . I posted there Tuesdays and Thursdays, conversation with Colin Wednesdays and Fridays, Gregway, which is just shows like this that are actually good though, not just about this. We're talking about this Ben Affleck slash Batman thing period. We we're Supple. Don't you guys love watching me tweet on my iPad, man? I tell you what, I know how to make interesting content on YouTube. So that's back down. Let's see if anybody's tweeted stuff. Oh, I got a new follower. Oh, thank you Dan. Dan says, I'm beyond proud that GameOverGreggy is being smart and rational about athic Batman casting instead of Cole McGrath is back. Ah, I get it. Of course, I flip that when they redesign Cole for Infamous. That's true. I did do that, but that was like and I guess that's the other thing too, you know, I I often talk about this, uh, that I'm a huge Superman fan, right? I'm a huge DC Comics fan friend and I, you know, I like",
      "start": 1177.08
    },
    {
      "text": "I did do that, but that was like and I guess that's the other thing too, you know, I I often talk about this, uh, that I'm a huge Superman fan, right? I'm a huge DC Comics fan friend and I, you know, I like Batman fine, but I'm not like super into Batman. So I get if Batman's your favorite thing and you only know Ben Affleck like from Phantoms like or Gigli or whatever and you want to make a big deal about it, but I still say as a comic book fan as a DC Fanboy, remember that, remember that I am all about DC Comics, that is totally what my bag is. You look over here, they're all DC Comics except for like one I think I think got Spider-Man blue down there, but I I I kind of get it, right? I don't know, I don't actually anymore. We're we're very lucky. Do you remember old people like me when you'd pick up Wizard magazine and you'd open it up and there'd be like the spread about the Nicholas Cage Superman movie, you're like, oh, we're finally gonna get a Superman movie and you're reading, you're like, this sounds awful",
      "start": 1236.84
    },
    {
      "text": "and you'd open it up and there'd be like the spread about the Nicholas Cage Superman movie you're like oh we're finally going to get a Superman movie and you're reading you're like this sounds awful this sounds like the worst movie ever but at least we're getting something and then it didn't happen like how many times I went you know KICKO for Superman Returns because hey guess what we finally have a Superman movie I'm finally going to be able to drive myself I guess be cognizant driving as an adult with my girlfriend and go see a Superman movie that's exciting right right now we're spoil little brats about everything you know Iron Man hit and we or I mean and let not even I'll thought way back from that right you X-Men hits and then we start getting all of these movies comic book movies as far as the eye can see occasionally one of my sports playing dumb friends would be like oh man this comic movie thing is going to burn out it's never going to burn out we finally made it we finally",
      "start": 1289.44
    },
    {
      "text": "far as the eye can see occasionally one of my sports playing dumb friends would be like oh man this comic movie thing is going to burn out it's never going to burn out we finally made it we finally made it where we can say look at Wolverine movie The Wolverine X-Men Origins is terrible big deal put out another movie call it Wolverine we'll be excited for it doesn't matter and that's what I'm saying today everybody's mad at Ben Affleck for some reason but in the end we'll be happy that we have this movie and you're all going to go see it too uh that legend says there's honestly no reason to hate on him he'd be a fine Batman I think we should trust the caster he she casted Cavill and Cavill is amazing is Superman yes Henry Cavill amazing is Superman again don't care what you think about the Man of Steel right I I like I've said for a while right I'm right in the middle people love it people hate it they try to talk to me about it and I'm just like yeah whatever you feel is fine you believe",
      "start": 1329.96
    },
    {
      "text": "of Steel right I I like I've said for a while right I'm right in the middle people love it people hate it they try to talk to me about it and I'm just like yeah whatever you feel is fine you believe whatever you want to feel I understand that I'm down I want you to be happy and live your life however Henry was awesome as Superman he was great Superman he's got a great Superman voice he's got a great Superman look filled out the suit nice Ben Affleck's gonna do the same thing he's gonna fell the suit can we at least get to that ladies and gentlemen that Ben Affleck is going to look dynamite in the Batman suit and again the cowl that jaw he's got a great jaw jaw oh I said jaw weird but you know what I'm saying also sorry if you're watching on YouTube it's all stretched and squished this was off forur the moment jumped right in there so just suck it up but you're here we're in this live stream we're bonding together I'm still taking your comments off the YouTube page here Kevin says DC Comics",
      "start": 1370.92
    },
    {
      "text": "the moment jumped right in there so just suck it up but you're here we're in this live stream we're bonding together I'm still taking your comments off the YouTube page here Kevin says DC Comics is okay to with a winky emote on Kevin DC Comics is fantastic and you know it I'd prefer it we don't talk trash about DC Comics I don't like that one too uh Chris says who's your favorite Batman Greg like to date I mean Kevin Conroy bam let's not I mean let's not forget how awesome the animated series was how awesome he is to be in Batman Beyond how awesome he is in the Batman games from Rock Steady I mean if you're talking about a actual actor actor then I got to go Christian Bale minus the Dark Knight Rises I did not like Dark Knight Rises I'm sorry I know Colin and I argue about this all the time eventually we'll have a conversation with Colin about it not just yet though but I I mean did not like dark but Bale's Batman was awesome right especially his progression and Begins I thought I still love",
      "start": 1413.84
    },
    {
      "text": "we'll have a conversation with Colin about it not just yet though but I I mean did not like dark but Bale's Batman was awesome right especially his progression and Begins I thought I still love Dark Knight uh Keaton I I I guess like it's easier to say the Batman I didn't like right like you know Keaton I was I liked I liked Keaton but then looking back at it being a Batman a DC Comics fan now who's grown up in the whole you know Batman doesn't kill anybody it's weird to see the Batmobile have guns and him s you know burn a guy to death and like can't really get over that now of course look at that H never thought about that now I said I can't whatever that I mean that that's like my knock against that Batman that version of Batman that interpretation of Batman but of course I was just giving you all crap saying that if Superman was going to you know that people had a problem with Man of Steel because of the that they were you know trying to have the best of both worlds he's a boy scout he's",
      "start": 1461.92
    },
    {
      "text": "you all crap saying that if Superman was going to you know that people had a problem with Man of Steel because of the that they were you know trying to have the best of both worlds he's a boy scout he's not a Boy Scout they can't have it they can't walk that line I could be fine with that and I guess that it's just like the gun thing right is like at the core of Batman so it was interesting to see the Tim Burton fans go past that and not worry about that that's not that bad of a TR I mean like the only Batman who didn't work right was George Clooney and it was just because it was way too campy and he says that too in all his interviews right he says like halfway through he started playing in gay and that's just how he wanted he how he did it and that's what he did I think Val Kilmer gets a bad rap I I loved Batman Forever at the time haven't seen it it's boiling acid remember that that's the best part of Batman Forever when they're in that safe oh it's boiling acid my thing it's acid why does",
      "start": 1504.16
    },
    {
      "text": "I I loved Batman Forever at the time haven't seen it it's boiling acid remember that that's the best part of Batman Forever when they're in that safe oh it's boiling acid my thing it's acid why does it need to be hot I don't like if if the acid's slowly creeping up towards me the last thing I'm like oh man it's hot too it's going to eat my foot in my fa I'm going to slowly die in this ass head and on top of everything it's very hot not my concern so I mean like yeah I guess you look back like yeah there's not really been bad Batman as I'm sure I'll look check the comments here see what you think but of course tweet me at GameOverGreggy leave your comments here in the little comment bar looks like I might be frozen over here oh Calvin Cory says who do you think the villain will be once Bat Affleck gets his own movie without Superman I don't know Joker probably right like that's the whole point that's why you reboot the universe so you can use the villains and like the classic things",
      "start": 1540.16
    },
    {
      "text": "Bat Affleck gets his own movie without Superman I don't know Joker probably right like that's the whole point that's why you reboot the universe so you can use the villains and like the classic things everybody everybody loves uh Chris McCracken says that has got to be a joke right and he's responding to the the the tweet I put out with the link to IGN's article about Ben Affleck like being Batman it is real I hope you're here now watching us Simon tweets and this is at saon one these people are way too quick to judge before knowing anything about the new Batman Affleck will pour his heart into it yes he will we got to give a sh we got to give Affleck a shot here folks he's he's he keeps getting parts for a reason it's not we might not we might have a problem with some of performances let's just give him a reason here let's not be crazy all right okay Dwayne says here uh or I'm sorry Danne says here don't get me wrong Ben is a great actor but I don't know if I see him Bruce I could be proven wrong",
      "start": 1593.28
    },
    {
      "text": "a reason here let's not be crazy all right okay Dwayne says here uh or I'm sorry Danne says here don't get me wrong Ben is a great actor but I don't know if I see him Bruce I could be proven wrong though #Afflac #Bats hopefully you will be right like that's the big I mean hopefully for all of us too again I'm not on I'm not on a Ben Affleck money hat here all I'm saying today is we need to give him a shot we need to not be quick to judge we need to see what he's going to have up his sleeve here right let's see what we got here thank you Daniel says I was me about the whole versus idea but now Affleck is on board I am totally down with them moving cannot wait well there he go that sounds like a good one right like is another rational person having a rational conversation irrational passion is another podcast you should listen to Augie Augie SoDo says Greg Greg Miller is taking me off the wedge right now haha see that's the whole thing we can't be too upset we can't be quick to judge",
      "start": 1638.08
    },
    {
      "text": "is another podcast you should listen to Augie Augie SoDo says Greg Greg Miller is taking me off the wedge right now haha see that's the whole thing we can't be too upset we can't be quick to judge there's a lot of people that need to grow into o Jeremy W says I can see Johnny Depp as the Joker Johnny Depp would be a cool Joker and again though can we see past him I guess when people people looked that now granted no one wouldn't saw the Lone Ranger but when people looked at the trailer for The Lone Ranger you got ped that that was Johnny Depp right I like Johnny Depp Johnny Depp would be cool too uh yeah and then asked who would be the villain in the who would be the villain right in the in a Affleck only Batman movie reboot gaming 11 says Mr. Freeze Clayface penguin Killer Croc there's plenty of options there Chuck Norris thank you for watching Chuck I'm a big fan Chuck Norris says JLo is Harley that's not a bad one too Richard Richard Giovanni wants the gray suit okay okay keep on looking",
      "start": 1684.56
    },
    {
      "text": "options there Chuck Norris thank you for watching Chuck I'm a big fan Chuck Norris says JLo is Harley that's not a bad one too Richard Richard Giovanni wants the gray suit okay okay keep on looking through all this stuff so you boiling acid oh okay I asked why is it a big deal if it's on if it's acid or boiling acid and lintonia HB says boiling acid as you increase the temperature the rate of reaction increases all right uh Noah says here didn't Affleck say he was embarrassed about playing a superhero and said he would never want to play superhero ever again I believe he did see if I can dig out that article real quick talk about yourself but I do know you're I do I remember reading this on ign.com it's a it's a dynamite [Music] website we're looking it up um well now of course all the news about Ben Affleck is in fact about all s of crap they did first off though here's a great picture I've been talking talking a lot about Ben Affleck is uh George Reeves look how good he looked oh sorry it's",
      "start": 1730.44
    },
    {
      "text": "about Ben Affleck is in fact about all s of crap they did first off though here's a great picture I've been talking talking a lot about Ben Affleck is uh George Reeves look how good he looked oh sorry it's all is George Reeves there Adventure Superman tell me that first off that's a good looking Superman period I wouldn't mind seeing him be Superman in a movie putting that out there I don't care if you want to hate on Ben Affleck right now I'm not gonna hate on G to tell you what I think I'm still going to try to find this I do remember this article though uh done with super hero like I'm sorry that all of you are just getting to watch me tweet things I hear it is yeah okay 10 worst superhero movies Rolling Stone of the past 10 years they had there La there I'm going to iPad starpulse.com this doesn't look good okay Ben Affleck SARS off superhero roles to avoid wearing tight pants this was posted 365 weeks ago apparently and it's one of those things where I can't the article isn't even here like their",
      "start": 1790.44
    },
    {
      "text": "look good okay Ben Affleck SARS off superhero roles to avoid wearing tight pants this was posted 365 weeks ago apparently and it's one of those things where I can't the article isn't even here like their ad breaks it star pulse no not how you run an app okay well then let's see what we got going on in the comments that's funny uh brain stem says that's funny he spelled brain differently but he means it brain stem uh my concern is Zack Snyder he's an Abomination he corrupts comic book movies with a shitty directing awful writing and effect on good actors making them terrible shut the up R really I liked Watchmen I like the Watch men comic and I like the Watchmen movie I know I a lot of people like hate hate hate it I don't get it I don't get the problem with it uh again Man of Steel not not the best movie again I was right in the middle I was it's fun I saw the next day I people I went to a screening right and I came to the E3 War Room the next day and Rich like how was it I was like it's",
      "start": 1846.8
    },
    {
      "text": "best movie again I was right in the middle I was it's fun I saw the next day I people I went to a screening right and I came to the E3 War Room the next day and Rich like how was it I was like it's fine he's like oh that me that's not good if Greg Miller saying it's fine we got problems um I don't I don't hate Zack Snyder I never saw 300 to my credit and then Sucker Punch of course looked like something I didn't care about because it looked dumb and then I thought Watchmen was good and then Man of Steel you know I wasn't it's like my problem with Man of Steel I had no party wasn't like my legs asleep sorry I switch legs P put some to sleep part of you're like matched up with your little guy um still have a problem with in terms of hey you know what like this directing sucks or whatever like I it had a bunch of problems it wasn't just s for now Trent cop says I'm down for it but he better not pull the cancer throat Christian Bale voice he's gonna have to like he's got to do a voice thing",
      "start": 1902.04
    },
    {
      "text": "I it had a bunch of problems it wasn't just s for now Trent cop says I'm down for it but he better not pull the cancer throat Christian Bale voice he's gonna have to like he's got to do a voice thing that's a big part of Batman right like that's what I loved you know there's a great moment in Pre New 52 comics where Batman and Alfred are talking and it's a flashback obviously actually no I don't think it is obviously it's all run together but he goes you know like he's they've gotten in a tiff or whatever and Alf's going upstairs like you know Master Bruce that Batman voice we had to practice when you first put on the cowl or whatever you're doing it all the time now like that's I thought so great right like that's the interesting thing they're going to have to toy with right is like an older Batman should be way different than the Christian Bale Batman because B and again not Dark Knight Rises older Batman but like a Batman who's been being Batman Forever for for a long time it'll have",
      "start": 1947.32
    },
    {
      "text": "Batman should be way different than the Christian Bale Batman because B and again not Dark Knight Rises older Batman but like a Batman who's been being Batman Forever for for a long time it'll have to be different because of course eventually Batman's the real thing right Bruce Wayne's The Mask Batman is the real dude like Bruce Wayne died in the alley with his parents Batman is the dude who went on and became crazy ass Batman so that's what it'll have to be right we'll have to see like Ben Affleck like already having how he have to bring like a very stoic nature and a very like beat down view of the world and that's the always the interesting dichotomy right between Batman and Superman that Batman thinks everything sucks doesn't see the good in anyway Batman or Superman believes in everybody let's go back to Twitter here remember tweet me at GameOverGreggy uh somebody continuing their tweet but it ends with Ryan Reynolds as Green Lantern and Deadpool in the Wolverine movie he ripped a",
      "start": 1989.6
    },
    {
      "text": "let's go back to Twitter here remember tweet me at GameOverGreggy uh somebody continuing their tweet but it ends with Ryan Reynolds as Green Lantern and Deadpool in the Wolverine movie he ripped a second hole in those beloved Heroes asses this is from Robe Joe let's see if I can see his first round okay Rob here says he cannot be both Batman and Daredevil that would rip a hole in the SpaceTime Continuum we saw it happen with Ryan Reynolds is Green Lantern in Deadpool in the Wolverine he ripped a second hole in those belowed Heroes different universes there's no RI in SpaceTime Contin we're going to be okay not to mention of course Greenlander sucked overall and again the Wolverine movie not a good movie but you can't blame Ryan Reynolds he didn't write the part he's not like you know we should do a Deadpool give him cyclop eyes at the end of it and you know cut his mouth up he didn't say that so let's not let's not be crazy here let's see what else we got here now um oh Chris gives me",
      "start": 2038.6
    },
    {
      "text": "do a Deadpool give him cyclop eyes at the end of it and you know cut his mouth up he didn't say that so let's not let's not be crazy here let's see what else we got here now um oh Chris gives me a shout out for answering this question no problem thought I could be here for you Johnny says grer boy Robin in this movie my vote is for Chloe Moretz if they pick a girl there's not going to be a Robin in this movie I'm pretty sure they already won the record about that or maybe I'm thinking of the game but even so that's way too much to introduce at once you don't want let's not introduce a Robin right now that you can break off and have a Robin later if you ask me seems like Twitter's coming that the world is going back to normal Christine's pouting Christine I'm just talking to my friends here you don't have to oh you need help getting the pot up you want to come sit down and talk about Ben Affleck no why not you got to that's the that's the deal I'll come get the pot out of the bottom we're",
      "start": 2085.88
    },
    {
      "text": "you don't have to oh you need help getting the pot up you want to come sit down and talk about Ben Affleck no why not you got to that's the that's the deal I'll come get the pot out of the bottom we're not going to eat tonight uh I'm trying to leave you with oh she got it all right don't worry I'm going to get out of here soon we're making uh chicken tenders the color already wet so you know like the chicken cut here we go pie makes me L okay he says my biggest issue with the film is the decision to base It Off The Dark Knight since when was Frank Miller the authority on Batman do we all forget about All-Star Bats dude since one is Frank Miller the authority on Batman since basically he rebooted everybody's vision of Batman with the Dark Knight Returns remember when Batman was running around in the blue and the gray still in the Justice League and it totally stupid and he except for when he punched that guy Garder awesome but that Batman like was caught in this in between phase right",
      "start": 2127.92
    },
    {
      "text": "in the blue and the gray still in the Justice League and it totally stupid and he except for when he punched that guy Garder awesome but that Batman like was caught in this in between phase right where he's like still the all right CH and then was also Batman so then like when Frank Miller came around it was like established Batman as being a badass that's really when the trajectory changed and he's like okay you know what this Batman guy is going to be super dark I mean let's not forget like they had a w show like that stuck around for a long long time and then it was Frank Miller then it was Tim Burton and all of a sudden everybody saw Batman as this really cool edgy era right like he got to be on the outside and not be everybody's gotam friend and all these other goofy ass things so like that's why nobody forgot about all bats Allstar bats from you know I'm the goddamn Batman that was good that was fine don't worry I like this F speaking of which what do we all feel about Batman",
      "start": 2175.32
    },
    {
      "text": "like that's why nobody forgot about all bats Allstar bats from you know I'm the goddamn Batman that was good that was fine don't worry I like this F speaking of which what do we all feel about Batman Superman so far the comic book New 52 I think I'm an issue behind I'm only I've only read two enjoyed myself so far let's look at the comic now we got another one here cocky Irishman he says Johnny Depp should play The Riddler in the Batman movie I like Johnny Depp so I don't mind Johnny Depp being involved somehow with this let's see um Brian Sanchez says this some bat yep another person asking what happened to Colin thank you hold on again Colin in Germany he's gone Noah says I loved Watchmen N300 Zack is cool I liked Man of Steel see Zack sun is not the worst thing in the world like some of these people are saying Watchmen this is Dave Michael Watchmen is still my third favorite comic book movie all time behind X2 and Dark Knight okay I night first ask for Colin God damn it Colin's not",
      "start": 2212.56
    },
    {
      "text": "these people are saying Watchmen this is Dave Michael Watchmen is still my third favorite comic book movie all time behind X2 and Dark Knight okay I night first ask for Colin God damn it Colin's not here Ben Affleck is two this is from TR and piie try and pie uh Ben Affleck is too tall to play Batman he'd have three inches over Henry Caville isn't Superman taller than Batman uh they're madeup characters they are drawings on the page there's no hard and fast rule about anybody being taller than anybody not Burton Ernie where we are we have an established thing here all right is B I think Ben's coming like the Batman that we've heard about in this movie older he's already been Batman for a while him coming in he needs to be like the Elder right he's he's going to he's going to teach some valuable lessons about how to be hero in this movie I bet so let's all com down also shout out to Bobby Amos of course for nailing the fact that this was going to be Batman Superman movie o CyberLink 420",
      "start": 2260.48
    },
    {
      "text": "lessons about how to be hero in this movie I bet so let's all com down also shout out to Bobby Amos of course for nailing the fact that this was going to be Batman Superman movie o CyberLink 420 says hypothetical question Greg Who Would You cast as a live action Terry McGinnis of course Terry McGinnis the young man who goes on to be Batman Batman Beyond again I want somebody I don't know I think the Lawrence brothers are all too old now see I look at that you think about the sh from Boy Meets World he would have been a goodness I don't know any of the young kids anymore how about that Teen Wolf kid that likes me in IGN him cast him uh oh reboot gaming 11 here he says Human Torch could be Captain America so good point see everybody wants to freak out about Ryan Reynolds doing dual rolles and ruining it quote unquote there you go we all know Chris Evans Dynamite as Captain America and he was in bad Fantastic Four movies and nobody really cared right Fantastic Four movies not good then he goes",
      "start": 2306.72
    },
    {
      "text": "ruining it quote unquote there you go we all know Chris Evans Dynamite as Captain America and he was in bad Fantastic Four movies and nobody really cared right Fantastic Four movies not good then he goes on to Captain America and the Avengers and he's great in that and nobody's like uh I can't see him past that see everybody's hung up on stuff everybody's calming down I'm glad that's what this whole support group was about ladies and gentlemen it was to make you sure you knew that the sky wasn't falling in the DC Universe that everything was going to be okay there's a lot of news still to come out somebody somebody SC so oh okay AJ jonasi says people who think Affleck is soft need to go see Affleck right now like okay but I it's hard to find Ben Affleck to look at him but I do believe he is buff right now so I'm not too worried about that okay uh Luis Santos says only issue I have with the new movie is that they might push Batman more than soups even though this is his sequel well spoiler",
      "start": 2359.0
    },
    {
      "text": "right now so I'm not too worried about that okay uh Luis Santos says only issue I have with the new movie is that they might push Batman more than soups even though this is his sequel well spoiler alert yeah Batman's going to get a lot he's going to get pushed a lot in this movie cuz is Batman super popular do Google Trend search right now Batman is more popular than Superman Batman is the most popular uh superhero on YouTube that's been proven so yeah EST bringing in a new character they're going to need you to bring you up to speed on Batman they're going to show a lot of Batman a lot of Bruce Wayne but I think that's a bad thing we saw a lot of Superman this time around at least Clark Kent and that was that again I like the fact that Clark in the movie is still Superman I never lik to Kill Bill uh Clark Kent The Mask Superman the alien is the real person when you say that that's when you lose me when you talk about Clark Kent being a downhome American farm boy and that's what you",
      "start": 2408.36
    },
    {
      "text": "Kill Bill uh Clark Kent The Mask Superman the alien is the real person when you say that that's when you lose me when you talk about Clark Kent being a downhome American farm boy and that's what you know Superman eventually is too I'm with you all American um kaky Irishman responds Jesus is Batman uh typ pant sad says can we get a beyond beyond yeah I think we covered it so I'm going to sign off here in a second but yes remember ladies and gentlemen Ben Affleck he's a good guy we like we like a lot of the things he's done right let's not be quick to throw him under the bus here um is he going to do the Voice who knows I don't care but Ben Affleck's good as a person as an actor yes he's made some bad films but you're if you hate Ben Affleck your job is to watch Hollywood Land Oro the town go watch those movies oh and then Wallat of course but everybody loves Mall Rats I'm not really concerned at selling you on Mall Rats you should if you're watching this video you you've already watched Mall Rats and",
      "start": 2448.76
    },
    {
      "text": "those movies oh and then Wallat of course but everybody loves Mall Rats I'm not really concerned at selling you on Mall Rats you should if you're watching this video you you've already watched Mall Rats and loved it so internet calm the down Beyond",
      "start": 2499.6
    }
  ]
}
