{
    "id": 1696,
    "video_id": "hVIDvyKyKc0",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "Should You Play Ratchet and Clank and Quantum Break? - Kinda Funny Gamescast Ep. 66",
    "description": "We give our reviews and impressions of Ratchet and Clank, Quantum Break, and all the other games we are currently playing. (Released to Patreon Supporters on 04.15.16) \n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1461308400,
    "duration": 5058,
    "transcript_chunks": [
        {
            "text": "What's up guys, welcome to the first ever episode 66 of the Kind of Funny Games cast only three away gentlemen. Oh my god, what are you planning for the big 6-9? I emailed myself, because that's my new to-do list, is I email myself so then I can knock it off and delete as I go. Oh that's interesting. It keeps me good because I always try to zero out the inbox, so I'm not successful at it. It's a good way to remind myself of the things I have to do. So playing games cast 69 is an email I just sent to myself today. What are we going to do? Probably nothing. If anyone has ideas, please send it to us and we'll adjust accordingly, but probably not. I like your jacket, I like your outfit. I like it a lot. I wish that says 69, but it doesn't, it just says 20. Damn well. You can technically go and get those removed I guess and put them in. Thank you Kevin. That's too much work. That's stitched in, you can't get that removed. Yeah I guess you're right. Thank you. Thanks Kevin. You're all great.",
            "start": 0.0
        },
        {
            "text": "get those removed I guess and put them in. Thank you Kevin. That's too much work. That's stitched in, you can't get that removed. Yeah I guess you're right. Thank you. Thanks Kevin. You're all great. As always, I'm Tim Gettys, joined by the coolest dudes in video games, Colin Moriarty and one Greg Miller. Hello. In a funhouse shirt. Yeah. It looks like Fallout. It does. See did you get it? That's the whole thing. That was the thing. Yeah. It was a good thing. They did it. This is the Kind of Funny Games cast. Every week we get together, talk about video games, and then you can get all of that video content over on YouTube.com slash Kind of Funny Games Monday through Thursday. There'll be a topic there for your needs. Then you go to Patreon.com slash Kind of Funny Games, get the whole thing early or do a bunch of other stuff just like Steven Insler did. Steven Insler, Patreon producer of the month. Oh thank you Steven. Should have had it ready. Didn't. I will next week. It'll be great.",
            "start": 50.2
        },
        {
            "text": "early or do a bunch of other stuff just like Steven Insler did. Steven Insler, Patreon producer of the month. Oh thank you Steven. Should have had it ready. Didn't. I will next week. It'll be great. You won't. You can't even play in episode 69. You're not going to have no horn ready. Maybe that's, you know what, forget it. We'll get there someday. Steven Insler, he went to their Patreon.com slash Kind of Funny Games, supported the show to help make it happen. So he's the Patreon producer. But yeah, you can go there for way less money. You can just get the show early, get exclusive episodes, do all that other stuff. Perks. Perks. Good things. So many perks. All the good perks. All the good perks. But today we got a really good show planned. I'm excited about this. Is this worth a dollar? This one will be worth a dollar. Let me tell you why, Greg. This one's going to be worth a dollar because we're finally getting to the point where video games are coming out this year. You know,",
            "start": 89.96
        },
        {
            "text": "This one will be worth a dollar. Let me tell you why, Greg. This one's going to be worth a dollar because we're finally getting to the point where video games are coming out this year. You know, there's been a couple months of just us bullshitting over and over about VR. Talking about all this shit. Now here we're actually playing some games. So we had a lot of games to talk about that we've been playing. Usually I'd start the show off with a what have we been playing topic. But because we played a good amount of a couple of games, I want to start with those. Third topic is going to be what we're playing. First topic is going to be Ratchet and Clank. Second topic is going to be Quantum Break. So that's a little preview. Wow. First topic, who knows? Yeah. Impossible to guess. Probably brought to you by the kind of funny force. Anyways, all right, let's start off Ratchet and Clank. Greg, have you played it? No. Well, let's play you and I did, but then you both have been heads down in",
            "start": 135.36
        },
        {
            "text": "to you by the kind of funny force. Anyways, all right, let's start off Ratchet and Clank. Greg, have you played it? No. Well, let's play you and I did, but then you both have been heads down in it. Colin's beaten it. You have not. Almost beaten it. Not beaten it yet. Fucking fantastic game. Colin, tell the people. It's fantastic. It's a fantastic game. It's one of the, I kind of went on a little thing on PSI Love You this week about, so people will listen to it, I guess last week by the time they hear this for the most part. It's surprisingly and shockingly awesome. I knew it was going to be great or good at least. I mean, it's a Ratchet and Clank game. The core Ratchet and Clank games are at the very least good with the exception of the travel defense shit and the all for one, like no one wanted that kind of stuff. But this is a return to the forum for Ratchet and I said with the exception of Resogun, the best exclusive on the console. And it's shocking to me that this reminds me a",
            "start": 175.52
        },
        {
            "text": "wanted that kind of stuff. But this is a return to the forum for Ratchet and I said with the exception of Resogun, the best exclusive on the console. And it's shocking to me that this reminds me a lot of Until Dawn in the sense that, do they not understand what they have? I don't understand how this game isn't being pushed harder. They have a movie that I guess they're hoping is going to kind of tangentially promote the game. The game will tangentially promote the movie. I understand that kind of like synergy that they're trying to get between the two products, but this game is so much better than some of the other stuff that they've released, like the order or even infamous or knack that it's like, why wouldn't you try to get behind this game and really push it? And the good news is that the word is out. I've been hearing a lot of anecdotal evidence that they way under shipped, it seemed like, because no one can find it and digital bro. You can buy digitally, of course, unlimited",
            "start": 213.12
        },
        {
            "text": "the word is out. I've been hearing a lot of anecdotal evidence that they way under shipped, it seemed like, because no one can find it and digital bro. You can buy digitally, of course, unlimited amounts. But I've heard from like a lot of people on Twitter just anecdotally that it's hard to find like that. They've gotten every Best Buy. They've gone here and there to eat or whatever, whatever the fuck they buy games out now and they can't and they can't find it. So it seems like Sony might have underestimated demand for the game. But I think that it's a really fantastic, fun, funny, cute, well-made, beautiful game with very little downside. There's a few frustrating parts and a few kind of issues like that, but technically it's great, runs great. No crashes in the 12 to 13 or 14 hours I've played. No crashes is the only problem. No crash, no proper noun. And I think that it's just, it reminds me of a different time in gaming and I feel like these kinds of games can't live again, but I",
            "start": 254.8
        },
        {
            "text": "played. No crashes is the only problem. No crash, no proper noun. And I think that it's just, it reminds me of a different time in gaming and I feel like these kinds of games can't live again, but I think that they can live again once in a while. And I think that this is a really nice, if they're made right. And I think this is a really nice example of that. And the other example I used on PSI.LoveYou was Sly 4 from Zanzara, which I think is another example of a great old school game made new again that we might not really need every year. But my assumption with this Ratchet game is that it was probably cheap to make. Insomniac made it and it seems like their satellite studio in North Carolina really did the brunt of the work. And they're only charging $40 for it, which is shocking. That's the crazy part. But I think that that's an investment on their part. I think that they understand that Ratchet kind of stayed as welcome for the last decade or whatever, or two decades almost. And",
            "start": 301.7
        },
        {
            "text": "the crazy part. But I think that that's an investment on their part. I think that they understand that Ratchet kind of stayed as welcome for the last decade or whatever, or two decades almost. And now that the movie's coming out, it is kind of the resurgence, it is the reboot and it's kind of getting in front of a whole new generation of people. And I think that the $40 price point, I think it's smart because it's gonna, people are gonna see the movie and they're gonna be like, well shit, I need to get the kids this. I think it works both ways, right? And the fact that I'm like, I'm a guy who's like, yeah, Ratchet's great. I loved cracking time, you know what I mean? But I haven't been aching for more Ratchet. So when another Ratchet's coming, I'm like, all right, but now it's out and everybody loves it and it's getting these great scores and it's cheap. Okay. And then when the movie does roll around, people leave that theater and they're like, oh man, Ratchet's cool. I'm gonna look",
            "start": 344.26
        },
        {
            "text": "loves it and it's getting these great scores and it's cheap. Okay. And then when the movie does roll around, people leave that theater and they're like, oh man, Ratchet's cool. I'm gonna look at, oh, it's only 40 bucks. Sure. Why not? And I think that I think the biggest thing with the price point is for the people that have played Ratchet over the last hella long where they know what they're getting. And my thing is, I think this game is as close to a perfect game as possible where I am having so much fun with it. I keep thinking about it. I want to come back to it. It's gameplay loop is awesome. I'm addicted to making sure that every single weapon's upgraded and the system they have with the grid where you kind of look like the cards and the grid thing, all of it. It's like, I like this. I want more of this. But the game, since it is a remake or whatever it is, re-imagining of the first game, it is a bit familiar and it's also a bit empty overall compared to A Crack in Time or even",
            "start": 379.98
        },
        {
            "text": "I want more of this. But the game, since it is a remake or whatever it is, re-imagining of the first game, it is a bit familiar and it's also a bit empty overall compared to A Crack in Time or even Tools of Destruction. Those had a lot more going on. Specifically Crack in Time had that big war sequence where there was so many people and you have to use all of the gadgets and weapons and stuff. This game doesn't have that. And I think it's obviously because it's just remaking the first one. So I think that that is kind of where the price point comes in too, in that it's for the hardcore Ratchet fans, it is a little bit of a concession with all of it. But it's amazing. Like it's so good and it's so much fun. And I think that this is a good sign that the next one, built from the ground up being an old original game, I think that's going to be something really special. Yeah. I wondered if they painted themselves in the corner a little bit with the price point and they have something to",
            "start": 418.06
        },
        {
            "text": "being an old original game, I think that's going to be something really special. Yeah. I wondered if they painted themselves in the corner a little bit with the price point and they have something to fear, I think, if they go back to Ratchet and Clank again, which I think they obviously would and should. There's the precedent now that this is going to be like a subpar A game that at a price point that's going to be, can they go back and charge $60 for a Ratchet and Clank game now? It's like one of the things they have to worry about later. They don't have to worry about that now. But I think that it's so it is a reimagining in some respect of the original game, but there are a lot of differences. There are a lot of things that are the same too. I mean, but there's new systems. And I liked going back to these different planets that I hadn't seen in a long time. But I remember this sequence. I can't remember the planets name, but the one sequence where it's like the kingdom kind of and",
            "start": 460.04
        },
        {
            "text": "going back to these different planets that I hadn't seen in a long time. But I remember this sequence. I can't remember the planets name, but the one sequence where it's like the kingdom kind of and there's like the river flowing through it. It's like early in the game. And yeah. And like and you see and you see it on the Vista and like you go down the elevator and something like I remember this and it looks so much prettier now. And I think the cool part of the visuals of it are that I mean, everyone, if you look at this game, it is one of the most gorgeous games ever made that I've seen for any console and its style otherwise. And all of that. Right. It's just it nails it. But what's crazy to me is you remember what Ratchet and Clank looked like. Like I remember what I thought when I first saw the PS2 one. And I remember thinking, this looks like a Pixar thing. And it's like now you look at it like, oh, but now you look at this and you're like, this actually does. And that's the",
            "start": 499.58
        },
        {
            "text": "first saw the PS2 one. And I remember thinking, this looks like a Pixar thing. And it's like now you look at it like, oh, but now you look at this and you're like, this actually does. And that's the crazy part. But what's even crazier to me is this game looks better than I remember Ratchet looking. Usually it's you remember things looking super good. And when you see a new one, you're like, oh, this is kind of how I remember it for me. This is even better than my memory. And that's the biggest accomplishment you can do. Yeah, I think the the the interesting things to me are and I don't remember the story very well anymore. Like, but I remember as I discussed, I think on the podcast, the other podcast, which was Ratchet and Clank didn't like each other. And that was like one of the super uncomfortable things I remember in the first. I think I might have just been in the first game. Yeah, it was. And I know that I feel like when I was talking to them about history of Insomniac years",
            "start": 534.5
        },
        {
            "text": "uncomfortable things I remember in the first. I think I might have just been in the first game. Yeah, it was. And I know that I feel like when I was talking to them about history of Insomniac years ago, when I was writing that at IGN, that they were talking about how they knew that that wasn't necessarily something that maybe was the smartest idea. And they totally removed it. Like the it's funny how they kind of revise the story. It's through a different perspective now. I don't like, you know, with Quark kind of telling the story and Ratchet and Clank are just quick friends. And it seems like the story is not as fleshed out anymore because there's no strife between them. And I like that. Like, I always was like, why don't they like each other? Like, this is like one of the things it's Ratchet and Clank and Ratchet versus Clank. And so I like that they kind of revise that the pre rendered cut scenes, which are there actually is like a lot of pre rendered cut scenes in the game are",
            "start": 569.08
        },
        {
            "text": "Ratchet and Clank and Ratchet versus Clank. And so I like that they kind of revise that the pre rendered cut scenes, which are there actually is like a lot of pre rendered cut scenes in the game are really pretty. The new boss fights are cool. They even like revised a lot of things in the game, like collecting the brains and all this kind of stuff like to kind of add things into the game. And then the back end structure, which I think you're right about with collecting raritanium, obviously to upgrade your weapons, plus the leveling system or each weapon, which natively upgrades them. And then the collectible card system, the challenge mode has been stripped out of the game and kind of put into sort of the main line, the main game itself. Right. Right. The campaign. Right. Exactly. In the original Ratchet games, there was like a challenge mode that was like in the back of the game that you can like do this and you get like a point or whatever. That like isn't an option the first time",
            "start": 603.76
        },
        {
            "text": "original Ratchet games, there was like a challenge mode that was like in the back of the game that you can like do this and you get like a point or whatever. That like isn't an option the first time through anymore. It seems like I never even I haven't played it through again. I want to because I want to get some of the trophies and stuff, but it seems like they've kind of stripped that out and put that into the next part of the game, like if you play it again. So while it's not a difficult game by any stretch of the imagination, like the times I died in the game was because I was like trying to use weapons that I shouldn't be using because I want to upgrade them equally. I mean, that was like I was like my obsession the entire time I was playing the game. And it's fun. Yeah. Dying is fun in this game. Yeah, because there's no penalty and you can ratchet it up to hard if you want to have a harder experience. But, you know, to me, it's it's ratchet and clank on PS4 is is almost like a",
            "start": 641.9
        },
        {
            "text": "in this game. Yeah, because there's no penalty and you can ratchet it up to hard if you want to have a harder experience. But, you know, to me, it's it's ratchet and clank on PS4 is is almost like a must play game. I really I thought I would like it. I knew I would like it. I like ratchet. I like insomniac, but I didn't realize I'd love it like this. And so I really highly recommend it. I would go as far as to say it's the best game I played this year and maybe the best game I played in a long time. So I agree with you completely. And I think that it modernized the franchise in such an important way. And again, like the future series on PS3. So when it was Tools of Destruction and Crack in Time, those also modern modernized it a lot. So it's not like this is like a completely mind blowing thing. But being able to hit the L2 button and do the strafing and stuff, you couldn't do that in the original than the first round. And it's like that makes it it changes the dynamics of it a lot.",
            "start": 674.9
        },
        {
            "text": "thing. But being able to hit the L2 button and do the strafing and stuff, you couldn't do that in the original than the first round. And it's like that makes it it changes the dynamics of it a lot. And I thought it was it's a lot of fun to use the weapons and it makes shooting and stuff a lot easier. And it's less old school 3D platformer. And it is more modern third person shooter and stuff like they really kind of master that with deadlocked on the PS2 generation. And I love that it wasn't until you you brought up the ratchet and clank not liking each other. I don't even remember that. But then I was like, oh, shit, that's right. Like it was really awkward. Yeah. The story was weird. Like you didn't it wasn't like Jak and Daxter where they were friends. They had a history already. Like they were you were kind of jumping into their life. Like you meet Ratchet when he's meeting Clank so they could go anywhere with it that they wanted to. And I like that they revised that because I",
            "start": 716.58
        },
        {
            "text": "they were you were kind of jumping into their life. Like you meet Ratchet when he's meeting Clank so they could go anywhere with it that they wanted to. And I like that they revised that because I think that it was it's it's it's it almost wasn't kid friendly in a way like it was like awkward and weird and I didn't like it. I remember not liking it. And I remember being kind of put off by it, not not ratchets a great. I like ratchet as a character more than I like Clank as a character. But I wanted them to get along together. And I don't want to underestimate the humor in the game either. It was the first time since I played South Park A Stick of Truth where I was like laughing out loud at things in the game. Like there's just a lot of funny shit in the game. I remember there's just like really weird scenes like after Ratchet gets back from like something really bad. He's talking to Clank in the garage and he's like, you know, it's such a catastrophe or whatever. And he's like, I",
            "start": 757.02
        },
        {
            "text": "really weird scenes like after Ratchet gets back from like something really bad. He's talking to Clank in the garage and he's like, you know, it's such a catastrophe or whatever. And he's like, I wouldn't call it a catastrophe. And then there's like a TV in the office with a guy watching and the newscast is talking about how it's a catastrophe. And you see the guy just take the remote and like lower the volume on the TV and like kind of look away awkwardly. It's like there's a lot of really funny shit that they didn't have to do that took probably more time than it needed to have little hits like that. And there's a lot of them in the game. The writing's awesome. Zorkon's awesome. The, you know, Quark's awesome. Like there's a lot of just solid comedy in the game that I think kids and adults alike will laugh at. That's a good question. Does it feel like a kids game? It's yeah, I think it does. I mean, it's definitely a kids game, but it's a Pixar movie. You know, that's the best way",
            "start": 791.02
        },
        {
            "text": "alike will laugh at. That's a good question. Does it feel like a kids game? It's yeah, I think it does. I mean, it's definitely a kids game, but it's a Pixar movie. You know, that's the best way to put it. Not only does it look like it, but it's like it's adults can enjoy it. Kids can enjoy it. Is it a kids movie? I mean, yeah, I guess it is. Is it a kids game? I guess it is. But like doesn't affect the enjoyment of it. Sure. I was just asking. It's a game. That's what I like about it. It's a fucking game. It doesn't take itself seriously. That's like it's just not this like overwrought social message. Yeah. Like after playing The Division, which is a great game, but this is, I think, far better than The Division in terms of just enjoyment. You can't really compare them. But I think I had more fun playing this than I did The Division. It's just like it's nice to see again. It's not like so like into itself. You know, it's like it's just it is it's just a game. Well, it's into itself",
            "start": 824.5
        },
        {
            "text": "more fun playing this than I did The Division. It's just like it's nice to see again. It's not like so like into itself. You know, it's like it's just it is it's just a game. Well, it's into itself in a fun way, like all the self referential stuff about. Yeah. You know, it's a movie based on a game based on all that stuff. It's like that's great. Like it's it's it never goes too far. I'd say it's a very kind of funny game. Like it's not hilarious. It's consistently it's pretty funny, you know, and that's good. And that's something that the series has always done for me. Like I remember the PS3 ones, like they were making jokes about Myspace and stuff, which at the time made sense. I think this game, you know, we might not be funny in 10 years, but right now it is. And they did take a lot of time to make sure that it was funny for audiences now. And it shows. So, yeah, I recommend it. You should play it. I recommend it. I want you to play it. I will. Yeah, eventually. It's it's super",
            "start": 863.42
        },
        {
            "text": "of time to make sure that it was funny for audiences now. And it shows. So, yeah, I recommend it. You should play it. I recommend it. I want you to play it. I will. Yeah, eventually. It's it's super fun. And I what I'm most interested to see now is that clearly this game is going to do very well. So what does it mean for Ratchet moving forward? And will Insomniac be interested in making another one? And I hope that if they do, that they don't go back to going command or anything like that, but that they just they just kind of make a new one. Yeah, I don't think that they would. You know, I think that they they they would have to just make a new sequel that is its own thing based on a second movie. I don't know. Although I want to be clear that this game isn't the first game like it like it is, but it isn't a beat for beat remake of the first game. And that's why I thought I was getting myself into it, which is why I was not that excited about it, because I'd played the first game",
            "start": 904.14
        },
        {
            "text": "it is, but it isn't a beat for beat remake of the first game. And that's why I thought I was getting myself into it, which is why I was not that excited about it, because I'd played the first game twice. You know, so it's not it's not it's not the first game. It's it's the first game kind of. And I say 80 percent. Yeah, but I think the beats are different. There are completely new places to go like their new bosses, the the you know, like it's the story's different. So I think that there's the story is the same but different. I mean, OK, so if anyone watches and reads The Walking Dead, it's very similar to that where it's like it is the same thing, but it's different enough that it's like you're surprised at moments. And there is things that come out. You're like, oh, shit, like you're getting to the same, you know, end goal. But like it's a different ride. Are you excited for the movie at all? No, not really. I mean, I I want to see I'm interested in how the movie does, because I was",
            "start": 938.58
        },
        {
            "text": "to the same, you know, end goal. But like it's a different ride. Are you excited for the movie at all? No, not really. I mean, I I want to see I'm interested in how the movie does, because I was kidding around that this movie is so, so late, like 15 years later, Ration Clean came out in 2002. So it's it's been out for almost 14 years and they probably should have done this movie during the PS2 era. But they're doing it now. And I wonder if this really is going to be an example of a series that was dormant or dying, because I think that Insomniac, not to its own credit, because they're a great studio, but Sony and Insomniac together really almost did their best to kill this franchise. And with all for one and with what was the fucking tower defense one? I can't even think of the name of it into the nexus wasn't into the nexus wasn't bad, but it was a budget short court ratchet game that was made very quickly quest for booty. Yeah, exactly. Like it's it's they just didn't give it the",
            "start": 982.14
        },
        {
            "text": "it into the nexus wasn't into the nexus wasn't bad, but it was a budget short court ratchet game that was made very quickly quest for booty. Yeah, exactly. Like it's it's they just didn't give it the love and care that a crack in time in 2009 really gave the series. That was the last time the series got something it deserved, like it deserved. And because Ratchet deserves love and it deserves care. And that's why I was so excited about with Sly for with Sanzaru is that I think that that game fits congruently with Sucker Punch's games. So I was excited to see a game that has fine production values and a lot of time and effort put into it. It is beautiful and it is fun and it is finally made. And Insomniac deserves a lot of credit. And Sony deserves a little bit of a shrug in terms of like, why aren't you pushing this harder? You know, it's the same thing with Until Dawn. You push the order 1886 hard and you don't push, which that game's garbage compared to this game. I think that",
            "start": 1025.02
        },
        {
            "text": "like, why aren't you pushing this harder? You know, it's the same thing with Until Dawn. You push the order 1886 hard and you don't push, which that game's garbage compared to this game. I think that bothers me. You know, like it's like, come on, like this, this this do this game justice. You have to know that this game's great. Yeah. And why aren't we hearing anything about it? Full frontal assault with Tower Defense. And I still think that I think this is what we were talking about earlier. I think that you get out the game now to appeal to gamers, the game stuff's doing it. And then when the movie comes, that's when there's a real push in theaters and on this. And we were talking maybe two months ago about is this even in theaters? Like we were a little unclear on if it was just a digital only game or if it was movie theaters. We're like, oh shit, it's actually a movie. And then every time we went to see a movie, there's a stand up all the time. Yeah. Like Ratchet and Clank. And",
            "start": 1063.84
        },
        {
            "text": "only game or if it was movie theaters. We're like, oh shit, it's actually a movie. And then every time we went to see a movie, there's a stand up all the time. Yeah. Like Ratchet and Clank. And it's like, damn, this is a real thing. This is a real thing. And I went to see Zootopia and every single trailer before it was CG talking animals. But Ratchet and Clank was in there and it was a step above all the other shit I saw. And it's like, I mean, I'm a fucking grown ass man. So, you know, like eight year old kids next to me might not be able to tell the difference, but maybe they can. I don't know. I guarantee you that all the parents that took their kids to see Zootopia. If they're watching all those trailers, if they're going to be like the next movie we're seeing, they would choose Ratchet and Clank. Nice. Because the trailer definitely it the movie, it looks good. And they have the voice cast plus more and stuff. I think it's great. This is the first shot at a video game movie being",
            "start": 1100.68
        },
        {
            "text": "and Clank. Nice. Because the trailer definitely it the movie, it looks good. And they have the voice cast plus more and stuff. I think it's great. This is the first shot at a video game movie being good, a distributed video game movie in theaters and stuff, because it's like, I mean, it is the source, you know, they are working on it. And it's like that, as far as I know, hasn't happened before with movies. But anyway, I'm pretty excited for it. And I overall for the whole series, like I'm excited to beat the game. I still got more to play. The last boss fight, I think, is a little underwhelming just in the sense that it's easy, but the game's easy. It's not hard. So but that's not that's not my plan. I was nice to just play a very loose kind of just a video game and not something with like a, you know, like Greg was saying, like a social message or it's like so weighted down. It's like those games are great. And I like playing those games, but it was refreshing to play this game and",
            "start": 1134.64
        },
        {
            "text": "a, you know, like Greg was saying, like a social message or it's like so weighted down. It's like those games are great. And I like playing those games, but it was refreshing to play this game and take a step back to simpler times. It was rashing clean. Yeah, I think that's it's a bravado insomniac. They really needed something. They make great games. But, you know, after sunset didn't do very well on Xbox one and resistance is kind of dormant or dead and no one really liked Fuse. And it's you know, they've they've been kind of struggling a little bit there. And I've really been pleasantly surprised that there are still a vast studio of employees, like a lot of people. So they're finally they seem to be doing well financially. And this should hopefully help buttress them a little bit. And hopefully they get another contract to do the next one. And hopefully it's a sign to that Sony might trust them to bring back resistance as well, which I think would be which one the resistance movie",
            "start": 1174.16
        },
        {
            "text": "hopefully they get another contract to do the next one. And hopefully it's a sign to that Sony might trust them to bring back resistance as well, which I think would be which one the resistance movie comes along. We'll have to. Resistance would be a good movie if you did it right. Following skies. No Wiley, what up? So yeah, congratulations to insomniac. Congratulations to Sony. Push this game. I think I think it deserves to be pushed. And yeah, we'll see. We'll see if this kind of game resonates and if we get more of these games in the future, because the only other one that I can really think of that's outside of the Nintendo wheelhouse, of course, is is you. So that's like that people give a shit about. So I would I would reckon that you're going to see some restraint on this because you haven't seen restraint on other trends that I think haven't panned out very well. Like everything's open world, everything's nonlinear, everything's choice based. It's like, all right, well, we get",
            "start": 1221.08
        },
        {
            "text": "haven't seen restraint on other trends that I think haven't panned out very well. Like everything's open world, everything's nonlinear, everything's choice based. It's like, all right, well, we get those once in a while. Speaking of that in this game, like I have fun in exploring the worlds, like having all the the raritanium and all the random cards and stuff like it really gives you a good reason to check every nook and cranny. And the nooks and crannies aren't that far. So it's not it's not too much to handle. It feels attainable. It feels attainable and it's fun. And like this game is fun. That's the most important point I want to get home. And if you are thinking about buying it, do because it's fun and it's awesome. And there's a lot of depth to it, even though it's easy. There is a lot of depth to the game, to the systems of the game replayability. Nice trophy list. So it's hard to platinum it. No, you have to be done challenge mode. You have to kind of find all the gold bolts",
            "start": 1252.4
        },
        {
            "text": "lot of depth to the game, to the systems of the game replayability. Nice trophy list. So it's hard to platinum it. No, you have to be done challenge mode. You have to kind of find all the gold bolts and stuff. I mean, it's not going to be like a huge deal, but there are a lot of like incidental bronzes that are going to be the most annoying, like, you know, ride every every. Escalator or whatever, without moving and stuff like that, like that shit's going to be annoying. Yeah. So I don't know that I'm not going to try to do that, but there are a few trophies. I'd like to pick off and go back to and mess with the challenge because I do like how they still have that in there, but it's something you kind of have to unlock as opposed to doing it, because I don't I don't remember ever. I remember that being available at the beginning could be wrong, but I don't think that it was. Locked away. I think you're right about that. So Greg. Yeah. While we were playing ratchet and clank, right.",
            "start": 1292.4
        },
        {
            "text": "that being available at the beginning could be wrong, but I don't think that it was. Locked away. I think you're right about that. So Greg. Yeah. While we were playing ratchet and clank, right. You were playing a little game called quantum break. I did. I played quantum breaker over the weekend and beat it over the weekend. Tell us all about it. Tim, I really enjoyed it. I liked quantum break quite a bit and I was happy about that because coming in, it seemed like the reviews were a bit mixed and it wasn't sure where it was going to go, but based on the let's play, I had done, you know, weeks back with remedy when they were came through town, I was like, fuck. Because like when quantum break originally got announced and we didn't even know what the fuck it was, we're seeing a fucking ship hit a bridge. And then this lady's got glass coming out of her eye and stuff. It seemed cool. And it was exciting that remedy was doing something after, you know, I mean, Alan Wake, I enjoyed as",
            "start": 1331.6
        },
        {
            "text": "ship hit a bridge. And then this lady's got glass coming out of her eye and stuff. It seemed cool. And it was exciting that remedy was doing something after, you know, I mean, Alan Wake, I enjoyed as well. I was interested to see them try something new though, but keep doing the storytelling they're known for. And so I was like, okay, cool. It was very much one of those games of like, I'm blackout. I don't even know anything about it. You know what I mean? I don't have any real desire to know more about this until I get my hands on it. So we sat down to do, let's play. It was that, Oh, Oh, okay, cool. Like the story seems cool. The acting seems cool. I like where it's going. I, you know, when we're talking about all these different things, I had not never really stopped to think about how mechanically it was going to play. And so like to sit down and be like, Oh, it's a third person shooter. Like it's unabashedly a third person shooter picking up, you know, your machine gun, you have",
            "start": 1364.16
        },
        {
            "text": "mechanically it was going to play. And so like to sit down and be like, Oh, it's a third person shooter. Like it's unabashedly a third person shooter picking up, you know, your machine gun, you have a handgun, you have your machine gun slot, your handgun slot, and then another gun slot. You know what I mean? Like, Oh cool. I'm picking these up and running around and killing these things. Transitioning into that was cool during the less play, getting a taste of the powers and less plays cool. But then to sit down and play the entire game, that's when it really all clicked together. And what I found the most interesting about it was the fact that what I thought, you know, could have been their Achilles heel was those live action segments, right? Like remember how confusing this was when we're doing quantum break, it's going to be this narrative driven thing. It's a game. But then there's also TV episodes in there. And it was so confusing when they announced that of like, well, is this",
            "start": 1402.0
        },
        {
            "text": "doing quantum break, it's going to be this narrative driven thing. It's a game. But then there's also TV episodes in there. And it was so confusing when they announced that of like, well, is this part of Xbox's entertainment initiative? Is this something that's air? No, it's coming. Then you can't stream in the eventually when you get to it's like no, they just play in the episode and you're streaming them off the internet and done like, oh okay, that seems weird and stupid, but whatever you know what I mean, because how many times have we seen that where it's games try to transition some aspect into a real life movie, twisted metal exactly for speed exactly into those ever really work. Twisted metal is like a B movie, so that makes sense. You know what I mean, but this one where we're telling a real narrative, we're telling a real story. We've hired actors and actresses. You know, and you know this guy from game of thrones, ice man, a morphs. Sorry, man. He was in animal. Sean",
            "start": 1435.04
        },
        {
            "text": "telling a real narrative, we're telling a real story. We've hired actors and actresses. You know, and you know this guy from game of thrones, ice man, a morphs. Sorry, man. He was in animal. Sean Ashmore. Yeah. We've brought these people in that, you know, from films and TV and you know how they're supposed to look. So now we're going to go transition back and forth like, oh, is that going to work? But what was fascinating about it and what it sounds like such a marketing bullshit point of like, cause it was like, oh well, the game you're playing through, you're playing through is the hero, you know, going up against a monarch. Then the episodes you watch are about what's happening with monarch and what the bad guys are up to in this, this world. You're like, all right, that kind of sounds stupid and it's going to be cliche and dumb and whatever. And it went the opposite where I'm playing through the first level. I'm going to meet my buddy and there's this dude over there. He's like",
            "start": 1470.32
        },
        {
            "text": "stupid and it's going to be cliche and dumb and whatever. And it went the opposite where I'm playing through the first level. I'm going to meet my buddy and there's this dude over there. He's like sitting there in a black trench coat and he's like, just keep, you know, the protest over there. I'm like, oh, like you're going to do something like you're a bad guy. And sure enough, he's a bad guy. He's like roughing you up and you know, he's like a henchman or whatever. And you're like, well, fuck this guy. Stupid and just generic ass henchman. And then that first episode is so centered and the whole, the rest of them are so centered around his plot thread. And it's this plot thread of all the, it's the multiple plot threads of all the people who are working for a monarch, who are the bad guys, even if they don't know, they're the bad guys, really. You know what I mean? And you're going through and meeting them and this stupid henchman, right? That's like totally a throwaway dumb",
            "start": 1507.2
        },
        {
            "text": "bad guys, even if they don't know, they're the bad guys, really. You know what I mean? And you're going through and meeting them and this stupid henchman, right? That's like totally a throwaway dumb character. And seems like your typical, like, I'm just, you know, this fucking mountain of a man, I'm a white guy with a gun. You're going to do this, da, da, da, da. And then to go with him back home and meet his wife and see what's happening and then see him. It's always the wife. It's always the wife and see how his relationship with her and then the company and his bosses and how it all develops and how it goes and his story throughout it. It was like, fuck, this is really good. And I started getting super excited with it because it would be like, I'm getting hungry. Oh, I'm going to hit it. I'm going to hit an episode soon and I'll pause it as soon as it starts. And then I'll go cook dinner and then I'll come back and sit and watch. And that's what I did. I planned, I didn't plan, but",
            "start": 1540.56
        },
        {
            "text": "I'm going to hit an episode soon and I'll pause it as soon as it starts. And then I'll go cook dinner and then I'll come back and sit and watch. And that's what I did. I planned, I didn't plan, but like every time I was ready for a meal during this one giant gameplay day, I'd want, you know, make sure that I was ready to watch an episode while I did it and you're meeting characters in the episodes that you won't meet in the game or see in the game. Then there are times that you are, of course, going to cross over that Sean Ashmore is in it or whatever, or the guy from game of thrones. I have it up because I'm going to screw it up. But what a Aiden, Aiden, I was one of the stupid item that still screws me up from David Cage. Who is he in game of thrones? A little finger. Got it. That's right. Yes, he's he's the bad guy and he's the monarch guy or whatever. And so he's in both of them and it works in the fact that the game doesn't run in that uncanny valley scenario where I'm watching",
            "start": 1581.36
        },
        {
            "text": "Yes, he's he's the bad guy and he's the monarch guy or whatever. And so he's in both of them and it works in the fact that the game doesn't run in that uncanny valley scenario where I'm watching the game or playing the game or I'm watching the episodes and playing the game and be like, this doesn't look good enough. They don't look real enough. This isn't, you know, I mean like you get over that where they transition, you know, when they transition out, it's, it's awesome. It does work. And then what it's what I love about it. And again, it's not stupid because I was just blacked out. I didn't want to know much about it, right? Is I love all the time travel stuff they fuck around with and do different stuff with. And you knew that was going to be there. It's quantum break stopping time. But as much as you're going back into the past and fucking with the timeline and their version, every version of time travel and the timelines a little bit different, right? And there's totally is the",
            "start": 1616.56
        },
        {
            "text": "as much as you're going back into the past and fucking with the timeline and their version, every version of time travel and the timelines a little bit different, right? And there's totally is the thing of like, well, the past had to happen the way it happened to get us to here. So that will always be the thing, no matter what you can't change that and trying to fuck with that or trying to change it or trying to fuck that stuff up is great. And then it gets really cool in the fact that like, so you're playing as through the episodes and you're playing as Jack Joyce, you're running around and you're, you know, you're this guy trying to help your brother Dominic Monahan, what up and do all this different time travel stuff. That's what you play as. And then when you end one of the acts as him or whatever, you get this interstitial where you go off and play as Aiden or whatever, and the bad guy in Monarch or whatever. And you play a real short section with him where you make a choice that",
            "start": 1654.64
        },
        {
            "text": "or whatever, you get this interstitial where you go off and play as Aiden or whatever, and the bad guy in Monarch or whatever. And you play a real short section with him where you make a choice that then influences like is the branching path for that. So it's like the first one that was in our let's play ride is, you know, some people saw you, you guys came in to get Jack and his brother, a whole bunch of protests saw you, you capture all these kids on campus basically. And you have all these kids and it's like, what do you want to do with these college kids? And like you have two choices in front of you that you get to like pull the trigger and then have him talk a little bit. I can see his time powers, give him a little bit of a ability to see what's coming, even though he can't see it crystal clear. So you get like little snippets of conversations and what they're saying. And so it's like your first choice with it that he's either with these kids, you can take this PR approach",
            "start": 1687.2
        },
        {
            "text": "it crystal clear. So you get like little snippets of conversations and what they're saying. And so it's like your first choice with it that he's either with these kids, you can take this PR approach where you're going to say, okay, what we're going to do is not, you know, we're all this one, the leader of the kids we're going to put on camera and she's going to read a statement blaming Jack. He's a terrorist. This is what happens, but she's going to still be, you know, you're not a lot of loose ends and people are going to do it, but the city will trust us for the most part that will, they'll be after Jack. The downside is that they'll have Jackson have these new allies and these kids that can help them and get them information. Or we can straight up murder all these kids. We can kill every witness, take them out, you know, do all this different stuff. But that the town is going to wonder what happened to all these kids in college and they're going to turn on you. And like, so you",
            "start": 1726.16
        },
        {
            "text": "every witness, take them out, you know, do all this different stuff. But that the town is going to wonder what happened to all these kids in college and they're going to turn on you. And like, so you have to, and like, that's just the first choice. And from there, I like every time you get to one of these points, you get those branching things that then not only change, of course, what things are going to happen in the game and ha it's going to change what happens in the next episode in a way it's going to be like, there's all these like ripple effects of it. And then in the game, there are these total, these are, I only, there's only like one or two, there's like neat little nods, but there it's neat little nods, right? Where in the game, you'll find things like there's an equation on a board again in the very early part of the game. But if you go up to and interact with your brother, they'll come up and be like, Oh, they got it wrong. And it'll fix it or rather than they'll go. And",
            "start": 1763.92
        },
        {
            "text": "board again in the very early part of the game. But if you go up to and interact with your brother, they'll come up and be like, Oh, they got it wrong. And it'll fix it or rather than they'll go. And then in the episode, there's then an optional scene where they like, did you know that somebody solved the equation last night? No, what? And they're talking about it. And then like the camera pans over and it's like a neat little nod to what you've done. There's like seven or eight of those in the game. They're like these little breadcrumbs to go fuck around with. But even without those, the episodes are cool and it works and it's fun. And what it's been interesting is I've seen a little bit of in comments and stuff and then Colin and I have talked about it before and like, he'd say, Oh yeah, but people are pissed about those cut scenes. Right. And I'm like, Oh, like they aren't cut scenes, right? They aren't like metal gear cut scenes where you're playing and then boom, this, like, it's",
            "start": 1795.92
        },
        {
            "text": "but people are pissed about those cut scenes. Right. And I'm like, Oh, like they aren't cut scenes, right? They aren't like metal gear cut scenes where you're playing and then boom, this, like, it's very clear, like you're playing, you're done playing. Here's your interstitial with the bad guy. And here's this episode. That is optional, right? Like you could skip through it and I think have a fine time with the game and play the game and the mechanics of the game would be really cool, but you wouldn't understand. Like, I mean, I think there's characters in the episodes I like more than people I like in the game, if that makes sense. You know what I mean? Like there's this one guy I pulled him up here. He tweeted back at us when I tweeted about it. Charlie is the character. Marshall Allman is the character, is the actor or whatever. And Charlie's whole story is super interesting because he is like, he's kind of a, what we always, you know, the Kevin Smith jokes of like stormtroopers,",
            "start": 1830.4
        },
        {
            "text": "is the character, is the actor or whatever. And Charlie's whole story is super interesting because he is like, he's kind of a, what we always, you know, the Kevin Smith jokes of like stormtroopers, right? Of like, do they know they're working for the bad guys necessarily? And like, so he's like doing all this stuff and then slowly kind of realizing how fucked up everything is and what's happening. And then like, cause they, once he doesn't know that there's like all this time travel shit happening until they see it firsthand and going through his story and do it. Like, I don't know. It's just, it was a really cool, really fascinating experience of playing. And I, I, I feel like I'm talking so much about the actors and the cut scenes. I enjoyed the gameplay so much because the gameplay did a great job of ramping you up to feeling like you're fucking awesome. Cause it is like you get the powers pretty quick and then it is like, you're going through and finding collectibles in the",
            "start": 1864.8
        },
        {
            "text": "did a great job of ramping you up to feeling like you're fucking awesome. Cause it is like you get the powers pretty quick and then it is like, you're going through and finding collectibles in the environment that then are like upgradeable points to make the powers better. And so as you get to the end and it's like you walk into a room full of dudes that before I'd been like, Oh fuck, like in cover jumping out of cover. But now it's like speed running around or I guess, you know, freezing time and running around really quickly and running up and fucking punch him, killing him, grabbing the one guy ripping his backpack thing off. And then like, you know, the, the heavy comes around that was such a hard fight in the beginning. And then all of a sudden you just like charge up your time powers and blast him with it. So he's slowly going down and you run up on a shotgun and just do. It's, it's like awesome. Like the, the, the combat and the way it all comes together is awesome. It falls. I",
            "start": 1899.28
        },
        {
            "text": "and blast him with it. So he's slowly going down and you run up on a shotgun and just do. It's, it's like awesome. Like the, the, the combat and the way it all comes together is awesome. It falls. I feel like I haven't played a pure third person shooter in a long time and it definitely falls into that. I think the trouble spot that so many do where it's like, all right, we're ramping up to the very end. So here's three corridors of every enemy you feel like, Oh Jesus Christ. And then some kids were bitching about it online for being hard. The final boss battle. I didn't have that experience. I just find it really boring like that. You know, but I mean like that's all just the normal thing of like, right? Like a game trying to end the game. I feel like every time you get to an end, you have a boss battle. Yeah. How are you going to do or whatever? I had a blast. I had a lot of fun. People keep asking me if I would play it again in a different world. Where we had more time and I'm more",
            "start": 1933.36
        },
        {
            "text": "a boss battle. Yeah. How are you going to do or whatever? I had a blast. I had a lot of fun. People keep asking me if I would play it again in a different world. Where we had more time and I'm more free time and there weren't a million games to play right now. I would totally run it again to see the different choices and how it all plays out. But I had a great time and I was super, super happy. It came through. I heard rumors, you know, I caught the headline on Twitter once in a while of like quantum breaks five and a half hours. And I was like, Ooh, is it wasn't for me. It was like, I think between 10 and a half, 12, I forget what my clock was at the end. And that was missing some of the collectibles, not having fully upgraded. I would go back and see how the other choices played out and stuff like that. Got a lot of questions. I know. Sorry. I just, I don't know. That was all out to you. So, uh, I don't, I don't really know how this works. How long are the episodes? About 20, 22",
            "start": 1974.24
        },
        {
            "text": "and stuff like that. Got a lot of questions. I know. Sorry. I just, I don't know. That was all out to you. So, uh, I don't, I don't really know how this works. How long are the episodes? About 20, 22 minutes. Okay. And how many are there ish? I would say there's five. If I, if I remember enough, that may have had how many acts or I could tell you precisely. There's four or five maybe. Okay. So it's not that much. No. So is it like, is the total length of it about a movie's length? Uh, of the cut scene or the cut scenes of the television episodes? Yeah, probably. Right. Cause that would be like what, 80 minutes right there if it was, cause there's at least four. Mm hmm. Yeah. So you said you could play the game with out watching the things cause they're optional, but they're not really optional. They're part of it. Sure. They're telling you cool things and making you care more about the characters. Could you watch just the movie and not, or just the show and not play the game? Oh, well",
            "start": 2012.08
        },
        {
            "text": "They're part of it. Sure. They're telling you cool things and making you care more about the characters. Could you watch just the movie and not, or just the show and not play the game? Oh, well no. Cause you have to unlock them. Oh, okay. Yeah. So they are, they are cut scenes, but they're optional cut scenes. Cut scenes to me always make it sound like, all right, cool. We've opened a door and the cut scene plays and I'm talking to you and dah, dah, dah. And then the cut scene ends and we're right back where we were. Whereas this is very much like, I feel like it's almost inter-splicing chapters. There's a chapter of gameplay. There's a chapter of this video, chapter of gameplay, chapter of the video, if that makes sense. Yeah. And it's one of those, like if you're in a mood and you just want to play the game, right. And just see Jack story and you don't care what, why monarchs doing what they're doing or any of that stuff like that. Maybe not the game for you. Cause this game is",
            "start": 2055.04
        },
        {
            "text": "want to play the game, right. And just see Jack story and you don't care what, why monarchs doing what they're doing or any of that stuff like that. Maybe not the game for you. Cause this game is super like, this game is a remedy game. And what that means is like here, it is dripping with narrative. It is dripping with story. And it's like, when you're walking around, you can, you know, like the first part, you get dropped off by the cabbie and you walk over to meet your friend or whatever in the physics building. That walk took me 20 minutes cause I walked over and talked to the protest girl. And then I read the flyers that were up and then I watched the Alan Wake teaser and then I did, you know what I mean? Like you do all these different things. And then once you're in there, even you're finding computers. And they're all, I spent, I played over the weekend. It's like a narrative objectives or narrative pieces found in the movie. Like, you know, X out of Y or whatever. And so",
            "start": 2088.24
        },
        {
            "text": "you're finding computers. And they're all, I spent, I played over the weekend. It's like a narrative objectives or narrative pieces found in the movie. Like, you know, X out of Y or whatever. And so you'll go to a computer and open it and you'll get an email that you read that's talking about what's happening. And it's, you know, usually somebody from on our talking to somebody else from Monarch. And it's a game where I, I think it's a whole experience, but if you did just want to gameplay, you could totally, all right, cool. I'll get to come back to this and pop out of the movie, go play the game. And then at the end, sit down and be like, all right, now I'll watch every episode back to back to back. I wouldn't recommend it. How's the production value on the show? Cause like my worry would be that it's kind of, you know, something. And you said something about like the, some of the actors not being in all of it or whatever. Like, do you think that that was like a budget thing or no,",
            "start": 2123.2
        },
        {
            "text": "be that it's kind of, you know, something. And you said something about like the, some of the actors not being in all of it or whatever. Like, do you think that that was like a budget thing or no, I think it's the fact that like why it doesn't make sense for, um, Charlie's would be girlfriend really to get in Jack Joyce's story at all. Like she has, they all have their own narrative and objective in the story. And so they're off doing their thing and the worlds don't have to cross over necessarily. You know what I mean? Uh, production values for the TV show, I thought were really well done. Like I don't get me wrong. There's definitely scenes with like, uh, Aiden and his, uh, right-hand man or whatever, where it's like, okay, you guys are on green. You're not really in this office building, but then there's other stuff where it's like, there's like awesome fight scene in a hospital. And it was like, oh, this is actually really well done. It's not Daredevil, but it's like, this is, it",
            "start": 2158.8
        },
        {
            "text": "but then there's other stuff where it's like, there's like awesome fight scene in a hospital. And it was like, oh, this is actually really well done. It's not Daredevil, but it's like, this is, it isn't clear that I'm watching something. You know, you're watching something that I feel like, all right, cool. This is not TV because it's more not risque, but it's, it feels grittier. Right. But not like low budge, but it's not like, yeah, yeah, it's fair enough. And then does it, when you're playing it, does the TV stuff feel like expanded universe stuff that you're just getting at the time? So it like kind of adds to it or does it really feel like it's a cohesive experience with the game play and TV show together? I think it's cohesive experience for sure. Because like there, there, it is, you know, there's one part with the guy I was talking about before where you'll, you would pick up as Jack and you would leave a building and you would not understand what you just did in that",
            "start": 2193.12
        },
        {
            "text": "it is, you know, there's one part with the guy I was talking about before where you'll, you would pick up as Jack and you would leave a building and you would not understand what you just did in that building. Cause what happened happened in the episode. Now, not necessarily Jack running around doing it cause they want you to control that obviously. But in terms of like, they're having this like tense standoff, you know what I mean? Not a real spoiler, but the tense standoff and their guns are drawn and they're yelling at each other. And then the camera just does like the little, like the cutting back and forth between people and it cuts to the guy and then it pulls out and his hands empty and then they cut to the girl and her hands empty and she's like, fuck. And she throws up in the van and he's gone. And so like, that's the thing of like, he, you know, it can exist in between the space between spaces. He can be in these moments or whatever. So for him to wake up in the van and then",
            "start": 2233.52
        },
        {
            "text": "and he's gone. And so like, that's the thing of like, he, you know, it can exist in between the space between spaces. He can be in these moments or whatever. So for him to wake up in the van and then freeze time and get out and do that stuff and then you pick up with him after that part of the episodes and it's like, that was awesome. Like that was a really cool move. What's very exciting to me is the idea of, so it's choice based and there's different branching paths, how that interplays with the video footage. Is it all slight things like, oh, there's this bonus thing. If you do this, then there's an equation on the board or is there episodes that you are totally different? There's, that's a great question. I have not gone and watched all the alternate, whatever it would be like for sure. There's a choice you make as the Monarch lead right before like the final stuff where theoretically when you come back, that should be a completely different episode and ending. I haven't gone and",
            "start": 2266.32
        },
        {
            "text": "There's a choice you make as the Monarch lead right before like the final stuff where theoretically when you come back, that should be a completely different episode and ending. I haven't gone and explored it myself to watch it, but it's definitely, he's acting in a different way and talking in a different way and you're choosing at one point who to trust. So who's going to be with you and what they're going to react to is going to be different as well. That's cool. Yeah. So obviously Xbox exclusive console wise. Yeah, sure. Is it worth PS4 owners seeking out an Xbox, whether that's using a friends or getting one to play this game? Getting one, I mean, is always hard. Don't buy a system for one game. I always say, you know what I mean? If you can, I mean, I think there's plenty of other reasons. Gears 4 is coming out this year and it was stated decay. Come on. But in terms of borrowing it, yeah, I would say for sure. Like I'm telling you have one, I'd say for sure played. If you're",
            "start": 2303.84
        },
        {
            "text": "reasons. Gears 4 is coming out this year and it was stated decay. Come on. But in terms of borrowing it, yeah, I would say for sure. Like I'm telling you have one, I'd say for sure played. If you're into story based games, if you're into time travel, if you're into cool performances and a different kind of game, like, you know what I mean? Cause again, like cut scenes, we've seen cut scenes before, but I don't feel like we've seen episodic narrative in this way where it's like, all right, cool. Play as this guy. Great. You've reached the end of his act. Let's check in on what's happening over here on these other people and what's going on. Yeah. I mean, I guess the biggest question is, does it feel gimmicky at any point? It didn't for me. No. And I, that was my whole thing. When that first episode starts, I'm like, let's see how bad it looks. Let's see where, where am I going to see that? Clearly everything is green screen and these people aren't putting in good performances and",
            "start": 2338.48
        },
        {
            "text": "first episode starts, I'm like, let's see how bad it looks. Let's see where, where am I going to see that? Clearly everything is green screen and these people aren't putting in good performances and everybody's like, everybody buys in. There's no actor I'm watching. Who's like, Oh, totally, totally phoning this in. They don't really care about what's happening. Cool. Yeah. Any questions? No. Greg and I talked about it pretty extensively before, you know, when he beat it. So I don't have any questions that I, that I have lingering at this point. Sounds great. But not a game I'll probably explore anytime soon. I assume the next Xbox one game I'll play is, is Gears 4. But yeah, I satiated myself by talking to Greg about it this weekend. So I have no outstanding questions. And you touched on basically everything that, that I was wondering or that I had wondered. Although I do think it's telling depending on the game you're looking for, because you're right. Remedy is very, is always very",
            "start": 2375.52
        },
        {
            "text": "basically everything that, that I was wondering or that I had wondered. Although I do think it's telling depending on the game you're looking for, because you're right. Remedy is very, is always very plot driven that you didn't even talk about how the game played for a very long time. So I think that that says, I think that that says more about what the emphasis of the game is as opposed to maybe some more dynamic, but still third person shooting. That seems to be pretty, pretty standard, which I don't think there's anything wrong with that Uncharted has very standard. Exactly. That's the thing. Like what if you're gonna talk about what's brilliant, different in newsworthy, worthy. I think it is the acting of the whole cast. I think it is the episodic infrastructure and then it is like the time powers, but we've had time powers before we fucked around before shooting's fun. It works really well. It does. I, I kept making a joke cause I was playing it. And then a Fran and Ty hit me up",
            "start": 2411.84
        },
        {
            "text": "time powers, but we've had time powers before we fucked around before shooting's fun. It works really well. It does. I, I kept making a joke cause I was playing it. And then a Fran and Ty hit me up to come on for division and it was so weird. I was telling them to play a game where headshots mattered again. You know what I mean? After division where it's just like blasting you in the face, wait, waiting for you to die. Whereas like quantum break is like you pop up and you perfect and like, especially when it's the last person and those go slow mo. You're like, fuck yes, this is die pig. They're not cops. They're bad guys. So thumbs up. Yeah. Thumbs up. I liked a lot. Cool. This topic brought to us by pro flowers. Mom has always been an expert on everything. Cooking relationship advice, fixing your cuts and bruises. Do jeans count as business casual? How quickly does chicken thaw? How do I do my taxes? The one thing you can't go to her for advice on is what to get her for Mother's day.",
            "start": 2449.12
        },
        {
            "text": "your cuts and bruises. Do jeans count as business casual? How quickly does chicken thaw? How do I do my taxes? The one thing you can't go to her for advice on is what to get her for Mother's day. That's true. She had his mother's day coming up. How far away is Mother's day? I don't know. May 14th. May. Okay. We got it's around there. It's around there. Not to worry. You'll look like an expert on Mother's day when you use pro flowers, pro flowers, takes the guesswork out of sending mom, grandma, or wife, the perfect mother's day gift. Pro flowers are guaranteed to be fresh and beautiful for at least seven days or your money back. You can get mom a hundred blooms with a free glass vase for $19.99 plus shipping and handling, or make her day extra special by upgrading to a premium vase and add gourmet chocolates. Visit pro flowers.com. Click the blue microphone in the top right corner and type in KF games. Remember Mother's day is right around the corner or just today because this offer",
            "start": 2494.34
        },
        {
            "text": "gourmet chocolates. Visit pro flowers.com. Click the blue microphone in the top right corner and type in KF games. Remember Mother's day is right around the corner or just today because this offer expires Friday at midnight. I'm not sure which Friday, whoever makes the vase out of chocolate. That'll be the one that will be the real, that'll probably be a bit more than an extra $9.99. But anyways, go to pro flowers.com. Click on the blue microphone, type in KF games. Got a good deal. Make your mom happy. Make your mama proud. Yeah. Yeah. Topic number three. What we've been playing lately. Colin, what you been playing lately? Mostly Vita at this point. Ratchet took a lot of my time. We already discussed ratchet pretty extensively, so we don't talk about that anymore. So the game I'm playing right now is severed, although I can't talk about it. The game's embargoed actually for a long time. I don't think that we're even allowed to talk about it extensively until after PAX East. That's",
            "start": 2532.98
        },
        {
            "text": "right now is severed, although I can't talk about it. The game's embargoed actually for a long time. I don't think that we're even allowed to talk about it extensively until after PAX East. That's where I'm at with Star Fox. But a lot of those games right now. Yeah, but I will, I'm comfortable saying knowing Drinkbox and knowing the PR agency that's repping them, I think I'm comfortable saying that Severed is a game worth being excited about. I mean, that's my interpretation of it. The way I keep interpreting it for people right is I played an hour of it last night. The hour confirmed everything I've said at the PAX as I played it, where I'm like, this is fun. I think I'd like to play this. I can't wait to play more of this. All of that's the, you know, after playing an hour of it, I'm still like, okay, yeah, I want to play more. I want to do more with this. It's a game that seems to become more cohesive the more you play it. I'm pretty far in it now. For those that don't know what",
            "start": 2581.48
        },
        {
            "text": "still like, okay, yeah, I want to play more. I want to do more with this. It's a game that seems to become more cohesive the more you play it. I'm pretty far in it now. For those that don't know what it's a Vita exclusive game from Drinkbox Studios. Usually guys do the mutant blobs game in Guacamelee. They've been working on this game for about two years, a little more than that. And it is a DRPG and you don't see many of these anymore. So it's like a first person role playing game in a dungeon. So a first person perspective, you just don't see a lot of dungeon crawling RPGs like this. A lot of them actually come out of Japan because they're very popular there, especially in Vita and on PC. But you don't see that's not a, it's not a well worn genre in the West anymore. It used to be. So think about like Shadow Gate or something like that. So it's a game where it's all touch based and you it's not all touch base. You use the sticks to kind of go around these environments and you're",
            "start": 2618.04
        },
        {
            "text": "think about like Shadow Gate or something like that. So it's a game where it's all touch based and you it's not all touch base. You use the sticks to kind of go around these environments and you're exploring in these interconnected environments. The art style is very similar to Guacamelee. One of my first questions was, is it in the same world as Guacamelee? Which I don't think it is. But you fight these enemies in, you could fight up to four of them. I think at a time you might be able to five them. I think four of them at a time. I believe it's four. And the enemies appear on your like so that an enemy can be behind you or to your side or your front. And each of them has like defensive postures and offensive postures. And you slash with your finger depending on where they're not guarding themselves. So like a spider enemy might be like having his hands up here. So you like slice him here. Then he goes down here and you slice him on his head. So it's like Skyward Sword. Yes, it's",
            "start": 2660.12
        },
        {
            "text": "themselves. So like a spider enemy might be like having his hands up here. So you like slice him here. Then he goes down here and you slice him on his head. So it's like Skyward Sword. Yes, it's kind of like Skyward Sword. And but not nevermind. So so there's these circle icons that represent all the enemies. And you can click, you can press them to turn around and fight the next enemy. And these yellow gauges fill up to show like when they're going to attack. So you have to like face the enemy and either interrupt their attack or block their attack by slashing them in the opposite direction that they're slashing at you. So parrying exactly. So there's there's a lot of the combat's actually super dynamic. And people have played it at PAX and E3 and all that kind of stuff. Know that the combat is super dynamic. And what's weird is like I don't like touch based games. You know what I mean? And there's the occasional one that will come through. And this is one that from all those PAX",
            "start": 2694.04
        },
        {
            "text": "combat is super dynamic. And what's weird is like I don't like touch based games. You know what I mean? And there's the occasional one that will come through. And this is one that from all those PAX demos I've had where you played, I'm like, oh, OK, this is different. This is fun. It's making me think it's making me move. It's not just like mindlessly doing that, because if you mindlessly do that, then they block and you lose your what do they call it? There's like a multiplier that grows. And then if you build this meter up, then you can actually slice their limbs off with your like when they're dead and collect their body parts to upgrade your character naturally as you do. So you play as a female who has one arm. Her arm has been sliced off and she's like looking for she's looking for her family. And we can't I'm not going to talk too much more about it because I don't want to break the embargo. But yeah, it's a game worth keeping on the other game I'm playing that I think Greg has",
            "start": 2735.64
        },
        {
            "text": "family. And we can't I'm not going to talk too much more about it because I don't want to break the embargo. But yeah, it's a game worth keeping on the other game I'm playing that I think Greg has talked about in the past is hit mango. And I this it would be disingenuous to me not to give credit to hit mango as a touch based. It was a cell phone game. It's a mobile game. But of course, mobile games suck until they come to VITA's. Exactly. So they got a trophy. But it's the word I used to describe it is actually it's quite clever. And and I first of all, I couldn't imagine playing it on a touch screen. I am playing it with the D pad and like buttons and stuff. And it's I think I'm sure you could figure it out on a touch screen, but it's simple. But it's I like playing it. It seems very tactile to me, but I'm really enjoying it. It's hard and it's it's forgiving. Like you're not necessarily dying and losing anything, but figuring out how to do things to get all three medals or whatever",
            "start": 2769.72
        },
        {
            "text": "to me, but I'm really enjoying it. It's hard and it's it's forgiving. Like you're not necessarily dying and losing anything, but figuring out how to do things to get all three medals or whatever on each stage as you go is cool. And I like the idea of it just being like a board game. It's like a meta game, basically like you're playing a digital board game and you're going around and trying to assassinate people. And it's it's cool. I like it a lot and it occupied a lot of my time flying back from Austin to San Francisco when we were flying back last week. I haven't gone back to it since I've had severed. And I also have Axiom Verge on VITA. So that's I'm going to try to save that. That'll be out actually by the time I play it, which will be when we're going to PAX. But in Boston. So that's kind of what I've been spending my time with. In addition, I haven't gone back to the division. I'm kind of just desperate to get it over with at this point. It's not a reflection on the game. It's",
            "start": 2814.76
        },
        {
            "text": "kind of what I've been spending my time with. In addition, I haven't gone back to the division. I'm kind of just desperate to get it over with at this point. It's not a reflection on the game. It's a reflection on how I want to spend my time. Then otherwise, I'm waiting for, you know, primarily for alienation at this point, which is the house Mark PS4 game that I should get very soon. So that's basically it. I highly recommend you try lower Crofco. I will when it comes to VITA. It will eventually. But it's worth playing on the phone because it's kind of easy. It's a little bit easier than hitman go, I think. But there also there's like a DLC package that I'm pretty sure is free. If you get the game that makes it a lot harder. Like there's a bunch of new levels that are way more challenging and those are awesome. Like it really makes you feel like you're doing something good when you beat a level. And I like that. What about you, Greg? So quantum break was the big one in terms of like",
            "start": 2854.76
        },
        {
            "text": "and those are awesome. Like it really makes you feel like you're doing something good when you beat a level. And I like that. What about you, Greg? So quantum break was the big one in terms of like all my time. But then I did other stuff. I hit level 30 in division. Uh, congrats. Thank you. Geez. Some supportive friends. You are the dark side. Enter the door. Well, I was already doing some dark sides. Fucked around this man. But yeah, so well, the dark sounds cool. And I ran around there and I got, I mean, I got my, it is, I got my Midas Uzi. See, I've had the opposite impression though. Like it could be mean. It hasn't been mean to me because there was a great moment where I was like, I want to run around the dark zone by myself. And I ran in there and some dudes popped up and I was waiting for timeframe or whatever the hell they were doing. And so I was in there by myself. Dudes popped up. I started shooting and like, of course the dark zones deal is like, you know, they're level 30",
            "start": 2890.84
        },
        {
            "text": "for timeframe or whatever the hell they were doing. And so I was in there by myself. Dudes popped up. I started shooting and like, of course the dark zones deal is like, you know, they're level 30 and they're all purples. And then there's like a team of bad guys, NPCs or whatever, or you know what I mean? And so they surrounded me and then another guy had spawned into the dark zone was running and he stopped and helped me. And then we teamed up and then we just ran around for like an hour collecting awesome weapons, extracting stuff. We, and we kept randomly picking up other people and nobody went rogue. Nobody in the entire group. We had no mics. Nobody, nobody was being a dick about it. I was like, that's fucking cool. That's what it's about. Then though. So I hit level 30 done school stuff. I'm all in. This is fun. I'm having a great time. Then Saturday stopped playing quantum break to jump on and play with Ty and Fran again. And Ty had been playing all day long, but he had been",
            "start": 2927.16
        },
        {
            "text": "stuff. I'm all in. This is fun. I'm having a great time. Then Saturday stopped playing quantum break to jump on and play with Ty and Fran again. And Ty had been playing all day long, but he had been grinding one mission where he was just like trying to get Phoenix credits or he's just replaying this mission over and over and over again to get Phoenix credits. And then we went and did one of the challenges or whatever and it was totally like, we're in there and it's like, all right, you guys pop this on this thing and you do that. And like, this is how we're going to are calling things out. And it was like, very like we used to run through these missions and have fun and talk to each other. And now it's very much about how to best this mission and how to get this. And I'm like, I'm not feeling this. And like, I did it once. They're like, all right, let's do it again. I'm like, I'm going to stop now. And for me, I was like, this is interesting. If this is my, the death meal of the",
            "start": 2959.24
        },
        {
            "text": "feeling this. And like, I did it once. They're like, all right, let's do it again. I'm like, I'm going to stop now. And for me, I was like, this is interesting. If this is my, the death meal of the division for me, you know what I mean? Of like, is this, cause that was a huge blow of like, I don't want to do that. I don't think, and I don't know how to handle that. But then the next day I tried to play a bunch of stuff and I did, and it was like, I have a, I have, I have like 30 minutes to an hour before I have to go do whatever I'm about to go do. I want to play something. I guess I'm jumping back in the division. And I went and then I popped out a few other trophies because I'm close. I'm like, I was looking here, I'm what, 67% on the trophy list. And like a lot of the main time sinks have been sunk. You know what I mean? Like, even if I don't go for the platinum, I just need to collect a few more dog tags and a few more cell phones and a few more laptops for each one of those",
            "start": 2995.0
        },
        {
            "text": "have been sunk. You know what I mean? Like, even if I don't go for the platinum, I just need to collect a few more dog tags and a few more cell phones and a few more laptops for each one of those trophies to pop. And so I'm in this weird spot of like, I, you know, they just dropped the incursion or whatever. Alfredo, of course, has been going crazy, but like Alfredo is putting up his character in his stats and what his loadout is and it's just like mine is not that and does that mean that I'm already to that point where I either have to get on the treadmill really fucking hard. The the grind treadmill, the gear treadmill here or can I just pop in itself fun but not be as fucking godlike as he is, you know what I mean, and so I don't know where I'm gonna end up with a division because I'd like to keep playing it. I do. I do like when it was like all right, cool. It is kind of that like so go for it, though you know what I mean, even though, but then if not, if it's going to be the",
            "start": 3029.82
        },
        {
            "text": "I'd like to keep playing it. I do. I do like when it was like all right, cool. It is kind of that like so go for it, though you know what I mean, even though, but then if not, if it's going to be the experience I had where it was like all right, let's do the same thing and you pop your special on this and I'll put my Josh, Josh, you know, not that so that was that's been part of it. So then yeah, that enter the Gungeon. I jumped into enter the Gungeon. I've been waiting a long, long time since Nick and I saw that at that event. I think it was for a games comp thing here in San Francisco. Totally delivered on what I wanted. Yeah, you enter the Gungeon, you know, randomly generated dungeons where you run around with awesome guns and shoot little bullet guys. You shoot back and you try to get better gear to beat the boss to get to the next level and what's interesting is when I played it and I was there, I was like, oh, this is fun. It's like, you know, it's basically like a twin stick",
            "start": 3065.26
        },
        {
            "text": "better gear to beat the boss to get to the next level and what's interesting is when I played it and I was there, I was like, oh, this is fun. It's like, you know, it's basically like a twin stick shooter or whatever. Like I'm shooting my 360 degrees and run around shooting everything great. This is fun. And then getting it home and playing it. I was like, oh, it's it's a, you know, it's dungeon crawler. It's all it's everything. It's like Rogue Legacy, but then dying and starting again, Rogue Legacy. When you die, you capture gold and you got to go buy something to make the next round easier or whatever. That's not happening here with the exception of some credits I'm getting up here that I haven't found what to spend them on or I'm still early. You know what I mean? So probably the first two hours of playing this game, but you die, you restart and you just go again and die and restart and go again, but without having to do anything. And I was like, Oof, I like the way Rogue Legacy",
            "start": 3099.34
        },
        {
            "text": "two hours of playing this game, but you die, you restart and you just go again and die and restart and go again, but without having to do anything. And I was like, Oof, I like the way Rogue Legacy did it. I don't know if I'm going to hang out and play it, but lo and behold, I keep playing it. I keep wanting to play in the dungeon. It looks awesome. It is fun. It's clever. It's cute. It's funny. It's got everything going for it. The characters feel different like that. I was playing forever as the pilot because he looks like Nathan Drake. And then I was like, Oh, now I'll try the Marine who looks like a Halo Spartan or whatever. He had a different gun set. He was different. And there's always like, there's two other characters that I haven't run with yet. And I want to jump in and play with them and get a feel for who I like and what, who's making the most sense for me as a player, but enjoying it. Yeah. It's just spelunky when I thought it was Rogue Legacy, if that makes sense. You",
            "start": 3135.42
        },
        {
            "text": "them and get a feel for who I like and what, who's making the most sense for me as a player, but enjoying it. Yeah. It's just spelunky when I thought it was Rogue Legacy, if that makes sense. You know what I mean? And I don't know if I'll ever be good enough to get to the bottom and do all these different things, but I'm enjoying it as a distraction. When I got, I took a break from that. I played episode two of Michonne, The Walking Dead Michonne. Liked that a lot more than I liked episode one. Episode one, I was like, no, it was an experience that was fine. This one was you're making choices. They matter. There's action. It wasn't just like trying that episode for a three episode series. I thought pacing would be hard. And I think that's what happened with episode one where episode one very much was like, we're going to start you into this thing. And it's like, well, you're burning clock. I already know who Michonne is. Why are you doing it like this? And this one was okay, cool.",
            "start": 3169.26
        },
        {
            "text": "very much was like, we're going to start you into this thing. And it's like, well, you're burning clock. I already know who Michonne is. Why are you doing it like this? And this one was okay, cool. Let's make choices. Let's kill things. Let's have action. Let's see what you know. Let's make choices that matter, which is what walking dead all about. Had a lot of fun with that severed. I've been playing. I've been playing Valkyria Chronicles. I also can't talk about that. I think that covers everything that I've been playing recently that I can speak to a lot. Yeah, that's it. This weekend was like two days and it was like, you know, two days here in San Francisco, which I hadn't had in three weeks and I won't have for another five weeks. So all I did was sit there and not shave and play games. Yeah, I played more games in the last week than I have in a pair. I played a lot of a lot of Ratchet. I've played a lot of Star Fox. I'll talk about that next week. The one thing I do want to say",
            "start": 3204.46
        },
        {
            "text": "Yeah, I played more games in the last week than I have in a pair. I played a lot of a lot of Ratchet. I've played a lot of Star Fox. I'll talk about that next week. The one thing I do want to say about that game is for everybody saying that you can turn off motion controls. You cannot. So many people have been giving me shit because I keep saying, no, they're not telling me if you can or not. You cannot. There's an option where you can make it so that it's only when you're like charging your laser that motion controls turn on. But that's the entire game. So that's fun. So it's great. I have a lot of, I have a, I have good things to say about the game and I have bad things and one of those outweighs the other. We'll have to find out next week. But there are other surprises that happened this week that I'm pretty excited about. Kingdom Hearts Unchained Key is what it's called, but it looks like an X, but it's a key. I don't know. It's square. You know, they just named things in the most",
            "start": 3244.7
        },
        {
            "text": "week that I'm pretty excited about. Kingdom Hearts Unchained Key is what it's called, but it looks like an X, but it's a key. I don't know. It's square. You know, they just named things in the most convenient way as possible. This is something that I, I've known was happening. It's been out in Japan for a long time, but I didn't know that it was being ported over to America. I know that there was like a, a movie that's going to be in Kingdom Hearts 2.8. I think they're calling it. I'm lost in all this shit. That's it. It just reached the point. I'm like, all right, whatever. When it happens, it happens. It happened. This game came out free to play mobile game and I'm like, Kingdom Hearts free to play mobile. I'm sure I'll try it way deeper than I thought it would be way more fun and you don't need to buy anything at all. You just keep playing. There's like, it's, it's a, it's a game. It's not some bullshit. It's the, it's their story that is completely canon and completely relates to",
            "start": 3289.5
        },
        {
            "text": "need to buy anything at all. You just keep playing. There's like, it's, it's a, it's a game. It's not some bullshit. It's the, it's their story that is completely canon and completely relates to the whole thing. It relates to Kingdom Hearts 3. This is the first thing in the timeline of Kingdom Hearts. So it was the earliest we've ever seen. It deals with the pre-Keyblade war stuff and the natural and naturally there's actual Disney worlds in it and stuff. There's, there's music that's Kingdom Hearts music. It's not weird, shitty, you know, mobile songs and stuff. This is, it's real. And I'm like, damn, there's, I, I, I'm shocked at the production quality of the game. I was playing, I played it for a couple hours and the, the gameplay starts simple and it starts getting a bit more and more complex as you go on the battle system. It's all touch based. You just kind of like point where you want to go and then the new little guy goes. There's groups of bad guys. If you hit a bad guy, they",
            "start": 3326.94
        },
        {
            "text": "complex as you go on the battle system. It's all touch based. You just kind of like point where you want to go and then the new little guy goes. There's groups of bad guys. If you hit a bad guy, they spawn a couple others around them. So it's like, there's one bad guy that you touch. It turns into like three. And as you're fighting them, it's like this like card based system where each character is a different color. There's red, blue and green. And each bad guy is a different color too. And depending on your card, it's, you know, rock, paper, scissors, scissors type system where I think it's blue beats green, green beats red, red beats blue. Sure. And depending on the card, you want to attack that guy first and just kind of cycle through it. It is just quick and easy swipes, but it's perfect for a mobile game. It's perfect for, I'm just going to do three more stages and just kind of bang them out when you're like in line for something. Right. But I like that there's a fair amount of",
            "start": 3374.22
        },
        {
            "text": "for a mobile game. It's perfect for, I'm just going to do three more stages and just kind of bang them out when you're like in line for something. Right. But I like that there's a fair amount of actual story going on and there is characters like you're talking to Aladdin, you're talking to Hercules, you're talking to like things where I'm like, fuck like this. I would have never expected this from a mobile game. So very pleasantly surprised by that. Also on the mobile front, Miitomo. That was a thing that happened. Oh yeah. It's, did you guys play it at all? No. News it at all? Play it's kind of a weird word to use with it, but I mean, it's, it's cool. Like when, remember when you first made an avatar on Wii and it was like, this is cool. You know, like it's just kind of like the whole, there's something about avatars that is just appealing, you know, creating yourself, answering questions, just kind of like, you know, choosing, tweaking the eyebrows and the clothes and stuff. Like",
            "start": 3416.54
        },
        {
            "text": "there's something about avatars that is just appealing, you know, creating yourself, answering questions, just kind of like, you know, choosing, tweaking the eyebrows and the clothes and stuff. Like there's something about that that is just inherently likable. And I think the Miitomo is, it's a cool step in taking some of the most memorable parts of that and just expanding on it. Like there's something addicting about answering questions about yourself. You know, what's your favorite ice cream? What do you think about this? And there's all it is is just like question, question, question. And then it's a point system based on how many questions you ask. Wasn't there, there was a Wii channel that was all questions, right? It wasn't there the voting, the polls. I remember doing that when the, when the Wii first came out. I'm not making this up. You're all much a psychos. Maybe. We had a lot of things that they did for a while and it stopped. But this is interesting in that it seems like",
            "start": 3456.94
        },
        {
            "text": "when the Wii first came out. I'm not making this up. You're all much a psychos. Maybe. We had a lot of things that they did for a while and it stopped. But this is interesting in that it seems like it's getting a lot of pickup. Like everyone on Twitter that we follow is using it. And I feel like the fall off for that hasn't been too crazy. Like people are still posting pictures of their Miitomo like characters doing weird ass shit. I think Nintendo made some really smart calls in terms of creating a platform that people are going to use socially on other social networks. Because I'm seeing it on Instagram, on Twitter, on like all these different things. People are making vines with the stuff. I'm like, that's, that's smart. Because now these Miitomo characters are everywhere. Yeah. Not enough to keep me going though. Like I was like, all right, I'm done asking questions, answering questions. And it's a little more difficult than it needs to be to create a friends list in classic. Oh",
            "start": 3497.74
        },
        {
            "text": "to keep me going though. Like I was like, all right, I'm done asking questions, answering questions. And it's a little more difficult than it needs to be to create a friends list in classic. Oh wow, who would have thought. I know. If that stuff wasn't true, like I feel like there's, there's really something there. And again, this is one of those things where this isn't for everybody. This isn't for people looking for a game. This is not that. There's a couple of mini games in it. They're not really fun. They're distractions at best. And I feel like if they were a little bit more fleshed out and if they weren't so hard to access, you need to like get a certain amount of points to be able to even play the mini games. And the mini games remind me a lot of when the DS first came out. Like when you played a Mario 64, there was like a set of mini games that came with where it's like Mario's would like would be falling from the sky on the top screen and you have to like swipe to bounce in",
            "start": 3539.2
        },
        {
            "text": "you played a Mario 64, there was like a set of mini games that came with where it's like Mario's would like would be falling from the sky on the top screen and you have to like swipe to bounce in different places. It's that type of stuff, which it's fun distractions. But now that we have mobile games, like that's what those are. This feels incomplete for sure, but I'm happy that it's getting the type of pickup that it is because I think that's a good sign that if this was a feature in another game, it could be really cool. Keep in mind, a lot of the pickup you're seeing though is just Mike Drucker tweeting 20 times a day. Well, Mike Drucker's great. And his, see he is a perfect example of somebody that should be using a Tomo because his answers are so funny. So when Mike Drucker comes in and like his question and answer pops up, it's like, this is what this is for. It's more following the right people, not a bunch of shitheads. You know, unfortunately I had a bunch of shithead",
            "start": 3576.32
        },
        {
            "text": "in and like his question and answer pops up, it's like, this is what this is for. It's more following the right people, not a bunch of shitheads. You know, unfortunately I had a bunch of shithead friends. I have noticed. Yeah. Sorry, Kevin. Anyway, I haven't opened it in like a week, so that's how much fun it was. So you're going to be a Tomo and there's probably starving. Probably. And that's the thing, you don't do anything like that. It's not even a Tomogachi. It's just answer questions. And then in terms of actual console games, we did the final fantasy 15 uncovered events. We did. And at that event we announced that the platinum demo was going to be released tonight and writing it to play it cause we were there. We were drinking our heads off. Then when I got back, I finally got time to play it. Very short. It's I put 30 minutes into it. Yeah. I mean it's not great. It's not bad. It's I hear it's, I hear it's pretty bad for some people. That's that's pretty bad. I mean it's,",
            "start": 3617.36
        },
        {
            "text": "time to play it. Very short. It's I put 30 minutes into it. Yeah. I mean it's not great. It's not bad. It's I hear it's, I hear it's pretty bad for some people. That's that's pretty bad. I mean it's, it's, it's very unnecessary. It's about if it's 30 minutes, I'd say it's 25 minutes of just weird. It's a weird tech demo that shows off a bunch of the like weather effects and just like different game effects that don't affect the player at all. Like these are things that the player aren't going to be doing in the actual game. So I don't really understand the thought process behind it. At this point we know the game looks good. Like we don't need to know that there's a day night cycle and stuff like that. You start off as as Noctis and then you you're asleep and you're dreaming. So you're in his dream and the opening bits, it's cool cause you're in this like canyon and you start to see a bunch of the summons and the sense of scale is ridiculous. And I'm like, fuck, this is awesome. But",
            "start": 3658.88
        },
        {
            "text": "his dream and the opening bits, it's cool cause you're in this like canyon and you start to see a bunch of the summons and the sense of scale is ridiculous. And I'm like, fuck, this is awesome. But then nothing really happens with that because it's a dream. Then you just move on to the next dream sequence and you're like in a room and it's very Kingdom Hearts ask like Alice in Wonderland where you're tiny and everything. Is that when you get the Mickey Hammer? The squeaky hammer? Yeah, you have a squeaky hammer and it's like, it's, it really misses the mark in a lot of ways where it's like, had they just made a demo more similar to Disgae or whatever the other one was, but just shorter. I think it's Disgae. I think it's Disgae. Disgae. They corrected me when I said Disgae. It's a made up word. Yeah, it is. It was interesting to me that it, that they would make these calls because like the squeaky hammer hammer, like it's cute and weird, but I guess that's the thing. It's a very",
            "start": 3709.52
        },
        {
            "text": "up word. Yeah, it is. It was interesting to me that it, that they would make these calls because like the squeaky hammer hammer, like it's cute and weird, but I guess that's the thing. It's a very Japanese game and this is a very Japanese demo. It's very just kind of out there. You're in this weird little toy car and you're doing something like, why, what is happening? And it happens so fast that you then moved on to the final section. And the final section is a boss fight with this iron giant thing and you turn into adult Noctis and you'll do carbuncles helping you out. Carbuncles the fucking homie named my Portillo. Thank you. Thank you. See, that's the thing is like, no matter how bad this demo is or how weird it is, I'm still going to do it at some point because I want to make sure I have carbuncles on my game. Yeah, you got it. I mean, again, it's so fast. You can beat this thing. If you, if you ran through it, I think you'd probably get it done in like 15 minutes. Okay. So then",
            "start": 3750.8
        },
        {
            "text": "have carbuncles on my game. Yeah, you got it. I mean, again, it's so fast. You can beat this thing. If you, if you ran through it, I think you'd probably get it done in like 15 minutes. Okay. So then we get to the final part, which is the boss fight. And that's the thing that I wish that I could be like, that part was awesome. So it's all, all fine. It's so awesome, but it's so easy. And the battle system is so dumbed down for the demo that I'm like, why did you even do this? You might as well be watching a trailer. Like you can just hold circle and win. Like the battle system is weird and you don't even need to tap it. You just hold it. It's like an auto dodge and attack thing. I'm like, all right, cool. It's a spectacle to look at. It's really, it's really cool. And I'm like, man, can't wait to play the actual game. Like, I can't wait till there's actually an enemy that is a challenge and we're built up and I have more, my magic spells have an actual use and stuff instead of just",
            "start": 3791.52
        },
        {
            "text": "wait to play the actual game. Like, I can't wait till there's actually an enemy that is a challenge and we're built up and I have more, my magic spells have an actual use and stuff instead of just having fire that like you can use that to win or you can use your sword to win. But what is cool is, and this is optional, you don't need to do this. Before you beat the thing, you can go back and there's this, if you go to the other end of the level, there's like a little platform you step on that makes it responds the giant. And then you can go to the building and like go all the way up the skyscraper and then warp strike down from like a hundred stories up to attack him. And that's really cool. And it reminds me of the Final Fantasy Versus 13 trailer that came out millions of years ago when he like does that in the trailer and being able to actually control and do it is really cool. But then, yeah, then the trailer or the demo ends and carpunkle's ears for the game. But I was very shocked",
            "start": 3834.88
        },
        {
            "text": "like does that in the trailer and being able to actually control and do it is really cool. But then, yeah, then the trailer or the demo ends and carpunkle's ears for the game. But I was very shocked at how weird the demo is. It's like, man, this is what you're going to put for free in front of people that aren't interested in Final Fantasy 15. Interesting call. I'm very excited about the game. Still, that event got me fucking stoked. And this is definitely it left a sour taste in my mouth. I'm like, why? Like, why should you do this? It would have been better if they just didn't do it. Yeah. But yeah, I'm interested to see what you have to say about the following game when it comes out. I wonder if it even can win you over. I think I'm going to play it. It's just I'm curious if anyone's ever not anyone, but I'm curious. I think I think this game doesn't look right. And that's all I'll say is that it just doesn't feel right to look like just what is this game? Why are they in this car?",
            "start": 3879.2
        },
        {
            "text": "not anyone, but I'm curious. I think I think this game doesn't look right. And that's all I'll say is that it just doesn't feel right to look like just what is this game? Why are they in this car? Who are these stuff I'm not worried about? A lot of people are, though. And I think that they have every right to be. I don't understand. This is a weird game. This game oozes weirdness. And I don't feel like Final Fantasy seven and Final Fantasy nine and Final Fantasy 12 and six and whatever. Games people like in different ways, like oozed a unique ness, not a weirdness. And I think that that's this game just looks strange to me. And I'm sure I'm super, super excited to play because I just want to see what it is. Yeah, I didn't think the demo was like the real demo. Do Sky was all that compelling to me. So it was. We'll see September 30th, apparently. I think playing it, my my biggest issue, besides the demo being weird, is the fact that the game looks like it's an action game, but it still",
            "start": 3924.24
        },
        {
            "text": "to me. So it was. We'll see September 30th, apparently. I think playing it, my my biggest issue, besides the demo being weird, is the fact that the game looks like it's an action game, but it still is kind of a slower paced RPG thing. So it's kind of weird where the controls don't feel as natural as I want them to. I feel like a lot of the moves, it looks like it feels like God of War and it's OK. OK. It's definitely way slower and clunkier to control. But I think that. In the context of the actual game, that might make sense once I actually start to understand the pacing of it, but I think being given a five minute fight wasn't enough and it makes it feel out of place and weird, but I'm still very I'm very sold on it. I think it has a lot of potential to be at least good. And I've been playing recently. Anything else? We miss anything else? Car buckled. Car buckles the homie. Bo Show. All right. Final topic of the day brought to you by the kind of funny forums. As always, if you have",
            "start": 3975.84
        },
        {
            "text": "recently. Anything else? We miss anything else? Car buckled. Car buckles the homie. Bo Show. All right. Final topic of the day brought to you by the kind of funny forums. As always, if you have a question for the show, you can go to kind of funny dot com slash topic. Leave your topic. Please make it brief. And we'll get to it on the show. You know, a lot of Zagres in there writing their novels. Zagres fine. It's all the motherfuckers. 15 years ago, Grandma Zagres said. This topic is also brought to you by Patreon. Thank you all for making things happen for us. There's your thank you crawl is what we call it. Kevin's going to put it really. But the thing does slide in from the side and then start going up. Shut up, Kevin. I was petting it. I'm clapping, but it sounds kind of like I'm masturbating. Like the mics far away. No, it's just like it's too fast. Damn, you waited longer than I thought you were going to. And I liked that. All right. First question of the day comes from George",
            "start": 4036.0
        },
        {
            "text": "Like the mics far away. No, it's just like it's too fast. Damn, you waited longer than I thought you were going to. And I liked that. All right. First question of the day comes from George Ash. He says, Hey, guys, what were some of the most difficult industry secrets you've had to hold on to until an NDA was up? Thanks for years of podcasts entertainment. This is an interesting question. Well, the question's weird, though. It's an interesting question. Yes, but the most difficult is like we're excited about him because I've never had a difficult time in like holding on to information. I'm excited to unleash information. I mean, I assume that's what he's asking. I mean, I read this as what's the thing that when you heard you like, fuck, I can't wait for people to know. I will say that I mean, the way he poses the question, I think Greg would agree is that he's like, well, until the NDA was up, I've signed very few NDA's compared to the amount of secrets I know. So it's like that I've",
            "start": 4088.08
        },
        {
            "text": "the way he poses the question, I think Greg would agree is that he's like, well, until the NDA was up, I've signed very few NDA's compared to the amount of secrets I know. So it's like that I've known and know to this day for every NDA I've signed, I know 20 things that I'd never signed anything for because they're coming from. Yeah, they're coming from NDA. They're coming from sources and they're coming from people you trust. Sure. I don't know that I want to get into specifics, but I will say that there is a great deal of shit that you know about if you're if you're well connected in this industry before it happens. And well, a good example is the God of War stuff that happened recently. Like I've known about that North stuff for a couple of years and Greg has to and we we heard rumblings about that forever. But it's until you can substantiate it. See, I never published I used to publish a lot of breaking stuff at IGN based on sources. If the sources were comfortable being anonymous",
            "start": 4131.6
        },
        {
            "text": "about that forever. But it's until you can substantiate it. See, I never published I used to publish a lot of breaking stuff at IGN based on sources. If the sources were comfortable being anonymous but going on the record and when you hear things you know you have to sustain. I want to have multiple sources. I don't I've never published anything without getting it from multiple sources that were comfortable with me using them as an anonymous source. If that makes any sense. So people will be like, well, they're obviously going to stay anonymous, but they also don't want you to use that as they're not a source. So that's not like checking one of the boxes. I have one source. It's like, well, you hear this and then maybe you can go chase a story or whatever. So the North stuff with God of War is a good example. We heard that from multiple people over time. And I believe that's 100% true because of the people that told us that. But to me, it's more like the more connected you are and the",
            "start": 4174.1
        },
        {
            "text": "is a good example. We heard that from multiple people over time. And I believe that's 100% true because of the people that told us that. But to me, it's more like the more connected you are and the more you kind of keep your ear to the ground and just listen and people trust you and you keep their secrets and all that kind of something. You learn more and more and more. Before you know it, you kind of know a lot. But I don't find it difficult to not tell anyone those things. It's fine. I'm so curious about the industry. I'm not I would love to tell you guys everything, but I mean, that's not the way it works in any industry. So I keep secrets and Greg keeps secrets and but there's a lot of games that we've known about or a lot of instances and behind the scenes drama and games that you think know we're going to be announced at this time or games that are getting canceled for this or whatever. I mean, without getting into too many specifics, I would say that I don't know if Greg has",
            "start": 4203.46
        },
        {
            "text": "think know we're going to be announced at this time or games that are getting canceled for this or whatever. I mean, without getting into too many specifics, I would say that I don't know if Greg has anything to add. No, that's good. Cool. Luke at me. That's a good name. Yeah, it is. Luke has two years though, so not full credit. Look at me. Hey guys, look at me. My question pertains to the video game industry as a whole. I've lived in Michigan my whole life, so the large conventions and most of the video game industry presence as a whole is absent from the area, even though I think the industry could strive here. I was wondering what areas of the country you think we could see the industry grow in the future. I myself has always been interested in doing something video games related, but I've never had the chance because of my location. Places with no income tax. So I think, you know, so that's why you find studios in Texas and in Washington because you get an automatic raise moving",
            "start": 4244.82
        },
        {
            "text": "I've never had the chance because of my location. Places with no income tax. So I think, you know, so that's why you find studios in Texas and in Washington because you get an automatic raise moving there. You got to raise subtracting the percentage of state income tax you pay and it's cheaper to run businesses there. I think New York is eventually going to thrive again. Rockstar is a huge developer in New York, but taxes are very onerous there usually, but they have a lot of new small business and like zeroing out tax rules basically in New York now to attract people back there, especially to upstate New York. So I think you'll see companies kind of thriving there as well. And then, you know, I think that obviously, honestly, I think the revolution is kind of happening, as I've said before, in Eastern Europe because of lax tax regulations and because of it's just cheaper cost of living. So you see a lot of studios, great studios coming out of now Poland and the Ukraine and places",
            "start": 4286.26
        },
        {
            "text": "in Eastern Europe because of lax tax regulations and because of it's just cheaper cost of living. So you see a lot of studios, great studios coming out of now Poland and the Ukraine and places like that. So Michigan, I don't know. I mean, because you have to because you have to remember Michigan is actually a beautiful state and there's a lot of money and and, you know, you know, talent there for sure. But you the idea is to open a studio in a place where people want to move. Like you have to be able to attract talent from other places. So Insomniac in North Carolina, as far as I understand, one of the reasons that they put it there was because they needed to attract talent from the East Coast that didn't want to necessarily relocate to California. And it was a smart move for them to put it there because they were able to say, well, this guy's from Georgia, but he doesn't really want to come to California. But he does want to work for Insomniac. So he's more comfortable coming to",
            "start": 4327.3
        },
        {
            "text": "put it there because they were able to say, well, this guy's from Georgia, but he doesn't really want to come to California. But he does want to work for Insomniac. So he's more comfortable coming to North Carolina. And so it's just easier. Are you going to be able to attract people wanting to go to Lansing or to Ann Arbor or something? I don't think so. So I think that that's one of the and that's no offense to Michigan. It's just that it's easy to say like we're in Seattle or we're in New York City or we're in Austin as opposed to being like, well, we're in Cheyenne, Wyoming or something. And you can run certainly run a very cheap studio there, but you can be able to get anyone to go there. Look at schools with good programs too. You know what I mean? Good video game development programs or computer science programs, because those would be the ones if that school is up and coming, you have a lot of grads coming out of it who'd want to be starting something cool and simple. And if",
            "start": 4370.66
        },
        {
            "text": "or computer science programs, because those would be the ones if that school is up and coming, you have a lot of grads coming out of it who'd want to be starting something cool and simple. And if that's the case, you can find those schools. You can kind of identify where there could be a thriving indie culture. Go from there. Yeah. I think individually it's like if you really want to be part of the industry, like you need to go to it. Don't wait for it to come to you. And I think that's good advice for anything really. You know, it's like you can, there's so much options to make things happen and it's way easier for you to change your life than for hundreds of other people that change their lives. Sure. Next question comes from NWO Hollywood. It seems to me that you guys, the coolest dudes in video games have a strong dislike for Sonic the Hedgehog. I'd like to know why, especially from Greg since he grew up a Sega kid. Also given this year marks Sonic's 25th anniversary, do you think",
            "start": 4406.18
        },
        {
            "text": "in video games have a strong dislike for Sonic the Hedgehog. I'd like to know why, especially from Greg since he grew up a Sega kid. Also given this year marks Sonic's 25th anniversary, do you think Sega will release a new game? Will the series ever ever regain the popularity it once had? I hope against hope that that happens. Much love from the city of brotherly love. You got a lot of problems, man. NWO Hollywood there. Yeah, no, it'll never get as popular as it once was. That's coming on. Yeah, I grew up a Sega kid and I grew up thinking Sonic the Hedgehog was boss, loved him, had a great time with him. And then yeah, you go back and play those games like, Oh no, no, no, no. I tricked myself. I was caught in this fanboy war against Nintendo where I was like, Mario sucks. You can't fucking play Super Mario World and have any delusions that Sonic gets even close to at any point, Tim. I mean, hey, I'm not going to say it gets close to it, but I would argue that Sonic three and two,",
            "start": 4443.4
        },
        {
            "text": "play Super Mario World and have any delusions that Sonic gets even close to at any point, Tim. I mean, hey, I'm not going to say it gets close to it, but I would argue that Sonic three and two, like two and three specifically are great games. One has its moments. It also has its issues. Sure. But I think as platforming games, they're great compared to Mario. Absolutely. They're not perfect, but they're great games. And I think that people should have them a little harder than they need to. A lot of the other stuff, like the adventure games, I don't quite understand the love for those. Those are definitely fan favorites and I don't understand what they see in them. They're really bad to me. And then everything post then it's just like, let's get out of there. Sonic Boom. Sonic Generations is fine. I had fun with that one. In terms of the Sonic being popular thing, like I don't think that it'll ever be as popular as he was in the 90s because he, you know, that it was a different time.",
            "start": 4483.8
        },
        {
            "text": "is fine. I had fun with that one. In terms of the Sonic being popular thing, like I don't think that it'll ever be as popular as he was in the 90s because he, you know, that it was a different time. Mascots were a thing. Saturday morning cartoons reign supreme. But I think now in the world of the movies and stuff like we're seeing with Ratchet and Clank, like with the Sonic movie they announced, is that going to do good? Probably not because already I think Ratchet's what we were talking about earlier, doing the right moves of it is very much the game being made into a movie, a live action Sonic movie. No, thank you. Not exactly going to push the needle in terms of kids falling in love with Sonic again. I don't think. Is it the TV shows popular though, right? Yeah, the Sonic TV shows have always been popular enough, but they're also not, you know, Ninja Turtles. Yeah. It's not like huge. You can always tell by toy aisles at like Target, right? Like what's popular. There's not like a",
            "start": 4526.36
        },
        {
            "text": "always been popular enough, but they're also not, you know, Ninja Turtles. Yeah. It's not like huge. You can always tell by toy aisles at like Target, right? Like what's popular. There's not like a giant Sonic the Hedgehog toy out of Mario's out there. Even Mario's not living. You see some Mars in there. Meables. No, not me. Sonic is just a, I don't know. It's it's it didn't bring the goods. It's a marketing ploy. Sonic was a marketing ploy and people fell for it. Mario is objectively better in every way than Sonic, both at the time and every and ever since then in terms of pure gameplay, because Mario brought the goods. It was fun to play. It wasn't fast. It wasn't edgy. It was just fun. And Sonic is very much what Genesis was. It was very much Sega's revival of the console. People forget that Genesis launched in 1989. Sonic didn't come out like it wasn't a launch game. It was it was the way for them to revive the console in the West. It was a way for them to compete with the",
            "start": 4566.76
        },
        {
            "text": "forget that Genesis launched in 1989. Sonic didn't come out like it wasn't a launch game. It was it was the way for them to revive the console in the West. It was a way for them to compete with the Nintendo to make Nintendo seem kiddie and irrelevant by by using terms like blast processing and all these kinds of things. But really, it didn't mean anything. And Mario won that. You know, Sonic might have won the fight in the Genesis Super Nintendo era in terms of, you know, it does with Nintendo and all that kind of shit. But, you know, obviously, you know, Sega lost the war. And that comes from a person who, you know, I don't mind saying I have a Genesis and I had a Dreamcast like I, you know, I have no problem with Sega. I just always was bothered by like what what game are you playing to think that this is anywhere near as good or worthy mascot replacement for the bundled in game you got with Super Nintendo. It always really infuriated me. It's like one of those things that was like",
            "start": 4622.68
        },
        {
            "text": "think that this is anywhere near as good or worthy mascot replacement for the bundled in game you got with Super Nintendo. It always really infuriated me. It's like one of those things that was like I just I don't know. Blake Harris is console wars talks a lot about this, and I highly recommend that book. It's all about how Sega revived Genesis using Sonic and when there's a lot of really interesting shit about Sonic in there and who created it and Team Sonic and all that kind of stuff, the studio and how it's very Western game. I don't know. I just. Sonic, I think Sonic's popularity was almost artificial. Like I don't think that he was ever actually that popular. It's just it's just it was a very limited Q score kind of thing as opposed to a very long term. This game sells 10 million copies every time it comes up. Mario, you know, and and so I think that like it's like going back to 1999 looking at a Q score and crash bandicoots number one, you know, and he was. But you go back and,",
            "start": 4657.0
        },
        {
            "text": "every time it comes up. Mario, you know, and and so I think that like it's like going back to 1999 looking at a Q score and crash bandicoots number one, you know, and he was. But you go back and, you know, two years later and no one cares about crash anymore. So it's kind of a similar a similar thing. There's no ubiquity with Sonic. It's just it's just people. Yeah, it's just people like won't let go. Yeah, I mean, I think the difference is I mean, if you like, Sonic is something that even moms would know. You know, if you ask them video game characters, name them. I think Sonic Pac-Man, Mario, like those are characters that they know. I'll give you that. There's something there. And also the Sonic Advance games were awesome. Those are the closest we got to the original trilogy in the modern era. This one comes from Barry Burton's beard. I've got absolutely everything I want in my life. Damn. Barring one thing. Oh, no. Will we ever get an HD Parappa the Rappa? Probably not. I'm",
            "start": 4701.16
        },
        {
            "text": "modern era. This one comes from Barry Burton's beard. I've got absolutely everything I want in my life. Damn. Barring one thing. Oh, no. Will we ever get an HD Parappa the Rappa? Probably not. I'm surprised that we haven't, but I don't know. I don't know. I think it's more complicated to do one of these games than they thought. And I was thinking proper, Robert, who was really bad. And so I think that they got a little gun shy charging $60 for that game and releasing it was just like I was so disappointed in that game in the world of Jammer Lamy. But I but that but I'm saying I'm saying we got him general at Walter P.S. one classic too. I'm saying we got a spin off of it that went in a more rock and roll direction. I think that there's licensing issues with doing a prop of the game game because you either have to have you either have to have someone writing this shit natively, which is expensive, or you have to license the music, which is expensive. And I don't know that there's an",
            "start": 4735.24
        },
        {
            "text": "because you either have to have you either have to have someone writing this shit natively, which is expensive, or you have to license the music, which is expensive. And I don't know that there's an appetite for proper the rapper, which is which is which is surprising to me because I think that I think if they were going to do it, two thousand seven thousand eight thousand nine would have been the right time to do it. I don't know that it's like PlayStation All Stars was a chance for a lot of people to be like, oh, we like this character. And then they did just put out the piece to classic for the rapper. And so it is a possibility. I'm sure they're looking at it in some way. I think you got another proper the rapper. If anything, I think it'd be a digital game. One hundred percent. I don't know. One hundred percent. No, no, no, no. Retail game. Popcorn Shower says, Hi, guys, I want to get Lego Dimensions, but I don't know if it'd keep me entertained in the long term. I've really",
            "start": 4779.16
        },
        {
            "text": "don't know. One hundred percent. No, no, no, no. Retail game. Popcorn Shower says, Hi, guys, I want to get Lego Dimensions, but I don't know if it'd keep me entertained in the long term. I've really played Lego games in the past, but I never played a twist to life game. What do you think someone like me should know before going all in with Lego Dimensions? Well, I don't know why you said you briefly played the other Lego games. Why? Why? Just briefly, I need more information as to why you would just play a little bit of those. If you don't like those, if that game play didn't work for you, this isn't going to really revolutionize. And I mean, don't be wrong. My favorite part of Lego Dimensions is when I put them down on the thing and it's like, all right, let's build stuff. And we sit there and you build the car or whatever the hell is going to be the arcade cabinet and then go through and play it. And the way they mix it up. If you have a problem with the Lego gameplay, though,",
            "start": 4815.96
        },
        {
            "text": "there and you build the car or whatever the hell is going to be the arcade cabinet and then go through and play it. And the way they mix it up. If you have a problem with the Lego gameplay, though, that's what Lego Dimensions is. So that would be my main figure out why you didn't like those games before you move on this one. The reason Lego Dimensions works is that it's fun. It breaks the fourth wall. It has fun with all these different licenses, bringing them together and doing different stuff. And then it is an excuse for you to play with Legos and build Legos and have a purpose for why you're putting together all these Legos and owning all these Legos. That's what I like about it. Ladies and gentlemen, this has been the first ever episode 66 of the kind of funny games cast. Greg, yes, this episode is coming out this Friday for Patreon users over at patreon.com slash kind of funny games coming out next week for the youtube.com slash kind of funny games crowd for everybody, though,",
            "start": 4850.36
        },
        {
            "text": "this episode is coming out this Friday for Patreon users over at patreon.com slash kind of funny games coming out next week for the youtube.com slash kind of funny games crowd for everybody, though, will be at PAX East at some point during that time. Do you know when PAX East is? That's when we'll be there. Exactly. Go to kind of funny dot com slash packs East to find out about all of our things we're doing there. We have the kind of funny panel on Friday. We have the kind of funny party on Saturday, then a whole bunch of podcasts or panel appearances, a whole bunch of signings at Rooster Teeth. A whole bunch of crazy ass shit's happening. You're doing a Paximania thing. I'm doing Paximania where I will bury Dan Reicher once and for all. Yeah, fuck that. Fuck Dan Reicher. Fuck giant bomb. Dave link sucks too. Fuck everyone. Doctor tracksuit. Cool. John Drake. A punk ass bitch. He's a punk ass bitch. It's true. Aaron and Pope. Terrible announcers. You're talking a lot of shit. I know.",
            "start": 4888.2
        },
        {
            "text": "Dave link sucks too. Fuck everyone. Doctor tracksuit. Cool. John Drake. A punk ass bitch. He's a punk ass bitch. It's true. Aaron and Pope. Terrible announcers. You're talking a lot of shit. I know. I'm about to get shot. And I'll be fine. Until next week. I love you. Leave comments below. Let me know what you want for 69. Okay, I gotta go. He's just a disturbing looking person. He's a little fuck, isn't he? Just a disturbing human being. Actually, get on iPad. We are rolling. Oh, how are you going to sit? Is that how you're going to sit? No. How are you going to sit? Like this. Stay in the frame. Came with the frame. That's one of your ASMR things. Look at how desperate he is for that water. He's arse. Got a whole bowl of water out there. Go drink it out there. You can go for a while. Put all this at the end then. Definitely. Will he ever stop? Oh yeah. 10, 15 minutes, he'll be all done. He'll be rehydrated. Ready to take out the world. It's cool. Okay. Thank you.",
            "start": 4931.72
        }
    ]
}