{
    "id": 1625,
    "video_id": "r6JR9n0Alzo",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "Batman V Superman FULL SPOILERS Review - Kinda Funny Reacts",
    "description": "The first 9 and a half minutes are the SPOILER-FREE Review of Batman v Superman: Dawn of Justice. Then, it's just for people who have seen the film and want to discuss it with SPOILERS. Be careful looking at comments!\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1458674822,
    "duration": 4669,
    "transcript_chunks": [
        {
            "text": "What's up everybody? I'm Greg Miller. This is the pure one, Tim Getty's, and this is your Batman V Superman Dawn of Justice Review reacts, whatever you want to call it. I kind of funny. So if you haven't ever seen us review something or react to something, here's how it works. We don't do number scores or anything that's silly. We don't want to do that. What we do is we do a spoiler free portion and then get into spoilers. We make it very, very clear when we will go into spoiler territory. We are not there yet, so you will be in the no spoiler section of this. So if you just want to know if the movie is good, if it deserves your time, what we thought of the top level, that's great. Then we will go into spoilers. Of course, don't watch the spoiler section until the movie is out. Do not look at the comments, probably because of the people will be discussing the story spoilers down there. This is your chance to get the ultimate experience from us. Do all these different things, but still",
            "start": 0.0
        },
        {
            "text": "at the comments, probably because of the people will be discussing the story spoilers down there. This is your chance to get the ultimate experience from us. Do all these different things, but still see what we think and all that jazz. So Tim, yes, first off, Greg, I want you to know that I wore this jacket for a reason today. I don't know any Batman stuff, but this is the closest I can get to making sure that on screen it's Batman v Superman. Oh, nice. That's very good. I didn't think of that at all. Yeah, because I, of course, if you're just joining us or something, you've missed all the Batman v Superman coverage we've done. I'm a huge DC Comics nerd. This has been my dream forever to see the Trinity on the fucking movie screen, and I got to live that dream tonight. So just some credentials out here. Greg, number one DC fan boy of all time. Sure. Over here, DC fan. Yeah. You know, comic fan. You enjoy it. I read a whole bunch, but I'm not super well versed. Exactly, but I enjoy the",
            "start": 36.96
        },
        {
            "text": "out here. Greg, number one DC fan boy of all time. Sure. Over here, DC fan. Yeah. You know, comic fan. You enjoy it. I read a whole bunch, but I'm not super well versed. Exactly, but I enjoy the stuff. So I think this is an interesting conversation ahead of us. I do too, so I mean lots of people on Twitter are asking for what I thought and I want to know what you thought, but this is my moment. Oh, this is yours. This is my good way. Greg, I liked that a lot and I might love it, but I don't want to say I love it yet. I want to see a few more times. I want to man literally. We just left the theater and came here, so there's a lot going on in this movie. Number one, there's a lot going on in this movie, which I think is great. I think in the beginning the pacing jumps around a bit, but there's a moment that happens that for me was like what in solidified and then we were off to the races. I feel like I feel the for me, I was telling Kevin. I think I talked to you about it right. There",
            "start": 72.0
        },
        {
            "text": "a moment that happens that for me was like what in solidified and then we were off to the races. I feel like I feel the for me, I was telling Kevin. I think I talked to you about it right. There were three moments in the film that I thought were genuinely like what the fuck I did not see that coming moments in the rest were in fact spoiled by the trailers. I think that we did have all of it given away on that front, except for these three big moments and I enjoyed the ride of everything. Yeah, overall, really, I right there. I want to say I love the movie. I probably love the movie, you know what I mean? But like I got burned by leaving Superman, return to be like Superman returns. Love. Yeah. Do you love the movie or do you love the experience you just had of what people clapping for the shit I love seeing the movie and seeing them on the screen? I mean, that's a loaded question. I don't know yet. That's the thing. I don't know how to separate the wheat and the chaff yet on that one.",
            "start": 116.64
        },
        {
            "text": "shit I love seeing the movie and seeing them on the screen? I mean, that's a loaded question. I don't know yet. That's the thing. I don't know how to separate the wheat and the chaff yet on that one. You know what I mean? I can tell you. I thought I liked Ben Affleck a lot. I thought I thought I mean I've liked Henry Cavill from Man of Steel. Even when I have like problems with Man of Steel, he's awesome in this. I think this is my problem. One of my problems with Man of Steel was him in lowest where it's like I get where you're going, but I felt you got there too fast and that I thought they were awesome together in this. I thought Amy Adams was awesome in this movie as Lois Lane, which I didn't think too much of in Man of Steel. Not that she was bad, but it just like it wasn't enough time to get into this character where here there's like depth and she's she's doing reporter stuff instead of being in military fatigues on an alien spaceship and be like what you know what I mean like",
            "start": 158.0
        },
        {
            "text": "to get into this character where here there's like depth and she's she's doing reporter stuff instead of being in military fatigues on an alien spaceship and be like what you know what I mean like I thought she was. I think there's so much going on, but I thought the supporting cast and the cast itself was so good. You know what I mean like it's awesome to see this movie come together and not be so many threads. We were so worried about right there. He so much in there that you want to be able to keep track of it and how does it all go and out of that again? We'll get into that and spoilers part of it, but I thought they did a good job of it where I was with it for the most part. I think Lex's motivations in the third act went off the rails for me a bit. I feel like they try to bring it back into his final scene and we'll talk about that in a little bit, but overall I'm super jazz. I'm super super jazzed about what they're doing here and what the cinematic universe they are building",
            "start": 196.48
        },
        {
            "text": "back into his final scene and we'll talk about that in a little bit, but overall I'm super jazz. I'm super super jazzed about what they're doing here and what the cinematic universe they are building and how it differs from Marvel. Even though I still wish Zack Snyder and everyone involved with these movies, you would embrace after credit scenes. Yeah, that's all I'm saying. There's no after credit scene on this movie, which is fine. I after I remember after we're managed still, he said something in an interview about after credit scenes and how he wasn't really into him, so I didn't expect it here. Yeah, I could have gone for it. You could have had it. Yeah, I think it could have helped a lot. Honestly, like my thing is, I don't want to get too bogged down by what I didn't like about this story, especially before we get into the spoilers thing in my non spoiler pitch on this. You need to see this movie if you're into this stuff. Yeah, I mean just surely seeing them on screen together",
            "start": 237.76
        },
        {
            "text": "story, especially before we get into the spoilers thing in my non spoiler pitch on this. You need to see this movie if you're into this stuff. Yeah, I mean just surely seeing them on screen together and the moments that they have, like what you see in the trailer. Yeah, a lot of the stuff is you've seen it already, but the extra stuff is really cool and I think that I was really impressed with like those moments. I'm like, this is cool. This is cool. I kept thinking that and I was worried I wasn't because I didn't during Man of Steel, right? My review. This is better than Man of Steel for sure. That goes without saying, but there was a chance because there was too much going on. All right, I do not think it was much better than Man of Steel. But I do think that you need to watch it just so you can at least kind of see the cool parts. Did you enjoy it there? I did, but I found myself constantly during the movie questioning if I did and if I should sure and that's not good. Do you think",
            "start": 274.16
        },
        {
            "text": "you can at least kind of see the cool parts. Did you enjoy it there? I did, but I found myself constantly during the movie questioning if I did and if I should sure and that's not good. Do you think that's been part because of this video being right afterwards? No, I mean, I think that it was like to say that I was bored isn't necessarily correct. It was more like anticipating what was gonna happen and it never quite did what I would think was cool and a lot of stuff happened where I'm like, oh, like, oh, that's, that's what's happening or like something would be set up and I'm like, damn it. Like they're going there. That's the direction they're going. That sucks, you know? But yeah, I think overall it, it's better than Man of Steel is my non-spoiler. I think it's a lot better. I think it's head and shoulders better than Man of Steel and not that I think again like this is the, I guess you if you're, you've just wandered in off the internet and don't know anything about me, right? I",
            "start": 322.96
        },
        {
            "text": "head and shoulders better than Man of Steel and not that I think again like this is the, I guess you if you're, you've just wandered in off the internet and don't know anything about me, right? I went and saw Man of Steel at a preview event similar to this, right? And I remember leaving and I the next day like Rich George, it was his comics guy and it was like, what'd you think? And I was like, I liked it and he's like, oh God, that's a horrible side. And like we've talked about it since then. Like my problem with Man of Steel was that I had my expectations set to what Superman is in the comics or was in the comics, not even now anymore, but is in the comics and what I'd seen Marvel do. And so you expected bright blues and this and like, especially off the trailer with the music and that score and everything else. And then you got there and it wasn't that movie. And then once my expectations were, I always say this in an insulting way, but not meaning it to be lowered on that movie.",
            "start": 369.28
        },
        {
            "text": "score and everything else. And then you got there and it wasn't that movie. And then once my expectations were, I always say this in an insulting way, but not meaning it to be lowered on that movie. And I went back and watched it and accept it for what it was and what it was for a building block of the universe. I was like, you know what? I enjoy Man of Steel now. I understand what that is and what this movie is supposed to be. See, now this is the point right here where I feel like we're treading between the spoilers and not spoilers. So I say we... We haven't even jumped over to that. Yeah, I know. That's what I'm saying. I think we should jump over. Okay. My one thing before we do it, I enjoy the movie. I definitely dug it. Definitely really liked it. I do think I loved it. I think I'm going to come down on it. And you're like, dude, did I love the movie or did I love the experience of it? I mean, like for me, the moments in the movie, like not... Because you're taking out the",
            "start": 403.92
        },
        {
            "text": "I'm going to come down on it. And you're like, dude, did I love the movie or did I love the experience of it? I mean, like for me, the moments in the movie, like not... Because you're taking out the experience of like the crowd, right? I'm not even talking about that. I'm just talking about just seeing I was talking to you about this earlier. When I first saw Transformers, I saw the trailers, everyone was talking shit and whatever. I loved Transformers growing up. So to me, it's like just to know that Optimus and Megatron and Starscream were on screen together. Even though it wasn't a great movie, I was still like, oh my God, this is happening. Oh my God, this is real. I don't think that... I'm not hung up on that. Because when I'm talking about... I'm talking about Amy Adams and Henry Cavill's relationship. I'm talking about Jeremy Irons and Ben Affleck's relationship. I'm talking even about the General who's now like a... Well, that's not a spoiler, whatever. But you know what I",
            "start": 439.76
        },
        {
            "text": "Cavill's relationship. I'm talking about Jeremy Irons and Ben Affleck's relationship. I'm talking even about the General who's now like a... Well, that's not a spoiler, whatever. But you know what I mean? Like the guy from the first movie who's back and like his relationship, how he's talking to Lois and things like that. I like... And Lex, I mean, we're gonna get into, I'm sure I'm gonna do a whole bunch about Lex. I enjoyed Lex. But again, from the trailers, I was like, I think I like this Lex. Yeah. And my thing was during the trailers, Lex was one of the things that I was like, oh, I don't like this at all. In this movie, Lex was, I think, my favorite thing of this movie. Until the point in which things... I'm like, I don't think I like you anymore. Just as the character. Things change. And I'm like, this is why, really why I don't understand. Yeah. Okay. Yeah. All right. So I think the movie is awesome. Obviously, DC fanboy number one. So I was gonna tell you that. But I also",
            "start": 478.88
        },
        {
            "text": "And I'm like, this is why, really why I don't understand. Yeah. Okay. Yeah. All right. So I think the movie is awesome. Obviously, DC fanboy number one. So I was gonna tell you that. But I also would be the guy who would be in tears right now if I thought the movie didn't live up to what I wanted. But I am a guy also... To exceed that. I'm also a guy... Yeah, I'm also a guy, heads up, of course, that loved the trailers. So if you hated the trailers, maybe there's something there too. I guess that's my thing. The last spoiler free thing is me being somebody that was like, I knew what I'm getting from this movie. This was exactly that. And I think that that is kind of a disappointment overall because I wanted to be impressed. And it's not so much that I was looking for it. It's just, I wanted it and it didn't happen. In fact, the whole universe, and we'll get into this in a second, because I really want to. I don't think this is a great stepping stone for building this universe. Wow.",
            "start": 520.64
        },
        {
            "text": "it and it didn't happen. In fact, the whole universe, and we'll get into this in a second, because I really want to. I don't think this is a great stepping stone for building this universe. Wow. Wow. Ladies and gentlemen, we are now entering the spoiler part of this review. I again urge you to not watch anything else until you've watched this movie. Like this video will be here when you watch the movie on the 25th. You do not need to see it right now. You do not need to dig through the comments and talk to people if you are not prepared for that. Also, don't look on twitter because I've seen so many people spoiling this and I can't believe somebody in our twitch chat spoiled and I didn't believe them. So thank God I didn't do that. That's like two days ago that they did. Yeah, there are moments in this movie that are surprises. Yeah, so okay, do not look for that. We are going into spoiler Terry. Now we are there. This is your final chance to click off. I love you very much. Let's do",
            "start": 560.32
        },
        {
            "text": "in this movie that are surprises. Yeah, so okay, do not look for that. We are going into spoiler Terry. Now we are there. This is your final chance to click off. I love you very much. Let's do this. Okay, you didn't think this built out the universe well. Okay, so here's my thing as somebody that is familiar with the universe but not entirely familiar with the universe. Just seeing random people be there isn't enough and I wanted this movie with me saying the that I was disappointed by it. I wanted it to make me understand how Aquaman and Cyborg and Flash and whatever at least fit in and we all knew, oh, they're all going to be in this movie and we're worried about how fleshed out they are and we knew they were going to be cameos. I didn't expect them to be this much of a cameo to the point of them literally being like, well, here's security footage of them that you could see, including some underwater footage of Aquaman. Let's hold on him for a little bit longer because he's Jason",
            "start": 602.72
        },
        {
            "text": "of them literally being like, well, here's security footage of them that you could see, including some underwater footage of Aquaman. Let's hold on him for a little bit longer because he's Jason Momoa and people know him and they've seen his outfit. Like this movie, it felt so disjointed to me in terms of writing the whole thing and in terms of tone and I think that was my biggest issue with it. So you're talking about the, you, when you watched Man of Steel, you liked it, but didn't like it, but I had a lot of it and you had your whole whatever. And then you you've said so many times you've had this like impassioned speech about, you know, it's like it made me realize what this universe is and that it's not Marvel. It's not cartoony. It's not this whatever it is, this thing that's more ground. What if heroes are super heroes came to our world and you sold me on that? Yeah, I believed and I was like, all right, like I can get behind that. This movie to me, I'm like, oh shit, it didn't",
            "start": 644.8
        },
        {
            "text": "What if heroes are super heroes came to our world and you sold me on that? Yeah, I believed and I was like, all right, like I can get behind that. This movie to me, I'm like, oh shit, it didn't do that. This it this was weirdly. It was that people die explosions. There's they're dealing with all this stuff and like everything you saw on the trailer that looked awesome of Bruce Wayne kind of seeing the destruction and all that stuff happening, whatever. My cool. How are they going to deal with the fallout from that Superman? Is he this false idol? Like what's going on? That whole plot kind of just stops. You know, they blow up the thing, which is like, that was crazy. And it was definitely a moment of damn. They went there, but then it's like, we leave at the end of this movie and it's like, so there was a lot more destruction. A lot more people died. Yeah, no, no, no, no. Remember they made a huge point this time around of like, well, when they start fighting in downtown metropolis,",
            "start": 688.48
        },
        {
            "text": "so there was a lot more destruction. A lot more people died. Yeah, no, no, no, no. Remember they made a huge point this time around of like, well, when they start fighting in downtown metropolis, getting like, whoa, I'm glad to at least it's, you know, they've cleared out the work day's done and then again, it's to an abandoned island strikers, which is cool. And then again, it's like she's even like, what about, why did you bring them back to the city? Like this, this is abandoned too. I'm like, damn, you got a lot of abandoned parts. Even if it's, even if it's not so much about the death, just the sheer destruction of it, it was still dragging ball. Z ask people getting thrown back and forth, but again, I get it. Superheroes like that. Do we want that or not want that? And I understand that no matter what, there's no pleasing people, but I think my biggest issue and I like, I said this back with the trailer, so I can't believe it actually stuck to the movie, but the overuse of",
            "start": 728.96
        },
        {
            "text": "that no matter what, there's no pleasing people, but I think my biggest issue and I like, I said this back with the trailer, so I can't believe it actually stuck to the movie, but the overuse of weirdly dramatic music cues that just kill the vibe and kill the tone. When we first saw the trailer and it's like, oh, meet Bruce Wayne and the piano goes ding and it's, you know, Luther just there and it's like, wow. Okay. So he's a wacky, cartoony guy. So it needs to kind of break the fourth wall, like really of the music, actually, what do they hear it too? And this movie, oh my God, anytime. And I get characters have themes. I'm all for that, but the character themes being as disjointed as these were, this totally felt like, uh, um, just we're trying to start a universe. So guess what? Lex Luther, he has this weird piano thing where it's just random, disjointed notes and stuff. Oh, Batman's here. You know what that means? Done, done, done, done. Everything he does, every single thing he",
            "start": 762.08
        },
        {
            "text": "he has this weird piano thing where it's just random, disjointed notes and stuff. Oh, Batman's here. You know what that means? Done, done, done, done. Everything he does, every single thing he does. He stands on a rock. Done, done, done, done. He stands over here. Done, done, done, done. Everywhere he stands. It's this just done, done, done, done. And it takes away. It was never cool to me. There was never a moment that I'm like, Batman's fucking cool. The three of them standing, the Trinity being bad-ass that we saw in the trailers, fucking bad ass. My heart raced. I'm like, this is awesome. Everything else. I mean, Man of Steel had that moment, him putting his hand down and flying for the first time. Chills. Awesome. This movie had none of that for me. I really think it's because of the music. My biggest issue with the music to finish this point is wonder woman. No, every single time she, that's what I was going to say. Like when she fucking showed up the first time and the shield,",
            "start": 809.52
        },
        {
            "text": "music. My biggest issue with the music to finish this point is wonder woman. No, every single time she, that's what I was going to say. Like when she fucking showed up the first time and the shield, and then she brings it down and her music hit. That was the first time. That was the first time. Here's some nineties guitar. Here's some nice guitar. That's cool. But here's the thing. I'm with you. It would be cool if these were Marvel movies, if this was the tone of it, we're going full comic. We're going for, yeah, there's fucking guitar. Cause wonder woman's here and yeah, Batman's up there. So done, done, done, but no, it's like there's death and there's real shit and like this is supposed to be real and we're dealing with this real stuff. Cheesy music, cheesy music, cheesy music. And it really, it took me out of it to the point. I'm like, man, like this isn't the same for me. It wasn't, I don't ingest content the way you and Nick do in a lot of ways in terms of movies and stuff like",
            "start": 843.68
        },
        {
            "text": "really, it took me out of it to the point. I'm like, man, like this isn't the same for me. It wasn't, I don't ingest content the way you and Nick do in a lot of ways in terms of movies and stuff like that. Wonder Woman is the only Q that I picked up on and I liked that one. You know what I mean, but and that's the thing about it into your point where you're like in a because we got way off of it to begin with of just not building a universe. I thought that this was a great universe building one in that it introduced them in such comic book. He weighs like you know because, like I what we when we were leading into this right and I've done, I've you know we're doing suicide squad re ones and I talking about the Jason Todd theory, that joker's Jason Todd, and this is how this stuff done. I'm like I was going to talk to me in line about this today. You know one of the fans shout out all the best friends who said hi to us to this thing in the you know it is the robin suit there with the",
            "start": 880.96
        },
        {
            "text": "like I was going to talk to me in line about this today. You know one of the fans shout out all the best friends who said hi to us to this thing in the you know it is the robin suit there with the jokes on you and dada and it's like I love the fact that this is a universe built for me and it is built for DC fans and I understand that that alienates you in a way. You know I mean same way that like now, like I was talking about at the end of, I guess the winter soldier right when the lights came up and Christine turned to me like so what's the deal with scarlet wish and quick silver and I'm like I don't know don't know anything about them. This is the first time I've ever seen the straight and been like let's go watch the I G, a video because I have no fucking clue what these people are. You know what I mean like I understand that, but for me I'm so so into this. If they're like yep, joker's Jason Todd and there used to be another joker and this happened, and it's like for me like like",
            "start": 921.92
        },
        {
            "text": "know what I mean like I understand that, but for me I'm so so into this. If they're like yep, joker's Jason Todd and there used to be another joker and this happened, and it's like for me like like in terms of universe building that fucking flash moment. You know what I mean like I beforehand we were doing the twitter Q and A and a kid asked me. You know what would be your like lose your mind moment and I was like that's not going to happen this movie because I my head, because I lost my mind during the trailer reactions. It would have been the reveal of doomsday right. If they would have just like here's doomsday, I'm like what the fuck, but like they ruin that for me and those go or whatever I mean for the ride, but like when fucking flash comes back in the fact that this was telegraph. Remember we've done these reactions and stuff and I've talked about that. The Jeff Johns conversation with Kevin Smith on Cw, where they were talking about how you know aquamans water and superman's",
            "start": 961.04
        },
        {
            "text": "Remember we've done these reactions and stuff and I've talked about that. The Jeff Johns conversation with Kevin Smith on Cw, where they were talking about how you know aquamans water and superman's up in the air and in like flash is going to be time time he's going to be that's like they're really going to play at the time thing. So for him to come back in time and yell at Bruce Wayne, I was like I literally did this and that and then somebody asked me what would be like what would make you jump out of your chair and I couldn't even come up with anything and like I was fighting not to. I was fighting not to yeah. You literally he literally in the theater went like this. And it was like you know a man and that was the thing too is like the odd in like you're talking about the experience like it's an I'm super excited to see that I wish I could go see it again right now. That's the big thing and that I think speaks to how like managed to I was like I'm going to take time off from this.",
            "start": 998.16
        },
        {
            "text": "it's an I'm super excited to see that I wish I could go see it again right now. That's the big thing and that I think speaks to how like managed to I was like I'm going to take time off from this. You know what I mean this movie. I'm seeing twice more this week and I'm so fucking in and I wish it was tomorrow because I want to go back and get out, but especially for opening night when people won't know what's coming, but like when that fucking happened in that entire scene goes to hi, you know about Lois Lane. I thought he was saying the suit, but that's not what it was kind of sound like. I heard Lois Lane. I mean it was a lot going on and people were clapping and shit. Well, that's no. That's the whole thing is that the room everyone took a collective breath and it wasn't until he woke up that everybody went nuts and I was like that's fucking awesome like that's a moment and I wish that they would have hidden doomsday and they would have done this not you know yeah showed all their",
            "start": 1040.96
        },
        {
            "text": "up that everybody went nuts and I was like that's fucking awesome like that's a moment and I wish that they would have hidden doomsday and they would have done this not you know yeah showed all their cards like they did. I mean, but like when they did that, I was like this is this universe to me and I know that it's like for a casual fan and that's not you know, but like a cursory. Yeah, I know you're because like Tim reads a fuck ton of comics. I'm not saying he's a casual fan, but like you know, you don't know this the way I know the things I know the fact that they just threw that in there and like now here's one of my things is like that was for me the moment where I was like boom like it clicked for me of like oh okay, okay, okay and that's when I was like locked in this movies. I'm into this. I'm into this. I mean yeah because before it was, I thought a weird pacing of like here's the flashback to Batman. Here's the flashback to metropolis. Here's what's happening with Clark and",
            "start": 1074.16
        },
        {
            "text": "this. I'm into this. I mean yeah because before it was, I thought a weird pacing of like here's the flashback to Batman. Here's the flashback to metropolis. Here's what's happening with Clark and Lois here's and I was like okay, okay, okay and then it was like not out of the blue, but it was the nightmare thing began and I've been from the jump trying to figure this out right of how how does the how do the parademons and you know because I had this whole fear. Maybe there's a bizarre as superman. This is like the old old days right and like the mask and torn off and the parademons and the omega symbol and I'm like I even on the Q and a beforehand on twitter. I was like there must be some wonder woman vision she has, but I'm like I don't know how she gets it to Bruce. I don't know because it clearly from Bruce's perspective. How does he get this thing and so for him to have that in them throw that at you and like I and I and you're, you know dark side, you know parody like I get that,",
            "start": 1120.16
        },
        {
            "text": "it clearly from Bruce's perspective. How does he get this thing and so for him to have that in them throw that at you and like I and I and you're, you know dark side, you know parody like I get that, but like the general superman fan, I think going to this will not know who those people are what that is yeah and like then in the end I don't when it's happening. I'm like what the fuck is going on. How is this possibly? How does this and then you cut back and it's fucking flash speaking through time to Bruce Wayne and I was like like you know what I mean like yeah and that was the thing of just like holy fucking shit. Is that awesome? You don't I mean in like I have said I know you mean a million times. I know don't even bother putting out the comments, but like that is what I want. You know what I mean in God day when they jump in the, you know jumping way ahead and like even even just Bruce to go to the files and look through and like it was, you know wonder woman flash cyber or a",
            "start": 1161.04
        },
        {
            "text": "know what I mean in God day when they jump in the, you know jumping way ahead and like even even just Bruce to go to the files and look through and like it was, you know wonder woman flash cyber or a gockel man, not in that order and like he opens wonder ones file and sees the thing with her and Chris pine from where I'm like yes and then the music plays and it pans over just to make sure you know it's wonder woman yeah. I heard you scoff them too, but then they went back to it again later and then when she opens it up and like does all this stuff and I was like looks through everybody's files. I was just like this is awesome now. I'm with you. Don't get me wrong of you know when cyborgs video plays or whatever. When one woman is looking through the computer or whatever that was the first time where I was like hmm like this is, but I mean these are the concessions we have to make for this. It is even with my thing of like it's real life, but with superheroes and this is how we react",
            "start": 1205.84
        },
        {
            "text": "time where I was like hmm like this is, but I mean these are the concessions we have to make for this. It is even with my thing of like it's real life, but with superheroes and this is how we react to them. We have to make a concession and that's superhero exactly exactly exactly, but I still see I loved that. I love. I just loved everything that happened on that front on that front. I was really, really into my thing. Don't get me wrong. I think you're mistaking some of the things I'm saying about the world building. I think that the flash thing is awesome. It's stuff like that. That's to the people that don't know what that is. It tells them that there's something they don't know and I think that's cool. I think it's the stuff that this movie should explain like wonder woman a little bit more instead of just oh, it's some woman that's at these parties. That steals Batman shit and then Batman finds her. They talk a little bit more and now she's in a suit because he found a file. It's",
            "start": 1243.04
        },
        {
            "text": "more instead of just oh, it's some woman that's at these parties. That steals Batman shit and then Batman finds her. They talk a little bit more and now she's in a suit because he found a file. It's like that's just it. We knew she's Wonder Woman because we knew we've seen the pictures. We know all this stuff, but why how and I know that there's a movie coming out that will explain all that stuff and I know that's like I guess it's a movie, so it's just like just pretend like none of this matters, but I just think it's weird. Usually you watch movies and it's like you understand why the characters that are the main characters are interacting with each other besides the fact that well, they're super, so that needs to happen and it just it was really weird to me where I know that people watching that movie that aren't DC fans are going to be like what the fuck? You know, I mean, I do you hope they're surprised when she becomes Wonder Woman or I mean, I don't even think it's earned. I",
            "start": 1283.44
        },
        {
            "text": "that movie that aren't DC fans are going to be like what the fuck? You know, I mean, I do you hope they're surprised when she becomes Wonder Woman or I mean, I don't even think it's earned. I think, okay, maybe maybe when they show the picture, it's like, okay, that's the moment of oh shit. She's old. She's old. But it's like, I don't know. It just it felt it fell so flat to me of like it didn't feel earned at all. It just it's like, all right, cool. So there's this woman and she does these things. And now here's a picture. She's Wonder Woman and then, okay, now she's going to come and she's saving people. She's Wonder Woman. And like from that, once she once she's Wonder Woman, she's awesome. Oh, she's so good. So good. Love that shit. There's so many like you've seen it in the trailer of the one where she gets knocked back by doomsday into the thing and then get some goes and like runs right. There's another great one where she's knocked down and she has this grin for you. It's like",
            "start": 1323.52
        },
        {
            "text": "the one where she gets knocked back by doomsday into the thing and then get some goes and like runs right. There's another great one where she's knocked down and she has this grin for you. It's like you get that like, yeah, yeah, this is fucking go like four or whatever. It's exactly. And so definitely it did build things and it is exciting in a lot of ways. But I just say, and again, the cyborg thing I thought was fine, like whatever. It's like, here's just that we don't that it's like characters you don't know. We understand you don't know them. And that's why I think the cyborg thing actually in some ways was good because at least it went out of its way to be like, I know you guys don't know who the fuck this is. So here's a whole bunch of stuff. We're going to talk for a bit just to make sure that you know that like, we know you don't know. Whereas the other stuff, it's like, it's like Aquaman. All right. He's Aquaman because he's underwater. Like honestly, the Aquaman scene was",
            "start": 1364.32
        },
        {
            "text": "make sure that you know that like, we know you don't know. Whereas the other stuff, it's like, it's like Aquaman. All right. He's Aquaman because he's underwater. Like honestly, the Aquaman scene was bad. And like, I'm not Jason Momoa Aquaman hater. Like I want that to be cool. And he looks, I think he looks cool. Didn't look cool in this. I thought that was like, this was the weird one, right? Of like, they have all this like security footage and all these things and dah, dah, dah. And his is like, I'm Aquaman. And I guess I'm trying to keep my presence hidden, but not this time. I'm just going to come up slowly to camera and then finally hit a thing with a trident. And then I thought when he swam away, it was cool. But it should have been like, cause you saw his eyes and it would have been much cooler. I think personally, you know, as Greg Miller, first time director, multiple time writer, if you would have seen the eyes, then he fades back and then you see the trident come out,",
            "start": 1405.52
        },
        {
            "text": "been much cooler. I think personally, you know, as Greg Miller, first time director, multiple time writer, if you would have seen the eyes, then he fades back and then you see the trident come out, killed the one thing. And then he holds out there. That's awesome. This weird and lingering and pandering. It was very like, here's Aquaman. It did get a reaction from the crowd. That was another point where they clapped and went crazy. Exactly. That's what pandering gets you if it works. Exactly. Exactly. And it's, oh man. I think that the biggest moment where I was like, besides the music, cause it really did bother me, but the, cause especially the second time where they brought back the wonder woman picture again, why? Cause it's a cool picture. But the biggest issue for me was the Batman fighting Superman, the turning point of why they stopped fighting. Yeah. Martha. Right. Cringe. Just please know why is this really a thing? And then it's like, okay, cool. I'll let it go. I'll be cool",
            "start": 1440.96
        },
        {
            "text": "Superman, the turning point of why they stopped fighting. Yeah. Martha. Right. Cringe. Just please know why is this really a thing? And then it's like, okay, cool. I'll let it go. I'll be cool with this. If you just keep on moving with the story and this happened. Oh, you're going to go back to the flashback to make sure that we know exactly why this is, this is meaningful. Let's have Batman walk around like this for a second, not know what the fuck's going on so we can, so we can understand what's going through his head. He couldn't save his mom. He can save his mom. They're both named Martha. Yeah. No, no, no. Like that. Like for me, the ad, like, like it's comic books and it's movies and it's whatever. So like my first reaction is like, I'm Superman and this is, Lex is being bad and I got to do this. So when I land, I'm immediately going to say we're being tricked into fighting. This guy has my mom. I need your help and instead he stumbles over and then keeps walking in the traps",
            "start": 1481.92
        },
        {
            "text": "got to do this. So when I land, I'm immediately going to say we're being tricked into fighting. This guy has my mom. I need your help and instead he stumbles over and then keeps walking in the traps and then gets mad and wants to fight it more and it's like so like at the end. Yeah, it would have in the so like there's this. I mean we're in the spoiler part, but I feel bad saying all this stuff, but like there's the part where he nonchalantly drops. I need your help Bruce and I'm like, oh shit, you know his identity. Like I could have gone for the scan and you're Bruce Wayne. Like I didn't get that, but I'm like, okay, no big deal. You must've scanned them earlier. Now, you know, maybe when you originally tore the doors off the car, whatever, no big deal. You do it. But yeah, when he gets to like the Martha and Andrew in Batman, it's like, how do you know that name? It's like you're Bruce Wayne. Your parents were killed. I read one article. I know, I know. Yeah, exactly. I was hoping",
            "start": 1539.2
        },
        {
            "text": "to like the Martha and Andrew in Batman, it's like, how do you know that name? It's like you're Bruce Wayne. Your parents were killed. I read one article. I know, I know. Yeah, exactly. I was hoping it was going to be, they're going to kill you right before anything happened. He stabs him. He's like, they're going to kill my mother. And that would have been motivation enough. And he's like, what are you saying? Exactly. You know what I mean? Like, oh, the thing you should have said when you landed the first time, that would have been helpful. Yeah, totally. But no, they didn't do that. And it was really, really awkward. And I also, that is a very, I agree 100% the end of that fight is awkward. Yeah. And then the, the, them teaming up all of a sudden it's like, now we're best friends. I get it. Okay. It's a movie. It's about movies. That's going to happen. We know, but I just thought it was so weirdly abrupt and like, he just cut me motherfucker. Like, you know, there was like",
            "start": 1580.96
        },
        {
            "text": "I get it. Okay. It's a movie. It's about movies. That's going to happen. We know, but I just thought it was so weirdly abrupt and like, he just cut me motherfucker. Like, you know, there was like Superman, just like, all right, we're good. We're totally good. And then I was telling you, my other issue is this, like this movie is constant need for literal ticking time bombs, where it's just like, all right, here's this clock that they're under and here's another clock. And then there's the egg timer thing going. And then just in case you didn't have enough things where you're like, okay, anything can happen. Lois gets put under water and the things fall on top of her. And it's like, oh shit. Is she going to make it? I wonder if Superman's going to come save her. Then he comes and saves her. And like, she, there's not even enough time to have that moment of issue alive or not. It's like, oh, she is. Okay, cool. Well, I'm like, you just wasted a, like the, the, you rose the tension for",
            "start": 1615.52
        },
        {
            "text": "And like, she, there's not even enough time to have that moment of issue alive or not. It's like, oh, she is. Okay, cool. Well, I'm like, you just wasted a, like the, the, you rose the tension for what? Nothing, just nothing. And then they immediately build it again to kill Superman. But they didn't really kill Superman. He's back. And we already know he's back there. So like, yeah, you're stuck. You just, you love to just truck through these points. The lowest thing was I was fine with. I didn't think she was really going to die. I was honestly kind of like, is this where Aquaman is going to pop up? Like, is he going to come out of this watery hole? You know what I mean? Like, and I'm like, I don't know how Aquaman would have heard about this, but whatever it kind of makes an animal and dudes and exactly. Yeah, I have some fucking sea urchins told me there's trouble foot. I'm never going to come get you, but no. Yeah. So I didn't think she was going to die and then they get to have",
            "start": 1651.84
        },
        {
            "text": "dudes and exactly. Yeah, I have some fucking sea urchins told me there's trouble foot. I'm never going to come get you, but no. Yeah. So I didn't think she was going to die and then they get to have that moment. And again, it is like that the whole reason that happens right is to get him off the to give him something so important that he can then get out of that fight to come talk to her and have again, like moments where I'm like, yes, this is fucking Clark and Lois. You know what I mean? And they do. You sound like you sound like me trying to tell Kevin how cool it is that Megatron's talking to star screaming. That's how we talked to him in the cartoon. And it feels like a right moment that I love, but I'm, but no, no, no, I'm not trying to, cause I'm not, I'm not at all saying your point about the tension and all this being wrong. I'm just saying, I mean, did you not like the moment of them talking? It was fine. I know it was good. It was good. I mean, it is good. I'm just saying",
            "start": 1696.32
        },
        {
            "text": "about the tension and all this being wrong. I'm just saying, I mean, did you not like the moment of them talking? It was fine. I know it was good. It was good. I mean, it is good. I'm just saying as an overall thing, like that is the good. That is the thing that they got right. Yeah. You know, but it's just surrounded by so much, everything else. I mean, for me, it was comic books is what surrounds it. You know what I mean? Like him going, it's just, I thought it was a good way to get him out of the fight, to get them over there, to get her to have that moment of, I really love you. And like the most honest line in that fucking movie. Jesus. That's awesome. And I think, and I'm pretty sure it's there. It might be on the balcony that he calls her low or he and I'm like, holy shit, that's all like the way they use pet names is so great. You know, she's always calling them Clark. She's never called him Superman and then granted, you know, but like like they were such an honest Clark and",
            "start": 1732.08
        },
        {
            "text": "like the way they use pet names is so great. You know, she's always calling them Clark. She's never called him Superman and then granted, you know, but like like they were such an honest Clark and Lois that I, I am not, I'm not having a scene because there hasn't been shots for it, but you know, like I felt like smallville took time to build to that, but like when they were in one, you know, Erica Duran and Tom Welling were together and he'd call her or she'd call him smallville and stuff like that was awesome, but like, you know, man of steel, they try to set that up, but I didn't feel like it felt right. The Superman returns Brandon Ralph and Kate Bosworth. I thought case Bosworth with those a bad lowest lane and definitely there was no romance there and then I mean we're just going further, further and back like this is like what I love about those two characters and just the way they care about each other and I love the balcony scene in DC when she just touches them and he has",
            "start": 1770.8
        },
        {
            "text": "further, further and back like this is like what I love about those two characters and just the way they care about each other and I love the balcony scene in DC when she just touches them and he has that on it and then he flies away. I'm like that's kind of pussy move, Superman, but whatever you know, and I understand you're going through some shit. You know what I mean it's same thing even to another like it's a movie, but whatever like lowest like you know puts it together like how would they know that you know that oh because I'm there. I'm the thing like they know they know where he'd be or whatever because that and she runs to the capital because she knows something's about to happen and gets to the barricade and see he's got a motherfucker super hearing Superman. Don't go in there. Shit's going down. Is that going to say something? I don't know what I don't know what, but things are happening. That's all you got to so then we get the seed, which was awesome, but also weird as",
            "start": 1806.64
        },
        {
            "text": "Shit's going down. Is that going to say something? I don't know what I don't know what, but things are happening. That's all you got to so then we get the seed, which was awesome, but also weird as hell. So we get we see the the senator or whatever she was. Yeah, yeah, yeah, yeah. Holly Hunter. Yeah, she gets the Kentucky center. There was the thing of the P. Yeah, awesome, super awesome. No, they saw the movie by now. Thanks, Kev. So the thing of the P and that's awesome, but then I just feel like they ruined it by like it went on too long. You got it. So I got on and then turn it and explain in case you didn't know the reference that we're making and then she talks all weird and it's like what yeah I was telling you on the or Kevin on the way out at least somebody that yeah when it starts and I saw the glass and I saw you know it said whatever gram is do sort of the hell set on the side of forget lemon sweet tea. Grandma's like whatever it does when it and I saw it and she started",
            "start": 1846.96
        },
        {
            "text": "and I saw the glass and I saw you know it said whatever gram is do sort of the hell set on the side of forget lemon sweet tea. Grandma's like whatever it does when it and I saw it and she started fumbling for words. I was like oh, she took a sip of it already now she's realizing it's poison like this is what's going down and then she doesn't. She just keeps fumbling for her words and then yeah she turns it around and still fumbling for her words and I'm like and then she looks over and Lex isn't there and it's like at any point I'd be like everybody there's something something's going down like it's all you ever have to yell you know what I mean but like and then I thought it was an awesome scene in a cool moment. Yeah, like that was unexpected and cool and seeing super understanding like that was awesome when it came back. I wish they would have come in for one single tear. Yeah, something something like that, but I thought it was good. I thought it definitely his face said enough.",
            "start": 1891.76
        },
        {
            "text": "that was awesome when it came back. I wish they would have come in for one single tear. Yeah, something something like that, but I thought it was good. I thought it definitely his face said enough. Yeah, yeah, I think this is somewhere you need to kind of jot my memory a bit because I haven't seen Man of Steel since it came out in theaters. Yeah, and like maybe I've seen Bits and Pieces when it came on TV, but that was the last time. So I was what 2009? 13. Really? Yeah, whatever time passed right? Yeah, there was a scene with his dad and he kind of had the thing where he could have saved his dad, but that would have given up that it was yeah. Jonathan told you was the world wasn't ready for him and he didn't want him using his powers and other. So there was a tornado coming. He they've gotten everybody other. Jonathan went back to save the dog after already saving a baby and then his foot got caught in the car, so he couldn't get out or he couldn't walk anymore. So he got out hobbled",
            "start": 1930.72
        },
        {
            "text": "everybody other. Jonathan went back to save the dog after already saving a baby and then his foot got caught in the car, so he couldn't get out or he couldn't walk anymore. So he got out hobbled out and then Clark went to make a move and he did the whole yeah, I got sucked into a tornado because I just I was like that. So fucking dumb. That is that that is dumb. Yeah. I remember being dumb at the time yeah, but in this movie there was the moment where lax is like you need to go fight Batman. If you want your mom to live, you kill him and then Superman like you know, of course it's a it's a movie, so he's going to figure it out. But like I was under the impression that he was going to go kill Batman to save his mom and it's just like it just seems like weird when the last movie you didn't save his dad, even those dad that stops you. This stops you, but go kill somebody even though you don't want to kill and like that's your thing. I don't know. So what was your hang up there? You're",
            "start": 1968.96
        },
        {
            "text": "save his dad, even those dad that stops you. This stops you, but go kill somebody even though you don't want to kill and like that's your thing. I don't know. So what was your hang up there? You're that he even entertained the idea of killing him or that he I mean I felt like he was going to go kill him. I like he when he lands and talks to low as he's like I'm going to try to talk him into it or I have maybe he, but he had. I thought he read on his face. It was. I mean he was there was a question sure, but like I don't know. I felt like it was a little bit leaning more than I was going to kill him. I thought I mean like and I don't mean because I thought you know obviously I don't like killed by now. I mean like yeah there I I didn't read into it that he was going to kill him and the fact that he even that that line started to make even more context or more sense in context right of like stay down. If I wanted you'd already be dead like again all the time to say they have my mother.",
            "start": 2010.72
        },
        {
            "text": "that he even that that line started to make even more context or more sense in context right of like stay down. If I wanted you'd already be dead like again all the time to say they have my mother. Lex is evil like you know what I mean like yeah we're being played a lot of things. I would have yelled yeah. I'm smarter than a kryptonian. Yeah, it's true. I think that the the fight scenes were all cool. The chase scenes were great like the car stuff was all really, really impressive. Now this brings up an interesting point. How do you feel about Batman fucking killing people? I mean it was awesome to see a different Batman. Sure. Like I think that he was brutal and uh and in terms of the the universe building like you're right like all the they did build a cool world and they they say lines here and there that make it really clear that this is not what we're used to. This is a different thing. Things have happened. He's been fighting criminals for 20 years or whatever. He makes clown",
            "start": 2048.64
        },
        {
            "text": "here and there that make it really clear that this is not what we're used to. This is a different thing. Things have happened. He's been fighting criminals for 20 years or whatever. He makes clown references. There's the phantasm references. All these references to just things that happened. How many of these and this is another Jason Todd reference I think maybe of like how many of the good guys stay good guys. Exactly and like there's all this stuff happening. I'm like awesome, awesome, awesome. You're giving all these cool little hints but then it's like just over. I've totally forgot the point of making um we want me back a bit. Yeah, they're building little cool things, little cool nods, things you liked about that. I don't know where you go with it. Yeah, uh oh Batman different Batman. Yeah, yeah, yeah. So the building so it's like I liked that they're like all right this is different Batman and the fact that he the way he acted fighting people that just the way he beat that",
            "start": 2094.48
        },
        {
            "text": "Yeah, yeah, yeah. So the building so it's like I liked that they're like all right this is different Batman and the fact that he the way he acted fighting people that just the way he beat that living shit out of people, branding people, all the stuff we saw in the trailers but seeing this movie it was different. Yeah, like this movie really contextualized it in a way that I'm like this is I like this Batman. You nailed it. I thought Ben Affleck was awesome. Yeah, he was Batman. Yeah, he was Bruce Wayne and it's not the Batman we're used to. It's not the Bruce Wayne we're used to but I liked this Bruce Wayne and I liked this bad and that's my big thing is going to be really interesting because so many of you had a fucking cow with Superman killing Zod right in Man of Steel and then the destruction like how are you going to because it's like Superman doesn't kill. Sure, Batman definitely doesn't kill Batman definitely doesn't use guns. You know what I mean? Like that's not this Batman",
            "start": 2131.68
        },
        {
            "text": "like how are you going to because it's like Superman doesn't kill. Sure, Batman definitely doesn't kill Batman definitely doesn't use guns. You know what I mean? Like that's not this Batman this Batman granted. I'm not saying except for the nightmares he uses guns but like even when he's fighting the guys he's like grabbing the dude that he makes the other that makes that guy shoot in a semi circle around him and all this other stuff but then he's like smushing people with cars and blowing shit up and yeah they did go out of their way to have him not shoot people. Yeah, and in a way that I was like that's interesting because they didn't go just the full thing of he's just fucking like it's good guys versus bad guys. I did think it was weird just his nonchalantness about the violence and death during the chase scene like at that point I didn't really get the feeling that he knew that all these guys are bad guys. Oh okay. You know he was there and there he's just driving his thing",
            "start": 2166.0
        },
        {
            "text": "and death during the chase scene like at that point I didn't really get the feeling that he knew that all these guys are bad guys. Oh okay. You know he was there and there he's just driving his thing fucking blowing up their shit like then they start pulling out like ridiculous big guns but like which they flop the car at the top of the car and they like they had gatling guns. Yeah it's like all right like I'll give it to you. Sure. But I just thought it was so weird that it's like that was like I don't know these guys backstory I'm just here I know that Lex has a thing and I know that Lex might be up to something bad. Yeah. I'm gonna kill all these motherfuckers because they're running away from me. Well it's funny because that was like the first time we were really seeing him be Batman and so when he came out and like fucking nails the first car I was like fuck that there's no way to guarantee that dude's alive and then he like fucking tow cables it and he's smashing around I was",
            "start": 2202.24
        },
        {
            "text": "and so when he came out and like fucking nails the first car I was like fuck that there's no way to guarantee that dude's alive and then he like fucking tow cables it and he's smashing around I was like like it's not fair. Don't give a fuck all right yeah, but that's my whole thing is like I'm going to be fascinated to see how general audiences react to that because we have hung our hat for so long that Batman wouldn't kill and when he's guns and wouldn't do any of this stuff and here he is and again I got you know. I argue this point all the time like Superman not killing and I'm like I think you should have killed Zod. I'm glad he killed Zod. That's what I would have done in that situation. Same thing here like when he walks in and Martha's about to be fucking flame thrower right and he's like all right, fucking shoots that fucking fucking guy sets that dude on fire jumps on my and then they have like that great moment of like your son's friend like great. Also there's a human",
            "start": 2237.52
        },
        {
            "text": "he's like all right, fucking shoots that fucking fucking guy sets that dude on fire jumps on my and then they have like that great moment of like your son's friend like great. Also there's a human burning behind you and I'm a housewife from Kansas speed of that. The thought she was with you line way less corny and cheesy in this context than in the truck. Still not not cheesy. I love that's a lot of still not great, but I thought that at least it didn't feel like that contrived like because it made the trailer made it seem like it was like right when she got there. Yeah, this was like at least gave some sense like some like all right, cool. There's some super shit going on. Speaking of which, I thought the doomsday fight was all over the place started really cool. The new thing awesome. Then when it came to see now the new thing I was so I was like I first off I liked how fast the government responded. Yeah, because there was that thing in man of steel again watching it again like",
            "start": 2273.04
        },
        {
            "text": "Then when it came to see now the new thing I was so I was like I first off I liked how fast the government responded. Yeah, because there was that thing in man of steel again watching it again like right the Terraformer land starts some fucking pancaking metropolis and then like. All right, we'll get this fucking spaceship into this thing and we'll fly that out there right Chris Maloney. All right, like there's this thing's pancaking everyone right now here. They're like fucking new come yeah, it's just like that was a scene. I really loved of like superman pushing doomsday into space again, learning from you think at least from what it is before of like I just got to get this thing out of the populated areas, but again it was like weird because I was like man he's really pushing him out in space. I'm like just push him one more time and hang back like I think he's going to keep going. If I understand space correctly and I don't get wrong, it's like Neil degrasse Tyson, Colin, then me",
            "start": 2314.8
        },
        {
            "text": "space. I'm like just push him one more time and hang back like I think he's going to keep going. If I understand space correctly and I don't get wrong, it's like Neil degrasse Tyson, Colin, then me down here, but like I understand a little bit of space and then when the new, but they have a new going off was cool. The superman being like shrunk down like dark night and I referenced superman wonder woman comic books about it. That was awesome. Yeah, I mean like that was all cool. I mean I that was one of the very, very, very few moments in this movies that I was like this is different for a superhero movie. So much of the other stuff I'm like I've seen this so many times and I hit this point where this is what the 20th superhero movie we've seen in the last 10 years. They're like was good and I liked that he just kept punching, but not on the normal superman. I'm just going to keep punching to finish this. Like it was cool seeing them go into space. I'm like fuck wow they're doing this",
            "start": 2355.92
        },
        {
            "text": "I liked that he just kept punching, but not on the normal superman. I'm just going to keep punching to finish this. Like it was cool seeing them go into space. I'm like fuck wow they're doing this like there. It's not just the bullshit normal like Avengers did it with Tony star sure, but not like this really like this was really like they went there. I'm like that's awesome and then you know seeing him fall on you like I thought that whole scene was like really well handled right. Awesome. Then you get to the actual fight and there was moments where I'm like oh man this is exhilarating. This is really cool and then I don't know. So I'm at the pacing of the fight. And this this is the thing where I feel we're going to disagree. I never thought this movie had the Avengers moment of Hawkeye shooting the arrow and the cameras switching between. No, we don't disagree on that all. I totally agree with that. Doing that because this movie tried to and I thought it was really like phoned in",
            "start": 2393.04
        },
        {
            "text": "shooting the arrow and the cameras switching between. No, we don't disagree on that all. I totally agree with that. Doing that because this movie tried to and I thought it was really like phoned in and just like you could have seen it from a mile away, but it was those final scenes like Wonder Woman with the lasso. Awesome. That was such like a cool moment of just like just great. Just came out of nowhere and was fun. Exactly. And then you know Superman's preparing his stuff. You know whatever. There's a question of where's Batman? Yeah. Lo and behold there he's over there. He had to do something. He had to shoot some stuff. Get that kryptonite. Yeah and it's just like I don't know. It just felt like I do something that wasn't epic for me. I'm from the beginning. You know you've hopefully seen the trailer reaction the night that that first trailer hit with dooms and it like I've totally been cool with him being in it. I was. I was fine with it. The one thing like in all of our trailer",
            "start": 2430.56
        },
        {
            "text": "seen the trailer reaction the night that that first trailer hit with dooms and it like I've totally been cool with him being in it. I was. I was fine with it. The one thing like in all of our trailer breakdowns and stuff I've always been like where is this energy pulse coming from that's like ripping things apart and it's all right and then you got it's like oh doomsday is doing it and it's like doomsday and I get now. This is not me because I'm the guy this. I think this whole universe is you had seventy five years of that crap like you know what I mean. We have if you want doomsday's, you know doomsday. You can read a thousand comic books about it right. I'm not against it. It was just like one of those things of like what? Why does he need this power? Why does he have the solar flare as it is? Is this the solar flare that Superman has a new fifty two because, like he has heat vision, which is was cool and I like the way he used it as cool and I liked when he you know I'm you know I",
            "start": 2474.56
        },
        {
            "text": "it is? Is this the solar flare that Superman has a new fifty two because, like he has heat vision, which is was cool and I like the way he used it as cool and I liked when he you know I'm you know I liked when he tore off his skin or whatever and then got the spikes. I was like all right, cool and he got hand cut off and this that and the other one yeah and I like that one woman cut off his hand fucking took out his Achilles and like yeah I like that she was fucking him up. He was fucking her up. I don't like that nobody bleeds. You know I mean we talked about we've talked about this before. It was one of my problems in man of steel of like we're fucking going through this cornfield and I'm just fucking punching you the face over and over and over again and you know this isn't broken and there's no blood or black guy and like so it's like well fucking can we get something out of these people. This question was answered and that's the most important thing that do you believe. No, I",
            "start": 2509.36
        },
        {
            "text": "there's no blood or black guy and like so it's like well fucking can we get something out of these people. This question was answered and that's the most important thing that do you believe. No, I don't know I get wound. I get wounded, but I don't believe now. So I have a little scratch yeah yeah with the Batman fight though yeah way Batman against the bunch of years. Yeah, twenty four dudes, another amazing moment ruined by stuff beforehand in like part of this. I worry because, like people were laughing at the lines and like that we had seen from trailers or whatever and I know it was for me. It was one of those things of like I've been waiting for that. Did you not know that in like part of our job here and like me being this DC guys, I have I have to consume all this content and I say it like all my life so hard, but I have to consume it right because I want to make videos and I want to be able to talk about it because a million people ask me questions about it. There's no way I",
            "start": 2545.76
        },
        {
            "text": "it like all my life so hard, but I have to consume it right because I want to make videos and I want to be able to talk about it because a million people ask me questions about it. There's no way I could for justice. Lee turn off and not watch anything and I lose what I am and that's this guy, but like that sucked. You know it was like a Jimmy Kimmel bit right and like do we need to see that clip beforehand. No, like think about how fucking amazing that would have been. I mean you know marketing is hard. I know it really is, but yeah, perfect example. My brother's going to watch this movie and not know any of that shit and he's going to be like oh shit yeah. That's no wonder woman's in it and that's the thing I'm going to see. You know the movie with us again on Thursday on opening night and then in Vegas with Poe, my friend who's a doctor who you know he had a professor at a school and has a kid and I'm like how much do you know about this movie? I'm going to be I might do something",
            "start": 2582.48
        },
        {
            "text": "and then in Vegas with Poe, my friend who's a doctor who you know he had a professor at a school and has a kid and I'm like how much do you know about this movie? I'm going to be I might do something with him where I interview him beforehand and then after I love his reaction. Yeah, all this shit you know what I mean? Because I loved it all. You know I think I did. I do think I love this movie and you know what I mean? It's early say yeah, I mean don't get me wrong. I'm not saying perfect movie. No, and I get that. I get that and that's it's you know people favorite and best are very different things and I understand that and that's the thing is like throughout this movie I kept thinking. Why is Greg feeling right now? Yeah, you know like like is this what he wants and I there was certain moments I'm like wow I can't believe this is happening. When Doomsday first pops out of the thing and it's like he's about to just fight everybody. I'm like this is crazy that this is a movie that",
            "start": 2617.2
        },
        {
            "text": "moments I'm like wow I can't believe this is happening. When Doomsday first pops out of the thing and it's like he's about to just fight everybody. I'm like this is crazy that this is a movie that we're watching right now. Totally. That's fucking cool. When Flash came I'm like this is crazy that this is a thing. I mean like you if you want to talk about like the moment for I mean like that if I I had been making a lot of references coming into this movie right like I never thought I'd see this day. You know like I never thought I'd see Batman Superman Wonder Woman a movie because I in my life as a DC fan have seen this film fail so many times to get off the ground. You know what I mean to finally be here and have the Justice League be real and all that's awesome. I never in a million years and I remember watching that Jeff Johns thing and being like that's really cool that they're going to play with Tom. I'm excited to see that version of Flash. I did not think I was going to see him",
            "start": 2659.84
        },
        {
            "text": "and I remember watching that Jeff Johns thing and being like that's really cool that they're going to play with Tom. I'm excited to see that version of Flash. I did not think I was going to see him in this. I'm so glad I didn't know I was going to see him in this because that is like a moment of just like they are fucking all in and if they're going to do that and like have this DC universe like this where I like the weird thing about it is like. Is that right? It did was that a warning for what's to come or was that a warning for this movie? What because like I really don't think him saying it's lowest lane is the key the suit again. I saw it once and I'm very yeah, it's all very fresh. I'm definitely be paying more attention. Try to focus in on it next time around, but did nothing because then I was like after I was like is he saying the spear like and the credits are rolling. I'm like well, you know what I mean, but is that something that is playing forward for the rest of the",
            "start": 2695.44
        },
        {
            "text": "then I was like after I was like is he saying the spear like and the credits are rolling. I'm like well, you know what I mean, but is that something that is playing forward for the rest of the movie just because if we get to Justice League Part 1 and Bruce has a send Barry back to fucking give him that message asking like fucking awesome, but I don't but that is it. Am I wrong in that it could clear me up on this so there's the thing care of because it was the apocalypse. He's encrypting the thing, right? Yeah, he's extracting it and it's going really slow. Yeah, you see it going up at one percent two percent and then all of a sudden nightmare which to me implied he fell asleep, right? Because it was taking too long. Yeah gets the nightmare because he's asleep. Yeah. Seems like he woke up from the nightmare and the flash thing happened. Yeah, and then he woke up again from the flash thing. So that's what's weird. I totally understand and I don't have answers for you. My is what would",
            "start": 2738.96
        },
        {
            "text": "from the nightmare and the flash thing happened. Yeah, and then he woke up again from the flash thing. So that's what's weird. I totally understand and I don't have answers for you. My is what would have made sense is if the flash thing woke him up from the nightmare, right? That was this. So was that thing a nightmare too? In which case did it happen? Was it just in his head? So now you're sure happen it for sure. That's what's weird though, so the flash can travel time in dreams. That was a dream, right? The nightmare thing the night. Here's the thing I believe the nightmare was a vision. I can't tell you in here. This is the really fascinating thing. I can't tell you how that would have happened, how that would and I'm sure there's somebody right now losing their mind because there's a comic. I haven't read that does all this, but I imagine it would have to be explained in future movies of all right. Yeah, they went back and doctor fate or somebody. You know I don't know shazam",
            "start": 2786.56
        },
        {
            "text": "a comic. I haven't read that does all this, but I imagine it would have to be explained in future movies of all right. Yeah, they went back and doctor fate or somebody. You know I don't know shazam has. I have no idea how any of this would work, but for sure, berry is real and for sure the vision isn't just a dream because there's no way Bruce is able to dream on his own. The omega symbol, the pair of demons, all this stuff that that's the coming of dark side and that is very much. I've been came to that by Lexus like this is what we're talking about at the end right stick with me. Everybody is that I loved Lex Luther as well. I'm like all right totally get what Lexus doing totally get what Lexus doing and then I was like, why is Lexus doing this? You know what I mean like I got it of like I need the body. I'm like all right, you're up to some super bullshit. Oh, you needed to get in there to learn shit. Okay, that makes sense. You want you want to keep tonight you're blowing them up.",
            "start": 2838.88
        },
        {
            "text": "I need the body. I'm like all right, you're up to some super bullshit. Oh, you needed to get in there to learn shit. Okay, that makes sense. You want you want to keep tonight you're blowing them up. You're making Superman look bad. Of course that makes sense and then it totally goes from I'm being a background. I'm doing things behind the scenes and pulling strings. We had a bad guy just suddenly like no. Now I'm on a helicopter. Bring me lowest lane right now. Capture Martha bring me Superman is like and then he's whoa. He's making doomsday and I'm like okay like all that like I'm I'm with you. I'm with you. I'm with you in that, but then it was like the doomsday. I'm making this. I'm capturing these people. I was like okay, but then I feel like it comes back at the end because at the end when he's talking to Batman and this is the very end head shaved, he's kind of crazy and he's awesome by the way. Why is that? That was cool. Okay, the head shape thing. Oh sure, sure, sure, sure.",
            "start": 2884.56
        },
        {
            "text": "when he's talking to Batman and this is the very end head shaved, he's kind of crazy and he's awesome by the way. Why is that? That was cool. Okay, the head shape thing. Oh sure, sure, sure, sure. But when we get there and he's, you know, suddenly like the bell's been rung. God is the God is dead and now that he's coming, he says he's coming now they can thank you very much. Gave that that he's coming meaning dark side and I'm like, oh, like now I'm kind of there with you. Now I kind of get it of you're an agent of apocalypse, but I really am. Is that what it was? You know what I mean? That's what I read it as. Okay, but I really, really needed like we're talking about making fun. Oh, this is all p. Oh, we're going to linger on this. I really needed a lingering, lingering, lingering symbol of the Omega symbol on the back of his head or something. You know what I mean? I'm like, oh fuck granny goodness got here or whatever. You know what I mean? Like that's what I needed more of there",
            "start": 2921.52
        },
        {
            "text": "of the Omega symbol on the back of his head or something. You know what I mean? I'm like, oh fuck granny goodness got here or whatever. You know what I mean? Like that's what I needed more of there because it was like that. I think is what's I think what this jet general and quote consumer of the film will get to and where they're like yeah, what and why did lex go do this and why did he throw because I'm like why did he throw away his business to do this, but it makes sense if he's a devotee that apocalypse has gotten to him and I think that's that we keep kind of referring to this moment without actually talking about the moment. I think the moment that this movie fell apart and the moment that lacks fell apart was when he gets into the ship and goes and puts the body in and cuts himself and puts it on and becomes this goes from behind the scenes to being the monster kind of himself or like he's creating it because all of a sudden he goes into this ship and he puts the fingerprints",
            "start": 2975.44
        },
        {
            "text": "and puts it on and becomes this goes from behind the scenes to being the monster kind of himself or like he's creating it because all of a sudden he goes into this ship and he puts the fingerprints on and all that makes sense from a logical standpoint of what this character has been up to this entire movie. Then he puts his hand on it and it's like I can teach you everything, which is very convenient for a ship to do and then it cuts away and the next time we see him, he's putting the body in the thing, whatever. I feel like that's a little big of a leap of faith in having the audience understand all right, so we taught him how to do this very specifically. We're talking on the car right and that was your question. Yeah, I mean in that we kept an hour like well isn't it this and then it was like okay, you're like oh, but like that because it is. I have the knowledge of a thousand worlds or whatever she says and it's like okay cool and he's like teach me everything. It's like well",
            "start": 3015.12
        },
        {
            "text": "it was like okay, you're like oh, but like that because it is. I have the knowledge of a thousand worlds or whatever she says and it's like okay cool and he's like teach me everything. It's like well yeah, what's not really how that works. It's just weird that like the next cut back it's him cutting hand. I got that it was a genesis chamber like from because I just watched me to steal like I understand what had blown up there and but yeah like when he cuts his hand, we talked about in the car. I was like was that symbolic or was that really doing something and is it that the genesis chamber can just reanimate like and he's like it's an abominant and it's like talking about what the council said about this and it's like I need a little a little bit more exposition there on what exactly was happening would have gone a long way because at that point he was just crazy and he was he was just full on bad guy crazy mode so in the end getting the head shaved and like he's just he is a",
            "start": 3055.68
        },
        {
            "text": "was happening would have gone a long way because at that point he was just crazy and he was he was just full on bad guy crazy mode so in the end getting the head shaved and like he's just he is a lunatic. He is crazy, so him doing all the stuff at that point. I was like alright like I've bought that he's crazy, so him saying all this stuff. I understand that there's something he knows that we don't so that I guess sold it for me is the fact that at least we know we're not supposed to know. I feel like it's one of those where the one thing I mean there's a lot obviously, but the one thing for this moment in this story thread in particular is that like Marvel makes it clear. Thanos is this guy and this is what he's doing and you know what I mean and I feel like what you're saying is there's a and what I'm saying too is that there's a little bit left to chance where it's like when in the nightmare, you know he rips the cow off and he's looking at him and he says you know like you took",
            "start": 3096.72
        },
        {
            "text": "a and what I'm saying too is that there's a little bit left to chance where it's like when in the nightmare, you know he rips the cow off and he's looking at him and he says you know like you took her away from me and I like oh it's like injustice. Well, you know, lowest died or something about and I'm like that's a threat for this movie and now I'm on the other side of it. I'm like well was it yeah and if in like and that's kind of cool if it wasn't, but then it's kind of **** up that you kill superman in this movie and you know he's back or whatever that we have to get to that, but it's this weird. That one's murky and I could have just gone for some kind of end credit scene, some kind of Omega symbol in the back to say like someone is pulling the strings here there. This is the big arc. I understand that the big arc is we are building to apocalypse. We are building to justice, like having to fight dark side and the you know the invasion you assume through boom tubes or whatever,",
            "start": 3136.4
        },
        {
            "text": "I understand that the big arc is we are building to apocalypse. We are building to justice, like having to fight dark side and the you know the invasion you assume through boom tubes or whatever, but right now yeah, I because I was watching it being like okay, very showing up to warn Bruce that lowest is the key to this problem and in in the suit. I still think he's saying the suit and I was like oh Bruce's suit and I'm like the armor suit must have some kind of Luther implants. I'm running theories in my head as I'm watching the movie and now on the other side of that I'm very I'm believing that no Barry came back to warn Bruce about something that's going to happen in justice. Lee part one or two yeah, which is cool, but I could have just again use something like because I think people might leave the audience or leave the theaters thinking that yeah, the reference was that hey, lowest the key to all this. Okay, the spear was the key to all this great that problems taken care of",
            "start": 3178.4
        },
        {
            "text": "might leave the audience or leave the theaters thinking that yeah, the reference was that hey, lowest the key to all this. Okay, the spear was the key to all this great that problems taken care of yeah. I have no idea why they were flying monkey man. You know, and then it's fine. You don't need to know that I think that that I think most people will just be always a dream period call it a day, especially because they made that flash thing look like a dream. Yeah, I'm right. We're right about that, right Kevin. Yeah, I mean, yeah, they made it look like a dream. Okay, thank you for like freaking out and hitting buttons just to say that you guys just said it. Yeah, I love you. Yeah, I know that that that was weird to me, but I think that it overall you're right like this all it is building something and I think that the that I think that this is going to tie into the other movies because this such a such a blatant job of showing the the fight from man of steel being in this one that",
            "start": 3226.64
        },
        {
            "text": "something and I think that the that I think that this is going to tie into the other movies because this such a such a blatant job of showing the the fight from man of steel being in this one that annexing it from Bruce Bruce's point of view where they are setting up this thing of all this relates or whatever and especially because we saw that clip of people matching up the movie from like the laser shot and being the exact same thing. There's obviously thought being put into every little thing like that, so I do think that like them having those things that to us feel unanswered. That's obviously for a reason, but it's one of those where I agree with you totally agree with you, but I feel like we're having to we're having to grasp too hard to even think those are unanswered. Yep, I think you can leave that room and be like oh great. The guy in the dream warned him to do this and their friends that's taken care of when I think in reality, that's a bigger thing that doesn't feel like a",
            "start": 3266.64
        },
        {
            "text": "you can leave that room and be like oh great. The guy in the dream warned him to do this and their friends that's taken care of when I think in reality, that's a bigger thing that doesn't feel like a bigger thing. You know what I mean like I get something at the end other than he's coming ding the dinner bells being rung or whatever. Okay, can we see in the distance apocalypse or something or you know what I mean? Even if it's just like really boring shooting through the gal, you know, slowly leaving and then shooting through and then going all the way to see the planet with flames shooting out of it. You know what I mean? Yeah, you know something's happening. We still got the big one. Yeah, the whole end the death of Superman. Yeah, I think that this movie did a weird thing where and a lot of movies do this where just doesn't end. It just keeps going and going and going and going and going and when movies do that when movies have. All right, here's the final line. You could roll",
            "start": 3311.76
        },
        {
            "text": "a lot of movies do this where just doesn't end. It just keeps going and going and going and going and going and when movies do that when movies have. All right, here's the final line. You could roll credits now. No, we're going to pan out for a little bit. Do a little bit more. What's another character doing? Here's a final line. Let's just keep going. There needs to be a payoff. There needs to be something that's worth it at the end of that and that thing can't be the easy answer and the thing that we all don't want it to be because that's just so lame and that's exactly what this movie did. All right, we're going to kill Superman. We're doing it. We're doing it except for the fact that I can't imagine watching this movie from the moment he dies. There's a, I think a about a three minute time period where people can believe that he's actually dead. Oh really? I thought it was more than that. When you keep it going and you keep this going and then you keep having this person talking.",
            "start": 3350.64
        },
        {
            "text": "time period where people can believe that he's actually dead. Oh really? I thought it was more than that. When you keep it going and you keep this going and then you keep having this person talking. All right, she's picking up the dirt. Let's get someone else. Now this is happening. He has literally two funerals happening right now. Like every superhero movie needs to end in a funeral scene and people talking. This one had to. So they're doing all that shit and then it just keeps going. It reached a point where I'm like, okay, he's alive. Like he has to be alive and then they show that he's alive and I'm like, you couldn't have just not done that. Like they showed the coffin with the thing and it looks so cool. I'm like, yes, okay. At least leave a question. Leave us speculating. I was in my seat and I was like, holy shit. Are they really going to kill superman because then it's in my head of like there is no other. There is no solar solar. There is no solo superman film on the books",
            "start": 3392.88
        },
        {
            "text": "my seat and I was like, holy shit. Are they really going to kill superman because then it's in my head of like there is no other. There is no solar solar. There is no solo superman film on the books right now. They've not talked about it and then I was like is henry caval in on the long con because he's like I'm get my justice league body. I'm like what if he's not even injusticely and then it was like no, they can't do that. What if they did it though? It's their universe thing. It doesn't and I'm going back and forth and back and forth and back and forth and then yeah, it kept going and going and I was like oh don't do it. Don't do it. Don't do it yeah and because it would have been awesome to end and he's dead and that's it. It would have been awesome. It would have been different. It would have been something. It would have been something that this movie did. This movie changed something and did something. Now I feel like this movie at the end of the day we're pretty much right",
            "start": 3438.32
        },
        {
            "text": "would have been something. It would have been something that this movie did. This movie changed something and did something. Now I feel like this movie at the end of the day we're pretty much right back where we were where are the aliens good or bad and I get that that problems never just going to be solved but all I feel like so much of the promise of this was just never fulfilled and now that that senator lady's dead it's just like all right cool moving on. Now Batman needs to get with his super friends and we knew that was what it was going to be but I still even beside like Superman's death aside I needed something at the end that was cooler than just Wonder Woman and Batman talking like hey maybe we should get some more dudes made those guys that we saw the computer files we should probably get them why I don't know it's probably something out there. Well the feeling is the the premonition and that's another thing that I just was like okay can we drive that home a little more",
            "start": 3475.36
        },
        {
            "text": "probably get them why I don't know it's probably something out there. Well the feeling is the the premonition and that's another thing that I just was like okay can we drive that home a little more because the feeling he's doing is the fact that and again this is the thread that even to me in the film was lost at first where I'm like okay he's warning him because at some point in the Batman v Superman fight Lois is in risk Bruce kills her by accident this you know what I mean and then we get there and that's not what and then and I'm like okay and then no he he believes the premonition he understands that something's coming but then it's all out of sync because it's like that makes sense so then in the so you have so like now you should be here's where we got to start you got to start thinking my here's the thing so Superman's dead then he's not that little particle start floating up like when he was charging up to fly or whatever right not only is that stupid you know you know what I",
            "start": 3516.32
        },
        {
            "text": "my here's the thing so Superman's dead then he's not that little particle start floating up like when he was charging up to fly or whatever right not only is that stupid you know you know what I mean like I hate that crap and I even as somebody who likes love the death and return to Superman right just like the fact that he just comes back and his body's charging in the kryptonian pit or whatever it's like all right here that's even harder to explain in a world that I do feel for the most part pretty grounded for what they're doing and I know I'm saying that with a fucking creature born out of a fucking floating uterus in a spaceship or whatever, but whatever all that aside now it's like what movie explains this you know what I mean like are we going to open justice league part one and Superman's alive and he's been alive for a while. Are we going to open justice league part one and he we're picking right up and he punches out of the coffin or is it because it's not what's going to",
            "start": 3561.44
        },
        {
            "text": "Superman's alive and he's been alive for a while. Are we going to open justice league part one and he we're picking right up and he punches out of the coffin or is it because it's not what's going to happen right and then the so then the question is like is the like so in the future that the suit and I can't wait to see this again and realize that is not what he's saying at all is a future that Barry's coming back from to warn them about is it that now Bruce starts a relationship with Lois is it now that Bruce drives Lois apart from this return Superman you know I mean like there's these things or whatever and that those are cool threads yeah but I'd like to see that in Superman solo film that's planned out for two years from now not in the justice league whenever that happens the thing that I thought was cool about this movie overall is that and this is kind of probably a bad thing but I liked it is it didn't feel so much like a movie as much as it did kind of feel like yo here you",
            "start": 3612.8
        },
        {
            "text": "that I thought was cool about this movie overall is that and this is kind of probably a bad thing but I liked it is it didn't feel so much like a movie as much as it did kind of feel like yo here you know when you read comics do you know that Greg I know the feeling of reading you know when you're reading like a crossover event yeah and it's like you're reading the Batman issue 42 and then you jump over to Wonder Woman sure you know six and then I mean whatever that the movie kind of felt like that 100 which I thought was cool I did like you know and did it had a lot going on and I don't think it did a good job of getting all that stuff going but I do think that it it was fun and it did have that experience of kind of like because even then you're never quite sure like you read Batman doesn't mean you read every bat family comic right so someone pops up and like I'll give it to you I don't know who they are but I'll give it to you um this movie style this movie kind of felt that way",
            "start": 3662.32
        },
        {
            "text": "mean you read every bat family comic right so someone pops up and like I'll give it to you I don't know who they are but I'll give it to you um this movie style this movie kind of felt that way yeah um but the I just the end like if it gave me like an inception moment the top spinning did it fall did not fall yeah now this is he's alive there's no question he is alive in some fashion yeah yeah it's just it's weird yeah it's weird I don't like that at all I'm interested to see what they do but like I'd be more interested here's the thing is like it's what I'm saying right and I'm Kevin what I'd like you to do is bring up the DC movie slate in your phone just to make sure I'm not missing anything I know there's not another solo Superman movie in here right and I forget when is Donna Joe or I'm sorry Justice League part ones release date I'll need that Kevin and I think Wonder Woman's in between that before that correct but one Romans her period peace in World War One these are all the",
            "start": 3701.28
        },
        {
            "text": "I'm sorry Justice League part ones release date I'll need that Kevin and I think Wonder Woman's in between that before that correct but one Romans her period peace in World War One these are all the next yeah that's what I'm saying I want no flat suicide squads next yeah then it's Wonder Woman then it's Justice League part one that sounds right okay we'll double check that but what I'm saying is yep suicide before Wonder Woman okay okay what's Justice League part ones really steady you have another okay anyways Justice League part one I would be super super stoked for it right now if it was Batman Wonder Woman in Superman being like we got to get the rest I'm in it because like imagine that is the ending right and I'm not gonna I don't have a good like what leads up to it but we've beaten doomsday Huzzah everybody's alive but there is a moment of we're at a funeral we're at something we're we've had chilled out we've had run down time even if Martha's thrown a dinner in Kansas and",
            "start": 3747.12
        },
        {
            "text": "doomsday Huzzah everybody's alive but there is a moment of we're at a funeral we're at something we're we've had chilled out we've had run down time even if Martha's thrown a dinner in Kansas and we're all hanging, which would be a kind of cool scene too, but all of them there and like Bruce is off being Bruce about it over all moody and they walk out and Clark walks over and then Diana comes and joins them and he's like I had and he's just like something's coming. You know what I mean I've had this vision like we need to we need to get the rest we in it. What if that like that's man that's line right there right we need we need to get the rest and and Clark's like what what do you what are you talking about and it's just a nice medium wide as Nick was a maybe just close up on him and he's it's and Bruce is just like we have to unite the seven boom credits like that. I would be like fuck yeah exactly right now. I'm like right now. I'm like so it's like the first part of the movie",
            "start": 3795.6
        },
        {
            "text": "he's it's and Bruce is just like we have to unite the seven boom credits like that. I would be like fuck yeah exactly right now. I'm like right now. I'm like so it's like the first part of the movie fucking bringing Superman back from the dead and then him explaining himself and then we're uniting the seven and how much flash we're going to get and how much you know that that that that that that yeah. What do you offer me cap one one one was june seventeenth twenty seventeen both those okay cool all right yeah. That checks out and it's fine, but it's just like one or one room is you know definitely at least a period piece. I don't know if she ever ever jumps to the for that one. I haven't started probably well, but and if they want it, I be like Captain America, you know which I mean yeah jumps, but not really. I guess the entities, maybe superman being coming back then the thing about the death and like the making that him returning part of the plot is I think that that is an easy",
            "start": 3835.52
        },
        {
            "text": "jumps, but not really. I guess the entities, maybe superman being coming back then the thing about the death and like the making that him returning part of the plot is I think that that is an easy sell to the mainstream of like oh death and return of superman. I've heard of that, you know, and I think it's kind of like civil war even non comic readers know civil war. So I think that is a good they're just kind of jumping the shit now. You know what I mean? They're just like all right. How can we latch on because we need to build this universe now. So maybe that does make sense. I'm not thrilled by that at all, but yeah, that's my big thing. Now that I've done the whole United 7 thing in my head, that's a much better ending. I'm going to try to figure out time travel and go tell them that. Yeah, you should. That'd be cool. Yeah. Is there a Martha's throne, turkey dinner and they're all there. Somebody else has said I don't somebody else's. And this is always give me the problem with",
            "start": 3878.56
        },
        {
            "text": "Yeah, you should. That'd be cool. Yeah. Is there a Martha's throne, turkey dinner and they're all there. Somebody else has said I don't somebody else's. And this is always give me the problem with all of these movies, especially about franchises that we care about so much, but the speculation of the what ifs and the what does this mean is always going to be way cooler because once you watch the movie, you know the answers and those answers that are there. You're either not going to get the answers you want or not going to get any answers and that's bad. And I think for me, a lot of stuff happened like with doomsday when you were speculating when do say first came and we're going frame by frame and you're like, could this be Bizarro? Could this be happening? Could this be happening? No, it really was the most obvious thing of it's Frankenstein and it's made in the matter of seconds off screen because the ship told him anything he needed to know and it told him to make a monster like",
            "start": 3924.72
        },
        {
            "text": "it really was the most obvious thing of it's Frankenstein and it's made in the matter of seconds off screen because the ship told him anything he needed to know and it told him to make a monster like that's just so like, all right, here's a villain. This movie needed a villain for people to fight and that just happened and see for me, that's the big thing we're talking about. You're like, I like the, you know, death and return to Superman is easy and it's like for people to wrap their head around and it's like, yeah, it is, but I would have loved for that to be its own thing and I know that I'm asking for a lot there, but like, you know, when you go back and you read or you talk to, you know, here, Kevin Smith scripts or, you know, when other people were pitching death and return to Superman, it's like that should have been a movie to unto itself that is called the death and return to Superman, whereas, like when doomsday popped up in the trailer, I was like, oh clearly yeah, Batman",
            "start": 3958.72
        },
        {
            "text": "it's like that should have been a movie to unto itself that is called the death and return to Superman, whereas, like when doomsday popped up in the trailer, I was like, oh clearly yeah, Batman is Superman United, the end after fighting to take this guy out. I never thought they're going to kill Superman because I was like that's a dumb decision that this thing that just showed up that really it's doomsday in name and they name and that's cool. That's all cool. He's cool, the fights cool, but like there's no pay off to him. You know why should he kill superman and then Superman gives his life doing it or whatever to make sure he kills him and you're like, all right, which not a great way to go. I mean, and honestly, like it was another cringy moment for me of like the I'm going to pull in. Really did you need to do that? Cause I don't think that wasn't necessary. It just was weird. I just feel like that was like such a, it didn't feel right. It didn't give me the response of like, oh",
            "start": 3993.52
        },
        {
            "text": "Really did you need to do that? Cause I don't think that wasn't necessary. It just was weird. I just feel like that was like such a, it didn't feel right. It didn't give me the response of like, oh man, like this is for us. It was like a let's do something cool. I guess that's cool enough. Okay, let's do that. And that kind of is, I think my, one of my big overall problems with the entire movie is the, the lack of emotional response that got out of me. I'm very emotional when it comes to movies. Like all it takes is a death and I'm tearing up. Like if, especially like when you get mother, daughter, like mother, son, father, son, any, any like family relation type situation going on. Like it gets me instantly. And this movie, like opening shots of Batman's parents dying again, I know we've seen this a million times. I know we know this in dark night and granted it was a montage. So I, I get it, but God, but they, Oh, right. I don't know. Do you see them dying? Like as quick as they did",
            "start": 4035.04
        },
        {
            "text": "seen this a million times. I know we know this in dark night and granted it was a montage. So I, I get it, but God, but they, Oh, right. I don't know. Do you see them dying? Like as quick as they did and like how it happened? Like to me, I'm like, man, this is the least I've ever cared about that. That's parents dying. And then every single love scene between Lois and Clark to me, I'm like, no, wow. That didn't work for you. It was just like, all right, we need to do this. And then it just keeps going. And like, then he was going to cook her dinner, Superman dying, like that whole scene. And then over him, it was kind of like, I feel like I should care more than I do. I agree with you again there too. Like I thought again, when Lois came up and was like choked up, that was great. But like when Batman and wonder woman are helping his body down or whatever, I was kind of just like, you guys don't really know him. It's not like there's no real payoff for you. It's like, Oh fuck. Yeah. I",
            "start": 4085.04
        },
        {
            "text": "when Batman and wonder woman are helping his body down or whatever, I was kind of just like, you guys don't really know him. It's not like there's no real payoff for you. It's like, Oh fuck. Yeah. I mean, Batman was kind of standing there like awkward, you know? But I thought I was like, Oh, he's trying to cover the wound. Like by that way, Lois doesn't see it. And then his arm like flopping. I don't know what you're doing. But even things that weren't deaths, like his mom getting kidnapped and like those pictures were pretty graphic and extreme. And like, my thought was like, damn, you know, like that sucks. I thought that was awesome. And when he looks up and his eyes are all red, I was like, fucking that's rad. He was definitely mad. I got, he was mad. I didn't care that much. I think it didn't. And again, I think a lot of it had to do with the music and just the tone not being right of like the whole thing felt serious and real and then cartoony at times. And a lot of times at the",
            "start": 4121.36
        },
        {
            "text": "didn't. And again, I think a lot of it had to do with the music and just the tone not being right of like the whole thing felt serious and real and then cartoony at times. And a lot of times at the wrong time that then the emotional moments just didn't hit with me because I'm in this like cartoony state of mind, they're punching and stuff. So it's like, I don't know, but the punching was cool. Yeah. And that was my one thing. And like, don't get me wrong. You know, I'm the guy tries to defend Superman and limit his powers and all these different things right. But like when Lex is like, and I have Martha and I was like, all right, cool. And I was like, and he's like, don't you know if you don't fight him, I was like, all right, cool. I'm gonna go fight him and I would like shot up in the stratosphere and then like look for her heartbeat or whatever and you might say, I'm assuming can hear heartbeats that way and I'm to that. I say cool. Maybe he can't. How did he get to save Lois in",
            "start": 4160.8
        },
        {
            "text": "stratosphere and then like look for her heartbeat or whatever and you might say, I'm assuming can hear heartbeats that way and I'm to that. I say cool. Maybe he can't. How did he get to save Lois in the desert? Like that was was first off that that photographers Jimmy Olson. So he's dead, by the way, and then was it the tracker in the thing that did Superman know that the CIA was listening and he was it's like and I know don't think too hard on its convicts and it's yeah, but it's just like still no, but that's not so much a don't think too hard thing. That was a they throw so much at you in this movie that they're just like just take it. Don't even take it for what it is just take it. We don't even know what it is and I think that it gets to a point where you just kind of admit defeat. You just kind of lay there and get things thrown at you and you're just like, all right, sure. I liked a lot of those things being thrown at me. Some of them were cool, you know? Yeah. Like Gal Gadot",
            "start": 4201.04
        },
        {
            "text": "You just kind of lay there and get things thrown at you and you're just like, all right, sure. I liked a lot of those things being thrown at me. Some of them were cool, you know? Yeah. Like Gal Gadot was awesome. How do you say it? Yeah, you make fun of me. That's our name. I was calling it Gal now. I want to say that I'm not sure of this, but I think this might just be a full blown racist. I'm not going to go that far, Craig, but I think that Han from Tokyo drift is in this movie. He's one of the guys that Batman beats up. I'm only saying this because I saw how he moved. I'm like, that guy looks like how Han moves. He's a big Han fan. I'm a big Han fan. And then his hair, I'm like, that looks like his hair. It was eating. He was not eating. That would be actually hard. And he was back to get his girl. That's why he's fighting. Yeah. That's a good movie. There's a good subplot right there. But yeah, dude, I mean, I think overall, again, going back to it, it's like, I'm down on this",
            "start": 4247.76
        },
        {
            "text": "to get his girl. That's why he's fighting. Yeah. That's a good movie. There's a good subplot right there. But yeah, dude, I mean, I think overall, again, going back to it, it's like, I'm down on this movie. I'm really down on this movie, but I left Man of Steel and I would have not told my friends that they need to watch it. I leave this and I'm like, you need to watch this. But at the same time, it's not like, I do not ever want to see this movie again. Ever. And I don't even want to see parts of it again. I'm not even like, because there's certain movies, I'm like, that fight scene was fucking dope. For this, I'm like, Batman fight scene was cool. Okay, cool. I've seen cooler ones. And also the animated shows, I think they just do it better in a lot of the ways. So I'm like, all right, but I'm not going to stop watching the rest of this universe. Good. Okay. I'm still, I'm invested in, they did enough, but they did enough little things that I'm like, all right. You're giving the",
            "start": 4287.52
        },
        {
            "text": "but I'm not going to stop watching the rest of this universe. Good. Okay. I'm still, I'm invested in, they did enough, but they did enough little things that I'm like, all right. You're giving the audience the benefit of the doubt, which is good. I feel like 90% of it was they didn't know what they were doing and they're just throwing shit at you, but 10% of it was we know what we're doing and we're throwing some stuff at you and if you look into this, there is theories you can come up with and some of them might be right and I think that's good. Okay, I totally can't wait to see more of it. I can't wait to see it again on Thursday and see again on over the weekend. Talk to my friend who isn't dialed in all this stuff. Kevin, do you ever want to see it again? Yeah, I really want to watch it again. Okay, yeah, the one thing in this is totally a straw poll that doesn't count and I'm not trying to discredit European yet at all. It's I think there we left and all the fans like the best",
            "start": 4329.36
        },
        {
            "text": "it again. Okay, yeah, the one thing in this is totally a straw poll that doesn't count and I'm not trying to discredit European yet at all. It's I think there we left and all the fans like the best friends that were there came up. I want to say of like the five or six I talked to on the way out, five of them were like, that was awesome and one was like, I don't know man. It was like in your camp. I'm in it. I'm very interested to see what people say. Yeah, well yeah, I don't know. I mean, I can't wait to read reviews on this. I honestly, I'm going to be shocked if they're not where I'm at. Like I'm going to be shocked if the overall thought is that this was a good movie. Granted, I think a lot of that's going to be tainted by the fact that people want to not like this. People want to hate this movie, you know, but again, I didn't. I think that it's not going to win over the people that were kind of, sure. I mean, I don't think Colin's going to come out of that and like that movie.",
            "start": 4374.4
        },
        {
            "text": "this movie, you know, but again, I didn't. I think that it's not going to win over the people that were kind of, sure. I mean, I don't think Colin's going to come out of that and like that movie. Colin's going to hate this movie. I mean, the biggest insult and I don't want, I don't want him to hear me right now. Okay. It's not dark night. Not at all. Not at all. There's moments in this movie where I'm like, Oh, this, Oh, it could have been so cool if, but it's not. Yeah. And again, something different and I appreciate what this is, but it's, you know, dark night. I remember watching and being like, yeah, Oh my God. Are you kidding me? Yeah. Even the third, like just, it has, it has flaws and stuff, but I think a lot of them, they're huge. Yeah. Way smaller than this movies. Wow. No, not even. No way. Oh, not even a question. I can't. Everyone needs to see this. Dark Knight Rises is so much better. Not a chance in hell. So much. Dark Knight Rises. I'll never forget. I'll never. What do",
            "start": 4411.68
        },
        {
            "text": "No way. Oh, not even a question. I can't. Everyone needs to see this. Dark Knight Rises is so much better. Not a chance in hell. So much. Dark Knight Rises. I'll never forget. I'll never. What do you have for me? Kev? Greg? I'm sorry. Dude. I remember rises 30 minutes in leaning over to Christine. I go, this movie's bad, right? She goes, yes, I hate rises. Oh man. It is not a good film. It is not an enjoyable Batman film. Definitely has flaws, but it is. It's good. No, it's good. So I can't. I can't. I can't help you on that one. We should. I'll after my next seventeen showings of batman be super. I should watch rises again. We should do as a topic on the game over greg show, which we do here each and every day. I don't think we've ever talked about dark night rises on the game of a greg show. That's a joke. I don't think we've ever given a real proper like we talk about it. Oh no. We comes up a lot. We've given that a topic rises specifically. I need to watch it again. I'm not doing",
            "start": 4457.68
        },
        {
            "text": "show. That's a joke. I don't think we've ever given a real proper like we talk about it. Oh no. We comes up a lot. We've given that a topic rises specifically. I need to watch it again. I'm not doing again. Definitely not to do it again. I just rewatched all three of them recently. Well gee, cause she's never seen any of them. Remember such a disappointment when bad men's parents died. She got, that was the best. She had no idea. Please show her this film at some point. You don't have to take her, give her money and center and then just have her come back. God, her doing the reaction, turn a camera on. No, no, don't let her talk to anybody. And she'll just, what was the plot? Yeah. What happened when those dragonflies flew up on Batman? See that, that is such a perfect example though because she's someone that is not in this at all. But now because she's, she watched the dark night movies, she started reading comics. She's starting to like do all this stuff. She's familiar with the",
            "start": 4507.44
        },
        {
            "text": "she's someone that is not in this at all. But now because she's, she watched the dark night movies, she started reading comics. She's starting to like do all this stuff. She's familiar with the like, she can tell you who's in Marvel and who's in DC at a top level, which is a pretty good advancement over from nothing to this. Yeah. Is she watched this movie? Oh, oh Lord. No ideas. Oh God. Did they even refer to Wonder Woman as Diane Ever? She, on the way out, she said, miss Prince when she was walking off the plane and she's listed as Diana Prince. Yeah. Okay. Okay. But no, there's no, no one ever calls her. All right, ladies and gentlemen, that's what we think of Batman V Superman Dawn of justice. But what do you think? Sound off in the comments. Let us know your thoughts on Twitter and of course, keep coming back here for all sorts of superhero conversation because that's what we do. Youtube.com slash kind of funny, kind of funny.com for short, the game over your show posts every",
            "start": 4548.08
        },
        {
            "text": "of course, keep coming back here for all sorts of superhero conversation because that's what we do. Youtube.com slash kind of funny, kind of funny.com for short, the game over your show posts every week and it is insane and there's always something always I now final thought and I mean like just a couple sentences or maybe just yet and I don't even have this. Is this the question because I haven't thought of how I'm going to say it. Does this, what are you more excited for suicide squad because of this less excited? Same. I've been more excited for suicide squad than this movie, but I mean based on what's based on this, I honestly, I don't think that it's, I'm more excited because I want to see how they handle what's happening. The universe. I mean, say stuff. Man, this could, this could be a whole topic because I think we should keep it for one because that is a good, a good conversation. Um, I do want to say I have one, one final message. Please be good to the people out there.",
            "start": 4587.2
        },
        {
            "text": "be a whole topic because I think we should keep it for one because that is a good, a good conversation. Um, I do want to say I have one, one final message. Please be good to the people out there. Don't spoil anything for anybody. Don't try to let people have their experiences because this movie is, you know, luckily one of the movies that does have moments that are worth not spoiling for people. So be good until next time. It's been our pleasure to serve you.",
            "start": 4627.76
        }
    ]
}