{
    "id": 13915,
    "video_id": "0bwzWbgvjBk",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "Where Are The Nintendo Switch 2 Pre-Orders?! - Kinda Funny Games Daily 04.17.25",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page -  https://nwzo.io/click/dzexr/\nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\n\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\nWe’re here to talk about video game news!\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1744918313,
    "duration": 3496,
    "transcript_chunks": [
        {
            "text": "Today's stories include everything from the Mario Kart World Direct. Phil Spencer says Nintendo has been a great partner and a big Switch 2 feature disappears from Nintendo's website. We have all this and more because this is kind of funny games daily. [Music] Bill Spencer says Nintendo's been a great partner. Got me. I noticed. I just didn't expect to see to read those words. It happens. You know what I mean? Phil's going to say what Phil's going to say. I get it. How you doing, Greg? I'm great. How are you, too? I'm really, really good. I want to tell you, I haven't been on a show with you, I think, since it became part of your rigma role of the I like that. Oh, I've been doing I mean, I can't stop doing it. That's But I mean, it's like anytime I cold open, you just don't lead when I'm on often. I guess I think that's how you That's probably what it is. So, I hear it when I listen to the show or watch the show, but I don't I can't stop myself. It's good. Like I I don't know that it's",
            "start": 5.44
        },
        {
            "text": "often. I guess I think that's how you That's probably what it is. So, I hear it when I listen to the show or watch the show, but I don't I can't stop myself. It's good. Like I I don't know that it's great. And it's always impressive that you're able to like sneak it in right before I hit the intro, you know? Like we've never rehearsed that. Like it's just you're just so good at it. It's just inside of me. Everybody, welcome to Kind of Funny Games Daily for Thursday, April 17th, 2025. We're 10 days away from Greg Miller's birthday. What is this? 42. 42. 42. Yeah. April 27th, right around the corner. That's nuts. More importantly, April 25th, right around the corner. That's my birthday stream. We're going to play Monster Hunter and do the spring event. I'm very excited. Moose's birthday is also your birthday which bothers me cuz I I I want to celebrate both of you separately. You know what I mean? No, I think it's you know it's so rare that we're together like you know if if it's a",
            "start": 49.6
        },
        {
            "text": "is also your birthday which bothers me cuz I I I want to celebrate both of you separately. You know what I mean? No, I think it's you know it's so rare that we're together like you know if if it's a weekday then my birthday something's happening here. You know what I mean? So I like that when we're not together and you just have a day for Moose. It's also a day for me. That's true. That is true. I often have days for you Greg. Uh how you what are you doing with Moose for his birthday on in 10 days? I mean I don't know but years ago when he it was his first birthday. Is this his adoption day or is this like No, his actual birthday birthday. Yeah. Um adoption day was July 3rd. Okay. Um but yeah, when he was turning one, this was like in the pandemic 2020. We were going to like throw him a birthday party at the park and everyone's going to bring their dogs and it was going to be a whole thing and he has this little hedgehog that like he loves so much and we made a cake that was the",
            "start": 87.44
        },
        {
            "text": "a birthday party at the park and everyone's going to bring their dogs and it was going to be a whole thing and he has this little hedgehog that like he loves so much and we made a cake that was the hedgehog. It was very exciting and then we got rained out and it never happened and then that uh the hedgehog we put in the freezer and we forgot about it for years. No way. Yeah. Wow. Still there? Did you find you find No, eventually we got rid of it. But yeah, there was just a [ __ ] giant blue hedgehog cake. The best laid plans of mice and men, you know. My god. Everyone, this is kind of funny games daily. Each and every weekday, we run you through all of the video game news that you need to know about live on YouTube and Twitch later on podcast services around the globe. Uh if you love what we do, please support us with the kind of funny membership on Patreon, YouTube, and now Spotify and Apple Podcasts. Get all of our shows ad free. watch us uh do them and you got a daily exclusive",
            "start": 126.56
        },
        {
            "text": "we do, please support us with the kind of funny membership on Patreon, YouTube, and now Spotify and Apple Podcasts. Get all of our shows ad free. watch us uh do them and you got a daily exclusive Gregway. What's that today, Greg? Today's Gregway everybody is me talking to you about how and when we should re-review The Outer Worlds as we get ready of course for the big uh SGF not I think officially connected but Xbox showcase followed by the Outer Worlds 2 direct that game is coming this year still apparently. We got to get vi we but when's a good point in the calendar to do it is it right now we talk about all rough man rough times here a little housekeeping for you. We are an 11 person business all about live talk shows. Uh you just got our Mario Kart World direct live reaction uh and also the kind of funny games cast breakdown of everything that we saw. So if you want even more details about everything uh you can get bless Andy me and Greg's thoughts on all that stuff. And Barrett",
            "start": 165.04
        },
        {
            "text": "the kind of funny games cast breakdown of everything that we saw. So if you want even more details about everything uh you can get bless Andy me and Greg's thoughts on all that stuff. And Barrett too he chimes in quite a bit as one of our Mario Kart sickos. Uh the stream after this is going to be schedule one. I like that face. Don't do that face. Which is going to be great. That is I I Joey, Nick, and Mike are going to become drug dealers. Oh, great. And then if you're kind of funny member, you get today's Gregway. That's all about O dub. Uh then thank you to our Patreon producers Anatoli asked, Delaney Twin, and Carl Jacobs and Omega Buster. Today we are brought to you by Imperial Factor and Shady Rays, but we'll tell you all about that later. For now, let's begin with what is and forever will be the Roper Report. [Music] No, seven stories today. A bacon dozen. It might be eight stories. What the [ __ ] What the [ __ ] No, you're giving me the face that Bless gave me when Last of Us",
            "start": 211.28
        },
        {
            "text": "will be the Roper Report. [Music] No, seven stories today. A bacon dozen. It might be eight stories. What the [ __ ] What the [ __ ] No, you're giving me the face that Bless gave me when Last of Us 2 was delayed. This might be a bigger problem. [ __ ] Joey Noel slacks me. goes, \"OMG, Monster Hunter now premium pass activated.\" Cuz I hit them up wanting to get free premium passes and she says, \"Thank you.\" And I open mine and I do not have the premium pass. They only activated Joey. They didn't activate me. Oh [ __ ] Look at this. I thought Nintendo delayed the Switch. I want this outfit right there. It's the Culu motif layered chest. I want that for my character. I'll give it a second. Maybe they're doing it like rolling them out. Maybe I'll I'll shut down the app and restart it. Maybe Barrett, at least it's not officially delayed yet. You know what I mean? There's still hope. It'll happen. It'll get delayed. It'll get a price bump. 150 bucks probably. God. Story number one. Mario",
            "start": 248.72
        },
        {
            "text": "Barrett, at least it's not officially delayed yet. You know what I mean? There's still hope. It'll happen. It'll get delayed. It'll get a price bump. 150 bucks probably. God. Story number one. Mario Kart World Direct shares new info, including new courses, outfits, and items. This comes from Chris Scullion at VGC. Super chat question for you. Are you surprised about the lack of Switch 2 pre-order info uh in this Nintendo Direct, the followup to the Switch 2's big blowout? Nintendo has shared more information on Mario Kart World's various features and modes. Let me just uh take a second to say something, Greg, because I don't think I've had the time on any show to say this. What a great name for this Mario Kart game. What a great name that somehow we didn't guess. When we were sitting there, none of us thought Mario Kart World. We're idiots. And the moment they revealed it, it's like, yeah, yeah. Very cool. Good for them. In a new Nintendo Direct focus solely on the game, Nintendo",
            "start": 310.64
        },
        {
            "text": "there, none of us thought Mario Kart World. We're idiots. And the moment they revealed it, it's like, yeah, yeah. Very cool. Good for them. In a new Nintendo Direct focus solely on the game, Nintendo revealed some of the game's new courses, including the retro themed Mario Brothers Circuit, the urban Crown City, the canalbased Salty Salty Speedway, the Snowy Star View Peak, and a new haunted course, Boo Cinema, that looked awesome. New items set to feature in the game include the coin shell, which fires ahead, leaving coins behind, the ice flower, which freezes enemies, the hammer, which flies in an arc and wedges into the ground for a while, causing chaos for the other drivers, and kamic, which transforms opponents just like in Yoshi's Island. I thought the hammer was super cool. It is. It is. And had you already seen this? You saw it in your Yeah, I got to play with all these uh items. And uh one thing that I didn't bring up uh in the uh in our direct breakdown was the focus on",
            "start": 353.36
        },
        {
            "text": "is. It is. And had you already seen this? You saw it in your Yeah, I got to play with all these uh items. And uh one thing that I didn't bring up uh in the uh in our direct breakdown was the focus on coins seems to be much higher in this game than in previous games. So which is is it going to do more than like the mini speed boost? Do you think it's still it's still doing that? But it just seems like that stuff matters a bit more. I think maybe just with the 24 characters just having more. It's like the little specifically Knockout Tour like we've been saying that every lap quote unquote feels like the final lap. It feels like, oh man, this we we got to get it because you get knocked out otherwise, right? And this is the one where you lost IGN. Um, yeah, it is embarrassing. Um, but I think that the little coin boosts are going to matter more because of that, where it's like every second of the race means more. So, uh, in addition to that, in older Mario Karts, you can get up to 10",
            "start": 393.6
        },
        {
            "text": "that the little coin boosts are going to matter more because of that, where it's like every second of the race means more. So, uh, in addition to that, in older Mario Karts, you can get up to 10 coins. You can get up to 20 now. And there seems to be more items and stuff based around coins like like this, uh, coin block being an example of that or coin shell. So, and there's more way more coin blocks actually that like you can hit in the level. So, I don't know like they I thought they were going to break a little more down into that in this direct and they didn't, but for my limited experience, I think coins are going to matter a bit more. I know we kind of talked about this, but we were talking more about um okay, we want what some people wanted out of this direct was why this game's worth $80. Deep dives into that. We talked a little bit about the open world and is there how much more could there possibly be a for what you just said right with coins and this that the other.",
            "start": 436.16
        },
        {
            "text": "worth $80. Deep dives into that. We talked a little bit about the open world and is there how much more could there possibly be a for what you just said right with coins and this that the other. Eliminate the $80 question. Eliminate the content question. Sorry. $80. It is a lot of coins. My question to you is do you think there's a lot more under the hood mechanically that we're going to have to learn? Are we going to have to relearn? Do do you feel like you know I'm a compared to y'all right? I'm a I'm a what Barrett. You tell me how good at Mario Kart am I? I'm not I'm not you and Tim. I know that you're good. Did you uh take me back to that uh you and Ziger? Did you [ __ ] out of him? Okay. Yeah, you're good. Yeah, you're good. So, it's like But I I never I You and Tim consume and play Mario Kart at a different level. You're You are pros and I'm pro or something. I I wouldn't even say that. I think that me and you are are in the same league. You guys are mainventors. Okay. I'm a",
            "start": 475.2
        },
        {
            "text": "Mario Kart at a different level. You're You are pros and I'm pro or something. I I wouldn't even say that. I think that me and you are are in the same league. You guys are mainventors. Okay. I'm a curtain jerker. All right. I'm on the show. I've never heard that. Oh, really? When you open the show, you jerk the curtain. It's not I don't mean in a weird perverted way. I thought you meant you were jerking off a curtain or jerking off into a curtain. Hanging brain and jerking the curtain. I love that Nick walks in on camera. Man, that's insane. No, I'm not a jobber mar. That's what I'm saying. I'm still on the show. I'm just opening the show. Anyways, it doesn't matter. My question is back to it. Are there a lot of new mechanics and strategies and things like that we're going to have to learn? Yes and no. I like I I was saying like in my limited time playing this, it in all the right ways felt like Mario Kart 8. Um the drifting felt very similar. Just the way the jump felt like all of",
            "start": 519.36
        },
        {
            "text": "Yes and no. I like I I was saying like in my limited time playing this, it in all the right ways felt like Mario Kart 8. Um the drifting felt very similar. Just the way the jump felt like all of that stuff felt like Mario Kart 8, which is perfect. There are the grinding on rails. There is now the charged super jump thing. that stuff is going to dramatically change shortcuts and especially uh in it seems like a lot of these maps are I I I do wonder if a couple years from now we're going to have these maps memorized in our brains and just muscle memory as much as we have in the past or is because it's so free room there's so many different like options and the the mixes of the knockout tour is it always just going to kind of feel like a fresh almost procedurally generated um type of situation. And I I think then mechanically that might change how we play the game. You know what I mean? Like the way we're focusing on shortcuts might not be a oh I know a shortcut is here. We I need to",
            "start": 558.88
        },
        {
            "text": "And I I think then mechanically that might change how we play the game. You know what I mean? Like the way we're focusing on shortcuts might not be a oh I know a shortcut is here. We I need to save a mushroom so I have the ability to make the jump in this specific place. And it's more just like a at any moment I need to be prepared to be able to jump over a chasm cuz you know okay I have enough speed to get over there if I try to whatever. You get what I'm saying? It's a minor difference there, but I do think it'll dramatically change like the game play or the the pro strats, the meta, if you will. Okay. Yeah. I think you're going to be fine. You're going to get your hands on these sticks and you're going to Well, I was just wondering how much Yeah. Like, you know, the deep dives, the YouTube videos, the treehouse directs you're going to get of coins have changed this and this, that, and the other. Now, when you do this, you should do that. Or if it is going to be No, no, we're all",
            "start": 606.96
        },
        {
            "text": "videos, the treehouse directs you're going to get of coins have changed this and this, that, and the other. Now, when you do this, you should do that. Or if it is going to be No, no, we're all going to you know what you're doing. You know what you're doing. There'll be something to learn, but not crazy. Yeah, I think it'll be I I think you said this uh during the reaction, but like we know what this game is. Yeah. You know, I I don't think there's going to be any major surprises mechanically or feature-wise. Um I think some things will be cool and like there'll be secrets, but like I feel like Yeah, this is an open world Mario Kart and this is what an open world Mario Kart is going to look like. It is not fullon forts of Horizon, it's fors of light. Okay, fair enough. Uh Nintendo also detailed how outfits will work in the game. races will feature dash food and by collecting and eating it, characters will transform into an outfit related to that food. Eat sushi and they'll wear a",
            "start": 648.8
        },
        {
            "text": "detailed how outfits will work in the game. races will feature dash food and by collecting and eating it, characters will transform into an outfit related to that food. Eat sushi and they'll wear a Japanese outfit. Eat an out. Once an outfit's been unlocked, it becomes available for use in the character select screen. Uh, new tricks confirmed include the charge jump, which can be used for leaping over obstacles. Stop. Sorry. Do you like picking up the outfits at the fast food places? No. Me neither. I wish they were hidden around the world. I wish they were attached to challenges or whatever. They are as well. Like Oh, okay. Yeah. Yeah. Yeah. I mean, when I was doing the free roam, um, can I take it back? They'll just be in a bunch of random spots. It's like I jumped off like a van and there was one just kind of in the air and it transformed me. In my experience, it seemed more random more often than not where it wasn't like, \"Oh, the sushi is the Japanese outfit.\" It was just like",
            "start": 684.8
        },
        {
            "text": "there was one just kind of in the air and it transformed me. In my experience, it seemed more random more often than not where it wasn't like, \"Oh, the sushi is the Japanese outfit.\" It was just like you eat a burger and just turns you into a random ass thing. Like I didn't I there was it didn't feel like there was too much rhyme or reason. Even though I get that in this trailer, we're seeing a little bit more correlation there. Yeah. Um but I don't know. I don't love it. I don't love it. It seems a little chaotic for my taste. You know what I mean? It seems a little forced of the the Oh, yeah. Just randomly you eat food and it changes your outfit. Like, I don't know. Something about that just doesn't happen. It just feels like noise. It just feels like adding stuff to add stuff. Sure. I don't know. It does happen in real life. Eat something wrong. Turn your blue jeans brown. You know what I'm saying? I had the visual already, but like man, uh the free room option was You know what?",
            "start": 717.92
        },
        {
            "text": "don't know. It does happen in real life. Eat something wrong. Turn your blue jeans brown. You know what I'm saying? I had the visual already, but like man, uh the free room option was You know what? Yep. Yep. Yep. Yep. The free roam option was also shown in more detail. Players can freely drive around the game's map, but also hit P switches to start missions, as well as find hidden coins, hidden panels, and more. Players can also free roam with others online and use a photo mode. Uh, the game will support four player split screen on a single Switch, too. Local wireless for up to eight players. Online races up to 24. Um, all the controls are returning. You get it. You get it. You get it. Uh, one thing we didn't get from this direct, the Switch 2 pre-orders. Another thing we didn't get is uh more technical stuff of like can we play it in 120 frames per second? Can we uh is it 4K 60 otherwise? Like all that stuff where I know that's not traditionally Nintendo, but their last direct says",
            "start": 759.76
        },
        {
            "text": "more technical stuff of like can we play it in 120 frames per second? Can we uh is it 4K 60 otherwise? Like all that stuff where I know that's not traditionally Nintendo, but their last direct says otherwise, you know, get ready for story number three kind of funny games daily things that have gone away from the switch too. What? Just the headline to tease you. Number three, Nintendo Switch 2 VRR mentions disappear from Nintendo's website, Jordan Miller of VC. Okay. Okay. But back to the story number one. Yeah. Uh, as you said, an entire reaction and Games Cast up about this so you can get detailed detailed deep dives over there. Please do. Of course, the reactions up as a Gamescast as a audio and you know, obviously everything's on YouTube. Um, I enjoyed the direct. I didn't expect anything crazy from the direct. I expected 15 minutes of Mario Kart and that's what I got. I'm excited for Mario Kart. This game looks amazing. Like I said in there it I woke up to the fact that this is",
            "start": 799.92
        },
        {
            "text": "crazy from the direct. I expected 15 minutes of Mario Kart and that's what I got. I'm excited for Mario Kart. This game looks amazing. Like I said in there it I woke up to the fact that this is going to be the first game Ben and I play from ground zero together, right? Like we are just going and like we're going to learn at the same time. We're going to I'm going to be unlocking things with him. When he wants to play, I'm really going to want to play as well because I'll be so into it. That's I hadn't thought I had wrapped my head around that. So far, every game Ben has played has been something I either don't care about like Paw Patrol or something that I've played a million times and know, you know, incredibly well. Uh, so that's exciting here. Um, I'm also not let down by this direct because I didn't expect the pre-order information here. I didn't expect them to have new news. I think that's a different beat and I do think that that's a disappointing beat. So, you'd have this",
            "start": 853.92
        },
        {
            "text": "because I didn't expect the pre-order information here. I didn't expect them to have new news. I think that's a different beat and I do think that that's a disappointing beat. So, you'd have this marketing beat today of here's Mario Kart 8 or Mario Kart World. It's awesome. Here's why it's incredible. Here's all these cool things. We hope you like what you saw. Great. and then you let that be the good news for a while and then next week come with the bad news. I I absolutely agree with you that I didn't expect to get the pre-order information or any of that in this direct um because yeah, it is a different beat and all that stuff. Having said that, I do think that uh contextually with where we're at with all the Nintendo Switch news and how the information has been handled and the level of utter chaos we are in. It's I understand why people would be upset getting this direct two weeks after the last one and this being it. Like this felt like a uh just a overview feature trailer like",
            "start": 889.84
        },
        {
            "text": "of utter chaos we are in. It's I understand why people would be upset getting this direct two weeks after the last one and this being it. Like this felt like a uh just a overview feature trailer like extended thing for Mario Kart, which yeah, they often do this for games and they need to. This makes sense. Again, the content I think was great. I just think the timing of this being prewitch 2 launch in the time and place in 2025 we are right now. I understand people being upset that it's like really like this game's [ __ ] $80. You just show us that we don't even know when the pre-order is. Like I get why people are upset if they are upset. I actually don't know. Yeah, we don't know what the internet off the internet. I assume they are because it's like I I am with them to the extent of just like I want these answers, but I also understand what I don't want is answers from Nintendo that are just going to change because the answers are just based on things that are changing. these the",
            "start": 928.16
        },
        {
            "text": "like I want these answers, but I also understand what I don't want is answers from Nintendo that are just going to change because the answers are just based on things that are changing. these the world we live in the constant sliding scale of it's 10% it's this it's happening it's not happening it's this well it's happening to this but it's not happening to that like yeah like I'm not I feel bad for Nintendo yeah I'm not mad at Nintendo for not saying anything because what are they going to say if they don't know and if they're waiting to see what happens in the next 24 [ __ ] hours in this news cycle we live in yeah so I I get that we didn't get the the pre-orders there but it is getting to a point now it's April 17th right now June 5th is the date that they stuck to in this uh direct Yeah, like we're saying, anything can change and I don't think that them saying that means, oh, for sure it's going to happen. But, uh, we talked a little bit about this earlier, but like I'm with you",
            "start": 973.44
        },
        {
            "text": "like we're saying, anything can change and I don't think that them saying that means, oh, for sure it's going to happen. But, uh, we talked a little bit about this earlier, but like I'm with you that like I think they hit that date. Like I think that there's just too many things at at play and they have to just get things out there and start the process even if it's going to really not be fun and it's going to be incredibly expensive or who the [ __ ] knows. Like I there there's so many factors of potential disaster with the Switch 2 launch, but I do think that quote unquote no matter what happens, there's there's obviously some whatever that could mean. The Switch 2 is selling out, so let's get that going. Let's get these things in as many people's hands as possible, right? If I was Nintendo, like that's what I would be thinking because what are you delaying for? More chaos, you know? Yeah. I don't think this settles, you know what I mean? And I don't think we get the Trump",
            "start": 1012.08
        },
        {
            "text": "was Nintendo, like that's what I would be thinking because what are you delaying for? More chaos, you know? Yeah. I don't think this settles, you know what I mean? And I don't think we get the Trump administration being like, \"All right, cool. We're done.\" And China's like, \"All right, we're done. We're done, too.\" Like, this is going to be the sands are going to be constantly shifting here, even with what was the 30-day extension Trump gave on whatever, and then capping them at 10, but X, Y, and Z. Like, for Nintendo, and again, I'm not putting blame on them, but Nintendo couldn't have announced this at a worse time. You know what I mean? They couldn't have announced this and then put the date of June on at a worse time because it is literally they did it the day [ __ ] Trump did all this [ __ ] So now everything's and like who knows when it settles if it ever settles if it settles in four years from now or if it settles by summertime. And and while that is true like them announcing",
            "start": 1055.44
        },
        {
            "text": "[ __ ] So now everything's and like who knows when it settles if it ever settles if it settles in four years from now or if it settles by summertime. And and while that is true like them announcing at the worst time it's like there was no right time though like cuz the people would be so upset if we still didn't know the date of the switch too. Sure. you know, at least now there's some target of like we're looking at and I believe it's going to hit June 5th. But yeah, if if they just showed the switch to we're like and we're we have to sit and theorize like for months more like is it summer? Is it fall? Is it like I hear that would suck, you know? But again, we're kind of doing that anyways. Yeah. Sucks. Yeah. realistically, you just said if I was Nintendo, I'd When are you going to come out and be like, \"All right, we're biting the bullet. This is the price. This is the pre-order date for America. I mean, the problem is it's like there's there's no understanding of what we're waiting",
            "start": 1094.4
        },
        {
            "text": "and be like, \"All right, we're biting the bullet. This is the price. This is the pre-order date for America. I mean, the problem is it's like there's there's no understanding of what we're waiting what we're talking about.\" Yeah. Right. So, I feel like it's not like, oh man, Trump's gonna have a press conference on Nintendo Switch 2 in video game console, whatever. So, it's like I I feel like it's just going to get to a point where hold out as long as you can because I don't think there's any need to get ahead of it. To your point, it's going to sell out no matter what. The the video game psychos like us and you listening or watching this show are in or out. There's a price ceiling to everything, but there's enough of us that you don't have to worry about. Yeah. the mainstream getting it that you'll have it by Christmas, they'll figure it out, blah blah blah. Yeah. So, I would say that at that point it really just is a matter of making sure that the supplies are where they need to be",
            "start": 1139.28
        },
        {
            "text": "that you'll have it by Christmas, they'll figure it out, blah blah blah. Yeah. So, I would say that at that point it really just is a matter of making sure that the supplies are where they need to be and like being able to get the people the system and I think that they've already done a lot of that work. Yeah. So, I feel like this thing could go up as late as I mean I think a month is the most realistic thing, but I do think even two weeks and you'll be okay. Yeah. Yeah, cuz like again like they they've already been prepping for the shipments of this [ __ ] Sure. What gets stupid for me, sorry. I'm definitely not understanding this is what I don't understand in the global supply chain is so if they're changing the retail price of this because of tariffs and stuff. I'm assuming then Amazon, Best Buy, Retailer X haven't ordered their thing yet. So, that's got to be in the mix of how long you give people the pre-order, right? Because Amazon's going to buy X million units and then have",
            "start": 1188.08
        },
        {
            "text": "Best Buy, Retailer X haven't ordered their thing yet. So, that's got to be in the mix of how long you give people the pre-order, right? Because Amazon's going to buy X million units and then have to get them up. But, if they haven't bought that and there isn't a check paid to Nintendo for that, that's where it is. That's where the two weeks doesn't sound right. I mean, an Amazon maybe, but like Amazon's the weird one though cuz they have a weird history of Nintendo anyways of sometimes not even having their systems at all. Um, so that might be a down the line like this might be a you got to get it from Nintendo situation. And if that's the case, then yeah, who cares when you put it out? Yeah. Yeah. Barrett, you got something? What do you guys think the price will end up being? Because at this point, it's like our economic situation uh is so volatile and it's not going to settle down probably in any sort of way, shape, or form uh anytime soon. And so I feel like you have to start",
            "start": 1238.0
        },
        {
            "text": "at this point, it's like our economic situation uh is so volatile and it's not going to settle down probably in any sort of way, shape, or form uh anytime soon. And so I feel like you have to start preparing for the worst in the long term even if things do stable out for the next 90 days. Right? So my thought there and I hear you and I don't think you're wrong. But I think that as PlayStation is showing us week after week, month after month, they can change these things when they want to. Right? and especially for 90 days or whatever it is and selling out at launch. I think they come up and they go, \"Listen, base model 450 bundle 500. That's what we're doing right now to protect us with this 10% that's guaranteed or x y and z, we're doing that.\" And they won't get in this level of detail. They're Nintendo. They'll just change that because of economic world things. And then yes, if we go down in those 90 days and it changes over and that, you know, Taiwan goes up even higher and da da",
            "start": 1278.24
        },
        {
            "text": "They're Nintendo. They'll just change that because of economic world things. And then yes, if we go down in those 90 days and it changes over and that, you know, Taiwan goes up even higher and da da da da da, then they or Vietnam, they come back and they do it again. and they change the thing like whatever the next wave is then I think there's also this like do they want to do that though especially like if the next wave is getting closer to holiday and then people I don't think they want to I don't think they want to do any of this again I feel bad for Nintendo right so I think it but I don't think you go that far out as to like future proof something that's not there especially for a price you already announced you already announced it at 400 450 and now you're like ah we got to change it again do this thing and if we have to it's one of the it's the normal thing of Like I feel like again and Nintendo announcing this at the worst possible time, not to their fault, is the idea that",
            "start": 1330.72
        },
        {
            "text": "it again do this thing and if we have to it's one of the it's the normal thing of Like I feel like again and Nintendo announcing this at the worst possible time, not to their fault, is the idea that they did this and if we get 90 days in, we're closer to holidays and they have to go up $100 on these things. It's going to suck, but everyone else will be and we'll all be in such dire straits of what the [ __ ] going on in the global economy right now because of this stupid goddamn administration that it won't be, \"Ah, Nintendo, you greedy sons of bitch.\" Like, it won't be on them. It will be your PlayStation's more expensive, your Xbox is more expensive, razors are more expensive, etc. So, yeah. Yeah, I'm with that. I I don't feel confidently about putting out a thing a price that I'm like, yes, I bet it's this because we just simply don't know what's going to happen. But if I did have to bet, I don't think they change the price for launch. And I do think that gives them the wiggle room",
            "start": 1368.56
        },
        {
            "text": "yes, I bet it's this because we just simply don't know what's going to happen. But if I did have to bet, I don't think they change the price for launch. And I do think that gives them the wiggle room later cuz I I feel like Nintendo like they want as much money as possible, but they're also not trying to steal from people. So, I feel like they want to get this thing out there. They want the initial launch of the Switch 2 to be as wellreceived as possible because this is the start of a generation. This is the start of their sole source of major money for the next 10 years, right? Yeah. So, I feel like they it's so important for them to get that right. And we've seen them before get things wrong many times. even like the 3DS coming out and within months getting a price drop and then having to come up with ambassador programs and coming up with make goods and stuff to to fix that. I don't think that they want to do that again, you know? I I know they don't want to do that again. And I",
            "start": 1408.16
        },
        {
            "text": "to come up with ambassador programs and coming up with make goods and stuff to to fix that. I don't think that they want to do that again, you know? I I know they don't want to do that again. And I feel like here it's like cool, you put it out and you can raise the price later due to all this other stuff, but that's where my money's at. Okay. I I I I believe that yes, they want to put their best foot forward. uh especially like with the success of the Switch 2, they don't want a Wii U situation. They they want to do as much as they can, but they're also being put into an impossible situation. Um and even though that they've moved a lot of a portion of their manufacturing to uh I believe Vietnam and um uh I'm forgetting the other country. like they're still dealing with the Chinese tariffs which like I don't know if they're going to actually eat those costs at launch cuz that would be insane. Yeah, it would absolutely be insane. But what what are the tariffs actually going to look",
            "start": 1454.88
        },
        {
            "text": "which like I don't know if they're going to actually eat those costs at launch cuz that would be insane. Yeah, it would absolutely be insane. But what what are the tariffs actually going to look like? I feel like I the number changes every single be even higher for China in two weeks probably. Yeah. So I it's at a certain point it's like what are you going to do? What what are you going to do? Yeah. Yeah. 100%. Oh man. Uh, so we got some super chats here. Can I ask a question for super chats, too? Yes. What is your ceiling? What is your price ceiling for the Nintendo Switch 2 at launch? I want to know that. That's rough, man. I know because I again I I just feel like it's it it's makebelieve numbers talking about real money. And that's what gets scary is like we know the value of money to us. the money that we have, we don't know what that correlates to to this nebulous, oh, tariffs are going to change things and the money, like the cost of things are going to go up. We don't know",
            "start": 1503.56
        },
        {
            "text": "to us. the money that we have, we don't know what that correlates to to this nebulous, oh, tariffs are going to change things and the money, like the cost of things are going to go up. We don't know what that's going to look like. So, it's like, what? I can't even answer that question myself. You know what I mean? Would I spend $1,000 on the Switch 2? I hope not, too. I mean, I would. Yeah. Yeah. I undoubtedly would. I spent $700 on the PS5 Pro. I want to play my Switch 2 games. I want to play in 4K. Yeah, I have the money to be able to do that. Would I spend more than that? Probably not. And that's I know that like I'm on the [ __ ] high end there for that. But like if that's what it costs, that's what it costs, you know? Yeah. I there's no world I don't get the Switch 2, you know? Yeah. Is there I don't know. I mean, get above $1,000. Holy [ __ ] Uh yeah, a thousand is crazy. Uh, for me personally, um, I said this weeks before, uh, the big reveal that I was mentally preparing for",
            "start": 1551.12
        },
        {
            "text": "Is there I don't know. I mean, get above $1,000. Holy [ __ ] Uh yeah, a thousand is crazy. Uh, for me personally, um, I said this weeks before, uh, the big reveal that I was mentally preparing for 600. And I think that's honestly probably where my ceiling is at. And I honestly think that's where things are going to land. I also don't even think that's crazy. $600 for the Switch, too. I don't like it. Yeah. Yeah. But yeah, it's such a weird one for us if like it's a business expense or whatever, right? But it's like I feel like I guess it's a weird one. Yeah. Because I would justify it for work no matter like 600 is where I'm like I I I'm questioning at 600 personally just for how much I use my Switch One. Now again I'm being well I guess I'm not at 600. I'm questioning it right based on how much we do it. And I think I'm even then it might be I would let us get the office unit that we buy or whatever we end up doing and I'll play Mario Kart here with y'all and then whatever maybe I",
            "start": 1598.64
        },
        {
            "text": "how much we do it. And I think I'm even then it might be I would let us get the office unit that we buy or whatever we end up doing and I'll play Mario Kart here with y'all and then whatever maybe I don't know. Yeah. I don't know. Yeah. I mean for me I'm taking take work out of it entirely. Just how much I enjoy Nintendo games and how much I play my Switch. And that's my thing is I'm not Exactly. Like that's why I I don't think that like everybody should if the Switch 2 is $600 I don't think oh yeah hey it's worth it for everybody. But like is it worth it to me? Yeah definitely thousand% it will be. But that's a shitty position to put people in when 100%. But but again, it's not their fault. So man, Costa says 500 is my max. Um, Living Legends says, \"Tim, did you play Donkey Kong and handheld and how did it run?\" No, when we were at the event, they were very, very like, \"This game's only TV. This game's only handheld. Like, you didn't get to like choose.\" Um, Breath of the Wild and",
            "start": 1656.96
        },
        {
            "text": "and how did it run?\" No, when we were at the event, they were very, very like, \"This game's only TV. This game's only handheld. Like, you didn't get to like choose.\" Um, Breath of the Wild and Tears of the Kingdom were the only ones that we got to do both handheld and docked. Uh, Claw Master says, \"Chat, let's be real. Who here can afford a Switch, too?\" Really depends on how much the Switch costs, right? Yeah. Uh, Yeling says they have to announce the pre-order with price and have it be known that the price increases because of tariffs so they can dampen the blow on them. Sure. Yeah. I mean, the communication on all that's going to be rough. Um, and then Mexic says, \"Birthday tax for my big brother. He put me on to you guys and would never do this for himself.\" So, happy birthday, Jose. Oh, happy birthday, Jose. Thank you for caring. That's very cool. Mexican king, shout out your brother like that. Good name. Dope stuff. It is a good name. Um, I want to move on to story number two,",
            "start": 1700.4
        },
        {
            "text": "Oh, happy birthday, Jose. Thank you for caring. That's very cool. Mexican king, shout out your brother like that. Good name. Dope stuff. It is a good name. Um, I want to move on to story number two, but first I want to do one more super chat and then a word from our sponsors. Jay Colado says, \"500 max, 550 for MK bundle, 600 for OLED.\" Oh man. You ready for a 750 OLED edition in a couple years too? We'll fix it by then, right? You got to hope. You got to hope. Uh, let's take a quick word from our sponsors. This episode's brought to you by Imperial. We've told you all how important it is to developers to wishlist games you're interested in on Steam. So, if this game sounds cool to you, make sure that you wishlist it. In Imperial, you play as a mercenary sent to a distant planet to discover the mysteries of an ancient civilization. Powers unknown lie within the monolith, but those are no mere ruins as an expedition has already ventured inside with only a few survivors. Why was it built?",
            "start": 1745.2
        },
        {
            "text": "the mysteries of an ancient civilization. Powers unknown lie within the monolith, but those are no mere ruins as an expedition has already ventured inside with only a few survivors. Why was it built? What powers reside within? Who is at the center of the monolith? All these secrets and more will be uncovered if you are brave enough to take on Imperial. Imperial features a unique blend of RPG systems and skill-based combat across three weapon archetypes. the acrobatic glaive, the defensive but devastating mace and shield and the powerfully ranged cannon. With a deep ability system, extensive customization, every battle is an opportunity to refine and optimize your combat style. Form relationships with each of the few surviving expedition members who all have their own personal quest lines. Whether you choose to help or not can have drastic consequences for them. The monolith is guarded by powerful automatons, each with distinct attack patterns and weaknesses that demand precise",
            "start": 1792.0
        },
        {
            "text": "lines. Whether you choose to help or not can have drastic consequences for them. The monolith is guarded by powerful automatons, each with distinct attack patterns and weaknesses that demand precise execution and strategy to be victorious. Create your mercenary, enter the monolith, learn powerful abilities, defeat the automatons, and uncover the secrets that lie within Imperial. Imperial is available May 8th on PC, Xbox SNX, and PS5, but you can wishlist now. Do it. Wishlist Imperial. This episode is brought to you by Factor. Make this your best season yet with nutritious 2-minute meals from Factor. Eating well has never been this easy. Just heat up and enjoy, giving you more time to do what you want. Greg Miller has been loving how simple it is to enjoy his Factor meals as he's rushing between shows each day. I just saw Blessie eating some, too. Factor arrives fresh and fully prepared. Perfect for any active, busy lifestyle. Factor powers your day with satisfying breakfasts, on",
            "start": 1841.76
        },
        {
            "text": "between shows each day. I just saw Blessie eating some, too. Factor arrives fresh and fully prepared. Perfect for any active, busy lifestyle. Factor powers your day with satisfying breakfasts, on the-go lunches, premium dinners, and guilt-free snacks and desserts. factor can help you feel your best all day long with wholesome smoothies, breakfast, grab-and-go snacks, and more add-ons. Multiple people here at Kind of funny have been loving their experience with Factor, and guess what? You can, too. Get started at factormeals.com/kindfunny50 off and use code kind of funny 50 off to get 50% off plus free shipping on your first box. That's code kind offunny50 off at factormeals.com/kindfunny5050 off for 50% off plus free shipping. This episode's brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized shades that won't break the bank. Shady Rays is an independent sunglasses company",
            "start": 1891.92
        },
        {
            "text": "the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized shades that won't break the bank. Shady Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people. They have hundreds of options to choose from, so you're bound to find the perfect pair to match your style. If you don't love your shades, exchange them for a new pair or simply return worry-free within 30 days. There's no risk when you shop. Their team are always there to have your back with personal and fast support. Y'all know I've been outside a lot playing Pokémon Go, and it's such a great experience wearing Shady Rays when I'm out and about looking dope. Exclusively for you, Shady is giving out their best deal. Head to shadyrays.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. Again, go to shadyrays.com, use code funny to get 35% off",
            "start": 1938.8
        },
        {
            "text": "to shadyrays.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. Again, go to shadyrays.com, use code funny to get 35% off polarized sunglasses. Story number two, Xbox boss Phil Spencer reiterates support for the Switch 2, saying Nintendo's been a great partner. This comes from Eric Van Allen at IGN following the reveal of the Switch 2. IGN, they're the ones who beat you at He got first place. It was Logan Plant. He was really good. He was very fast. He wasn't that far ahead of me. Just wanted to be known. It sounds like Roger, run the footage. Sounds like the partnership between Nintendo and Xbox will continue a pace. I've never heard that word before. Have you? A AAC. A pace. Yeah, I don't think I have. No. Crazy. Microsoft's head of gaming, Phil Spencer, recently reaffirmed his support for the Switch platform as a way for the company to reach people who aren't on its platforms. In an interview with Variety,",
            "start": 1983.04
        },
        {
            "text": "Microsoft's head of gaming, Phil Spencer, recently reaffirmed his support for the Switch platform as a way for the company to reach people who aren't on its platforms. In an interview with Variety, Spencer was asked if he had any plans for specific projects on Switch 2. Uh the Xbox head said, \"Just as his company has been supporting Such One, it wants to support Switch 2.\" Quote, \"Nintendo's been a great partner. We think it's a unique way for us to reach players who aren't PC players, who aren't Xbox. Uh, it lets us continue to grow our community of players that care about the franchises we have and that's really important for us to make sure we continue to invest in our games. I'm a really big believer in what Nintendo means for this industry and us continuing to support them and getting the support from them for our franchises, I think, is an important part of our future. Spencer's previously been a vocal proponent of Nintendo Switch 2. If we know that stuff, blah blah blah. When",
            "start": 2034.88
        },
        {
            "text": "the support from them for our franchises, I think, is an important part of our future. Spencer's previously been a vocal proponent of Nintendo Switch 2. If we know that stuff, blah blah blah. When Variety asked whether the Switch 2 reveal made Spencer Ansie to announce what Xbox has next for its console lineup, though it doesn't seem like that's moved the needle there. No, I think it's I think all of us in this industry should focus on our communities and the player base that we're building. I get inspired by what a lot of different creators do and other platform holders, but I believe in the plans that we have. Cool. Not surprising. What was surprising is no Xbox games at all in that Switch 2 direct. Yeah, right. I thought for sure we would have seen something out there. Yeah. I wonder why. you know, there there's been a lot of talks about devkits not being out there, right? There was that the three threephase report and all that stuff. Um, clearly like a lot of the big dogs got",
            "start": 2070.4
        },
        {
            "text": "why. you know, there there's been a lot of talks about devkits not being out there, right? There was that the three threephase report and all that stuff. Um, clearly like a lot of the big dogs got them. Uh, and there was a couple surprising third party things going on in that direct like, uh, you know, Star Wars Outlaws was there, but it wasn't featured. It was just kind of like, hey, it's here. Cool. We're getting Ubisoft support that way. Um, so having Greg Cassavin out there talking about Hades, too. Absolutely. Yeah. They crushed it in terms of third party support from software. Come on. uh project 007 like all that stuff great but there were things that weren't there and that is bizarre when we see Microsoft making these moves multiplatform and we've heard Phil Spencer talking about wanting to support Switch 2. They've already supported Switch One. I'm not upset cuz I know the games are going to come. It's just I thought that that was going to be a slam dunk guarantee that that",
            "start": 2106.16
        },
        {
            "text": "wanting to support Switch 2. They've already supported Switch One. I'm not upset cuz I know the games are going to come. It's just I thought that that was going to be a slam dunk guarantee that that stuff would be there. What's your So do you think it is them being protective? Do you think it is Nintendo being like, \"Hey, let's not share that amount of spotlight.\" No, I think it's uh Xbox being like we have an Xbox showcase in summer and that's when we're going to do it all. Right. I think I think that this the Xbox showcase this year is going to be dramatically different than what we've seen in the past. Like I think Talk to me about that. What do you mean dramatically in terms of I mean they already talked about PlayStation logos being on there? I know. Okay. Uh really quick, Dylan Torso brings up a good point in chat. Tony Hawk was at the direct. Wouldn't that count? Sure. In some way, shape, or form. Yeah, that that was featured, right? and Xbox are treating Tony Hawk like it's",
            "start": 2149.68
        },
        {
            "text": "brings up a good point in chat. Tony Hawk was at the direct. Wouldn't that count? Sure. In some way, shape, or form. Yeah, that that was featured, right? and Xbox are treating Tony Hawk like it's one of their games. Like they they putting in the the images of next to South Midnight and all that stuff. So yeah, that's a that's a good point. But uh yeah, I just think that the Xbox showcase this year is going to feel more like a really really really good Ubisoft conference from the past, right? Of just like Yeah, these games every time it pops up like we're going to assume it's on all systems. Yeah. Yeah. Yeah. For sure. Like um I think the Switch 2 reveal has proved that Nintendo came to play and like they're Exactly. Like the the tech is going to be able to play games like Star Wars Outlaws that just came out last year. I don't think it's going to be able to play every single game. I definitely don't think it's going to be the best way to play most games, but I think it's going to be a",
            "start": 2184.48
        },
        {
            "text": "that just came out last year. I don't think it's going to be able to play every single game. I definitely don't think it's going to be the best way to play most games, but I think it's going to be a good enough way to play most games in a way that the Switch one simply was not. Sure. Um, so yeah, I think that the Xbox Game Showcase, we're going to see a ton of new announced games and Yeah. coming everything. Interesting, right? Yeah. Yeah, that makes sense. I hadn't thought that far ahead, you know what I mean? We're always so on the next thing, the next thing, the next thing. SGF and Xbox. I was talking about this in the Gregway today. I really hadn't. It happened while I was gone even the announcement of their SGF or, you know, whatever their summer conference followed by Outer Worlds 2 uh direct or whatever. And so like finally having the brain capacity to think about that. Yeah, you're right. I guess that they would be doing there. Are you see do you think it's going to be uh it's",
            "start": 2229.6
        },
        {
            "text": "uh direct or whatever. And so like finally having the brain capacity to think about that. Yeah, you're right. I guess that they would be doing there. Are you see do you think it's going to be uh it's coming to everything for the new stuff or do you think it's going to be like we're bringing older stuff like Master Chief Collection? Oh, definitely. Everything under the sun. Oh, yeah. I think so. And yeah, I I've been wanting to do a Games cast episode where we do look at Xbox games and kind of predict what's going to happen uh with the the legacy content like like Master Chief Collection, like what's that look like? And like are they going to enhance some of the old games? Like what's the cut off point? like what's it going to look like? Obviously, not every single Xbox game ever is going to come to PlayStation and Switch, but I do think that we're going to get a handful of them. We already are. Uh with things like Forza, is that going to come to Switch, too? I'm pretty sure it will,",
            "start": 2265.12
        },
        {
            "text": "to come to PlayStation and Switch, but I do think that we're going to get a handful of them. We already are. Uh with things like Forza, is that going to come to Switch, too? I'm pretty sure it will, right? I just don't know when. Um either. Sorry, what? That's imminent on PlayStation, right? This week. Yeah, it is. Yeah. Um but it's exciting. You know, I think that this is going to be very, very big for Xbox. saying it's going to be a huge win for these games to be able to be I mean it's it's you know what it'll be their latest because I don't say like you know it'll be whatever but it'll be their latest uh example of their strategy actually working and being there. Xbox wants to be where you are. Xbox wants Xbox games in your hands wherever you are. uh it's been a compelling argument for a long time I think between all of us and you know hardcore gamers people listening or watching this show but then to see that you know get out to the mainstream and for so many people when that",
            "start": 2302.64
        },
        {
            "text": "for a long time I think between all of us and you know hardcore gamers people listening or watching this show but then to see that you know get out to the mainstream and for so many people when that happens and Xbox team start showing up on their Switch and they see an Xbox splash logo they're going to be like wait what but I'm playing on Switch they they won't understand or know that that's happening the way they that we know it's happening right now and you can get your Xbox anywhere and so on and so forth this is an Xbox yeah this is an Xbox story number three Nintendo Switch 2 VRR mentioned disappear from their website. This comes from Jordan Middle Middler at BGC. Uh, as part of Nintendo's Switch 2 reveal, the firm announced that the new console would support 4K 120 fps and variable refresh rates. Now, Nintendo seemingly removed mentions of VRR from several websites officially. As noted by Digital Foundaries Oliver McKenzie, mentions of VRR have been removed from certain regional",
            "start": 2344.96
        },
        {
            "text": "rates. Now, Nintendo seemingly removed mentions of VRR from several websites officially. As noted by Digital Foundaries Oliver McKenzie, mentions of VRR have been removed from certain regional Nintendo websites at the time of writing. Uh, it's also been removed from CA from Canadian, US, and Japanese versions of the site. BGC can confirm at the time of writing that the text is still present on the European version, but it's possible Nintendo's in the process of removing it from all versions and is yet to update its European site. Uh, variable refresh rates allow supported TVs to display unconventional frame rates in order to provide a smoother experience. This allows games with uncapped frame rates to have wider performance flexibility in intense areas. BGC's contacting Nintendo for comments on this story. Not good. Yeah, that definitely definitely not good. I also don't think that this is the end of the world of course, but it's not good. Like that for them to to come out and have",
            "start": 2384.8
        },
        {
            "text": "on this story. Not good. Yeah, that definitely definitely not good. I also don't think that this is the end of the world of course, but it's not good. Like that for them to to come out and have all of the buzzwords there in a way that we weren't expecting. No, definitely were not expecting. Um, but I also think that from my experience so far, there is that push with these games that at least the first lineup of games, it's 1080p 120 frames per second or 4K 60 for these Nintendo games. Yeah. Um, and I think when it comes to the Nintendo games, I think VR is going to matter less. I think VR is going to matter and this is going to be a big bummer to third party games. Yeah, you talked about, you know, Star Wars and Xbox stuff and whoever from So, yeah, it's like if they get rid of this stuff again or if they don't have it, like, yeah, this is a bummer. Like, what do you think happened to get it on the sites to get it in the material and then now to take it away? I don't know. And the",
            "start": 2424.96
        },
        {
            "text": "again or if they don't have it, like, yeah, this is a bummer. Like, what do you think happened to get it on the sites to get it in the material and then now to take it away? I don't know. And the thing too is uh again, this is not confirmed. This is just things being taken away from a website like Jordan Middler looking at websites seeing what they have and what they don't have. But like is it specifically talking about when it is connected to a TV or is it it works this way docked or undocked different? I don't know. Yeah. Um, but yeah, I do not like this, you know, and it continues this like cycle of Nintendo losing control of the public's rioting with the the lack of information that we're getting or information changing and all that stuff. So, like definitely sucks to see. Like I I want to see a healthy Nintendo that technically is on par with the baseline of uh the rest of the industry. And this stuff nice to haves, but they're very nice to haves. And it's really sad to have them",
            "start": 2474.56
        },
        {
            "text": "to see a healthy Nintendo that technically is on par with the baseline of uh the rest of the industry. And this stuff nice to haves, but they're very nice to haves. And it's really sad to have them taken away. 100%. Uh in the chat, and I don't even know if this is true, uh Isaac Reed says they'll add it with an update. PS5 did that. And that's true, too. So that could be something that for some reason isn't working for launch or they need to whatever and then yeah they can patch it in later. Um we got a couple super chats. Zach Johnson says birthday tax. Have a great day y'all. Happy birthday Zach. Uh and movie rants Joe says I was hoping for a Diddy Kong racing style quote story mode in Mario Kart, but it looks like it's $80 because it's a high demand game. SMH. Yeah, we'll have to see how substantial all that free roam stuff is. I'm I'm still keeping my fingers crossed that it's going to be a fun time. Um a fun time. Yeah. But I mean I also not hoping for the dream. Cart games don't",
            "start": 2523.04
        },
        {
            "text": "substantial all that free roam stuff is. I'm I'm still keeping my fingers crossed that it's going to be a fun time. Um a fun time. Yeah. But I mean I also not hoping for the dream. Cart games don't need story modes, Tim. Just Yeah, but they could have them and they could be good. H Have they been though? I mean Mario 64 doesn't need a story, but it has one. Like just giving a like a frame of reference for like what's going on. And like here's the frame of reference to him. You're on a cart and you're [ __ ] racing. Go. You don't win. You die. Andy was bringing this up on the on the reaction. Like I would love to go up to NPCs and have them talk to me. Like the story can just be like there's a world. You know what I mean? Like like I not having that stuff makes this look empty. Like it looks like you're just in a big empty world and I want things to do. I agree with that. I wish all the stuff was inside of the open world. I wish I wish it was fors of Horizon where you turned it on and",
            "start": 2572.0
        },
        {
            "text": "like you're just in a big empty world and I want things to do. I agree with that. I wish all the stuff was inside of the open world. I wish I wish it was fors of Horizon where you turned it on and that was all there and you could go do all that stuff rather than choose I want to go do the cannonball run mode. Choose I want to go to open world. choose I want to battle. I think it kind of is going to be like that though. What do you mean? I think it is going to be integrated. There will be menu systems, but like it is all in the world. But is it I have to go to separate modes, right? I have to like come back to the main menu to choose to go to all these. That's what that's what you don't have to do in Forza, right? You can drive in the next race. You can do the next thing. H that would populate the world of things to do and talk to like you're talking about. Yeah. Yeah. Yeah. can't remember how it worked when we went into the knockout tour because I'm pretty sure we just were in free",
            "start": 2614.56
        },
        {
            "text": "the world of things to do and talk to like you're talking about. Yeah. Yeah. Yeah. can't remember how it worked when we went into the knockout tour because I'm pretty sure we just were in free roam and got drove to a place and then it started. Well, they were very clear that there's a free road mode. Yeah. So, there might be a little bit of free roam before you do it, but that would mean that in that mode you can't go get the coins and you can't go get the thing. I think that's going to be the the g the gating gating they're doing here. Yeah, we'll see. Which I think on one hand silly on the other hand, it really doesn't matter because it'll be I don't feel like racing anybody. I feel like going to get some coins. All right, I'm done with that. I want to go race the big thing. I need to practice. I need a time trial. I just go off and jump to all the different things. But yeah, uh story number four. Final Fantasy 15 director comments on the delay. This comes from Genki on Twitter. Uh",
            "start": 2652.32
        },
        {
            "text": "I need a time trial. I just go off and jump to all the different things. But yeah, uh story number four. Final Fantasy 15 director comments on the delay. This comes from Genki on Twitter. Uh Final Fantasy 15 director Hajime Tomatita says that that him choosing an initial release date for Final Fantasy 15 that was too early leading to them delay the game was a massive mess up. quote, \"So, I took the development status into account and got a grasp of the situation of competing titles, then initially decided on a release date of September. However, about a month after deciding I was holding my head in my hand, saying I messed up.\" When you delay the release of a game of a major game like Final Fantasy 15, it really does cause trouble in a lot of places. It really was the greatest mistake. Jesus. In the end, it was delayed from September 30th to November 29th, 2016. Uh, if you don't remember, Greg and I were the ones that announced the September dates and it was a big ass reveal. It was a",
            "start": 2686.4
        },
        {
            "text": "In the end, it was delayed from September 30th to November 29th, 2016. Uh, if you don't remember, Greg and I were the ones that announced the September dates and it was a big ass reveal. It was a giant the biggest reveal of all I've ever [ __ ] seen. And the greatest thing is like they had the date spinning, right? It was like going to do the reveal and it was November and it was like and it ended going going up to September and it's like ah I just thought this is hilarious. I like it is so funny to have the kind of transparency being like yo we [ __ ] up. Like we should not have done that. I was glad he didn't call us out cuz I thought that's when you send this you're like when you put it through and you're like and make sure we talk about this tomorrow when you you put it into Slack yesterday and I can never for the life of me find assets when I'm trying to get something to Barrett. There's uncovered if you jump to the end Barrett. I thought it was going to be about us and the",
            "start": 2728.56
        },
        {
            "text": "yesterday and I can never for the life of me find assets when I'm trying to get something to Barrett. There's uncovered if you jump to the end Barrett. I thought it was going to be about us and the button. Yeah. Remember the whole the whole brew haha with the button. I don't even remember what happened with the button except that we talked about the button the whole show hitting it and then when we got there somebody lost the button. We were like going on stage at the end we're like where's the button? Like we don't know where the button is. I'm like, \"Well, that was the we've built this up an entire live stream to hit the button in the shrine auditorium, but now we don't have the button.\" Okay. Or whatever. Yeah. 7,000 screaming fans. And then we got really ripped apart, remember, by the Japanese commentators who were wa who were like doing their like their reaction stream. They were all mad that we didn't use the button, you know. Yeah. Where's the button? Yeah. Who knows? Yep. Yep.",
            "start": 2769.84
        },
        {
            "text": "Japanese commentators who were wa who were like doing their like their reaction stream. They were all mad that we didn't use the button, you know. Yeah. Where's the button? Yeah. Who knows? Yep. Yep. Yep. Yep. There it was. There it was. Final Fantasy 15. What a time. Yeah. You ever stop and think about that? That we host that thing? I do. I often think about it. Yeah. I also often think about how Final Fantasy 15 was so close to being amazing. Maybe not so close, but it's there. I mean, had Flowers the Machine, you know, the potential is there. I feel like if you gave that game, and I know this is a crazy thing to say, but if you gave that game two more years, I think it would have been an all-time. Wow. Yeah. Okay, fair enough. Story number five. PlayStation Plus prices in Canada are increasing again. Man, come from Chris Stulling at BGC. Uh, PlayStation Plus prices in Canada are raising for the second time. Canadian subscribers, including Reset Era user Gallo, I get that's just",
            "start": 2800.8
        },
        {
            "text": "increasing again. Man, come from Chris Stulling at BGC. Uh, PlayStation Plus prices in Canada are raising for the second time. Canadian subscribers, including Reset Era user Gallo, I get that's just sourcing where they got it from, but have been reporting that they've received emails from Sony informing them that 12 month subscriptions to the service would be rising from June 24th. On that date, the price of a 12-month PlayStation Plus Essential subscription will change from $95 to $110, an increase of $15. a 12-month PS+ extra subscription. I hate this stuff, Greg. I know. I really hate it. Like, I get it. It's not that complicated. And I I I'm not the biggest fan of people like when there's a chart, everyone making fun of it cuz it's like, yo, the chart's just [ __ ] making this simple. But like, also, does it need to be like this, you know? I mean, it makes sense when you read it. I just don't want to read it. I refuse if I'm being honest. Uh, one's going up 35, another's going up",
            "start": 2841.36
        },
        {
            "text": "But like, also, does it need to be like this, you know? I mean, it makes sense when you read it. I just don't want to read it. I refuse if I'm being honest. Uh, one's going up 35, another's going up 35, one's 15. Cool. Do the math on that. According to Sony's email, the price adjustment will enable us to continue bringing high-quality games and benefits to your PlayStation Plus subscription service. Cool. Uh, this is the second time Canadian players have seen their PlayStation Plus prices rise following a hike in 2023. Uh, the second price increase now means that since the three tier system originally launched in Canada, Essentials risen by a total of $40 a year. God damn. Extra has risen by 75 and Premium by 85 a year. Man, money. Yep. We're on the ride. Everything's going on. They're gonna find a way to get every dollar they can to try to make up for the dollars they're losing. When does it come here? Imminently, probably. I don't know, before the years end. I'll say before summer.",
            "start": 2887.2
        },
        {
            "text": "find a way to get every dollar they can to try to make up for the dollars they're losing. When does it come here? Imminently, probably. I don't know, before the years end. I'll say before summer. Before end of summer. That's the economy you live in now. Story number six, a report. Ubisoft developing a new battle royale heavily inspired by Apex Legends comes from Tom Henderson at Insider Gaming. The game, which is currently under the project name of Scout, is so heavily inspired by Respawn Entertainment's highly successful Apex Legends that it was once used as the thumbnail for the project. It's understood that the game has been in development for at least a couple years and will feature quote very similar characters to Apex Legends, including a spin on Pathfinder, Wraith, Lifeline, and other characters from the game. One source said on the project, \"I think the goal is to capitalize on the player count of Apex dropping and Ubisoft high-ups, thinking there's room in the market for",
            "start": 2932.88
        },
        {
            "text": "other characters from the game. One source said on the project, \"I think the goal is to capitalize on the player count of Apex dropping and Ubisoft high-ups, thinking there's room in the market for another hero battle royale.\" Interestingly enough, the project seems to go against Ubisoft's own internal research team, who recently asked the question as to quote, \"What's next after Battle Royale?\" while citing the decline in players across various battle royale games, including Apex Legends. They figured it out, Greg. I'm so happy. I'm so happy that Ubisoft looked, they're like, \"How do we save ourselves?\" We've been talking for months about maybe doing a Games Cast topic of how to save Ubisoft. We don't need to do it anymore. They figured it out. Let's copy Apex Legends when Apex Legends isn't doing as well anymore. And of course, and like even use the thumbnails. You know what I mean? Just be that like blatant about what you're doing and where you're going with it. You know, Ubisoft",
            "start": 2978.64
        },
        {
            "text": "isn't doing as well anymore. And of course, and like even use the thumbnails. You know what I mean? Just be that like blatant about what you're doing and where you're going with it. You know, Ubisoft hasn't succeeded the most when they trace chase trends. But maybe this will be the one that changes. This might be the one. This will be the one that changes it. Yeah, this will be the one that chang herbased shooter. That's what people want, man. That's what people want. That's what they want. Ask about Concord. You know what I mean? Let's get out there. Let's get on and do the damn thing. Holy [ __ ] dude. Holy [ __ ] You will never see this game is my prediction. Do we see a Ubisoft showcase at Oh my god. Summer Game Fest. Oh my god. No, you can't. Bring me back to that hotel [ __ ] lobby, man. You can't. We can't. They can't. We can't. They can't have a Ubisoft showcase at SGF, can they? Can they? I I honestly pray that they don't. They simply can't have things to talk about. You",
            "start": 3013.36
        },
        {
            "text": "man. You can't. We can't. They can't. We can't. They can't have a Ubisoft showcase at SGF, can they? Can they? I I honestly pray that they don't. They simply can't have things to talk about. You figure Assassin's Creed DLC, man. They've always got Are they still doing all the mobiles and bullshits? They're in such a weird place, man. Star Wars DLC. I guess that's about to come out, right? Yeah. A new Far Cry. That's a good point. Guy V says new Far Cry. That could be the reason you'd go there. Okay. Y Rainbow Six Siege stuff. Somebody says Alex says Division 2 DLC. remember like in on April 26th they're doing a Division 2 DLC live stream. So I don't think you do that. Yep. Just Dance, of course. Yeah. Yeah. Avatar. Don't do it. Just don't. Save your money. The worst produced live show I think I've ever seen. And it's like I don't love saying that just because I know how hard it is to of course do live production particularly for uh E3 SGF. But like what was the vision? Embarrassing.",
            "start": 3047.6
        },
        {
            "text": "think I've ever seen. And it's like I don't love saying that just because I know how hard it is to of course do live production particularly for uh E3 SGF. But like what was the vision? Embarrassing. Simply embarrassing to have all the suits in the the front row like the whole point of this just for them just to to have them be like look at our stuff. Look at all my [ __ ] Not even the cool way. And they would like to show B-roll like this. Yeah, this is how we want to see this game. Don't do it, Ubisoft. Don't do this. How should we show off Skull and Bones for the fourth year? Let's just have people come up and play some music from the game. They kick off like they don't have like the, you know, the talent that was, you know, like camera ready and car charismatic like uh shout out to the, you know, homie Yousef and Nam. Like why use them? Why? Why? You know what I mean? Nah. Nah. God, I'm I'm in big hater mode right now, Greg, but I can't get out of it. I can't get out of it. They",
            "start": 3110.08
        },
        {
            "text": "you know, homie Yousef and Nam. Like why use them? Why? Why? You know what I mean? Nah. Nah. God, I'm I'm in big hater mode right now, Greg, but I can't get out of it. I can't get out of it. They killed my dog. What? I regret to inform you. Moose. Oh, man. If Ubisoft did kill my dog, Greg, that'd be big news. But if I wanted to know something small, where the [ __ ] would I go? We have small dogs, too. But uh you'd go, of course, to our last news story, the Wii News Channel, where we cover all the small news items you need to know about. You're [ __ ] with me. This feel Am I getting bananed right now for IGN Skull and Bones to add land combat this fall? They got it. They figured it all out, everybody. As Ubisoft outlines year two content plans. There you go. That's what the show is going to be. Clones. Oh my god. Oh my god. Uh, during season 3 this fall, Ubisoft will finally allow players to take the action away from the sea, meaning you'll be able to sword fight and even draw your",
            "start": 3162.0
        },
        {
            "text": "to be. Clones. Oh my god. Oh my god. Uh, during season 3 this fall, Ubisoft will finally allow players to take the action away from the sea, meaning you'll be able to sword fight and even draw your firearms against others. Um, cool. Star Overdrive launches June 19th on Xbox Series, PS5, and PC. Uh, Uncapped Games announced that a new phase of beta testing has begun for its upcoming action real-time strategy game, Battle Aces. Players can sign up kind of funny. Uh, players can sign up to play now via Steam and can experience the full depth of strategic options in the game with all units unlocked. The Outlast Trial Season 3 launches April 22nd with trial, you [ __ ] I ain't going to read that banana, Barrett. I'm not reading the banana. Nice try, Barrett. Trial banana maker mode. That's funny. New enemy and more. And that's it for Wii News. Well, that was good. You timed it perfectly. Thank you. Me and Barrett have been working on it after hours. Yeah. Yeah. Uh Barista Brand super chats",
            "start": 3213.52
        },
        {
            "text": "New enemy and more. And that's it for Wii News. Well, that was good. You timed it perfectly. Thank you. Me and Barrett have been working on it after hours. Yeah. Yeah. Uh Barista Brand super chats in saying, \"Is Final Fantasy 15 worth playing if the only Final Fantasy I've played is Kingdom Hearts?\" It wouldn't be my starting place. I'll tell you that. Okay. Okay. I apprec I appreciate the honesty. I If if Kingdom Hearts is your only Final Fantasy, I'd play Seven Remake. I think that's the right move. Okay. Yeah. Living Legend says, \"Hoping for a PS5 mod that lets you transfer game saves to an external drive since that's the only reason I have PS+. Paywalling a basic feature is scummy.\" Great point. That you are 100% correct. There is no counterargument to that. That's super [ __ ] up that you can't move it to a USB anymore. Trevor says, \"Just watched the Goofy Movie documentary the other day. I want to shout out Tim's Cameo. Great documentary if you grew up with the Goofy Movie.\"",
            "start": 3263.04
        },
        {
            "text": "that you can't move it to a USB anymore. Trevor says, \"Just watched the Goofy Movie documentary the other day. I want to shout out Tim's Cameo. Great documentary if you grew up with the Goofy Movie.\" Yeah, great documentary. Highly recommend y'all watch it on Disney Plus. And yeah, I'm in it for a second, which is pretty cool. pretty damn cool. That was a fun one because uh I don't know how much you ever talked to him about it, but like your Disney enthusiasm is matched by Po. Po grew up a huge Disney household family takes Jack there multiple times a year to and so like un you know me and him were going back and forth. We're still planning the Chicago show and then all of a sudden I just got a in the middle of the Chicago text I get a screenshot of his TV and it's just Tim exclamation cuz he was watching it on release date cuz he loves Goosey. I mean that's awesome. Yeah. I mean, it's so cool. It's like the the Goofy Movie uh Not Just a Goof is the name of the documentary. It's",
            "start": 3308.24
        },
        {
            "text": "cuz he was watching it on release date cuz he loves Goosey. I mean that's awesome. Yeah. I mean, it's so cool. It's like the the Goofy Movie uh Not Just a Goof is the name of the documentary. It's getting like front placement on Disney Plus. I think even right now if you just turn on Disney Plus, it's there, which is very very cool. Um and a Best Friend directed it. So, yeah, that's how I got in, which is awesome. But yeah, it's a great documentary and a very fascinating story about a very fascinating movie, Goofy Movie. At some point, Greg, Goofy, you and Ben need to watch Goofy Movie, okay? But it's going to [ __ ] you up. Oh, yeah. It's a father son. Also extremely goofy movie. Still haven't watched it. Barrett I know it's X Games, dude. What was the the word that you used? You're like, I'm going to get Was it zooted? [ __ ] yeah, dude. I'm going to get zooted and [ __ ] watch Extreme movie tonight. I think about Barrett saying that all the time and it makes me laugh so much.",
            "start": 3350.0
        },
        {
            "text": "like, I'm going to get Was it zooted? [ __ ] yeah, dude. I'm going to get zooted and [ __ ] watch Extreme movie tonight. I think about Barrett saying that all the time and it makes me laugh so much. Honestly, if like just thinking the father-son stuff, the second one would [ __ ] you up even more. Oh [ __ ] man. I need to get zooted. [ __ ] is watching goofy extremely goofy movie baby. Um and then CJ Splitzon says Twisted Metal trailer is out. I know we're running long. I got to watch it, Greg. Oh, okay. I'm cool with that. Yeah, sure. Of course. Anthony Mackey, of course. My Captain America. Um I don't want to. Ah, you're right. You're right. Sorry. We can't we can't remember when YouTube came out of the [ __ ] shadows while we were live with Superman and like it's scary. It's been scary since then. Everybody was live trailer. Yeah. Over here. New Fantastic 4 trailer. We know we're planning on doing a react to the Fantastic Four trailer. Yes, we will do Fantastic 4 trailer and the",
            "start": 3388.4
        },
        {
            "text": "since then. Everybody was live trailer. Yeah. Over here. New Fantastic 4 trailer. We know we're planning on doing a react to the Fantastic Four trailer. Yes, we will do Fantastic 4 trailer and the final Thunderbolts trailer, but it won't be live. It'll just go up later cuz that's how I get you. It's like we got a warning from YouTube. If we get our first strike, we're not going to be able to upload or stream for a week. So, we got we got to be chill. Um, but we appreciate all of you. That was kind of funny Games Daily. Um, thank you for hanging out with us today on this beautiful Thursday. It's a Friday for me though cuz I'm going to Las Vegas, baby Mania. I'm excited. Um, but we're not done with the day. Like we're saying, later you'll be able to watch our Fantastic 4 trailer reaction and right now you can watch our Wrestlemania predictions followed by a fun little schedule one stream with Joey and the boys. Till next time, it's been our pleasure to serve you. He is my stars. [Music]",
            "start": 3438.48
        },
        {
            "text": "right now you can watch our Wrestlemania predictions followed by a fun little schedule one stream with Joey and the boys. Till next time, it's been our pleasure to serve you. He is my stars. [Music]",
            "start": 3475.44
        }
    ]
}