{
    "id": 13954,
    "video_id": "5p32m4Uyz2c",
    "show_name": "Gameplay",
    "hosts": [
        "Nick Scarpino",
        "Andy Cortez",
        "Mike Howard"
    ],
    "title": "We Play The Marathon Closed Alpha (Day 2)",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page - https://store.steampowered.com/app/1377700/Empyreal/ \nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1745536552,
    "duration": 8218,
    "transcript_chunks": [
        {
            "text": "Three, two. Yo, what the heck is going on? Kind of funny best friends. Welcome back to your Kind of funny games afternoon stream on a lovely Thursday, April 24th, 2025. Andy, we've returned to Marathon. Let's do it, baby. You feeling good? I was I was really bummed last night cuz I knew what my plan was going to be and I was like, man, I wish I had a PC that was free and open to play uh more marathon cuz I saw you streamed last night, too. Yeah. Uh, you know, it's just it's I I'm I'm giving myself all into the extraction shooters this weekend next, and I'm having a a blast with this one. So, I've been following the missions. I've been making new friends out there in the community and we're just having a good time. And we, you know, we luckily have been sitting here and chat. You'll be proud of us cuz we we've been playing. Yeah. Before the stream started. Yes. So, like that's crazy. We've been uh we've been learning and we've been having some fun. Nick, how are you feeling today? I'm",
            "start": 3.24
        },
        {
            "text": "of us cuz we we've been playing. Yeah. Before the stream started. Yes. So, like that's crazy. We've been uh we've been learning and we've been having some fun. Nick, how are you feeling today? I'm good, big dog. Um, yeah, it was nice to kind of jump in here for a little bit to to get a feel for it off stream. And I'm looking forward to uh to doing this and upgrading some of my guns cuz I really want some mods. I got these nice little open spots here uh that you can see that are just they're just begging for some mods. Yeah, they're begging for Where do you get those from, Andy? Oh, the black market, right? Well, you see the actual buy [ __ ] You You can find mods in the world. I don't find any mods. I'm not seeing any mods. I don't think you're looking hard enough. I'm definitely not. Where are the mods? We had we did have a little moment earlier chat where I had to ask Nick and what did we learn Nick? Mhm. What did we learn there? And you know what? That's a great question. Let's go",
            "start": 47.2
        },
        {
            "text": "are the mods? We had we did have a little moment earlier chat where I had to ask Nick and what did we learn Nick? Mhm. What did we learn there? And you know what? That's a great question. Let's go let's go around each one of us one thing. What did we learn from yesterday that we're bringing in today to be mindful of? That's what I'd like to do. What do we mindful of today? Um well, one thing that I that I found a little earlier that Nick kind of I found something, hit a button, and Nick was like, \"Oh, Andy, do you know what you just did?\" I was like, \"No, I have no idea.\" And he goes, \"You just emptied out the poison from that poison room. You found the laptop. You found this.\" And it was a little red laptop that was outside the building. Like, \"Oh, cool. Now we know how to do that.\" But then the other cool thing um is the uh the little numbers thing that we just figured out, Mike. We did a really good job at being able to call in the cargo bot. We worked it out in our minds and we",
            "start": 84.88
        },
        {
            "text": "then the other cool thing um is the uh the little numbers thing that we just figured out, Mike. We did a really good job at being able to call in the cargo bot. We worked it out in our minds and we did it right. So, nice job. Some puzzle solving. I'll give you that. Being mindful of the puzzles and taking a deep breath, a different approach than the last time we did. We also had a uh a dude push Nick. Uh he killed Mike and then downed Nick. Yeah. Uh and I had to pop off. We didn't panic. Everybody You really did pop off, Andy. And I'm I'm impressed by that. And I didn't know. Did I know how my gun fired at the beginning of it? No. And I also sw cycled to my knife by accident. Yes. Yeah. Like And I swapped to my single uh shot semi-automatic weapon and held down the mouse button and went and I was like, \"Oh, that's not an automatic weapon. I got it. I got to tap it a bunch. Okay, let's go over to Nick. Nick, what did you learn from yesterday? What are you bringing in today? What are",
            "start": 123.12
        },
        {
            "text": "and I was like, \"Oh, that's not an automatic weapon. I got it. I got to tap it a bunch. Okay, let's go over to Nick. Nick, what did you learn from yesterday? What are you bringing in today? What are you going to be mindful of today? Um, I am I'm going to be mindful of sticking with the group and really kind of uh looking out for my my backpack inventory, making sure I have high valued items in there, which I think I'm now starting to get acclimated to. Okay, just seeing that like if you got something in there that's like 10 bucks, get it out. 50 bucks, get it out. 225, maybe it stays with you on the way back. Because right now, I'm looking at I'm pushing 3,600 credits. No big deal. So, if you guys need a loan, get in line. Nice. Uh, beyond that, I'm looking forward to seeing what other guns I just got this V95 Lookout precision gun. Try that out today. See what happens there. Okay. Got this badass V11 Punch. Great name for a gun. Yeah. Uh, and I want some mods. I want I want some",
            "start": 168.72
        },
        {
            "text": "guns I just got this V95 Lookout precision gun. Try that out today. See what happens there. Okay. Got this badass V11 Punch. Great name for a gun. Yeah. Uh, and I want some mods. I want I want some weapon mods. Dude, what's up? That green pistol looks sick as [ __ ] Do you want me to bring a weapon mod with you? Tactical. I don't know. I'll figure it out. You got an SMG at all? I do. I have the bully SMG, but I just put a precision rifle in there instead. I don't I don't know if that's I don't know if that's the right Chrisa says, \"Have y'all been reading though?\" Yes. I mean, well, you know, there several times where Nick was wondering what his abilities do. I was like, \"Hit the tab button you see on the bottom left.\" I still don't know how my missiles work, Chris. Yeah, we're still learning. Well, yeah, we got to try. We didn't test those out, but you should probably just test them out. Well, here's the problem. The problem I I tried. The problem is the um the missile thing is cool",
            "start": 205.44
        },
        {
            "text": "Well, yeah, we got to try. We didn't test those out, but you should probably just test them out. Well, here's the problem. The problem I I tried. The problem is the um the missile thing is cool as [ __ ] but it requires targets to lock onto. So, you can't test that out unless there's people in front of you. I think it's literally you ping them Boop boop boop. But then I don't know what to hit to actually launch the missiles cuz you know how those there there are the uh robots that have missiles that launch at you. Probably the Q button again maybe. I imagine or like left click. That's my goal. I'm going to try to use that once during this time. Victor Vanuran says bully SMG is the best gun right now. Boy, says Victor Vancur. The bully SMG. Is it now? If you bring the bully SMG, Nick, I want you to know that I will give you a flash draw chip that will upgrade your bully SMG. Look at that. What a deal. Fire spread, handling, and movement accuracy all up on that. Well, you know, I might",
            "start": 242.08
        },
        {
            "text": "you to know that I will give you a flash draw chip that will upgrade your bully SMG. Look at that. What a deal. Fire spread, handling, and movement accuracy all up on that. Well, you know, I might be able Yeah, let's do that. I'll trade out this uh Let me trade this out. Let's put the bully back in. Put that back in with you if you don't mind. I'll pack that. Let me put the bully back in here. Let me trade out all my ammo types. It would be nice if they got like you could do a load out per like package all this [ __ ] together cuz obviously why would I want to bring the gun if I don't have ammo for it? That's just me venting. I like that. I like that. Well, I'm feeling very good about this. I'm excited for day two. As Andy said, I played this last night. I've had a ton of fun. I thought day one for us went really, really well, you guys. We We learned to get be to be a little more cohesive. I think our communication is getting better. Let's be more mindful. I want to be more mindful of",
            "start": 277.6
        },
        {
            "text": "one for us went really, really well, you guys. We We learned to get be to be a little more cohesive. I think our communication is getting better. Let's be more mindful. I want to be more mindful of pings, okay? Of pinging enemies the moment we see them. Instead of I see an enemy, it should be I see an enemy plus the ping at the same. You should be pinging it as you're saying ping as you say it so we all can turn and look. But as of right now, I'm feeling something with my load out. Uh, right now I am bringing in a load out of well, Andy, I think, is in control. I'm bringing in $1,400. Nick is bringing in $1,200 and Andy is bringing in $1,800 load out right now. You got to spend money to make money. Insane amount of money. And like Mina Kim said, he lost on Celebrity Jeopardy recently, scared money, don't make money. Money don't make money. Do you guys have anything in your course lots? Uh, yeah. I've put in two cores right now. I have two cores on mine. So does Andy. They look like uh",
            "start": 318.32
        },
        {
            "text": "money, don't make money. Money don't make money. Do you guys have anything in your course lots? Uh, yeah. I've put in two cores right now. I have two cores on mine. So does Andy. They look like uh gold cubes. Yeah. Teal cubes. We don't have No, no, no. Those are the implants. Oh, wait. What do you have in your core slots? Well, that's I'm saying the core slot is the teal cube. Oh, I don't have one. Okay. Yeah. Ping it. Sing it. Exactly. Con man says, \"How we liking it so far?\" How we liking it? This I mean I'm I'm having a good time with it. Yeah, I'm having a good time for what it is. This is still not a game that I think I will no life because I don't think I will no life any extraction shooter because I prefer Marvel Rivals or that sort of multiplayer experience. So like that's not anything to say against the game. That's just like hey Greg why don't you enjoy Marvel vs. Capcom or something. He's like well I don't love fighting games. That's kind of where I'm at with the attractive",
            "start": 366.4
        },
        {
            "text": "to say against the game. That's just like hey Greg why don't you enjoy Marvel vs. Capcom or something. He's like well I don't love fighting games. That's kind of where I'm at with the attractive shooters. But I'm also super easy to satisfy when it comes to a shooter mic cuz I could just be looking at a white screen with a cursor and if I could just like shoot the thing. Yeah. Like I have fun doing that and I'm gaming with my friends and I I enjoy it. Well, remember team, we do a really good job at let's call out what our missions are. Let's ping the areas we need to go to. I got to do the botney report in uh from station. I got to download the botney report as well from the station. So, how about we go to hauler first? to call in this uh loot drop. I'm going to take the main vein over to station. It definitely didn't work for me last. Give me that mod. Oh yeah, of course. Remember that the the call-in didn't work. Uh yeah, we're going to try it again. This is why you dodging us",
            "start": 414.0
        },
        {
            "text": "to station. It definitely didn't work for me last. Give me that mod. Oh yeah, of course. Remember that the the call-in didn't work. Uh yeah, we're going to try it again. This is why you dodging us tomorrow. I'm not dodging anybody. Chris Anko, what are you talking about dodging? Are you talking about last night though? If you wanted me to play last night playing my Clare obscure VA and I couldn't use my computer, my computer was occupied all day yesterday. Shout out to everybody hanging out with Mike on the GameStop stream last night. That was a lot of fun. I went out into the streets, made a friend in the streets. I'm just so glad I wasn't there cuz I I would have ended up having to giving him my phone number. Oh yeah, you definitely would have given that guy your phone numbers, right? Deploying barricade. Let me get your phone number. Both of y'all. I was like, \"Okay, yeah, no problem.\" So Mike, so how do you know him? I just met him. Mike, you've got [ __ ] Guys, guys, guys. We got",
            "start": 454.96
        },
        {
            "text": "barricade. Let me get your phone number. Both of y'all. I was like, \"Okay, yeah, no problem.\" So Mike, so how do you know him? I just met him. Mike, you've got [ __ ] Guys, guys, guys. We got a real guy here. Ping, ping, ping, ping on me. Maybe never mind. He's at this robot guy. Oh, okay. Big robot. Big robot. Big robot. Hanging singing. Hanging singing. Oh man, that grenade is crazy. Dude, I love this little single shotgun gun, chat. This is a cool one. Yeah, use your abilities. Bust out that shield, Nick. That's what I'm That's what I'm the worst at in new games whenever there are abilities cuz I just forget I have them. Yeah, me too. This All right, Mike. Uh, have we found that number thing yet on the wall? No. Now you got to start looking for the So, what was crazy was was that bugged earlier, Mike, where the it didn't call in the drop? I I wonder. I mean, we we kind of had to leave pretty quick because we were so low on time. We waited there for a while, though. Yeah, we waited",
            "start": 503.68
        },
        {
            "text": "earlier, Mike, where the it didn't call in the drop? I I wonder. I mean, we we kind of had to leave pretty quick because we were so low on time. We waited there for a while, though. Yeah, we waited for a solid 60 seconds. I just don't know what the timing is on that. How long it takes. So, I'm just looking for in a nook somewhere. You're looking for a Palm Pilot with a bunch of numbers on it. You'll see it. Oh, right here. 6. Is that it? So, if you ping us. All right. So, look for all the spots around. Look for all Oh, wait. Wait. No, this was an actual computer. [ __ ] This wasn't that. Oh, you [ __ ] it up. Yeah. Oh, real dude. Here. No, that's a robot. Is it? That was a real dude. Holy [ __ ] Real man. I have 73 seconds until I have my ping. Everybody be ready. They're above you, Andy. They're up top. They killed me. Pinged them. Okay, I'm I'm shielding. I don't see him. He's dropping down to the center right now on his dead friend's body. He just smoked on it. He'll be in his",
            "start": 563.2
        },
        {
            "text": "They're up top. They killed me. Pinged them. Okay, I'm I'm shielding. I don't see him. He's dropping down to the center right now on his dead friend's body. He just smoked on it. He'll be in his ultimate. There's a lot of people here. There's two. I I weakened them a lot. Yep. Oh, Nick down one. There's one more. Be smart. Take your time. You have your abilities. Thirst them and then step back. [Music] This is [ __ ] so dangerous. Heal up. Great job. Take your time, boys. Take your time. They probably ran away to go heal, Nick. I would have to guess. Yeah, I'm molting. Prepare for increased hostiles detected. Oh, that's a nasty gun. Guys ain't [ __ ] though. Did we get Mike back? Uh, no. Sorry. I'll go get him. The bots's dropping on us. Where's Mike? In that. You got him. Yep. But like, come to me and see if it does it faster if you're doing it, too. Oh, I think all three of these guys are dead here. I think Mike killed the other guy. No, I can't. No, but that guy was crawling. Oh, I",
            "start": 610.88
        },
        {
            "text": "to me and see if it does it faster if you're doing it, too. Oh, I think all three of these guys are dead here. I think Mike killed the other guy. No, I can't. No, but that guy was crawling. Oh, I thirsted that guy. Yeah, but like if he was the last one. I don't know if you Well, there's three bags. One, two, three. Oh, okay. Got you. Got you. I don't know if that I I'm assuming that's all three of them. I threw a grenade in there, so I don't know if that definitely did something awesome cuz I I I had broken one dude's shield and I started shooting the other one cuz the other guy started ducking. Good job. Great job. Great [ __ ] job. Great run right there. Mike, do you think your radar is something you want to be doing often? Uh, I don't think a blood hound situation seconds and so I was still on cool down, but like No, no, no, but I Yeah. Yeah. No, I'm not like trying to call you out. Do you think it No, no. I'm just saying like when it's three 300 seconds, you I don't think you use",
            "start": 694.48
        },
        {
            "text": "still on cool down, but like No, no, no, but I Yeah. Yeah. No, I'm not like trying to call you out. Do you think it No, no. I'm just saying like when it's three 300 seconds, you I don't think you use it until you actually engage with it. Until you think Okay. Yeah. Cuz if you start just willy-nilly using it, you're going to miss it when you actually need it the most. It's not like a blood hound situation in Apex where you're kind of like just doing it all the damn time. Yeah. No, cuz like right there and then we met that kid and I'm still on 85 seconds on cool down unfortunately, which doesn't help at all. Hey, we [ __ ] survived that, dude. That was good. Oh, there it is. Up here. You see the ping? Oh, yeah. The holler ping. That's That's the one we're wanting. All right. K it up. Dude, I love All right, we're looking for 644. 64. 644. I have 943 over here. That's not correct. 644. I see 644. I got it. Yeah, I definitely pinged the wrong one. I got it. We're good. All right,",
            "start": 734.96
        },
        {
            "text": "Dude, I love All right, we're looking for 644. 64. 644. I have 943 over here. That's not correct. 644. I see 644. I got it. Yeah, I definitely pinged the wrong one. I got it. We're good. All right, everybody read your screen. Let's see what it says. Top left. Top left. Progress made. Updating tracker. Okay. I didn't see anything pop off. Yeah. I don't know how why this is what this is supposed to pop. Supply box containers and perimeter. Oh, you know, it might be there cuz there's a bunch of sh bunch of guys in a shield over there. So, I'm assuming it's that. No, that's the boss. That's that bad guy with That's not what we have to loot. It looks like it maybe moved. Interception point. Yeah, see how it moved and moved the station. All right, so we're going to move. Okay. Okay, we're going to station. That's where you guys A2 B2 A1. Oh, chat. And we got the crouch working. Me and Nick got the crouch working. Oh, yeah, we do. If you have We just turned every single key by into crouch.",
            "start": 778.96
        },
        {
            "text": "to station. That's where you guys A2 B2 A1. Oh, chat. And we got the crouch working. Me and Nick got the crouch working. Oh, yeah, we do. If you have We just turned every single key by into crouch. It worked. Seize on crouch, baby. Everything sees. Uh, whoever called out that the bully was the best gun in the game was absolutely right. This thing [ __ ] rocks. Oh, thank you for that nice little deal. Jesus. I don't know who it was, so I'll just credit it to Chris Anka. Somebody in chat. How many hours of sleep did you get asked from soft serve? Who? I got last night. I got a uh I got home at about 4:00 a.m. Woke back up at 9:00, so about 5. Okay, plenty. I I set my alarm for 3:40 a.m. cuz I had to turn off my YouTube. Stop the stream. Oh [ __ ] that's funny. Shnie Mack, thanks for 55 months, Shaunie Mac. I'm riding this side far right next to the uh the main vein. I am definitely far left. We also got a Uhoh. Oh, these are just bots. We also got L nasty. Uh, you got people coming",
            "start": 832.32
        },
        {
            "text": "months, Shaunie Mac. I'm riding this side far right next to the uh the main vein. I am definitely far left. We also got a Uhoh. Oh, these are just bots. We also got L nasty. Uh, you got people coming after you right now. Get ready. Uh, that's AF people, but they did see you and you put some big shots in on people. Yeah, a little bot. Thank you to Shauny Minasty Guy. 65 months of support. Appreciate you, Guy. What are these things? What are these sealed? Oh, they're they're just props. They're just trees going to be covered up, I guess. Mike, what are you popping at? Uh, this guy way over here. Nice. This gun kicks ass. This is my favorite gun, but I do need a lot of cells to use it. All right, they're dropping in reinforcements here. Yeah, they should have my drop somewhere, too. Oh, what is this? Oh, the the botanical report, Nick, it's over here. Oh, pick it up. Oh, this is a different mission, though. I'm on a different faction now. The last one I did is for Traxxas. Yeah, I I",
            "start": 892.48
        },
        {
            "text": "what is this? Oh, the the botanical report, Nick, it's over here. Oh, pick it up. Oh, this is a different mission, though. I'm on a different faction now. The last one I did is for Traxxas. Yeah, I I agree, Jeffy. And I I think that's what they want to do. Well, we'll see. I mean, who knows? Who knows if they succeed with trying to have every season be a new adventure. Shout out to Pusco 56 months and Feisty, a first time subscriber. Mike Feisty, Feisty, welcome in, buddy. Thank you so much. Got the big guy. Nice. Great job. Nick has over 2,000 rounds of light ammo in his backpack. Yeah, I don't know why I have that. We still getting shot at. No more. Got him. I am still looking for this drop. Oh, it's coming. Literally dropping on my face right now. Oh [ __ ] Yeah. Yeah. [Music] These sound effects are insane. Sounds are [ __ ] What is happening? It's like [ __ ] War of the Worlds. We have to shoot it or what? Dropping this thing or not, Big Daddy. I think Do we have to shoot it?",
            "start": 958.72
        },
        {
            "text": "sound effects are insane. Sounds are [ __ ] What is happening? It's like [ __ ] War of the Worlds. We have to shoot it or what? Dropping this thing or not, Big Daddy. I think Do we have to shoot it? Objective update. Oh, you did it. You did it, Mike. Yeah. Well, no, I didn't. Yeah, it it departed. I think we had to shoot it down for me. I think we had to shoot the box. Did you shoot it? Did it I shot it twice? But like it I was It turned red when I put my crosshair on it. I just don't have like a fast gun, you know? Says shoot the box, people are saying. Okay, so we should have shot the box. It definitely turned red. All right. Well, y'all are here. Uh why don't you I already did my [ __ ] Uh I did not. I need to go to the pump station again. Oh, you go down to the pump station. Yeah, if we have time. If not, we can rotate out. Lord Starscream, thanks for gifting us five subs. A Starscream, thank you. I don't see a pump station on my map, so you're gonna have to reevaluate. I'll ping",
            "start": 1032.08
        },
        {
            "text": "we have time. If not, we can rotate out. Lord Starscream, thanks for gifting us five subs. A Starscream, thank you. I don't see a pump station on my map, so you're gonna have to reevaluate. I'll ping it. Uh, it's over. I'm sorry. I think it's an overflow. Wait, hold on. [ __ ] Oh [ __ ] We got another guy coming. I love this sniper, man. Woo! Through the little gap. Okay. Download the botney report from station perimeter. Sorry. What does that mean? So you're at station. So you need to go into station. Right station. Okay. Yeah. And then you got to you'll see a big ping on your screen. Yeah. The computer and then you don't know what computer to go to. Yeah. Turn around, Nick. Like to your right. It was to my left right there. You got to come inside. It was on the ground floor. Ground floor. It was It was on my map though. Like if you hit the M button and then um assuming it's the the fist maybe. No. No. Like I like I said, you go into certain buildings and there will be a giant white",
            "start": 1071.68
        },
        {
            "text": "It was It was on my map though. Like if you hit the M button and then um assuming it's the the fist maybe. No. No. Like I like I said, you go into certain buildings and there will be a giant white ping on your screen. Okay, let me show you what that computer is. I just did it. Oh no, but I was on a different I'm in a different [ __ ] faction. My bad. Okay, hold on. Maybe it's the same one. I don't know. It might be. Well, let me look around. That was [ __ ] terrifying. Guy just came out invisible in front of me. Oh yeah, those are the ghosted ones. Freaky. Oh, it was over here, Nick. I'm pretty sure. Or I just being day one. A1. Okay. That's where I just did my [Music] little might not be going the right way. Yeah, it was it was this module. Okay. No, no. Uh, resistance. Red flare means good loot and guarded. FYI, thank you. Barricade ready. Downloading bots research. I just dropped a precision rifle there. Objective complete. Activate. I don't know what I'm activating, but Anything",
            "start": 1126.88
        },
        {
            "text": "good loot and guarded. FYI, thank you. Barricade ready. Downloading bots research. I just dropped a precision rifle there. Objective complete. Activate. I don't know what I'm activating, but Anything else for you? Uh, that's it for me. We can rock. All right. I just scanned something. Cool. Give us some scam, buddy. Uh, I'm good. I still need perimeter stuff or I still need uh loot boxes, but there's none. Uh, we have the bully SMG if you want it for It's a good gun. If you want it for your secondary. Oh, no. I'm chill for now. So, wait. So, Mike, you is there any way for us to recall that thing for you? Uh, no, not at this time. If you're looking at your map, there's none of that. Oh, damn. We have a we have a cash here that we could try to find. There's a hidden items. Uh, there's a cache of hidden items near this location. Try that. May contain backpacks and data cards. Uh, you can look for the cash here. There are two question marks down at overflow if we wanted to make our move",
            "start": 1217.84
        },
        {
            "text": "of hidden items near this location. Try that. May contain backpacks and data cards. Uh, you can look for the cash here. There are two question marks down at overflow if we wanted to make our move down there. And then south relay has uh our Xfill ready to rock. You have reinforcements coming up right now. I think we Xfill. Yeah, let's get out of here. Let's Xfill. I want some. Well, I mean, we're on top of this hidden cash. We might as well look really quick. All right. Oh my god, these dudes are Well, this is Yeah. What is this? They're [ __ ] coming. Let's get the [ __ ] out of here. What is this red smoke? Oh [ __ ] You're not You're not [ __ ] around here, Mike. Yeah, they are kind. Yeah, this cash has some good [ __ ] in it. Oh, have you found it? You see it? I think we're in the building with it. Oh, you think this is it? I think this is it. These big [ __ ] these big containers. Am I wrong? I have no idea. There's massive eight time med packs and [ __ ] like that. So, maybe.",
            "start": 1276.56
        },
        {
            "text": "with it. Oh, you think this is it? I think this is it. These big [ __ ] these big containers. Am I wrong? I have no idea. There's massive eight time med packs and [ __ ] like that. So, maybe. What up, Brad? Bananas. Yeah, this thing's got it looks like it's got a ton of [ __ ] in here. Okay. Yeah, I would just uh smack that then and then we can leave. Okay. Yeah, let's get out. This is the furthest south point as we head towards the relay. Warning, reinforcements detected. You run faster with your knife out, chat. Isn't it so gorgeous? Danessa, thanks for your $2 super chat. Appreciate you. I I agree with chat that I think the exteriors, the trees, and the foliage could look more appealing. Uh, this this obviously is not the final look. [ __ ] I got eyes on me. But I do think the outside looks like, is that you firing? less than being inside the buildings. I'm coming back now, but I've already left. No, no, no. You're fine. I'm just kidding. I'm going to just get the [ __ ] out of",
            "start": 1316.24
        },
        {
            "text": "looks like, is that you firing? less than being inside the buildings. I'm coming back now, but I've already left. No, no, no. You're fine. I'm just kidding. I'm going to just get the [ __ ] out of here. I'm just going right back to you guys. Let's go. I am A1. Okay. I'm just trying to get out of this interior spot. I'm just Mike is just slowly going away from me and I'm just following his his little white dot. There you go. Yeah, you see it. I'm right. Doesn't this remind you of Destiny so much? like this shot right here just with these the the lights sort of ventilating. You know, the eight time med pack is a better version of the green pack says waddled unicorn. The eight time med pack. Huh? Yeah. Cool. The pack. Okay. So, let me So, I can swap those out then. I don't need the other one. Yeah, you can replace it with that. Okay. So, how the [ __ ] do I do that? X has been put it in that slot. Yeah, right there. Oh, wow. Okay. Move eight slots to carry more items. Can I drop this",
            "start": 1370.0
        },
        {
            "text": "one. Yeah, you can replace it with that. Okay. So, how the [ __ ] do I do that? X has been put it in that slot. Yeah, right there. Oh, wow. Okay. Move eight slots to carry more items. Can I drop this thing then? I have a nest. You could sell it, but it's only a hundred bucks. Okay, cool. And you'll have And it takes up a lot of room when it's not being utilized. Yeah. Yeah. Yeah. That's cool. Cool. Cool. Cool. Cool. Cool. Cool. Mike, you hit the button, right? Mhm. Oh, someone's on me. You actually getting shot at. Someone just shot me, huh? You got hit. I did. All right. It may just be a robot then. It's a robot right here. cuz the robots will just find the tiniest sliver of space to shoot you through. We're out of here. Nice job. Actually, I'm going to try to use this [ __ ] thing. Dude, I love this single shot gun. It is It's so nice. That was a chill easy uh uh one right there. What are you using? Are you using the precision first drop or a sniper? I don't know what it's called.",
            "start": 1419.84
        },
        {
            "text": "I love this single shot gun. It is It's so nice. That was a chill easy uh uh one right there. What are you using? Are you using the precision first drop or a sniper? I don't know what it's called. Oh, I Well, I have both. I have a sniper and then I have a singleshot DMR. Iap pat and it's real nice. That's the one that I killed the other dude with. The one that I was trying to kill you. I wish you could do like multiple things in a run. Yeah, that that's I was listening We need to be able to do that. I was Well, they won't. It doesn't sound like it. Like listening to the listening to one of the devs talk with uh Dr. Lupo recently and he was like it kind of makes sense because they want people to like just focus on the one thing that they're doing. Mhm. Um but like we're multitaskers, right? Well, we barely do one thing good. Yeah, but we do that one thing really. I don't know. That one thing really good. We barely do one thing like fine passible tech subscribing for seven months. big",
            "start": 1472.56
        },
        {
            "text": "Well, we barely do one thing good. Yeah, but we do that one thing really. I don't know. That one thing really good. We barely do one thing like fine passible tech subscribing for seven months. big backpack. Appreciate you. And a $630 pistol. We got comic Sam's 20 month says, \"I just fired at Expedition 33. I have no idea what's going on, but I'm in. Dude, you're you get so in.\" Drago gave that out a sub to Tucker. What up, Drago? Thanks for supporting. A lot of things to claim. Be claiming all your [ __ ] y'all. I'm just decryting stuff. I don't know what I'm doing. You're getting new contracts, man. I know, but there's like all sorts of cool [ __ ] happening. Talk to the pink face. Talking to the pink face. You guys are on the pink face guy, right? Cyber acne is no longer available. I'm on new caloric. Yeah. New caloric. Okay. You could do Traxxas though. That was one I was doing earlier. Oh, no. I don't understand that. That lady's face scares me. I'm going to go new caloric cuz",
            "start": 1525.68
        },
        {
            "text": "on new caloric. Yeah. New caloric. Okay. You could do Traxxas though. That was one I was doing earlier. Oh, no. I don't understand that. That lady's face scares me. I'm going to go new caloric cuz then we're on the same thing. Yeah. Right. Well, I'm one ahead of you right now, I think. Oh, okay. All right. My new caloric contract is activated. Scan sparkle leaf incubators and south relay. I'm activated, baby. I have an upgrade, though. I purchase this. Can I purchase you? Oh, what does this do? Revive speed. Actually, remember to be sending [ __ ] to your vault if you don't need it. I also had the eight time med pack that I didn't realize that I had. I'm going to put that away. Okay. Okay. I don't know what any of these. Have you guys done the individual upgrades for a new caloric or for cyberne? I've started. Yeah. Uh I don't think I've gotten there yet. You definitely have to have go in. Go back to your factions. Hold on. Let me just like it wasn't letting me click on anything. Go",
            "start": 1570.32
        },
        {
            "text": "cyberne? I've started. Yeah. Uh I don't think I've gotten there yet. You definitely have to have go in. Go back to your factions. Hold on. Let me just like it wasn't letting me click on anything. Go to upgrades. Go to go to cyberne. Cyberne had one thing activated, but like I I don't Oh, you got it. Yeah, you got explosives. But like I don't think I clicked on anything. No, it just it must have done it for you then. It must have done it when you hit the the things that you needed. Plastic filaments and [ __ ] Yeah, I think we just got to rank this up one a couple more times. I think you get micro processors. All right, so who's making fun of me for having this much ammo? [ __ ] you. [ __ ] you. [ __ ] you guys. Suck it. You don't know what ammo's like in this game, bro. Hi-tech Funk 13 months of support. So, let's go. Jirody, boys, what up? Hi-Tech Funk. Thanks for the love and support. Thank you uh to mouse for nine months of support. Ready, Nick? Uh, I got You want to hit the low or",
            "start": 1625.92
        },
        {
            "text": "of support. So, let's go. Jirody, boys, what up? Hi-Tech Funk. Thanks for the love and support. Thank you uh to mouse for nine months of support. Ready, Nick? Uh, I got You want to hit the low or the high? What's that? Do you want to hit the low or the high? Do you want to sing the low or the high? Uh, I'll sing the low, please. Yeah. Did you know that if you have Amazon Prime, you're just hitting the lower octave? Mhm. Do you want to sing the high but at the lower octave? I would like to sing the high but at the lower octave. Okay. Okay. Ready? Did you know that if you Now, now I'm confused. Did you know [ __ ] shot him. Mike just waits patiently for us. I I love Wait, wait, wait, wait mod. I want the Okay, I want another Where do you buy the [ __ ] mods, man? I need some cool [ __ ] How come I'm not I don't have any work more with the factions to get upgrades in the black market to then be able to buy that. Dude, it's so annoying. All right, you have Twitch Prime. You have Twitch",
            "start": 1667.76
        },
        {
            "text": "come I'm not I don't have any work more with the factions to get upgrades in the black market to then be able to buy that. Dude, it's so annoying. All right, you have Twitch Prime. You have Twitch Prime. You have Twitch Prime. Ready? It's not working right now. You have Twitch Prime. No, I'm off. You just do the normal one. It's just not I love what he's saying. It's just not working right now. Sometimes the antiders is off. We got to get the gum out of the shoe. What is a synchronizer? It looks cool. I don't know, but it takes up so many spots. I don't want to use it. Oh, it's unlocks. How do I like how do I do like you put in your backpack, but I don't know what you do. Go to your uh check out the upgrades. I bet with those factions, they'll probably like now if you go to upgrades and like hover over certain things, you see these are the things you need. Oh, so I'm sure you'll start needing some of those. Aardo, thank you for being a member for the past 5 months. Says, \"What's the",
            "start": 1718.8
        },
        {
            "text": "like hover over certain things, you see these are the things you need. Oh, so I'm sure you'll start needing some of those. Aardo, thank you for being a member for the past 5 months. Says, \"What's the vibe on the game? Any good?\" Yeah, we're really enjoying it. I think I definitely think that if we were going to commit, like we were going to commit to this, I would be very happy to try to screw around in this for a week or two for sure. Like I I am enjoying the simple pleasures of seeing the bar go up and unlocking more things. Uh finding a new cool weapon. Yeah. Running into people is exciting. Um Oh, you are using the precision rifle. Yeah. Oh, yeah. That's a good one. Oh yeah. Um I will say also, and this is going to be a deep cut for anyone who's out there that's my age, but I like the armor of my guy because he reminds me I did, didn't I? Oh, [ __ ] Sorry. I had to run. You guys had to write it first. Um it's your fault, am I? My guy looks a lot like a cyclone rider from um",
            "start": 1764.8
        },
        {
            "text": "the armor of my guy because he reminds me I did, didn't I? Oh, [ __ ] Sorry. I had to run. You guys had to write it first. Um it's your fault, am I? My guy looks a lot like a cyclone rider from um Rootech Army of the Southern Cross. And if you got that reference, please pop off in the chat right now. Mhm. And you were calling the Star Wars reviewers nerds. Nerd. Oh, I definitely was. Yeah. We had, for those of you guys that don't know, you can see right behind my there's a TV right here that uh we can watch programming from the studio ends. We were listening to Barrett, Tim, and Sage talk about Andor. Uh, and boy that it was so dorky. What was that comment you had you saw in the chat that was like, \"My K2SO is better than your C30 R2-D2. [ __ ] dorks.\" I am excited to watch Andor, though. I want to get I want to try to get into it cuz now that I've watched The Pit and I hated it, but then I started watching it, I was like, \"Oh, wait. Maybe I'm wrong.\" Yeah, I'm growing. Oh, nice.",
            "start": 1805.92
        },
        {
            "text": "I want to get I want to try to get into it cuz now that I've watched The Pit and I hated it, but then I started watching it, I was like, \"Oh, wait. Maybe I'm wrong.\" Yeah, I'm growing. Oh, nice. Yeah. He's not a flipflopper anymore. No, I'm a grower, not a shower. Oh. Mhm. Always be a grower, guys. Never be a shower. Thank you to Melo for Prime Gaming as well. Alex, $5 super chat. We got Feisty, a first time subscriber. Ricardo, five months says, \"What's the five on this game?\" Once again, thank you for uh becoming a YouTube member. And Levis's 28 months of Prime Gaming. I need to go to overflow. I need to go to I need to go to SC relay for me. All right, let's go to overflow first from Mike. Oh, wait. Now I have three things I have to do. Maybe I did activate three of them. No, it's just one, but I cuz I have the same thing. Why does it say Oh, it's all You can only activate one, but it's got those are all part of the single contract. Oh, wow. That's a lot of [ __ ] This guy better",
            "start": 1852.32
        },
        {
            "text": "one, but I cuz I have the same thing. Why does it say Oh, it's all You can only activate one, but it's got those are all part of the single contract. Oh, wow. That's a lot of [ __ ] This guy better [ __ ] pay me. So, sparkle leaf incubators in South Relay. We have We also have to do something here in overflow. We're looking for another Palm Pilot for me to hit and then get the code in. And me and Nick also need to scan fungal incubators here in Overflow. Okay, good. I don't I don't Annie, I'll be real with you. I don't know that I want to scan anyone's fungal incubator. Yeah, it's that just doesn't sound like a It's not a fun Saturday for me, dude. What are you popping at, Mike? Just robots. I can't take much more. You're looking for the palm pile on the wall, Mike? I'm looking for the palm pilot on the wall. Y'all are doing your thing. I need to find a fungal incubator. I've been downed by a robot. Okay, I'm coming, Mike. Uh, Mike's over there. I'm going to run from Mike and res him.",
            "start": 1901.04
        },
        {
            "text": "pilot on the wall. Y'all are doing your thing. I need to find a fungal incubator. I've been downed by a robot. Okay, I'm coming, Mike. Uh, Mike's over there. I'm going to run from Mike and res him. Go for it. Engaged. Thank you. The robots are on me. The [ __ ] you, bro? Mike's looking for the Palm Pilot. These are all biop printers. There you go. I got him. Thanks, Andy. Or you got him. But you finished. That was a good distraction. I'm put armor. We're going to put a suit of armor around the world. God, it's so good. You know why? Cuz you go like down with a little syllable that you're not supposed to go down with. And that's just so Robert Downey Jr. Oh, a blue bully. Oh, baby. What's a blue bully? The a bully SMG, but it's a blue one. Oh, that's cool. You see, I was able to loot a bully SMG. You're really getting the constipated nature of that now. If I'm being real. Thank you. All right. Uh, so we haven't found the palm pile on the wall yet. I haven't found my I haven't found the",
            "start": 1945.92
        },
        {
            "text": "SMG. You're really getting the constipated nature of that now. If I'm being real. Thank you. All right. Uh, so we haven't found the palm pile on the wall yet. I haven't found my I haven't found the incubators either. Fungal incubator. I keep looking around. chat, please link me to a picture of whatever your fungal incubator looks like at home. If you got one, let me see what your fungal do. I need to see it. Yeah. I don't even think you can request something like that. Like it's it's like bad enough for someone to just randomly do that, but for you. Everyone's of age. If you can sense, go ahead. Link me to your fungal incubator. Please don't do that. My f Can we just go back to like telling people to send stuff to Tim? Oh yeah, that was my favorite thing. Send your fungal incubator Tim Getty is a picture of your fungal incubator. It's just another version of you all giving out Kevin's phone number. Oh my god. Oh my god. That was such a fun moment. All still looking for the Palm Pilot.",
            "start": 2023.24
        },
        {
            "text": "is a picture of your fungal incubator. It's just another version of you all giving out Kevin's phone number. Oh my god. Oh my god. That was such a fun moment. All still looking for the Palm Pilot. We're still looking for a fungal incubator. I don't even know what my fungal incubator looks like. That's what I'm saying. Oh, it's got to be down here. Jesus. In in the water is Yeah, it's got to be here in this room somewhere. Has to be. Could be this. No. [ __ ] Is this thing fungal growth? It's got to be here, right? It's got to be somewhere around where I'm at. I mean, there's a bunch of Yeah, there's a bunch of like growths on the ground. Man, this I [ __ ] love the look of this game so much. It is clean, man. It's clean. The glossy the matte surfaces. Got such a freaking personality. Uh maybe. No, that's just the door to get in. Damn it. Where's the fungal incubator? We got uh robots over by mic. Yeah, we got robots arriving. I'm rapping to I'm just on the outside, but it's got to be",
            "start": 2070.16
        },
        {
            "text": "No, that's just the door to get in. Damn it. Where's the fungal incubator? We got uh robots over by mic. Yeah, we got robots arriving. I'm rapping to I'm just on the outside, but it's got to be on the inside. There's no way it's on the outside. It has to be in the inside. You okay over there, Mike? Yeah, I'm just shooting at a supply drone that I somehow found just randomly. That was big for me. Got him. Folio. Oh, I'm getting the hang of uh understanding what credits look like when you just kind of walk by credits. Increased hostile action. Window closes in 20 minutes. Where the [ __ ] is this? I mean, this looks like a fungal. Okay, maybe we got to do it in order, Nick. Oh, maybe. My shit's at the south relay then. Oh [ __ ] there's a lot of dudes. Oh, I'm down. [ __ ] [ __ ] you. Oh, Mike's here. [ __ ] You got him, Mike? Yeah, I got him. I'm good. Have you come across other players yet? Yeah, we have. And we dominated twice. Well, one on stream, one off. I'm healing real quick,",
            "start": 2134.64
        },
        {
            "text": "Mike's here. [ __ ] You got him, Mike? Yeah, I got him. I'm good. Have you come across other players yet? Yeah, we have. And we dominated twice. Well, one on stream, one off. I'm healing real quick, Mike. Yeah, I just killed one with Nick. Nice. Yeah, maybe Nick, maybe we got to go to South Relay first and do it in order. Maybe put a ping down. Let's go. I'm going to try to ask one of these new robots where their fungal incubators are. Let's go to A1. All right. Ping A1. Green A1. Yellow A1. That's not it. No, that's just a crash cart. Like I want to say it's like this thing, but Fung looks like a fridge. Looks like a fridge. Can you do it out of order is my I mean you have to be Oh, no. Well, mine doesn't. I don't know. But you you would imagine you can activate it at the very least, right? Let's just go to A1 and see what's up there. And we'll do that cuz this looks like it's very Oh [ __ ] What happened? I don't I just heard some noise that freaked me out. Oh, it was the birds.",
            "start": 2204.36
        },
        {
            "text": "right? Let's just go to A1 and see what's up there. And we'll do that cuz this looks like it's very Oh [ __ ] What happened? I don't I just heard some noise that freaked me out. Oh, it was the birds. When you run by them, they let players know you're here. That's terrifying, man. Your backpack looks so cool, Andy. Does it? Yeah, it's kind of cool. Is it the middle one? Oh, it's the one you have. Yeah, it's kind of cool. It's cool. My guy uh has like an extra sprint that generates heat. Oh, really? Yeah. It's very exciting to watch. Kevin Quelloo. Yes. Yes. Do you think he's going to beat that puzzle game soon? God [ __ ] his so just addicted to the puzzle game. I just hear him like he will. I heard him telling the Uber driver about it the other day. Does he really No, but anybody anybody who's got ears would be like play blueprints before. He looked at Kevin. He's going to tell you about it. He showed it to me one time. He's like, \"Check this out.\" And I'm like, \"It's a slow puzzle",
            "start": 2276.24
        },
        {
            "text": "who's got ears would be like play blueprints before. He looked at Kevin. He's going to tell you about it. He showed it to me one time. He's like, \"Check this out.\" And I'm like, \"It's a slow puzzle game. I don't know what I'm looking at. You're stuck in a room. It's like an escape room. Like what's going on? He's like, \"Pretty cool, huh?\" I mean, it's a genius ass game, but you're doing it. Kevin only plays good games. He doesn't play bad games. So, when he gets into a game, I know it's going to be like game of the year contention for people. Oh, fungal incubator. No. Excuse me. Do you know the way to the fungal incubators? Oh, robots. [ __ ] [ __ ] [ __ ] [ __ ] Oh my god. See you, papa. [ __ ] goat. Get off me. You don't want this. Up top, Nick. He's up in the window. Not anymore. Not anymore. He's chasing us. We're good. Okay, we're in the [ __ ] [ __ ] to the right. Oh, I see one. Y see here. Oh, so it did ping. Yeah. So, we had to do it in order then. So, one is So, it's showing",
            "start": 2326.56
        },
        {
            "text": "He's chasing us. We're good. Okay, we're in the [ __ ] [ __ ] to the right. Oh, I see one. Y see here. Oh, so it did ping. Yeah. So, we had to do it in order then. So, one is So, it's showing up on the map here. Yeah, we had to be We had to do it in order. I'm still fighting. They look like this, Andy. This thing right here. Not that it matters. Okay. Sick. Mike, is is Mike dead? Yeah. Is the guy still around you? I I killed the dude. All right. You got You're so quiet, Mike. You're so reserved. You got lost in the fungal incubator. Stop crying with me. Prepare for reinforcements detected. To be fair, it was a leaf incubator that I got lost in. I had to get that. The other one's upstairs, Mike or Nick. Oh, I see it. There we go. Oh, you got it. Well, me doing it won't count for you. Remember that? Oh, I thought it did. I thought Mike said it did. I don't know, man. We No, no. Now you're you're not you're not sharing that stuff anymore. Well, I mean, I can't see Nick, right? You kicked",
            "start": 2388.56
        },
        {
            "text": "that? Oh, I thought it did. I thought Mike said it did. I don't know, man. We No, no. Now you're you're not you're not sharing that stuff anymore. Well, I mean, I can't see Nick, right? You kicked me out. What does it say? No, it's right. It didn't work for me. So, yeah, you're on your own stuff. Where is it, Andy? Uh, it's right here. Here I just cool. Those two are done. Now we can go to overflow. Bad guys. Real guy right here. Oh, [ __ ] me. I'm hiding my tracking. Track out. Two confirmed. Okay, I see him. I see him. Ping. I don't know how to get out of this [ __ ] building. I'm going to try to use my gun. My cool thing. I lost him. Lost contact with him. He's not in this area. Well, this is a waste now of my special. That's all right. Come this way, Nick. He must have gone this way. All right. Well, we got to go to the um perimeter or to overflow. Okay. Why don't you look at the map really quick and ping which direction? C3. Yes. All right, let's head C3. No, he's right here.",
            "start": 2438.72
        },
        {
            "text": "All right. Well, we got to go to the um perimeter or to overflow. Okay. Why don't you look at the map really quick and ping which direction? C3. Yes. All right, let's head C3. No, he's right here. Broken him super low. Nice job. First him. Anyone else? Mike, see anything else? Well, I mean, I'm dead, but no. Well, you can still look your [ __ ] eyeballs. I'm [ __ ] trying my best here. I'm the one that can shoot. You're holding your chi. Oh, dude. He's got a bunch of stuff. I have no more room. I [ __ ] broke that guy. No love for me. Put no clip in that guy. Great job. I mean, it would have been great if you put him down. I had to clean up. Nick gets the [ __ ] clean up. He's over here like he did. Great job, Nick. Great job. Great shots. Way to go, Mike. Great job, Mike. Great job, Mike. Oh my god. All right, let's keep going. What a guy gifted a sub to rapid. What a guy. What a guy. What a guy. What a guy. What a mighty good guy. A mighty mighty good guy. really off key. Oh [ __ ]",
            "start": 2495.04
        },
        {
            "text": "Oh my god. All right, let's keep going. What a guy gifted a sub to rapid. What a guy. What a guy. What a guy. What a guy. What a mighty good guy. A mighty mighty good guy. really off key. Oh [ __ ] where am I going? [ __ ] I just start running in the wrong direction every single time in this game. I got to go to C3 overflow, right? Yeah. Are we going the right way? Yeah, it's all of us are Oh, I was like I didn't Mike goes back the other way. I was like, what are you doing? He's [ __ ] looting this guy's body. Look at you quiet little looter over there. I'm just looting it. Well, you guys you guys all got to turn. It's my turn now. Yeah, get on the guy's back, dude. I got Oh, I got Bang this dude's dead corpse. He had to bang that guy's dead corpse, man. Too bad for that kid. He really thought we uh left him. Oh yeah, Mike, you're like a blood hound, dude. You really kind of We went after his asses, right? He was like, \"Oh, they left me. I'm good. I'm good.\" And then me and Mike just",
            "start": 2553.68
        },
        {
            "text": "we uh left him. Oh yeah, Mike, you're like a blood hound, dude. You really kind of We went after his asses, right? He was like, \"Oh, they left me. I'm good. I'm good.\" And then me and Mike just circled around and got his ass. No, we're going to continue to And Barn Dog 42 months of support. Thank you, Barn. A1, right? I'm still moving towards A1. Yeah, A1, C3, whatever. 33PO remember you have your boost Nick to get you across [ __ ] faster. O um it says I got an email and then after I got the email I had to finish registering. Yeah. So make sure you check that that bungee site where you see your uh your your like code inventory. I forget what check your promos and spam as well. I think mine mine went into like my promos part of the Oh yeah. All right, Andy. I got the first one here. Sick. Oh, and I got the second one. Cool. Oh, it's downstairs. Okay. The first one's downstairs. No. Uh, one's downstairs, one's upstairs. Oh, okay. I got a robot. Got it. More robots here. Got it. Is this",
            "start": 2601.68
        },
        {
            "text": "Oh, and I got the second one. Cool. Oh, it's downstairs. Okay. The first one's downstairs. No. Uh, one's downstairs, one's upstairs. Oh, okay. I got a robot. Got it. More robots here. Got it. Is this a robot? Oh [ __ ] it is. What the [ __ ] He was He was like not moving. the stab in the [ __ ] neck. He was stuck. I had to let I had to free him. That was crazy. That scared the hell out of me. I was like, for a second I was like, is this an NPC that'll like talk to me? That's crazy. Oh [ __ ] Oh my god. Oh my god. Oh my god. I need to go invisible. Camel filter engaged. I'm crazy. Holy [ __ ] Oh [ __ ] Holy [ __ ] Okay, I just needed to not do that. I really got to figure out which button is which gun. Three is always your knife. So, if you just one and two, maybe just put it on your side buttons on your mouse. Yeah, that'd be a good idea. Stupid. Don't do that. Don't be dumb. Mike, your mouse button is always your either melee and then my melee for some reason is dropping my grenade",
            "start": 2657.44
        },
        {
            "text": "buttons on your mouse. Yeah, that'd be a good idea. Stupid. Don't do that. Don't be dumb. Mike, your mouse button is always your either melee and then my melee for some reason is dropping my grenade at the same time. Every time I melee something up, I swear to God, that's definitely not the same button. I don't know if this is just me being dumb or Yeah, I think so. Okay. No, but like check it. Every time I hit two or three, it brings up a different gun. I swear to God. Like one one and two and three just completely are interchangeable at this point. It's an alpha. It's not It's not for me. Fair enough. Uh okay. Uh the second one down here. Yeah. Oh [ __ ] Oh my god. This God damn, man. Some of these guys are just just coming at you, dude. Just here's the weird one. We still haven't found that Palm Pilot that's supposed to be here for my mission. It's crazy to think about. Oh, where's this? Well, I mean, I think me and Nick were just preoccupied with getting our ass whooped, who I",
            "start": 2720.72
        },
        {
            "text": "that Palm Pilot that's supposed to be here for my mission. It's crazy to think about. Oh, where's this? Well, I mean, I think me and Nick were just preoccupied with getting our ass whooped, who I haven't really been looking for a pawn pilot here. Oh, no. I've looked the whole entire time we've been Oh, really? Okay. We're like coming up on like about 7 minutes spent here. Mike, I think it's I think Are you sure you don't have an objective you have to do prior to that? No, no, no, no. I'm doing something completely different. All right. I'm doing my last incubators, then I have to go choose. Oh, we got hostiles. We got real people here. Get ready. I've just been pinged. I'm sending out my pings. Be ready just in case if they come near me. I got nothing on my pings right now, but I was pinged, so be prepared. Nobody believes. I found it at 799. It was outside. That's crazy. I need to go to the south relay after this. I've been hit. I'm getting hit by something by bots. I think Nope. I'm",
            "start": 2772.96
        },
        {
            "text": "so be prepared. Nobody believes. I found it at 799. It was outside. That's crazy. I need to go to the south relay after this. I've been hit. I'm getting hit by something by bots. I think Nope. I'm just getting hurt. Weird. I'm coming. I'm coming. I just went down. Not a sight at all. You got him, Andy? Yeah. Oh, I stopped looking at you. God damn it. You good? [Music] All right. So, seven. What? times. Uh 799. Okay. It's not. Let me double check really quick. It's right around this corner. Uh it's 799. You see all the little white ones up on your screen? That's what we're looking for. Little white ones up on our screen. Oh, I see. Okay. All those little pink. You got that one over there, Andy? Yeah. We're looking for 79. The one the one I think I was going to is not on the ground level. We're also still being mindful because it could I got it. I got it, boys. Don't worry. Oh, nice. Be mindful that people still could be around us. Like I said, I was pinged. So, what does it tell you?",
            "start": 2814.2
        },
        {
            "text": "We're also still being mindful because it could I got it. I got it, boys. Don't worry. Oh, nice. Be mindful that people still could be around us. Like I said, I was pinged. So, what does it tell you? How it says you've been pinged by an enemy cuz like how did they not ping? I see him. I see him. I see him. I see you. There's someone over here. Ping it. Ping it. Ping it. Someone's running. Oh yeah, real team. Everybody get together. Oh yeah, I see him. I'm above Nick. Careful here. Right here. More pings. Reinforcements detected. Oh yeah. Oh, big snipe. Well, they're about to fight some robots. They're fighting me out here. Reinforcements detected. Oh yeah, they're fighting robots. I hit one of them really hard. I'm getting up. Shot one of them really hard. I got a far one way out there. One really close. Do we have objective? Oh [ __ ] The one really close is on me. God damn it. No. [ __ ] I got [ __ ] I did not know that dude. Oh, dude. You were over there. Oh, [ __ ] Yeah, you got I",
            "start": 2878.56
        },
        {
            "text": "really close. Do we have objective? Oh [ __ ] The one really close is on me. God damn it. No. [ __ ] I got [ __ ] I did not know that dude. Oh, dude. You were over there. Oh, [ __ ] Yeah, you got I was c Well, they were the dude that I was shooting at was where you were looking at and then the other one circled me. Nick, these guys are kind of nasty. Yeah, Mike, let's maybe we bounce or do you want to try to take Let's back up and see if we can just go get Andy Flunger. Yeah, this dude flanked the hell out of going all the way out here. Nick, I downed I think I downed the guy that killed Andy, but they're probably resed by now. Okay, I sniped to the guy who was playing I'm going to wrap. I'm going to wrap hard to the right. Maybe we just wait and see if they just like forget about us. Maybe they died to bots, too. Who knows? They seem pretty good, though. I'm going to wrap up and then around. I got Mike switching cameras at his feet, chat. I'm trying my best. Someone shooting. Someone",
            "start": 2932.4
        },
        {
            "text": "they died to bots, too. Who knows? They seem pretty good, though. I'm going to wrap up and then around. I got Mike switching cameras at his feet, chat. I'm trying my best. Someone shooting. Someone shooting. It's not as easy as I thought it would be just because of how it's placed. I bet that all three of those guys are huddled on Andy's body right now, just waiting for us. And I'm out of grenades. That's all right. Just take it. You have your alult, though? I do have my alult, actually. Hold on. I'm going to activate my now. Search and destroy online. I see him. Yeah, they're still on Andy's body. We should split up a little bit. Yeah, you stay there. Let me go higher. I don't know how to use this [ __ ] alt though. What do you see? Mike's on. Nick's on him. Oh, Nick. I I down him. I down him. Mike, get up here. Thirst this kid. Give me some pings. There's another kid right here. Right here. See it? Ping it. Ping it. Sing it. Ah, he's on. He's on there. There's two kids, too. Back",
            "start": 2973.6
        },
        {
            "text": "him. Mike, get up here. Thirst this kid. Give me some pings. There's another kid right here. Right here. See it? Ping it. Ping it. Sing it. Ah, he's on. He's on there. There's two kids, too. Back off, Mike. Back off. The other guy is to the far right. I don't know how to use this [ __ ] alt. We should have gone up top. Mike, you're playing a dangerous game right now. My friend's going to be left, Mike. They're just They're just standing there. No, you're not. To the right of that blue building right there. Oh, yeah. He's got a nasty sniper shot. 5 minutes remain. Just going to stay with you, Mike. Sorry. That's all right. We're just trying to find the right time for I just need to figure out this [ __ ] alt, guys. They're coming, Mike. Yeah, they definitely res at third by now. It moved. They moved. Yeah. They've moved inside. Be prepared. I say we get the [ __ ] out of here. Can you put down your smoke? Oh, you brought me back. What the [ __ ] Oh, I'm ding your boat back. Into the",
            "start": 3038.16
        },
        {
            "text": "They moved. Yeah. They've moved inside. Be prepared. I say we get the [ __ ] out of here. Can you put down your smoke? Oh, you brought me back. What the [ __ ] Oh, I'm ding your boat back. Into the dark. Oh, they took all of my [ __ ] you [ __ ] Did they take my [ __ ] too? No, they didn't take any of my [ __ ] Holy [ __ ] I'm going up this hill to just try to get space. [ __ ] Hold on. Okay. Okay. Okay. You're going left side. Yeah. I right where purple ping. I've just moved on. Those guys were super cool. All right, let's push the mic. They didn't take any of my stuff. How nice of them. No, Chad. Nick knows what the ult is. He knows what the alt does. He doesn't know how to activate activ. It shoots out like homing missiles to people, but he doesn't know. Like one of you needs to ping the ex the extraction. Oh, I need to get one more objective down. No, no, no. We have 3 minutes. A1 A1 A1 A1 A1 a Yeah. I mean, that's the closest one. I mean, sorry. There's two A1 pings right now on",
            "start": 3104.32
        },
        {
            "text": "ex the extraction. Oh, I need to get one more objective down. No, no, no. We have 3 minutes. A1 A1 A1 A1 A1 a Yeah. I mean, that's the closest one. I mean, sorry. There's two A1 pings right now on the screen. Oh, go a That's the closest one. The one in the middle. I don't know if we could fight back against the No, we're not fighting robots that pop up. You can revive someone who is down. Yeah. Yeah. Even if they get fully killed. You can still res. Prepare for increased hostile detected. Yeah. Nick's character has the double sprint thing. It's pretty cool. Just It also has that like charge. Isn't it great, Resky? Isn't it incredible, man? What's the best way to get there? I guess far right. Be prepared. They could be on our right hand side. Yeah, cuz they're probably trying to Xville as well. U reinforcements. Remember, you're a knife, you run faster. Got a bot to the right. I think we just run. Do you think kids skate on this after hours? [ __ ] yeah. What runner is Nick? He's the",
            "start": 3165.28
        },
        {
            "text": "well. U reinforcements. Remember, you're a knife, you run faster. Got a bot to the right. I think we just run. Do you think kids skate on this after hours? [ __ ] yeah. What runner is Nick? He's the big one. Yeah, got the shield. This might not go well for us, boys. This is going to be cutting it real close. Minute and a half. I think we can do it. We're like right here, Mike. Not here. 40 minutes. Unless we clash with anything. I don't have my ultimate for another 60 seconds. So, we're just going in blind. Link on the way. What's the timing? I cannot believe those guys didn't find Mike. That's crazy. You hitting that little crate. Yeah. I wonder if they were just like, \"Get the [ __ ] out of here.\" Or cuz I downed one of their guys. Look at these robots. They're freaking out. They're having sex. Oh, I freed one of them up. 30 seconds still. I'm just looking out these hills. We have 40 seconds. This isn't Oh, there we go. Oh my god, what an insane combo there. I think if we all get in",
            "start": 3223.92
        },
        {
            "text": "sex. Oh, I freed one of them up. 30 seconds still. I'm just looking out these hills. We have 40 seconds. This isn't Oh, there we go. Oh my god, what an insane combo there. I think if we all get in the circle, it goes faster. What was it again? From in the circle, it calls it. Yeah, it does. It went from 30 to 10 from Yeah, it will go from 30 to 10 if we hustle. That's smart. I'm going to live forever. That's so sick. Yeah, that wasn't bad, dude. That's a great Hey, you [ __ ] survived, Mike. Mike, we all survived. You're the hero. All that matters. [ __ ] You can loot any bodies you want from now on. We had a good good job right there. We got a kill and uh we uh we survived that. A strong team that definitely wanted to check us. They definitely got We didn't get to do all of our missions, but I don't give a damn cuz I didn't they didn't take my guns. That is true. Oh yeah. Does everybody got their stuff? Yeah, they didn't take [ __ ] from me. I think they were just so panicked and",
            "start": 3314.72
        },
        {
            "text": "but I don't give a damn cuz I didn't they didn't take my guns. That is true. Oh yeah. Does everybody got their stuff? Yeah, they didn't take [ __ ] from me. I think they were just so panicked and were trying to heal and freak out. That's a bummer cuz now we can't do I have to just do that one thing. That's it. Yeah, I guess I could just act. I guess we might as well just do it. Cool. Okay, so Oh, you know what? They did take my They took my bully. They replaced their They had a normal ass basic ass bully. I had a blue bully. The shitty one. That sucks, dude. I'm sorry. It's all good, man. It is what it is. Mike saved the day. Mike saved the $600 pistol I still haven't shot. I'm excited to see what that looks like. You got to shoot that, Mike. You got to learn how to use your alt. Chat, how does he use his ultimate? How the hell do I use it, chat? I think it was a flawless run, Jake. I don't know about you. Uh Ken J gifted us up. Thank you, Ken J. Kenj freaking uh rewarding the the",
            "start": 3374.32
        },
        {
            "text": "how does he use his ultimate? How the hell do I use it, chat? I think it was a flawless run, Jake. I don't know about you. Uh Ken J gifted us up. Thank you, Ken J. Kenj freaking uh rewarding the the flawless run where no problems were had. And did you figure out what the synchronizer does? Access control unit for USC group ground troops a faint rhythmic. Oh, Mike was saying that that it's probably under the factions tab where you do like your load your uh upgrades that he thinks it's one of those things that's used to like uh Yeah, I mean you can you can literally see it see usage when you read in the middle cyberact upgrades neuro or neuro caloric uh vendor unlocks right so like those are just going to be part of your upgrade stuff. So you just leave it in your vault for now. No. Okay. So we don't need it. Okay. I'm ready ammo. Ready to rock the restroom while you get off. You can go ahead. Well, let's take a moment. Hit that uh hit that ad button. Hey chat, we'll be right back after",
            "start": 3413.52
        },
        {
            "text": "we don't need it. Okay. I'm ready ammo. Ready to rock the restroom while you get off. You can go ahead. Well, let's take a moment. Hit that uh hit that ad button. Hey chat, we'll be right back after a word from our sponsors. Everybody's going to pee. This episode's brought to you by Imperial. We've told you all how important it is to developers to wishlist games you're interested in on Steam. So, if this game sounds cool to you, make sure that you wishlist it. In Imperial, you play as a mercenary sent to a distant planet to discover the mysteries of an ancient civilization. Powers unknown lie within the monolith, but those are no mere ruins as an expedition has already ventured inside with only a few survivors. Why was it built? What powers reside within? Who is at the center of the monolith? All these secrets and more will be uncovered if you are brave enough to take on Imperial. Imperial features a unique blend of RPG systems and skill-based combat across three weapon archetypes.",
            "start": 3459.36
        },
        {
            "text": "All these secrets and more will be uncovered if you are brave enough to take on Imperial. Imperial features a unique blend of RPG systems and skill-based combat across three weapon archetypes. the acrobatic glaive, the defensive but devastating mace and shield, and the powerfully ranged cannon. With a deep ability system, and extensive customization, every battle is an opportunity to refine and optimize your combat style. Form relationships with each of the few surviving expedition members who all have their own personal quest lines. Whether you choose to help or not can have drastic consequences for them. The monolith is guarded by powerful automatons, each with distinct attack patterns and weaknesses that demand precise execution and strategy to be victorious. Create your mercenary, enter the monolith, learn powerful abilities, defeat the automatons, and uncover the secrets that lie within Imperial. Imperial is available May 8th on PC, Xbox SNX, and PS5, but you can wishlist now. Do",
            "start": 3504.0
        },
        {
            "text": "the monolith, learn powerful abilities, defeat the automatons, and uncover the secrets that lie within Imperial. Imperial is available May 8th on PC, Xbox SNX, and PS5, but you can wishlist now. Do it. Wishlist Imperial. This episode's brought to you by Arafmes. If you haven't called your mom in a while, here is your reminder to do it. But then, if you want to go above and beyond, Mother's Day is coming up and I have the perfect gift idea. Our frames are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preload it with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special, they'll use it every day. Trust me, Gia's dad does. Greg and Kevin and a ton of people here at Kind of Funny are obsessed with their Aura frames. It takes about two minutes to set up a frame using the Aura app and I know that from experience. Aura has a",
            "start": 3554.8
        },
        {
            "text": "and Kevin and a ton of people here at Kind of Funny are obsessed with their Aura frames. It takes about two minutes to set up a frame using the Aura app and I know that from experience. Aura has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting aframes.com to get $35 off plus free shipping on their bestselling Carver matte frame. That's a frames.com. Promo code kind of funny. Support this show by mentioning us at checkout. terms and conditions apply to Hello everyone and welcome back to our uh playthrough of or play I shouldn't say play through our uh playing of Marathon. Thank you guys so much for joining us and thank you for everyone in the chat who is trying desperately to figure out how my alt works. Uh it says let's see a couple people here have said that I need constant uh vision on the target. Yeah, that makes sense cuz I think it locks on. You have to stay but I don't know how long I don't know if I can activate it midway",
            "start": 3601.76
        },
        {
            "text": "people here have said that I need constant uh vision on the target. Yeah, that makes sense cuz I think it locks on. You have to stay but I don't know how long I don't know if I can activate it midway through. It will lock on any distance you can see the target. He just has to shoot it with bullets three times to have the missiles fire. Oh. Oh. Oh. Okay. So, if I lock if I have that locked on and I'm shooting at a real life enemy, not a robot, will it shoot? That sounds right. That sounds good. Yeah, that's cool. Mike, I figured it out. Oh, talk to me. If I have my alt activated, if I shoot a target three times, it'll shoot a missile at it. Okay. So, yours is similar to mine of like when we see somebody, that's when you pop that and then start shooting. So, our alts are see something, say something. See something, say something. Just like that. If you see it, ping it. Like we've talked about seeing. We got We got to get a little bit better with the pings. But the communication is going",
            "start": 3645.52
        },
        {
            "text": "See something, say something. Just like that. If you see it, ping it. Like we've talked about seeing. We got We got to get a little bit better with the pings. But the communication is going well. The missions have been going well. Uh I would say so far so good on today right here. What's the plan here, Mike? Uh well, you're going to go pee. What's the plan? Land, look, loot, locate. I love the the four L's, bro. The four L's. Damn. I didn't know those are still around, man. You got to have that in your life. And the fifth one was lose. Yeah. We're not talking about the fifth one. The fifth one's a secret. That's the secret to the fun is you lose every time. Is that for War Zone? Yeah, that was for War Zone. We don't know. We don't know when Pokemon is coming back, but it is coming back. It's not abandoned. Oh, we know. Oh, it is. For my birthday. I have one I have one request for my birthday and that's Nick to beat this [ __ ] Pokemon. Okay, nice. So, we will we will force him to play",
            "start": 3691.12
        },
        {
            "text": "not abandoned. Oh, we know. Oh, it is. For my birthday. I have one I have one request for my birthday and that's Nick to beat this [ __ ] Pokemon. Okay, nice. So, we will we will force him to play on my birthday which is May 7th. That is two weeks from now. Uh he has no excuse and he has to give me my birthday presents which is Roger needs to throw you a party, right? Yeah. Well, Roger owes me a pair of shoes cuz I ran that marathon. Did you? You have the metal. It wasn't a marathon but it was a marathon. Kevin didn't do the math right. Awesome. What What's the thing you got a medal for that you didn't run? That was a real marathon, but I didn't. That was a legit marathon, but I never ran I never ran it. Yeah, that's crazy. They just sent medals for they just give me back the money cuz you know they didn't want to give back the money. That's why they had to send a course. You know what I mean? Gift is right. So yeah, we will uh we will do my birthday. I have told him that my one",
            "start": 3734.72
        },
        {
            "text": "you know they didn't want to give back the money. That's why they had to send a course. You know what I mean? Gift is right. So yeah, we will uh we will do my birthday. I have told him that my one request for my birthday is Nick to beat this. So he will not have any excuses. There won't be any ifs, ends, or buts, right? I'm really liking Void. I'm I'm finding a lot of utility in like the Goon Invis the Yeah, the smoke is big. Yeah, the smoke is uh big. I played with Drago, OP, and uh Pontton last night and we had Void out there and I don't know which one of them was, but it was a lot of smoke and that is the move for sure. A lot of smoke. smoke for resing even there at the end for X filling, you know. Yeah. Yeah. Yeah. Just How How long is that cool down though? Um it's like 2 minutes, I think. Yeah, it's a good It's a good while. It's a long time for us. You ready up? What are you doing? Oh, sorry. I didn't know I didn't know if we were going to go without him. My bad. I'll be back.",
            "start": 3778.0
        },
        {
            "text": "think. Yeah, it's a good It's a good while. It's a long time for us. You ready up? What are you doing? Oh, sorry. I didn't know I didn't know if we were going to go without him. My bad. I'll be back. I still have a weird mission. These loot crates. I found one in the sky. They're just randomly flying. That's the one that you were calling in. You know, I guess, but it just says just says loot loot crates. It's a weird one. We definitely saw the one that we were trying to get and I shot it twice. Not shoot that. That sucked. We'll have to do that again. And it definitely was. Have you used a slam junk to smoke much, Andy? No, I haven't tried that yet. The slam jump is something that I don't even know how to how to fully activate yet, but I'll Are you wearing that cuz you're feeling it right now on your wrist? Are you wearing that cuz like you're just hoping you won't feel it tonight? Um I want to see if if I wear it a lot. Will it help me in the long run? Cuz I You're wearing this at",
            "start": 3830.64
        },
        {
            "text": "now on your wrist? Are you wearing that cuz like you're just hoping you won't feel it tonight? Um I want to see if if I wear it a lot. Will it help me in the long run? Cuz I You're wearing this at home as well. Only at night when I sleep. But not when you game. No. Why not? Cuz like it doesn't hurt and it doesn't feel weird. But like lately I have been feeling leather finally. Lately I have been feeling like it's like becoming sorry like a nuisance like a soreness you know. Yeah they got creams. They got cream. It doesn't even hurt. I got a ping at B2 is where I need to go. Another one of those calling things. I still got to do the stupid last thing at the south. So we still need to go to Unicorn. Thanks for giving out three subs. We'll go south to south. Let's go south first. Oh what are you going to do first? We go to B2. We call in the cargo bot. So, we look for the Palm Pilot for me. And then we go to South Reley. Copy that. I ping. And remember the cargo bot. It's a big ass. It's",
            "start": 3879.6
        },
        {
            "text": "you going to do first? We go to B2. We call in the cargo bot. So, we look for the Palm Pilot for me. And then we go to South Reley. Copy that. I ping. And remember the cargo bot. It's a big ass. It's that big ship that we Well, that's a two. We got to do two parts. Oh, okay. We call it in first, then we go to a different area and shoot the We need to get on the same factions here. Um, I'm just letting you know. We can double up either. We can't double up. No, but we all just in the same thing. We get in, get out. But we can't double up. Well, Mike's just making us waste time. Yeah, we can. He's saying because I'm on a different mission. He's doing a different mission, so we're wasting time with him. Oh, I don't think we are. Well, I mean, I'm still having a great time. Don't get me wrong. He wants to complete his mission to move forward. 799. Mike, I got 79. I like that. I like that. I got 557. I got a 06. Show me where this thing is. Yeah, if I find it, I'll let you know. I'm seeing",
            "start": 3927.04
        },
        {
            "text": "He wants to complete his mission to move forward. 799. Mike, I got 79. I like that. I like that. I got 557. I got a 06. Show me where this thing is. Yeah, if I find it, I'll let you know. I'm seeing the red ones. Those are the ones we go to second. We got to find the first one. It's on an all black monitor. Have numbers right across the front. Yeah, the first one looks like the red screen, Nick. It just isn't surrounded by the red like console unit. Damn, look how good this looks right now. Is it on me? No, it is. Man, Mike's just good with it. It just looks so good. I just got a candy bar for $225. Better be some good [ __ ] protein. Yeah, dude. That's good. That's good. That's good. Can I eat it? No. A well-loved candy bar. I I'll tell you what. I could You want some this moment right now? I could play this game with you all night. Do you guys [ __ ] around with the claymores at all? I'm down. Uh the claymores I have not I only play once. It's an awkward spot. But when I watched",
            "start": 3967.12
        },
        {
            "text": "now? I could play this game with you all night. Do you guys [ __ ] around with the claymores at all? I'm down. Uh the claymores I have not I only play once. It's an awkward spot. But when I watched their live stream, like pro players or two of the devs were talking about how they would often holster themselves into rooms by pushing teams with just a shitload of claymores. Boys, I have no idea where that is. How did you know I was here, sir? Guess we were closed. [ __ ] off. They're robots. And door was closed. The robots just know, bro. Unless Nick activated something. I did not. I did not. No. Don't forget about the vents. Have you guys been traveling in vents yet? Oh, yeah. No, I got thrown off that cuz I kept getting stuck in Monaco, too. Man, [ __ ] Monaco, bro. What a fun time. That's a good I found it, boys. All right. So, all right. Look around. Come to me. No. No. Really quick. Just so Yeah. I just want to know what the hell this thing is. I'm downstairs. Uh yeah. I want you",
            "start": 4024.24
        },
        {
            "text": "a good I found it, boys. All right. So, all right. Look around. Come to me. No. No. Really quick. Just so Yeah. I just want to know what the hell this thing is. I'm downstairs. Uh yeah. I want you to see it. Like you'll notice how everything you've seen so far is covered in a a red cover. This one is just a straight up blacked out team. Hold on. I'm I I'm so slow right now. Yeah. You're good. You're good. All right. Where are you? You're all down. Uh yeah. I don't know what you I see. I see. I see you. You're fine. So see this up here. Oh yeah. So walk up to that. Scan it really quick. Ooh. 511, Andy. So, see how you have a bunch of white pings all around you? Yeah, I see. Yeah. So, those are the ones that could be 5'11. We're not doing anything but 5'11. Okay. But now that I did it, does it matter? Don't you have to do it now, too? No, I I need the final thing. I found it. I'm doing it. Annie's got it. All right. Anny's got it. So now if you look at your map right this blue marker",
            "start": 4072.8
        },
        {
            "text": "it matter? Don't you have to do it now, too? No, I I need the final thing. I found it. I'm doing it. Annie's got it. All right. Anny's got it. So now if you look at your map right this blue marker has moved to overflow where we will we will finish this. So let's go down to south rally south relay as fast as possible and then I'll start moving to overflow. Are we're going to south relay for what? For my for yours and my last. Oh yeah the let's get this off our plate. This is like our last email that we just got to [ __ ] get done. Reinforcements detected. Reinforcements are coming in. Everybody move. We're going south relay. Don't stop. Bust out your knife. remember. Good call on the knife. Good call on the knife. I'm sorry. It's about the Halo Reach DMR, dude. It feels a lot like it. Cam, it rocks. I do agree with a lot of the other feedback though is that the, you know, you can't put anything too game-breaking into the game when it comes to the different runners and their ultimates,",
            "start": 4118.44
        },
        {
            "text": "it rocks. I do agree with a lot of the other feedback though is that the, you know, you can't put anything too game-breaking into the game when it comes to the different runners and their ultimates, but the abilities seem kind of basic so far. Like go invisible or ping enemies. Like there's there's not a whole lot that feels special, but then if you try to get too special, then it's like that. So OP got to keep it super basic. Yeah, right. But that's why I kind of wish that like there weren't classes. I wish it was just you create your dude and maybe you pick uh you guys have to be smart over there cuz I have to go and get this cargo. Yeah, we'll be we'll sneak it. Yeah. Yeah. Upload data. Do you see it, Nick? No, I'm just just getting over there. [ __ ] you, dude. Jesus. Oh [ __ ] Sorry, I'm getting I'm in the middle of a [ __ ] Uhoh. Bot on me. A bot zombie. Careful. I got downed. [ __ ] Damn it. Sorry. Are you at South Relay or are you out uh somewhere else? I was on the way to",
            "start": 4167.32
        },
        {
            "text": "I'm getting I'm in the middle of a [ __ ] Uhoh. Bot on me. A bot zombie. Careful. I got downed. [ __ ] Damn it. Sorry. Are you at South Relay or are you out uh somewhere else? I was on the way to South Relay. Mike, you're probably closest to me. I'm not at South Relay. Oh, yeah. You pass South Relay. Oh [ __ ] Is that what happened? Okay. Yeah. I was just kind of running toward Mike. Oh [ __ ] I got to get this [ __ ] Andy. I'm running up the hill for you. Yeah. Oh. Oh [ __ ] man. Oh [ __ ] Drop kick tando. Thank you for that 27 months. We're certainly going to try to bring extraction shooters main mainstream. Come on. We have the audience and we have the power. Got it. Supply intact. Oh, you you got to get that box in, Mike. Yeah. Good job, Mike. It takes a lot of bullets to pull down. I've died, though. Oh, [ __ ] They drop. So, they'll drop a lot of people on you. So, let's go to Mike then. [ __ ] this. Wait, we're right here. Well, we can come back to that. Okay, let's go. We",
            "start": 4233.52
        },
        {
            "text": "I've died, though. Oh, [ __ ] They drop. So, they'll drop a lot of people on you. So, let's go to Mike then. [ __ ] this. Wait, we're right here. Well, we can come back to that. Okay, let's go. We don't Xfill with my stuff. Oh, I see. I see. I see. I mean, this is my mic's just like holding us back. Andrew, I'm holding you back from [ __ ] reading that goddamn computer screen. I just need I have a thing. It's not even It's like zero out of one. It's so sad. Come on. What the [ __ ] Really? We played We streamed Dark and Darker one time. Couple times. Yeah. Remember we got together? There's a real team fighting those robots dead ahead of me. Oh, [ __ ] me. Going to need you right there. And then let's prepare for this. Oh yeah, you can see them right there. I see him. I see him. Let's third party this team. Are you sure? Oh yeah. Hold on. There's a bot behind me. Let me kill it. Well, let let the reinforcements go after the dudes. Well, now we have reinforcements to the left, so we're",
            "start": 4300.48
        },
        {
            "text": "party this team. Are you sure? Oh yeah. Hold on. There's a bot behind me. Let me kill it. Well, let let the reinforcements go after the dudes. Well, now we have reinforcements to the left, so we're about to get pinned. Real guy. Real guy. Real guy. [ __ ] That was a real guy. It's an Andy character. I Why are you so far, Nick? God damn it, dude. Cuz he was shooting at me from behind. It took you that long to get over here. No, I thought it was a bot, so I didn't tell you guys. I was like, \"Oh, it's just a bot, but the guy was creeping up on me.\" He's right there. It's just one dude solo. Dooo. Mike, you're going to you're you're rotating right back. I'm trying to find him. That's right. He's over by like Nick's body. I see him. That's a different guy. There's two guys then. That's a different one. I I I I hit him. I don't know if I knocked I got one. I just thirsted him. I got Nick. Yep. Oh, you got another one. Nice. I'm going to res Nick. Did you see the Andy character? Yes, I got I",
            "start": 4354.16
        },
        {
            "text": "one. I I I I hit him. I don't know if I knocked I got one. I just thirsted him. I got Nick. Yep. Oh, you got another one. Nice. I'm going to res Nick. Did you see the Andy character? Yes, I got I got the Andy character. I killed the glitch character. That [ __ ] probably took my gun. I don't think he had time. I'm watching where we came from, Mike, just to see if anybody's Yeah, this guy's got a lot of [ __ ] These guys both have a lot of [ __ ] I'm just more worried about that loot box. All right, we're good. Let's go get it. We'll go get it. This guy had three guns on him. [ __ ] All right, let's go get it, Mike. I'm going to just go get eyes on it. See if it's still there. Yeah, the box is still there. Oh, the big old crate. Yeah. I wonder if maybe that team died of bots, dude. I mean, the bots are still here. They're very I mean, the bots are crazy. They very much were. Could still be in this building as well. That's Should I kill this bot? Well, we're going to kill. No, don't",
            "start": 4404.72
        },
        {
            "text": "the bots are still here. They're very I mean, the bots are crazy. They very much were. Could still be in this building as well. That's Should I kill this bot? Well, we're going to kill. No, don't shoot. Don't shoot anybody yet until you get shot at. Oh, he's shooting at me. Oh, the bot Oh, the bot is already shooting. Okay, then yeah. Shoot at him. [ __ ] All right, I'm definitely going to use my thing now. Oh, there you go. Do it. Destroyer system. Oh, they're dead. Let's jump. Well, that was a waste right here. I can't take once more. Us reinforcement signal detected. Oh, that's really helpful. Wow, that's a really cool. The white wolf says, \"No shot. You just killed me, Andy.\" What? What's that? What's popping off? What is that sound? I don't know. It's got to be a glitch or something. Oh, upstairs. Oh, that's a real person. Is it? No, it's an invisible. That's a bot. All right, we're going to go back to south relay right now. Kill that [ __ ] guy. Do you see this this this thing?",
            "start": 4480.32
        },
        {
            "text": "Oh, upstairs. Oh, that's a real person. Is it? No, it's an invisible. That's a bot. All right, we're going to go back to south relay right now. Kill that [ __ ] guy. Do you see this this this thing? No, Mike. Uh yeah, those don't worry about. And that one also we just did a supply drop container and it didn't give me any of my Oh, real dude up here. My Q. I'm pressing Q. Stealth engaged. Echo searching robots. I'm charging my shield. We have eyes on them. Uh, no. They're invisible bots. But the dude I was shooting was a real person. I'm pretty sure. I didn't see him. No, I saw two invisible bots that you were kind of shooting in the direction of. Just killed one of the invisible bots. Cool. All right. Maybe it was a bot though, but I saw a dude do like a [ __ ] uh crouch slide. These guys these bots are kind of cracked. I I will be They do have crazy movement, but it looked like a person doing a crouch slide. All right. Well, let's take what we got and let's get out of here. Let's go",
            "start": 4540.16
        },
        {
            "text": "these bots are kind of cracked. I I will be They do have crazy movement, but it looked like a person doing a crouch slide. All right. Well, let's take what we got and let's get out of here. Let's go uh back to south relay now. Oh [ __ ] I just No need to stay here longer than we need to. Yeah, let's go back to south relay. Wait, if Andy killed one of you in the chat right now? Which one of you [ __ ] killed me? Has Andy killed someone that I killed. I'm just saying not cool. Oh, wait. It's the mission where you have to get all the stuff out of the thing. Yeah. So, what is this mission that I'm missing out on? I don't know, Mike. Did we just not do the thing that we needed to do again? No, we got it. It loot supply loot supply drop containers in perimeter. I don't Sorry, we're rotating back to south, right? Yeah. So, did we do the thing we had to do where we were just at an overflow? Oh, yeah. We we hit the big box. Yeah. Yeah. Okay, we're good. White Wolf says, \"Unless you were a",
            "start": 4608.16
        },
        {
            "text": "back to south, right? Yeah. So, did we do the thing we had to do where we were just at an overflow? Oh, yeah. We we hit the big box. Yeah. Yeah. Okay, we're good. White Wolf says, \"Unless you were a Titan guy, I popped your shield.\" No, I didn't have a shield out. No, he's just saying like your shield like overshield. Yeah, I put my ass down. I assume his buddy took you down. Yeah, it had to be. I just don't want to type about their friend giving them any credit. Pretty [ __ ] up. It's like how awesome Mike always does awesome cool [ __ ] all the time. Andy's never doing cool. Where'd it go, Mike? I'm on the other side of the map. That's Andy. Whatever. Same person. It's a team compliment. It really is. Just my name's rarely included in the team. Mike's name comes up first in the alphabet. Alphabetical order. All right, I'm inside here. All right, I see the things I got to do. I see downstairs and upstairs. I think I got him, too. Where the [ __ ] are we? Come on. Come on. There it",
            "start": 4653.52
        },
        {
            "text": "Alphabetical order. All right, I'm inside here. All right, I see the things I got to do. I see downstairs and upstairs. I think I got him, too. Where the [ __ ] are we? Come on. Come on. There it is. I see you. I see you. I'll do the one downstairs. You see me? Yeah. Objective complete. I only have one. Yeah, me too. All done. No, I got one left. And These things look like futuristic cash registers. All right, so what's the vibe here? The vibes chill Jedi. We're cool dudes. We're gaming. We review games for a living. Uh we work for a studio called Kind of Funny. And uh and we're we like playing video games. Love playing video games. Oh yeah, baby. Big guy, big loader. Dude, the sniper is so sick. I really like it. All right. Should we ping extraction again? Yeah. Yeah. There was one at the last place we just found. Guess what? We're going back to extraction, boys. Or back to overflow. [ __ ] overflow. God damn. Guess what though? We got a toxic clear. You guys know how to solve the",
            "start": 4706.96
        },
        {
            "text": "the last place we just found. Guess what? We're going back to extraction, boys. Or back to overflow. [ __ ] overflow. God damn. Guess what though? We got a toxic clear. You guys know how to solve the toxic clear problem. Where is that? Toxic clear inside of overflow where we're going. You have to do that next, Mike. Uh, no. That I'm just saying that's a open world option. Look at your map. All those little blue icons. These are things that we can do while you can do other [ __ ] while you're doing your activives. Oh, I say yeah, like everyone knows that. No, you can you can just only activate one contract. Got it. Makes sense cuz that's not a contract. So, there's more [ __ ] to do in the realm. That's really cool. That's Yeah, there's a lot of like random little um little like mini missions throughout the the That's cool. the game that I didn't realize that, but the faction uh quests are only one. Faction Quest sounds like a really cool show that I'll never win. It really does. Yeah.",
            "start": 4772.64
        },
        {
            "text": "throughout the the That's cool. the game that I didn't realize that, but the faction uh quests are only one. Faction Quest sounds like a really cool show that I'll never win. It really does. Yeah. But what am I thinking of? Mythic quest or or Galaxy Quest? What's the ocean one? The one with the the kid with the blonde hair who died. Jonathan Brandice. Yeah. Something ocean. Uh oh. Great question. Ocean. What was it called? You keep saying ocean, but I don't think it's ocean. It was ocean something. Ocean quest. Something. Explore adventure. What was it called? Just seaquest. Seaquest. Close. Damn. Real close. It was close. Different body of water. Same difference though. What the [ __ ] Who cares? Nothing being gathered on the pings. There's something good there. I Those pings are so great, Mike. Yeah, they are. They're all right. They're all right. All right. So, we got a toxic room. We have our Xfill, but we have eight more minutes. So, maybe we try to figure out the toxic toxic",
            "start": 4811.88
        },
        {
            "text": "Mike. Yeah, they are. They're all right. They're all right. All right. So, we got a toxic room. We have our Xfill, but we have eight more minutes. So, maybe we try to figure out the toxic toxic room. Well, Andy found it. Yeah, it was a Find the room. It was on the outside is where I found Oh, this was definitely a person who died here where the Oh, yeah. They were They were already dead. I think that was that first original team way back in the day cuz Yeah, when I first went down there, they were Oh, wow. That's a cool gun. The Vu Zeus RPG. The Vu Zella. Vu Zella. It's cool. Don't eat it. Leave that alone. I don't want to fight that dude. All right. So, it was a laptop on the outside, Mike, for the of the room itself. For the poison room. Okay, Chad, is the RPG worth it? Well, I don't even know if it was outside of the room. I don't know if it was like directly outside of it or maybe it was, but when I did the laptop thing, I didn't even know what I was doing. I was just like, \"Oh,",
            "start": 4864.8
        },
        {
            "text": "know if it was outside of the room. I don't know if it was like directly outside of it or maybe it was, but when I did the laptop thing, I didn't even know what I was doing. I was just like, \"Oh, there's a little laptop that I'm activating something.\" And Nick said, \"Oh, listen to what it just said.\" And the character was like, \"Toxins, whatever.\" Yeah, it completely declassified. Well, let's find this toxic room then. Found it. Good job, Mike. All right, toxic room is up on the second story. All right, let's work from there. I found it. Okay. Mike has red. That's the one. Yeah, there it is. Did not see that. So, I guess they just put it in different spots every time. That's Maybe we just didn't see it there last time. Please wait. Oh, yeah. You're right. That was outside last time. Yeah. I'm going to open this up and breathe in. Just see what happens. Oh, look at that. That's cool, right? There's got to be sick loot in there, too. Oh, there's a lot of loot in there. It's not quite",
            "start": 4912.4
        },
        {
            "text": "I'm going to open this up and breathe in. Just see what happens. Oh, look at that. That's cool, right? There's got to be sick loot in there, too. Oh, there's a lot of loot in there. It's not quite gone that yet, though. Do we need to close the doors? No, it takes a while. It definitely took a while last time. You can hear the sound getting pitched higher. This is like a bathroom fan that needs to be cleaned out. Oh, yeah. It's It's clearing out, I think. Or not. Maybe there's a second. Oh, yeah. Look at that. Look at that. See, it's beeping. Clear. Things just take Sorry. Oh, a heart. A fungal growth heart. Oh [ __ ] This thing's worth 1.6k. Big money. Not a whole lot in here. I mean, I just got $1,500. Deteriorating. What the [ __ ] Oh, [ __ ] What the [ __ ] Oh, I think it's on a timer. Oh, yeah, dude. It's definitely on a timer cuz the the laptop just blew up. I was scared that somebody like activated it while we were in there. That really sucks. I'm dying. Uh, yeah, you have to",
            "start": 4953.68
        },
        {
            "text": "Oh, yeah, dude. It's definitely on a timer cuz the the laptop just blew up. I was scared that somebody like activated it while we were in there. That really sucks. I'm dying. Uh, yeah, you have to put on a health. It's not a kill. Yeah. All right, let's uh hit this [ __ ] out of here then. Get you guys a new mission. Imagine if like a if a dude on the other team like trapped us in there. That would be cool. It remind me of back at Apex trap people in rooms with such a trolly move. Where the [ __ ] is this? I'm already on it. Take a look. All right. So, the when the time pops up, that's when you can go in there and it goes down to 30 seconds or 20 seconds or whatever. Mhm. Or was it 10? I forget. I think it went from 30 to 10. Yeah, 10. But then it did that thing that Kevin does where it go it was like 30 29 and then went 10. You're live 8 one. Wait, you're live. All right, let's get in. You're live. What do you mean I'm live? You said there was 10 seconds. We had a pretty good battle",
            "start": 5009.2
        },
        {
            "text": "it was like 30 29 and then went 10. You're live 8 one. Wait, you're live. All right, let's get in. You're live. What do you mean I'm live? You said there was 10 seconds. We had a pretty good battle right there. That was good. Yeah, that felt good. Yeah, that one felt good. That felt real good. Flawless run. Flawless victory. Mike, tell Andy to talk to his bungee people and get some get chat some marathon codes. I'll take a PS5 one time. Talk to your people. Andy, talk to your people. Talk. They were all like, \"Mike, talk to your people.\" I said, \"Here's the deal. Only Andy and Blessing know people.\" No. Mike knows no one. Okay? I know f I know eight people in my life. I can name them all right now. Okay? I I I beg to differ cuz every time we go somewhere, you meet seven people that you get their phone number. Yeah. It's absurd. You made friends with an old lady on an airplane. You'd be like, you got to ask her about her day, bro. You don't have to do that. You got to ask her. You got",
            "start": 5076.24
        },
        {
            "text": "their phone number. Yeah. It's absurd. You made friends with an old lady on an airplane. You'd be like, you got to ask her about her day, bro. You don't have to do that. You got to ask her. You got to ask her about her day. All right. How do I claim that big ass victory? All right. Let me sell these little shitty guns. All right. What do we want to pop next, Andy? Just going to do the next one over for for new caloric. Okay. Uh, download the AI maintenance protocol. Download harvest logs. Um, what do you think? One sec. Let me see. [Music] Factions activate. Uh, yeah, I did uh survivable future. Yep. Two of three. Yeah. Yeah. So that two of three means that you and I are both on the quest. Okay, cool. That's cool. No, no, that means you're two out of the three quests available on this quest line, I believe. Oh, that's how I took it cuz I think they're going to give you three total quests on this. Cool. Oh, okay. Cool. Still nothing to do here though with the with these upgrades. I",
            "start": 5133.2
        },
        {
            "text": "quest line, I believe. Oh, that's how I took it cuz I think they're going to give you three total quests on this. Cool. Oh, okay. Cool. Still nothing to do here though with the with these upgrades. I still haven't unlocked anything here. [Music] I unlocked something sick. Graceful Landings V3 vintage. Upon Xfill, this item's value will be increased. It's an implant. Magazine reload weight reduction for vault cell mod. Put that over here. I don't need that. I don't need claymores either. They scare me. Oh, claymores could be great when you're like trying to extract. Put them around the Put them around the world. Around the Put around the world. Uh, Panacea kit restores health and brings shields to full charge. How the [ __ ] do I put that on my quick load menu? That's the real question here. What? Panacea kit? Yeah, cuz this thing recharges everything. Restores health and brings shields to full charge. So, it's like a This is a badass kit. I just don't know how to use it. Uh, well,",
            "start": 5192.88
        },
        {
            "text": "here. What? Panacea kit? Yeah, cuz this thing recharges everything. Restores health and brings shields to full charge. So, it's like a This is a badass kit. I just don't know how to use it. Uh, well, that's when you bring up your Q and you if you hold Q. But is it automatically in that quick menu? Yeah, pretty sure. Yeah. Yeah. Trying to figure out how to get is cuz there's like you'll see it on Yeah, you'll see the different rows to the left or whatever. I hear what you're saying. I hear what you're saying. So many guns. Why do I have some guns? Hey, what what gun are you rocking, Andy? I have the DMR Lookout. V95 Lookout. Do you want a uh fire chip for that? Do you have one of those yet? Uh oh. No, I got handling, crouching, and moving accuracy on this. Yeah, give me that [ __ ] Does anybody have a shotgun? Install them onto your gun. Yeah, make sure you're installing them if you have. Yeah. No, it doesn't go there. Yeah, I need a marksman chip mod. This is for assault chip mod. Um",
            "start": 5256.52
        },
        {
            "text": "have a shotgun? Install them onto your gun. Yeah, make sure you're installing them if you have. Yeah. No, it doesn't go there. Yeah, I need a marksman chip mod. This is for assault chip mod. Um I would No, I don't need that chip mod. Actually, anyone using vault? Yeah, you do. You need an assault chip mod, right? No, I have one already installed. It just doesn't show it. Oh, that's a bug then. Oh, so I do have a thing then installed. My bad. Yeah, but not in your marksman rifle. Hold on. Let's take us back in. This is my marksman. What's the other one down there? Sniper. What's that? What's the gun called? Um, Longot. Yeah, this one doesn't do that. Okay. And what's your chip installed right there? This is the combat control chip. You like that? Cuz I have handling crouch accuracy down on moving. Yeah. This is a blue. This is the blue. Okay. You like that? I'm going to sell this one then. This is exciting now. Now that we're kind of learning the language more. I like it. Talking it",
            "start": 5303.2
        },
        {
            "text": "on moving. Yeah. This is a blue. This is the blue. Okay. You like that? I'm going to sell this one then. This is exciting now. Now that we're kind of learning the language more. I like it. Talking it out here, Chad. Yeah, we're talking it out, Chad. I'm ready to [ __ ] rock again. This is fun. Yeah, I'm similar to Nick on the quick menu. It brings up two wings of like here's your first two and then there's two more, but I can't ever I can never get to those. You have to click on them. You have to like click over to them. Yeah, like you use your like cursor when you hold the Q button, you can go click on the the right ones, you know, cuz I'm finding myself going into my bag and then using them via the bag, which sucks. What up, Fran? Um, this is like our fifth or sixth maybe. Mike played a lot last night. Yeah, about last night, I would say probably. Yeah, you guys want We've played a lot. We We played like five or six. No, but if there's an energy drink in there, I'll take it.",
            "start": 5345.28
        },
        {
            "text": "a lot last night. Yeah, about last night, I would say probably. Yeah, you guys want We've played a lot. We We played like five or six. No, but if there's an energy drink in there, I'll take it. Whatever it is. Oh, you know what? Coca-Cola, please, homie. Keep it easy. Give me the crack. Um, let's see. See, I still haven't used I got to use this [ __ ] pistol, bro. I got this goddamn expensive ass pistol. I'm not even touching it, dude. The sidearms are really good, too. Yeah, I keep looking at this bully, but I'm not even pulling out the bully cuz we haven't died. We've actually survived quite a couple of times now, which is funny. Uh, all right. I need that. So, I need a better understanding of what this [ __ ] mission is right now. Shout out to the homie Chrisena who said that he just bought a an Asus 4K OLED monitor. Oh, that's nice. Thank you, Nick. Um, okay. Actually, no. I mean, here's the question for that, though, right? Like, how much did that cost versus how many tickets",
            "start": 5392.08
        },
        {
            "text": "bought a an Asus 4K OLED monitor. Oh, that's nice. Thank you, Nick. Um, okay. Actually, no. I mean, here's the question for that, though, right? Like, how much did that cost versus how many tickets could you buy to come see us? Oh, I miss him so much already. True. How fun was it to have Chris here and see the look on his face of disappointment when we said something stupid? It was great. It was so funny. I was totally No, but I just think of I'm ready up. I just think of Yeah, I'm looking something. Hey, Andy. Uh, multiply top pass filter. Is that some Is that something that you would like? Is that me or Kevin? Cuz I can't tell you. Okay. Kevin. God damn. It could go either way really when you're making fun of someone in this office. No, man. It was I mean, there's been a string of Kevin saying stuff recently that we need to clip them all out and make a we need to make a montage of all the different Kevin talking moment. Yeah, we Yeah, we should definitely get those. Andy, uh the the",
            "start": 5440.08
        },
        {
            "text": "saying stuff recently that we need to clip them all out and make a we need to make a montage of all the different Kevin talking moment. Yeah, we Yeah, we should definitely get those. Andy, uh the the wing with the feathers. Oh my god. I was like, you know what? You know what the cans? We did the cans, Andy. That's We got three right there. That's what I'm saying. Yeah, there's been like four or five the last couple videos. You know what? Andy, you see Andy, you see we did the We figured out the cans. Jesus. And like or or him looking at me and Nick and going, you know, when you shuffle cards. Yep. And he just like processed the next thing. Remember the remember the uh what was it? The lighthouse. You guys know about lighouses, right? Like what? Russian lighouses. Russian. Oh, you guys like those Russian lighouses. What? We'll we'll make a Reddit post. We got to make a Reddit post like help us get some of these clips. We need to do that cuz after like when Kevin it's his 20 year",
            "start": 5484.4
        },
        {
            "text": "like those Russian lighouses. What? We'll we'll make a Reddit post. We got to make a Reddit post like help us get some of these clips. We need to do that cuz after like when Kevin it's his 20 year anniversary, I want to do the 1 hour super cut. It is a lot of like Evan Y's clipping them out. Great. You know how you shuffle a deck of cards? the order that they now Kevin text me goes you guys are [ __ ] I'm just asking you guys a question I was like you that's not a question that is a that is an ellipse between a statement between posing a question and saying something like you're not asking one more oney yo alpha channel does pre multiplied mean anything to you some very important [ __ ] I'm trying to sort some [ __ ] you know very important thing for It's how the alpha channels are interpolated. Not trying to fight for our lives in war zone or anything. Just might as well be playing blueprints right now. Kevin Chris is like they're jackals. I know. Kevin, does that mean anything? Now,",
            "start": 5531.28
        },
        {
            "text": "Not trying to fight for our lives in war zone or anything. Just might as well be playing blueprints right now. Kevin Chris is like they're jackals. I know. Kevin, does that mean anything? Now, Nick, I'm ready. Just make sure you're on the right map for your contracts, whatever you guys are doing. All right. I may not be on the right map. I'm probably not. Oh yo, Jedi Ziz used their prime on us. Jedi Ziz just followed or just chatted for the first time rather and then gave us their prime. Thank you so much. Nice. That's awesome. Thank you. What's up, Fran? Does that mean anything to you? It's cuz he just trails off. Well, it's cuz he and he doesn't know what the word is. It's his also the headphones. He's hearing his voice like a half a second later and that's where the struggle goes through. That helps. Yeah, it does. That's where the struggle goes through. Yeah. Yeah, alpha channel. Does pre multiplied mean anything to you? But like why are you asking that question while we're in the",
            "start": 5582.4
        },
        {
            "text": "That helps. Yeah, it does. That's where the struggle goes through. Yeah. Yeah, alpha channel. Does pre multiplied mean anything to you? But like why are you asking that question while we're in the middle of dropping a war zone? I think he was doing an OBS thing or something. I don't know. And people go, \"Oh, Nick, how am I not paying attention to the [ __ ] words and people that Cuz I had people ask me questions like that midway through a game.\" By the end of it, though, it was so [ __ ] funny. He was like, \"You know what? I'm [ __ ] leaving. I'm I got to get out of here.\" And when I played that clip for Joey, she was like, \"Oh, is that when he left the office?\" Yep. He just left. Oh, [ __ ] I can read your guys's contracts. Yeah, you saw that, right? So now I know. All right. So why don't Okay, so my thing had two I had two things on my thing that I had uh accepted, but only So I told you look at the maps. The second piece to this is on the second map. So we're going to do the first",
            "start": 5632.56
        },
        {
            "text": "Okay, so my thing had two I had two things on my thing that I had uh accepted, but only So I told you look at the maps. The second piece to this is on the second map. So we're going to do the first part on this map and then we have to go to the second map. So you guys are now caught up with me cuz I'm on We're going to Holler. We need Holler. So right now we're going to go to Holler. Okay. All right. Let's go. Got it. Uh B2, that is true, Chris. Yeah, we're really paying attention to War Zone anyway. I mean, we're just so good at it, Chris. The fact that we got Andy to play War Zone with us again really is a testament to how much patience Andy has gathered throughout the years. I mean, my favorite thing, it's really cuz we had to get Chris up here. If Chris wasn't here, there's no way in hell he would have done that with us for 12 hours. Chris to come. My favorite thing was recently when we did the Cyberpunk stream and Nick was like, \"Well, I want to lock in on the story.\" So, like",
            "start": 5676.32
        },
        {
            "text": "hell he would have done that with us for 12 hours. Chris to come. My favorite thing was recently when we did the Cyberpunk stream and Nick was like, \"Well, I want to lock in on the story.\" So, like the least amount of people in the room as possible would be great. And I'm sitting next to Nick and Nick is looking at Mike playing Pokemon the whole time. Like much on his phone. You're not paying attention to anything. I see the ADG. It was an important grind. He needed to know what was happening. Well, Mike's in the room. I got to talk. I know. He's so fun to talk to, dude. I we did Allan Wake and he locked in for Alan Wake though. Locked in for Alan Wake. We [ __ ] dug that game. Here's the thing. I paid attention. I paid attention to Alan Wake. I focused on Alan Wake. I read every [ __ ] thing I possibly could. I listened to every line. I have no idea what's happening in that game. Yeah. I mean, none. Nobody does. It's all good. But every time, every single time, Andy, that someone",
            "start": 5721.04
        },
        {
            "text": "thing I possibly could. I listened to every line. I have no idea what's happening in that game. Yeah. I mean, none. Nobody does. It's all good. But every time, every single time, Andy, that someone said Allan, I'm Alan. Allan every time. Every time. Cuz I'm committed to the bit. Chris, Anka, Alan, uh, we have a first time subscriber with Prime Gaming again, Sonar, right? Sonar, thank you Sonar. Thank you so much, Sonar. Man, welcome in to some kind of funny best friends all around the globe. Dude, if I can end up getting like a nastier sniper, like this is just a basic ass white sniper and it's awesome. It sucks, dude. Oh, so Oh, yeah. So, check out the So, the the gear [ __ ] um which is the is it Q, right? a little behind you. Yeah, I'm just watch up in my corner. Invisible dudes. Who is their like lead designer for these games? Is it different people? Cuz they have like the same shared aesthetic, which is really cool between this and like Destiny, you know? Well, no, these are",
            "start": 5763.52
        },
        {
            "text": "is their like lead designer for these games? Is it different people? Cuz they have like the same shared aesthetic, which is really cool between this and like Destiny, you know? Well, no, these are totally different aesthetics. Destiny doesn't look anything like this. Oh, really? Okay. Destiny is like not cell-shaded and No, I don't mean that. I mean like the actual like weapon redesign and stuff like that. Am I crazy? Like the Destiny the in terms of the I mean maybe the hardware of the guns but the or the hard surface like [ __ ] but the color schemes and everything here is just like I'm definitely misremembering Destiny. It's so different. Fran, how come you don't want me to play Destiny with you? Oh god, you would just make fun of him the whole time. I did. And you get so angry at him when he's in his his menus. Wait, I got to go over to this faction's menu and see if I can up my PPP on this FS3. You just said FN3 but with an S. Dude, it's not. He's very I'm saving my creativity",
            "start": 5819.28
        },
        {
            "text": "when he's in his his menus. Wait, I got to go over to this faction's menu and see if I can up my PPP on this FS3. You just said FN3 but with an S. Dude, it's not. He's very I'm saving my creativity for my show tonight. He's saving his creativity tonight. All right, this goddamn holler, y'all. That's a big guy, so be careful. Oh, is this we got to do this [ __ ] No, no, we're we're in the hauler. We got to do Okay, y'all. The holler. Should be another scanning one. I believe I see be putting it down on the highest ground. You can [ __ ] Oh, there's a real guy. Oh, I just downed him and he down me. Hang. I'm queuing right now, Andy. Holy [ __ ] I thought it was me. I was looking into a mirror. Oh, I see three people over there. A different team over there. I see three people. [ __ ] Oh no. Oh, that's my [ __ ] That's me. You got Yeah, I got Nick up. We have three people close. Healing out. Oh, this dude had a selfres. Oh, yeah. Use that thing. It's sick. Yep. I got one down. Holy [ __ ]",
            "start": 5862.16
        },
        {
            "text": "that's my [ __ ] That's me. You got Yeah, I got Nick up. We have three people close. Healing out. Oh, this dude had a selfres. Oh, yeah. Use that thing. It's sick. Yep. I got one down. Holy [ __ ] you're shooting. [ __ ] I didn't even know we had I didn't know they were that close. Oh, they're close. They are right here. They have jumped off the window, but I have killed a man right there. I have them behind your angle on them. Suck. That's all right. They're by the wi by the wheels. I saw them jump off towards the wheels, so be careful. We're in like a doorway, so I can't really get out with you. [ __ ] happened there. They're like right over here. Seeing this. 20 minutes remaining. That's so long. They're underneath us, Mike, I think. Yep. Nice [ __ ] Nick. Keep shooting. [ __ ] yeah, Nick. I see one. I saw I'm killing one in here. Ping, ping, ping. Coming. Nick, finish that kid if you can't finish him. I'm going to help Andy. Where Andy? In this building somewhere. Coming. I see",
            "start": 5920.72
        },
        {
            "text": "Nick. I see one. I saw I'm killing one in here. Ping, ping, ping. Coming. Nick, finish that kid if you can't finish him. I'm going to help Andy. Where Andy? In this building somewhere. Coming. I see him. Andy. He's right through the glass. Oh, there's a lot of people here. I'm shooting them, Andy. I'm shooting. They're super low. There's two. There's two. There's two. Got one. One more, Nick. One more. Yes. Great job, y'all. I'm self-resing. Selfres. Oh, wait. Was that not you? Did you not self press or what were you doing? I I was holding the button all the way down, but like one of his guys was still there. I think he might have thirsted you. Either that or I shot you. I'm not sure. Yeah. Or I shot you. One of the Let's go outside, Nick. Let's go outside. You got Andy. What happened with that guy on the floor? Oh, I killed him. You thirsted him? Oh, I killed everyone. Okay. Yeah. This bully is nasty out front up close. I have two dead bodies outside. We killed one guy. Shotty. I",
            "start": 5974.0
        },
        {
            "text": "with that guy on the floor? Oh, I killed him. You thirsted him? Oh, I killed everyone. Okay. Yeah. This bully is nasty out front up close. I have two dead bodies outside. We killed one guy. Shotty. I think we killed two teams. We just wrecked someone's day. Oh man. Okay. This kiss has nothing of any value to me. That's all right. Yeah. All these kids don't have much. Well, one of them had a really good shotty. Well, yeah. You took it. No, I didn't. Really? Really? Yeah. In the room right here. Oh, I'm not up there with you. I don't know if I want a shot here in this game though. That's pretty sick. You have a good SMG though, but it might be good to sell if you don't or put it in your wallet. Yeah, it's only two 10 credits. You hear stepping? Yep. That's me. Be prepared. I think it is Andy running around. I think it's a robot, actually. Yeah, I would just say just be prepared for anything here. There's definitely footsteps. I have 70 seconds until my alt. I think it's a robot up top.",
            "start": 6022.88
        },
        {
            "text": "running around. I think it's a robot, actually. Yeah, I would just say just be prepared for anything here. There's definitely footsteps. I have 70 seconds until my alt. I think it's a robot up top. Andy. Oh, there's a good hardliner PR up here. Andy, do you want this sniper rifle or is it I don't know if this is better than the one you have. Uh, it's a white one, but I I'm good. It's white. Um, let's uh let's figure out your guys' missions. Let's get back on focus. It's upstairs. I got it. Call. Yeah, it's definitely a bot. I got it right here, Nick. Great call out when you're like, \"They're below us, Mike.\" Oh, wait. I can't. Oh, there we go. Yeah. So, you know what? I have something. I'm getting shot at. It's an AI bot, I think. All right. Objective completed for me. Andy, it's right here if you need it. Oh, perfect. Thank you. I'm getting doubled on AI bots. Are they or not? I killed one. Thank you. Yeah, that must have been him. One more. Got him. Thank you, Andy. Oh, from behind.",
            "start": 6085.76
        },
        {
            "text": "if you need it. Oh, perfect. Thank you. I'm getting doubled on AI bots. Are they or not? I killed one. Thank you. Yeah, that must have been him. One more. Got him. Thank you, Andy. Oh, from behind. From behind. [ __ ] Man, the AI is like really smart. Yeah, it really makes it fun. [ __ ] they move fast, too. Damn, he's running around. That guy is running. Oh, it's a real guy. No, really? Yep. It's a real team. Andy, I'm putting on my queue. Kill him. Kill him. Kill him. There's two guys. Three guys. All right. Chill out. They push us back. Seeker deployed. I'm dead. [ __ ] Damn. Where are you? Oh [ __ ] Damn. Right around the corner. I wasn't ready for him to come. Just hide. Camel filter engaged. They're looting his body right down the street. I can feel them violating me. They're right down in there to the left. Left. Even going to bother. There's a lot of N. It's three. It's a It's a three stack. Get out. Yeah. Kind of hide and wait and then come back and get us. I think they're",
            "start": 6135.92
        },
        {
            "text": "down in there to the left. Left. Even going to bother. There's a lot of N. It's three. It's a It's a three stack. Get out. Yeah. Kind of hide and wait and then come back and get us. I think they're looking for you, so be prepared. He's definitely like tracking you. Reinforcements have responded to the signal. Oh yeah, take a second. Do the objective. Why not? That's smart. That's smart. I don't know if it'll let me. Oh man, I got finished by a guy named Frezy. I don't like that. I got eliminated by three bugs. Kabs, 1987. Not kebabs. Kbabs. Kbabs. Could be kebabs, but Kbabs. Well, it could be kebabs if there was another A in there. Well, you never know. It could be a new rebrand. We've been calling Kbabs kebabs for like 10 years. They're down there, Andy. There. Oh, you see them? You see them? Oh, yeah. Be chill. There's three of them. I just waited out is right. You got all the time in the world. They're definitely going to circle up to you, though. They might not flank hard around,",
            "start": 6195.52
        },
        {
            "text": "them? Oh, yeah. Be chill. There's three of them. I just waited out is right. You got all the time in the world. They're definitely going to circle up to you, though. They might not flank hard around, man. Until signal loss. And we already did the mission. Yeah, you can just extract if you want to leave me and Mike behind. You [ __ ] get us back. Roll the dice. I just hear him. Yeah, I hear him chalking. Why would a bot walk through here? Are you [ __ ] kidding me, man? Just the loudest thing possible. You're good. We got the smoke. Yep. Another bot. [ __ ] him. Another bot. Welcome. You're fine. Oh, he's right there. That's a bot. That's a bot. Yeah, that's an invisible bot. No. No. It's a guy. It's a No, I don't know. That's a bot. What the [ __ ] man? Oh [ __ ] Oh, what the [ __ ] is this bot? Yeah. See that bot? Look at that bot. Freaking you, dude. You still have your res. Oh my god. Oh [ __ ] Oh my god. Not even a chance to get back. [ __ ] dude. I thought it was of me that was",
            "start": 6252.96
        },
        {
            "text": "bot? Yeah. See that bot? Look at that bot. Freaking you, dude. You still have your res. Oh my god. Oh [ __ ] Oh my god. Not even a chance to get back. [ __ ] dude. I thought it was of me that was cloaked. Yes. Yes. You know a bot. Yeah. No. Damn. That [ __ ] sucks. Lost so much [ __ ] there, dude. Yeah, I really lost a lot there. Lost a lot. That was a tough run. Tough run. I I think I lost like $4,000. Uh I literally I lost a lot of good guns. I had a $4,000 load out that I just lost right there. I'm I'm really bummed about that, too, cuz I thought it was there was two bots down there and I saw a third guy shooting. I was like, \"Oh, it's a bot.\" But he was running away and I'm like, \"Oh, that's crazy. This thing's really running fast.\" And he ran you right into his three stack. That was tough. That sucked. Damn. So now the cool part is it sucks that we died, but we're going to go to a new map. Well Oh, I mean, no, that that gave me the the mission. I did the thing. Yeah. So you have",
            "start": 6314.24
        },
        {
            "text": "tough. That sucked. Damn. So now the cool part is it sucks that we died, but we're going to go to a new map. Well Oh, I mean, no, that that gave me the the mission. I did the thing. Yeah. So you have to now now that means we get to go to the other map. Oh yeah, we can turn in those quests. Yeah. Yeah. Wait. Well, I turned in part one of it. I don't think Oh, yeah. We got to go to Dire Marsh for the second part. Let me do my load out real quick. [ __ ] that sucked. That sucked. I lost my really good blue AR or my blue single shot. That hurts, chat. That really hurts. Oh, dude. Chat's so I I this whole time I thought nobody was typing into YouTube and it froze the YouTube chat. Oh, really? Who did Where did you stop on? Away. I'm buying this. Like it was way the [ __ ] up here. Oh, Aw. Yeah, Awane was my last one. That thing just never refreshed. Why does that bot take so many shots? That's just like an elite type deal. Yeah, that's what it is. I mean, what happens in the game is if you",
            "start": 6370.32
        },
        {
            "text": "Awane was my last one. That thing just never refreshed. Why does that bot take so many shots? That's just like an elite type deal. Yeah, that's what it is. I mean, what happens in the game is if you stick around an area too much, they the game keeps sending us UESC reinforcements and they get tougher and tougher. So, you want to get out as quickly as possible. But because that dude was cloaked and it looked like he was looting something, I thought it was a dude who was playing my character that was cloaked. You can see how I'd have that misunderstanding check. No. Yeah. Wait, what do these mechanics kits do for you? I don't want that. Sell that [ __ ] [ __ ] back. I'm just totally wasting money right now. We got money to spend, man. This is just the alpha. That's true. It's two weeks, though. All right, I am readying up now. Everybody check your missions. Are we going to Dar? We going to D Mar. So, I got to change my mission then cuz I got to do that, too. Oh, man. I need a backpack.",
            "start": 6428.48
        },
        {
            "text": "All right, I am readying up now. Everybody check your missions. Are we going to Dar? We going to D Mar. So, I got to change my mission then cuz I got to do that, too. Oh, man. I need a backpack. All that [ __ ] [ __ ] I thought it was a dude disguised as a dude playing. That sucks, dude. I'm just a dude. All right, I think that's it. And I also wasn't scared of him enough of that bot cuz I was like, \"No, with every time I click the button, I was like, this will likely be the bullet. You think this is going to be the one?\" And just like, \"Fuck, man. [ __ ] took so many shots. So, three brand new prime gamers in the last 30 minutes. That's awesome, guys. That's That's exciting. Thank you for first timers out there. Thanks for enjoying it. Why am I a leader here? I don't Oh, cuz I was out when you guys started. Yeah, I had to go clean my car after last night. What did you do last night, Mike, that made your car so dirty? Uh, well, I proceeded to bring the chat into my car to go get warm",
            "start": 6488.32
        },
        {
            "text": "you guys started. Yeah, I had to go clean my car after last night. What did you do last night, Mike, that made your car so dirty? Uh, well, I proceeded to bring the chat into my car to go get warm while I waited outside of GameStop. And that's when I started crashing and getting tired, you know, and so I decided, you know what would be a good idea? Let's open up a 100 Magic cards and sleeve them in here. Yeah. Which means I went full raccoon mode of just throwing [ __ ] everywhere around my car. What are you looking at? Oh, a look. Andy's giving him a look. Jesus. What do you think he needs? Oh, the gate. He just said the gate. Oh [ __ ] the gate. Broken gates. [Music] Set a reminder so that you don't forget. [Music] Why can't he do that? You have Twitch Prime. See, he put us on the wrong [ __ ] map. I told [ __ ] God Christ almighty, dude. Damn it. [ __ ] [ __ ] [ __ ] Planet side for extended. What do we do? He did. Oh, wait. We just And this is like our last one cuz he's like,",
            "start": 6547.92
        },
        {
            "text": "[ __ ] map. I told [ __ ] God Christ almighty, dude. Damn it. [ __ ] [ __ ] [ __ ] Planet side for extended. What do we do? He did. Oh, wait. We just And this is like our last one cuz he's like, \"Mike, I got to leave at 4:00.\" Okay. So, we could just I mean, we could either We could either dip out right now to South Relay. Extract right now and then we could have one more good one or we make this a good one. All right. We got to run to South Relay. [ __ ] Nick. God damn it, man. No matter how many times I tell him, still [ __ ] zero zero retention. And I thought I was bad, you know. [ __ ] you coming in on the high or the low? Do you want to sing it on the high or the low? I love that before we were streaming, I had that moment of like of you being like, \"Oh, you're way back there, Nick.\" Like, what the hell? Yeah. SA and then you ended up going down. I just saw you like so defeated. That's you just sat there. I was like, \"Fucking God.\" Of course I died because I had to go get you who",
            "start": 6605.76
        },
        {
            "text": "Like, what the hell? Yeah. SA and then you ended up going down. I just saw you like so defeated. That's you just sat there. I was like, \"Fucking God.\" Of course I died because I had to go get you who were dead way far away from us. That just happened just with us here on this live stream. Where are you? I'm still over there. Okay. We left that a long time ago. Doesn't Nick have to be at the extraction? Well, yeah. We're going to get his I'll get on his dies. All right. Oh, I am doing Traxxas missions though, I think. Oh [ __ ] He's going to be inverted. The biggest enemy. Time to hunt. Oh [ __ ] he's going to be inverted. Uh-huh. We'll do it right now. Uh, we'll call it after this next run. So, why don't you uh just do your thing. What's up? Um, we're already moving. We're already moving. It's crazy that Nick is like the handyman of office as well. It's like insane that Well, Kevin is, I would say. Well, yeah, but like you talk about the gate, Nick's on it, right? You want you want to",
            "start": 6662.4
        },
        {
            "text": "It's crazy that Nick is like the handyman of office as well. It's like insane that Well, Kevin is, I would say. Well, yeah, but like you talk about the gate, Nick's on it, right? You want you want to get an electric charger for a for a car charger, Nick's the guy. All right, we're here. He uses hammers inverted. I'm calling him now. Deploying barricade. [Music] Stay focused until we're out. Uh-huh. You have to prime. Enjoying it. Iconic. I had a really bummer of a run a little while ago, but still having fun. Just this last run was a major bummer, unfortunately. Yeah, our gate broke and Greg had to call out Nick. Nice. Good smoke. So, is the smoke the ultimate or is the smoke the ultimate? The smoke is the ultimate. Yeah. And then what's the F? My F I just go invisible whenever. Boom. Yeah. But the ultimate is not only cover, but if I'm in the smoke, then I am invisible. So, it's like it doubles up on that flawless run. Look at that [ __ ] Who's controlling that right there? What? The",
            "start": 6745.76
        },
        {
            "text": "But the ultimate is not only cover, but if I'm in the smoke, then I am invisible. So, it's like it doubles up on that flawless run. Look at that [ __ ] Who's controlling that right there? What? The camera like showed us an interior. Who is that? [ __ ] n It's a whole thing now. All right. So, we're going to go here. Leave crew. We still together? No, he was the party leader. Okay. Oh, no. Yeah, you and I are still together actually. Yeah. Yeah. Okay, cool. Did Sonic Mike just two man this too? Actually, he sure did. Now me and Andy are about to dominate this. All right, Dire Marsh. Are you with me? Yep. Okay, cool. Yeah, put us in Dire Marsh. Uh, let's go complete this mission, you and I. And also check out this second map. I haven't really explored this. I think it Here we go. Oh, should I do crew fill on? I think they automatically fill you, right? No, you could like fill off. Oh, then fill off. Yeah, that's fine. One of those things where you're like, did is that selected? Yeah. I",
            "start": 6847.52
        },
        {
            "text": "I do crew fill on? I think they automatically fill you, right? No, you could like fill off. Oh, then fill off. Yeah, that's fine. One of those things where you're like, did is that selected? Yeah. I have no idea. Yeah. Yeah. Here we go. Langley's been under the weather. We got to get him back. Oh, man. Langley, spring weather's in effect, man. We got to get you outside. Fran has been watching us. I wonder what Fran thinks of this game. Inverted is the correct way. Your brain's broken. Yeah. What does Fran think about it? Fran, what you think? Let us know, Fran, if you're still here. You know who I tried to play with last night since you were busy? Mike Manady. Oh, he's on. Uh, he was going to play it, but then he was like, I'm going to go play Switch games to celebrate the Switch. And I didn't want to call him a nerd cuz I like Mike and I with him, but I'm calling him out right now. I wanted to call him a nerd because he's like, no, [ __ ] that. Play this game with me. [ __ ] shoot",
            "start": 6918.48
        },
        {
            "text": "didn't want to call him a nerd cuz I like Mike and I with him, but I'm calling him out right now. I wanted to call him a nerd because he's like, no, [ __ ] that. Play this game with me. [ __ ] shoot with me. Data integrity. All right. Dire marsh. Oh, algae ponds. Algae ponds all the way across the map. Oh, all right. Check this out. New map, bro. This is definitely This feels larger already. Yeah. Are there enough menus for Fran? That's a good question. This is pretty. A lot of these little god rays kind of short answer feels like Tarov light Apex with Destiny Halo vibes. Great potential if you like loot and extract form man. Okay. Sounds like some gunshots. I'm also excited, Mike, for the for the Arc Raiders beta cuz you and I played that once and had a good time with it. Yes, we did. There's bad guys right here. Let's just go around the right side. Sure. All right. 104. Knife out. I'm going to freaky deicky stuff going on. Yeah. What is this goop? What the [ __ ] You can't go",
            "start": 6984.48
        },
        {
            "text": "There's bad guys right here. Let's just go around the right side. Sure. All right. 104. Knife out. I'm going to freaky deicky stuff going on. Yeah. What is this goop? What the [ __ ] You can't go around. Oh, check it out. The goop is like It's called the anomaly. Well, be prepared. Those people might see us over on pink. Oh, you wrapped that way. Nice. Yeah, there's an opening over here. I saw on the map. No [ __ ] Christ. [ __ ] I heard some noises. Oh my god, there's so much happening. Oh, you really got trapped in there. Okay. Yeah. No, I was I'm the king of opening the map thinking I'm knowing who I am on the map and where I'm going and I'm always wrong. Okay. Yeah, man. So, I'm no better than Nick, you know. It's all right. Well, I mean, you're moving, but I'm making the attempt. That's all that matters. That's the Just move. Oh, yeah. Oh, I see a full team. And they I They may have seen me. I'm alting. Oh, yeah. Full squad right here. Ping. Are they coming? Two people. They're",
            "start": 7050.24
        },
        {
            "text": "all that matters. That's the Just move. Oh, yeah. Oh, I see a full team. And they I They may have seen me. I'm alting. Oh, yeah. Full squad right here. Ping. Are they coming? Two people. They're They're heading this way. All right. No, it's three people. They have a full squad. I have completed the mission. God, you're the goat. Turning back my attention to you now for Overwatch. One of those things where I keep on hearing sounds and it's like, \"No, that's me stepping, but it doesn't feel like I should be making those noises.\" Is there a ground floor? Yeah, there's ground floor right here for me at least when it popped up. Yeah, for you as well. Beautiful. I like those big white pings when you get close to it. Yeah, that's nice. Iconic, thank you once again for 13 months of support. We have a supply cash here if we want to search for it um while we're here cuz we've completed the mission now. So, we might as well loot. Man, they're close, Mike. They're right here. Live ping. Are those",
            "start": 7119.6
        },
        {
            "text": "a supply cash here if we want to search for it um while we're here cuz we've completed the mission now. So, we might as well loot. Man, they're close, Mike. They're right here. Live ping. Are those people or Yeah, those are people. Those are people. Really? Okay. I'm not I'm ready. Oh, yeah. No, I'm hiding behind the wall. All right, cool. I have 20 seconds until I get my ping, so chill. Oh, yeah. Upstairs. I just saw another body right here on yellow. All right. On A1. 7 seconds. Live ping right here. closer. Are they bottom level then? Yeah, bottom level. Live ping. I'm up on like the roof now. I've gotten lost. I see. You see this light ping right here? Uh, ready for my IQ. Here it comes. No, no, I don't have any cover though. Oh, they're fighting. They're fighting another team. Well, intel is out and I might be on top of someone. Yeah. Yeah, they're fighting people. I'm I'm fighting. I I knocked the dude. Sounds good. I'm shooting as well. A lot of people behind that. A lot of",
            "start": 7181.28
        },
        {
            "text": "intel is out and I might be on top of someone. Yeah. Yeah, they're fighting people. I'm I'm fighting. I I knocked the dude. Sounds good. I'm shooting as well. A lot of people behind that. A lot of people behind that. Yep, you see them in there. They're going to get dropped on by a bad team or by AI. Oh, I killed one. I killed one. Oh, that kid's ripping me a new [ __ ] I'm armoring. I'm out for a second. I'm out. Oh, that's bots. [ __ ] [ __ ] [ __ ] [ __ ] [ __ ] Thought those were people. Oh my god. That That's a bot. That is a [ __ ] bot. Is it weird I'm scared of the bots more than people? The bots are bad, right? The bots are mean. Prepare for increased hostile. They're still behind the white. Still behind the white trucks. I'm just pinging. I'm scared of bots. Oh yeah, they're still fighting. Oh yeah, they're stuck behind the white box right now. Movement. That's a bot. That's a bot. That's a bot, but it's still right. That's the invisible bot. Yeah, I pinged him again, though.",
            "start": 7240.24
        },
        {
            "text": "fighting. Oh yeah, they're stuck behind the white box right now. Movement. That's a bot. That's a bot. That's a bot, but it's still right. That's the invisible bot. Yeah, I pinged him again, though. I'm trying to get an angle. I I hit him a couple times. Yeah, I see him. Nice. I'm hitting him. I'm hitting him. Keep that pressure up. I'm wrapping him. I I I hit him several times, man. I'm wrapping. I'm wrapping. I have to shield. I have to I hit him hard. I have to heal. One kid's downed. Thirsted. Still behind the white truck. I'm pushing left side. Push that. I have the right side pinched. No, I'm laying down cover fire. Got one down. One more back here. I'm armoring and then I'm going to jump down on them. Okay, [Music] jumping. Clear. Three dead bodies confirmed. Let's [ __ ] go, dude. Oh [ __ ] Mike. The [ __ ] was that, bro? What the [ __ ] was that? Somebody probably threw a grenade at us. You sure you didn't press a button? No. Yeah. Or or somebody put a claymore down. Okay.",
            "start": 7304.4
        },
        {
            "text": "Oh [ __ ] Mike. The [ __ ] was that, bro? What the [ __ ] was that? Somebody probably threw a grenade at us. You sure you didn't press a button? No. Yeah. Or or somebody put a claymore down. Okay. Camel filter engaged. I'm going back to it. I'm searching. You cover. I'll search for a second. Yeah. Damn, that scared the hell out of me. All right. Thought I heard noises. Uh, robots, be prepared. Yeah, we got to get the [ __ ] out of here, man. A blue bully sniper here. Sniper in that body. Oh [ __ ] My god. We've got nothing near us. I'm looking right now, dude. So many bags. Holy [ __ ] Okay, take it all. Take it all. Should we extract sniper right here? All right, I got that one. All right. Uh, we got extract behind us. We got a lot going on. Let's go check out this supply drop down below us. That is to the west. No. Yeah. Warning. Reinforcements detected. B2. Yeah, but I have two B2s for some reason. There it is. No. I I thought two just meant like that's a player. You're looking",
            "start": 7374.0
        },
        {
            "text": "us. That is to the west. No. Yeah. Warning. Reinforcements detected. B2. Yeah, but I have two B2s for some reason. There it is. No. I I thought two just meant like that's a player. You're looking Well, I have two B2 pings for some reason on the map. I can't get Yeah. Yeah. Well, one of them you took away right now. Yeah. B2. It's uh towards the south. Oh, okay. Damn, that was crazy. That was crazy. That was good. You trapped those kids. That was good. Engagement. Oh, I do need bully ammo. [ __ ] You need what ammo? Bully ammo. Whatever. Is that SMG? Yeah. Tiny bullet. I got about 240. Give me a So, that's not light rounds. No, that's even smaller. What the [ __ ] It's called heavy rounds is what the bully uses. heavy rounds. Yeah, this sniper looks gross up close. Looks like the textures aren't laid on correctly or something. Thank you, Pete, for calling that out. All right. So, here it says there's a supply drop. Call down a high value supply drop here. Okay. What up, JG in the",
            "start": 7487.32
        },
        {
            "text": "aren't laid on correctly or something. Thank you, Pete, for calling that out. All right. So, here it says there's a supply drop. Call down a high value supply drop here. Okay. What up, JG in the YouTube chat? We'll give it a try. Why not? Connection collapse in 15 minutes. Oh, Andy, literally right in front of me. Real people. Yep. out. You have your ping. Uh, yep. Ping out. Right in front of me. One kid. Just the one. He's down. Killed him. Oh [ __ ] Nice. No. Uh, no threats as of right now. No threats. Could be coming up soon. Just kind of bumped right into him. Oh [ __ ] Be prepared for robots. So I I still need bully ammo. Yeah, I have to give you some of mine unless that kid has some right to your right. Search it. I'll protect you. Oh, damn. This is the supply drop. Whoa. What the [ __ ] What the [ __ ] What the [ __ ] is that, dude? Real people. Really? Yeah. Oh [ __ ] I sniped him twice over here. I'm healing. Me, too. I'm going down. Let me in. Let you in. What? Can you open",
            "start": 7548.28
        },
        {
            "text": "What the [ __ ] What the [ __ ] is that, dude? Real people. Really? Yeah. Oh [ __ ] I sniped him twice over here. I'm healing. Me, too. I'm going down. Let me in. Let you in. What? Can you open that door? Oh, okay. I didn't know if you closed the door or not to use cover. Where are you? I'm right next to you. Okay, cool. I see them. What? They're right here. They They're on the ground level now. Coming towards us. Yeah, I think they're pushing. All right, I'm reloading everything. I still don't have bully ammo. I was interrupted during that. So, I only have a sniper here. Here, here. Here. One sec. F to drop. There's 100. Oh, yeah. Thank you. Close that door. I have 148 seconds until I can get that. Prepare for increased hostilements incoming. Anybody out there? I'm trying to jump. I can't see anything. Yeah, they're fighting over here. They're fighting at that same spot. They're fighting another team though. No, robots. Push forward right where you're at. There he is. Open that",
            "start": 7646.64
        },
        {
            "text": "can't see anything. Yeah, they're fighting over here. They're fighting at that same spot. They're fighting another team though. No, robots. Push forward right where you're at. There he is. Open that window. Oh, [ __ ] Like I said, they're fighting robots in there. I'm underneath crouching. I threw a poison round thing. Do you have your thing yet? Nope. 95. There's a one of these floating drones behind us also. The one with treasure on it. I'm right in front of these guys. What the [ __ ] Oh, someone sent out one of them spider things. M. That was my spider. Oh, they're shooting like right in front of us. Left to right, right to left. There might be a guy right in your right corner right when you turn around there. I have no angle cuz I'm trapped in here. Do you have it back yet? Nope. 60 seconds still. stepping in. I'm taking a look. Robots. They were looking right though, like at the wall to the right where those dead body bags are. Yep. They're shooting at the white. They're coming",
            "start": 7731.32
        },
        {
            "text": "seconds still. stepping in. I'm taking a look. Robots. They were looking right though, like at the wall to the right where those dead body bags are. Yep. They're shooting at the white. They're coming up on the black wall far right where we killed those dead bodies. Okay. 30 seconds until I can call mine. Yeah, they're right behind that. They're like right there. 24 seconds. I can call it. Who's shooting from the left side? That's robots. Don't let them see you. Yeah, pause it. Oh, I just Oh, [ __ ] That's all right. You're good. You're good. You're good. The actual people shot. Yeah, those are real people. Oh, yeah. Yeah, the actual people shot at me. I'm not trapped in a corner. I'm going to need you to protect me here. You got to light down fire. I'm going to have to come in there and you're going to have to close the door. Yeah. I'm going to die. Ready? Here I come. Close it. I have to shield up. Yeah. Watch the door. I'm dead. He uh threw a toxic grenade at me. Oh [ __ ] So be",
            "start": 7793.52
        },
        {
            "text": "you're going to have to close the door. Yeah. I'm going to die. Ready? Here I come. Close it. I have to shield up. Yeah. Watch the door. I'm dead. He uh threw a toxic grenade at me. Oh [ __ ] So be ready for that kind of action. Stealth engaged. 10 minutes remain. All right. So, they're still there. I think we back up. It's only two of us. They probably have three. Can we wrap somehow to the right? Yeah. Go out that door and try to wrap over there. There's like no angles for jumping or mantling out of here. Can you go back to where we started and then keep wrapping the right and I'll look out the door. See if they're still here. I can try. Oh, yeah. They're out. They're out further now. Come back. Come back. They're back at the big base. Okay. You can probably snipe them dead ahead up second level where we shot those kids. Imagine where we were before when we fought these kids down below and killed a bunch of them. That's where they're at. They're up and straight ahead. I hit broke",
            "start": 7852.96
        },
        {
            "text": "level where we shot those kids. Imagine where we were before when we fought these kids down below and killed a bunch of them. That's where they're at. They're up and straight ahead. I hit broke shield one. Good [ __ ] Broke armor. Ah, he downed me. But I broke the purple armor. Nice heals. They probably just have a [ __ ] ton of armor and stuff. [Music] Go outside. Wrap to left. It's just impossible. It takes forever. That's fine. We got time. We got time. [ __ ] go back. Yeah. Yeah. Go back. We wrap to left. We'll go find them inside. [ __ ] it. Take some more heals from these dudes. Oh my god. Do you Oh, that's eight minutes. I thought that said 10 seconds. I'm going say, \"Oh my god, dude. We just forgotten about the time in our battle.\" All right, I'm going to call out my uh once we get up to the top of these stairs, I'm going to call out my scam. Okay, we should be close. Hold on. Hold on. Hold on. Hold on. Hold on. What you got? What you got? I I was just I wasn't like fully",
            "start": 7919.28
        },
        {
            "text": "get up to the top of these stairs, I'm going to call out my scam. Okay, we should be close. Hold on. Hold on. Hold on. Hold on. Hold on. What you got? What you got? I I was just I wasn't like fully sprinting with you. I was like just sniping, kind of looking at the area. That's fine. Step on up with me, Dardy. Thanks for the raid. I'm going to call my scan right now. Ready? Scan out. No targets. Do they run? They're further back or they've moved. I hear them northwest or north 338 337. Over here. Where do you think you hear the I I hear gunfire like over here on A1. Really? Okay, let's go that way. Like it's further out in the distance. It's That's fine. Yeah. Yeah. [ __ ] it. I don't have a ping. Not for another two. 20 200. So, we're out for a while. Yeah. The the texture on this sniper is definitely broken. This doesn't look right. You think you heard gunshots out here? Like real far. Okay. Okay. Let's go. Where did these dudes go, though? I think they went over where I pinged",
            "start": 8000.56
        },
        {
            "text": "is definitely broken. This doesn't look right. You think you heard gunshots out here? Like real far. Okay. Okay. Let's go. Where did these dudes go, though? I think they went over where I pinged downward where I heard gunshots. Or maybe it is right. I don't know. It looks off. Nope. They're right here. Right there. Right there. Right there. Outside. Reinforcements. Oh, [ __ ] me. He sees you. He doesn't see me. Cracked him in the head. Didn't down him though. Throw out a spider drone at him. Going to wrap him hard. Keep the fire up or just keep him in a Oh, in in the second floor. 10 floor. I'm rapping. How How am I not hitting them? What the [ __ ] I thirsted one of them. The other one's in the window. Backside now. Backside now. Where are you? I wrapped him. I'm on the other side. Oh yeah, he's low. He got me though. That back window. I'm going to I'm just going to heal. He's looking at me. You're going to have to put down smoke. I Dude, I didn't do it in time. I didn't know you",
            "start": 8054.0
        },
        {
            "text": "yeah, he's low. He got me though. That back window. I'm going to I'm just going to heal. He's looking at me. You're going to have to put down smoke. I Dude, I didn't do it in time. I didn't know you That's all right. Damn it. [ __ ] We had a good engagement. We were God damn it. Real good. Uh with that kind of funny best friends. That's the end of your afternoon stream. Will you tell Barrett? He'll shut it down for us. Um that's your end of your kind of funny games afternoon stream. Tomorrow is Greg's birthday. So you won't see Andy or Nick. You'll see Greg, Joey, and myself celebrating all things Greg Miller. So come on down, celebrate Greg and play Monster Hunter Wilds with us as we give Greg the day he deserves all the fun he can handle. So come on back. We'll have a good time with that. And then of course next week we'll have a fun Mike and Nick week into Pokemon after that. So a lot of streams, a lot of fun, a lot of good times, plenty of weekend fun ahead as well. We'll see you",
            "start": 8115.68
        },
        {
            "text": "And then of course next week we'll have a fun Mike and Nick week into Pokemon after that. So a lot of streams, a lot of fun, a lot of good times, plenty of weekend fun ahead as well. We'll see you then. Uh thank you everyone for your support. Andy, you were a great teammate right there. We really crushed. We We were battling. That was fun. Make sure to cash in your uh your rewards and cash in your checks. And we'll wait for Bear for just a moment. If not, I'll turn it off. I can turn it off. I know. Turn off. You know the button. They got certain They got special buttons now. Yeah. Yeah. He said don't do it. They got special They said don't do it. They got special buttons. Uh with that, Bar and I and Andy say goodbye. Thank you all so much for your support. [Music]",
            "start": 8164.72
        }
    ]
}