{
    "id": 13925,
    "video_id": "_JPvcsqYPak",
    "show_name": "Screencast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Blessing Adeoye Jr."
    ],
    "title": "The Last of Us Season 2 Premiere SPOILERCAST",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page -  https://nwzo.io/click/dzexr/\nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\n\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1744662940,
    "duration": 3068,
    "transcript_chunks": [
        {
            "text": "[Music] [Music] It's been a couple years since I heard that intro and I just got the most major chills that in a while. That was good. That was damn good. Welcome back everybody to The Last of Us season 2 spoiler cast for episode 1. Of course, I'm your host Tim Gettys. I'm joined today by blessing Addio Jr. Good day Tim and Greg Miller. Good afternoon, Tim. Now, Greg, you were at the premiere of The Last of Us season 2. No big deal. Um I I know that you got to see an episode. Is this the episode you saw? And was this all that you saw? This was the episode we saw and this was all we saw. Yeah. Okay. Okay. a rip from your HBO Max. Have you watched Did you watch it again last night or I did not going off your two weeks agoish uh memories. Cool. Great. Great. Great. Um before we get into all of this real quick, I do want to say we're going to handle this the same way we handled the first season of the show. Uh but the rules are a little bit different now just because of what that means.",
            "start": 0.22
        },
        {
            "text": "of this real quick, I do want to say we're going to handle this the same way we handled the first season of the show. Uh but the rules are a little bit different now just because of what that means. Uh, for season 1, the rules were spo all spoilers for The Last of Us one game and The Last of Us one show, but we weren't going to get into Last of Us 2 spoilers at all. Uh, because we assumed that a lot of people were going to play Last of Us 2 for the first time after watching the show, jumping on, playing through the game, you get all that stuff. For this one, all spoilers are on the table for The Last of Us, period. Uh, obviously, we have played The Last of Us 2. We've been talking about The Last of Us 2 for years at this point, and I imagine the vast majority of people that are coming to kind of funny games uh to hear us talk about The Last of Us are looking for a perspective that comes from people that have played The Last of Us 2, especially because I imagine uh that the show is",
            "start": 69.76
        },
        {
            "text": "to kind of funny games uh to hear us talk about The Last of Us are looking for a perspective that comes from people that have played The Last of Us 2, especially because I imagine uh that the show is going to deviate from the game in terms of pacing and uh the the segmentation than uh a lot more than season 1 did. So, that's just letting everyone know that's where we're going with all this. So that essentially means all Last of Us media is on the table at this point. Um so just just letting everybody know that. Um of course this is the kind of funny Last of Us breakdown. Each and every week for the next seven weeks we will be doing these spoiler cast of each and every episode and I'm incredibly excited for all of that. You can get it on YouTube or Twitch live when we record them every Monday or you can get it later on podcast services around the globe. If you love what we do, please support us with the kind of funny membership. It gets you the show's ad free and you get a daily",
            "start": 109.44
        },
        {
            "text": "Monday or you can get it later on podcast services around the globe. If you love what we do, please support us with the kind of funny membership. It gets you the show's ad free and you get a daily exclusive Gregway. Today's is all about my Chicago trip and then my best and worst meet and greet experiences. Fun stuff. If you wanted to be a part of this episode, please YouTube super chat in. If you have any thoughts on episode one of season 2 or where you think the season might be going, please write them in and we will discuss them. Uh, a little housekeeping for you. You already got kind of funny games daily. That was Greg and I talking about Marathon's uh, pricing and that was mainly what we talked about a lot of like its positioning in the world. And then bless, you just did a games cast uh with Paris and Andy and Mike talking way more about Marathon. Yep. Just our reaction to all the Marathon content over the weekend. And then also Paris a couple years ago got to get hands- on with",
            "start": 155.92
        },
        {
            "text": "uh with Paris and Andy and Mike talking way more about Marathon. Yep. Just our reaction to all the Marathon content over the weekend. And then also Paris a couple years ago got to get hands- on with Marathon. So his perspective on it costing a premium price and all that. Yep. So you can check all of that out. And then after the screencast, the day is not done. We'll be jumping back into Marvel Rivals with a fun partnership with Nvidia, showing off all that DLSS4 with multi-frame generation AI powered tech that gives you up to uh for 440 frames per second in 4K uh with a top-end 50 series RTX GPU. So, if you want to see what a 50 series card looks like in action, stay tuned as Mike and Andy play some of that Marvel rivals right after all of this. Thank you to our Patreon producers, James Hastings, Casey Andrew, and Carl Jacobs, and Omega Buster. Today we're brought to you by Imperial Factor and Shady Rays, but we'll tell you all about that later. It's time to get into The Last of Us",
            "start": 198.56
        },
        {
            "text": "Hastings, Casey Andrew, and Carl Jacobs, and Omega Buster. Today we're brought to you by Imperial Factor and Shady Rays, but we'll tell you all about that later. It's time to get into The Last of Us season 2 premiere. Taylor dealer dealer dealer. Season 1 had nine episodes. Season 2 will have seven. Uh, and season 3 has officially been green lit as of a couple days ago. Uh, this episode is called Future Days, named after what? The Pearl Jam song, of course. That's true. That's true. Future Days. uh written and directed by Craig Maisin and uh came out April 13th, 2025. Bless, I want to start with you. What did you think about this season opener and we're going full spoilers for full spoilers from the get- go for the game, for the show, for anything you want to say about Last of Us. Hell yeah. Uh absolutely loved this episode. It is great to be back after being away for what, a couple years at this point since Last of season 1 came out. I've not rewatched season 1 since then. So to be",
            "start": 241.52
        },
        {
            "text": "Uh absolutely loved this episode. It is great to be back after being away for what, a couple years at this point since Last of season 1 came out. I've not rewatched season 1 since then. So to be thrown back into season 2, episode one, it is a reminder of, \"Oh, Pedro Pascal can act his ass off. Oh, Bella Ramsay is good at this. Oh man, these guys have a like casting and direction that is just very good at interpretating or interpreting interpreting what the video game did. Uh, but finding a way to make it fit within the cast they have, the characters they have. There are slight differences that I think make sense because of, you know, who the characters are, who they're being played as. Bella Ramsay being a bit more I don't even know if scrappy is the right word. I don't I don't even know if Pharaoh is the right word, but there's something there's something about Bella Ramsay and her like from the getgo being like, \"Yo, stop pulling punches.\" All this [ __ ] right? Like them starting",
            "start": 291.36
        },
        {
            "text": "if Pharaoh is the right word, but there's something there's something about Bella Ramsay and her like from the getgo being like, \"Yo, stop pulling punches.\" All this [ __ ] right? Like them starting obviously they're trying to build she's a different Ellie. She's a different Ellie and they're trying to build her up of like no this is a she can still be scrappy. Like this is who she is. Even though like she doesn't look like the same Ellie that we know from the video games, they're painting this picture of but this is the Ellie that she is and this is how she's going to end up being the threat to everybody in the room, right? Kind of thing. Um I like the new characters they introduced. Um the I don't know the name of the actress that's playing Dena, but I really liked her chemistry. Isabella Merrced. Isabella Merced Web fame of course Superman, of course. Um but yes, I love her um her chemistry that she had with Bella Ramsey on screen. I think it worked really well. Uh, but I think the",
            "start": 333.12
        },
        {
            "text": "Merrced. Isabella Merced Web fame of course Superman, of course. Um but yes, I love her um her chemistry that she had with Bella Ramsey on screen. I think it worked really well. Uh, but I think the thing that I like mo most were the ways in which they used this episode to set up kind of the tone and the direction of the rest of the season. There's a lot of um foreshadowing happening. Uh, Tommy's kid doing the pew pew at Joel. I'm like, \"All right, you're messing around, kid. You're doing too much now.\" U, but I I I like that. I like the expedition of the stalkers. I thought that was very entertaining. Um, and overall, oh, the therapy scene, I think for me was by far my fa my favorite addition uh to this opening sequence of uh this season two, right? I think getting that back and forth of uh Joel and the therapist and like the therapist being, you know, not therapist like obviously cuz she has [ __ ] to get off her chest, but using that as a way to flip it around on a like on, hey",
            "start": 365.2
        },
        {
            "text": "of uh Joel and the therapist and like the therapist being, you know, not therapist like obviously cuz she has [ __ ] to get off her chest, but using that as a way to flip it around on a like on, hey Joel, like say what's on your mind like you got something you're hiding and Joel struggling so much with that. I think just did so much for Pedro Pascal's um performance of Joel and honestly like has me kind of concerned is the wrong word, but I am when he's gone from the season, I'm going to be so sad. You know what I mean? Like I expect that to happen probably by next episode and we're going to get flashbacks. We're going to get all that stuff. But once he's out, I'm going to be like, man, I hope I'm not going to miss Pedro Pascal a lot because he's doing such a good job in this first episode. So that's my impression. Greg, I mean, echo everything he just said, right? What a fantastic episode of television, period, let alone an adaptation of the Last of Us. I think the things they do,",
            "start": 413.92
        },
        {
            "text": "So that's my impression. Greg, I mean, echo everything he just said, right? What a fantastic episode of television, period, let alone an adaptation of the Last of Us. I think the things they do, the choices they make here, I think make for a I don't want to say stronger product, but as somebody who knows the game so well, definitely a Oh, oh, this is interesting. I like what they're doing here. I like the way they're fleshing out the stuff and the characters here, right? I really love uh getting to see Joel with his the glasses on trying to figure out just building, right? He's construction. That's what he was before. Here he is. That's what he contributed to Jackson. Obviously, the Catherine Hara scene, the the therapy session is just I give me an entire show of that, right? Like so well done. Her being a little bit drunk and very angry and feeling it out and saying it, right? Him being all the way up to that edge, having the weakness and then swallowing it, right? The one tier. I",
            "start": 457.44
        },
        {
            "text": "done. Her being a little bit drunk and very angry and feeling it out and saying it, right? Him being all the way up to that edge, having the weakness and then swallowing it, right? The one tier. I saved her and leaving, right? Like so [ __ ] good. And like that being what gets him, not the talk of Eugene, right, of of her being mad about that. I know where I assume we're gonna get that in a flashback, right, of Eugene being infected. Joel had to kill him. That's what it is. That's where it goes from. Loved all that. And then, yeah, I think especially to what Bless said there, Bella Ramsay's Ellie not being the Ellie from the game, being a much more angry, visibly angry Ellie. I loved the little droplet in the front there of like, okay, cool. Yeah, they do these MMA barn fights, right, where they are training. They this is what their world is. She needs to be ready for that and yeah, don't pull the punches. Don't do these things. Just the anger inside her and then Joel, you know,",
            "start": 498.72
        },
        {
            "text": "where they are training. They this is what their world is. She needs to be ready for that and yeah, don't pull the punches. Don't do these things. Just the anger inside her and then Joel, you know, trying to express that to Dena and then getting more of that, well, it's just, you know, 19 year olds and their dad or parents, right? Even Joel acknowledging that the having that conversation there, I think does such a nice job of fleshing out Joel and Ellie's relationship where we are, let alone the fact we haven't jumped into them doing things out of order, right? And us getting Abby. Here is Abby. Here she is. Here is the conversation with everybody in the aftermath of the murders, right? And what will set them off in their journey, which I think immediately does what we've all talked about leading up to this, makes her more sympathetic. Makes them more sympathetic. We might still like Joel and Ellie more, but you at least understand where they're coming from now and see them in a",
            "start": 546.16
        },
        {
            "text": "about leading up to this, makes her more sympathetic. Makes them more sympathetic. We might still like Joel and Ellie more, but you at least understand where they're coming from now and see them in a parallel journey to them that I don't think we got in the game necessarily. Tim loved it and, you know, I don't think it's any surprise. I really loved season one for uh how true it stayed to the games, but then also for the changes it made to adapt it to TV. I don't think every single thing was perfect in the game or in the uh the show, but I think that uh going into this one, I wasn't concerned, but I was very interested on what choices are you going to make to make this work for TV. And so far, they've really succeeded in that. I think that showing us the um Abby stuff so early, but also not showing everything was a really wise call. Like having the giraffes be seen like and us knowing what that meant of like time and place of like, oh [ __ ] they're in Salt Lake City. like this is",
            "start": 588.08
        },
        {
            "text": "not showing everything was a really wise call. Like having the giraffes be seen like and us knowing what that meant of like time and place of like, oh [ __ ] they're in Salt Lake City. like this is this is probably right after the the Ellie stuff or like the the results of the end of the the first game. I'm like, \"Oh, this is cool. I can't believe they're doing it this way.\" But they didn't necessarily show it was Aby's dad, the doctor. You know what I mean? Saving that, right? Like Yeah. Exactly. And I I I think that that's that's smart because it get gives us enough to go off with this group and understanding the motivations, but it's still leaving the opportunity for a kind of like very like oh [ __ ] moment to come later in the season. Uh, but the thing I appreciate most about the show in comparison to the game is video games to me, these narrative story Naughty Dog games, their stories are so powerful because of the little off off remark comments that characters make to each",
            "start": 627.6
        },
        {
            "text": "show in comparison to the game is video games to me, these narrative story Naughty Dog games, their stories are so powerful because of the little off off remark comments that characters make to each other as they're just walking around the world. You're just climbing stuff and there's little like quips back and forth and like that kind of like is what to me really makes the the world and story of these games like sing so much. The plot is amazing, too, but I feel like that's the real story of it. And adapting that to a show is kind of difficult. But I think that adding things like the therapist scene and allowing us to have that conversation with uh Joel and uh Tommy's wife uh talking about the refugees, like they're really, I think, recontextualizing Jackson and the world that we know to set up familiar story beats, but done in different ways. Like I imagine now Abby and the crew are going to kind of come in as like refugees showing that Joel is wrong uh about wanting to or that um",
            "start": 671.04
        },
        {
            "text": "set up familiar story beats, but done in different ways. Like I imagine now Abby and the crew are going to kind of come in as like refugees showing that Joel is wrong uh about wanting to or that um that he's kind of right about pushing back on letting people in. But it's the the irony of um him probably going to be taken down from the inside if they change stuff if I'm right about all that. Right. Yeah. Um, but I like that because I think it just adds depth, especially with, you know, political situations going on now of like trying to take a story that can be timeless in so many ways, but make it make sense in a different medium. And so far, I think that Craig and Neil and the team have just done a perfect job of adapting what matters about the game, but also changing it enough so it's not just the exact same thing. Because I think we could all look at Last of Us 2 and be like, there's some messy parts. There's some stuff we don't love. And more than that, just like not in terms of",
            "start": 715.68
        },
        {
            "text": "not just the exact same thing. Because I think we could all look at Last of Us 2 and be like, there's some messy parts. There's some stuff we don't love. And more than that, just like not in terms of critical reception, but in terms of like emotional things, I'm like, \"Oh man, like I know you had to do that, but I wish you didn't do that.\" Like I wanted more Joel in Last of Us 2. Like, and I feel like we were robbed of him so quickly in the game. And I get the point of that, but even just the conversations we have from Pedro Pascal's Joel in this episode, I feel like does a I don't want to say better, but what it does different I really liked uh compared to the Last of Us 2 Joel in Jackson conversations and stuff we got in the game. And if we continue to get that level of this is a different Last of Us 2, but it's still Last of Us 2, I can't complain at all. Yeah. I mean, it's interesting to see uh this is Last of Us 2, but it's a different Last of Us 2. and what other tricks and",
            "start": 760.48
        },
        {
            "text": "Last of Us 2, but it's still Last of Us 2, I can't complain at all. Yeah. I mean, it's interesting to see uh this is Last of Us 2, but it's a different Last of Us 2. and what other tricks and twists they have up their sleeve and how much more time we're going to get, right? Like we're already playing with the timeline in a very interesting way. Uh, you know, I I one of the first things when we were out of them the theater, me and Jen, I was talking about I was like, well, keep in mind, too, like, you know, when Ellie comes back after the barn dance, she's supposed to talk to Joel there, right? We're supposed to get their final interaction. The I don't know if I can ever forgive you, but I want to try. And so, the fact that you didn't get that, right? Bella walks back to her uh garage apartment, which I never put together was next to Joel's house. If it was in the game as well, I thought that was an interesting uh but if we don't get that now or are we going to get that later? Like",
            "start": 799.16
        },
        {
            "text": "which I never put together was next to Joel's house. If it was in the game as well, I thought that was an interesting uh but if we don't get that now or are we going to get that later? Like what's the next day look like? What does episode two look like when we wake up? Let alone the fungal network coming out of the pipe, right? Like a big change of that like we're about clearly the shit's going to go which we've seen of them running at the walls, but we're going to get an even bigger I think attack on Jackson than I was ready for. What do you think that is like as far as how they're setting up the rest of the season? Because at some point Ellie and Dean are going to go to Seattle, right? We're going to get that story. But is the fungal network in the pipes a way to have us cut back to Jackson over time and like have that still be a Bplot? I think I think that happens pretty quick. Do you think Jackson falls because of it or do you think it is just like part of the the Abby attack on",
            "start": 840.24
        },
        {
            "text": "over time and like have that still be a Bplot? I think I think that happens pretty quick. Do you think Jackson falls because of it or do you think it is just like part of the the Abby attack on uh Aby's crew attack on like Jackson or on Joel? I don't think it falls. I think it takes a big hit though and we lose a lot of people. I I imagine it'll be a way to get Abby and the squad into Jackson and like like maybe they're even like running from the big horde of people and like which I think we've kind of seen, right? Yeah. Some of it. But I imagine then Jackson like allows them to come in and then it's a very similar thing to what we saw in the first game, but instead of Joel being out on patrol, it's more just the threat coming to them. You get what I'm saying? Yeah. And having that whole thing of like him saying the name immediately reacting in a way like it's just a question of like where and how like where's the event going to go down, you know? I'll be interested to see if they get",
            "start": 871.36
        },
        {
            "text": "of like him saying the name immediately reacting in a way like it's just a question of like where and how like where's the event going to go down, you know? I'll be interested to see if they get him in like you're talking about ahead of time. I still think it'll happen offsite. But I still think it'll happen over at the whatever that ski lodge was where the whole showdown happened cuz I feel like even what we've seen we've seen enough that it looks like that and it looks like I don't remember saying it but maybe yeah if we did then well like we've seen uh Dena and Ellie in like the basement weed thing. No. Or am I making that up? Yeah. But like them being like I feel like they've already set up them going on like recon missions which I guess they did in the game too but for some reason I don't get the vibe that Joel's going to go out on a recon thing. Okay. But I could be wrong on that. But I I just feel like the Jackson in the show seems a bit more expansive than the Jackson in the",
            "start": 911.12
        },
        {
            "text": "don't get the vibe that Joel's going to go out on a recon thing. Okay. But I could be wrong on that. But I I just feel like the Jackson in the show seems a bit more expansive than the Jackson in the game. So there could be a ski lodge looking thing in Jackson, you know? Yeah. I think the fact that they also have Joel on construction duty uh is a very interesting framing of who his character is and what he means to uh Jackson cuz Yeah. Like that strikes me as like, okay, that's your thing. Like that's your job. Maybe you're not going to go on recon. Unless there is like a specific reason why you I think the thing I think would be right that Ellie and Dena go out again, you know, get separated from their group. They they, you know, they do the thing where they hole up during the storm and that when word gets back that uh Ellie's ex-girlfriend, right, the only other one uh shows up and she's like, \"Yeah, they're out there.\" I think that that kicks Joel into I saved her mode and he goes",
            "start": 948.56
        },
        {
            "text": "that when word gets back that uh Ellie's ex-girlfriend, right, the only other one uh shows up and she's like, \"Yeah, they're out there.\" I think that that kicks Joel into I saved her mode and he goes out. Got it. Yeah. Yeah. Totally. And I mean, well, now there is the thing of like the the fun reveals of Eugene, who was the the weed guy from the game that gets a very bill in terms of game storytelling uh thing in the game. Now, we know that that is a way more important character to the show because of Katherine O'Hara's uh relationship to him, but I love the idea that the show is going to probably use that as a Bill episode type thing. I wonder with the limited run time of seven episodes, I don't expect to see a full Eugene episode, but maybe they combine it like with flashbacks when we do see the the weed like when they're smoking smoking [ __ ] You know what I mean? Maybe we get like the cuts to to kind of explain that like maybe they read something that says Eugene or whatever and",
            "start": 984.8
        },
        {
            "text": "see the the weed like when they're smoking smoking [ __ ] You know what I mean? Maybe we get like the cuts to to kind of explain that like maybe they read something that says Eugene or whatever and it like cuts to that. But I'm so excited because we know it's Joey Pants, baby. Bad Boys, let's go. You know who John was? No. Oh, the you know Joey Pantanello from Bad Boys. He doesn't know any We've covered You're right. You're right. You're right. I don't know celebrities like that. Joey Pantanello. Uh I I always jump to the Matrix. And the Matrix, too. Oh, this guy. Yeah. Yeah. That's Eugene Cyer. Oh, Cyer. Good for him. Yeah. Good for Um, I like the a lot of the framing of the episode, the central tension being around um, Ellie being mad at Joel and kind of how they kind of keep that a mystery slash like you as audience member, you kind of know what's going on, right? You kind of understand like where this comes from, but so much of the town being like, what's your beef? And that",
            "start": 1032.88
        },
        {
            "text": "a mystery slash like you as audience member, you kind of know what's going on, right? You kind of understand like where this comes from, but so much of the town being like, what's your beef? And that culminating to the um church dance scene of I love how in this one Joel [ __ ] just shoves a dude straight to the ground instead of just like I think in the game it was like just a light like hey man like kind of kind of thing. Um, Ellie blowing up on Joel in that dance scene hit so much for me, but also like it's such an interesting place we're in for Ellie's character where like this is a show that is going to end up being about anger and rage and revenge in the same way that the game is about anger and rage and uh and revenge. But so far, I think they are putting Ellie's character in a very interesting place. I guess just in the eyes of the audience and the people around her where so much of this episode I love Bella Ramsay's performance as Ellie, but the decisions that Ellie's making",
            "start": 1077.84
        },
        {
            "text": "interesting place. I guess just in the eyes of the audience and the people around her where so much of this episode I love Bella Ramsay's performance as Ellie, but the decisions that Ellie's making as a character I'm looking at and I'm like you got to chill. You're doing too much right now as a character. No, I really I do appreciate her. Like she she feels like a a very off version of Ellie and I like that. I like that it it feels different from what we got in the game cuz I think that allows them to kind of tap into that teenage emotion that sure the game has, but already I feel like we're getting something from this that the relationship between this version of Joel and this version of Ellie feels grounded in like such a way that obviously the the betrayal that he has and especially this episode starting with uh the reshowing the very end of the the first game and the end of the first season of like like like do you promise me that like that you and he just straight up lies and to",
            "start": 1123.68
        },
        {
            "text": "episode starting with uh the reshowing the very end of the the first game and the end of the first season of like like like do you promise me that like that you and he just straight up lies and to see how much it's affecting him like every single scene you see the guilt on Pedro's face like I think that it just allows a a back and forth between those two characters to be again just so much more grounded and real and then adding the Dena factor the Isabella Merced's performance as Dena is like impeccable and her back and forth and relationship with Joel is I think it so additive additive to showing the differences between like I get like the triangle we have going between those three characters I just think is very smart because I think it contextualizes the realities and complications of parental dynamics you know relationship dynamics like just relationships period any type of relationship not just romantic um but putting that in an apocalypse where there is so much danger where",
            "start": 1169.12
        },
        {
            "text": "of parental dynamics you know relationship dynamics like just relationships period any type of relationship not just romantic um but putting that in an apocalypse where there is so much danger where there's literal monsters outside and this little kid um the son of Tommy and and his wife is you know like growing up like crashing playing with toys and crashing planes. Like, how does he even know what that is, you know? Like, I don't know. I just think that like the every single thing in the show feels so deliberately chosen to like back up the themes of it all. And for a story we know so well where the themes are kind of revenge and all this stuff, this episode one, I really liked that the themes were kind of just finding your your place. And they even said in the um the little post show thing like perspective like it's all about the perspective of who are the heroes, who are the villains. And before we even get into the true dynamics of heroes and villains, Joel is a villain to Elliot",
            "start": 1217.16
        },
        {
            "text": "like perspective like it's all about the perspective of who are the heroes, who are the villains. And before we even get into the true dynamics of heroes and villains, Joel is a villain to Elliot right now. Like I think that like even that is just such an interesting dynamic that they they did a masterful job of getting like I they How long was the episode? Like 50 minutes. They I think they spent that time well as far as building up a variety of tensions because there is the tension between Joel and Ellie. There's a tension of at the very beginning they introduce Abby and she the quote was uh when we kill them or when we kill them we kill him slowly. So you know there's this looming threat of somebody who wants to [ __ ] skin Joel practically. You have the looming threat of the stalkers and and this new u uh strand of you know uh um of infected forming that are smarter that which immediately becomes so scary as a viewer right and then you also have the looming threat of the stuff",
            "start": 1259.68
        },
        {
            "text": "and and this new u uh strand of you know uh um of infected forming that are smarter that which immediately becomes so scary as a viewer right and then you also have the looming threat of the stuff coming through the pipes and what's about to come and in infect Jackson right like it is an episode that is about showing the perspective and showing all these like okay this is where we're at now these are the relationship between the characters this is how they gone all this stuff there's a lot of comfort in the episode but then just a bunch of looming things that I think just do a great job of having me like, \"All right, what when are things about to blow up?\" Setting the stage, right? Really setting like all these different little traps that you know are going to go off. The the tension in the fear because we're concerned about these characters because we care about them because they set them up well, I think is the the greatest compliment to give to the show like uh watching it with Gia",
            "start": 1297.28
        },
        {
            "text": "fear because we're concerned about these characters because we care about them because they set them up well, I think is the the greatest compliment to give to the show like uh watching it with Gia who does not know the story of the game and so it's it's fun to like see like how is this going to resonate with somebody that like doesn't know what's happening. She was so riveted by all the little dynamics that by the time um they have that conversation with Jesse and they're kind of like giving him some attitude and they like head out on the horses um with uh with Cat as the the leader and stuff, she was just like, \"I'm so stressed about this dynamic like all of these charact like what's happening here?\" And she was stressed about um Dena not reciprocating feelings for Ellie. So that by the time that they they had their kiss and all that stuff, she was like, \"Oh my god, thank God.\" And I'm like, damn, the show did a good job of setting it up that she's not worried about them dying and",
            "start": 1334.48
        },
        {
            "text": "time that they they had their kiss and all that stuff, she was like, \"Oh my god, thank God.\" And I'm like, damn, the show did a good job of setting it up that she's not worried about them dying and stuff. She's worried about people having finding love. You know what I mean? I was like, damn, they did a good job to to get there already. Oh, yeah. I agree with that. Um, before we keep going on though, here's a word from our sponsors. This episode's brought to you by Imperial. We've told you all how important it is to developers to wish list games you're interested in on Steam. So, if this game sounds cool to you, make sure that you wishlist it. In Imperial, you play as a mercenary sent to a distant planet to discover the mysteries of an ancient civilization. Powers unknown lie within the monolith, but those are no mere ruins as an expedition has already ventured inside with only a few survivors. Why was it built? What powers reside within? Who is at the center of the monolith? All these",
            "start": 1371.76
        },
        {
            "text": "but those are no mere ruins as an expedition has already ventured inside with only a few survivors. Why was it built? What powers reside within? Who is at the center of the monolith? All these secrets and more will be uncovered if you are brave enough to take on Imperial. Imperial features a unique blend of RPG systems and skill-based combat across three weapon archetypes. The acrobatic glaive, the defensive but devastating mace and shield and the powerfully ranged cannon. With a deep ability system, extensive customization, every battle is an opportunity to refine and optimize your combat style. Form relationships with each of the few surviving expedition members who all have their own personal quest lines. Whether you choose to help or not can have drastic consequences for them. The monolith is guarded by powerful automatons, each with distinct attack patterns and weaknesses that demand precise execution and strategy to be victorious. Create your mercenary, enter the monolith, learn",
            "start": 1414.48
        },
        {
            "text": "is guarded by powerful automatons, each with distinct attack patterns and weaknesses that demand precise execution and strategy to be victorious. Create your mercenary, enter the monolith, learn powerful abilities, defeat the automatons, and uncover the secrets that lie within Imperial. Imperial is available May 8th on PC, Xbox SNX, and PS5, but you can wishlist now. Do it. Wishlist Imperial. This episode is brought to you by Factor. Make this your best season yet with nutritious 2-minute meals from Factor. Eating well has never been this easy. Just heat up and enjoy, giving you more time to do what you want. Greg Miller has been loving how simple it is to enjoy his Factor meals as he's rushing between shows each day. I just saw Blessie eating some, too. Factor arrives fresh and fully prepared. Perfect for any active, busy lifestyle. Factor powers your day with satisfying breakfast, onthe-go lunches, premium dinners, and guilt-free snacks and desserts. Factor can help you feel your",
            "start": 1464.8
        },
        {
            "text": "Perfect for any active, busy lifestyle. Factor powers your day with satisfying breakfast, onthe-go lunches, premium dinners, and guilt-free snacks and desserts. Factor can help you feel your best all day long with wholesome smoothies, breakfast, grab-and-go snacks, and more add-ons. Multiple people here at Kind of Funny have been loving their experience with Factor. And guess what? You can, too. Get started at factorymeals.com/kindfunny5050 off and use code kind offunny50 off to get 50% off plus free shipping on your first box. That's code kind offunny50 off at factormeals.com/kindafoney5050 off for 50% off plus free shipping. This episode's brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized shades that won't break the bank. Shady Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people. They have hundreds of options to",
            "start": 1513.6
        },
        {
            "text": "polarized shades that won't break the bank. Shady Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people. They have hundreds of options to choose from, so you're bound to find the perfect pair to match your style. If you don't love your shades, exchange them for a new pair or simply return worry-free within 30 days. There's no risk when you shop. Their team are always there to have your back with personal and fast support. Y'all know I've been outside a lot playing Pokémon Go and it's such a great experience wearing Shady Rays when I'm out and about looking dope. Exclusively for you, Shady is giving out their best deal. Head to shadyrays.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. again. Go to shadyrays.com, use code funny to get 35% off polarized sunglasses. And we are back. Uh, one of my favorite things about video game adaptations, specifically",
            "start": 1561.44
        },
        {
            "text": "stars by over 300,000 people. again. Go to shadyrays.com, use code funny to get 35% off polarized sunglasses. And we are back. Uh, one of my favorite things about video game adaptations, specifically recently, is how they can just recreate moments from the games like so perfectly. I think this episode has so many amazing examples of that. Specifically, the dancing like, oh my god, getting the same band from the games to to be here. All was there too. Incredible stuff. Like so. And also shout out to the soundtrack like already the classic bangers are there but like they're going off for the score on this uh show. Very very into it. I love the themes from whenever we have Aby's people on the screen. It's like oh that totally different vibe than the Ellie stuff. And I think it's super cool. But another thing I love is how video game moments and video game elements are translated through the mediums. And sometimes they can be super corny like Doom going to like first person mode and all",
            "start": 1607.76
        },
        {
            "text": "But another thing I love is how video game moments and video game elements are translated through the mediums. And sometimes they can be super corny like Doom going to like first person mode and all that stuff. But the way that they so popped off though, of course. Of course. Uh but the the way that this show is handled, that stuff has always impressed me. I really in this episode though, love the them jumping on the van to get into the the building. Like things like that, I was like, \"Oh, that feels like playing Last of Us.\" But the entire scene of Dena and Ellie uh kind of like calling out to each other like how they're going to throw the bottle and kill the uh the clicker and all that stuff. like you know like fun great stuff that felt like playing the game of having the back and forths but then the introduction of the stalker that was so that felt like playing Last of Us like they did such a good job of you see it in the background a little bit you're like what's going on like I",
            "start": 1652.64
        },
        {
            "text": "but then the introduction of the stalker that was so that felt like playing Last of Us like they did such a good job of you see it in the background a little bit you're like what's going on like I totally even forgot I was like it looked like an animal and I'm like that's not an infected animal what are we doing here and then just like the way that it all played out I was like oh yeah it's a stalker that's great yeah I like the sounds that I was making right cuz like obviously like it's I forget if we the kind of infected that got introduced in the first season cuz they do a lot of conflating of the game in the show. It's hard. Yeah. And I forget if we had ones in the first season that were just like had just like the grunts like the human like like that kind of boning up. Yeah. But the way that like the stalker was sounding felt very like felt ominous. Felt like oh [ __ ] like this is scarier than a clicker. Like the way that it's talking and the way that it's groaning and then yeah",
            "start": 1695.36
        },
        {
            "text": "that like the stalker was sounding felt very like felt ominous. Felt like oh [ __ ] like this is scarier than a clicker. Like the way that it's talking and the way that it's groaning and then yeah the fact that Ellie's like run at me and then goes the other way chased after it. Can't see it. And we've seen this a million times in TV shows, especially horror [ __ ] or like post-apocalyptic [ __ ] with zombies, of yeah, just the thing is behind you. Oh, you got to turn around, Ellie. Ellie, turn around or you're going to get got, right? But like, I don't know. It didn't It didn't feel cliche if it didn't feel like, oh man, I've been there, done that kind of thing. I think they played it very very well here. Well, I think the reason for that is it wasn't just like, oh, jump scare, it's behind you. It's like, oh, it's stalking her. like it was hiding and it was like purposefully like going behind her and I like trying to get the jump on her like acting more human and the fear that that",
            "start": 1732.4
        },
        {
            "text": "you. It's like, oh, it's stalking her. like it was hiding and it was like purposefully like going behind her and I like trying to get the jump on her like acting more human and the fear that that brings to Jackson when they're like yo they're getting smarter and it's like they don't know what that means they don't know is it all of them like what's happening like the fact that they're this many years into the apocalypse and are still learning things about uh the the monsters out there like that's terrifying you know and we know in the game like where that potentially goes but I thought that stuff was very well done and legitimately was scary to watch. Like this is the type of thing I was thinking about Andy the whole time where I'm like, how is Andy going to handle this [ __ ] Like this is like legitimately a terrifying scene. Yeah, I will say my my one beef with the scene. Here we go. And this I think most of my beasts with this episode, not that I have many beefs, right? But the",
            "start": 1770.96
        },
        {
            "text": "is like legitimately a terrifying scene. Yeah, I will say my my one beef with the scene. Here we go. And this I think most of my beasts with this episode, not that I have many beefs, right? But the ones that I have mainly have to do with Ellie's character of like you're jumping on the back of this clicker and just stabbing it and I'm like, man, we got to be smart in this. Like pick up pick up the shotgun and shoot the thing in the in the head. like this is you're like getting too close and I understand it's the feeling of this goes back to her and earlier in the episode, you know, yelling that I'm immune, right? Like she is having this moment of like I can do anything kind of thing. And I'm sure that is what they're trying to do here of she's hopping on the back of it because if she gets bit like who who gives a [ __ ] right? Who cares? She's fine kind of thing. But even still, I'm like there's worse things than getting bit. Like you can get your guts [ __ ] torn out by this thing and",
            "start": 1808.32
        },
        {
            "text": "like who who gives a [ __ ] right? Who cares? She's fine kind of thing. But even still, I'm like there's worse things than getting bit. Like you can get your guts [ __ ] torn out by this thing and you're hopping on his back. Yeah. Same thing what Tess told her in season one, right? Of like you can still be torn apart or whatever. that you don't have to worry about it. You don't have to worry about infection but you still be killed by these things. Yeah. And again, it comes back it I think it's me getting used to it being a different Ellie cuz even her chasing after the her and Dena, right, chasing after the blood and the dude the um folks behind them being like, \"Oh, we got to we should be reporting this, right?\" And like the immediate kind of thing they're building into the character. I'm just looking at this and I'm like, \"Ah, you're making me not like Zelli as much as I should like the Zelli.\" And well, should you like Ellie that much? That's the other thing. I don't think I mean I",
            "start": 1844.64
        },
        {
            "text": "just looking at this and I'm like, \"Ah, you're making me not like Zelli as much as I should like the Zelli.\" And well, should you like Ellie that much? That's the other thing. I don't think I mean I think we want to because we love her from the game and we know so much about it already but I and I think obviously Bella Ramsey is great but I think there is a part they want you going like what the [ __ ] man because again I think the Ellie you're seeing that is so angry right now and so jaded goes back to my point that Joel's the bad guy that he robbed her of this opportunity she probably feels like she shouldn't even be alive right now what's the point of it so she is being a lot more like [ __ ] fullon punch me I want to feel I do this I'm going to go yeah I'm going to chase this thing yeah I'm going to shoot this Yeah, I'm going to go this way. Again, jumping on the back of the clicker I think was a little bit because it started to go haywire, right? Wasn't it starting to go a little",
            "start": 1878.64
        },
        {
            "text": "I'm going to shoot this Yeah, I'm going to go this way. Again, jumping on the back of the clicker I think was a little bit because it started to go haywire, right? Wasn't it starting to go a little bit sideways where she needed to act? I thought No, I think that was the point cuz like Dena or I forget which one of them threw the bottle to like attract the clicker and then Ellie just like kind of straight up runs to it and just again I think it is just being a hot shot devil may care who and I this is the whole point right of like okay cool I can't be hurt but or I can't be infected so I'm playing fast and loose with it and her getting bit god and having to like like cut it later was just brutal so hard to watch that stuff but I mean it is interesting how they're going to play with the the sport stuff cuz in the the game it was for stuff at this point, right? Or did she get bit? What do you mean? In this this uh bit of the in Last of Us 2, like what happened to her? I don't remember",
            "start": 1913.2
        },
        {
            "text": "sport stuff cuz in the the game it was for stuff at this point, right? Or did she get bit? What do you mean? In this this uh bit of the in Last of Us 2, like what happened to her? I don't remember her getting bit. The spore stuff is later on in the tunnel when she's confronting the woman in the red light. She's like, \"You're not.\" She's like starting to die. The other woman's like sucking in the spores and dying. She's like, \"You're fine.\" Like, yeah. And I think there was another moment that you might be thinking of too where I think her and Dena are going into a sport thing and Dena tried to like give Ellie her um face mask or whatever and Ellie's like I think takes hers off be like I'm fine. I'm fine. I'm fine. Like I can breathe this [ __ ] Yeah, that's that's like that's in Seattle, I'm pretty sure. Oh, that's right. That's right. Yeah. I'm I'm so interested in how they're going to intro reintroduce the spore stuff into this cuz they it was in the trailer and they've been talking",
            "start": 1948.16
        },
        {
            "text": "pretty sure. Oh, that's right. That's right. Yeah. I'm I'm so interested in how they're going to intro reintroduce the spore stuff into this cuz they it was in the trailer and they've been talking about getting it in here cuz obviously the whole network of the fungal network stuff is new to the show and like them continuing it in the the pipes which was great because even in the beginning of the episode when we see I think it was Dena like break the pipe open and like looking through it all I was like well where's this going and it's like oh damn like the where do you guys think it's going like is that is there going to be I think that's what's going to set up I think we're going to get this two levels of action where you'll have the action of what's happening with Joel, Abby, Ellie, all over there. And I think then you have someone that finally creeps through and someone steps on it. Someone hacks the pipe and hits it and that sets off the vibration waves all the way back that Yeah.",
            "start": 1986.4
        },
        {
            "text": "over there. And I think then you have someone that finally creeps through and someone steps on it. Someone hacks the pipe and hits it and that sets off the vibration waves all the way back that Yeah. Okay, that makes sense cuz Yeah, we did get that shot of Tommy with the big ass flamethrower, right? So that that would make sense then of Yeah. Tommy being at home. Oh man. Oh no. Well, Tommy's there. Was that in like the post um show like season trailer or was that in the show? No, no, no. This was the uh um the show the the like coming up this season on HBO trailer from uh a month ago or so. Yeah. Um yeah. Oh, that's so interesting. Also, I love Tommy. Like the like I forget the actor, but man, so good. Him uh uh lying to Joel when Joel's like, \"You're just shooting by him by yourself.\" And he's like, \"Yeah.\" Like I I just I like a lot of the dynamics uh that they're painting between Tommy and Tommy and Ellie. even getting uh Joel and Tommy and Maria's son, right, of like just hanging",
            "start": 2022.96
        },
        {
            "text": "he's like, \"Yeah.\" Like I I just I like a lot of the dynamics uh that they're painting between Tommy and Tommy and Ellie. even getting uh Joel and Tommy and Maria's son, right, of like just hanging out like them. They're painting a lot of these familial slash like friendly dynamics that we know are going to get [ __ ] up here pretty soon. Oh, yeah. Um but I don't know. I I like getting to see these sides of the characters. Again, it fleshes them out. I mean, the show's doing a great job of doing that, of giving you multiple sides of the same character, so it feels different. Speaking of Tommy and Maria, what was up with the government like building where they had Ellie and Dena addressing them to talk about the stalker? For some reason, that [ __ ] made me crack up. I was You don't like the town council? No, just meet in the [ __ ] room. This is where Jackson business happens. All right. They're trying to keep some semblance cuz like for me that's like, \"All right, did you build this",
            "start": 2065.12
        },
        {
            "text": "town council? No, just meet in the [ __ ] room. This is where Jackson business happens. All right. They're trying to keep some semblance cuz like for me that's like, \"All right, did you build this room or was did this already happen to exist and y'all looked at it and you're like we're conducting?\" I think they're running like the city hall out of the city hall. Yeah. That's [ __ ] hilarious to me. Why? They're going to do community things at the church. I don't know. It's like you're not even facing each other really. Like this is in a weird semicircle. Skin skin a table. Everything's [ __ ] up now. They're in a post-apocalypt [ __ ] up. They're trying to have some level. Hey man, give it up. Everybody's dead. Give it up. Speaking of the characters, we get introduced to Abby Squad and obviously we don't get much of them in this, but we know where they're going to go. Any initial thoughts on the casting here? No. The main guy who she's talking to, I assume is her ex-boyfriend. I can't",
            "start": 2104.72
        },
        {
            "text": "we don't get much of them in this, but we know where they're going to go. Any initial thoughts on the casting here? No. The main guy who she's talking to, I assume is her ex-boyfriend. I can't remember the names any Owen. Thank you so much. I thought he looked a lot like uh the owner from before, right? Yeah. Yeah. And then uh the woman from Intergalactics there like that. I was like, \"Hell yeah.\" Okay. Seen that. And also this game. Yeah. Yeah. Playing the same character, which is always fun. Oh, I didn't even notice that. You're right. That's cool. Are we sure about that? There there was a lot of confusion about this last time we mentioned this on a show. Really? Somebody said that and it was no bless I don't want to try to throw you under the bus. It was no you're the intergalactic person is in this show as that character but the but they weren't in the game as that character. You're right. No, they're playing a different character or no they're playing a character but she wasn't",
            "start": 2143.76
        },
        {
            "text": "is in this show as that character but the but they weren't in the game as that character. You're right. No, they're playing a different character or no they're playing a character but she wasn't this character in the game. Was she in Last of Us? Uh let me see. Interesting. Thank you for the clarification there. No, it's okay. It's one one of those slippery slopes of how we've said it and then move on and you come back to it and yada yada. Uh, but then we have Danny Ramirez as Manny. I assume this is of course the Falcon. The new Falcon. Yeah, I like him. Was Tati Gabrielle in Uncharted? Wasn't she in the Uncharted movie? Is that right? That's what it is. Yeah, she's in the Uncharted movie. It's that thing. I I've had this conversation through You're Wrong before I Daily, I think. So, yeah, like that. I mean, I miss Ashley Burch. I wish Ashley Burch would have been in this. Yeah. Uh, yeah. I wasn't really sold on what's what's that character's name? Uh, was that Nora or was that",
            "start": 2182.8
        },
        {
            "text": "yeah, like that. I mean, I miss Ashley Burch. I wish Ashley Burch would have been in this. Yeah. Uh, yeah. I wasn't really sold on what's what's that character's name? Uh, was that Nora or was that somebody else? No, that one's more the pregnant woman in this one. Yeah, the pregnant woman. I can't remember her name. It's [ __ ] too pregnant. But I'm very I'm so excited to have the uh dynamics play out of that group and the pregnancies and then also Mel, how could I forget? Um the the the all the pregnancies in Last of Us 2 I think are going to be very interesting of how they play out and the character dynamics between that in the show. I think we should do a bracket a pregnancy bracket babies. Yeah, I love the idea. Uh, and then yeah, getting Caitlyn Dver, like that's another thing that I I I've been pretty hesitant about going into the show because I do feel that um Aby's character being jacked is like such an important plot point to the game. Obviously, the show is very different.",
            "start": 2221.44
        },
        {
            "text": "I I I've been pretty hesitant about going into the show because I do feel that um Aby's character being jacked is like such an important plot point to the game. Obviously, the show is very different. So, I'm giving them He has five years. We've not seen her in the present, right? We Right. But yeah, you're right. What? Also, we saw her in trailers and stuff. So, I didn't watch the trailer. She's buffing my brain. We watched on Dave's Daily and stuff last. I closed mine. It's [ __ ] like She-Hulk GI CGI. So, I I am very hesitant about that because I I I feel like that's something they're going to have to win me over on on like making the character matter in a way that I care about as much. Having said that, they're already recontextualizing the story there. And I think that having what they did of her here and how angry she is, like she's clearly respected, right? Like I feel like she has this group of people and she is their leader it seems already and like she's just this little",
            "start": 2268.48
        },
        {
            "text": "they did of her here and how angry she is, like she's clearly respected, right? Like I feel like she has this group of people and she is their leader it seems already and like she's just this little girl, but like I think that having that kind of like cult personality already with her being small I think could just lead to interesting stories that are different. But um that's something I'm still jury's out. What What do you got? I know. I don't want I'm trying to get back on track cuz just from the chat are just tu pe the last of us preferred pregnancy partner. Oh, even more bees there. Okay. I like that. Yeah. Yeah. I mean, I I liked the introduction like her performance in the introduction of the episode, right? Like as she as uh Caitlyn Dver is speaking, I am like, \"Oh, damn. I'm kind of scared of her.\" Like she I Yeah, that intensity. Yeah. Like there's an intensity that she has. She's fresh off the incident, right? And so like you can kind of see where that comes from. I'm",
            "start": 2312.4
        },
        {
            "text": "kind of scared of her.\" Like she I Yeah, that intensity. Yeah. Like there's an intensity that she has. She's fresh off the incident, right? And so like you can kind of see where that comes from. I'm curious to see how that develops in a fiveyear break cuz like not that you I guess not that you lose the want and desire to kill the person that killed your people 5 years later but like are we going to be met 5 years later with that same amount of intensity or is it going to be almost like a resolved like all right finally I get to do this thing you know it's like Thanos at the end of Infinity War kind of thing of like all right cool it's a matterof fact kind of thing that I know I need to kill Joel kind of thing. Um, I'm curious on that. But even to like the her being a different Abby, it strikes me in the same way of Bella Ramsey being a different Ellie where partway through this episode, I started thinking about Jet Force Gemini as I do cuz there's a there's a cheat code in that game",
            "start": 2359.28
        },
        {
            "text": "me in the same way of Bella Ramsey being a different Ellie where partway through this episode, I started thinking about Jet Force Gemini as I do cuz there's a there's a cheat code in that game called Jet Force Kids where you take all the main characters of Jet Force Gemini and they just become children. And I kept thinking about that in my brain as I'm watching this of like I like the performances. I like the writing for the most part, even though there are some things Ellie's doing that's annoying me. But it I feel like I'm watching the game except all the characters or the main characters that I love just happen to present younger. Yeah. And it's just a getting used to kind of thing. But and we'll see how that like how that goes over the season cuz even as we're talking about like the the pregnancy bracket kind of thing, right? I'm like, yeah, Dena even seems it presents younger here too. Even though it will make sense what we get when we get there, but my brain's just not there.",
            "start": 2399.68
        },
        {
            "text": "the pregnancy bracket kind of thing, right? I'm like, yeah, Dena even seems it presents younger here too. Even though it will make sense what we get when we get there, but my brain's just not there. See, I think for Ellie, I had that with season one. That was one of my things with season one where just like the way she presented in the show I was like oh you're so different but similar but not you know what I mean like by but by the end of it I felt stood on its own stood in her Dena is a similar thing except that I think just giving us this scene of Dena and Joel and her wanting to learn about what's going on with the fuse box but then giving [ __ ] and then getting a little bit of like dad angst when she knows like I was like oh this does so much more for me than what we got in a game of Dena where Dena was babysitting the kids in the snowball fight goes out then they start you know hook up and then there was this and it was like I got all that and I was fine with it but this",
            "start": 2438.56
        },
        {
            "text": "game of Dena where Dena was babysitting the kids in the snowball fight goes out then they start you know hook up and then there was this and it was like I got all that and I was fine with it but this version of Dena being a little bit younger I would say a little I what I think what's interesting for all these characters uh that we're talking about is there's a level of carefreeness to them in an environment that's the apocalypse and why because they've been raised here uh back to the scene of them getting ready to throw the bottle and do the thing and like and they like start joking around. That felt so natural where I think sometimes when we're playing the game and like there is that level of levity a level of levity in it. It is a little bit more like listen I failed three times on this. I don't need that right now. Whereas here this is just their daily activities. They do like going out Ellie for a different reason than Dena but they do like you know hunting and doing this. They",
            "start": 2480.56
        },
        {
            "text": "I don't need that right now. Whereas here this is just their daily activities. They do like going out Ellie for a different reason than Dena but they do like you know hunting and doing this. They get a there so this is fun for them. Yeah totally. And I something that I am interested to see uh how far they take it is like maybe the show is flipping the some of the characteristics of Abby and Ellie like already having Ellie doing the MMA stuff and being way more physical and fighty as opposed to I feel like the game presents it gameplay wise as she's a bit more stealthy and Aby's bit more like like because she's bigger a little bit more aggressive and Joel like gameplay-wise. Um, but I I think it could be interesting to to flip it where I really appreciated the story beats of Abby being muscular because she spent years training for this moment, being prepared for it. But what if they flip it here and instead they play with the story of like with Ellie kind of pushing Joel away and like",
            "start": 2524.56
        },
        {
            "text": "because she spent years training for this moment, being prepared for it. But what if they flip it here and instead they play with the story of like with Ellie kind of pushing Joel away and like not accepting it and like kind of being a little bit more insular and like not a team player. Yeah. and leaning more into Abby having a team, you know, and have like maybe they they flip it where Ellie is a bit the more aggressive one and she's alone versus Abby having like around her and a little bit more like maybe not tactical but like I mean they fit that would fit the wolves, right? Like the was the Washington Liberation Force, right? I think if she has people that are around her that are more tactically trained because this is their style of survival versus Ellie coming up with Joel during that year of Last of Us one and being a bit more brooding. I do think there's an interesting thing that that's a great take and I'd like to see how they do that. Right. I do think that with again with",
            "start": 2565.92
        },
        {
            "text": "year of Last of Us one and being a bit more brooding. I do think there's an interesting thing that that's a great take and I'd like to see how they do that. Right. I do think that with again with this one MMA scene they set up here, we're establishing, oh [ __ ] like this Ellie can throw hands, she can actually do blah blah. So, if you bring in Abby, right, and she clowns out Ellie, we suddenly go, \"Oh my god.\" Like, we've already seen Ellie go off and be able to take down this big guy, right? But if Abby can do that, she's even more trained by the wolves, right? Like, so there's an interesting mixer where it could be a more stealthy thing or it might just be that she shows up and like, \"No, sorry. Break your arm the wrong way. Do this thing.\" Like, and then since we've already bought that Ellie's that good of a fighter, we'd buy that Aby's, you know, amazing, been trained armywise. I mean, yeah, that would be interesting. I mean, we know we're going to get more Seattle backstory at",
            "start": 2612.8
        },
        {
            "text": "Ellie's that good of a fighter, we'd buy that Aby's, you know, amazing, been trained armywise. I mean, yeah, that would be interesting. I mean, we know we're going to get more Seattle backstory at the very least or just more with Jeffrey Wright's charact, excuse me, Jeffrey Wright's character. Um, so I wonder what that's going to to look like, you know? Like I'm I'm so excited to see the uh like the stadium cuz I always thought that was like one of the coolest things in Blasters 2, like getting to like their home base. Yeah. Yeah. Football stadium, right? Was it? Yeah. So sick, though. Like walking around that stuff was like Yeah. Washington Liberation Front. Yeah. Yeah. What' you say? Of course. Oh. Um, we have a couple super chats here. CJ Splitzson says, \"Does it feel like the show's spelling things out a little too much at times? It's a lot of narrative handholding.\" Interesting. Hard to say, I think since we all feel like we know where it's going because we know the game. I don't",
            "start": 2650.88
        },
        {
            "text": "things out a little too much at times? It's a lot of narrative handholding.\" Interesting. Hard to say, I think since we all feel like we know where it's going because we know the game. I don't know. I I wouldn't say that because it was like I I think if it was Jen or somebody else I was talking to who didn't understand. No, it was a comment maybe I read. I don't know. Yeah, I think I on our own sub on the kind of funny subreddit somebody was talking about like oh Eugene but if they if Joel killed him why would he still oh well he's probably infect like I thought that would be so clear that like oh he killed him because he was infected but people didn't get that and yeah I think to the spelling out things I think there are certain things where because this is the premiere of a season you kind of have to reintroduce people to certain concepts cuz like there's some things you forget I forgot about the Fungal network from season one right yeah and then like once we see it coming out the",
            "start": 2690.56
        },
        {
            "text": "kind of have to reintroduce people to certain concepts cuz like there's some things you forget I forgot about the Fungal network from season one right yeah and then like once we see it coming out the the the thing for a second I was like oh what the [ __ ] is that what's about to happen but then like as I'm talking to you I'm like oh yeah that's like the thing that they introduced as a big part of how this world this version of the world works, right? Or even like them kind of talking through taking out one clicker and then a stalker is like a fun, hey, here's the way these things work again, but also here's a cool uh um like set piece sequence to kind of show kind of keep you still engaged while also reshowing you this is what we're dealing with. These are what the stakes are. This is what this world is. Like I think it's worth doing in episode one. And like I was saying, G was watching it too and her being so foreign into this like I think that uh it really worked and like she's on",
            "start": 2725.36
        },
        {
            "text": "this world is. Like I think it's worth doing in episode one. And like I was saying, G was watching it too and her being so foreign into this like I think that uh it really worked and like she's on a good path to it where like I afterwards I asked her I was just like just as a TV show what do you think of that? And like she was completely into it. She's like I can't wait to find out what's happening with this stuff. So I think that the reintroduction to stuff mattered cuz I did think that some of the expositioning stuff was a little clunky but necessary because I think even for obviously like the normies like gee but then also for they know that people like us are watching this show. So, I think a little bit of handholding to guide us into what direction they're going to play with what world we're in, I think is necessary. But the uh the bit of her screaming, \"I'm immune. I'm immune.\" Like I think that that while a character trait and they that will definitely be seen in like who Ellie",
            "start": 2758.4
        },
        {
            "text": "we're in, I think is necessary. But the uh the bit of her screaming, \"I'm immune. I'm immune.\" Like I think that that while a character trait and they that will definitely be seen in like who Ellie is and feeling like she's a little invulnerable at this point, um I also think that that was just a real reminder to the people of like how serious this is and like what happened in season one and like why the the the lie from Joel is so important cuz like even watch the recap, great recap, but I I do feel like it doesn't necessarily drive home like the importance of the choices made there, you Now, sure. Yeah. I can't wait to see where this goes. I'm really excited for next episode. Especially because it's just, you know, I'm not doing like a weird thing. It's for me. It's been so long. I You know what I mean? It's like I got excited Last of Us yesterday. I was like, \"Oh, right. See, it's the episode. I've seen this.\" Yeah. I'm like, is I clicked. I'm like, \"Is it a dual episode?\" No, it's",
            "start": 2792.48
        },
        {
            "text": "what I mean? It's like I got excited Last of Us yesterday. I was like, \"Oh, right. See, it's the episode. I've seen this.\" Yeah. I'm like, is I clicked. I'm like, \"Is it a dual episode?\" No, it's just the one. [ __ ] Only six more weeks, man. Oh, six more weeks of the show. Yeah. Yeah. I mean, that was the thing thing for me of like, man, I this episode made me remember that I haven't played Last of Us 2 since we reviewed it in 2020 and I probably played it over the course of three weeks, right? And I haven't touched it since then. Yeah. Of like the amount of things that kind of leave your brain uh in that time or then re-enter your brain when you experience something again. So, watching it and getting to the barn scene and being like, \"Oh, I forgot about this scene. I know what's about to happen.\" Also, that scene was until the end of the game, right? Or what? Did that happen at this point in the video game? No, we didn't see the fight yet. At this part in the video game, we saw them",
            "start": 2836.64
        },
        {
            "text": "happen.\" Also, that scene was until the end of the game, right? Or what? Did that happen at this point in the video game? No, we didn't see the fight yet. At this part in the video game, we saw them kiss. Okay. We didn't have the fight. We didn't see the guy. So, they cut the scene into like there's it happens at the beginning and then at the end again with more Yeah. Gotcha. Cuz that was the thing. The same thing we get way way way later when Ellie comes home and Joel's on the front porch. Yeah. Working on the guitar and he has a cup of coffee and there's a whole conversation about how much I trade speech or whatever. Gotcha. But yeah, it's it's so fun reexperiencing it this way. How do you do it? He says, \"I love the games, but the teen drama is tough.\" I love it. Open up your heart. I [ __ ] love it. live. You think so? A little bit so far. But we'll I just need to see how it develops over time. I'm I'm open to liking this version. But yeah, I mean so far the teen drama is a bit I",
            "start": 2869.76
        },
        {
            "text": "[ __ ] love it. live. You think so? A little bit so far. But we'll I just need to see how it develops over time. I'm I'm open to liking this version. But yeah, I mean so far the teen drama is a bit I think my thing is also them being 19. I I sometimes I'm like ah this feels a bit 15-year-old behavior. Like this feels like Last of Us one Ellie a bit like I don't know. There's there's parts of it that feels a bit to I think Greg said carefree. I think I would even say like pluckucky in terms of like what their personality is here, but I'm not going to dismiss it yet. Yeah, real quick too. Sorry, I misunderstood the question in chat's keeping me honest of like we get the the barn scene as a flashback even remember we start the morning after the thing and there's a lot of conversations about what happened last night, what happened last night blah blah blah blah and then you go on to them whatever and then you fl then you flash back to the barn where you get them kissing and then you flash",
            "start": 2906.08
        },
        {
            "text": "happened last night, what happened last night blah blah blah blah and then you go on to them whatever and then you fl then you flash back to the barn where you get them kissing and then you flash back again, right, to get the fight or am I wrong about that? We don't I don't think we see Yeah. Joel inter Yeah. intervene until the end of the game or later in the game at least. That doesn't sound right, but it's been five years and we'll see how the show plays it out. Matt Yellow says, \"Is Isabella just typ cast as morning sickness as a person? Hot girl is going to be pregnant in Superman as well.\" Spoilers, I survived Hodkins, too. Congratulations on the Hodkins. Yeah. Well, thanks for spoiling. Is Isabella sick in other things? I don't know. Or pregnant in other things. I don't think she was pregnant in Madame Web. I don't know. Who knows? The web saw all we all saw. So many it did see all. Um, what else do I have? Alien. They're saying alien. She was pregnant. Alien. Ah, no future",
            "start": 2945.6
        },
        {
            "text": "was pregnant in Madame Web. I don't know. Who knows? The web saw all we all saw. So many it did see all. Um, what else do I have? Alien. They're saying alien. She was pregnant. Alien. Ah, no future spoilers for your boy, but whatever. It's fine. Um, any final thoughts? Can't wait for more. Yeah. Did you Did you watch the uh next time on? No. This season on trailer thing. Yeah. Yeah. It was cool, but it's also it's it's so funny to watch an adaptation of Last of Us 2 that we know is not going to be the whole game and the game already has a lot of flashbacks and like out of order [ __ ] So, you're seeing all these scenes and I'm just like I have no idea how they're going to play this all out, you know? So, I'm very very excited for all of that. Uh, like I was saying, we will be here every single Monday talking about The Last of Us season 2 on HBO. Let us know in the comments below what you thought of the season premiere and stay tuned. If you're on Twitch, stay right where you are. on",
            "start": 2989.2
        },
        {
            "text": "single Monday talking about The Last of Us season 2 on HBO. Let us know in the comments below what you thought of the season premiere and stay tuned. If you're on Twitch, stay right where you are. on YouTube. Make the jump over to the Marvel Rivals stream the boys are about to do. Till next time, love you all. Goodbye. [Music]",
            "start": 3033.36
        }
    ]
}