{
    "id": 13956,
    "video_id": "a5ogeVt3oR4",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Andy Cortez"
    ],
    "title": "Ghost of Yotei Reaction, Hopes and Dreams - Kinda Funny Gamescast",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page - https://store.steampowered.com/app/1377700/Empyreal/ \nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1745522507,
    "duration": 3812,
    "transcript_chunks": [
        {
            "text": "[Music] What's up everybody? Welcome to the kind of funny games cast for Thursday, April 24th, 2025. I'm one of your hosts, Greg Miller, holder of three of Tim Getty's stars from Game Showdown, alongside the other man who helped me beat Tim Getty's. We're crushing this guy. He of course is the Hispanic Arthur Texas Street Latino Heat clicking heads and ripping him to shreds. The globe trotten head shot three-point shooting root and tootin nitro rifle from twitch.tv. Andy Cortez [Music] one star. That's one star. That's all you need. You know what I mean? Some people say if you have seven stars, you have none. You know. Well, here's what I actually that actually brings a great point as you just saw there. I have seven stars. You have one. Tim has three. What do I need to do to get you to give me that one star? So, I go up to eight. Replace me with Mike permanently next season. I'm already excited. This is my final season on Game Showdown. Wow. Retirement, too. We didn't know. It's like,",
            "start": 5.56
        },
        {
            "text": "me that one star? So, I go up to eight. Replace me with Mike permanently next season. I'm already excited. This is my final season on Game Showdown. Wow. Retirement, too. We didn't know. It's like, you got to do like John Cena, though, and tell us like next one's your final one. And you don't to do the full Yeah. So that every stadium I go to, people give me little gifts and things. You ever see the like athletes do that? You can sell a bunch of merch with it. Yeah, for sure. Chipper Jones did that when he was retiring. Every stadium he went to, everybody give him like a little little gift on Games Daily. Yeah, when this came up, of course, Roger called out that, you know, that oh man, Andy must feel great, you know, with the one star. And I I said I bet he does cuz he just it's just me yelling at Tim like he he Tim, you don't want to be the the object of that. Oh, 100%. Yeah, there it happened the other night when I was streaming and somebody was like, \"Man, [ __ ] stupid Greg.",
            "start": 58.72
        },
        {
            "text": "me yelling at Tim like he he Tim, you don't want to be the the object of that. Oh, 100%. Yeah, there it happened the other night when I was streaming and somebody was like, \"Man, [ __ ] stupid Greg. Doesn't that suck?\" And I was like, \"Yeah, fuck.\" I was like, \"No, no, no. I don't want the heat right now. The heat's on Tim. Keep the focus. Keep the laser focus on Tim. Yeah. Yeah. But also, I was in the back during the when you challenged him and I was like, Jant, 30 point answer. I was like, god, I'm good at kind of feudy. Bring that back full. Dude, it's one of those things where there are so many comments last night on the com of the of course we I cashed in Stars in the Bank on the Games cast yesterday after Tim did an amazing Oni Musha 2 interview. Um, and so many people like, I can't believe they didn't say Assassin's Creed. I can't believe they And it's like when you're in the moment, you don't know. at all of that, but you don't like Carl said it really well when he was on the",
            "start": 99.84
        },
        {
            "text": "believe they didn't say Assassin's Creed. I can't believe they And it's like when you're in the moment, you don't know. at all of that, but you don't like Carl said it really well when he was on the first game showdown of like, man, I thought you guys were idiots when I play at home. But when you're out there, it is there's the this is happening, that's happening, you're clear your mind, you're worried about this, but there's so many things happening. There are obvious answers to you, but then you get in your head about like is that the obvious answer from the audience, right? It's that one. It's the weird thing to walk you through that of like name a game that has a lot of climbing. I like I once you jump like I clear it and I jumped to Uncharted and then I jump I did like Tim jumped to Tomb Raider and then it's like once you're on that track it was so hard for me to even think of games outside of that genre to go to Assassin's Creed where yes of course I climb everything in the",
            "start": 139.36
        },
        {
            "text": "to Tomb Raider and then it's like once you're on that track it was so hard for me to even think of games outside of that genre to go to Assassin's Creed where yes of course I climb everything in the thousands of hours of Assassin's Creed I've played but it just was so far gone and Jan I thought was way too small like that had gone through but I was like oh that's not gonna in the same way Tim was talking about Kevin's dong and mount your friends I was there too of like yeah but it's not gonna be it's not gonna be that yeah Yeah. Yeah. Yeah. It's Look, once you're under the lights, things should you you act differently. Any given Sunday, they say any given Sunday, not everybody's going to hit that clutch three-pointer, you know. It's true. And so far, I have not and I will and I will never, man. I did uh suggest very early on in this uh whole saga, Andy, that what if Greg spent all of his time like bullying Tim and then took the left turn and then cashed it in on you instead? Oh, just",
            "start": 174.0
        },
        {
            "text": "man. I did uh suggest very early on in this uh whole saga, Andy, that what if Greg spent all of his time like bullying Tim and then took the left turn and then cashed it in on you instead? Oh, just took the one from me? I think that would have been awesome. It would have there was but also I'm pulling for you to somehow after all of this I'm still pulling for you to win it all Andy next. See I think that's what it comes down to though is like it I definitely considered Oh, wouldn't it be funny if I cashed it on Andy? But the problem is I definitely considered is that Tim is just so good at game showdown. Yeah, he's that's like if we if I don't take every opportunity there's just no way to catch this kid cuz he hears one [ __ ] note. He's like, \"Oh, that's from [ __ ] Kirby farts in the [ __ ] third game of this talking about heard of this game.\" And you know, there's a lot of like really awesome supporters out there who watch Game Showdown and they go, \"Andy, like, Andy, every week",
            "start": 212.24
        },
        {
            "text": "[ __ ] third game of this talking about heard of this game.\" And you know, there's a lot of like really awesome supporters out there who watch Game Showdown and they go, \"Andy, like, Andy, every week I'm pulling for you, and I'm putting my my channel points on you, and it's like, you know me well enough to know that I'm the least knowledgeable of the two and easily have the worst memory of the two.\" And that combined in a trivia show is not the recipe for success. You know what I mean? When I can't think of the word bagel, you know, like that's where my brain is sometimes when I, you know, so um you know, I'm, you know, it was a great run. We had a good run on Game Showdown. You know, we had a good time. Shout out to Roger for getting you your one star this year. I'm excited to fill in for for Mike next year if you ever need somebody. If I can make this happen, I get your star. Yeah. Okay. I like that. I like that a lot. Uh, if you didn't know, everybody, we're going to stop talking",
            "start": 255.76
        },
        {
            "text": "for Mike next year if you ever need somebody. If I can make this happen, I get your star. Yeah. Okay. I like that. I like that a lot. Uh, if you didn't know, everybody, we're going to stop talking about Game Showdown because this is the kind of funny Games Cass. Each and every weekday, we talk about the biggest topics in gaming, whether they be reviews, previews, trailer reactions, or just things we need to talk about. Uh, if you want to talk with us, of course, YouTube.com/kindfunnygames. Get in your super chats while we're live. Of course, you know it. We're talking about Ghost of Yotai. Yay. Yay. I can't I know it sucks. Yay. I'm going to start thinking of Taylor Swift and Tay. That'll do Mhm. Ghost of Yote. Uh, so if you have thoughts on the trailer, if you have thoughts about the game, if you have hopes, if you have dreams, if you have concerns, I need them as YouTube super chats so we can sit here and nerd out about that their PlayStation game. Of course, if you're watching",
            "start": 301.28
        },
        {
            "text": "game, if you have hopes, if you have dreams, if you have concerns, I need them as YouTube super chats so we can sit here and nerd out about that their PlayStation game. Of course, if you're watching later on YouTube.com/kind of funny games or listening on podcast services around the globe, please like, subscribe, share, tell your friends about it. If you're watching live on twitch.tv/kindfunnyames, why not use your Amazon Prime free subscription on Twitch and give it to us. Hearing about this later while you listen to a podcast you never use Twitch, go ahead, give it to us. You got to do it every 30 days. Kind of funny games. Come give us your free 30-day subscription. Otherwise, it's just something that they taken from you and laughing at you about. Of course, the best way to support us though is to pick up a kind of funny membership. You can get on patreon.com/kindfunny, youtube.com/kindfunnygame, Apple and Spotify. It would get you all of our shows adree. Good karma for supporting",
            "start": 342.56
        },
        {
            "text": "though is to pick up a kind of funny membership. You can get on patreon.com/kindfunny, youtube.com/kindfunnygame, Apple and Spotify. It would get you all of our shows adree. Good karma for supporting a small business. And of course, your daily dose of me, Greg Miller, in a series I call Gregway, a 20 to 15 minutee podcast each and every day from me to you. Housekeeping for you. Uh, we're an 11 person business all about live talk shows. KFGD just happened and it was all about the disastrous Switch to pre-orders. Andy, do you have a Switch to pre-order? I got two. God damn. Where'd you get them from? Target was the first one. Uh, and that was a that was a harrowing experience trying to refresh. Refresh. Yeah. Is it broken? Should I even try to refresh or is it doing something right now that I just can't see? Did you get a confirmation email from Target? I did get the confirmation email and then people then were still in my chat being like I mine got cancelled though, so be careful. So I",
            "start": 376.16
        },
        {
            "text": "I just can't see? Did you get a confirmation email from Target? I did get the confirmation email and then people then were still in my chat being like I mine got cancelled though, so be careful. So I kept on looking and never I never got that notification of it being cancelled. And then the Best Buy one where it's 9:20 and I'm like I don't know if they know that they're still open. I don't know if they know they're still in business cuz it still says coming soon. Who knows what disconnect is happening? Maybe their computers don't reach California. I don't know. Of course, I'm like, \"What's happening with their website?\" And then finally, people in my chat were like, \"It's uh they went up at 9:30.\" And I was like, \"Oh, okay. That's fascinating.\" I'd already got my Target one by then, and I know that I was reading the Slack, seeing if people needed one here, so I just tried for Best Buy on my phone, and it happened to work. And I was like, \"Oh, shit.\" It was our It was like 10:20 when I",
            "start": 423.12
        },
        {
            "text": "know that I was reading the Slack, seeing if people needed one here, so I just tried for Best Buy on my phone, and it happened to work. And I was like, \"Oh, shit.\" It was our It was like 10:20 when I got my Best Buy one. Good job. Yeah. Okay. Good for you. Uh after this it's going to be Star Wars andor season 2 spoiler cast for episodes 1 through three with Barrett, Tim, and Sage. Will Anthony Carboni call in from Japan or an airport or wherever he is now? Nobody knows. Where in the world is Anthony Carboni? And after that, it's going to be a stream of marathons closed alpha. If you're a kind of funny member, today's Gregway is from me to you and it's all about my least favorite piece of content I've ever done, aka my biggest on camera regret. Thank you to our Patreon producers Anatoli asked, Delaney Twining, Carl Jacobs, and Omega Buster. Today, we're brought to you by Imperial and Aura Frames. We'll tell you about that later. For now, let's start with topic of the show. Tots, so",
            "start": 462.8
        },
        {
            "text": "asked, Delaney Twining, Carl Jacobs, and Omega Buster. Today, we're brought to you by Imperial and Aura Frames. We'll tell you about that later. For now, let's start with topic of the show. Tots, so yesterday we say no games daily. We'll do two games casts. Tim's amazing on Musha interview and of course the review of Expedition 33. There will not be any huge news in video games. Of course not. Then of course, Andrew Golarb, former Dark Knight of News, now Sucker Punch employee, goes to the PlayStation blog, announces of course the release date of October 2nd for Ghost of Yote and drops a brand new trailer that you and I have yet to watch. I have not watched it. We knew this would be good reactionary content. We we are excited to see it. We said, \"Let's not watch it yesterday. Let's not watch it till we get to Games Cast.\" Even on Games Daily today, we didn't show it as B-roll. We just talked about the, you know, the date and then the pre-order stuff in there. And so then now it's",
            "start": 504.24
        },
        {
            "text": "watch it till we get to Games Cast.\" Even on Games Daily today, we didn't show it as B-roll. We just talked about the, you know, the date and then the pre-order stuff in there. And so then now it's time. We're ready to get in there. This is the followup to my retroactive game of the year. I beat it a year after. That's fine. We're going to talk about that. I appreciate that. Are we going to redo that vote, too? You always want to revote it. I mean, we we haven't done one, so I would love to do a one, you know, write some wrongs. Jedi fall in order, God. Come on, dude. I'm going to be honest. What are you doing? I think even after all that, I think the way votes would probably land down, it would still probably be Jedi Fall in Order. That's why we do stuff differently there, too. We have control. Different voting. That's why we have control. Oh, so you're suppressing voters. No, I know. If anything, I am the VEI of voting of you, you know? Like you all are the majority, you know. Um,",
            "start": 553.6
        },
        {
            "text": "control. Different voting. That's why we have control. Oh, so you're suppressing voters. No, I know. If anything, I am the VEI of voting of you, you know? Like you all are the majority, you know. Um, why don't we vote for representing us? Here's my here's here's my the thing that I've been submitting, right? A lot of people also making great points about NASCAR and F1 voting. Yeah. How like you have way more points for one and the points get less and less instead of 10 N, you know, whatever, whatever. But then also we submit 15 games. You don't have to if you don't want to, but you submit 15. That way, let's say Tim has like a [ __ ] Nico DO at number five, right, on his list. Yeah, I like that. And none of us played Niko Dico, but it's so high that it makes it top 10. But let's say Oh, so like Hell Divers 2. Let's say me, Greg. A game that [ __ ] deserved to be last year. I You're so right, Greg. Because let's say me, Greg, and Barrett had Hell Divers 2. You had Hell Divers, too. And",
            "start": 591.04
        },
        {
            "text": "like Hell Divers 2. Let's say me, Greg. A game that [ __ ] deserved to be last year. I You're so right, Greg. Because let's say me, Greg, and Barrett had Hell Divers 2. You had Hell Divers, too. And I had it at 11 and Barrett had it at 12. Those could have been points for you towards your cause. But because they were right out of our top 10, they don't make it. These are all like little ancillary things. Can you let me talk? Yeah. Sorry, we're not taking questions right now, Barrett. We're not taking questions right now. We're redraw we're redrawing the district fun facts are all about like how different point systems don't really change much for our lists. So just you know I don't know if the research has been done. Yeah, I know. Yeah. I choose I choose to believe it hasn't been done. I don't want to talk about it every [ __ ] year. I don't think so. All right. Well, we're 23 minutes into the show. I guess it's time to react to the Ghost of Yote trailer to my chagrin because while we",
            "start": 638.88
        },
        {
            "text": "want to talk about it every [ __ ] year. I don't think so. All right. Well, we're 23 minutes into the show. I guess it's time to react to the Ghost of Yote trailer to my chagrin because while we were live I got a text from someone who will remain nameless. Not Goldarb at Sucker Punch saying get your [ __ ] together. We're all waiting. The stream says 11:00 a.m. and I'm sorry it's your first time watching. Kind of funny. By the way, what's a sugar grin? I mean, I don't know the literal definition, but I mean it to your dismay. Like, you know what I mean? Like, that's a great point. Let's Google make sucker punch. Keep watch embarrassment at having failed or been humiliated, but like it's not like we're humiliating. It's not a word. That is It's Never mind. Let's watch it, Charlie. All right, everybody. We're going to watch the trailer for Ghost of Yote. Remember Taylor Swift from here on out to help him. Play station on. You can get this mask in the collector's edition. Oh, no way. 250",
            "start": 674.48
        },
        {
            "text": "everybody. We're going to watch the trailer for Ghost of Yote. Remember Taylor Swift from here on out to help him. Play station on. You can get this mask in the collector's edition. Oh, no way. 250 though. I wonder spirit seeking vengeance. Who are you? I thought we killed your whole family. The snake. The only keeping up with this, dog, the [Music] kids, the spider. She She's collected the past dragon. [ __ ] That is Erica. I know, right? That Erica is of course starring in this game. Holy [ __ ] What are we going to do with this one? Zetto, I'm sorry it came to this little wolf. [Music] I hope he goes to jail. I think he's going somewhere different. Hell. artists. Situ Ru. Why do you always call me that? It means one who is easily lost in the hunt. You want to know how I got these scars? God damn. Get the [ __ ] out of my face. [Music] the weapon with the chains. Like I just Oh man. I have to go home. Back where all this started. October 2nd, 2025. Damn. Gooseies, man. [ __ ] a",
            "start": 717.44
        },
        {
            "text": "God damn. Get the [ __ ] out of my face. [Music] the weapon with the chains. Like I just Oh man. I have to go home. Back where all this started. October 2nd, 2025. Damn. Gooseies, man. [ __ ] a That's That's just so saucy. That's so good. I I mean, like, it's dripping in sauce. I It's Let me dip my tender in that. You know what I mean? Like, [ __ ] Hey, man. It's one of I mean you look at that and you see what another level Ghost of Tsushima and what I assume Ghost of Yotay will be and I really do think there is that before and after thing and like this is just a reactionary content to this us talking about our hopes and dreams for this obviously this game that we're both so excited about because I loved Ghost so much and you did too a year later. Um, but you look at that man and it's just like everything about that. I think even this interaction right here as we're seeing it, right, where Erica shows up to confront him. Who are you? And she just shows the hilt of her blade, right? I",
            "start": 854.68
        },
        {
            "text": "like everything about that. I think even this interaction right here as we're seeing it, right, where Erica shows up to confront him. Who are you? And she just shows the hilt of her blade, right? I thought we killed your whole family. the animation, the story, the character dripping from that right there, like you're talking about is I and I know I'm talking about a game I haven't played yet, but I think even to compare that to the DNA that is Ghost of Sushima is one of the reasons I just was like, \"Oh man, Assassin's Creed Shadows just ain't hitting.\" Where it was like Assassin's Creed Shadows spoilers for the setup of that game. I can't believe how good that looks. That shot blows me away. Sorry. For now is the is a very similar thing. Hey, this person that mattered to you got killed. Now you and by all these people wearing masks, you're going to go out on this revenge mission to go get them. And to be fair, Assassin's Creed's done that. That's like a very formulated course. Of",
            "start": 938.2
        },
        {
            "text": "Now you and by all these people wearing masks, you're going to go out on this revenge mission to go get them. And to be fair, Assassin's Creed's done that. That's like a very formulated course. Of course, of course. But in our preview of playing that, I was like, \"Oh, wow. That's so cool of taking something formulaic for Assassin's Creed, blending it with what I think Ghost also had going for it of like, hey, Ghost of Sushima did like we are making a samurai film that is a video game that's playable.\" Right. And then to get into Shadows for me personally as a big Assassin's Creed fan and maybe just a big Odyssey fan, maybe I should say that to get into it and be like, \"Oh, the Samurai movie part isn't here. It's just Assassin's Creed, but it's samurai flavored.\" And for it to be that pald in comparison to what Ghost of Sushima was and what I'm expecting Yotay to be. And it's the same thing for Rise of the Ronin where Rise of the Ronin I jumped in and it was like, \"Oh, okay.",
            "start": 981.44
        },
        {
            "text": "that pald in comparison to what Ghost of Sushima was and what I'm expecting Yotay to be. And it's the same thing for Rise of the Ronin where Rise of the Ronin I jumped in and it was like, \"Oh, okay. PlayStation is behind this and treating it as a first party game, but it isn't Ghost of Sushima. It isn't what I expect the sequel, which going to be Yote be actually isn't. You watch this and just like back to the shadow comparison, the amount of times I would get into a duel, a fight or whatever, and I didn't have the [ __ ] like cut and then the of just knocking your sword out with your thumb. like something that little that made Ghost of Tsushima so much more than I think the games that have come since it and to see and have hopefully that those payings from this are so important. I think those little those little elements of Ghost and I say like the Ghost franchise if there's been like 20 of them, but those tiny little elements that made Ghost so special were definitely missing for",
            "start": 1022.56
        },
        {
            "text": "those little those little elements of Ghost and I say like the Ghost franchise if there's been like 20 of them, but those tiny little elements that made Ghost so special were definitely missing for me. And I I I still think that if I had no other games to play right now that I would legitimately be enjoying Assassin's Creed Shadows because I had fun with what I played. And to jump in if I can just give you I think a thought to it because Assassin's Creed Shadows because Assassin's Creed Shadows is a great game. It's Assassin's Creed. It's all the systems I've loved in other Assassin's Creed. I just feel like I've had my fill of them. I and and I'm on the opposite cuz I don't play Assassin's Creed games. The general joke this whole time has always been this is going to be the one because I love anytime we're in like a feudal Japan era or anytime I can be a samurai of some sort, this sounds really awesome. And I think there was just too many things to play and Assassin's Creed wasn't as",
            "start": 1067.76
        },
        {
            "text": "love anytime we're in like a feudal Japan era or anytime I can be a samurai of some sort, this sounds really awesome. And I think there was just too many things to play and Assassin's Creed wasn't as awesome in order to take away all the other games attention uh away and kind of like help me main just that experience because I think Assassin's Creed is Shadows looks [ __ ] gorgeous when it's running on a really high-end rig. I I really enjoyed the combat of what I played. I just wasn't I do think it was it was just there was too much [ __ ] happening. And to jump in, Sneak says, \"Rise of Ronin was a damn good time as well.\" I'm right there with you. If you remember that review conversation when we were all just a few hours into whatever, I had a great time with Ronin because it was an Assassin's Creed style samurai playground where I'm running. I'm jumping off throw on my thing. Come down. I'm assassinating people. But it was I'm clearing the map and I'm getting more powerful and I",
            "start": 1112.32
        },
        {
            "text": "Creed style samurai playground where I'm running. I'm jumping off throw on my thing. Come down. I'm assassinating people. But it was I'm clearing the map and I'm getting more powerful and I don't know what the story isn't they're not trying to make a samurai movie with Rise of the Ronin. I was the one who like [ __ ] talked it the most because about 3 hours in I I said on kind of like that preview or whatever it was whether it was review or not you know this it just it's lacking sauce. Yeah. Yeah. And with Rise of the Ronin, if I were to put like letter grades on [ __ ] their combat is a tier. That I mean, that's Coway Techmo. That is it. That combat is phenomenal, right? It's what you expect with Neo with what I enjoyed about Wolong Fallen Dynasty, which is a game that I at the time we had our rating system was different. So, I gave it a three out of five. And we all did because we were like, \"Yeah, the combat rocks. just not much else is good in this when it comes to voice acting or",
            "start": 1160.4
        },
        {
            "text": "our rating system was different. So, I gave it a three out of five. And we all did because we were like, \"Yeah, the combat rocks. just not much else is good in this when it comes to voice acting or uh cut scenes or cinematics or story. But like for me, Rise of the Ronin and Ghost Isushima, I'm looking at like a like [ __ ] S tier combat for Rise of the Ronin and A tier for Ghostsushima. Now, everything else in Ghostsima is a as well for me. and Rise of the Road and it drops down to like the D's and the B's when it comes to story and characterization and compelling interactions making me give a damn about what's happening in the world. And I just think back to my time with when I first tried out Ghost Sushima 1 and was like this isn't hitting right now. Decided to go back to it a year later and completely fell in love with the experience. And a lot of it has to do with these characters that I grew to love. That game has some of the most [ __ ] gut-wrenching, heartbreaking side quests",
            "start": 1209.12
        },
        {
            "text": "and completely fell in love with the experience. And a lot of it has to do with these characters that I grew to love. That game has some of the most [ __ ] gut-wrenching, heartbreaking side quests that really really hit you in the feels. And a lot of that has to do with how gripping the dialogue is and these characters you grow to care about, man. Come on. These awesome twists and turns and backstabbings of charact like god damn, dude. It was just it overtook The Last of Us Part Two for [ __ ] of the for that year for me. And you know, for anybody who says that combat gets repetitive, it's my flavor of combat. So, it never became competitive or repetitive for me because I sought out every other battle cuz I was having that much fun. And that's one of the things for me to take the baton for me for a second is the idea that I'm not the combat guy. I'm not the Perry Poppy guy or and and I mean I like combat, but I don't like the challenge or this or whatever. I thought the combat was so",
            "start": 1256.56
        },
        {
            "text": "me for a second is the idea that I'm not the combat guy. I'm not the Perry Poppy guy or and and I mean I like combat, but I don't like the challenge or this or whatever. I thought the combat was so good in Sushima that I also was seeking out challenge and I was also seeking out these people and was it repetitive? I don't think so because for me it was always about getting better and finding the parry window and doing the thing and like what is the mechanic I'm going to use here to fight this and then you know those one-on-one samurai duels you'd have and stuff like I thought it was so incredibly special on that front. Yeah, it brought it brought the fun gameplay mixed in with a lot of other amazing, you know, what what brings the sauce, the little those cinematic moments, the moment where, you know, you get backstabbed by one of your by one of the homies and then it's the duel with the wide shot and the down like cinematography and everything just adds so much to help supplement how",
            "start": 1306.32
        },
        {
            "text": "you know, you get backstabbed by one of your by one of the homies and then it's the duel with the wide shot and the down like cinematography and everything just adds so much to help supplement how fun the combat can be. And so when Ghost 2 gets revealed that one time, obviously super pumped for it, want to see what the next adventure is. And after watching that, it's like, god damn, dude. This year is so [ __ ] stacked. Yeah. Yeah. I want to talk about that. Uh from if you didn't watch it or you want more, we're going to read from the one, the only Andrew Garb at the PlayStation blog, who wrote this two paragraph synopsis of what's going on there. 16 years ago in the heart of Izu uh called Hako in present day, a gang of outlaws known as the Yote 6 took everything from Atsu. They killed her family and left her for dead pinned to a burning a a ginko ginko ginko tree outside her home. But Atu survived. She learned to fight, to kill, and to hunt. And after years away, she has returned to",
            "start": 1346.24
        },
        {
            "text": "family and left her for dead pinned to a burning a a ginko ginko ginko tree outside her home. But Atu survived. She learned to fight, to kill, and to hunt. And after years away, she has returned to her home with a list of six names. the snake, the oni, the kitsu or kit kitsune. Kitsune. Uh the spider, the dragon, and Lord Sat. One by one, she's hunting them down to avenge her family. You mix it up right there. Yay is ei ai is sai, so it's or i. So it's silto. Silto. Thank you very much. Yeah, there you go. Okay, I like that. Uh, one by one, she's hunting them down to avenge your family armed with the same katana used to pin her to that burning tree all those years ago. That's so cool. So [ __ ] cool. It reminds me of when we first saw the glimpses of Robert Pat's Batman and we were like, \"Oh, that's a pistol. I'll probably kill it.\" It wasn't, but it's still cool. Could be. They never talked about it. Maybe. Uh, but while Atu's story begins with vengeance, she'll find there's more to",
            "start": 1396.72
        },
        {
            "text": "\"Oh, that's a pistol. I'll probably kill it.\" It wasn't, but it's still cool. Could be. They never talked about it. Maybe. Uh, but while Atu's story begins with vengeance, she'll find there's more to her journey than just revenge. As she explores EO, Atu will meet unlikely allies and forge connections that help give her a new sense of purpose. Over in the super chat, so many of you wanting to be part of the show. I appreciate that. Please come on with that. Uh, but Norman writes in and says, \"The story looks heavily inspired by 70s samurai movie Lady Snow Blood and that rules. In the same way I beat Ghost of Sushima or was playing it and got obsessed and started buying I hit up sucker bunch of people and I was like, \"What are inspirations?\" And I started getting like comics and mangas and stuff, I would definitely want to watch Lady Snow Blood right now cuz that sounds [ __ ] rad, too. Um, where do you want to go from here, Andy? Because I want to talk about the release date. I want",
            "start": 1449.04
        },
        {
            "text": "stuff, I would definitely want to watch Lady Snow Blood right now cuz that sounds [ __ ] rad, too. Um, where do you want to go from here, Andy? Because I want to talk about the release date. I want to talk about the competition this year. I want to talk about what we saw. I want to talk about I want to talk about hopes and dreams. What do you want to jump in? I I think um cuz I was really I was really stoked for whatever the concept and presentation was for Assassin's Creed Shadows and obviously this extremely similar coincidental thing of you go after the six people whatever that we go after the eight people whatever it may be. Um, and there's just something that I love that that's so easy to latch on to as somebody who enjoys media like this. It's such an easily consumable thing. These six dudes, it reminds me of all the Metal Gear games going after the Beauty and the Beast, going after freaking um uh the end. Are you talking about like I'm just talking about like the groups of the",
            "start": 1485.44
        },
        {
            "text": "six dudes, it reminds me of all the Metal Gear games going after the Beauty and the Beast, going after freaking um uh the end. Are you talking about like I'm just talking about like the groups of the bosses like you know Fox Town. In Fox Town. Yeah. All that. Um, it's such a cool, easy, marketable way totally to have these characters with the, you know, the kitsune, the the the little fox mask and all that stuff. I just love the idea of it. This concept is just so it's such an easy win for me to hop in there and go, \"All right, this is what we're doing. I'm in already.\" Um what I would love to see from it however um because there are some aspects of Ghost of Sushima that I think of like what can we sort of you know improve here what can we implement um and I think we all go you know either raid WB and take the [ __ ] nemesis system take the nemesis system uh because that's just like can you even imagine how something like that would be implemented here? Are there any ways for Sucker",
            "start": 1533.28
        },
        {
            "text": "raid WB and take the [ __ ] nemesis system take the nemesis system uh because that's just like can you even imagine how something like that would be implemented here? Are there any ways for Sucker Punch to kind of skirt those little IP law lines and maybe kind of implement anything like that? Cuz I, as much as I love this living, breathing world that feels so like it feels so immersive and so alive, I still feel like I got quickly tired of those emerging gameplay moments when homie is by his cart and is like, \"Help me out.\" And then he's really just there to try to kill you or whatever. Yeah. Andy, hear me out. They make their own proprietary like uh Nemesis system and then to skirt the line, they'll call it the the the meanie apparatus. Oh, okay. I love it. I love it. Nema, bro. Yeah. Top of my list in terms of things I I would want to see strengthened because I think Ghost is so great. Ghost of Sushima. Uh, but it would be the idea of somebody who platinum it and love chasing all of",
            "start": 1585.44
        },
        {
            "text": "of my list in terms of things I I would want to see strengthened because I think Ghost is so great. Ghost of Sushima. Uh, but it would be the idea of somebody who platinum it and love chasing all of that side quests, right? Making those less repetitive cuz it was okay cool. It's fun to go to the bath. It's fun to write the haiku. It's fun to follow the fox, but like your fifth time or maybe that it's not even the right number, but it was as you got deeper and deeper into it. That's where it started to wear me down. There's hope for that already, though. Of course, over at WCCF Tech, this is a September 2024 article. Uh, Allesio says, uh, Ghost of Yot will feature a less repetitive open world. Yot, I [ __ ] it up again. Uh, thankfully, developer Sucker Punch shared a few tidbits, uh, about this sequel in an interview published the New York Times. Creative director Jason Connell said, \"One of the changes uh, compared to Ghost of Sushima will be a less repetitive open world.\" Quote, \"One",
            "start": 1647.2
        },
        {
            "text": "this sequel in an interview published the New York Times. Creative director Jason Connell said, \"One of the changes uh, compared to Ghost of Sushima will be a less repetitive open world.\" Quote, \"One challenge that comes with making an open world game is the repetitive nature of doing the same thing over and over again. Uh, we wanted to balance that, balance against that and find unique experiences. So, I like the idea that again Sucker Punch, which in the grand scheme of studios is a small studio in terms of PlayStation first parties has enough time to sit there and really go, okay, we have it's been 5 years, which both sounds so short, but also so long since Ghost of Tsushima. The fact they've noodled it and come up with this in this story and whatever they're about to do with this world is exciting. When you see that there, see her go to be the little girl there, that's that's such a deliberate choice. And I wonder we saw that with Jyn obviously where we would have flashbacks to",
            "start": 1686.16
        },
        {
            "text": "is exciting. When you see that there, see her go to be the little girl there, that's that's such a deliberate choice. And I wonder we saw that with Jyn obviously where we would have flashbacks to it, but do you think is there a chance that's a game mechanic? Cuz the way they did it right there. I know they're they're bloop they're like doing the water droplets. I just think it's an interesting thing to call out there at the end here is like your stinger going into it. I wonder if that's actually going to be a mechanic or if that's just we're getting the flashback as always. you're 100% dead on there is I I feel it it's such a deliberate choice to have that be the stinger because at any moment a game can show a flashback that doesn't that's not going to blow anybody away but if you're showing it off in that way to where it looks like a mechanic and it very well may not be but that feels like such a choice to have that there in the chat caboose is saying it's a game mechanic they",
            "start": 1727.6
        },
        {
            "text": "showing it off in that way to where it looks like a mechanic and it very well may not be but that feels like such a choice to have that there in the chat caboose is saying it's a game mechanic they confirmed on the PlayStation blog which blog post did they confirm that on let me know cuz I don't even know what to Google change perspective [Music] Now when you switch was like of course if Sucker Punch is still watching and they want to just text me if that's does that one tree that was you know burned down has it grown back now like how I mean we're not talking like the medium right like dual world type things how deep can that even go because you mentioning that them being well aware about how their open world can become repetitive and how that can be a a a little point of, you know, all right, we got to improve this in the future. It it's just kind of, oh, that's a lesson learned. They know that. They are aware of it. Great. That's something they want to address. Oh, here it is.",
            "start": 1767.68
        },
        {
            "text": "all right, we got to improve this in the future. It it's just kind of, oh, that's a lesson learned. They know that. They are aware of it. Great. That's something they want to address. Oh, here it is. Yeah. Okay. Well, first off, I asked that the chat said it was in the most recent post. Another [ __ ] person from Sucker Punch, who will remain nameless, says it's in the blog you were literally just reading for [ __ ] sake. Like, calm down. It's a [ __ ] live show. Jesus. You were reading it. But I didn't read that part cuz again then it g then go far starts doing is we hope you enjoy this brief [ __ ] off. I'm gone. I'm not I'm no longer listening. The comment if you're an audio listener does though go uh I'll just read the whole thing. We hope the brief looks uh in today's trailer give you a taste for what you can expect from Ghost of Yote. Uh, beyond our first look at the Yotay 6, you'll spot some of the gorgeous scenery of Izo, as well as a handful of Atsu's new weapons, a few of",
            "start": 1814.16
        },
        {
            "text": "you a taste for what you can expect from Ghost of Yote. Uh, beyond our first look at the Yotay 6, you'll spot some of the gorgeous scenery of Izo, as well as a handful of Atsu's new weapons, a few of her allies, and even a new gameplay mechanic that will allow you to glimpse Atsu's past and understand everything that was taken from her. I would imagine it's Atsu, not a, you know, I mean, I don't know, but obviously I'm saying it one way cuz I don't know. Yeah. So, you're saying ah, I'm saying, you're saying au was I was saying at au. I also think it might be ezo. I don't know cuz I think of the Edo period. Yeah, that makes sense. Yeah, that one I'm less sure about, but I feel like you're probably either reminds you of Element Zero Mass Effect. So, did you read about the mechanic or Yeah, I did there. Yeah, glimpse uh Atsu. Did I say it right there? Yeah, you nailed it past and understand. So, I mean, how how often are we even given the opportunity to do that? Is it Yeah, I know,",
            "start": 1854.0
        },
        {
            "text": "I did there. Yeah, glimpse uh Atsu. Did I say it right there? Yeah, you nailed it past and understand. So, I mean, how how often are we even given the opportunity to do that? Is it Yeah, I know, right? Is it? Yeah, this I know I'm calling out a game that's better than Resident Evil, but the medium like you know when we saw that in trailers and stuff, we were like, \"Oh, cool. You're back and forth, but it was very specific spots.\" So, yeah. Is this just going to be specific spots? I don't think we needed that at the front end. Everybody needs to know. I know what I'm doing here. I'm calling out a game that's better than Res. Better than Resident Evil Village. I'm just saying. Just putting it out there. Um, yeah. You wonder if that is a momentary thing or if just after certain chapter points you have the opportunity to do that. Yeah. Either way it' be cool. But then it's not like a revolutionary gameplay mechanic. Yeah. But yeah, cuz I I think when I think of Ghost of Sushima and Jin",
            "start": 1895.92
        },
        {
            "text": "you have the opportunity to do that. Yeah. Either way it' be cool. But then it's not like a revolutionary gameplay mechanic. Yeah. But yeah, cuz I I think when I think of Ghost of Sushima and Jin story, I do think about hopping back and forth quite a bit. But that was never a voluntary thing, you know? You were they were shoving you in the past to I hate being shoved in the past. Yeah. And so I don't know. I I wonder how often that's something that can even be utilized. If you're even, you know, if you're even calling it out, not only as the singer, but then you're saying, \"Hey, you also probably noticed this thing.\" It seems like it's going to be maybe a lot more prevalent than than maybe even we think. I doubt it's like open world activities to an enemy camp and then turn back into Look, this there was a rock here before. They've really done a lot with the place. You know what I mean? She turned into a little girl. What the [ __ ] She's still fighting. Girl, it's time traveling. I",
            "start": 1939.84
        },
        {
            "text": "this there was a rock here before. They've really done a lot with the place. You know what I mean? She turned into a little girl. What the [ __ ] She's still fighting. Girl, it's time traveling. I can't kill the girl. Uh, I want to get into more super chats. I want to talk more about what we think this October date. I want to talk about all sorts of th stuff ghost related. But first, I'll remind you that this is kind of funny. Games cast, we couldn't do this without your support. Thank you for all the super chats. Continue to come in with what you want from this game, what you didn't like about Ghost of Sushima, and what you want out of this one. Uh, of course though, what you'd really do if you wanted to help us was go pick up a kind of funny membership. We're an 11 person small business all about live talk shows. You can go to patreon.com/kindfunny. youtube.com/kindfunname. Apple or Spotify, you can kick us $10. Get all of our shows ad free. Get your daily dose of me in a series we",
            "start": 1986.88
        },
        {
            "text": "all about live talk shows. You can go to patreon.com/kindfunny. youtube.com/kindfunname. Apple or Spotify, you can kick us $10. Get all of our shows ad free. Get your daily dose of me in a series we call Greguay. And feel good for supporting some idiots you like on the internet. However, you're not supporting us right now. So, here's a word from our sponsors. This episode's brought to you by Imperial. We've told you all how important it is to developers to wish list games you're interested in on Steam. So, if this game sounds cool to you, make sure that you wishlist it. In Imperial, you play as a mercenary sent to a distant planet to discover the mysteries of an ancient civilization. Powers unknown lie within the monolith, but those are no mere ruins as an expedition has already ventured inside with only a few survivors. Why was it built? What powers reside within? Who is at the center of the monolith? All these secrets and more will be uncovered if you are brave enough to take on",
            "start": 2022.48
        },
        {
            "text": "inside with only a few survivors. Why was it built? What powers reside within? Who is at the center of the monolith? All these secrets and more will be uncovered if you are brave enough to take on Imperial. Imperial features a unique blend of RPG systems and skill-based combat across three weapon archetypes. The acrobatic glaive, the defensive but devastating mace and shields and the powerfully ranged cannon. With a deep ability system, extensive customization, every battle is an opportunity to refine and optimize your combat style. form relationships with each of the few surviving expedition members who all have their own personal quest lines. Whether you choose to help or not can have drastic consequences for them. The monolith is guarded by powerful automatons, each with distinct attack patterns and weaknesses that demand precise execution and strategy to be victorious. Create your mercenary, enter the monolith, learn powerful abilities, defeat the automatons, and uncover the",
            "start": 2065.84
        },
        {
            "text": "attack patterns and weaknesses that demand precise execution and strategy to be victorious. Create your mercenary, enter the monolith, learn powerful abilities, defeat the automatons, and uncover the secrets that lie within Imperial. Imperial is available May 8th on PC, Xbox SNX, and PS5, but you can wishlist now. Do it. Wishlist Imperial. This episode's brought to you by Araf Frames. If you haven't called your mom in a while, here is your reminder to do it. But then, if you want to go above and beyond, Mother's Day is coming up and I have the perfect gift idea. Aframes are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preload it with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special, they'll use it every day. Trust me, Gia's dad does, Greg and Kevin, and a ton of people here at Kind of Funny are obsessed with their",
            "start": 2114.32
        },
        {
            "text": "so it's ready to go right out of the box. It's a gift so special, they'll use it every day. Trust me, Gia's dad does, Greg and Kevin, and a ton of people here at Kind of Funny are obsessed with their Aura frames. It takes about 2 minutes to set up a frame using the Aura app. And I know that from experience. Aura has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting aframes.com to get $35 off plus free shipping on their best-selling Carver matte frame. That's a rafra.com. Promo code kind of funny. Support this show by mentioning us at checkout. Terms and conditions apply. Okay, so shocking no one who's watched kind of funny for 10 years or me for 18 years. I'm an idiot. I try not to be. I just I'm an idiot. There's things I don't understand. He's try. He's actively trying. So, we're going to We got the whiteboard out, right? It's yo t t a y. Got it. This is the only way I'll commit it to memory. Okay. Now, I saw about 15 different",
            "start": 2160.16
        },
        {
            "text": "He's try. He's actively trying. So, we're going to We got the whiteboard out, right? It's yo t t a y. Got it. This is the only way I'll commit it to memory. Okay. Now, I saw about 15 different pronunciations for all the other words in the chat. So, we got to get to we got to get on board right now. Okay. We got to get on board right now with what how the [ __ ] we're saying these words because I'm trying my best. Everybody same page everybody. Now, it's au and that's but I just said it the way you want me to say it. Asu with a t. It's a little tatsu. So, au. You think you know like a matsub? Okay. But like if it was matsu, it'd be atu there. Oh, I like the ah. That's very very good. Oh, dude. Here. I'll put like that's good. Bike. Matzah. You could probably put a symbol over the H. Want to help me make it sound? This is This is for Greg. This isn't for everybody else in the world. All right. Matzah. Atu. Who is atu? Atsu is a different word, right? Matzah. I'm gonna say matzah every",
            "start": 2208.24
        },
        {
            "text": "to help me make it sound? This is This is for Greg. This isn't for everybody else in the world. All right. Matzah. Atu. Who is atu? Atsu is a different word, right? Matzah. I'm gonna say matzah every [ __ ] time before I Matzah. Atsu. Got it. Okay. And then the other one. What was it? Wasu in in a movie chat. That was a character. Where we at with Ezo? EO. I don't know that one. That one I'm less sure of. You know, like back in the day when I saw the word if I saw the word I don't know. I'm just I'm trying to like sound it out like myself just like what would make sense. Yeah. Like when I first saw the word edeto period spelled out and it was edo I would have assumed it was eido or something. See and there goes the chat with different [ __ ] you can't do this chat. If you don't know don't say it cuz 9,000 you're saying it all different ways now. It it's definitely not. It's looks like what people eo it's got to be ezo. If Edo period is EDO, EO's got to be EDO or Ezo. [ __ ] Goldarb,",
            "start": 2256.88
        },
        {
            "text": "say it cuz 9,000 you're saying it all different ways now. It it's definitely not. It's looks like what people eo it's got to be ezo. If Edo period is EDO, EO's got to be EDO or Ezo. [ __ ] Goldarb, you know. Don't get me started cuz Goldarb could have saved a lot of time for me right now if he would have just been like, \"Hey guys, he wasn't catching the last.\" I understand we got a lot of awards for respecting Japanese culture and doing this stuff, but what if we just named her Jessica? You know what I mean? Of course, of course. Of course. This is a joke. Everybody calm down. Don't go breaking it out. M. Okay. So, yote atu. I feel like the matzah is going to throw you off, but you might need to erase that. No, I think you leave it there. Disgrau. Ezo. And then Lord Silto is s a i just like. Okay. I don't don't no no no no no. We don't need to know the actual spelling of it. All right. Okay. How do I si say syaitto? Saito. No, that's so bad. You can't put the word sai si gh. I knew",
            "start": 2306.72
        },
        {
            "text": "like. Okay. I don't don't no no no no no. We don't need to know the actual spelling of it. All right. Okay. How do I si say syaitto? Saito. No, that's so bad. You can't put the word sai si gh. I knew that's what he was going to do. I got that's going to help me though. Saitto again because what's crazy to me? Wait, Sai two ore? Toe. What's crazy to Oh god, he spelled toe like the on your feet. I don't want to be like this everybody. I'm trying to be better. What's hilarious to me is if you were like Andy phonetically spell the word syaitto. I would put s ai the way it's spelled, you know, which you're not wrong. I know Raphael uses size and I know how to spell size. So why wouldn't I say sigh? That's not how sizes are spelled. I don't think is it. Yeah. Sai for Raphael size, is it? I got to go correct a lot of Teenage Mut Ninja Turtle fanfiction if that's not the correct. Yeah, SAI. SAI. Okay. [ __ ] [ __ ] got you, baby. Oh, I was thinking he had psychic powers. S P S Y. You've been",
            "start": 2367.0
        },
        {
            "text": "to go correct a lot of Teenage Mut Ninja Turtle fanfiction if that's not the correct. Yeah, SAI. SAI. Okay. [ __ ] [ __ ] got you, baby. Oh, I was thinking he had psychic powers. S P S Y. You've been playing too much Pokemon. Let me do it. Atsu Ezo Saitto. There you go. I picture this is how Ben is when he's trying to do something. He's like, \"No, no, I can do it. I can.\" That's actually very accurate to how my son is when he tries to tell him something. All right. Thank you very much for this, everybody. Again, I'm not I'm making an a joke out of myself. I hope you all are not like me and can commit uh reading comprehension, I guess, a pronunciation to your to to your to your to your noggin better than I can because I just can't. You were you were saying yay for or yoai for so long. Yeah. And but it was that thing of like literally it's the thing where as soon as the game debuted, we said it and we're like, is it yo tai or yay? And it was and I and I want to say you go I'm like yote",
            "start": 2421.04
        },
        {
            "text": "And but it was that thing of like literally it's the thing where as soon as the game debuted, we said it and we're like, is it yo tai or yay? And it was and I and I want to say you go I'm like yote yote and then to then it was like just resets every time. It's grindhog day in here. Not no it's 51st dates every time. A I and EI are really hard for you to figure out right now. Yeah. Yeah. Right now. And I about to be 42. This is really hard for you to do. Okay. Thank you. I'm glad we had this uh you know coming together helping Greg out just to nip it in the bud. Um now put that next to your desk and you're not allowed to get rid of it until you're nailing. We have to have a final exam. Like when the review codes come in you you we should do a video where you guys quiz me on how to say stuff and if I can get a passing score I can play the game. But that's also the thing is like the game would help so much. Jyn taught me so much. You know what I mean? He did. Yeah. It's like now where",
            "start": 2463.84
        },
        {
            "text": "and if I can get a passing score I can play the game. But that's also the thing is like the game would help so much. Jyn taught me so much. You know what I mean? He did. Yeah. It's like now where it's like when blessing mispronounces sushima. I get What does he say? He says sushima still. Oh, really? Yeah. Yeah. Yeah. It's always the emphasis on the first syabal, the first syllable. Yeah. You always got to pronounce harder. Yeah. In Yeah. I'm pretty And you want to talk about weapons? I wanted to talk about weapons. Yeah. because it feels like we're kind of getting a nice little upgrade similar to what we had with Jedi Fall in Order going into Survivor, which you know, not to bring up a game that shouldn't have won game of the year for kind of funny for Jedi Fall in Order. It probably would still if there was a recount doing the thing like he did with Medium earlier. I like that. Um, but with that going from all right, you have your lightsaber and then now we have a heavy blade for",
            "start": 2505.76
        },
        {
            "text": "still if there was a recount doing the thing like he did with Medium earlier. I like that. Um, but with that going from all right, you have your lightsaber and then now we have a heavy blade for you. Now we have the uh freaking pistol or you know the pistol gunner thing and the other lightsaber like they have different fighting styles right in Gushima we always had different fighting styles but this introducing new weapons and new styles of fighting I think is re very very exciting. Oh. Oh yeah. Put up the whiteboard next to the TV. Maybe he was gonna lead it up to the sticks. I was gonna lead it on one of the camera sticks and I figured that's a bad idea. So I'll just put it there for right now. So, super chat from Red Devil. This brings a whole new meaning to whiteboard. That's a great That's a great [ __ ] That's a great comment. That's a 21-month membership by Red Devil. Um because not only do you have your katana, but you have the Odachi, which is a longer samurai sword, which is",
            "start": 2549.6
        },
        {
            "text": "a great [ __ ] That's a great comment. That's a 21-month membership by Red Devil. Um because not only do you have your katana, but you have the Odachi, which is a longer samurai sword, which is likely going to be heavier to swing, harder hits or whatever. But I'm the most soaked for the kusariama, which is the sickle attached to the weighted chain used for grappling and entangling opponents. Anytime one of these weapons is you I always say kunai because the kunai is just the ones that you throw, but I always think that that's attached to the chain, but it's a kusarama. Anytime I see one of these weapons used in any medium, I'm like, dude, that looks like the coolest, hardest thing to, you know, it's like when people are really good with nunchucks. You ever see people on TikTok like just insane with the nunchucks? Ninja Turtles. The guy who does a bad back flip. Remember like the arrow where everybody was into the butterfly knives? Oh yeah. Butterfly knives. Oh right, right. Sorry,",
            "start": 2590.72
        },
        {
            "text": "insane with the nunchucks? Ninja Turtles. The guy who does a bad back flip. Remember like the arrow where everybody was into the butterfly knives? Oh yeah. Butterfly knives. Oh right, right. Sorry, sorry, sorry. I heard arrow. Um, I did too, but I then I put it together. Yeah, write down how to pronounce Detective Lance and the Black Canary are all write down the word air. A I a R and then row. Um, and then you have a spear which is for like thrusting attacks. Yeah. And then dual katanas and players will be able to wield dual katanas. Dual katanas is always dope. I guess you can kind of freaking uh you know power stantum Dark Souls style. Um along with the long range weapons, bow and arrows. Uh this is coming from Game Rant uh in an article they put out. But yeah, I'm just like I'm super stoked to not only mess around with the different fighting styles. Now, will each one of those weapons have a different fighting styles? I think that's maybe pushing it too far when you're trying to",
            "start": 2637.68
        },
        {
            "text": "stoked to not only mess around with the different fighting styles. Now, will each one of those weapons have a different fighting styles? I think that's maybe pushing it too far when you're trying to think of, you know, having your defensive stance or your whatever. I mean, again, they're crazy at sucker punch. And I think that was something that to me didn't sound I wasn't excited by the fighting stances as an idea, but playing the game, I liked it a lot where it was like, oh, I'm switch I'm switching this up and I'm doing a thing. I would probably I'm on the I'm on the opposite there because I used it when not out of a I get to really have fun with, you know, making this combat my own. I kind of used it almost out of necessity and I wish that I didn't have to cuz it did get a bit cumbersome switching between the things and it was kind of just more of an annoying nuisance for me. But fighting but having different weapons is a different ballgame for me. Like I am to so down to mess",
            "start": 2686.24
        },
        {
            "text": "switching between the things and it was kind of just more of an annoying nuisance for me. But fighting but having different weapons is a different ballgame for me. Like I am to so down to mess with different weapons. I love in Souls games having different styles of damaging people because in Souls games you have um you may think they're all interchangeable, but certain weapons are weaker to strike weapons which are clubs or hammers or maces and certain weapons are weaker to piercing weapons which are like you the rapier or certain you know uh um what am I thinking of like a big old spear? Big old staff. Yeah, big old spear. whatever. Um, and so there's a lot of like different damaging styles that gets me excited cuz I level up two things. It's like, oh, these, if I'm fighting these rock enemies, they're weaker to strike type damage. Let me bust out my uh my morning star maces or whatever. And then when I get back to fighting normal dudes or whatever, bust out my sword or whatever",
            "start": 2732.96
        },
        {
            "text": "enemies, they're weaker to strike type damage. Let me bust out my uh my morning star maces or whatever. And then when I get back to fighting normal dudes or whatever, bust out my sword or whatever blade I'm using to slash cuz I think different damages is just a really neat way to kind of, you know, make make it your own. My thing with the fighting styles and then the weapons is I think if you could switch if you're switching to a different weapon and then the different fighting style, you just unlock a different way to use that weapon, which would be cool. I just don't I I guess the way I think the amount of work it would take to go, all right, we need animations for not only all these different weapons, but four different styles for each of like a defensive stance with those Kusari Gama. I hope I pronounced that right. uh write it down on the board. And now you now you're defensive. So now the attack animation has to look different when you're coming from a different angle on it.",
            "start": 2782.32
        },
        {
            "text": "I hope I pronounced that right. uh write it down on the board. And now you now you're defensive. So now the attack animation has to look different when you're coming from a different angle on it. Like I just feel like that may be a [ __ ] ton of work, but also what we just saw looks like a [ __ ] ton of work and it looks [ __ ] incredible. CJ Splitz on the chat says the blog says there are new weapon m I'm sorry. There are weapon masters that teach you new skills. They've ditched the regular leveling system which sounds pretty [ __ ] cool. Sounds like uh Star Wars Outlaws, a system that, you know, I did actually kind of kind of enjoy. Oh, right. That is right. Where Yeah. There wasn't a skill trait. You had to like go out and do like missions from people and learn from people out in the world. That is a very cool system. I did enjoy that. That's almost like an ally system, you know, almost not a nemesis system. I see where I see where with that one. Plus, you got the dog now. Oh,",
            "start": 2827.04
        },
        {
            "text": "world. That is a very cool system. I did enjoy that. That's almost like an ally system, you know, almost not a nemesis system. I see where I see where with that one. Plus, you got the dog now. Oh, yeah. Wolf. So, wait. So that's like that he's chilling with you the whole time. Yeah. Well, the whole time I doubt it, but you're sicking him on dudes. I think so. Yeah. That's what the trailer showed there. Is it going to be similar to like your little BB-8 or whatever that little guy was in Star Wars? I think it would be more useful than that. BB8. Don't I love I'm just saying very useful. Bar, have you gone back to Jedi uh to freaking uh not Jedi, but Sorrows Outlaws since they fixed quote unquote fixed everything? No, because a lot of the big fixes was like right like uh taking out um automatic loss like during force stealth sections and stuff. For me, it was the fundamental uh kind of design of the game in terms of uh base structure and all that just feeling very uninspired and the",
            "start": 2866.88
        },
        {
            "text": "loss like during force stealth sections and stuff. For me, it was the fundamental uh kind of design of the game in terms of uh base structure and all that just feeling very uninspired and the momentto moment gameplay kind of conflicting with that. I really [ __ ] hate it when I picked up that cool ass sniper in the beginning and they're like, \"You got to go down this ladder. You got to put it down. You can't take the sniper with you. You got to leave it there.\" That was super cool. That sucked. That was That was a bad choice. Like, let me keep this gun. Let me loot [ __ ] over. I do want to try some of the DLC though because it's like Sabach coolest part of that game. Love Sach. Love a good card game in a video game. Honestly, Sabach I didn't [ __ ] with really. Wow. I feel like after the year of Queen's Blood becoming such an incredible thing that took over my life and once I finally learned how to play it, just being really enthralled with it. But Sabach never really vied with me,",
            "start": 2912.48
        },
        {
            "text": "year of Queen's Blood becoming such an incredible thing that took over my life and once I finally learned how to play it, just being really enthralled with it. But Sabach never really vied with me, huh? Hey, Greg, I have a bone to pick with you. Sure. When we did the preview for Clare Obscure Expedition 33. That's right. You were You were creaming your jeans being like, \"Man, I can't [ __ ] wait to play this game.\" Yeah. What are you doing? I played it for three or four hours and then I just got to that point that I get to where it's like, \"All right, I'm going to sit down and play more. I'm really enjoying the story. It's beautiful. It's all these different things.\" And then I was ah I gotta fight this guy. I really I just don't like turn-based combat. It's my problem. It's a me thing. Even with the activ even even with the activity stuff like I like that about it. And I've played other games that had that. Uh you know Sea of Stars uh has me being active in there doing things like I",
            "start": 2954.88
        },
        {
            "text": "with the activ even even with the activity stuff like I like that about it. And I've played other games that had that. Uh you know Sea of Stars uh has me being active in there doing things like I enjoy these games but I just burn out. I just get to where I'm like I want to play other things. And so it was like I played a lot of it on my Rag Rag Ally X ROG Alli X. Uh I intend to one day get back to it. I think I'm just going to restart on PlayStation when the time comes. But I had that thing where I was like, \"Okay, cool.\" And I came to work cuz I I was re I was playing it when we just got codes. And so I came back and you guys were all gung-ho on it. You were all so deep on it. And I was like, \"This is a great example of where I don't need to bite down and keep going. You guys got the review. I can go play Monster Hunter. I can take a week off and play Monster Hunter like I want to before Oblivion, before I move on to Redacted, before X, Y, and Z.\" And so I was like, I'm not going to",
            "start": 3000.96
        },
        {
            "text": "I can go play Monster Hunter. I can take a week off and play Monster Hunter like I want to before Oblivion, before I move on to Redacted, before X, Y, and Z.\" And so I was like, I'm not going to force this one and go. I I think it's gorgeous. I think it's awesome. I think the story is great. I think the voice acting is great. I think the setup is amazing. Like I want to get back to it. But even when people like, \"Oh, put it on story.\" It's like, \"Well, then why why am I just not watching a compilation of cut scenes at that point?\" You know what I mean? And I think part of it was to being on a plane and it was like, you know, I'm playing on a plane at parts. I'm getting distracted obviously by Banner taking care of that. So then it would be the thing of coming back in like, \"Oh, wait. How do I parry this guy again? What is this guy's thing?\" Da da da da. I'm going to secretly call Jen and I to be like, \"Jen, can you tell Ben be like, \"Daddy, but I I want to know what happens with",
            "start": 3036.96
        },
        {
            "text": "How do I parry this guy again? What is this guy's thing?\" Da da da da. I'm going to secretly call Jen and I to be like, \"Jen, can you tell Ben be like, \"Daddy, but I I want to know what happens with Gustav.\" Yeah, exactly. More on me, you know, like I want to know what happens with that party. Yeah. I just guilty you into it. I mean, I want to play more. I'm not This is not a game I'm like is dead to me or anything like that. It's just like it's not the time for it right now. It's similar to Ghost of Sushima. Don't put this on me. I'm just saying you had it. Don't put this back to me. You had the quote here. I wrote it down on the shushima. You play at launch said this isn't hitting right now. You came back to it a year later. Yeah. Wow. My question for you is when October 2 rolls around, do you think you'll be ready for Yote? Um, oh, oh yeah. Yeah. Oh, yeah. Okay. I was, if anybody remembers during my uh discussion with of Rise of the Ronin, four hours into that being like, I'm going",
            "start": 3068.96
        },
        {
            "text": "do you think you'll be ready for Yote? Um, oh, oh yeah. Yeah. Oh, yeah. Okay. I was, if anybody remembers during my uh discussion with of Rise of the Ronin, four hours into that being like, I'm going to reinstall Ghost. Like, I just I want to have a better taste in my mouth right now. Um, because How long is Ghost? How long is Ghost? Yeah. Uh, a great question. It took me like 20 to 30 hours maybe to to kind of beat it, but I think you could be in there for like 60 or 70. Okay. It's a big ass game. That that was one that did not hit for me when it came out and then I just never went back to it uh unfortunately. So I might try it. I'm I'm not really looking forward to anything uh super on my radar until Night Rain. Um so maybe that's what I play for the next month or so. Yeah. Okay. Uh I want to get some super chats in here because we have so many. Matt Thornton writes in on youtube.com/kindfunnames just like you canon says one concern I have with Yotay is that the missions will get",
            "start": 3107.52
        },
        {
            "text": "want to get some super chats in here because we have so many. Matt Thornton writes in on youtube.com/kindfunnames just like you canon says one concern I have with Yotay is that the missions will get too repetitive. Don't get me wrong I love Sushima but you have to admit most of the missions were exactly the same. I wonder Matt and I'm not going to make you super chat again if you mean like I was talking about the side activities or you mean missions in general because for me the flavor of the missions of who I was going after, why I was going after them and stuff like that that always I never thought the missions got stale as much as side activities. Yeah. I I mean I got to assume with you know I I hope that they can do a lot visually and tonally to make all of these bosses that you're going after feel if anybody's played uh Sefue and there's only four of those bosses there that you're kind of going after for revenge but each one of them had their own their own flavor which was like",
            "start": 3161.44
        },
        {
            "text": "after feel if anybody's played uh Sefue and there's only four of those bosses there that you're kind of going after for revenge but each one of them had their own their own flavor which was like totally different and obviously they doing a lot with visuals and stuff because the game isn't like 100% rooted in reality. Uh the game does a lot of really like, you know, uh trippy things visually and even gameplay-wise where suddenly you're just sidescrolling doing the raid type, you know, takedown. Um, but I hope that they can differentiate them in a big way to where my my biggest hope is that when we are all done with the game and we are reviewing it, we all have our own favorite bosses and go, \"Dude, I love this one because of how the story played out and that one twist and it's like, well, but this one, the setting had this visual kind of like different thing cuz everything was on fire.\" Whatever it may be. I really hope that these all feel like like a different season of television or",
            "start": 3201.52
        },
        {
            "text": "but this one, the setting had this visual kind of like different thing cuz everything was on fire.\" Whatever it may be. I really hope that these all feel like like a different season of television or just a a completely different experience for sure. While you're still killing a dude, granted you're still doing a murder or whatever. But I think there are really cool ways to I I think what I'm just so stoked about is get like when we see that first guy ask her, \"Oh, who? I thought we killed your whole family, whatever.\" I I loved that characterization and I hope that they all have really distinct personalities. Uh, I have good news for you. Lady Snow Blood is on Max right now streaming, so I've added to my list. You could do that as well. Uh, CJ splits on super chats and says, \"Do we think they're deemphasizing stealth/ninja?\" I think absolutely not. I think we're seeing it very much through the lens here of getting ready to confront all these people in your duels. I think you'll still",
            "start": 3257.2
        },
        {
            "text": "they're deemphasizing stealth/ninja?\" I think absolutely not. I think we're seeing it very much through the lens here of getting ready to confront all these people in your duels. I think you'll still be sneaking around, stabbing people from bushes, doing all that jazz. Yeah, you still I mean I think once we get a deeper dive of gameplay and whatever the next big PlayStation showcase or state of play or whatever it may be, that's when we might get a Here's what a stealthlike encounter looks like. Uh shout out to Lucid Dream who says uh I know you did uh with Nine Souls. Yeah, Nine Souls had that very similar thing that I loved about Sefue where every boss was so different. The leadup to it was so wildly um varied. What a fantastic video game. Uh, as I have told you throughout the show, uh, several sucker punch people have been texting me to talk [ __ ] or, you know, just be jerks. Uh, one apparently is super chatting. Uh, Brendan Barry super chats and says, \"This is the first game I've",
            "start": 3301.68
        },
        {
            "text": "several sucker punch people have been texting me to talk [ __ ] or, you know, just be jerks. Uh, one apparently is super chatting. Uh, Brendan Barry super chats and says, \"This is the first game I've been working on since graduating. To have you guys react to it is such a surreal experience for me. Thanks for all you do.\" Thank you, Brendan, for being a kind of funny best friend. Getting a game degree. I assume you're game design. Maybe you are Trailer House. I don't know. Uh, but apparently working at Sucker. Congratulations to you. That's awesome. Thanks for watching live and paying. Unlike the other sucker punch freeloaders who are just texting me to be jerks, you know what I mean? Cuz I can't read. Be cool. What if they don't give us review codes? Oh, trust me. They have no power there. That's all Sony PR. Don't get me wrong. You don't know. I'll tell you about the hierarchy and where it leads. Don't pick fights, Greg. Don't fight. I'll pick fights with whoever I want to. Uh Dean",
            "start": 3349.52
        },
        {
            "text": "That's all Sony PR. Don't get me wrong. You don't know. I'll tell you about the hierarchy and where it leads. Don't pick fights, Greg. Don't fight. I'll pick fights with whoever I want to. Uh Dean says, \"Awesome trailer, but is it kind of weird this showed up on a random Thursday with SGF around the corner?\" Technically Wednesday. We're just reacting late with SGF around the corner. I guess that would be too close to release. I don't think it's so much close to release as much as we've talked about this a million different times of video games, video game marketing and marketing beats. I think you you want to have a beat where you get to talk and have the attention, right? And even though yesterday we kind of funny put our attention elsewhere, this is a chance for Ghost to come out. Here's the release date. Here's the pre-orders. here's when we're going to have the big box edition and go all that stuff and then yeah, I would hope hope at Sucker or I'm sorry at SGF they're doing demos",
            "start": 3387.6
        },
        {
            "text": "the release date. Here's the pre-orders. here's when we're going to have the big box edition and go all that stuff and then yeah, I would hope hope at Sucker or I'm sorry at SGF they're doing demos or if they're not doing them at SGF showing something on Jeff stage doing a trip to Seattle/Belleview to go there and play it or do whatever do something in LA, San Francisco, whatever. Like there's lots of stops on the Ghost of Yote uh train we're on right now. So I I don't think it's weird to do this. This is how PlayStation usually does their stuff, right? They want their games to have their moment and they feel the blog and obviously all of this stuff can go out there and get it done. Well, I I mean I still think it was kind of odd that it was released in the way that it was like that that it wasn't this is what I come to expect from PlayStation. I think that it wasn't a a larger sort of on a larger stage. And when I mean stage, I just mean a showcase with a couple of other games. Um",
            "start": 3426.48
        },
        {
            "text": "it wasn't this is what I come to expect from PlayStation. I think that it wasn't a a larger sort of on a larger stage. And when I mean stage, I just mean a showcase with a couple of other games. Um because yeah, just waking up that morning seeing this like oh what was this leaked? I was like oh no that's it was just a PlayStation blog thing. I especially for a trailer like this which seems a lot more important story-wise but the last one was more of hey let's show you how beautiful this world is that we're crafting but we're not necessarily giving you all the details. This one is very you know we are going you're getting the gist of what's happening in this experience. I was kind of surprised that it was in a in a blog on a random Wednesday drop. I think PlayStation does this a lot. And I also don't think it matters, right? Because a random drop this that the other. Like you go to the thing, it's been up what 24 hours now and it's got 1.4 million views, number 12 on trending right",
            "start": 3469.28
        },
        {
            "text": "I also don't think it matters, right? Because a random drop this that the other. Like you go to the thing, it's been up what 24 hours now and it's got 1.4 million views, number 12 on trending right now. I think I think I saw gold far Instagram that it was like number six, number four somewhere in there yesterday on trending. Like it's this is one of those games that makes its own news cycle of like you want to talk about it, here it is. You don't need SGF necessarily for it. Again, SGF is for those in a lot of different ways. Double A's higher up and then a big reveal of course, but this is a known quantity. We know we're going to love this. We're going to have a preview event. I assume we're going to have the review stuff. You're going to have a whole bunch of stuff in the leadup to it. So, no, I I personally wasn't surprised, but I can understand that. Um, Dublas in the Twitch chat says because Sony's going to reveal something big at SGF. That's not out of the possibility. I I mean",
            "start": 3517.92
        },
        {
            "text": "So, no, I I personally wasn't surprised, but I can understand that. Um, Dublas in the Twitch chat says because Sony's going to reveal something big at SGF. That's not out of the possibility. I I mean I when we think of where Sony Santa Monica is or um uh freaking like whatever specifically whatever Barlo is working on. Yeah, that's that's mainly where I'm at uh thoughtwise where that has to get revealed somewhere and sometime soon. Um do you want to sort of overshadow your upcoming game in that way? Like I the thought process there kind of makes more sense to me. When I think of if you were to release this trailer and wait for a summer gamefest thing, how dominated be by the big the other big day and summer gamefest is the place like a game awards where that Jeff showcase is the here's exclusive exclusive never before seen game reveal like again we know we can't wait for Yay. So to put the release date out there and an amazing trailer I think it would have just gotten a bit lost in",
            "start": 3554.48
        },
        {
            "text": "exclusive exclusive never before seen game reveal like again we know we can't wait for Yay. So to put the release date out there and an amazing trailer I think it would have just gotten a bit lost in the shuffle of it. We wouldn't have done a Games Cast all to it. You know what I mean? Yeah. We're we're the we're the taste makers. We decide what works and doesn't work. Uh, final chat before we get out of here comes from Alex Frasier, uh, who super chats on youtube.com/confunn just like you can and says, \"This is my most anticipated game of the year and nothing will top it.\" I can say that with certainty. Sucker Punch is goated. Dude, this year, man, I can't believe that for me after somebody who's experienced a lot of blueprints. Yeah. and just completely marveling and astounded that, you know, humans are still capable of incredibly creative and wonderful things. Yeah. To play that and just be blown away by it and be like, \"Yeah, that's probably going to be game of the year, even",
            "start": 3606.88
        },
        {
            "text": "you know, humans are still capable of incredibly creative and wonderful things. Yeah. To play that and just be blown away by it and be like, \"Yeah, that's probably going to be game of the year, even though it's definitely not a game that I gravitate towards.\" Yeah. And then to play Clare Obscure and be like, \"That's my game of the year right now.\" And then we still have this. We're still in We're It's almost May, but we still have something like Gossushima. Yeah. Or Gosote rather. I I can't believe how sneakily stacked this year has become crazy. Because I think at the beginning of the year, no, never mind. I'm totally lying. This year was always kind of like, \"All right, it's going to be crazy because of something like well, not only GTA, but also um freaking the new Doom, you know, like this. This is a pretty massive.\" Oh, Captain has a super chat that goes Delta late August. hell is us week one week later ghost early October. Uh with all that I don't even need a GTA 6 this year.",
            "start": 3653.0
        },
        {
            "text": "this. This is a pretty massive.\" Oh, Captain has a super chat that goes Delta late August. hell is us week one week later ghost early October. Uh with all that I don't even need a GTA 6 this year. Yeah, delay it. We'll see if I mean for my fantasy critic, please. Mike won't get the points though. Yeah. Yeah, exactly. God, Expedition 33 is so good, chat. So [ __ ] good. It's so good, man. I was watching uh a lot of my video yesterday of it with the chat just like, \"Oh, I can't wait for them to see this part. Yeah, I can't wait for for them to get to like here and and then watching that one and the way the music like culminates to start this fight. Like, god damn, dude. What an experience. Everybody, we hope you enjoy video game experiences like Expedition 33. Review right now up of course on youtube.com/kindfunname, Spotify, Apple, all the podcast services, and hopefully we all enjoy Ghost of Yotay when it comes out on October 2nd. Of course, we'll be covering it throughout these many",
            "start": 3699.68
        },
        {
            "text": "on youtube.com/kindfunname, Spotify, Apple, all the podcast services, and hopefully we all enjoy Ghost of Yotay when it comes out on October 2nd. Of course, we'll be covering it throughout these many months here on Kind of Funny. Of course, if you like us covering games on kind of funny each and every weekday live on a variety of platforms, we'd love you to pick up that kind of funny membership. YouTube.com/kindfunnyames, patreon.comkindfunn, Apple and Spotify. Get all of our shows ad free, get a daily podcast from me, and of course, get good karma for supporting us. If you want to keep supporting us and you're watching live, no big deal. Twitch doesn't have to go anywhere. YouTube.com/confunnames. You'll get a new link. Up next is Andor episode season 2 episodes 1 through three spoiler cast. After that will be a marathon stream from the gentleman. Not a marathon stream. A marathon alpha stream. A game stream where they play the game marathon. Semantics. Semantics. Uh ladies,",
            "start": 3743.44
        },
        {
            "text": "cast. After that will be a marathon stream from the gentleman. Not a marathon stream. A marathon alpha stream. A game stream where they play the game marathon. Semantics. Semantics. Uh ladies, gentlemen, and NBS, until next time, it's been our pleasure to serve you.",
            "start": 3783.6
        }
    ]
}