{
    "id": 13913,
    "video_id": "bP8mnezf47s",
    "show_name": "Gameplay",
    "hosts": [
        "Nick Scarpino",
        "Joey Noelle",
        "Mike Howard"
    ],
    "title": "Mike and Joey Introduce Nick Into A Life Of Crime In Schedule 1",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page -  https://nwzo.io/click/dzexr/\nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\n\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1744931611,
    "duration": 7196,
    "transcript_chunks": [
        {
            "text": "Three, two. Yo, what the heck is going on kind of funny best friends? It's your guy Snow Bike Mike back again for another kind of funny games afternoon stream. And today we got a special one for you. Today, this Thursday stream has been kicked around. We went back and forth and I'm glad that we landed here today. So, I want to first off and thank Joey because Joey, this stream is possible because of you. So, thank you this weekend. Joey heard she was like, \"Oh, Mike, I hear you need to slot in a stream. Can I help you?\" And I said, \"Joey, I would love some help.\" And so, Joey, you brought me and Nick together because we're going to we're going to take Nick to the streets. Oh, I'm so excited. We're going to show him schedule one for the first ever time. Schedule One has taken over the internet, taken over the gaming world, and I'm glad that we can return back to it. Maybe Joey, this is the goal today, okay? Is to get Nick so hooked. Yeah. So hooked on the smack that we can come back and",
            "start": 7.92
        },
        {
            "text": "taken over the gaming world, and I'm glad that we can return back to it. Maybe Joey, this is the goal today, okay? Is to get Nick so hooked. Yeah. So hooked on the smack that we can come back and play more schedule one because I don't want to just do one restart stream. I want us to make a drug empire together. I'm excited about this, Mike. I've been hearing you guys talk about this for a very long time. Yes. And I'm just wondering when you needed the heavy, your enforcer to come in. need the guy and just let a [ __ ] know. Now I'm starting a new game and I don't know. It says what is specifi specify a name for your organization. Yeah. And I kicked around a lot of different names. Okay. Give us But I think I I think I've as just to be inclusive. Yeah. And to let you guys know that this is a team. Uh our organizational name will be Fenton. All that's very good. Thank you. That's very good. That's very good. Oh man. Um was Nick supposed to invite us before? Uh Nick will invite us. He",
            "start": 53.68
        },
        {
            "text": "is a team. Uh our organizational name will be Fenton. All that's very good. Thank you. That's very good. That's very good. Oh man. Um was Nick supposed to invite us before? Uh Nick will invite us. He just had to first and then he will invite us into his world and we'll go join Nick. We're very excited. Of course, chat, let us know where you are in schedule one. I know Joey, as she said, got addicted to the game throughout last week. Created four days ago, last played three. Oh, this is actually right. But yeah, I've put in like 20 hours of Joey has put talked about this game on a games cast because yes, this is a good game right here, y'all. Uh me and the boys have gone all over the place. We have three worlds going on right now and so you never know. Do you have like a solo world and then like a I have a solo world. I have a Washi and Mike and JD world. And then the big world that you want to play in is Kevin Aex, Chris Anken, Maddox world. I don't doubt it. They got the good [ __ ]",
            "start": 94.32
        },
        {
            "text": "like a I have a solo world. I have a Washi and Mike and JD world. And then the big world that you want to play in is Kevin Aex, Chris Anken, Maddox world. I don't doubt it. They got the good [ __ ] going. I can see Kevin I can see Chris did like just [ __ ] sat on this game like he did with Icarus where I come back and we've got alien technology. Yeah. You leave as like a lowly dealer. Yes. And you come back to an empire. You come back. That is how it went. We came back to an empire. We were laundering money. Uh we all of a sudden had a barn. We were moved on to The barn is so far. It's so fun. Uh Nick Scarpino, do me a favor. Yes, my friend. Uh click shift tab. Okay. And I'll invite you guys and invite me and Joey if possible. Uh friends in the game. All I see is bros. So, let's see for friends who have played this game. Oh, this is my first time doing this through Steam. Mike, you might have to come over here and I'm going to come over there. Is this like the fun thing where it's",
            "start": 143.36
        },
        {
            "text": "friends who have played this game. Oh, this is my first time doing this through Steam. Mike, you might have to come over here and I'm going to come over there. Is this like the fun thing where it's like, are we Steam friends? Well, I saw you guys at I can back out and just start a new game. But what do we Hold on. Let me see. Can I There little snowbike mic. Oh, you know what? Yeah. That's Oh, from the beginning menu. Make it easy. Joey, you got an invite. I got an invite. Let's get all in there second here. Here. Nick invited me to schedule one. I'm in. Let's go. All right, Nick. Restart the game. Pick a new game and let's get it going. JG says, \"Reporting for duty.\" That's what we need. We need We need loyal people out there that won't rat on us, that are willing to get out there and sell some drugs. I tell you one thing right now, Mag, we've had we've had a lot of run-ins with people selling illegal substances today. So, this is perfect. This is par for the course. Shockingly",
            "start": 191.36
        },
        {
            "text": "sell some drugs. I tell you one thing right now, Mag, we've had we've had a lot of run-ins with people selling illegal substances today. So, this is perfect. This is par for the course. Shockingly accurate. Very accurate. Hi, Miss June Bug over on the Twitch side. Welcome in. Uh Joey, I don't know if you've heard there's a couple of strategies on the pregame. Couple strategies cuz like you know things happen here, but like they were like you could grow this weed right here. Start off with weed in your back pocket. Oh, some helpful tricks to think about there. I never would have thought about that. I will uh I'll do that for us as maybe Nick goes and uh answers a phone call. I think I I got to do Oh, you're going to prune it? Yeah, I I'll chop it up. Prune it up. How the heck do I open [ __ ] up? How do I get inside? Usually E. I don't hear any phones. Oh, yeah. I guess I don't really have game audio, but do you need it? No. You ever think about getting Mike just you and me getting an",
            "start": 249.12
        },
        {
            "text": "up? How do I get inside? Usually E. I don't hear any phones. Oh, yeah. I guess I don't really have game audio, but do you need it? No. You ever think about getting Mike just you and me getting an RV with Joe and we just setting up the trimmer's okay. Okay, I got the trimmers, Mike. Nick's got the trimmers. Okay, I'm gonna get the water pot, too. I love that. And of course, you will see Nick's screen as he learns today. Uh Kevin is out today. Barrett is working on a very awesome project. So, we're all just doing stuff. So, today we're just going to have a lax stream. Oh, little bit little bit of our boy Nick Scarpino. And we're just going to have some fun chat. Of course, we got cool stuff to say. I know you don't embibe in marijuana, but did you know it's the actual buds, not the leaves that you smoke? I had an interesting conversation about this last night with Katie. Can you believe that it's weed week here? Did you know that weed week is it's a big deal? I actually watched 4:15,",
            "start": 291.68
        },
        {
            "text": "that you smoke? I had an interesting conversation about this last night with Katie. Can you believe that it's weed week here? Did you know that weed week is it's a big deal? I actually watched 4:15, too. Yeah, I watched a very interesting uh news piece here in San Francisco about weed week and actually how the sale of weed has gone down over the past four years in the state of California and down yeah I think because taxes are getting a little high on it and so people they're worried that people will start going outside of now the legal ways of getting weed and they're worried about that but they're trying to push on we're going back to nature everybody we're trying to say hey you know 420 is a big deal here in San Francisco. We need to sell more weed. I think I accidentally just smoked weed. You can definitely smoke weed, bro. Can you Is this the packing station? Thank you to Leonard NL and Spenny B. That's not the weed station. Is this the packing station? No, the packing station's",
            "start": 339.28
        },
        {
            "text": "You can definitely smoke weed, bro. Can you Is this the packing station? Thank you to Leonard NL and Spenny B. That's not the weed station. Is this the packing station? No, the packing station's inside. Oh, it's inside. Okay. I just smoked weed. Oh, I see. It looks like we have to do all of this. Oh, yeah. This is This is the tutorial. I never played this. This is really Yeah, I was like, what? Where are we? Oh yeah, we have to do guys. I'm pack I'm Dude, I'm so packed. Pack it up, bro. You got to pack the truck. We got We need to make a game cuz this is perfect. Do we need to make a game or do we need to play games that other people have made that we love? I just think me and Mike sitting in a room being like, what could we do? What's the game that This game is like I wonder how long this took to develop and then I think to myself, what kind of psychoticness would would happen if Mike and I made a game? Like it would be like this, but then the back rooms happens. Damn. This is the",
            "start": 384.8
        },
        {
            "text": "took to develop and then I think to myself, what kind of psychoticness would would happen if Mike and I made a game? Like it would be like this, but then the back rooms happens. Damn. This is the uncle, bro. I never knew this was the uncle. Yeah. Oh my god. Oh, cuz you missed the whole back room. I've only Yeah, I've only accepted a phone call from him. Oh, wow. I packed all the weed, but maybe I smoked some of it. But then what does it say in the left corner? It says, \"Another day in paradise. Pack all the weed at the packing station.\" [ __ ] yeah. Pack that weed. You got to take it out. Oh, you got to take it out. Got it. There you go. Okay. That's very Okay. Did I take it out? I have it. What do I do? Luckily, you have Mike and I. You know what? This was the perfect call, Joey, because it is 4:20 on Sunday. [ __ ] yeah. And like we get to do a little fun. So, let's do this. 420. Leonard NL says, \"Gotten to uni. My second uni degree at 38 years old. Back to school. I go to become a",
            "start": 429.6
        },
        {
            "text": "it is 4:20 on Sunday. [ __ ] yeah. And like we get to do a little fun. So, let's do this. 420. Leonard NL says, \"Gotten to uni. My second uni degree at 38 years old. Back to school. I go to become a psychologist. Sometime with some subs.\" A Leonard, thank you so much for Yeah. big congratulations. That's amazing. I think I ran out of weed cuz I smoked one of them. And now it's not letting me do the tutorial. Oh no, that could be a problem. That I'm supposed to have eight. I smoked one of them by accident. I don't probably go up to the guy like you need to keep it in your inventory. Oh, I got to keep a manager. Okay. Like in your Yeah. hopper. Okay. What do I go to now? Who do I sell to this old lady in the wheelchair? That's your uncle. But yeah, this old lady in the wheelchair. Listen, we just need to get you through this tutorial so that we can go I need to start gaffling fools, dude. I want to be your enforcer so bad. I just That's perfect because all I want to do personally is um",
            "start": 471.76
        },
        {
            "text": "just need to get you through this tutorial so that we can go I need to start gaffling fools, dude. I want to be your enforcer so bad. I just That's perfect because all I want to do personally is um pick up all the trash on the ground and sell it. That's my favorite. Pack the [ __ ] weed. What do you want me to do? There's no more weed to pack. What is it saying? It says, \"Pack all the weed at the packing station.\" But it's all packed. I have seven. I think I'm supposed to have eight cuz I smoke one. Oh, you definitely uh No, you sell only six. Yes. Okay. So, where do I Where the hell do I go? Another day. You have more weed to pack. Like maybe you left some on the station. Oh, maybe. Let's take a look. Now, I'm just smoking right now. Okay. Now he's just smoking his own supply. Oh, yeah. I'm definitely smoking my own supply. Yeah, you're definitely smoking on your supply. Whoops. Well, now I've really gone down. Well, now you probably have to go back inside and like there's probably",
            "start": 521.24
        },
        {
            "text": "I'm definitely smoking my own supply. Yeah, you're definitely smoking on your supply. Whoops. Well, now I've really gone down. Well, now you probably have to go back inside and like there's probably more. Yeah. Chris, come sell some weed with us. We miss you, Chris. You got Well, my pot's done. I got to grow my pot. Well, how do I get water? Uh, there's a watering. No, inside. You just Everything's just inside. Huh? Go to the Well, yeah. You got I mean, you can't have it outside. And then you go water the plant. Not water the plant now. Give me that money. And then you use A and E to tip it over. really or Andy got to go over the things. Yeah, this is a fun mini game. It's real fun. Yeah, this Yeah, this is all This game is very good. I don't know what Nick has to do now. I'm going to be honest. I'm going to step over to control to see what it looks like. I'll help him out. Well, I have five weeds. I think I'm supposed to have Paradise pack ups all the weed at the packing station. So,",
            "start": 573.36
        },
        {
            "text": "I'm going to step over to control to see what it looks like. I'll help him out. Well, I have five weeds. I think I'm supposed to have Paradise pack ups all the weed at the packing station. So, turn around. Look at that packing station. Yeah, it's gone. Do you not have something on the floor? Do I? I'm trying to see if there's nothing on the floor. I think it's cuz I smoked a bunch of weed by accident. They say don't get high on your own supply. I believe that that is probably Let's Let's restart the world, Nick. Let's just skip it. We'll just skip the tutorial, folks. Hold on. I said I'm stuck. I'll just smoke again. Folks, this is what happens to kids when they don't go to college. You just end up in the desert making meth and smoking [ __ ] All right, run it back. Quit the game. Restart. All right, we're just going to I'm doing so well on the tutorial. I'll just do the tutorial again. Okay. Yeah, whatever you like, big dog. We're We're in. We're down for that. Do I have to exit? I",
            "start": 626.08
        },
        {
            "text": "All right, we're just going to I'm doing so well on the tutorial. I'll just do the tutorial again. Okay. Yeah, whatever you like, big dog. We're We're in. We're down for that. Do I have to exit? I don't Yeah, you got to accept my invite again. New invite. I find my invite. Uh, check your Steam one, Nick. Give us uh two new ones, please. Two new ones out. I'm in. All right, we just got to get Joey and we're in. All right. How did you break it already? There we go. Oh, wait. It might have just saved it. I might have just put us right back in the same game. Last time it asked me if I wanted to restart. Oh, no. It's good. It's No, we're back. I got This time I'll focus. This time I'm not going to smoke the weed. You can't smoke the weed until we're all playing. Exactly. We got to make as much of the weed. I'm going to be that liability. I'm such a liability though. I'm such a [ __ ] liability. The one person that doesn't maybe smoke weed regularly anymore. Well, I guess you don't really.",
            "start": 671.6
        },
        {
            "text": "of the weed. I'm going to be that liability. I'm such a liability though. I'm such a [ __ ] liability. The one person that doesn't maybe smoke weed regularly anymore. Well, I guess you don't really. I never really smoked weed and Mike doesn't really I feel like fell off. I think about Greg too much. I think that's about He's got a kid, man. He's got a kid. He doesn't think about you, Mike. That's what I got to remember. It's So, you're always so stressed and it's like not even illegal. I can't even I can't be letting him down. I don't think he would be let down by it. He'd just be disappointed. I think he would be. He expects more from me. I mean, I expect more from I expect more from you and you don't care. Greg doesn't Once Greg's gone, he doesn't think for 5 seconds about you. I think about you all the time. Oh, you're the best. I think about you like you're the kid that I never had. Uh where are we at right now? Someone asked, \"Is the Nuzlocke done?\" No. Uh that Nuzlocke will",
            "start": 721.84
        },
        {
            "text": "about you all the time. Oh, you're the best. I think about you like you're the kid that I never had. Uh where are we at right now? Someone asked, \"Is the Nuzlocke done?\" No. Uh that Nuzlocke will return Tuesday through Thursday next week where Nick Scarpino will hunt down a legendary bird. Oo. And he'll take on the Elite 4 to hopefully become Pokemon Champion of Pokemon Soul Silver, Lugia. So be prepared for that as Nick is now back. We've missed him. Uh he went on vacation. And I wasn't too happy about it. You hate when anybody leaves. M text me a lot. Yeah. Not happy about that. The building the country. No, it was the weekend. Why would I be texting you? Hey, I know that you're on vacation. Why would I bother you? Nothing of like desperate importance. Joey never calls me. What did we talk? I think me and Nick talked a little bit about the Rizzler. We did. I hit Oh, and Roger's disrespect for the Rizzler. I hit him up and I said, \"Why does Roger disrespect the Rizzler, bro? We",
            "start": 773.68
        },
        {
            "text": "we talk? I think me and Nick talked a little bit about the Rizzler. We did. I hit Oh, and Roger's disrespect for the Rizzler. I hit him up and I said, \"Why does Roger disrespect the Rizzler, bro? We don't.\" I said, \"We don't talk about the Rizzler enough.\" Yeah. And Mike said, \"Roger disrespect.\" He talked about the Rizzler a lot like four months ago. Disrespects him. Okay. Morning. Okay. So, select a time to deal afternoon. Right now, you can only do do morning. Yeah, cuz we're literally driving. This is just a tut, Nick. We got to get Joey is flying through the tut. It's amazing to watch. We're just off-roading. I like how he's scheduling it through his messenger app. That's Yeah. Oh yeah, dude. They got a whole They got a whole thing going on. This is an operation. I'm going to stab Uncle Nelson in the eye with these prunes. These pruners. These prunes? Is that what they call? Shears. Morning, bud. Sure is. You ever get invited out to some guy's farm to trim some weed before? No,",
            "start": 824.8
        },
        {
            "text": "Nelson in the eye with these prunes. These pruners. These prunes? Is that what they call? Shears. Morning, bud. Sure is. You ever get invited out to some guy's farm to trim some weed before? No, but I do. No, but one of that's what one of my like childhood friends does. Yeah. Hey, you want to come out to the farm and trim weed? I was like, I don't know if I really Uncle Nelson said I could take That sounds kind of fun. Do I get to smoke the Yeah, that's the thing. I was like, what if you just like, can I just take a tour? I don't really want to do any like manual labor. What if I took a tour? I'm going to the salt flats, everyone. Oh, yeah. We're waiting for you there. We did it for the high desert, baby. I like this car. I like that you can't use it's just a car. You can't use the mouse at all. No. No. Stop your job. Come make a game with us. We're not even making a game. Give me money. I'm going to will that into existence. I want to make a game. What kind of game? Oh, the most",
            "start": 867.6
        },
        {
            "text": "at all. No. No. Stop your job. Come make a game with us. We're not even making a game. Give me money. I'm going to will that into existence. I want to make a game. What kind of game? Oh, the most twisted [ __ ] you've ever seen in your life. Twisted. It's going to be back rooms, but like way worse. Oh, but also kind of funny and enlightening and kind of inspiring. And then A24 will make a movie out of it and I'll like that. And then Florence Pew will know who I am. Is that the first name? Cuz you guys just watched the Thunderbolts trailer. Yep. I was going to say, did you watch the finals Thunderbolts trailer there? Yeah. Yeah, it looks dope as [ __ ] I'm so excited. And uh the Fantastic 4 trailer, too. You watched? I did. Currently, uh I think that's uploading and it might be out right now. So, get ready for a special kind of funny screencast with those guys. What does this guy want? This guy wants you. Yeah, if you do right mouse click, you drag one at a time. What does he want? How",
            "start": 910.96
        },
        {
            "text": "So, get ready for a special kind of funny screencast with those guys. What does this guy want? This guy wants you. Yeah, if you do right mouse click, you drag one at a time. What does he want? How do I know what he wants? He wants two, right? Two OG cushes. Done. Thanks, homie. Make that money. Money. Don't smoke it here, dog. It's a gas station. He's got to double check it, bro. He's got to make sure it's These people will light up right in front of the police station. Appreciate that. [ __ ] Oh, this guy's high as [ __ ] His eyes are beat red. I have $80 on a credit card right now. See, guys, I love games that are just all about the American entrepreneurial spirit. Oh, you're going to love this. Oh, [ __ ] The police. Oh, Andy works at the gas station. This guy kind of looks like our Andy. Oh, no. You know how Andy's always high, but we don't we're not supposed to talk about it. We just never talk about it. We never talk about We never address it. Chelsea, dude. Uh, blue house.",
            "start": 956.96
        },
        {
            "text": "Andy. Oh, no. You know how Andy's always high, but we don't we're not supposed to talk about it. We just never talk about it. We never talk about We never address it. Chelsea, dude. Uh, blue house. Behind the pawn shop. Got it. Okay. Blue house. Blue house. Blue house. Where's blue house and the pawn shop are two different places. Yeah. Yeah. Yeah. I figured as much. Uh, I'll go to the bahan shop guy first cuz he's right here. Drug deals behind the pawn shop. Hey buddy, what's up? You want to do some deals with me? Where the [ __ ] is What does he want? He wants two OG cushes. Oh, at the motel. You're welcome, my friend. Blue house. This way. I'm just walking around with weed everywhere. Yeah, you got to do it. You want some weed, lady? You're a doctor. Where's the freaking blue house, Joey? Um, it's on It's like by the gas station. Cops. Yeah. And then go left on this street. left and then Oh, it's literally just a blue house. I thought it was like a cool bar. No, they're pretty",
            "start": 1003.6
        },
        {
            "text": "Joey? Um, it's on It's like by the gas station. Cops. Yeah. And then go left on this street. left and then Oh, it's literally just a blue house. I thought it was like a cool bar. No, they're pretty literal with the uh the descriptions. Complete deal, Doug. Okay, now I got to go [ __ ] Oh, it's the first time I've ever been body searched in this video. Oh, you've never been I'm getting [ __ ] searched right now. Oh, I get searched all the time. I think it's just like a proximity for when you're walking next to the cop. Put it on my butt. I don't think that's a mechanic. Okay. Oh, I got to give a sample out. I'm the only weed dealer in town. Yeah, but if they like it. Yeah, you got to get more customers, bro. All right. Good call, guys. I'm sorry. I'm new to this game. When do I get to kill someone in a drug bus gone wrong? Uh, I don't think I don't think you do have to run from the cops, so I don't think you have to kill anybody. But I have never had anybody refuse to pay me. [ __ ]",
            "start": 1051.84
        },
        {
            "text": "someone in a drug bus gone wrong? Uh, I don't think I don't think you do have to run from the cops, so I don't think you have to kill anybody. But I have never had anybody refuse to pay me. [ __ ] cops come to try to snatch my crops. These pigs want to burn my house down. I don't Well, that's like kind of accurate. Would you like a free sample game? They're definitely not happy that you're in their town. Yeah, they don't want you in their town. That's right. No. Like, this is our turf. This is very much like a rules only. I'll say this, and this is going to sound crazy. Yeah, but if we There's probably what, one or two cops in this tiny town. Yeah, we kill them, right? Probably a sheriff. What if I became a cop? What if I was the sheriff? Are you I mean, that's the only way to rule the world, bro, is you you become the cop and the major drug. Exactly. Right. And you run the town. Nobody's got it on you. You You run the local bar, the drug game, and you're the cop. You also have to",
            "start": 1101.68
        },
        {
            "text": "world, bro, is you you become the cop and the major drug. Exactly. Right. And you run the town. Nobody's got it on you. You You run the local bar, the drug game, and you're the cop. You also have to have an underground gambling thing. Oh, yeah. We're down. That's like That's like B2. That's like that one movie, The House with with Will. Oh, I love The House. Amy Polar and Will Frell. So funny. So funny. Those two. They were just so excited for her daughter to go to college. Is it Will Frell or Will Arnett? Will Ferrell. Do you ever or listen to the podcast that Will Arnett and Jason Baitman No, but I saw the show. Oh, the show out of that. Oh god, the cops are coming after me. Why is this guy running after me? Conceal it. How do I conceal it? It'll tell you in the thing. You just in the menu. So when he searches me, I can seal it. Yeah, it's just right click on the item and it'll like conceal it for you. [ __ ] you, cop. No, I'm trying to get to the motel. Oh, behind you. There's a",
            "start": 1144.96
        },
        {
            "text": "menu. So when he searches me, I can seal it. Yeah, it's just right click on the item and it'll like conceal it for you. [ __ ] you, cop. No, I'm trying to get to the motel. Oh, behind you. There's a cop. Motel's behind you. I don't like this fuzz. Go right. Go left. I mean, how am I lost in this town? It's five buildings. And this isn't even like the real town. Oh, it's not the real real town. Oh, man. The town gets big. Dude, I'm so excited about this. I'm I'm going to kill people with garden shears. I Man, it is. I just want to make sure that you know killing that this is like not a murder sim simulator. It's a drug uh cooking and dealing simulator. Oh, now I got to go to bed. Cool. So, Oh, yeah. So now you're getting Are you Give me some pills. Oh, that's cool. I have pills now. Oh, and OG Kush. Cool. All right. Uh, drive back to the ranch. Oh, [ __ ] We're ripping. [ __ ] you, cop. Oh, yeah. [ __ ] you, cop. You can just outrun the cops and it's fine. That's all I'm doing, dude.",
            "start": 1197.44
        },
        {
            "text": "OG Kush. Cool. All right. Uh, drive back to the ranch. Oh, [ __ ] We're ripping. [ __ ] you, cop. Oh, yeah. [ __ ] you, cop. You can just outrun the cops and it's fine. That's all I'm doing, dude. I've been out running the cops my whole life. This is a very relaxing game. This is why I stayed up till like 4:00 a.m. the other night. Wait until you start really cooking is right. Oh, man. You start putting the mixtures in this Viagra mixed with this uh this Coke bottle. What is it going to get me? Get me up is what it's going to get. It's going to get you definitely up. Does this car go faster than 1 mph? Um if you press shift sometimes it does. Oh, is this now when we wait for Yeah, Nick. Okay, that's great, guys. I feel great. That car is whipping. I'm getting 240 frames per second in this game. Are you really? I feel super cool. That's amazing. Let's check in with the chat. Chat, who's been playing this? Have you continued your schedule one? Have you given up? Let us know. Body search",
            "start": 1259.6
        },
        {
            "text": "game. Are you really? I feel super cool. That's amazing. Let's check in with the chat. Chat, who's been playing this? Have you continued your schedule one? Have you given up? Let us know. Body search in progress. Yeah. Oh, well. [Music] Mhm. I've been playing this game so much that I've like reconsidered doing my desk setup for a more optimal thing. Oh [ __ ] the game's got you thinking about resetting rooms. I mean, this is like a a bigger issue than just this game, but because I don't I don't play mouse and keyboard very often, but for sim games, I do. And my desk is really low. Yeah, we So, I feel like I got the my wrist is suboptimal. Oh [ __ ] You don't want the Andy Cortez. I know exactly. Sleeping on my arms at night. What is he doing? Why is he doing that? I don't know. Who told him to do that? So, I think I might take my current desk and put it in my room and make it into like a vanity to like do my makeup and my hair. I love that. That would be fun. And then get a new desk",
            "start": 1309.36
        },
        {
            "text": "him to do that? So, I think I might take my current desk and put it in my room and make it into like a vanity to like do my makeup and my hair. I love that. That would be fun. And then get a new desk that I can move up and down. Well, if you need the best streamer look, me and Nick can come over. We run an HGTV design lab. Uh we we've already promised Danny to do his room. He was going to be our concept room of proof that we can do it, but he won't let us in his room. But like we can do anybody's room. Don't worry about it. Well, really? I mean, my room is like, \"Oh, [ __ ] The cops are here.\" [ __ ] So, I don't know that I need help. The cops are here, bro. You got to [ __ ] rip it. Rip that. They [ __ ] found you, man. How do they not see me sneak past? Uncle Nelson's caught, man. I pinned it all on him. Sorry, Uncle Nelson. You You have to imagine he knew that it was coming, though. Well, Uncle Nelson's, you know, he's had some problems with the law. some runins, if you will,",
            "start": 1366.72
        },
        {
            "text": "I pinned it all on him. Sorry, Uncle Nelson. You You have to imagine he knew that it was coming, though. Well, Uncle Nelson's, you know, he's had some problems with the law. some runins, if you will, willingly, you know, like he's putting it out all out on the line. Correct. They got some good music. You see that? They put queso and Moist critical in this game. No, they made a graffiti art of them on the wall. That's pretty funny. Oh, you're a small time drug dealer from the south. Let's [ __ ] go. We're in it together. In a fresh town with no cash, no product. Badass. You got a RV just like Breaking Bad. The only one way to make money. Let's cook some meth. It takes longer to unlock meth than you think. Honestly, here's the thing. I think the number one problem that meth dealers face is that you don't want to skip to meth too fast. You want to grow into the meth. I do think it's interesting. Oh, do you do you grow into things? I thought you just pick a lane on what you want to sell.",
            "start": 1410.56
        },
        {
            "text": "that you don't want to skip to meth too fast. You want to grow into the meth. I do think it's interesting. Oh, do you do you grow into things? I thought you just pick a lane on what you want to sell. Well, I think it's easier to start selling weed, right? Because then if you get like arrested, nobody's putting you in jail for life for some weed, but they will [ __ ] you up for that. Okay. Okay. Maybe not some. I feel like there's a lot of people in prison for weed right now. uh you know you know but I don't yeah I think the current day I guess it also depends oh we have to create our characters of this um bull cut a top knot hot pink charact slight smile no that love That's okay. I don't really care that much. I'm going to be shoes. Oh, all white sneaks, you know. Okay. So, do we all have separate RVs? Is that the deal? No, we all share this already. Sweet. Okay. No, [ __ ] pupils are dilated, [Laughter] dude. Okay, let's get some watering done. We all share money. Yeah, I think for",
            "start": 1465.12
        },
        {
            "text": "separate RVs? Is that the deal? No, we all share this already. Sweet. Okay. No, [ __ ] pupils are dilated, [Laughter] dude. Okay, let's get some watering done. We all share money. Yeah, I think for as much as I've played this, I've only ever played it by myself. I have $100 on a credit card and a dream. I guess we have I [ __ ] love this game. It's so dumb. I love it so much. I love this game. I'm sorry that I'm just gonna go buy a trash picker uper immediately. Oh, I love that. With whatever we got to get start getting some money. That gives us money. Well, we do need Yeah. Coming in money. Take time. Take your time. Take your time. You got to go to a pay phone. You got stuff. I got to go to a [ __ ] pay phone. Walk to the UN to buy a pay phone. Oh, I can see you guys on the map. That's so fun. Oh, I see your RV, Joey. I think we all have ours. Yeah. Yeah. Together. Oh, never mind then. Yes. Yes, you did. Yes, you did. Nick, what's up? Yes, you did, dude. Yes. Are you naked? Damn it.",
            "start": 1545.04
        },
        {
            "text": "fun. Oh, I see your RV, Joey. I think we all have ours. Yeah. Yeah. Together. Oh, never mind then. Yes. Yes, you did. Yes, you did. Nick, what's up? Yes, you did, dude. Yes. Are you naked? Damn it. God, it always happens. I got sandals on. Mike, come look at me. You want to look at each other? Come look at me. Look at me. Look at me. Look at me. Look at you. Shirtless. He's in his underwear, Joey. I got sandals on. He's in his underwear, Joey. So white. I think the white is so white. So white. We don't go outside. We stay inside the RV. We cook. This really is just like a Walter White. Why is there so much trash all over the job, Nick? I got to get Oh, yeah. You got to go collect the stash, right? You got to go get the stash, bro. Near the fountain. Yep. Stash up. Remember, there's a map now. You can look at Oh [ __ ] Okay. Oh, that's a tutorial area. It doesn't have a map. Damn, this is big. That's a big [ __ ] map. Mike, lead me to the fountain. Yeah, you want me to lead you to the",
            "start": 1632.24
        },
        {
            "text": "now. You can look at Oh [ __ ] Okay. Oh, that's a tutorial area. It doesn't have a map. Damn, this is big. That's a big [ __ ] map. Mike, lead me to the fountain. Yeah, you want me to lead you to the fountain? Okay, we'll get some. All right, I can probably find it. Hold on. I'm assuming there's a fountain. I just made $23 in picking up trash. I just went and got a little picker uper thing. I'm surprised you didn't want to go buy one. Where the [ __ ] is the fountain, bro? Uh, right here, big dog. You were almost there. I guess I was almost there. Right here. This guy just put piss piss. Collect near the fountain. So yeah, there's a bunch of stashes like on walls that Where do you see it? Oh, look at that. [ __ ] yeah, bro. Dead drop. Yep. Dead drop. Sick. Collect stash near the canal. Okay. Yeah. Oh yeah. You know where the canal is right off the rim. Going to have to kind of [ __ ] dog. You're so good at this, Nick. New dead drop behind the super marquetta. Oh, that's over by me.",
            "start": 1693.68
        },
        {
            "text": "Okay. Yeah. Oh yeah. You know where the canal is right off the rim. Going to have to kind of [ __ ] dog. You're so good at this, Nick. New dead drop behind the super marquetta. Oh, that's over by me. See it? We see a bright green door. What's up, cops? What's up? What's up? Look at these cops right here. What? What? We all need vests, dude. We ain't [ __ ] like that. I'm a weed dealer. I'm just cool. Can you get arrested for not following the street lights in this game? Investigate the explosion. Mike, did your [ __ ] blow up? Did you hear that? I don't see where it went, though. We have to go back to the RV, I imagine. So, yeah. Look at the fire coming out of that smoke. Tough. Never a good sign. Did our meth lab blow up? Too much pressure. Nobody opened a window. Damn it. You got to crack a window. Crack a window, Joey. [ __ ] dude. Listen, I'm out here making money. I'm just picking up all these cans. Oh no. Read the note. Somebody blew our [ __ ] up. Welcome to Highland Park, the",
            "start": 1745.2
        },
        {
            "text": "a window. Crack a window, Joey. [ __ ] dude. Listen, I'm out here making money. I'm just picking up all these cans. Oh no. Read the note. Somebody blew our [ __ ] up. Welcome to Highland Park, the Zar Territory. Don't even TB. [ __ ] me, dude. TB. I thought we were homies. Do you even know who TB is? Oh, I'm going I don't need to know who TB is to shoot him in the [ __ ] face with my Yammy. You don't even have guns. My [ __ ] gat. Nick, you're out here with a watering or you don't even have Oh, no. Cuz I took the watering can. $76. Uncle Nelson, by the way, definitely a snitch. Cuz he should be in jail for real. I think he is in jail. Oh, cool. Yeah, he's calling you from jail. Oh, perfect. All right, we got to go to the motel, you and I, Nick. Mike, how do I look behind? Do I look good running behind me? Oh, yeah, bro. Oh, yeah. God, I can't believe you. The tidy whiteies were an inspired look. No clothes. Do we have no decorum? Where the hell is the motel? Uh, to your left. Yep. I'm",
            "start": 1797.92
        },
        {
            "text": "behind me? Oh, yeah, bro. Oh, yeah. God, I can't believe you. The tidy whiteies were an inspired look. No clothes. Do we have no decorum? Where the hell is the motel? Uh, to your left. Yep. I'm going to meet you at the hotel. Wait until you see the taco spot, bro. Oh, Taco Ticklers. Who the hell named that? This town is massive, man. This is a nice little town, Mike. It's like Tahoe. It only gets bigger, bro. It only gets bigger. It's like It's like downtown Phoenix. That's the size it will be. Love it, dude. a really specific just over here being Joey. I see Joey just picking up. I immediately was like, I'm spending our money and I'm dying. Joey knows what she wants. All right, guys. I got us checked into a motel room. We're good. All right, let's go make money. Here we go. We're in here. Is this her room? Yep. Can't sleep. Go to the hardware store. A lot of [ __ ] I got to do in this game. Well, you got to start off your drug empire. Yeah, you got to figure out where all the things",
            "start": 1847.28
        },
        {
            "text": "Is this her room? Yep. Can't sleep. Go to the hardware store. A lot of [ __ ] I got to do in this game. Well, you got to start off your drug empire. Yeah, you got to figure out where all the things are. You guys are making good points. Dan's hardware store. I'm going to stunt. Ready, Mike? Stunt in. Oh [ __ ] He's parkouring. Well, I see him. Hardcore parkour. That was regretfully. I see him. I was parkour. What? I got to put Buy one grow tent. Sick. Add to cart. Buy one soil. Add to cart. Do I need a watering can also? No, I have one. Okay. Insufficient funds an online balance. Oh, I can do it. I can do it. Dory's got you. She's been making good money. I have 300 bucks. Do I have to like put Oh, yeah. Yeah. He He likes it in C in uh ATM. Oh, he likes Venmo. Yeah, he's got to track it. He's got to track your card. Forgot that. I Oh, you probably have a ton of cash, too. Did you get enough, Nick? Got it. I just told this guy we're drug dealers. I don't feel like there's any I saw our",
            "start": 1903.28
        },
        {
            "text": "got to track your card. Forgot that. I Oh, you probably have a ton of cash, too. Did you get enough, Nick? Got it. I just told this guy we're drug dealers. I don't feel like there's any I saw our balance go down. I don't see any reason why this guy shouldn't know we're drug dealers. I mean, let's just let's just let him know what we're doing. I mean, he's selling grow tents. He knows. Yeah, he knows, dude. I'm stunting. [ __ ] you, cops. I'm going to try to snatch my crops. Place the grow tent to fill in the soil. Oh, okay. I got to place the grow tent. Yeah, you got to put it in. I'll come over with the watering can because you probably need that. Joey's coming. God, I hate that you're just sneaking. We're going to have the cleanest neighbor. Okay, so I have here's the watering can and some speed grow and some things over there. There you go. Thank you. Let me take this trash out. It's so gross in there. I can take it. I got the watering can. Oh, we actually probably need to buy",
            "start": 1954.4
        },
        {
            "text": "some speed grow and some things over there. There you go. Thank you. Let me take this trash out. It's so gross in there. I can take it. I got the watering can. Oh, we actually probably need to buy trash bags to take it out. I think I can only dump trash. Oddly specific. Nick has a phone call. Oh, I'll take it. Talk to Uncle Nelson. The pay phone. Man, Uncle Nelson got a lot of phone privileges in lot. Yeah. I think he has the inside hookup. Yeah, he's definitely there. He's getting more than one call a day. They're still picking up trash. You You inspired me. Yeah. Yeah. We have the cleanest neighborhood on the block. [Music] Hello. Oh, yeah. Oh, OG Kush. That's some OG cush. 30 minutes, dude. What the [ __ ] It's going to take time. He's got to drive into town. He's got to go find the seed. Drive into town. Busy man. Okay, guess I'll just hang out. Wait for the dead drop. 13 minutes. Oh yeah. And then he'll tell us where to meet him up. In the meanwhile, I'm going to [ __ ] stunt.",
            "start": 2012.4
        },
        {
            "text": "seed. Drive into town. Busy man. Okay, guess I'll just hang out. Wait for the dead drop. 13 minutes. Oh yeah. And then he'll tell us where to meet him up. In the meanwhile, I'm going to [ __ ] stunt. Oh, Joey, have you ever seen this? Uh, this is new. This big piece of graffiti here. Uh, I don't think so. In the canal. Come read that. That's the canal that connects the two little sides. Collect drop taco ticklers. You know where that is. I do know where the tickler is. Dude, there's one thing I know is where to find the good tacos. [ __ ] you, cops. Why did you say it? Like, I don't really need to ask because I know, but I just don't really like it. badly. Okay, just running straight past cops with weed seeds. They ain't checking you. Let's go back and drop off all this trash. Okay, guys. We're growing. We're growing. Got a little empire and just cleaning up the streets, man. We might as well be hired by the city at this point. I know. Hey, Grun. Sanitation department had two new",
            "start": 2095.24
        },
        {
            "text": "We're growing. We're growing. Got a little empire and just cleaning up the streets, man. We might as well be hired by the city at this point. I know. Hey, Grun. Sanitation department had two new employees clocking in and they look great. They're doing great work for us. We should get a raise. Joey's just awoken something inside of me. Honestly, this is what happened the other night while while I was like, \"No, I just need to zone out and pick up all the trash.\" Damn it. Especially once you start getting into like some of the other little neighborhoods, you're just like, \"Oh, so messy.\" I mean, it's 20 It's 20 bucks a bin. You know what I mean? Not bad. Not too shabby. It's about $18 to $20 every bin that you make. So, that's money. $44 cash on me right now. What's going on, Nick? What are you up to? Oh, I'm playing pong. Oh, yeah. Don't get lost. That's awesome. Oh, we got to buy stuff, but we don't. Yeah, we got to wait till the morning. We should go over and see Nick and try to",
            "start": 2160.48
        },
        {
            "text": "are you up to? Oh, I'm playing pong. Oh, yeah. Don't get lost. That's awesome. Oh, we got to buy stuff, but we don't. Yeah, we got to wait till the morning. We should go over and see Nick and try to sleep. Play some pong with me, Mike. Yeah, we're going to come. We're coming up right now. Usually your eyes blur for a little bit. No, the curfew's starting soon. We have to go home. We got to go home quick. Otherwise, you're going to get arrested. Play some snake. We don't want you to get arrested. They got snake. They got the cactus jump. Let's play pong. Can we play two-player pong? I don't think so. I don't think we can. Oh, that would have been so cool if you thought about that. Oh, you can just play pong inside. Yeah. Oh, what is that? Air raid. That's a curfew. Close the door, dude. I don't want them to see what we're doing in here. Close the curtains. I went to bed. Okay. Going to bed. Why do we have a a little funco pop of Richard Nixon? I don't know what you're talking about.",
            "start": 2213.6
        },
        {
            "text": "I don't want them to see what we're doing in here. Close the curtains. I went to bed. Okay. Going to bed. Why do we have a a little funco pop of Richard Nixon? I don't know what you're talking about. Guys, that was a good experience, but we did not make any money that day. And unfortunately, it's just not going to cut the money. I think me and Joey made you $150 today. You made me [ __ ] I have $76 in my pocket. Right about Keep the trash bag. Buy a trash bag from the hardware store. Harvest the weed plants once fully grown. Mike, you're on that. I'll get the trash back. What do you want me, big dog? Harvest those. Harvest that weed. 104. Do we got uh We got clippers. Scissors. Oh, I got the scissors. No, mine. Joey, you're on the hard. You're on the trash. Oh, yeah. Duty. Joey's on trash. I'll go buy I'll buy you a packing station and uh 10 baggies. Not growing yet. Does it need more water? It needs more water. Oh, it needs more water. You got to put water on it. One packing station",
            "start": 2268.88
        },
        {
            "text": "I'll go buy I'll buy you a packing station and uh 10 baggies. Not growing yet. Does it need more water? It needs more water. Oh, it needs more water. You got to put water on it. One packing station and 10 baggies coming up, boss. Thanks, Big Mike. I know I'm new to this, but I really feel like I pretty well, Dan. And let me get 10 from you. Let's use speed bro on this [ __ ] Thanks, Dan. Big Dan the man. [Music] All right, Nick. I got you a uh packing station right behind you set up with some bags for you. Thank you, JD. You're set to go. Thank you, JD. Thanks, J Dizzle. There's something going on. I have no idea. I think he's talking about me saying [ __ ] No, it's Chad. He's usually teasing me. What are they saying? It's nothing worth it. What do they say about me? It has nothing to do with either of you. I don't care then. If it doesn't pertain to exactly what I'm doing at this one moment, I do not care. Let him write. Let him write about it later. I feel like journals. You might",
            "start": 2313.92
        },
        {
            "text": "with either of you. I don't care then. If it doesn't pertain to exactly what I'm doing at this one moment, I do not care. Let him write. Let him write about it later. I feel like journals. You might need to be introduced to the joy of picking up the trashes. Joey's going to Are you buying the trash bag? You want me to? Oh, I can get it. Okay, you got it. Yeah. Yeah. Excuse me, Mike. We'll take I take my job of trash. Joy's part of the sanitation department. Let her let her have that. All right, guys. Pick a pick up a cup. Got some cash. Got to start selling. Yeah, it's your time, bro. List OG. Yeah, dude. I got you, dog. You got manager. Put it out there. Why is that on fire? Mike. What? When you were throwing away the trash, it was on fire. Really? I didn't see it. No, it wasn't on fire. Oh, methane cocaine. Oh, see. Oh, it's the like burning the trash. Why did I not notice that on any of the other ones? List OG Kush for sale in product manager. How do I list this for sale? Uh bring",
            "start": 2376.24
        },
        {
            "text": "Oh, methane cocaine. Oh, see. Oh, it's the like burning the trash. Why did I not notice that on any of the other ones? List OG Kush for sale in product manager. How do I list this for sale? Uh bring up your phone. Yeah. With tab here. And then you and then go to product. Yeah. And then find OG Kush. See there's a little square that says list for sale. Click that. OG Kush. Got it. Suggested asking price is 38. You can go up and down with whatever you want. 50. 50 spot. Got it, dude. Let's [ __ ] make some and then wait for customers to reach out. All right. And then set it up. Set up the sale. All right. Joey, do I need to give you guys this? Uh, if you have the weed, you have to be the one to like I can't just hand it over to you guys. I mean, you could, but let's divide and conquer. Yeah. All right. Schedule your first deal. Schedule it with Austin so I'm going to call Austin up and say, \"Hey, buddy.\" Yeah. What What time do you want to OG Kush? I'll pay 120 for it. [ __ ] dude.",
            "start": 2422.0
        },
        {
            "text": "Yeah. All right. Schedule your first deal. Schedule it with Austin so I'm going to call Austin up and say, \"Hey, buddy.\" Yeah. What What time do you want to OG Kush? I'll pay 120 for it. [ __ ] dude. That's more than asking for. Let's go. Yeah. Tell him hell yeah. afternoon deal. And yeah, you usually want to pick like the deals as soon as possible cuz we're pretty free and available. Yeah. So, we got to make our way to the north waterfront. Well, Nick does, but yeah, if you bring up your map, you should be able to see it. Oh, you're getting hit up, bro. You're getting hit up. I need to increase the price of this. This is the life of a dealer now. You're just getting hit up all the time. No free time. Did we Do we need to plant another plant? Probably. Okay, I need to I'm going to pay off our debt to Albert. Okay, smart move. Smart move. You got to go to drop boxes, right? Do we have Drop box the taco shop, right? No, it's uh behind the hardware store. Do we have any more cash or no?",
            "start": 2469.92
        },
        {
            "text": "our debt to Albert. Okay, smart move. Smart move. You got to go to drop boxes, right? Do we have Drop box the taco shop, right? No, it's uh behind the hardware store. Do we have any more cash or no? I don't think we have any more seeds. We got to buy some more from him. So, if you guys want to get some more, I can do that. Okay, but I'm going to pay it off. Pay it off. Uh you got Kyle all set, dude. He wants to meet you behind the taco spot. Oath. How do I just pay $30? Uh, you could put more in and it'll just kind of be like there and you can take it back. Yeah. Like leave a hundred on that or like even just like you can walk away and go for it as well. You owe Albert $80. Hi chat. We should be back. The computer we stream from crashed for some reason and now they're all gone. What happened to them? I wonder. I wonder whose phone is buzzing. That's weird. I wonder if that's from the game. It's me, Barrett, on the ones and twos. I was editing my Naughty Dog video in Station 5, Area 69",
            "start": 2517.84
        },
        {
            "text": "to them? I wonder. I wonder whose phone is buzzing. That's weird. I wonder if that's from the game. It's me, Barrett, on the ones and twos. I was editing my Naughty Dog video in Station 5, Area 69 as we used to call it. And Mike came into the room and gave me that look like, \"Hey, something's wrong.\" And I knew immediately this computer [ __ ] crashed. Why? Who knows? But where did our trio go? Did the cops bust them? Who knows? Who knows? Did the computer crash from porn? I don't believe so. Wait, Barrett, are you doing a best Naughty Dog game list? Uh, yeah. We announced it at the anniversary stream, the 10-y year anniversary stream. I'm doing a Naughty Dog uh deep dive video that I am halfway through editing. I've just hit the 1 hour mark on the timeline. I think I'm roughly halfway through uh the script. So, yeah, look forward to that at some point in summer. As you can hear the sirens right there. Those are our on our on ah on our end. Jesus, I can't speak. I figure I kick the",
            "start": 2568.4
        },
        {
            "text": "through uh the script. So, yeah, look forward to that at some point in summer. As you can hear the sirens right there. Those are our on our on ah on our end. Jesus, I can't speak. I figure I kick the stream live cuz I know why the our trio is not on camera. And honestly, coming back sooner rather than waiting for them was probably the right call. I'll just come here. What up? Damn, they did get Nick. They did get Nick. What game are you on now? I am wrapping up Uncharted 2 uh in my video and uh yeah, it's kind of crazy. Uncharted 2 and only halfway through the script. So, what that's Uncharted 3, Last of Us, Uncharted 4, Lost Legacy, Last of Us Part Two, five of the games. The Jack and Dexter and Crash sections aren't as uh aren't as lengthy, but definitely uh definitely fun times. Definitely fun sections. Just not as like, you know, I'm a big story guy. I like analyzing story. And let me tell you, not much story in Crash Bandicoot, but still have uh fun things to say. Are they",
            "start": 2644.32
        },
        {
            "text": "Definitely fun sections. Just not as like, you know, I'm a big story guy. I like analyzing story. And let me tell you, not much story in Crash Bandicoot, but still have uh fun things to say. Are they getting nugs? No. I'm sure I don't want to say anything of why they're not back quite yet. I'll let I'll let it be to their discretion if they want to talk about this on the stream, but something out of the ordinary has happened in our neighborhood. So, they went to go check it out. And uh yeah, so here I am just talking to you, waiting to get back, waiting to edit some more. And here they come. They're back. I'll let it I'll I'll I'll let it to be their to their discretion whether they want to talk about what just happened or not. We tell them we can talk about it. Yeah. Okay. I don't think it's that crazy. The body shop on fire is on fire next door. Fire next door. So the that has nothing to do with the PC shutting out. I wish it was a big fire though. Bear like [ __ ] flames coming out",
            "start": 2720.16
        },
        {
            "text": "that crazy. The body shop on fire is on fire next door. Fire next door. So the that has nothing to do with the PC shutting out. I wish it was a big fire though. Bear like [ __ ] flames coming out of the thing. It's not like that right now. Um it's like it we can't see flames or anything, but they're smoke boarding out and there's like 17 engines outside and they're on the roof. So like we had to move all of our cars off of that wall. Greg came in and was just like uh so the body shop next door is on fire and we were like what the [ __ ] You might want to move. We went and moved our uh we went and moved our I like that bless was like I'm leaving right now. Bless just started running for it. He's a dentist of course. Well, we really can't leave right now because No, there's so there's So, we're going to be here which is nice. Three fire engines, a ambulance, and then they pulled out a car that looks it doesn't look charred. It's like a white uh dust. Oh [ __ ] So maybe like um So what",
            "start": 2776.72
        },
        {
            "text": "we're going to be here which is nice. Three fire engines, a ambulance, and then they pulled out a car that looks it doesn't look charred. It's like a white uh dust. Oh [ __ ] So maybe like um So what happens if my car catches fire inside the body shop? They pay for that. Uh I'm sure it's an insurance thing. Yeah, I think it's under there. So sorry, Mike. Uh the body shop caught fire. Your car was in there. Um but it doesn't like nobody's in the ambulance, so I think it's just precautionary. It doesn't look like anybody's hurt, so that's good. Slaying a joke. Um so yeah. So that's what we that's what we were just doing. Well, let's go sell some drugs. Oh, it's a police curfew. We got to go home. I'm already home. I'm playing the egg run game. I don't know where Nick I don't know where Nick is, so we should probably worry about that cuz he does have the supply. I'll uh I have it on your uh gameplay now, Mikey. That sounds great. Okay. Oh, people. I was killing that. Is that from the",
            "start": 2821.44
        },
        {
            "text": "is, so we should probably worry about that cuz he does have the supply. I'll uh I have it on your uh gameplay now, Mikey. That sounds great. Okay. Oh, people. I was killing that. Is that from the game? Yeah. Uh-huh. What's inside the game? Oh [ __ ] They also have snake. No, I was talking with the [ __ ] Oh, yeah. Yeah, yeah, yeah, yeah. Oh, yeah, yeah, yeah. That's the alarm to say you got to go inside cuz it's curfew. Gotcha. They don't want people outside late cuz there's [ __ ] is all inverted. [ __ ] worse. Nick flaked on like three deals in the time y'all were going. Oh, we [ __ ] up those deals. That sucks. Yeah. Well, you know, things happen. His um keybinds are so weird. Really? You have something different going on? He has E and F flipped. So, his interact is F and his flashlight is E. We won't ask him about that. That is crazy. That on top of um on top of being inverted is an interesting way to play. Panicked there. How big is your giant? How big is your snake? How big has",
            "start": 2870.4
        },
        {
            "text": "is E. We won't ask him about that. That is crazy. That on top of um on top of being inverted is an interesting way to play. Panicked there. How big is your giant? How big is your snake? How big has everybody's snakes been? Like what is the what is the number before snake is just impossible? Oh, I don't play it that regularly, so I don't know much weed. I'm just gonna keep accepting these deals for tomorrow. Um, [ __ ] Well, there it is. What was your final? I found out how many how big your snake is. It's too big. Like 54 there. I texted the girls and I was like, \"Oh [ __ ] the body shop next door is on fire with a picture.\" And then immediately one of them was like, \"Do the firefighters seem single and nonproatic?\" Which is exactly what I said when I walked out. I was like, \"Maybe this is how I meet my husband.\" This could be the moment. We got to touch uh touch Nick's thing. Tell him be on that thing. It's my turn. Go. Um, okay. Perfect. All right, let's reset. Let's reset here. It",
            "start": 2935.2
        },
        {
            "text": "how I meet my husband.\" This could be the moment. We got to touch uh touch Nick's thing. Tell him be on that thing. It's my turn. Go. Um, okay. Perfect. All right, let's reset. Let's reset here. It was one of those days. It was a day that felt like a Friday. A little wonky out here. Yeah. You know what I mean? It felt a little off. Yeah, it did. It did feel a little bit weird. Feels right for a fire next door. Andy went home. Andy, how come? Why does Andy refuse to hang out with us? Andy, I said I saw what he put on the calendar. Did you see what he put on the calendar? Did Andy GFH and I was like gooning from home. He's gonna come home. [ __ ] man. He doesn't want a Goon in the office. No wonder he's uh he's got that wrist strap all the time. I mean, we don't want him gooning at the office. I have to go at home from now on. That's what he said. And we said, \"Oh shit.\" Yeah. Roger's not here, too. Mike, how you feeling about that today? Oh, yeah. I don't like any of it. right now. You",
            "start": 3004.4
        },
        {
            "text": "I have to go at home from now on. That's what he said. And we said, \"Oh shit.\" Yeah. Roger's not here, too. Mike, how you feeling about that today? Oh, yeah. I don't like any of it. right now. You know what I mean? All of your best friends. Everyone's gone. It's just an odd day. It's a Thursday that feels like a Friday. Yeah. I'm trying to look at the computer logs to see why this computer crash. I'm not getting any [ __ ] answers. Give us an answers, right? Yeah. Put Put all of Nick's [ __ ] up on that so I can do something for him. It just decided to restart. That's funny. Special time. Special time for Andy is right. I actually have a three-day weekend. I'm off tomorrow. Uh, and uh I'm playing games with my mind and I'm pretending like it's not playing mind games. I'm playing mind games with my own mind. Um, Mike, do you want to go deliver or do you want to go pick up the drop? Cuz I have more weed. I'll pick up the drop and I'll get us back to growing. You go. Okay, I'm going to",
            "start": 3064.56
        },
        {
            "text": "with my own mind. Um, Mike, do you want to go deliver or do you want to go pick up the drop? Cuz I have more weed. I'll pick up the drop and I'll get us back to growing. You go. Okay, I'm going to go. You handle all that is right. Yeah. Yeah. Let's get us back on track. We've already lost Nick. Ignore Nick. Nick's making sure the building doesn't burn down. That is true. He He He got out there with him, which was nice. It does feel it's so funny. Greg was out there very much like as like a very dad posture of like I'm gonna be out there. Always slop shop. Uh oh. You have to go on the other side. That's why we're back. Tell them, Nick. We're back. We're back in live. Tell them about it. Oh, do we talk about what's happening? Yeah. Hell yeah. Okay. Yeah. That's uh Man, it's so funny. You see Oh, what's going on here? What do we get here? Um I emptied your pockets. Thanks. I appreciate it. Um, yeah. It's so funny because you guys, you think about our life, right? And then you see real,",
            "start": 3111.28
        },
        {
            "text": "Oh, what's going on here? What do we get here? Um I emptied your pockets. Thanks. I appreciate it. Um, yeah. It's so funny because you guys, you think about our life, right? And then you see real, you know, first responders, men and women, putting their life on the line, going into a burning building. You go, they're just better people. I mean, not better people than us, but like that's a real job. Yeah. We're going to sell some drugs in a video game land. [ __ ] Yeah. You let them know, but uh it looks like everything's gonna be okay. Just a just a minor thing going on next door. But yeah, like there aren't any flames or anything. No, I think it was just a small I think it's just a precautionary thing. But shout out to uh to the the the Daily City Fire Department the Daily City and Como Fire Department for being awesome and always being always always having our backs, keeping everyone safe out there. Well, we're back to making money. Nick, you need to grow. Yeah. While they while",
            "start": 3155.04
        },
        {
            "text": "Fire Department for being awesome and always being always always having our backs, keeping everyone safe out there. Well, we're back to making money. Nick, you need to grow. Yeah. While they while they risk their life, let's uh sell some weed in a in a video game. I'm going to buy you another grow tent and some soil. Oh, we're getting in there already. Yeah, I'm delivering. Oh, wait. I got a deal to Austin OG Kush. I think I took all the wheat from your pocket. We didn't know. Shall I deal up a couple more, Jessica? We have more. You did this already. Yes. All these you Kyle and everyone. Okay, cool. Yeah, it's it'll just have new ones if um when they come in. Okay. What's in the arcade? Is it cool? Is it fun? Just walking around with a stack of hundreds right now, ready to give it away. Damn, we got stacks of hundos. I just want to let you know that if you have money, you can deposit it at these ATMs so that we can all use it. Okay, I'll do that right now. Why do I have 256 on the",
            "start": 3192.96
        },
        {
            "text": "Damn, we got stacks of hundos. I just want to let you know that if you have money, you can deposit it at these ATMs so that we can all use it. Okay, I'll do that right now. Why do I have 256 on the credit card? Is that what I owe? No, that's how much money That's how much money we have in the bank. Yeah. Oh, so Joey picked that up for us. The only things you pay for in cash are the weed. I just assumed this was a cash business. The weed you is cash, but like all the stuff you have to buy, you have to have it in the bank, which makes sense. You know the fat dragon Chinese restaurant cheap room. Oh, could we buy this restaurant? [ __ ] You can't buy the restaurant yet. Hello, Mrs. Ming. Might learn something. All right. Well, I can't do anything. We got to unlock the downtown area and the shred shack. This town looks cool. Mike, is this a place you'd like to hang out? Oh, yeah. Bro, wait until you see more of the town. The town is great here. Does this remind you a little bit of Tahoe?",
            "start": 3239.68
        },
        {
            "text": "shack. This town looks cool. Mike, is this a place you'd like to hang out? Oh, yeah. Bro, wait until you see more of the town. The town is great here. Does this remind you a little bit of Tahoe? Oh, yeah. Good people. Who's got the watering can? I got it. Okay, come on back home and water these. Sorry. I don't know why it's in my inventory I got for I just put everything back on the Everything on the shelves. Anything grow related you want to keep on the shelves is right. I do think that you should go to the store and get one of these little trash grabbers. Very fun. That's fun for me. Then you just run around as you're dealing stuff. You're picking up trash. You're putting it in the recycling machine. You're getting money. Give it away. Here. You can have mine, Nick. I'll put it on the shelf. Why don't you give it a try? That's fun. And I can continue growing weed for us. Sounds good. All right, I'll just pick up trash, Mike. Away now. I mean, yeah, go give that a try. Let's give a",
            "start": 3283.44
        },
        {
            "text": "shelf. Why don't you give it a try? That's fun. And I can continue growing weed for us. Sounds good. All right, I'll just pick up trash, Mike. Away now. I mean, yeah, go give that a try. Let's give a little whirl. So, I just pick it up and it goes straight to this thing. And then you have to empty this thing into those these green recycling bins to get money money to make money. Here comes the money. We got the pawn shop. Oh, gold bricks. Let's knock this place over when we're kingpins, I think. Can you buy the pawn shop? That'd be a great investment for us. I know. The only thing I've bought so far is the laundromat to laundromat. Yeah, you got to. Guys, we should buy a laundry mat. I watch those videos on Tik Tok. I think so. I think so. You watch those videos on TikTok? Yeah. Where it talks like, \"Hey, I own a laundromat and this is how much I made off of how much I made this machine and this machine.\" Yeah. I mean, it's passive income, right? So, they say the best investments for",
            "start": 3321.68
        },
        {
            "text": "talks like, \"Hey, I own a laundromat and this is how much I made off of how much I made this machine and this machine.\" Yeah. I mean, it's passive income, right? So, they say the best investments for [ __ ] like that are like laundry mats and um parking lots cuz they don't have a ton of upkeep. You have one person that goes in like like that. You have one employee basically or one or two employees. Low overhead and low overhead and like what's you know what's the worst that could happen? You got some graffiti you got to get out there. Maybe the pavement needs to be done every 10 years slurried and whatnot. But I remember there was a guy that I heard of in LA that owned like 10 parking lots and was like a mega millionaire, I guess. Yeah. I'd like to own the parking lot next to the uh baseball field baseball field over here. You mean by uh Giant Stadium? Yeah. That's god tier. You know what I mean? like money. They're charging $150 to park for play games. Insane. All right, y'all. We",
            "start": 3371.68
        },
        {
            "text": "field baseball field over here. You mean by uh Giant Stadium? Yeah. That's god tier. You know what I mean? like money. They're charging $150 to park for play games. Insane. All right, y'all. We got to give away some free samples to some people to make some uh more money. All right, so get out there, make some new meet some new customers. I'm going to be real, dude. I just I just uh figured out the scam of the century. Oh, I'm going trash. No, he's picking the trash out of the trash can. Nick, you're so smart. And then recycling. Dude, I'm [ __ ] so smart, dude. Dude, I'm about to kick over some trash cans. Make us some money. Scam of the century. Look at me, dude. Broy, yeah, we just got to pick up more trash so we get more money. Nope. I just dumped it all into here. More grow tents so we can buy more weed. That's just Do I get money for this? Oh, press the start. Yeah, guys, I just made us $34. That's more than I get paid to do comedy. [ __ ] yeah. That's a good That's That's a",
            "start": 3408.08
        },
        {
            "text": "so we can buy more weed. That's just Do I get money for this? Oh, press the start. Yeah, guys, I just made us $34. That's more than I get paid to do comedy. [ __ ] yeah. That's a good That's That's a solid 4 hour show from Oh god, there's cops here. Mike, run cops. No, don't let the cops see you. No, you don't have any weed on you. They're looking for me. I got this cool taser gun, though. Is that what this is? No. Stunting. You only have to run from the cops if you have wheat, but then you can also conceal it. Honestly, if you play this game the right way, you never have to sell weed. You just do the trash. Yeah, that way. That's not far off. Joy's Tuesday night here, right? Like Joey, I'm not going to lie. Like, this is just a fun Right. That's a fun way to do this, man. Especially when you unlock a dealer and then you just give them all the weed and they sell it and I That's Kyle to sell it for. That's really where you want to be, right? Is you want to be the guy that's like an",
            "start": 3454.56
        },
        {
            "text": "you unlock a dealer and then you just give them all the weed and they sell it and I That's Kyle to sell it for. That's really where you want to be, right? Is you want to be the guy that's like an intermediary, but you're not dealing with the product. No, I just want to like coordinate the people. Like you call We'll call it skateboards. And if anyone says the cops come and say, \"Why are you selling weed? We I'm selling skateboards.\" Yeah. Albert was the one that was selling weed. I was just telling him the economics of it all. Yeah. I was dealing in an allegory. I use skateboards. Chat, let me know if you need anyone to contribute funds to a parking lot investment or something like that. I I would get in on that. I would definitely get in on that. Just chipping in on parking lots. I just think to myself, you know, stock market being what it is, we should go all in on trash collection. People are always going to have trash. They're always going to make trash, right? Always going to",
            "start": 3501.28
        },
        {
            "text": "think to myself, you know, stock market being what it is, we should go all in on trash collection. People are always going to have trash. They're always going to make trash, right? Always going to have trash. Buy a couple of trucks and just say, \"We'll pick up your trash.\" Yeah. I mean, that's how 1800 Junk started. Yeah. Junk wrap. Three jabronies were like, \"I'll just come pick your [ __ ] up and throw it to the All they do is take it to the dump.\" Literally and they they get charged per pound and they charge you like an extra like 50 bucks per pound. I love that. Me and Kevin thought about it for a while. I was like, \"Put it in Ranger Danger and let's just go. Let's just collect put it in the Ranger Danger. Let's just collect [ __ ] on the side.\" I can't imagine a more chaotic duo chaotic life than you and Kevin. There'd be so many cigarettes smoked. The thing is this. The thing is this about Kevin is that he only stresses me out when it's stuff that matters. But if it's us just",
            "start": 3540.96
        },
        {
            "text": "life than you and Kevin. There'd be so many cigarettes smoked. The thing is this. The thing is this about Kevin is that he only stresses me out when it's stuff that matters. But if it's us just picking up trash and [ __ ] up his truck, I couldn't give 10 shits. [ __ ] it up. I could not care. Thing's got mold on it. Don't worry. It is growing moss. Have you noticed that? Can't get worse. If you look at the Ranger on the side of his car, it is it has moss growing out of it. I think he has never So funny. I don't think he's washed that car ever. Mike, you're you got a little thing going on here. Yeah, dude. I got you got your little setup going on, man. I'm totally going to be that employee that does nothing. He just plays [ __ ] Pong all day and gets high. As long as you don't smoke too much of the weed, it's fine. Nick, I will say going into the trash can to pick up stuff. Pretty good. Look how quickly I filled up my little bit. I'm just waiting on this grow. Is at 76%. Do we have any",
            "start": 3578.88
        },
        {
            "text": "of the weed, it's fine. Nick, I will say going into the trash can to pick up stuff. Pretty good. Look how quickly I filled up my little bit. I'm just waiting on this grow. Is at 76%. Do we have any more weed on us? I don't. All right, cool. But we also don't have any Yeah, we need to get new uh customers. Oh, we got to start giving out We'll have samples in just a couple of minutes here. That's Listen, you don't you don't got to tell Nick and I to keep picking up trash. Has Has Kevin uh kicked the addiction of blueprints? No, he's gotten worse where he has brought his PlayStation Portal into work and is uh playing it at his desk and he's only gotten deeper into the game. We're getting close to Breath of the Wild, Kevin. Like this is the closest we've gotten to Zelda Kevin in a long time. I've started a new life of pickpocketing strangers. Can you do that? Oh yeah, man. There are so many things in this game I've just never Crouch up behind him, Joe. Crouch up behind him. See what",
            "start": 3614.8
        },
        {
            "text": "I've started a new life of pickpocketing strangers. Can you do that? Oh yeah, man. There are so many things in this game I've just never Crouch up behind him, Joe. Crouch up behind him. See what happens. Just never thought about it. Which I guess was kind of what happened whenever I would get arrested in this game because I was like, \"Oh, I didn't even think about the fact that you could just run from the cops. [Music] But I guess that's what you got to do. How much? Just watering plants. Waiting on this to go. $93 in trash money. Not too dang shabby. At all of this trash over here. Very exciting. Oh, Miss June Bug. I wanted to do it. I wanted to do it, but he's off today. Kevin, with Kevin? Yeah, Kevin was off. What's wrong with him? I was going to make him play Blueprints with me cuz we We're going to beat that game. We got to solve those puzzles. That puzzle solves. I was watching Northern Lion play blueprints. It does look kind of fun. A good time. It looks fun to watch. I don't",
            "start": 3672.72
        },
        {
            "text": "We're going to beat that game. We got to solve those puzzles. That puzzle solves. I was watching Northern Lion play blueprints. It does look kind of fun. A good time. It looks fun to watch. I don't think I would enjoy playing it. Uh, my brain just doesn't work like that. My teammates, we have weed. So, yay. I will bag it for all of you and I will leave it in the grow station, but I will need you two to go get us some new customers. Okay. How do I do that? I got to put my body on the line. Uh Joey, explain it to them. So, we are going to take these baggies of weed. Oh, we're just going to give them to people on Yes. On the map, it'll tell you like potential customers. Sweet. And then you got to give them the weed. Please only give them does get bigger. Look, guys. There's a whole thing over there. I once gave a free customer. Oh, this guy's got to search me. [ __ ] I ain't got [ __ ] on me. [ __ ] you, dude. I'm just a man in my underwear. [ __ ] speed grow and some shears in a grow",
            "start": 3736.08
        },
        {
            "text": "there. I once gave a free customer. Oh, this guy's got to search me. [ __ ] I ain't got [ __ ] on me. [ __ ] you, dude. I'm just a man in my underwear. [ __ ] speed grow and some shears in a grow tent. Definitely not suspicious collection of items, but you don't do anything. This guy sucks. I have uh put forth uh eight and eight for both of you to go earn. Perfect. Oh my gosh, you have all this trash on the floor, Mike. Dang, it burns the trash. This is high tech. Okay, unlock customers. All right, give me some weed, Mike. I'll take that. Don't forget that the cops are right there. So, they will search you on the way back, but it should be fine. How many customers do we have? We need four more, right? Oh, yeah. We need four more. And you'll see them out there. Okay, Joey. Let's divide and conquer. My potential customers here. I am trying to, but the my potential customer is standing right next to the cop. They don't really know. Cops are dumb. Weed. Weed. Weed. Weed. Weed. Weed. Let",
            "start": 3776.96
        },
        {
            "text": "conquer. My potential customers here. I am trying to, but the my potential customer is standing right next to the cop. They don't really know. Cops are dumb. Weed. Weed. Weed. Weed. Weed. Weed. Let them know. Let them know you need weed. I got Chloe's a tough one to get, too. She's a little crabby, but I like it. Where are you? I This region isn't unlocked. Did you already talk to Chloe? You did, Chloe, right? We got her [ __ ] smack. Donna. Oh, which one's Donna? Are you guys my customers? Hello. Would you like some weed? Hello? Would you like some weed? Oh, it's a cop. That's a cop. [Laughter] Why can't I find Donna? I think Donna's Sometimes you got to knock on doors as well. Right here. She might be inside, buddy. Buddy. Damn it. Potential customer Pete behind us. Got it. Oh, there we go. You thought I got Albert going to drop off a little dead drop for us as well. We got 500 bucks. We need eight times. I'm about to make a hard sell to Pete right now. Pete, get the [ __ ] back",
            "start": 3824.16
        },
        {
            "text": "we go. You thought I got Albert going to drop off a little dead drop for us as well. We got 500 bucks. We need eight times. I'm about to make a hard sell to Pete right now. Pete, get the [ __ ] back here, bro. Get back here. Pete, [ __ ] you. Don't forget that. You guys You guys see this backroom cleanup crew game? I saw that. It's powerwash simulator but in the back rooms. That's crazy. I love that. Pete's a new customer. Everyone. Yeah, there you go. Maybe I got Donna. Sell you some, dude. Offer. What do you want, bro? Donna. Donna Martin. Oh, we got late night. We got to go back to bed before we get arrested. Just cost I just I'm selling this [ __ ] for 60 bucks, dude. Sell this [ __ ] for 60. Why is there martial law in this town? Is it cuz it's overrun by weed dealers? Is that 60 and eighth or 60 a gram? You think? 60 and eighth. Probably 60 and eighth. That's pretty on par. That's pretty on par. Not bad. Pretty on par. All right, going to bed. Go to bed. All right, you guys are",
            "start": 3894.4
        },
        {
            "text": "eighth or 60 a gram? You think? 60 and eighth. Probably 60 and eighth. That's pretty on par. That's pretty on par. Not bad. Pretty on par. All right, going to bed. Go to bed. All right, you guys are in charge of uh getting out two more samples. I think we need We leveled up. Street rat level two. Street street rat level two. Just have to hit okay next. Neon Sonics. I'm just letting you know. You know what I mean? 60. It's not It's not ideal. Not ideal, but you got to do it. I'll go get the dead drop. Y'all get me one more customer and talk to Mr. I got it. I got two weeds some in me and I'm just going to go sell for us today. I'm going to make two sales today. Go make some sales. Like where are my potential customers? Go to the one that's on there. The potential Peggy Myers. No, for Donna. For Donna? I thought we already got Donna. We got her as a customer and now she put in an order. So she's like two OG Kush behind the Oh, behind the construction and demolition. Where the hell's",
            "start": 3938.96
        },
        {
            "text": "For Donna? I thought we already got Donna. We got her as a customer and now she put in an order. So she's like two OG Kush behind the Oh, behind the construction and demolition. Where the hell's that? It's like right outside of the motel. Okay. Oh, Thompson's construction and demolition. But you have to go around the other way. You have to go around the Burke wall. They're always doing deals in the back, dude. Yeah, that's that's where deals get done. It is true. That's what deals get done. Okay, one more potential customer. Do you want to go talk to the woman at the Chinese East restaurant? What does she want to? Yeah, I got her. Well, it says all it says we have to talk to her. We need to up our prices, dude. Make sales. Big sales. I see Mike jumping around shirtless. Big sales. I'm back into the motel to grow some more weed. I like how this sounds like risky business. It's all risky. Look. Would you like a free sample? Be cool if you liked our stuff. Yeah. Hello, Ludwick Meyers.",
            "start": 3995.76
        },
        {
            "text": "into the motel to grow some more weed. I like how this sounds like risky business. It's all risky. Look. Would you like a free sample? Be cool if you liked our stuff. Yeah. Hello, Ludwick Meyers. Would you like a free sample? Ludwick bars, free samples. John, we're leaving you two nugs there. Mike, I need you growing, buddy. Uh, guess what? I got more bags ready to rock for you. I'm going to talk to Mrs. Chen at the Chinese restaurant and see what she's got for us. Keep accepting sales cuz we got [ __ ] I am slinging all over. I'd like to buy a room. Can I interest you in a free sample? Which one should I say? Give her a free sample and get a room. No, don't give her a free sample cuz she's already a customer. Is she? Yeah. Is she? Oh, maybe she'll Oh, no. Sorry. That was the other girl. Yeah, that was Donna. Definitely get her on our side. Maybe she'll discount our rent. Yeah, that's what I'm saying. Look at Oh, she's lighting up, dude. She's ready to rock. Give her a free sample",
            "start": 4045.68
        },
        {
            "text": "Yeah, that was Donna. Definitely get her on our side. Maybe she'll discount our rent. Yeah, that's what I'm saying. Look at Oh, she's lighting up, dude. She's ready to rock. Give her a free sample now. I'd like to buy Now she's in a good mood, guys, cuz she's high as [ __ ] [ __ ] She's going to get I'd like to buy a room. Oh, you want to buy something or do you I'm good, thanks. Okay. I'd like to buy a room. $800. I got 16 for you. Guys, I think we need to get 800 bucks together. We'll buy a room from Mrs. Mrs. Ming. You guys might have deposited 570. Okay, I'm going to buy it, guys. I'm going to make this deal. I'm not going to Oh, wait. I need cash money. She wants cash money. Let me take it out of the ATM. I'll get the cash. Enjoy this. Thank you. Once uh once Nick successfully buys this room, I'll replant. Guys, I'm a good negotiator. She said 800. I said deal. You said not a dollar more, not a dollar less. I just took all of our money out of the bank. It's great. I'm going to",
            "start": 4097.28
        },
        {
            "text": "this room, I'll replant. Guys, I'm a good negotiator. She said 800. I said deal. You said not a dollar more, not a dollar less. I just took all of our money out of the bank. It's great. I'm going to give her all of it. I love Mrs. Ming. She's kind of a baddie. She is going to say she wants to feed me. This is Ming. Let's do it. I like to buy a room. Let's deal. Guys, we are the owner of a room. The room, Mike, let's start setting up shop there. I'm moving the grow operation over now. We could just start another one over there. So, we have two. It's true. But then we have to have two. You got to be moving all around. Good point. Somebody Somebody else has got to grow then, you know. That's a good point. I'm going to deposit the money back in. Um, I'm going to go track down Peggy. Man, this this ATM works like a real life ATM. Put your money in. Music is hip. It's so [ __ ] hip. I'm going to go find us some more customers. All right. Move the grow tents and packaging. Mike, would you",
            "start": 4137.6
        },
        {
            "text": "this ATM works like a real life ATM. Put your money in. Music is hip. It's so [ __ ] hip. I'm going to go find us some more customers. All right. Move the grow tents and packaging. Mike, would you like me to help move stuff? You did it. You got it all done, buddy. Get my rent back. Okay. Growing pot as well. Okay, but here's the thing. They're going to be like, \"Man, everyone's so happy and this town is so clean. I wonder what happened.\" I'm like, \"Cops, we're doing your job for you.\" Yeah, we're giving everyone marijuana and we're picking up cans. Look how happy they are. And we're burning cans into the atmosphere. Yeah. Hello, ma'am. Would you like some weed? Oh, she's already high as [ __ ] You already got her. You already make that sale. You know, I got to make sure that everybody's got what they need. Uncle, can I am I supposed to? Uh, but you'll need help managing our customers. Time to think about recruiting a dealer. I don't need a [ __ ] dealer. We have three people in here.",
            "start": 4186.64
        },
        {
            "text": "what they need. Uncle, can I am I supposed to? Uh, but you'll need help managing our customers. Time to think about recruiting a dealer. I don't need a [ __ ] dealer. We have three people in here. I almost just knocked on the uh police station. All we got to focus on selling to Peggy, Beth, and Ludwig. All right, Peggy, I'm at right now, guys. I just made us $8. Nice. Peggy. Peggy. Good job, Joe. And then I'll go get that other guy. I'd like to buy a skateboard. $1,500. What the [ __ ] Yeah, they got they got six skateboards, though. We got to get We're getting skateboards before the end of the day. Hey, say the word. Buy all this. We have to get Do we want skateboards if we can just get a car? Um, yeah. Are you a weed? Are you a real weed dealer? Don't a log board around town. Where's our new um room, Mike? Above the house. Yeah, back door. Right where you're at. Sorry, Oh, Mike, you did a great job here. Can I clean this [ __ ] up, though? Uh-huh. Clean it up for me, please. How do",
            "start": 4240.96
        },
        {
            "text": "new um room, Mike? Above the house. Yeah, back door. Right where you're at. Sorry, Oh, Mike, you did a great job here. Can I clean this [ __ ] up, though? Uh-huh. Clean it up for me, please. How do I clean it up? I'm [ __ ] Pick it all up. Oh, you got to get a trash can from the motel. The motel. I left a couple of things if you want to grab the rest of it that I left behind. Sounds good. I'll get it. Uh, you right click on it to grab it. Sounds good. I've got a robot arm. My right arm is a robot. Oh [ __ ] Oh, come back. Come back. Come back. Let me sell you weed. Who made this game? How do we partner with them? Say congratulations. This is the best game ever made. Okay. Well, she doesn't like OG Kush, so that's going to be a problem. Do we have the option for different strains yet, Mike? No, not yet. We haven't heard. OG, get out of here. I think we're right around the corner from it, though. Okay. I think Oh, I just got hit by a car. Um I think that's the only that I have right",
            "start": 4296.32
        },
        {
            "text": "No, not yet. We haven't heard. OG, get out of here. I think we're right around the corner from it, though. Okay. I think Oh, I just got hit by a car. Um I think that's the only that I have right now. So, I'll go sell these. Mike, I don't Oh, nailed it, Mike. Yeah, there's a couple things back there. I don't know what it is. You can bring like the TV if you want to keep playing video games. Yeah, dude. I want all I'm robbing this place. We are drug dealers. They cannot stop us. Walk into this motel. We've ripped the TV off the wall. Let's see. Vex. Got it. All right. We only have $4 left, but I know we can make money. Oh, I have money. that I know we can make money. Dude, don't even worry about it. We got $46. I just got us some money. Good job. Oh, paid off, Albert. And I'm going to get some more weed going. Gerard needs six cushes, Mike. Okay, I got it. I have some speed grow, too, if you need it. Uh, no. Speed grow uh makes for uh shitty weed. We don't need this bed, do we? No.",
            "start": 4356.88
        },
        {
            "text": "some more weed going. Gerard needs six cushes, Mike. Okay, I got it. I have some speed grow, too, if you need it. Uh, no. Speed grow uh makes for uh shitty weed. We don't need this bed, do we? No. [ __ ] the bed. Leave the bed there. the bed and the lamp. We just want the TV with us to like we can't make it all the way home. You can sleep at home, right? Makes sense. [ __ ] yeah, Nick. This is a sick place. I'm going to put the bed outside. This I did not need to bring that trash can over, Mike. I know. I turned around and it was there and I was like, \"Ah, well, you know, it's here now. Two trash cans is fine.\" Always give Nick something to do. Keep him busy. Keep him [ __ ] busy. Someone's going to rent this room. Like, it's not even a trash can or a TV or a bed. It's literally just an empty room. Okay, going to the barber shop. Oh, the cops are here. Hate that for me. Hate that. Got weed growing. 40. All right, put some money in there. We got 60 bags. Uh Um, zero. I have five bags",
            "start": 4419.44
        },
        {
            "text": "empty room. Okay, going to the barber shop. Oh, the cops are here. Hate that for me. Hate that. Got weed growing. 40. All right, put some money in there. We got 60 bags. Uh Um, zero. I have five bags of OG Kush. Do we need them? Oh, no. Not not like done weed. I just have bags ready to rock. Yeah. Yeah. Um, Nick, you can I'm going to the shipping containers, but you could pick up that new order and give them. If you got four OG Kush, I'll pay. That's counter. That's our counter offering. Okay. [ __ ] around with it. Yeah. Yeah. Have some fun with it. That's You can You can get in negotiations. See you guys tomorrow. Bye, Greg. Bye, Greg. $250. Part of the deal, bro. Get crazy with it. You get weird, dude. They don't have a choice, Joey. There's no other weed dealers. Who else is selling weed here? And it's an addicting product. I don't care what Joe Rogan says. Yeah. Oh, love. I've smoked some shitty weed. Once smoked trimmings, watch my buddy turn [ __ ] pale and vomit all night. Ew.",
            "start": 4476.48
        },
        {
            "text": "here? And it's an addicting product. I don't care what Joe Rogan says. Yeah. Oh, love. I've smoked some shitty weed. Once smoked trimmings, watch my buddy turn [ __ ] pale and vomit all night. Ew. What the [ __ ] is that? Funny. Trimmings. It's the weed trimmings. No. Oh, just like the You mean like the um like the stems and [ __ ] that they say never to smoke because it makes No, not the ste not the stems and the seeds. Like the trimmings of the buds. Oh, so the buds have like these little mini mini leaves and stuff like that they call trimmings. Okay. Tacos. Is there a difference in the blue trimmers and Yeah, one's uh one's electric and automatic. The other one you have to click. Oh, I kind of like clicking. Oh, I didn't know that the blue ones are automatic. I'm not going to lie. Mike, Mike, you're doing great, man. I'm dialed in, bro. Picking up more weed. Uh, the grow will be done in like just a couple moments and then you guys can pick up some weed. Maybe Nick can start doing",
            "start": 4529.92
        },
        {
            "text": "Mike, you're doing great, man. I'm dialed in, bro. Picking up more weed. Uh, the grow will be done in like just a couple moments and then you guys can pick up some weed. Maybe Nick can start doing uh maybe Nick takes over on weed deal. Deals. Oh, is is he is he doing deals? Okay. I didn't pick up Peggy one, so that was all Nick. Okay. Where's All right. I'll go find Peggy. She's not up for another 12 hours. Go do go do Kathy. Yeah. Oh, dead drop is uh dead when he behind the taco truck. Got it. I don't I don't have free cushies though. I need those. Um I have some. Oh, dead drop just dropped. Okay, cool. Behind behind the motel. Can I just Are you right there, Nick? Can I give this to you? Yeah, give it to me. I don't think I can. You just drop it. Oh, I just Yeah. Oh, no. Just No, you just smoked it. Yeah, I saw that. I heard that. I definitely heard that happening. I almost did the exact same thing. I'm gonna put this upstairs. Yeah, put it upstairs. I'll grab in a sec. All right,",
            "start": 4580.8
        },
        {
            "text": "smoked it. Yeah, I saw that. I heard that. I definitely heard that happening. I almost did the exact same thing. I'm gonna put this upstairs. Yeah, put it upstairs. I'll grab in a sec. All right, weed's coming. I got only OG Kush right now, but that's all we're selling. I'll go get the dead drop. I got it. Thank you, Joe. All right, we got weed available. All right, Mike. Bringing this back to you. Perfect. Bring it back to me. put it on the shelf and then grab this weed out of the packing station for you and Joey to sell. Let's see. Lot of cops just standing there. That makes me nervous. Oh, Mike. Done. All right, Nick, here. Uh, click into this packing station and grab that weed right there. Enjoy. Go sell. All right, I'm off to see the wizard. Expires in five hours. Deal with Kathy behind the taco ticklers. Joey, I'm got it. I got it. We love taco ticklers. We love loving the ticklers. Ticklers. I like Kathy. Mud Dog, thank you for the Prime Gaming sub for 73 months. Marijuana. She",
            "start": 4633.84
        },
        {
            "text": "the taco ticklers. Joey, I'm got it. I got it. We love taco ticklers. We love loving the ticklers. Ticklers. I like Kathy. Mud Dog, thank you for the Prime Gaming sub for 73 months. Marijuana. She likes it. Oh god. Kathy, give it to me. Kathy, I've been trying to do a joke that requires me to do a Trump accent and people keep asking me why I keep making fun of Woody Allen. Not doing that. What? She want three. Nice doing business with the Kathy. I love you. Mrs. Ming could just come upstairs and get weed from us, but no, she texts us. Mrs. Ming, are you serious? I'm not on your time. I'll sell it to her. Just carrying a trash bag. Nothing to look at here, officer. Like I have some uh I think I have some kush seeds by accident. Oh, from the dead drop, probably. Yeah, I think I didn't. I think the the shelf was too full. Hate when that happens. Hate it. Hated it. I'm out there selling. Man, Mike's a good cook. That's it. Wait until we start to really cook, though. When we get that",
            "start": 4694.96
        },
        {
            "text": "I think the the shelf was too full. Hate when that happens. Hate it. Hated it. I'm out there selling. Man, Mike's a good cook. That's it. Wait until we start to really cook, though. When we get that mixing table, everything changes. It's to the point where I have notes in my phone of like the order that I need to mix things to get the highest like uh not potency but like the addictive quality. Do we need to go to bed before the cops snatch our crops? Uh no, they'll never come inside your house. But they the curfew alarm just went off. I'm just accepting all of these because I assume we'll be fine. Yeah, you guys could run around at night. You guys will be fine. Oh, I hate running around at night. Yeah, I'm not doing that. Damn. Mike's got it all. Not doing that. Mike's got this [ __ ] dried out and stuff. You ready, Nick? Can I do I can I get rid of this [ __ ] speed grow? Do I need this? Uh, yeah. You can just put it on a shelf. [ __ ] it. There's not enough room on a shelf. I say we",
            "start": 4752.88
        },
        {
            "text": "out and stuff. You ready, Nick? Can I do I can I get rid of this [ __ ] speed grow? Do I need this? Uh, yeah. You can just put it on a shelf. [ __ ] it. There's not enough room on a shelf. I say we just use it once and then get rid of it. Right. There you go. It makes bad. No, not on one of them. It's fine. All right, you guys got OG Kush on the shelf. Go sell it. If we're going to go to bed, pick it up in the morning. Y Joe's got the right idea. Let's just go to bed. Stay safe. But if you sell at night, you get a little more money. Do you? cuz you're putting your putting your job on the line. I had to do that. All right, here we go. Nice job, team. Look at us. Look at us right now. We're experienced. We are. Oh, street. Oh, look at all this stuff. The LED growing. What is Have I ever Man, I just skip through all of these every time. Oh, Joey, you got to see what you've unlocked. You have new things to grow with, new things to use. I know. Look at that. Oh, we got the mixing station,",
            "start": 4814.08
        },
        {
            "text": "I just skip through all of these every time. Oh, Joey, you got to see what you've unlocked. You have new things to grow with, new things to use. I know. Look at that. Oh, we got the mixing station, baby. Mixing station. And we unlocked Westville. Here's my thing is like I like to be sort of um I like the minimal amount of liability during criminal enterprises. I just want to be the trash guy cuz the trash guy never has to go to jail for long. So, you want to work for the criminal enterprise but just be the trash guy, but like do something legit. The lawyers never go to jail. You think the cops are going to be like, \"Yeah, he he was only just he was only doing the trash.\" I think so. They're like, he's just the trash man accessory. And it turns out the trash man was the brains behind the Exactly. Got him. He's the trash man. Kaiser So, that guy. It's Kaiser. So, Kaiser So, nice little fun reference to that movie and uh the studio maybe. Yeah. He's like, \"What if Kaiser just knew he was",
            "start": 4875.48
        },
        {
            "text": "Got him. He's the trash man. Kaiser So, that guy. It's Kaiser. So, Kaiser So, nice little fun reference to that movie and uh the studio maybe. Yeah. He's like, \"What if Kaiser just knew he was the bad guy the entire That was good. That's funny. That show is funny. Is anybody doing this last deal or no? That's you. I'm not doing any deals. I have drugs waiting for you back home. My trash can has overrunth. Sometimes you just got to just got to go. You going to deal with Trent? Yeah. Oh, I'm going to go try to sell some to Ludwick and Betty and all those people. There you go. Make them know our friend. Oh, yeah. Cuz we just unlocked a new um area. Hey, what's your name? Hey, what's your name? Betty. Beth, potential customer. What's up, Beth? Love how peaceful it is here with all the dick art graffitied around everywhere. Great place to live. Peaceful. It's a fun place. Nothing better than peaceful good oldfashioned peaceful dick art. Oh my. And Betty is running away from you right now.",
            "start": 4918.32
        },
        {
            "text": "graffitied around everywhere. Great place to live. Peaceful. It's a fun place. Nothing better than peaceful good oldfashioned peaceful dick art. Oh my. And Betty is running away from you right now. She's just doesn't want any part of your illegal operation. I think so. Can I put a ping on the map for Betty? It's a bath. Maybe that's why. No, there's no the Betty. I'm I'm just I'm reading this wrong. I'm going too fast. Body's writing check or No, your ego is writing checks. Your body can't cash. Cash. Oh, [ __ ] you, Betty. You inside. [Music] You know, sometimes it is hard to find. [Music] turn into my customer, Betty. Oh, is she I think she's the one that doesn't like the OG cush. She said she'll message me. Oh, thanks, Beth. We got a new customer, everyone. All right, I'm going to go after Meg. Meg Clooney. Is that her real name or did you make It's [ __ ] Oh, okay. You gave her a cooler, though. Yeah, Clooney is a badass name. No one ever had that name. Okay. No, no. All this",
            "start": 4985.36
        },
        {
            "text": "go after Meg. Meg Clooney. Is that her real name or did you make It's [ __ ] Oh, okay. You gave her a cooler, though. Yeah, Clooney is a badass name. No one ever had that name. Okay. No, no. All this money, money, money, money. Thanks you two for the money. Here comes the [Music] money. Joyce maybe needs a [Music] sample. Kyle, I got you, my dude. Oo, nice new customer. Nice. Oh, you got Meg. I didn't know me was in Me. I'm going to be real with you, man. This game moves so much quicker. Stay. Is it amazing? I know, right? Is all the weed for gel. What is Oh, poor. Yeah, it's just different quality. [Music] over here. My trash [Music] bin exciting for me personally. Oh, what are you doing in here? That's for pickups from you guys. So, you don't even have to walk in or worry. Oh my gosh. Right there, ready to go. Mike just holding himself up in there. We got to make sure that Mike gets some fresh air in the No, Mike is going to grind it out until he gets himself. I learned this. I",
            "start": 5071.92
        },
        {
            "text": "Right there, ready to go. Mike just holding himself up in there. We got to make sure that Mike gets some fresh air in the No, Mike is going to grind it out until he gets himself. I learned this. I learned this technique from Chris An. You just put your head down and work, dude. That's the best. Nobody wants to work anymore. Nobody wants to work anymore. Nobody has a work ethic anymore. I think I'm grinding out drugs all night. Going to go do comedy later tonight. Yeah. Oo, grinding drugs. Is your in-game drug dealer also doing comedy? Yeah, of course. It goes hand in hand. Do you know how many drug Oh, no. Donna doesn't want [ __ ] you, Donna. I think she's the one that doesn't like that. Or one of them doesn't like the only weed we have, which is upsetting. Okay. Yeah, really upsetting. Mhm. Yes. Literally right now. [ __ ] are these people? Just running around. Mike, what are you cooking up? I am Well, you guys have a bunch of uh kush. need you to sell through the cush and then",
            "start": 5177.44
        },
        {
            "text": "Mhm. Yes. Literally right now. [ __ ] are these people? Just running around. Mike, what are you cooking up? I am Well, you guys have a bunch of uh kush. need you to sell through the cush and then we're gonna move to green crack. Hell yeah. One of my favorites. Well, that might be sour diesel. Not sure, but either way, it's some of my favorite. Do you ever like short customers? Uh, only when I when I didn't have actually enough. [ __ ] them. You know, sometimes I'm just like, me, you get one less today. You get one. You know what? [ __ ] you. What are they going to say? What are they going to call? What are they going to do? called the Better Business Bureau. Yeah. Get out of here. Uh I'm going to go pay off our debt. I actually am paying it off right now. Oh yeah. I have uh talked to him. I put in an order. So you guys will receive my dead drop in a minute. Uh sell out through this OG Kush and then we'll have uh Sour Diesel next. I'm very excited. New strain coming up. New strain.",
            "start": 5222.28
        },
        {
            "text": "I put in an order. So you guys will receive my dead drop in a minute. Uh sell out through this OG Kush and then we'll have uh Sour Diesel next. I'm very excited. New strain coming up. New strain. Where are the bags of uh Look behind you, Nick. Right in the doorway. Boom. Oh [ __ ] Yeah, you got your own little special spot. I'm going to go make some new customers. Love that. Yeah. Who we got? Doris and Keith. Hi. Wait. Come back here. Where are you going? Where you going? Oh, it's Joey. Oh my god. Geraldine Pune wants seven of OG Kush. Seven. Yeah. Dang. Here, hold on. I have four. I have seven. You got seven. Okay. I'm just going to keep trying to deal with Chloe and Ludwick and Bev. Cool. I will go do this one. Where Chloe and Ludwick and Beth are. Oh, Ludwig just asked for something. Oh, maybe I already converted them. Five, six, seven. Keep me posted on your uh your counts of bags that you have left. So I know I have four and nine. Four and nine. Nick, how much how much weed you",
            "start": 5288.48
        },
        {
            "text": "Oh, maybe I already converted them. Five, six, seven. Keep me posted on your uh your counts of bags that you have left. So I know I have four and nine. Four and nine. Nick, how much how much weed you got left? Four and four. Four and four. Eight. Okay, sounds good. Try to get rid rid of the last of our drugs. the last of our drugs for the day or we're switching strains now. Oh, got it. Got it. I'm I'm usually a one strain type of guy. I like to keep it simple. I find when you start doing multiple strains at once, you get a little lost in the sauce early in the game before you have a bunch of uh you know, things to do. Thank you. I right now in my home game rocking two strains cuz they're they sell for the most amount of money. Okay. What? Like I almost just sold to a cop. Oh no, we hate that. The [ __ ] am I? This guy on top of this human. Oh, it's right there. He was in the piss pub. Know what that is? Who wants things? Oh [ __ ] What's wrong, big dog? You good? Yeah. I'll make an",
            "start": 5354.4
        },
        {
            "text": "that. The [ __ ] am I? This guy on top of this human. Oh, it's right there. He was in the piss pub. Know what that is? Who wants things? Oh [ __ ] What's wrong, big dog? You good? Yeah. I'll make an offer. What does she want? What does she want from me? Offer a product like this. I'm just going to give her all four of these. All four? Yeah. I'm just going to sell her. Okay. light up right in front of the cop boner. Um, I'm putting your seeds on the Perfect timing, Joe. I'm on the wave number two now. Let's go. Needed that. Perfect. I hope it would be so cool if you were here, but you're not. And with a dash of fertilizer, we're just cooking it out. I don't want to talk. Mike, what's your favorite strain? Um, granddaddy perp of course, but that's an easy answer. Uh, I like some sour diesel. Northern Lights. Girl Scout cookies is big out here. I had this uh skunk haze back in the day. I liked. Look at us guys. We're just growing weed. We're just growing weed. Um is that cop gun?",
            "start": 5422.72
        },
        {
            "text": "diesel. Northern Lights. Girl Scout cookies is big out here. I had this uh skunk haze back in the day. I liked. Look at us guys. We're just growing weed. We're just growing weed. Um is that cop gun? Perfect. Uh how about uh some counts now? How's our counts looking? Um, I mean, I'm just I'm at two and nine. Two and six. I guess I've sold so much weed. Hell yeah, Nick. You're about to sell some new weed, too. Wait, just went to the ATM. What's up, Beth? You want some? Oh, short Hokag says that Gary Payton is loud. The last Gary Payton. I slept through a very loud argument that I found out about later. I was like, \"Oh, didn't hear anything that happened.\" The Gary Payton. That's a That's a lead name. That's funny. Yeah. That's what happened. Why is it called the Gary Payton? After Gary Payeyton, I assume. I actually have no idea. The glove basketball player. Gary Payton. See, that's the fun part. It's like, you know, Snoop and Whiz. Everybody gets in the weeds. In the weeds. There's",
            "start": 5518.12
        },
        {
            "text": "I assume. I actually have no idea. The glove basketball player. Gary Payton. See, that's the fun part. It's like, you know, Snoop and Whiz. Everybody gets in the weeds. In the weeds. There's that. Just gave us 500 bucks. about to go to bed. Also, so funny that Gary Payton coaches community college basketball out here. Love that. Let me pick up and sell all your Here comes Joey. Joey's my Yep. She's She's going to handle it for me. Thank you, Joe. I'm going to call my main man up for some more weed, Mr. Albert. Oh, we got that green crack now, too. Man, Albert's really trying to bend me over here. We got crack now. I can't get that. Damn, Mike. What the [ __ ] are these sprinklers? Yeah, bro. What do you think about that? Pretty dope, right? Damn, dude. You've been to work, dog. I'm deep in the sauce, homie. I'm going to go sell it now. Putting them in front is interesting. Yeah, I have to put them in front. You can put them through the sides. Joey, get the [ __ ] out of town. You can",
            "start": 5591.92
        },
        {
            "text": "the sauce, homie. I'm going to go sell it now. Putting them in front is interesting. Yeah, I have to put them in front. You can put them through the sides. Joey, get the [ __ ] out of town. You can put them through the sides, Joe. In my like where or in the barn, I have the soil feeder on one side. [ __ ] cool. Look at Joey Noel. Oh, Joey's deep in the weed. That's what those little holes on the sides are for. That's what those [ __ ] holes are on the side for, Michael. Why am I jamming everything up, keeping things tight? Then in the morning, we got 1,300 bucks. And guess what? I'm introducing a new strain of weed to the market. So, now it gets a little dicey because we have to keep track, Nick, of who ordered what. Well, I'm going to turn off the the other one. Okay. Well, how much more OG cush y'all got? I have eight. I'll only have I'll only have one more once if I do all of I have I'm going to put all mine back on the desk here. You want to take all the sour diesel ones and I'll",
            "start": 5648.24
        },
        {
            "text": "OG cush y'all got? I have eight. I'll only have I'll only have one more once if I do all of I have I'm going to put all mine back on the desk here. You want to take all the sour diesel ones and I'll do all the OG. Yeah. Nick, you do all sour diesel. Which one's sour diesel? Does that green? The one that's on there right now. Yeah, you should be able to read. I'll take all the sour diesel. Oh, it's not the color is the quality, not the strain. Oh, I see. So, you have to hover. Oh, gush. I'll take that. All right, I'll take all these. Perfect. Pleasure. Let's go to bed with you. All right, everybody. Go to bed. Go to bed, team. Look at us cooking right now. Look at us cooking. You might get one more day of sales, just so you know, cuz this afternoon stream is about to wrap up. So, go forth. Go forth. And go [ __ ] make some. What do we Look at all that XM. Now we got the soil pourer and Viagra and green crap. Deal with Donna. She wants OG Kush. Joe, you have all the OG Kush. I do. I'm",
            "start": 5699.28
        },
        {
            "text": "Go forth. And go [ __ ] make some. What do we Look at all that XM. Now we got the soil pourer and Viagra and green crap. Deal with Donna. She wants OG Kush. Joe, you have all the OG Kush. I do. I'm gonna go do all of these. You got to do all those, right? I got to do all of them. I'm going to try to get Ludwig to come the [ __ ] out and be my friend. Maybe. Maybe he'll come to your comedy show. That'd be fun. I got my buddy Ludwig here. What if you were friends with the Ludwig streamer, Mike? Do you think he'd be cool? Why does he not go by Why is he not Ludwick? Why is he Ludwig? I don't know. Um, that's a great I'd ask him that. He does seem like a cool jabroni. I'd hang out with him. Mrs. Ming, do you want complete deal? Say yeah. What up? And I need you to hang out with Mrs. Mrs. Ming wants OG Kush. I will I will go do that. All right, Mrs. Ming right here. I would like you to be friends with Lewig because I would like to be friends with Cutie Cinderella. So, if you could put in",
            "start": 5746.0
        },
        {
            "text": "wants OG Kush. I will I will go do that. All right, Mrs. Ming right here. I would like you to be friends with Lewig because I would like to be friends with Cutie Cinderella. So, if you could put in the work for me, that would be great. I'll do my bestest. I'm on track to be streamer of the year this year. That's my goal. I'd like kind of Do you want to go to the streamer award? I'd like to go to the stream awards, be nominated for stream of the year, and I'd like uh kind of funny to be uh team organization of the year. That would be cool. I just need I need QT Cinderella to understand what uh what we do here. Of course, with kind of funny with games media slash Twitch streaming. Yeah, it's going to be tough. Explain the cool [ __ ] that we do. Drop is ready at the speed. that drop. Oh, wow. The new the new area is open. Um, where operations? Look at this man. Warehouse district. Oh, it's on the wall. Oh, Mike, we can get tattoos now. Tattoos. You got to meet Austin at the basketball",
            "start": 5793.6
        },
        {
            "text": "The new the new area is open. Um, where operations? Look at this man. Warehouse district. Oh, it's on the wall. Oh, Mike, we can get tattoos now. Tattoos. You got to meet Austin at the basketball court, Nick. Got him. [Music] And then, oh, I'm dropping this off. Does he need sour diesel? He does. Got a lot of sour diesel back home. Let me know when the OG cushion is done. We can turn it off. Um, okay. I'm putting your seeds in there. Thank you, Joe. This guy's just randomly standing at a kid's basketball court trying to get some weed. What does he want? He wants three. What do we got? Okay. Counter offer. I only have two, so I will charge you less money, but not that much less. Yeah, don't give him that big of a deal. I will need you. Okay. Um Okay, let's talk it out. What's up? You can turn off the OG Kush now. OG Kush has been turned off. We've moved only to currently sour diesel sales for $20 more for Nick. You of course can negotiate your own offers as you go out forth. Let's get",
            "start": 5842.16
        },
        {
            "text": "off the OG Kush now. OG Kush has been turned off. We've moved only to currently sour diesel sales for $20 more for Nick. You of course can negotiate your own offers as you go out forth. Let's get a good final day in. All right, team. Let's get a good final day of sales. Let's make money. Let's handle our business. How do I [ __ ] make Lwick and Chloe and Beth love me? Have you given them the right kind of samples? Oh, do they need the samples? I think we just have to keep selling. Yeah, sell more weed to him. Potential customer up. Peter would like some weed. Peter Peter. Peter. Peter. Peter. Peter. Okay. Doris. Nice. Doris. Doris. Got her. She could only hold out for so long, you know. Yeah, dude. Doris, get your ass over here. We know like the rest of us. Come have fun. You got to get in people's faces, Mike. Right. This guy's trying to run away from you. Step right up the doors. Oh, he's already high. You already got this guy. Kind of interested in a free sample. You know what? I",
            "start": 5942.8
        },
        {
            "text": "in people's faces, Mike. Right. This guy's trying to run away from you. Step right up the doors. Oh, he's already high. You already got this guy. Kind of interested in a free sample. You know what? I want this lady. Geraldine, why don't you want to buy from me? You're friends. Delaney. Kim. Oh, Kim. Nice, Nick. You're getting us more customers. You're doing exactly what we need to do right now. Good job. I'm out here selling. I am perfect at giving [ __ ] away for free. I want everyone in this town blitz out of their [ __ ] minds. And that's how it works. Barber shop behind. Where's the pond? Oh, come here, buddy. You have to talk to me. Good. Hey buddy, clean the pit stains. [ __ ] you. We got the barber shop and the pawn shop. We got a dead drop on the way. We got a dead drop. Oh, watch out there. Oh, wait. What does she want? Oh, you kush. I have that one. I don't have it. Okay, it's all you. I got it. I'm very forward find I'm like trying to get some sales leads here. I'm lead",
            "start": 6021.04
        },
        {
            "text": "out there. Oh, wait. What does she want? Oh, you kush. I have that one. I don't have it. Okay, it's all you. I got it. I'm very forward find I'm like trying to get some sales leads here. I'm lead genen. I'm lead genen for this team. You know it's an important important task to have. It's true. Oh, I should find a ATM cuz I got a lot of money. Tropic Thunder. Oh, don't forget about our skateboard goal. We're not leaving today without everybody getting there. We're not making any money. No, we have money. We should be carrying money. Deposited any money. This is the problem with this game, right? These games just like it just you got to spend money to make money. Yeah, but I don't like that, man. We got to make some cash. I'm just giving [ __ ] away for free. That's the problem. I mean, that's your job right now. We have $1,500. We're making it. We're I'm getting two more clients before the stream is done. I love that. Love this. Can't I go that way to go that way? Who are sneaking in?",
            "start": 6090.88
        },
        {
            "text": "your job right now. We have $1,500. We're making it. We're I'm getting two more clients before the stream is done. I love that. Love this. Can't I go that way to go that way? Who are sneaking in? Jerry, I think you're going to love us. Dude, I just snuck around the police barricade. Do you think that's kosher? Me? We just don't tell them about it. Yeah, just don't tell them about it. What are they going to do? Nothing, dude. They can't do hard to find. became a member on YouTube for 29 months. I want you to know that the stash is [ __ ] working. Thanks, my friends. People think it's gross. I I think a lot of people say they love it. Chris Hank liked it. He said it's a good look. Yeah, that's all that matters to me in my life. Are we going to sell to today? Cannot get my mind. I know the map is kind of crazy. Damn, someone got killed over here. Crazy. Killed. Oh yeah, that's active crime scene. Jerry, like some weed. Oh no, Jerry, you're shirtless at 12:00 in the afternoon, boy. You're",
            "start": 6137.12
        },
        {
            "text": "is kind of crazy. Damn, someone got killed over here. Crazy. Killed. Oh yeah, that's active crime scene. Jerry, like some weed. Oh no, Jerry, you're shirtless at 12:00 in the afternoon, boy. You're [ __ ] becoming my part. You don't really like that. [ __ ] you, Jerry. Give my money back. [ __ ] Well, I [ __ ] Jerry up a little bit. Jerry wants OG Kush. We don't have any. No, tell him no. You can renegotiate with what we got, though. It's time to move on. Tell him to [ __ ] get with it. Jerry does not understand that this is a crack world and he's smoking weed. Just need you to modernize a little bit. Jerry. Jerry, please understand that we sell green crack now. We are crack dealers. Fenton all. I don't All for one and Fenton for all. I think it's still weed, guys. When do we start selling that [ __ ] that [ __ ] immediately kills people? I think that that's coming up in the future. That's on his season one road map. He's not quite ready for it, but he's going to put it out. Perfect.",
            "start": 6204.88
        },
        {
            "text": "that [ __ ] that [ __ ] immediately kills people? I think that that's coming up in the future. That's on his season one road map. He's not quite ready for it, but he's going to put it out. Perfect. Okay, they need sour. We got sour. Oh, sour. I'm accepting all of these. You want Do you want me to leave a sour here for you? I'm sure No, you you can go out and deliver. I got you. Okay, I got you. I got you. Don't forget, you can buy a skateboard if you want. Go hit the town. I'm going to the one by Buds Bar. That [ __ ] expires fast. Yeah. Well, I probably just The taco bar. It's by the motel. And then when you're over there, you can go. Oh [ __ ] I just gave her all of her sour diesel by accident for $70. She's got the deal of a lifetime. God, deal of a lifetime. I'm sorry, dude. We are We are in the hole now. I grabbed it. I grabbed all in the hole. I grabbed 10 sour diesels and gave it to her. Hit complete. [ __ ] [ __ ] Go talk to Benji in motel room number two. Nick, I don't have",
            "start": 6266.8
        },
        {
            "text": "are in the hole now. I grabbed it. I grabbed all in the hole. I grabbed 10 sour diesels and gave it to her. Hit complete. [ __ ] [ __ ] Go talk to Benji in motel room number two. Nick, I don't have any money. You don't have to have money. No, you got to go talk to Benji. [ __ ] guys. I failed you. Really? That's a lot of money, bro. That's a lot of money. [ __ ] 60 time 10. That's 600 bucks. Jesus. See if you can pickpocket her. Go up behind her, crouch, and pickpocket her. Okay, I need Yeah, Benji. I'm going to give Benji on our side. He's going to start selling for us. Oh, [ __ ] yeah. Withdraw everything. All right, I'm going to go pickpocket her ass. Yeah, we need we need that [ __ ] back. Tell her. Yeah, that's a lot. My boss says I need this back. That was a little a little too too generous. Okay, see if I can pickpocket her ass. I don't think I see her here. Where'd she go? Who was it? I'll find her. You can also knock on a door if she's inside. Benji, it was [ __ ] I don't see",
            "start": 6333.84
        },
        {
            "text": "Okay, see if I can pickpocket her ass. I don't think I see her here. Where'd she go? Who was it? I'll find her. You can also knock on a door if she's inside. Benji, it was [ __ ] I don't see her ass. She was behind the taco. Let me see if she probably check your text messages. They usually say like who you just sold to. You can see who was like, \"Oh, meet me behind Taco Ticklers.\" Bud Bud's bar. Chloe, where is she? Chloe, go find Chloe right now. Where the hell is Chloe? She's got our [ __ ] Um, your seats are on the shelf. Thank you, Joey. [Music] This one's going to stick with Nick. He doesn't like [ __ ] up. No, I [ __ ] hate that. It's going to stick with Nick. But here's the thing. Whomst of us hasn't gotten fleece? Who hasn't [ __ ] up? Yeah. Or whatever. I just feel bad, man. That's fine. That's Do you know how much weed I've lost to cops in this game? A lot. And maybe she'll remember this in the future, you know, and she'll be like, \"Man, yeah. I've got the best dealer.\"",
            "start": 6388.72
        },
        {
            "text": "That's fine. That's Do you know how much weed I've lost to cops in this game? A lot. And maybe she'll remember this in the future, you know, and she'll be like, \"Man, yeah. I've got the best dealer.\" Yeah. He just gave me 10 times the amount of weed that I asked for. She wanted one bag. I gave her nine. Oh [ __ ] That's a good life right there. Damn, Mike. I [ __ ] you. That's I got I got more weed ready to rock for you, too. Why don't you go buy a skateboard? See how it feels. Do you have weed for me? I do, Joe. I have 16 weed. Go buy a skateboard. See how it feels. I'm going to go give this rip that board, bro. Benji, we'll get him out on the town for us. I think we really set Nick's world up for success, Joe. In case Nick likes this game, we could come back and play again. And like we have a pretty good I do I do love that Mike put these things right out front. There is a hole in the Oh, yeah. The holes on the sides. Yeah. Yeah. But we're in a tight area, right? Like you got to",
            "start": 6448.0
        },
        {
            "text": "we have a pretty good I do I do love that Mike put these things right out front. There is a hole in the Oh, yeah. The holes on the sides. Yeah. Yeah. But we're in a tight area, right? Like you got to remember it's a tight area. It's a tight area, Joey. Um, okay. Context. I'm gonna How do I I'm going to bed. I'm just gonna sign a lot of Benji. He has eight customers. Oh, there you go. I don't know if they're the right ones, but they're customers. Nice. Going to bed. Going to bed. Oh, I like that you changed the bed orientation. Open up some room. Yeah, I put the uh I got a mixing station now. I was going to have Nick learn how to mix. Oh, Nick's got a Nick, why don't you go over to the gas station where you met Chloe? Okay, kill her. And uh go buy some uh ingredients that we could possibly mix with weed. Okay. Oh [ __ ] Are we going to start lacing our weed? Yep. Yes. Yes, we are. What the heck? They give it different personalities, different traits. Oh, it's so fun. Is that how they",
            "start": 6502.72
        },
        {
            "text": "mix with weed. Okay. Oh [ __ ] Are we going to start lacing our weed? Yep. Yes. Yes, we are. What the heck? They give it different personalities, different traits. Oh, it's so fun. Is that how they make all that cool like Girl Scout cookie weed and [ __ ] That's definitely mix. They mix in a donuts. That That's the kind of [ __ ] you're about to buy. Donuts. Horse seaman. Yeah. Gas station. It's like uh that bridge where the cops always are. Yeah, I got you. Nobody wants to buy this. Benji's probably making sales. 7:45 in the morning. Guess I'll go back to my side job as a sanitation enforcer. [Music] Wash, thank you for the Prime Gaming stuff for 48 months. Shout out to Washi. Thank you, Wash, for the love. Great to see you always. All right, I'd like to buy something for Oh, Chloe. [ __ ] yeah. Yeah, steal it. I pickpocket her ass. Hold on. See, she's still holding out on our free stuff. I can't get back there. I mean, if I was her, I would have smoked all of that last night. Yeah,",
            "start": 6570.24
        },
        {
            "text": "yeah. Yeah, steal it. I pickpocket her ass. Hold on. See, she's still holding out on our free stuff. I can't get back there. I mean, if I was her, I would have smoked all of that last night. Yeah, she smoked it all. She had a party for sure. I'd like to purchase something. All right. I got donut. I got perk at them all. I got banana. I got Cook. Okay. I think you want one of everything. One of each. Or a couple of each. Yeah, a couple. Viagra, maybe. Yeah. Whatever. Nick, buy whatever you like and then come back and see me. We're going to we're going to create [Music] What do we got here? All right, Mike. I got a bunch of [ __ ] Yeah. You back at the house yet? Coming back. What? I'm running the route. We are going to go to the pay phone. We're going to create Nick. I'm going to create Nick. Joe, I'm going to bag you up 18. I gave Nick six to create with. Perfect. We already bought a mixing station. What if we have to buy another one? Oh, is that going to do that? What do we got to",
            "start": 6633.2
        },
        {
            "text": "Nick. Joe, I'm going to bag you up 18. I gave Nick six to create with. Perfect. We already bought a mixing station. What if we have to buy another one? Oh, is that going to do that? What do we got to do? That's fine. Buy another one. Oh, no. Oh, there we go. No, I'm freaked out. Oh, go to the gas smart force, Joey. just so we could progress that and then Nick will have to make a strain with worth a little bunch of money which will be great. All right, Mike, what do you want this [ __ ] All right, I want you to hold on to all that. I'm going to show you what to do. One sec. Let me just finish bagging up my crap here. Just help Chloe out with Ren for a month. Do you want a cheat sheet for the mix? No, let him let him get creative. All right, Nick. So you have free weed over here. Come to me. Got it. So this is the mixing station right here. You have unbagged weed and you have items to mix it with. So what you're going to want to do when you go to the weed mixing for the first time is go",
            "start": 6688.12
        },
        {
            "text": "Got it. So this is the mixing station right here. You have unbagged weed and you have items to mix it with. So what you're going to want to do when you go to the weed mixing for the first time is go one by one. So just one nug and one item. And then I want you to mix that and see what kind of attributes it gives you every time you mix certain weeds with different items. All right. Okay. So I how do I do I start it? I mix I have this in here. You got to drag it. Yeah. And I put one Viagra. One Viagra. Let's see what that mix gives you. And so now it will cook up. We can make people high and hard. Okay. Refresh. Tropic Thunder. Tropic Thunder. So the fun part here is if you want, you can hand me that strain. So take it. Mhm. How do I put it? There you go. Okay. All right. Now, uh, cool part is you can hand you can put that on back on the shelf here. Hey, hold on a sec. I got it. Okay. Put it back on the shelf. Yeah, the shelf where you found it. And then drop that on the shelf. That one",
            "start": 6747.84
        },
        {
            "text": "is you can hand you can put that on back on the shelf here. Hey, hold on a sec. I got it. Okay. Put it back on the shelf. Yeah, the shelf where you found it. And then drop that on the shelf. That one little new nug. No, no, the other nugs. [ __ ] Yep. All right. Now, take your five back. And then, of course, you always want to know what your weed does, right? You want to find out what does Tropic Thunder mean. So, Nick, look at me. Yeah. And so, like, we got to test the weed, right? So, let's see what happens to me. Does he die? [Laughter] Did you What the hell just happened? Tropic Thunder. Tropic Oh my god, it gives you black face. Is that what that is? I didn't know that. Insane. Insane. That's crazy. That's insane. So now you go back to the mixing station and just like you did one nug, one thing. You can double mix too, Nick. So if you like a certain thing, you can mix on top of that. Uh really whatever you want, Nick. So just keep mixing with your ingredients from the gas",
            "start": 6796.48
        },
        {
            "text": "one nug, one thing. You can double mix too, Nick. So if you like a certain thing, you can mix on top of that. Uh really whatever you want, Nick. So just keep mixing with your ingredients from the gas station. Okay. And uh good luck. We're gonna mix sand and mix mix and mix product and cooking. Joe, if you get past the pay phone, please hit that cuz he's going to tell us to make a a high value strain. And at this point, Nick is already doing that. And yeah, just find some properties of each uh thing that you like, Nick. But always go one at a time. I think I made three by accident. That's all right. And I don't think I put anything in with him. I don't know if that's possible, but all right. Okay. It's mixing. Yeah, it's mixing. The stuff that's in there while it's mixing. California cookies. Ooh, California cookies. So, what is the what's the lines? What does it do? Refreshing and energizing. Okay. Why don't we uh mix some more stuff with that? With that? I mean, let's double mix it.",
            "start": 6851.44
        },
        {
            "text": "Ooh, California cookies. So, what is the what's the lines? What does it do? Refreshing and energizing. Okay. Why don't we uh mix some more stuff with that? With that? I mean, let's double mix it. Let's double mix it. Double mix it. Yeah. So, put that same strain back in. Okay. Uh, with just one thing. You don't You don't have to put two donuts on it, but like I I like I [ __ ] did two donuts. Sorry. Uhhuh. That's fine. Well, I [ __ ] up. I didn't do I didn't use the right weed. Hold on. I'm going put some Viagra in there, too. Yeah. Whatever you like. Got some sick ass weed now. Thick crack. Okay. What does it got? Calorie dense. Calorie dense. Okay. And now you got some weed to find. So now I can put this back in here. And then you can add more. Yeah, you can add more things to it. You can uh you can just call it good on that one. Now it's like finding your favorite strain and attributes that you want to put on it to then sell as well. So we can add everything that you make, we can",
            "start": 6904.0
        },
        {
            "text": "can uh you can just call it good on that one. Now it's like finding your favorite strain and attributes that you want to put on it to then sell as well. So we can add everything that you make, we can add onto the market and we can say, \"Hey, thick cookie over here is for sale.\" We can we can throw that up for as much as we want. Tropic Thunder wedding punch. I'm going to go do this. This shit's [ __ ] great. And then yeah, we can smoke it. We can uh we can test out the theories and then just keep going. Just keep putting stuff on. Aspen death. Aspen death, bro. Refreshing ginger. Gingeritis. Why don't you uh why don't you hand that over to me? Put it or No, no, you have to do that one, Nick. So, put that in your pocket. Okay. Uh, smoke it and then V is to look at yourself. So, smoke it and then press V. Oh, take a look. Oh [ __ ] my head's big. Is it going to explode? Is your hair orange? Yeah, it is. Yep. Gingeritis. Oh, I got gingeritis. That's amazing. And your head is quite big.",
            "start": 6952.56
        },
        {
            "text": "then press V. Oh, take a look. Oh [ __ ] my head's big. Is it going to explode? Is your hair orange? Yeah, it is. Yep. Gingeritis. Oh, I got gingeritis. That's amazing. And your head is quite big. Yeah, you got big, dude. That's amazing. And so yeah, that's uh what you're going to do there. Now your goal is to find the best strain that can we can sell for a lot of money and does fun dumb things that you like. Maybe strains can kill people. Who knows? Well, this one did say death. I don't think it killed you, though. Got to go sell this. Kelsey, thank you for the Prime Gaming sub and welcome in to Easy Allies for the raid. Hi, Easy Allies. Allies, thank you for coming in and saying hi to us. Banana Death. Just awesome. Yeah, Nick is learning how to make drugs. I'm making some drugs, guys. I'm going to give you some I'm going to smoke this banana death and see what happens. Smoke some banana death. I'm going to give you some uh open weed, Nick, to mess with. Um I need some stuff to",
            "start": 7009.68
        },
        {
            "text": "I'm going to give you some I'm going to smoke this banana death and see what happens. Smoke some banana death. I'm going to give you some uh open weed, Nick, to mess with. Um I need some stuff to Yeah, we have uh Joey, I got uh 18 plus another 14. All right, Mike. So, what do I do with this? Uh, I guess sour diesel. Uh, so any open nugs, Nick, I'm leaving for you on that on that. I want you to keep making strains, okay, that you like. So, keep going to the gas station, buy different uh ingredients to mix with and try different mixing. Uh, can I give you this wedding punch? Uh, yeah. Or you can uh you can also uh give it to people on the street, Nick, and just imagine what happens when they try it. I think I just got to But it's unpacked at the moment. Uh yeah, you can pack that. You can pack that right here on my station. So step right up, pack it on that station and go for it. Gonna go fill Benji back up. Perfect. Joe, I got you another 14 for you to personally sell if you need to.",
            "start": 7074.4
        },
        {
            "text": "pack that right here on my station. So step right up, pack it on that station and go for it. Gonna go fill Benji back up. Perfect. Joe, I got you another 14 for you to personally sell if you need to. Love that. Love that. We are cooking with kind of funny is now cooking it up, y'all. I'm going to love to party. Do I need to tell this guy to give us more uh dead drops? Probably. All right. And guess what everybody? That's the end of our stream. Tragic. Great job, everybody. We made money. We hired a dealer. Perfect, guys. We learned how to make weed. We had fun. Nick's cooking. Nick is cooking. Maybe we'll return to schedule one. If we don't, I hope you and your friends out there are having a blast with it. It's an awesome game for 2025. It's a mustplay with you and your friends. So, go have fun. Until then, we will be gone uh tonight. Tomorrow, you'll have Blessing and Andy take over the stream. And next week, Nick Lock returns for the finale. Keep an eye out. We're very excited to",
            "start": 7119.12
        },
        {
            "text": "have fun. Until then, we will be gone uh tonight. Tomorrow, you'll have Blessing and Andy take over the stream. And next week, Nick Lock returns for the finale. Keep an eye out. We're very excited to beat the game. We'll see y'all then. Good. [Music]",
            "start": 7173.68
        }
    ]
}