{
    "id": 13888,
    "video_id": "BSxGrfQ1_nw",
    "show_name": "Highlights",
    "hosts": [
        "Tim Gettys",
        "Blessing Adeoye Jr."
    ],
    "title": "Why are we doing this?!",
    "description": "From KFGD: https://www.youtube.com/watch?v=kT1tV6XowUs \n\nThis episode is sponsored by BetterHelp — go to http://betterhelp.com/kindafunny to get 10% off your first month.\n\nFOLLOW US ON EVERYWHERE!\n---------------------------------------------------  \nYouTube: Youtube.com/KindaFunnyGames\nTwitch: https://www.twitch.tv/kindafunnygames\nPatreon: https://www.patreon.com/kindafunny/\nTwitter: https://twitter.com/KindaFunnyVids\nInstagram: https://www.instagram.com/kindafunnyvids/\nTikTok:  https://www.tiktok.com/@kindafunnygames?lang=en",
    "published_at": 1744139213,
    "duration": 602,
    "transcript_chunks": [
        {
            "text": "Hades 2 will be a Nintendo Switch 2 console exclusive at launch. Um, well, Nintendo Switch console exclusive, right? Nintendo Switch 2 and Nintendo Switch console. Yeah, Nintendo Switch family of consoles. Family of consoles. Uh, Hades 2 will be a Switch 2 console exclusive at launch. And a new Creators Voice video developer Super Giant confirmed that the game, which is also planned for other consoles, will first come to Nintendo Switch. The roglike sequel, which has been in early access for some time, will come to Nintendo Switch 2 later this year, but no specific information was provided on launch date. In an update to the story, the Super Giant Games X account has issued a correction now claiming that the game will also launch on the original Nintendo Switch when it comes to version 1.0. I saw this as a headline on the run of show that you made. Yeah. And I was like, surely this can't be correct. Hades is a Nintendo Switch 2 console exclusive at launch. Why? What are we doing here?",
            "start": 0.0
        },
        {
            "text": "I saw this as a headline on the run of show that you made. Yeah. And I was like, surely this can't be correct. Hades is a Nintendo Switch 2 console exclusive at launch. Why? What are we doing here? It's 2025. This is stupid. Is it? Yes. Or is it business? Tim, this is stupid business. I don't like this. I I feel like once the floodgates open of, you released Hades on PlayStation and Xbox. Mhm. Release the sequel everywhere. But it I mean Hades launched on Switch. I know as a console exclusive, but then later came to the other consoles. True. I I did we I just feel like this is this is bad business. Do you think like why do you think this is happening? Do you think this is Nintendo throwing money at their giant? And I think that's silly cuz I Why why would Nintendo do that? Why would Nintendo want Hades 2 as a launch exclusive for their brand new console? I I just don't I don't think that that's I think that the the the the tides have changed and shifted when it comes to this stuff.",
            "start": 40.76
        },
        {
            "text": "want Hades 2 as a launch exclusive for their brand new console? I I just don't I don't think that that's I think that the the the the tides have changed and shifted when it comes to this stuff. Like I I still believe that exclusives are incredibly important and that they matter if they matter to your strategy and ecosystem. Nintendo that's it's paramount to theirs, but we're talking about first party titles. I I feel the exact same way about the um Dusk Bloods. I'm just like specifically because that like there's certain things that I'm like I can argue for the exclusive making sense and then there's ones I'm like no that being a multiplayer title what are we doing get it everywhere give that the best chance of success possible. Hades 2, the fact that Hades 1 did come to the other consoles. I feel like this is like it's not worth the the business. Yeah. I mean I think the context to it I think means a lot to how we receive this cuz I I do think that Hades 2 being announced a year and",
            "start": 93.28
        },
        {
            "text": "I feel like this is like it's not worth the the business. Yeah. I mean I think the context to it I think means a lot to how we receive this cuz I I do think that Hades 2 being announced a year and a half ago, right? Like we've known about Hades 2 for a minute. Many of us have played Hades 2 and early access already. And the the hype cycle for Hades 2 has already begun, right? It's been going on for years at this point. When you then partway through that marketing cycle go, \"Oh, and this is going to launch as an exclusive on a console.\" I think that then makes fans be be like, \"Oh, what the fuck?\" Like, I'm a PlayStation guy or I'm an Xbox guy and I'm a big Hades fan and you're telling me you're not going to launch my console because Nintendo gave you money or whatever it is, right? Like I think that's where the salt starts to starts to set in a bit. I think maybe I'd feel different about it if like Hades 2 was first announced at this Nintendo Direct and they were like, \"Yo, we got the",
            "start": 139.6
        },
        {
            "text": "think that's where the salt starts to starts to set in a bit. I think maybe I'd feel different about it if like Hades 2 was first announced at this Nintendo Direct and they were like, \"Yo, we got the deal. We're got like we're making this happen or whatever and this was the first we're hearing about it 2 situation.\" Yeah. It would still be the same on paper kind of, right? But like I think the way you present it, it almost feels more like you're taking something away from the Xbox players and the PlayStation players as opposed to being like, \"Oh no, Nintendo is part of the big push for this new game that just got announced and all this uh all this stuff.\" This episode is brought to you by BetterHelp. We all know that therapy can feel like a lofty investment, but we also know that there's nothing better to invest in than yourself. The state of your mind is just as important as for physical health. Let's talk numbers. Traditional in-person therapy can cost anywhere from 100 to 250 per",
            "start": 178.72
        },
        {
            "text": "nothing better to invest in than yourself. The state of your mind is just as important as for physical health. Let's talk numbers. Traditional in-person therapy can cost anywhere from 100 to 250 per session, which adds up fast. But with BetterHelp online therapy, you can save on average up to 50% per session. Therapy should feel accessible, not like a luxury. With BetterHel, you pay a flat fee for weekly sessions, saving you big on cost and on time. Some of my best friends use BetterHelp and love how helpful it can be for learning positive coping skills and how to set boundaries. It empowers you to be the best version of yourself. And it isn't just for those who've experienced major trauma. If you're thinking of starting therapy, give BetterHelp a try. It's entirely online, designed to be convenient, flexible, and suited to your schedule. Your well-being is worth it. Visit betterhelp.com/kindfunn to get 10% off your first month. That's betterhelp. Ep.com/kindafoney.",
            "start": 218.08
        },
        {
            "text": "designed to be convenient, flexible, and suited to your schedule. Your well-being is worth it. Visit betterhelp.com/kindfunn to get 10% off your first month. That's betterhelp. Ep.com/kindafoney. betterhelp.com/kindafoney. I think for me I I'm I I feel like a bit um I guess on both sides with it where Hades 2 is going to come to Xbox and PlayStation probably what a year after it launches on Switch. Let's say sometime next year since they're saying 2025 uh for Hades 2. So I think that gives me a bit of like all right, we'll see it. I also I also I shouldn't assume anything, right? Cuz assumptions make an ass out of you and me, but um I assume there's going to be some kind of cross safe system. I assume you're going to be able to keep your progression cuz uh Hades on Switch One had the cross between PC and and and Switch. Um and so like I don't know, for me it's rough, but I do kind of view it in the same way as Dust Dust Bloods of like, all right, cool. Like Nintendo got one. If I'm if",
            "start": 262.24
        },
        {
            "text": "between PC and and and Switch. Um and so like I don't know, for me it's rough, but I do kind of view it in the same way as Dust Dust Bloods of like, all right, cool. Like Nintendo got one. If I'm if I'm head of Nintendo, if I'm making business decisions at Nintendo and I see the opportunity to make Hades 2 an exclusive, I'm spending that money. I'm doing I I truly don't think it benefits Nintendo. Like maybe it benefits Super Giant because Nintendo paid them. Cool. I'm like, \"Get that bag, Super Giant. You're [ __ ] amazing. You make amazing art, so get that money for sure.\" But I don't think that there's any world in which this causes it to sell more copies on Nintendo than it would by a dramatic effect than if it was on other consoles. Then it's just like then you're just going to make the money in more places. Like we were talking about what potentially is going to be a what is expected to be a game of the year contender. Yeah. You know what I mean? I mean, do we say the same thing",
            "start": 311.84
        },
        {
            "text": "money in more places. Like we were talking about what potentially is going to be a what is expected to be a game of the year contender. Yeah. You know what I mean? I mean, do we say the same thing for Delta Rune? because Delta and this might be a you're wrong, right? Is Delta Rune coming to PlayStation and Xbox um at launch. I don't know. That might be one for chat because I I I see it as you're right that I think this alone doesn't necessarily move the needle of getting switches selling Switch twos, but I think it's the compounding effect ones though as well. And switch ones as well, right? But I think it's the compounding effect of all right, we have Donkey Kong, we have Mario Kart, we have XYZ Nintendo the Nintendo game, but we also have Hades 2 and we also have Dust Bloods and we also have Delta Rune, right? Like I think when you start to like build this case of what Switch One was at the beginning of the Switch generation, which was like, okay, it's the Nintendo machine, but then",
            "start": 353.92
        },
        {
            "text": "have Delta Rune, right? Like I think when you start to like build this case of what Switch One was at the beginning of the Switch generation, which was like, okay, it's the Nintendo machine, but then also it's the best place to play indies. Like this is the indie machine. I think that's an identity that I could see Nintendo trying to reclaim a bit for the titles that you already do associate a bit with Nintendo. I think Delta Rune uh for the previous chapters when it came to console were were coming to Nintendo at first. Again, this is a you're wrong for chat. Um but yeah, Hades is the same thing. From Software is new to Nintendo, but it's like I think because it's not a sequel, it is kind of it is this new IP that From Software has, it doesn't feel as crazy. I I'm only saying that from the multiplayer front when it comes to Dust Blood. If if it was just a single player from software game exclusive to Nintendo, I get that. That is trying to sell systems. That is worth it to Nintendo",
            "start": 392.88
        },
        {
            "text": "the multiplayer front when it comes to Dust Blood. If if it was just a single player from software game exclusive to Nintendo, I get that. That is trying to sell systems. That is worth it to Nintendo to pay because they're like we are trying to get the from software fans to buy a Switch 2 to play this game. Hades doesn't have that. That's fair. It just doesn't have that. Like you don't think the Hades fans are going to like this is going to You don't think this isn't going to move Hades fans to buy Nintendo Switch? No, I don't. I really don't because I think the Hades fans like that type of Hades fan, they're either already have the Switch one, they can just play it there or more likely they'll play it on PC, which I imagine that's the majority of people playing Hades is on PC to some extent, right? Yeah. I don't know. I think that this is a blunder. It's random as hell. This is one that I This is one where Yeah. waking up to this news this morning, I did go, \"Oh, really?\" Like that's",
            "start": 433.12
        },
        {
            "text": "right? Yeah. I don't know. I think that this is a blunder. It's random as hell. This is one that I This is one where Yeah. waking up to this news this morning, I did go, \"Oh, really?\" Like that's how we're doing this. All right, cool. Like I mean, my bigger thing is like I think that this this is shitty. This sucks. Like I I'm shocked at how much the chat's not on my side about this because people get so up in arms about exclusivism stuff. This is a perfect example of a game that does not need to be exclusive anywhere. Yeah. It should be playable [ __ ] everywhere. If you're your Netflix account gets you Hades on a mobile device, like what are we why are we gatekeeping this? I mean that I agree with, right? That's that's I think overall for the gaming audience like for the audience side, this sucks. This sucks. If you're a Hades fan that discovered it through Xbox on Game Pass or something, or you discovered it through PlayStation, or yeah, if you played it on Netflix on your phone,",
            "start": 466.56
        },
        {
            "text": "this sucks. This sucks. If you're a Hades fan that discovered it through Xbox on Game Pass or something, or you discovered it through PlayStation, or yeah, if you played it on Netflix on your phone, it's like, wait, why are we limiting limiting this to just one console at launch? Like, it's like, let's look at it from three different perspectives. One is from the perspective of the gamers. This sucks. Yes. Hard stop. One is from the perspective of Super Giant. I think they'd make I don't know the amount of money Nintendo paid for this. don't think it's uh going to be an amount that makes up for the potential sales otherwise that you would get with that big everyone's playing this game and buying this game and talking about this game. Again, we're talking about Hades 2, we're talking about a known quantity. It's not like a h maybe it's good. So, it's like I I think that there's some question there about like the money aspect. And then there's the side of Nintendo. Yeah, sure it's good",
            "start": 508.32
        },
        {
            "text": "a known quantity. It's not like a h maybe it's good. So, it's like I I think that there's some question there about like the money aspect. And then there's the side of Nintendo. Yeah, sure it's good for Nintendo. Of course, anything to sell the Switch to. Yes, it's a good move for Nintendo in that way because they have more exclusives and more things to push. But when you look at all that, I feel like in 2025 with how excl this landscape of video games, this sucks. Do you think for Super Giant it could be a thing as well of there's still an indie team and so for them like slow rolling out to one console at a time is is maybe easier for them as opposed to like trying to launch everywhere cuz that's what the Switch one I don't buy it though. Think of how much money they have at this point. Oh, they have a lot of money. They have a lot of money. They have a lot of money. Yeah, that's true. But it's like cool. Like I don't know. There's there's something here of just like we can we can",
            "start": 544.88
        },
        {
            "text": "Oh, they have a lot of money. They have a lot of money. They have a lot of money. Yeah, that's true. But it's like cool. Like I don't know. There's there's something here of just like we can we can like play the game of like imagining where the money goes and all stuff, but like let's just [ __ ] be real. They could do it if they want. If they really wanted to push for all consoles, they for sure could do",
            "start": 584.72
        }
    ]
}