{
    "id": 13828,
    "video_id": "E_wXPoy9qr4",
    "show_name": "Gamescast",
    "hosts": [
        "Tim Gettys",
        "Blessing Adeoye Jr."
    ],
    "title": "We Played Metroid Prime 4 Beyond on Nintendo Switch 2!",
    "description": "Tim Gettys and Blessing Adeoye Played Metroid Prime 4 Beyond!\n\n\nWishlist Lost Skies today: https://kindafunny.com/lostskies\nWishlist Monaco 2 today:\nhttp://kindafunny.com/monaco2\nGo to http://rocketmoney.com/kindafunny to cancel your unwanted subscriptions with Rocket Money.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1743685231,
    "duration": 1158,
    "transcript_chunks": [
        {
            "text": "[Music] We played Metroid Prime 4 Beyond. Can you believe it, Blessing? I still can't believe it. It's kind of unreal. Yeah. after almost a decade. I'll never forget sitting at the old studio space in the Nintendo Direct and all of a sudden the four starts coming in and it's or no no it was the the Samus logo the S and it starts coming in and it was like oh my god oh my god it's happening and then the four and it was like oh my god oh my god we're about to play Metroid Prime 4 on the Nintendo Switch and then it caught really bad um situations right had a re had a restart development a long wait long wait and I remember when the debut happened like I was popping popping off like, \"Oh my god, it's Metroid. Oh my god, it's Prime 4. Oh my god, it's going to be retro. Oh, it's not retro.\" Huh. Hm. Who's it going to be? That's kind of weird. Um, and then after all, did you ever learn who it was? I don't think so. I don't think so. Uh, but we know who it is now. It's retro. Let's just go back",
            "start": 0.07
        },
        {
            "text": "Who's it going to be? That's kind of weird. Um, and then after all, did you ever learn who it was? I don't think so. I don't think so. Uh, but we know who it is now. It's retro. Let's just go back to what works. Of course, I'm Tim Getty's. This is Blessing Adi Jr. Hello, it's me. We've been playing Nintendo Switch 2 games all day. Uh, we're giving you all of our hardware impressions, software impressions, everything in between. If you want to hear us talk about Mario Kart Worlds, you can do that. If you want us to talk our If you want to hear us talk about our very first time holding the system and all of that, you can do that. And of course, you can also check out Donkey Kong Bonanza. Right. I got it right. Finally. Finally. You put some respect on it. Um, Roger, do Bandai Namco. Bandai Namco. We're involved in that. Man, they're hands everything. Super Smash Brothers, all that, too. Yeah. Except Paton like Wars Remastered. Interesting stuff. Uh yeah, it's true. It's true. Anyways,",
            "start": 51.28
        },
        {
            "text": "Namco. We're involved in that. Man, they're hands everything. Super Smash Brothers, all that, too. Yeah. Except Paton like Wars Remastered. Interesting stuff. Uh yeah, it's true. It's true. Anyways, we've got to play Metroid Prime 4 Beyond. Um and I want to hear all of your thoughts on this, Bless. Yeah. Oh, this is a fascinating one. My Okay, first off, even though this demo was probably the same length as the other demos we got to do, somehow not long enough of a demo for this game, I needed more time with this, right? Like, it felt real quick. like we got to do a whole section and then we did a we ended with a boss fight and once I finished it I was like oh that's it that's all. And so like I my impressions feel light even though I'm sure as we talk about it we're going to get deep. Um I think first thing to point out is that uh the setup that we played we got to play with uh the Joy-Con as a mouse. Uh and the dope thing about it is it's very seamless of you can play with the mouse",
            "start": 93.28
        },
        {
            "text": "I think first thing to point out is that uh the setup that we played we got to play with uh the Joy-Con as a mouse. Uh and the dope thing about it is it's very seamless of you can play with the mouse functionality and if you pick it up you can play with the two JoyCons, right? It is that seamless. It's not a button that you press. It's not a setting. you pick it up and start controlling and you then play with the two Joy-Cons. So, I was going kind of back and forth with that. Uh, playing this game with the mouse functionality, extremely smooth. Uh, and that part of that is the 120 fps. 120 frames per second in 1080p. Uh, it still looked great. We're playing on the TV. That was the only way we were allowed to play this. We couldn't play it in handhelds. We couldn't play it in 4K and any of that stuff, even though they're saying it's 4K 60. Um, and I mean, I was incredibly impressed. I felt the 120 frames. What about you? Yeah. No, for sure. Like this thing felt smooth as hell,",
            "start": 140.0
        },
        {
            "text": "any of that stuff, even though they're saying it's 4K 60. Um, and I mean, I was incredibly impressed. I felt the 120 frames. What about you? Yeah. No, for sure. Like this thing felt smooth as hell, especially playing with the mouse mode, right? Like that was the thing that blew me away. But honestly, even before getting to gameplay, the cut scenes that we saw blew me away as well, just in terms of the visual fidelity of it. I was looking at I was like, \"Wow, this is next Nintendo gen right here. Like this is the you know what I mean?\" And we were playing on Switch too. Uh but yeah, it's it's it's funny. But uh visually to me it it's very interesting because you compare this. I saw a lot of people after the direct last week uh comparing Metroid Prime 4 gameplay to Halo 4 gameplay. Uh and Halo 4 just looks way better. Yeah. But it doesn't because the art style. There's just there's something about this style that like there they if it ain't broke, don't fix it. And I think that they",
            "start": 176.24
        },
        {
            "text": "Halo 4 just looks way better. Yeah. But it doesn't because the art style. There's just there's something about this style that like there they if it ain't broke, don't fix it. And I think that they kind of just really nailed what they had to with this visually. Yes. And so that's my thing is once you get into gameplay, it is 1000,000% Metroid Prime. And that is I think the best thing, right? As somebody who played Metroid Prime Remastered a couple years ago for the first time and was blown away by it. This felt like getting back to form, right? Um, you know, it was the I that's it's tough to talk about like the level experience that we had cuz it really was a hey, here's how to play Metroid real quick. You know what I mean? Hey, shoot the door to open the door. We essentially got to play what we've seen in the Metroid Prime uh trailers like in in the specifically that uh and it was kind of a tutorial section as well. Exactly. And I don't think I learned much of like things that",
            "start": 220.08
        },
        {
            "text": "play what we've seen in the Metroid Prime uh trailers like in in the specifically that uh and it was kind of a tutorial section as well. Exactly. And I don't think I learned much of like things that haven't been in other Metroids. Uh they give you like it was a mouse mode tutorial. You know what I mean? Honestly, it did feel kind of that way. I will say they give you the things that you want to have pretty quickly, right, of like, all right, morph into get into the morph ball. All right, here's how you drop a bomb. All right, here's how you shoot a door. All right, here's how you scan and all that stuff, right? So, they give you that stuff pretty quickly to to uh introduce it and then you get into the boss fight and they do put you to the test. Um, but in all of that, it just felt right. And that was both in mouse mode, which we can talk about in a second, but then also playing on JoyCons, right? the control scheme is what you expect it to be and it just felt right. It felt like",
            "start": 262.08
        },
        {
            "text": "And that was both in mouse mode, which we can talk about in a second, but then also playing on JoyCons, right? the control scheme is what you expect it to be and it just felt right. It felt like Metroid. Mouse mode was an interesting thing. One, because it did feel right, but also, we talked about this in uh the hardware impressions, broke my brain as far as All right, so I'm pressing the buttons while I'm in mouse mode. I'm pressing the A to jump on the right Joy-Con, even though I'm I have it being held sideways. No, you know what? In the hardware conversation, we were asking if the mouse uh stuff switched controls. It did because uh it switches it so that jump is on your left trigger now. You can use your left hand to jump. You could also do other things, but like it did add functionality to jump a different way. Yes. Okay. Um but even still, right, like I had the thing every now and then of even though I'm in mouse mode, I'm using the right analog stick and the right analog stick",
            "start": 293.04
        },
        {
            "text": "to jump a different way. Yes. Okay. Um but even still, right, like I had the thing every now and then of even though I'm in mouse mode, I'm using the right analog stick and the right analog stick doesn't work in mouse mode, right? And so it's a weird thing to get used to though over the course of however long like I'm sure it's going to be a pretty quick process to get used to it. I think that if you just commit to one of the control styles, it's going to work and make sense. And I think the mouse mode is a very legitimate way to play. If you're looking at this and you want to play with mouse and I keep want to say mouse, keyboard, but mouse and left Joy-Con, I think it's a very legitimate way to play. The dream, some would say. You know what I mean? For years, I've been trying to pioneer this experience and now we finally have it. Not exactly how I want it. I was saying this the hardware thing. I don't love how the Joy-Con feels as a mouse, just where the buttons are placed. At the",
            "start": 334.96
        },
        {
            "text": "this experience and now we finally have it. Not exactly how I want it. I was saying this the hardware thing. I don't love how the Joy-Con feels as a mouse, just where the buttons are placed. At the end of the day, there's an analog stick just jutting out in the way of your hand, right? Uh and it's very hard to not hit that uh when you're you're just playing the game naturally holding a and that's the thing, too, is like you put a mouse down and the mouse just stays where it is. You put the Joy-Con down, it might fall over, you know what I mean? You kind of need to like keep your hand locked there and it's a little just different. Maybe people get used to it. I don't see myself playing this way. Having said that, playing this way is pretty awesome. Like the uh it the it feels amazing. the 120 frames per second with the mouse, you're moving around. It is pinpoint accurate. And it was like, man, I don't know that I need this for a Metroid game. But having it kind of opens up a lot of",
            "start": 371.68
        },
        {
            "text": "120 frames per second with the mouse, you're moving around. It is pinpoint accurate. And it was like, man, I don't know that I need this for a Metroid game. But having it kind of opens up a lot of opportunities. There's a lot of doors we would get to that, you know, it's tutorial. You kind of go to the door, you scan it, and then like four different like color circles point pop up, and you need to like shoot each one to open the door. And I was like, I'm going to do this with mouse mode. I think that'll be fun. And it kind of was fun. I think it kind of added to the experience there. simple little thing, tutorial mode, but I was like, \"This feels good.\" My nitpick with Metroid Prime specifically out of all the first person shooters, right, Metroid Prime 4 with mouse mode is um Metroid Prime has that lock on function. Yep. And so you lock on and bullets will automatically like fly to the enemies that you're fighting. But like I don't know, there's something about it that feels weird",
            "start": 405.92
        },
        {
            "text": "has that lock on function. Yep. And so you lock on and bullets will automatically like fly to the enemies that you're fighting. But like I don't know, there's something about it that feels weird with the mouse precision, but I almost I don't really need the mouse precision. Exactly. Because I am locked on. So that's the one thing where I think that is really what broke my brain. It was the fact that I wanted to press the buttons, but then also like that lock on feels a little bit weird with the mouse. And again, that is the the brain breaking situation, but I also found uh once I like pushed through that, I found some opportunities to do some pretty interesting gameplay stuff with that where I'm like I was kind of impressed with the amount of enemies that were in an area at once and how big the area would be. So, I'd lock on to one enemy on the top left and I'm like I I do a like charge a shot, shoot it, and then whip the mouse over cuz I knew there was another enemy on like the",
            "start": 442.16
        },
        {
            "text": "how big the area would be. So, I'd lock on to one enemy on the top left and I'm like I I do a like charge a shot, shoot it, and then whip the mouse over cuz I knew there was another enemy on like the bottom right and was able to just get to him fast, pinpoint it, and then lock onto him. And it just felt a lot faster and quicker than using an analog stick to do it. Um, and then being able to like lock on so it kind of like pulled it to him. It felt really badass, you know what I mean? Which I I I think is uh pretty pretty legit because like that's another great thing about especially early Metroid. It's that power fantasy of I'm super powered up. I have all the things. Let's go before it's probably taken all away from you. But speaking of taking things away from you, I'm taking this conversation away from you until we get through a word from our sponsors. This episode's brought to you by Lost Skies. What would you do if you woke up and the world around you was now floating high in the",
            "start": 481.2
        },
        {
            "text": "away from you until we get through a word from our sponsors. This episode's brought to you by Lost Skies. What would you do if you woke up and the world around you was now floating high in the clouds? Lost Skies is the new openw world survival like that puts the power of exploration and choice in your hands. Use the physics-based grappling hook, glider, and your own custom airship to traverse the remains of this fractured world and uncover its mysteries. You and up to five friends will harness the power of ancient technology to survive the hostile islands that scatter the horizon and the threats that lurk in the sky itself. The battles are intense, so it's up to you to build a sky ship to shelter you in fierce storms and take the battle to gigantic monsters. Want to take a break from fighting in the skies? Use the intuitive island creator and share your builds with the community. Head over to Steam and Wishlist Lost Skies today and discover what's lurking beyond the horizon. This",
            "start": 520.32
        },
        {
            "text": "fighting in the skies? Use the intuitive island creator and share your builds with the community. Head over to Steam and Wishlist Lost Skies today and discover what's lurking beyond the horizon. This episode's brought to you by Monaco 2. Gather your crew, plan your heist, and let the chaos unfold in Monaco 2. Return to Monaco, a city teameming with excellent scores and gullible marks right for getting parted from their prized possessions. Go it alone or tackle heist as a team of four with online and local co-op. Just remember, even the best laid plans can blow up in your face, so you'll have to stay on your toes. Monaco 2 is the sequel to the cult classic Monaco. What's yours is mine that expands on every aspect of the game. New characters bring unique abilities and play styles to help you escape the heat. And with new modes and procedurally generated levels, every run is full of surprises. The heist is on when Monaco 2 arrives on Steam, Xbox, and PlayStation on April 10th. Y'all know",
            "start": 565.68
        },
        {
            "text": "escape the heat. And with new modes and procedurally generated levels, every run is full of surprises. The heist is on when Monaco 2 arrives on Steam, Xbox, and PlayStation on April 10th. Y'all know how important it is to wishlist these games. It helps the developers so much. So, please wishlist Lost Skies and Monaco 2. This episode is brought to you by Rocket Money. You sign up for something, forget about it after the trial period ends, and then you're charged month after month after month. The subscriptions are there, but you're not using them. In fact, 85% of people have at least one paid subscription going unused each month. Thanks to Rocket Money, you can see all of your subscriptions in one place and cancel the ones you're not using anymore and save more money. Rocket Money has helped multiple members of Kind of Funny learn that they're still paying for things they totally didn't even realize. You know who I'm talking about. Rocket Money is a personal finance app that helps find",
            "start": 612.16
        },
        {
            "text": "multiple members of Kind of Funny learn that they're still paying for things they totally didn't even realize. You know who I'm talking about. Rocket Money is a personal finance app that helps find and cancel your unwanted subscriptions, monitors your spending, and helps lower your bills so you can grow your savings. Rocket Money has over 5 million users, and has saved a total of 500 million in canceled subscriptions, saving members up to $740 a year when using all the apps premium features. Cancel your unwanted subscriptions, and reach your financial goals faster with RocketMoney. Go to rocketmoney.com/kindfunnday. That's rocketmoney.comkindfunn. Where do you want to go from here? Uh, I want to shout out the fact that of course this is Metroid Prime 4 beyond. Uh, and you talk about that original reveal trailer where you got the Samus logo and then you get like, oh man, this is Metroid Prime. They're they're calling it four. Like this is the fourth game. For me, coming in as somebody",
            "start": 660.24
        },
        {
            "text": "original reveal trailer where you got the Samus logo and then you get like, oh man, this is Metroid Prime. They're they're calling it four. Like this is the fourth game. For me, coming in as somebody who's only played through Metroid Prime 1, I was interested to see that, oh, this really is a follow-up. This is a sequel. There's a character that shows up where the demo the demo guy looks at me. He's like and I'm like I don't know who that is. And your boy is like now here's the thing. Real talk. Do you need to know? Probably not. And honestly something I'm really excited about. Like yes, this is private. Yes, there is story stuff. Obviously it makes it better to know play the other games. They're fantastic games. You should play them if Nintendo would put them out again. Who knows? Um, but what I think is really cool about this is the amount of cut scenes and is the amount of like yes, it's Metroid Prime and that's what we wanted. That's a it's a great thing. I I know a lot of people",
            "start": 708.48
        },
        {
            "text": "what I think is really cool about this is the amount of cut scenes and is the amount of like yes, it's Metroid Prime and that's what we wanted. That's a it's a great thing. I I know a lot of people I want the most innovative game in the world and sure that'd be cool, but I think they're just getting another Metroid Prime now. Fingers crossed if it's as good as I think this is going to be will hopefully be the highest selling Metroid game and hopefully convince people and hopefully, you know, blah blah blah. But I do think there's a level of polish of, hey, there's a story here and the cut scenes and the characters talking and just like you kind of have a squad with you in the beginning of this and the appearance of that. Did that get you hyped of like, oh, we're going to get a Metroid Prime game that actually has a little bit of a story? I think it for me it was the thing of good for you guys that like we're able to follow along with Metroid Prime like have played all the Metroid",
            "start": 746.64
        },
        {
            "text": "Prime game that actually has a little bit of a story? I think it for me it was the thing of good for you guys that like we're able to follow along with Metroid Prime like have played all the Metroid Primes, right? And like know what's going on here. And I think I'm excited for yeah the idea of like okay, where does this go? What's going on here? and all that stuff. But I don't know. Like now I'm like, \"Okay, I might watch a quick recap or something.\" Yeah. Yeah. Maybe maybe that's it's interesting cuz like to me it's and having played them, I don't really think that this is like a oh man like you need to know everything to keep going. It just to me is like oh they're trying to tell a story here, you know? And I think they'll tell you everything you need to know. And well my my thing is having only played Prime 1 that is very story light. Yeah. It's very story light and like to the point where we start off this one I'm like oh other people like oh there's an army like shit's going on",
            "start": 783.68
        },
        {
            "text": "only played Prime 1 that is very story light. Yeah. It's very story light and like to the point where we start off this one I'm like oh other people like oh there's an army like shit's going on here. I but I look at it more so as like, oh, they're feeding the fans. Like they're giving people like for it's been so long since a Metroid Prime, right? That like I could see the idea of people being like, oh, they're probably going to reboot. Oh, they're probably going to like forget about all this right? No. Hey, here's returning character that I don't know, but I'm sure Tim Gettys gets hyped about. For me, that's exciting just for the fact that fact of oh, they're staying true to what this is. And yeah, like I'm I'm hoping that it hits for me, but I didn't necessarily get from this that I'm like I'm not invested in the story yet is what I'll say. Yeah. Yeah. And I I I'm all over the place with this. I'm excited like for the the feeding the fans and all of that. I'm more excited that I",
            "start": 818.72
        },
        {
            "text": "like I'm not invested in the story yet is what I'll say. Yeah. Yeah. And I I I'm all over the place with this. I'm excited like for the the feeding the fans and all of that. I'm more excited that I think that the they're what from what I experienced this, I think they're going to make this game a little bit more digestible for more people. Like I think just having like it's still atmospheric as hell. It's still it's still Metroid, right? But having just that little bit of story bit, like I think the comparisons to Halo aren't just like oh the visuals and stuff. It's like the fact that it seems to be like we're getting like a Halo campaign, like an old school Halo campaign style single player here mixed with all of the Metroid Prime trappings. I think that that could like really make a lot of people happy whether they've played a Metroid Prime before or not. Um, and from playing this demo that my suspicions seem to be confirmed. Yeah. Uh, we got to talk about that boss fight. We got to",
            "start": 854.96
        },
        {
            "text": "of people happy whether they've played a Metroid Prime before or not. Um, and from playing this demo that my suspicions seem to be confirmed. Yeah. Uh, we got to talk about that boss fight. We got to talk about the boss fight. They cook. They cook. That was a fun one. It was fun, man. I I really enjoyed uh that that was when I decided I'm going to go full mouse mode um kind to see if I can like get used to it and like what my impressions were and I'm happy I did because that's when I re realized like oh there's something cool here and the boss fight uh it was like this big old dude with like kind of these like energy shields on both of his arms so like blocking a lot. You have to wait for the the right weak spots to pop up and like shoot him and you know then a big weak spot opens like classic video game boss stuff, right? But what was cool about it is he would shoot this like energy beam at you kind of like Star Wars Episode 1, Darth Maul and Obi-Wan, you know what I mean? Like that",
            "start": 892.72
        },
        {
            "text": "video game boss stuff, right? But what was cool about it is he would shoot this like energy beam at you kind of like Star Wars Episode 1, Darth Maul and Obi-Wan, you know what I mean? Like that type of thing. Um, but it shoots it at you and you need to like um jump over it, right? And at first it's just like oh the ground. So you jump the ground, but then eventually it's a lot bigger. It's like a fence coming at you. You have to jump over it, but then eventually they start coming at you and you have to turn it into a morph ball underneath. And I'm like, oh man. Like that's what I'm talking about. This is Metroid baby. This early in the game too, I'm like, oh man. Like I I like the different phases. I I liked how Yeah. Like they have you doing different things, right? Like you're shooting the different You start off shooting these different orbs that he has on him and once you get the orbs down, right? Like his big weak spot opens up and you shoot that. But like he might he had the um",
            "start": 931.04
        },
        {
            "text": "the different You start off shooting these different orbs that he has on him and once you get the orbs down, right? Like his big weak spot opens up and you shoot that. But like he might he had the um the energy shields that he has on his arm will like block certain orbs and stuff and I'm like this is classic right here. This is some classic game design right here. But then yeah, you get into the thing where he's throwing the big energy shield at you and yeah, you're hopping over it. You're going to the morph ball. You're dodging all around. And then also like uh I like that ear this early on. Assuming that it's early on, right? like it feels early on in the game. I don't think they actually said that this is the beginning or not. No seem like it kind of seems like I can see like a cut scene to set it up and then boom, you're into this and then title screen and then maybe it slows down. Yeah, they didn't set up where we're at in the game, but it feels early, right? So like but being at",
            "start": 966.72
        },
        {
            "text": "to set it up and then boom, you're into this and then title screen and then maybe it slows down. Yeah, they didn't set up where we're at in the game, but it feels early, right? So like but being at this part of the game and it already being the thing of all right, missiles, uh blast, charge up this blast, boom, charge up my blast to collect the collectibles that are on the ground real quick and then point and like I'm functioning on that level in a way where I'm like this is good. like they they nailed this first boss fight. Scan this thing, go up, now you're in the vents, you're in the morph ball. It just feels like like home, but it also it like you keep saying classic and oh man, it feels classic. And and I mean, you know, Metroid Prime is now an old game. 25 years old, something like that. 24 maybe. Like that is uh incredibly dating me. Um but we're talking about one of the best games of all time. And like yeah, sure old game is old, but I think old game can be new. I I think that",
            "start": 998.88
        },
        {
            "text": "24 maybe. Like that is uh incredibly dating me. Um but we're talking about one of the best games of all time. And like yeah, sure old game is old, but I think old game can be new. I I think that Metroid Prime 4 Beyond right now like has the potential to be that. I I don't think it's going to change the minds of people that are going into this of like first person shooters aren't this. Metroid Prime, I've been fighting this fight for 25 years. Nintendo fans, Metroid fans, people like like, \"Oh, why would you play this? There's Halo right there.\" It's like, it's not a first-p person shooter. It's a first person adventure. There's puzzle, there's combat, there's so many different elements to it. It's a Metroid vania but in 3D first person. Yeah. And we haven't got to touch the psychic abilities. We haven't got to there's so much we don't know. So, uh you said it earlier. It's like there's not much to break down here. Uh because like the devil wasn't that long, but everything we got I was",
            "start": 1036.48
        },
        {
            "text": "We haven't got to there's so much we don't know. So, uh you said it earlier. It's like there's not much to break down here. Uh because like the devil wasn't that long, but everything we got I was like it gave me faith. I mean I already had faith before but I guess this reassured that faith. Playing through this I'm like okay this is what ex this is exactly what you want it to be. It's exactly what we think it's going to be. And that couldn't excite me more right? Like, you know, you you make the reference to old game is old, but also old game is good. As somebody who played that old game two years ago, old game is still good. Old game is fire, actually. And I mean, you know, after almost 10 years since they announced this, it's so nice that we know when it's coming. It's so nice that we have a release date for this game. And I know when I'm going to be playing it. He lied. We don't have a release date for this game. Why don't we? And I get we can't have all the answers at once, but",
            "start": 1081.44
        },
        {
            "text": "have a release date for this game. And I know when I'm going to be playing it. He lied. We don't have a release date for this game. Why don't we? And I get we can't have all the answers at once, but like I will also say on that I'm very happy it's not at launch because I really really really didn't want Nintendo to put this game out to die. Um especially after this long. And I think putting it out with my Mario Kart as well as the biggest suite of third party titles ever. Uh first time CD Project Red's ever been at a a console launch period. Like stay out of the way. Stay out of the way. Let Metroid have its moment. Metroid Prime 4 Beyond so far deserves its moment 1000%. Till next time. Love you all. Goodbye, Bonanza.",
            "start": 1119.04
        }
    ]
}