{
    "id": 14004,
    "video_id": "JnoHJVw2wHY",
    "show_name": "Gameplay",
    "hosts": [
        "Nick Scarpino",
        "Mike Howard"
    ],
    "title": "We Let Someone Guide Us In Escape from Tarkov! (Day 2)",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page - https://store.steampowered.com/app/1377700/Empyreal/ \nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1746046476,
    "duration": 9311,
    "transcript_chunks": [
        {
            "text": "two. Yo, what the heck is going on kind of funny best friends? It's your guy Snow Bike Mike coming back to you live here for another kind of funny games afternoon stream. It's a mixup. You don't get kind of funny games cast after your normal kind of funny games daily. Today you get me and Nick and Bear running in the ones and twos for just a little bit playing some more games for your enjoyment until we go live for this afternoon's Borderlands 4 presentation with that will be happening 2:00 p.m. West Coast best coast time 1:45 for the pre-show and beyond beyond. So you can check that out. We're going to have some a whole lot of fun with all that. But I'm here to get you hanging, get you comfortable, and get you through the workday or the school day with your friends over at Kind of Funny. Today is a good day. We are back for more Escape from Taroff. As you know, this week is dedicated to me and Nick going from total noobs to probably just beginners. But like, we're going to become pros",
            "start": 6.4
        },
        {
            "text": "is a good day. We are back for more Escape from Taroff. As you know, this week is dedicated to me and Nick going from total noobs to probably just beginners. But like, we're going to become pros at this by the end of the week. And I'm very very excited to jump in and have some fun with Nick and all of you because yesterday it was a battle. But last night, last night, shout out to the kind of funny community, shout outs to the best friends, and shout out to Bacon. Bacon came on and gave me the full-on crash course run through of Escape from Tarov. And I'll tell you what, I got gear, I got guns, and I got the knowledge now. So, I'm very, very excited to have some fun. But of course, before we do that, Nick Scarpino is currently working with the contractor to check out our gate right now for the parking lot. So, I get to buy some time with all of you and chat it up with each and every one of you. So, let's say hello to the YouTube chat. Hi, YouTube. Are you awake? How are you? JG,",
            "start": 52.08
        },
        {
            "text": "for the parking lot. So, I get to buy some time with all of you and chat it up with each and every one of you. So, let's say hello to the YouTube chat. Hi, YouTube. Are you awake? How are you? JG, Victor, Hannie, of course, welcome me. Great to see you all. Victor wants to know, did anyone else get an Arc Raider code? I have Arc Raiders booted up here and on Andy's PC. uh just in case we want to end today's stream with some Arc Raiders gameplay for your enjoyment, but we'll see how it goes. Over on Twitch, of course, hello to Reverend Cam Abbott. Uh we have the zombie in the building, the Omega Nerd, Super Loop. Shout to Super Loop. Super Loop, I saw you out there. Thank you for the love and the support. Uh chat is ask Mike, when will you upload the Final Fantasy X2 VODs? Yeah, you know, I'm slacking on that. We'll put them up eventually. We'll get them up eventually. If you didn't know, I'm currently playing Final Fantasy X2, aka 10 2, and I'm loving it. So, that's been a whole lot",
            "start": 102.72
        },
        {
            "text": "I'm slacking on that. We'll put them up eventually. We'll get them up eventually. If you didn't know, I'm currently playing Final Fantasy X2, aka 10 2, and I'm loving it. So, that's been a whole lot of fun to jump back into that. Um, there's a lot of games, a lot of great games, and May is only going to get a little bit crazier with the games. Doom, the Dark Ages, of course, you got Elder Ring Night Re. It's going to be a really good time. So, uh, or I should say May, but yeah, we're gonna just play a bunch of video games together and have some fun. Uh, before we get into it, Chad, who's, uh, who's jazzed up about Borderlands 4? Are we excited for that one? Mike, have you played Expedition 33? Handy, I have. I played the first hour of Expedition 33. I enjoyed it a lot. Uh, I have a lot of other games that I'm currently playing, but I will either play Expedition 33 alone at my desk uh next week after the uh Oblivion review on Friday, or I'll stream it eventually later on in the year,",
            "start": 152.24
        },
        {
            "text": "other games that I'm currently playing, but I will either play Expedition 33 alone at my desk uh next week after the uh Oblivion review on Friday, or I'll stream it eventually later on in the year, but I might just play it by myself. We'll see. I wasn't good at parrying. Uh, and so it kind of got me a little down on myself because I was really bad. Poopy dudy doo doo doo doo. Thank you for the prime gaming sub for two months. Says, \"Yo, Mike, you guys think about doing a scav armies with chat?\" Uh, poopy doo doo doo doo doo. Yeah, I've never done that. I would definitely be down to do that. So, that would be fun. We could possibly do that if you have it downloaded. I like poopy doodoo. I like that. I I'm not mad at that at all. That's right. How did they not get the message with the flop of the movie? Oh [ __ ] Oh, Borderlands. Yeah, I'm excited for Borderlands. It's a big moment. I think Roger said it pretty well. It's gotten a lot of hate recently and uh I'm going to try to open up",
            "start": 202.56
        },
        {
            "text": "of the movie? Oh [ __ ] Oh, Borderlands. Yeah, I'm excited for Borderlands. It's a big moment. I think Roger said it pretty well. It's gotten a lot of hate recently and uh I'm going to try to open up my mind and be on the other side. I think the issue was is Borderlands Barrett since Bear just walked in so I can kind of talk to him and you was Borderlands 4 when they first showed the cinematic reveal kind of teased us with of course this new art design, this new look and it got me thinking of like oh I would be interested in a different vibe of Borderlands and then they went back to the, you know, good old cell shaded vibe. Yeah. I like Borderlands is Borderlands, you know, like I don't I don't really know if the movie uh being a flop is really nobody even thinks about the movie. Yeah. Of like, oh, what what does a Borderlands 4 do today? Um, yeah. I don't know. Borderlands 3 was like a, you know, like we had a nice hookup and I have not thought about Borderlands ever since and I",
            "start": 257.68
        },
        {
            "text": "Of like, oh, what what does a Borderlands 4 do today? Um, yeah. I don't know. Borderlands 3 was like a, you know, like we had a nice hookup and I have not thought about Borderlands ever since and I don't think I ever will. Yeah, I will always go back to Borderlands for a fun co-op experience. I love a bunch of guns. I love the zany nature of it, but it is very much a once I play through it, Barrett, I'm never going back to it. Yeah, this isn't a live service game. This isn't I'm going to run it back a second time. So, like for me in particular, similar to what you see a lot with the streams is like if I review this game, I'm never going to play it after the review. Yeah. If we stream it, then that's where I'll play it. But I'm a I'm a one anddone Borderlands man. Okay. Okay. But I'm excited. You know, they've promised a lot of new writers that we know. Um they new vibes. So, hey, if you can bring it, I'm down for that. But, uh, yeah, I don't know. Borderlands be interesting to see",
            "start": 303.04
        },
        {
            "text": "You know, they've promised a lot of new writers that we know. Um they new vibes. So, hey, if you can bring it, I'm down for that. But, uh, yeah, I don't know. Borderlands be interesting to see what they show today to get people excited. Or is it just more Borderlands? And either you like it, you love it, or you hate it. One of the two. But it's still a solid IP. When I think of gaming IPs, I think it's one of the uh, you know, the tippy top up there that's like well known, well, usually wellreceived, and it's got some love. So, I think it will do some good. So, we'll see what happens. Does Kevin Hart show up? Man, you got to you got to give him a lot of money to have Kevin Hart show up on the video game. That's right. We'll see about that. Um Chad, I also received a gift from Xbox. So, thank you to Xbox for sending us this nice little package. Of course, Greg and Blessing showed you this during Kind of Funny Games Daily. We have a special note that says, \"Thank you for continuing to",
            "start": 344.48
        },
        {
            "text": "you to Xbox for sending us this nice little package. Of course, Greg and Blessing showed you this during Kind of Funny Games Daily. We have a special note that says, \"Thank you for continuing to join us on this journey. Whether on console, PC, or cloud, with Xbox, players have the power to choose how and where to play. This is an Xbox campaign represents the promise. Oh [ __ ] This is an Xbox. This controller. This is an Xbox. Why is Mike so big on the camera? I have a new camera. Uh, they've added a new cam. Oh, this is very cool [ __ ] It says this is an Xbox on it, chat. Yeah, we put in a different lens for mic station. Yeah, we have a different lens to try to stop the shaking of the desk uh that you all have seen so much of. And so this lens hopefully will give us a better opportunity to allow my desk to stop shaking as much. But I will say anytime I put my hands on the desk, it shakes no matter what. Uh that's just how it goes cuz it doesn't have four legs. Barrett, it's not a",
            "start": 385.68
        },
        {
            "text": "to allow my desk to stop shaking as much. But I will say anytime I put my hands on the desk, it shakes no matter what. Uh that's just how it goes cuz it doesn't have four legs. Barrett, it's not a four-legg. No, it's a two-legg desk. It's all about the back of the It's a very stable desk. Um someone was saying in chat that I had delayed audio. Was it just my camera that was doing delayed audio or Yes, that that happened yesterday as well with Nick's stuff. He's a mover and a shaker. I don't have a B button. I never go back. And I've never gone back, chat. Never gone back on it. Go back. I guarantee before the film flopped, they had movie skins ready to go for Borderlands 4, but now probably not. Wasn't the Borderland movie like last year? F so long ago, Langley. But you're probably right. Yeah, Borderlands was last year. So long ago. Yeah. Yeah. Yeah. We'll see. I mean, what do you want? You want a Kevin Hart? It was August of last year. It was a long time. It was a long time ago.",
            "start": 436.48
        },
        {
            "text": "Yeah, Borderlands was last year. So long ago. Yeah. Yeah. Yeah. We'll see. I mean, what do you want? You want a Kevin Hart? It was August of last year. It was a long time. It was a long time ago. Full 12 months ago. It's crazy. Snow Mike, you still do magic? Yeah. I think I have a magic night this Thursday I have to go to. So, I'm very excited. I've been playing a lot of Magic. I have four new decks. So, I'm getting up into the Mike's got a bunch of decks now. And I'm having fun with that. So, it's gonna be a really good time. It was a collective fever dreamers, right? Who saw the Minecraft movie? When are we going to the Minecraft movie, y'all? It's gonna be a great time. We got to go to this Minecraft movie. You know what I found on Tik Tok? I found a Tik Tok account that just has Viva Leam episodes on it. [ __ ] yeah. It was crazy. I was like swiping and it was like it started with Viva Lean and then you know when you look down on the Tik Tok and normally like when it's 30 seconds",
            "start": 487.76
        },
        {
            "text": "Leam episodes on it. [ __ ] yeah. It was crazy. I was like swiping and it was like it started with Viva Lean and then you know when you look down on the Tik Tok and normally like when it's 30 seconds it's like moving the little time thing. This one wasn't. I was like, \"What's the deal?\" Oh, these are just 30inut episodes that they've uploaded to Tik Tok. What are we doing? Bam that my friends and I used to watch sleeping over each other's houses and my one friend had like the entire show or something on YouTube. It was crazy. Rick, ridiculous, man. So, yeah, that made me laugh uh last night finding that. And then all of a sudden, I'm watching a Viva Leam episode on Tik Tok. I'm like, Jesus, what am I doing here? They got Chicken Jockey on uh Tik Tok. You know, they've got chicken jockey, man. Chicken jockeyy's all over the place. All right, now I'm coming back over to this camera uh and chat. Let me know if my if I'm still delay, if the audio is ahead or if my video is ahead, I'm",
            "start": 531.44
        },
        {
            "text": "man. Chicken jockeyy's all over the place. All right, now I'm coming back over to this camera uh and chat. Let me know if my if I'm still delay, if the audio is ahead or if my video is ahead, I'm going to try to fix this now. So, let us know he's fixing it now. Once Nick gets in here, um I can just go video edit in peace. Okay. Suggi says, \"Mike, find me a Robin Big account, please. Those episodes were gold.\" Where are those episodes? You know what I mean? We talk about unaccounted for hours. Dear dear MTV, all those episodes should be on YouTube. Just put everything. Remember next and Room Raiders? Next. I remember next. When they get off the bus and they're like next. That [ __ ] was God. We got to get those. We got to get those. We got to get those. I love how chat is saying audio is ahead. Audio is delayed. Audio is ahead. Make up your mind. Kevin's touching stuff now. He's here. I I thought I dialed it in. Apparently not. Audio is like half a second ahead for both of them. For",
            "start": 574.32
        },
        {
            "text": "ahead. Audio is delayed. Audio is ahead. Make up your mind. Kevin's touching stuff now. He's here. I I thought I dialed it in. Apparently not. Audio is like half a second ahead for both of them. For just I think just me. Just him. He's touching it cuz I think the FPS on this camera is different. Yeah, I set it to I think [ __ ] I set it to JG says I know someone who did next. That's lit. JG. Really? And then Lucas Lucas my homie. Lucas says snowike Mike did you do your research on Taroff last night? Lucas, right next to me right now, I have all the Tarov maps ready to go on a web page. I played last night, got a couple of kills, and I teamed up with Bacon. Lucas, I feel good. Now, did I retain all of that information? Absolutely not, cuz it was a lot. But I feel way more confident this time around. Now, I do wish I don't know if Nick's PVE has finally turned on or not, but I would love I wish we could play PvE, but it doesn't matter because now I got a good I got a good grip on Escape",
            "start": 623.6
        },
        {
            "text": "around. Now, I do wish I don't know if Nick's PVE has finally turned on or not, but I would love I wish we could play PvE, but it doesn't matter because now I got a good I got a good grip on Escape from Tarov right now. The people in chat are really Mike's audio is drifting. Kevin Kevin's Kevin's working on it, chat. Just type in a bunch of numbers and Kevin will type it into the chat delay. See if it works. It was just Okay. It's an everyday thing. Yeah. I mean, it really shouldn't be. It's It resets itself. If you turn it on, resets, you know, it's a whole thing. Last night, Mike got a few kills on a PMC. I did. I get I got a couple of real kills. It was really exciting. So proud. Uh I really really enjoyed it, man. It's going to be a good time. Going to talk. I'm going to start talking now and just hang out and uh we were talking about next. Someone was on Next. Next. Yeah. JG knew a guy that was on Next. The audio is blurry. That's so cool. That's really funny. Cracking me up. All",
            "start": 674.72
        },
        {
            "text": "now and just hang out and uh we were talking about next. Someone was on Next. Next. Yeah. JG knew a guy that was on Next. The audio is blurry. That's so cool. That's really funny. Cracking me up. All right. How's Barrett sounding? The audio will be both ahead and delay. Both good now, right? You're good now. Okay. What was it set to? Do you remember? It was set. So, when someone told me it was delay or it was like desyncted, it was set to 30. So, then I went over there and changed it to 45 and they're like, \"Oh, the audio is ahead now.\" And then I just changed it back to 30 and they're like, \"Ah, it's fine now.\" Yeah. I think they're messing with us chat. Never change. Never change chat. Awful. Never stop. Nick, let's go get [ __ ] lost in some tar off. Big dog leaving us. Thank you, big dog. We're looking good. I got my buttons. Let's take a little quick run through. Boom. Boom. Boom. Boom. Nick's thing is uh off because Bear turned it off. That's why. We're good. I get it. All",
            "start": 718.08
        },
        {
            "text": "big dog. We're looking good. I got my buttons. Let's take a little quick run through. Boom. Boom. Boom. Boom. Nick's thing is uh off because Bear turned it off. That's why. We're good. I get it. All right. Uh Big Nick, welcome in, bro. Hello. Who said that? Where are you? Somebody said we didn't figure out the Or JG says we didn't figure out the Tarov issues. No, I mean, uh, Taroff took my money. They took my They took my money. They just didn't give Nick what they wanted. You know what we wanted. They took my money, though. Uh, Mike, I'm firing up the game right now. Fire it up. Uh, Nick, I have a couple of things in front of you. Let's talk. You'll see. So, right in front of you, I just You have quick commands. Okay. Of course, you and I made the rule. No one in this room cuz it's going to get weird. Okay. We got prox chat on. We're We're going to talk to people. We're going to lie. We're going to cheat. We're going to steal. Maybe make friends. You never know. Never know. But I've",
            "start": 769.76
        },
        {
            "text": "to get weird. Okay. We got prox chat on. We're We're going to talk to people. We're going to lie. We're going to cheat. We're going to steal. Maybe make friends. You never know. Never know. But I've given you some quick commands. If anybody gets out of pocket and gets way too crazy, we can cut off all communications by pressing the letter P on your keyboard. You'll see that on your quick commands on your sticky notes. Okay. And then on your top right of your PC, if you went back and brought up the Google uh Chrome that I had for you, I have given you all of the Tarov maps, an interactive map, a 2D map, and a 3D map. You don't have to really concern yourself about being the map guy. I'll be the map guy and tell you what to do, but I'm just letting you know that if you want to know the maps, I have all the maps in front of you because this game doesn't give you a map. So, we got to know. That's fantastic, Mike. And you believe that I I closed that immediately. Immediately. Yeah. Yeah. I",
            "start": 814.32
        },
        {
            "text": "I have all the maps in front of you because this game doesn't give you a map. So, we got to know. That's fantastic, Mike. And you believe that I I closed that immediately. Immediately. Yeah. Yeah. I had a good feeling as I looked over and didn't see it there. So, don't worry about it. I'm the map guy. Can you slack that to me real quick? Just slack it over here. Yeah, I want the map. I was like, now the big question is this. Tell me that. We're getting into off. We're a bit late. I apologize. Thank you guys for uh hanging out with us while we sorted out some technical issues both inside and outside. Uh would you like Starbucks? Can I order you some Starbucks? I would love some Starbucks to start the day with you is always my favorite thing to do. You're on station four. I'm going to slack this over to your station. You've been slacked with the maps here. And I'll tell you, so now I've I I got to have a really great experience, Nick. I got to play this last night. I had a whole lot of",
            "start": 861.12
        },
        {
            "text": "this over to your station. You've been slacked with the maps here. And I'll tell you, so now I've I I got to have a really great experience, Nick. I got to play this last night. I had a whole lot of fun. Shout out to the best friend. I'm so sorry I couldn't jump online with you, by the way. I know I texted you. Well, I will say, Nick, it's a very slow download. Well, that was the at home. You text me at like 8:00 or and you say, \"Hey, it's a late night talk,\" which I [ __ ] love. And I was so bummed I didn't say no to it cuz I was at punch line shooting some stuff for my friend. Um and then I was like, \"Wait a minute. Even if I ran home now, would this it takes about an hour? Like an hour.\" Yeah. I was a little I was a little upset because I started my stream last night. I think I started the download at 5:15. It didn't finish until about 600 6:15. So I was not happy about how slow it is because that's going through its own launcher blah blah blah. But it is a longer download. So, I",
            "start": 895.68
        },
        {
            "text": "the download at 5:15. It didn't finish until about 600 6:15. So I was not happy about how slow it is because that's going through its own launcher blah blah blah. But it is a longer download. So, I do encourage you if you want to play it at home, hit the download when you can, uh, let it go. But, uh, I had a lot of fun last night. I'm really excited. I even got some cool guns, Nick. I got some sick guns. And, uh, I I'm excited to share with you. I got some kills, y'all. I got some kills. Your boy, Snowike Mike got some gear. Where's Where's my main man? Where's uh, where's Lucas at? Lucas, take a look at his little gun, bro. Lucas, look at my [ __ ] bro. Lucas was so [ __ ] on us yesterday. Yeah, but then he came around and he's like, I'm Lucas, I got a mustache, Lucas. Mike, I'm getting you a venty ice ch that uh no sandwich today. I'll have a chocolate croissant. Okay, please. And thank you, Lucas. Look at this. Look at my gear today, L. Look at Look at these kills, Lucas. Now, none",
            "start": 934.8
        },
        {
            "text": "a venty ice ch that uh no sandwich today. I'll have a chocolate croissant. Okay, please. And thank you, Lucas. Look at this. Look at my gear today, L. Look at Look at these kills, Lucas. Now, none of this [ __ ] is like that great, Lucas. I totally get it. But like, look at me now. And look at this. Is this the insurance guy? He spoke croissant cross. There it is. I found it for you, Mike. Oh [ __ ] I even insured some of my gear, Lucas. So, and I learned about I I I learned about insurance in this game. You can also commit insurance fraud in this game. Oh, I like that. So, I did, you know, I did a little bit of that one. Oh, that's so fun. Okay. Yeah. You had to have some fun on that. And so, now I come in with Nick and I'm very ready. I'm looking I'm excited about this one. I'm excited about this. I feel really good about this AUG. This is my gun right now, Lucas. Um, but I don't want to lose, Mike. You know, Starbucks has been ordered. Starbucks has been ordered. Get me into the",
            "start": 979.28
        },
        {
            "text": "about this. I feel really good about this AUG. This is my gun right now, Lucas. Um, but I don't want to lose, Mike. You know, Starbucks has been ordered. Starbucks has been ordered. Get me into the game. Get me into the game. Nick, get in the game. So, let's take a look. Nick, you and I are back. And so, to start off today's stream, we are going to jump in to a scav uh mission. Actually, before we start that, Nick, on your screen right now, let's see if PvE worked. Can you click on the bottom right zone? This is nut. It's the locked. Okay, dear Tarov, you got 20 from me, Lucas. No, here's what we're Lucas, because you were on one yesterday. This is your job now. Now, you have to hit the Tarov people up. You have to tell You have to ask them why my PVE doesn't work. I just want you to say that. The people Tarov, hey, I'm emailing you on behalf of kind of funny games at Nick Scarpino. CC Nick Scarpino, right? Care of Why doesn't his PVE zone not work? What the [ __ ] Can somebody check",
            "start": 1029.6
        },
        {
            "text": "that. The people Tarov, hey, I'm emailing you on behalf of kind of funny games at Nick Scarpino. CC Nick Scarpino, right? Care of Why doesn't his PVE zone not work? What the [ __ ] Can somebody check out Nick Scarpino's PVE zone? We need to know it. They got my 20. They got my They got my [ __ ] I'm about to buy real talk. I'm about to buy the unheard edition. It's $200. We might need to at the end of this week, I might be buying that. That's how deep I Here's what I'm going to say. We get it to this end end of We We do a marathon stream on this, right? Yeah. And for every if we hit the $200, people giving us the $200. Me get the unheard [ __ ] zone and then we never play this game ever. Fun talkoff edition edition is right. All right, Nick, jump on in. Let's have some fun. Jumping in. Now, I'm going to add the thing that Andy always says. I'm going to try to do the 3D. I'm sure this game has amazing 3D audio. So, yeah, we actually I learned a lot about the audio now. So, the audio,",
            "start": 1076.56
        },
        {
            "text": "I'm going to add the thing that Andy always says. I'm going to try to do the 3D. I'm sure this game has amazing 3D audio. So, yeah, we actually I learned a lot about the audio now. So, the audio, now mind you, it's probably better to go into the splitter with our audio system. We do have a lot going on there. So, it's probably best to go into the actual 3D thing. But the audio, Nick, if you go to your character, you'll notice up on the top uh top left of your screen. There's an earpiece. The audio is also driven by having a headset. Buy headsets. You can get better headsets that will allow you to hear better, Nick. And so, you might be noticing like, \"Oh, I can't hear that well.\" That's partly the game, of course. Probably a lot of it's on our side of things as well, but you actually can't hear that well without better headsets. Oh, that's so [ __ ] lame. [ __ ] crazy. I'm still gonna I'm still gonna put this. So, you might want to put that in. I don't know how that works. That's an",
            "start": 1128.16
        },
        {
            "text": "hear that well without better headsets. Oh, that's so [ __ ] lame. [ __ ] crazy. I'm still gonna I'm still gonna put this. So, you might want to put that in. I don't know how that works. That's an Andy thing. Uh, but you might want to put that in. Chat, can you tell me do I need to go left or right here? I don't know how I don't know where I'm at. Let me know. So many details. I love [ __ ] like this, though. I always want to just get in games like this. is I know that sounds crazy, but like I don't have a lot of time to play after hours and I really really do enjoy playing games these days. So, it's nice to like commit to something, you know? We we're always just like guns for hire. We come in, we do a fun Arc Raider stream or something fun like that, right? And then we're done. We never come back to the thing. So, it's nice to just commit. Mike and I are committed to this. Ideally, all we do is Pokemon and escape from Tarov cuz they Pokemon and escape from Tarov. They just",
            "start": 1169.92
        },
        {
            "text": "We never come back to the thing. So, it's nice to just commit. Mike and I are committed to this. Ideally, all we do is Pokemon and escape from Tarov cuz they Pokemon and escape from Tarov. They just compliment each other so well. That's all we want to do now. Now I got to I got to go to my my guy's healthy. What is this p What's the pouch? Secure container. So your pouch, Nick. Wow. Let's just get into what I learned and what I can teach you. So your pouch is your goodies bag is what we're going to call it. Nick, the goodie bag will never be lost. So whatever you put in the pouch will always come back with you, even if you die. Oh, I see. So your goodie bag right there is very important to put in the good stuff that you really care about. Right now, I currently have a health pack and two rounds of like special ammo for me. But when we go into a run, that pouch is going to be your goodie bag. That's that good. Good right there. Okay. Good. Good. Thank you to Ken Jr. for gifting out a",
            "start": 1210.24
        },
        {
            "text": "rounds of like special ammo for me. But when we go into a run, that pouch is going to be your goodie bag. That's that good. Good right there. Okay. Good. Good. Thank you to Ken Jr. for gifting out a tier one sub to the bacon who helped me learn and grow. Thank you to So, I got a DVD support. I got a DVD player in this power cable. So, I can now I can sell that, right? You can definitely sell that off, Nick. Go to your traders. Uh you probably have to go to the correct trader that might be uh buying that. Okay. I don't know which one that is. Uh but yeah, all the traders in front of us are going to be dealing in different things. Some guys, Nick, I learned deal and American money. You and I don't have American money yet. Oh, we don't have American money. Pretty wild, right? Deal. I just sold this for like Oh, cool. I can buy a gun now. All right. Now, now, okay, before we go in now, I really got I really got to sort out two things. One, how do I change the orientation of magazines?",
            "start": 1251.76
        },
        {
            "text": "sold this for like Oh, cool. I can buy a gun now. All right. Now, now, okay, before we go in now, I really got I really got to sort out two things. One, how do I change the orientation of magazines? Okay. In my inventory, cuz one's sideways and it's You ready for this? On your inventory. Everybody check this out. On your inventory, go down to the bottom middle, there's a little blue button there. See two arrows in blue? Yeah. Uh, the inventory. No, I don't see. So, click on character. I'm on character. All right. Now, in the bottom middle, right right above the quick use button menu, there's on the right hand side is two blue arrows. Yes, I see them. Click that. Are you sure you want to automatically sort Oh my god, it auto organizes it, Nick. Sick vows. What the front door? Okay, so cool. Tomic, thank you for the tier one sub for 19 months. Thank you for the support. Now, I have two guns. You have two guns, Curt. I don't have ammo for either of them. Okay. I have a lot of bullets and",
            "start": 1292.56
        },
        {
            "text": "Tomic, thank you for the tier one sub for 19 months. Thank you for the support. Now, I have two guns. You have two guns, Curt. I don't have ammo for either of them. Okay. I have a lot of bullets and a lot of magazines. Okay. And I don't know. So, with your guns, with your guns, we're going to right click on them. I want to sell all of it. I just want to sell the ammo cuz I don't think any of this is worth is is I mean, I don't know. Should we sell the ammo at this time? Yes, Bacon. Bacon. Bacon. If you want to come in here and join us on Discord, Bacon, you feel free. You can come and talk to us now. Nick, on your guns, let's right click. Okay. Okay. Linked search on the right click drop down, man. Yeah. Hold on. Let me go to the carbine cuz I've done this before. Okay. Right clicked. Now, click on linked search. Linked search. So, as you can see, it starts to bring up this new browser. So, if you go to the bottom, there's ammo, right? Like on the top left there's ammo. So here you",
            "start": 1342.88
        },
        {
            "text": "click on linked search. Linked search. So, as you can see, it starts to bring up this new browser. So, if you go to the bottom, there's ammo, right? Like on the top left there's ammo. So here you would purchase ammo for that gun that you need. Right. I can't purchase any of it. Why not? It says it's locked. 4320 43 minutes. So you have you might be looking at a gun that I don't I'm going to sell this gun back. I don't need this gun. Okay. This gun sucks. What gun is it? It's the carbine. It's sick. Okay. Well, maybe we don't sell it yet. Maybe we just keep it. All right. So, let me go to this. Let me go to this other one. This AK-47. Okay. AK-47. linked search ammo. Okay, so now it's got three ammo types. So there we go. We got ammo in here. Okay, so the craziest part about this, Nick, that [ __ ] gun will take three different types of ammo and you'll jam it into the magazine however you want to organize the ammo. There's good ammo, there's mid-range ammo, there's low tier ammo, okay,",
            "start": 1389.92
        },
        {
            "text": "[ __ ] gun will take three different types of ammo and you'll jam it into the magazine however you want to organize the ammo. There's good ammo, there's mid-range ammo, there's low tier ammo, okay, pretty [ __ ] wild, right? And then you can put you can put the bacon in as you want. Shout out to Heroic Headgear for the tier one sub for 18 months. But I need to know as an Avatar player for the last five years. I'm so proud of these jabronies jumping in. Thank you, Heroic Head Gear. Okay. All right. But here's the question. Yeah. Which magazine do I need? So now, do you have magazines in your thing for that? If not, let's go to weapon parts and mods. Yeah. Okay. So, I saw that and I could have swore I bought this AK74. I'm just going to purchase one just to see. Wait, hold on. This is the AK Mike. Remember, AK74 Delta Tech Sage 555. Yeah. Okay. Okay. Pretty sure I have one. Okay. Okay. Okay. Let's take a look. Okay. So, let me look at my character. Yeah. AK-55. Do you have an AK-55? I",
            "start": 1434.0
        },
        {
            "text": "AK Mike. Remember, AK74 Delta Tech Sage 555. Yeah. Okay. Okay. Pretty sure I have one. Okay. Okay. Okay. Let's take a look. Okay. So, let me look at my character. Yeah. AK-55. Do you have an AK-55? I have the AK I have this. Okay. So, but it doesn't work. You have one clip. I have one clip, but there's maybe there's no bullets in it. Okay. So, now here, what I want you to do is right click on it. Uh-huh. Can you go load and go load from Okay, look at that. Is it loading ammo? Let me load ammo, but it's not letting me put it on the gun. No, no, no, no. So, yeah, then you have to have the gun in your like in your possession. Oh, yeah. Right now, it's in your inventory. You got to put it on you. All right. Now, bring that. Put it in your pouch. Didn't work. I think it's the wrong ammo or the wrong thing. What does it say? Drag it open. Slot is not It just It's red. It's red. I don't think you need a vest, big dog. You got to get a vest on. Oh, I have to get a [ __ ] You got to put a vest",
            "start": 1479.04
        },
        {
            "text": "wrong thing. What does it say? Drag it open. Slot is not It just It's red. It's red. I don't think you need a vest, big dog. You got to get a vest on. Oh, I have to get a [ __ ] You got to put a vest on. God darn it. Okay, let me go buy a vest. Oh, it's got a mag in it is what the chat is saying. But it's got zero. Oh, it's got a mag in it. It's got So, unload the mag, bro. Bro, unload the mag. Oh, Bacon, again, if you want to join us, Bacon, and be the man, you are more than welcome to come join us. Bacon is Bacon's got the stamp of approval from Kind of Funny. He can be in here and help us right now. Bacon's got it. Okay, so I did buy the right one. Yeah. And now I have that dark dooby. This shit's so deep, bro. This is like jumping in to the deep end of the pool, bro. You You like You know you're in the kitty side of the pool where you should be, but they're like, \"Yo, [ __ ] that. Jump in the 10 foot.\" I don't care, man. This is what I like. I like this [ __ ] This is [ __ ] wild.",
            "start": 1526.4
        },
        {
            "text": "you're in the kitty side of the pool where you should be, but they're like, \"Yo, [ __ ] that. Jump in the 10 foot.\" I don't care, man. This is what I like. I like this [ __ ] This is [ __ ] wild. This shit's a wild, bro. It's wild, bro. Okay, so I need to buy some ear earpieces now. Uh go to the rag man bagman. So skier will have the high-end stuff. Oh, I can buy this for that. But I think the ragman bagman might have some headphones for you. Yeah, you don't really need you. Well, here's the best part, Nick, is you and I are going to jump in as scabs and we're just going to run this thing. Okay. You know what I mean? Like So, Nick, on your character really quick, put everything back in your um your inventory. We'll get to the inventory after that. Okay. Put everything in the inventory. No, not on your body. Back in your stash. Put it in your stash. I don't need [ __ ] I don't need it. Yeah. Yeah, we don't need [ __ ] The dog tags. Do I need the dog tags? Uh, no. Don't worry about the",
            "start": 1571.92
        },
        {
            "text": "not on your body. Back in your stash. Put it in your stash. I don't need [ __ ] I don't need it. Yeah. Yeah, we don't need [ __ ] The dog tags. Do I need the dog tags? Uh, no. Don't worry about the dog tags. Okay. So, now we're going to go into scabs, which means we drop in Nick. Yeah. One, we are like the AI guys. If we shoot an AI guy, they hive mind will come after us. Okay. If we don't, they're cool and peaceful with us. Okay. Our goal as these scav guys is to go in, maybe find a dead body or two, take that stuff, get out safely, right? So, we're hoping to find a human dead body out there. Okay. Now, of course, as a scab, get this, you load in with different guns. So, remember the one time when you had a a nice assault rifle and I had a pistol? The scab, random guns. Good luck. You don't know what you're going to get. Do we need any sort of body armor or anything like that? Um, no. No, no. The scab, you don't get to pick anything. Okay. They give you a pre-made kit. They just give",
            "start": 1617.84
        },
        {
            "text": "know what you're going to get. Do we need any sort of body armor or anything like that? Um, no. No, no. The scab, you don't get to pick anything. Okay. They give you a pre-made kit. They just give you the pre-made kit. I love this. Okay, let's do it. All right, so Escape from Tarov. We're going to go into scavs here. We're going to hit next. You and I, Nick, I got a good I got a good mindset of customs. We're going to go to customs. Okay, I've learned customs. We're going to drop in at the 1330 mark, which is the midday. And you're ready to join? Let's do it. Thank you to Vermodex for the tier one sub for 12 months. chat. Don't forget if you enjoy what we do here at Kind of Funny, all about live talk shows, 11 person small business, you can of course support us with your Twitch subs. If you got Amazon Prime, you got Twitch Prime. We would love that free monthly sub if you subscribe at the tier one through three level. You help keep the lights and mics on and you get ad free viewing.",
            "start": 1665.52
        },
        {
            "text": "you got Amazon Prime, you got Twitch Prime. We would love that free monthly sub if you subscribe at the tier one through three level. You help keep the lights and mics on and you get ad free viewing. You get all of our channel emotes and you can help keep us all employed. If you're watching over on YouTube, don't forget, come on over really quick. Drop that Twitch Prime sub. Then get back over to YouTube where you prefer to view. We would love your Twitch subs over here. But let's have some fun. The bacon says, \"Where do you want me?\" Bacon, if you're free, I will take you after the scav mission and we will get you on there. All right, let's let's do this, Bacon. I will send you the invite uh to your Twitch whispers in just a moment. When I'm done with the scav mission, you can be in here. Mike, I think I've um disconnected, but I will try to reconnect. You You should be able to reconnect. That's crazy. That happened to Bacon, too last night, which was I think it's it happened to be",
            "start": 1708.48
        },
        {
            "text": "Mike, I think I've um disconnected, but I will try to reconnect. You You should be able to reconnect. That's crazy. That happened to Bacon, too last night, which was I think it's it happened to be the first time. Maybe it's just the first one. You got to rip it off. Rip off the band-aid. Rip off the band-aid. Pump up the volume. Oh, yeah. Attention. Your character is still in the raid. Slad gone. Thank you for the Prime Gaming sub for 42 months. Oh, that's S. Sal gone. Thank you, homie. Okay, I'm trying to reconnect as we speak. I'm excited for this. I got to bring up my map. So, I learned, Nick, the dorms inside of customs is where people pop off. That's where people meet and they battle each other. I love this. Oh, man. Smoking Joe says, \"Guys, I'm in Deliverance, too. It's Cody material. Incredible game fun. Good for you.\" Okay. get lost in the sauce of it. Lot of goaties out there. A lot of games. Too many games, some would say. Mike and Nick playing Tarov. Mike and Nick playing",
            "start": 1750.4
        },
        {
            "text": "Incredible game fun. Good for you.\" Okay. get lost in the sauce of it. Lot of goaties out there. A lot of games. Too many games, some would say. Mike and Nick playing Tarov. Mike and Nick playing Tarov. Sorry, Mike. Give me one sec. Trying to figure out why my audio is not working. Nick, lock yourself in. I'm fine. I'm all dialed in. I'm I'm excited. Are you hearing audio at the menu screen? Is there any audio right now? Uh, yeah. It's a [ __ ] killer rock band. Okay, I'm not hearing that. So hard to break. All these games off by day, Final Fantasy X2 by night. Oh my god. They loaded me with a [ __ ] shotgun. Get a grip, Mike. Get a grip. Figure out where you at. You might load in somewhere differently than me. [ __ ] It's all good. I'll find you. I think I'm over by the S entrance. I'm on the main road. I got a shotgun, too. [ __ ] This sucks. [ __ ] Where are you, Brody? I'm not even in. Hold on. Okay. I just can see my character has a shotgun. So, I have no audio. Why would that",
            "start": 1811.12
        },
        {
            "text": "on the main road. I got a shotgun, too. [ __ ] This sucks. [ __ ] Where are you, Brody? I'm not even in. Hold on. Okay. I just can see my character has a shotgun. So, I have no audio. Why would that have changed from yesterday? I wonder. Were the What were the jabronies doing in here before? I don't I can't tell you. Okay. I can't even tell you. Stop. Take your time, Mike. Figure out where you're at. You might be somewhere else. I'm a waiting session to start. Two minutes. You might be over by C. Actually, I don't know why I have to wait two minutes, but I'm waiting. Okay. Yeah, I'm over by C. I'm on the far right side of the map. Look at that identification right there. Your boy Snowike Mike right off the rip. So, I'm on the far side of the map on the right hand side over by Big Red. Yep, Big Red right there. I'm CRT T and R2 up here. My extraction points are going to be military base, old gas station gate, scav checkpoint. Scav checkpoint is on the opposite side of the map, which is",
            "start": 1881.32
        },
        {
            "text": "Big Red right there. I'm CRT T and R2 up here. My extraction points are going to be military base, old gas station gate, scav checkpoint. Scav checkpoint is on the opposite side of the map, which is S. Scav checkpoint S. So, I'm going to go down from R. I'm going to go across the broken bridge, the the trash bridge. Then I'm going to go over to dorms. Blat blat. And then I'm going to go all the way over to S. Now, I don't know. Mike, look at my screen real quick. Nick, I'm coming to you. Okay, so I start on this side of the gate. Okay, if I go on that side, is the sniper going to shoot me or is that I don't know, Nick. Is that the [ __ ] game? I don't know if I'm in the space or not in the space. Oh my god, how exciting is this? So, Nick, I need you to get I need you to get a grip here. Nick is my new gas. Mikey, new gas. You're going to have to tell me. Middle, left, or right, chat. Middle, left, or right. Nick is in the woods by scav checkpoint. Okay, Nick, here's what I want to",
            "start": 1930.88
        },
        {
            "text": "Nick is my new gas. Mikey, new gas. You're going to have to tell me. Middle, left, or right, chat. Middle, left, or right. Nick is in the woods by scav checkpoint. Okay, Nick, here's what I want to orient yourself to. Okay. Okay. Forward is always north. Winky face. You know what I mean? So, that means behind you is probably south. You, Nick, need to navigate to the southeast to meet me at dorms. There's going to be two giant apartment buildings. I see them. Okay. You're going to just slow creep those. Don't go. That's far from me, though. Yeah. Yeah. Yeah. Well, everything's far. Do you see two giant smoke stacks that look Oh, Nick, I'm on the opposite side of the map from you. I'm I'm trying to come to you. Can you see the smoke stacks, though? You should be able to see those on the horizon. Smoke stacks. Show me on your screen. Those two smoke stacks right there. You see those? Yeah, I see them. I see. Those are going to be those are going to be our true north. Okay. So, like I'm",
            "start": 1980.96
        },
        {
            "text": "Smoke stacks. Show me on your screen. Those two smoke stacks right there. You see those? Yeah, I see them. I see. Those are going to be those are going to be our true north. Okay. So, like I'm coming to it from the north. I'm coming to it from front left. You should be coming in from it front right. Right. Yes. All right. So, like, stay where you're at, Nick. Imagine we're two points like a yo-yo swinging back and forth, right? You're on the right, you're on the left, I'm on the on the right. Stay low and meet me in the center. Okay. Okay. Stay low. Meet me in the center. Are we Okay. The analogy was great, but are we just meeting at the smoke stacks? No. No. No. Yeah. In front of the smoke stacks, but not at the smoke stacks. Okay. You know what I mean? I want to keep them in front of me, but I want to still be a hundred yards south of them. Okay. I'm on my way right now. Oh [ __ ] I see a PVC. That's a real Is that a real guy or no? If they're walking like a robot, they're probably",
            "start": 2023.04
        },
        {
            "text": "but I want to still be a hundred yards south of them. Okay. I'm on my way right now. Oh [ __ ] I see a PVC. That's a real Is that a real guy or no? If they're walking like a robot, they're probably somebody fake. This guy looks like he's walking like a robot. Are you on the road? That's fake. No, not yet. All right. So, if you step up towards those smoke shoot me, though. No, if it's a if it's a fake robot, they will not shoot you. Okay. He's looking at me, though. Yeah, don't worry about him. If you shoot him, you awaken the hive mind. Okay. I don't want that. Yeah. All right. I'm at smoke stack number one behind it. I'm going to I'm going to loot this. How did you arrive at the smoke stack? I just walked toward it. I Okay, I'm I'm gonna meet you at the smoke stacks then. Go meet me at the base of the smoke stacks. I'm I'm going in front of it. That's what you said you are, right? Okay. Yeah, but now you said you were at it. I'm in the building of the smoke stacks. Okay, just stay in",
            "start": 2061.2
        },
        {
            "text": "base of the smoke stacks. I'm I'm going in front of it. That's what you said you are, right? Okay. Yeah, but now you said you were at it. I'm in the building of the smoke stacks. Okay, just stay in the building of the smoke stacks. I'm coming. Oh, this is where we got iced that one time. Yeah. Remember that guy that snuck up on us and murdered us? Yeah. Just [ __ ] murdered us. I watched the tape back on that one. Yeah. What happened? I definitely gave the wrong call out of the door behind us, but on your screen, you clearly saw the man in the doorway when you walked by it. All right. I want [ __ ] I want I want I want to see the replay. Throw the challenge flag on that one. I'm throwing the challenge. I am approaching the smoke stacks building. I'm going to be entering a door. Are you inside? I'm inside. I'm inside. Okay. I'm on the far staircase. Now, Jester says this is not the same smoke stacks. Okay, never mind. So, you're looking at the silos. Are they white silos or the actual",
            "start": 2127.6
        },
        {
            "text": "I'm inside. I'm inside. Okay. I'm on the far staircase. Now, Jester says this is not the same smoke stacks. Okay, never mind. So, you're looking at the silos. Are they white silos or the actual brick smoke stacks? Brick smoke stacks. I'm at the brick smoke stacks. Are you in the building? I'm going to walk in the building right now. Chad, we're at different buildings. All right, we're at different buildings. Oh [ __ ] I'm sorry. You're at the silos. No, no, no. There's two buildings that have brick smoke stacks. I'll run to the other ones. Okay, I got you. Okay, you're not in the same spot as me. Yeah, I I see where there we are. Chad, he sees he sees it. I am at the smoke sacks building. I will stay in there. Just hang there. Holy [ __ ] I almost popped one. Almost had to pop that guy. He was a robot, though. Holy canoli, man. Now, we've got two. Okay, good to know. We're learning. Yeah, we're learning. Two different buildings that have dual smoke stacks, and there's one building",
            "start": 2165.44
        },
        {
            "text": "He was a robot, though. Holy canoli, man. Now, we've got two. Okay, good to know. We're learning. Yeah, we're learning. Two different buildings that have dual smoke stacks, and there's one building that looks like it has three dildos. Okay. Yeah, those are the silos is what we're going to call those. Okay, those are silos. There's a guy on top of silos, by the way. Do you see him? No, I do not see him. I am inside of the brick. There's literally a guy. Look up at top of silos. See that [ __ ] Okay, I'll take a look at him in just a second. I'll take a look at him. That's I I hope that's not a real person cuz if it is, he's got a real good beat on me. No, it's fine. That's a sniper scav is what the chat is saying. Okay, good. Keep going the rails. Okay, there's two guys right here. Yeah, if they don't shoot at you, they're fake. You don't have to panic. Well, one's not moving, so Yeah, let's go back the other way. There's just a guy running at me now. What the [ __ ] does that mean? I",
            "start": 2214.96
        },
        {
            "text": "they don't shoot at you, they're fake. You don't have to panic. Well, one's not moving, so Yeah, let's go back the other way. There's just a guy running at me now. What the [ __ ] does that mean? I don't know. There's so many guys. They're all scavs. They're just fake. They're fake robots. Okay. There's a lot of them. Yeah. Don't Well, they're not going to shoot you. They won't shoot you. Okay. They're not shooting me. Of course. Thank you to everybody for your support. Thank you for the subs over there. Don't forget if you subscribe, you won't be fed any ads during this Borderlands pre presentation. We always encourage you during these summer gamefest months as we get into presentation season. Don't miss out on any of the live reaction fun. Don't miss out on the biggest gaming announcements of the year by having to watch ads here on Twitch. Make sure to subscribe and you can subscribe for free with Prime Gaming, which is even cooler. We would love your support. How you doing? I can't",
            "start": 2259.52
        },
        {
            "text": "of the year by having to watch ads here on Twitch. Make sure to subscribe and you can subscribe for free with Prime Gaming, which is even cooler. We would love your support. How you doing? I can't take this dude's [ __ ] Whatever. I want to take this cool tactical rig. I already have one. That's why. Yeah, you might have one on. Forget it. All right, Mike. I apologize. I'm coming towards That's all right. You're coming. Are you coming towards me? Wait, looting, too. We have uh 10 minute. I have 10 minutes. You probably have like 11, I bet. Can you not mount? Oh, you can. You can even [ __ ] You can [ __ ] dip with it, too. Dip it. Do I have to like have my gun not out to mount mantle rather? Uh, I don't know. I've never Oh, no, no, no. You can mantle without with your gun out. Can you? Yeah, we're like low-level players, so we haven't really earned like those kind of skills yet. Oh, you're [ __ ] kidding me. Yeah, you got The goal is to leech level 15. Okay. Well, then I have to go",
            "start": 2313.52
        },
        {
            "text": "Yeah, we're like low-level players, so we haven't really earned like those kind of skills yet. Oh, you're [ __ ] kidding me. Yeah, you got The goal is to leech level 15. Okay. Well, then I have to go around this fence. You can't jump over a [ __ ] thing, though. God, I can't get around this. Okay, we'll just go. So, wait, why aren't you guys on the PVE version since Nick doesn't have the PvP thing? No, no, no. Pont, he only has the standard edition. The PVE version somehow is not clicked on on his account even though it says he owns it when he goes to the website. So, it's just a whole thing. You know what I mean? It's two different worlds colliding. They took my money. They did take my money. They took my money. They took his money. They took his money. Mike, I'm almost to you. I apologize. That's all right, Nick. That's all right. I just had to get around a fence, and in this game, it takes a little while to do that. I mean, yeah, you got to find openings on the fence. You got to be",
            "start": 2364.72
        },
        {
            "text": "That's all right, Nick. That's all right. I just had to get around a fence, and in this game, it takes a little while to do that. I mean, yeah, you got to find openings on the fence. You got to be smart. All right, I'm approaching the smoke stack building. Are you still inside? I am inside of the smoke stack building. Someone just ran out of the building, but I assume it's an NPC cuz he's running in a straight line. Okay, I'm waiting on you. Yep. He's not seeing me. No problems. There's guys at the front of the building. I'm going to loot this body real quick. Nick, is that old gas? Is Am I wrong? No, just keep moving to me. Okay, I see new gas. Sorry, the text on the map is just so small. Oh, there's so many bodies in here to loot. Old gas isn't on this ma on this map. Oh [ __ ] You're looking at him blast off on you, sir. Told you not to, dude. He's at Fortress, Mike. I know where Fortress is. God damn it. Why am I not where you at? Yeah, I know. I know where he's at. I I get it. I",
            "start": 2411.84
        },
        {
            "text": "at him blast off on you, sir. Told you not to, dude. He's at Fortress, Mike. I know where Fortress is. God damn it. Why am I not where you at? Yeah, I know. I know where he's at. I I get it. I get it. I get it. What's going on? What are you You got any questions? What are you looking at? Uh looking at our Uber driver. Okay. I love that. I love that. Oh, perfect. I'm at Fort. Uh next week is Pokemon chat. Uh we have the team meeting tomorrow. I will pitch to do Monday starting it. If not, we will start on my birthday, which is actually uh Wednesday. But, uh, we're looking from I'm looking just to get it done. I promise you that. We're looking just to get it done. Yeah, we want this over with. I'm terrified. We were putting it off long enough. All right. So, I'm not where you're at then, Mike. Is that what you're saying to me? No. No. I'm trying. I'm waiting for you at the smoke stacks. Where are you? Let's check to Cool. G. Thanks. I'm inside the building of the smoke stacks. You're",
            "start": 2459.08
        },
        {
            "text": "Mike. Is that what you're saying to me? No. No. I'm trying. I'm waiting for you at the smoke stacks. Where are you? Let's check to Cool. G. Thanks. I'm inside the building of the smoke stacks. You're inside the building of the smoke stacks. Okay, I'm coming inside. Be prepared to see me. Appreciate it. Rocking. Now, the chat says you are not in the smoke stacks building. I not smoke. Oh, Jesus Christ. Sorry. Okay, that's fine. That's fine. We're learning. We're Stop. Stop. Crouch. That's me. That's us, baby. That's [ __ ] us. Now, do me a favor, Chad. I need your help, Nick. Yeah. Double press O, please. O, what's his extraction points, Chad? I'm going to need you to rattle them off. Railroad support. Okay. I don't [ __ ] anything there. One sec. Old G. Get it one more time for me now. I'm looking at your screen. Railroad. Railroad. Old gas boiler room. [ __ ] I don't think we have any shared. Okay, you take me to mine first. I got old gas station. Press your button one more time. Old",
            "start": 2537.28
        },
        {
            "text": "looking at your screen. Railroad. Railroad. Old gas boiler room. [ __ ] I don't think we have any shared. Okay, you take me to mine first. I got old gas station. Press your button one more time. Old gas station. I got old gas station gate. Chad, that's where we're going to go. Old gas station gate. Let me take a look. Old gas station gate is L on my map. Looking for L. L is directly above us. Easy peasy. Now, Nick, we've wasted a lot of time. We we are going to come out of this not well. So we need to get some [ __ ] and move. Okay. Um L is directly above us. Past forts right to the left hand side of fort. So I got that. North left. Okay. I got that. Nick, we need to go get some we needed some loot. So we might have to kill unfortunately some scavs. Not really what we want, but we're just going to have to take it. So come with me. Follow me. We're going to start moving towards our gate, but at the same time we're going to [ __ ] murder some scavs. So, we will awaken the robots. Okay.",
            "start": 2603.04
        },
        {
            "text": "going to have to take it. So come with me. Follow me. We're going to start moving towards our gate, but at the same time we're going to [ __ ] murder some scavs. So, we will awaken the robots. Okay. We unfortunately didn't have enough time to make it to where we wanted to go there, but that's fine. Okay. See this guy dead ahead of me? Mhm. This dead body in the doorway. Loot that. I'll cover you. Beat your Get your body inside the door, though. Like, go inside. Wrap to the left. Crouch. Yep. Perfect. Loot all that. Oh, I already looted this guy. You looted that guy. Love that, Nick. All right, let's uh keep moving then. There's another guy back here if you need it. Taking a look at him. Take a look. I already looted this dude, but you might be able to loot this guy. Nice. All right, let's keep it moving. I'm out. I'm outside moving. Nice. Don't loot Fort. Get out. Well, I mean, we only have four minutes and we're just scavs and we literally have got nothing. So, yeah. I mean, we're",
            "start": 2655.28
        },
        {
            "text": "keep it moving. I'm out. I'm outside moving. Nice. Don't loot Fort. Get out. Well, I mean, we only have four minutes and we're just scavs and we literally have got nothing. So, yeah. I mean, we're looting. We're literally just We're vultures now. You might as well call us the vulture boys cuz we're going to just start picking at things. We got to pick. We got to pick. Man, there's all cool [ __ ] in here. Okay. All right, let's just bounce. Yeah, I'm all full up. I'm already outside. I've been I'm outside. Let's go. So, the way we came in and then up north. I see you. Yep. Let's move. Let's rock. So, we have our extraction dead ahead of us, but we still need kills. What do we got to get? We have three minutes. Yeah. Well, we we burned a lot of that time, so we just got to kill. We're going to go over here through this. Right through this door should get us to our extraction. We got two people right there. Nick, what is my what? See them in the green. They're on the green smoke. Okay,",
            "start": 2704.88
        },
        {
            "text": "to go over here through this. Right through this door should get us to our extraction. We got two people right there. Nick, what is my what? See them in the green. They're on the green smoke. Okay, I got the guy on the right. Ready? Blast off. [ __ ] blast off, dude. Stop shooting me. Stop shooting me. You chill. You chill. Is that you or not? That's not me. Shoot him. Got him. Loot him. Loot it. Loot him. This guy's a badass gun. I'm going to take it. I'm bleeding heavy. Bleeding heavy. I'm bleeding heavy. Got some body armor. You okay there, Mike? All right. We're taking all their stuff. It's not. I really got to figure out the whole I really got to figure out how to uh So, if there's things that you want from them that your body is currently like in the way of, drop whatever you have, take their stuff instead. So, right click on your bodies, just drop it. I get that. I'm just trying to figure out how to uh reload this guy's gun. Oh, okay. There you go. Let's reload. All right,",
            "start": 2762.08
        },
        {
            "text": "take their stuff instead. So, right click on your bodies, just drop it. I get that. I'm just trying to figure out how to uh reload this guy's gun. Oh, okay. There you go. Let's reload. All right, cool. I think I'm good. Okay. Plenty of bodies here to loop. We got two minutes. I don't know what's a good gun or what's not a bad gun, chat. So, don't judge me based off of what I'm I mean, we're taking anything over the shotguns for sure. Yeah, for sure. All right. That's just red for some reason. Coal. All right. Coal gas mask. You searching all the way down, Mike? The tack rig and all that [ __ ] I've I've searched it all. Okay. All right. I said we get the [ __ ] out of here. So L should be like right there. That red gate. I think we got to step outside of here. Follow me. It should be right next to us. You can't You're not making that. Oh, you made it. Yep. And I think it's this. Yeah, it is. We made it. Step on inside. Step here. Oh, we're just in. Y the door. Sit. We did it.",
            "start": 2840.72
        },
        {
            "text": "be right next to us. You can't You're not making that. Oh, you made it. Yep. And I think it's this. Yeah, it is. We made it. Step on inside. Step here. Oh, we're just in. Y the door. Sit. We did it. Anticlimactic. Woo. We [ __ ] did it, bro. That's what success looks like, chat. But we did it, bro. That's for you, Golden Spider. 666. You got the mark of the devil. Yeah. And we've got his side. Um, we'll take that. We'll take that. We'll take that big. Not not our best because of course we looted we loaded in different times. Uh we weren't able to get into where we wanted but like at the same time two noobs jumping in a successful evac. We got some gear maybe probably off of some scavs. Yeah, they were scavs. It's fine. We'll take that. We'll take that. Definitely scavs. So Nick, now on your right hand side when you load in here Mhm. is yours still loading? Yeah, it's still loading. Sorry I had to skip through all the menus and [ __ ] Oh no. So you want to take all this [ __ ] Oh",
            "start": 2906.04
        },
        {
            "text": "on your right hand side when you load in here Mhm. is yours still loading? Yeah, it's still loading. Sorry I had to skip through all the menus and [ __ ] Oh no. So you want to take all this [ __ ] Oh [ __ ] Yeah. So you like when you're here in this menu that I'm looking at, you got to take all this [ __ ] and put it in there. Oh [ __ ] Yeah. Or else you just leave it. [ __ ] Well, I [ __ ] it up then. That's all right. That's all right. Okay. I thought it would just automatically have it on my [ __ ] Yeah. No, no, no. You're doing a great job, Mike. I'm trying my best. I think Bacon might join us. Maybe Bacon will help me even further. But yeah, I think from what Bacon described to me, I'm pretty sure you got to take that [ __ ] Yeah, I'm pretty sure you're right, cuz I don't have any of it. Yeah, you got to take you got to take all that [ __ ] always. All right, so let me do this. Let's let's do another one. Let me get my audio working real quick. Okay, get your audio working, chat.",
            "start": 2961.68
        },
        {
            "text": "it. Yeah, you got to take you got to take all that [ __ ] always. All right, so let me do this. Let's let's do another one. Let me get my audio working real quick. Okay, get your audio working, chat. Let's get Let's get some ones in the chat. How do we feel? Did we do good on that one? Put a one in the chat if we feel good. We feel good on that one. Put a one in the chat. Let me know. Holy [ __ ] Holy [ __ ] Yes, we know. Yeah, we know we're not really supposed to be killing scabs, but as I said, as team captain, I had to call the ball. We had 5 minutes left. Two noobs not understanding the map, not knowing where we were. Far away from dorms that we weren't going to be able to make a move to dorms and then move. I had to call the ball of we're gonna kill scavs. We're going to loot them and we're just going to take what we can and we're going to get out because now as you know right the scav missions will turn off for 30 minutes for us. So I couldn't have us walking away with nothing.",
            "start": 3004.56
        },
        {
            "text": "we're just going to take what we can and we're going to get out because now as you know right the scav missions will turn off for 30 minutes for us. So I couldn't have us walking away with nothing. So I needed us to have something. And so that's why you team leader Mike had to make a call. So I apologize if that's not the way you go. You got to get it out right there. Okay. He's going to get Kev. I'm gonna Bacon. Are you available? Bacon. Would you like to join me and Nick? Bacon says, \"Mike, I am available.\" [ __ ] yeah, bacon. Thank you. [Music] [Music] Hey Kev, is your birthday next week is what Sacho wants to know. No, it's like a month from now. May 2. Kevin's end of May. You're early May, right? May Yeah, I'm May 7th. You are May 23rd. 26th. I just said, did I go? No, you said end of May. I thought you said. Yeah, and then I said May 26. Oh, I didn't hear that. Yeah. Yeah. I got yours wrong, too. Hey. All right, Bacon. I'm sending you the Discord. Please. Uh, jump in the waiting",
            "start": 3051.44
        },
        {
            "text": "May. I thought you said. Yeah, and then I said May 26. Oh, I didn't hear that. Yeah. Yeah. I got yours wrong, too. Hey. All right, Bacon. I'm sending you the Discord. Please. Uh, jump in the waiting room, Bacon, and then we'll bring you into live one with us, please. And thank you. Should I turn on Discord here? Yes, please. That'd be great. Put him in live one. Okay, let me see. Wavelink's giving us problems. Yeah. Is he going He's going through something, right? He's going through the special one. I don't know what that means. What? He's going through his system. Yeah. Yeah. Yeah, his system, but I did not. What do you mean? Well, I'm sorry. I don't know. My door. It was unclear what he was talking about. Yeah, I'm not getting any audio right now. Like, I'm not even seeing channels, but could it be that there are no channel? There's no noise. This is normal. Hold on one second. What the [ __ ] Yeah. See, earlier. Yeah. Uh, can I restart it? Yeah. And uh I guess just to see here",
            "start": 3158.32
        },
        {
            "text": "but could it be that there are no channel? There's no noise. This is normal. Hold on one second. What the [ __ ] Yeah. See, earlier. Yeah. Uh, can I restart it? Yeah. And uh I guess just to see here Chrome bacon. Dude, Nick, I did my best on that one. I chat I will say thought I did my best on that one. Bacon is in. Bacon is going to join the waiting room. I'm going to bring Bacon in. Bacon is in live. Bacon was able to move. No problem. Did you move Bacon? No. Oh, no. Bacon, you're perfect. That's great. Bacon. Thank Here. He moved himself. Yeah, he moved himself. That's crazy. I didn't know you could do that. I didn't know you could do that. That's fine. Uh, uh, Nick, real quick, where do you start? Bacon, one sec. I got a mouthful of food. One sec. One sec. Bacon, can you hear me? Excellent. Were you hearing me [Music] before? [Music] Ah, where's the game? It's opening. [Music] Audio's back. Audio is good. Just had to restart Wavelink and restart the game, of course. All right. And",
            "start": 3198.56
        },
        {
            "text": "Were you hearing me [Music] before? [Music] Ah, where's the game? It's opening. [Music] Audio's back. Audio is good. Just had to restart Wavelink and restart the game, of course. All right. And then you'll have to get bacon on your PC other than two seconds. Kevin's working on it right now. As we do that, Mike will eat this chocolate cassad in front of you. Oh, and you know what we could do? I could run an ad, right? Uh, yeah, sure. All right, chat. We're going to run an ad. We'll be right back. Here, a word from our sponsors. This episode is brought to you by Imperial. We have told you all how important it is to developers that you wishlist the games you're interested in. So, if this sounds cool to you, make sure you wishlist it. I can't tell you how much it helps. Imperial is a complex, featurerich action RPG where you'll be sent to a planet in a far-off corner of the galaxy to explore an enormous imposing monolith. As an elite mercenary, you'll join the expedition tasked with",
            "start": 3258.52
        },
        {
            "text": "featurerich action RPG where you'll be sent to a planet in a far-off corner of the galaxy to explore an enormous imposing monolith. As an elite mercenary, you'll join the expedition tasked with unearthing the secrets of the monolith and face off against the deadly automatons within. In Imperial, you'll explore four vastly different quadrants of the monolith, accessible only by using mysterious artifacts known as cardoggrams. Each cardoggram affects which enemies, boss fights, and loot will appear when you enter the monolith, so no two excursions will be the same. Find even more cardiggrams to explore by looting defeated enemies, or buy them from other players online at the trading post. You'll need to make sure you have the right gear to take on the harder Cardoggrams. Build your mercenary, choose your gear, master your abilities, and take down everything in your path in Imperial. Face off against enormous deadly bosses and seek out secret paths to find bigger and better loot. Help",
            "start": 3322.16
        },
        {
            "text": "choose your gear, master your abilities, and take down everything in your path in Imperial. Face off against enormous deadly bosses and seek out secret paths to find bigger and better loot. Help the members of the expedition in deep branching quests and aid other players in asynchronous multiplayer. Get ready mercenaries, the monolith awaits. Imperial is available May 8th on PC, Xbox Series X and S, and PlayStation 5. Wish list now. It helps so much. Wishlist Imperial. This episode is brought to you by Aura Frames. If you haven't called your mom in a while, here is your reminder to do it. But if you want to go above and beyond, beyond. Mother's Day is coming up and I have the perfect gift idea. Ora frames are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preloaded with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so",
            "start": 3367.76
        },
        {
            "text": "videos directly from your phone to the frame. Plus, you can order the frame online and preloaded with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special they'll use it every day. Me, Kevin, and a ton of people at Kind of Funny are obsessed with our Aura frames. It takes about two minutes to set up the frame using the Aura app. Aura frames were named the best digital photo frame by Wire Cutter and featured in 495 gift guides last year. I counted Orura has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting orura.com to get $35 off plus free shipping on the bestselling Carver matte frame. That's auraframes.com. Promo code kind of funny. Support the show by mentioning us at checkout. Terms and conditions apply. Kevin's going to work on that back end. All right, Nick. Hey. Hey, buddy. Wait up a sec. Nick, really quick. Hey, give me [ __ ] Come on, [ __ ] bro. Give me some of that in your",
            "start": 3414.32
        },
        {
            "text": "conditions apply. Kevin's going to work on that back end. All right, Nick. Hey. Hey, buddy. Wait up a sec. Nick, really quick. Hey, give me [ __ ] Come on, [ __ ] bro. Give me some of that in your camera. There it is. Here's what I need you to do. Here's what I need. Good [ __ ] run, Nick. Stop. Are we back on? Yeah, we're back on. I need you to go get Roger. He needs to dap us both up right now. I need a Roger dap right now. I need his hand to hurt and bleed a little bit. No, don't do that to him. He doesn't want to. He said no. He said no. He said no. No. All right. Um All right. Real quick. Yes. Give me two seconds cuz I think I need you guys to mute your Discord call. Okay. I will stream. Beg them or mute our Discord? Your audio, which will be a lot cleaner through mine. Just mute or deafen. No, mute because you want to be able to hear. Okay. Muting my Discord. Let me change my mic really quick. Oh no, it's already set up. Oh, maybe that's why you were hearing him duplicated. Play",
            "start": 3458.64
        },
        {
            "text": "No, mute because you want to be able to hear. Okay. Muting my Discord. Let me change my mic really quick. Oh no, it's already set up. Oh, maybe that's why you were hearing him duplicated. Play of stream. Mic check on my end. Let me turn game off on that. Yep, we're setting up. Okay, awesome. Mic talk. Uh, hello. This is Mike talking to the chat. Answer Bacon. Getting everything geared up and ready. Confirmed. Heard you. Could you hear them both? Clear. Heard Mike. You heard them both. Haven't heard Nick. And it sounded good. Hello. Hello. Hello. Hello. Okay, great. Nick. So yeah, I think this solves it cuz audio. I like that. Okay, excellent. Thank you to Kevin uh and of course Kind of funny best friends. Thank you to all of you for supporting us here on twitch.tv/confunny games and of course over on YouTube. We appreciate your support through of course the follows through your viewership through your friendship and the fun we have. Don't forget you can subscribe with Twitch Prime",
            "start": 3509.92
        },
        {
            "text": "course over on YouTube. We appreciate your support through of course the follows through your viewership through your friendship and the fun we have. Don't forget you can subscribe with Twitch Prime Gaming totally for free to get 30 days of adree viewing. You can also subscribe at the tier 1 through three level. We're having fun. You don't want any ads because we're about to jump into it. Now, Nick Y, I just want to say really quick, y thank you for a great run right there. It was thrilling. It was exciting. And we blasted off on those robots at the end. That was the game. I I need Bacon for one more second to hear his love. Bacon, I'm going to talk to you now. Bacon, let me introduce to you our Sherpa into the escape from Taroff world. Bacon last night teamed up with me on my Twitch channel and got me through it. So, Bacon, say hello and tell me what you like about Tarov. One nice thing while we get your voice right. Hello. Hello chat. Um, I like Tarova because it's always a",
            "start": 3551.88
        },
        {
            "text": "channel and got me through it. So, Bacon, say hello and tell me what you like about Tarov. One nice thing while we get your voice right. Hello. Hello chat. Um, I like Tarova because it's always a different adventure and story in every raid. Something crazy happens every time. Um, and it can be wildly different and it makes some uh good memories and there are way way too many things about the game to master and figure out. So, makes it fun. Chad, that sound all right? Let me know cuz he sounds good on my chat. Let us know. Of course, Bacon, we welcome you in as our captain today. You and I went through it last night. So, I'm feeling confident about myself, but I need you to get my duo's partner, my number two, up to speed with us. And of course, that means we can't do a scav run because we just did one. So, we need to build out his character. Okay. So, I have him up on Twitch. Sounds good on my end. I'm going to leave. Sounds great. That's perfect. So, Nickacon and Bacon, this is the",
            "start": 3591.44
        },
        {
            "text": "just did one. So, we need to build out his character. Okay. So, I have him up on Twitch. Sounds good on my end. I'm going to leave. Sounds great. That's perfect. So, Nickacon and Bacon, this is the time where we're going to put guns in our inventory. So, Nick, please go to your character screen. Bacon's watching on Twitch on a soft delay, but he will be able to help guide us on what we need to bring in for our first good uh first good successful run. I'm sorry. Before I leave, do you want me to also share the video directly from us? So, there's Bacon. Would you like to see something on Discord if you have the opportunity? I'll use that. Okay, he will use that. That's great. No big deal. I can set up stream just as well. It It should be easy enough. Okay, let's see. You tell me if it's not working right. camera OBS virtual cam. All right, that works great. The feed should be going. Okay, great. I will use that. Um, yeah, if there's any issues with it, we can always turn it off and you",
            "start": 3639.68
        },
        {
            "text": "working right. camera OBS virtual cam. All right, that works great. The feed should be going. Okay, great. I will use that. Um, yeah, if there's any issues with it, we can always turn it off and you can go back to the normal way. That sucks. No, that works great for now. All right, Bacon. Good luck with everything. I'm going to go. All right. All right. And so with that, we're back with Bacon. Uh, Nick, your screen is being shown in your character menu, and Bacon is going to help you and I walk through the successful run uh of putting on the guns for your character. First off, great job on that on that scout run. That went very well finding each other after being split up like that. So nice. We crushed it. Well, it was you're being good. It worked. It worked. Well, you say it worked. That's all that matters. I was like, how many buildings in Russia have smoke? All of them. All right. So, the first thing we want to check uh just basics is we want to get you a rig on. That's your",
            "start": 3680.88
        },
        {
            "text": "That's all that matters. I was like, how many buildings in Russia have smoke? All of them. All right. So, the first thing we want to check uh just basics is we want to get you a rig on. That's your tactical vest. That's that top right slot. So, scroll through your inventory and see if you have one. If you sorted and that's all you have right now, then we're good. So, you go to the traders and go to ragman. That's where you buy clothes. So, yeah, you're going to do a lot of back and forth now between character and trader screen. You can buy any of these cheap vest. It doesn't matter. I'd say get the $12,000 one, $12,000 rubble one. That's fine. It really doesn't make a big difference. Um, whichever one you like to style of as long as it's not the cheapest one, not this $15,000 one. You could. You could. Absolutely. It's all It all works fine. They have slightly more space versus a little more cost, but at this point it doesn't matter. Yeah. All right. So, let's go and put that on and",
            "start": 3721.28
        },
        {
            "text": "You could. Absolutely. It's all It all works fine. They have slightly more space versus a little more cost, but at this point it doesn't matter. Yeah. All right. So, let's go and put that on and let's see if you have anything else we want to fill in first. You've already got good armor on. You could buy a helmet and wear a helmet. It's not necessary once you have money. Everyone always has a helmet. I wouldn't worry about it right now. Let's get you a working gun. Do you want a use the gun you have cuz it's easiest. Um, or do you want a semi-automatic gun or a full auto gun knowing that they're all bad at this point in the game? Whatever. I've got Take that one right there. Put that on your uh on your character. You can uh you can control or alt click it to put it on if you want. Um, you already have a magazine, so that's good. Um, let's get you two more. So, right click the gun that you have and do linked search. Mhm. One of the options is going to be link search. All right. Now, if",
            "start": 3763.28
        },
        {
            "text": "already have a magazine, so that's good. Um, let's get you two more. So, right click the gun that you have and do linked search. Mhm. One of the options is going to be link search. All right. Now, if you expand that top left uh option where it says weapon parts and mods in the top left. All right. Now, expand the one that says gear mods. Click on magazines. I know this is cumbersome, but it's the easiest way to do it consistently. All right. Now, you can choose whichever one you want. Buy the one with 30 rounds. Your choice if you want gray or red or gray or orange and buy buy three of them or something like that. The ammo you're going to use is going to be really bad. So, we're going to buy you a bunch of cheap ammo and make the best of it. I saw someone in chat earlier say that uh in this game the guns don't do damage uh the ammo does and that's very true and sadly you don't have access to any good ammo but we'll do what we can. Okay, so you bought three of those I think. Okay, so I",
            "start": 3804.72
        },
        {
            "text": "game the guns don't do damage uh the ammo does and that's very true and sadly you don't have access to any good ammo but we'll do what we can. Okay, so you bought three of those I think. Okay, so I bought three. Right click on that. Um actually for simplicity just click on where it says ammo. Yeah, just click ammo. Any of those things uh click the word uh rounds. Rounds. Yeah, click. Yeah, exactly. And it'll show you where you can get. Um, I honestly don't know what's best at this point. They're all pretty much the same and bad. Um, get either PRS or SP. I don't think it matters. I could check. It doesn't matter. Okay. Well, I'll get SP. How many rounds should I purchase? Um, yeah. Get like uh you just bought three mags, 30 each, so get like 180 at least. Just get 90. 180. Got it. Done. All right. Good. Go back to your character. Um, now the ammo is there in the bottom right. Uh, and the mags are there as well. So, you can control-click those magazines to move them to your uh vest.",
            "start": 3849.12
        },
        {
            "text": "All right. Good. Go back to your character. Um, now the ammo is there in the bottom right. Uh, and the mags are there as well. So, you can control-click those magazines to move them to your uh vest. Uh, the newest ones you got the bottom ones, not those. Um, oh, un move those back. Yep. And real quick, just to show you something for simplicity, if you right click your gun and unload it. All right. Now, if you if you grab one of those magazines that you just uh bought, the ones you just put in there, the gray ones, see how it turns green? That means you know you can use it, right? So, if you're not sure you're grabbing the right thing, just drag it, drag it around, and you'll see if it's good to use. All right. Now, just drag your ammo into those guns or you can do the load from ammo that way. Either one is fine. Get them all loaded up. And Mike, feel free to interrupt me at any point if you want to teach them something more complex or less complex. No, you're perfect, Bacon. I'm let",
            "start": 3898.88
        },
        {
            "text": "way. Either one is fine. Get them all loaded up. And Mike, feel free to interrupt me at any point if you want to teach them something more complex or less complex. No, you're perfect, Bacon. I'm let I'm letting you cook with it. I'm trying to remember myself. As you can see over my screen, I'm currently I'm building my stuff out right now. So, yeah, it's perfect. Oh, I need more bullets, I think. No, you you should be good. Um, so the ones you have in the bottom right there, you can just drag them on there. Yeah, I can't see it from here, but yeah. Ah, I see. Yeah, I see. I see that guy. Cool. Okay. Um, now you're pretty much good to go there. Grab one of those full stacks of 60 bullets and put it in your pockets or in your vest. Doesn't matter. Um or or your pouch there. It's cheap, so it doesn't matter. The pouch is what you keep forever. So, if you have a valuable like good ammo, you'd keep it there. This ammo's cheap. It's okay. Um, all right. Now, we need to do your medicine. Um,",
            "start": 3943.44
        },
        {
            "text": "doesn't matter. The pouch is what you keep forever. So, if you have a valuable like good ammo, you'd keep it there. This ammo's cheap. It's okay. Um, all right. Now, we need to do your medicine. Um, you have some of it, but let's just go to the trader and get the rest of it. So, go to the traders and go to therapist. All right. Buy like three sets of the white painkillers. Buy three. Uh, now you have enough advantages. Yeah. Buy three of those. Um, and buy uh a couple of the orange cheeses. Yeah, let me do 10. You can buy 10. There might be a limit. I'm not sure. Okay. You don't need 10, but you will eventually, so it it can hurt. Um, how many cheeses? You're running low on money, so buy just three or two. We'll get you some this run. Let me do two. I'll just deal. All right. Now, go back to your inventory. Okay. Oh, wait. Hey, I'm sorry. I don't see any bandages. So, go ahead and also buy yourself two white bandages from that same screen. Or one. It doesn't matter. The antiseptic",
            "start": 3982.72
        },
        {
            "text": "to your inventory. Okay. Oh, wait. Hey, I'm sorry. I don't see any bandages. So, go ahead and also buy yourself two white bandages from that same screen. Or one. It doesn't matter. The antiseptic band ones. Yep. All right. Now, back to your character screen. Got it. What about a Snickers bar? Do I need a Snickers bar? Some sort of For fun, you could. It's a funny animation, but no, not at all. Uh, we don't worry about food and water until later on. Reality is either going to find some or you're going to die before you need it. So, I don't stress about that. Okay. Um, now for simplicity, for your health, I always do the same setup. Uh, so you got that bar called your pockets. You can only use stuff that is in your pockets or in your rig. So you're going to make sure you always have your medicine in there. Like if you had a backpack, that's in storage. You can't use it actively. So go ahead and put the red circle, the S march in the first slot. That's your heavy bleed. That's important.",
            "start": 4040.64
        },
        {
            "text": "in there. Like if you had a backpack, that's in storage. You can't use it actively. So go ahead and put the red circle, the S march in the first slot. That's your heavy bleed. That's important. You want to use that right away. So we're going to make them in order. The red circle, the cone called the S march. It's right beside the measuring tape. Put that in your first pocket slot. What's that thing do? Yep. Now it's a tourniquet. Now, exactly. It's a tourniquet. Um, then do the uh the orange cheese, then the uh white pain pills, and then the white bandage. Oh, Mike, are you doing this, too? Oh, yeah. I'm running all You're going to hover over each one of those in order and press a hot key on them. So, you're going to hover over that one and press four. Then the next one, you're going to press five. Next one, uh, well, sorry. Yeah, that's right, isn't it? four, five, six. Yeah. Yep. Yep. Yep. And then that way whenever you get in trouble, if you just hit those buttons over and over in",
            "start": 4083.76
        },
        {
            "text": "five. Next one, uh, well, sorry. Yeah, that's right, isn't it? four, five, six. Yeah. Yep. Yep. Yep. And then that way whenever you get in trouble, if you just hit those buttons over and over in that order, right, it'll do the things in terms of how important they are. Okay. What's my one hot key? One is um I think that's going to be your gun or maybe your pistol. Pistol. I believe that's your pistol. That's your pisto. Okay. I don't have a pistol. That's why. Okay. All right. And now um you should get a backpack. Do I need a pistol? So go ahead and buy one this time. In the future, you'll either find them or someone will bring you one, whatever. Um, but go back to Ragman to buy a backpack. You can, you know, if you're feeling confident, you get a big backpack and try to get a lot of stuff or you get a medium small backpack and save some money. And if you buy more stuff, you can take a backpack from somebody else. I'm feeling super confident right now. [ __ ] yeah, bro. All right,",
            "start": 4127.92
        },
        {
            "text": "or you get a medium small backpack and save some money. And if you buy more stuff, you can take a backpack from somebody else. I'm feeling super confident right now. [ __ ] yeah, bro. All right, let's And you're pretty much um And then you don't put [ __ ] in your backpack cuz that's basically just where you would. Yeah, that's where you're going to keep all the loot stuff, right? Yeah, absolutely. Okay. Um, and you can move stuff around, right? This important thing to remember is you can't use stuff from your backpack. If you have a grenade in your backpack, you can't throw it. has to be in your vest or in your pockets. Okay. Um got it. All right. That is a barebones setup. Let's get you a splint as well. That's the one last thing we haven't done for you that you guys can have right now. And so, take one of those splints and either put it in your backpack or put it in the pouch. It doesn't really matter. Okay. Now, here question for you. If you're looking at my screen right now,",
            "start": 4167.28
        },
        {
            "text": "now. And so, take one of those splints and either put it in your backpack or put it in the pouch. It doesn't really matter. Okay. Now, here question for you. If you're looking at my screen right now, right? So, I can't exact. Okay. So, that gun that you're trying to load that into Yeah. It is using a type of ammo called 366, right? Um, but sadly, because the game is confusing, uh, it can use that magazine that you have. That magazine has a different kind of bullet in there. So, as soon as you try and put it in there, it's telling you it's going to break because it's the wrong kind of ammo. Okay. But it can use you unload that magazine. So, I just need a different You would link search the gun and then you would find the ammo that it can use. You load that in and put it that way. It's complicated, but Exactly. Okay. Okay. Well, we'll do that later. I need what do I need to throw? What? What type of ammo? Oh, for that gun, you would go back to that gun and do that link search thing",
            "start": 4199.92
        },
        {
            "text": "complicated, but Exactly. Okay. Okay. Well, we'll do that later. I need what do I need to throw? What? What type of ammo? Oh, for that gun, you would go back to that gun and do that link search thing again, and that'll take you there. So, back to your uh character inventory screen. Okay. Okay. Link search. Okay. And then ammo. And then you can see what ammo it accepts. Ammo. Okay. So, if you click the word ammo, it'll show you everything in the category as opposed to exposing and only seeing a certain one. Right. Okay. So, I can't Click on the word rounds or go through all of them. You might not be able to get any yet. Yeah, you can't get any yet. It's They're all grayed out. Okay, cool. So, I just can't use that. So, as you as you do like task for the traders and level up, you'll build reputation with them and they'll sell you more stuff. Sick, Mike. We're going to build our rep, Mike. We're going to [ __ ] building rap. [ __ ] you, Tarov. The jabronies are coming. We're in this",
            "start": 4241.04
        },
        {
            "text": "reputation with them and they'll sell you more stuff. Sick, Mike. We're going to build our rep, Mike. We're going to [ __ ] building rap. [ __ ] you, Tarov. The jabronies are coming. We're in this game. There's two [ __ ] time periods in Tarov. before jabronis and after jabon. AJ, baby. Captain Bacon's here. All right. Um, the last thing that we've got, take us in, Mike. Now, hold up. One of those uh grayish brown splints somewhere in your inventory. Doesn't matter where. In case you break a leg. Not critical, but just in case you break a leg. Do I have right above your pain pills or right to the left of the measuring tape? Oh, I see. So, I put it in my vest or put it in your backpack or your pouch. You're not going to use it quickly, so it's not a rush. Okay, pouch it is. All right. Yeah. Question for you guys is what do you all want to do? Where do you all want to go? Do you uh Well, before we do that, I want you to look at mine really quick, Bacon, just to double check me. I feel",
            "start": 4285.68
        },
        {
            "text": "Question for you guys is what do you all want to do? Where do you all want to go? Do you uh Well, before we do that, I want you to look at mine really quick, Bacon, just to double check me. I feel pretty good. I unfortunately took everything out before the scab, so I've reset myself. Uh, but I do have I got my mustache. Shout out. I got my AUG. I have 30 bullets in it. I have a clip here. And then I bought these two 10 round clips cuz they don't sell extra 30 round clips. Yep, that sounds good. Um, I'm feeling good. I got my healing stuff here. It's looking pretty good. I got $5,000 just in case of car extract. I got extra bullets here ready to rock. I'm feeling pretty good. I feel like I had it set up from last night. Um, there's a few things we can optimize, but I won't I won't worry about it now. Like, you might want to like make sure your heals in your pouch. There's like a full heal if you're going to be saving it there cuz you're if you think it's valuable, right? Use a good",
            "start": 4330.96
        },
        {
            "text": "about it now. Like, you might want to like make sure your heals in your pouch. There's like a full heal if you're going to be saving it there cuz you're if you think it's valuable, right? Use a good one, not a half full. I wouldn't worry about it. Um, the only thing I will say and then I have one is that you probably do still have some full magazines left for that gun. I think you had more last night. So, they might be in one of your vest. I thought I had more. You want to check the vest you have by opening them up. You might find that they're like in your storage. Not the middle one. The other two, the one on the left and the right are vest. That one's armor. Double click to open it, I think. Maybe. Or maybe right click open. Oh, double click. I don't know. Controls are different for everybody. Okay. Yeah. Yeah. Yeah. No, I got a helmet on this one. Helmet. Okay. Um, let's see. Yeah. And then Yeah, they're not there. Don't worry about the 10 rounds. We'll be fine. Backup. And then",
            "start": 4375.04
        },
        {
            "text": "Okay. Yeah. Yeah. Yeah. No, I got a helmet on this one. Helmet. Okay. Um, let's see. Yeah. And then Yeah, they're not there. Don't worry about the 10 rounds. We'll be fine. Backup. And then you use those and you get to a quiet spot and try and re uh reload the big magazines. And then finally, before we go, I would love you and I Let's go to our settings. Nick, click on the settings down below cuz you did have some recommendations for FOV and head bobbing. What are those numbers again? Cuz it's different at home. Go to the bottom of this one right here, Nick. And we're going to set FOV to 63 and head bobbing to minimum. Uh, in a lot of games, FOV is a preference. In Tarov, it it generally works best at 63. Some people use other ones, but in general, that's good. I should not crank it up to 200. And if you wanted, uh, uh, Mike, we could change other settings like show shows his health and stuff, but we don't need to do that unless you want to. Yeah, I would I I would love that. I think",
            "start": 4412.64
        },
        {
            "text": "200. And if you wanted, uh, uh, Mike, we could change other settings like show shows his health and stuff, but we don't need to do that unless you want to. Yeah, I would I I would love that. I think I think we do it all. So, yeah. What? Let's walk through those. So on the settings there settings screen one more time. Mhm. And so on and the first ones under the game section uh quick slots stamina. Change all those to just always show. Always shown. Under the game always shown. Yeah. Right at the front if you look at it. Yeah. Quick slots as well. Always make it polychrome. Um okay. And then and then you had um double click item use. Right. That one. Yeah. Some people like having it on. I don't. Whatever. Okay. Okay. Now, here's the real question. I'm going save that. Is there a way to toggle sprint? Yes. So, that's a big one. And I really recommend the way they have sprint is terrible. I hate it. I didn't want to get into this. [ __ ] hate it. But yeah, so go to uh Yeah, go over there.",
            "start": 4458.88
        },
        {
            "text": "sprint? Yes. So, that's a big one. And I really recommend the way they have sprint is terrible. I hate it. I didn't want to get into this. [ __ ] hate it. But yeah, so go to uh Yeah, go over there. Controls and then you see sprint to the middle on the top. Score to the top of that. Um, and it changed that to continuous. And we could talk about this page forever, so I'm not going to, but the What about crouch? Uh, crouch is the same thing. I have my crouch as set to release personally. Um, I don't know why. I don't remember the exact thought there. Or have as a press. Yeah, it's release for me. I don't know why. What is What is toggle? What if I just want to click it and then you unlock? That's press. I think that's press, right? Or is that release? I don't know. Maybe they have a toggle crouch. Maybe that's separate. Honestly, I've never used to Oh, that is toggle, right? Crouch is toggle. So, that's fine. Crouch is always toggle like that. Sorry. Okay. Okay. Jump is release. Um, I",
            "start": 4508.72
        },
        {
            "text": "crouch. Maybe that's separate. Honestly, I've never used to Oh, that is toggle, right? Crouch is toggle. So, that's fine. Crouch is always toggle like that. Sorry. Okay. Okay. Jump is release. Um, I like having jump on press. I think that means like click to press. Um, it'll make you feel a lot more dynamic. On release makes you miss your jumps. Thank god. Okay, good. So, Oh, so that's when you Okay, so if it's released, you literally as the button is pressed or the button Oh [ __ ] So, we don't ever want release. [ __ ] crazy. Who Whoever designed that game mechanic, what does that mean? You're too [ __ ] hardcore parkour. There are there are legitimate reasons for these different options. It's wild. Like for your health, you can actually hold the heal button and change things if you have it set the right way. It's a whole thing. What about reload? Why would you ever want reload to be released? Um, there's reasons for it, but uh you can leave it as, let's see, what do I have reload",
            "start": 4553.36
        },
        {
            "text": "it set the right way. It's a whole thing. What about reload? Why would you ever want reload to be released? Um, there's reasons for it, but uh you can leave it as, let's see, what do I have reload as? I'll leave it as it is release. Um, it saves you.3 seconds. It doesn't make a difference. Holy [ __ ] bro. Okay. Energy run. Double click. Okay, cool. We're going to save all this [ __ ] We're just going to go in. This game is so hardcore. I feel like I'm going to get I feel like I'm like getting a degree with the pouch, the butts being um being your your permanent storage. You don't lose. Um but we'll cover that again as it becomes relevant. All right. All right. Let's go in. So, escape from Tarov with Click on We are 3 minutes out from another Scav, which means we're going to do a PMC run. We're going to bring in our gear. We're going to put it on the line, boys. So, I think we go to customs again. Bacon. Feeling pretty good about customs. I think I think we got a good one here. I got",
            "start": 4595.04
        },
        {
            "text": "We're going to bring in our gear. We're going to put it on the line, boys. So, I think we go to customs again. Bacon. Feeling pretty good about customs. I think I think we got a good one here. I got 19 and seven. So, let's talk about the times really quick for all the best friends out there. You, of course, it's running on military time. You have day and night raids that you can do. What are the preferred times for best friends who are just jumping in to know the time they see and be like, \"That's what I should click.\" Generally 7 to maybe uh 18 are reasonable, right? Uh it'll be a little bit dark in the beginning or a little bit dark at the end of the raid, but generally that's good for being in the daytime. Some people like going at night though and using that to hide, but some people out there have uh thermal sights and that won't help you. So night's not necessarily safer. Okay, we're going to jump in at 720 right now. Um no practice mode engaged. You can ensure your items. Why",
            "start": 4636.56
        },
        {
            "text": "out there have uh thermal sights and that won't help you. So night's not necessarily safer. Okay, we're going to jump in at 720 right now. Um no practice mode engaged. You can ensure your items. Why don't you explain that to Nick? Oh, Nick can't see the insurance on that yet. Once you go once you do the raid, once you get to the next stage, it'll then cue us to join it and we'll have the same options. Okay. So, I am uh insuring my items for fun and then I've done that. So, Nick, you will see this. I'm up. Okay. All right. So, so I guess Nick, I don't have it yet. You want me to explain this one? Yeah. Oh, yeah. that check box there in the middle of the screen where it says select items Nick and you can hit ensure all and that lets you just say I want to ensure this stuff and if it gets left in the raid you get it back right so if maybe you die to a stab and no one loots your body and it just stays in the raid then it'll come back to you if another player kills you I think the cycle of",
            "start": 4680.08
        },
        {
            "text": "in the raid you get it back right so if maybe you die to a stab and no one loots your body and it just stays in the raid then it'll come back to you if another player kills you I think the cycle of Frontier had this right yeah I think you can insure stuff so we use it usually for insurance fraud right if I kill someone but I don't have enough room to carry their gun I'll drop my gun in a bush I'll take their gun. I get their gun and mine comes back to me. Insurance a day later. So, usually So, you hit the button. Love that. So, should I Now, you need to press the insure button um in the bottom. Yeah, exactly. Okay, perfect. Oh, let's go. Okay. All right. Let's Here we go, boys. Captain Bacon's calling the ball. We follow Captain Bacon. I got the map in front of me to assist. And boys, let's go have a great raid. Here we go. You ready? Can you put us in and then we'll talk real quick about the map to make sure you and I have at least the same map. On that note, you have throw some ones",
            "start": 4728.08
        },
        {
            "text": "go have a great raid. Here we go. You ready? Can you put us in and then we'll talk real quick about the map to make sure you and I have at least the same map. On that note, you have throw some ones in the chat for bacon. Celebrate bacon in the chat and let's go have some fun. I look badass on. You're a bad mother. For fun, you can also got a mustache thanks to bacon. They add it. You can click the eye and on the left side of the screen you can see your friend's gear too if you want to see what they've got going on. What? Oh no [ __ ] If we can see what bacon's got. Let me see what bacon. What? Cheeto fingers got Man, what is this Uzi? It's got a badass U SMG. The M7 was my original gun in um the best gun in this game. Love that game because of that gun. Just like in War Zone, I need it. I'll never forget in War Zone, we started playing dropping in for Dans and Kevin Aex had the anime skin MP7. He is the best. He had that and it was it was the kilo and the MP7 set and it was the the",
            "start": 4773.6
        },
        {
            "text": "I'll never forget in War Zone, we started playing dropping in for Dans and Kevin Aex had the anime skin MP7. He is the best. He had that and it was it was the kilo and the MP7 set and it was the the pink anime skin and I was like I [ __ ] love and that and he shredded people with that. Just kid it out with a laser. It's a laser gun. Click on my guy, Nick. Click on my guy. Oh [ __ ] I hit back. I [ __ ] up. You did. So if you accident it kicks us all out, which is good. We're all out together at least. Oh, thank god. Okay, good. Yeah, that's good. Sorry. That's all right. You got one of our friends does it all the time. Like half the raids he does it. So, it's very common. Oh, thank God. We're back, though. We're so We're so in for raid number two. Here we go. My apologies. No worries at all. Why are we uh putting ones in the chat? We're celebrating Bacon right now. Captain Bacon is here to help me and Nick uh become our very best. And so, we're going to jump in as PMC's. We've",
            "start": 4823.68
        },
        {
            "text": "at all. Why are we uh putting ones in the chat? We're celebrating Bacon right now. Captain Bacon is here to help me and Nick uh become our very best. And so, we're going to jump in as PMC's. We've unlocked uh scav runs again, so we'll do a scav run next. But make sure you have everything. Insure it all. It should stay insured as last time. So, you don't need to do anything this time. Should be good. Yeah, I don't have to do anything. It It'll stay insured until you lose it and you have to like cycle through insurance again. Ah, okay. Okay. All right, boys. We're in. Here we go. Customs. Now, what is customs versus the other map we did? Customs is the map. So, that's just the name of the map. Like a US customs department. Yes. Yes. That's confusing. So, you and I did customs. We're going to go to customs. See, this is what we need to do, Mike. Tell me. I've talked a long time about you and I developing a game together. Yeah. We need to make it purposely abduce. Yeah. And so confusing",
            "start": 4870.96
        },
        {
            "text": "to go to customs. See, this is what we need to do, Mike. Tell me. I've talked a long time about you and I developing a game together. Yeah. We need to make it purposely abduce. Yeah. And so confusing that it doesn't make sense, but it needs to work. But you have to have an advanced degree and like only play this game to figure out how it works. And then we got you. We got you. And then we got you. And it's going to be the hardest game on the planet. And it's going to not be fun to play. I am I'm obviously all for that. I would love to see it. Yeah. Yeah. You and Fran, you and Fran are going to get you. We're going to get you. We're going to get you. Has Fran ever played Tarov? Yes. We got to hit a hit in my chat. He said, \"I played it.\" Hit a friend right now and ask if he wants to join us to play Tarov. Well, that's not exactly correctly. If you have the 866 bullet, it's better than the 867 bullets. It's crazy. It's inverse. Oh, that's too real. All right. So, I can I spent a lot of",
            "start": 4916.4
        },
        {
            "text": "to play Tarov. Well, that's not exactly correctly. If you have the 866 bullet, it's better than the 867 bullets. It's crazy. It's inverse. Oh, that's too real. All right. So, I can I spent a lot of time with Fran. Fran's the best. He's coming in today, is he? Yeah. You're going to see him in like an hour. Well, that's not exactly true. I'll be in 1 hour and 45 minutes. That's difference. I guess I'll be in 1 hour and 75 seconds. Fran said he got deep into the tar off for a little bit. We need to get France's ass in here to play tar off with us. And then we're going to feed him cake and make him gain weight. Welcome to the bread line, sucker. Oh my, dude. I was still dying of that last night, bro. The bread line. [ __ ] hell. Who would have thought we would be the insensitive ones? Uh, no. I always thought other people I thought other people were going to get us in trouble. Is Fran gonna be in person? Yeah, Fran will be here to live react to the Borderlands presentation. I saw one of",
            "start": 4955.28
        },
        {
            "text": "I always thought other people I thought other people were going to get us in trouble. Is Fran gonna be in person? Yeah, Fran will be here to live react to the Borderlands presentation. I saw one of you out there in the YouTube world asking, \"Hey, where's Gamescast?\" Gamescast will actually be today's after post show for the Borderlands uh presentation. So, you'll see a live reaction into Gamescast and that's why you're getting us early today on the afternoon stream. It's Mike and Nick taking over. having a good time with all of you. We're playing Escape from Tarov all week, going from noobs to pros. And of course, we called in the very best. We called in Captain Bacon to come take us through and sherpa our day two because day one day one went well. It wasn't bad by any great. No, it was terrible. Yeah, it didn't go as planned, but it was better than Let's do a quick recap, everyone. And this is where the graphic goes yesterday's game. I got sniped out of zone. Yes. That I didn't know",
            "start": 4999.52
        },
        {
            "text": "Yeah, it didn't go as planned, but it was better than Let's do a quick recap, everyone. And this is where the graphic goes yesterday's game. I got sniped out of zone. Yes. That I didn't know could happen. And then I took one step outside and invisible landmines blew me apart. That was wild. That was wild. And Mike laughed at me both times. I'll be honest. So, you might have had a great game, but I did not have a great day yesterday. Mike, I had a great time. I had a fantastic time. I'll be honest. I got sniped the same way last week. So, it it happens the exact pretty much the exact same thing. It's crazy cuz when I watched it back, it is crazy. You have no idea why you're getting sniped. It doesn't look like you're really out of bounds, but you're kind of pressing the line there. And like the first shot, there's no delineation. The first shot kind of grazed him. I'm like, \"Okay, this is your warning.\" And then Nick, I had no idea what was happening. It was just Jesse Ventur. The",
            "start": 5050.8
        },
        {
            "text": "like the first shot, there's no delineation. The first shot kind of grazed him. I'm like, \"Okay, this is your warning.\" And then Nick, I had no idea what was happening. It was just Jesse Ventur. The first thing hit me. I was like, \"What is that?\" And I turned around and the predator blew my [ __ ] brains out. So, here we are, Nick. Let's hit double zero. Double zero. Double zero extractions. Okay. Okay. We got ZB dorms. ZB and old gas station and railroad passage. Okay. All right. Okay. All right. Bacon, call the ball. Where do you want to go? Tell you tell me what kind of what kind of action you want. We're going to start heading this way to the right just we're not stuck here at spawn. People know where we are. I I think we get a little I think we get a little mild to light medium. We're not going hot and spicy, but we definitely want we want to see one. We want to see one or two. We want to We want to see I honestly think we try obviously Taco's going to interrupt us, but we try",
            "start": 5092.4
        },
        {
            "text": "not going hot and spicy, but we definitely want we want to see one. We want to see one or two. We want to We want to see I honestly think we try obviously Taco's going to interrupt us, but we try and do the same run that you and I did uh last night where we kind of go through the middle. Okay. Okay, head uh head through some buildings, look around, maybe go to dorms, maybe check it out as we go. I love that. I see you're working on some settings. Is something I'll tell you what. Put Yeah. No, no. I'm just doing um I put my crouch to press and that was a mistake. Oh, Bacon. Let's try this. You ready for this, Bacon? Come in. This is Captain Sunburn live on the game chat. Loud and clear. Perfect. Loud and clear. Perfect. 104. Perfect. We're good. We got game chat just in case we need to chat with somebody. I messed up. It's fine. Oh well. I don't need to crouch. All right. They have Wait until Bacon tells you about the crouching. Crouching insane. You can uh you can crouch very",
            "start": 5126.08
        },
        {
            "text": "to chat with somebody. I messed up. It's fine. Oh well. I don't need to crouch. All right. They have Wait until Bacon tells you about the crouching. Crouching insane. You can uh you can crouch very granularly. You can move up and down like this if you want to. Like every like look at this with the scroll wheel. Hold C and then scroll wheel. Yeah. No, we're not in a safe place. How crazy this is. Yeah. Are your crouches? We'll have to go through your menu in a second. Yes, we can do that. I I reset my crouch and I don't think it's I don't think I did the right thing. I think crouch needs to be toggle. Yeah. Uh, it should always toggle essentially, but if it's not toggling much, you can't see it moving much. Maybe you have it set to a certain spot. No, that doesn't make sense. Yeah, you don't have it. Maybe it doesn't go low enough. For simplicity, we're going to go around. We're not going to jump over this time. Unless you want to jump over, but we'll we'll we'll learn some jump soon.",
            "start": 5166.88
        },
        {
            "text": "have it. Maybe it doesn't go low enough. For simplicity, we're going to go around. We're not going to jump over this time. Unless you want to jump over, but we'll we'll we'll learn some jump soon. No, we'll we'll go around. We'll go around. Be easy now. All right. Uh, I'm going to real quick adjust my volume just so I can make sure I hear everything in this game. Oh, who's cracking? So, that was pretty far away from us. That was probably 40% of the map away from us. Maybe a little closer, but probably not. We're going to go around this right here. We're going to watch the left. Someone could be watching down this line. They probably won't be. All right, chat. Of course, let me know if you like the single shots, the double shots. I'm doing my best. And then we now need to cross this land bridge where there could be tons of snipers around watching for us. There's probably not, but they could be anywhere. So, you make sure you have full stamina and you're going to run all the way across",
            "start": 5206.88
        },
        {
            "text": "where there could be tons of snipers around watching for us. There's probably not, but they could be anywhere. So, you make sure you have full stamina and you're going to run all the way across to some kind of hard cover like that uh container or some cement, whatever you whatever you choose. So, snipers would just be guys like us, just a squad like us. It's just someone might be we used to go sit on the bridge and like people cross you trying to take pot shots on them and scare them and stuff, you know, or kill them and take their stuff. All right, we're going to head across. And if you want with you, I'm following this. You let me go first in some of these things. If I get shot at, that's a good warning for you that there's someone there. No, we ride together, die together. Ride it together. Die together. Bad boys. Can I only We go by bad boys for life. Can I loot you? That is a spawn body. That's like static loot, but it does have good stuff in it sometimes. Just uh do it from",
            "start": 5245.36
        },
        {
            "text": "together. Die together. Bad boys. Can I only We go by bad boys for life. Can I loot you? That is a spawn body. That's like static loot, but it does have good stuff in it sometimes. Just uh do it from inside so you're nice and safe. I don't see it. Oh, it's not giving me an option. I believe that one's lootable. Let me check it. You got to really close, but if it's not working, it doesn't matter. No, you should get it. It is there. Okay, that was a He's trying to It must be close. Suppressed shotgun guy pretty close to us. Up this way. I need to figure out where he is. Just be ready for that. Uh you see him going up to the welcome to Tarov van right now is our guy. It's Bacon and myself. Okay, we are now pretty much starting a fight. They're dead scavs here. You're in the middle, Nick. I'll be behind. That means people have killed people here already. They're probably about 30 ft in front of us in a diagonal. Hard to say. Be ready. Make sure you have cover. That's that suppressed",
            "start": 5284.16
        },
        {
            "text": "I'll be behind. That means people have killed people here already. They're probably about 30 ft in front of us in a diagonal. Hard to say. Be ready. Make sure you have cover. That's that suppressed shotgun going off. They're fighting over here other side of this left side of this building. Uh like the big brick building. Bacon's moved up forward to the left hand side of the building by the graffiti. Now they're going to hear us running and good call. That's good call. We just have to be careful that we are aware of like which one is us versus them. Um yeah. He's coming back around the right side. I'm going to run towards him. Okay. This is me. That's me. Hi. Me. Me. You're good. You're good. Oh [ __ ] [ __ ] [ __ ] Oh, I got killed. [ __ ] I saw. He's got him. I got him. Another shotgun guy. All right. Got shot by somebody, Nick. No, I shot Well, yeah, somebody shot me, but I think Bacon might have just killed Did you step Oh, you stepped up over there. Guy got you. Oh, sh got me.",
            "start": 5326.64
        },
        {
            "text": "guy. All right. Got shot by somebody, Nick. No, I shot Well, yeah, somebody shot me, but I think Bacon might have just killed Did you step Oh, you stepped up over there. Guy got you. Oh, sh got me. Sorry. Okay, so you stepped up in here. I see where you're at now, Nick. So, the shocking There's another shot guy over here in this bush somewhere. I'm not sure where. Okay, I'm with you. I don't know exactly. He's somewhere over that way. I'm going to look from the other side. Sorry, Nick. I'll stay on my side. Oh, you're good. That's all right. All good. I got insurance. It happens in war. I don't see him, but he could be literally anywhere. All right. I'm staying at top a big rock pile. Oh, I'm getting shot at from their side. All right, I'm going to come back to you. I'm running back from above my head. All right, so I'm going to show you where he is. This way. He's over there. He's other way through this uh broken wall near that brick building. So, we're behind that white wall for",
            "start": 5372.88
        },
        {
            "text": "above my head. All right, so I'm going to show you where he is. This way. He's over there. He's other way through this uh broken wall near that brick building. So, we're behind that white wall for right behind you. I'm on your six. Wrap left. Yeah. Yep. 10 for on your six. Let's do it. He's going to know we're coming, but he's got a shotgun, so we might have a chance. Okay, I'll be ready to blast off. He's smart. He's hiding in those bushes probably. Can't quite see him. Okay. Getting closer on that. Back up into this area on my left here. I'm going to quickly go make sure he's not over here first. 104. I'm on your six. This is insane. All right, I'm going back to you. You going in? I don't see him, but who knows? I'm watching the bushes still. I was might be camping this little gap right here. 104. We got on my right something. Could be in this building, actually. This building's open. He could have shot us through the building. I don't think so. Okay. Um, let's push to this way and",
            "start": 5423.12
        },
        {
            "text": "here. 104. We got on my right something. Could be in this building, actually. This building's open. He could have shot us through the building. I don't think so. Okay. Um, let's push to this way and go find out. Yep. Grenade. I'm going to push at it, actually. Okay. I'm at you. I'm at you. I'm on your six. We're going to try We're going to try shooting somewhere. I hear him in the back. Y 104. Let's try and get this door open. On the fence you're looking at. We're in a bad spot. 104 coming in. Come inside. Cool. Now guy in the doorway. Scav shot at me. I had to shoot. Yeah, we always kill scouts. You kill everything that's not me or me. That's fine, too. Better than hesitating. I'm in. Where are you? And I got the guy. He was uh hiding in that bush out there. I got one of them, but there might be another one. Nice shots. I'm up top now. This laser on up top. 104. All right. It seemed like there might have been two. Let's make sure there's not a guy up here. Okay. And I need a heal.",
            "start": 5485.2
        },
        {
            "text": "might be another one. Nice shots. I'm up top now. This laser on up top. 104. All right. It seemed like there might have been two. Let's make sure there's not a guy up here. Okay. And I need a heal. I'm inside and lost. You do. You have heals. There's a bunch of dead people in here. Yeah. This the fighting happened in here. There's a bunch of loot and dead guys in here. Uh, not a bunch. A little. A little. Now, do do you have to heal because they shot you or because I shot you three times? Let's say it was them. Let's say it was all them. I'm laying down to heal. That's all we'll say is them. Chad, be cool. upstairs. I'm laying down, Mike. So, anything you see is an enemy. 104. Now, let me ask you this question. Yeah. As you guys are in this situation, if by the end of this game, if you were to drop your gun and I were to pick it up, do you get your gun back if it's insured? And then, can I keep that dope ass SMG? You cannot. No. So, if uh if someone another player takes it out, the",
            "start": 5537.84
        },
        {
            "text": "were to drop your gun and I were to pick it up, do you get your gun back if it's insured? And then, can I keep that dope ass SMG? You cannot. No. So, if uh if someone another player takes it out, the insurance is canceled. Oh, okay. So, insurance is only for stuff in the map. So, like if I These guys are so I will throw your stuff maybe in the lake or hide it in a bush somewhere. That way nobody finds it and you get it back. But you won't get it back for like a day or so. So you can't trade guns with You can you can you just don't you can't I can give you whatever you want. We can drop in the ground. Oh, you have to get my own. Yeah. Well, I don't want you know and that is usually weapons back and forth. You know, if you got something fun. Yeah. All right, Mike. So, what you might want to do is come over towards me where I'm healing over here on the ground. Uh, pathetically, I don't know where you're at. I'm in that building we walked in. I'm looking at two trucks right now. Okay. I'm",
            "start": 5582.0
        },
        {
            "text": "do is come over towards me where I'm healing over here on the ground. Uh, pathetically, I don't know where you're at. I'm in that building we walked in. I'm looking at two trucks right now. Okay. I'm going to step up to the white truck. This is me stepping up to the white truck. I think I was looking at a delayed stream. I'm back to get my flashlights on. Hi, this is me. I see you. Yep. Now I see you. Yeah. Yeah. Oh, you were in this room. Okay. Yeah. I had no idea. I peaked out this window and he was there looking at us in that bush right there. That orange bush. And that's where I got him from. Yeah, I see it. Um, now this guy died right here. This guy's pretty He's got some good stuff on him. So, take this guy's stuff. This guy's actually really good. Guy next to us. This guy died. Uh, oh yeah. Oh, yeah. He was up in the window. Got him. He might have heard a step down to our left. Very faint. So, I'm not sure, but just be ready. There might be someone else nearby. All right. I'm",
            "start": 5624.4
        },
        {
            "text": "oh yeah. Oh, yeah. He was up in the window. Got him. He might have heard a step down to our left. Very faint. So, I'm not sure, but just be ready. There might be someone else nearby. All right. I'm currently searching him really fast. Yeah, you can take all that stuff. I didn't kill that guy, so that means it's fair game for whoever wants it. So, feel free to run and grab it. Fuel. Is fuel any good? fuel is valuable later on once you have the flea market to sell it. Right now, it is definitely not worth the space, so leave it behind. Um, that armor he's wearing is probably pretty good. I'll come check it real quick and tell you if it's good or not, but you can also inspect it yourself and see what level the plates are. And that face plates are level mask is really good. I know your mustache and sunglasses are cool. I have it. Yeah. Yeah. I'm gonna I'm gonna take it. I wear put it on, Mike. But I'll even take the free that's a ballistic face mask. It'll block bullets. So, if you want",
            "start": 5663.28
        },
        {
            "text": "and sunglasses are cool. I have it. Yeah. Yeah. I'm gonna I'm gonna take it. I wear put it on, Mike. But I'll even take the free that's a ballistic face mask. It'll block bullets. So, if you want to take your your mustache and glasses off, you can put that on. That's your cho choice. Style versus safety. All right. Um, now what could Mike just put the body armor on? Uh, he could, but you had to take off his rig because his rig is armored and my rig is Oh, your rig is armored. Oh, that's sway. I didn't get an armored cool rig. There's a guy in that doorway walking in. It's a scaff. So, we're going to head back out there and we're going to look around. Uh, as we do it, we want to move pretty quickly, right? In case someone's sitting in a bush. Did you just jump? Yeah, you just jumped and fell. 10. So, we're going to go run around real quick and just see if someone shoots at us. Hopefully, they don't. Now, did that scaven see you in yellow or did it see somebody else? No. Make it behind",
            "start": 5699.36
        },
        {
            "text": "10. So, we're going to go run around real quick and just see if someone shoots at us. Hopefully, they don't. Now, did that scaven see you in yellow or did it see somebody else? No. Make it behind you. Did not see you. They did see you. It's here. Yeah. Okay, cool. We're good. Oh, okay. Cool. All right. All right. I'm with you. There should be one more player around just guessing wise. There always is. So, okay. He's just waiting. He will wait and watch the bodies until we get near it, then try and kill us. Then, so we just kind of do a full circuit of what we did to kind of just clear out the bushes and slowly kind of hone in on it. Um, we also I killed this guy. This is the guy that killed Nick. Um, yeah. So, we can take any of his stuff we want to. Um, we should at some point. All right, I'm going to loot. Stepping up. Taking a look. I'm gonna drop Nick stuff on the ground just so that it comes back to him. Will probably see it. Um I'm gonna hide one of his good things that you That",
            "start": 5743.04
        },
        {
            "text": "I'm going to loot. Stepping up. Taking a look. I'm gonna drop Nick stuff on the ground just so that it comes back to him. Will probably see it. Um I'm gonna hide one of his good things that you That was not me. No. What's the virtue of hiding? So I'm hiding it. That way it'll people probably won't find it and you'll probably get it back in insurance, right? If I leave it in your body, someone's going to come grab it and and steal it for free. So I'm going to put it in a bush at least so it's a little harder for them to to grab it. Um if it was really valuable, we'd go hide it like in a lake somewhere so they definitely couldn't get it. All right, Mike. So, how long until it comes back to me? Like, when all you guys exit the game, do I get it back then or does it have to like a day or so? I'm coming back towards you, Mike. This is me. We're going to stay together. We're going to go out the rest. 10 for 10 on your tail. Here we go. Can you see the game? Okay, cool. I can see you, buddy.",
            "start": 5790.8
        },
        {
            "text": "coming back towards you, Mike. This is me. We're going to stay together. We're going to go out the rest. 10 for 10 on your tail. Here we go. Can you see the game? Okay, cool. I can see you, buddy. I'm watching this. I'm learning. I'm learning lots of stuff here, Mike. Good. Just take it slow by bacon. I'm on a six. I usually like to be in the back here. I'm like a half second delay, unfortunately. Hey, uh, when it comes to like game play against, you know, if like somebody rolled up on Bacon, but I'm at least behind him. I think I hear something else. Yeah, right above us. 104. Guessing it's a scab, but we'll see soon. Is this cool gun you have? You have an AUG? Got an AG, buddy. What the hell did you do last night? We [ __ ] killed. Nice. Got him. All right, I'm going to push through this area. [ __ ] murder that guy, bro. Was it a scab? Okay, I got to need to go big. Someone just shot at me. I think it was a scab, but we don't know. Could have been like stop Call of Duty. One of",
            "start": 5828.72
        },
        {
            "text": "this area. [ __ ] murder that guy, bro. Was it a scab? Okay, I got to need to go big. Someone just shot at me. I think it was a scab, but we don't know. Could have been like stop Call of Duty. One of many places. I do a panic. Panicked. Okay, player. I'm backing off. Probably not a scaff. I'm not near you, but I'm going to come towards you. I'm running your way. So, he's somewhere back there, but we don't know where, right? And it's kind of up to you if we want to push him aggressively, grab our stuff, and go a different way. I'm looking. I don't see anything. I'm still in that fence that you came through. Uh I'm on your stairs now. Right here. Okay. I am up. Yeah. Yeah. I'm up elevated. Trying to take a look. I am going to push forward uh through the building and see if I can see him. 104. I'll hold this angle for a minute and then you tell me what you see. Just going to scaff. Okay. 104. I'm looking hard now. when you're up there. So, it might pick you off, but you're pretty safe.",
            "start": 5876.8
        },
        {
            "text": "I'll hold this angle for a minute and then you tell me what you see. Just going to scaff. Okay. 104. I'm looking hard now. when you're up there. So, it might pick you off, but you're pretty safe. If you want to push and be more aggressive, you know, we can, but it's just it's just risky. So, [ __ ] yeah. We're going to be aggressive. Oh, you hear them fighting right now? That might be them getting attacked by a scav. Is that inside the building? Where I am? That doesn't sound the building. That sounds I'm not sure to be honest. All right, I'm stepping up. I'm stepping up towards the doorway that we entered. I see them. They're looking right at them. They're right over there where you're looking. I'm to your right. I'm to your right. There to your left. There's a scab to your left as well. Okay. I'm looking by the empty building. By the cleared out building. Yeah, that way. Yes. Threetory destructive building. That's me shooting. You're good. That's me shooting. You're good. They're",
            "start": 5924.88
        },
        {
            "text": "Okay. I'm looking by the empty building. By the cleared out building. Yeah, that way. Yes. Threetory destructive building. That's me shooting. You're good. That's me shooting. You're good. They're 104. I don't see anyone yet. I'm keeping eyes on it though. Y I need to pack a mag real quickly and they'll be good to go push them. They might have died to that scav. They might not have. Okay, I'm getting a different angle. I'm stepping up. I'm behind the rebel now. Okay, they're somewhere off to the left over there. I'm not sure where. I got a half full mag. Watching the fence line. I'm stepping up towards the fence line now. I'm running up to the destroyed building. Okay, I'm going to be at the base of the destroyed building. 10 four. I'm on the left hand side of the destroyed building walking up in the fence line/bushes now. I see one dead ahead of me. He's not moving. Could be a scav. Took shots. I'm going up and he was behind the yellow box, yellow cargo bin to the far right. He was",
            "start": 5968.56
        },
        {
            "text": "up in the fence line/bushes now. I see one dead ahead of me. He's not moving. Could be a scav. Took shots. I'm going up and he was behind the yellow box, yellow cargo bin to the far right. He was on top of the destroyed building. 10 four. Oh, he was at the top of the destroyed building. [ __ ] he was wearing a Twitch armband. Might be an extreme. Yeah, big save. Okay, that is a scab you saw up there ahead. Um, okay. You shooting just now. Uh, that was not over there near you to your left, I think. I'm not sure where. Yep, I see them. Oh, I got them drop. They're on the sniper hill across the um the fence from me. So, we're safe. Across the way. Okay, so I'm good on the wall. I'm going to I'm going to crouch. I'm going to double check my weapons right now. Make sure I'm still loaded up. And jumped off the thing and broke both my legs. So, I'm going to fix my legs. Okay. Um Okay. Yeah. So, there's a player hiding in the woods to the left of us there. Crazy. There's someone creeping up",
            "start": 6007.44
        },
        {
            "text": "jumped off the thing and broke both my legs. So, I'm going to fix my legs. Okay. Um Okay. Yeah. So, there's a player hiding in the woods to the left of us there. Crazy. There's someone creeping up behind us as well. Behind you where you came through in the fence line. Pretty much behind the broken building. Just coming now. All right. Get out of your menus. M. Get out of your menus. There he is. There's a scab. I got it. We got it. Nice. Good luck. Got him. There's one more. Yeah. More scav. I'm coming. Missing a lot. Shooting back at me. We're good. I think you I think you got him. All right. There. I'm over. Yeah, I took a couple shots there, but I'm fine. I'm going to heal really quick. Good work. I did hear more moving outside the fence. It could be another scav. It could be a player, though. I think what we need to do is we need to grab some of this stuff and start moving on before we get swarmed by a bunch of player scavs. So, like the people who are doing the scatter runs are",
            "start": 6056.64
        },
        {
            "text": "though. I think what we need to do is we need to grab some of this stuff and start moving on before we get swarmed by a bunch of player scavs. So, like the people who are doing the scatter runs are spawning in. They're hearing all this noise and they're coming to come to get us. I'm checking my uh I still got to check my guns really quick. Unload. I'm inspecting all my ammo right now. And there's fast ways to do that. You'll figure out other ways to manage it and stuff, but that's a great way to start. Someone's running in. So, how do I pack them? I need a pack. Just another scab. Man, they've turned up the scabs a lot. There's another scab in the middle. I need to pack ammo. Um, so you can just drag ammo to your things and pack it in. That's fine. I'll come over there to help help you out. Guard you a little. Oh, wait. I'm going to actually quickly loot this player we killed so we're not to be here any longer. This is [ __ ] crazy. This is crazy. [ __ ] Yeah, I know. You're flying,",
            "start": 6102.08
        },
        {
            "text": "Guard you a little. Oh, wait. I'm going to actually quickly loot this player we killed so we're not to be here any longer. This is [ __ ] crazy. This is crazy. [ __ ] Yeah, I know. You're flying, dude. I'm really learning a lot. I'm packing right now. I'm packing my ammo. I'm good. Okay, I'm figing it out. Chad, how proud. We're so proud of my Holy [ __ ] bro. Everyone give my This [ __ ] is wild right now. You should be packing this by hand, one by one. What the [ __ ] is happening here? All right, I'm almost done. I need to pack up both and then we can we can get out of here. This guy had What happened with that guy you killed up on the top? He's got single shot sniper rifle, but really well set up. Gap coming in. Hold on. Nice. Rogue four. I am taking all this in. I'm watching my heal. I'm watching Mike reload all these guns. Like, this is a very it's it's good. I'm super jealous of Mike's sick aug. I'm coming. I'm running at you now, bro. Okay. I was going to say here steps. The",
            "start": 6143.36
        },
        {
            "text": "I'm watching Mike reload all these guns. Like, this is a very it's it's good. I'm super jealous of Mike's sick aug. I'm coming. I'm running at you now, bro. Okay. I was going to say here steps. The bushes outside are an enemy, so we're going to head on. This is mehi. All right, 104. One sec. One sec. Yeah. God, your that SMG is so sick. Got to unload this. I have to reload that. That's an enemy. That's an enemy. They're shooting at you. Yeah, he shot at me. I killed him. That was a scav. Yep, we're good. Uh the Geek Fam says if you're using a 10 rounder, set the gun to single fire and not fall out. Yeah, I took off those 10 rounders. Thank you, homie. Right. Yeah. All right. Uh we needed to loot some of these bodies. Yeah. Um do you have any loot already? We don't need to w the scavs. Uh, no, not really. I only took that guy's shotgun. I haven't took that armor. The armor is good and the face mask is good. Oh, yeah, the armor. Yeah. Yeah. Oh, guy's running around. It's a scaff. He got",
            "start": 6194.88
        },
        {
            "text": "no, not really. I only took that guy's shotgun. I haven't took that armor. The armor is good and the face mask is good. Oh, yeah, the armor. Yeah. Yeah. Oh, guy's running around. It's a scaff. He got shot in the back, just so you know. Then let's Unless you blew his ass up, but it looked like bullets. Let's get out of here. Let's move from a different spot. All right, I'm on I'm on your tail. Let's get out of here. There is a ton of loot on scavs. Another one right there. Jesus Christ. That's Is that you running into the broken building there? But you can leave them, too. Yeah, you can just ignore it if you want to save ammo. Okay, I'll ignore that guy. Move away from say shoot in the back is all this is me. Yeah, I'm with you. All right, we are going to try and just get the hell out. Um, yeah. 10. If you press O, quick tip, you'll see that dorm's vex is now red. That means someone has already taken the paid vehicle extract. Yeah, double for you. Sorry. What is What What's the average",
            "start": 6250.0
        },
        {
            "text": "yeah. 10. If you press O, quick tip, you'll see that dorm's vex is now red. That means someone has already taken the paid vehicle extract. Yeah, double for you. Sorry. What is What What's the average group that you come across? Are there people rolling trios five times? I would say the average was probably two, maybe three. Um, depending on when it isn't wiped. So, you're never coming up against a five stack. Not often, but as soon as you tell yourself that, it's a five stack. As soon as you think, \"Oh, I got the fourth guy. There couldn't be another one.\" It's a five stack and you're pretty much done, right? I mean, the fun thing about this game is you you can actually win us a fight against a 5second. That's like the peak of enjoyment in this game is, you know, hitting killing five is one. But because one bullet kills a guy, you can easily do it. It's just uh you got to be good. Got to get you just got to get to hear your shots. That's so exciting. It's so exciting. My character is",
            "start": 6289.6
        },
        {
            "text": "But because one bullet kills a guy, you can easily do it. It's just uh you got to be good. Got to get you just got to get to hear your shots. That's so exciting. It's so exciting. My character is in a rough shape. All right. Um so yeah, we're just going to try and hit old gas. You need anything? You good? You good, baby? I'm going to probably drop some armor here in a second once I get to this next spot cuz it's too heavy and I'm just walking slow. I still got I'm guarding our six. Geek fam, that's a good that's good. I'm going to swap that O right now. I think I've lost it. I'm right on this corner here. Um, yep. Put my armor there. So, probably won't see it. If I lose it, no big deal. I still want to keep I don't want to slow us down by pausing all the time. We're good. We're fine. Now, you remember this is where we killed those guys last night. Yeah. Oh, yeah. Old gas is off to our track. Um, if smoke is lit, we can take that. So, we're going to see if we can peek the smoke from",
            "start": 6332.88
        },
        {
            "text": "you remember this is where we killed those guys last night. Yeah. Oh, yeah. Old gas is off to our track. Um, if smoke is lit, we can take that. So, we're going to see if we can peek the smoke from here. I don't know if we can cuz this is new to me. I don't see it. Yeah, we'll go that anyway just to check. I'm with you. Save us a little bit of time. That's crazy. It's like walking through bushes and it slows you down and [ __ ] A lot of people really mad they changed that. It It is for the best, but it is annoying. I love it. Uh earlier he was trying to jump over this. You can't vault over this. There is a really really tricky way to jump over it. We're not going to get into that, but you can technically jump over it, but it's okay. Very tricky. You got to jump under the tree, then jump off it. Got it. Okay. I have a few bullets. Another one coming through the door. Watch out. He's stuck in the door. Yeah, I see him. Reloading. So, old gas. The smoke is off, so it's closed. So, we got",
            "start": 6376.08
        },
        {
            "text": "it. Got it. Okay. I have a few bullets. Another one coming through the door. Watch out. He's stuck in the door. Yeah, I see him. Reloading. So, old gas. The smoke is off, so it's closed. So, we got to head on. We're just going to head on and one is to inspect the gun again to see how much ammo I have. That's going to be for you. Yeah. Alt T. Alt T. Control T. I'm not sure. Alt T. There it is. Fewer than half. Good to know. It looks like we're a little bit lucky at least. Okay. The sniper scout is up top. We're not going to shoot him. We're hope he doesn't see us. He's top of that building. That's the guy shot at us last night. Yeah, I see him up there. Yeah. Uh-huh. Now I finally see him. Uh, sorry. Look at that. He was right. There is also one that spawns on top of that one that he saw in the middle in your last cave run. Really? Yeah. What do I If this light is lit, that means this extract is open. So, if you have this extract and the light is on, you can take it. What light? If",
            "start": 6423.92
        },
        {
            "text": "in the middle in your last cave run. Really? Yeah. What do I If this light is lit, that means this extract is open. So, if you have this extract and the light is on, you can take it. What light? If it's off, that means this isn't working right now. How can I tell if that's on or not? It's obvious when it's off. It's not obvious when it's on. Okay. Okay. I said that, but uh they've changed it. Um that is out of date information. That is out of date information. I'm like, what the [ __ ] is happening here? Usually that is I think maybe that's something new for transits. I don't know. Chat can correct me. We're getting out of here before that guy with a I stomped on that [ __ ] bar. See number of justicees. You need the code for that. Cool. Awesome. I want to look into that. I have not played any this wipe except for like three games. So, got to get ready for this. Okay, we got a sniper above us. I hope that's all I heard. There's another player coming behind us that I am not equipped to",
            "start": 6473.52
        },
        {
            "text": "any this wipe except for like three games. So, got to get ready for this. Okay, we got a sniper above us. I hope that's all I heard. There's another player coming behind us that I am not equipped to fight. I'm out of ammo. So, we got a player to our right. All right, I'm ready. I got guns. They're right outside the stance line. Okay, come quick and catch me. Quickly catch up to me as fast as you can. All right. Yeah, that broken hole. If they're trying to push us hard. Left side. Left side on if we can. If you want to fight them, we can, but I am out of ammo. So, I've got I'm ready to fight him if we need to. We're going to head towards extract is my goal. Where are you? This at the end of the train. Flashing at you. You went up the train line. Got it. Yeah, I'm on you. I'm on you. Sorry that we're running away from a fight. I just don't have the ammo and I don't want you to die this close to the Yeah, that's the right call. It wouldn't be good without you. Yoyo. All right, we are",
            "start": 6513.36
        },
        {
            "text": "that we're running away from a fight. I just don't have the ammo and I don't want you to die this close to the Yeah, that's the right call. It wouldn't be good without you. Yoyo. All right, we are almost to the extract. Catching up now. That was crazy. That was a lot of fighting. That was way too many uh scabs. That was a lot, bro. I'm [ __ ] tensed up. All cranked up here. All right, I'm behind you. All right, got to hope there's somebody just waiting in this building to uh to get us by surprise. And always expect someone to be waiting down here. It's rare when it happens, but it is annoying. All right, we made it. Clear. Um, cool. Second successful run. Holy [ __ ] There it is, ladies and gentlemen. It's a tough one. That's a tough one. Sorry that took us so long, Nick. Usually if No, that was great. It was really fun to watch. If like we're like established in the wife, we have a bunch of gear and we don't need to like care about getting the stuff out. At that point, we just push",
            "start": 6558.72
        },
        {
            "text": "that was great. It was really fun to watch. If like we're like established in the wife, we have a bunch of gear and we don't need to like care about getting the stuff out. At that point, we just push aggressively hoping we get them or we die and then it gets you back in the game faster, right? But since we want to get Mike the stuff, uh, that's what we're going to do. No, this is great. Again, this year these are we're on fact fighting missions. Oh, I feel I feel like I got I got we got three PMCs that time. [ __ ] yeah, bro. Yeah, we were shooting, dude. We were shooting. Surviving is a win. We take a survival win right there. All right, now cool. So now tell me tell me bacon. We can probably do a scav just to let uh Nick get back in the action quickly and then we can choose if he wants to go through the practice of building a kit or I can just quickly grab one of the kits I've already set up and bring that in a backpack for him too. And we can choose which we want to do the next",
            "start": 6635.92
        },
        {
            "text": "to go through the practice of building a kit or I can just quickly grab one of the kits I've already set up and bring that in a backpack for him too. And we can choose which we want to do the next one. But let's do a scav just to get them back into it. Yeah. Yeah. Let's get a scab back. Let's get a scav in. Let's get Nick back. We got to get some gear here. So we're going to just quickly jump into a scav. So everybody stretch out really quick. Everybody tuning in. Thank you all so much for your support and of course thank you to Bacon for giving us his time and coming in and playing with us being our Sherper today on day two of our Escape from Tar off adventure. Of course, don't forget we truly appreciate your support here on Twitch with your Twitch subs cuz keep those rolling and let's have some fun. Here we go. All right, Nick, we're jumping back. So, now we're doing a scav mission. None of this is on the line, but we want to come out with some loot for sure. Got it. Check. That was",
            "start": 6677.68
        },
        {
            "text": "some fun. Here we go. All right, Nick, we're jumping back. So, now we're doing a scav mission. None of this is on the line, but we want to come out with some loot for sure. Got it. Check. That was good [ __ ] Yeah, I was trying to keep you in the middle, Nick, but maybe you be Do you want to be third in line? I just got to move slow and I'd be in the middle. Be way more cautious. I'm just not cautious enough here. Yeah, you got to be real cautious as well. I got to just only a couple shots. I got those guys. You got to air. Yeah, it's okay. I'll just I'll fight you guys in the map. Yeah, we'll come to you. Those guys had a certain quest where they need to kill people kill players while using that shotgun. and it's hard to do. So, they were playing super aggressive. So, even if you had hid, they would have they would have come for you and found you. Um, it was just bad timing that you were distracted looking at me whenever he was rotating around behind you. And we just have to practice",
            "start": 6716.88
        },
        {
            "text": "they would have they would have come for you and found you. Um, it was just bad timing that you were distracted looking at me whenever he was rotating around behind you. And we just have to practice that to communicate that. So, their mission there to kill people with the shotgun. Um, like if they die, do they still get those kills for the mission or do they have to get the kills and then No, doesn't matter if they die. They just have to get the kills, which is good because you Okay. As long as they get the kills, the go quest. It's It's a quest where you end up buying like 40 shotguns. You insure them all and then you just forever have a cycle of shotguns coming back in your insurance till you give up on them. All right, so we have me. Oh, you got a really good gun. That's a really fun gun. That's a fun. Okay, cool. Cool. Cool. I have a Walther PPK. And then I'm going to show off Nick. I have the world's smallest is loading in. And we will find Nick, you and I, right away. Yep. Are",
            "start": 6761.2
        },
        {
            "text": "gun. That's a fun. Okay, cool. Cool. Cool. I have a Walther PPK. And then I'm going to show off Nick. I have the world's smallest is loading in. And we will find Nick, you and I, right away. Yep. Are you Jesus? Uh, okay. That scared me. There's a player right beside me. I am not near you. I'm at scabboat. I don't know where you are right now because you're showing Nick's screen. Um, yes, I am by the double spot. You are at factory far corner. That's at top left of the map. I am almost the opposite side of the map. I'm going to start heading your way, but there is players fighting near me. Oh [ __ ] There is There is multiple smoke stacks. Okay. Yeah. Yeah, there is. How about we meet? Well, let's find out where Nick is and then we'll go from there. We're going to meet at Nick. I'll feel comfortable making my way to Nick as long as you tell me. Geekfam says, \"Yeah, factory far corner. Good to know.\" Frank, hey, hey, Frank Furer. How are you? Yeah. So, this is where you and I just",
            "start": 6800.4
        },
        {
            "text": "comfortable making my way to Nick as long as you tell me. Geekfam says, \"Yeah, factory far corner. Good to know.\" Frank, hey, hey, Frank Furer. How are you? Yeah. So, this is where you and I just escaped pretty much as well, too. Yeah, I literally see the exit right there. Yeah, that's cool. So, I could just scav sit here and wait for PMC's to possibly come to this extraction point in hopes and just kill them. Pretty common practice called um Xville camping. You know, hanging out the extract and doing that. You you can do it. The problem is there's enough extracts now where you might just sit there for 40 minutes and be bored, you know. Yeah, there's going to be a low likelihood they're coming in. That's right. All right, I'm in. All right, he is where I was. I'm going to go grab him. I'm headed back to him right now. Okay, you're you were with him. Okay, cool. I'm making my way. Let's meet at Fort and then uh go wherever you want to go. I'm just cuz that's the middle. You can runong",
            "start": 6840.72
        },
        {
            "text": "headed back to him right now. Okay, you're you were with him. Okay, cool. I'm making my way. Let's meet at Fort and then uh go wherever you want to go. I'm just cuz that's the middle. You can runong I don't know where you are right now, but you could run along that railroad and jump over the fence. I'm lit. Yeah, I'm literally doing that. You You read my mind. That's right. Yeah. I'm just going to follow this line. And then it seems like now going through old gas is a slightly more dangerous way. So you can go left through old gas or you can go right through that little alleyway we've been using the broken fence into that big building. Yeah. So your choice, Nick, I'm almost to you. Um Okay. I'm not going to do it right now, but you can shoot in the air just as a signal to help find your teammates when you need to. Um but I can also do this. How would they know? You just hear it. You hear me yelling in Russian? That's me yelling right behind you. Yeah. Yeah. If you double tap F1, you",
            "start": 6880.4
        },
        {
            "text": "teammates when you need to. Um but I can also do this. How would they know? You just hear it. You hear me yelling in Russian? That's me yelling right behind you. Yeah. Yeah. If you double tap F1, you hear me? Yell. If you double tap F1, you'll yell out and exclaim something. Amazing. God bless the Russians. They really are the greatest. If you're on a scav run and you're not sure if an enemy is another scav or a player, you can yell out and that might let them know that you're a scav and they if they're a scab might be nice to you. If they're a player, they might not. All right. So, if you want to learn landmark stuff, we can, but we don't really need to, I don't think, yet. Um, but we're kind of in the middle of the map area. And, uh, we just died over that way behind those. You died earlier behind that fence over there. That way. Um, and he is now Yeah, where that shot is. That's about That shot is about where you died last time. Um, that sounded close. Might be running to our left.",
            "start": 6918.88
        },
        {
            "text": "behind that fence over there. That way. Um, and he is now Yeah, where that shot is. That's about That shot is about where you died last time. Um, that sounded close. Might be running to our left. Let's head on. Let's go this way. So before when you ran into bushes, did it not slow you down? Yeah, before that was a good while ago, but for a while there wasn't that. And there also used to not be like momentum, if you'll call it, so you could move around a lot more quickly. It didn't feel as heavy, but it was a problem to be honest. It was a problem. Yeah, the heavy feeling is wild, man. to feel the momentum build up and slow down and then move again is like a wild feeling. All right, Mike, where you at right now? I can't quite see your screen. I am approaching Fortress right now. We are the railroad right in front on the right. Uh we took a little bit of a risky route for the record. Uh we usually wouldn't go this way, but it seemed like it was safe this time. And we're right behind",
            "start": 6963.04
        },
        {
            "text": "the railroad right in front on the right. Uh we took a little bit of a risky route for the record. Uh we usually wouldn't go this way, but it seemed like it was safe this time. And we're right behind those trains ahead of you. I'm stepping into the coming. Um, we've t talked mostly about like, you know, killing players, looting bodies for looting. Once you figure out what's good and stuff, you can also loot um, uh, containers and items in the ground, right? Like, for example, I know that there's usually ammo spawns on these boxes and blankets over here unless someone's already picked them up, which they have, right? But you'll know, you'll know certain spots where you'll find, you know, good ammo, good medicine, etc. So, yes. Okay. Okay. All right. We're at 15 minutes left. Um, Sally, we are going to be We have a I have a trailer park extract. What extracts do you guys have? We can tuck into this building so we're not out in the open. I have old gate railroad railroad boiler room.",
            "start": 7017.04
        },
        {
            "text": "we are going to be We have a I have a trailer park extract. What extracts do you guys have? We can tuck into this building so we're not out in the open. I have old gate railroad railroad boiler room. Okay. I have sadly never scabbed this map. So, I'm going to quickly pull up my uh customs map and check them. So, you and you and Nick could go trailer park together. Is this a scab? And I could go railroad to port or railroad to tar off. Oh my god. Is that a scab that just ran past me? Maybe. Do you see? Do you see your Yeah. Remember, you're a scav, so they're not going to come after you. Do you see your good option? I could. Yeah. So, my good option if we were to go to dorms. Hey, someone just jump behind us. I have Old Gate Road, which is literally right behind Uhoh. Looks like you're not a scav dropping. I don't think they do that now, but who knows? Okay. I'm with you. I don't know where Nick is, though. I'm inside the building. Might have been I'm inside the building by the truck.",
            "start": 7061.44
        },
        {
            "text": "a scav dropping. I don't think they do that now, but who knows? Okay. I'm with you. I don't know where Nick is, though. I'm inside the building. Might have been I'm inside the building by the truck. It might where you are. I'm by a truck. Okay. Nick's in the big I'm behind by us. Cool. Okay, that's me screaming. All right, so like I said, if we go to dorms, I have the dorm x fill, so I can just go there and you and Nick can go your own. Yeah, we can go ahead head by dorms, see if anything happened there, any to kill anything to loot, and then uh we can get him out with about 5 minutes to spare. Cool. Nick, come on back to that truck and we are moving forward. Uh it's also a good place to check his stronghold in the middle. You want to check that out too for the first time. That's kind of the equivalent to dorms side of the map. They're both big fighting centers with a bunch of loot. Oh, you actually check it out. Did they only give you a pistol, Nick? Uh-huh. Yeah. No [ __ ] I have a",
            "start": 7102.0
        },
        {
            "text": "the equivalent to dorms side of the map. They're both big fighting centers with a bunch of loot. Oh, you actually check it out. Did they only give you a pistol, Nick? Uh-huh. Yeah. No [ __ ] I have a wealth of PvK just like James Bond. That's [ __ ] wild. I asked for it though. I said, \"Give me the James Bond special.\" That's all he needed. That's all I need. That's all I need. I will say that if you kill a bunch of scavs while you're playing as a scab, it'll lower your reputation. You'll get worse stuff. So, if I wouldn't worry about it, honestly, but uh that is one thing to keep in mind. All right, so now we're in stronghold, a fortress, whatever people call it. That's a suppressed gun that's right in the middle of the map. That's pretty close. Um we're going to need to watch out for that. But this room right here is good loot. This big green box is nice. And then leaning around these beds, you can find good ammo and stuff, though right now it's mostly bad ammo. Um and then in the",
            "start": 7146.8
        },
        {
            "text": "But this room right here is good loot. This big green box is nice. And then leaning around these beds, you can find good ammo and stuff, though right now it's mostly bad ammo. Um and then in the other room in the front left, there's some big crates. I'm going to go up top. Uh you can feel free to come with if you want to. We're gonna go look and see if we see those guys. We're just shooting. I'm going up, Nick. Okay, I went up the stairs behind you. So, you can be seen from everywhere up here and you get silhouetted really easy. So, just try and keep moving um and not be too exposed. I don't see them, but that doesn't mean anything. So, we're going to keep looting around and look around for stuff. See what we find that's interesting. Um, again, these big wooden crates are good things to loot. Just nice and simple and easy. Um, are we all three upstairs now? I think. Yes, I think so. Um, also for fun is this grenade launcher. I wouldn't really recommend getting on it because if",
            "start": 7186.48
        },
        {
            "text": "to loot. Just nice and simple and easy. Um, are we all three upstairs now? I think. Yes, I think so. Um, also for fun is this grenade launcher. I wouldn't really recommend getting on it because if someone's easy, they can easily kill you, but you can also shoot grenades across the map, which is a really really fun way to surprise people. That's kind of sick. All right. Do you want to push towards the next sound? Do you want to or do you want to go towards um you know extract? Nick, what do you feel? I think we Well, I'll leave it up to you guys. I think we push to the next sound. Yeah. So, let's move in the direction of our extracts. Uh but the last time we heard was this way. So, we're going to go ahead and head that way. So, I'm heading downstairs towards the front of the building. Nick, you're going to stay with uh Bacon no matter what. When we ask F when we ask Phil and I will go by myself. Sounds good. I'll love you forever. Yep. [ __ ] going down the wrong stairs. Okay, that's",
            "start": 7234.0
        },
        {
            "text": "you're going to stay with uh Bacon no matter what. When we ask F when we ask Phil and I will go by myself. Sounds good. I'll love you forever. Yep. [ __ ] going down the wrong stairs. Okay, that's fine. Um I'm going back stairs. Yeah, you should see me soon. Yeah, back stairs. We're going to meet you there. I'm running and jumping. Okay. Yep. You hear us? You see us? Okay, cool. I'm with you. I don't recognize all of us right now. That's a new guy. That's a That's another player right there as a scaff actually. Maybe not. No, he's not. I don't know. It's hard to tell. He could be faking it. He looks like a scaff now. No, you probably shouldn't, but you could. I wouldn't recommend it, though. No, it's fine. So, if he's But he could kill me right now if that's a player. Uh, yes. Uh, if it was, but I think it's a AI. All right. Uh, just to confirm one more time, Nick, we have the same extracts, right? You have Chad Park, Worker Shack, or what do you have? I believe so. I have, let's see,",
            "start": 7286.4
        },
        {
            "text": "but I think it's a AI. All right. Uh, just to confirm one more time, Nick, we have the same extracts, right? You have Chad Park, Worker Shack, or what do you have? I believe so. I have, let's see, double checking. I have trailer park worker shack scab. Yeah, I do. Um, we could really go left or right right now, but uh we'll go back to the trailer park. I think I'm just following you, my friend. Now, in general, is it smart to run up? No, but the map the raid is almost over. There's only 10 minutes left, right? So, most of the heat has died down. Um, if we're being safe, we'd be running through all these buildings and being really careful. But you also said you wanted to kind of get some action. So, we're kind of tempting people to shoot at us. Yeah. Yeah. Yeah. We need And uh see what happens. Don't forget I also only have a pistol. Yeah, but it's a James Bond pistol. So, you got it. Someone just moved ahead of us. Was that Was that Did you go into a building, Mike? Uh no, that is not",
            "start": 7337.68
        },
        {
            "text": "Don't forget I also only have a pistol. Yeah, but it's a James Bond pistol. So, you got it. Someone just moved ahead of us. Was that Was that Did you go into a building, Mike? Uh no, that is not me. I've gone towards dorms. Uh just cuz that's my Xville. So, you two are now solo dooo. I will go silent and let you guys fine. Um this is a dead player here. You could grab his bigger rig. That's decent worth worth grabbing, I guess. I'm going to go quickly check and see in front of us as a player. What? Just close the door. No looting it. What the hell? Uh, if you crouch, it's a lot easier to loot stuff as well. Um, and this rig he's got is a really big one, so it uh has extra room to store wood loot in later. How do I How do I take that? You have to drop yours first. So, open up your inventory, right click, drop yours, then take his, then open yours again off the ground, and grab the stuff out of it. It's It's a mess. I am not beside you. I'm going to the top of this broken building in",
            "start": 7377.12
        },
        {
            "text": "right click, drop yours, then take his, then open yours again off the ground, and grab the stuff out of it. It's It's a mess. I am not beside you. I'm going to the top of this broken building in the middle. Just look around. All good. This guy's going to get sick. That's a sniper scab. That's really far away. Not relevant to us. Okay. I think I've I think I've searched this guy's dead body. Come back the other way. Uh behind you. I'm going in the I'm going in this building for a hot sake just to get away. Where you at? I'll come to you. I'm right here. I would My legs are tired. Um you could grab one of these guns. Uh since you don't have any guns, grab their stuff just to have something. If you're not wearing body armor, you already got armor, so you're good. Is this armor better? Um I can't that armor. He uh I actually don't know. I'd say no. No, it's definitely not. That is bad armor, but he has a mustache. If you want to put his mustache on, you could do that. And that's pretty",
            "start": 7422.64
        },
        {
            "text": "can't that armor. He uh I actually don't know. I'd say no. No, it's definitely not. That is bad armor, but he has a mustache. If you want to put his mustache on, you could do that. And that's pretty sick. What about this head gear? I'm looking at him. That is okay. That is a fake helmet. And you often see people wearing it cuz they don't realize it's fake. That one of that color uh is fake. If you inspect it, it'll say replica at the end. Um what about his tactical ears? Oh, I'll take those. Yes, if he has them, definitely grab those. If he has ears, grab them. And put his armor in in your backpack. It's worth keeping if you can get room for it in your backpack. And he's got a decently sized backpack. Looks like you all have the same size backpack, so you're finding the way there. I don't think I have room for it. I have a helmet. I'll just give him a [ __ ] helmet here. I I I I'll get it. Uh and Oh, no. I'll leave it there for you. You should You can make it fit probably. It's fine.",
            "start": 7475.44
        },
        {
            "text": "think I have room for it. I have a helmet. I'll just give him a [ __ ] helmet here. I I I I'll get it. Uh and Oh, no. I'll leave it there for you. You should You can make it fit probably. It's fine. I think I can do I can make it work. Put [ __ ] in my other stuff. Hold on a sec. Sorry. One second. How's it going over there Mike? You find anything interesting at dorms? I'm looking at a man that's definitely a real, but I think he's just a scav. Cool. Can't tell if he wants to pop one at me or not. So, I'm playing I'm playing Gucci. I think if you double press Y, it'll bring up uh like a menu to wave at him and you can wave at him, but he might wave back. I never figured out how that worked, but it is funny. He's walking. What is the scar scav? Um yeah, you got that guy cleared off. Good enough. Yeah, good. Um and I'm going to grab from him real quick and then we're good to go. All righty. out. It's funny. You put the ear things on, everything's way louder. Which I told you, right?",
            "start": 7513.68
        },
        {
            "text": "enough. Yeah, good. Um and I'm going to grab from him real quick and then we're good to go. All righty. out. It's funny. You put the ear things on, everything's way louder. Which I told you, right? Isn't that [ __ ] crazy? It can be really annoying. Some of the Some of them sound My steps are so loud. It sounds awful. Just skim these. See if we see anything interesting. I don't. So, we're going to just connect head on. That's better armor than I have. So, I'll grab that and we move. All right. So, we're now at ROF uh checkpoint or something like that or RUF roadblock. This is an extract. When you're a player, you stand right over here. But we're going to head on towards our scav extract, which the other side. I have a body right here. I'm going to check it out. That is not close. What did that sound like to you, Mike? That's me [ __ ] sound like it was at dorms. Guy rolled up at me, bro, and I [ __ ] just let it rip. Now, how do I how do I know fast and they weren't bad guys, but like",
            "start": 7564.56
        },
        {
            "text": "that sound like to you, Mike? That's me [ __ ] sound like it was at dorms. Guy rolled up at me, bro, and I [ __ ] just let it rip. Now, how do I how do I know fast and they weren't bad guys, but like you know the heat of the is the heat of the moment, bro. It's the heat of the moment. How do I know if this guy's tactical rig is better than if it has more space? If you want to just like know really quickly, you can right click it and hit as a size on there. Or you can just look at it. Um, it's only armored if it has like that number. or like mine says 128 out of 155 on it. That's how you know it's armored. Okay, that gets that's cool annoyingly complex again. So, we're not going to go to that. But I'm like out of space. So, better to get something than nothing. [ __ ] Let's go. Full move towards extract. Oh, wrong way. Yeah, I've been retired from this game for at least a year now. So, remembering a lot of it. How long? How long did you play? Since it came out on and off, I probably",
            "start": 7623.28
        },
        {
            "text": "towards extract. Oh, wrong way. Yeah, I've been retired from this game for at least a year now. So, remembering a lot of it. How long? How long did you play? Since it came out on and off, I probably have at least $3,000. [ __ ] phone. We were talking. You get what you deserve, Mike. You get You get what you deserve, Mike. Was that a player, Mike? No. I woke up to hive mind. Oh my. Yeah, I woke up the hive mind. Are they woken up for all of us now? No, we're okay. So the crazy part was like I knew one guy was a scab, but then there was a a second guy that came and he just bolted in the room and I panicked and so I [ __ ] let him get one, you know? I had to give him some I had to give him. I get it, Mike. I totally get it. All right. So we get out of this raid, you can choose if you want to use the gear you just got as your new kit. And uh Oh, we are going to make sure that we take it this time. Uh, I warned Mike about that yesterday because it it's happened to me even recently that",
            "start": 7668.48
        },
        {
            "text": "to use the gear you just got as your new kit. And uh Oh, we are going to make sure that we take it this time. Uh, I warned Mike about that yesterday because it it's happened to me even recently that I've actually left the stuff behind. So, you gota always make sure you move it to your inventory first. And do you have infinite inventory slots or you have to actually manage? Okay, that was a stupid question. If you pay more, you have more, but that's that's it. All right. Now, we stand here and we're out. Um, excellent. Good. Look at that. Well done. Well done. Kind of quiet and calm, but that's better than um dead quickly. So, I'll take it. Yeah, you got to stay in the middle so that that keeps running all the way down. Yeah, I got you. Cool. Bacon. Right on, chat. My first successful scav run. Second, actually. Do not trust Mike if you are a scab. Yeah, don't do that. Mike has made it clear he is not to be trusted as a scav. All right. Correct. Okay. So, my next menu. This is where",
            "start": 7729.28
        },
        {
            "text": "run. Second, actually. Do not trust Mike if you are a scab. Yeah, don't do that. Mike has made it clear he is not to be trusted as a scav. All right. Correct. Okay. So, my next menu. This is where Okay, not this one. No kills. And this is where I take everything. Select. So, you probably want to keep all this stuff, right? So, I would control click every item that you have individually. But if you want to be quicker, you can click the backpack in the vest, right? I take it all out. That way, I see what I have, right? Um, but it's okay to just click the stuff like that. Exactly. Okay. So, now I have nothing. Grab those headphones. Those are important. Glasses don't matter. So, you can hit next or sell all at this point. You're good. Okay. Sweet. All right. This is exciting. It's exciting. I'm proud of myself. OMGX. I'm proud of myself, Warog. I can follow directions. I've learned that today. So, what is the ultimate goal for you in this game then? Is just to go in and wreck people's",
            "start": 7776.88
        },
        {
            "text": "I'm proud of myself. OMGX. I'm proud of myself, Warog. I can follow directions. I've learned that today. So, what is the ultimate goal for you in this game then? Is just to go in and wreck people's days at this point? Yeah, pretty much. That's that's I mean everyone you just gets a different kind of fun. Some people like the money number going up. Some people like the kills. I think most of us who play the PvP version like to get a base that we feel comfortable with. We can use decent weapons, right? So it's not completely unfair for us and then um go hunt fights pretty much. Got it. Um, but it also is really fun to go in with like a really cheap gun, like just a pistol, and try and remove that, you know. But it's obviously very hard. Half this [ __ ] Is his body armor better than mine, though? So, you can right click it. You don't really need to learn about this yet, but you right click and inspect it, right? And it's going to show you there. It probably says something like armor",
            "start": 7834.52
        },
        {
            "text": "though? So, you can right click it. You don't really need to learn about this yet, but you right click and inspect it, right? And it's going to show you there. It probably says something like armor class somewhere on there. And it's probably going to be a three, right? And it only this is too complicated to even talk about, but that one is worse than the blue one you have. The blue one you have is better cuz that one it says armor class 3. And if you inspect that blue one, you're going to see that it says four. At least for some parts of it, it has two. Where do you see that? Where do you see? So in the bottom right of that box is armor class 4. If you hover over it, it'll tell you, but essentially it has two plates in there that have level four armor and the rest of it's probably level three. Okay, so we want we definitely want obnoxiously over complicated, but level four armor is the beginning of good armor. That's really relevant, right? That like that will help you survive a fight",
            "start": 7894.08
        },
        {
            "text": "Okay, so we want we definitely want obnoxiously over complicated, but level four armor is the beginning of good armor. That's really relevant, right? That like that will help you survive a fight for sure. Now, should I just keep the rest of this [ __ ] or just sell it? Um, what is your That's kind of personal preference. Um, for simplicity sake, you can just sell it all and buy the same gun every time that you can get, right? Um, but if you can figure out what you're doing or use that link search, right, you could probably find magazines and ammo for that gun. And it's a fun gun. It's not a good gun. Generally, I think most people would sell it. Um, but since you're starting the game new and figuring out, it could be fun to just try what you what you have and and use it, right? And so maybe don't sell it until you need to sell it, right? Until you're out of room or you need the money. Yeah. Fair. Okay. Okay. And then is there a way for you just to see? I guess you just kind of compare",
            "start": 7930.16
        },
        {
            "text": "don't sell it until you need to sell it, right? Until you're out of room or you need the money. Yeah. Fair. Okay. Okay. And then is there a way for you just to see? I guess you just kind of compare and contrast which one goes on here. What what works with what? Do you know off hand which you learn to know which magazine was on here? The easiest thing to do is to unload that gun. Right now it says 0 to 10. That means I think there's a mag in it. It's an empty mag. So unload it. Okay. And now if you click and drag a mag, you'll see you're probably not going to have any mags that work for it except for the ones that you just picked up from the body. So you can right click and link search and find it that way. Um Okay. So now I just got to buy ammo for it. Okay, let's buy some. If you link search the gun, you'll be able to link like the mags and the ammo at the same time and see if you can get it. It's a good gun, a good ammo, and so that means you probably just sell it for now. Or you",
            "start": 7971.6
        },
        {
            "text": "search the gun, you'll be able to link like the mags and the ammo at the same time and see if you can get it. It's a good gun, a good ammo, and so that means you probably just sell it for now. Or you could save it until you find the ammo. But again, that gets complicated. Okay. Well, I'm just going to take it out cuz I don't have the ability to do that. Okay. So, I need to buy a gun. Uh, you have a few guns that you could use or I can just bring you one that I already have set up. your preference. Do you want to take the time and learning to buy your own gun or you want to speed into We have 20 minutes left. Let's speed it out. We have 20 minutes left. Yeah. So, if we want to do one more lesson is great. If we want to jump in, we'll do one more. It's up to y'all. Entirely up to you guys. Um I am going to bring you Let me get all this [ __ ] out. Yep. Just get your get your gear right. Get you feeling good. I feel pretty good about mine. I got the AUG back. I have my two 30 round",
            "start": 8009.2
        },
        {
            "text": "Um I am going to bring you Let me get all this [ __ ] out. Yep. Just get your get your gear right. Get you feeling good. I feel pretty good about mine. I got the AUG back. I have my two 30 round clips. two 10 round clips, which I know aren't the best, but they're my backups in case of emergency. All my ammo is clipped up and ready. I got 120 extra bullets ready to rock and roll. Emptied out my backpacks. I got all my health supplies ready to rock. I got $5,000 in my butt cheeks just in case it goes down. Okay. Like, I'm ready. All right. I am almost ready as well for myself. Let's get you set up with everything but a good gun, and I will bring you a gun. Okay, sounds good. what I need here. I don't think I can make this work yet, but I'm going to quickly check and see if I can. I can't. Um, God, this is so ridiculous. We're going to bring you an Uzi. Cool. Should I load in with this gun that already have automatic? Um, if you want to, but keep it for next time and I'll bring you this",
            "start": 8050.68
        },
        {
            "text": "God, this is so ridiculous. We're going to bring you an Uzi. Cool. Should I load in with this gun that already have automatic? Um, if you want to, but keep it for next time and I'll bring you this out. You just have something quickly. Okay. Okay. Cool. Cool. Cool. Cool. Okay. I have all my health. Uh, everyone probably needs to I need to eat and drink from our last raid. Make sure that you have eat and drink. Uh, Mike, eat and drink. Yep. Uh-huh. Uh-huh. I don't know that I have anything to eat and drink. I'm You are You're good. You're at 100. 100. I want to last checked. All right. I am almost done setting up your gun and we'll double check to make sure you have everything else, but do you think you have everything else that you need besides the gun and the magazines and ammo? Of course. I mean, I can put this blue helmet on, but everyone says that's how you get hit. Yeah, but it but if you do get hit, it's going to block it. Um, yeah, people have mixed feelings on the blue helmet.",
            "start": 8108.64
        },
        {
            "text": "I mean, I can put this blue helmet on, but everyone says that's how you get hit. Yeah, but it but if you do get hit, it's going to block it. Um, yeah, people have mixed feelings on the blue helmet. They're all right. It's easy to see, but it doesn't I mean, I I would say wear it makes it easy for us. I'm going to put the blue helmet on. That way, you know where your little brother is entire time. Uh, let's see. Put a face covering on too for shits and gigs cuz that's crazy. Uh let's put some eye on. We'll just look cool. Do I need uh like tal like this measuring tape and [ __ ] Can I sell some bottle of sailing? Sell all that stuff, but technically if you're to play the game a little bit more, you would need it for your hideout. I really doubt you're probably end up playing that game that much, you know, unless you really fall for it. Um so you could just sell it to clear your inventory, but technically it's needed for your hideout and that would let you upgrade the stuff you can do",
            "start": 8156.48
        },
        {
            "text": "much, you know, unless you really fall for it. Um so you could just sell it to clear your inventory, but technically it's needed for your hideout and that would let you upgrade the stuff you can do in the background. And that's another conversation, but um I wouldn't I really wouldn't worry about you if I just sell it. Um and then if you need it later, you go find one, right? But it also takes up a spot. So either way. All right. So I have your gun. I've got you um a bunch of mags for it. So I'll be packed up in a backpack for you. I'm going to give you a backpack. You're going to put the backpack on and sort it out from there. So you can leave your backpack behind. Do you want me to take my backpack out? Leave your backpack behind. Um you got your heels. You can take that ammo that you have in your pouch and you can put it back um in your inventory. Oh, this the also the ones at the very bottom one in that yellow box called the alpha container am that you're not going to need in",
            "start": 8192.16
        },
        {
            "text": "have in your pouch and you can put it back um in your inventory. Oh, this the also the ones at the very bottom one in that yellow box called the alpha container am that you're not going to need in there. Got it. Got it. And it looks like everything else for you is looking good enough. Um I'm not going to worry about it right now. Let's tear it up. I think we are ready. All right, let's go tear it up. Here we go. Our last run of the day, everyone going into PMC one more time. Back to customs to get comfortable on the map. We're jumping in at 1400. Captain Bacon ready to lead us off. Nick Scarpino ready to lead us off as well. Let's go [ __ ] get lost. Captain Bacon ready to lead. Nick Garpino ready to follow. [ __ ] yeah, dude. Let's do this. And hopefully not get shot in the face. We're doing great. Do I need to is there any sort of missions I should be accepting for this at all or? People have been asking about missions. I thought tomorrow we'd maybe learn about missions. Uh but",
            "start": 8227.36
        },
        {
            "text": "doing great. Do I need to is there any sort of missions I should be accepting for this at all or? People have been asking about missions. I thought tomorrow we'd maybe learn about missions. Uh but please tell us a little bit more. I will start loading in. Uh you absolutely should do them. Uh it gets you a lot of stuff. Uh revs you up really quickly, levels you up faster all around and it's fun to do. They actually are pretty fun. Should I go to traders right now and just accept the mission or do I not have one? Don't worry till tomorrow. We'll do that tomorrow. All right. We'll do it tomorrow. Got it. Just because we only have 15 minutes. I don't like wasting time here. Greg's going to come in here and yell at us. So, we got to talk about Borderlands now. Trying to make sure we get one more good game. Are you able to ready up on your side? I'm I'm seeing a glitch on my side. I am ready to ready. That's my That's See if it works. I [ __ ] look cool, bro. Look at my guy, dude. My guy.",
            "start": 8279.84
        },
        {
            "text": "good game. Are you able to ready up on your side? I'm I'm seeing a glitch on my side. I am ready to ready. That's my That's See if it works. I [ __ ] look cool, bro. Look at my guy, dude. My guy. Look at my guy, dude. Look at Escape and back out. Well, the game glitched on us back here. Uh oh, I [ __ ] it up. I press I can't do it. My game's freaking out. Well, well, well. Fran. Oh, we're already loading into a map. We're loading into a map. Fran, say hi to people. What's going on everybody? Look at I'm so proud. He's got his map up on the left. He's spinning it in 360 trying to figure out where do I Can you rejoin? You know what tired doing? I cannot get out of here. You know what I mean? Honestly, I'm so I think he's back. Hey chat, what's up? Is Nick hating or loving this? I'm loving it. So, he's we're learning. We're in Fran. So crazy. this game. We want to play with you, big dog. High stakes. High stakes. Yeah, we we should have had you in here early. You could have been our",
            "start": 8316.24
        },
        {
            "text": "it. So, he's we're learning. We're in Fran. So crazy. this game. We want to play with you, big dog. High stakes. High stakes. Yeah, we we should have had you in here early. You could have been our fourth. Oh, yeah. Well, we should play. I do have a stash and active. Oh, I know you do. Yeah. Okay, random. We'll be talking at the end of the day. We'll be fine on the date. We're playing all week long. Okay. Do you have any free time between the hours of 12 to 3? I got called in to jury duty. Oh [ __ ] Okay. Okay. Got to do your duty. Yeah. We'll see you on the next one. I'll see everybody else on the Borderlands. All right. Borderlands. You got All right. All right, we're going back in, everybody. It kicked us out. I've rereadied us. So, everybody press the button again. That's not me. It worked that time. We're good. Fran [ __ ] jumping in here. Bringing the hype, dude. He's crazy. All right, let's go have some fun. Uh, I might just be glitched. I might be guiding you off. Oh, he",
            "start": 8363.28
        },
        {
            "text": "It worked that time. We're good. Fran [ __ ] jumping in here. Bringing the hype, dude. He's crazy. All right, let's go have some fun. Uh, I might just be glitched. I might be guiding you off. Oh, he doesn't have a gun. Oh, man. We're running out of time here. Um, for some reason it is not bringing me in the game with you. Um, are you loading, Nick? We can back out one more time. I back when you leave the group. You're going to reinvite me. Um, okay. Yeah, I love that idea. I love that idea. I'm gonna pee while you do this, Mike. Well, you got to hit ready up. Okay, I'm ready up. I'll I'll hit ready up for you. Go, go, go, go, go, go. We're only thing. What time is it today? Of 45. Oh, we're fine. We have 15 minutes. Yeah, but we're trying to have a good run. Why this over Art Raiders a marathon? Just out of curiosity. I mean, Seahawk, honest to God, we're trying all of them. If you have, as you know, Seahawk, I know you've seen it. We are literally trying every single one throughout",
            "start": 8402.4
        },
        {
            "text": "Just out of curiosity. I mean, Seahawk, honest to God, we're trying all of them. If you have, as you know, Seahawk, I know you've seen it. We are literally trying every single one throughout this week and past week. So why this one? This is just its turn, right? We played Arc Raiders last week. It has a beta available right now for all of you. Uh we played Marathon last week. Currently has a beta still going on that all of you can play. We're testing out Tarov this week. Uh I'm going to play Hunt Showdown uh later tonight. So yeah, we're just trying them all. Big dog. Uh this also cuz I see Cheese Head Troy in here. Cheesehead Troy, this is for you, Big Dog. Bacon, I reinvited you. I don't know if you really reset it just in case. Uh, if you want to be ultra safe, you could also kick him out, close the group, and start it fresh. Probably is fine either way, but this game when it glitches like this, you never know. Kick player and then right click, right click, right click, and hit",
            "start": 8448.08
        },
        {
            "text": "out, close the group, and start it fresh. Probably is fine either way, but this game when it glitches like this, you never know. Kick player and then right click, right click, right click, and hit disband group and then reinvite us. Mhm. But this uh this is for you, Cheese Head Troy, cuz you said, \"Mike, you got this is a blind spot. You got to go try it.\" And she said, \"Troy, I'm [ __ ] deep in it for you, big dog. I'm deep in it. Classic Tarov. Great game, but still has it glitches. Still does stuff like this. Come my own video game. Are you not getting the invite? What's happening on there? No, he was in a different thing. It's looking like it's working better this time. We'll just have to hope it's working. Perfect. Here we go. All right. Well, you just want another tarco thing whenever it uh um but your boy Mike uh Seahawk, we'll we'll talk about all of them at the end what I really think. Um but like I like a lot of things from each one of them so far. And so yeah, we're just",
            "start": 8490.08
        },
        {
            "text": "it uh um but your boy Mike uh Seahawk, we'll we'll talk about all of them at the end what I really think. Um but like I like a lot of things from each one of them so far. And so yeah, we're just trying them all, big dog. That's the goal, right? Was to try them all. We had a little bit of a blind spot with Extraction Shooters. They're currently the hot topic, of course, as Bungie has uh put their flag in there and said we want to make one of these and try to bring it to the mainstream. So, we decided to try them. And we're currently running through them, find the ones that we like, the ones that we don't like, and let's go get lost. S Rob, thank you for the Prime Gaming stuff for 43 months. Love you, Rob. Yeah, Taro is a great one. It just requires so much investment. So, we're all hoping one of these other ones will be uh fun enough without the huge investment Tarov takes. Yes, this one uh this one's fun, though. This one's fun. It's thrilling and exciting. Uh it definitely has some",
            "start": 8592.56
        },
        {
            "text": "one of these other ones will be uh fun enough without the huge investment Tarov takes. Yes, this one uh this one's fun, though. This one's fun. It's thrilling and exciting. Uh it definitely has some Arc Raider vibes when it comes to the setting and the tone of like being a little bit slower. It really feeling like things cost you. Uh I like Marathon because it does feel arcadey and you can just kind of jump in with that battle royale mindset. I like that a lot. I love the guns in this and in Marathon way more than Arc Raiders. So, I'm enjoying that. The gunplay. It's been good. I I'm I'm looking forward to checking out Marathon. I'm I won't say I'm hopeful, but it could be it could be great. Big Could be great. Could be a big deal. Could be a really big deal. This game has a fun mode called arena, which is like their 5v5 mode. The only problem is not people play it. So, the people do play it are very good. No, I It took me a long time. Okay. Um, yeah. What? Here's one for you. I was",
            "start": 8635.68
        },
        {
            "text": "arena, which is like their 5v5 mode. The only problem is not people play it. So, the people do play it are very good. No, I It took me a long time. Okay. Um, yeah. What? Here's one for you. I was watching this guy on TikTok, uh, Mr. Peanuts, and he was playing one where they were in like it looked like they were in like a labyrinth or sewers. Now, it came out recently. They added a new map which you get to through another map. Um, and I think it's called Labyrinth, and it's a relatively high level map. And, uh, it's the same as any other ones, kind of like factory where it's small and you fight your uh, other players, right? But it has all high level people in there and a ton of really, really good loot. Um, so it's a very challenging thing. I actually haven't looked up yet what it takes to get in there besides just going to it, right? So you go to the map shoreline, you go to this big building, you go in the base of that building, you fight your way down there, and you can press a",
            "start": 8681.68
        },
        {
            "text": "to get in there besides just going to it, right? So you go to the map shoreline, you go to this big building, you go in the base of that building, you fight your way down there, and you can press a button in there, and that takes you to the other map. I'm sure can tell us if there's some requirements you to do first to get access. There probably is. Okay, but the loot is crazy good. Just hard fight. Crazy good. Hey, Bill Luis, if you see me later tonight, I can send you my second my second friend code. If you want to get in the marathon, you let me know. And Jess Hinkle, Jessica Hingle has just gifted out five tier one memberships over on YouTube. YouTube best friends, you might have just got a membership from Jess. Say hi and thank you. Let's go get lost in the sauce. I want to get lost so hard. What's going on? We're waiting for game. We have loaded in. We have found We're now waiting for someone with a slow computer to load the game essentially. And so [ __ ] League of Legends all",
            "start": 8724.8
        },
        {
            "text": "so hard. What's going on? We're waiting for game. We have loaded in. We have found We're now waiting for someone with a slow computer to load the game essentially. And so [ __ ] League of Legends all over again. We don't have much time. [ __ ] League of Legends all over. Um, you guys do have your good gear on. Uh, so you may or may not want to, but we could just run at the fight and do our best. Um, or we could try Yeah, we run right at the fight. And I think it'd be more fun to run out of fight. We We run right at fight number one. Fight number one, we take. If we win, we run right to extract. If we lose, we lose. But like this, we run right into it. I love this. Blast that out. So, we get in. I'm going to drop you this bag and this gun and you're going to uh rearrange it all on your on your person so it's good to use and then uh Sounds good. We'll start sprinting that way. Damn, my guy look like like sweat. Yeah, your guy looks cool. I got ball of clav on. I'm like full up. Mike,",
            "start": 8764.8
        },
        {
            "text": "your person so it's good to use and then uh Sounds good. We'll start sprinting that way. Damn, my guy look like like sweat. Yeah, your guy looks cool. I got ball of clav on. I'm like full up. Mike, what would you what would you if you had to go to war? What would you be wearing? I'd be right now. Look at my guy. You see my guy? Click on my guy. Click on the eyeball on my guy. Kevin Sunburn. Oh, that's my guy. I'd wear this. I wear the mask. Oh my god, you look so cool. I wear the mask, bro. Nobody sees my face. And also because I don't want to get sunburns. I would wear I would wear so much long sleeves, Nick, cuz I would not want to get sunburn. Just sweating. Look at Bacon's all like dark clothes and [ __ ] and I'm like I'm like bright so blue. Bacon's got all the blacked out gear, bro. I'm like got a UN hat on. I'm a peacekeeping mission. I'm like a Jedi in the Come on, video game. Get the [ __ ] in here. Let's go. Let us in. What are we doing? game used to be a game where it make",
            "start": 8806.0
        },
        {
            "text": "I'm like got a UN hat on. I'm a peacekeeping mission. I'm like a Jedi in the Come on, video game. Get the [ __ ] in here. Let's go. Let us in. What are we doing? game used to be a game where it make you wait 15 to 20 minutes to get in and we would for some reason we would all do it like it was fine that we're heading in. Okay, it's okay. We used to play War Zone a lot and it would just bore every five. Yeah, I just boot you out and then it would be like and then it' be like, \"Oh, you got to do your shader.\" At least this game doesn't have any shaders. All right, where are we? Okay, no shaders to load. We're near Scap Checkpoint. I got from my extract that I have dorms, crossroads, trailers. Yeah, we have them all. We have all the same, right? Double check. Dorms. So, we could make it to dorms, right? Yeah. Dorms is um if we run at dorms, we will find a fight either on the way or at it. I'm great. All right, let's go to dorms. Let's do it. Nick loads up all of his stuff. He gets",
            "start": 8850.48
        },
        {
            "text": "to dorms, right? Yeah. Dorms is um if we run at dorms, we will find a fight either on the way or at it. I'm great. All right, let's go to dorms. Let's do it. Nick loads up all of his stuff. He gets himself organized. And then uh pick up the backpack on your left so you'll have extra ammo to repack into those mags. [ __ ] you. Or if y'all hear a sound, do you want us to pursue the sound instead? We can do that, too. And there's always a chance. Someone's at dorms. Unlikely, but there's always a chance. So, y'all just let me know and I'll just Cuz P, thank you for the tier one sub for 55 months. Thank you, Cous P. All right. All right. Bring out your good gun. Let's [ __ ] rock this thing. Damn, that check the fire mode to make sure that it is in full auto by pressing B to toggle fire mode. B. And you can also think I think alt B checks, but just make sure it's on full auto and then we're good to go. We're going to Let's roll. It needs to be on full auto full auto. The ammo's not very",
            "start": 8893.76
        },
        {
            "text": "B. And you can also think I think alt B checks, but just make sure it's on full auto and then we're good to go. We're going to Let's roll. It needs to be on full auto full auto. The ammo's not very Let's run to those mag. You want to run at those shots that are super close? All right. Yeah, we're go up this hill right here. Look over the hill down at that. Um, someone is sniping this way though, so try and keep moving. When we get top of the hill, it's going to be get pretty dangerous pretty quick. There's a player down the ground somewhere overside where those grenades are going off. Definitely going to run out of stamina before we get to the top of this hill. There could be someone up here with us as well. There's a dead guy right here. I don't know. That's spawn dead. That's new. I haven't seen that. Okay, so this is a new gas station and they're fighting around new gas station. They know look over these rocks. So you can peek the rocks and just be [Applause] careful. I'm ahead of",
            "start": 8941.36
        },
        {
            "text": "seen that. Okay, so this is a new gas station and they're fighting around new gas station. They know look over these rocks. So you can peek the rocks and just be [Applause] careful. I'm ahead of you guys. Um if you hear that's running behind. Yep. Cool. Good. Yeah, I'm behind you. Okay. I see Nick in the blue helmet. Okay. All right. So, if you want to push this fight, we can. We should probably jump over this side because going forward is uh little bit chaotic. So, Nick, you on us? I'm on you guys. I'm on. We got to jump off the rocks with him, it looks like. Okay, let's go. All right. Dropped on those rocks and see if it was still over here. They might have moved on. It sounds like. Who knows? Let's do it. So, there's a guy dead in front of us. That again, that might be a static spine. I don't know. You don't hit barb wire. You need the fence. I think I just did. Yeah, I think that was me. It's a razor wire, but I like the barb sound. This is Russia. There a lot of dead people here.",
            "start": 8984.24
        },
        {
            "text": "don't know. You don't hit barb wire. You need the fence. I think I just did. Yeah, I think that was me. It's a razor wire, but I like the barb sound. This is Russia. There a lot of dead people here. Probably someone in this building or at least in front of it. They can shoot these windows. Be careful these windows. It sounds like they're fighting out the yard in front of us, but I want to quickly check this building. Make sure we're not going to get shot in the back. So, we're going to go peek in front of it. Okay, I'm with Oh, that is a painting. How dare they put that there? Okay, that's another dead guy. We're just going to keep it out. Oh [ __ ] We got to just dead run to dorms. We're going to chase his grenade sounds. We're going to run straight at him. Enemies are very close. Don't forget chat, we will be live reacting to the Borderlands 4 reveal video coming up in just a couple of minutes here at the top of the hour. You'll get a Games Cast following that with the big breakdown",
            "start": 9037.04
        },
        {
            "text": "chat, we will be live reacting to the Borderlands 4 reveal video coming up in just a couple of minutes here at the top of the hour. You'll get a Games Cast following that with the big breakdown right in front of us. Ahead right there. Yep. Guys to the left over in the uh box over there. Yep. And down the road as well. [ __ ] yeah. Here we go. We're in it. Taco Bell time. Duelers, thank you all so much for the love. We're going to go through this bus terminal. Go through the green fence right here. Need a little cover to push up further. Green fence to the right. Right outside on the in the front of the fence. I'm in. Wrapping around him. Nick, you good? Yep. Okay, that's my boy. We're moving forward, Nick. We're moving hot, boy. Real hot. Okay, from the box again. I'm going to try and jump in this car. Look over at him. There's an enemy right behind us where we just came from as well. Shoot that guy, Nick. Shoot him. Thank you. I'm getting lit up. I'm getting my ass. That was me. That",
            "start": 9095.28
        },
        {
            "text": "in this car. Look over at him. There's an enemy right behind us where we just came from as well. Shoot that guy, Nick. Shoot him. Thank you. I'm getting lit up. I'm getting my ass. That was me. That was me. That was me. Sorry. I didn't know which who shooting who. That was on me. He's hiding in the bus. He's very hurt. I'm dead. He's in the last bus. He was hiding from us. He's very hurt. You can get him. I'm going to die. Where the [ __ ] is he? Nick, you have the furthest one from you. [ __ ] I got to get out of here. [ __ ] I can't get around these buses. Probably still there. He's probably very hurt laying down bleeding. I guess Nick, [ __ ] Oh, he got out. He got out. Oh [ __ ] He was right there. He's on the [ __ ] outside. Damn it. On the outside of the bus. Yeah, he's on the outside of the bus. Oh yeah. There's a high chance I die here cuz I have no health. Backside backside. Yeah, backside. Back right side in this [ __ ] bus. He might have He might have left, but he was on",
            "start": 9145.28
        },
        {
            "text": "of the bus. Oh yeah. There's a high chance I die here cuz I have no health. Backside backside. Yeah, backside. Back right side in this [ __ ] bus. He might have He might have left, but he was on the like far right. He was He shot me from as I enter the bus from the right side of the window. I can't walk. I'm like dying so bad. I don't know who you are. Walk faster. I died with anything, bro. I literally just trying to apply everything. I'm at zeros all the way. Nick turned Mike in a switch. I shot you so many times. Oh, man. But dude, you know what happened was? I turn I was watching our back and then Mike said there's a guy right there and I turned I saw two two of you and the furthest away guy I thought was the bad guy. Oh my god. So I just lit you up. Me and this me and this bad guy lit your ass. [ __ ] yeah. Let's give it up to Bacon right there. Thank you so much to Bacon for leading us. Thank you, Bacon. Let me see a friend request real quick. Uh, go have a wonderful evening,",
            "start": 9201.36
        },
        {
            "text": "lit your ass. [ __ ] yeah. Let's give it up to Bacon right there. Thank you so much to Bacon for leading us. Thank you, Bacon. Let me see a friend request real quick. Uh, go have a wonderful evening, Bacon. Shout out to Bacon for being our sherper for today. Like I said, the fun does not end. We are going to live react to the Borderlands 4 big video and then you'll get a games cast afterwards. So, thank you for tuning in. Don't go anywhere if you're live on Twitch. If you're on YouTube, new video for you to go click on. Go have some fun. and we'll see you guys over there. Goodbye everyone.",
            "start": 9256.88
        }
    ]
}