{
    "id": 14007,
    "video_id": "jzDXyDL-qV0",
    "show_name": "Gamescast",
    "hosts": [
        "Tim Gettys",
        "Nick Scarpino",
        "Andy Cortez",
        "Mike Howard"
    ],
    "title": "Extraction Shooters: Yes or No? - Kinda Funny Gamescast",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page - https://store.steampowered.com/app/1377700/Empyreal/ \nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1745955024,
    "duration": 3630,
    "transcript_chunks": [
        {
            "text": "[Music] What's up and welcome back to the kind of funny games cast for Tuesday, April 29th, 2025. Of course, I'm your host, Tim Gettys. I'm joined by a very unusual cast today. It's the Jabroni boys snow bike. Mike, I mean, if you get the Jabroni boys together, Tim, that means we're talking about one thing. Firsterson shooters, baby. This is a anything shooter. Yeah. We also have Andy Cortez. Second person shooters as well. Yeah. And the producer/sucer Nick Garpier. How come there aren't second person shooters? You know, I just watch you play a game. Yeah, exactly. Mike's experience. You play Mike. All day I've heard you say a bunch of [ __ ] cuz you're still Mike Mike and you you're just constantly Well, I had to I had to fill you in on my life, Tim. And I I appreciate it. Can we stop? Can we stop for one second? Can we stop for one second? Can you take one of those down? Just one. Just one. Just one. I need you to go 90s with it. Go. There it is. There it is. Wednesday. No, nothing",
            "start": 9.9
        },
        {
            "text": "we stop for one second? Can we stop for one second? Can you take one of those down? Just one. Just one. Just one. I need you to go 90s with it. Go. There it is. There it is. Wednesday. No, nothing screams ' 90s more than uh one one overall on, one off with a Beyonce shirt. Skin tight Beyonce. It's a fun one because like I bought this way back in the day and I told the chat I was like I can't wear back in the day when you were in junior high way back in the day as I was like I can't wear this and they're like just wear a jacket over it and I was like I don't have a good jacket so I'll wear overalls over it. But of course Andy you're probably saying sto Mike why are you wearing a Beyonce t-shirt as Tim was going to get to and it's a great question. Of course, I have now joined the girly pop nation for Final Fantasy 10 2 and it was ladies night last night because it's all about Final Fantasy 10 2. What's the group name, Tim? You should know it's RP in position, baby. RP. What? That",
            "start": 66.56
        },
        {
            "text": "pop nation for Final Fantasy 10 2 and it was ladies night last night because it's all about Final Fantasy 10 2. What's the group name, Tim? You should know it's RP in position, baby. RP. What? That [ __ ] is so lit. Nick Scarpino is there. I know. I had to get him involved. Nick, this thing starts off like a Spice Girls concert in the early 2000s. Bang. Dancing in. And now I'm thinking about trees. I'm thinking about the sky. We got to get back to shooters. I want to let you know why I'm having fun. I've heard you say ladies night no less than 15 times this morning with no context or anything. And the fact that the context is Final Fantasy 10 2 makes me so [ __ ] happy. I know you'd love it, Tim. Uh I've gone through some heartbreak as well, but I won't get into that. We'll talk about it later on. I I hit something so hard and heavy, Andy, in that video game that it rocked me to my fundamental core. Chris Anka told me, he said that and I haven't quite been the same. Yeah, Chris Anka",
            "start": 106.56
        },
        {
            "text": "later on. I I hit something so hard and heavy, Andy, in that video game that it rocked me to my fundamental core. Chris Anka told me, he said that and I haven't quite been the same. Yeah, Chris Anka told me Mike uh cried today, by the way, because uh some characters have a baby now and it's just like he wishes that he could have, you know, father, you know. So, is that what you're upset about that it should have been you or are you just such a Chapu fan that you're you're sad that that brother would do that? It should have been me, of course. It should have been all of us except for Waka. And then yeah, I'm a chop. I'm a ride or die Chapu fan to the point where I'd rather have Lulu poor sad and lonely than with Waka, right? So yeah, it's a tough one out there when you hear about the girl that you love having a baby with somebody you don't even know. You know what I mean? Like that's a tough one. Happens to the best of us, Mike. Shake it to your core. Yeah. Happens to the best of us.",
            "start": 155.28
        },
        {
            "text": "that you love having a baby with somebody you don't even know. You know what I mean? Like that's a tough one. Happens to the best of us, Mike. Shake it to your core. Yeah. Happens to the best of us. So yeah, I've been absolutely I had a dollar for every time I love someone and they just spit out someone else's baby. Mike sends me a two and a half minute video last night where like he just turns his phone on, starts talking to it as if he's doing a podcast, which I always appreciate the snow bike mic move. He's what's up Tim Getty's? I have this for and he tells me this whole story and on the Uber home last night. It's just me and G and I'm just like listening to this call and she's like what are you doing? And I'm like listening listening to Mike and she's just like what? I'm like he made this for me. She's like he made it for you at like 1000 p.m. What are we talking about? I'm like yo he just had his heart broken. And Tim gets it because it is important. Okay, one of the best RPGs",
            "start": 197.44
        },
        {
            "text": "this for me. She's like he made it for you at like 1000 p.m. What are we talking about? I'm like yo he just had his heart broken. And Tim gets it because it is important. Okay, one of the best RPGs of all time. The characters you've fallen in love with are back for the sequel. They don't do sequels and they're pop stars now and people are having babies. Final Fantasy 10. Stay tuned for the journey, the story. It will continue with no long-term review of Final Fantasy 10. What's his game of the year 2025 list? Final Fantasy 10. Best RPG of the year. DMC 3. Oh, you beat DMC 3. We need to talk about that. This isn't the show, Mike. This isn't the show. This show is talking about extraction shooters. Y'all have played Arc Raiders. The embargo is up for that. So, we're going to talk about that. Marathon is the new hotness. I know we've talked a little bit lightly about it here and there, but the question of the day is Extraction Shooters. Yes or no? We will get into all of that because",
            "start": 233.6
        },
        {
            "text": "Marathon is the new hotness. I know we've talked a little bit lightly about it here and there, but the question of the day is Extraction Shooters. Yes or no? We will get into all of that because this is the Kind of Funny Games cast. Each and every weekday, we get together to talk about the biggest reviews, previews, and topics in video games live on YouTube, Twitch, and podcast services around the globe. If you love what we do, support us with the kind of funny membership on Patreon, YouTube, Spotify, or Apple Podcast to get all of our shows ad free. Watch us do cool things for you, and get a daily exclusive Gregway. for a chance to be part of the show. Submit your thoughts and opinions as YouTube super chats as we go. Just like Demon Hacker already has saying, \"I like Extraction Shooters, but it has to have Prox Chat.\" I'm sure we'll be talking a lot about Prox Chat today. Um, a little housekeeping for you. We do have a schedule change for tomorrow, Wednesday, at 10:00 a.m. we're",
            "start": 279.44
        },
        {
            "text": "but it has to have Prox Chat.\" I'm sure we'll be talking a lot about Prox Chat today. Um, a little housekeeping for you. We do have a schedule change for tomorrow, Wednesday, at 10:00 a.m. we're doing games daily. Then at 11:00, the stream's going to happen. Nick and Mike playing little Tarov. At 1:45, we're going to start our reaction to the state of play for Borderlands and then do the Games cast after that, talking about everything we see for Borderlands 4, which recently got pushed up, a rare release date move up situation. Interesting. Does it mean GTA 6 is coming this year, Andy? Yes or no? Do they have insider info? Uh, probably. It's I mean it's weird that like PlayStation's doing a state of play for a game that is not un like Marathon's coming out the I guess they moved it up but I don't know it's just it's really weird. It's a weird situation. It is weird. Um then at 3:30 we'll be doing the happy hour for patrons out there. Uh where you get to call in and talk to us live.",
            "start": 322.08
        },
        {
            "text": "I don't know it's just it's really weird. It's a weird situation. It is weird. Um then at 3:30 we'll be doing the happy hour for patrons out there. Uh where you get to call in and talk to us live. It's great. Uh remember we're 11 person business all about live talk shows today. After this, you're going to get Mike and Nick playing Escape from Tarov, starting your journey. Two complete noobs, first timers ever, jumping into Escape from Tarov for the first time. The whole week is dedicated and just me and Nick jumping into this extraction shooter. Will we like it? Will we love it? Will we hate it? Will we get good? We're going to find out this week. We're going to find out together. Uh, if you're a kind of funny member, today's Gregway will be a massive one, lasting the entire drive-in as Greg explains where the hell he's been the past two days. That's a great question. I've been wondering where the [ __ ] this motherfucker's been. He was on a show yesterday. No. Were you on the",
            "start": 373.04
        },
        {
            "text": "as Greg explains where the hell he's been the past two days. That's a great question. I've been wondering where the [ __ ] this motherfucker's been. He was on a show yesterday. No. Were you on the podcast? I don't think you were when Secrets last week's podcast where Andy, he might have said the most poignant thing I've ever heard say ever. How is Greg as a 42 now? 42. Yeah. Just turned 42 years old last weekend. Fresh. Beautiful. How is he still going on spring break? It's my It's the best thing you've ever said. I haven't listened to the airing of Grievances 2025 episode yet. I need to. I really really need. I don't think you catch too many strays in it. Truth be told. Oh, no. Most of you That's bad. That's fine. Roger put me on blast cuz I I always have a lot of open high five. Yeah, Mike. Yeah, Mike. It's just the uncounted hours, honey. That's all I need. Mike Mike didn't like Roger's high. I hate Rogers high. I'm up about walks in right now. Goes like this. Like the [ __ ] mic.",
            "start": 414.96
        },
        {
            "text": "Yeah, Mike. It's just the uncounted hours, honey. That's all I need. Mike Mike didn't like Roger's high. I hate Rogers high. I'm up about walks in right now. Goes like this. Like the [ __ ] mic. He just doesn't want to touch you. He doesn't want to be touched. What are you wearing, Mike? He's never going to wear it again. Ladies night. Ladies, I heard you in in the office. I questioned the Greg Spring Break thing and I I it was a guttural laugh out loud, you know. It's It is It is very Oh, the podcast. There it is. Oh god. Yeah. Oh, here we go. You guys, real talk, the Pavlovian [ __ ] is so real. Like, it's not a joke. When the set changes, when music plays, I get a chill through my body thinking Greg's [ __ ] with me. Oh, I'm sorry about that. Like, it's insane that it's like such a response that like my stomach sinks where I'm like, what am I going to have to deal with? Like, how hard and loud is he going to be? What am I going to change schedule-wise? What's what's what",
            "start": 462.32
        },
        {
            "text": "such a response that like my stomach sinks where I'm like, what am I going to have to deal with? Like, how hard and loud is he going to be? What am I going to change schedule-wise? What's what's what temperature and smell is his breath going to be? You know when he gets all up in you and you're like, \"Oh, that is a cool that's like a Coors life smell right now. That's an IPA.\" Like sometimes and then the other time you're like, \"Dad, that's not okay. Dad, you have one too many.\" Dad, isn't it exciting to think about like you're wrapping up the season here soon and then a new season will happen and then a new Stars in the Banks will happen. I have to take a phone call. This show's a disaster. Talk about I'll handle it. Let's talk about Extraction. Let's jump into it cuz guys, we played Arc Raiders which is going to have a live play test very soon, April 30th through May 4th. So, we have now jumped into Arc Raiders. Me and Andy have already previewed Arc Raiders before. Yeah, we have",
            "start": 511.04
        },
        {
            "text": "Raiders which is going to have a live play test very soon, April 30th through May 4th. So, we have now jumped into Arc Raiders. Me and Andy have already previewed Arc Raiders before. Yeah, we have played Marathon. We've played The Cycle. We're jumping into Tarov. You played a little Delta Force. Yeah, played some Delta Force over the weekend. We've played a lot of Extraction Shooters. And that's kind of today's topic is we played Arc Raiders. Let's talk about is marathon or is extraction shooters hitting for us right now? Are we in or we out on them? I mean my answer is always yes. I like extraction shooters. The big the bigger question for me is what what will it take for them to endure in this office or just going forward I guess in the general populace. I think it's a really fun balance. I think it combines all the elements like in the genre in general combines all the elements that I like in while playing with my friends. There's goals, there's simple, it's the cycle itself, no",
            "start": 550.64
        },
        {
            "text": "I think it combines all the elements like in the genre in general combines all the elements that I like in while playing with my friends. There's goals, there's simple, it's the cycle itself, no pun intended, is is quick. Rest in peace. RIP. Um, and there's a human element to it that I think you absolutely have to have because that adds a level of competition to these things that like something like a Destiny raid just never really hit for me cuz I'm like I don't love shooting bots. I do love the occa. I like that chaos of clashing with another team and then getting third party and then like you barely survive and all these things. I like knowing there's a really human on the other side that whose day I just ruined or who just who knows they ruined my day. So these are all like both of these were really really fun. Our creators and marathon in their own in their own right. But I'm just fascinated like what's going to be the one that catches for us if there is one. Real quick ending",
            "start": 595.76
        },
        {
            "text": "these were really really fun. Our creators and marathon in their own in their own right. But I'm just fascinated like what's going to be the one that catches for us if there is one. Real quick ending out the little rigarroll here. Thank you to our Patreon producers and a Totally Assan Twining Carl Jacobs and Omega Buster. Today we're brought to you by Imperial and Our Frames, but we'll tell you about that later. Let's get to the topic of the show. Starts, stats, stats. I appreciate you jumping in so quickly, Nick, but I want a little refresher and I want you to answer a question that I've asked you all before, but I want to hear it again. What is an extraction shooter? An extraction shooter is a video game um that you interact with on a computer screen. Mhm. You and your friends gather together or you can hop in solo and it's usually a largeish map that you go explore because your main missions. You're always working for a faction. There's always there's always somebody. There's",
            "start": 636.64
        },
        {
            "text": "together or you can hop in solo and it's usually a largeish map that you go explore because your main missions. You're always working for a faction. There's always there's always somebody. There's always somebody in this like dilapidated world that you exist in that says, \"Hey, I need five [ __ ] cans of beans and three gears of whatever and you know, two armor plating or whatever. So go find those. we'll give you a lot of money. Go find those things. Bring it back. We'll reward you. Right? And you select that. You say, \"I will select that contract.\" You select it and you embark on this world. No pun intended. Embark is a studio that made is making Arc Raiders who also makes the finals. And then you go embark on this world. And you and your homies go out there and then you go, \"Oh, the those little parts are usually in this area of the map. Let me go there. But watch out. There's other players out there. There's other there's another an extra threat that's not just the NPC enemies",
            "start": 677.12
        },
        {
            "text": "those little parts are usually in this area of the map. Let me go there. But watch out. There's other players out there. There's other there's another an extra threat that's not just the NPC enemies that vary across different difficulties depending on the game that you're playing. Some spots you're like, \"Ooh, really good loot in there.\" But we know that it's going to be hot because there's good loot and other teams are really going to gravitate towards that little spot on the map. And it's also going to be extra difficult because the game also put in harder NPCs and harder computer enemies there that are going to really challenge us. If there's not already another team challenging us as well, you hope to get those things. If you die, you're you you die, you die. You lose your [ __ ] Dead, you're dead. So that riskreward of, oh man, I really want this to be a good run, but I got this really sick ass shield and I'm not willing to lose it right now. And I feel like if I take it out,",
            "start": 725.68
        },
        {
            "text": "you're dead. So that riskreward of, oh man, I really want this to be a good run, but I got this really sick ass shield and I'm not willing to lose it right now. And I feel like if I take it out, we're just going to get third partied or we're going to get snuck up on by somebody. You lose your [ __ ] and your run is done and then you're either super sad and you you hit alt f4 and you get real sad and you quit out the game. Uh, but yeah, I think Extraction Shooters are in sort of a a weird spot, right, Mike? Cuz like I think Escape from Tarov is kind of like the big main one. And then the more casual audience who isn't PC gaming cuz it it Escape from Darov requires you to like go to a website and sign up for Yeah. You can't get it through Steam. I'm pretty sure Mike and I belong to the Russian model. I've given up my credit card information, Tim. So, a lot. The The Division Dark Zone is kind of the main thing that a lot of more casual audiences know cuz The Division Dark Zone was a mode",
            "start": 771.52
        },
        {
            "text": "model. I've given up my credit card information, Tim. So, a lot. The The Division Dark Zone is kind of the main thing that a lot of more casual audiences know cuz The Division Dark Zone was a mode within the Division video game, which is a PvE game, but the Dark Zone is like you can hop in there to go get loot, but you might also encounter other players that really want that loot as well. Who's going to be able to extract the quickest? And then we've sort of seen a lot of different extraction games pop up. Remember, Call of Duty had their own. They tried to make that, you know, popular to the masses as well with DMZ. Yeah, they tried. Um, I have some questions. Yeah. You're you're saying that you and your squad, you get the contract, you're going out to to get all the things that they want, and there are other human characters or players stop you. Are there other missions to stop you or are there other missions to get other extract other things? There might be a little side mission",
            "start": 821.68
        },
        {
            "text": "and there are other human characters or players stop you. Are there other missions to stop you or are there other missions to get other extract other things? There might be a little side mission that says like, \"Hey, if you take down an enemy challenges, you might get extra XP or whatever.\" But the missions are always go out, go loot here in this spot, go out, take down this enemy, go out, bring back some cloth so I can make bandages and we'll reward you. There's always different contracts and missions that people are on. Now, this is where prox chat comes in. Yeah. Because when we were playing the cycle, there would be multiple times where you'd come across one person. You'd be like, \"Look, you can't it's it's hard to get that's one of the the the downsides to to shooters like this. It's hard to get to your friends sometimes to to hop in with you midday or whatever if you're just grinding.\" So, you hop in by yourself, right? And we've had multiple times where we come across one",
            "start": 864.48
        },
        {
            "text": "It's hard to get to your friends sometimes to to hop in with you midday or whatever if you're just grinding.\" So, you hop in by yourself, right? And we've had multiple times where we come across one jabroni with his proxhat on and he's like, \"Guys, look, I'm just trying to get 10 plantains or whatever it is. Please don't kill me. Please don't kill me.\" And the two of us are like, \"Absolutely.\" And Mike's like, \"Come on, why don't you come over?\" And then my I used we hear like three shots and like [ __ ] did you just kill that kid? Yeah. And that's like it. So like the biggest question that a lot you know we had that super chat asking about prox chat and arc raiders has prox chat. Arc raiders will allow you to sort of live out those really improvisational cool moments with another player that I got to experience when I play the cycle where most of the time you're going to run into a [ __ ] who's going to want to kill you and take your stuff because that's part of the thrill of running",
            "start": 906.64
        },
        {
            "text": "I got to experience when I play the cycle where most of the time you're going to run into a [ __ ] who's going to want to kill you and take your stuff because that's part of the thrill of running against enemy players. But 10 to 15% of the time there will be like I I will never forget this I think his name was Luis or Wanito or something. Okay. Dude with a heavy uh Spanish accent. Okay. Um I mean he just sounded like somebody I went to school with back in the day. And I was like, \"Hey man, please don't I'm just trying to do this.\" He's like, \"Okay, cool. Yeah, I'm trying to do that, too.\" And then we just kind of became homies and we're just on this run like looting together. We're just chatting. I'm not even streaming. I'm just like, this is kind of this is a cool sort of thing. And then we hear gunshots and we're like, oh [ __ ] there's another there's another team here. I was like, and then we're communicating. Oh [ __ ] he's over here. He's over here. Here's we can't he can't see",
            "start": 948.0
        },
        {
            "text": "we hear gunshots and we're like, oh [ __ ] there's another there's another team here. I was like, and then we're communicating. Oh [ __ ] he's over here. He's over here. Here's we can't he can't see the pings that I'm doing on the map, but I'm trying to communicate and we end up taking this dude down and we both leave with our [ __ ] and I'm like, I'll never forget you, bro. Like, let's And it was just like a cool moment. And those are the things that like I wish Marathon turns on Prox Chat. I hope they eventually do because that those are the the an extra layer of excitement that adds into running uh against another player uh in the world. It definitely adds to the tension too, especially if if one of your other teammates hears them and you don't and and they're a little bit off the map, that's when your heart starts beating a little bit. Like we had a great moment in Arc Raiders where we came across a team and they were in a lit elevator and we were in the darkness and we were like",
            "start": 988.24
        },
        {
            "text": "that's when your heart starts beating a little bit. Like we had a great moment in Arc Raiders where we came across a team and they were in a lit elevator and we were in the darkness and we were like we just I don't know if you guys noticed but we inherently went wait I don't know if you think we had proced I literally got like I felt myself getting like quieter. I was like, \"Oh, here.\" And then we iced them, went into the elevator, and I looked down the hallway and it was dark. And after about a couple seconds, I was like, \"Wait, is someone else?\" And then just shot started ringing out on us. And I'm like, \"This this is a very unique thing.\" And and at that moment, as Nick and Mike go down, Mike is like, \"Andy, get the [ __ ] out of here.\" So, I attach to the zipline and I go up the elevator because there's no like actual functional elevators. You just go up like a little zip or whatever. And I'm at the top and it's like Do I wait it out? Do I wait to go res them? There's there's a",
            "start": 1029.52
        },
        {
            "text": "because there's no like actual functional elevators. You just go up like a little zip or whatever. And I'm at the top and it's like Do I wait it out? Do I wait to go res them? There's there's a lot of excitement like that. And I think what kind of really pumps me out about Arc Raiders and the different jokes for different folks, right? But running across a team in the game Marathon, which I still enjoy, not a game that I love yet. I hope we can maybe get there. But with Marathon running against another squad because the mechanics and the look and the first person shooter and hit three to run with your knife out so you run quicker. It reminds me of running across another team in a battle royale. Mainly Apex cuz the game reminds me so much of Apex. Yes. And it it's that same sort of vibe where I'm not ever really super surprised and the heart rate doesn't quite get as high, but it's still like exciting to run another squad. You want to shoot them. We want to kill them. All",
            "start": 1069.44
        },
        {
            "text": "of vibe where I'm not ever really super surprised and the heart rate doesn't quite get as high, but it's still like exciting to run another squad. You want to shoot them. We want to kill them. All communication. We had some great exciting moments. Yeah. There's something just really cool about Arc Raiders that reminds me so much of playing Day Z. So, let's get into it. Let's talk about Arc Raiders, Andy. How much have you played and what's your experience with it? Um, Arc Raiders is something that me and Mike played many, many months ago as an early preview. We couldn't even record it. I really wish we could record our gameplay cuz we had like some awesome laughs and great moments. And then this opportunity came up again to hop in Arc Raiders for the second preview before the big one that uh releases tomorrow, which is kind of more of a public thing. You have to go to their Steam page and request access. And Arc Raiders is from Embark Studios, the people that made the finals. There's",
            "start": 1113.84
        },
        {
            "text": "uh releases tomorrow, which is kind of more of a public thing. You have to go to their Steam page and request access. And Arc Raiders is from Embark Studios, the people that made the finals. There's a lot of like former DICE developers on there as well. Um, it is a third person shooter. I've played maybe around six or seven hours maybe now, maybe eightish. um over the different sort of gaming, you know, periods that we could play and a lot of it reminds me of Day and the the sort of stress that comes with that as well. And maybe it was like the third time that we played it, the final time that we played it, because Michael's like, \"Oh [ __ ] we're playing on the nighttime map.\" And I felt the need to be way more stealthy and sneaky. And you hear shots ringing out in the distance and you're like, \"Oh [ __ ] squads over here. Keep a lookout because they're probably going to be in this area.\" And then as we start sort of sneaking in these darker rooms where, you know, you turn on your",
            "start": 1160.0
        },
        {
            "text": "like, \"Oh [ __ ] squads over here. Keep a lookout because they're probably going to be in this area.\" And then as we start sort of sneaking in these darker rooms where, you know, you turn on your flashlight, but you don't want to have it on too long cuz you don't want to maybe make anybody else aware that you are out there. Um, the robot NPCs are really tough to kind of take down cuz once the robots take start shooting you, you're like, \"Shit, they're alerting everybody else that shit's going down here.\" Um, and there was just like a tension there, man. We were creeping in the dark. We were like, \"Where's the squad at?\" They're at the bottom of the elevator. There was just it I It felt great. It It felt exciting and and full attention. And that's kind of the feeling that I've been looking for in a lot of these styles of games. I still don't think extraction shooters are 100% my [ __ ] but if you put me in a lobby with my friends, I'm going to have fun cuz I like pointing and shooting",
            "start": 1211.04
        },
        {
            "text": "for in a lot of these styles of games. I still don't think extraction shooters are 100% my [ __ ] but if you put me in a lobby with my friends, I'm going to have fun cuz I like pointing and shooting and clicking. You know, Mike, you like pointing, you like shooting, you like clicking, you love hanging out with your friends. What was your experience with Arc Raiders? I really enjoyed Arc Raiders. I like Arc Raiders for the setting. I think the different maps that they had, the zones felt big to the point where you could hear gunshots ring out and you would be enticed to maybe go check it out or want to go hide and go the opposite way. But like these maps were very cool, right? reminiscent of like a I don't know, Nick, like an 80s Mad Max type movie, right? Well, I mean, it's literally like it's like watching Last of Us right now, too, right? It's just any post-apocalyptic sort of like post-apocalyptic in the desert, bright colors that all around you, right? And I think the third person",
            "start": 1253.2
        },
        {
            "text": "it's like watching Last of Us right now, too, right? It's just any post-apocalyptic sort of like post-apocalyptic in the desert, bright colors that all around you, right? And I think the third person uh perspective also adds to that, right, of like you seem so small in this giant map as opposed to Marathon where Marathon right now feels like smaller maps that are definitely meant to like you're going in for engagements and you're going to clash and that kind of gives that battle royale feel. I like lots of elevation here too. I liked Dark Raiders for the setting. Uh I also liked Dark Raider for the vibes, right? And I think there's just like a cool theme of like this robotic world meeting this post-apocalyptic world and you're kind of blending the two together. So, we're out there shooting these super futuristic robots, but all I got is this like put together pistol that has 10 rounds and goes super slow or my assault rifle only has 15 bullets and it sucks. And of course, you'll build",
            "start": 1294.32
        },
        {
            "text": "these super futuristic robots, but all I got is this like put together pistol that has 10 rounds and goes super slow or my assault rifle only has 15 bullets and it sucks. And of course, you'll build off of that to get better and better. Um, I liked walking around with the crew. I enjoyed the missions that they gave us. It felt like every other extraction shooter. Nothing different on the mission structure wise. I appreciated the presentation a lot more than Marathon though. And Marathon is already kind of hinted that they may want to introduce a hub world. So when we play the cycle frontier, which got shut down recently, uh the cycle frontier when you'd finish a run, you'd go back to your home world and or to your hub world rather, and you would see your other home like other homies kind of running around going to accept missions from different NPCs and stuff. Yeah. Uh that's probably like the most It felt like the Destiny Tower, right? Uh in the in Marathon, you're basically looking",
            "start": 1337.12
        },
        {
            "text": "of running around going to accept missions from different NPCs and stuff. Yeah. Uh that's probably like the most It felt like the Destiny Tower, right? Uh in the in Marathon, you're basically looking at a video that plays and of a person of a computer of an AI, whatever it may be, and then dialogue is read to you. With uh Arc Raiders, I I really appreciated that while still not a hub world, which I would ultimately prefer, it's a 3D model of a human being that is looking at you, talking to you, saying like, \"Hey, man, here's the deal. We need this and but and so not quite a hub world but still more presentation that than what Marathon offered. Keep going temp. Yeah. What if Nick? What about you? Like you you played this too. Yeah, it's very interesting. So playing this back kind of back toback actually on on alternating days with Marathon was a very interesting experience for me cuz we played Marathon first uh the alpha and I was like this is really fun. This is scratching an itch",
            "start": 1380.32
        },
        {
            "text": "toback actually on on alternating days with Marathon was a very interesting experience for me cuz we played Marathon first uh the alpha and I was like this is really fun. This is scratching an itch that I I like. I like extraction shooters. I think it's fun. And you're more of a first person guy, right? Um first or third? I I just I like anything competitive shooting wise and um I am I mean I gravitate more toward first person shooters. I think that's just cuz that's the that's the majority of the genre is first person. Um if you name any game that's come out that's competitive shooter the last like you know six six years it's most of them have been first person right. Um, we played Marathon. I was like, \"This is really, really fun.\" And then you jump right into Arc Raiders and Andy's right. It's a different pace and it's a different vibe and it definitely has a like the second you're in this world, you feel isolated and that you're in danger and that there is no safety for you. And",
            "start": 1427.6
        },
        {
            "text": "It's a different pace and it's a different vibe and it definitely has a like the second you're in this world, you feel isolated and that you're in danger and that there is no safety for you. And that's a really cool fun feeling as a player. And then of course when you do inevitably clash with another team, you can feel they're feeling the same thing and they're not quite sure if they should push you or not, but they don't have a and then you're, you know, you're they don't know you don't know if they have a choice or whatever, but then all of a sudden you're you're you're entangled with them. Um I immediately thought, hey, I kind of I think I'm gravitating more toward the Arc Raiders experience than than Marathon. And then we jumped into Marathon the next day and I was like, okay, they're they're just very different. One is more fast-paced, one is more forgiving. Marathon's way more forgiving because you can actually res people a little bit easier and all that stuff and one person can",
            "start": 1467.44
        },
        {
            "text": "they're just very different. One is more fast-paced, one is more forgiving. Marathon's way more forgiving because you can actually res people a little bit easier and all that stuff and one person can like run away and and bring the other people back. Um, but Arc Raiders is like if they had a single player mission in that if there was like a 20our experience I would jump into this and play this game. It's really fun and that's what's kind of ultimately more of a bummer cuz I think my feedback which is echoed by a lot of other people and it's ultimately like well you're just asking for a different game at this point is that I look at Marathon I'm like I I I just wish it was a PvE game with a PvP side component like the Division Dark Zone. I wish it was just another version of Destiny. Arc Raiders when revealed in 2021 was going to be a luda shooter like PvE game co-op with your friends or whatever and then they eventually kind of turned it into this more um extraction shooter experience",
            "start": 1506.08
        },
        {
            "text": "when revealed in 2021 was going to be a luda shooter like PvE game co-op with your friends or whatever and then they eventually kind of turned it into this more um extraction shooter experience which is a huge bummer cuz it reminds me so much of the Division because it's not only third person but has a cool little dodge roll when you're trying to get back into cover and stuff. um the switching of views from from each shoulder. There's just like a really good tactical nature to it. And because the maps feel a lot larger, right, Mike? Like they definitely feel more there's more places to explore than just the you know like buildings in Marathon. I think the Marathon buildings maybe go three or four stories, but there's some gigantic structures, super tall structures stuff, too. you talking about the verticality earlier. Like I'm very taken back by how much variation there is in the terrain. It it feels like you're just playing in a much larger map and and I think you get the added",
            "start": 1549.84
        },
        {
            "text": "about the verticality earlier. Like I'm very taken back by how much variation there is in the terrain. It it feels like you're just playing in a much larger map and and I think you get the added feeling of this sort of aloneeness feeling because you are in third person. Yeah. But I I love it. I love that sort of that that sort of dread when you're kind of walking into these zones because it doesn't quite feel it feels more like the PVP engagements happen more by happen stance where with Marathon it feels like they really want you doing that. Yeah. And I don't know which one I prefer or not. Yeah. I think Marathon feeds the audience like me who wants that engagements, right? Like I think Andy will tell you whenever I hear gunshots I usually say, \"Let's go find that.\" Right. as opposed to like, hey, let's try to avoid that and keep on to the mission or keep searching. Maybe we'll get a better engagement on them. I usually hear the gunshots and it's like I'll drop everything and just",
            "start": 1603.44
        },
        {
            "text": "like, hey, let's try to avoid that and keep on to the mission or keep searching. Maybe we'll get a better engagement on them. I usually hear the gunshots and it's like I'll drop everything and just start chasing that, right? And I think for me on marathon side, I like that clash, right? I really enjoy the, hey, we are a looter shooter extraction game, but at the same time, like it's a battle royale type vibe where you're just going to be clashing all the time and you're going to get third party and frustrated because it happens so quickly. That first day, Mike. Yeah. When we played Dark Raiders, it's like you could go a run without ever seeing a team. That's how big the map feels and how much room you kind of have to play cat and mouse with, but you could bang into a team. When you play marathon, it's like, oh, you're going to bang into a team and you might bang into two or three teams and it gets wild. So, I like that side of things because it feeds that constant competitiveness that",
            "start": 1652.48
        },
        {
            "text": "it's like, oh, you're going to bang into a team and you might bang into two or three teams and it gets wild. So, I like that side of things because it feeds that constant competitiveness that I want, but at the same time, I like our creators of like, let's slow it down, let's get lost in this, and that's the setting that builds that. But I do wonder though, right? Because for me specifically, the competitive aspect of it is what keeps me coming back. I've never gravitated toward The Division or anything like that where it is just you're just constantly fighting AI bots and it just feels like it's such a such a cycle of predictability that there is no wow factor to it where when you do clash with a team like we had that that moment in Arc Raiders where we clashed with the team and I was like we're great and then another team came up and I was like oh [ __ ] right? You forget that's actually a possibility. So, I think you do need that competitive aspect of it. And I think to myself,",
            "start": 1690.72
        },
        {
            "text": "like we're great and then another team came up and I was like oh [ __ ] right? You forget that's actually a possibility. So, I think you do need that competitive aspect of it. And I think to myself, like if we were if you were like, \"Nick, let's play more marathon right now.\" I would absolutely want to do that. I think a lot of it comes down to the def for me it's like the really deflating feeling of us having a great first day with Marathon. Yeah. And then me and Mike turn on the stream that night and it was five straight backto back like dying so fast and almost you got to assume sometimes like maybe there was like interesting. What was the uh what was the difference there? Oh god. What was the difference in your team? We were missing our rock. We were. Yeah. Sure. Yeah. Our anchor, as some would say. Most teams need an anchor. Oh, anchoring you to reality. Is that what you're saying? And that's the problem with the extraction shooter is about like the fun tagline that they all use,",
            "start": 1728.64
        },
        {
            "text": "would say. Most teams need an anchor. Oh, anchoring you to reality. Is that what you're saying? And that's the problem with the extraction shooter is about like the fun tagline that they all use, right? Scavenge, survive, thrive, right? And at the end of the day, you want to thrive. We've gone into the world, we've gotten all this cool, sick loot, and at the hopefully by the end of the night, we are thriving. Meaning, we have the best guns, the best gear, the best loadouts, and we feel confident to bring them in. But there's moments where me and Andy had right in marathon where you get in a cycle of losing. You've now lost all your guns. You're up against the wall of I have the bare bones load out that I can walk in with. And Nick and his squad are going to be thriving and we're at a big disadvantage. Now, I will say in all of this, it always feels like you have the opportunity to be on an even footing with them and maybe catch them, but like there is a that team was very much better",
            "start": 1773.2
        },
        {
            "text": "disadvantage. Now, I will say in all of this, it always feels like you have the opportunity to be on an even footing with them and maybe catch them, but like there is a that team was very much better than us with all of their guns and weapons and we were up against it cuz we didn't have anything and we lost it. Right now, we feel down. We we're beat up on that and I think Arc Raiders would allow us to kind of crawl back. Right. Big enough room. We can loot, we can get out, we can do good. Marathon, if you jump in with the basic load out, you're going to get run over probably 80% of the time. They're going to find you. I don't think you're getting in and out safely. It does feel a little It does feel harder to Oh, sorry. Do you want to throw an ad? I I want to keep talking about this, Nick, but we'll do that right after a quick word from our sponsors. This episode is brought to you by Imperial. We have told you all how important it is to developers that you wishlist the games you're",
            "start": 1812.96
        },
        {
            "text": "but we'll do that right after a quick word from our sponsors. This episode is brought to you by Imperial. We have told you all how important it is to developers that you wishlist the games you're interested in. So, if this sounds cool to you, make sure you wishlist it. I can't tell you how much it helps. Imperial is a complex, featurerich action RPG where you'll be sent to a planet in a far-off corner of the galaxy to explore enormous imposing monolith. As an elite mercenary, you'll join the expedition tasked with unearthing the secrets of the monolith and face off against the deadly automatons within. In Imperial, you'll explore four vastly different quadrants of the monolith, accessible only by using mysterious artifacts known as cardoggrams. Each cardoggram affects which enemies, boss fights, and loot will appear when you enter the monolith, so no two excursions will be the same. Find even more cardiggrams to explore by looting defeated enemies, or buy them from other players",
            "start": 1850.4
        },
        {
            "text": "boss fights, and loot will appear when you enter the monolith, so no two excursions will be the same. Find even more cardiggrams to explore by looting defeated enemies, or buy them from other players online at the trading post. You'll need to make sure you have the right gear to take on the harder Cardagrams. Build your mercenary, choose your gear, master your abilities, and take down everything in your path in Imperial. Face off against enormous deadly bosses and seek out secret paths to find bigger and better loot. Help the members of the expedition in deep branching quests and aid other players in asynchronous multiplayer. Get ready mercenaries. The monolith awaits. Imperial is available May 8th on PC, Xbox Series X and S, and PlayStation 5. Wish list now. It helps so much. Wishlist Imperial. This episode is brought to you by Aura Frames. If you haven't called your mom in a while, here is your reminder to do it. But if you want to go above and beyond, beyond. Mother's Day is coming",
            "start": 1894.24
        },
        {
            "text": "This episode is brought to you by Aura Frames. If you haven't called your mom in a while, here is your reminder to do it. But if you want to go above and beyond, beyond. Mother's Day is coming up and I have the perfect gift idea. Ora frames are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preloaded with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special they'll use it every day. Me, Kevin, and a ton of people at Kind of Funny are obsessed with our Aura frames. It takes about two minutes to set up the frame using the Aura app. Aura frames were named the best digital photo frame by Wire Cutter and featured in 495 gift guides last year. I counted Orura has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting orura.com to get $35 off plus free shipping on the bestselling",
            "start": 1939.68
        },
        {
            "text": "last year. I counted Orura has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting orura.com to get $35 off plus free shipping on the bestselling Carver matte frame. That's auraframes.com. promo code kind of funny. Support the show by mentioning us at checkout. Terms and conditions apply, Nick. Riffing off that, it does feel like you can be a lot more tactical in in Arc Raiders. It feels like you can there if because the map is so big, especially those night maps where you can literally be like, we could do a run where we don't fire a single bullet if we wanted to. And I think that's that's always a double-edged sword for me cuz you do it once, that's great. You do it a second time, that's great. Third time, I'm like, I'm itching. I got to kill a real human right now. And so I think that I I think that's in the grand scheme of things, while they're both really fun, I think I would gravitate more toward Marathon because I do think I",
            "start": 1985.2
        },
        {
            "text": "to kill a real human right now. And so I think that I I think that's in the grand scheme of things, while they're both really fun, I think I would gravitate more toward Marathon because I do think I want that that type of engagement more so than I want the let's explore this environment. I think that's going to just run itself thin very quickly for me. Yeah, I think for me and Nick in particular, I think I can speak for him. It's like we get kind of bored over and over again looting the same stuff, right? looting that just basic gear or the duct tape of like every run you're going in there and you're just looting and it's like no, I'm here to shoot, right? And so I want to shoot more than I'm just grabbing random stuff from my backpack. Yeah, that's my thing is any game that reminds me that there's borders to the game or anytime I start seeing behind the curtain of like, hey, this is just the basic programming of this. I start getting bored and I immediately lose focus. That's why",
            "start": 2028.24
        },
        {
            "text": "that there's borders to the game or anytime I start seeing behind the curtain of like, hey, this is just the basic programming of this. I start getting bored and I immediately lose focus. That's why that's why I think I stayed with battle royale for so long because it it might seem like it's repetitive, but it's not. there's always something crazy or chaotic to look forward to that's new in the experience. And it's the same reason why that or it's the inverse reason why I never really gravitated toward Call of Duty's multiplayer because that just felt so grindy and so sy that I think you need to have both those elements to keep my attention specifically. I I guess for me I'm on the opposite side of it where if it's all of the time human engagements I I want it to feel more special and that's why I think I'm leaning more towards enjoyment in Arc Raiders because it does feel tense hearing the audio. The audio is [ __ ] fantastic in both games honestly. Uh, I think the the audio design",
            "start": 2067.84
        },
        {
            "text": "why I think I'm leaning more towards enjoyment in Arc Raiders because it does feel tense hearing the audio. The audio is [ __ ] fantastic in both games honestly. Uh, I think the the audio design of hearing other players walking around like the the LA last night playing with Kevin and Maddock and we're looting inside of a room and then hearing like footsteps and you're like, \"Oh [ __ ] there's something here. Someone here. Something here.\" Kevin, send out the [ __ ] drone. Oh, it's one dude. I only see one guy. Is it only one person or they are his two squadmates somewhere else? And then he's sort of like, you know, I'm like he's right here. I'm pinging next to me because he's on the other side of the wall. And Maddo sees him, our homie Maddock, and is like, \"Start shooting him. Start shooting him.\" We start shooting him. Oh [ __ ] he has a purple shield. We take his ass out. We don't know where the other two people are. Did he die? Did he come in here alone? We don't know. I kind of",
            "start": 2107.84
        },
        {
            "text": "him.\" We start shooting him. Oh [ __ ] he has a purple shield. We take his ass out. We don't know where the other two people are. Did he die? Did he come in here alone? We don't know. I kind of want to wait to go loot. Should I go loot yet? I'm scared that like maybe they're just watching my bag. You know, all those sort of thoughts start racing through your head. I go out and I go take all of his [ __ ] and it's like, \"Oh, that was cool. That was thrilling.\" And I think if I wanted more of that, I would just play a battle royale. Fair. And with Arc Raiders, I love the tension, es the night map especially was like the one that really made me feel the fear with especially how good great their audio design is where even when you're walking around, you're like, is that a noise or was that me? Like I'm hearing [ __ ] right now. And it's it really kind of [ __ ] with your head. And I I want to see what though what these games have to offer more with more dangerous areas. I want to progress",
            "start": 2149.92
        },
        {
            "text": "Like I'm hearing [ __ ] right now. And it's it really kind of [ __ ] with your head. And I I want to see what though what these games have to offer more with more dangerous areas. I want to progress more in those games. And I think the progression in that game overall feels more enticing because of how there being a skill tree in Arc Raiders as opposed to Marathon which has a kind of a more convoluted system. Yeah. We haven't really talked about there's a skill tree in Arc Raiders to make you feel like this is your character. It can be unique from everybody else. Marathon it's hey this is a hero shooter. We're going to give you set classes. You are going to pick one of these characters and you're going to jump in with their move set. Right. And so it is interesting to see right you and I on this skill tree in Arc Raiders which is big. It has what three different pathways maybe four. And you can choose oh I want more endurance. I want to be able to climb up a ladder faster. I want to",
            "start": 2188.72
        },
        {
            "text": "on this skill tree in Arc Raiders which is big. It has what three different pathways maybe four. And you can choose oh I want more endurance. I want to be able to climb up a ladder faster. I want to be able to look at people's backpacks to recover quicker and I'm still just whatever Mike character I want. Right? You can go into the store, buy cosmetics, right? You can just be generic soldier 42. But then on marathon side it's like hey here's four pre-made classes. You're going to choose from one of them and there's not much leeway between that. You're just going to be there. What's up, Andy? You were talking about the the audio and stuff and how impressive it is, but the visuals of Arc Raiders I'm kind of surprised by. And you talking a lot about the the night uh level having a very different gameplay style because of the dark and I saw a lot of the flashlight stuff that you were describing, but in the daylight stuff, it seems like there's a lot of like sun glare and like getting in",
            "start": 2229.76
        },
        {
            "text": "gameplay style because of the dark and I saw a lot of the flashlight stuff that you were describing, but in the daylight stuff, it seems like there's a lot of like sun glare and like getting in your eyes and stuff like is it am I wrong in saying that that this is a very pretty game? Gorgeous. And like does that like I feel like when you guys normally play your competitive There's no disrespect to Marathon by the way, but this game is stunning. Our creators surprisingly. I love I love them both for I I know like Marathon I think is a bit more uh I think it's a bit more polarizing art style-wise. Like some people really don't like it, some people really love it. I happen to really love Marathon's art style and I love art creators art style. But so with this though, I feel like uh when I hear you guys talk about competitive shooters and stuff, you usually want to turn all the visual settings off so it's not distracting, the lights not getting in your way, but is that part of the gameplay",
            "start": 2267.76
        },
        {
            "text": "you guys talk about competitive shooters and stuff, you usually want to turn all the visual settings off so it's not distracting, the lights not getting in your way, but is that part of the gameplay here? I think it's part of the experience. Yeah, for sure. I think it it it adds to the immersion a lot more for sure. Like it adds to the the sort of feeling of dread and just I think the game looks gorgeous and I want to see it look amazing. It's not necessarily a game that I need to have 200 frames per second on. I don't mind rocking, you know, 80, 90, 120 or whatever. Like, I I I I I would I prefer the visuals so much that I want the experience to look great because I'm having fun with this experience. And yeah, I think just like the dynamic sort of lighting. Um, Marathon has a very similar thing where Marathon I think is it looks great, but Marathon also is super light and super like diet when it comes to how it runs on your machine. It can run on a lot of much lower powered machines.",
            "start": 2306.48
        },
        {
            "text": "thing where Marathon I think is it looks great, but Marathon also is super light and super like diet when it comes to how it runs on your machine. It can run on a lot of much lower powered machines. It feels like I don't know how Arc Raiders would really fare. I don't know how Arc Raider scales performance-wise, you know, cuz it looks really damn good. I was going to say probably not as well as Marathon, but but I'll second that like Arc Raiders is also not it's not a ultra fast Call of Duty multiplayer like you need those frames because you need to have your 13-year-old reflexes be like as jacked as humanly possible. This is a tactical. This is way more tactical. you get caught out in the open, it doesn't matter if you're have 200 frames per second with this, you're going to get destroyed. Yeah. Uh and that's that really adds to it. And I would actually second that. I really do think that like this would be the one game that I'd be like, you know, when they they always have I don't",
            "start": 2351.16
        },
        {
            "text": "Yeah. Uh and that's that really adds to it. And I would actually second that. I really do think that like this would be the one game that I'd be like, you know, when they they always have I don't think they even have it in this, but like in most games where it's like you want to set your gamma and we all be like, \"Yeah, we'll set it right, but we all jack it up, right?\" This is the one where you want to set it correctly because it really does add the tension to like like I said with that first example of looking down the hallway and seeing the actual like real-time shadows and like not being able to see anything in front of you, but they can see you and then like seeing something move. You're like, \"Oh my god, this is terrifying.\" And it really really adds to the experience. Yeah, we got a bunch of super chats I want to get to here. Uh Demon Hacker says, \"I'm enjoying Mike's hello fellow children fit.\" I do. Here's the thing. There's, you know, the the hello fellow youth type thing.",
            "start": 2396.16
        },
        {
            "text": "a bunch of super chats I want to get to here. Uh Demon Hacker says, \"I'm enjoying Mike's hello fellow children fit.\" I do. Here's the thing. There's, you know, the the hello fellow youth type thing. This legitimately is children though. It is the vibes of like a kid at recess. You know what I mean? And I appreciate that a lot, Mike. It's ladies night. Ladies night. Remember that. Uh yeling says, \"Is Nick continuing Pokemon after the Elite 4?\" We are continuing Pokemon for Snowike Mike's birthday next week after the Elite. I'm sorry. Elite. Yes, we will. I'm sorry. He doesn't know about it. Yeah, he doesn't know anything. The end is the Elite 4. Yes. Uh next week, stay tuned for that. Flying Penguin says Nick's Nick on a Games cast. What is this Bizarro world? Got to get him off the bench. You know, he's been playing. He did a preview. He did hard. We also We also don't know where Greg is. We haven't seen Greg. We don't know where Greg is. Spring break is is never ending. Spring break.",
            "start": 2426.16
        },
        {
            "text": "You know, he's been playing. He did a preview. He did hard. We also We also don't know where Greg is. We haven't seen Greg. We don't know where Greg is. Spring break is is never ending. Spring break. Forever. Forever. They said it. They told us a long time ago. Look at all my [ __ ] Mike, how do you feel about the weapons and like upgrading things and going back once you're done with a run? What are your your strong points and your weaknesses in either Arc Raiders? The big drive for me right now in Arc Raiders is the setting that we've talked about with the visuals and the look and the style. I've really enjoyed I've actually not liked or connected with the weapons whatsoever in Arc Raiders. The very slower game, right? Feels like The Last of Us with the singleshot sniper rifle, the 10shot automatic uh rifle. I I haven't dug that, right? So, I really have enjoyed the futuristic more machine gun full blast thing on Marathon. Uh, I always dig finding a new scope, right? We talked about",
            "start": 2471.36
        },
        {
            "text": "automatic uh rifle. I I haven't dug that, right? So, I really have enjoyed the futuristic more machine gun full blast thing on Marathon. Uh, I always dig finding a new scope, right? We talked about it when you and I were playing Marathon on stream. I was like, \"Hey, what gun are you rocking? I have X, Y, and Z. Let me drop this for you.\" And so, I like the upgrades so far on both of these games finding them. I haven't found much in Arc Raiders to upgrade my guns. I never felt like we had that. I found one yellow sniper rifle. We lost it the next round, so I never really got to see it in action. But like I never felt like I was finding, hey, here's a scope for this gun or here's this gun's larger ammo round, right? As a marathon, I felt like I was finding that stuff. I don't I also don't know if we progressed even that. And we were because the unfortunately with just the way that we work here and us all, you know, we're always on a lot of shows and stuff. There was a lot of moments",
            "start": 2515.52
        },
        {
            "text": "know if we progressed even that. And we were because the unfortunately with just the way that we work here and us all, you know, we're always on a lot of shows and stuff. There was a lot of moments where it's like, I'm not even start up the next one cuz I got I got to be on Games Cast. I got to be on whatever. So, like just [ __ ] what we found. Get in there. Like, let's try to get another run in or whatever. Um, but when it comes to the weapons, yeah, I think the initial kind of weapons you find in Arc Raiders may feel a bit overwhelming or underwhelming because you're also you're essentially just shooting at steel robots and drones. So like when I I I always kind of make the comparison of why I always felt Battlefront Star Wars Battlefront was always underwhelming because shooting a laser just doesn't feel as cool as like hit a bullet like pop, you know, that hard impact. And there's something about uh shooting metal and hearing like ding ding ding ding ding that is not quite as",
            "start": 2559.12
        },
        {
            "text": "laser just doesn't feel as cool as like hit a bullet like pop, you know, that hard impact. And there's something about uh shooting metal and hearing like ding ding ding ding ding that is not quite as satisfying as it would if it was like a big monster enemy or other human NPC. Yeah. In Arc Raiders. That's interesting. I had the opposite feeling. I actually really liked the mechanics of shooting like just the little drones in the air and how they reacted to your bullets and they would like shift and and that that felt really organic trying to find the weak spot on like the larger spider enemy when it would open up and you'd get inside the I guess I'm thinking more of just the audio feedback but I love how in Arcadus you can shoot the individual propellers on these drones and it will if you break like that one propeller it'll and kind of like [ __ ] up or whatever. Um, but yeah, there's some I I I think I want to eventually put more time into Argus just to see how the weapons get. And",
            "start": 2604.96
        },
        {
            "text": "break like that one propeller it'll and kind of like [ __ ] up or whatever. Um, but yeah, there's some I I I think I want to eventually put more time into Argus just to see how the weapons get. And also the skill tree is really nice because I really loved feeling weak as [ __ ] at your lowest level and consistently upgrading to, oh, my stamina is coming back now. I'm not running 12 feet and then getting tired. I enjoyed seeing that progression. uh in addition to albeit how you know it is very very limited but the having a character creator and that's also another big disappointment I have with marathon with marathon you the lore is that you are a consciousness that is being put into a weaved like body exo suit right so you're just kind of like a mind being put into any sort of body doesn't matter like citizen sleeper yeah kind of it doesn't matter if it looks male or female whatever like you're just kind of being put into any body you want. And so that's why they had these classes",
            "start": 2647.28
        },
        {
            "text": "matter like citizen sleeper yeah kind of it doesn't matter if it looks male or female whatever like you're just kind of being put into any body you want. And so that's why they had these classes that you are able to sort of create. And it still bums me out because one thing I really enjoyed about the game that we played, Exoborn, which is another extraction shooter that we got to play that little Steam NextFest demo or whatever it was. Uh the way Exoborn is it's also a character creator, but the classes are dependent on what exo suit you are equipping. So, if you want to be the more tanky sort of exo suit, you put on the tankier exo suit. Where in Marathon, it's like you feel like you have less agency. And I think they want to have added agency by doing customization and getting cosmetics and getting a cool new helmet, cool new color scheme, whatever it may be. But I still look at Marathon, I go, but I want I want my Destiny Guardian. I want my character to be like my character. And",
            "start": 2701.04
        },
        {
            "text": "and getting a cool new helmet, cool new color scheme, whatever it may be. But I still look at Marathon, I go, but I want I want my Destiny Guardian. I want my character to be like my character. And then maybe I put on the glitch thing that makes me the glitch class or I put on the whatever class that gives, you know, I I just kind of find it's such a bummer with how much I [ __ ] with Bungie's art style and them not giving me a character created just like No, I've already talked it to death, but I it just really bums me. You talk about the look though, let's talk about the play. Did you like the hero move sets? Right. Because like for me, I enjoyed having the, \"Hey, let me scan the area.\" Nick fumbling the bag most of the time, but like him having the tank shield, his, you know, never quite got the hang of the shield. I'll tell you, like I liked when you threw down smoke. I liked that added layer of gameplay of, hey, how do we work these hero attributes together and actually be able",
            "start": 2747.2
        },
        {
            "text": "got the hang of the shield. I'll tell you, like I liked when you threw down smoke. I liked that added layer of gameplay of, hey, how do we work these hero attributes together and actually be able to do cool things? I do, but I think in the same vein, it could have been a character creator with you picking certain perks going into a Andy. You know, picking you could pick the radar thing that sends out the thing that pings enemies out there or I could pick the perk class that lets me drop down. Did you like the hero moves? I did enjoy them. I feel like they I want to see more creativity with them cuz they do feel a bit standard at the moment. But I also don't know if like is that even necessarily what I want out of an extraction shooter because does it then become too Apexy or Overwatchy where these abilities may start to you get that feature creep right like you it it happened in Apex where it's like the first class of heroes have you know their set moves and abilities and then they",
            "start": 2795.92
        },
        {
            "text": "where these abilities may start to you get that feature creep right like you it it happened in Apex where it's like the first class of heroes have you know their set moves and abilities and then they hey brand new hero we're making oh they're finally adding a brand new hero let's check it out and it's like this and this character abilities combine, you're like, \"Oh man, that's way better than them. Why would I ever?\" And then you start to see this like escalation of abilities, and I don't know if I want that in an extraction experience, and I also don't know if I want an extraction experience at all. Like, cuz I would rather play Marvel Rivals or any other multiplayer game. Like, I I took I took part in the Bungie little survey and it's like ultimately I don't think this is a game that I would ever main. I don't think this genre is a game that I would ever main. If I want to do a PvP, I would prefer the battle royale experience. I would prefer um Overwatch, Marvel Rivals, that sort of",
            "start": 2842.8
        },
        {
            "text": "ever main. I don't think this genre is a game that I would ever main. If I want to do a PvP, I would prefer the battle royale experience. I would prefer um Overwatch, Marvel Rivals, that sort of thing. So, like ultimately, I'm enjoying these games and I'm enjoying this genre, but I don't think I would ever it would ever be my main thing that I would like pour hours and hours into. And that it's interesting. You know, the topic of the show is extraction shooters. Yes or no? We have breaking news now from Jason Shrier. Electronic Arch is laying off between three and 400 staff, including a 100 at Respawn, cancing a Titanfall extraction. Yeah, I think that was the Star Wars stuff, right? This is more information. Well, yeah, this is we're getting more specific details. We did talk about this story, but it was all breaking and coming out. We now know that the title that Respawn was working on was this extraction shooter. Yeah. set in the quote unquote Titanfall universe, which means",
            "start": 2887.52
        },
        {
            "text": "this story, but it was all breaking and coming out. We now know that the title that Respawn was working on was this extraction shooter. Yeah. set in the quote unquote Titanfall universe, which means absolutely goddamn nothing because Apex Legends is in the Titanfall universe. Yeah. Uh we have a couple of super chats I want to get to as well. Um Cowhand uh super chatted about the Jason Trier news there. Um if there's more that comes out, we'll talk about that on Games Daily tomorrow. Uh then Dean says, \"Everyone's bubble's different, but I don't know anyone who has played these extraction shooters. Maybe I'm the odd man out, but I don't see why companies are chasing this as the next battle royale craze.\" And then Vulk Dasher says, \"The genre is still very niche, contrary to what some say. Free to play versus paid doesn't make a difference. Nobody wants these games anymore, especially from devs like Bungie and Sony.\" Any thoughts on that, Mike? I mean, they're taking a shot at the dart",
            "start": 2931.68
        },
        {
            "text": "Free to play versus paid doesn't make a difference. Nobody wants these games anymore, especially from devs like Bungie and Sony.\" Any thoughts on that, Mike? I mean, they're taking a shot at the dart board, right? Like, it's very tough to read the futureing ball, right, and go this is what it's going to be like four years, 5 years from now, right? You're seeing companies now come up with games that they've been working on for two to three plus years, and they're trying to find what's the new hotness. Fortnite has taken over and changed the world of video games in general, right? And so you have Call of Duty, which is a mainstay. You have Battlefield trying to get back into relevancy here. You have massive companies that have been shaken to their core on where we're at in 2025. And then there's smaller teams that are a little more agile, but they come and go. We've seen hundreds of games here on this panel and all of you that have played and then they've just kind of gone and they're",
            "start": 2972.64
        },
        {
            "text": "smaller teams that are a little more agile, but they come and go. We've seen hundreds of games here on this panel and all of you that have played and then they've just kind of gone and they're never coming back, right? And so I think it's very tough, right? and they're trying to hitch their wagon onto something that may blow up. Maybe it doesn't. But right now, no one knows what is going to be the next big money maker. You just try to make something great and hopefully people vibe onto that. You also have to remember this doesn't need to be Fortnite, right? You can get wins and still stick around. We've seen that a ton where people have made great games. We've all rallied behind them, played them for 6 months, a year, two years, and then they've gone and that team is now able to fund their next game, right? And so, yeah, maybe when we look at it on the EA level, it's massive, right? This is ground shaking. Oh, we made the wrong decision. But they're also testing a thousand different",
            "start": 3014.72
        },
        {
            "text": "next game, right? And so, yeah, maybe when we look at it on the EA level, it's massive, right? This is ground shaking. Oh, we made the wrong decision. But they're also testing a thousand different game types and going, what works? What doesn't? What can I say? Yeah, let's back up the brinks trucks and let's develop this for 5 years, right? We're in a a tough one right now. And so, yeah, I mean, we're trying. I I think this is something that someone is trying to find the mainstream game. They're trying to play it. It might not be for one day a week, two days a week. If I can start to build that momentum, that's a win for any company. I think the most I I think the most pressing question is the one I get a lot and the one that I'm always thinking about while playing these interaction shooter games is, you know, with with a game like Destiny or even thinking of The Division or any sort of looter shooter, you are trying to get the best weapon. You're trying to get the best gear and the",
            "start": 3054.96
        },
        {
            "text": "games is, you know, with with a game like Destiny or even thinking of The Division or any sort of looter shooter, you are trying to get the best weapon. You're trying to get the best gear and the best loot so that you can eventually take on the endgame boss or the final raid or whatever big thing it is. And that is still a question that people who maybe haven't experienced extraction shooters, that's still the question they're asking. What am I getting this for? Yeah. What? What? And a lot of it is like, well, to do another run and then to feel that thrill again of experiencing another team that you come across and you go, \"Oh, I beat your ass cuz I had this better gear or this better loot.\" Or you die and you lose that loot because maybe you just got sniped from an angle you didn't see. You know, it happened to me and Mike and granted we're not having this crazy loot that we could even worry about losing, but you know, running in marathon and we're just talking, shooting the [ __ ]",
            "start": 3104.0
        },
        {
            "text": "You know, it happened to me and Mike and granted we're not having this crazy loot that we could even worry about losing, but you know, running in marathon and we're just talking, shooting the [ __ ] and I like to think I'm I'm usually good at hearing like the footsteps and all that stuff. And so we're just kind of hanging on. It's like, oh [ __ ] we're Oh man, I didn't even we just landed here. I don't know how we didn't see that other team or whatever. like there is that riskreward that will be worth it enough for some people, but I don't know if this will ever capture the mainstream audience because I think they will still prefer the battle royale experience, prefer the 4v4, 5v5, Counter-Strike Valerin experience. Do what's the price on Arc Raiders? Is it free to play? Is it a paid game? I thought it was going to be 40. They were initially going to want to do freeto play and I think it's going to be 40 but $40. Okay. Yeah. Because they said that during the preview period because and",
            "start": 3153.92
        },
        {
            "text": "I thought it was going to be 40. They were initially going to want to do freeto play and I think it's going to be 40 but $40. Okay. Yeah. Because they said that during the preview period because and they're originally planned free to play shift to premium. Yeah. And like during that first preview session many sometime last year with them. The reasoning was we'd rather create content for the game that is for the betterment of the game and not to help sustain the company like free to like we'd rather us be able to make [ __ ] that makes the game better as opposed to like makes the company money to like oh we need to put on a new cosmetic to make more money. And I guess at the end of the day, it's like, oh man, this this could have been a looter shooter with a PvP component and I would have like lost my [ __ ] about that cuz you could still have the people like Nick that want the thrill of that. Or you could have the people like me that can momentarily to hop in to the PvP section but",
            "start": 3199.6
        },
        {
            "text": "like lost my [ __ ] about that cuz you could still have the people like Nick that want the thrill of that. Or you could have the people like me that can momentarily to hop in to the PvP section but still be like, \"Ooh, now we get to go to this map to take on that big ass crazy boss.\" Yeah. And who knows what that experience is going to be like, but I'm stoked to see what they cook up because a lot of these big robot enemies and arc raiders are super sick. They look awesome. They're scary. They're these big like they they get gigantic at some points where they're just massive spider walkers around the world. I mean, we're also in this uh day and age where hell divers last year just took over the entire planet and that is strictly PvE shooter like you wanted, right? Now companies are going, well, maybe we back off the PVP situation and extraction shooters. we make something like this, right? And so they're constantly in flux. Is it we need to charge $40 to make some money back because",
            "start": 3248.48
        },
        {
            "text": "well, maybe we back off the PVP situation and extraction shooters. we make something like this, right? And so they're constantly in flux. Is it we need to charge $40 to make some money back because if we go free to play and Andy and the crew does want to spend their time in it, we make nothing at all. Right? Like the business decision of now you weigh out the freeto play. Yeah. get more people in here. We hope to make some money on cosmetics or hey, we need this $40 price tag cuz whatever we do get in here is at least giving us the money that we can make back and put forward into it because if we go full freeto play and nobody wants to play this, we've lost it all. Well, there's no doubt they'll still be making content for cosmetic purposes. Yeah. Like there will still be dev time to make cosmetics that will Well, Arc Raiders has a battle pass, right? Like they're Yeah. All these games have battle pass. selling you all these cosmetic things in the chat who hates them. Someone in the",
            "start": 3290.08
        },
        {
            "text": "cosmetics that will Well, Arc Raiders has a battle pass, right? Like they're Yeah. All these games have battle pass. selling you all these cosmetic things in the chat who hates them. Someone in the chat was saying that the battle pass is free in Arc Raiders. It's It is, but I think there's there's a currency that you have to buy as well for for a lot of these up or something. I don't know. Got it. Um I mean Yeah, I think it's like everything else where you just buy our coin or whatever it is. I think it all depends on I think your question, Mike, is all depends on how good and viable the finals is. Yeah. You know, the finals the game. Yeah. Oh, yeah. I mean that this is just one of those of like Tim will tell you as Mr. Businessman, right? It's like there's a bunch of people in the room going, \"Can we go free to play? Do we need a charge?\" Right? That's why what we see with Marathon is like that team is now like, \"Well, we're a premium title. Not 70, but like we're going to have to",
            "start": 3331.68
        },
        {
            "text": "going, \"Can we go free to play? Do we need a charge?\" Right? That's why what we see with Marathon is like that team is now like, \"Well, we're a premium title. Not 70, but like we're going to have to put something on this cuz it clearly isn't going to be the way on freeto play with these right now.\" Uh final couple super chats here. First off, I want to give a congrats to Ravelord Nito, who says uh just Brave Lord Neato from Dark Souls 1. Oh, my bad, Andy. And and Mr. Neato, uh just accepted an internship at a game company for this summer as a programmer. Congratulations. Have fun. Hell yes. Uh and then Demon and Hacker has the last super chat of the day here, saying, uh survival, Arc, and V Rising versus Extraction. Which do the three of you prefer? Survival. Yeah, Andy likes survival games. I'm a survi. Yeah. Like if I had to choose, I'd have a more sort of zen-like experience and win. You know, an extraction shooter is I'm always on the edge of like I'm I'm just going to alt f4",
            "start": 3373.92
        },
        {
            "text": "games. I'm a survi. Yeah. Like if I had to choose, I'd have a more sort of zen-like experience and win. You know, an extraction shooter is I'm always on the edge of like I'm I'm just going to alt f4 after losing all my [ __ ] Like I just the frustration there is too high for me and I don't think this genre will ever 100% be my [ __ ] I'm on the chase constantly for competition. So I like that. I love the good survival game especially with these guys. We found a couple of great ones recently. But, uh, yeah, I'll always want to go in and try to be the very best or try to get close and see what happens. Yeah, I mean, competition for me all the way. I I all going in, looting, all that stuff, that's that's interesting for 5 seconds to me. But if I'm not clashing with teams, if I'm not feeling like I'm getting better at the core mechanics of a game, like like an athlete would in their particular sport, their chosen sport, then I know I'm just not coming back to this. If that's the case, I",
            "start": 3419.52
        },
        {
            "text": "like I'm getting better at the core mechanics of a game, like like an athlete would in their particular sport, their chosen sport, then I know I'm just not coming back to this. If that's the case, I have such an interesting thin line where I'm like, it's either ultra competitive or it needs to be a standalone single player story that I can just immerse myself in and not have to worry about anyone else. Give him Cyberpunk. I'm still playing Cyberpunk. Hell yeah. It's great. It's still great. I still just jump in every once in a while because I like to exist in that world on my own timeline, take the story or the side quests as I want to take them and not have to worry about that. And it's so weird and antithetical to what I just said about like dropping into war zone, but like there's so much energy that has to go into even getting your friends together to play a an extraction shooter that sometimes you got to just sit and it's midnight and you guys fire this up and hear Kiana Reeves",
            "start": 3463.52
        },
        {
            "text": "much energy that has to go into even getting your friends together to play a an extraction shooter that sometimes you got to just sit and it's midnight and you guys fire this up and hear Kiana Reeves sweet voice in my ear and just relax for a little bit and just get lost in this world. You know, I really quick I do wish on the um prox chat when we talk about that I wish more people took part in that. I feel like we live in such a dangerous wish to discord. Yeah. You you more on the side of, oh, I'm just in Discord and I'm not really doing the pract because I do wish there was more engagement of like, hey, we're talking about our day like, yo, shut the [ __ ] up. Everybody be quiet. They can hear us, right? You know, we get a lot of that. What do we live in? We live in a silent society, Baron. And that's where it is. People say they want prox chat, but like 90% of the time we're just on a Discord call. I wish it was like because like we found so many great games, right? That recent",
            "start": 3499.52
        },
        {
            "text": "Baron. And that's where it is. People say they want prox chat, but like 90% of the time we're just on a Discord call. I wish it was like because like we found so many great games, right? That recent game repo is all about proximity chat, right? Like you shouldn't be in the same room. We've done it with Lethal Company and other games where it's like everybody go in your own room, turn on the prox chat, and the moment that you can't hear someone, you get that fear, right? And then the moment they come back, you laugh and giggle when they're running away from something. And the same goes for extraction shooters of why that is so cool and what Call of Duty did with the death c or defs and all that of like you love hearing other people talking and you can be strategic of like, \"Everybody be quiet. we can hear them like let's creep up on them or you know they can hear you and come after them. I wish we had more of that. Uh well we just had an excellent conversation about extraction shooters",
            "start": 3543.36
        },
        {
            "text": "we can hear them like let's creep up on them or you know they can hear you and come after them. I wish we had more of that. Uh well we just had an excellent conversation about extraction shooters but the day is not over when it comes to them. We're about to hop into escape from Tarov. Mike and Nick are going to see if they have what it takes to escape. I don't know if that's how it works. We don't either. We're going to figure it out. Figure it out. Uh so if you're on Twitch, stay where you are. You'll be able to see that. If you're on YouTube, you need to make the jump over to the other video. Well, let us know in the comments below what you think about extraction shooters, yes or no. Or if you want to say anything else, uh, we'll appreciate that as well. Uh, until next time, it's ladies night. Celebrate ladies night.",
            "start": 3581.28
        }
    ]
}