{
    "id": 13910,
    "video_id": "KcVPR7bi3Oc",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Xanth"
    ],
    "title": "The BEST MONTH EVER for ARPG Fans! - Kinda Funny Gamescast",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page -  https://nwzo.io/click/dzexr/\nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\n\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\nTime Stamps:\n00:00:00 - Start\n00:05:27 - Housekeeping\n00:09:14 - ARPG April!\n00:12:05 - Path of Exile 2: Dawn of the Hunt\n00:24:05 - Last Epoch: Tombs of the Erased\n00:40:10 - Back from Ads\n00:50:20 - Diablo IV\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1745005780,
    "duration": 4312,
    "transcript_chunks": [
        {
            "text": "[Music] What's up everybody? Welcome to the Kind of funny games cast for Friday, April 18th, 2025. I'm one of your hosts, Greg Miller, alongside kind of funnies ARPG expert and the host of the Diablo podcast. It's Zanth. Well, hello, Greg. How are you doing? I'm good, Zan. It always does me well to see you broadcasting from this basement. What were you You're always ready for kidnapping. What are you doing down there? Uh, well, I live in the Midwest. We have a basement dwelling and I'm just kind of sitting on the outskirts of my bar in case I need an emergency drink at some point during say the word. I'll join you. We're in there. It's 11:30 here. I mean, oh, speaking of which, uh, you know, uh, you were you were in my neck of the woods recently. I was. Of course you say that you're being very liberal. You live in Wisconsin, Milwaukee, if I remember correctly. I was in Ly, Illinois. You and your son came down for one night with Greg Miller. Thank you so much. Uh, and phenomenal show.",
            "start": 6.61
        },
        {
            "text": "very liberal. You live in Wisconsin, Milwaukee, if I remember correctly. I was in Ly, Illinois. You and your son came down for one night with Greg Miller. Thank you so much. Uh, and phenomenal show. Great to be there. Um, but you were you were in my neck of the woods. I did uh I did trade you a little bit of beer. You did? Did you try it yet? I did. Oh my god. Yes, I did. What's the actual name of it? I don't remember off the top of my head. Uh, it's called Ecto-Cooler. Well, but they spell it funny, don't they? Whatever. But it's a beer that tastes exactly like Ecto-Cooler. Exactly like Ecto-Cooler. It was so good. It was delicious. Right. Um, when I had had it, I was like, Greg is going to love this. So, I'm glad uh to hear that. Now, um, a little bit of more housekeeping before we Wait, but who makes that beer? I forget who makes that beer. Uh, that is Eagle Park Brewery uh, in Wisconsin. So, if you are in the Midwest and can get your hands on it, I wanted to uh, be able to get it",
            "start": 67.12
        },
        {
            "text": "but who makes that beer? I forget who makes that beer. Uh, that is Eagle Park Brewery uh, in Wisconsin. So, if you are in the Midwest and can get your hands on it, I wanted to uh, be able to get it for you when I was in California, but the distribution is not that vast. But, uh, I believe uh, Wisconsin, Illinois, Iowa area, you should be able to get your hands on it. So good. It really is. It's phenomenal. Um, now little more housekeeping. As I was saying before, you know, you you brought the the briefcase. I see it was Spectoooler. I knew they spelled it funny. Spectoer. Oh, there it is. I mean, I'm sure there's like some legality that you can't I'm sure, too. I'm just saying. Obviously, somebody going to be googling around for Ecto-Cooler. They're not going to find it. You look for Specttocooler, you'll get it. Spectoer. Um, phenomenal. Phenomenal. Uh, anyways, uh, you had the briefcase. You were offering it up for people to be able to put in notes to Tim. My son had a note and we",
            "start": 111.84
        },
        {
            "text": "you'll get it. Spectoer. Um, phenomenal. Phenomenal. Uh, anyways, uh, you had the briefcase. You were offering it up for people to be able to put in notes to Tim. My son had a note and we didn't get a chance to to drop it off. So, I feel like I I I feel like this is probably the best place to do it. I said I would I would share it. If you don't remember everybody, my name is Greg Miller and I have Stars in the Bank from Kind of Funny Games Show Showdown. It's our show. You'll see right after this. We're doing an episode. Uh, this of course entitles me to challenge Tim whenever I want to for three of his stars. I brought the briefcase because everybody loves the briefcase uh to Chicago. So many people took photos and then just organically people wanted to leave hate mail inside of the briefcase for me to read to Tim which I have been doing all week. I'm happy you're here even though Tim is not to read some hate mail. So go for it. I was really hoping Tim would be here but uh coward",
            "start": 158.08
        },
        {
            "text": "for me to read to Tim which I have been doing all week. I'm happy you're here even though Tim is not to read some hate mail. So go for it. I was really hoping Tim would be here but uh coward this is courtesy courtesy of my son. It's real simple. Oh, it's just it just says let Tim host. That's positive. I don't like that's a positive. Oh. Oh. Oh. Ah. De Nazi. Got him. You suck, Tim. You suck. Are there Are there three stars there as well? Oh, there are three stars there. Your son's wise beyond his years. How old is he? He's 13. Look at that. That kid's got a future. That kid's got a career. I hear he's playing Monster Hunter Wilds, too. He's He's a man of taste. His dad isn't. No, not at all. He gave his dad the code, but his son's playing it apparently. Not like there's a million ARPGs coming out this month. No. And that's man, that is a beautiful transition, you know, like what am I doing here? It's not just to insult Tim. Uh, it's not to Well, no. I mean, not to just give you a",
            "start": 202.56
        },
        {
            "text": "coming out this month. No. And that's man, that is a beautiful transition, you know, like what am I doing here? It's not just to insult Tim. Uh, it's not to Well, no. I mean, not to just give you a recommendation. We could spend a lot of time doing that. Um it's it's the greatest month for ARPGs uh that I have witnessed in a long time. And so top level before I give the intro to the show, what does that mean? So this is the the first time that like three major players in the ARP genre are dropping major releases and updates in in the same time span all in the month of April. starting, you know, at the beginning with Path of Exile, then Last Epoch, and finally Diablo I at the end, every like every fandom kind of gets its own little uh celebration, its own little update to to dive back into. And it's a busy month for me. I want to hear all about this. I want to talk about ARPG being the uh April uh 2025 being the best month ever for ARPG gamers. Uh, but first I want to remind everybody",
            "start": 253.28
        },
        {
            "text": "And it's a busy month for me. I want to hear all about this. I want to talk about ARPG being the uh April uh 2025 being the best month ever for ARPG gamers. Uh, but first I want to remind everybody this is the kind of funny games cast. Each and every weekday we talk to you about the biggest topics in gamings. Whether they be reviews, previews, or just things we need to talk about, we do it live on youtube.com/kindfunnyames, twitch.tv/confunnyames, and podcast services around the globe for your listening and viewer pleasure. If you enjoy what we do, of course, pick up the Kindfunny membership over on youtube.com/kindfunnames. patreon.com/kindfunny. Apple and Spotify, you can pick up the Kind of funny membership. You can get all of our shows. That's more than 80 a month ad free. And of course, you get your daily dose of me, Greg Miller, in a oneman podcast series, usually from my car called Gregway, where I give you 15 to 20 minutes each and every day, adding up to about four hours of",
            "start": 307.36
        },
        {
            "text": "you get your daily dose of me, Greg Miller, in a oneman podcast series, usually from my car called Gregway, where I give you 15 to 20 minutes each and every day, adding up to about four hours of exclusive podcast each and every month. No bucks toss away. No big deal. Like, subscribe, share. If you got Amazon Prime, you got Twitch Prime, give us that free sub and please tell your friends about us, whether it be through the reviews or the ratings. Uh, if you are watching live and you are an ARPG nerd like us, of course, we have YouTube super chats ready to go. Uh, you go to youtube.com/confunname super chat there to be part of the show with your questions, comments, concerns, recommendations. Uh, Guitar Hero Arrow wrote in and said, \"I got an extra Indiana Jones PS5 pre-order bonus code for any interested KFBFs. Can't wait to finally swing in this weekend. Uh the code is Q95 Q47RM A38M. Go get that one. And then down here, Omega Buster says, \"Support Tim, the people's champion. Don't",
            "start": 354.96
        },
        {
            "text": "any interested KFBFs. Can't wait to finally swing in this weekend. Uh the code is Q95 Q47RM A38M. Go get that one. And then down here, Omega Buster says, \"Support Tim, the people's champion. Don't let phony baloney Greg Miller steal the stars. # save the stars. You can't steal what is promised.\" All right. What the real theft on Game Showdown has been blessing giving softballs to Tim over and over again. I'm getting quizzed on what what the Freedom Wars publisher fighting games are putting out. He's like, \"What the Freedom Wars? What's the What's opponent's name?\" You know what I mean? Get the hell out of here. Get the hell out of here. Opponent. That's That's the opponent's name. I know. And it's upsetting. That's the kind of question Tim gets on the show. You're CEO Junior. There's no wall protecting us. You be on my side this time. All right. You be on my side. I mean, I like Chad. I'm touching him. I'm touching Barrett. It's weird. But he's not on camera, so it wouldn't hold up in",
            "start": 397.28
        },
        {
            "text": "protecting us. You be on my side this time. All right. You be on my side. I mean, I like Chad. I'm touching him. I'm touching Barrett. It's weird. But he's not on camera, so it wouldn't hold up in court. Housekeeping for you. Uh we're an 11 person small business all about live talk shows. Uh, you already got kind of funny Games Daily today. It was covering Nintendo's commitment to the Switch 2 price and the new US pre-order date of April 24th. That's right. Right. I didn't double check it. I shoved it in there. April 24th. That's right. Uh, after this, you'll be getting an episode of Kind of Funny Game Showdown. We'll see how Blessing tries to screw me out of my birthright this time. Uh, and then after that, it's the Kind of Funny podcast talking about the sexiest song lyrics of all time. That's my topic. I'm bringing that topic. Okay. Okay. Uh, and then, uh, if that wasn't enough, you are also getting a 2X KO stream that rounds out your incredibly packed Friday. That also might be a",
            "start": 441.44
        },
        {
            "text": "That's my topic. I'm bringing that topic. Okay. Okay. Uh, and then, uh, if that wasn't enough, you are also getting a 2X KO stream that rounds out your incredibly packed Friday. That also might be a rematch stream as well. Oh, it might be rematch. Rematch like open beta this weekend. Oh, so Bless is like emotionally being pulled towards two games right now. He'll end up with a rematch, I think. Is that is that is rematch coming this year? Yeah, it's got it's got a release date. Yeah, cuz when I I almost put in my fantasy team a long time ago, like before this beta, and I was like, I'm not confident. And then I was like, maybe I should have. I know it's been picked up now. Yeah, I did. I picked that up. It's going to be great. Yeah. Uh, if you're a Kind of funny member, you can get 20 minutes of unfettered access to my mind right now over on youtube.com/kindfunny games and patreon and Spotify and Apple. And thank you to our Patreon producers, Anatoli Ass, Delaney Twining, Carl Jacobs,",
            "start": 478.72
        },
        {
            "text": "of unfettered access to my mind right now over on youtube.com/kindfunny games and patreon and Spotify and Apple. And thank you to our Patreon producers, Anatoli Ass, Delaney Twining, Carl Jacobs, and Omega Buster. Today we're brought to you by Imperial Factor and Shady Race. We'll tell you about that later. For now, let's start with what is and forever will be topic of the show. Dots. I forgot to load into the PNG. It's fine. It's just a day. We're just doing a date in here. It's fine. Uh Zanth, as you said, it's April 2025 and three major ARPGs have three major content updates. Uh what I love about you, Zanth, is you grabbed the bull by the horns. All right. You came to me and said, \"Hey, we should do a Games cast about this. This is why you call me Kind of Funnies ARPG expert.\" I said, \"That is right.\" So you you take the reigns. Explain to me how what's happening, where this is happening, which is the biggest, where what's the hottest? Does anyone care about Diablo anymore? I got a",
            "start": 517.68
        },
        {
            "text": "is right.\" So you you take the reigns. Explain to me how what's happening, where this is happening, which is the biggest, where what's the hottest? Does anyone care about Diablo anymore? I got a million questions, but I want you to have you're hosting now. Oh crap. I get to host. Uh, let's Zanth host. Um, but not these nuts. So, uh, in starting for this, Oh, am I getting moved over? Wow. Um, yeah, but I think Did I say that live yet? Oh, you're doing the thing. So, Oh, you put him in the host chair. Barrett's so fun. I love Barrett. that this is this is quality. I I've been upgraded to to host. So, ARPG April, right? Uh it is massive. I'm going to pull up what I wrote here because I did spend a lot of time on this breakdown. April 2025 is the first time that the big three and ARPGs have released major content updates in the same month. There's a lot of cross-pollination, but a lot of loyalty to each respective franchise. No matter where your allegiances lie, April is a great month for",
            "start": 563.52
        },
        {
            "text": "major content updates in the same month. There's a lot of cross-pollination, but a lot of loyalty to each respective franchise. No matter where your allegiances lie, April is a great month for an ARPG fan. Um, it's been hard. I think I the I titled this how like now it's now we get into it's been hard. Yeah, I I titled this how to whole ass three ARPGs. Uh, you know, referencing the great Ron Swanson with uh don't don't halfass something, whole ass it. Um, it's hard. It's impossible. It's got to be I mean again this is your preferred genre. You play these games on the treadmill for hours a day every day. You also have a family and you also have a job and you have all the but you are whole assing RP ARPGs all the time, let alone to have three major updates. I'm fascinated to see how you've been juggling it. Uh it got a lot harder last night. Uh I can say that. So uh let's start at the front end. Uh at the beginning of the month, uh Path of Exile uh released or Path of Exile 2 rather",
            "start": 614.08
        },
        {
            "text": "been juggling it. Uh it got a lot harder last night. Uh I can say that. So uh let's start at the front end. Uh at the beginning of the month, uh Path of Exile uh released or Path of Exile 2 rather released its first major update introducing a new class, new systems, uh new items, new skills, uh with uh Path of Exile 2: Dawn of the Hunts. Uh Barrett, do you want to pull up the the little trailer there and I'll just kind of chat for you audio listeners, which is me, and I appreciate you. I am an 100% an audio listener. I mean, for the record, so am I. I listen on Spotify. That's where I'm at. Right. Uh for your audio listeners, we're we're just going to delve a little what is Path of Exile 2's first uh trailer for their new release. We're seeing an Amazon start to scour the forest and follow a wisp. Uh and this is really the introduction to the new class uh that was introduced to the base uh six that we started with. Now moving on into a spear wielding, shield carrying Amazon. um or",
            "start": 665.6
        },
        {
            "text": "a wisp. Uh and this is really the introduction to the new class uh that was introduced to the base uh six that we started with. Now moving on into a spear wielding, shield carrying Amazon. um or technically Huntress, but it's hard not to not default to just calling it the island of Femiscara. All right, everybody, don't forget uh yeah, you can live out your Wonder Woman fantasies uh here. I won't be doing a monolith game. No, you won't. Uh so you'll have to get that uh somewhere else and maybe Path of Exile will be for you. Um, so this releases April 4th and GGG, uh, Grinding Gear Games is a smaller development company, you know, out of New Zealand. Um, that's first major release was Path of Exile 1 and then this was the the major step up uh, in back in December, you know, it finally coming to life and and getting a lot of good traction and turned so many heads, right? was one that you texted me. You're like, \"I know your Diablo burned out, but this is different. You need to play",
            "start": 719.52
        },
        {
            "text": "coming to life and and getting a lot of good traction and turned so many heads, right? was one that you texted me. You're like, \"I know your Diablo burned out, but this is different. You need to play this.\" And I didn't believe you. And I played it and I was like, \"Oh my god, this is so much different that I'm not having having the same issues I was having with Diablo.\" Yeah, it it what you know I think we'll talk about today is that each one of these games kind of offers something a little different. Um, you know, what's comical is, as you will see during all the trailers, an isometric ARPG is an isometric ARPG, right? They all have a very similar look. Like you're you're pushing that character forward with a mouse or a controller. You're, you know, casting a spell, you're swinging a sword. That's always kind of the same. However, each of these games has a very different approach to what happens after that. Path of Exile is what I would consider to be like more of the the difficult",
            "start": 780.24
        },
        {
            "text": "That's always kind of the same. However, each of these games has a very different approach to what happens after that. Path of Exile is what I would consider to be like more of the the difficult game, right? Uh, the boss fights can be a little bit more difficult, the skill system, the the mapping at the end game could be a little bit more difficult and a little bit more challenging, but you're rewarded. Sure. That was what drew me in, right? When you when you called me in for December to play it, when I got in there immediately, what I kept saying, right, was the weight. This felt weightier. It felt like, okay, cool. I'm not moving as quickly. Two enemies are a threat versus, you know, being surrounded by a mob in Diablo and not caring about it. And then yeah, getting to these battles that I kept describing for lack of uh uh being a smarter man to the audience as I think it's what Andy and the crew love about Souls likes where it's I come in and I got to learn this boss's pattern",
            "start": 823.84
        },
        {
            "text": "that I kept describing for lack of uh uh being a smarter man to the audience as I think it's what Andy and the crew love about Souls likes where it's I come in and I got to learn this boss's pattern because if not I'm going to die and then I'm going to have to restart and not lose everything. But I would prefer to get in there and actually feel like I'm learning on that one. Yeah. And you're you're rewarded for that knowledge. Like you've learned those bosses and then the next time through, which I know you hate. you're not a big fan of having to replay the campaign, but every time you come back to it, it it's a little bit easier because you you know what that boss is going to throw at you. You get a little bit better with those skills. Uh so this releases April 4th and as you you know kind of alluded, I've spent a lot of time there. Um because it it was a very it's been a quality update and I'm I'm not quite done with it yet. Uh the the nicity of ARPGs is you have that ability to",
            "start": 865.84
        },
        {
            "text": "kind of alluded, I've spent a lot of time there. Um because it it was a very it's been a quality update and I'm I'm not quite done with it yet. Uh the the nicity of ARPGs is you have that ability to kind of bounce off them after a couple weeks. You can feel like you've got everything done. I am nowhere near that yet with Path of Exile 2. Uh this this update definitely has hooked me being able to kind of go in and play around with a power fantasy that I've always enjoyed. Being able to throw lightning spears around uh done, that's that's all I'm going to do for a very long time. Um, it's not to say there haven't been challenges. Like that's part of the cycle of ARPGs, right? You push out a major update and then you react. You see the community like, oh, we we have to scale back. Uh, what's been impressive is the speed at which Grinding Gear Games has reacted to it. When it launched on the first day, everything was significantly more difficult. Monster health and speed was too high. And",
            "start": 904.16
        },
        {
            "text": "been impressive is the speed at which Grinding Gear Games has reacted to it. When it launched on the first day, everything was significantly more difficult. Monster health and speed was too high. And they were able to kind of gauge those reactions and start patching accordingly. And they're still reacting. This is an early access game, right? Uh yeah, of course, it has that weird challenge of like it's in early access, but they also are kind of treating it as if it's a live game where here's a major patch and we've been holding off on doing quick reactions. Whereas, I think they're starting to adjust to what early access should be for this game of, okay, we're getting a lot of feedback. Let's start fixing that before we go on like a a two or three month hiatus before the next big thing like we would in a traditional ARPG space. Um, so it it's talk to me a bit about that reaction. I want I want to know what you're getting because in the chat over here, we had two chats come through",
            "start": 952.08
        },
        {
            "text": "like we would in a traditional ARPG space. Um, so it it's talk to me a bit about that reaction. I want I want to know what you're getting because in the chat over here, we had two chats come through about Path of Exile 2 and this update. Uh, Herby Aeros says, \"The new class is awesome, but the changes to the world in PoE2 are god awful.\" And then uh Tin and for 54 says, \"Love the launch, but it seems like GGG lost the thread on what people want PO Path of Exile 2 to be.\" I think uh they have like this weird balance to strike. Uh it's much like the jump from Diablo uh 2 to three or from Diablo 1 to Diablo II where you have a a a departure from what the game used to be. you know, it is its own thing. And how do you keep both sets of players happy? You know, the of course this has been the big struggle with Diablo I, right? As a noob and somebody who just wants to never come back and then people like you want to play it non-stop, right? There's there's always going to be this struggle",
            "start": 996.56
        },
        {
            "text": "big struggle with Diablo I, right? As a noob and somebody who just wants to never come back and then people like you want to play it non-stop, right? There's there's always going to be this struggle for the people who can play uh you know, like as you were saying before, I I do play a lot, but I'm not a streamer. I don't play for eight to 10 hours a day. And how do you balance for that? How do you balance for the people who are going to put in over the course of a week what your traditional player might be able to get through over the course of three months? And that always leads to burnout. I think that's the other part of the ARPG problem is there there's a lot of burnout with any game that you play for that amount of time. Um, I'm always kind of relatively balanced with it where I don't feel like I burn out that quickly, but there are times when things just don't hit. And for a lot of people with this most recent release with Path of Exile 2, it just didn't hit. Um, you know, you",
            "start": 1050.8
        },
        {
            "text": "feel like I burn out that quickly, but there are times when things just don't hit. And for a lot of people with this most recent release with Path of Exile 2, it just didn't hit. Um, you know, you you probably played a lot in the the first launch for early access. Sure, you're coming back and things are still a little bit slower. You've got a new class, you got new things to play with, but it hasn't changed dramatically uh that you you want to hang out there for too long. the seasonal mechanic is a little lackluster. Um, it could be faster, it could be more engaging, and then loot could be dialed up just a little bit more as well. But even with all that, I'm still having a shitload of fun. Like I'm just like I've I've been torn to like going back and I was playing Last Epoch last night, but in the back of my head I was like, \"Oh, I could be I could dip back in and play a little bit more.\" you you can't I get 30 minutes in before I go to bed, right? I could I could balance this. Uh so",
            "start": 1098.0
        },
        {
            "text": "in the back of my head I was like, \"Oh, I could be I could dip back in and play a little bit more.\" you you can't I get 30 minutes in before I go to bed, right? I could I could balance this. Uh so yeah, there has been a lot of uh that kind of sentiment within the Path of Exile 2 community of just wanting something a little bit different and I think it still is early access. They they've adapted a lot from what they've been able to see. It'll be curious to see what happens in the next couple weeks. Um you know, are they going to keep moving the levers? So, they are they going to keep balancing it out or are they going to kind of, you know, make a few more changes and then start pushing towards what will be the next major update? There there's still uh what five more classes that need to to show up, a bunch of new ascendancies. There are three full acts that aren't present. So, there's a lot of things that are still missing. And I I think sometimes it's like how do we view early access?",
            "start": 1144.88
        },
        {
            "text": "show up, a bunch of new ascendancies. There are three full acts that aren't present. So, there's a lot of things that are still missing. And I I think sometimes it's like how do we view early access? Do we do we treat it as the the the total game and judge it accordingly or do we wait until we have all of the evidence before us before we can come to those conclusions? And I don't know. I I I don't think there's a right way. I think all feedback is is good as long as you can back it up. The the other danger with these games, too, is like a meta. uh somebody out there way smarter than me figures out the best way to build a character or the best possible skill and then everybody kind of plays that and then what are you missing? You're missing like half of your player base trying and and messing up things to to give you good feedback. Like you can give feedback about the most powerful skill and like oh that's overtuned, but are you messing with all the other ones that you you blew past?",
            "start": 1190.88
        },
        {
            "text": "up things to to give you good feedback. Like you can give feedback about the most powerful skill and like oh that's overtuned, but are you messing with all the other ones that you you blew past? Um you're not. So like that that also kind of affects that cycle in terms of how the the game will then be iterated on. Have they given any road map for Path of Exile of where they think they are with eventually getting to a full release or leaving early access or are we just going to be in early access for a long long long time? I as far as I know I think they're under the impression that they can get it out uh before so the the goal was a year. It launches in December of 2024, but it's April. That's eight months from now to still introduce three new acts and five new classes. I I don't see it. And honestly, I'd rather let them cook. You know, take a little bit more time. I'm happy with what I have. I'm going to keep coming back uh again and again, but I I really do not see this uh launching",
            "start": 1238.88
        },
        {
            "text": "honestly, I'd rather let them cook. You know, take a little bit more time. I'm happy with what I have. I'm going to keep coming back uh again and again, but I I really do not see this uh launching legitimately in December. Okay. Okay. But overall from you, thumbs up on this update. Oh, 100%. And I would recommend it to everybody to at least get in and play. I mean, one, it's always nice to play with a new class. Uh there's a whole bunch of new support gems. Uh I have found that if you played on day one, the the leveling of a character was far more brutal. It was harder. It felt a little bit more of a slog. uh the changes that have happened in just like the the two weeks time have been significantly better where I play only hardcore so I do die uh and then I have to go back and redo it all over again. Uh so with each character it's actually gotten easier. It it does feel easier. It does feel better. So I I would say it's worth it if you maybe kind of bounced off of it and then",
            "start": 1293.28
        },
        {
            "text": "it all over again. Uh so with each character it's actually gotten easier. It it does feel easier. It does feel better. So I I would say it's worth it if you maybe kind of bounced off of it and then challenge yourself. Maybe we all know lightning spear is one of the best skills. Try something different. try something different and see how that's that's playing for you because there are a bunch of other good builds out there. You just got to stray away from the meta a little. Okay, get in there, Greg. Toss some spears around. It's awesome. I'm sure it is. It's just the thing that for Path of Exile 2, which I loved back in December, I enjoyed. And I'm just not the early access guy. I would rather they be like, \"Here it is. Boom. the game is complete to what it's the same thing with Hades, too. Loved Hades. I you know what I mean? Like I'm ready to play, but I want it to be final and done and this is their the final. I know everything will be updated forever and ever and ever, but like",
            "start": 1343.6
        },
        {
            "text": "too. Loved Hades. I you know what I mean? Like I'm ready to play, but I want it to be final and done and this is their the final. I know everything will be updated forever and ever and ever, but like here's the vision of what it is and where we want and all the balances and this is that like I'm not you know how it's so rare uh sadly to some degree, but so rare that even an ongoing game that's always evolving, changing can keep me around for a long time. So rather than come in and have it be I played 20 hours of Path Exile 2 at early access launch when X Y and Z wasn't working right but I did it anyway. I don't want that to be the experience. So I'd rather hang on. But this is enticing but then of course I'm hunting. I'm monster hunting out there. All right. Give me get your son's got to get on my friends my friends list. If you're not going to play I'll be over there playing with him because we got to get out there. We got too many monsters over there thinking that they're the top of",
            "start": 1391.12
        },
        {
            "text": "on my friends my friends list. If you're not going to play I'll be over there playing with him because we got to get out there. We got too many monsters over there thinking that they're the top of the food chain. Barrett. All right. They're just trying to live their life but not in my world. I'm going to skin them and wear them. That's what I'm doing. Jesus. I mean, I will get there eventually. It's See, that's how I feel about Path of Exile, right? It's just so hard. I've got I got so many things going on. I got to level so many characters. There's too many games now. It's a tough, like I said, it's a tough month. Uh where, you know, here it is. Ap uh Path of Exile 2 goes April 4th. It is the 18th and I am still like deep in on that. And then I got to pause and and jump into to Last Epoch because that is that is new, that is fresh, that is exciting. What I need from you in reality here is a refresher on what Last Epoch is. When Last Epoch originally launched, you weren't part of our",
            "start": 1432.56
        },
        {
            "text": "because that is that is new, that is fresh, that is exciting. What I need from you in reality here is a refresher on what Last Epoch is. When Last Epoch originally launched, you weren't part of our community yet. All right. I did I wasn't I Diablo podcast. Maybe I was listening. Maybe I wasn't. I don't know. But you weren't like on a firstname basis texting me what I need to be playing. And so this is one that the chat in the audience had been like, \"Oh, Greg, you'd probably love Last Epoch. You should play Last Epoch.\" I was like, \"He's on a console.\" They're like, \"No.\" I'm like, \"Well, no chance.\" You know what I mean? Is it Steam Deck compatible? I don't even know. I can't remember. This is so long ago. It is. I don't know. I asked for a code yesterday. I got my email about the update. I asked for a code. So, I'm Because I know you swear by what it's already done, let alone what this new update is, yada yada. But what is Last Epoch? In this pantheon now of Path of Exile 2 being",
            "start": 1476.16
        },
        {
            "text": "I asked for a code. So, I'm Because I know you swear by what it's already done, let alone what this new update is, yada yada. But what is Last Epoch? In this pantheon now of Path of Exile 2 being the harder version and slower version of Diablo 4, which I know so well and I feel like so many people know so well. Where does Last Epoch fit in? I think it is the, you know, as we're going through this conversation, it's the perfect middle ground. It is not as rigorous perhaps as Path of Exile, and it's not as streamlined as Diablo I. It's it's really right in the middle and I think honestly it's probably the perfect introductory ARPG where you can then kind of figure out which which direction you would want to go in. Um you know as we're seeing here we have the the newest trailer for Tombs of the Erased their next big update you know their seasons uh that they have. This is the one that just came out. Yep. Uh just launched yesterday. Um, now with Last Epoch, it it's so much more friendly",
            "start": 1515.36
        },
        {
            "text": "the Erased their next big update you know their seasons uh that they have. This is the one that just came out. Yep. Uh just launched yesterday. Um, now with Last Epoch, it it's so much more friendly to the individual player. Um, you have your different classes like in any ARPG, but you also have what I think is is really fundamentally uh something that's gone missing from the ARPG genre. You have an offline mode. Uh, online is built into so many ARPGs. This is one that has offline compatibility. And you were talking about like uh wanting uh possibly for Steam Deck. This to me strikes me as one of those perfect Steam Deck games. Uh I don't have a Steam Deck. Uh but if I did, I'd be playing it like non-stop, especially with that offline functionality, right? Yeah, that's huge. As somebody who's on the plane all the time, that that that's always a bummer for me when I'm super into Diablo or even thinking of Path of even, you know, Monster Hunter, which is a different conversation because",
            "start": 1564.4
        },
        {
            "text": "on the plane all the time, that that that's always a bummer for me when I'm super into Diablo or even thinking of Path of even, you know, Monster Hunter, which is a different conversation because it does, but I don't have it on, you know, blah blah. Right. Right. Yeah. It uh it has that that functionality which also then makes it just a little bit easier to kind of pick up because you don't have to be online. You don't have to worry about playing with other people. Um in tandem with that, it does have uh just a great way to distribute loot. Like you are you have a lot more in-depth crafting that you know if there are things that you want for your character, if you want your character to be stronger, you have a lot more control of that. It's less reliant on, you know, sometimes the hard part of a ARPG is just the the randomness of it, right? I'm trying to find this particular item to to be stronger. I want a better sword, whatever. And uh the crafting tools within Last Epoch make that",
            "start": 1621.36
        },
        {
            "text": "of a ARPG is just the the randomness of it, right? I'm trying to find this particular item to to be stronger. I want a better sword, whatever. And uh the crafting tools within Last Epoch make that significantly easier to kind of happen. So, it a lot of tools for a new player to just go and have fun. Uh the difficulty as well is not it's not super rigorous. you're not like the boss fights are not at the level of Path of Exile. You can kind of jump in and no matter what choice you make along the way, you're going to be successful. Like I don't think there's a bad way like the I don't think you can choose a skill and items throughout this game that will not get you to the endgame of it. Uh it's it's pretty well built in that regard. And we should point out that u you know this is 11th hour games. It's an all remote independent studio that is putting this together. So, no central hub, you know, just everybody kind of on their own remotely and independently making a great game. And I think",
            "start": 1660.4
        },
        {
            "text": "It's an all remote independent studio that is putting this together. So, no central hub, you know, just everybody kind of on their own remotely and independently making a great game. And I think that's also kind of worthy of being celebrated as more people are kind of being forced back in. We've seen a lot of studios force their their people back in and to have them all remotely um come together and be successful is is pretty awesome. So, tell me about the update. Uh, well, I'm only just a little bit in. Uh, you know, as I said, I'm It's hard to get uh three ARPGs all in in one go. Uh, I think I ended last night at like level 25, I want to say. Um, but I will point out I was getting notifications the entire time. Um, it launched yesterday around I think one o'clock my time and by the time I was still like closing up playing people were already level 90. Um, got it. So, it's not also impossible to get to the very end. Obviously, those are top end players that are pushing unknown",
            "start": 1709.28
        },
        {
            "text": "time I was still like closing up playing people were already level 90. Um, got it. So, it's not also impossible to get to the very end. Obviously, those are top end players that are pushing unknown strategies to to be successful. But for the average person, you could get in there and you could find yourself at the the end game uh relatively quickly. I mean, we're talking like 5 10 hours depending on um what you happen to be doing and how you're building what what have you. Um the combat itself is pretty fluid as you can kind of see here. We're watching through some It looks awesome. I Yeah, I haven't seen much of it and I know we said at the top as a joke in isometric ARPG looks like an isometric, but like the colors and visuals they're using here are pretty impressive. Yeah, it it it's uh a little it retains a little bit more of that uh kind of wowy kind of gothic, you know, where it's not okay, it's not uh as dark gothic as Path of Exile, um or as what Diablo I was was aiming for at",
            "start": 1768.48
        },
        {
            "text": "a little it retains a little bit more of that uh kind of wowy kind of gothic, you know, where it's not okay, it's not uh as dark gothic as Path of Exile, um or as what Diablo I was was aiming for at the start. It's got like a little bit more flash, a little bit more pop, a lot more purple, right? A little bit more green here. uh kind of sets it apart uh by comparison to its peers, but it uh it plays really smoothly. I was playing a lot on uh controller uh controller sport was kind of uh significantly better than when I had played it initially. They just introduced uh wasi as well if you want to go if you're an absolute animal and want to use wasi. Uh it's just I' I'm just it's not intuitive for me. Uh but controller it isn't for anybody. A lot of people have trained themselves to say that it is it isn't. I just don't know how you could. Uh but controller support was really great last night. And um I had the I think one of my favorite feelings in any ARPG is like you start out with a",
            "start": 1815.04
        },
        {
            "text": "it is it isn't. I just don't know how you could. Uh but controller support was really great last night. And um I had the I think one of my favorite feelings in any ARPG is like you start out with a character and then like you see somebody else in town or whatever you're like, \"Oh, that looks kind of cool. I would like to I want to do that.\" There's a lot of that capability here in Last Epoch. Um Barrett, do you want to pull up the skill tree asset? Uh, so the the last epoch has a really cool skill system. Essentially, you can choose any skill that your character would would earn and you get a tree for each skill. So, as you're leveling, you're you're getting points along the way and and you get to branch it out and affect how the skill actually works. So, we see here the the little introduction. kind of cut this video last night on my um little necromancer that was starting out. Um so as you level, you're getting access to new skills and then you can go in and specialize in those. So",
            "start": 1866.96
        },
        {
            "text": "kind of cut this video last night on my um little necromancer that was starting out. Um so as you level, you're getting access to new skills and then you can go in and specialize in those. So up at the top there, you see level 4, 8, 20, uh 35, and 50. I can grab one of those skills from there, assign it, and then it starts earning points. Uh it's all really intuitive once you kind of get going. Eventually, I will click on something. Oh, there we go. So, now you're just shopping now, right? So, there is the skill tree. And as you're kind of branching out, each one of those little nodes will change the skill itself to do something. Now, you're never going to get enough points to do all of them, and some of them will run counter to what you might do on one end, but it's just that little bit of control. It's that little bit of uh being able to make and shape the character that that you actually want. Um, so I could have different types of minions. I could have u my rip blood, you know,",
            "start": 1920.16
        },
        {
            "text": "of control. It's that little bit of uh being able to make and shape the character that that you actually want. Um, so I could have different types of minions. I could have u my rip blood, you know, branch out or heal me or whatever else I might need. But you get a lot of that kind of control and then you can couple it up with, you know, there are different items that will go and change the skills as well. But it's just it's a fun skill system uh where I'm not hunting for an upgrade for the skill. I'm choosing how it's going to work. Gotcha. That's cool. Over here, I in the chat, you got a tin and 54 or Yeah, 54. Uh, love the skill system. Yeah, this is I'm wrapping my head around it as I see your B-roll run. It seems way more complicated than what it actually is. Like, at the end of the day, it's like, hey, what are these skills that I actually really enjoy? Okay, I'm like, Rip Blood isn't my favorite, so why would I want to specialize in it? Maybe I really want to specialize in",
            "start": 1967.72
        },
        {
            "text": "the day, it's like, hey, what are these skills that I actually really enjoy? Okay, I'm like, Rip Blood isn't my favorite, so why would I want to specialize in it? Maybe I really want to specialize in minions. Okay, what can I do with those and how can I make them better? Uh, after this I end up making um a sentinel uh with uh the goal of becoming probably a paladin. Um, and one of his skills was throw hammer, right? You throw a hammer, it returns to you. A classic kind of Diablo paladin. Uh, but you spec into one point and suddenly those hammers now rotate around you instead of so instead of a straight line, they're going to rotate. um and spin around and then you could change that. Maybe it's multiple hammers, maybe it does more damage. Um and just that level of control is just so fun. And then the the Sentinel next to me might not care about hammers. They might want to go into a javelin. Who couldn't care about a hammer, Zan? They got to care about the hammers. You you have to it it",
            "start": 2020.88
        },
        {
            "text": "then the the Sentinel next to me might not care about hammers. They might want to go into a javelin. Who couldn't care about a hammer, Zan? They got to care about the hammers. You you have to it it does have this this really really cool function to it. Um, I I think it's one of the the shining stars of this game is just like how fun that is. Like, oh man, that that school's that skill is really cool. I want to mess around with it. I want to do something different. And there's so many different options to make that happen that it none of them really feel bad, but you're also excited to try something new and like, you know, you kind of can be rewarded for that. And then there's more skills to to mess with along the way. It's it's very fun. I I if you if you're intimidated, I don't think you need to be because like I said, I don't there's no real wrong choice. You can get through all the content making bad decisions um and be totally fine. Nitrogen Mustard in the live chat goes, \"God, I",
            "start": 2073.84
        },
        {
            "text": "need to be because like I said, I don't there's no real wrong choice. You can get through all the content making bad decisions um and be totally fine. Nitrogen Mustard in the live chat goes, \"God, I love ARPG so much that I haha, I can't wait to get home and play this tonight.\" Greg, you would love this if it came to console without a doubt. Again, I'm I'm gonna, you know, we're going to go to ads here and I'll open up my email and poke the person I asked about the code because I'm getting a code for this. I'll put it on the rag ally X out there Barrett especially if the controller you said controller support's better now right Zan yeah significantly better okay okay let me let me draft an email here everyone and we'll come back and talk more about ARPG April right after of course we remind you that this is the kind of funny games cast uh if you love what we do please pick up a kind of funny membership either on patreon.comindafoney youtube.com/kindfunny games apple or Spotify $10",
            "start": 2120.32
        },
        {
            "text": "you that this is the kind of funny games cast uh if you love what we do please pick up a kind of funny membership either on patreon.comindafoney youtube.com/kindfunny games apple or Spotify $10 gets you all of our shows that's more than 80 a month ad free and it gets you your daily dose of me Greg Miller and a 15 to 20 minute podcast I call Gregway. I'm off on Monday so it'll be a Rajay and you'll find out what Roger's been up to. I digress. Right now you're not using your membership benefits. So here's a word from our sponsors. This episode's brought to you by Imperial. We've told you all how important it is to developers to wishlist games you're interested in on Steam. So if this game sounds cool to you, make sure that you wishlist it. In Imperial, you play as a mercenary sent to a distant planet to discover the mysteries of an ancient civilization. Powers unknown lie within the monolith, but those are no mere ruins as an expedition has already ventured inside with only a few",
            "start": 2159.68
        },
        {
            "text": "a distant planet to discover the mysteries of an ancient civilization. Powers unknown lie within the monolith, but those are no mere ruins as an expedition has already ventured inside with only a few survivors. Why was it built? What powers reside within? Who is at the center of the monolith? All these secrets and more will be uncovered if you are brave enough to take on Imperial. Imperial features a unique blend of RPG systems and skill-based combat across three weapon archetypes. the acrobatic glaive, the defensive but devastating mace and shield and the powerfully ranged cannon. With a deep ability system, and extensive customization, every battle is an opportunity to refine and optimize your combat style. Form relationships with each of the few surviving expedition members who all have their own personal quest lines. Whether you choose to help or not can have drastic consequences for them. The monolith is guarded by powerful automatons, each with distinct attack patterns and",
            "start": 2199.92
        },
        {
            "text": "have their own personal quest lines. Whether you choose to help or not can have drastic consequences for them. The monolith is guarded by powerful automatons, each with distinct attack patterns and weaknesses that demand precise execution and strategy to be victorious. Create your mercenary, enter the monolith, learn powerful abilities, defeat the automatons, and uncover the secrets that lie within Imperial. Imperial is available May 8th on PC, Xbox SNX, and PS5, but you can wishlist now. Do it. Wishlist Imperial. This episode is brought to you by Factor. Make this your best season yet with nutritious 2-minute meals from Factor. Eating well has never been this easy. Just heat up and enjoy, giving you more time to do what you want. Greg Miller has been loving how simple it is to enjoy his Factor meals as he's rushing between shows each day. I just saw Blessie eating some, too. Factor arrives fresh and fully prepared. Perfect for any active, busy lifestyle. Factor powers your day with",
            "start": 2248.64
        },
        {
            "text": "Factor meals as he's rushing between shows each day. I just saw Blessie eating some, too. Factor arrives fresh and fully prepared. Perfect for any active, busy lifestyle. Factor powers your day with satisfying breakfasts, on-the-go lunches, premium dinners, and guilt-free snacks and desserts. Spectactor can help you feel your best all day long with wholesome smoothies, breakfast, grab-and-go snacks, and more add-ons. Multiple people here at Kind of funny have been loving their experience with Factor. And guess what? You can, too. Get started at factormeals.com/kindfunny50 off and use code kind of funny 50 off to get 50% off plus free shipping on your first box. That's code kind offunny5050 off at factormeals.com/kindafoney5050 off for 50% off plus free shipping. This episode's brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized shades that won't break the bank. Shady Rays is",
            "start": 2297.36
        },
        {
            "text": "you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized shades that won't break the bank. Shady Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people. They have hundreds of options to choose from, so you're bound to find the perfect pair to match your style. If you don't love your shades, exchange them for a new pair or simply return worry-free within 30 days. There's no risk when you shop. Their team are always there to have your back with personal and fast support. Y'all know I've been outside a lot playing Pokémon Go, and it's such a great experience wearing Shady Rays when I'm out and about looking dope. Exclusively for you, Shady is giving out their best deal. Head to shadyrays.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. Again, go to shadyrays.com,",
            "start": 2344.24
        },
        {
            "text": "giving out their best deal. Head to shadyrays.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. Again, go to shadyrays.com, use code funny to get 35% off polarized sunglasses. And we're back. I'm fighting a sneeze, but it's not going to win. I'll tell you that right now. Allergies. I think it's going to win eventually. Yeah. You know, it's like it's like, you know, it follows. It'll eventually it'll eventually catch you. Uh Zanth, again, we've been jumping around a bit and I know it cut you off in the middle of everything going on there. Uh for Last Epoch, I know you just jumped in, but what are like the big things they've been promoting with this patch? Like if people had played it and had weren't weren't, you know, ready, didn't know about this or weren't coming back, like what what did they add to this one? Is it just a class? Uh no. So, and not really a new class. They kind of reworked the Sentinel class,",
            "start": 2388.96
        },
        {
            "text": "ready, didn't know about this or weren't coming back, like what what did they add to this one? Is it just a class? Uh no. So, and not really a new class. They kind of reworked the Sentinel class, which is what I was talking about before with coming in and uh tossing hammers around. Uh really it was more focused on the end game. Uh which is, you know, okay, the it's the the crux of every ARPG like all of them. We we'll get them through the story, but then how do we keep them? How do we keep them to keep playing over and over again? um so we don't lose them to another ARPG or whatever it it might be or the other myriad of games that that are out there. So this is more of a rework around that introducing a new faction. Um and really just it really what it boils down to is more stuff to do at the end, right? More stuff to play with. Uh and I like I said, I got to like level 20 25 last night. didn't get a chance to play with all the new fancy stuff, but here's to hoping in the days to come",
            "start": 2437.84
        },
        {
            "text": "the end, right? More stuff to play with. Uh and I like I said, I got to like level 20 25 last night. didn't get a chance to play with all the new fancy stuff, but here's to hoping in the days to come that I will be able to pull myself from all the other ARPGs and get into it. Um, but overall sentiment seems to be pretty high around uh how it has been going. So, I think that's a big test for all of these updates. Now that you have actual competition with new content, what like tonight when you get the chance today when you slip away to your treadmill to play games like a psychopath, where will you go? Like what is speaking to you? Like I have to get back and do X, Y, and Z. Uh well, unfortunately, uh because Last Epoch does not have console support, the only way I can run on that treadmill has got to be on console. Um, so I will be uh at least running playing uh Path of Exile 2. Um, I think for me that becomes easier because like I'm going to I've got a longer run tomorrow. I'll I'll",
            "start": 2489.76
        },
        {
            "text": "has got to be on console. Um, so I will be uh at least running playing uh Path of Exile 2. Um, I think for me that becomes easier because like I'm going to I've got a longer run tomorrow. I'll I'll be on Path of Exile 2 in the morning. Um, which means How long is your run tomorrow? Uh, 22 miles. You're psycho. He's psycho Baron. It's awesome. Yeah, I mean crazy behavior. You know what I mean? I'm I'm I'm aware it's it's an odd thing. Uh, but I do about I'll do about half of that on the treadmill and I'll do the other half outside. And that treadmill half will be uh Path of Exile 2 because it's on console. If Last Epoch was on console though, yeah, I would probably want to stay with what is new and current and kind of hang out and and make the the the push with those characters. Uh, so the really the only thing Last Debuck doesn't have going for it right now is that lack of a a console support. If I had that, I'd be all over it right now. Uh, but it does also mean since I know I'm",
            "start": 2544.0
        },
        {
            "text": "the really the only thing Last Debuck doesn't have going for it right now is that lack of a a console support. If I had that, I'd be all over it right now. Uh, but it does also mean since I know I'm going to get some Path of Exile time in the morning, I can spend some time in Last Epoch tonight and like there's that. Got it. Got it. You're gonna balance it out. You'll make it up, right? It'll it'll be totally fine. Uh, and I am very much enjoying my time uh playing Last Epoch right now. Uh, it was a game that uh, you know, it came out in what, February of uh, it's on the sheet. I'd have to pull it up um pull up the date, but it was surely February 24th, 2024, right? So, lots of things happening at that time, lots of different seasons. Uh it went into early access before. I remember playing it before Diablo I launched when it was in its, you know, beta stage. Uh so, I just had not kind of gone back to it and so much has changed. Uh the story itself has changed several times over. Uh,",
            "start": 2594.8
        },
        {
            "text": "it before Diablo I launched when it was in its, you know, beta stage. Uh so, I just had not kind of gone back to it and so much has changed. Uh the story itself has changed several times over. Uh, those of you guys looking for an interesting ARPG story, it reminds me a lot of Chrono Trigger where you are bouncing around from different time periods to like try and prevent calamity. Um, oh, that sounds cool, right? So, you like you get to choose these different time periods and different things are happening. Chrono Trigger's name. I've got enough games to play. Could we convince you to play an ARPG? Are you against the genre or is it what's what doesn't work for you with it? Um, time. Yeah. Yeah. Yeah. And it's uh it's one of those like uh I I know there's like big world and stories and stuff, but if a game is, you know, where there's a lot of grinding and stuff, I want to feel like I'm building to something that's like going to have like an emotional payoff for me or something like",
            "start": 2642.32
        },
        {
            "text": "stuff, but if a game is, you know, where there's a lot of grinding and stuff, I want to feel like I'm building to something that's like going to have like an emotional payoff for me or something like that. And it's usually just like the worlds I'm less into, not so much the game. I'm just not like a high fantasy guy. So that's just And a lot of these like ARPGs are a bit more like totally fantasy like adjacent. So yeah. Fair enough. Thank you. I'll shut it up. No, no. I think that's Barrett, I think you bring up like an interesting point of like a contrast between a JRPG and an ARPG is where the grinding is located, right? Uh for a JRPG, you do a lot of your grinding to get to that penultimate uh or ultimate battle. And then with an ARPG, a lot of the grinding is more at the end. Like you cruise through the story, that's the real game. Yeah. Right. And now your grinding is for more gear and different upgrades. not to not to beat a particular boss for a satisfying conclusion. Um, and I",
            "start": 2692.16
        },
        {
            "text": "cruise through the story, that's the real game. Yeah. Right. And now your grinding is for more gear and different upgrades. not to not to beat a particular boss for a satisfying conclusion. Um, and I guess it's just what what will drive you, but I I would say like as a Chrono Trigger fan, jump into Last Epoch, play a little bit. You might you might have Crab Daddy in the chat says, \"It's cool because you get to explore the same map, but like in five different time periods.\" Yeah, that sounds [ __ ] rad. I'm on the I'm on the page now because now I'm not even going to wait for the code. I'm probably just going to buy it. Uncover the past. Reforge the future. Ascend into one of 15 mastery classes and explore dangerous dungeons. Hunt epic loot. Craft legendary weapons and wield the power of over a 100 transformative skill trees. Last Epoch is being developed by a team of passionate action RPG enthusiasts. [ __ ] this sounds great, right? And I mean, uh, you know, if they don't get you",
            "start": 2737.36
        },
        {
            "text": "over a 100 transformative skill trees. Last Epoch is being developed by a team of passionate action RPG enthusiasts. [ __ ] this sounds great, right? And I mean, uh, you know, if they don't get you back with a code, it is $35. That's not bad. Yeah. Yeah. It's not uh it's not a Now that I'm not spending $550 on a Nintendo Switch 2, like I was preparing mentally, I'm I'm This is gamer math. This is free. Yeah, you've you've actually saved so much money already today. I know, right? I'd be stupid not to buy it, right? Uh definitely would recommend. So, $35 and then all these updates uh from there on out uh are free, right? This most recent update is free. The Last Debac is kind of following much like what Diablo has done, what Path of Exile has done, the paid cosmetics route. Um, you know, there are different paid cosmetics. Uh, they also have uh skill cosmetics, which are the the things that will get me every single time. I care less about the armor that my character wears, but if I can",
            "start": 2779.92
        },
        {
            "text": "are different paid cosmetics. Uh, they also have uh skill cosmetics, which are the the things that will get me every single time. I care less about the armor that my character wears, but if I can have a fancier fireball, I can have a fancier pet, uh, yeah, I'm gonna buy that. that that's that's right up my alley. But, uh, that's where a lot of their monetization is kind of coming from. Uh, so, you know, that initial $35 years ago, you keep getting those updates, but then maybe you get tempted. You get tempted to purchase something. They've earned it at that point. You feel like I assume there's a rogue class in here for me. Yes. Yes, there is. Uh so if we're looking at the classes and you're trying to figure out like what do you want? You've got a mage, you've got a rogue, a primalist, an acolyte, and a sentinel. Uh the mage uh will bounce from mage to sorcerer, spellblade, or rune master. Rogue would be blade dancer, marksman, and falconer, which I did play a while ago. That one that",
            "start": 2838.16
        },
        {
            "text": "acolyte, and a sentinel. Uh the mage uh will bounce from mage to sorcerer, spellblade, or rune master. Rogue would be blade dancer, marksman, and falconer, which I did play a while ago. That one that one's actually kind of fun. You get a falcon, it can drop knives on things. Uh it's it's pretty sweet. Uh, your primalist, a beastmaster, druid, and shaman. Does have a lot of cool druid shapes. You know, your typical bear, but then also like a tree form. Uh, acolyte is a necromancer, lich, and warlock. And then sentinel, paladin, void knight, and forge guard. And uh, this update actually does allow. It used to be locked in. Like you made that choice. You're like, \"Oh, I'm a rogue. I'm going to become a falconer.\" And you're like, \"Ah, I I thought the falcon would be cooler.\" Now, now I have to make a whole new character. They have added in, you know, kind of that respecting of players time, right? Uh, you know what? You can change that. If you feel like you did not enjoy that",
            "start": 2881.76
        },
        {
            "text": "now I have to make a whole new character. They have added in, you know, kind of that respecting of players time, right? Uh, you know what? You can change that. If you feel like you did not enjoy that specialization with this new update, you can change it. You can go back. You can become, you know, whatever else was uh kind of catching your eye. So that that's a nice little update for those of us who are more strapped for time in the ARPG space that uh we're not as uh punished for making a bad decision along the way. I can't believe I missed this. It's in the like their official website, Last Epoch, official game site. Time travel action RPG. Yeah, I love all those words together. You would love it. And uh I think a lot of people would too. I there's getting there is a lot of traction like on Twitch right now a lot of like the ARPG space is very cross-pollinated as I kind of said at the front where you know people bounce a lot and this is the the time in which Last Epoch is kind of",
            "start": 2929.84
        },
        {
            "text": "on Twitch right now a lot of like the ARPG space is very cross-pollinated as I kind of said at the front where you know people bounce a lot and this is the the time in which Last Epoch is kind of getting a lot of its flowers um when they had their mo their most recent patch prior to this there was a lot more other stuff happening so it didn't really get that attention um whereas now like there's just there's just hunger there's hunger in this market to to try something new and play with it. And I'm happy to see them finding the the level of success that they're having right now. Love it. So then that brings us to the final action RPG of April, Diablo season. So then there is the Diablo I of it all, right? And you were on the Diablo podcast not that long ago and we talked a little bit everybody. We talked a little bit about this. Um, but uh in the most recent uh weeks or so, we got a full road map. Uh, we got an idea of what's going to happen with uh Diablo I, and we know the most",
            "start": 2977.36
        },
        {
            "text": "everybody. We talked a little bit about this. Um, but uh in the most recent uh weeks or so, we got a full road map. Uh, we got an idea of what's going to happen with uh Diablo I, and we know the most recent season will be happening on April 29th. So, up here is the Diablo I road map. We kind of have a nice little concept of what's going to come for this game. And uh we had talked not that long ago about what our predictions were for Diablo I and what we thought was happening with Diablo I. As we look here um there's a little bit of sameness. Uh right now we're in Bile's return uh which will be April 29th. We're getting boss powers. Um there's an earnable pet. There is a new IP collab which I'll talk about in just a second because they just announced that. Uh and it was not what I was expecting. Uh then we'll go into Sins of the Haradrum and Infernal Chaos. And all of those are going to kind of repeat the same thing that we've seen for a while, which is you're going to start out the",
            "start": 3031.28
        },
        {
            "text": "Uh then we'll go into Sins of the Haradrum and Infernal Chaos. And all of those are going to kind of repeat the same thing that we've seen for a while, which is you're going to start out the game, you're going to have a different power system that you're unlocking through some way, and that'll make your character more powerful in tandem with the regular character, what have you. Did you hear about the new IP collab, though? I have not heard about it. No. So, it was just announced today, so it wasn't uh this might be more up Barrett's alley, I would assume. Oh, it's Spongebob. Oh, it's Persona or Spongebob? No, it is Berserk. Oh, yeah. Okay. All right. Listen, I'm depressed. I'm not that depressed. Um, so, you know, dark fantasy IP combined with another dark fantasy IP makes a lot of sense. Uh, sure. The last major IP they collabed with was World of Warcraft. There were a bunch of different skins for that, but this uh is a little different. Uh, a little and Oh, look at Barrett. Wow,",
            "start": 3084.56
        },
        {
            "text": "Uh, sure. The last major IP they collabed with was World of Warcraft. There were a bunch of different skins for that, but this uh is a little different. Uh, a little and Oh, look at Barrett. Wow, that was so quick. Johnny on the spot. He's got it. Yeah, I'm impressed with that. So, we have like a little for you audio listeners, there's a little Berserk style Diablo cinematic kind of happening here to announce the partnership. Uh, we have our barbarian dressed like Guts from Berserk. So, it looks pretty cool. Um, what that actually means like what the I was going to say, okay, we haven't actually seen the outfits or anything, right? Okay. I I would I would hope that it is more than just a paid thing, you know, where it's just this is on the store, drop $40. But if there was earnable stuff within the game, I think that would be great for everybody. Um, sure you can still have a paid version somewhere, but give everybody a chance to get something along the way to make that collaboration",
            "start": 3137.6
        },
        {
            "text": "within the game, I think that would be great for everybody. Um, sure you can still have a paid version somewhere, but give everybody a chance to get something along the way to make that collaboration feel like a collaboration and not just a payw wall. Yeah, that'd be awesome. I mean, I doubt it, right? Because they got to pay for the collaboration. I bet they're going to charge you for it. You're not getting nothing for free out there. I That's 100% true. Um, but this is as we're looking ahead for the the end of the month, uh, this has been four months since the the last Diablo season and I think it's been long enough. I kind of burned out on the the most recent season that I'm also kind of chomping at the bit to get back in. Okay. Okay. Talk to me about why because now that you've now that you've taken your foot off the gas, you feel like you're ready to go back. Yeah. I think you burn out from everything, right? you burn out from from playing the same kind of games for for too long.",
            "start": 3185.84
        },
        {
            "text": "you've taken your foot off the gas, you feel like you're ready to go back. Yeah. I think you burn out from everything, right? you burn out from from playing the same kind of games for for too long. And the it it's almost like a pallet cleanser in some regards, like jumping from Path of Exile to Last Epoch and then finally to Diablo I. They're all so similar and yet so very different. Um, you know, out of all of them, Diablo I is the the fastest paced, right? It's kind of nice to just jump in and mow through thousands of demons and uh by having and feel powerful, right? By having like a little bit of a like a a slower time in Path of Exile and a little bit slower in uh Last Epoch, I'm looking forward to kind of cruising through I'm looking forward to kind of coming back and mowing down the the hordes of hell pretty quickly. Uh because it is it is very much its own thing. And uh while we can critique and say like, you know, maybe it needs a little bit more of that that challenge, um it",
            "start": 3232.72
        },
        {
            "text": "the hordes of hell pretty quickly. Uh because it is it is very much its own thing. And uh while we can critique and say like, you know, maybe it needs a little bit more of that that challenge, um it is somewhat refreshing by comparison and and like you can kind of appreciate it in in that regard. Um and there's no cost of entry at this point. I've already bought the uh expansion. You know, the season's free. It it does me no good to to sit on the fence. I should I should hop in and and get a taste for it. Uh so we're getting boss powers. Plus, you host the Diablo podcast, so it's kind of It'd be really hard to talk about something I'm not playing. I just couldn't do it, guys. I didn't want to. We'll wrap it up. We'll uh close the show. That's That's kind of how it works. Uh but I have said for years, like with uh hosting the Diablo podcast. If it's ever not fun, I won't do it anymore. But it's always fun. Like I think keeping a level head about these kind of things and not becoming",
            "start": 3281.6
        },
        {
            "text": "for years, like with uh hosting the Diablo podcast. If it's ever not fun, I won't do it anymore. But it's always fun. Like I think keeping a level head about these kind of things and not becoming too obsessive, which I know is weird because I host a podcast. Um, but playing on the treadmill, can't stop, but yeah, you're not too obsessive. Not too obsessive. It's still not my job. I think like that's the biggest thing. It's not my job. Um, got you. It's still your passion. That's awesome. I'm not I'm not reliant on it. So, it is it's much more fun that way. it it's fun when I'm just getting together talking with friends about video games. Like that's that's exciting. Um but you know, we're getting these boss powers uh which all look kind of exciting. I'm I'm intrigued to to mess around with it. And really what we have is about the last time we saw everything was uh about a month ago they did uh a PTR. And a public test realm is always kind of a [ __ ] show. It it's all the bugs coming",
            "start": 3328.48
        },
        {
            "text": "it. And really what we have is about the last time we saw everything was uh about a month ago they did uh a PTR. And a public test realm is always kind of a [ __ ] show. It it's all the bugs coming to light. you get to see broken stuff. And what we're going to get in about a week is they'll they'll do a campfire chat and they will discuss what this season actually will be and they'll they'll put it out there. They they'll have refined all those broken bugs. There's always going to be something there's always something that gets broken. Um but it'll be a little bit cleaner and then we'll get to jump in on the on the 29th. So, it's like get all the last epoch in you can because then on the 29th you need to jump in to Diablo and start cruising there. Um, probably playing around with those new Berserk outfits cuz I'm going to get suckered in. I know it. I know myself. I feel like the one thing we're talking about with all these uh is that even though it's a jam-packed April, the best",
            "start": 3376.32
        },
        {
            "text": "new Berserk outfits cuz I'm going to get suckered in. I know it. I know myself. I feel like the one thing we're talking about with all these uh is that even though it's a jam-packed April, the best month ever for an ARPG fan, there's still a fair amount of time between each one of these where yeah, like you're saying, like you aren't even by any stretch of the imagination done with the the Path of Exile 2 stuff to really get into Last Depo. But it is this idea that they're giving you time to really get in there, taste it, and figure out then which one of these this Neapolitan ice cream you've been given here of ARPGs you want to stick with and go forward with. Yeah, it uh well actually uh sadly Last Epoch was uh going to launch right around when Path of Exile 2 was launching its update and they pushed it by about uh two weeks just to give that breathing room which was probably one of the best choices. If memory serves, I saw them put a message out about it, right? Where they were",
            "start": 3424.24
        },
        {
            "text": "and they pushed it by about uh two weeks just to give that breathing room which was probably one of the best choices. If memory serves, I saw them put a message out about it, right? Where they were like, \"Hey, one of our other ARPG friends is putting out an update, so we're going to move.\" Right. Right. Which was a good call on their part. Like, uh, I think that's the challenge for all three of these studios going forward is it's not like they talk like they're not there's no special discord for all of them to get together and like, \"Hey, when are you going to release?\" Uh, so they don't step on each other's toes. Um, but it I think like a two three week window is usually the the best. That that's enough time to get in there. It's enough time to play through a campaign and get your hooks into whatever the end game happens to be and and maybe work out whatever you know challenge you had kind of set for yourself and then jump on to the next one and the next one. And then for those who",
            "start": 3469.68
        },
        {
            "text": "into whatever the end game happens to be and and maybe work out whatever you know challenge you had kind of set for yourself and then jump on to the next one and the next one. And then for those who are like really really into the genre like myself, like I need three months. I need like I've got like four I need to live here, right? I got like four or five different characters I want to be able to take to different levels of power and and challenges I want to set for myself. And that extends it always for me. Like that is where my extension always comes from. Um but for the your average player, you a week, two weeks to kind of go in mess around that that's totally fine. And I think it will serve all these games really well to kind of respect that space. Uh because you can't do both at the same time. It's It's impossible. Before we wrap up, get out of here. You've done a great job recapping all this and telling us what's happening. Thank you. Can you give us a kind of funny a read on",
            "start": 3510.0
        },
        {
            "text": "same time. It's It's impossible. Before we wrap up, get out of here. You've done a great job recapping all this and telling us what's happening. Thank you. Can you give us a kind of funny a read on the pulse of Diablo II? I feel like I've I was the torchbearer. I've talked about it, but as I've said multiple times in all of our podcasts, like I just burned myself out platinuming it doing the expansion story three different times and then so I've just stopped talking about it and I glance at the updates obviously I'm still following along but I'm not talking about it. What is the general community right now? because it does seem like for me somebody reading the raw interviews or seeing these headlines that there's been a bit of a they're trying to course correct where you know we're talking about this being oh it's so easy and you just murder everything and do the thing and I've seen the comments from them of well we want to go back to trying to be a bit harder is that accurate yeah I",
            "start": 3554.8
        },
        {
            "text": "about this being oh it's so easy and you just murder everything and do the thing and I've seen the comments from them of well we want to go back to trying to be a bit harder is that accurate yeah I think there is a little bit of that course correction that should be coming in the most recent update uh on the 29th uh I think in some ways is it it's a conflicted game. Uh it's very reactionary from time to time of like, okay, it's it's blast blast blast and it's like, well, we're going too fast. Let's let's crunch those numbers. Let's bring it back to being more difficult. But then somebody else discovers something that's more blast blast blast. And um it's it's really kind of tough to balance. Uh, in terms of like general sentiment, I think two years in, it's like appreciating Diablo II for what it is and maybe tempering expectations about what it will be. Um, like seasons themselves don't seem to be as gamechanging as what maybe we initially had hoped it would be. um as we're seeing",
            "start": 3600.96
        },
        {
            "text": "what it is and maybe tempering expectations about what it will be. Um, like seasons themselves don't seem to be as gamechanging as what maybe we initially had hoped it would be. um as we're seeing the the recycled power system kind of come back continuously, uh we're not getting as many guild changes or paragon board systems or anything like that that that's shifting up the way the game's kind of been played. And yeah, it there's a little bit of stagnation that that kind of creeps in when when you know it's going to be the the same kind of thing, but maybe in a different color paint and yeah, that that can that can have things kind of die down a little bit in terms of excitement. There still is another expansion that's on the horizon. I mean, I know that's on the road map uh for 2026, but but when in 2026, when does that happen? We know Blizzcon is in uh September of 2026. That feels too late. That feels way too late to be announcing an an expansion. Um as I think that's where big",
            "start": 3650.56
        },
        {
            "text": "but but when in 2026, when does that happen? We know Blizzcon is in uh September of 2026. That feels too late. That feels way too late to be announcing an an expansion. Um as I think that's where big changes happen, right? That an expansion for Diablo is when the big changes happen. It's not like Path of Exile uh where each season is a big change uh or even in Last Epoch where they're they're doing a little bit more changes on their seasons. it it seems to fall on these expansions and I think people are hungry for that. Uh there was a lot of um the story itself in the the in vessel of hatred for Diablo was fine but it left on such a huge cliffhanger. People wanted to fight meto uh people like the real Mefisto right people wanted that. I think the longer it goes where we don't have that the the more that sentiment just kind of builds up. So, I'm hoping early 2026 is when we're seeing it because again, going too long feels dangerous. It feels like again working best interest. Yeah.",
            "start": 3705.32
        },
        {
            "text": "the the more that sentiment just kind of builds up. So, I'm hoping early 2026 is when we're seeing it because again, going too long feels dangerous. It feels like again working best interest. Yeah. Yeah. Like we want to get in. We want to play a paladin. We want to toss some hammers around. We want we want all of our We got to toss the hammers. We love the hammers. Uh and without it, yeah, we're we're running um into dangerous territory, especially as the competition is is amping up. You Last Epoch and Half Exile aren't going anywhere. Um, and then there's just other games. There are other games that are going to be competing against uh all of these ARPGs. And if it's uh if it's not big enough and different enough, then yeah, you're not going to come back for that that next season. A final question for you. I think the the landscape here of ARPGs, right? Obviously, this month is a banger. That's amazing. Where's your head at? Because one of the comments early on in the show was, \"Man,",
            "start": 3763.92
        },
        {
            "text": "question for you. I think the the landscape here of ARPGs, right? Obviously, this month is a banger. That's amazing. Where's your head at? Because one of the comments early on in the show was, \"Man, I used to love ARPGs, but now that everything's moved to being an an always online games as a service, it's kind of taken the fun out of it for me.\" Like, as we talk about Diablo right here, and the length of time until this next expansion, all these seasons here, which are doing things, but not doing things people that really want or maybe aren't gamechanging, like, do you think that's worked against the genre? The fact that people have really leaned in on, okay, well, let's always be online. Let's do updates. Let's do this. Let's do that. That's a good question. I mean, like, first we go back and we look at we look at uh Are we high-fiving? I was trying to high five Barry, but it was he didn't he was looking at his phone. He didn't hear the question. He I was I was looking at the replies",
            "start": 3813.2
        },
        {
            "text": "and we look at we look at uh Are we high-fiving? I was trying to high five Barry, but it was he didn't he was looking at his phone. He didn't hear the question. He I was I was looking at the replies to my Blue Sky uh post earlier about needing to fart in an Uber. Missed that one. Missed that one. I did see that one actually. Um, so coming back happy to report I did not fart in that Uber. I mean, you could. You're paying for the time, right? I I I don't think he would have been the first one to fart in the Uber. Like, I don't think they would have said anything. But I digress. Uh, going back to uh the the always online. Yeah, you're absolute banger of a question. Um, it like Last Epoch, you know, kind of coming back to it, it has that offline option. I think that is, you know, maybe something to kind of push the the genre in a a different direction. I think them being a small independent studio helps that where they can kind of push out and if if the these things catch fire and more",
            "start": 3856.32
        },
        {
            "text": "to kind of push the the genre in a a different direction. I think them being a small independent studio helps that where they can kind of push out and if if the these things catch fire and more people are enjoying that, then then maybe we do see ARPG shift into having that as an option. Diablo II had an, you know, an offline mode and that that's considered the basic pinnacle of the of the genre. The genre. Yeah. That helps it. It helps, you know, being able to add in mods and for people to play around with the game. So, it could be cool to see. I'm I've never had a huge issue with it. Uh, I've always been content to be online with it, but having like the the nicity of like Path of Exile, you got the pause feature built in. That is a lifesaver. Um, love it. Like we're we're dads. Life happens. We need to pause. Yeah, I can't do that anything else. I can't quick open a town portal all the time. I need to pause. I need to pause right now. But, uh, I would love to see that kind of move",
            "start": 3916.08
        },
        {
            "text": "We need to pause. Yeah, I can't do that anything else. I can't quick open a town portal all the time. I need to pause. I need to pause right now. But, uh, I would love to see that kind of move forward. I think being able to kind of take yourself offline from time to time in an ARPG is is phenomenal. Um, and the the push for continual live service is is tougher. I get it. Uh, I I think Path of Exile system as opposed to a battle pass is still to me the the easiest one. Same with the last epoch. Here are a bunch of skins. You're going to look real awesome. You don't have to buy them. Um, but like this is how we're going to make our money. So, you could you could purchase a few things. Uh Diablo's battle pass. I I rarely, we were talking about it the other day, I rarely use anything from it. I get the battle pass every season, but I'm never decked out in it. It's always kind of the same thing. So, uh crazy. I love chasing that battle pass in Diablo. That granted, like, you know, right",
            "start": 3969.36
        },
        {
            "text": "I get the battle pass every season, but I'm never decked out in it. It's always kind of the same thing. So, uh crazy. I love chasing that battle pass in Diablo. That granted, like, you know, right now burned out, I'm not doing it, but like there was a couple seasons there where I was like, \"Oh, that's cool.\" And that's cool. I like this whole set, so I will I'm excited to do this. I'll be playing no matter what, right? I play a druid though. So typically the druid the cosmetics don't show up anyway because you're in a bear form or werewolf form. So it doesn't it doesn't matter as much. But yeah, I get some of the appeal, but for me it's never been uh it's never been about those chasing a skin or anything like that. It's it's more chasing whatever arbitrary challenge I've I've ended up setting for myself. And like I said, you know, Path of Exile 2, I'm still chasing that uh last epoch. Now I've got that chase. And then I'll be starting up another one uh at the end of the month and I",
            "start": 4017.12
        },
        {
            "text": "for myself. And like I said, you know, Path of Exile 2, I'm still chasing that uh last epoch. Now I've got that chase. And then I'll be starting up another one uh at the end of the month and I have no idea where I will find success, but I'm having fun doing it. I think I think everybody else will be too. Uh I'm excited to hear I would hope they get back to you, Greg, and shoot you a Oh, they did. I'm good. I'm I got it box in there. We're done. We downloaded. We're set to go. Well, that was quick. Now Now it's like I got to I got to grind through I got to burn through the Monster Hunter Wilds obsession that I have. Just get that satiated enough to be able to play something else. Because here's where my life is. It's I was going to just wilds it up all weekend long of course. Then be ready for a shadow drop of oblivion next week to then move over to that. Now if that doesn't happen, big gap there. We can get some epoch going in there, but it'll probably just be more wild. So I got more",
            "start": 4056.8
        },
        {
            "text": "for a shadow drop of oblivion next week to then move over to that. Now if that doesn't happen, big gap there. We can get some epoch going in there, but it'll probably just be more wild. So I got more things. But then I'm getting on the plane for packs and that's when I need the rag ally set to go. And I was going to play I thought there well I still will. That's when I'll start outer worlds again to get ready for the we're reviewing that at the end. But somewhere in there, I will find a place to try epoch. Maybe today. In no way you're going to put any sign if Oblivion is real next week, there's no way you're putting any significant time into it. Oh, into Oblivion. Yeah. You think so? I think you'll play an hour. You'll be like, \"This looks This looks very pretty.\" Old game is old, though. Game is old. Did you play Oblivion back in the day? No. See, that's my thing is it's such a it's such a blind spot for me that I don't even know what the old game is old thing that'll turn me off",
            "start": 4099.76
        },
        {
            "text": "Game is old. Did you play Oblivion back in the day? No. See, that's my thing is it's such a it's such a blind spot for me that I don't even know what the old game is old thing that'll turn me off about it is. What is When did that come out? Oblivion 2006. Yeah, I was 11 years old. Uh I think I was a sophomore in college at that point. Oh no, I Oh crap. I'm actually way older than that. I had graduated college. God. Yeah, I was working my first job. I was engaged. I was about to go work at IGN. My friends and I were still playing like Tony Hawk and Spongebob Squarepants. Well, nothing's changed. Zanith, I thank you for your time as always. your ARPG expertise before you go. Is there anything people need to know about this month or these games that we didn't cover? Um, really just choose one and have fun. Um, okay. My biggest recommendation for anybody who is new to this genre is honestly start with Last Epoch. I feel like it is so approachable and then it allows for a nice branch to",
            "start": 4137.6
        },
        {
            "text": "one and have fun. Um, okay. My biggest recommendation for anybody who is new to this genre is honestly start with Last Epoch. I feel like it is so approachable and then it allows for a nice branch to one or the other. If you find yourself like, \"Oh, I want to go zoom zoom fast,\" bounce on over to Diablo I. If you're like, \"Oh, I want this this is fun, but I want just a little bit more of a challenge,\" then jump on into Path of Exile. Um, and honestly, there's no wrong choice. Uh, you don't have to play all three, but you might find yourself kind of chasing uh chasing the dragon of the ARPG awesomeness that uh they all offer and uh getting sucked in. I love it. Uh, Zanth, where can people keep up with you? Uh, predominantly just Blue Sky, uh, HD Zanth and, uh, the Diablo podcast on Spotify and Apple. I love it. Thank you for your time. I hope you have a lovely weekend. I hope you have a good time running 22 miles. Uh, yeah, it'll be a great time. It'll be a great time. Good. Everybody",
            "start": 4188.88
        },
        {
            "text": "and Apple. I love it. Thank you for your time. I hope you have a lovely weekend. I hope you have a good time running 22 miles. Uh, yeah, it'll be a great time. It'll be a great time. Good. Everybody else, whether you're watching or listening, I hope you have a lovely weekend as well. Of course, if you're watching live on twitch.tv/confunny games or youtube.com/kindfunn, your day is far from over. We go from here to Kind of funny games showdown. We go from there to the Kind of funny podcast. We go from there to a stream of maybe Rematch, maybe something else. Bear's just shrugging. Maybe they'll play Spongebob. Uh, of course, if you're listening or watching later, thank you. Like, subscribe, share. Uh, consider picking up the Kind of funny membership. Of course, $10 gets you all of our shows ad free and the ability to get my exclusive daily podcast. Greg Way. YouTube.comkindfunname patreon.comkindfunny Apple and Spotify. No matter where you get the show, thank you for your support and",
            "start": 4245.12
        },
        {
            "text": "ad free and the ability to get my exclusive daily podcast. Greg Way. YouTube.comkindfunname patreon.comkindfunny Apple and Spotify. No matter where you get the show, thank you for your support and until next time, it's been our pleasure to serve you. [Music]",
            "start": 4287.12
        }
    ]
}