{
    "id": 13926,
    "video_id": "rlFqDGD6Pjg",
    "show_name": "Gamescast",
    "hosts": [
        "Andy Cortez",
        "Blessing Adeoye Jr.",
        "Mike Howard",
        "Parris Lilly"
    ],
    "title": "Our Marathon Reveal Impressions - Kinda Funny Gamescast",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page - https://nwzo.io/click/dzexr/\nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\n\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\nTime Stamps:\n00:00:00 - Start\n00:03:13 - Housekeeping\n00:05:26 - Our Marathon Thoughts\n00:26:50 - SuperChats\n00:36:07 - Should Marathon Be Free-To-Play?\n00:57:17 - Final Thoughts\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1744659407,
    "duration": 4031,
    "transcript_chunks": [
        {
            "text": "[Music] Yo, what's up everybody? Welcome back to another kind of funny games cast for Monday, April 14th, 2025. I'm one of your show hosts, Snow Bike Mike, and today I'm joined by a great panel of awesome guys over here. We got Paris Lily coming in via Discord. Hi Paris. How are you? Hey, what's up? How's How is everyone doing? Paris, I'm much better when I get to see your face. It's been quite some time since you and I got to hang out. Is always nice to uh spend some time and talk video games, especially a Bungie video game, which I know you love. Absolutely. You know, I'm a huge Bungie fan. So excited for the conversation today. Big reveal happened this Saturday. Blessing. Bungie finally showed off gameplay for Marathon, the big extraction shooter. That's going to be the topic of the show Saturday. Tell me what you were doing. I was playing Magic with the homies. I thought about doing a Twitch stream. I think Andy went live during Was that correct? Yeah, Andy was doing it. I ended up",
            "start": 9.51
        },
        {
            "text": "Saturday. Tell me what you were doing. I was playing Magic with the homies. I thought about doing a Twitch stream. I think Andy went live during Was that correct? Yeah, Andy was doing it. I ended up doing my own Twitch stream the day after reacting to the Bunchy stuff, which we'll get into, was different than what I thought it was going to be. Okay. I thought it was going to be like almost like more of a showcase, like 30 minutes to an hour of like here is everything. And they did their thing, right? like we'll talk about it, but it was just different in format. But yeah, I was I was playing Magic Commander. You're the best. I love that. And of course, rounding out the squad is Andy Cortez. He has a 2hour long video breakdown of him live reacting to the marathon. Uh all the videos that Bungie put up because there was a couple of them. There was actually four videos that they put up proper. There was a cinematic video that was very cool about 8 minutes long. that a gameplay breakdown",
            "start": 61.12
        },
        {
            "text": "put up because there was a couple of them. There was actually four videos that they put up proper. There was a cinematic video that was very cool about 8 minutes long. that a gameplay breakdown for 5 minutes, gameplay reveal for about a minute and 55 seconds, and then rounding it out with the big creator highlights from the alpha that they allowed a bunch of people to go to. Andy, two hours of fun watching that live on Twitch. How did it go? Well, mainly two hours cuz I kind of forgot to stop the stream. I just kind of kept on yapping. I was like, I got to end this VOD. Like, this is right now we're just talking about other games. So, like we're, you know, I've definitely gone a little too long here. But it was neat hearing from other creators and watching other creators talk about their time uh over there and getting their hands on with the latest build for that recent sort of creator event. Um yeah, I'm just uh it's an interesting one and I can't wait to kind of break it all down",
            "start": 99.12
        },
        {
            "text": "time uh over there and getting their hands on with the latest build for that recent sort of creator event. Um yeah, I'm just uh it's an interesting one and I can't wait to kind of break it all down with y'all. It is an interesting one and it's going to make for a great topic of discussion here on your Monday games cast. Of course, Paris has played Marathon a long time ago, which we'll talk about that. And Andy and Bless and myself have both or all three of us have watched the breakdown and reveal. So, we're going to dive into it with you, the awesome audience on YouTube and on Twitch. If you want to get involved in the conversation, don't forget to super chat with your thoughts of the reveal, the game play, the game itself being an extraction shooter from Bungie, maybe the price tag, maybe the overall release date, whatever you want to talk about, send in those super chats. We'll get you involved in the conversation because of course this is the kind of funny games cast. Each and",
            "start": 138.88
        },
        {
            "text": "maybe the overall release date, whatever you want to talk about, send in those super chats. We'll get you involved in the conversation because of course this is the kind of funny games cast. Each and every weekday we get together to talk about the biggest reviews, previews, and topics of discussion live on YouTube and on Twitch and of course on podcast services around the globe. If you love what we do, consider supporting us with that kind of funny membership available on Patreon and on YouTube where you can get the very best of kind of funny. Also now available on Spotify and Apple Podcast to get our shows adree. Watch us live as we record them and get your daily exclusive show for a chance to be part of the show. Submit your thoughts and opinions as YouTube super chats as we go. Of course, this is Kind of Funny Games cast. Earlier today, you got the Kind of funny games daily giving you all the nerdy news you need to know about. After today's Games cast, you will get a special",
            "start": 182.56
        },
        {
            "text": "course, this is Kind of Funny Games cast. Earlier today, you got the Kind of funny games daily giving you all the nerdy news you need to know about. After today's Games cast, you will get a special screencast all about the Last of Us season 2 premiere. Who here on the panel watched it? Oh, come on. You already know. You already know. I was blessed. Paris, did you make time on a Sunday night to watch The Last of Us season two? I haven't even watched Severn season 2 yet. Oh my god, brother. Lock in. Paris needs a a night on the couch watching some good television. It sounds like uh later, guess what? We're assembling the team. It's time to jump back into Marvel Rivals with the launch of season 2. Later today, thanks to our friends over at Nvidia, we're going to be showing off in-game Nvidia DLSS4 with multi-frame generation AI powered tech that gives you up to 440 frames per second in 4K with the topend 50 series RTX GPU. So, make sure to come join us later this afternoon as we play",
            "start": 225.76
        },
        {
            "text": "DLSS4 with multi-frame generation AI powered tech that gives you up to 440 frames per second in 4K with the topend 50 series RTX GPU. So, make sure to come join us later this afternoon as we play some games. Of course, don't forget if you're a Kind of funny member, you get today's Greg Way, which is all about Greg and I'm sure his big vacation spring break trip. I think it's 19 minutes of Greg Miller unfiltered. Wow. Unfiltered. Wow, that's dangerous. No rules. Uh, thank you to our Patreon producers, Anatoli Anst, Delaney Twining, Carl Jacobs, and Omega Buster. Thank you all so much for your support. Today, we are brought to you by Imperial Factor and Shady Rays, but I'll tell you all about that later. Let's get into what is the topic of the show. Let's talk about Marathon. Marathon is coming to you from the development team of Bungie. It's a team-based extraction shooter set to release September 23rd, 2025 on consoles and PC. It's a premium title, not a full price title, with Bungie",
            "start": 271.88
        },
        {
            "text": "to you from the development team of Bungie. It's a team-based extraction shooter set to release September 23rd, 2025 on consoles and PC. It's a premium title, not a full price title, with Bungie giving more details this summer, they say. Over on Steam, the writeup sounds like this. Scavenge the lost colony of Taetti 4 in Bungie's team-based extraction shooter. Choose your runner cybernetic mercenaries with unique abilities as you battle rival teams and security forces for weapons and upgrades. Fill your vault. Take on high stakes challenges and unravel the colony's mysteries. Oh, wrong marathon. Sorry. That is your marathon write up. Let's talk about our thoughts and impressions coming out of Saturday's big reveal. Andy, I'm going to start with you because you had the big breakdown over on your Twitch channel and then we'll get to Paris who's played it and blessings thoughts after that. But Andy, after Saturday's reveal of gameplay, the overall trailer, uh, Marathon creator alpha uh,",
            "start": 324.96
        },
        {
            "text": "your Twitch channel and then we'll get to Paris who's played it and blessings thoughts after that. But Andy, after Saturday's reveal of gameplay, the overall trailer, uh, Marathon creator alpha uh, highlights and the cinematic short, what did you think of Marathon? I think it looks amazing visually. I loved hearing other creators talk about their time with it and what they think the potential can be. I think it's uh kind of a weird one because this I think extraction shooters are such a niche genre that it's there's a lot of people that there's a lot of like normies out there that aren't constantly playing the newest games and maybe only play War Zone and other battle roytoplay title is I think it's a bit hard for those players to try to wrap their minds around the game loop and I think even based on what a lot creators were saying and videos that I watch from people like Skill Up or um I watch Dr. Lupos's video on it as well and them mentioning that maybe the gameplay loop isn't",
            "start": 375.92
        },
        {
            "text": "even based on what a lot creators were saying and videos that I watch from people like Skill Up or um I watch Dr. Lupos's video on it as well and them mentioning that maybe the gameplay loop isn't quite 100% developed. And it kind of just feels like everything that we've been shown so far that this this is giving me a lot of Destiny 1 vibes where maybe it's not fully fully cooked. And I and that's I think you could look at that statement kind of from both angles, negatively and positively because I put a [ __ ] ton of hours into Destiny 1, even though I knew that, you know, this isn't exactly what I think is a perfect video game, but I'm still kind of addicted to the loop of it all. Um, I think this will I think it's going to catch a lot of people off guard and a lot of people are also going to say, \"Dang, this isn't a PVP exclusive only game. I'm good. I'm out.\" And maybe not even I'm out because you still have to pay a premium price to even get in to it. So, I'm I hope they do a lot",
            "start": 427.72
        },
        {
            "text": "to say, \"Dang, this isn't a PVP exclusive only game. I'm good. I'm out.\" And maybe not even I'm out because you still have to pay a premium price to even get in to it. So, I'm I hope they do a lot of sort of free alphas and things like that to get people acclimated with what the with what the video game is. But um just from a from a nerd design standpoint, this is like the freshest thing I've ever seen in a long time. I love the art style. I love the look of the guns, the look of the weapons, and I was kind of discouraged by there not being a a central hub when me and Mike played a a game called The Cycle Frontier, which was kind of my first foray into an extraction shooter. whenever you go want to do missions or whatever, there's a player hub and you go talk to the NPCs and you see them standing there. And this has very much what a lot of people have told me is very similar to Tarov, which is the premier extraction game where you're just kind of accepting missions and menus. I'm kind",
            "start": 484.88
        },
        {
            "text": "there. And this has very much what a lot of people have told me is very similar to Tarov, which is the premier extraction game where you're just kind of accepting missions and menus. I'm kind of bummed out about that. I hope maybe they can continue to develop that to, you know, make the player more immersed. Really bummed out there's no uh character creator, but that was leaked a while back. We kind of knew and expected that. But yeah, you are essentially selecting from pre-created heroes. And of course, there's going to be customization on top of that. I'm just really bummed out with the idea that you being a consciousness uploaded into a synthetic robot body that there's not a whole lot of agency you have there because you're kind of just picking I'm going to pick pick Glitch who is the character that does this or I'm going to pick whatever. I don't know. I'm just making this void. Dude, I don't even know if that's a character, but it sounds like Oh, it was really Oh, nice. Okay.",
            "start": 533.68
        },
        {
            "text": "character that does this or I'm going to pick whatever. I don't know. I'm just making this void. Dude, I don't even know if that's a character, but it sounds like Oh, it was really Oh, nice. Okay. What about Shadow? Is that a third one? Um, so yeah, that that that does bum me out. Also, I think extraction shooters are made all the more exciting with uh with Prox Chat and that not being here. While understandably the devs going, \"Yeah, it's just not where it is where it needs to be because of how toxic it can be and how off-putting it can be.\" But that also lends so much to the extraction thrill. Um, however, the gunplay and everything still looks so freaking fantastic and fun and the moves and the visuals look amazing that I still want to despite it not being what I want it to be, I'm still going to put a lot of hours into it because it's a Bungee shooter and those usually feel really fun to play. You you mentioned it reminding you of Destiny 1, right? And you say both and the good",
            "start": 575.28
        },
        {
            "text": "going to put a lot of hours into it because it's a Bungee shooter and those usually feel really fun to play. You you mentioned it reminding you of Destiny 1, right? And you say both and the good and bad angles of it. I think my number one question coming out of this is for you Andy and for Paris too, right? Like what are your guys' expectations for day one of this game because when you say Destiny, I think about the time that it took for Destiny to build and get people on the side of, oh, this is [ __ ] awesome, right? Like was it the Taking King or whatever it was that was like the turning point of people going, \"Oh, no, this is now fantastic. We [ __ ] with this thing. We love this thing.\" Do you think that when this launches day one, it's going to be in a place where people understand it and love it? or do you think it's going to take time to get there? And then the follow-up question is, if it takes time, how good does it need to be to be given the luxury of time? Paris, I love",
            "start": 621.12
        },
        {
            "text": "it and love it? or do you think it's going to take time to get there? And then the follow-up question is, if it takes time, how good does it need to be to be given the luxury of time? Paris, I love how you throw it right to me. Um, let let me rewind a little bit and then I will answer that question, blessing, because I do want to kind of have some takes on what Andy just talked about as well. So, for full disclosure with me, I went to Bungie in the summer of 2023 to get hands-on with uh Marathon. And since that time, I've been a part of their creator program. So, I have not played it since then. I did not play this alpha, but I've been able to sit in, for lack of a better term, some town halls with with Bungie where they're talking to the creators. They're showing us some concepts where they're headed with it. a lot of the stuff that wounded up in the alpha. I got to see some weeks back and then uh we did a Q&A on it, stuff like that. So, I've seen the progress over the past couple",
            "start": 662.24
        },
        {
            "text": "they're headed with it. a lot of the stuff that wounded up in the alpha. I got to see some weeks back and then uh we did a Q&A on it, stuff like that. So, I've seen the progress over the past couple years of what the game is, but I've not physically played it since the summer of 2023. Um, also pricing is a thing. I'm sure we'll have a whole discussion about pricing as well. So, I I won't dive into that right now other than to say when I was at Bungie, they were doing Q&As's with us back then and they were talking about monetization and trying to figure out, you know, what the best path would be. But, I'm sure we'll have a whole discussion about that. So, when I played it, they weren't doing these specific hero classes at the time. It was you kind of create your character. You go in and the whole 3v3 concept, the PvP PvE concept of the extraction shooter was all there at that time. And even two years ago, it's it's Bungie. The the it felt good. It felt really good to play. The shooting",
            "start": 708.88
        },
        {
            "text": "whole 3v3 concept, the PvP PvE concept of the extraction shooter was all there at that time. And even two years ago, it's it's Bungie. The the it felt good. It felt really good to play. The shooting mechanics, weapons, everything about it felt really good to play. We definitely got into some intense situations just in the play session that we had. So, I walked away from that feeling good about what Marathon potentially could be. But even back then, we're like, obviously, this still needs needs more work. They're going to have to be able to explain it. And one thing that you keyed on, Andy, which I 100% agree with. I know they're going to do this closed alpha now, I'm assuming they're going to do some kind of open beta in the summer before September, because I think that's going to be part of it. They got to get people to actually understand, especially on the console side, what is an extraction shooter? What does it mean to go into this world? You're looking for loot. You're you got",
            "start": 756.48
        },
        {
            "text": "of it. They got to get people to actually understand, especially on the console side, what is an extraction shooter? What does it mean to go into this world? You're looking for loot. You're you got to get out. you have to successfully extract it to be able to keep it to get some permanent upgrades, perks, obviously the weapons, things like that. Because to your question, blessing, I don't think people are going to get it day one. That would be my one thing. I don't think this is going to be something that's going to immediately click. And even if you go all the way back to Destiny 1, it really wasn't until people got to play the raid that people truly started getting addicted to Destiny and it became the phenomenon that it was. This isn't necessarily from the from what I know, I will say this isn't necessarily going to have some kind of moment like that, but that's what Bungie is going to need to explain over the summer is what is going to be that gameplay loop beyond just going on",
            "start": 800.4
        },
        {
            "text": "this isn't necessarily going to have some kind of moment like that, but that's what Bungie is going to need to explain over the summer is what is going to be that gameplay loop beyond just going on these runs to extract loot that's going to keep you coming back moment to moment, right? I'm sure again there's going to be some intense fun things that you're going to be able to encounter while you're in there, but is it going to be cuz I I did get to talk to a couple people that played to the alpha and we we had this conversation about it that I think there will be some initial fun here. I'm more concerned about month three, month six, year, you know, year two. Am I still excited to go back and play Marathon? And what is that content that Bungie's going to be able to deliver that's going to keep me coming back? because it's going to launch with three maps. Um, ultimately there will be six classes that you'll play at launch and then they're going to do four during this alpha. But what",
            "start": 842.64
        },
        {
            "text": "to keep me coming back? because it's going to launch with three maps. Um, ultimately there will be six classes that you'll play at launch and then they're going to do four during this alpha. But what what can we expect beyond that? What does the road map for marathon look like, excuse me, p excuse me, past season 1 that I'm like, \"Yep, can't wait for season 2. Can't wait for season five, six on down the road.\" So, there's still questions they need to to answer, but the art style, I I love it. Uh, visually, it's very impressive. Again, like I said, the the gun the game play that the gun play that I did even two years ago was already in a good place. So, I imagine it's an even better place now. So, I think people that are used to playing Bungee shooters, you're going to you're going to know what to expect as far as that goes. It's I just think the extraction part is the thing that they're going to really need to explain more to people. Yeah. I think one of the reasons I bring in even",
            "start": 886.08
        },
        {
            "text": "what to expect as far as that goes. It's I just think the extraction part is the thing that they're going to really need to explain more to people. Yeah. I think one of the reasons I bring in even that last part of my question, right, is the luxury of time is going back and I know there's going to be a lot of comparisons to Concord because it's PlayStation first party live service shooter if it's within the the strategy that they're they're going with, right? But that was a game that had two weeks. Granted, seemingly very low player base, right? And so when it is, oh, you have 2,000 concurrents, we got to pull pull the plug on this thing. Probably different from how a new Bungie title is going to come out where they have the built-in reputation, they have a built-in audience, they have a large amount of people. It's fun looking online and seeing how many people that are like you got to let Bungie cook. They're Bungeie. You know what I mean? Like just the Bungie name I think carries it",
            "start": 928.96
        },
        {
            "text": "amount of people. It's fun looking online and seeing how many people that are like you got to let Bungie cook. They're Bungeie. You know what I mean? Like just the Bungie name I think carries it so far, but then I start to wonder of we're talking about what this is going to look like season 3 or year two or whatever it is, right? Like what are the level of expectations that you guys think we should have by the time we get to what is it September 23rd when this thing comes out? It's it's such a hard thing to even think about because I feel like I'd have a much better answer if it were any other genre than this. Yeah. I this this being a genre that may not satisfy the people that only want PvP experiences and it may not even satisfy the people that only want PvE experiences. I'm going for this PvPVE thing that I think it's a genre that depends on the players to create the content because you are fighting NPCs and you're fighting tough bosses and or not tough bosses but uh enemies that",
            "start": 965.12
        },
        {
            "text": "this PvPVE thing that I think it's a genre that depends on the players to create the content because you are fighting NPCs and you're fighting tough bosses and or not tough bosses but uh enemies that what I listen to, you know, Dr. Loopa do the breakdown saying that, you know, these things are tough. They're not like these sort of just pushover. I'm just going to shoot these robots and get XP or get pieces from them or whatever that they provide a challenge. And to me, that's exciting. Uh hearing about the this supposed third map because they're apparently going for like a map sort of breakdown release or whatever. And there's a third map that wasn't shown to a lot of people that has a lot more raid like situations that you would experience in something like Destiny and even something with they didn't go too into details, but puzzle solving and things like that that you would have to do with your squad. Now, are you doing it at the same time that maybe another team is trying to get",
            "start": 1011.44
        },
        {
            "text": "they didn't go too into details, but puzzle solving and things like that that you would have to do with your squad. Now, are you doing it at the same time that maybe another team is trying to get the drop on you and you got to defend yourself? It it feels like it could be too hardcore of a genre for the mass market because first off, you have to pay $40 for a genre that you may not be sold on. Well, there's no confirmed price. No confirmed price. Yeah, I think 40 was the rumor. Yeah, apparently, right? But from a while ago, you would have to pay into a genre that you may not necessarily be sold on. And then how quickly are you willing to stick around when you get your loot taken from you four runs in a row? It's like [ __ ] this man. You know, like you're also hopping having to hop in with a set squad. You can drop solo if you want, but there will be other trios. And Bungie is also mentioned in a lot of different interviews. It's meant to be a trios type game. You could go solo if you",
            "start": 1063.04
        },
        {
            "text": "a set squad. You can drop solo if you want, but there will be other trios. And Bungie is also mentioned in a lot of different interviews. It's meant to be a trios type game. You could go solo if you want to do a no fill lobby, but the NPCs and the way a lot of the world is kind of built is meant to have through other homies with you. Um, it's it's such an interesting and I got to assume really kind of scary place that they're in because I think for a lot of people like me and even somebody like Paul Tassy who is one of the biggest Destiny heads you've seen out there and you know just followers of Bungie content out there, I I feel pretty similarly where I look at this and I look at that incredible 8-minute freaking Love, Death, and Robots uh cinematic. Holy [ __ ] this is incredible. I want to exist in this world. I don't necessarily want to be an extraction shooter. And I totally get that may not be for me. Mhm. But who is it for other than the people that are already stoked about",
            "start": 1109.92
        },
        {
            "text": "want to exist in this world. I don't necessarily want to be an extraction shooter. And I totally get that may not be for me. Mhm. But who is it for other than the people that are already stoked about extraction shooters? I mean, do you think they're trying to invent that audience, right? Like a more mainstream, a more console focus. This is coming out everywhere. It's being published by Sony, right? like this is and it's also Bungie where Bungie I kind of look look at as almost like a different form of Riot in a way where Riot right now they're working on 2X KO and I look at that as a fighting game and I'm like ah it's Riot. They know they know how to make um an entry into a genre that like they have no business being in and somehow like making it work and making it one of the the best competitive things in the space. Bungie time after time again, they have been able to enter genres that might be more niche or might not be as established and turn it into like this mainstream like what",
            "start": 1159.52
        },
        {
            "text": "things in the space. Bungie time after time again, they have been able to enter genres that might be more niche or might not be as established and turn it into like this mainstream like what they did with Destiny, right? Where they practically took a World of Warcraft like experience, brought it to console, kind of help pioneer what the current generation of live service first-person shooter can be. And now it's a thing that, you know, any gamer knows what Destiny is. So many gamers love Destiny, right? I I would assume they're trying to do the same thing with Marathon as far as bringing extraction to way more people and then the question becomes like can they actually do that? Like how much faith do we have in Bungie to actually be able to make that happen? Paris, do you think so? If I Yeah. Yeah. I want to jump in on that. Yeah. Go ahead. And yeah, go ahead and ask your question too. Do you think people will constantly have the same sort of mindset that I've had that it's hard for",
            "start": 1201.04
        },
        {
            "text": "Yeah. Yeah. I want to jump in on that. Yeah. Go ahead. And yeah, go ahead and ask your question too. Do you think people will constantly have the same sort of mindset that I've had that it's hard for me to get away from? And I totally understand the criticisms of look man, they're making a game that isn't the game that you want. Either [ __ ] play it or don't. And I to I I get that. It's similar to, you know, um me loving Hyperllight Drifter and going, \"Oh, they're making a rog light kind of like multiplayer thing. It's not a single player campaign. I'm still excited for it. I'm still excited for Marathon. I can't wait for whenever this alpha happens. But I also can't help but feel like the whole time Paris, I'll be thinking, man, I kind of just wish this was another Destiny type thing with maybe, you know, on Dark Souls games, you can get invaded by other players and it's like maybe I I wish that was the multiplayer angle as opposed to always kind of feeling that threat. But that is",
            "start": 1240.72
        },
        {
            "text": "maybe, you know, on Dark Souls games, you can get invaded by other players and it's like maybe I I wish that was the multiplayer angle as opposed to always kind of feeling that threat. But that is what an extraction shooter is by and large. So go ahead, Paris. Yeah. So to to answer that and I want to go back to stuff that you already mentioned as well. I think it's a thing of you don't know what you like or you don't like until you experience it. So I I take into account that Bungie is saying they want this to be a more social experience. So to what you were talking about previously, this has been Destiny for 10 years. That balance, them constantly trying to figure out that balance of we want to appease the hardcore people, but we want to lower that barrier of entry so the casual player doesn't get their loot taken four times in a row and said, \"F this and I'm out of here.\" So they have to figure that out. So like you were already talking about that third map. Maybe that is more",
            "start": 1286.4
        },
        {
            "text": "doesn't get their loot taken four times in a row and said, \"F this and I'm out of here.\" So they have to figure that out. So like you were already talking about that third map. Maybe that is more in-game type of stuff, more raid level stuff that the hardcore can experience and then maybe the other two maps is built around, you know, making it more a more casual experience so people aren't getting frustrated with it. Again, I can only go back to to what I played a couple years ago and what what they've they've shown me in concept, but I mean, I don't think this is not going to be like Tarov. I don't think they're trying to go for that hardcore experience. I think sure there's going to be some intense moments in there and I think we've even seen that in some of the alpha footage they showed on on on Saturday, but I also think they wanted that, hey, if you just want to go in there, you're going to fight some of the PvE bosses. Sure, you might encounter some PvP experiences, but they you",
            "start": 1331.92
        },
        {
            "text": "on on on Saturday, but I also think they wanted that, hey, if you just want to go in there, you're going to fight some of the PvE bosses. Sure, you might encounter some PvP experiences, but they you have to have that carrot on the end of the stick of being able to extract and get loot. If you're going in there and because you're not a high-skilled player and you're constantly losing your loot, you're not going to play marathon. Bottom line. So, this is again where I think they need to show this off through this alpha over the summer. Talk about it. Show examples of this. Like, hey, here's some really hardcore experiences for the highest skill players, but here's some other instances for people that are brand new to an extraction hero shooter, and you know, here's how you can have fun and experience this game. and as you become more experienced and you you level up now, maybe you can take a chance and and go in some of these more high-end things. So, this is destiny. They've been doing",
            "start": 1374.4
        },
        {
            "text": "this game. and as you become more experienced and you you level up now, maybe you can take a chance and and go in some of these more high-end things. So, this is destiny. They've been doing that since 2014, right? That's been the the whole balance that they've always tried to figure out. And it seems like they're going to be doing it again with Marathon. You mentioning that Bungie is hoping for this to be their social, you know, they want this to be a social experience and I think Prox Chat lends so much to that. And I agree. I agree. I I I hope that they sort of, you know, allow players to at least have it off because there are without prox chat, you are only looking for PVE and I think if you want a social experience, you have to allow players to not have those PV uh or PVP moments rather. Yeah. Where there were definitely, you know, of course 90% of the people you run across on on prox chat are going to kill you and try to take your [ __ ] That's just the reality of it. That's the",
            "start": 1419.6
        },
        {
            "text": "Yeah. Where there were definitely, you know, of course 90% of the people you run across on on prox chat are going to kill you and try to take your [ __ ] That's just the reality of it. That's the way it works. Like we get that, but there are those, you know, those [ __ ] needles in the haystack that you come across somebody and they go, \"Don't kill me. Please, let's please take on this [ __ ] dude. I'm trying to finish this mission.\" And I've had that experience in the cycle where I was just playing solo at times because I legitimately enjoyed the cycle frontier and I that game's been shut down. Uh, I got think I got shut down last year, but there were several moments where I would hop in and have that prox chat moment, not knowing whether to trust this person or or this trio and suddenly we are playing together and then somebody else comes across us and now we're teammates and we're both fighting that other squad and you take them out. You're like, \"Oh [ __ ] that was sick. Hey,",
            "start": 1469.52
        },
        {
            "text": "we are playing together and then somebody else comes across us and now we're teammates and we're both fighting that other squad and you take them out. You're like, \"Oh [ __ ] that was sick. Hey, dude. I'm going to go extract. Good luck, bro. Hey, yeah, good luck to you, man.\" And maybe they come back and try to stab you in the back. Or maybe they don't. But I think if you are going for a social experience, it isn't a fully social experience if you're only looking for players to have PvP type experiences. If you're just expecting everybody to bump into each other and try to kill each other, then that's not fully social. Just say we want players to always be killing each other as opposed to we want players to experience a social moment, you know? So, I I'm I'm with you 100%. I think it is a mistake to not have proximity chat. And I'll go back to just when I was at Bungie playing. It was we weren't using proximity chat because we're all in kind of, you know, the same room. It was yelling",
            "start": 1509.44
        },
        {
            "text": "mistake to not have proximity chat. And I'll go back to just when I was at Bungie playing. It was we weren't using proximity chat because we're all in kind of, you know, the same room. It was yelling across the room at people when you had these encounters, right? And the fun that we had, the trash talk that you would you would do in those moments. To your point, I just think it should be an option. If my squad wants to go in with proximity chat on, we have the option to turn it on or off. and the and the teams that don't want it on, they can turn it off and go from there. Or maybe by default it's off and you have to manually go in and turn it on. Maybe that's the option that you go with so that teams that want to have that experience can have that experience and the ones that don't don't. I think I think it should be a choice, not just by default no one gets proximity chat because to your like you're already saying that's probably been the number one comment that I've seen all weekend",
            "start": 1553.68
        },
        {
            "text": "I think I think it should be a choice, not just by default no one gets proximity chat because to your like you're already saying that's probably been the number one comment that I've seen all weekend is the fact that that's not there. Street Shadow writes in with a super chat and says, \"Context on why no Prox Chat for now. Prox Chat brings a lot of legal/harassment laws across the world. This gets amplified with a company the size of Bungie/Sony and if the game is rated T4 have that little warning on there. I mean, is it T1 for teen? I don't think there's a uh label on that blue blood in there.\" Yeah, but it's blue, so it's safer. I mean, maybe, honestly, maybe less violent blood. Mike, I I was going to throw to you cuz again, going back to this weekend, we got the stream with the reveal, right? But then out of that, they broke out on the Marathon uh YouTube channel, four different videos. You got the Marathon gameplay reveal trailer, that's about 2 minutes long. You got the Marathon",
            "start": 1593.44
        },
        {
            "text": "right? But then out of that, they broke out on the Marathon uh YouTube channel, four different videos. You got the Marathon gameplay reveal trailer, that's about 2 minutes long. You got the Marathon gameplay overview trailer, which is about 5 minutes long, explaining the game. You got the Marathon creator alpha gameplay highlights, which features Dr. Lupo and some folks uh playing like a full match together. Um that was like cut between. And then you have the marathon reveal cinematic short which is almost like nine minutes long right of like a cool cinematic thing that was happening. Mike for you checking this stuff out right before before this episode. How does this hit for you as somebody who's I'll say into Bungie right from the sense of you know Bungie pioneer pioneered with Halo and all that stuff but also somebody who seemingly on the hasn't been sold all the way yet on Marathon and you're also planning a big Can we talk about the Tarov? Yeah. Me and Nick were going to looking",
            "start": 1644.24
        },
        {
            "text": "all that stuff but also somebody who seemingly on the hasn't been sold all the way yet on Marathon and you're also planning a big Can we talk about the Tarov? Yeah. Me and Nick were going to looking to get into Tarov just cuz we're always in the search of something. in there. You or Andy, somebody's got to be the third. And so, yeah. And also, you and I again, we played the cycle mic. We also um uh we did our little demo for Arc Raiders, which is another extraction shooter. We did Exoborn. We've kind of seen what a lot of these things have to offer. What do you think, Mike? Were some of the strengths and weaknesses from this? Yeah, for me over the weekend, I was not overly impressed with the rollout. I was expecting a little more uh E3 like showcase of maybe a narrating voice, maybe the team from Bungie kind of showcasing some of the points there, but I think at this moment in my life, I know what an extraction shooter is. I kind of know the P's and Q's of it. So, I don't really need",
            "start": 1679.28
        },
        {
            "text": "from Bungie kind of showcasing some of the points there, but I think at this moment in my life, I know what an extraction shooter is. I kind of know the P's and Q's of it. So, I don't really need somebody telling me what's going to go on. So, I liked the roll out of the creator highlights, having people like Dr. Lupo and others kind of share their thoughts and experiences on the game and how long they've been involved. Similar to Paris over the years seeing this grow, but the minute and 50 seconds gameplay reveal wasn't long enough for me. The fiveminute breakdown I think got a little bit more of like what I wanted. The 8 minute cinematic, as Andy brought up, was beautiful, stunning, very cool, a world that I definitely wanted to get lost in. And then knowing it was an extraction shooter, I was kind of more on the fence about it. Right now in my life, I'm not the biggest extraction shooter guy. I really love the dynamic that it plays with the PVEP. I love the push and pull of, hey, am",
            "start": 1723.28
        },
        {
            "text": "I was kind of more on the fence about it. Right now in my life, I'm not the biggest extraction shooter guy. I really love the dynamic that it plays with the PVEP. I love the push and pull of, hey, am I about to engage with another team? Is this a bunch of NPC bots? How do we play this? Where's the highv value loot that I got to go after? How do we make this run successful? I like the cycle of it all, but I do not love the endgame of after 10 runs and getting a bunch of duct tape and cigarettes. I don't know where to really go with any of this, right? And so I think a big battle for me is how Bungie will handle that of someone who is putting in those hours and still having a fun time that isn't just I'm here to troll kids and just get into PvP battles all the time, which is what I mainly do. Uh I'm also very excited for console players, right? I'm a kid who loves MMOs growing up. I loved World of Warcraft and I was excited in that Xbox One era when we started to roll out more MMOs onto",
            "start": 1767.44
        },
        {
            "text": "Uh I'm also very excited for console players, right? I'm a kid who loves MMOs growing up. I loved World of Warcraft and I was excited in that Xbox One era when we started to roll out more MMOs onto the console and right now it feels like Bungie is bringing an extraction shooter landscape that hasn't really been seen on console for kids to finally check out and play. And maybe this is, as many people have wrote in with their super chats, the Fortnite moment for extraction shooters, right? We have Street Shadow writes in and says, others have said it before, Marathon could be the Fortnite for Extraction. Taroff is the PUBG. Fortnite pulled the casual audience into a niche gen or niche genre at the time. I think open beta will be huge. And for me, that's where I think a big moment is is giving these console uh players an opportunity to play a top tier extraction shooter that they kind of just see come and go on PC all the time. I mean, I could see that happening if the game stayed free",
            "start": 1816.48
        },
        {
            "text": "these console uh players an opportunity to play a top tier extraction shooter that they kind of just see come and go on PC all the time. I mean, I could see that happening if the game stayed free to play, but without freeto play with expectations where they're at, it sucks. But it's the reality. There have there are millions of people around the world with with millions of parents around the world having an expectation that it's a tough economy. No, go play that free game you've been playing for the last three years that that's really the only thing you want to play anyway. Keep playing that freetoplay Fortnite game. I haven't spent a dollar on you as opposed to, you know, for the exception of maybe buying you some V-Bucks for Christmas gifts or whatever, but you know, trying to trying to make this their Fortnite moment for the the genre is a lot tougher if you're going to be charging for it and it sucks, but that's the reality. I mean, how about how about we talk about price cuz",
            "start": 1862.08
        },
        {
            "text": "to make this their Fortnite moment for the the genre is a lot tougher if you're going to be charging for it and it sucks, but that's the reality. I mean, how about how about we talk about price cuz that's where we're going to go with this. And we're going to bring in a super chat before we kick it to ads cuz CJ Splitzon says, \"I hate the freetoplay or bus mentality around multiplayer games.\" And we know that this is a premium title, not a full price title, which means you will have to pay for it. But we're going to talk about the price and should this be free to play or not, right after a word from our sponsors. This episode's brought to you by Imperial. We've told you all how important it is to developers to wishlist games you're interested in on Steam. So, if this game sounds cool to you, make sure that you wishlist it. In Imperial, you play as a mercenary sent to a distant planet to discover the mysteries of an ancient civilization. Powers unknown lie within the monolith, but those",
            "start": 1913.12
        },
        {
            "text": "make sure that you wishlist it. In Imperial, you play as a mercenary sent to a distant planet to discover the mysteries of an ancient civilization. Powers unknown lie within the monolith, but those are no mere ruins, as an expedition has already ventured inside with only a few survivors. Why was it built? What powers reside within? Who is at the center of the monolith? All these secrets and more will be uncovered if you are brave enough to take on Imperial. Imperial features a unique blend of RPG systems and skill-based combat across three weapon archetypes. The acrobatic glaive, the defensive but devastating mace and shields and the powerfully ranged cannon. With a deep ability system, extensive customization, every battle is an opportunity to refine and optimize your combat style. Form relationships with each of the few surviving expedition members who all have their own personal quest lines. Whether you choose to help or not can have drastic consequences for them. The monolith is",
            "start": 1953.92
        },
        {
            "text": "relationships with each of the few surviving expedition members who all have their own personal quest lines. Whether you choose to help or not can have drastic consequences for them. The monolith is guarded by powerful automatons, each with distinct attack patterns and weaknesses that demand precise execution and strategy to be victorious. Create your mercenary, enter the monolith, learn powerful abilities, defeat the automatons, and uncover the secrets that lie within Imperial. Imperial is available May 8th on PC, Xbox SNX, and PS5, but you can wishlist now. Do it. Wishlist Imperial. This episode is brought to you by Factor. Make this your best season yet with nutritious 2-minute meals from Factor. Eating well has never been this easy. Just heat up and enjoy, giving you more time to do what you want. Greg Miller has been loving how simple it is to enjoy his Factor meals as he's rushing between shows each day. I just saw Blessie eating some, too. Factor arrives fresh and fully",
            "start": 2004.32
        },
        {
            "text": "to do what you want. Greg Miller has been loving how simple it is to enjoy his Factor meals as he's rushing between shows each day. I just saw Blessie eating some, too. Factor arrives fresh and fully prepared. Perfect for any active, busy lifestyle. Factor powers your day with satisfying breakfast, onthe-go lunches, premium dinners, and guilt-free snacks and desserts. Factor can help you feel your best all day long with wholesome smoothies, breakfast, grab-and-go snacks, and more add-ons. Multiple people here at Kind of Funny have been loving their experience with Factor. And guess what? You can, too. Get started at factorymeals.com/kindfunny5050 off and use code kind offunny50 off to get 50% off plus free shipping on your first box. That's code kind offunny50 off at factormeals.com/kindafoney5050 off for 50% off plus free shipping. This episode's brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered",
            "start": 2052.24
        },
        {
            "text": "off for 50% off plus free shipping. This episode's brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized shades that won't break the bank. Shady Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people. They have hundreds of options to choose from, so you're bound to find the perfect pair to match your style. If you don't love your shades, exchange them for a new pair or simply return worry-free within 30 days. There's no risk when you shop. Their team are always there to have your back with personal and fast support. Y'all know I've been outside a lot playing Pokémon Go and it's such a great experience wearing Shady Rays when I'm out and about looking dope. Exclusively for you, Shady Raays is giving out their best deal. Head to shady.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated",
            "start": 2098.6
        },
        {
            "text": "out and about looking dope. Exclusively for you, Shady Raays is giving out their best deal. Head to shady.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. Again, go to shadyrays.com, use code funny to get 35% off polarized sunglasses. Welcome back, everyone. Let's talk about price because of course I kicked it to the ad from a super chat with CJ Splitzon who says, \"I hate the free-to-play or bust mentality around multiplayer.\" And of course, we have now gotten the reveal. We've had the conversation that this will be a premium title, not a full price title, and clearly not free to play. Bungie will give us more details by the summer. So, you never know. It could go left, it could go right, could be anywhere by the time September hits. But let's talk about freeto play versus the price tag of a premium title. Maybe not a full price title. Bless, but you guys, as we've had this conversation, everyone seems like",
            "start": 2145.2
        },
        {
            "text": "time September hits. But let's talk about freeto play versus the price tag of a premium title. Maybe not a full price title. Bless, but you guys, as we've had this conversation, everyone seems like they like the world. They love the look of this. The gunplay of Bungie is to be expected. Very high and dope, of course. But we're on the fence of extraction shooters. And even more on that, now we have to pay for this title. Blessing, let's start off with you. Where do we feel on the price? Uh to follow up on the super chat. I think for me, I agree. This is something I talked about when I was watching the thing and I was talking about it on my stream of I don't like the blanket this is how every single thing needs to work, right? I think games are every game is unique. I think different types of games have to be treated the way they are as far as like marketing strategy and all that stuff. I don't think this game and I for this game particular I got kind of varied opinions as far as like",
            "start": 2193.28
        },
        {
            "text": "of games have to be treated the way they are as far as like marketing strategy and all that stuff. I don't think this game and I for this game particular I got kind of varied opinions as far as like free to play not free to play yada yada but I think in general the only true thing I would say about across multiplayer games is that you just need a good release strategy and for a lot of games that is going to be free to play. I look at something like Concord and I'm like this probably would have benefited way more from free to play as opposed to coming out and being a $40 premium game. I look at something like Marathon and I could see the argument for free to play. I think this is something that if you are trying to be the Fortnite, if you are trying to be the most approachable, most accessible, biggest extraction shooter ever, um, you know, in terms of player base, reaching out all these reaching to all these different players, then yeah, you probably should be free to play. That said,",
            "start": 2235.28
        },
        {
            "text": "biggest extraction shooter ever, um, you know, in terms of player base, reaching out all these reaching to all these different players, then yeah, you probably should be free to play. That said, I'm on I'm on a wait and see as far as, okay, how much is it? Is there a PlayStation Plus plan? Is there an Xbox Game Pass? Is there like is there a release strategy around this that is going to justify or make sense for what it is? But I'm on the wait and see. I know Paris and Andy probably have deeper opinions on it. I I'm I'm of the same opinion. I think that uh again there's if you want this to be a larger release, if you want this to be a larger title and Bungie has correct me if I'm wrong, Paris, like is it 300 people working on this title? I'm not ex I'm not exactly sure, but it's a lot. I believe I heard that from I'm blanking on the name of the content creator. Maybe it was Skill Up. I think I heard the same thing. I also watch Ske and that's a lot of money, that's a lot of budget.",
            "start": 2270.32
        },
        {
            "text": "I believe I heard that from I'm blanking on the name of the content creator. Maybe it was Skill Up. I think I heard the same thing. I also watch Ske and that's a lot of money, that's a lot of budget. This game is not cheap to to make obviously. And um I think freeto play is one thing to talk about, but then it's also it's not only that Fortnite and War Zone and games like that succeed because of freeto play. It's you're also discounting the additional cost of needing the Xbox whatever or the PlayStation whatever to even play those premiumbric games online because you would still need that to play the game online as well. And that's an additional cost that a lot of people probably aren't paying for when their kids are playing Fortnite all the time. Um, when we talk about needing whatever version of Game Pass or whatever version of of PS+ uh is required to play a multiplayer game online and I I I'm with Blessing where I I feel like if anybody can do it, Bungie can, but don't get too",
            "start": 2314.64
        },
        {
            "text": "version of Game Pass or whatever version of of PS+ uh is required to play a multiplayer game online and I I I'm with Blessing where I I feel like if anybody can do it, Bungie can, but don't get too cocky because yeah, this could quickly become a game that has a dwindling player base and becomes it could quickly become a meme of damn dude, look at this highpriced game that's coming out and all of this massive budget. It's been in development for a long time and look at the state at where it's at. And I hate to be doom and gloom about it because I'm stoked about this title, but it's just kind of where your brain goes when you are talking about these things all the damn time about struggling player bases and and games that are only have 2,000 people playing or whatever. It's it's just where you naturally kind of go. Paris, where are you at with it? I think it's a mistake. I think it's a mistake to not have this freeto play. I think what both of you are talking about is great in concept,",
            "start": 2363.92
        },
        {
            "text": "you naturally kind of go. Paris, where are you at with it? I think it's a mistake. I think it's a mistake to not have this freeto play. I think what both of you are talking about is great in concept, but I think in practice, in this current gaming market, this current land landscape. I I agree with you. If anyone can do this, it would be Bungie because they have the reputation. They have the pedigree to be able to pull this off. Obviously, I know people bring in hell divers charging $40 and that worked. Obviously, Concord charging and again, we're just using $40 as an example. We don't know the exact price and and it failed. I always go back to my kids when it comes to this. What do you think they play? They play Fortnite. And my oldest daughter is absolutely obsessed with Marvel Rivals right now. Oh, free to play games. That makes sense. We already talked about this being an extraction shooter. This is something, especially for the console market, is going to be kind of a new",
            "start": 2418.96
        },
        {
            "text": "right now. Oh, free to play games. That makes sense. We already talked about this being an extraction shooter. This is something, especially for the console market, is going to be kind of a new concept. So, the way I've wrapped my head around this is, okay, again, let's just say it's $40, whatever the price is going to be, you're essentially paying for season one, the battle pass, whatever it is upfront. Excuse me. But how many people are going to look at that and go, \"Look, the Destiny people, the Bungie fans, we're in. We're buying it. We're we're playing it. We're not the audience that I'm talking about. I'm talking about the more casual audience that you're trying to attract to this game. do they see $40 price point and go, \"Well, I don't know. Do I really want to try this? I'm not sure. Maybe I'll just stick to Fortnite. Maybe I'll just stick to Marvel Rivals or Apex or whatever whatever the current multiplayer game is.\" I I get not everything needs to be free to play, but this",
            "start": 2464.16
        },
        {
            "text": "Maybe I'll just stick to Fortnite. Maybe I'll just stick to Marvel Rivals or Apex or whatever whatever the current multiplayer game is.\" I I get not everything needs to be free to play, but this this isn't Destiny where I can spend $40, $50 upfront and I have all this PvE content to play. I don't have to worry about PvP. For all intents and purposes, this is a PvP game. So, going all the way back to something you already talked about, Andy, what if I'm coming into this and I realize, man, I I just I I I I can never extract this. This is frustrating. I'm putting this down. I don't want to play it anymore. Now, the player count goes down. Now, these are people going to be less willing to want to go try it because they're hearing word of mouth, maybe this isn't for me. Whereas, if at least it was free to play, people would be more willing to at least try it. This is why I was saying before and what you said, Andy, with them charging an upfront price, I'm telling you, whatever this beta",
            "start": 2510.64
        },
        {
            "text": "it was free to play, people would be more willing to at least try it. This is why I was saying before and what you said, Andy, with them charging an upfront price, I'm telling you, whatever this beta is going to be, they got to nail it this summer. They need to nail it. You need to convince me that, man, I need more of this. I want to go play more of this. Here's my money. I'm all in. Because once you you've spent the 40 bucks, you're more than willing to invest your time to make sure that it was worth worth the price of admission. Whereas at least with freeto play, I I I'm I'm going to be more willing to want to just just go try it. Whereas $40, you're going to convince me to go try it is what I'm trying to say. So I personally think it's a mistake. I like I said even back then I pretty almost was pretty sure I was even saying freeto play probably made sense back then in 2023 when I was at the studio saying it. So obviously whatever decisions been made I mean now it's up to Bungie to",
            "start": 2559.76
        },
        {
            "text": "was pretty sure I was even saying freeto play probably made sense back then in 2023 when I was at the studio saying it. So obviously whatever decisions been made I mean now it's up to Bungie to convince everyone that it is worth the $40 price point or whatever the price is going to be upfront to want to go try out Marathon. Like I said I will play it. Andy, you'll play it. I'm sure Mike you'll try it. Blessing you'll try it. But we're not everyone, you know, and we're in a market where free-to-play multiplayer games dominates and they take up a lot of your time. And I know we've talked about this in the past. The biggest enemy of all these games is time. You only have so much time to play these games. So if if I'm already invested in Fortnite or Marvel Rivals, what are you doing that's so good that's going to get me to stop playing that game to go play your game? Oh, and you want to charge me $40 to go try it, too? They're going to have a lot of work to do. That's all I'm saying. We",
            "start": 2605.2
        },
        {
            "text": "good that's going to get me to stop playing that game to go play your game? Oh, and you want to charge me $40 to go try it, too? They're going to have a lot of work to do. That's all I'm saying. We would just be in such a different place in the industry if these gigantic freetoplay games still required people to pay the monthly Xbox games with gold, whatever the [ __ ] games such a long time ago, but PS or whatever. If if those freeto play games still required that entry price, I think the mentality surrounding everything would be in a completely different uh uh thought space and maybe these discussions don't even happen a whole lot anymore, but because they are free free like they are just free as [ __ ] Yeah, those games like I think I think it just we are trained now and the consumers are trained now to expect that from a multiplayer thing. And I think Paris brought up a great point. If I was paying a $40 price to experience this game that had a [ __ ] ton of also PvE content,",
            "start": 2652.16
        },
        {
            "text": "are trained now to expect that from a multiplayer thing. And I think Paris brought up a great point. If I was paying a $40 price to experience this game that had a [ __ ] ton of also PvE content, that's one thing where maybe, you know, yes, I I I love the thrill of the extraction and maybe I get killed or whatever, but I got that cool gun to go take on that big ass boss that is the ultimate whatever. But when the content that you are expected to produce is you the content is the other players making content for each other and having those thrilling moments. I think that can wear really thin for the people that um that that just go, \"Well, I'll just hop into another round of Marvel Rivals. I'll just hop into another round of Fortnite.\" And again, it's this is basically me saying, \"Well, make your game another game.\" Which is completely stupid, and I understand that, but that's just the reality of And I still get into the again the conversation of how much luxury do you have as far as",
            "start": 2702.48
        },
        {
            "text": "your game another game.\" Which is completely stupid, and I understand that, but that's just the reality of And I still get into the again the conversation of how much luxury do you have as far as the time that it takes for you to build a player base to maintain that player base to um you know fulfill your road map of things that you got going on cuz I think again when we're talking about a premium title of of this kind you're not going to launch with 10 million players you know what I mean and like I think for the the premium nature of it and the timing nature of it right like we're talking about it competing as as far as time with things like Fortnite with things like Call of Duty or or the other games that all the casual players are playing. You're also coming out as a premium title on the same day as Borderlands 4, which I think does have a lot of crossover obviously like at the core different video games, but you're talking about two premium titles that are going to be very grindy",
            "start": 2748.96
        },
        {
            "text": "same day as Borderlands 4, which I think does have a lot of crossover obviously like at the core different video games, but you're talking about two premium titles that are going to be very grindy that are first person that you're going to want to play with your friends and you're going to want to commit a lot of time to. I think when you're coming out as a premium title on the same day as something like a Borderlands 4, I think you really have to there has to be a conversation between Bungie and Sony as far as hey, this isn't going to sell gang bust gang busters and like do crazy numbers at launch because of the space that we're launching in, right? Like that is the fall, that is Borderlands, that is Call of Duty coming out probably a month or so later, right? Like and one of those titles is a a story-based game with Yeah. with, you know, bosses and NPCs and you will be progressing and keeping your weapons and obviously it's a completely different genre, but I think you're right that",
            "start": 2788.64
        },
        {
            "text": "is a a story-based game with Yeah. with, you know, bosses and NPCs and you will be progressing and keeping your weapons and obviously it's a completely different genre, but I think you're right that there is a bit of crossover there and a lot of people are going to go to the store and be like, \"All right, what is the maybe not go to the store, but a lot of people are going to be picking a game to play and going, all right, what is the game I want to spend all my time uh with right now?\" And Borderlands does have the name recognition. Borderlands does have the already built-in audience and I think a lot of I it's not a circle of a ven diagram, but I do think there is quite a bit of overlap in that in that ven diagram. Barrett, really quick, I just wanted to say I put this in chat. I think the mentality would be even worse if we were still paying for online access on PlayStation and Xbox. Like I can I can see the the YouTube comments if we lived in that alternate universe where people",
            "start": 2827.28
        },
        {
            "text": "the mentality would be even worse if we were still paying for online access on PlayStation and Xbox. Like I can I can see the the YouTube comments if we lived in that alternate universe where people are like, I'm already paying for online now I got to also pay for marathon. whereas like all these other services are three like I don't think there would be winning in either scenario honestly just to comment on what you were saying earlier Andy on um oh well I mean I don't I'm not even I wasn't even talking about in comparison to Marathon I'm just talking about play you know conditioning the normie parent who knows nothing about gaming who right now they are just conditioned to know my 12year-old 15year-old 16 year old son, I haven't spent a dime on these video games for him in like the last 3 years, except for the V-Bucks or the whatever cosmetics that I'm buying him whenever he wants his superhero to look like whatever. And I think if they were still if that they they were conditioned",
            "start": 2865.12
        },
        {
            "text": "3 years, except for the V-Bucks or the whatever cosmetics that I'm buying him whenever he wants his superhero to look like whatever. And I think if they were still if that they they were conditioned to pay monthly for something for their son to play online in the same way that they play that they watch Netflix monthly or that they watch HBO Max monthly. I think that's that puts them in a different mind space, but they've just had the the common American person has who's only playing these freeto play games has experienced freeto play for a long ass time and asking for a premium price is just that's too far in this economy especially for clarification. And to to my point though is like um there was a point where you had to pay for online to even be able to play Fortnite. Correct. Yeah. Yeah. Play specifically. Yeah. On PlayStation. And so like I think that mentality would like either be equal or even worse because it's like all right, I'm already paying for uh to to be able to play",
            "start": 2913.76
        },
        {
            "text": "Yeah. Play specifically. Yeah. On PlayStation. And so like I think that mentality would like either be equal or even worse because it's like all right, I'm already paying for uh to to be able to play Fortnite monthly essentially to add another price on top of that when games like Fortnite and others uh freeto play already building in that mentality a little bit. Um I I think there would just be just as much um kind of like scuttlebutt about paying for a a premium uh price. Anyways, sorry to distract guys. The the price is going to be a big one. It'll be a big conversation uh throughout until September. Bless. Yeah. Another one I wanted to bring into the conversation of of monetization and it it coming out as a premium game is one of the things I do wonder, let's say we went with the reality where Marathon is a free-to-play game, right? Which means you're going to have to find these ways to monetize. From what we see so far with Marathon, how and for you guys that have way more",
            "start": 2963.12
        },
        {
            "text": "reality where Marathon is a free-to-play game, right? Which means you're going to have to find these ways to monetize. From what we see so far with Marathon, how and for you guys that have way more experience with extraction shooters than I do, right? like what are the ways you monetize? Cuz I look at this and I'm like, well, you're not going to have a Luke Skywalker skin. I don't think you would have like these popular like Fortnite like crossover skins in this thing cuz it has a very distinct art style. Has more of a realistic slashspace punky vibe that you're you're going with here. I are we talking about battle pass? Like what would be the ways that you monetize outside of just the premium sale of the game? Yeah. I mean, I think a battle pass is kind of inevitable, right, Paris? Yeah. Yeah. They're they're they're going to have to do a battle pass and there would would just be cosmetics because again going back to when when we were talking with them at the studio that was the",
            "start": 3012.32
        },
        {
            "text": "Yeah. They're they're they're going to have to do a battle pass and there would would just be cosmetics because again going back to when when we were talking with them at the studio that was the number one thing. You cannot make this pay to win and they know that. So I don't think anyone needs to be concerned about that from a monetization standpoint. But yeah, some battle passes, some fun unique cosmetics would probably be the thing. Yeah, maybe I'm discounting the Luke Skywalker skin. I'm starting to think about You'd like to see that now? Well, now I'm thinking of other Star Wars skins you could do and like maybe you could do a Darth Vader marathon. launch at $40 or whatever the price may be. Do we not expect a storefront with skins for sale day one? To me, as the consumer, right, I think free to play, I think heavily monetized on me supporting the devs by all of that. If I give you $40, do we avoid that path and not do that day one or are we doing that no matter what in today's",
            "start": 3049.28
        },
        {
            "text": "think free to play, I think heavily monetized on me supporting the devs by all of that. If I give you $40, do we avoid that path and not do that day one or are we doing that no matter what in today's age? Well, I would think season one, no. But I think beyond that, you've now gotten your $40 worth of content, right? I I and that's how I'm wrapping my head around it. And maybe I'm wrong, but I would think the first season is basically you spending the $40 upfront. After that, then yeah, you're going to start seeing battle passes to where they're going to have to monetize it moving forward. That's dope. I hate it. Seems like here such a good discussion. They're actively ruining the content. We're having such a good discussion about marathon. You spent all on team GD doing a bit. Okay. First off, every 10 minutes I did a bit. Not all of it. That's all of it. That's very good. It's very common except it's like it's our show. Listen, with great power comes great responsibility. When you",
            "start": 3089.04
        },
        {
            "text": "off, every 10 minutes I did a bit. Not all of it. That's all of it. That's very good. It's very common except it's like it's our show. Listen, with great power comes great responsibility. When you gave me Stars in the Bank, you said, \"Greg, you've been screwed over too long. I know you'll make the content better with this case. I know that this is what Game Showdown needs. Of course, I'm wearing the most successful Game Showdown shirt of all time, everybody. Tim Getty's farewell, too. So many people have no idea what's going on right now. As everybody knows here, uh I have Stars in the Bank so I can get Tim's three stars. There you now. They know. I went to Chicago and I rocked the [ __ ] town to the goddamn ground. You did. Mike, a lot of people who came to your meet and greet, uh blessing, Mike, they came to mine. They said, \"Hey, how you doing? Thanks for that. Thanks for coming out. Thanks for supporting.\" I said, \"No problem. Bless.\" He gave me the case cuz he knew I'd go",
            "start": 3146.88
        },
        {
            "text": "blessing, Mike, they came to mine. They said, \"Hey, how you doing? Thanks for that. Thanks for coming out. Thanks for supporting.\" I said, \"No problem. Bless.\" He gave me the case cuz he knew I'd go support. I asked everybody to write hate mail for Tim. I was looking through organizing for my next attack on Tim. This one's to Tim from Noah. And Andy, it's for you. Oh, Tim. Why do you hate Andy? You cancel all the shows. You rig game showdown so he he does not win. That's [ __ ] up. You are a mean man, Mr. Gettys. I want you to lose. Noah. Well, thank you, Noah. Yeah. All right. Yeah, actually, I do agree with that. I'm glad you didn't win. Can we cash this thing in already? I'm glad you came in for that. Yeah, please just cash it in. He's torturing me. Just cash it in. We got a long summer ahead. Cash it in. It's going to be a long summer. Story's never over. It's been four months. It's been four months of this [ __ ] Let's talk some more. Uh, something I'm interested in is uh",
            "start": 3187.68
        },
        {
            "text": "summer ahead. Cash it in. It's going to be a long summer. Story's never over. It's been four months. It's been four months of this [ __ ] Let's talk some more. Uh, something I'm interested in is uh storytelling through a multiplayer game like this, right? You have an awesome 8 minute cinematic which is like, wow, this is rock your socks. Unbelievable. Yeah, but also I've been burned through multiplayer storytelling. I look at you in Halo Infinite when I wanted just so much more and I didn't get enough. How do they Well, Concord. Yeah. How do we nail this? How is this going to look? Will this just be data chips that I have to read in the middle of this? Will it be audio logs? What do you expect from this, Andy, with such a prestige team as Dest or uh Bungie? Well, they mentioned that they in a couple interviews them mentioning that they wanted every season to feel like a new adventure. I don't know if that means Well, first off, I think it's hard to do that when you don't have a hub",
            "start": 3226.64
        },
        {
            "text": "in a couple interviews them mentioning that they wanted every season to feel like a new adventure. I don't know if that means Well, first off, I think it's hard to do that when you don't have a hub world or people that you're talking to. if you're just the the the way the core kind of loop will work in this extraction game. It's not just you talking or it's just not you dropping into a world to try to go get loot where you know that this area might have higher tier loot but it's going to be more dangerous. The way that it works is uh in the menus you see your sort of different uh corporate bounties by different corporate in-game corporations. One of them is new caloric, one of them is called I don't know what the hell. So, you accept these bounties and they might want five [ __ ] data chips that you got to go get from whatever area, right? I think it's really hard to try to do story content without NPCs to look at, without cutscenes and things like that. And maybe there will be cut",
            "start": 3275.76
        },
        {
            "text": "that you got to go get from whatever area, right? I think it's really hard to try to do story content without NPCs to look at, without cutscenes and things like that. And maybe there will be cut scenes. Maybe there will be sort of, you know, in-game cinematics or even animatics if it's just like a 2D thing showing you dialogue with a person talking or whatever. But I think it's really I think it's going to be a hard task. And again, that's why I'm kind of it just everything that they've shown us so far reminds me so much of Destiny 1 where they want to include all these things, but you have to go online and read the grimoire, whatever the [ __ ] Like you you have to it's not accessible in the game. What what what were they called in Destiny 1 early on? The the lore in grams. No, the the grim the what the Grimmoire. Was it called the Grimmore? Okay. I was blanking on it. Yeah. Um it it it just gives me a lot of like we hope to like all the goals that you've heard right now. We hope to",
            "start": 3325.04
        },
        {
            "text": "the what the Grimmoire. Was it called the Grimmore? Okay. I was blanking on it. Yeah. Um it it it just gives me a lot of like we hope to like all the goals that you've heard right now. We hope to get there someday. That's kind of like what I was getting from uh a lot of their discussions where yeah we want you know yeah stories and adventures and you know there will be a persistent story just even nods to the old marathon game which I know nothing about the lore but I've heard it's fantastic. I I just don't know how you really achieve that without, you know, any sort of cut scenes or or a hub world to walk around and talk to that one NPC who goes on a little monologue about whatever. Like I it's it would be it seems like it's going to be a gargantuan task to try to make that stuff satisfying for the user. guys, as we start to ramp down the show and prepare for our final super chats, any final thoughts walking away from Marathon and the big reveal? Yeah, I mean for me I Oh, I'll say",
            "start": 3372.08
        },
        {
            "text": "for the user. guys, as we start to ramp down the show and prepare for our final super chats, any final thoughts walking away from Marathon and the big reveal? Yeah, I mean for me I Oh, I'll say real quick, right, for me watching the content over the weekend, right? Like I was I'm basically going to echo Andy's thoughts at the very top. I was pulled in by the visuals of it. I was pulled in by the moment to moment gameplay of it. I think the gunplay looks fun. It looks like a Bungie game, but the aesthetic of it, I think, is really enticing and looks really cool. And it's a game that, you know, we're talking about the Borderlands 4/Marathon release date. One of the things I was talking about yesterday during my stream was the fact that like you look across this office and there are so many people that are going to have to make a choice. Granted, there are people that probably fall on the side already, right? Greg's going to play Borderlands for most likely, right? Barrett probably going",
            "start": 3424.48
        },
        {
            "text": "that are going to have to make a choice. Granted, there are people that probably fall on the side already, right? Greg's going to play Borderlands for most likely, right? Barrett probably going to play Borderlands 4, right? Kevin, Joey probably Oh, yeah. Barrett doesn't know actually. Um, blessing. We gave up on three like halfway through the game. Yeah, but that's like, you know, 120 hours. You know what I mean? We played a lot of that game. I don't know if it was that long. This is a [ __ ] longass game for no reason. Um, but like you then keep going through the office, right? And I can see Nick getting into Marathon. I think us three are probably going to have to make a decision as far as all right, Monday, we're playing Marathon. Tuesday we're playing Borderlands. And there's a lot of love to be spread around as far as the amount of I think people that are going to be playing either or. Uh, but I bring that up to say that like at the very least for me personally, I'm looking at it",
            "start": 3468.08
        },
        {
            "text": "love to be spread around as far as the amount of I think people that are going to be playing either or. Uh, but I bring that up to say that like at the very least for me personally, I'm looking at it as I think I'm more likely to pick up more pick up Marathon, right? It's a game that is enticing. It's a game that looks interesting. It's a game I want to know more about and it's a game that I think is wanting to do something fresh and it's new frontier for uh uh for Bungie. And so I'm in. My biggest question is how are those betas going to hit? like is that going to be are are those betas going to come out and and convince people on what what this gameplay loop is and convince them on oh I got to shout out the the price at launch and oh I'm I'm here for the gameplay loop long term. Those are my biggest questions. But after seeing the stuff from this weekend, I'm into it. I like what I see. Okay. I'm super I'm super stoked and I think that if they can convince the general audience, the",
            "start": 3498.8
        },
        {
            "text": "my biggest questions. But after seeing the stuff from this weekend, I'm into it. I like what I see. Okay. I'm super I'm super stoked and I think that if they can convince the general audience, the more sort of normie audience and casual people who are hopping into these free betas that getting expensive loot and having that will should I bring it into the next run having that sort of tugof-war is, you know, can they convince people that that's enticing enough to have them kind of continuing these runs? That's the biggest challenge. But I I'm still in I've been a negative Nancy this whole time. I'm still going to play the [ __ ] out of this. I'm very excited about the gunplay, about the upgrade systems that I've heard a lot of con uh content creators talk about, and the world looks so freaking cool, and I'm stoked to see what the other maps look like. What about you, Paris? Yeah, I mean, I'll echo everything both of you said that I'm excited to play Marathon. I want to play Marathon. I",
            "start": 3539.36
        },
        {
            "text": "cool, and I'm stoked to see what the other maps look like. What about you, Paris? Yeah, I mean, I'll echo everything both of you said that I'm excited to play Marathon. I want to play Marathon. I will be there day one. Um, my concern, as we've already talked about, is the pricing. Let's, again, Bungie's going to need to convince people to want to spend that upfront. But even more so, it is, and if there's any company that's going to be able to do this, cuz they've been used to doing this for 10 years with Destiny, is the ongoing content. That's going to be the biggest challenge that I see for Marathon is I fully expect a fantastic season 1 coming from them. It's going to be after that. What are you giving me for season 2? Are you going to be able to keep up that cadence? Like Mike, you had alluded to Halo Infinite at one point. That was the downfall of Halo Infinite. They couldn't keep up with the demand for content and new modes and features and things like that. We know Bungie's",
            "start": 3586.8
        },
        {
            "text": "had alluded to Halo Infinite at one point. That was the downfall of Halo Infinite. They couldn't keep up with the demand for content and new modes and features and things like that. We know Bungie's going to listen to the community. So, as they get feedback, they'll they'll pivot as needed on things that the community is excited about, things that community isn't happy about. But that that's going to be the key to everything. The gunplay is going to be great. It's a Bungie game. You know, it's going to be fun as hell to play from a PvP standpoint. It's going to be intense. Just give me the loot. I like, like Biggie said, give me the loot. Give me the loot. I need cool loot to go chase to make me want to go on those runs and go back into that world and extract it. As long as they're able to keep that up, I think Marathon will be fine. Let's jump into uh some super chats to get us out of here. Uh Lance C writes in and says, \"Honestly, the gameplay doesn't remind me of the original",
            "start": 3630.4
        },
        {
            "text": "to keep that up, I think Marathon will be fine. Let's jump into uh some super chats to get us out of here. Uh Lance C writes in and says, \"Honestly, the gameplay doesn't remind me of the original announcement trailer. That looked way slicker. Not the Voxil look to it like it does now. Voxil. Yeah. I don't know on that one. I think there's a a little tad different look on the original one we saw a while back to what we're seeing now. I I get where you're coming from, but I like the look regardless. It looks good. Uh Sheffield Boulevard writes, \"Ooptimistic thinking. I hope Marathon is to tark off as Fortnite was to PUBG.\" We talked about that. Dean writes in and says, \"Looks like a captivating world to be vis to be in visually, but I have fears about how they'll be to how we'll be told the story or narrative. If it's all through menus, that's sad.\" We talked about that. How do you address telling the story through that? Couch Hero says there should be a highlighted extractions",
            "start": 3671.28
        },
        {
            "text": "told the story or narrative. If it's all through menus, that's sad.\" We talked about that. How do you address telling the story through that? Couch Hero says there should be a highlighted extractions throughout the season where you'll need to where you'll need good loot to be able to survive. Highlighted. Um, I mean, I don't know if they're talking about PvE or And I'm not I I part of me just wishes this was like hell divers, you know? I I wish I was just like taking on big bosses and risking my [ __ ] to just go full PV. The idea of risking of risking weapons and losing it to the computer is a lot easier for me to digest and losing it to other tryhard insane gamers that I think Creed uh in the Twitch chat made a great point talking about how that's why fighting games are such a niche market because people aren't willing to spend $60 to get their ass whooped by people that have been playing fighting games their whole lives. You know, I'll definitely be waiting for you at the",
            "start": 3715.92
        },
        {
            "text": "niche market because people aren't willing to spend $60 to get their ass whooped by people that have been playing fighting games their whole lives. You know, I'll definitely be waiting for you at the extraction site to loot your dead body. Yeah. Uh, Street Shadow says, \"Game uh games biz perspective for freeto play. This keeps us in the forever games. This hurts more developers and games than it helps. We We will just keep seeing games and devs laid off.\" How do we reconcile that? Let's see. That's kind of the double jinx reverse Uno card of this whole thing, right? We're already in this world of these forever games. And how do you wean people off of that and get it back to where it used to be? Because sure, a bungee can try this, but a firewalk tries it and they last 10 days and they completely go away. That's the scary risky part of about all of this is we we know that we we don't necessar because again I agree with everything that's been said. I don't need everything to be free",
            "start": 3766.24
        },
        {
            "text": "completely go away. That's the scary risky part of about all of this is we we know that we we don't necessar because again I agree with everything that's been said. I don't need everything to be free free to play, but how do you get back to the pre freetoplay world without these companies going under and people getting laid off? So, you know, there's a lot of risk with that. Like again, Marathon is a risk. Let's be crystal clear on that there. This is not a 100%, you know, surefire thing. There is risk that Bungie is taking with Marathon with with this format. So, we'll see if it works. Hope I hope it does. Let's be clear. I hope this works and then you'll see more people do the same thing. We need more space marine twos and we need more out rididers. I think that's I think that's what it is. We really do. We need more sort of truncated experiences that people go I'll spend 40 hours over here in this world with an endame in mind and something that I don't feel like I have to sort of,",
            "start": 3818.72
        },
        {
            "text": "is. We really do. We need more sort of truncated experiences that people go I'll spend 40 hours over here in this world with an endame in mind and something that I don't feel like I have to sort of, you know, take on this gigantic responsibility of continuing to play it and be there. You know, I I I just think that's why double A games and studios and double A budgets more importantly have been kind of killing it lately. Okay. And Dane writes in with a game recommendation for Bless. Bless, you got to try out Look Outside. It's such a unique survival horror RPG turn-based game that is a very captivating design and gameplay. 10 out of 10. The best indie game of the year for me so far. Dan, what if I told you I did try out Look Out. Damn. I was going to say that sounded familiar. Yeah, I wasn't feeling it. Okay, he wasn't feeling it. Well, thank you for the game, but it is a game that people should check out. Yeah, I it it's a very interesting game. Really freaky vibes. Um it was",
            "start": 3866.32
        },
        {
            "text": "I wasn't feeling it. Okay, he wasn't feeling it. Well, thank you for the game, but it is a game that people should check out. Yeah, I it it's a very interesting game. Really freaky vibes. Um it was surprise dropped by uh Deolver Digital uh published it, right? I got the email for the code like the day before they even announced the game, right? It was announced and dropped the same day. Um if you're into the things that Dane's talking about here, survival horror, GRPGs, it's a mix between the two and it it just has very freaky vibes. I didn't I didn't I I didn't like the vibes, but if you like freaky [ __ ] okay, there you go. We're also like I'm so blueprints pilled right now, man. Yeah. There's just too many. Oh, yeah. Hell yeah. I mean, how can you not be? You know what I mean? Blueprints. We played rematch over the weekend. I wanted to talk about rematch, but you took that away from me, Mike. Talk about video games happening. We've played a bunch and had so much fun. Well, we're",
            "start": 3916.48
        },
        {
            "text": "We played rematch over the weekend. I wanted to talk about rematch, but you took that away from me, Mike. Talk about video games happening. We've played a bunch and had so much fun. Well, we're going to talk about more games uh from this point and beyond, just like we always do here at Kind of Funny Games. This has been your marathon reveal impressions from the Kind of funny crew. Paris, Andy Bless, and myself. Of course, we want to hear from you in the comments down below. What do you think about the reveal of Marathon on a gameplay side, an extraction shooter with a premium price tag, not a full price tag? Let us know your thoughts down below. We have more kind of funny content coming your way all day long. We're going to have a special screencast all about The Last of Us season 2 premiere that just went on last night. And then after that, me and Andy are teaming up with Nvidia to play season two of Marvel Rivals. So, if you're watching live on YouTube and on Twitch, don't go",
            "start": 3956.4
        },
        {
            "text": "premiere that just went on last night. And then after that, me and Andy are teaming up with Nvidia to play season two of Marvel Rivals. So, if you're watching live on YouTube and on Twitch, don't go anywhere. Stay tuned and keep supporting and having some fun. If you're listening on podcast services around the globe, thank you for listening and watching. We'll catch you on the next one. Goodbye. [Music]",
            "start": 3998.8
        }
    ]
}