{
    "id": 13951,
    "video_id": "rNgbGYkN3fw",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Andy Cortez",
        "Joey Noelle",
        "Mike Howard"
    ],
    "title": "Greg Miller's Birthday Stream 2025!",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page - https://store.steampowered.com/app/1377700/Empyreal/ \nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1745627566,
    "duration": 16343,
    "transcript_chunks": [
        {
            "text": "two. Yo, what the heck is going on kind of funny best friends? It's your guy Snow Bike Mike and the Kind of funny crew back again for another kind of funny games afternoon stream. And it's Friday, y'all. Joey, it's Friday. It's Friday. Got to get down on Friday. Now, did I think that Thursday was Friday yesterday as I walked out the office? Definitely. Everyone was like, \"We're going to see you tomorrow. What are you talking?\" What a little treat for you, Mike. As somebody who hates the weekend more than anybody, not coming into this office, being able to realize you had one more day here. I'll tell you what, Greg, this was the most confident I had ever walked out of work not feeling down or having the blues. I looked at everybody's like, \"See y'all later. Don't want to see you.\" And uh Roger was like, \"We work tomorrow.\" And it was even better because 5 minutes before you said that, you and I were prepping the lab for today's stream. Forgot it. Blacked out. blacked out everything. But",
            "start": 10.92
        },
        {
            "text": "was like, \"We work tomorrow.\" And it was even better because 5 minutes before you said that, you and I were prepping the lab for today's stream. Forgot it. Blacked out. blacked out everything. But today is Friday and it's a special day. Joey Barrett and kind of funny best friends all around because what? It's Greg Miller's birthday and we're celebrating all things Greg today by having a stream about him. And Greg, uh, we'll all say happy birthday to you, Big Doug. Thank you so much, guys. Thanks for coming out. Thanks for agreeing to play Monster Hunter. Of course. Of course. We're going to play Monster Hunter all afternoon. We're going to celebrate Greg with your kind messages, your Twitch subs, your YouTube super chats, and you just being here playing games with Greg. It's his favorite game of the year right now. This is his obsession. And we said, \"Let's play some more of it.\" And of course, Greg, a birthday wouldn't be complete without presents. You know the rule, Joey, always",
            "start": 46.16
        },
        {
            "text": "game of the year right now. This is his obsession. And we said, \"Let's play some more of it.\" And of course, Greg, a birthday wouldn't be complete without presents. You know the rule, Joey, always bring presents when it's the birthday. So, I got present number one. Joey, pass that down to Greg. Of course, Greg, here I was preparing. What do you get a man that has it all for his birthday? Oh, I got you a Monster Hunter plucky. And guess what? It's reversible. I was going to say there's stuff inside. Look at that. Oh, Mikey, you know, you crushed it. It's on brand. I didn't expect this. We have a Monster Hunter themed birthday. Uh, a man who has everything. A family, a loving wife, every toy in the world. You now switch to dads have to get gifts that they can give their children. So these are no this is staying on my bed. A gift that we can think about. I brought home the you know the cut coo the coo cut the little guy from the collector's edition. Ben thought it was horrific. He didn't",
            "start": 91.52
        },
        {
            "text": "no this is staying on my bed. A gift that we can think about. I brought home the you know the cut coo the coo cut the little guy from the collector's edition. Ben thought it was horrific. He didn't like it. No way. Really? He's lost his ability to get my Monster Hunter goodies. I get my Monster Hunter. Okay. Well, we got present number one. And we also have Krabby Patty with the five gifted subs. Minivan saying happy birthday. Filipino Mamba doing the dance. Alex is saying happy birthday over in the YouTube chat. I have 26 hours in this video game. That is a lot. Wow, that's a lot of monster hunting with all of you and I'm ready to add some more. So, let's go have some fun. I have 79. 79, Greg. Wow, that's a lot. That's a lot, Greg. Good stuff. I'm out there doing it. All right, so a lot's changed since you guys last played honest, bro. What's We now of course have the Grand Basin or the the Grand Hub, I'm sorry. uh which uh is the now decked out for uh springtime for the blossom",
            "start": 139.52
        },
        {
            "text": "lot's changed since you guys last played honest, bro. What's We now of course have the Grand Basin or the the Grand Hub, I'm sorry. uh which uh is the now decked out for uh springtime for the blossom festival. So there is a blossom festival going on. You can look in here everybody. You're on my screen, right? Yeah. The Grand Hub of course got introduced first all the gather to drink, but now it's all decked out in basically Eastery kind of things for this Blossom Festival. You'll be getting Blossom tickets to unlock stuff, but we have to get you all to unlock uh the Grand Hub. Okay. So, what I need all of you to do on your own times, it looks like Joey's already in a mission, which I love. Which I love. Joey, I'll come join you. I'll come and leave. I just started it cuz we I was I had nothing else. We were waiting. Well, I mean, we could do it though. Uh anyways, you want to go uh when you have the chance to hear world map. All right. So, on a touchpad for a normal person, God only",
            "start": 185.36
        },
        {
            "text": "else. We were waiting. Well, I mean, we could do it though. Uh anyways, you want to go uh when you have the chance to hear world map. All right. So, on a touchpad for a normal person, God only knows with a key with a mic over there with a mousey keyboard. Uh and then you're going to want to go to Suja Peaks of Accord. Uh you should have a guy there that wants to talk to you and that'll get you to open up the old Grand Hub for you. So you can have that. So you can go in there so they can introduce the Blossom Festival and you can be earning the right things on your dailies. Sorry. Now it's going to make me do this next step and then I'm going to do all of that. It's fine. I'm going to go enjoy Diva's performance while you do this. I'm very excited. I almost jumped into this last night, but I was like, we're going to do this, I assume, all today. So then I promptly turned off my PS5 and I was kind of sad about it cuz I wanted to get back into it, but I didn't. See, I made sure I was in",
            "start": 226.24
        },
        {
            "text": "I was like, we're going to do this, I assume, all today. So then I promptly turned off my PS5 and I was kind of sad about it cuz I wanted to get back into it, but I didn't. See, I made sure I was in there trying to look my best. I'm wearing the Blossom Festival outfit. I've decked it out in the black and white like I like so I look fancy. I got my glasses. At some point, Andy might come in and try to redo my face. Oh. Oh, really? In the live chat, uh, Krabby Patty says, \"Y'all got more room in the kind of funny squad. I never got in.\" You know what? That's a great point. While we wait for people here, I will go in there and manage the old squad. Uh, give give some people the old boot. Maybe get on Get on that. cuz yeah, let's see. Oh man, Kevin, we're going to Kevin's ever gonna come back. It's when he when he comes back, we can kick somebody else out. I love that. He's going to get blessed. It's fine. Okay, I'm going to suja the peaks of Accord. Mike's under the desk. Yeah, I had to",
            "start": 263.92
        },
        {
            "text": "It's when he when he comes back, we can kick somebody else out. I love that. He's going to get blessed. It's fine. Okay, I'm going to suja the peaks of Accord. Mike's under the desk. Yeah, I had to restart mine. My, you know, PC problems over here. Of course, they were redoing my shaders. Then I came on, turned on the game, and it looked like absolute dookie. So I had to restart. I see people sending me uh friend requests. Don't bother. I've turned that off. The easiest way would be to join me on the other thing. Maybe, you know, maybe when we get to a certain point or whatever. We'll get back to that. Also want to check my bounties, won't I? Um I want to Okay, see you later. Here info. [Music] Lot of happy birthdays to Greg. Thank you. It's Bro Dad says, \"Happy birthday, Greg with my Prime Gaming sub.\" Uh, Cam Shaft989 with the $3 super chat that just says, \"Fist bump me daddy.\" Uh, frog nights says, \"Happy birthday, Greg. Get some hunting done.\" And over on the YouTube to celebrate",
            "start": 312.0
        },
        {
            "text": "Gaming sub.\" Uh, Cam Shaft989 with the $3 super chat that just says, \"Fist bump me daddy.\" Uh, frog nights says, \"Happy birthday, Greg. Get some hunting done.\" And over on the YouTube to celebrate you. Justin writes in and says, \"Greg, super excited to announce my new job will give me Fridays off starting in July. I can play alongside five.\" That's like five their time streams, I think, is what that says. Yeah. Yeah. Chris Hank with 10 gifted subs to celebrate Greg Miller. Thank you, Chris. Can't believe this pig just headbutted me. I love this game. I didn't know that was a thing. Okay, the Grand Hub is now open. Yay, Joey. You'll like the colors. You'll like all the stuff you can get in the Grand Hub. Who' you talk to there, Joe? Where was he? Uh oh. Up the hill. Yeah. Yeah. Yeah. Okay. Oh, yours looks so different. My world. Yeah. Like yours is way more like green. Okay. Oh man, there's a giant man here. I'm booting, too. I don't think Andy's ever coming back. I think you I agree.",
            "start": 388.72
        },
        {
            "text": "Oh, yours looks so different. My world. Yeah. Like yours is way more like green. Okay. Oh man, there's a giant man here. I'm booting, too. I don't think Andy's ever coming back. I think you I agree. Then we get into it here. You start looking around like how do I That's what I need to [Music] do. And then you got to start looking around. Who's Who's Who else isn't coming back? Walrus. Walrus. Where are you? 67. Last login a month ago. You're gone. You're out. We're at the point where, you know, I need more from you on that one. Ash 93 last login. It's gone now, but a zero days ago. That's what I'm looking for. That's the kind of commitment we need. Zero days ago. When you get to the more than a month ago, Brenda is what I got to say. I don't know about that. And you might say, \"Ma'am, this is harsh. This is how it's got to be.\" All right. We got a giant group here. We need people who are hunting. All right. Feel free to send in your in your your in your your invitations. If you can't",
            "start": 449.2
        },
        {
            "text": "is harsh. This is how it's got to be.\" All right. We got a giant group here. We need people who are hunting. All right. Feel free to send in your in your your in your your invitations. If you can't handle it, don't be team captain. You know, gota make this is the pressure. This is the pressure that sits upon my head today. Greg Miller's got to make that. See, I see a lot of people a week ago, more than a month ago, but he's 116. But again, I can't I can't do it. Laying out the options. You got to do it. You got to do it. The frog knight. I'm in the KF squad every day. That's I know you're frog. I see you right here and here playing with us. Oh, I do love this. Just look at all these pretty cherry blossom trees. [Music] I would like to live here. Can I move my home? This is where I work out of permanently now. Oh, so like I come back here after everything. So you can just come back. It's got everything you need. And barrel bowling if you want to try that. I don't Is that It's like",
            "start": 516.48
        },
        {
            "text": "out of permanently now. Oh, so like I come back here after everything. So you can just come back. It's got everything you need. And barrel bowling if you want to try that. I don't Is that It's like bowling with giant barrels, too. I'm just making sure. That's kind of dope. All right. All right. So, I have some spots open there in the in the guild if you want to try to jump in. Everybody, as you can see, uh 4 F9 CD5KM, do not message me a friend request. I've stopped accepting them, but I appreciate you. And like, thank you. Is that because you're maxed out? It's more because I have enough IRL friends that are playing where I'm just like, \"Oh, okay. Let's just keep it to And like everybody's got the different names, you know? We're all being so cute with our names. Me, too. So, it's like it's a pain in the butt. I for the life of me could not tell you which person my friend required. Welcome aboard. Monster Hunter list is Anthony Carboni. Avantra, welcome aboard. We talked about",
            "start": 562.24
        },
        {
            "text": "like it's a pain in the butt. I for the life of me could not tell you which person my friend required. Welcome aboard. Monster Hunter list is Anthony Carboni. Avantra, welcome aboard. We talked about playing, but the game showdown finale is next week. Correct. I when I will win it all. Blessing in Japan. Momentarily I'd be like, did he post about that? I think people should put it together. I think we've talked. We do enough stuff on delay though, I guess, that I can understand. Hot Link, welcome aboard. Trin, welcome aboard. Okay, so Joe, I'm in here. Good job. Uh, hanging out. Good job. You're talking to those guys. I like that. We should You should eat. We should all eat. Mike's not here, but I just got a If you turn around, basically, right behind you, there's a place to go eat. That table right there, you can go eat there. Have a meal. Yeah. Yeah. A real package. Yeah, a package. I'm sitting next to you, by the way, Joe, because we are in the same world, which is nice. Oh, hell",
            "start": 598.88
        },
        {
            "text": "table right there, you can go eat there. Have a meal. Yeah. Yeah. A real package. Yeah, a package. I'm sitting next to you, by the way, Joe, because we are in the same world, which is nice. Oh, hell yeah. I want this fun sushi meal. I'm doing that as well if you're watching my screen. I'm going to go check out the package. You You might want to. Yeah, I think it's going to be something cool. Thank you to a fire outside celebrating Greg's birthday with three stars. Do you think Tim is finally getting his revenge with this package? No. No. I think this is a this is like a nice package where you're going to say like, \"Oh, damn. I wish I got that package. You and I, Joe. Send me stuff. Mike loves stuff. Mike loves stuff. Send me your stuff. You're just ready at any moment to pull anything out of your car. Uhhuh. At any time. Um, okay. I'm going to go over here. Did you make it into the fun place? I am here. currently. Am I supposed to be talking to people? Um I Greg and I just ate at the",
            "start": 652.08
        },
        {
            "text": "of your car. Uhhuh. At any time. Um, okay. I'm going to go over here. Did you make it into the fun place? I am here. currently. Am I supposed to be talking to people? Um I Greg and I just ate at the big table with the colorful lantern. I saw you needed like a ticket to do that. Yeah, I got it from someone. So if you talk to the people, you'll get it. Okay. Um but I would like I need to go look at some of my crafting stuff. Probably see if I can get anything fun. Even though at this point I guess it's kind of hard because I just really like the way that my armor Yeah. looks. So I don't really want to build anything new. I guess I can just keep overgrading it or whatever it's called. Keep leveling it up. Yeah, we got lots of stuff to do here. Don't worry about that. Okay. I got all sorts of stuff for y'all to get out there and do. You got a lot of good events happening, too. Okay. Dope. Dope. Love that. See, the thing that I like I haven't unlocked the like upgrade material for. Okay,",
            "start": 706.4
        },
        {
            "text": "stuff for y'all to get out there and do. You got a lot of good events happening, too. Okay. Dope. Dope. Love that. See, the thing that I like I haven't unlocked the like upgrade material for. Okay, so the package I got is an exciting one. It is a backpack that I asked for from Waterfield Designs. Remember SFbags.com? You heard me talk about the other day over there on Games Daily, right? Or Gamescast about the Switch 2 cases. However, they had sent a press release last week about the Techfolio tank backpack and I said, \"This is exactly what I need because I'm using a nice just I I was using a Waterfield bag for a long time. I tore it. It was on me.\" Then I have been using this Hershel bag. Don't love it. It's just a backpack. I don't love my Hershel backpack. There's no nowhere to put my water bottle on the outside or inside. Not enough pockets. So, they sent this through and this is the official press release, okay, which got me excited to get it and I'm going to do like a review",
            "start": 763.92
        },
        {
            "text": "my water bottle on the outside or inside. Not enough pockets. So, they sent this through and this is the official press release, okay, which got me excited to get it and I'm going to do like a review when I go to packs with it. But designed for serious gamers, power users, and creative professionals who carry extensive equipment and large laptops in professional settings. The tank addresses a significant gap in the market for quality bags that can fit an 18-inch laptop in bulky peripheral gear while maintaining the same sophisticated uh aesthetic and meticulous organization that has made the original Techfolio backpack a customer favorite. You got dual padded compartments for laptops, right? A full length compartment for pockets. Spacious main compartment for uh controllers, portable monitors, keyboards, headsets, even overnight accessories because I love the idea of eliminating, you know, stuff on short trips. A hidden air tag pocket to track this. Firm foam in the back. Uh padded",
            "start": 815.44
        },
        {
            "text": "keyboards, headsets, even overnight accessories because I love the idea of eliminating, you know, stuff on short trips. A hidden air tag pocket to track this. Firm foam in the back. Uh padded straps. Uh a wheel a wheeled suitcase pass through adds convenience. Like it's a nice backpack. It also looks super nice. I'm looking at it on the website right now. Right. Right. Yeah. Yeah. If you can show that to them. But you got your pouch up there. Like I don't I just don't have enough pouches and I need my pouches. Joe, I love a good pouch. Look at that. Look at that. Look how As a gamer, look how gorgeous that looks because my thought was the Pax East trip, right? I'm gonna bring uh the Rock Ally and I want nice heads nice headphones for that, right? And then I was talking to Razer. They got that new 16 inch blade and I was like, \"Send me one of those like maybe we can send you a review.\" And I was like, \"Send me one to keep or I'll kill you.\" No. Um but I was like, \"Then I can put them",
            "start": 853.44
        },
        {
            "text": "that new 16 inch blade and I was like, \"Send me one of those like maybe we can send you a review.\" And I was like, \"Send me one to keep or I'll kill you.\" No. Um but I was like, \"Then I can put them both in here.\" And I got my pouches in there that I've missed so bad cuz this Hersel has no freaking pouches. It drives me crazy. Do you have outside pouches that you then have to put in your backpack? Like do you have a collection of in not attached to a backpack pouch for organization? No, I just You mean like right now what am I doing? Yeah. No, I'm just tossing things in there. I hate it. And I got cuz I have like a one for all of my like tech and cords that I like. I'm just such a big guy that the little Hershel bag doesn't have enough stuff for my stuff. Yeah. So this one in here, I get a water bottle in there. Look how spacious it is to put in there with the water bottle on the inside and this I'm excited to try this out. Look at this. That's exciting. What color? I got black. You",
            "start": 891.28
        },
        {
            "text": "a water bottle in there. Look how spacious it is to put in there with the water bottle on the inside and this I'm excited to try this out. Look at this. That's exciting. What color? I got black. You got the black leather. Yeah, black leather is very nice. They also have chocolate leather, grizzly leather. Okay, you guys ready to go now? Joey, have you looked through great? Cuz we're going to want to go through uh PC. What a great place to play. What the [ __ ] I love what you're doing. I need armor uh spheres, too. So, I figured we could do I'll knock out a bunch of those together cuz the dailies have a whole bunch on them. But I think I when you're out of here, Joe, no rush. I want you to look through and I forget if we got to go unlock the seasonal costumes for you or if they're already there for you. Oh, interesting. Cuz I want you're going to be getting these blossom tickets. I want to make sure you're working on the right thing. Thank you. I appreciate that, Greg. Mr. Hawk says,",
            "start": 928.64
        },
        {
            "text": "there for you. Oh, interesting. Cuz I want you're going to be getting these blossom tickets. I want to make sure you're working on the right thing. Thank you. I appreciate that, Greg. Mr. Hawk says, \"Is Greg wearing a Starfield jacket?\" He is. It's always so goddamn cold in this room. It is. I walked in while the boys were doing redacted and I was like, I got to I got to put on a sweatshirt. I can't Yeah, I can't do this. Okay. So, go to forge, upgrade your armor. No, no, don't leave. Don't leave. Don't leave. So, talk to them. Yeah. I don't like this new guy personally. I don't like this guy working with Gemma. I like her. Uh, so got No, not yet. There you go. And then you give me an R3 on that one. Oh, and then hit R1, too. Yeah. Rarity is what I want you to sort by. And then R1 over to high rank. There you go. And then go to the very bottom. It might be easier. I didn't even know that any of these existed. Yeah, this is what you should be getting and upgrading and working on now",
            "start": 970.08
        },
        {
            "text": "to high rank. There you go. And then go to the very bottom. It might be easier. I didn't even know that any of these existed. Yeah, this is what you should be getting and upgrading and working on now cuz this is way But I like mine. so much. I'm not going to But if you look at the top, I mean, you get to go after the arcs again. So, you have things and I'm sure that there's a fluffy one that will be So, does you go all the way down? I guess I could be doing this on my screen so people see it, too. All right, hold on. Slow down here. I think we might have to They might give you one of them. The soccer attack. Yeah. Yeah. Okay, there it is. But there's that. So, that's one of the blossom out things. Cool. But there is a whole different blossom set to get to. Yeah, that's the only one I have. Okay, cool. Well, once we do the first event mission, you'll be all set on that one. Let me talk to anybody. Is there anything I want to like mix and match here? Not I hate that there's more armor.",
            "start": 1004.48
        },
        {
            "text": "Okay, cool. Well, once we do the first event mission, you'll be all set on that one. Let me talk to anybody. Is there anything I want to like mix and match here? Not I hate that there's more armor. I was so committed to I was so committed. Oh, this one's fun. I just like my fluffy feathers so much. Oh, why is my [ __ ] so bright? Oh, right. It wouldn't tell me because I'm already That's what I had before. Granite skulls. There it is. Daughters of Katabos. This one's fun, too, though. So many choices. Well, again, I think you should see the set of uh the blossom armor, too, for you. Yeah. So, let me know when you're set. Oh, yeah. I was just [ __ ] around. I'm going to toss I'm going to toss up a quest then for you. Okay. Questy. Justin says, \"Happy birthday, Greg. Hope you have an incredible day, you beautiful man.\" I will. Thank you so much. Nick says, \"Happy birthday, G. Can't believe Alphacino is lucky enough to share a birthday.\" Woo! Whoa. Oh, you might have been in the Godfather",
            "start": 1048.4
        },
        {
            "text": "day, you beautiful man.\" I will. Thank you so much. Nick says, \"Happy birthday, G. Can't believe Alphacino is lucky enough to share a birthday.\" Woo! Whoa. Oh, you might have been in the Godfather have stars in the bank. I do, and that's worth more than any appearance Alpuccino could make. We haven't talked about this, but the other day you slacked us after work and you were like, \"Man, I didn't really get a chance to talk to you guys that often. I just want to remind you that I have the stars in the bank.\" It made me laugh cuz I was like, \"Oh, Greg's about to like write one of his like heartfelt messages.\" Just ask. It was not not even a little bit. That was one of those I was chuckling to myself when I thought about writing it and then when nobody immediately responded and I just kept doubling down and talking to myself about it. Okay, we got to find this. This is an easy arena one. Just two of these guys. I separated them for the moment. Not that it would be hard if they were all",
            "start": 1122.96
        },
        {
            "text": "doubling down and talking to myself about it. Okay, we got to find this. This is an easy arena one. Just two of these guys. I separated them for the moment. Not that it would be hard if they were all together. You got Hot Link here, a brand new kind of funny guild member. Whoa. You got Mike over there talking about his GPUs not working with his CPU. Oh my god, the game crashed. I got to restart the hub. Just hacking away at this. Do you have birthday plans this weekend, Greg? The plan is to go to the Giants game on Sunday. Oh, but I have heard the weather. Jen said it's going to rain, so I don't know. But she said that I I don't know where we are in terms of what's happening at Oracle Park or yada yada yada. But yeah, that is the loose plan. We'll see if it actually happens. Let's get the weather check right now. Dailies, get a weather check. What's happening at Oracle? 57 and cloudy today. Saturday the 26th will be 58 and partly cloudy. And then Sunday will be 56 and cloudy with a",
            "start": 1166.88
        },
        {
            "text": "weather check right now. Dailies, get a weather check. What's happening at Oracle? 57 and cloudy today. Saturday the 26th will be 58 and partly cloudy. And then Sunday will be 56 and cloudy with a 19% chance of rain. Winds at the west northwest of 10 to 20 mph. So, pack a jacket. Okay. Okay, AT&T. I feel like we are so lucky to have such a beautiful, perfect golf ball right there on the water. Gorgeous. Even though it's always so freaking dark. Save for the six day games a year. It's so funny. I feel like I used to go to baseball games all the time when I didn't live here. Yeah, I would come back for him and then I never really go anymore cuz I'm like I got to go downtown. So much harder. I don't do that. Before it's like a fun trip and exciting and now I'm just like traffic. It's crazy to me like you know whatever and not that I'm going a lot now I guess but like when we worked there at IGM we never went. Oh that's we never went. Nobody ever was like we should go catch a ball game.",
            "start": 1224.24
        },
        {
            "text": "to me like you know whatever and not that I'm going a lot now I guess but like when we worked there at IGM we never went. Oh that's we never went. Nobody ever was like we should go catch a ball game. That's just not who we were. Especially like it's 6:30 we're leaving the office. Let's go have a beer if they fall apart. Is this Ben's first baseball game? No, no, no. He went last year with me, Auntie Loose, and Jen. Oh, he got the whole certificate and all the photos. So cute. He is now though obsessed with baseball. Mike, we are very much big deal. Like you and me are going to have to be huge little league coaches here cuz like I got out, dude. We went to Chicago and Po's son Jack gave Ben his first glove. And I and what I mean is that Jack gave Ben Jack's kid glove. He was small, which turns out was Po's kid the glove. So it's got crazy, but it's still a little too big. But we were making it work. And so we went to Target, bought him a glove. I had to buy my own glove cuz I've been",
            "start": 1283.28
        },
        {
            "text": "turns out was Po's kid the glove. So it's got crazy, but it's still a little too big. But we were making it work. And so we went to Target, bought him a glove. I had to buy my own glove cuz I've been using a glove. Ken's had a glove forever. Then I had to buy one obviously. And so like now we went out, we're throwing the ball. I came back to talk to Jen about it. I'm like, I can't believe how much [ __ ] fun this is. like it's like such have something. It's such a you know cliche. I don't even mean like the dad's son part that's obviously very touching and amazing to see him pick it up and yada yada but I mean just in general like throwing the ball and using a baseball glove this is [ __ ] fun. Like I don't know why I never tried this. I thought you know I mean I did T-ball obviously not the same so whatever but like we were having such a great time out there. It's incredible how good he is using a baseball glove. You feel like you got superpowers. I'm catching balls. I'd never be",
            "start": 1335.6
        },
        {
            "text": "the same so whatever but like we were having such a great time out there. It's incredible how good he is using a baseball glove. You feel like you got superpowers. I'm catching balls. I'd never be afraid. And I'm like, no wonder people aren't afraid of when balls come out of train on this for a couple years. Then you get something coming. Big deal. You don't care about it. So I'm we're bringing the gloves on Sunday if everything holds up. You got to bring the gloves every baseball game. You never know. Even if we're on the third deck, my dad will got to be prepared. Never know when one's going to come sailing your ball might be coming right at you. You better catch it. That was always the role. My dad brought his glove and then I brought the score book because I thought really fun to learn how to score baseball game with like all the hell position numbers and all the different ways that they score it. Now people just plug in the Google don't know what's going on. The art of the game.",
            "start": 1374.88
        },
        {
            "text": "how to score baseball game with like all the hell position numbers and all the different ways that they score it. Now people just plug in the Google don't know what's going on. The art of the game. Come on. In terms of Ben and sports, is there like a hierarchy? Cuz I know he's also playing soccer. Dance is also an activity he's involved in. Dances today, too. He's very excited. Is there a hierarchy that No, it's We haven't had it get in a position where you have to choose. So, like he loves basketball as well. So, he just loves everything he can get his hands on. I do think baseball will win out. I feel like that's the one he asked me to do the most in terms of it used to be just going out and throwing the ball and having him hit and now it's going out to catch. So, I feel like that's succeeding. But yesterday, like he did express uh he's very tired, very cranky, had a napped and we were going to go outside and play in the park and he was like I was like, \"All right, I'll get the",
            "start": 1413.84
        },
        {
            "text": "succeeding. But yesterday, like he did express uh he's very tired, very cranky, had a napped and we were going to go outside and play in the park and he was like I was like, \"All right, I'll get the gloves.\" And like then, you know, it just takes one second for everything to change. And so when I walked in the room with the gloves we had agreed on, he was like, \"No, I want to kick the rainbow ball.\" Like, \"Give me a set glove.\" He's like, \"Oh, but it's hard to catch.\" I'm like, \"Well, you're really tired right now.\" But yes, kicking the ball is easier for them. I relate so highly to the like, \"I'm just going to whine because none of these things sound like what I actually want to do.\" Like, I want to do everything and nothing at the same time. Uh, Couch Sloth says, \"Has Greg fought uh Mitsune?\" Yes. Yes, I have. I have. I have bested uh Mitsune. Hit him where it hurts. All right. So, now you can go in and you can look at that outfit and see if that's what you want to grind for or",
            "start": 1467.84
        },
        {
            "text": "Mitsune?\" Yes. Yes, I have. I have. I have bested uh Mitsune. Hit him where it hurts. All right. So, now you can go in and you can look at that outfit and see if that's what you want to grind for or grind for something else. Up here. Back to Gemma. I was like, where are you? She's around. So, go right. There you go. Oh, up the thing. There she's right there. What do I want to do, Mr. Hawk? Right. At the KF 30th anniversary stream, Ben's going to throw football at Roger's head while yelling. You remember this? My game crashed again as well. So, all right. I'm just going to say it. Love this PC boying over here. Get out of here. I'll be out. This skirt is so cute. Right. We've got a special great horn flies, which is just unless they out in the world. Yeah. Oh, you saw that? I saw the little one that has like the the sugar glider on top of your head. See that armor? Look at that. Yeah, I want that arm. I don't know if Joey has it. Yeah, I can show it to you. Jo, this one? No, no, no,",
            "start": 1511.6
        },
        {
            "text": "one that has like the the sugar glider on top of your head. See that armor? Look at that. Yeah, I want that arm. I don't know if Joey has it. Yeah, I can show it to you. Jo, this one? No, no, no, no. Hold on. Let me get back down to Gemma. You go move on. little sugar glider bat that will go on your head. I don't I don't know if that's No, it's cuter than you think. I don't know if you'll need want it, but it's cute. I really just like this skirt. Like you just Google it. No, my game is crashed twice now, oddly enough. I'm having some problems here. So yeah, you got this little guy who can sit on your head. Oh, like Okay, that is more What was It's It's like what you Mike? What' you call the What's the thing from Australia? The Krakua. That's what I would envision a quacket to look like. But then up here you got this sugar glider guy who can just sit on your head and just like I'm tight tie I'm tight tie. I can't I can't fight anymore. I'm tight tie. But then you have this little guy",
            "start": 1575.12
        },
        {
            "text": "But then up here you got this sugar glider guy who can just sit on your head and just like I'm tight tie I'm tight tie. I can't I can't fight anymore. I'm tight tie. But then you have this little guy who sits there. Yeah. Oh, that is cute. Dang it. Dang. This isn't Yeah, I was going to say this is a good thing to have. You want to go? And the thing that I want is now I just have to ride around and find it. Uh if you go to your map. All right, great. You're already there. I love that. Uh, you want to get it here, but if like if you look at mine when if you hit your D-pad and then you Oh, nope. Sorry. So, go to it and then hit right on your D-pad. Oh, got it. There you go. And then you go to like uh the little icons there. Right now, obviously, there's nothing here, but when you go to one of the open other worlds, it'll tell you where they are, right? And here, let's get a mission going then. Um, do one of the event [Music] ones. There's one that they that is listed this week as Yeah.",
            "start": 1619.04
        },
        {
            "text": "of the open other worlds, it'll tell you where they are, right? And here, let's get a mission going then. Um, do one of the event [Music] ones. There's one that they that is listed this week as Yeah. tongue tied is supposed to be, hey, this is a great way to level up fast. So, let's go do some I've been doing it here and there. My my goal today, Mikey, yeah, would be hit level 100 hunter rank. Oh, wow. I like that. Possible. Oh my gosh. Yeah, we're I'm in the high 80s right now. And again, like you move a fast clip here. So, if we run a bunch of different stuff, but if we keep going here and we do tongue tied, I think we do. So, I'm going to throw that down, Joe. And then when we get there, feel free to look and say, \"Oh, do we currently have some best friends currently playing you guys?\" Oh, All right, guys. I'm going to leave an open slot for you guys to join Greg while I uh see if I crash my game again. So, jump on in there and have some fun. I've already I just threw it up, Joe.",
            "start": 1661.36
        },
        {
            "text": "Oh, All right, guys. I'm going to leave an open slot for you guys to join Greg while I uh see if I crash my game again. So, jump on in there and have some fun. I've already I just threw it up, Joe. So, you should be able to Yeah. Join quest and then link member quests. Um, let's be on our way. Hurry, it's just one. Somebody's going to take it from you. I know. Oh my god. I don't not the right level, but it's Damn it. Really? How low are you? That's a great question. How low am I? What is I think I'm 20. Okay. Well, I think I mean tongue tie is 21. Okay. So, we're right there. We can get Well, let let me climb this out with the kids I got coming in. Let me go do this annoying one that's just on my screen that I So, if you pop that up, I'll come join you. See what happens. Okay. Oh, you get in. Uh, well, it's working right now. Let's see what happens. We'll see what happens. In the chat, Neo, she says, \"Mike, did you try to verify the game files in Steam?\" At which point I say, \"Did you",
            "start": 1702.16
        },
        {
            "text": "in. Uh, well, it's working right now. Let's see what happens. We'll see what happens. In the chat, Neo, she says, \"Mike, did you try to verify the game files in Steam?\" At which point I say, \"Did you try to [ __ ] play a real game?\" Exactly. Thank you. Are you kidding me right now? Play on console. The moment you say that, I immediately just turn off and go, \"Yeah, I'm not doing that.\" That's right. I got to join Joey. That's um Yeah, I'm need to talk to this girl and then I need to go fight this thing. Guess I'm ready to go. Oh, no. That's my egg. [Music] It should automatically when I start. Let's get to it. and follow. Let's get to it. Mag, did you ever figure out if your GameStop friend got Nintendo pre-order. He was number one. Number one. Yeah. I pulled up and checked on him uh when I was coming in to work and he was smiling and there was probably 60 plus people there. You didn't think about getting in line just uh for a second there. It's like do I need one? Do I need one here?",
            "start": 1750.88
        },
        {
            "text": "I was coming in to work and he was smiling and there was probably 60 plus people there. You didn't think about getting in line just uh for a second there. It's like do I need one? Do I need one here? You know, just in case. What if Walmart cancels on me? Who knows? But you got to have faith at this point. I can't believe you got one so easily. Me? Yes. I mean, yeah. But also at the same time, it was still mayhem, right? It took me probably 25 minutes to make it all the way through. So like we were live on stream, people were coming in way easier than I was, for sure. Or when they were like, \"Wall, put up a line.\" Like there's a clock and it's like mine just says I'm in a line. What are you talking about? You just chimed in so nonchalant black. Uh and then yeah, Walmart charged me six times, so I had to call the bank. They were like, \"You have six charges here.\" And I was like, \"All right, well, only one. Only one.\" And they were like, \"Okay.\" What if he had six switches, though? You",
            "start": 1869.92
        },
        {
            "text": "so I had to call the bank. They were like, \"You have six charges here.\" And I was like, \"All right, well, only one. Only one.\" And they were like, \"Okay.\" What if he had six switches, though? You know, that'd be sick. It was sick. I know. I was like, every time I clicked it, I was like, I wonder if my credit card is freaking out. Uh-huh. Oh, yeah. Mine definitely was. [Music] I like I like this electric dinosaur monster with the wings. Oh, yeah. Where are them? Somewhere. This is a rare research opportunity. I'm going to try not to electrocute myself, but I don't feel great about that. Once I get out of here, I'll come help. I have like a full party, so it's not I don't think it'll be that crazy, but I just sometimes stop pay attention to That's That's trouble, Joe. Yeah, that's trouble. You got to pay attention. It's a big part of it. Yeah, I guess so. So I'm 89 as of or about 89. 89. Okay. And you want to hit 100 today for your birthday. How is it moving up? Is it moving up pretty",
            "start": 1921.52
        },
        {
            "text": "You got to pay attention. It's a big part of it. Yeah, I guess so. So I'm 89 as of or about 89. 89. Okay. And you want to hit 100 today for your birthday. How is it moving up? Is it moving up pretty quick still? Yeah. Yeah. Nice. Okay, good. And what are you doing for these cherry blossom? Uh there's login bonuses and then the event quest like the dailies basically. The dailies. Okay. Where would you see those? I do love a daily. You just go to the merchant, right? Yep. Or and you can check them out. You can't redeem them on uh your main menu, but you can check them on your main menu. Joey, I'm on my way to you. Hell yeah. Kick out these dumb saltwater cowboy says, \"Greg, do you like the Zoia weapons and armor sets?\" I do. I just have not made the time to jump through the hoops of finding Zo Shia to go fight since you have to wait for them to either appear or whatever or do the thing. I think I guess I do have a saved investigation. I do. Uh but I haven't been chasing them. I've been",
            "start": 2002.56
        },
        {
            "text": "Zo Shia to go fight since you have to wait for them to either appear or whatever or do the thing. I think I guess I do have a saved investigation. I do. Uh but I haven't been chasing them. I've been just working on what I got. [Music] Roger earlier in the office was asking Cool Greg and I what the song in our heart was today. He's like, I don't want anything that you've been listening to. I just want like what? Oh, you weren't paying attention. See? Yeah. Sorry, I got too distracted. Hey, man. This is your game, not mine. It's fine. I'm going to go back. Going to mostly be alive. No, I do not want to restock any of my supplies. I'm going in to finish. Oh, look. Mikey, what are you up to? I am trying to make sense of these dailies that Greg is calling you just cuz I don't know what those look like. Yeah, but I've accepted clear on the menu. Yeah, I've accepted just a random quest. Uh, so now I'm out here just about to fight some for a second. Do you spider? Ooh, I didn't know you had a",
            "start": 2052.64
        },
        {
            "text": "like. Yeah, but I've accepted clear on the menu. Yeah, I've accepted just a random quest. Uh, so now I'm out here just about to fight some for a second. Do you spider? Ooh, I didn't know you had a little pokey thing. up the wall. Chat's telling you a lot of different things. Yeah, I just don't see anything that says event quest, chat. But we'll figure it out. Don't you worry about it. We're here for Greg's birthday. So, make sure you join on Greg. We got to get him to level 100. That's what matters. Just right. Okay. Okay. What if I just slot my potion? So, Mike, when you open it up, Yeah. Well, I'm in a fight now, so it won't matter. All right. Well, eventually when you do, you go to It's recently viewed. That would have helped you. You go to info and then view limited bounties and open that up and you should see there. Oh, that's unlike that many. Okay. Not talking to the person at the table. There is a person to go talk to. Not at Yeah. Well, she would have event quests that would",
            "start": 2136.88
        },
        {
            "text": "that up and you should see there. Oh, that's unlike that many. Okay. Not talking to the person at the table. There is a person to go talk to. Not at Yeah. Well, she would have event quests that would have the stuff like the weeklys or whatever, [Music] but monster had my number. Really not for me. Okay, back at it. Just die, please. Who are you fighting? Oh, that looks It's so funny. So, Greg, yep. Monster Hunter Now and Monster Hunter Wilds do not have the same monsters, correct? Um, they kind of They do and don't. I mean like it was a big deal when Chadakabra came over to Monster Hunter now for the launch of Monster Hunter Wilds. Yeah. I say big deal loosely, but you know what I mean. And like Raffthalos and stuff are here and whatever. But like Yeah. Why? You're just talking like there's a bunch from previous Monster Hunter games in now that aren't in this. Yeah, cuz I'm looking at uh my screen and I was like, I'm pretty sure I've bought one of those in Yeah, for sure. You probably",
            "start": 2240.64
        },
        {
            "text": "a bunch from previous Monster Hunter games in now that aren't in this. Yeah, cuz I'm looking at uh my screen and I was like, I'm pretty sure I've bought one of those in Yeah, for sure. You probably have. I thought that they were mutually exclusive. Okay. Okay. Okay. Can I just [Music] uh Jake says, \"Greg, have you tried any new weapons?\" No, I haven't. I just play uh dual blades. That's all I ever have been. All I ever will be. I appreciate that. J man says, \"Thank you.\" Oh my god. I never knew that, Greg. I don't know what you're referencing at this point, but there's a lot of little things in Monster Hunter they don't tell you. Oh, was it the search on the bar? Search uh with the D-pad. [Music] Just Dave, you're making some time to play this again, Greg, which is nice. Yeah, you know, came off the last review and I was like uh I was I went away uh for spring break, right? So, I was away from the PlayStation and I was playing Expedition 33, but my heart wasn't into it. Like, you",
            "start": 2346.56
        },
        {
            "text": "came off the last review and I was like uh I was I went away uh for spring break, right? So, I was away from the PlayStation and I was playing Expedition 33, but my heart wasn't into it. Like, you know, turn-based ain't my thing. I want to get back to it. I love the story. I love the visuals. Yada yada, but I was like, I want to play Monster Hunter so bad. And so, when I got back and I found out everybody was playing Expedition, I was like, you know what? It's covered. I don't need to I don't need to force myself to play this, which will probably just make me hate it. And so, I was like, I'll commit to Monster Hunter uh until Oblivion gets here and then hopefully work the junk out of my system to review Oblivion. And then uh I didn't and have continued to gorge on it. I liked Oblivion from our stream. Yeah. Played for it another night too, but I was like I I knew this stream was coming up and I'm like I just going to play. And then last night playing it, I was like, you know what?",
            "start": 2413.76
        },
        {
            "text": "from our stream. Yeah. Played for it another night too, but I was like I I knew this stream was coming up and I'm like I just going to play. And then last night playing it, I was like, you know what? After today's stream, especially if I can hit 100, I'll be back to a good place of I'll want to play Monster Hunter and I'm sure I will here and there, but I until the next new set of dailies, items I'm chasing, whatever. Yeah. I can I can I can go and play other stuff. Oh, the dailies is what you didn't know about, J man. Okay. And they're weekly. Well, no, I guess you know the event things I'm talking about. The event quests are your weeklies, right? And then you got your bounties that are basically dailies. They recycle every 24 hours. And that's where you're getting blossom tickets right now for all the stuff uh for the Blossom Festival, which I think I pretty much got everything I want from it. How long do you think it took you to get? Not long at all. Especially like I I for some",
            "start": 2449.76
        },
        {
            "text": "now for all the stuff uh for the Blossom Festival, which I think I pretty much got everything I want from it. How long do you think it took you to get? Not long at all. Especially like I I for some reason my dailies timed out the other day where it was like I was live while they recasset. So I was like, \"Oh, great. Perfect. I can switch right over to this then.\" That is nice. Okay. Okay. Okay. Just dancing on his corpse. Then Jar says, \"Let's make Greg change his weapons since he's so strong.\" No. That won't be another fun tip. This is something I didn't know till I was listening to the Palib Bros. Uh the kind of funny best friend run kind of uh Monster Hunter podcast, right? So, right now with we're moving on the next one, but you see on the side of my screen there on the left, it says, you know, oh, white gleam gemstone parishrooms and tangled rock. Sometimes it's hard to find that [ __ ] right, when you're looking around the map and feeling that. If you hold R2 and then you can use",
            "start": 2491.92
        },
        {
            "text": "know, oh, white gleam gemstone parishrooms and tangled rock. Sometimes it's hard to find that [ __ ] right, when you're looking around the map and feeling that. If you hold R2 and then you can use the D-pad up and down to highlight those things and have a trail. But more importantly, if it a circle pops up, bam, you can just shoot off wherever you are with with circle and grab those parachutes without having to go get them. They made a they made a point to call that out and I was like, damn. Damn. I should have known that, but I never do. So hard to keep track. There's so many buttons. Pixelated soul says L2. Unless I if I said something wrong. Sorry. L2. Hey, if you could stop. It's booty bumping me. That is so cool. Alex calls out the the the they're usually weeklys because but the festival they're dailies. I'm aware, but I'm just trying to talk to a wide audience of what the difference is right now. But I appreciate that. What are you doing? This doesn't get me [Laughter] the broke",
            "start": 2542.48
        },
        {
            "text": "they're dailies. I'm aware, but I'm just trying to talk to a wide audience of what the difference is right now. But I appreciate that. What are you doing? This doesn't get me [Laughter] the broke something. her pedals. There you go. Yay. Excellent work, everyone. Especially in this circumstances. I can't say I'm a fan of these monsters evolving this way. Now, we've got more Guardians. Jman asked if we know anything about the Capcom crossover content. No, we just know in May, right, that they're crossing over with another Capcom H franchise for something. That'll be funsies. Yeah. Oh, Krabby Patty. Yes, you are the one who does the Palib Bros. Appreciate the shout out, Greg. It should be up soon. Did you get into the guild there when I opened up the slots, Krabby Patty? I noticed every time I sign on to play, right? Uh uh Lucy Dream says, \"Greg, you'll rank up a lot faster with a rank eight quest.\" Yes, but I'm trying to play with Joey and Mike, so we're just doing We appreciate it. Uh",
            "start": 2595.92
        },
        {
            "text": "I sign on to play, right? Uh uh Lucy Dream says, \"Greg, you'll rank up a lot faster with a rank eight quest.\" Yes, but I'm trying to play with Joey and Mike, so we're just doing We appreciate it. Uh anyways, uh Oh, I I sign on and it's like, \"Okay, nobody's in any of the groups.\" My damn it. Oh, I'm like in all these different things. I'm coming on West Coast time, 9 10 o'clock. Nobody's on. I'm like, \"Fuck.\" All right. So, in the menu, you press start. So, what are you trying to do right now? Tell me what you're trying. Well, I want I want to know how to earn tickets so I can get the cool armor for this event, right? Yeah. Okay. So, so how do that start? Then you go over to info little magnifying glass. Then go down to view limited bounties. Okay. And then you see stuff there and you see you got bloss blossom dance tickets in there. Blossom tickets, right? Yeah. So like complete all research help monster bounties new trophy. Oh, I unlock tempered monsters which somebody said earlier.",
            "start": 2679.0
        },
        {
            "text": "you got bloss blossom dance tickets in there. Blossom tickets, right? Yeah. So like complete all research help monster bounties new trophy. Oh, I unlock tempered monsters which somebody said earlier. Yeah, that's a they'll move faster obviously leveling us up that way. Uh, what level did you end up being at? Um, that's a great question. Mine is showing 123 for you, but I thought your screen said 20, which might mean your story gated and we have to do another story mission for you. Um, which ain't no thing. I How was it profile? That'll tell me this. Oh, I'm 23. Okay, great. And there you go. Can I only craft the event armor at the hub? No, no, no. Any any blacksmith can do that for you? He said not a thousand% sure, but pretty sure. [Music] Scarlet with the Prime Gaming sub says, \"Tried to super chat this, but you missed it. Last Sunday I beat Hollow Knight and now I'm currently blasting through Monster Hunter World. Wow. Wow. Those are some good games. You're living You're living big",
            "start": 2726.0
        },
        {
            "text": "super chat this, but you missed it. Last Sunday I beat Hollow Knight and now I'm currently blasting through Monster Hunter World. Wow. Wow. Those are some good games. You're living You're living big there. Kind of like that. That one. So, we still need more of those. J man calls out that the LA the one we just did with the two spiders uh gives tickets for one armor scent and then the Zoo event gives you the one for the eyewear and then there's a whole different one if you want the things for your head. Joey, I always hide my helmet so I'm not particularly attached to them, but then I always forget. Um and then I like never upgrade my Sure. [Music] Oopsies. Want to do that. Mike, don't forget to eat a meal. Mhm. I tried to eat a meal at the Blossom thing and they said I needed a ticket and I was like, \"Oh shit.\" They got other foods you can do though. Uh, and then Mike, what hunter rank are you at now? M no idea right now. Okay, let's see. I like this place. Remember this fun tunnel?",
            "start": 2811.6
        },
        {
            "text": "I was like, \"Oh shit.\" They got other foods you can do though. Uh, and then Mike, what hunter rank are you at now? M no idea right now. Okay, let's see. I like this place. Remember this fun tunnel? You should have an invite mic to hang with us. I'm fighting Duga right now. Just trying to get my get my feet back. I'm trying trying to get in the flow. I hear you, bro. That's what it's all about here. We're having fun. It's birthday. Uhhuh. Birthday. You're not legit, though. I got to do this thing. Come and help on this Digma. Astonishing adaptability. Um, Oriel Sanchez super chat says, \"Happy birthday, Greg. Visiting San Francisco soon. Any recommendations for what neighborhoods to look at for hotels? You don't have a lot of options. If you want a hotel that isn't like very like uh what's going on at this hotel, I would say just go to Soma. Yeah. Do the W your Mar Yeah. Your Bonvoy points. Yeah. Yeah. That's what I do. I always liked Motel Capri that you used to recommend way back in",
            "start": 2904.56
        },
        {
            "text": "going on at this hotel, I would say just go to Soma. Yeah. Do the W your Mar Yeah. Your Bonvoy points. Yeah. Yeah. That's what I do. I always liked Motel Capri that you used to recommend way back in the day. I've never heard of this place. I know what that is. I like that spot. Tell me about it. Um, it's near Palif of Fine Arch, that big street over there. Uh, that kind of section. It's got It's got it parking included, which was always nice. And then you just Uber around the city. Yeah, you're right. I guess you could go down on Lumbard Street there. Be in the marina. Marina would be nice. I'm sure that that puts you really close to Gearelli Square, right? There's probably something closer to that I'm not familiar with. There's a some Holidays and stuff there. Yeah, and that's a good point. You know what? I try to stay by Geared Elliot in the marina there. That's a way nicer area than S. Yeah, unless you're going to GDC. Alex, uh, Alex G3B says, \"I'm calling it now. The Capcom",
            "start": 3001.04
        },
        {
            "text": "point. You know what? I try to stay by Geared Elliot in the marina there. That's a way nicer area than S. Yeah, unless you're going to GDC. Alex, uh, Alex G3B says, \"I'm calling it now. The Capcom crossover will be on Musha themed because of the new game. And that would be our chance to get Tim in everybody.\" Will it? Hey, we got it. We got him to buy mutant ninja turtle skins, didn't we? Like we in Fortnite, we can almost get them here. That'd be cool, though. I don't know anything about the show. All you need to know, Joey, is they look cool. You have that the cool glaive with the things floating around going into it. Cool stuff. Cool katanas. Cool katana. We can scarlet. Oh no, the shuga. Uhoh. What happened? [Applause] Can you hear me? This way. Ooh, Mr. Hawk is going to Chicago for Riot Fest. Nice. That sounds fun. I feel like Feel like maybe it's Mike and Kelsey from 61 Indie that go to Riot Fest every year and post pictures. That always looks very fun. It's for Riot Games. No,",
            "start": 3046.76
        },
        {
            "text": "Fest. Nice. That sounds fun. I feel like Feel like maybe it's Mike and Kelsey from 61 Indie that go to Riot Fest every year and post pictures. That always looks very fun. It's for Riot Games. No, this is like a music festival. Big uh Metal Fest. Metal. Jessica Hel in the chat says, \"Greg, I owe you a big big birthday super chat next week when I get paid. I also one for Andy's Anniversary. You don't owe us anything, Jessica. Don't worry about it. Thank you for your lovely comment on today's Greg or yesterday's Greg. I don't want a fish. That is not the side quest I wanted to pick up. Is it If it's your first one, is it your first one? First fish. No, this is just I thought I was still on that goldfish fish. No, this is a a different fishing quest. Okay. It was one of those things where I was doing a Nether quest and I just saw the little Oh, why not pick this? Ah, [ __ ] I don't Yeah, exactly. Not the thing I want to do. I'm stuck doing this fishing quest. I know I could leave, but",
            "start": 3175.36
        },
        {
            "text": "I was doing a Nether quest and I just saw the little Oh, why not pick this? Ah, [ __ ] I don't Yeah, exactly. Not the thing I want to do. I'm stuck doing this fishing quest. I know I could leave, but it's fine. They threw a hang. How did I get away from that? Pixelated Soul says, \"Oh, no, sorry.\" Uh, Big Sheet says, \"Don't forget everyone gets a free Blossom Fest themed secret uh sacred armor if you want to drip out your sacred.\" Oh [ __ ] that's Pixelated Soul. Greg, I did platinum this game last week. The RNG for those crown trophies were brutal. Luckily, you can save those quests and share them with others. Ah, I see what you're talking about again. A far-off dream of one day, years from now, platinuming Monster Hunter Wilds. Again, I don't want to I You know, you're talking about fishing over there. I started doing that kind of stuff, the side quests. Oh, you know, catch this [ __ ] bug that only drops every So, and I'm like, you know what? I'll pop in when it rains. I'll pop in",
            "start": 3237.28
        },
        {
            "text": "over there. I started doing that kind of stuff, the side quests. Oh, you know, catch this [ __ ] bug that only drops every So, and I'm like, you know what? I'll pop in when it rains. I'll pop in and look for him at night time. And if he's there, great. And if he's not, I am not going to [ __ ] spend my night time sitting there doing it. Yeah. Flash. I also need to probably get into crafting like different types of arrows. Sure. Sure. I feel like that was on my ammo and stuff. Yeah. Oo, this one's pretty. He wasn't expecting that hot link to come in. No, hot link was there. This is a rare research opportunity. Can't let it go to waste. Okay. [Music] Looking good out there, Mike. You found you still you still using that gun. You don't understand. I'm used to Oh, yeah. I'm still using this weird blade. I don't understand is right. I have twoirds of it. Understood. That's about it. But you know what? I do understand gifts, Greg. And it's your birthday. Let's get another gift. Oh, wow.",
            "start": 3336.8
        },
        {
            "text": "weird blade. I don't understand is right. I have twoirds of it. Understood. That's about it. But you know what? I do understand gifts, Greg. And it's your birthday. Let's get another gift. Oh, wow. There's more. Another gift. Of course, I got my own Mrs. Sun right there. That's who Joy's fighting. Hello, Joey. You're fighting me. I do really love Joey. Pass it down to him. I'm fighting something you do. Joey pass it down to him. Thank you, Mike. Craig, open up another gift. What did we get? Ah, it's a Monster Hunter. It's another Monster Palico. This is a Palico. Reversible Palico as well. Oh. Um, did you order these online? Yeah. Yeah. Yeah. Good job, man. Went to Amazon and I typed in Monster Hunter and I saw what popped up. You're killing it. I'm going to go with the basic. There you go. You got another piece of Monster Hunter gifts right there. Happy birthday, Greg. This is amazing. Thank you. Chat with that. We are celebrating Greg's birthday all day long. We're playing Monster",
            "start": 3434.8
        },
        {
            "text": "go. You got another piece of Monster Hunter gifts right there. Happy birthday, Greg. This is amazing. Thank you. Chat with that. We are celebrating Greg's birthday all day long. We're playing Monster Hunter Wild. If you want to come join us, feel free to queue up, gear up, and have some fun with us. We'll be right back after a word from our This episode is brought to you by Imperial. We have told you all how important it is to developers that you wishlist the games you're interested in. So, if this sounds cool to you, make sure you wishlist it. I can't tell you how much it helps. Imperial is a complex, featurerich action RPG where you'll be sent to a planet in a far-off corner of the galaxy to explore enormous imposing monolith. As an elite mercenary, you'll join the expedition tasked with unearthing the secrets of the monolith and face off against the deadly automatons within. In Imperial, you'll explore four vastly different quadrants of the monolith, accessible only by using",
            "start": 3478.08
        },
        {
            "text": "with unearthing the secrets of the monolith and face off against the deadly automatons within. In Imperial, you'll explore four vastly different quadrants of the monolith, accessible only by using mysterious artifacts known as cardoggrams. Each cardoggram affects which enemies, boss fights, and loot will appear when you enter the monolith. So, no two excursions will be the same. Find even more cardoggrams to explore by looting defeated enemies or buy them from other players online at the trading post. You'll need to make sure you have the right gear to take on the harder cardiggrams. Build your mercenary, choose your gear, master your abilities, and take down everything in your path in Imperial. Face off against enormous deadly bosses, and seek out secret paths to find bigger and better loot. Help the members of the expedition in deep branching quests and aid other players in asynchronous multiplayer. Get ready, mercenaries. The monolith awaits. Imperial is available May 8th on PC,",
            "start": 3518.56
        },
        {
            "text": "loot. Help the members of the expedition in deep branching quests and aid other players in asynchronous multiplayer. Get ready, mercenaries. The monolith awaits. Imperial is available May 8th on PC, Xbox Series X and S and PlayStation 5. Wish list now. It helps so much. Wishlist Imperial. This episode is brought to you by Auraf Frames. If you haven't called your mom in a while, here is your reminder to do it. But if you want to go above and beyond beyond Mother's Day is coming up, and I have the perfect gift idea. Aura frames are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preload it with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special they'll use it every day. Me, Kevin, and a ton of people at Kind of Funny are obsessed with our Aura Frames. It takes about 2 minutes to set up the frame using the Aura app. Aura",
            "start": 3562.8
        },
        {
            "text": "a gift so special they'll use it every day. Me, Kevin, and a ton of people at Kind of Funny are obsessed with our Aura Frames. It takes about 2 minutes to set up the frame using the Aura app. Aura frames were named the best digital photo frame by Wire Cutter and featured in 495 gift guides last year accounted. Aura has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting oruraframes.com to get $35 off plus free shipping on the bestselling Carver matte frame. That's auraframes.com. Promo code kind of funny. Support the show by mentioning us at checkout. Terms and conditions apply. [Music] for me, too. What's up, gamers? We're back. We're back, gamers. Joey became Andy. Andy uh was trying to leave, but before he leaves, he's going to give me the birthday present of making my character look more like me. Some smart ass over here was like, is G point? Listen, I don't I did the best I could. I got the game. I don't have the skills to make",
            "start": 3608.64
        },
        {
            "text": "the birthday present of making my character look more like me. Some smart ass over here was like, is G point? Listen, I don't I did the best I could. I got the game. I don't have the skills to make things look good. Sometimes the lighting is weird, you know? I got close enough and I said, \"This kind of looks like Greg from a different country and I'll take it.\" Joe, use it. Yeah. It's like It's a different alternate universe, Greg. Yeah. Yeah. Yeah. 30 frames per second. So gross, dude. Joey put on Andy layered armor. I think Blessing were interested in trying Doom. Oh, Dune Awakening. Funny you asked that. I just messaged Greg about that. But uh cuz that code came in definitely probably around the same time that we got Clare obscure codes. The Dune Awakening beta. Yeah. So I never hopped in. Honestly kind of forgot about it. And then I saw people talking about it today. I was like, \"Oh, that's right.\" Try to type in that code and none of the codes worked. I was like, \"Oh, it's",
            "start": 3659.36
        },
        {
            "text": "hopped in. Honestly kind of forgot about it. And then I saw people talking about it today. I was like, \"Oh, that's right.\" Try to type in that code and none of the codes worked. I was like, \"Oh, it's because they shut down the beta build or whatever.\" So that sucks. But I I am definitely interested in trying it out, looking into it. You know me, I my first three hours in a survivor game or my survival game or my favorite three hours in game. Uh oh. Oh my god. Oh, they're going to break the camp. Oh, never mind. They break the walls. Damn. The doshaguma have 70 decades of family photos need to be digitized before they get destroyed by time. Some Oh my god, Langley. That sounds like something you just put a weekend aside for. You know, apparently the new MLB game has a really good face scanning feature. Ooh, can we import that into Monster Runner? Huh? Is that an NFT? Can my face be anything? Is that how it works? NFTs, man. Huh? Remember that? Remember when that was our big fight? That",
            "start": 3708.0
        },
        {
            "text": "feature. Ooh, can we import that into Monster Runner? Huh? Is that an NFT? Can my face be anything? Is that how it works? NFTs, man. Huh? Remember that? Remember when that was our big fight? That was the big struggle. That's all we had, man. What did Andy and Blessing give you, Greg? I gave uh Greg the alarm. Yeah, he did. Actually, Blessing gave me the gift of going to Japan, be alone for a week to get some cool Death Stranding 2 content. Very exciting. The Ara is like such a nice little surprise. I keep forgetting about it and then I see it on my desk. Oh man, Ben's going to flip. You pick all the different themes, bud. You got to you got to uh link it up to your Wi-Fi. Okay. Um and you have to log into your Nintendo account and then you can download like updates and they'll release like new themed sounds for new games and things like that. Okay. cuz so far they got Mario Odyssey, Mario Kart, Splatoon, and I really only ever used the Mario Kart was like the last one I was checking",
            "start": 3768.24
        },
        {
            "text": "new themed sounds for new games and things like that. Okay. cuz so far they got Mario Odyssey, Mario Kart, Splatoon, and I really only ever used the Mario Kart was like the last one I was checking out. They got Zelda, too. Oh, they have Zelda. Yeah, Breath of the Wild. Yeah, Tears Breath. That just that era you wake up to hear. Yeah. I can't wait to wake up to Tingle one day. H. But enough about Jen. What am I doing? Oh, I'm [ __ ] Sorry. I'm I should not be doing this. I'm messing with Oh, don't worry. Joey got KO'ed and then had to go move her car. So, Oh, me. You got me and two other kind of funny best friends over here working the Or just one other. No, two. Yeah. Yeah. Working the thing. We got it. We're Joey's going to come back and have a nice little We're being attacked by kangala. Kongala. Kangalas. Kangalas. I conga for you. likes his bow, huh? Listen, there's no accounting for taste, you know. Just say it always feels like it's the secondary one, you know. Yeah. Yeah, for",
            "start": 3829.6
        },
        {
            "text": "Kongala. Kangalas. Kangalas. I conga for you. likes his bow, huh? Listen, there's no accounting for taste, you know. Just say it always feels like it's the secondary one, you know. Yeah. Yeah, for sure. Does feel nice, though. What am I using? Like arrows that I shouldn't be using? Cuz these little guys should not take this long to kill. Yo, I'm afraid your bow may be [ __ ] You got to upgrade this. Well, she just found out about high level armor. So, yeah, we uh we didn't teach her well on that part. You're doing 30 damage to this [Music] kangala. Big Papa Bros. 29 months of support. Thank you, Big Papa Bros. When you call me Big Papa, your hands [Music] These little babies are taking so long. Oh, I broke the head though. Break that head. Just broke that dude's skull. Hoping is a 4-day pass to go to your packs east ke. What time should I get there? Uh, usually the keynotes in a gigantic room and I've only gone to a few keynotes and they're never super packed. So, I think you're going",
            "start": 3885.12
        },
        {
            "text": "to go to your packs east ke. What time should I get there? Uh, usually the keynotes in a gigantic room and I've only gone to a few keynotes and they're never super packed. So, I think you're going to be okay. What? It's 11:00. I'd say, you know, Walt's in at 10:30. You're probably fine. And I think me and Ben Star are packing the room. It's a, you know, you the keynote kicking off on a Thursday, I get it. But I think Saturday, Sunday, you know, that's when people are going to pack. Yeah, Thursday people are in school about work. Play hookie Boston. You've been through enough. Any chance for a meet up Jane then? Absolutely not. Absolutely not. Uh, I'm doing a thing where I'm actually flying for a redacted game in Canada. Then Wednesday night, flying into Boston. Then Wednesday, no, sorry, Thursday I do my panel 11. Then I do the mafia panel at 2. Then I go straight to the airport and I fly back home. I'm a jet setter, Andy. You know what I mean? A famous guy's going to be there. And",
            "start": 3960.88
        },
        {
            "text": "Thursday I do my panel 11. Then I do the mafia panel at 2. Then I go straight to the airport and I fly back home. I'm a jet setter, Andy. You know what I mean? A famous guy's going to be there. And Greg, don't get me started. I got your ass. You got it. Are you playing the game on PC? Oh, you are on PC, right? Yeah, it keeps crashing. It booted up 480p. Um, and then it's crashed four times now. Play stupid games. Win stupid prizes and down fresh download, too. Downloaded it last night. Drivers update. Yeah, everything's updated on this PC. They've been telling him to check his files. That's not a bad idea. You got that [ __ ] marathon anti-che and the colonels doing god knows what keeping the colonels, huh? That's definitely what that was. Can't we just Why can't we uh catch the game? Oh, yeah. [ __ ] Oh, a marathon. Yeah, when you thought about it. Yeah, you were totally right on that. How you guys like Oh, you're doing a whole games cast by, aren't you? Yeah. Yeah. Keep it under",
            "start": 4009.0
        },
        {
            "text": "Oh, yeah. [ __ ] Oh, a marathon. Yeah, when you thought about it. Yeah, you were totally right on that. How you guys like Oh, you're doing a whole games cast by, aren't you? Yeah. Yeah. Keep it under wraps. Don't tell these kids anything. No embargo. I mean, I was mad at Andy last night. I already went to bed in like two seconds. Went to bed. That's such a live stream for like two and a half hours. We went for a while. We played a long time. My Frappuccino was finally kicking in though when he quit. Yeah. Nuh-uh. No. No. You better not. And hey, I had somebody in chat being like, \"Man, I love this like I love the way this sort of camera angle POV looks whenever it spectates like your homies doing stuff.\" I was like, \"Yeah, you're watching it a lot. You're seeing it a lot today.\" Dying a whole lot. It was a rough one. I love that Nick walked in today was like, \"Let's just play marathon together, boys.\" It's like, it's Greg's birthday. He's like, \"What if we just played marathon all",
            "start": 4074.48
        },
        {
            "text": "a whole lot. It was a rough one. I love that Nick walked in today was like, \"Let's just play marathon together, boys.\" It's like, it's Greg's birthday. He's like, \"What if we just played marathon all day?\" He's such a piece of trash. Boa is R2 R2 circle circle R2 R2 circle circle. Oh, I just feel like this computer is probably just scuffed by this point. Like something happened. Which computer? The one you're on. I think you downloaded a virus. Yep. You think I downloaded a virus? Probably. I'm gonna put that on Kevin, not me. I think this computer is just scuffed. [Music] I love you overhearing you telling Kevin, \"No, I don't download anything on that anymore. You told me not to.\" Yeah, I told I said, \"You got to figure out Escape from Tarov.\" He looked at me, he goes, \"Why?\" I go, \"Because you told me not to download it.\" Shit's not on Steam. Good luck. It's scary downloading stuff these days, you know. Go. The freaking marathon code I was trying to get Kevin Ax and Madak with",
            "start": 4123.12
        },
        {
            "text": "\"Because you told me not to download it.\" Shit's not on Steam. Good luck. It's scary downloading stuff these days, you know. Go. The freaking marathon code I was trying to get Kevin Ax and Madak with wasn't working. What's going on? Yeah, Tarov is coming to Steam this year. Doesn't help us right now. See, not even a game I didn't I I just assumed it was on Steam the whole time. You thought they have the arena on Epic Games Store, but arena is not even escape from Tarov. What? Yeah, that's too standalone game. That is the multiplayer. Think Valerin type stuff. What the [ __ ] I had no idea that was the only thing. They even have a PVE in uh Tarov as well. $20 expansion. So, you got to assume they're uh is this like a Dark and Darker situation when Dark and Darker was like, \"Hey, download our game since we're not on Steam and we just give you an executable file.\" That's what That's literally what Taroff is. Yeah. Yeah. Go to their website, give them money, they give you you got to do an",
            "start": 4188.96
        },
        {
            "text": "game since we're not on Steam and we just give you an executable file.\" That's what That's literally what Taroff is. Yeah. Yeah. Go to their website, give them money, they give you you got to do an interview cuz they're like, \"We got to make sure you're not a cheater.\" So, this comes in at 48 480. It's like I uninstalled it and then um 740p or 1448 came back and it's just forgot who it is. And go to a full screen instead of borderless window. Okay. Whoa. A $50 super chat. What the heck? Woo. From Noah. So, happy observe birthday, Greg. I just had mine on Wednesday. It's cool to have a birthday so close to a trending gamer 20. Doesn't matter. The trending gamer or trending gamer 25. It doesn't matter. The trending gamer. It's great to be a best friend. Thank you for everyone a kind of funny for a great six years for me. Thank you, Noah. That's super kind of you. Now they have window mode. Okay. Leave it at uh leave it window. Sorry. Um another thing. Let me see. Get my kernels. Yeah,",
            "start": 4249.52
        },
        {
            "text": "for a great six years for me. Thank you, Noah. That's super kind of you. Now they have window mode. Okay. Leave it at uh leave it window. Sorry. Um another thing. Let me see. Get my kernels. Yeah, let me get in the kernels. Get in these kernels for me. Let's see here. All right. Don't you love a good when someone's like typing and stuff? Oh, Andy, I'm going to go to my tent and set you up to give me a face off. Hell yeah, big dog. I want to take my face off. Yes. Would you like to trade something? doubt it's like an issue with GPU or cards, but just in case [Music] everyone in the village said they can help. Happy anniversary to the best pro gamer. Kind of funny. Andy Garcia, the only person we should be celebrating this Friday. Painful. You're all being painful. Earlier, Jessica said she owed you owed us a super chat for your anniversary when of your you were a and this clown walked in just wanting to insult me. I got to lobby. Uh yeah, the squad lobby kind of fun. You going to get",
            "start": 4306.32
        },
        {
            "text": "owed you owed us a super chat for your anniversary when of your you were a and this clown walked in just wanting to insult me. I got to lobby. Uh yeah, the squad lobby kind of fun. You going to get back to the supper? I mean, I'm done just cuz there's so much [ __ ] Yeah, chat. I've obviously never done this before because I've been waiting for Andy. Where do I cash in the voucher? I have the voucher to change my face. Damn, that is Rahul. It is not Rahul. It's a lot of people. Omega Buster 20 gifted. Thank you, Omega Buster. Oh, here. Let me move down. Here's a chair. Here you go, Andy. So, he has a chair. Uh Andy's gonna make Greg's face in the game because he wants to look. Yeah, but I don't remember where to go for that to cash that in. You got to go to the person you like the person that you get extra inventory from that's like kind of in your camp. The little dude that gives you like little Can't you buy stuff from somebody out there? Yeah, but then you have the thing. All",
            "start": 4382.32
        },
        {
            "text": "that you get extra inventory from that's like kind of in your camp. The little dude that gives you like little Can't you buy stuff from somebody out there? Yeah, but then you have the thing. All right, everybody stop saying tent. I'm in the tent. I don't You see me in the tent, right? You're w You see it, right? And we I want to change the makeup of my face. Do you have to like maybe hit the the item in your Oh, character select chat same like all the way at the main menu. Okay. Main menu. Okay. I [ __ ] hate the chat sometimes. Joe says tenty tent and then goes and after I scream at I'm already in the tent. He goes then then you were already there big boy. Shut up. God damn it. That's why I was stream with you people. Everybody acting like they [ __ ] know exactly what's going on. Nobody was jack [ __ ] when everybody's talking. All right. No, it's not makeup chat. Sorry, Gaming. So, here's my thing that that character brought you, right? Edit the character. There it is. All right.",
            "start": 4449.6
        },
        {
            "text": "was jack [ __ ] when everybody's talking. All right. No, it's not makeup chat. Sorry, Gaming. So, here's my thing that that character brought you, right? Edit the character. There it is. All right. There you go. There you go, Daddy. Yo, how do you want to do this? Uh, you you sit in this scene. I mean, I really just kind of need a photo of you. There's there aren't that many. You can just take a photo. Don't smoke. Brilliant. Bloody brilliant. What are you What are you changing? We're going to make him a a white man. What we're going to do? I tried. I got no tail. Let's see here. Uh, make a I'll take my Yeah, do that. Watch on on Yeah, do that. The ticket. [Music] All right, let's see. Way to get to where I'm going. How about Joey? I don't know if it's anything I need help with. Joy's struggling. help her. Enjoy. What's wrong? I'm trying to just figure out the fastest way to get over here, but I don't know where my way point, which I guess maybe I'm just going What are you trying to",
            "start": 4513.12
        },
        {
            "text": "help her. Enjoy. What's wrong? I'm trying to just figure out the fastest way to get over here, but I don't know where my way point, which I guess maybe I'm just going What are you trying to do? Um, go to this. So, yeah, if you click on it, it should drop the waypoint. I hate how like here. Zoom in with R2. So, hyper. There you There you go. There you go. Focus. But then it doesn't actually do anything, which is annoying. You're whispering, Joe. It's probably not picking you up, doesn't it? It's annoying. I thought it was like a thing that I clicked, but apparently it could be, you know. And Jenny says, \"Good games to Greg for randomly being one of the kind of funny founders.\" Send nugies. I don't know if I appreciate this level of humor. LOL. Happy birthday, I guess. But it's still Greg sucks. Oinky. Love you all in the KFBFs, huh? It's Yeah. What's What What do you understand about that? What are we doing to Greg? We're making him a white man. Oh my god. We're making him Caucasian.",
            "start": 4602.88
        },
        {
            "text": "sucks. Oinky. Love you all in the KFBFs, huh? It's Yeah. What's What What do you understand about that? What are we doing to Greg? We're making him a white man. Oh my god. We're making him Caucasian. Everybody, we're starting there. First things first. Every like, what? How could you make this even better? How can you make that any better? [Music] Ryan the Lion, 72 months of support. Wow. We says, \"Happy birthday, Greg.\" Thank you. Can you just show Joey's gameplay while I'm doing this? No, I don't know how to do that. You're talking to me? No. Oh, here. I know how. I can end the stream. I can do that. No. So this is black screen right now. No, that's just a frozen screen. Oh, what the hell? Freezing. I mean, she's playing right now. Yeah. Who knows what's going on. I wonder if her I'm not streaming. That's why. Oh, Joey doesn't want to be seen. I imagine they just thought that Mike and I wouldn't stream probably. Eim says, \"No, we want to watch Andy, but I think Andy wants to",
            "start": 4668.64
        },
        {
            "text": "I'm not streaming. That's why. Oh, Joey doesn't want to be seen. I imagine they just thought that Mike and I wouldn't stream probably. Eim says, \"No, we want to watch Andy, but I think Andy wants to surprise you with a Greg Miller looks like me at the end.\" Um, well, I just I just wasn't sure what people wanted to watch. I mean, I spoilers, I don't think people get Joey Speed going. People want to watch Monster Hunter. I think you're that guy forced this on everybody. I was kind of like, I'm going to tank the Friday for my birthday. I want to play Don't let the Friday tank, chat. Thank you for your subscription support. Don't let the Friday tank on [Music] me. Don't let me down. Uh Merk says, \"Greg, you watched this Smackdown tonight. Big red debut expected.\" No. Uh I don't I don't have terrestrial TV, so not on Netflix, not on. Yeah, that's what we're calling it. That's what I call it. Yeah. So I'll I'll catch it as I always do on the drive home. I'll see Instagrams. Don't let me",
            "start": 4739.76
        },
        {
            "text": "terrestrial TV, so not on Netflix, not on. Yeah, that's what we're calling it. That's what I call it. Yeah. So I'll I'll catch it as I always do on the drive home. I'll see Instagrams. Don't let me down. It's propaganda panda. Such an aware CEO. We stand. Pixelated soul. Uh, oh no. Pon says, \"It's okay, Greg. We indulge you every once in a while.\" I was surprised how well the Oblivion uh stream did. Yeah. 30k views last check. Good job, Andy, on telling us to pivot to that or asking, you know. Yeah, I was trying to finish Clear Obscure also. And and Nick just not understanding at all what I was asking for. Mr. Mr. Ox says, \"You got Netflix? You got a VPN? Boom. You got Smackdown.\" I tried once and it didn't work. And I was like, I'm done trying them. So, goodbye. Just don't care. Just I mean, I care, but now that I don't have that many hoops to jump through, you know. Uh, Alex says, \"Greg, how old are you?\" That's a very forward question. Yeah. How dare you? I will be 42 on Sunday.",
            "start": 4793.68
        },
        {
            "text": "mean, I care, but now that I don't have that many hoops to jump through, you know. Uh, Alex says, \"Greg, how old are you?\" That's a very forward question. Yeah. How dare you? I will be 42 on Sunday. Still younger than Nick, which is important. Wild. Yeah. Uh, DJ or I'm sorry, Deneration Max's. Uh, Greg, have you ever watched Better Call Sa Saul? I don't waste my time with shitty TV. Go kill I hate you. Like, I [ __ ] want you to die right now. I watched I watched a few. You got me so mad. I was going to say, go kill yourself. He just comes out and deletes my my character. So mad. No, no, no. I did. I watched a few episodes of season one and I enjoyed it, but I just fell off and then you know what happened? Nine years went by. I blinked and nine years went by. Uh DJ Ree says, \"How long fell in my life how long is it until you're older than Nick?\" I mean, god forbid never. You mean you don't want to catch up? Yeah. Well, I mean, if if I'm going to be older than Nick, he's going to die.",
            "start": 4844.64
        },
        {
            "text": "in my life how long is it until you're older than Nick?\" I mean, god forbid never. You mean you don't want to catch up? Yeah. Well, I mean, if if I'm going to be older than Nick, he's going to die. That's true. You know what I mean? Kilo says, \"Let me add to Andy's anger. Greg, do you watch Andor?\" No. I respect my time. God, you know, I only let me tell you how andor ends. They all die and the planet gets blown up. Like, I've seen the [ __ ] movie. I don't need to see all this [ __ ] to know how it happened. Only Nick can do that for me because it's not like Greg is watching a lot of other TV shows and not the good ones. Like, I know Greg doesn't really consume TV in that way unless, you know, I know him in general watch the select. Well, whatever HBO fil, but it's not like you are constantly watching everything possible. Yeah. Um, and selectively avoiding the good ones. If you want, you can take off the uh scar on my eye, too. No, I kind of like undoing it cuz it, you know, my guy's",
            "start": 4891.44
        },
        {
            "text": "watching everything possible. Yeah. Um, and selectively avoiding the good ones. If you want, you can take off the uh scar on my eye, too. No, I kind of like undoing it cuz it, you know, my guy's never getting hit. Ah, that is true. And I got glasses now. So, the glasses I was worried I wouldn't have glasses ever. So, I have glasses now. I think it would look more like me without this car. I like it. Where is that makeup face? The Matt Effect says, \"Dc Universe Online 2 or Marvel Heroes comes back. Which one are you picking?\" Uh, I would go Marvel Heroes. I mean, DC Universe Online is still chugging. I jumped in for the Superman event uh this week. Yeah, right. This week. And I was impressed with what they're doing with their things and I never I didn't go back to finish it off because I was busy, but and I wanted to play Monster Hunter and Oblivion came out, blah blah blah. But like I miss Marvel Heroes. I want Marvel Heroes. I want Ultimate Alliance. Can we get in another Can we get",
            "start": 4942.32
        },
        {
            "text": "busy, but and I wanted to play Monster Hunter and Oblivion came out, blah blah blah. But like I miss Marvel Heroes. I want Marvel Heroes. I want Ultimate Alliance. Can we get in another Can we get an Ultimate Alliance 4, please? everywhere. Or just, you know, Phil Spencer, come on. Open up the satchel of games you've acquired and let me have Ultimate Alliance 1 and two again. Get that satchel open. You got a satchel of games. You spent $69 billion. Let me have it. Number might not be accurate. Don't let the sun go down on [Music] me. I want to see if this will be the weekend where I try to play a lot of Oblivion, but I I fear I will just play more clear obscure. I fear. I fear. Paul says, \"Happy birthday, Greg. Still my favorite WWE superstar. Thank you so much.\" Wow. That game looks so freaking good. WWE. I know that, too. Yeah. Look at Andy go here. Look at what he's doing. You making him Tim or me? Joke. It's a joke. I know. I know. I know. Well, yeah. Yeah, I was going to keep on",
            "start": 4988.4
        },
        {
            "text": "good. WWE. I know that, too. Yeah. Look at Andy go here. Look at what he's doing. You making him Tim or me? Joke. It's a joke. I know. I know. I know. Well, yeah. Yeah, I was going to keep on editing the other one, but I was like, \"Whatever you need. You're the artist.\" When you start off with the basis of a non-Caucasian man when that's your starting your template. He had a round face. It looked like my face. I just When that's your template, did you do any of the customization stuff or you just pick someone right? No, no. I I went in there and tweaked to my the best of my ability. But typically with in an overly complicated character creator like this, I tweak tweak tweak and I'm like, \"All right, this is good enough. I want to play the game. I don't want to sit here and like continue to do this. Yeah. I just always end up doing like I'm going to do a preset. I we'll accessorize and that's fine. Yeah. And it's, you know, I don't get me wrong, I love my wife. She's fantastic. Yada.",
            "start": 5060.96
        },
        {
            "text": "to do this. Yeah. I just always end up doing like I'm going to do a preset. I we'll accessorize and that's fine. Yeah. And it's, you know, I don't get me wrong, I love my wife. She's fantastic. Yada. Yeah. But I should have never listened to her cuz she convinced me to make myself cuz she was going to make herself in the game and then she played that one night and never came back. And so now I'm left with this guy and every time I go through the stuff I'm like, man, the girl outfits are so much cuter. They're so much more like It's more exciting and interesting. Yeah, I agree. So, I guess I just have to Don't let the sun go down. Wildly different songs. I know. Cary just said, \"Pretty sure I saw that you can play Marvel Heroes again on modded community servers.\" Uh, you can. That's correct. But I also don't want to make a VPN work for Netflix. So, I assure you I'm not in the mood to jump through a hoop. I got to do that. All right. I got things going on. Instead, I'll just keep",
            "start": 5110.16
        },
        {
            "text": "correct. But I also don't want to make a VPN work for Netflix. So, I assure you I'm not in the mood to jump through a hoop. I got to do that. All right. I got things going on. Instead, I'll just keep screaming into the void that I want these games to come back. Marvel Heroes. I don't even know what game that is. Marvel Heroes Omega. Marvel Heroes. It was the Diablo Marvel game. Gazillion. David Brevik, Anthony Gio. That's the That's the first like pre-party mode let's play I edited. You can watch that video right now. Ch. I got up to get my seven years old by now. Got up to get my water and I noticed there's still three more birthday presents back there for Mike. Why? Why is he spending money like that? That's a great question. What did we do in party mode for It wasn't It wasn't Oh, you did a Let's play. I I did a let's play. It was before the official like party. Yeah, it was it was Nick sitting next to you. Oh, won't we just like show each other games? Got it. Got it. It was Nick,",
            "start": 5163.04
        },
        {
            "text": "did a Let's play. I I did a let's play. It was before the official like party. Yeah, it was it was Nick sitting next to you. Oh, won't we just like show each other games? Got it. Got it. It was Nick, you and Anthony Gos. Look at Joey just doing this. Andy was pointing out your bow's not doing a lot of damage, so maybe we Yeah, I'm going to have to fix that. I know. And I keep it every time it's like, \"Oh, upgrade this.\" And then I'm like, \"Well, I don't have those things.\" But I'm not really I was like, \"These little Congala guys are I've been shooting them for the last three minutes and they're not dying.\" But I also may not have been using the weapon correctly. Okay. Angala Red Hut 8 says, \"Greg, do you think WWE will leave USA Network eventually and go fully on Netflix like most other countries?\" You'd hope so. Uh, but I doubt it. Uh, I think USA has been such a partner to them for so long that they're going to keep giving them money to make it happen like this. And they just",
            "start": 5212.48
        },
        {
            "text": "countries?\" You'd hope so. Uh, but I doubt it. Uh, I think USA has been such a partner to them for so long that they're going to keep giving them money to make it happen like this. And they just signed this contract. How long is this contract? I'm not even sure. What am I looking for? I'm looking for Alex says, \"Greg, you can wear the girl outfits.\" I'm aware. I know. Even now I can totally blow it all up and make a girl, but at this point I'm too committed to Greggy. He's got a reputation. Yeah, everybody knows him out there. Why did it take that long for Dude with a kid says, \"Everybody watch The Wild Robot. It's so great. I've never heard of that.\" Oh yeah, everybody said it. That movie was incredible. That was a I think it's a DreamWorks one that kind of just came and went, but I heard only amazing things about it. Just watch out with Ben. Okay. Where is it? Um, probably Digital Rental. I got to assume. Wild Robot might be on Peacock. Everybody's got to go watch it based on a",
            "start": 5258.64
        },
        {
            "text": "heard only amazing things about it. Just watch out with Ben. Okay. Where is it? Um, probably Digital Rental. I got to assume. Wild Robot might be on Peacock. Everybody's got to go watch it based on a book, right? Win or lose. Win or lose. Disney Plus. Pixar. Oh yeah, that's the one that you uh Greg about. that softball one. Yeah, it's great. Peacock um been into hockey. Like is it when is the Mighty Ducks age? Oh, it's more getting him into something that's not easily accessible. Where's an ice rink I can take him to? And I know there's one downtown, but like an easy, you know, one. There's something we doing the other day where he was like, \"It's like hockey.\" And Jen was very her her Canadian hackles were very warm. Is she going to be really upset if he decides to be a Sharks fan? No, no, no. I don't think she cares that much about that. Just the general hobby. You get him. It's like me with like, you know, football, right? If he he doesn't I'm never would wish him to be a Bears",
            "start": 5311.68
        },
        {
            "text": "no, no. I don't think she cares that much about that. Just the general hobby. You get him. It's like me with like, you know, football, right? If he he doesn't I'm never would wish him to be a Bears fan. Yeah, you don't want that right now either. You know how it is. But some teams just never do well, Joey. Oh, yeah. That's not the Sharks. Sharks were good for a long time. Spooner Martinez says, \"Win or lose, one of the greatest thing is one of the is one of the greatest things Pixar has ever made.\" I agree. Damn. I tell you something. I know. [Music] [Music] T is Thunderbolts next week. It is. Oh, that's exciting. I mainly for movie popcorn about the only reason you know there's other movies you you could get that movie popcorn whenever you want. Yeah, but it's so exciting to have movie popcorn. The [ __ ] Oh my god. Dude with a kid says, \"My kid loved it.\" And this is win or lose. They're four years old. But it's also great for kids and a great animation. Tears were shed. I think",
            "start": 5365.84
        },
        {
            "text": "popcorn. The [ __ ] Oh my god. Dude with a kid says, \"My kid loved it.\" And this is win or lose. They're four years old. But it's also great for kids and a great animation. Tears were shed. I think it's it's it falls, I think, really much into that Bluey camp where it's like, yeah, it's obviously designed to look like something your kid can watch cuz Ben was watching it, but all the themes and all the dialogue were [ __ ] hidden. It'll make you feel. BJ Bernardo says, \"Happy birthday, Greg with a super chat. Uh, paying your birthday tax. Have you watched Raw After Mania? Any predictions for Smackdown tonight?\" I have watched Raw After Mania. I had a good time. This Cena stuff's crazy. Uh, predictions for Smackdown? No, I haven't kept up on what they're hyping or what they're doing uh for Smackdown tonight, but as always, I'll find out via social media. I feel like that's generally how I consume wrestling as well. Just social media. The the you know, it's just the thing where the time",
            "start": 5434.96
        },
        {
            "text": "Smackdown tonight, but as always, I'll find out via social media. I feel like that's generally how I consume wrestling as well. Just social media. The the you know, it's just the thing where the time zones are never our friend on that one. Yeah. So, it's like, you know, even when it was like you could watch it on delay, it was like, well, it's ruined by the time it gets here. Dude with the kids says, \"Greg, I'm going to want a Wild Robot review from you. I'm going to look at what Wild Robot is, everybody.\" It was one of like the highly rated movies of last year. So, everyone that's seen it has said it's excellent. Um, the Wild Robot. After a shipwreck and intelligent robot is stranded on an uninhabited island to survive the harsh surroundings, she bonds with the native animals and cares for an orphan baby goose. The film was nominated for three Oscars. Three. Three. Damn. Pedro Pascal's in it, of course. What is these days? Matt Barry. Bill Ny. Billy. Matt Barry. Nice. Oh, Bill NY.",
            "start": 5483.52
        },
        {
            "text": "for an orphan baby goose. The film was nominated for three Oscars. Three. Three. Damn. Pedro Pascal's in it, of course. What is these days? Matt Barry. Bill Ny. Billy. Matt Barry. Nice. Oh, Bill NY. Yeah. Yeah. That's the uh about time. Hot fuzz. No, I know who he is. I was going to pronounce his name. I'm well verssed in his career. He's He's amazing. Can you adjust the ears? Too big. Yeah. I don't I like this monster a lot, but I hate how he looks when he gets all deflated. Oh, that's my Oh, I just love all the forms of him. I I accept him no matter how he looks. Don't let me [Music] down. Let's see. Don't let me down. Okay. [ __ ] Why aren't you helping Joey, Greg? I don't know if she needed it. You know, you're still designing my character. Yeah, sorry. Mike's thing crashes and plus it's he's got it hooked up to keyboard and mouse here. If only there were controllers that even look at what do you want me to do? I'm not a PC technician. I don't know how to do it. The mouths always",
            "start": 5526.56
        },
        {
            "text": "he's got it hooked up to keyboard and mouse here. If only there were controllers that even look at what do you want me to do? I'm not a PC technician. I don't know how to do it. The mouths always lean towards a smile and I'm not going for a smile. And even if I try to put the the corners of the mouth down, there's still a little bit of a smirk. And every every mouth looks like Anthony Mackey's mouth. Always specifically always doing something. There's always a little smirk there. What's he up to? Twisted Metal season two. Man, they're really doing that. That's I don't know if we season one. I'm much I mean similar to the uh the split fiction thing like I'm happy it exists. I'm happy like you know more and more things are are being made in that vein but Twisted Metal just will just always confuse the hell out of me that it got a TV show. Krabby Patty says, \"Happy birthday again, Greg. My favorite memory of meeting you was being interviewed by you right before we won the Uncharted 3",
            "start": 5615.44
        },
        {
            "text": "confuse the hell out of me that it got a TV show. Krabby Patty says, \"Happy birthday again, Greg. My favorite memory of meeting you was being interviewed by you right before we won the Uncharted 3 multiplayer event. Tell me more about that, Krabby Patty. Was that where did that go up? Where was this? What do you mean go up? I interviewed Krabby Patty. Where did that Was that on IGN Beyond? I don't know. Was it an article? Was it a thing? Was it a Was I walking around hosting something live? I have no recollection of this is what I mean. Sagorilla says, \"Tell me about that thing I did.\" Uh, Willie Maddox says, \"This is the first time hearing this.\" Says, \"Happy birthday, Greg. Sending love from Adelaide Adalian, Australia.\" That's Mike's favorite spot next to Perth. That was a great part in that live stream. He loves Perth. Don't let me down. You know what I should have done? I should have done a time lapse of you doing it. Like put set up the phone right by it so his face just went",
            "start": 5682.8
        },
        {
            "text": "in that live stream. He loves Perth. Don't let me down. You know what I should have done? I should have done a time lapse of you doing it. Like put set up the phone right by it so his face just went cuz it's taking forever cuz I want to watch and it fast forward. I want to [ __ ] play some I want to watch it sped up. You're doing fine. You're doing fine. Make me look great. I think I think I'm done. It's just the ears. I hate the the ears. I wish I could also make your head taller. Is this the color of my hair? I mean, you got a lot of I got a lot of grays in there. I know. I'm It's It's It's gray. Not Yeah, it's not not Okay. Okay. This Don't get me wrong. I Maybe it's darker. I have absolutely no opinion of myself in any high regard. I'm not like offended. I'm just didn't read as a judgment, just genuine curiosity. He's slightly sausage says it should be a shade darker. I'm going to get more water and pee, then I'll be back. Just Yeah, I'll go a shade darker. It's just like a shade",
            "start": 5735.68
        },
        {
            "text": "just genuine curiosity. He's slightly sausage says it should be a shade darker. I'm going to get more water and pee, then I'll be back. Just Yeah, I'll go a shade darker. It's just like a shade darker felt black and I guess maybe those browns have turned black now possibly. But I'm back while he goes pee. Made it. Well, it hasn't blown up yet. That's nice. Not yet. Yeah, my game hasn't dropped out. That's surprising. Yeah, I'm having a problem. Did you ever figure out what he meant by getting all the Are you getting tickets? Are you just doing [ __ ] I'm not even doing seasonal or the event stuff. I'm just trying to get my hunter rank up. So, I'm doing side quest things, but I can come out of here. Yeah. Have a wonderful Friday, man. Have a great weekend. See you, big dog. He's like, \"Go to info. Go to view limited time bounties.\" And I see the Blossom Dance ticket vouchers, but then it says complete all research help monster bounties. Like, where are those? And I'm like, what? What",
            "start": 5791.84
        },
        {
            "text": "to info. Go to view limited time bounties.\" And I see the Blossom Dance ticket vouchers, but then it says complete all research help monster bounties. Like, where are those? And I'm like, what? What are those? Do you have Is that the thing that you have to go to the table for? Mission info. Table. Okay. [ __ ] Where's that lady at? She just left. Um, where is this person I have to talk to? It's not that wrinkly. [Music] Okay. Aside from the ears, which I can't seem to find, can you shrink the ears? I don't know where they are. Um, I mean, they got to be under detailed settings where all the other shapes are. I would try physique. No, no. Try face. What's going I'm going to read the things off to you that you've already been in. There's definitely a way to shrink the ears. I don't think there is, man. Face shape. No. Well, go down. What would you like? Weird, right? Yeah. Like I I I could have sword and I guess not. Oh, you know what? I don't think you can cuz I remember wanting like",
            "start": 5873.16
        },
        {
            "text": "is, man. Face shape. No. Well, go down. What would you like? Weird, right? Yeah. Like I I I could have sword and I guess not. Oh, you know what? I don't think you can cuz I remember wanting like that's always the thing that kind of sells my likeness of like, oh, give myself big ears or the page like and I couldn't do the ears and it was really annoying. Okay, there you go. That's you. Thank you, Andy. Yay. Looks better. Have a great weekend, Andy. Smash your phone. Smash my phone. There's still presents you got to open. You want to give him one? Give him one. Give him another present up on the top. He's got three presents on the top. Give him one of the top ones. Happy birthday, Greg. We got you more presents. What is it this time? Another guy, but they're reversible, so they're different. You know, you started duplicating your headset. Now, did they only have two Monster Hunter adjacent items that would be shipped here in 2 days? Yes. Everything else said May 11th, so I bought",
            "start": 5979.04
        },
        {
            "text": "You know, you started duplicating your headset. Now, did they only have two Monster Hunter adjacent items that would be shipped here in 2 days? Yes. Everything else said May 11th, so I bought whatever Monster Hunter items I could. I love that. Thank you, Mike. That's amazing. Uh, Krabby Patty answers my question. You were still at IGN. You and Anthony Gas were there. Brian from the Palib Bros was on your team, Elena. There was an Uncharted 3 multiplayer event at an AMC theater in San Francisco where they showed the multiplayer matches on the theater screen. You interviewed me before we won the finals. Even have a shot even have shoddy Facebook vids of it. I v I do remember that now. Correct me if I'm wrong. Wasn't there an earthquake while we were there? And weren't we like live streaming it to Facebook live? And I think that I do remember that now. Thank you very much. Damn, that does look really good. Now, Andy, look at that right there. Mike, that's Greg Miller on a hill with his",
            "start": 6037.2
        },
        {
            "text": "it to Facebook live? And I think that I do remember that now. Thank you very much. Damn, that does look really good. Now, Andy, look at that right there. Mike, that's Greg Miller on a hill with his glasses with Portillo and Cole ready to start some [ __ ] Oh man, you got really cool looking cat now. Oh, yeah. Yeah, that outfit is sick looking. Greg's really playing this [ __ ] game. I'm playing this game, guys. [Music] Uh, Trey Jamal says, \"Greg, how many days are you going to be at PAX East?\" I believe it's less than 1:00. Think I get in at 5:30 p.m. and fly out at 4:30 p.m. This is going to be fun. It's going to be a good time. Really may. Hopefully the weather's turning a little bit. Should be a positive time in Boston. Hell yeah. What are you guys into? You doing stuff? What are you up to? I'm uh [ __ ] around. I'm fighting uh I'm on a hunt right now for some random animal. I have to raise my hunter level at certain areas. I don't know how to describe it anymore. You're doing",
            "start": 6078.8
        },
        {
            "text": "up to? I'm uh [ __ ] around. I'm fighting uh I'm on a hunt right now for some random animal. I have to raise my hunter level at certain areas. I don't know how to describe it anymore. You're doing you're crushing it. You're doing But like you know what I mean. This one you got to just go out and fight random monsters in the area. Got it. Where the [ __ ] is this optional quest that I have to accept? I'll come help you with this ebony guy. Mikey Mike. Oh, yeah. Yeah. Just the first monster I saw, I clicked on and I said, \"I'm coming to fight you.\" Got it. Love it. That's what it's all about out here, hunting. Yeah. Yeah. Yeah. I'm hunting. I mean, our goal should be you getting to level 100. So, whatever we got to do to get you 100, that's the birthday gift. Okay. Okay. We have three hours to do that. If Let's do this. And then we all are old. We can all join on that toad mission. And I think we all in uh chat somebody was talking about how the tempered ones will get you more. What is",
            "start": 6154.16
        },
        {
            "text": "to do that. If Let's do this. And then we all are old. We can all join on that toad mission. And I think we all in uh chat somebody was talking about how the tempered ones will get you more. What is the random ass tempered going to give us more uh than the recommended uh whatchamacall you understand what I'm saying here? I hope what's the button to look at my my little monster's bag? My little my little birdman's bag. Uh when you're on the birdman, you want to hit uh left on the D-pad. Left on the D-pad. There it is. [Music] Okay, we'll find a tempered one we can all do. Pixelated Souls, I believe there's an event quest that gives extra XP. Yes, that's the one I'm talking about. There's an event quest uh going right now for Chatakabra that is recommended to give you the uh for fast leveling. And so I was thinking we can all go do that since it's 21. That's what I was talking about earlier. And then I said that and somebody else said no tempered would be faster. And so I was asking if",
            "start": 6233.28
        },
        {
            "text": "And so I was thinking we can all go do that since it's 21. That's what I was talking about earlier. And then I said that and somebody else said no tempered would be faster. And so I was asking if that's the case. Did everyone get a Switch 2 pre-order at KF? Yeah, I believe everybody that wanted one is good. Thanks to everybody working together. Yeah, except for Nick Scarpino. He He was upset he didn't get one. He's not upset. He doesn't even care. He doesn't even know. He doesn't even know it's right. Hand him a switch light and tell him it's a switch too. He'll never know. That would be awesome. Chris, they have him like give his real impressions like he tries to figure out if it's different. New design and [ __ ] anguish and atrocities rais it says J man. Okay, what's the hunter rank on that one? Jman. 21. Okay, thank you. Infantry Mike. How much more into Oblivion are you? Uh, I played 5 hours. I saw that stream. Yeah. Uh, I had so much fun. I'm going to play it again tonight. Like",
            "start": 6291.12
        },
        {
            "text": "that one? Jman. 21. Okay, thank you. Infantry Mike. How much more into Oblivion are you? Uh, I played 5 hours. I saw that stream. Yeah. Uh, I had so much fun. I'm going to play it again tonight. Like I told you, I uh I'm going on my own adventure now. Yeah. And that means me and the king's son are just going to go do random dungeons and side quests and then I'll bring him back when I'm done with him. So, yeah. I'm having so much fun with that. You said you played Another Night, which is dope. Are you still enjoying it or what? Yeah. Yeah. And and it's that thing of, you know, playing off stream. I was I wasn't enjoying it more, but it was interesting to see it click a little bit more of like, oh, this is how I should be doing combat, not how I was doing it. Get the shield out there, take the hit, then [ __ ] hit him. Okay. Yeah. It's still got the old school combat with that. Uh, it's just one of those of like, am I really sinking in another 80 hours into this game? Probably not.",
            "start": 6393.68
        },
        {
            "text": "the hit, then [ __ ] hit him. Okay. Yeah. It's still got the old school combat with that. Uh, it's just one of those of like, am I really sinking in another 80 hours into this game? Probably not. That's my thing is like right now I and I I want to give it more time, but I'm not like, oh, the story's got me. You know what I mean? Like that's not happening. And then also like the environments don't got me either where it's like this one big round, you know, uh, stone city with all these doors that look exactly the same to go into shops that look exactly like put all this out in a courtyard. Let me just go to it easily one by one. Yeah, it's a special game. It's also an old game that I don't really need to replay. I'm definitely deep on Marathon right now. I'm I'm having a lot of fun with that. I'm finishing up Devil May Cry 3, Dante's Awakening. Uh, and Greg, let me tell you what, that's a video game right there. That's a video game. I'm having so much fun, man. I'll come back here for",
            "start": 6489.2
        },
        {
            "text": "I'm finishing up Devil May Cry 3, Dante's Awakening. Uh, and Greg, let me tell you what, that's a video game right there. That's a video game. I'm having so much fun, man. I'll come back here for you're angry. [Music] There we go. [Music] [ __ ] you. Come on, Mikey. [ __ ] you, dude. There's four other people. Attack them. Jesus. What's going on with your your boys Washi? Are they still playing this or they already day done? Uh Washi loves this game. He would play this every single day if he could. Uh everybody right now schedule one Marvel rivals wanting to get into marathon with the boys. Um Oh, and then we were really enjoying Runescape with the uh the Dragon Wilds. They had their own survival crafting game and uh me and the boys had a great three nights with that and then uh we got to come back to that. I went on a little trip to go see Big Mike. We haven't gone back. But they did a great job with that survival crafting game. Surprisingly a lot of fun. Yeah. Yeah. Runescape.",
            "start": 6530.16
        },
        {
            "text": "to come back to that. I went on a little trip to go see Big Mike. We haven't gone back. But they did a great job with that survival crafting game. Surprisingly a lot of fun. Yeah. Yeah. Runescape. Everybody loves Runescape. [ __ ] yeah. NFL draft happening this weekend right now. NBA playoffs, Smackdown tonight, Smackdown after Wrestlemania. What's going to go down over on that? You paying a lot of attention to the draft to the NFL draft? Yes, that's right. Yeah, just because uh the two Buffaloos are in it, right? So, you had Travis Hunter go number two overall. What went Yeah. What happened to the Browns? I saw I caught a thing today of somebody taking a photo of the Miz and they're like I just told them on the plane what the Browns did and I didn't know if I didn't know if they actually did something stupid during the draft or if it Well, they did trade down away from Travis Hunter. They had the number two pick so they could have taken him. I think they went down to five right there",
            "start": 6664.4
        },
        {
            "text": "did something stupid during the draft or if it Well, they did trade down away from Travis Hunter. They had the number two pick so they could have taken him. I think they went down to five right there and then drafted probably some kid from Michigan I remember cuz he was going down to Cleveland. He was a DTackle I believe is who he was. So they had the chance to go there. That's where they went. I got it. Got it. Uh and then yeah, we're waiting on Shadur Sanders. Deion Sanders number one son, the quarterback. He dropped out of uh round one, which a lot of people thought, well, he's got to go round one, but no, he's not that talented. Is he good enough? So, he went to round two. Hopefully today, we'll find out. We'll see. Okay. Oh, Blueprints. Yeah, I got to go back to blueprints, too. Is that a mic game? Uh, yeah. It is a lot of fun. That's a great game. I definitely can get lost in that. Yeah, as I said, I started that on a plane ride and I was like, I like this. It's not a",
            "start": 6717.04
        },
        {
            "text": "too. Is that a mic game? Uh, yeah. It is a lot of fun. That's a great game. I definitely can get lost in that. Yeah, as I said, I started that on a plane ride and I was like, I like this. It's not a traditional Greg game, but I need a notebook. So, this was the time. Yeah, I need a notebook. I need to sit there and write jot down notes if I want to play this, you know? I also enjoy cuz I can cheat. If I stream it, people can just give me the answers. So, like that's super fun. Yeah. Give me the guide. I'm like, yeah, why don't you just tell me? That's how I was doing it when it was, you know. Uh, oh man, here's all this fishing. I'm like, where do I go? Yeah. Where do I go? What time of day? What do I need to do? I don't want to like actually try to figure out this fishing. Me and uh me and Kevin had a blast with it though when we streamed that one time. That was a really great stream. Quello or ASAP? Uh, Ko. Me and Kevin had a stream here and we uh we fell in love with it. That was a",
            "start": 6760.0
        },
        {
            "text": "Kevin had a blast with it though when we streamed that one time. That was a really great stream. Quello or ASAP? Uh, Ko. Me and Kevin had a stream here and we uh we fell in love with it. That was a lot of fun. Kev's been obsessed with him. I'm very excited to see him. Crazy how obsessed he is. Yeah. Come on. Come over here. This kid, this guy that we're fighting is a beast. It's an absolute freak. One of you. We got him on his last legs. Oh, Mikey, don't you worry. Okay. As long as you don't faint again every I'm like now I'm like in the mood of like maybe don't die again. Just hang back, you know. Yeah, that might be uh the biggest problem of my Monster Hunter gameplay was chose the wrong sword, dug my heels in too deep, never tried anything different. I mean, you can try right now. Should have done that. Yeah, just try something different. You'll be fine. You'll be right as rain. Nothing is locked in monster. You can change whatever you want to. All right, here we go. Okay, you",
            "start": 6801.84
        },
        {
            "text": "Should have done that. Yeah, just try something different. You'll be fine. You'll be right as rain. Nothing is locked in monster. You can change whatever you want to. All right, here we go. Okay, you sleepy love buttons [Music] level 32. That's what I like to see. Mikey. Yeah. It says investigate the regions and raise your HR is all I have to do. Well, now you're going to ride with me. All right. We're good. Now I'm riding with you. I'm going back to home base, though. First, I'll go home base. The Grand Hub. We're just going to milk this Dugima. That's what we're going to do. Oh, really? The anguish and atrocity. An event quest for earning tons of hunter rank points. This is a great chance to raise your hunter rank. I'm just going to keep throwing those up for a while if you want to. Yeah, I I'm I'm in on that. I'm going to go run the jewels as they say. They say that, Joey. I don't know if it's in that context, but they we're going to run the jewels. Yeah. Joe, we'll let you finish",
            "start": 6874.64
        },
        {
            "text": "I I'm I'm in on that. I'm going to go run the jewels as they say. They say that, Joey. I don't know if it's in that context, but they we're going to run the jewels. Yeah. Joe, we'll let you finish your thing and you can come join us on the next one. Okay, sounds good. Oh man, my buddy Wavy just gifted out a tier one sub that says, \"Happy birthday, Greg.\" Thanks, Wavy. Wavy. Shout out to my guy right there. You ready to get in there, Mike? I'm crafting a weapon first. You let me know because I don't want to drop it and have it much. Let's see. What am I in the mood for? Others joining [Music] us. Okay. Oh, now she's got a crew making weapons for her. Yeah, this guy he's he's got more experience, so he bosses a run. I don't like it, you know. Oh, really? I don't like I don't like the vibe over there when I'm looking at little little hat guy do his thing. Uh, all the skill sets tuned in and everyone is lifeless. We're all locked in. All right. Monster Hunter. This is Monster Hunters,",
            "start": 6936.16
        },
        {
            "text": "over there when I'm looking at little little hat guy do his thing. Uh, all the skill sets tuned in and everyone is lifeless. We're all locked in. All right. Monster Hunter. This is Monster Hunters, right? That's what it looks like. Anytime I'm locked in. All right, Mike. I'm dropping it. You join or you don't join. Drop in there. Try not to do that again. I need to get a special wing. Need to bait one of these over here. Delicious. I don't really know how to do that. Okay, let's move out now. Commence in quest by order of the guilt. sent us supply items. We got this there. That's our target. Uh Mike Skyc says, \"Any idea when there will be more Pokémon?\" Oh, yeah. My birthday May 7th. Uh on my birthday, May 7th, I have asked Nick Scarpino and Andy Cortez to just please God, finish Pokemon for my birthday. I said, \"Please God, the only gift we need and my only gift I want is for you to stop changing this [ __ ] schedule to play this game.\" And they said, \"Mike, deal. We will finally",
            "start": 7029.28
        },
        {
            "text": "for my birthday. I said, \"Please God, the only gift we need and my only gift I want is for you to stop changing this [ __ ] schedule to play this game.\" And they said, \"Mike, deal. We will finally play that for my birthday, which is great.\" When's your birthday again? May 7th. So, two weeks from now, that's a Tuesday or a Wednesday, we will complete our Pokemon run and we will finally put it to bed. Good night, sweet prince. Just need one of you to die already. Just one. I'm going to go kill this bird first. Got to kill this bird so I can make a sword. Leaving my weapon behind, Joey. Yay. Finally calling it quits, everybody. I'm never doing the charge blade again. I can't I can't figure it out. I'm going to go sword and shield. The most basic thing you can do. That's all I want to do now. Keep it basic. Keep it easy. I kill this. I kill this bird. I get its wings. I can craft a new sword and shield. And then I'll be good cuz I'm using the basic one, y'all. Sword and shield is my",
            "start": 7105.04
        },
        {
            "text": "now. Keep it basic. Keep it easy. I kill this. I kill this bird. I get its wings. I can craft a new sword and shield. And then I'll be good cuz I'm using the basic one, y'all. Sword and shield is my default for now. And it makes me think like, hm, would I like it in this? Oh, in Monster Hunter now. Oh, wow. Okay. Wow, that game got some depth to it. I didn't know it was like that. Come on, Mike. Come play Monster now. Monster now is so fun. Okay. Got a bird. Oh no. Let me go actually. Greg is fighting what you're supposed to be doing for the event, which is fun. After this, our goal is to get him to level 100. I'm fighting a giant uh bird, the naked chicken looking bird, and uh I need its wing so I can create a sword. That helps. Pixelated soul. That is correct. Oh, you are so close to being dead. That would be lovely. Okay. Okay. Give me the fangs. One short. We'll run it right back. Mike, that was You enjoying me, Mike, or you still working on your thing? Uh, no. I'm I'm still I I'm",
            "start": 7205.04
        },
        {
            "text": "dead. That would be lovely. Okay. Okay. Give me the fangs. One short. We'll run it right back. Mike, that was You enjoying me, Mike, or you still working on your thing? Uh, no. I'm I'm still I I'm literally just fighting this chicken right now. It's I got NPCs, so it's going to be slow. You want me to come help? Yeah, jump right on in. Hey, what is the attitude? [ __ ] [ __ ] jump get in here and save the day for me for you to jump in and save him. Likes to play dead. Keep attacking it. Well, let me tell you what. I'm just smashing Y. 91. Mike, we got this. 91. Oh, yeah. Easily got that. Holy cow. What's max level or is there no max? It just keeps going. Oh no, it just keeps going. Yeah, 100's a big uh big number there. Big feet. That's a trophy, too. Got that going for me. Hate getting flashbanged by Yeah, the flashbang is crazy. Oh, looks like you already got a full party. People are joining. Come on in. Uh-oh. Thing's going to die to a spider now. throw him back up a sugar if you",
            "start": 7367.0
        },
        {
            "text": "flashbanged by Yeah, the flashbang is crazy. Oh, looks like you already got a full party. People are joining. Come on in. Uh-oh. Thing's going to die to a spider now. throw him back up a sugar if you want to. Oh, people are saying that 999 is the max. There you go, Mikey. Why is uh why is Austin Creed aka Xavier Woods aka Austin Creed [ __ ] big time in you all the time? You know, he's he's on the water. He's, you know, winning tag team titles. He's always got some goddamn excuse. Some excuse. It's embarrassing. I don't know where he was. That that pool picture. It was the ocean video. You win the tag team titles, you go on you go on vacation apparently. You know, it checks out. Finally. Mike, how are you doing? Uh, blew up on me. We're midfight. Game blew up on me again. Yeah, Mikey, I'm so sorry. See like a I know. [ __ ] Get him. Get him his makeup, Joey. He's a big red nose. You did this to yourself, Mike. That times communicate 16. I don't know how to do that, but apparently I",
            "start": 7430.08
        },
        {
            "text": "so sorry. See like a I know. [ __ ] Get him. Get him his makeup, Joey. He's a big red nose. You did this to yourself, Mike. That times communicate 16. I don't know how to do that, but apparently I did it a lot. All right. Heat. Come out. What are you calling playing over there, Mike? I just restart the rubbing his beard looking off. Man, this this one hurt me. I'm trying to get back. I really thought this was going to go smooth for me. That's right, Chad. Everybody remember, we're trying to get Greg to 100. That is the goal. Easy peasy. We focus on that. Get him to 100. Find out. did that or Mike just starting and restarting the game. Yeah, that one's tough. That one's unfortunate. [Music] RPG Saint says, \"Happy birthday, Greg. I'll keep crashing Mike's game just like we talked about.\" [ __ ] you. That's great. Yeah. Nothing worse than PC issues. When you're not the PC guy and you have no idea what any of it means, you just kind of say, \"All right, whatever. All right, here we go. We",
            "start": 7554.96
        },
        {
            "text": "you. That's great. Yeah. Nothing worse than PC issues. When you're not the PC guy and you have no idea what any of it means, you just kind of say, \"All right, whatever. All right, here we go. We go. Alex says, \"Joey, I'm coming to help.\" They might already made it. I'm Yeah, Dawn's in there. You're all set. What are you fighting, Joe? A dashuga. Oh, okay. Give me some more of your pretty fur so I can make Okay. Except that you're just going to kill me again. So I can make another cool cape. Thank you for the happy birthday wishing game, Sunny. Oh, that's cool. They got that in game. That's fun. Oh, that's fun. Game chat. Love a little game chat message. [Music] Um, in the chat, Rocken says, \"Should Greg pay us a birthday tax?\" The birthday tax I'm paying you is being here and streaming. Mhm. He could have been home with his child and wife right now. I got to just check check that Friday. Nick wanted you to check out. Nick was like, \"Just tell him to go home.\" I said, \"I'm not doing",
            "start": 7699.72
        },
        {
            "text": "Mhm. He could have been home with his child and wife right now. I got to just check check that Friday. Nick wanted you to check out. Nick was like, \"Just tell him to go home.\" I said, \"I'm not doing that. You got to tell him that.\" I'm not telling. You tell him. real quick. We're all out here. Doing the damn thing. Come on over. You have any requests? Oh man, you got to meet Barista Bran says, \"Happy birthday, Greg. It was great meeting you in Chicago. What's your birthday dinner tonight?\" Oh [ __ ] What's the big birthday dinner? I don't know what the big birthday dinner is. You know, like I said, we planned, of course, uh on uh doing the baseball game. Uh and then that's as far as the real birthday plans are. Jen uh hit me up and she's like, \"Do you want to do special dinner tonight?\" Which usually means we wait till Ben goes to sleep and we cook something. Oh. And I said, \"Yeah, but I don't know what she's planning.\" And also, she's not feeling great, so we'll see if that comes.",
            "start": 7838.24
        },
        {
            "text": "Which usually means we wait till Ben goes to sleep and we cook something. Oh. And I said, \"Yeah, but I don't know what she's planning.\" And also, she's not feeling great, so we'll see if that comes. Okay. Thank you, Sunny Nolles, for the 10 gifted subs here on Kind of Funny. Thank you, Sunny Nolles. Should I begin? Watch this. Bang into that spider again. Just exactly what happened last time. All right. Oh boy. I need hunter symbol two. Pon goes in and out. Dead head goes house of prime rib. Yes. Two very different ones, but also two things I would be thrilled with. I love that. I think we'll end it probably just cookies take at home. But yeah. Oh, love both of those. Little original Joe's is my thing, too. So, would that be Let me do the math. That'd be to go tomorrow for family Easter. And now I'm being forced to go to Sacramento for the weekend. Sack time for the weekend for Joe. How can I serve? A s choice. Can hear this monster dying. I just need to get to it. Don't [ __ ] Don't",
            "start": 7909.44
        },
        {
            "text": "And now I'm being forced to go to Sacramento for the weekend. Sack time for the weekend for Joe. How can I serve? A s choice. Can hear this monster dying. I just need to get to it. Don't [ __ ] Don't you [ __ ] do this to me. Uh, Selinire with the Prime Gaming sub for 50 months says, \"I blame my new baby for breaking my monthly sub streak.\" Well, congratulations to the baby. Baby, exciting. Congrats. Thank you for the love. Don't do it again. Demetri is Thank you for the prime gaming stuff for 31 months. Michael, what are you doing? You fighting some? I'm fighting the giant turkey bird again. One more time. You want some help or you? Uh, yeah. If you want to join on this, you should be able to join on us. I'm just checking. See what happens. Oh, guy blinded me. Who's Alessa? Do we remember who Alessa is? Is Alessa Alessa? I think Alyssa's I thought was a kind of funny best friend. I always thought it was an NPC, but I thought was a kind of funny best friend. I think well, it has to be",
            "start": 7992.88
        },
        {
            "text": "who Alessa is? Is Alessa Alessa? I think Alyssa's I thought was a kind of funny best friend. I always thought it was an NPC, but I thought was a kind of funny best friend. I think well, it has to be a kind of funny best friend. It's some If you're in here, make yourself known. Let me know. A supply shipment's coming in. Hope you find something useful. Alex says she's an NPC. That's what I thought. Thought so. That's why we've been sucking then cuz I needed all of you. Rune factory Guardians of Azuma Earth Dancer Edition may not release on June 5th due to tariffs in production. You wanted to make sure it was on PC before you started talking [ __ ] You are god awful. Uh, real quick. Uh, is this a person? Sorry. Big CM6000 with the gifted sub. Thank you, Big CM. Great to see you. Johnny Boss writes in and says, \"Happy birthday, Greg. I'm glad you came out of your eggshell. PS. Bring back calling Andy. Candy Andy. Anyways, love you all. Going to replay the Last of Us 2. Johnny, bring back",
            "start": 8091.32
        },
        {
            "text": "writes in and says, \"Happy birthday, Greg. I'm glad you came out of your eggshell. PS. Bring back calling Andy. Candy Andy. Anyways, love you all. Going to replay the Last of Us 2. Johnny, bring back the Johnny Bos awards. All right. How have we not gotten a Johnny Bos award in so long? This faking death. Yeah. What's not good? I thought it was a glitch cuz of Mike's thing. I didn't realize the bird was faking it death. That's faking it death. That's what the chat said. They're like, \"Get ready. It's going to death.\" That's fun. You guys thought it was so cute in Saro, but here it is. You know, this game ain't getting nearly enough praise for it. Nice. Fake that. Fake that, Dad. Fake that. Give me your wings. What? I don't know. That's not me. I don't know what these arena quests are. I don't know. This is a rare research opportunity. Can't let it go to waste. Joey's stoned. You can tell. No, I'm bold to think that I would come to work stone. It's the monster hunter. It's the monster",
            "start": 8224.4
        },
        {
            "text": "know. This is a rare research opportunity. Can't let it go to waste. Joey's stoned. You can tell. No, I'm bold to think that I would come to work stone. It's the monster hunter. It's the monster hunter lock. Yeah, you just get lost in the hunt. Let's see if I can upgrade some things now. [Music] 256 green pass. [Music] Somebody pressed the button. Slappy. There we go. Got to get wings. Got one wing. I think I need two. That sucks. Keep [ __ ] that chicken. I need 92. My 92 still. Yeah. Well, that didn't help us, right? That one didn't help. That helped a little. You were 92 just a second ago. I was 91 a second ago. What? Hey lady, pay attention to me. I'm trying to upgrade. Forge weapon. Show me the weapon that I want. What? You watch you. What you want to like? I'm going to drop one in here that I uh I don't know if you I might come join you. Can you do 31 yet or no? What are you? I'm 31. Yeah. I'm beautiful. Let's go. Everybody come join me and Mikey Zoo. Woo. What the Oh, you ready",
            "start": 8285.12
        },
        {
            "text": "that I uh I don't know if you I might come join you. Can you do 31 yet or no? What are you? I'm 31. Yeah. I'm beautiful. Let's go. Everybody come join me and Mikey Zoo. Woo. What the Oh, you ready to go to the joke? It's not Well, you're not 31. No, I thought you were still doing 21. You can go ahead. I don't care. And that three. [ __ ] you. Okay, let's move out. Do you have everything? The guild sent us supply items. We got this. Good to have you. I haven't looked at my power stuff in a while. Uh, nice says, \"Wouldn't fighting the tempered Archel give the most XP?\" Sure, but I also want stuff that this guy's giving me. Uh, I need blossom a blossom dance ticket for something. And then I also need a hunter 2 or whatever. So, I figured I would do two birds with one stone and do something Mikey could join on. And then I screwed Joey. But, you know, we're just juggling. We're just juggling here. How do I join? Go to your quest person. Whether Oh, no. Well, yeah. Quest person, whether it",
            "start": 8397.2
        },
        {
            "text": "could join on. And then I screwed Joey. But, you know, we're just juggling. We're just juggling here. How do I join? Go to your quest person. Whether Oh, no. Well, yeah. Quest person, whether it be Alma or the quest people. I'm aware of you. Those butterflies look so cute. Yeah, you're right, Greg. I don't really like Gemma's little He's He's just Shut up. I don't like Gemma should be running the Grand Hub, not you. What's the difference between a blossom dance ticket and a blossom ticket? Different things need different different stuff is going to require different things. One of them also is your meal ticket too to get that sushi thing. Oh god, Q site 12 with a 10 gifted sub. Thank you so much. Hi Q. I can't join that cuz it says progression not met. That means probably story stuff. Yeah. When I clear this, we'll go back to doing that uh one we can all do from the event, the 21 one. Well, you you get to 100. Well, that's the one that's giving you the bonus XP, so it's going to be",
            "start": 8463.28
        },
        {
            "text": "When I clear this, we'll go back to doing that uh one we can all do from the event, the 21 one. Well, you you get to 100. Well, that's the one that's giving you the bonus XP, so it's going to be close enough to, you know, whatever. We're going to just grind that. All right, guys. We're grinding. Turn around. We grind that. I'm going to go kill another chicken. We can do whatever you want. I'm making Joey, you're going to grind it with us. It's my birthday. Let me make this cute Palico armor. Will I regret using one of those tickets on this? Probably. No. No. You're going to be swimming at tickets. You're fine. Look how cute she look. She's got a little butterfly backpack, this fun hair, nice little Sakura cat body. Dooi with the tier one sub 44 months says, \"Happy birthday, Greg. Look forward to watching you at PAX East with the interview with Ben Stark. Very exciting stuff. Don't forget about that mafia panel 2 p.m. as well. Mafia, man. Two in one day. Big stuff going on right there.",
            "start": 8553.76
        },
        {
            "text": "to watching you at PAX East with the interview with Ben Stark. Very exciting stuff. Don't forget about that mafia panel 2 p.m. as well. Mafia, man. Two in one day. Big stuff going on right there. That's how I do it. And then leave immediately. Then I'll see you later, Boston. Very excited to play video games on the plane. Okay, I like that. Yeah. What are you looking forward to? The idea was, and I don't think I'll deviate, but the idea was that I would play uh Outer Worlds. Outer Worlds. That way I can we because I have an Outer Worlds review on the books before SGF. Okay. So that we can re-review Outer Worlds getting ready for Outer Worlds, too. Wow. But Oblivion made me a wrench, but I doubt I fall so in love with Oblivion that I'm like, I got to keep doing this. But maybe I do. Dave Burns out here losing his mind. $20 super chat says, \"Happy birthday, Greg. I spent my birthday on Wednesday slaying monsters, too. Crossed hunter rank 300.\" Hell yeah. Put me in, coach. Dave, if you",
            "start": 8607.68
        },
        {
            "text": "Burns out here losing his mind. $20 super chat says, \"Happy birthday, Greg. I spent my birthday on Wednesday slaying monsters, too. Crossed hunter rank 300.\" Hell yeah. Put me in, coach. Dave, if you if you're online, make sure you're ready to jump into any of the lobbies. Calling fourth. Trying to kill this chicken right now, Dave. You know what I mean? Come get over here and kill this chicken, bro. Now remember, Mike, when game of the year voting comes around, you enjoyed this. Greg, I want you to know that in my notebook of all the games that I've been playing this year that I've been tracking, Monster Hunter right now is the only other game. There's two games that currently have three stars. next to it being the highest star rating. Oh wow. And so I want you to know that Monster Hunter is on my top 10 three star scale as of right now. It's actually it's actually top uh five top five top three right now. Love that. Keep it Monster Hunter is still up. Uh you know what's number one,",
            "start": 8660.88
        },
        {
            "text": "is on my top 10 three star scale as of right now. It's actually it's actually top uh five top five top three right now. Love that. Keep it Monster Hunter is still up. Uh you know what's number one, Joey? What is it? Schedule one. [ __ ] yeah. Schedule selling drugs. I love What a year video games. Oh my god. What a year. Every you look there's just great games. It's got to be schedule one blueprints launch the wild me. What are are you going to do, Claire? Obscure. Uh yeah, I'll eventually get to it. I played the first hour. It's got a slow first hour. Oh, but so good. Yeah, it's beautiful, but it's just like they give you two fights, Greg, and it's like, okay, what? Yeah, but they give you so much great story. A lot of story. It's a lot of beauty crying. Yeah. But uh yeah, I'm over here like, let me fight. Let me fight. And they're like, not yet, Mike. You got to wait. And then I got off. I got past uh you know, you go out and then uh I was like, you know what? I'm gonna put this",
            "start": 8719.52
        },
        {
            "text": "like, let me fight. Let me fight. And they're like, not yet, Mike. You got to wait. And then I got off. I got past uh you know, you go out and then uh I was like, you know what? I'm gonna put this down for a little bit. I also couldn't get the parry timer for the life of me. You know, Andy blew my mind today saying wait till the last second, like right as it hits. I'll try again. I was going too early every time. I think even though I was getting it, clearly I wasn't getting it up. Mike Mariro says, \"Happy martini Friday, Greg.\" Happy martini Friday. Happy martini Friday. If Jen's saying special dinner, I bet there is a martini in my future. Oh, okay. We like our martinis at the Miller household. Saw a Tik Tok of people using pickle brine instead of olive brine. When we're out of When we're out of olives for there, I'll garnish with pickles or corons or whatever the [ __ ] Jen calls fancy little pickles. Nice job, chicken hunting team. All right, good. Mike, don't get lost in the",
            "start": 8769.44
        },
        {
            "text": "we're out of olives for there, I'll garnish with pickles or corons or whatever the [ __ ] Jen calls fancy little pickles. Nice job, chicken hunting team. All right, good. Mike, don't get lost in the sauce of getting a new weapon. Joey, don't you get in turn in a quest. I might need one more chicken hide. Oh my god. Let me take a look. Let me take a look. [ __ ] chicken. They were just trying to play with my squand. This is what you get for ditching your weapon. Diva is playing again. Hey, what up div? Yeah. Almost stopped talking all [Music] my friends are waiting on me. Just a gabber. She definitely she'd definitely be gabbing. That's right. All right. Where is it? There it is. This one didn't even give me a wig. [ __ ] it. Greg, launch the mission. All right. Here we go. Atrocities going out again. Chicken invitation list. Is that where I'm looking? Uh, yes. I mean, that's not the invitation. So, I know, but it wasn't in there. So, then I was doing something else. Okay, then go talk",
            "start": 8817.2
        },
        {
            "text": "out again. Chicken invitation list. Is that where I'm looking? Uh, yes. I mean, that's not the invitation. So, I know, but it wasn't in there. So, then I was doing something else. Okay, then go talk to one of your people. But hurry. You know they're going to come. Go talk to one of my people. One of the quest givers and go to a party or event people. Oh, I got to go this way then. But invitations would have done it, too. Old man has left in the lobby. God damn it, Mike. Really? [ __ ] don't even say anything. Mike doesn't want to talk about it. It's got to be bumping up against that marathon anti-che probably. bumping. Uninstall marathon ahead. It's bumping. I got kicked out of the link party at some point. That's probably you keep going. If you're in the lobby, you can go to lobby quest. It should work there, too. If you're still in our world or whatever. Goodbye, Sunny Nles. Have a good day. What are you and Jen watching lately, Greg? What's the TV show? Anything? Last of Us,",
            "start": 8891.04
        },
        {
            "text": "quest. It should work there, too. If you're still in our world or whatever. Goodbye, Sunny Nles. Have a good day. What are you and Jen watching lately, Greg? What's the TV show? Anything? Last of Us, obviously. Uh, I think that's really, honestly, the only thing we we, you know, we are somewhere in the middle of White Lotus. I don't think it grabbed either of us this season enough where we're like, we have to watch it. So, it's kind of gets forget forgotten about. We've had guests. We had a guest in town last weekend too in the end of the week. So, it's like you're off there. And then, you know, I always got some dumb in review thing I got to watch. Hey, Jen. Let's waste our time watching Prometheus. We'll both be angry at the end cuz nothing happens and nobody understands what this [ __ ] movie is about. Cam over at the French dip design for 40 months says, \"Happy birthday, Gregory.\" Thank you, Cam. Appreciate everything you do, big dog. Excited to see what the new year brings for",
            "start": 8975.44
        },
        {
            "text": "movie is about. Cam over at the French dip design for 40 months says, \"Happy birthday, Gregory.\" Thank you, Cam. Appreciate everything you do, big dog. Excited to see what the new year brings for you. What's the goal for the new year, Greg? Oh god. You turn 35 years old. You look ahead. Wife, kid, dog, home. What are you going to do? I don't know. Mike, what do you think's on there, Ryzen? I think, you know, it's funny. I got confused when he said the new year cuz I think of, you know, Yeah. for the year. I still think it's kind of funny. He's 10th year. You know what I mean? Like I I think January on birthday is just a fun thing. You're alive. Another year. Congratulations. Here's some cake. Not paint the house. Oh, [ __ ] dude. I'd rather dive into what you have. Get underneath the house, fix the leak or anything like that, you know. Get get in there. I'll just pay people who probably ripping me off the front. What's wrong with my ancient ass house? Oh, funny. But I don't disagree.",
            "start": 9028.64
        },
        {
            "text": "fix the leak or anything like that, you know. Get get in there. I'll just pay people who probably ripping me off the front. What's wrong with my ancient ass house? Oh, funny. But I don't disagree. [Applause] [Music] [Applause] They put on a concert here. What's up with this? Yeah, demon. Oh, yeah. There it is. attack. Just [Music] die. Mr. Nice guy Ry with the $5 scoop chat says happy 50th Greg. The Gillian brothers love you. Well, Zach and I do. John's on the fence. So, two out of three ain't [ __ ] John. [Music] Can you invite me back to the link party? Yeah. I don't want to fight you. No interest. [Music] 93. Mike, 93 is a big deal. We got two hours. Two hours on the clock, man. You got to get to like 95 here in a minute. You got to hustle up, Mike. You going to get back into this game when the inevitable DMC armor drops in this game? Is that an O? Is that Is there something that happens like that? They got a chance for that? Well, you know, Capcom's going to be doing crossovers.",
            "start": 9098.72
        },
        {
            "text": "when the inevitable DMC armor drops in this game? Is that an O? Is that Is there something that happens like that? They got a chance for that? Well, you know, Capcom's going to be doing crossovers. So, you gonna put a little crossover, a little Dante, maybe Virgil in this. Rocking that Virgil blue, Dante red. Yeah. Okay, Joey, you got an invite now. Yay. You're back, Joey. I'm so back. [Music] Yeah. One of these days I'm going to understand the menus in this game. But that day is not today. Not today. All right. I'm going to throw out another one. Okay. Yeah. Everybody ready? Yeah. Benjamin with the $5 super chat says, \"Thanks to kind of funny on our Lord and Savior's special day.\" Thank you. Happy birthday. And Drake Summers with the Prime Gaming stuff for 16 months celebrating Greg's birthday. Thank you so much. Everybody's having fun out there. I am on my way. I like this. Uh I like when the monster comes. Yeah. But I I'm supposed to like racing. Well, I think it's also when you",
            "start": 9321.36
        },
        {
            "text": "birthday. Thank you so much. Everybody's having fun out there. I am on my way. I like this. Uh I like when the monster comes. Yeah. But I I'm supposed to like racing. Well, I think it's also when you have to go somewhere far away from where you are. Like you're tra it's like fast traveling you to a new area. I would just kind of rather fly than drive, you know. Counter hurry for hearts unknown. Greg is 93 big dog. 93. Getting there. Aiming to get to 100 out for his birthday. [Music] Showy's down. It's just like you might as well just kill me on the first shot if you're not going to let me get up and get out of the way, you know? Have we gotten you a new armor set? Are you still rocking the low stuff? No, I'm working on it, but I a bunch of higher level stuff. Get away. Listen, sometimes got to do it. You got to do it. You got to set up shop. You got to eat. You got to make sure you got your food. Now we Do we do say you have to carve up the carcass, right? You have to. Yeah. I mean,",
            "start": 9395.92
        },
        {
            "text": "got to do it. You got to do it. You got to set up shop. You got to eat. You got to make sure you got your food. Now we Do we do say you have to carve up the carcass, right? You have to. Yeah. I mean, you still get quest wars at the end, but you get more by doing that. You get more by doing that. Yeah. The question is is because we got the spider chases up here. So, now we're fighting for our lives next to this while trying to get the dead body, you know? And it's like, what if I couldn't get that? What would happen here? Then leave. I mean, focus on the enemy at hand. Eventually, you chase that enemy off, right? Usually when you damage them enough, they run for a little bit, right? Then you can pick up then chase the one that's alive. Oh, no. No. I mean, so like my my hunt just died. Clock clicks on 30 seconds, but then the spider is now on top of its carcass freaking out. Got it. Usually. All right. You got to back up. I feel like usually the AI stops attacking. Okay. Yeah, we",
            "start": 9573.56
        },
        {
            "text": "Clock clicks on 30 seconds, but then the spider is now on top of its carcass freaking out. Got it. Usually. All right. You got to back up. I feel like usually the AI stops attacking. Okay. Yeah, we handled that. Great job, people. One more. One more chicken wing and we're there. Chicken wing. Chicken wing. I got chilling with my homies. One of those. You guys know the song. Is that how it goes? Yeah. Chicken wing. Chicken wing. Chilling with my homies. Video games journalist with the $5 um super chat right says, \"Happy birthday, Greg.\" Thank you. Come on now. We'll sing that while making Lulu dance. Hell yeah. I forget what exactly was happening, but Jen and I were in the bedroom having a conversation. And it wasn't a fun one. We weren't fighting, but it was serious or whatever. I forget what was going on. And Ben just burst through the door. Chicken wing. Chicken wing. Like, all right, buddy. Why don't you go out there? Mom talking about something. Get after. And like I pushed him",
            "start": 9679.44
        },
        {
            "text": "what was going on. And Ben just burst through the door. Chicken wing. Chicken wing. Like, all right, buddy. Why don't you go out there? Mom talking about something. Get after. And like I pushed him back out. I shut the door. Then he opened it back up. like no solicitors and pushed him back out. Is he instantly just like, \"Okay, guess he doesn't accept that answer. He comes right back at him.\" That's what that was all about. Okay. Okay. You sit on the armor. We want to get on that stronger armor now. Mhm. Yeah. Fire. That way. Just die. You could. Oh, okay. Okay. Okay. What if we just got out of the way? Okay. I don't know if I need this other monster chasing the add to the fun. Yeah. Just Nice job team. Jess says, \"Do these monsters have help bars or am I missing it?\" They do not. You just fight for your life. So many people hate it. I love it. You'll see them break down, their patterns change, then the skulls around them when they're close to death. Yeah, but like I hear you. [Music]",
            "start": 9745.68
        },
        {
            "text": "fight for your life. So many people hate it. I love it. You'll see them break down, their patterns change, then the skulls around them when they're close to death. Yeah, but like I hear you. [Music] Willie hears you. Willie don't care. Here comes Greg right now. 93. Where's he going? Almost to 94. Almost to 94. Chat, we're celebrating Greg's birthday today. Playing all things Greggy's favorite games. It's Monster Hunter Wilds. We're playing it all afternoon. We'll be back right after a word from our This episode is brought to you by Imperial. We have told you all how important it is to developers that you wishlist the games you're interested in. So, if this sounds cool to you, make sure you wishlist it. I can't tell you how much it helps. Imperial is a complex, featurerich action RPG where you'll be sent to a planet in a far-off corner of the galaxy to explore an enormous imposing monolith. As an elite mercenary, you'll join the expedition tasked with unearthing the secrets of the",
            "start": 9915.12
        },
        {
            "text": "you'll be sent to a planet in a far-off corner of the galaxy to explore an enormous imposing monolith. As an elite mercenary, you'll join the expedition tasked with unearthing the secrets of the monolith and face off against the deadly automatons within. In Imperial, you'll explore four vastly different quadrants of the monolith, accessible only by using mysterious artifacts known as cardoggrams. Each card affects which enemies, boss fights, and loot will appear when you enter the monolith. So, no two excursions will be the same. Find even more cardiggrams to explore by looting defeated enemies or buy them from other players online at the trading post. You'll need to make sure you have the right gear to take on the harder cardiggrams. Build your mercenary, choose your gear, master your abilities, and take down everything in your path in Imperial. Face off against enormous deadly bosses, and seek out secret paths to find bigger and better loot. Help the members of the expedition in",
            "start": 9979.44
        },
        {
            "text": "abilities, and take down everything in your path in Imperial. Face off against enormous deadly bosses, and seek out secret paths to find bigger and better loot. Help the members of the expedition in deep branching quests and aid other players in asynchronous multiplayer. Get ready, mercenaries. The monolith awaits. Imperial is available May 8th on PC, Xbox Series X and S, and PlayStation 5. Wishlist now. It helps so much. Wishlist Imperial. This episode is brought to you by Aura Frames. If you haven't called your mom in a while, here is your reminder to do it. But if you want to go above and beyond beyond Mother's Day is coming up, and I have the perfect gift idea. Aura frames are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preload it with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special, they'll use it every",
            "start": 10022.32
        },
        {
            "text": "to the frame. Plus, you can order the frame online and preload it with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special, they'll use it every day. Me, Kevin, and a ton of people at Kind of Funny are obsessed with our Aura Frames. It takes about 2 minutes to set up the frame using the Aura app. Aura frames were named the best digital photo frame by Wire Cutter and featured in 495 gift guides last year. I counted. Aura has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting orura.com to get $35 off plus free shipping on the bestselling Carver matte frame. That's auraframes.com. Promo code kind of funny. Support the show by mentioning us at checkout. Terms and conditions apply. And we're back. Woo! Welcome back everyone to Greg's birthday. Here we are playing some more Monster Hunter. Greg has got one goal. Make it to Hunter rank 100 before he goes home to the family tonight. Can we do",
            "start": 10069.84
        },
        {
            "text": "Woo! Welcome back everyone to Greg's birthday. Here we are playing some more Monster Hunter. Greg has got one goal. Make it to Hunter rank 100 before he goes home to the family tonight. Can we do it? Let me know. Yes, we can. Come join the fun. Come battle with Greg, Joey, and myself as we all go on hunts and uh celebrate Greg's favorite game right now. Watch Hunter Wilds. I've decided that my goal is to surpass uh Mike's hunter rank. Oh, wow. Okay. I like that, Joe. Okay. Okay. The way because you keep getting kicked out. I keep getting kicked. Oh, you get closer and closer. I love that. Well, I'll keep giving you the updates and you just keep chasing, right? Cuz you're almost there. Yeah. I've moved on to now that I've gotten the sword, I have to get the armor. As Greg said, Mike and Joey, are you in your level two armor yet? And I say, no, Greg, I'm not. And say, okay, Mike, time to go get some then. Okay. Okay. I don't know where I'm supposed to go. I'm sometime gaming with the T1",
            "start": 10133.84
        },
        {
            "text": "are you in your level two armor yet? And I say, no, Greg, I'm not. And say, okay, Mike, time to go get some then. Okay. Okay. I don't know where I'm supposed to go. I'm sometime gaming with the T1 for 37 months. People want to know, Greg. No scheduling or budget issues. What's the ideal birthday for you? Oh man. Uh, great question. I guess uh, you know, it would be a mix of everything, right? So, go throw the ball with Ben cuz it turns out throwing baseballs is fun. Who knew? Keep the mitts in the back of the car. You never know. You never know. Uh, Mike way. Maybe get a beer at a beer garden brew pub for lunchtime. Okay. Okay. Okay. Get to play some games in the afternoon. Uh, probably get either been to a Yeah, probably get a babysitter, I'll say, and then go out with Jen, you know what I mean? Maybe taking a movie at the Alamo Draft House. I went to Alamo for the first time this week in months, years, maybe. It's been a long time for us, too. It's perfect. Like, since Beetlejuice,",
            "start": 10186.4
        },
        {
            "text": "I mean? Maybe taking a movie at the Alamo Draft House. I went to Alamo for the first time this week in months, years, maybe. It's been a long time for us, too. It's perfect. Like, since Beetlejuice, but still, it feels long. I'm really looking forward to this Giants game uh on Sunday. We haven't been in a while. Where's the dream seats for you and the family? Where do you guys like to sit? You know, we were bleacher bums last time. Uh in the center field. Yeah. Yeah. Out there. And this time we're over on the first baseline. So, I'm excited about that. Love the first base line. That's why I got to bring that bit. Catch a foul ball. You know, put it right up. Save the day. Save. Yeah. Yeah. Yeah. He's probably better at me. Look at that. I'm so sad that they moved the bullpens because it used to be fun to sit on the first baseline. Sure. Where are they now? They're like back. Oh, really? Wow. Yeah, they were one of the last remaining MLB uh stadiums that had the bullpins where you'd",
            "start": 10263.84
        },
        {
            "text": "used to be fun to sit on the first baseline. Sure. Where are they now? They're like back. Oh, really? Wow. Yeah, they were one of the last remaining MLB uh stadiums that had the bullpins where you'd actually be right up outside. They don't do that anymore. Such a bummer. So, they also got the giant nets now too along the uh foul line. So, you're not really getting smashed with balls, but they're still Also, they changed the Coke bottle stuff, too. Yeah, I saw that it's like a different You do more with it now or I think it has like LED on it now instead of just the Tim's piss. It's not OLED. I got an ad yesterday for another Han Zimmer performance and I was like got to put it on the calendar now that Tim's going to be out. Now, do they sell upgradables? So, like what I'm getting at is like I'm missing a dragon bone relic. I'm missing a fire stone and a wing wing drake hide. Are those like things you got to find out in the world then? Yes. But there is a and I'm not familiar with the",
            "start": 10304.0
        },
        {
            "text": "I'm missing a dragon bone relic. I'm missing a fire stone and a wing wing drake hide. Are those like things you got to find out in the world then? Yes. But there is a and I'm not familiar with the very specific things you just brought up. There is a when you talk to Nata, he offers you trades from other towns and stuff and I have found stuff that I had marked there. So, it's always worth to check in with him across from Alma in your tent. The little boy. Oh, yeah. My little boy. Yeah. Yeah. Yeah. Yeah. Where's my little boy? I wish I could help you because I have so many winged drink hides in my Monster Hunter. Oh, God. I know. Oh, he's just swimming at him in mos running. Mhm. No, don't be running around this festival thinking you can have fun. Get back to the tents. Where are you? And then obviously once you wishlist them, it'll show up on your screen when you're selecting missions if that. Okay. Okay. Yeah. Yeah. Yeah. That does a good job. Make sure you we understood. Um but yeah,",
            "start": 10378.88
        },
        {
            "text": "obviously once you wishlist them, it'll show up on your screen when you're selecting missions if that. Okay. Okay. Yeah. Yeah. Yeah. That does a good job. Make sure you we understood. Um but yeah, now we're getting into like the the weird smaller things. Wing drinks you just find flying in the world and use your grapple to knock them out of the sky. Damn. Give me all of it. But you can't even share resources in this. I don't know. All right, there's 94. Mike, 94. Joey, I'm 33. Almost 34 for an update for you. I'm midway to 31. He's on the move. Where the hell is this kid? He left guys. I need you to crash Mike's game just like a couple more times, but not in a way that like kills his will to live. Yeah, I'm feeling good now that I'm actually gaming. So, that's a positive. It only took all day. Natada, where are you? It only took all day. I'm dropping the same one again, Joe. We're going back. I'm ready. A child. I have a child. Billy Zane. God, he's so good in Titanic. Like the",
            "start": 10428.0
        },
        {
            "text": "all day. Natada, where are you? It only took all day. I'm dropping the same one again, Joe. We're going back. I'm ready. A child. I have a child. Billy Zane. God, he's so good in Titanic. Like the perfect little [ __ ] villain, but also so charming when he wanted to be. Okay, let's move out. I put the diamond the girl. Oh my god, Mr. Showtime, you're so right. We should give Greg another present. He has two more. I wonder what they can be. Two more gifts. Another gift. What could it be? What do you think? I ordered another Palico. Oh, this time I can have I can turn him inside out, though. He can match all his friends. Reversible, Chad. Not many not many Monster Hunter toys available. I'll tell you what. Well, boy is Greg going to get all of the ones that are. Yep. I get a set. Ben gets a set. It works out perfect. Everybody gets a couple. Right. Here we go. You got to respect Natada. He's just decided not to be present and he went home. Okay. Did you go to your tent? Yeah, he's gone.",
            "start": 10487.44
        },
        {
            "text": "set. It works out perfect. Everybody gets a couple. Right. Here we go. You got to respect Natada. He's just decided not to be present and he went home. Okay. Did you go to your tent? Yeah, he's gone. Your big tent, not your little tent. No. Yeah, the big tent. He's gone. I found in the in the new like uh place they like to get up and walk around. Like Alma will take a walk. All right, Alma, sit down. We're not walking here. I need you to be predictable. I need you to be where I think you are at all times. sort by a first name with the $10 super chat says, \"Happy birthday, Greg.\" Just saying. I had Ben Star, best known as the guy interviewing Greg Miller at PAX. That's right. Wish me a happy birthday as Clive on Kind of funny last month. What did What did he ever do for you? Huh? I mean, he got me one of my stars cuz he got it for Tim and then I stole it from Tim. Oh, nice. That's a good way. So, you got to thank Ben Star for being amazing. You see that? That's how he did it. That's",
            "start": 10550.56
        },
        {
            "text": "he got me one of my stars cuz he got it for Tim and then I stole it from Tim. Oh, nice. That's a good way. So, you got to thank Ben Star for being amazing. You see that? That's how he did it. That's the map he always shout out to Roger for getting Andy this one star. Shout out to Roger. Where is this? Start calling it Roger Star. Yeah, we should do that. Actually, Joe, that's a great idea. You've had so much focus on Tim from the last few months that Andy's just been skating by. Not on Joey's watch. Yeah, nobody's been caught on that. He had zero stars here this season. Andy criticized me for not doing enough damage in this game and now has my entire focus. I imagine he'll get he'll get Greg's focus soon. We can only hope. It's been a while. It has been. I've been itching to get, but I've just been having so much fun torturing Tim. I mean, celebrating, too. Yeah, celebrating. For sure. I did have a momentary thought when you got a package. I asked. I was like, do you think Tim's",
            "start": 10642.0
        },
        {
            "text": "I've just been having so much fun torturing Tim. I mean, celebrating, too. Yeah, celebrating. For sure. I did have a momentary thought when you got a package. I asked. I was like, do you think Tim's starting his revenge? Do you think Tim has it in it for revenge? No, Tim's too pure. He's the pure one. And he knows a war of escalation. He goes a little bit a little hard. If you engage even a little bit with me. Yeah. Then it's on. This is what I did when you when you weren't participating. I look what I did. Now you're down to rough house. You got a problem. And you know what did happen? Chrisa, god forbid Elma have hobbies when she leaves. Sounds familiar. Alma's got a lot of unaccounted for hours, Chris. Lot unaccounted for hours. What's he doing in there? He's live streaming a 10-hour live stream of himself, but it's just a video of himself, you know? Yep. Like, come on now. We want to see you play. All right. Where's He's lost. I've lost this. Find Nata again, Chad. I'm telling",
            "start": 10695.76
        },
        {
            "text": "live stream of himself, but it's just a video of himself, you know? Yep. Like, come on now. We want to see you play. All right. Where's He's lost. I've lost this. Find Nata again, Chad. I'm telling you, this child is gone. Do you think that Nata found home? Yeah, we found his home, remember? And they were like, \"You don't want to be here no more.\" Oh, that's right. It's time to go to sleep, big guy. Come on. It's someone who has to do with Mike. I don't fault her for taking a walk sometimes. They say Mike. He's in his tent. Gregy's going to look right at my tent right now. He's right, folks. He should be right there. Yeah, the kid's gone. Step in your tent and come back up. Do you think that this is part of a research opportunity? Thank you. Yeah, the little little octopus band. Yeah. Right. Yeah. And I've I've gone to different regions to see if Natada will just show up out of nowhere, but he's decided he must be on a mission. Blue exclamation gone forth. Kanye was talking. Yeah,",
            "start": 10768.96
        },
        {
            "text": "Right. Yeah. And I've I've gone to different regions to see if Natada will just show up out of nowhere, but he's decided he must be on a mission. Blue exclamation gone forth. Kanye was talking. Yeah, that's got nothing wrong. Natada. Nada. Where's Nata? Not around here. Uhoh. [Music] Who wants to talk? Oh, the fishing lady. No, lady. I'm good. That's what I I don't want to talk to you. Yeah. No. No. You already got me looking for a goldfish that I can't figure out. Just like realistically, if I'm playing this game, I don't want to go fishing. That will never happen. I'm never going to play this game and go fishing. No. Halfway to 32. Yeah. Coming for your ass, Mike. Nice joke. Good stuff. Just a one-sided beef that Mike doesn't care about at all. Haha. Laol says, \"What's Andy up to right now?\" Great question. You know what I mean? Where is he? You're not hanging out with us. Not hanging out with us on Greg's birthday. Mhm. Just so rude. Had the main goal of just leaving. Said, \"See",
            "start": 10831.84
        },
        {
            "text": "now?\" Great question. You know what I mean? Where is he? You're not hanging out with us. Not hanging out with us on Greg's birthday. Mhm. Just so rude. Had the main goal of just leaving. Said, \"See you fools.\" What are we running this time? Same thing. Same thing. It's It's You know, I think for your level, I think you can give us the most XP the fastest, right? We're cleaning it out in 5 minutes. though. I mean, you figure every So, that's a level every 10 minutes basically. I'm into that for me. I'm a level every time. I think we got this. [Applause] We got this. I wish I should bring What do you have planned this weekend, Mike? Nothing. I have two weeks left with Big Mike before he goes back home. So, I was thinking about getting in the car, but then Andy's got me signed up to play Gears of War with him at noon tomorrow. So, I'm like, now I can't go see dad. I like how Okay. You know what I mean? And he didn't like sign you up blindly. He asked you, I'm sure, if you wanted to do",
            "start": 10914.24
        },
        {
            "text": "of War with him at noon tomorrow. So, I'm like, now I can't go see dad. I like how Okay. You know what I mean? And he didn't like sign you up blindly. He asked you, I'm sure, if you wanted to do this. Yeah. Just so you know. I love that Mike has to hang out with everybody until he actually has to hang out with everybody. Did you listen to that airing of grievances, Greg? That I started too. Yeah. God damn. We had fun. That was good. When Andy got mad at me for spring break. That was pretty good. ridiculous, you know. It's just He just wants spring break, too. Is Oh [ __ ] I'm fighting a new monster. That's cool. Never seen this monster before. Oh [ __ ] it's [ __ ] me up. It's blowing bubbles at us and stuff. It's a dragon. This And then we time to move. chat seems to be excited about whatever you're fighting. Yeah, I'm fighting the new monster. It's pretty cool. Oh, Matsuna. Yeah, it's cute. It's a cool looking monster. Watch out for them bubs. He's going to spit some bubs at you.",
            "start": 11020.24
        },
        {
            "text": "you're fighting. Yeah, I'm fighting the new monster. It's pretty cool. Oh, Matsuna. Yeah, it's cute. It's a cool looking monster. Watch out for them bubs. He's going to spit some bubs at you. Yeah, spitting a lot of bubbles at us. Uh, and you know what else, Joe? I could potentially go on a date this weekend. Whoa. Uh, first time meetup. Uh, I'm tempted to not do it. Um, but so here's the catch is I love going on uh a nice little first-time meetup slashdates. I really want that in my life as many of you know. Uh the issue is I'm not happy with myself right now. Uh and so I'm not really in the mood to go out there and meet this person with my big old belly. And so there's a high chance I won't do it. But at the same time like oh man, cute chick, nice fun date. I'm down for that. You know, go do it, Mike. Have fun. We'll see. We'll see. Just don't wear like the Superman t-shirt and the I lost it again. Not happy about it. It's gone forever now. That one's definitely gone. So, we'll see.",
            "start": 11155.92
        },
        {
            "text": "do it, Mike. Have fun. We'll see. We'll see. Just don't wear like the Superman t-shirt and the I lost it again. Not happy about it. It's gone forever now. That one's definitely gone. So, we'll see. We'll see on that one. Andy's got me staying here, so I might as well. Yeah. You know, Andy lockdowns of war. That's what he did. [ __ ] Andy lock [ __ ] locked me in here, right? So, then you get the fun options of a mic date, right? Early morning, you know, I'll give you a Sunday morning. We can meet up, go get coffee, walk Marina Greens, look at the bridge. Love that, right? San Francisco Giants game. You want to go out for an afternoon, go get a hot dog. Crash Greg's birthday to Greg and his family. Doing it. We act like we don't know you. I tell Ben to fake like he's choking and then you say, \"Save his child.\" Uncle Mike, I'm choking. No, no, you don't know, Ben. You don't know. I mean, you look like my uncle Mike. Haha. Um, rollerblading in the park. This girl's down to rollerblade.",
            "start": 11205.12
        },
        {
            "text": "say, \"Save his child.\" Uncle Mike, I'm choking. No, no, you don't know, Ben. You don't know. I mean, you look like my uncle Mike. Haha. Um, rollerblading in the park. This girl's down to rollerblade. So, what we were going to do is we're going to go Facebook Marketplace, buy some rollerblades from a crazy SF hippie so we can hear all the stories, right? Cuz you know, you always get good stories from that, I guess. So, and then go uh rollerblading in the park would be a lot of fun. The little outdoor roller rink is so fun. Yeah, especially I think it's Sunday afternoons where they have like live maybe a some sort of musical aspect to it. Could be fun. That's right. Where's the add to a roller ring? Um, it's right by keys are. Huh. Yeah. The last time we did the Facebook market. I mean, it's just like painted on the thing. Yeah. Yeah. Yeah. It's not crazy. Was when me and Roger went to go get his uh outdoor patio furniture. Mhm. From an old Italian man who had owned it for about 74",
            "start": 11256.08
        },
        {
            "text": "it's just like painted on the thing. Yeah. Yeah. Yeah. It's not crazy. Was when me and Roger went to go get his uh outdoor patio furniture. Mhm. From an old Italian man who had owned it for about 74 years and it was just falling apart. And Roger's like, \"We're going to unscrew it all and then we'll put it back together.\" I was like, \"Roger, if you unscrew this, it will never back together.\" That is the end of its life cycle. Would that guy had every story under the book for us? So, you know, something like that would be fun. I can only imagine. Where'd you meet this woman? Uh, Hinch. Okay. So, yeah, we have some fun stuff like that I could do. Or nothing. Or nothing. Play Oblivion again. Does she think you guys are going on a date this weekend? Uh, she was like, \"Hey, I'm free this weekend. If you would like to meet up with me, here's your opportunity.\" And so I'm right here sitting on the text message of like I can write back to this girl and say I would love that. Let's go do that.",
            "start": 11299.68
        },
        {
            "text": "If you would like to meet up with me, here's your opportunity.\" And so I'm right here sitting on the text message of like I can write back to this girl and say I would love that. Let's go do that. Or hey uh this weekend is a no for me. 95 Mike 95 people. I know I got no time to lose but what when what I'm looking at this old Oh yeah. I'm I'm surprisingly still fighting this thing. Hot link is here. Great. Perfect. Thanks, Hot Link. We're going right back to shipping with time, everybody. No time. I'm hunter rank 32 now. So, can we bump bit? Isn't Is there another one? Here's my thought on that in chat. Feel free to get involved with this one. We know we can do this in five minutes. We know it basically gives us a half bar every time. So, again, every 10 minutes would get me up. So that would mean if we if we keep that pace unless we hit 100 no problem but by rap versus something that's gonna you go in it's gonna go in it's going to be a longer fight and then do we get as much XP out",
            "start": 11344.64
        },
        {
            "text": "mean if we if we keep that pace unless we hit 100 no problem but by rap versus something that's gonna you go in it's gonna go in it's going to be a longer fight and then do we get as much XP out of it? I don't know chat I'm w I welcome your suggestions on that. But I feel like we got one in the hand. Let's not go for the two in the bush, you know. Yes, exactly. I'll just hop off for Alex says, \"What about lucky vouchers? Doesn't lucky voucher only help me with my uh items out of it? Does does it increase my HR too? Cuz I have lucky vouchers. I haven't I haven't been using them right now. Your little paws so hurt. I hate that for you.\" No sympathy. But I will still fling arrows into your face. It gives more money. I swear to God, Alex, it's not that hard to keep up with the conversation. We're worried about Hunter rank points. I'm sorry, Alex. No, I'm kidding. No. Hey, boo boo. I'm just kidding. And see, like Yeah. So, it's just rewards, J man. So, I am on the right page. If I don't",
            "start": 11400.0
        },
        {
            "text": "We're worried about Hunter rank points. I'm sorry, Alex. No, I'm kidding. No. Hey, boo boo. I'm just kidding. And see, like Yeah. So, it's just rewards, J man. So, I am on the right page. If I don't need rewards off this man, just quick XP. Yeah, then you might as well save that. Yeah, I'll save it for when I'm grinding on whatever I'm grinding on next. Grinding. I'm going to make some really cool armor when we're done. Yo, you're going to have so much. You're talking about you. You're talking about wanting some uh level two. You're going to be rocking level two dishw remember with level two you can do transmog. Oh hell yeah. So you can get the best armor you can get and then you know or whatever vice versa and then keep a style and switch it up and yada yada yada. I think I've made the executive decision that I'm just moving my PS5 into my bedroom instead of my office. Like I pretty much only play Steam games in there. Sure. And I will probably end up playing way more of this curled",
            "start": 11468.08
        },
        {
            "text": "decision that I'm just moving my PS5 into my bedroom instead of my office. Like I pretty much only play Steam games in there. Sure. And I will probably end up playing way more of this curled up in my bed than I will like at my desk. Just don't even run. You're just going to die. I know. We're kicking his ass right now. We are moving. [Music] Get out of here. Nobody's got time for you. Leave us alone. Okay. I would like to not be on fire. Ah, destroy. Okay. Okay. Oh, I don't Where are you taking me? Fall. What do I need? Uh, squad. I need to fight another one more Wrath low. So, we'll do that in a second. There we go. There we go. Let's just roll. Sword by first name says, \"Greg for your birthday. I got myself tickets to the PlayStation, the concert in London on Sunday.\" Hell yeah, you did. You deserve that. That sounds nut. Okay. Are they doing that here or is that just [ __ ] with his child abroad. I don't know. Feels like something we would have known about. Yeah, like that feels",
            "start": 11559.44
        },
        {
            "text": "You deserve that. That sounds nut. Okay. Are they doing that here or is that just [ __ ] with his child abroad. I don't know. Feels like something we would have known about. Yeah, like that feels like a Well, it see it does, but it seems like something I would have read on Games Ali and then forgotten about that since I was like, I'm good. But Tim would be all about it. Mhm. Just here for now. Well, that makes sense, I guess. Stay right there. Oh, I need to cook in our little before I accept this next. You got no time. No time. Cooking on the battlefield. I get it. We'll be the first time. We'll be the [Music] last. Oh yeah, it is like 5 minutes flat. Just shy 95. Talk to Nada. If you want, let's run and cook real quick. Or you're going to eat at the I'll run and eat with thing. No, I can. I'm just going to do it. We're here. We're eating. We're eating. We're eating. Oh, you're not even at the right place. No, I was just going to do the grill. Okay, go do it. [Music] Look how fast",
            "start": 11715.04
        },
        {
            "text": "can. I'm just going to do it. We're here. We're eating. We're eating. We're eating. Oh, you're not even at the right place. No, I was just going to do the grill. Okay, go do it. [Music] Look how fast that was. Amazing. Yeah. [Music] ation list. [Music] The field sent us items. On my way. Oh, never mind. Oh, lied. Did she not get in? No, but it's fine. No, see, no. Dawn withdraw withdrew from the quest. Oh, okay. Joey's in her own world now. Oh, no. She's But I can come. We don't have the time for this kind of mistakes, everybody. Your [ __ ] together. Do you understand? We're running fiveinute drills here. Can we do it faster than like 450? Coming back in. Thank you, Alex. [ __ ] What are you doing? I've somehow happened upon a whole quest line out of nowhere. You're like, \"This is not click. I click the button. They're like, oh, I have to take you somewhere.\" You're like, \"No, no, no. I don't want that. I got to go slay a monster.\" Oh, that's [Music] Well, dang. You're in the snow.",
            "start": 11779.04
        },
        {
            "text": "I click the button. They're like, oh, I have to take you somewhere.\" You're like, \"No, no, no. I don't want that. I got to go slay a monster.\" Oh, that's [Music] Well, dang. You're in the snow. Yeah, we're all we're moving around the world right now. We're globe trotting. Listen, whatever you got to do to get your globe trotting monster popping. What are you looking for? Sword shield. Yeah, well, no. I'm looking for my rathalos armor to be complete, but I need I need small things now. I need to find red stone. I got to somehow grapple little flying monsters, which I don't even remember the grapple button. God. Is it just the slingshot thing with circle circle when you're on your um safe rate? You know, might save my day. Let's find out. Why do you guys always want to fight in the middle of our fight? I'll d them. Let me get away from the rock. We got these little ones. Joe, did you ever finish Lost Records Bloom and Rage? No, I never went back and did the second one. Um, it's on my",
            "start": 11899.76
        },
        {
            "text": "of our fight? I'll d them. Let me get away from the rock. We got these little ones. Joe, did you ever finish Lost Records Bloom and Rage? No, I never went back and did the second one. Um, it's on my list, but I just been playing so much schedule one. Sure, sure, sure. Though I do, Last night I was like, I think I am reaching like a getting your fill point. Yeah. Where I'm just like I might be done unless there's something more fun that unlocks after I got that cuz now it's just like I have too much stuff in my warehouse and my dealers can't sell it fast enough. Uh and I have too much cash and I can't launder it fast enough. So now I'm like well white problems over here. I know I have like $60,000 in cash that I can't really do anything with. You've beat the game at that point. You've done it. Yeah. But I want to launder it all so then I can buy more buildings and businesses. Good job everybody. We're doing it. [Music] Oo, that was down to 421. like to see 96. Mike Joey, where you at?",
            "start": 12022.4
        },
        {
            "text": "it. Yeah. But I want to launder it all so then I can buy more buildings and businesses. Good job everybody. We're doing it. [Music] Oo, that was down to 421. like to see 96. Mike Joey, where you at? I'm at 33. Joey, though. I know you're I mean, you're killing things left and right here also. Yeah, I'm putting a little distance on you, but I'm still right there. I think I'm like 34 35, so you're right around the corner. If you're killing things in 4 minutes and 21 seconds, you're tracking well. [Music] Josh is claiming he could shave 30 seconds to a minute off with his boomstick. You're welcome to join. Oh, wow. Wow. Big claim. Seen it all happen right before your eyes, Josh. Big claim. That's my boys next door checking on the car. Oh, homie. You got to love him. That's so funny. I'll see you back. I thought we were in the Silent Society. I hate that the silent society has died. I don't ever want to hear a single a beef, a buzz, anything for my today. I was in an awkward spot where I",
            "start": 12107.28
        },
        {
            "text": "you back. I thought we were in the Silent Society. I hate that the silent society has died. I don't ever want to hear a single a beef, a buzz, anything for my today. I was in an awkward spot where I came off Games Daily and was at my desk for a little bit and Roger had disappeared. like people were looking for him like I don't know what he just went outside or something and there was an alarm going off on his computer a timer but it was like still coming through his headphones and it was like loud enough that it was like not annoying but I was like I want to stop this but I know if I stop it I might not see Roger when he comes back and I feel like I'm going to his timer was important I don't know you know I was like ah just got to live through it just power through it's always crazy to me when I encounter somebody in the wild that has their keyboard board clicks on cuz that feels like the most anti- silent society thing, but it doesn't it feels like a rare thing these days. Oh yeah,",
            "start": 12192.24
        },
        {
            "text": "when I encounter somebody in the wild that has their keyboard board clicks on cuz that feels like the most anti- silent society thing, but it doesn't it feels like a rare thing these days. Oh yeah, for sure. Get out. David Gors says, \"I love when you guys go later on a Friday.\" I do, too. Yeah, it's fun. It's a good Friday vibe. Heat. Heat. You guys are dancing a lot over here and it's making it hard to figure out. Kill them all. Insanity on the screen right now. What a gorgeous looking game. I love it. Cool. I missed that charge. That's not good. There we go. This thing's a trouble with me. Dana car. Okay. Uh, yeah. They actually can't figure out what's wrong with it. Ghost. He's like, \"It seems fine.\" Like, \"All right.\" What was that? What were you What was happening? Uh, it's like slide. Whenever I try to break, it's like doing this weird uh sliding thing where it's not quite catching fully. Okay. And then you'll see it go like and then it will break. Um Kevin gives a great face",
            "start": 12241.44
        },
        {
            "text": "Whenever I try to break, it's like doing this weird uh sliding thing where it's not quite catching fully. Okay. And then you'll see it go like and then it will break. Um Kevin gives a great face whenever I pull out of the parking lot and it happens like that. Um and he's like, \"No, it seems fine to me.\" I'm like, \"All right, sounds good.\" I'm like, \"It's clearly not. Who's not doing it? Get us out of here.\" [ __ ] it. Not me. These seconds are precious. Don't you understand the mission you're on? Kind of funny guild. Less than an hour now. 57 minutes. We got this. I believe so, too. 4:36. So, we didn't shave off time if that person joined us. You lying piece of [ __ ] Oh, wow. They said they'd shave off a whole minute. They didn't do it. We're just shy of 96 right now. Oh, perfect. Somebody have to turn for [Music] Jeff says, \"Joe, you're going to watch the final season of You this weekend.\" What the? I fell off of you probably two seasons ago, three seasons ago. The one after he and",
            "start": 12477.68
        },
        {
            "text": "have to turn for [Music] Jeff says, \"Joe, you're going to watch the final season of You this weekend.\" What the? I fell off of you probably two seasons ago, three seasons ago. The one after he and Love were like living in suburbia. So, uh, sounds like Joey will not watch it this season. No, right now I need to watch the studio cuz I'm watching Oh, I've heard so much about that. It's really good. That's Apple. Yeah, it's really fun. And I'm catching up on like a lot of my [ __ ] TV, which is like 911 and Dr. Odyssey and all of those essentially really bad Ryan Murphy shows that I love. Um, and then I was like scrolling around cuz I like wasn't I was like, I don't want to watch reality TV. I don't want to watch this Ryan Murphy stuff. What do I want to watch? So, I'm now on season 3 of Big Love. from HBO. Oh, Bill Paxton. Yeah. Jennifer Goodwin and Chloe 70. It's like the show, right? Yeah. Yeah. Um and it's actually really good. It's like old HBO good. Sure. Um but it's it Bill",
            "start": 12546.88
        },
        {
            "text": "of Big Love. from HBO. Oh, Bill Paxton. Yeah. Jennifer Goodwin and Chloe 70. It's like the show, right? Yeah. Yeah. Um and it's actually really good. It's like old HBO good. Sure. Um but it's it Bill Paxton's really good and I feel like I only really know him from like roles. So something like a little more serious. Goodbye, Frog. Oh, and I have like one more episode of Black Mirror. Oh, I haven't started. Or was it a good season? I really liked probably two of the episodes. One there were a couple that were fine and then maybe two that I was like halfway through and I was like, I don't care about this. Got it. Stop watching. And then I think I maybe have like one left and I think it's the USS Callister. Sure, sure. Sure. I've heard a lot about them. Um, but the two that I I feel like that's kind of how I go every season where it's like there's some that are fine, there's some I really like, and then there's some that are absolute bangers. Yeah. Yeah. The one with um Cheetah jumps I",
            "start": 12614.96
        },
        {
            "text": "kind of how I go every season where it's like there's some that are fine, there's some I really like, and then there's some that are absolute bangers. Yeah. Yeah. The one with um Cheetah jumps I really like. I think my first Hurry up. Mike, are you watching anything right now? Uh, I'm watching the Studio and Hacks. Studio. I'm so behind on hacks, too. Episode one and three were fantastic. I have not liked any of the other episodes. Like, they're good, but like they're not You didn't like two? No, two is number three. Two is ranked number three for me. Two was my favorite. So, two is pretty good. Um, but yeah, I didn't care about the Zack Efron one. The Zack Efron one. Uh, you probably are missing the next two then after that. Uh, didn't care for the next two either. This last one I didn't love. This is doctors versus, uh, the arts and he tries to make a case of like doctors saving lives are just as important as people making movies and you know the doctors don't want to hear that. So",
            "start": 12683.04
        },
        {
            "text": "love. This is doctors versus, uh, the arts and he tries to make a case of like doctors saving lives are just as important as people making movies and you know the doctors don't want to hear that. So yeah, that was fine. hats though is fantastic. Oh, I know. I'm like a whole season behind. I didn't watch any of season 3. It's already season 4. Isn't that crazy? I feel like the show just debuted. I know. They three and four came out really close back to back it, but like I thought I was going to have more time. Thank you, Bowlex 22 for 10 gifted. Oh, Bow Flex. Thank you. We're hanging out celebrating my birthday streaming some Monster Hunter. The road to 100. Yes. So, that's what I'm watching right now. Joe, those are my two that have my attention. I also just watched Companion. I want to see that real bad. Have you seen the trailers for it? I Yes, but like just that like it's like a sex doll or whatever. That's all I know. I had fun. I think Jack Wade is like obviously friends, but he",
            "start": 12765.04
        },
        {
            "text": "that real bad. Have you seen the trailers for it? I Yes, but like just that like it's like a sex doll or whatever. That's all I know. I had fun. I think Jack Wade is like obviously friends, but he picks fun projects for sure. I don't know why it won't let me do that, but that's fine. He was sleeping. We didn't kill him. We knocked him. Oh, that's why. 434. That's what I like to see. Everybody lock in. We're cutting time down. There we go. Keep it low. 97. That's what I'm talking about. Made it to 35. Jesus. Yes. Back up. Coming in. Okay, let's be on our way. I'm just out here fighting for my life. If I'm also grilling up a barbecue while my team is fighting for their lives. You got to do it sometimes. I don't know why. Olivia Roso Winardium Lea fight this man NPCs. Why am I not in the What happens when you open the departure window? I accepted it, but hold down the touch pad. See what happens. Depart now. Hit depart now. Why does it not do this one time? Well, as you know, the Monster",
            "start": 12833.44
        },
        {
            "text": "happens when you open the departure window? I accepted it, but hold down the touch pad. See what happens. Depart now. Hit depart now. Why does it not do this one time? Well, as you know, the Monster Hunter menus are so intuitive and responsive. Also dumb because I'm just so right here. Retreat. [Music] An enemy That's all. under attack. Okay, back down to the bottom. What up, Pixel Garage? We are locked in because we are getting Greg to the end. All right, there's a timer. We're going. And we have perfected a loop that will get us there sooner rather than later. I feel like we're having a bad time right now, though. Like literally like our time's going longer than Yeah. Yeah. Yeah. Hold on. There we go. Good capture, everybody. Good capture. That means we can get out of here right away. Got nothing to carve. Nothing. Do you get the same amount of XP for capturing? Uh, I'm not sure the XP difference tells you. 514. Ugly. [ __ ] tighten that up. Wow. Kind of funny. Gill minute. [Music]",
            "start": 12970.8
        },
        {
            "text": "nothing to carve. Nothing. Do you get the same amount of XP for capturing? Uh, I'm not sure the XP difference tells you. 514. Ugly. [ __ ] tighten that up. Wow. Kind of funny. Gill minute. [Music] Just shy 98. We're looking good. Oh, hell yeah. Calico is also doing great. Yeah. quest now. Are you prepared? [ __ ] [ __ ] raffle. Have you crafted your No, I can't craft any of the armor cuz I'm missing Oh, those things. I'm missing the smaller pieces. But that I have to go out and find in the world, I guess. [Music] Joe, I'm 35 and a half. So, you're tracking it. You're getting close. Get up. Get up. Jesus. Getting there. I actually could not tell you what level I am right now. I I also want to go see Sinners. Everybody's talking. Ah, yeah. Yeah. Yeah. Yeah. Trying not to let it get overhyped cuz I feel like we're in that dangerous tier. Definitely getting hyped up for sure. But that might be a next hard to get tickets. I keep hearing. I know. And especially to see it downtown at Metro.",
            "start": 13232.0
        },
        {
            "text": "cuz I feel like we're in that dangerous tier. Definitely getting hyped up for sure. But that might be a next hard to get tickets. I keep hearing. I know. And especially to see it downtown at Metro. It's like one of the only 70 mm sure things which like I largely don't care about but might as well many of the people that I would go see this with do. So there's that. Yeah. And then we have Thunderbolts next week too. This is like maybe three weeks in a row where I have like double movie plans in the week. You're back to being a movie, bro. Back to being a movie, bro. I also Well, Roger and I have like joked about going to see that movie Drop. That looks so dumb. I don't know what that is. It's a thriller movie with Megan Fahi. And the whole thing is that she's getting air dropped these like messages on a date being like, \"If you don't do this for me, I'm going to kill your son.\" But she doesn't know who they're coming from. So, is it my date? Is it? But she knows it's somebody in the",
            "start": 13347.92
        },
        {
            "text": "messages on a date being like, \"If you don't do this for me, I'm going to kill your son.\" But she doesn't know who they're coming from. So, is it my date? Is it? But she knows it's somebody in the restaurant. Um, and it sounds really dumb, but everybody says it's fun. That sounds fun. It does sound fun. Plus, I have 17 books that Libby has decided are available for me at the library. Oh, great. So, you got all the time in the world. Yeah. No. Uh, no issue there. Mr. Pronton, I know it looks dumb, but I often times like dumb things, especially if like I know that going ahead going in. You set your expectations correctly for what you're about to get. They're just shooting all over. Oo. Okay, I'm not even fighting you. Enemy heat. There we go. Good job with that. Another one down. Capture. Yes. [ __ ] you. Is that it? I'm now uh googling. Good job. I need uh and yeah, I've just gotten fire stone. So, that's a win. I'll move on to the next thing in a second. Cuz like if Greg's going to",
            "start": 13421.68
        },
        {
            "text": "Yes. [ __ ] you. Is that it? I'm now uh googling. Good job. I need uh and yeah, I've just gotten fire stone. So, that's a win. I'll move on to the next thing in a second. Cuz like if Greg's going to reach level 100 by the end of this stream, I'm damn sure going to get this armor by the end of this. Hell yeah, Mike. That's what we're doing. I'll be fully kitted out in the the highle armor by the end of this. We are 98. 36. Yeah. Armor is cool. Did you guys see Mickey 17? No, that's one that I missed. I don't really know how. Well, I do know how cuz I missed the screener and then it's just at that point it's gone. Um, but I feel like I missed the window of everybody going and I was like, well, do I want to see this badly enough that I want to go by myself? Sure. Which often times the answer is yes. It's like I don't care about playing movies by myself. I don't know what happened. Chat, what artist should I listen to on the way home tonight? Tool says Lord Jiraqua. Here's some pulls.",
            "start": 13624.24
        },
        {
            "text": "is yes. It's like I don't care about playing movies by myself. I don't know what happened. Chat, what artist should I listen to on the way home tonight? Tool says Lord Jiraqua. Here's some pulls. Okay. I guess what kind of mood are you in? Any kind of down? I want new something new. Okay. In my usual vein of probably more, you know, country. I don't feel like pop. I don't feel like pop to pop. But I also feel like, you know, the countryest of country. You know what I mean? Yeah. Folk Noah Khan, somebody says Kahan. Have you done role models? No, I don't know who that is. It's the Sally when the wine runs out song that you've probably heard a million times. Maybe. Yeah. They're like countryish. What are they called again? Role Models. Role. Lean Ryan is Mr. Showtime. You know, I love Lean Ryan today. I'm looking for something different. Oh, Luke Myers shouts out Joe, but that's not really country. Who's Joe? Um, do you know Joe Ciri from Stranger Things? Oh, is it when I'm back in",
            "start": 13706.16
        },
        {
            "text": "Ryan today. I'm looking for something different. Oh, Luke Myers shouts out Joe, but that's not really country. Who's Joe? Um, do you know Joe Ciri from Stranger Things? Oh, is it when I'm back in Chicago? He's great. His new or their new I guess their band new album is really good. All right. But it's not what you're looking for. It's like Poppy. I mean, you've heard that one song and very similar to that. Oh, yeah. Charlie Simpson's solo work, his debut album, Young Pilgrim. Do you think it's crazy, Joe, that everyone's TikTok is so [ __ ] different? It's so crazy. That's so funny that you bring it up. I uh have made a return to Reddit. I was like not on Reddit for a really long time and I was just like, I know what I need to do and I just started a new Reddit account. Hm. Now I can just secretly be on Reddit. So I was like going through like different subreddits and stuff like that and I ended up on the Tik Tok gossip subreddit and it's just like different people talking about like",
            "start": 13819.52
        },
        {
            "text": "secretly be on Reddit. So I was like going through like different subreddits and stuff like that and I ended up on the Tik Tok gossip subreddit and it's just like different people talking about like Tik Tok trends and stuff like that. And one was like what's the what's the rabbit hole that you're deep into right now. And I was going through it. I was like I don't know what half of these things are. And I think it's crazy. It's just I think you know for people like us that work in the same industry are together all the time watch the same shows blah blah blah blah blah like Twitter was always we all saw the same stuff. I'd come home and Jen would did you see this? I saw that blah blah blah like whatever. And then for Tik Tok Jen will mention something I'm like I never saw that and then I'll be like and I'll sing a jingle like you know that one from Tik Tok right? She's like no. And it's just like the fact that we could be so we live in in the same [ __ ] bed and we Well, and you guys,",
            "start": 13895.08
        },
        {
            "text": "be like and I'll sing a jingle like you know that one from Tik Tok right? She's like no. And it's just like the fact that we could be so we live in in the same [ __ ] bed and we Well, and you guys, your overlap of interest is an overlap for sure. Not like you guys are wildly different. 358. That is what I need to see out here. Everybody, that's the kind of hustle I'm looking for. Ben loves it when we play uh teacher student or coach athlete and he loves it when I when he throws the ball at me and if it gets by me or by him and I all right, hustle, hustle and get it. And he loves that. Hustle up now. Hustle up. Show a little hustle. Daddy, tell me to hustle. The head of the heart I haven't listened to in a long time, but that's a great call, too. Yes. Browns McGee, shout out for the Jack's Mannequin call out, which is like I made you listen to something corporate again the other day, and Jack's Mannequin is Andrew McMahon's like solo project. Okay. Um, and it's the one of those classic",
            "start": 13935.84
        },
        {
            "text": "Mannequin call out, which is like I made you listen to something corporate again the other day, and Jack's Mannequin is Andrew McMahon's like solo project. Okay. Um, and it's the one of those classic I feel like at least for me, a lot of my favorite music people are having their like 20th in a year anniversary for albums. I'm like, I don't like that. I like this is all my high school music and I don't like what this means. Let's go. You crash again, Mikey? Oh, yeah. Mikey, just get rid of the [ __ ] video game. Get rid of the No, cuz I'm trying to get my [ __ ] bro. I'm trying to get my upgrade. Here's the thing. If you had just turned off the PC and turned on a PlayStation or Xbox, you could have you could have you could have caught up to yourself by now. Mhm. This is more up Mike's alley, but I'm listening to a lot of DM Dollar. Oh, really? Okay. Okay. I don't really know why other than it was probably Uh, did he play a Coachella or something recently? Probably. Yeah. What was the",
            "start": 13986.12
        },
        {
            "text": "but I'm listening to a lot of DM Dollar. Oh, really? Okay. Okay. I don't really know why other than it was probably Uh, did he play a Coachella or something recently? Probably. Yeah. What was the thing that he did with John Summit anyways? Oh, shut up. Um, but just been really feeling and then because Tik Tok's Tik Tok, it's like here's all the different types of like EDM music and what defines them and then I'm like, oh, maybe I really like French house music. Cuz it's like way more like discoy and stuff. Oh, dude, you need to talk to Jen. actually give you back that concert we went to. That's what they did. Oh, I love that. Yeah. I've just been listen I just searched French House or whatever it was on Spotify and I was like I'm just going to sub to some of these playlists and see what happens. But then Chris Anank and I go back and forth about all the pop girlies. Addison Ray has some good stuff out right now. She does. I do like her stuff. Yeah. That new headphones on song is real",
            "start": 14046.24
        },
        {
            "text": "But then Chris Anank and I go back and forth about all the pop girlies. Addison Ray has some good stuff out right now. She does. I do like her stuff. Yeah. That new headphones on song is real catchy. How about Lord coming out? The new Lord song is really good. I did laugh that like she There's one line in the song about MDMA that feels so much louder than everything else and I'm just like this is a very funny line to include. Rockin, that's surprising cuz I feel like Mike talks about EDM stuff music not infrequently. I like the dance. Oh, Mike made it back in. For how long? Come back. Come back. I have to go and continue to just bang into bone piles is what I'm doing right now. It's like not super exciting. No, not the most exciting aspect. The unfortunate part is that it's like, oh, this is a rare item to get, so you only get three pieces in the bone pile. It's like, oh, [ __ ] you. Oh, yeah. Okay. Oh, give it a second. It's fine. I'm just Yeah. This is exactly what I'm listening to.",
            "start": 14102.92
        },
        {
            "text": "is a rare item to get, so you only get three pieces in the bone pile. It's like, oh, [ __ ] you. Oh, yeah. Okay. Oh, give it a second. It's fine. I'm just Yeah. This is exactly what I'm listening to. Yeah. Yeah. And this is all these guys do when we when we saw him live. Jessica Hinkle says, \"Banging banging the bone piles is a decent band name.\" Mhm. Thanks, that helped. [Music] Best part is you can just jump on your bird. The bird will take you there automatically. So really, I'm just looking at the map. It's a nice little time. Nice little time. And then I crash every 15 minutes or something. Oh man, I need a Rathalos Ruby, which I haven't come up lucky on yet. When you're getting a stone, that's usually a bit hard. Dragon Bone relic. There it is. Got it. [ __ ] yeah. Get blessed. There you go. What's up with my What do we got? Armor. Got it. Yes, please. All right, we've crossed into 99 territory. About halfway there. Wow. I'm almost to 38. We're still talking about music. What",
            "start": 14196.4
        },
        {
            "text": "you go. What's up with my What do we got? Armor. Got it. Yes, please. All right, we've crossed into 99 territory. About halfway there. Wow. I'm almost to 38. We're still talking about music. What mood are you in? important for a Reco Greg said country or country adjacent. Oh, I need another Firestone. [ __ ] you. You know, something with soul. [ __ ] Finish strong, everybody. It's birthday. Birthday 30 minutes. Just need half a bar. We got it. Oh, Greg's camera died. It's off my head, I think. Okay. Is that like a overheat issue? Yeah, probably. Nothing stops the train. Nothing stops. Yeah, we're not we're not stopping this. He's still there. Maybe I'm back now. No, still I turned it back on, but I didn't like it. We're back. Good to have you. Lord Incredible does call out Jelly Roll, which Oh, yeah. I like when he pops around on the the old hot country. I like him. I feel like he's somebody that I'm like aware of, but I have no I honestly mainly know him through WWE. Oh, he's at WWE",
            "start": 14334.6
        },
        {
            "text": "Oh, yeah. I like when he pops around on the the old hot country. I like him. I feel like he's somebody that I'm like aware of, but I have no I honestly mainly know him through WWE. Oh, he's at WWE a lot. He's gotten in the ring for a bit here or there. Ty Stevens says, \"Happy birthday, Greg. Thanks for everything.\" Thank you, Ty, for this super chat. Ty, let's meet Ty Stevens. Fire start. One more fire start. It's good luck. Oh yeah, Remy Wolf is like a little I have mild knowledge of and I like to I can't get it out. What are you thinking about? I was just looking at my final two things. To get the Raffthalos Ruby, you need to attack its head and or tail preferably is what it says. And you want to do it on a high one. And then a wing wing drake. Wing drake. Not looking at you. That water swish sounded definitely like vomit. Yeah, you got to get on a high one. [Applause] I'm just looking for little monsters flying around. Okay, I usually got pretty great guides. I concur. That's why",
            "start": 14418.56
        },
        {
            "text": "swish sounded definitely like vomit. Yeah, you got to get on a high one. [Applause] I'm just looking for little monsters flying around. Okay, I usually got pretty great guides. I concur. That's why they're suing Open AI. Is it really? Damn it. I mean, Ziff Davis's thing is Yeah, that Open AI learned all our stuff and is using it as their own. So, I have to imagine IG guides is pretty high up there. AI overview that gives you on everything. Yeah, that thing's annoying. It's like, all right, get on my face here. I'm trying to [ __ ] look it up. Tom 123 says, \"I know you like zombie stuff, Greg. Are you interested in 28 years later?\" Oh my god, I can't [ __ ] wait. I loved 28 Days Later and love 28 Weeks Later. And so yeah, they're coming back to that. I'm so stoked. When does that come out? Do you know? I don't know. It's like this year, right? Yeah, they just did a 332. Come on, chat. We just did a They just dropped a new trailer. I didn't watch it. I think we were going to try to",
            "start": 14555.2
        },
        {
            "text": "out? Do you know? I don't know. It's like this year, right? Yeah, they just did a 332. Come on, chat. We just did a They just dropped a new trailer. I didn't watch it. I think we were going to try to react to it and it just didn't happen. Oh my. That's right. God, crazy trailer. That close. The closest that Greg could be. Run it back one more time. Well, now we can have our pick of the litter. Oh, we got to do now. We just need the smallest amount, right? So, it's like we don't have to go do that. Yeah. Well, make it a good one cuz it could be your last if you make it a big one. Figure up here with this. You're 31 now, Joe, right? You said I'm 38. 38. Look at you. I mean, none of these are going to be tough. Perfect. We love that. Okay, we'll go after the oo together. Did Did it crash again? My just just not not God damn. Y'all laugh at me when I say PC gaming not even once unless it's a handheld because those are cool. And look what happens here. Or if you're going to do this solo. I",
            "start": 14631.68
        },
        {
            "text": "My just just not not God damn. Y'all laugh at me when I say PC gaming not even once unless it's a handheld because those are cool. And look what happens here. Or if you're going to do this solo. I said, \"I'm going to go get my car.\" Good. Someone else go hop in there with Greg because it won't let me do it. Why not? I don't know. Cuz it's dumb. I feel like we're just so spoiled with autoleveling stuff that Now I'm going to this bridge. We're going to figure out Oh, that's fun. I don't know if I thought that yet. Walked right into that one. Attack. RL Ramsey super chats and says, \"Happy birthday, Greg.\" Thank you, RL Ramsey. I'm going to go get good at marathon. Happy birthday, Greg. Subscribe. Enjoy. I've never seen 28 days. What? So, it's one of those things where it's like, well, I'm just going to wait now. We should do review for that. In review, the interview schedule. Crazy. I know. I know. There's too much good [ __ ] happening. We got to fit a Megan in review in there",
            "start": 14698.56
        },
        {
            "text": "I'm just going to wait now. We should do review for that. In review, the interview schedule. Crazy. I know. I know. There's too much good [ __ ] happening. We got to fit a Megan in review in there somewhere, you know. I mean, we could just do a week where we don't do Games C just all in reviews only for the most important franchises. Ed Reed Pan 20 says, \"Greg, someone from Missou is drafted to the Bears.\" Oh, nice. Do you know who? One of the best birthday gifts I ever got was being in the car in Columbia, Missouri, and hearing that Justin Gage got drafted to the Bears of Missou's own. I was so stoked. Hell yeah. Oh, I don't know. Mike's camera might have died. Or it does. I mean, Mike died. The hope within him died. That little spider. I kind of want all cameras to die. I end the stream now. The chat says Mick Radler. The drivers are really what killed me. Of course. A lot of talk of the anti-cheat software. His name is Luther Burden the third. A wife. Oh, okay. Oh, this guy's fine.",
            "start": 14831.6
        },
        {
            "text": "now. The chat says Mick Radler. The drivers are really what killed me. Of course. A lot of talk of the anti-cheat software. His name is Luther Burden the third. A wife. Oh, okay. Oh, this guy's fine. I was at the draft last night since JShock. Crazy experience. Over 200,000 people were there. That does sound wild. I'm not making out of this fight by myself alive. There we go. Time to pick a side quest. Well, I mean, we can help you with it. Which one are you trying to do? Uh, the gindahod. Is that a thing? That is help. Yeah, just I'm with you. Landbased squids scary. Mhm. Mhm. I don't like it. Prometheus sad. I haven't seen Prometheus in a very long time. Mike's back, everybody. All right, that's it. That should be it. Uh-oh. Is it? Is it? You won't see his face on the camera, but you're going to see. Did it die again? It died again. Jesus. See your face on the camera. Do that. Try to get it back for the before I agree to move on. Oh, moved on. You might have You might have to do",
            "start": 14893.68
        },
        {
            "text": "going to see. Did it die again? It died again. Jesus. See your face on the camera. Do that. Try to get it back for the before I agree to move on. Oh, moved on. You might have You might have to do another one. You know what I mean? Can't prove that you love There it is. I mean, I'm down to keep playing. Don't me. Do another one. I love that. Do you want to try to do one together or are you just done, Mike? I No, I'll boot up right now. Let's go. [ __ ] video game. [ __ ] level 100. Pop the trophy. There it is. took me too long, but impressive amount of time considering for sure with the amount of games we play and review yet. Thank you everybody. Thank you. Happy birthday to me. What level did you finish at? 35 and a half. I think I'm 38. Nice, Joe. 35 and a half. Uh, got to go collect two hides from little flying monsters. And I need a Rathalos Ruby to have my full armor kit for level two gear. One, you can call the ball. Let's go chase something. You need Joey. Whatever you need. Oh,",
            "start": 15064.96
        },
        {
            "text": "hides from little flying monsters. And I need a Rathalos Ruby to have my full armor kit for level two gear. One, you can call the ball. Let's go chase something. You need Joey. Whatever you need. Oh, I want to go do this thing. All right, I'll be right there in one sec. I want to do this scary. Can I proceed? Watch this. Lend me a hand. Good. Right. Another satisfied customer. Come on over. Happy birthday, Alex. I'm not an issue with the tier one. Perfect. It's perfect. I don't know what you're talking about. Real quick, do me a favor and go back to this. Go back to talking to Alma. Yeah. And then go down just so Yes. Join. And then go down to assignments. Oh, that's the one you're trying to do. Sorry, I wasn't sure where it was. This wasn't me like mansplaining. I thought maybe it hid something. In this game, I'm happy to be mansplained, frankly. Go back over it because it's there's something red popping up. So, go back into it. Assignments. Oh, no. It wasn't even on that one. The",
            "start": 15128.72
        },
        {
            "text": "something. In this game, I'm happy to be mansplained, frankly. Go back over it because it's there's something red popping up. So, go back into it. Assignments. Oh, no. It wasn't even on that one. The [ __ ] Oh, and you started this one. Yeah. And then I abandoned it. Unless I didn't abandon it correctly. No, it doesn't even have like the return. Should I begin? Redo the assignment. Watch this. Let me finish preparations. Stormcloud. Vortex. Vortex. That's what I'm on. [ __ ] Joe. See? Okay, then you start it. Oh, you want me to start it? Okay, I can do that. Um, Greg, do you know why my guy glows? Um, even outside of battle outside of battle, he's he's red and green or red and gold right now. I've always thought it was just a glitch and never looked into it cuz it happens to me too. But chat, let me know. Funny. A sage choice. Watch this. cleaning up here on my [ __ ] wish list. It's a buff from eating. Thank you very much. Another satisfied. You won't want to miss out on this. Talk",
            "start": 15207.92
        },
        {
            "text": "chat, let me know. Funny. A sage choice. Watch this. cleaning up here on my [ __ ] wish list. It's a buff from eating. Thank you very much. Another satisfied. You won't want to miss out on this. Talk to you. That's Rex. Got everything I need. Quest is being posted now. Okay. I am quest has begun. Flare is out. I'mma Something in my game just me musted cuz it won't it says no lobby member quest either. Can you join on Greg Tabby when he joins me? I'm here. Ah [ __ ] What the [ __ ] I'll see you back there. We got this. Got this. And I was able to restart that mission, Joey, as well by talking to Alma. That's what I first one it looked like. That's what I was doing. Weird. [ __ ] this. [Music] Let me back in, please. It won't even let me join the lobby. So, and that's a wrap on Joey, everybody. Thank you, Joey, for See you later here in the birthday stream and pushing me to level 100. Hell yeah. I'll make sure it's not totally worked. Oh, I'm sure you're safe. You're not playing on PC.",
            "start": 15284.24
        },
        {
            "text": "Thank you, Joey, for See you later here in the birthday stream and pushing me to level 100. Hell yeah. I'll make sure it's not totally worked. Oh, I'm sure you're safe. You're not playing on PC. Everything's fine. Connected to PlayStation. [Music] Shield. Oh, we entered the lobby. Made it. [Music] [Music] Damn. Walking right in. I like Jin to hide cuz he's got Got a wiener dog shake. It does. It's one of the stronger ones in the game for sure. Oh yeah. Saves find you. Yeah. See if there's anything else that I can do. Just smacking things about my life. Die moving. Keep that. Golden Rant and Mike 64 subbed with Prime and they both say happy birthday Greg. Yay. Happy birthday mate. They go. All right, there we go. What hunter rank are you guys now? I'm 100 finally. Thank you. I think I'm 38. I think I'm like 36. Yeah, I'm probably 36. 35 [Music] 36. And Mike is playing as old man. Truly inspired. Mike, you got you behind a rock, man. I'm I'm behind a rock, but I don't know if it's going",
            "start": 15550.72
        },
        {
            "text": "I think I'm like 36. Yeah, I'm probably 36. 35 [Music] 36. And Mike is playing as old man. Truly inspired. Mike, you got you behind a rock, man. I'm I'm behind a rock, but I don't know if it's going to count. Okay, they counted. Okay, cool. Got very lucky. [Music] Just an awkward rock like right next to him. I'm like, yeah, that doesn't I don't rock. It looks like a rock, but I don't know if it's the rock you're supposed to be behind. So, we'll see. Leave me alone. Bomb set. [Music] The large bridge on its lower back. [Music] Why are you here? I bet we can use the rockets to our advantage. This guy's ridiculous. For just like a like the moment during the story, you totally get it. But like damn, they just keep this [ __ ] up even on random hunts. That's amazing. It's just the ultimate ultimate beast. The ultimate apex predator. If you want to bring them over here. I don't think I got any luring stuff. I dropped a trap over here so we could drop that thing on top of them. [Music] Yeah,",
            "start": 15887.8
        },
        {
            "text": "beast. The ultimate apex predator. If you want to bring them over here. I don't think I got any luring stuff. I dropped a trap over here so we could drop that thing on top of them. [Music] Yeah, [ __ ] yeah. Let me move. Get out. [ __ ] I'm miles from Hurry, Cole. Hurry, Cole. Hurry, Cole. No, Cole. Not towards it. He launched over him. Oh, the died. Made it. Made it. Made it. Dive to survive. Fatigued out of my mind. You got Vegeta in your mind? I'm fatigued out of my mind. That's my car. It's mine. Barrett. Barrett's going. Please. If I die, I die. No. Mike, if you die, you [ __ ] have our ass get run away. At least run him away. upstairs or something. Joey, you have to play for me. Joey, I'm also trying not to die differently. And also, I don't know how to use whatever weapon you have, but I will smack things around if you need my [ __ ] one shot me in the face. Thanks, Mike. [ __ ] cars. just died. No one's head in the goddamn game. Was it Mike? Oh, cuz it's Mike's world. He was",
            "start": 16064.4
        },
        {
            "text": "but I will smack things around if you need my [ __ ] one shot me in the face. Thanks, Mike. [ __ ] cars. just died. No one's head in the goddamn game. Was it Mike? Oh, cuz it's Mike's world. He was on his last legs, ladies and gentlemen. We still couldn't get it done. God damn it. You hate to see it, but I love to see you all show up to support me for my birthday. Thank you for hanging out all day and night long with us, ladies and gentlemen. And NBS, of course. This has been us playing a little bit of that Monster Hunter Wilds cuz I love it and it's my birthday. Thank you, Joey. Thank you, Mike. That was so fun to do this. Uh, thank you all for watching. Remember, this is the end of our programming week. We will be back Monday with kind of funny games daily. But until then, it's been my pleasure to serve you as I burp. And now I'm going to hit the stop streaming button. I think it stops it. But I have no idea. If it doesn't, just hang out for a second. YouTube, too. Maybe there'll be",
            "start": 16271.76
        },
        {
            "text": "to serve you as I burp. And now I'm going to hit the stop streaming button. I think it stops it. But I have no idea. If it doesn't, just hang out for a second. YouTube, too. Maybe there'll be a little bit about darkness at the end. Nobody's sure. We have no idea how that part works. That's a bad thing, you know.",
            "start": 16322.08
        }
    ]
}