{
    "id": 13927,
    "video_id": "T-KzUmU_kJc",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "Marathon Launches September, Isn't Free-To-Play - Kinda Funny Games Daily 04.14.25",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page - https://store.steampowered.com/app/1377700/Empyreal/ \nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\n\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\nMarathon is coming this September, PlayStation 5 prices are going up, and Mythic Quest has been canceled.\n\nToday after, KFGD, you’ll get:\n- GAMESCAST - Our reaction to Marathon\n- After Gamescast is The Last of Us Season 2 Premiere Screencast\n- Then later - Guess what? We’re assembling the team. It’s time to jump back into Marvel Rivals with the launch of Season 2.\nIf you’re a Kinda Funny Member:\n- Today’s Gregway about Greg’s Chicago Trip!\n\nTime Stamps:\n00:00:00 - Start\n00:05:46 - Housekeeping\n          -  The Roper Report   -\n00:13:03 - Marathon launches September 23 on PS5, Steam, and Xbox Series X|S\n00:15:26 - Marathon’s director explains why it isn’t free-to-play: ‘Everyone has their own definition of what’s the right price’\n00:30:50 - SuperChats \n00:41:50 - Sony is raising the price of the PS5 (again)\n00:50:26 - ‘Mythic Quest’ Canceled By Apple After 4 Seasons\n00:56:49 - A new Respawn Star Wars game has been announced\n00:59:26 - Wee News! \n01:01:15 - SuperChats\n01:08:06 - You‘re Wrong\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1744654678,
    "duration": 4222,
    "transcript_chunks": [
        {
            "text": "Today in the nerdy news you need to know about. I'm back from Chicago everyone and I brought with me the Stars in the Bank briefcase everyone. And what I did in Chicago Timothy was entertain hundreds of people at a late night with Greg Miller. And what I asked them to do at the two meet and greets we did was fill this briefcase with hate mail about you. And boy howdy did they. They came and they were creative, Tim. All right. So, not only do I have of one person he gave me, it's a level up real estate in Wisconsin. He wanted you to have this chapstick for when you get burned. All right. And then look, they made you a little farewell Tim friendship bracelet. All right. That fair. What I'm going to do though is I have so much mail here, ladies, gentlemen, and envies. can't just possibly get through it in one show. So, I'm going to read it every 10 minutes a random from it. Okay. You know, you walked in, Greg. I haven't seen you in a week. I'm sorry. This is still the cold open. You don't",
            "start": 3.92
        },
        {
            "text": "it in one show. So, I'm going to read it every 10 minutes a random from it. Okay. You know, you walked in, Greg. I haven't seen you in a week. I'm sorry. This is still the cold open. You don't talk during the cold open, right? God damn it, Tim. I couldn't possibly give you hate mail. That's not a one I want to read. That's not a one I want to read. I want to find one where suck a butt, Tim. We have all this and more because this is kind of funny games daily. [Music] Setting my 10-minute timer right there. Oh my goodness. So many timers on your phone. You're so prepared for this, Greg. What's up? Welcome everybody to Kind of Funny Games Daily for Monday, April 14th, 2025. I'm one of your hosts, Greg Miller, alongside Forbes 30 under 30, aka the second best baby blues into San Francisco, aka the married one at Tim Getty's. You You've been gone a week. I've thought about you every day. Often times, multiple times a day, thinking about how you're going to crush this show on Thursday. So",
            "start": 53.76
        },
        {
            "text": "the married one at Tim Getty's. You You've been gone a week. I've thought about you every day. Often times, multiple times a day, thinking about how you're going to crush this show on Thursday. So excited for you. I see footage of the show come out. You walk out with the briefcase, and I then I'm reminded I'm reminded what type of person you actually are. And then this morning you walk in, you know, we didn't get as much time to catch up or talk at all that I would like, but you did walk over to me and you're like, \"Oh, yeah, you didn't get much hate mail, but you got this.\" And you you leave one note, a nice note, a very very very nice note on my desk that somebody left. And and you're like, \"Yeah, there wasn't much much hate mail.\" No, no. What I say you see, I just said it too fast. I slur my words together. I'm very excited to be back. All right. What I said is it wasn't all hate mail. Okay. So people did again, let's see what this one is. Oh, yeah. I knew people would do this.",
            "start": 109.76
        },
        {
            "text": "I slur my words together. I'm very excited to be back. All right. What I said is it wasn't all hate mail. Okay. So people did again, let's see what this one is. Oh, yeah. I knew people would do this. Oh, Colin. It's Colin with two L's. This guy, he was I couldn't possibly give you hate mail. You're one of the only people in Kind of funny that always reps Transformers. And for that, you'll always have my love. Yes. I just got a tattoo of the Autobot symbol to show my undying allegiance. It was my first hat. Here's hoping Highoon Studios makes a comeback. Y and I did. He showed me the tattoo. It was very nice. Yeah. Yeah. Shout out to High Moon. Let's make that happen. I agree with that 100%, too. How are you, Tim? I'm good. How are you? I missed you. Good. You got some sun. I did get some sun. Were you Were you a Pokemon? was at an 11-year-old's birthday uh party in Golden Gate Park. We were Pokémon Go. Oh, yeah. A lot. Oh, yeah. You were. Oh, yeah. Oh, yeah. It was a very complicated",
            "start": 148.0
        },
        {
            "text": "sun. Were you Were you a Pokemon? was at an 11-year-old's birthday uh party in Golden Gate Park. We were Pokémon Go. Oh, yeah. A lot. Oh, yeah. You were. Oh, yeah. Oh, yeah. It was a very complicated situation. This child, a relative of Gia's. Okay. Uh went to Hawaii recently and um caught a conf exclusive to Hawaii. Yeah. I do not have one. It is one of the three Pokemon I do not have currently in Pokémon Go. Um and so it was a big deal. She was excited to catch this one, to come back and trade it with me. And um the reason I was invited to her 11 year old her 11th birthday was to trade this Pokemon with me. We get there and uh she pulled the most 11-year-old move possible. She looks at me, she's like, \"I don't want to trade you that one. I want to trade you this shiny ponyt.\" And I'm like, \"But I have a shiny ponyt.\" She goes, \"I want you to have it.\" And you only can trade once a day for a Pokemon. Oh, no. Like that you don't have. She wanted one that she didn't have. You know what",
            "start": 187.12
        },
        {
            "text": "\"But I have a shiny ponyt.\" She goes, \"I want you to have it.\" And you only can trade once a day for a Pokemon. Oh, no. Like that you don't have. She wanted one that she didn't have. You know what I mean? I had to give her some good [ __ ] All right. Well, hold on. Straight up then. I feel like right there. That's the stopper. Yeah. I don't I'm not trading. I mean, she's got to learn it somewhere, right? Yeah, but her parents are right there. You know what I mean? It's a lesson the parents need to learn. She's right there. It was a whole thing, Greg. I don't have my my com fee. Why didn't you like Why didn't you like up the ante? Like, I'll give you $100, too. I'll handle you something here. You know, cuz I was trying this thing. I I feel like I'll get it eventually. I'll see. I feel like you're teaching a good lesson here. This isn't like Yeah. No, just like bartering. You know what I mean? Okay. Gotcha. And when the shoe's on the other foot and eventually Ben has some toy you want,",
            "start": 237.92
        },
        {
            "text": "you're teaching a good lesson here. This isn't like Yeah. No, just like bartering. You know what I mean? Okay. Gotcha. And when the shoe's on the other foot and eventually Ben has some toy you want, you know what I mean? And then he all of a sudden tries to change the deal. I'm I want you to be like, \"No, no, no. I've tried to season this all the time. No, no, no. That's not what you said. This is usually when I threaten to call Santa.\" Yeah. That That is good. That is good. 11 is a little older than the the three-year-old. You know what I mean? So that like there's some I think she's playing mind games with me. You know what I mean? She's trying to pull one over. She wants to let me know she's the Pokemon master, which I guess I kind of appreciate. I did try. Obviously, I didn't like take this one without trying to swing. You know what I mean? I was just like I asked I was like, \"No, no, no. We're talking about this one.\" And you know, I asked once, I asked twice. It was that third",
            "start": 272.4
        },
        {
            "text": "this one without trying to swing. You know what I mean? I was just like I asked I was like, \"No, no, no. We're talking about this one.\" And you know, I asked once, I asked twice. It was that third time where she was insistent and I'm like, \"It's your birthday. You can cry.\" Oh, it was her birthday. Oh, yeah. I didn't realize that. I'm sorry. I thought you She was at the birthday party. No, no, no. It was her birthday. I was literally a little bit different. That's a little bit different, I guess. Yeah. Yeah. Anyway, that's a whole thing, man. It is a whole thing. Uh just like the fact that Marathon is coming in September, PlayStation 5 prices are going up and Mythic Quest has been cancelled. We'll cover all that because this is kind of funny Daily each and every weekday on a variety of platforms. We run you through the nerdy video game news need about live on youtube.com/kindfunnyame, twitch.tv/kindfunnygame, and podcast services around the globe. If you love what we do, pick up a",
            "start": 311.36
        },
        {
            "text": "platforms. We run you through the nerdy video game news need about live on youtube.com/kindfunnyame, twitch.tv/kindfunnygame, and podcast services around the globe. If you love what we do, pick up a Kind of funny membership. You can grab it on patreon.com/kindfunny. YouTube.comkindfunny games, Apple and Spotify. What it would get you, of course, is every one of our shows ad free. That's more than 80 a month. And of course, your daily dose of me, Greg Miller, and a series I call Greg, plus Good Karma for supporting a small business, making really cool shows even though there's just 11 of us. Right, right, right. No bucks to wait away. No big deal. Of course, you can uh watch live, subscribe, share, do a thing, leave a review, tell your friends, etc., etc., etc. If you want to be part of this episode of Kind of Funny Games Daily as we read through the news, of course, I have the super chats open. YouTube.com/kindafame where you can super chat to be part of the show and have a great",
            "start": 345.84
        },
        {
            "text": "this episode of Kind of Funny Games Daily as we read through the news, of course, I have the super chats open. YouTube.com/kindafame where you can super chat to be part of the show and have a great time. Uh, Alex Frasier super chats and says, \"Your Pokemon gonna lose those SC stars, Tim.\" That's good. That was good. And I see some people in the chat uh saying that she should have caught multiple of these things in Hawaii so she had one to trade with me. She did. She she had multiple. You know, and now to be positive on this, she wanted me to have that shiny ponyt. You know what I mean? So I appreciate that she for some reason was like, \"Tim, I want you to have this. It means something to me. It now will stay with you.\" Where does the 11-year-old live? San Francisco, but like close to the studio. No. Where does she go to school? She is the school close to the studio. No. Tim, should we go to school right now and get you this Pokemon? You know what? Absolutely not. Can you imagine if we",
            "start": 392.48
        },
        {
            "text": "No. Where does she go to school? She is the school close to the studio. No. Tim, should we go to school right now and get you this Pokemon? You know what? Absolutely not. Can you imagine if we showed up at a Well, I don't even know. What is that? They all go to the windows. Me and Kevin. I want my coffee. I don't even know. Is I I think I might even be getting it wrong. It's the the Hawaiian ones. This is the freaking keychain. Keychain. Is that No, no, no. It's the lay. Doesn't matter. Keep going, Craig. Okay, no problem. Uh housekeeping for you. We're an 11 person small business that's all about live talk shows, which means after today's kind of funny games daily, you're getting the Games cast with our reaction and thoughts about playing Marathon. That's right. Of course, we're going to get together all those shooter boys over there that want to talk about what they think of this Marathon stuff. But the one, the only, the best voice in the business, Paris Lily, has played Marathon",
            "start": 435.04
        },
        {
            "text": "get together all those shooter boys over there that want to talk about what they think of this Marathon stuff. But the one, the only, the best voice in the business, Paris Lily, has played Marathon and he will be on the show to tell us all about it. After the games cast, it is The Last of Us season 2 premiere screencast. What an episode. Yes, I can't wait to talk about this. Then later, guess what? We're assembling the team. It's time to jump back into Marvel Rivals with the launch of season two. Later today, thanks to our friends at Nvidia, we are going to be showing off in-game Nvidia DLSS S4 with multi-frame generation uh AI powered tech that gives you up to 440 frames per second in 4K with a top-end 50 series RTX GPU. Come join us later. And then, if you're a kind of funny member, of course, you'll get a Greg Wave from me today. It's already been recorded. It is my synopsis of the Chicago activities along with a question from Patreon about my best and worst meet and greet",
            "start": 481.12
        },
        {
            "text": "of course, you'll get a Greg Wave from me today. It's already been recorded. It is my synopsis of the Chicago activities along with a question from Patreon about my best and worst meet and greet experiences. I think it's about 18 minutes. You'll get it momentarily because I haven't sent it off my phone over here because I brought in a lemon cake and I needed to cut that up. And I also got a car wash today cuz my car was filthy and now my mats are drying in the parking lot. Was I at your worst meet and greet? No. No. Well, yes. Yes and no. I gave two worst meet and greet experiences and neither of them. You'll see. Okay. Don't go. One's international. You know how that goes. No. Yeah. Thank you to our Patreon producers, uh, Anatoli's Asked, Delaney Twining, Carl Jacobs, and Omega Buster. Today, we're brought to you by MP Real. That's not how you say that. Imperial. Imperial. Yeah, I knew I was getting cute with the spelling. EMP. All right. Imperial Factor and Shady Rays. But we'll",
            "start": 523.84
        },
        {
            "text": "Today, we're brought to you by MP Real. That's not how you say that. Imperial. Imperial. Yeah, I knew I was getting cute with the spelling. EMP. All right. Imperial Factor and Shady Rays. But we'll tell you about that later. For now, let's begin the show with what is and forever will be the Roper Report. Time for some news. six items on the rope [Music] report does it 3D never forget Omega Buster super chats and says speaking of stars did Greg know about the Switch 2 event before or after he challenged him has Greg been lying to us #avethearss you should have come to Chicago this was asked in the Q&A there and one day it'll be available on YouTube probably and that's when I'll reveal all but right now don't worry about this the briefcase is still here there's plenty of hate mail and again they're creative with it all right do appreciate the coloring of the goodbye bracelet matching the Stars in the Bank briefcase. Oh yeah, you you mentioned, you know, we're going to get to marathon.",
            "start": 562.16
        },
        {
            "text": "they're creative with it all right do appreciate the coloring of the goodbye bracelet matching the Stars in the Bank briefcase. Oh yeah, you you mentioned, you know, we're going to get to marathon. Don't worry about it. Let's just keep putting ourselves over though. You mentioned how all the photos or me or the You mentioned me coming to stage with the briefcase. I brought the briefcase to the meet and greet. The briefcase was a bigger star than me at the meet and greet. Everyone wanted a photo with the briefcase. It was a huge thing. You know what I mean? And it's funny because the briefcase of course had my underwear in it like an hour before I went there. You know what I because I had it I had a pack in the bag and put the whole thing in there and d So it was nice to see this this briefcase get some love. Yeah. Okay. Mhm. And then I had a match I had a kind of funny uh friendship bracelet. I forget who gave it to me. I apologize. Uh I wore it meet and greet. Got it. Wore it wore it",
            "start": 611.6
        },
        {
            "text": "get some love. Yeah. Okay. Mhm. And then I had a match I had a kind of funny uh friendship bracelet. I forget who gave it to me. I apologize. Uh I wore it meet and greet. Got it. Wore it wore it on stage. Came off stage at the end in the green room. Uh Ben saw it and he's like can I wear it? I'm like of course Ben. He put it on immediately broke it. Everywhere. Pieces everywhere. And let me tell you this kid was already I mean like it's 10:00 Chicago time. He should not be awake. period. He was already on like Jen had to bring him back from the brink of f. This was just so it's it's me and Ryan Fergus and all these people kept picking up every one of these like we'll build it at home again then. That is hilarious. No more stalling everybody. Number one on the rope report. Marathon launches September 23rd. Oh no, the timer is going off. I wish I wish I could I wish I could read the marathon news. Instead I have to reach in here. Now this is one. Now again people have been create here.",
            "start": 645.76
        },
        {
            "text": "September 23rd. Oh no, the timer is going off. I wish I wish I could I wish I could read the marathon news. Instead I have to reach in here. Now this is one. Now again people have been create here. This is this is a one I had up of leave Tim. I I walked into every one of the meet and greets and said, \"Hey, leave Tim hate mail. Leave Tim hate mail here.\" So, you can have that, Tim. That's a memory for you. Okay. What I appreciate is like again, I think I mentioned that we I was going to have the hate mail thing. Come do it. I'll have paper out. People brought sympathy cards. Okay. I haven't read them. So, this one is one to you. Okay. Let's see what we got in here. It says, \"At this difficult time, Tim, extending deep and heartfelt sympathy to you and your family. Sorry for the loss of your stars. You deserve it though. Uh, and then it's a heart from Gwyn96 on Twitch. So, Gwin, I hope you're there right there. We'll put that I'm going to firmly put that in the not hate category, which",
            "start": 686.88
        },
        {
            "text": "stars. You deserve it though. Uh, and then it's a heart from Gwyn96 on Twitch. So, Gwin, I hope you're there right there. We'll put that I'm going to firmly put that in the not hate category, which is nice. People just care about you. You know what I mean? Yeah. All right. We're going to hit the timer then to get into it. Sorry, back to it. Number one marathon launches September 23rd on PlayStation 5, Steam, and Xbox Series X/S. We read from the PlayStation blog. What happened to the ghost colony of Tao Centi Bower? I hate it when they put the the the Roman numerals in there. I got to think real fast. I'm caught up at Stars. Why you making me go back to school? Four. Uh, and the infamous marathon ship that started it all. Decades after the original marathon trilogy, the Bungie development team is ready to dive back into the world of Tao Seti 4 in their upcoming team-based extraction shooter, Marathon. The game launches on PlayStation 5, Steam, and Xbox Series SX on September 23rd. Of",
            "start": 730.08
        },
        {
            "text": "team is ready to dive back into the world of Tao Seti 4 in their upcoming team-based extraction shooter, Marathon. The game launches on PlayStation 5, Steam, and Xbox Series SX on September 23rd. Of course, we are watching footage right now if you're an audio listener later or whatever. Uh, I do want to know right now, super chats, be a part of this. What did you think of the Marathon reveal? Is this going to be a success? Are you going to play it? etc., etc., etc. Please hit me up on the YouTube.com/kindfunname super chat as I continue reading. In Marathon, players work together in crews of three to scavenge the remnants of the lost colony of Tao Centi4. or if I have to say Tao set4 one more [ __ ] time. Uh in their search for the powerful weapons and equipment left behind. They'll face AI security forces, otherworldly threats, and rival runner teams competing for loot. Death is part of the journey. It's a cutthroat world, and it's not possible to survive every expedition. But every",
            "start": 772.88
        },
        {
            "text": "AI security forces, otherworldly threats, and rival runner teams competing for loot. Death is part of the journey. It's a cutthroat world, and it's not possible to survive every expedition. But every time you make it out alive, you get to keep everything you scavenged, which means you'll grow in power and fill your vault across matches. Uh you're only ever one run away from your next big score. Very first thing. Here's the the Oh, yeah. Okay. For your first look at the gameplay, check out the reveal uh trailer debuted in Saturday's live stream, which is what we are watching right now. Timothy, yes, we have more coming up on why it isn't free to play. There's going to be a few things. And like I said, you're getting a preview from Paris and of course our extraction shooter boys after this. What has been your reaction to the reaction to Marathon? I mean, here's the thing, right? I legitimately feel like you can take our conversations around Concord last year and just replay that episode",
            "start": 815.04
        },
        {
            "text": "What has been your reaction to the reaction to Marathon? I mean, here's the thing, right? I legitimately feel like you can take our conversations around Concord last year and just replay that episode of Games Daily and it's going to be the exact same thing. I just think the problem there is it's even worse now because that's happened and we saw how it ended. So, I just think it's a little more rough for this to be coming out now. I will say looking at it, I personally think it looks really cool. Like I don't think that this looks like like ah just another one of these things. I think there is a nice visual style to this that like is fun and colorful in ways that I appreciate. Having said that, it's not marathon. This is definitely a departure from what Marathon was. I don't know that that's necessarily the biggest factor. But if you're going to bring back Marathon, like why do it then, right? Like just come up. It might as well just be a new IP if it's a new IP. Sure. Um so that to me",
            "start": 856.8
        },
        {
            "text": "necessarily the biggest factor. But if you're going to bring back Marathon, like why do it then, right? Like just come up. It might as well just be a new IP if it's a new IP. Sure. Um so that to me just is a little bit weird cuz Marathon's a lot griier and uh maybe they play into that. Again, I understand the argument that it doesn't matter, but then why use the brand? Um, on top of that, hearing that this wasn't free to play was definitely a shock to me. Let's bring that into the conversation. All right, number two on the rope report goes, \"May Marathon's director explains why it isn't free to play.\" Quote, \"Everyone has their own definition of what of what's the right price.\" Uh, this is the one, the only only, the big man, Jordan Midler of VGC. And I mean that literally. He's huge. Marathon's director has explained the decision behind the game not being free to play. Developed by Bungie, Marathon is an extraction shooter. The game sees players form a crew of three to battle up to",
            "start": 896.4
        },
        {
            "text": "director has explained the decision behind the game not being free to play. Developed by Bungie, Marathon is an extraction shooter. The game sees players form a crew of three to battle up to 18 other players in each zone. Over the weekend, Bungie debuted the first gameplay from the game, as well as the release date and closed alpha plans. Bungie also confirmed uh that the game will be a quote unquote premium product, though the studio has yet to confirm the price. Now, speaking on the Friends Per Second podcast, director Joe Ziggler has explained why Bungie's Marathon won't launch as a free-to-play title. quote, \"We are hoping uh that what we're showing is exciting enough that someone is going to take the leap with us, but we are also committed to delivering on seasons past that on seasons past this that will continuously offer uh to evolve the game without an increase to the box price.\" He said, \"What we're hoping everyone understands about the game is that we're focused on",
            "start": 939.36
        },
        {
            "text": "on seasons past this that will continuously offer uh to evolve the game without an increase to the box price.\" He said, \"What we're hoping everyone understands about the game is that we're focused on committing to making this a game that's really awesome, and we think that starting we think that starting point is really strong at this current time. Everyone's got their own definition of what is the right price.\" End quote. It was reported last year that Bungie and Sony are reportedly considering a $40 price tag for Marathon. This price point could would bring it in line with Hell Divers 2 and the now defunct Concord. So there there's a lot here, right? Like because the assuming it should be free to play, I do think is based on just looking around at similar games and what's happened to them in the last couple years. Uh on top of that, I will say uh other gut reactions, I totally forgot that this was also coming to Xbox. So seeing that news, I I was like, \"Hey, good for them. This is",
            "start": 981.28
        },
        {
            "text": "in the last couple years. Uh on top of that, I will say uh other gut reactions, I totally forgot that this was also coming to Xbox. So seeing that news, I I was like, \"Hey, good for them. This is the type of game that needs to be everywhere.\" 100%. You need the community. You need as many people playing as possible to have a a player base that's actually playing the game for these type of multiplayer only experiences. Which leads me to it's multiplayer only. And it's like, man, I look at that and like I know that I am just a specific type of gamer, but there are many of me and I want to play a single player Bungie marathon game that looks like that. Cool. I'm not getting that, but it's still a paid title. That to me kind of reads a little bit weird. You games cost money. There has to be a price. Yep. I also think marathon's caught right now in a very terrible time for product announcements because of the state of the world and tariffs and everything where why do we not know the price?",
            "start": 1025.44
        },
        {
            "text": "price. Yep. I also think marathon's caught right now in a very terrible time for product announcements because of the state of the world and tariffs and everything where why do we not know the price? Like why was there already misinformation this weekend of it's going to be a full priced game? Oh wait, no it's not. No, it's not full price. Like we're going to talk more in the summer about the pricing. Why is that? Is it because they don't know yet? Are they just trying to figure it out or are they like hedging their bets trying to wait for all that? Either way, not good news for uh a game that I think is already an uphill battle to win people over. So, I think that's just kind of where we're at is in the time and place that we're in, this doesn't seem like a great move. Yeah, 100%. Um, you're not wrong. And I I I struggle with this one because it is so easy to just double back to exactly what we're saying about Concord. I don't think this looks and Concord had a vibe, right? But I",
            "start": 1069.92
        },
        {
            "text": "you're not wrong. And I I I struggle with this one because it is so easy to just double back to exactly what we're saying about Concord. I don't think this looks and Concord had a vibe, right? But I don't think this looks as derivative as Concord did. And I'm not [ __ ] on Concord. I just felt like we all looked at Concord like, \"Oh, Guardians. Okay, it's another hero shooter.\" This has a vibe to it that's different. I don't know if that vibe will speak to people and make them go play and make them pay 40 bucks for it, right? Of course, throughout the internet, there was a bunch of creators that got to go play this. Like we said, Paris, uh, the one that spoke to me, uh, was Skill Up. Skillup's Blue Sky reads, \"Bunie's Marathon shows great promise, but it's still missing something at the very core of its extraction gameplay loop, making it difficult to predict how Marathon will launch or where it might one day end up.\" Of course, Mskeilla has hands-on impressions up on the YouTube. Uh,",
            "start": 1109.28
        },
        {
            "text": "core of its extraction gameplay loop, making it difficult to predict how Marathon will launch or where it might one day end up.\" Of course, Mskeilla has hands-on impressions up on the YouTube. Uh, you know, IGN has an write up from Travis Northup that's a bit, you know, not more glowing, I guess, but a bit more positive, right? But it does at the end come down to the same things we're going to talk about, right? Uh, another question is how much support and longevity can we expect from Marathon? Bungie has earned its reputation for mastering the live service model over the past decade of Destiny and shows no signs of letting players down here as they told me they already have plans to support Marathon with new maps, weapons, characters, and more as they develop it. But as always, there's the question of whether they'll do uh so at a fast enough pace to appease ever ravenous players. And importantly, Marathon also plans to use the seasonal reset model found in the likes of Diablo IV,",
            "start": 1150.4
        },
        {
            "text": "the question of whether they'll do uh so at a fast enough pace to appease ever ravenous players. And importantly, Marathon also plans to use the seasonal reset model found in the likes of Diablo IV, where you'll be stripped of your loot and progress at the end of each season to do so again with new content and a new meta to mix things up. While I could definitely see this working for Marathon, uh there's a question of how they'll manage to incentivize making that arduous climb from scratch each season. After playing enough Marathon to get a pretty good feel for it in its alpha state, I'm already fairly confident it'll scratch the Bungie PvP itch that's been left unscratched for a number of years now. Here's hoping they knock it out of the park. Uh, you know, I asked for super chats over here and what we're going to do that way. Blah blah blah blah blah, right? And there was one. Here it is. Uh, Flying Penguins, uh, super chats and says, \"Charging a box price for shooter with three",
            "start": 1188.32
        },
        {
            "text": "here and what we're going to do that way. Blah blah blah blah blah, right? And there was one. Here it is. Uh, Flying Penguins, uh, super chats and says, \"Charging a box price for shooter with three maps, a battle pass, and everything is wiped at the end of the season. I hope Bungie changes that.\" I mean, dude, that's really the conversation, right? Is like I I feel like we're just at a point that it almost doesn't matter if the game is good or not. Like, we look at this and like, yeah, it's Bungie. Like, they're the gunplay feels impeccable, right? You expect it's going to. We'll hear from Paris later about actually how it feels and like is it a good game or not. Uh but remember like conquered like a lot of people here kind of funny like enjoyed the game but that is just not enough uh in this day and age with where we're at and how much competition's out there paid free or otherwise at time we always talk about being a big thing but uh I I feel like you talking about the Concord and",
            "start": 1226.48
        },
        {
            "text": "this day and age with where we're at and how much competition's out there paid free or otherwise at time we always talk about being a big thing but uh I I feel like you talking about the Concord and like oh like it felt derivative because of Guardians of the Galaxy which it's not just like oh we've seen this thing before. It's more about a vibe and a culture of like Guardians has permeated so many things for so long. um a de over a decade at this point that like it kind of just feels like been there, done that already. Sure. Whereas like this I feel is kind of stuck in this awkward place where despite it looking I think awesome. I again I really like the direction of the art of this game. The problem is it's almost uh the opposite of the Guardian situation where this kind of just feels like we've seen a lot of this for games that haven't necessarily even come out yet, but then when they do come out, they're just kind of like, oh yeah, the finals, you know, like I just feel like",
            "start": 1266.48
        },
        {
            "text": "like we've seen a lot of this for games that haven't necessarily even come out yet, but then when they do come out, they're just kind of like, oh yeah, the finals, you know, like I just feel like there's we've seen trailers that look like this of a ton of games coming out and we're already exhausted by it. And that's the thing, too, where we double back and you go, okay, well, what does the success of Marathon look like to PlayStation? What does the success of this look like to Bungie? You know, sit here and we have uh on Friends Per Second uh you know, the director talking about we have these planes and we're going, you know, we're commit is committing to this long term blah blah blah. Remember one of Concord's big [ __ ] things, right? Oh, sorry. That's the timer. Yeah, of course. Now, this one I'm actually pretty proud of. Okay. And this person admitted they had too much time on their hands. Oh my lord. There's an essay. Nick uh Mezer uh did an essay, an actual essay. He wrote it",
            "start": 1310.32
        },
        {
            "text": "this one I'm actually pretty proud of. Okay. And this person admitted they had too much time on their hands. Oh my lord. There's an essay. Nick uh Mezer uh did an essay, an actual essay. He wrote it to Professor Blessing Edoy Jr. English 105 advanced game showdown studies in a the cowardice of Tim Getty's a farewell tour for a false king. There comes a time in every long-running story where the truth finally comes out. The masks fall away and the crowd sees their so-called hero for what he really is. For Kind of Funny's quote unquote champion, Tim Gettys, that time is now. For too long, Tim has strutdded around the Kind of funny game showdown stage like some kind of trivia god, racking up stars and drowning in his own hype. But hype can only take you so far. And when Greg Miller dash dash kind of funny he's walking chaos engine came to cash in stars in the bank. Tim didn't meet the moment like a champion. No. He packed his bags, clutched his limited edition JoyCons, and fled the",
            "start": 1347.52
        },
        {
            "text": "dash kind of funny he's walking chaos engine came to cash in stars in the bank. Tim didn't meet the moment like a champion. No. He packed his bags, clutched his limited edition JoyCons, and fled the state. Fled the state. This goes on for one. That's one page, two, three. This is four pages of just an essay this man wrote. You know what I mean? I'll just read you the final three sentences here, please. Four, I guess. Uh, the Tim Gettys era is over. Not because someone took his stars, but because he ran before they could. The champ is here. You can have that one, too. You can look at that one. Thank you. Thank you so much, Nick. Nick Matzer, set the timer again. Sorry for the next 10 minutes. Um, English 105 advanced game showdown studies. Yeah. Okay. We got some good kids out there. You know what I mean? Chicago man, they hate you. Good. They just hate you. They know what you did on Game Showdown. Um, this marathon business. Yeah. Like is it enough to stand out? Is it this? Is it",
            "start": 1391.52
        },
        {
            "text": "know what I mean? Chicago man, they hate you. Good. They just hate you. They know what you did on Game Showdown. Um, this marathon business. Yeah. Like is it enough to stand out? Is it this? Is it that? Is it? And are we having the same again right now at this? Let's just jump back cuz there's so much to talk about. I apologize. And I'm just excited to be on a microphone hanging out with my good friend Tim here that I love taking care of. You talked about at the top of where's the price? There's all this confusion. There's this, that, and the other. I feel like you are PlayStation. You didn't watch Concord die and it was an Xbox game. You lived this. And so the fact that you don't have a locked in rock solid here you go. Here's the next four seasons or whatever it is spelled out to show we are committed and show we are there to there isn't a packaged answer out there that I've seen. Maybe please you're wrong if there is of how are we sure this is going to be supported. Are we sure",
            "start": 1436.16
        },
        {
            "text": "we are committed and show we are there to there isn't a packaged answer out there that I've seen. Maybe please you're wrong if there is of how are we sure this is going to be supported. Are we sure this is going to be supported? And the answer is no. Of course, man. Yeah. God, it's so it's so complicated and I I want it to be very clear that I know that I sound just very doomy on all of this stuff and it feels very like we've been here before and like that our conversation sounds like guys we get it move on but why aren't they moving on? Like why are they continuing to to do this over and over like I feel like when we look at Concord specifically like they committed to a lot of things. They committed to, hey, there's going to be weekly story drops and all this stuff. And we're like, wow, you y'all believe in this game. We've cut scenes for an entire year. I can't believe that that's going to happen. How is that going to happen? But like, y'all are committing to this. And that didn't",
            "start": 1483.92
        },
        {
            "text": "you y'all believe in this game. We've cut scenes for an entire year. I can't believe that that's going to happen. How is that going to happen? But like, y'all are committing to this. And that didn't work out. And you look here with like how they're committing. And it's like I just I don't know. It feels like a a false sense of bravado if you're going to be like, \"Yeah, this is the plan.\" We've seen it before. Avengers, right? be the [ __ ] Avengers trying to go for this live service thing with a honestly foolproof plan of we're going to have all your favorite heroes month after month just be dropping. Sounds impossible. The Marvel Revival did and it's [ __ ] crushing it and continues to dominate. It turns out it was impossible for Crystal Dynamics like every single time like they put something out. It's like the whole day is dedicated to fan art of Emma Frost. You know what I mean? Anyways, it's like um I'm I totally lost the point I was making. It was good. that I promise that we're",
            "start": 1522.0
        },
        {
            "text": "out. It's like the whole day is dedicated to fan art of Emma Frost. You know what I mean? Anyways, it's like um I'm I totally lost the point I was making. It was good. that I promise that we're saying the same thing again. Yeah, but I think there's an interesting super chat I want to drag in there. Okay. L Captain 22 super chats and says, \"Kills me kills me that every game like this from Sony is going to be mentioned with Concord while Hell Divers 2's success is ignored.\" Yeah. Okay. Thank you. That actually sparked what I was saying. Um remember, and we don't know who the people are specifically, but like the conversation was PlayStation bought Bungie. Bungie is now kind of talking to the rest of their teams for their clear live service initiative of hey, there's some structure. there's some DNA here that we know stuff because of Destiny 2 that we're going to educate the PlayStation to some extent, right? And now you look at it here and it's like cool. Well, this is the example of",
            "start": 1561.84
        },
        {
            "text": "some DNA here that we know stuff because of Destiny 2 that we're going to educate the PlayStation to some extent, right? And now you look at it here and it's like cool. Well, this is the example of that seems a little scary and upsetting in the wake of something like Concord. Having said that, Hell Divers 2 major freaking success. And to give Marathon its props and not just like completely like ride it off, they did the one thing that we all wanted Concord to do, which was just let people like after we saw the first initial preview or reveal of it, we're all like, why didn't they just let people play and let that speak for itself? And that's what happened with Apex Legends and that became a huge hit because it had this like unique marketing strategy that's not just like, oh, shadow reveal, shadow drop. It's when the entire conversation is, yo, this game's good. I played it. It's good. That goes so far. And so, hey, at least they let people play the game here, but we're now at a point",
            "start": 1599.28
        },
        {
            "text": "shadow drop. It's when the entire conversation is, yo, this game's good. I played it. It's good. That goes so far. And so, hey, at least they let people play the game here, but we're now at a point that you need to couple that with all the right answers. And a lot of the stuff they're saying here simply aren't the right answers when it comes to price slash not actually having a price, but knowing that it's going to have a price. Yeah. That is like this nebulous thing that gives people Yeah. own it. And I know why they don't want to own it. Again, tear stuff aside. Even besides that, it's like because of Concord. Yeah. Uh to this question about, you know, oh, it's going to be compared to Concord rather than Hell Divers 2. I think again we're talking about to a degree apples and oranges where Hell Divers 2 of course they don't own Arrowhead. They own the IP. But again, back to what is a success for any of these companies, the number they wanted to hit with Hell Divers 2, I'm sure, is",
            "start": 1642.8
        },
        {
            "text": "Hell Divers 2 of course they don't own Arrowhead. They own the IP. But again, back to what is a success for any of these companies, the number they wanted to hit with Hell Divers 2, I'm sure, is far smaller than what they wanted to hit with Concord and what they want to hit uh with Marathon. Bungie Concord a new Star Wars. Bungie is a studio that they bought for all this live service initiative. Their expertise that has not that fruit has not been buried for that which includes Marathon, right? Like like why are they doing Marathon? Because they own that IP. So it's like you don't get another swing at the bat at Marathon. If Marathon doesn't work, Bungie closes, right? I don't know that I'd go that far. I I think so. I I don't mean immediately. I don't think it's the Concord level of hey we're going to take this back to square and I was like you guys are dead and then they were dead a month or two later months later. Uh I think this would be the thing of like okay cool like you're",
            "start": 1683.84
        },
        {
            "text": "we're going to take this back to square and I was like you guys are dead and then they were dead a month or two later months later. Uh I think this would be the thing of like okay cool like you're going to you're going to churn on Destiny stuff for a while but like I mean I feel like that would just be it right then just become hey Destiny 3 that's what you're doing. I mean do they but I mean would they get to getting there you think? I mean I think so. Like I I think I mean Destiny's been the you know the the the the slope of uh not getting the rewards you want out of it. It's been it's doing diminishing returns. There you go. Thank you so much. Go I've been on a vacation. I get it. I get it, man. Uh yeah. Where I think like that would be the thing about it where even if if it's are they spinning up a Destiny 3? I forget what the I mean I I don't know. But I I think that uh despite the diminishing returns and all that stuff, I do think that despite anything they may or may not have",
            "start": 1730.08
        },
        {
            "text": "spinning up a Destiny 3? I forget what the I mean I I don't know. But I I think that uh despite the diminishing returns and all that stuff, I do think that despite anything they may or may not have said in the past, hey, it's Destiny 3. I do think that that's going to get that im like if we're just talking about success, it might not be bigger than Destiny one or two, but like I do think that it'll like hit where they need it to. Is that necessarily the right move and where the I don't know, but I don't I don't think that this tanks Bungie. Uh really interesting uh YouTube comment from Jeff Grubs game mess. I don't know what that is. Uh I mean it won't close, but it will be completely different. It'll be a shell of itself if Marathon doesn't work. Which I think is kind of what you're saying. Yeah, that's what I'm saying. I saw somebody in there was like, \"Oh man, they wouldn't throw away the billions of dollars.\" Well, no, they're not throwing it away, but they would reabsorb those",
            "start": 1766.8
        },
        {
            "text": "Yeah, that's what I'm saying. I saw somebody in there was like, \"Oh man, they wouldn't throw away the billions of dollars.\" Well, no, they're not throwing it away, but they would reabsorb those people into different roles of PlayStation and be like, \"You're not making a Destiny 3.\" Yeah. I mean, you know, we talked about this a bazillion times about Activision with Vicarious Visions, all the other teams, but like, yeah, you're making Overwatch maps now, you're making, you know, Call of Duty maps now. Like, that's what you're doing. So, yeah, maybe. But at that point, what are they doing? Cuz it's like I mean, what are they do PlayStation? I mean, like, what are they doing with live services? This wasn't the way to go. And again, though, I said this earlier, but this being on Xbox 2, I do think gives it a little bit extra of like there's some potential here. I don't think that it's over for Marathon yet. Let's get into super chats about because plenty people have written in what they",
            "start": 1806.64
        },
        {
            "text": "think gives it a little bit extra of like there's some potential here. I don't think that it's over for Marathon yet. Let's get into super chats about because plenty people have written in what they think about it. Uh, Street Shadow gave a very handsome uh super chat here. Thank you so much. It said, \"Very excited for Marathon. They have room to improve, but something they are doing that is very positive for me as a longtime and still active Destiny player is the level of openness and community engagement they are doing from streamers to normies. Uh we got more in here. I'm sorry there's everywhere, you know, we got a bunch of people talking about uh Cody says, \"I think Marathon has a lot of promise. Even if you guys don't love the look, watch the cinematic trailer. Uh it's uh by the Love Death and Robots, guys. So good.\" Hell yeah. Uh again, I I love the look. I think the look looks good. Is that too? Huh? You also feel that way of the game? Yeah. The greens and the thing style of",
            "start": 1836.88
        },
        {
            "text": "Death and Robots, guys. So good.\" Hell yeah. Uh again, I I love the look. I think the look looks good. Is that too? Huh? You also feel that way of the game? Yeah. The greens and the thing style of the game. It looks different. Concord did not look different enough. I think as And I'm not again I'm not a person for Does that translate to live service success though? Exactly. Yeah. Yeah. Does that actually matter? I don't know. And then anytime you go Well, I guess you were talking specifically about the look I want then. I was like cinematic trailer doesn't help me because I'm wanting to know how the game plays, but again that's different guys conversation of it. But cinematic trailers in general, let's not base our hype on any of that stuff. CJ splits on says game looks cool needed hands-on hate the freeto play or bus narrative around multiplayer titles these days to jump back to that that was a thread you had in put out very well Tim it is the idea of when marathon launches in",
            "start": 1877.12
        },
        {
            "text": "hands-on hate the freeto play or bus narrative around multiplayer titles these days to jump back to that that was a thread you had in put out very well Tim it is the idea of when marathon launches in September where are we globally in the financial landscape and and how much are people willing to spend $40 to jump into something that looks cool when they could go play Fortnite when they could go play etc etc etc etc etc etc when they could go play all their Switch games. Yeah. and CJ saying they hate the freeto play or bust narrative around multiplayer titles these days. It's like I it it's not up to us to like or hate it. It's it is what it is. Like we are we're in a world where like I am so happy that Hell Divers exists as a counterpoint to what I'm saying 100%. But like that is an outlier period. And like that to me is like thank god there are outliers. Thank god there is potential for this to be fought back against. But you there needs to be so much love, care, and luck involved",
            "start": 1917.12
        },
        {
            "text": "period. And like that to me is like thank god there are outliers. Thank god there is potential for this to be fought back against. But you there needs to be so much love, care, and luck involved in that. Whereas you look at some of these things, it's like there are just too many successful free-to-play games. And when you design a game that walks like a duck, talks like a duck, and all that stuff, and it's very expensive duck. Yeah. Yeah. Guys, I lost it. All right. You know what I'm saying? But I lost where exactly I was. You lost the duck. I lost the duck. Where's the duck, everybody? Oh, Hell Divers, you know, is being this outlier and also being something that draws me in. Like, it's again that Hell Divers says all the right things for me wanting to play those games of play with your friends, which you can do here. Great. Sure. Okay. But it's also the buy the war bonds and they never expire. You're always earning for that. You're doing the thing. I don't feel like I'm on the",
            "start": 1960.48
        },
        {
            "text": "your friends, which you can do here. Great. Sure. Okay. But it's also the buy the war bonds and they never expire. You're always earning for that. You're doing the thing. I don't feel like I'm on the treadmill. When I'm reading this one and they're immediately talking about, well, your progress gets wiped in the end, which I don't like about Diablo. I don't love rolling a new character. I like having a lineage there. the idea of jumping into this, going through, playing it, have and then learning a new meta, doing a whole thing. Like, granted, I'm not the guy for this game. This isn't meant to be a great game. But I can tell you why I am why I love and still play Hell Divers. Oh, timer's going off. Why I love and play Hell Divers, but why I look at this one and I'm like, I don't think I would come back to this one. Uh, this one says, quote, \"Team Greg,\" and then it's attributed to Han Zimmer. Oh, Aaron Aaron wrote this. Aaron Hesselink wrote this one, though. Thank you. I thought Hans",
            "start": 2002.8
        },
        {
            "text": "come back to this one. Uh, this one says, quote, \"Team Greg,\" and then it's attributed to Han Zimmer. Oh, Aaron Aaron wrote this. Aaron Hesselink wrote this one, though. Thank you. I thought Hans himself was there. Why? You Aaron probably heard that in the bathroom. He probably heard him say that. Whatever. Uh, boycott Activision says, \"$40 equals less players. Free to play equals more cheaters, i.e. Delta Force.\" I love just coming out to dunk on Delta Force. Do you have to pay for Call of Duty War Zone? No, right. War Zone's free to play. Oh, yeah. Okay. Uh, Gator Mash Potato says, \"I am interested in Bungie's take on the extraction shooter, and this does look cool, but the premium price makes it makes me less interested to check it out on day one.\" And again, what is that number that they need on day one to be like, \"This is great. This is what we wanted. Now we're ready to go.\" And because it is that usual usually for games, right, your numbers is at the highest when you are",
            "start": 2036.32
        },
        {
            "text": "they need on day one to be like, \"This is great. This is what we wanted. Now we're ready to go.\" And because it is that usual usually for games, right, your numbers is at the highest when you are launching. Here we go. And then it's going to be this decrease, but bringing it back, but bring are you ever getting back to that number? and is like, are they going to be able to ride that thing back? That number in to start isn't like where it needs to be. There's no coming back at this point. You know, I think gone are the days of the Rainbow Six Sieges and things like that of just like, oh, we can like we can fix this. We can get this because I think that so many of those were bolstered by other titles in the library in the portfolios of these publishers. And I think that one by one, we're seeing different verticals of these type of games get wiped out, not have enough success, and like studios get closed. And it is kind of uh condensing on, okay, we're losing, we're not made enough money",
            "start": 2080.4
        },
        {
            "text": "different verticals of these type of games get wiped out, not have enough success, and like studios get closed. And it is kind of uh condensing on, okay, we're losing, we're not made enough money here. Let's pivot to more of these like free-to-play live service games or whatever. And then it's like, well, well, what if the live service wasn't free to play? What if we also charge? What if we tried to make even more money from it? And that's where we're at now. Street Shadow writes in and says, \"Free to play is a pro and a con with extraction shooters. Cheaters are more likely in freeto play, but Tarov is the biggest extraction shooter, and it's not free to play.\" Then you get into this other argument of do we think Marathon is going to be better than Escape from Tarov at launch. No. Now granted this, correct me if I'm wrong, Tarov's only PC, right? That's not Xbox, not PlayStation. So you have no alternative over there. But obviously a huge reason Hell Divers was so successful was the",
            "start": 2119.04
        },
        {
            "text": "this, correct me if I'm wrong, Tarov's only PC, right? That's not Xbox, not PlayStation. So you have no alternative over there. But obviously a huge reason Hell Divers was so successful was the idea of, hey, here you go. A lot of people in the chat are saying yes. So may maybe I'm totally wrong. So it's like or not even wrong, but again, we're talking about, hey, you are committed to Tarov if you're that kind of player. Is this enough to turn your head and get you into it? I don't know. So, it's interesting enough. I mean, the the sheer fact of the matter is Tarov, for as popular as it is, is not going to get the backing ever that a a PlayStationbacked Bungie with the game multiplatform like with a NIP marathon. It's like that's going to get so much push that yeah, people are going to be interested. But wasn't the question, is it going to be as good as Yeah, I was saying yeah, at launch is going to miss features, not have this blah blah. That's the problem. I I feel like comparing a",
            "start": 2157.76
        },
        {
            "text": "interested. But wasn't the question, is it going to be as good as Yeah, I was saying yeah, at launch is going to miss features, not have this blah blah. That's the problem. I I feel like comparing a game and I know that Tarov also is like like a different level of game. So maybe in some ways Marathon will be better, but it will not be as feature complete as Tarov, I don't think. And I think that is going to definitely people can look at me like why the [ __ ] would I pay for this when I could do this? Uh Bobby Joe writes in and says, \"If the gameplay is good, I'm 100% in. Bungie usually crushes how a first person shooter should feel. So I'm hoping this is a banger.\" Yeah. I mean I I again don't know. I haven't seen any real thoughts on hands-on for this and later he'll from Paris, but I imagine it feels great. Uh, Alex says, \"If it's 40 bucks coupled with the great preview coverage and hype, I'll buy. Concord didn't have either.\" Interesting point. And then Deckor says, \"It's hard to",
            "start": 2197.28
        },
        {
            "text": "it feels great. Uh, Alex says, \"If it's 40 bucks coupled with the great preview coverage and hype, I'll buy. Concord didn't have either.\" Interesting point. And then Deckor says, \"It's hard to pay a pre pay a premium on this to try something that is already giving me the same feeling I had with Anthem, missing the X factor.\" And I think that goes back to both skill up and then what I've seen a few different people say. We'll see what Paris says on Gamescast here of what is the hook, what is the thing, what is the special sauce that this is bringing. You go, \"Yes, this is why I want to commit.\" We'll find out soon. Ladies, gentlemen, and NBS, it's time for you to hear a word from our sponsor. Remember, if you don't want to hear from our sponsors, you can pick up a kind of funny membership, get all of our shows ad free, get a daily dose of me in a series I call Greg Way, and of course, support an 11 person small business so you get some good karma. But right now, you're not. So, here's",
            "start": 2234.48
        },
        {
            "text": "get all of our shows ad free, get a daily dose of me in a series I call Greg Way, and of course, support an 11 person small business so you get some good karma. But right now, you're not. So, here's a word from our sponsor. This episode's brought to you by Imperial. We've told you all how important it is to developers to wishlist games you're interested in on Steam. So, if this game sounds cool to you, make sure that you wishlist it. In Imperial, you play as a mercenary sent to a distant planet to discover the mysteries of an ancient civilization. Powers unknown lie within the monolith, but those are no mere ruins, as an expedition has already ventured inside with only a few survivors. Why was it built? What powers reside within? Who is at the center of the monolith? All these secrets and more will be uncovered if you are brave enough to take on Imperial. Imperial features a unique blend of RPG systems and skill-based combat across three weapon archetypes. The acrobatic glaive, the",
            "start": 2278.64
        },
        {
            "text": "more will be uncovered if you are brave enough to take on Imperial. Imperial features a unique blend of RPG systems and skill-based combat across three weapon archetypes. The acrobatic glaive, the defensive but devastating mace and shields, and the powerfully ranged cannon. With a deep ability system and extensive customization, every battle is an opportunity to refine and optimize your combat style. Form relationships with each of the few surviving expedition members who all have their own personal quest lines. Whether you choose to help or not can have drastic consequences for them. The monolith is guarded by powerful automatons, each with distinct attack patterns and weaknesses that demand precise execution and strategy to be victorious. Create your mercenary, enter the monolith, learn powerful abilities, defeat the automatons, and uncover the secrets that lie within Imperial. Imperial is available May 8th on PC, Xbox S, and X, and PS5, but you can wishlist now. Do it. Wishlist",
            "start": 2320.8
        },
        {
            "text": "powerful abilities, defeat the automatons, and uncover the secrets that lie within Imperial. Imperial is available May 8th on PC, Xbox S, and X, and PS5, but you can wishlist now. Do it. Wishlist Imperial. This episode is brought to you by Factor. Make this your best season yet with nutritious 2-minute meals from Factor. Eating well has never been this easy. Just heat up and enjoy, giving you more time to do what you want. Greg Miller has been loving how simple it is to enjoy his Factor meals as he's rushing between shows each day. I just saw Blessie eating some, too. Factor arrives fresh and fully prepared. Perfect for any active, busy lifestyle. Factor powers your day with satisfying breakfast, onthe-go lunches, premium dinners, and guilt-free snacks and desserts. Factor can help you feel your best all day long with wholesome smoothies, breakfast, grab-and-go snacks, and more add-ons. Multiple people here at kind of funny have been loving their experience with Factor. And guess",
            "start": 2369.28
        },
        {
            "text": "feel your best all day long with wholesome smoothies, breakfast, grab-and-go snacks, and more add-ons. Multiple people here at kind of funny have been loving their experience with Factor. And guess what? You can too. Get started at factormeals.com/kindafoney5050 off and use code kind of funny 50 off to get 50% off plus free shipping on your first box. That's code kind of funny50 off at factormeals.com/kindafoney50 off for 50% off plus free shipping. This episode's brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized shades that won't break the bank. Shady Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people. They have hundreds of options to choose from, so you're bound to find the perfect pair to match your style. If you don't love your shades, exchange them for a new pair or simply return worry-free within 30 days.",
            "start": 2414.56
        },
        {
            "text": "of options to choose from, so you're bound to find the perfect pair to match your style. If you don't love your shades, exchange them for a new pair or simply return worry-free within 30 days. There's no risk when you shop. Their team are always there to have your back with personal and fast supports. Y'all know I've been outside a lot playing Pokémon Go, and it's such a great experience wearing Shady Rays when I'm out and about looking dope. Exclusively for you, Shady Rays is giving out their best deal. Head to shady.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. again. Go to shadyrays.com. Use code funny to get 35% off polarized sunglasses. Bryce writes in to the Stars in the Bank Tim hate mail uh thing and says, \"My son had brain cancer, but watching Tim cheat away Greg's hard-ds is the worst thing that happened to him.\" The best part about Bryce had to redo it. Yeah. Like he started writing it. I looked",
            "start": 2466.24
        },
        {
            "text": "\"My son had brain cancer, but watching Tim cheat away Greg's hard-ds is the worst thing that happened to him.\" The best part about Bryce had to redo it. Yeah. Like he started writing it. I looked over and I was and he like I'm like, \"Are you stopping?\" And he's like, \"No, I just screwed up a word in there.\" I'm like, \"All right, good.\" I'm good. I'm like, I like where that one's starting, Bryce. As a man who jokes about his own cancer, I like how you're starting this one. Let's keep going. Number three on the Roper report. Sony is raising the price of the PlayStation 5, parenthesis again. This is Michael Mcwarter over at Polygon. The price of the PlayStation 5 is going up again in some territories. Sony Interactive Entertainment announced on Sunday uh on its PlayStation blog. Sony's latest price increases went into effect on Monday and affected consumers in Europe, the UK, Australia, and New Zealand. Uh Sony blamed quote a backdrop of challenging economic environment, including high",
            "start": 2515.84
        },
        {
            "text": "price increases went into effect on Monday and affected consumers in Europe, the UK, Australia, and New Zealand. Uh Sony blamed quote a backdrop of challenging economic environment, including high inflation and fluctuating exchange rates end quote in a statement attributed to Isabelle Tomita, uh vice president of global marketing at SIE. In Europe, the price of the PlayStation 5 edition is now €499.99. Uh, that's a 50 euro increase and now 100 euros more than the PlayStation 5's digital's launch price in Europe, which was £399.99. Uh, the UK is getting a pricier, okay, yes, pricier PlayStation 5 digital edition 2. It's now £429.99. Uh, that's an extra £40 compared to what the console cost last week and 70 more than the console's original price in the UK at £359.99. Uh, in Australia and New Zealand, both the PlayStation 5 digital edition and the standard PlayStation 5 with a 4K blue uh, array disc drive are getting price increases. The price of the PlayStation 5 Pro is not changing in",
            "start": 2556.16
        },
        {
            "text": "Zealand, both the PlayStation 5 digital edition and the standard PlayStation 5 with a 4K blue uh, array disc drive are getting price increases. The price of the PlayStation 5 Pro is not changing in any of those regions. One piece of PlayStation 5, one piece of PlayStation 5 hardware that's getting less expensive is the conso's 4K Bluay Drive add-on. Sony previously raised the price of the PlayStation 5 in Canada, Mexico, Europe, UK, Australia, Japan, and China back in 2022. When's it coming to America, Tim? Who the hell knows when's it going to come and then go away the next day and then come back worse the day after that? Like, we just in such tumultuous times that it almost feels silly to speculate and even give any thoughts on this. Just sucks. This is not like it was even the last time this happened cuz it happened last time, Greg. We're at a point now that in the console generations, we're not getting price cuts. We're getting price increases. That was scary when it first",
            "start": 2611.2
        },
        {
            "text": "time this happened cuz it happened last time, Greg. We're at a point now that in the console generations, we're not getting price cuts. We're getting price increases. That was scary when it first happened when we see games just get more and more and more expensive and just get standardized in that way. Mario Kart [ __ ] world is $80. That is nuts, man. I I hate this. And there's just no getting away from it. Yeah. Uh Bears got his tweet up from the one, the only Matt Piscatella. He's quote blue skying. I don't know what he [ __ ] say. uh games industry biz that says uh major Nintendo supplier warns Nintendo Switch 2 will be subject to 145% US tariffs. Matt quote quote tweets it and has a quote that says uh quote that's because US President Trump has now confirmed Chinese-made electronics will not be exempt by simply move to a different tariff bucket which means hardware created in China including PlayStation Sony's PlayStation 5 consoles will likely still be impacted. End quote. Of",
            "start": 2655.2
        },
        {
            "text": "will not be exempt by simply move to a different tariff bucket which means hardware created in China including PlayStation Sony's PlayStation 5 consoles will likely still be impacted. End quote. Of course over the weekend there was a whole bunch of different breaking news. news. I'm reading from a Washington sky blue uh blue sky uh I'm sorry, Washington Post Blue Sky breaking news. The Trump administration announced that smartphones, computers, and other electronic components are exempt from reciprocal tariffs. Uh days after the United States imposed the highest levies on foreign goods in a century. Important that this of talks a lot about computers and phones, it is not uh video games. The video games still are attributed to all this. So everything's [ __ ] crazy and sucks. Yeah. And again, it's like it's just the scariest part is just feeling like there's no resolution coming. Like at any moment, all of this could just be like, \"Guys, we fixed it.\" Or more likely, hey, it is worse",
            "start": 2700.56
        },
        {
            "text": "it's like it's just the scariest part is just feeling like there's no resolution coming. Like at any moment, all of this could just be like, \"Guys, we fixed it.\" Or more likely, hey, it is worse than you could ever imagine. Or or more accurately, you'll never know. We're never going to hit a this is the new normal. The new normal is where we're in right now, which is utter [ __ ] chaos. Yeah. This is what this is a shitty question to ask because we're talking about the chaos and nobody knowing anything x y and z but I have to ask when do you think we find out what Nintendo is going to do? I mean I don't know like the the reality is this is a make orb breakak moment for this company. Like this is their next generation system that they are going to be supporting for the next probably 10 years. Sure, the Switch 3 or whatever it is might also come out. They're still going to be supporting the Switch 2 after uh the Switch 3 comes out. You got to imagine that's how these things used to like",
            "start": 2736.64
        },
        {
            "text": "Sure, the Switch 3 or whatever it is might also come out. They're still going to be supporting the Switch 2 after uh the Switch 3 comes out. You got to imagine that's how these things used to like have been working and now I think more so than ever because of just how ecosystems work. Yeah. Uh and we see Nintendo adopting that with the uh Nintendo Switch online profiles and accounts like actually like following you and all of that like Yeah. like if they are not positioned for a maximum install base at the jump, that's going to be very very bad for them when they're trying to sell games and they have a limited install base. Like we've seen it happen so many times before. But even look at at Xbox right now. How many times have we talked about stories of games not selling well on Xbox because the install base just isn't there and all of that. And like that we're talking about big numbers here, right? Like it's just scary if that's Nintendo and like they need that. They we're talking",
            "start": 2790.16
        },
        {
            "text": "the install base just isn't there and all of that. And like that we're talking about big numbers here, right? Like it's just scary if that's Nintendo and like they need that. They we're talking about a company that has the most insane attach rate ever and like they you need systems out there to be able to attach the software to 100%. And I do think that no matter what happens here well that's going too far cuz good lord anything can happen. But like I believe it is as close to a guarantee as you can get that no matter how many units uh Nintendo has been able to make and they say that this is by far the most they've been able to for a launch they're going to sell out like I think that is a guarantee but what what happens next? What happens when do you think there's no ceiling on that statement that there's no price this thing is going to go up to where they don't sell out? I don't think so. I think no matter and again there's a reality here where things are just so bad that why are we",
            "start": 2836.88
        },
        {
            "text": "that there's no price this thing is going to go up to where they don't sell out? I don't think so. I think no matter and again there's a reality here where things are just so bad that why are we even talking about video games? Yeah, of course. Of course, of course. But like I I I think that no matter what happens, the Switch sells out like in in in any I think realistic next couple months of how things could shake. Yeah. There's also the side of does Nintendo pull the truck and be like pull the plug and be like we're not releasing it this year. I don't see that happening because they need to make money. They need to like get the games out and the software and all this stuff. It's like it's this sucks. This could potentially ruin so many companies no matter how big and powerful they are. Yeah. Do you think they delay it? I know that they said like as of now, right, we still haven't heard anything about like the the pre-orders. They were only delaying the pre-orders in US and now",
            "start": 2878.08
        },
        {
            "text": "are. Yeah. Do you think they delay it? I know that they said like as of now, right, we still haven't heard anything about like the the pre-orders. They were only delaying the pre-orders in US and now Canada. Uh and they said that it'll still launch June 5th. Do they delay that in the States? I I 100% Oh, so you're just asking like only in America if they delay it, but like they release everywhere else. I just I don't see them doing that. America's too important and powerful when it comes to the voice of video games and like the all that stuff. Like that's we just see how sales of games work and all that. Like they I think that that is that would be a very very bad strategy for them and I I don't see them doing that. I mean, do they do they delay worldwide? I think that's way more likely. Um, and I I think at this point it's I any hypothesis I could have is pulling out of my ass. Totally. I mean, this could easily by the time this hits Spotify, some other crazy [ __ ] [ __ ] could have",
            "start": 2919.04
        },
        {
            "text": "and I I think at this point it's I any hypothesis I could have is pulling out of my ass. Totally. I mean, this could easily by the time this hits Spotify, some other crazy [ __ ] [ __ ] could have come out of China or out of the White House or out of whatever in this stupid ass trade war were for no [ __ ] reason. Yeah. So, like if you ask me right now, do I think the Switch 2 is going to get delayed? No. But you could see it. I Oh, a thousand% I could see it. I I I wouldn't bet anything that it it won't, but like I think that they have a plan. They again these things need to be sold or else the company is in trouble. Like there's an entire plan with like a lineup of software that they need to get out there. Like and sure they can like take the hit for a while. But I do think it gets to a point that it's like there's just too too much money at stake uh that needs to be in play, but like there's bigger, more important things out there and there's factors that are getting involved that",
            "start": 2963.04
        },
        {
            "text": "point that it's like there's just too too much money at stake uh that needs to be in play, but like there's bigger, more important things out there and there's factors that are getting involved that like could again just could tank the entire industries surrounding this course if the wrong moves are made. 100%. Speaking of wrong moves, Greg, number four on the Roper Report, Mythic Quest has been cancelled by Apple after four seasons. Uh this is Nelly and Geriva over at Deadline. Apple TV's a Apple TV Plus's Mythic Quest has come to an end. The streamer has opted not to renew uh the gaming or workspace comedy series for a fifth season. The decision comes days after the season 4 finale dropped March 26th. Uh since it had not been conceived as the series finale, the seasons 4 finale will now get a new ending to give fans closure. The updated episode will be made available next week. quote, \"Endings are hard, but after four incredible seasons, Mythic Quest is coming to a close. We're so",
            "start": 3005.04
        },
        {
            "text": "get a new ending to give fans closure. The updated episode will be made available next week. quote, \"Endings are hard, but after four incredible seasons, Mythic Quest is coming to a close. We're so proud of the show and the world we got to build, and deeply grateful to every cast and crew member who poured their heart into it.\" Series creators/executive producers Megan Gans, David Hornsby, and Rob Mlany, is that how I said the one? I always forget. Uh, said in a statement Friday, quote, \"To all our fans, uh, thank you for playing with us. To our partners at Apple, thank you for believing in the vision from the very beginning. Because endings are hard, with Apple's blessing, we made one final update to our last episode so we could say goodbye instead of just game over. End quote. Yeah. So, that the new version of the finale is coming out sometime this week. I'm incredibly bummed about this news. I loved this show. It was not always perfect. I think season two uh overall was not good",
            "start": 3052.48
        },
        {
            "text": "that the new version of the finale is coming out sometime this week. I'm incredibly bummed about this news. I loved this show. It was not always perfect. I think season two uh overall was not good enough. I don't want to say it was bad, but I think that season 2 kind of put them in a in a place that they lost a lot of people that were kind of watching week to week rocking for it. Uh and and then I think that uh season 3 and four got into a much better spot of realizing like we now just have an amazing cast of characters that just putting them in situations and letting them be the way they are is fun. It reminds me a lot of community or the office and things like that where you were like just at a certain point it's not about the plot. You're here for the characters. Sure. Sure. Sure. And god, they got there. Like season 4 was awesome because of everything I just said. Like amazing characters and amazing choices for them. The the two leads, uh, Ian and and Poppy were awesome. The",
            "start": 3092.56
        },
        {
            "text": "And god, they got there. Like season 4 was awesome because of everything I just said. Like amazing characters and amazing choices for them. The the two leads, uh, Ian and and Poppy were awesome. The dynamics they had, the amount of situations they put them in and took them out of and back and forth and back and forth. It's a sitcom workplace comedy, right? Like, we've seen a lot of this stuff before, but we haven't seen it in the video game space. And the amount of times, if you've watched the show every freaking day, you've heard us say this a lot, but the amount of times that Bless and I, who are two of the people I know that watch the show, have brought up the show clearly is written by people that watch Games Daily. Like, it is jokes for us. Like, it is. And they're smart. It very, very, very smart. Very fun. Like, it's a show that should not have been nearly as good as it was. Um, yeah. I mean, I remember this getting announced, right? Oh, Ubisoft's doing a show with Apple as",
            "start": 3136.32
        },
        {
            "text": "very, very smart. Very fun. Like, it's a show that should not have been nearly as good as it was. Um, yeah. I mean, I remember this getting announced, right? Oh, Ubisoft's doing a show with Apple as Ubisoft's uh like E3 show and we're like what the [ __ ] is this and so wrong and again I'm not trying to say it's the best thing ever but I will say that it is a incredibly good comedy. Like I think that they've gotten to a point that they like like I'm watching this and I I put it up there. I think Hacks is the best. But in terms of the contemporary kind of comedies like it's this Hacks like I um like I like this a lot more than Sex Lives of College Girls and I loved that show. another one that just got cancelled. But at the same time, I can't believe the show made it to four seasons in a spin-off. Yeah. Um I'm very uh it's called Side Quest. It just came out. It's like technically the last uh I guess besides the little bit that they're adding here. It's the latest thing that they did.",
            "start": 3179.12
        },
        {
            "text": "Yeah. Um I'm very uh it's called Side Quest. It just came out. It's like technically the last uh I guess besides the little bit that they're adding here. It's the latest thing that they did. It was four episodes. Um show ran by Ashley Burch, who is a a lead in the the show um in the main show. And she also uh wrote and directed a couple of the episodes in Side Quest. And side quest was Mythic Quest. One of the best things about it was every season they would do at least one episode that was just completely not part of the main story and they would just follow one character's like backstory and it would always add some very interesting and usually the best episode of the season. Yeah. Side quest was kind of like let's just do that for a whole show. Gotcha. And like one of them was about and it's always like relating to Mythic Quest that is this video game. And the amount of video game culture that they were able to fit in the show and treat authentically is something that really needs",
            "start": 3223.6
        },
        {
            "text": "it's always like relating to Mythic Quest that is this video game. And the amount of video game culture that they were able to fit in the show and treat authentically is something that really needs to be commended. And I'm saying all this because y'all should watch this show. Even if it's over the time that's there, it's worth your time. And that's really cool. They get to do an ending. It it is. And I'm very interested in what's that going to be. I don't think it can possibly be great. Like just with where you're laid off with I mean real talk, I I think that's going to be what it is. Like that's the type of show that this is. Um, but it's it's crazy that uh the side quest like one of the episodes was about um the comic book based on the game and it takes place in a comic book store uh the day that that comic shows up and the people that are coming to get it, right? Awesome concept and they just do a really good job with it. Another one is about the violinist in or maybe not",
            "start": 3266.16
        },
        {
            "text": "uh the day that that comic shows up and the people that are coming to get it, right? Awesome concept and they just do a really good job with it. Another one is about the violinist in or maybe not violinist, whatever, some instrument in a video game orchestra concert for Mythic Quest and like just following her journey. It's like very very very smart video game culture stuff. So yeah, I'm very sad that this happened that it was canceled this way and like I I get it though. I totally get it. But shout out to them for four and four seasons in a spin-off that I thought were excellent. I would recommend everybody watch it. Apple TV continues to be the unsung hero of the streaming game. They need to [ __ ] promote their stuff better. And this is what happens. They don't do that. Yeah. They just let their shows happen. The people that are watching them are like, \"These are so freaking good.\" But unless you're severance, it's like it you never hear about it. You don't break out. Barrett. Uh",
            "start": 3307.76
        },
        {
            "text": "let their shows happen. The people that are watching them are like, \"These are so freaking good.\" But unless you're severance, it's like it you never hear about it. You don't break out. Barrett. Uh if you don't like the ending of season 4, Tim, you can just pretend it the show ended at season two where it should have ended. No. The ending of season 2 is very good and that's where the show should have ended. I mean, here's the thing. Plot-wise, yes. I entirely agree. But like show comedy wise, absolutely. Oh, that I get that I cuz the ensemble cast [ __ ] great. I could watch them forever doing a different show. Like I would love to see them still work on something else. Yeah. And that's plotwise. Yes. That that show should have ended at season two. Yeah. But season two, but whatever. Okay. Have Oh, here we go. Timer's off. Hold on. Stop that. This one's in all caps, it looks like. Uh, this one says, \"Can't wait to see you lose all your stars, loser.\" Joey, sooner or later, TV. There's",
            "start": 3348.8
        },
        {
            "text": "Have Oh, here we go. Timer's off. Hold on. Stop that. This one's in all caps, it looks like. Uh, this one says, \"Can't wait to see you lose all your stars, loser.\" Joey, sooner or later, TV. There's one for you. Thank you. No problem. Don't worry about it. Thanks, Joey. Uh, number five on the roper report. A new respawn. Well, start the timer. A new respawn Star Wars game has been announced. This is Wario 64. Uh, the blue sky reads Star Wars Zero Company from bit reactor/respawn single player turn-based tactics game announced. First look at Star Wars Celebration on April 19th. Dick, this has been rumored for a while. So, this is one of those announcements that's kind of like I feel like would have been very exciting to talk about, but it's kind of, oh yeah, yeah, we knew this. We talked about this already. It's everything that we have seen and heard. Cool, though. I mean, I I think that uh it's it's great that these turn-based tactics games like seem to have an audience and seem to",
            "start": 3388.8
        },
        {
            "text": "about this already. It's everything that we have seen and heard. Cool, though. I mean, I I think that uh it's it's great that these turn-based tactics games like seem to have an audience and seem to kind of be well fed in the last five years or so. So, uh hopefully this is another win for for Respawn and uh Bit Reactor. can't pull what they've worked on off the top of my head. But I know I should be able to cuz I know it too. But their site ain't that great. Their site ain't that great. They make video games. Oh, they're XCOM vets. The chat saying great. I mean, yeah, that's awesome, right? Like we we talk about all the time of like what IP and what developer would you want to see make this type of game. Yeah, cool. They're they're doing this here. And I think Respawn um at the very least have proven that they have uh really smart takes on the world of Star Wars and they they care in the right ways. So hopefully they can apply that to this as well. Barrett, does as a Star Wars guy,",
            "start": 3433.52
        },
        {
            "text": "have proven that they have uh really smart takes on the world of Star Wars and they they care in the right ways. So hopefully they can apply that to this as well. Barrett, does as a Star Wars guy, does this do anything for you? No. Um I'm just not an XCOM guy. Like if if they make it as like entry level uh for a [ __ ] like me who enjoyed Mario Plus Rabbids, maybe. But yeah, no matter like how much I I love Star Wars, I just know that there's gonna be certain types of genres that just aren't going to be for me. Um I think like it's interesting. This picture is interesting though because we see like a a seemingly a clone trooper um like general or something. Maybe that's stolen armor or something. The vibe is definitely um the vibe of this picture is definitely cool and it reminds me of a different era of Star Wars. It reminds me of pre-D Disney Star Wars, you know, like let's just do [ __ ] And with that, I'm like, [ __ ] yeah. This might not be for me, but I'm glad all the sickos are",
            "start": 3480.88
        },
        {
            "text": "era of Star Wars. It reminds me of pre-D Disney Star Wars, you know, like let's just do [ __ ] And with that, I'm like, [ __ ] yeah. This might not be for me, but I'm glad all the sickos are going to get to enjoy this. I think the sickos enjoying Star Wars is great, but it's also big news. Tim, if I was sick of the big news and one of the smallest news I need to know about, where would I go? That was horrible. Just want to let you know. Me and Bless bust our [ __ ] ass every day to try to come up with good segways. You come back to Chicago with that. That was great. It's big news. This is I want No, you said it's great. It's big. No, get the hell out of you. Go to our last story, the Wii News Channel, where we cover all the small news items that you need to know about just for [ __ ] that. You get one off cycle. All right. Great. Off cycle. I don't like this one, but I, you know, I'll live by it. Uh, this is Adam Matthew Inc. who says, \"Tim, I had a gun to my head from Greg. I don't I",
            "start": 3531.12
        },
        {
            "text": "You get one off cycle. All right. Great. Off cycle. I don't like this one, but I, you know, I'll live by it. Uh, this is Adam Matthew Inc. who says, \"Tim, I had a gun to my head from Greg. I don't I didn't know he was serious about the hate mail, so I guess you suck. He made me write it.\" Heart Adam Matthew Inc. PS fan art in route. Thank you. They brought a whole bunch of cool posters that I just said mail to us because I will break them in my thing. Uh we news number six on the road report. Uh Victoria Kennedy has a Eurogame article. It says cinemas have begun playing a short video ahead of a Minecraft movie screenings asking viewers to refrain from hurling their popcorn everywhere and to be kind and respectful to others. If you're wondering why this is necessary, it's because a viral trend has seen some younger viewers of a Minecraft movie going feral, screaming out loud midfilm while launching their popcorn into the air when Jack Black's character Steve shouts, \"Chicken jockey!\"",
            "start": 3573.12
        },
        {
            "text": "trend has seen some younger viewers of a Minecraft movie going feral, screaming out loud midfilm while launching their popcorn into the air when Jack Black's character Steve shouts, \"Chicken jockey!\" as Jason Mamoa's Garrett the garbage man Garrison gets ready to fight a baby zombie riding on the back of a chicken. Shout out to Victoria Kennedy who had the most fun riding that. Like, they added all every detail. While this trend perhaps started off as a bit fun, has quickly become increasingly disruptive uh with one absolute idiot even bringing a live chicken into the cinema. God, this must be an old article. It's gotten so much worse. Has it? Oh, the fireworks. Oh, man. Yeah, it's Don't do Don't do this. Don't be scared. First detail. This is why again we should just close movie theaters. Do it at your home. Who cares? Uh, first details for Star Wars Outlaws: A Pirates Fortune are coming on April 18th. And then Metro 2033 Redux is currently free on Steam. Cool. That's your Wii news.",
            "start": 3613.92
        },
        {
            "text": "Do it at your home. Who cares? Uh, first details for Star Wars Outlaws: A Pirates Fortune are coming on April 18th. And then Metro 2033 Redux is currently free on Steam. Cool. That's your Wii news. All right, let's clown out some super chats. We had a whole bunch in here. Uh, Bran Cakes says, \"Hey Tim, check out the game Dusk Fade. Think it might be your cup of tea. It's coming in 2026.\" Yeah, we uh watched the trailer for this Friday from the Triple Eye Initiative and Oh yeah, this looks like if Ratchet and Clank had sex with Kingdom Hearts, made a baby, that baby grew up. I hate that I got to play it. I hate the way you said that. You love playing babies. No, growing up. I played it when I was growing up. Okay, I missed that part. No, it's important. Uh Jessica Hinkle became a member for 17 months and says, \"Bummed I miss you in Chicago, Greg, but I'm wearing my farewell tour shirt.\" Thank you. The Tim Gettys farewell tour rules on everybody. Don't worry about it. Uh, Scarlet Libra",
            "start": 3656.8
        },
        {
            "text": "17 months and says, \"Bummed I miss you in Chicago, Greg, but I'm wearing my farewell tour shirt.\" Thank you. The Tim Gettys farewell tour rules on everybody. Don't worry about it. Uh, Scarlet Libra says, \"A little under the weather today, but thanks for brightening my day.\" Uh, I love the rematch stream VOD. Greggy How Chicago. It's great. And you can hear all about it in Gregway today and eventually watch it probably on our own thing. Sterling. Matthew Oliver says, \"Thanks for a fun show in Chicago. No problem. Sterling is the suitcase we we we put on stage.\" Awesome. Sterling needed to store his suitcase and so I made sure we did that for him. Chris Roas says, \"Tim, you got to give us a recap on the Prodigy concert you're going to. They stopped touring for a while after one of their vocalists died, and they just rarely play in the US to begin with.\" Yeah, I'm going to see the Prodigy tonight. Oh, me and G. Okay. I need you to pop off when they play Invaders Must. Of course. Of",
            "start": 3704.08
        },
        {
            "text": "vocalists died, and they just rarely play in the US to begin with.\" Yeah, I'm going to see the Prodigy tonight. Oh, me and G. Okay. I need you to pop off when they play Invaders Must. Of course. Of course. But no, I am incredibly excited. But this is definitely like the most out of my and definitely Gia's comfort zone contest. So, why are you going to it? I saw an Instagram ad for it and I'm like, \"This looks awesome as [ __ ] and I have to do this.\" And also like I love Prodigy's music. I just never thought, oh, I'm going to go to a concert of like the music they play during street races in Fast and Furious one. But then I'm also like, wouldn't I do that? You know what I mean? Fair. Fair enough. Yeah. So, I mean, they they just did Coachella this weekend. Every clip I saw, I'm like, \"Oh, I made a good decision buying tickets to this.\" Okay. So, I I'll keep you all updated. Zero SP says, \"Birthday tax. Love you guys and all the kind of funny best friends. Thanks for all that you do. I",
            "start": 3743.68
        },
        {
            "text": "I made a good decision buying tickets to this.\" Okay. So, I I'll keep you all updated. Zero SP says, \"Birthday tax. Love you guys and all the kind of funny best friends. Thanks for all that you do. I could use some sweet nasty love today. Happy birthday, Zero SP. I hope you have a fantastic time.\" Uh, Zack Brown then writes in and says as a member for 15 months, 15 months rock chalk, Gregy, Zack Brown, I hope you have a terrible uh, day. I hope you have an awful day while you're flint stoning your car around in Kansas. You don't have any electricity or combustion engines. Mr. Hawk 182 says, \"Your boy got a new job. Thanks to all the kind of funny best friends for keeping me in good spirits.\" Also, Tim, how about a meet and greet in Vegas this weekend? Oh, man. First off, congrats on the job. So proud of you. He's been updated and done all this stuff. So, it wasn't even that great last week. So, hell yeah. That's awesome. Me and Green Vegas probably not gonna happen. This uh Vegas trip",
            "start": 3781.92
        },
        {
            "text": "So proud of you. He's been updated and done all this stuff. So, it wasn't even that great last week. So, hell yeah. That's awesome. Me and Green Vegas probably not gonna happen. This uh Vegas trip is very It's It's pretty in and out. And I'm I'm with a friend group that I'm not normally with. So, it's like, you know, I don't think I'm going to have time to But if you see me, say something. Yeah. Day one, I'm wearing a dope as [ __ ] gold Wrestlemania 41 jacket. Uh remember the Vanessa Hudins? Oh, yeah. Hot girls. Love pro wrestling. Gia got that. I have a custom made hot boys with a Z love pro wrestling. I'm wearing that underneath the dope ass gold uh jacket. And day two, I'm going full John Cena. George, wristbands, hat. I can't I I can't wait for photos of this. I I've known Gia for 10 years. She's allowed me to do so many things. This is where she almost found it. Legitimately, she like walked into the room and I was full fully decked out in the outfit. She looked at me and she",
            "start": 3822.0
        },
        {
            "text": "10 years. She's allowed me to do so many things. This is where she almost found it. Legitimately, she like walked into the room and I was full fully decked out in the outfit. She looked at me and she was pissed. She was actually mad and she's like, \"No, no.\" And I'm like, \"It's just, dude, it's I I was like, I know. I'm embarrassed, too.\" She's like, \"No, no, no.\" Ah, god. No, no, no. Do it now. Finish your story. She was like, \"No, no, no.\" And she's like, \"I want to let you know I'm not [ __ ] you ever again.\" And I was like, \"That is so aggressive.\" And then, I'm not kidding. She literally starts going, \"Yeah.\" And I'm like, \"Get the [ __ ] away from what are we doing here?\" Yeah. She was joking to the point that she then almost started throwing up. Jesus Christ. That's on you, G. We're going to read this uh card for from a Hallmark. It says, \"Timothy the star holder.\" That's me. Remember the miracle. Take strength from the legacy. Rejoice and give thank for the goodness of stars",
            "start": 3865.92
        },
        {
            "text": "going to read this uh card for from a Hallmark. It says, \"Timothy the star holder.\" That's me. Remember the miracle. Take strength from the legacy. Rejoice and give thank for the goodness of stars in the bank. May you and your loved ones share a blessed losing of stars. Hear me and rejoice. You have had the great privilege of being dethroned by the great titan. You may think this is suffering. No. Dot dot dot. It is salvation. The universal scale tips towards balance because of your sacrifice. Smile. Dot dot dot. For even the loss, even in your loss, you have become the loser to Greg. And it's all caps. And it looks like a serial killer wrote it. I love that. Is that the speech that Squidward gives in Infinity War? Sounds very similar. Yeah. Yeah. Yeah. Of course. Uh, spicy jellyfish super chat. says, \"Fantastic news on the PAX PAX East storytime slot. Greg, are we getting a kind of funny meetup anywhere? Too many good breweries and food out in Boston.\" If you missed it, I'm the",
            "start": 3910.72
        },
        {
            "text": "super chat. says, \"Fantastic news on the PAX PAX East storytime slot. Greg, are we getting a kind of funny meetup anywhere? Too many good breweries and food out in Boston.\" If you missed it, I'm the keynote speaker for PAX East. So cool. Uh what has happened since then is I want you to know they had hit me up and like, \"Oh yeah, you want to do PAX East keynote?\" I announced this during my Chicago show. No big deal. Do you want to do the PAX East keynote? I was like, \"Hell yeah, that sounds great.\" Like, \"Yeah, you know, I we know you can talk for an hour by yourself, but if you want to, we found success with fireside chats and yada yada.\" I was like, \"Oh, that's interesting.\" because I really really one of my favorite interviews of all time is Roger interviewing me and I was like oh he has such a great perspective and he knew us and I was like who knows us who is I don't even know this who would people want to see interview Greg Miller so I'm happy to announce that when I kick off",
            "start": 3963.2
        },
        {
            "text": "has such a great perspective and he knew us and I was like who knows us who is I don't even know this who would people want to see interview Greg Miller so I'm happy to announce that when I kick off Paxis for story time the keynote I will be interviewed by the one and only Benar no [ __ ] Benar is going to sit down with me for a one-on-one where he interviews me so we're flipping the roles here that is so cool also shout out to Benar the coolest dude in the freaking world today entertainment weekly put out a piece about Expedition 33. Oh, nice. And it's like, you know, Charlie Cox, Andy Circus, Ben Star. Hell yeah. Yeah. It's going to be a really fun in Paxis. Uh for meet and greets, probably not. It's very similar to what you're talking about. This is an In-N-Out trip. I'm actually going to fly to Redacted, see a game the day before or the Yeah, the day before. Then fly to Boston late night, get in Wednesday, rehearsals Thursday, do my panel, and then hosting the Mafia panel after my",
            "start": 3997.68
        },
        {
            "text": "to fly to Redacted, see a game the day before or the Yeah, the day before. Then fly to Boston late night, get in Wednesday, rehearsals Thursday, do my panel, and then hosting the Mafia panel after my keynote, and then I'm going to fly home. Very cool. Uh Ashish uh writes in and says, \"Do you think uh Switch 2 might skip US until it all comes down uh if it ever does since they could get extremely expensive over here?\" We kind of talked about this the way back. I don't think you would skip just the US, but I could see you delaying everybody. Yes, because of the US and our stupidity. And then Will says, \"Uh, final super chat. Uh Tim, my family had an extended layover in San Francisco. They [ __ ] loved the wings at Fogghorn Tap Room. Thank you for the recommendation. Hell yeah. Great recommendation. Great recommendation, Tim. Yeah. Yeah. Yeah. Uh, we asked people watching live to go to kind of funny.com/you wrong and tell us what we screw up as we screw it up. Uh, NA says Tim suggested",
            "start": 4036.0
        },
        {
            "text": "Great recommendation, Tim. Yeah. Yeah. Yeah. Uh, we asked people watching live to go to kind of funny.com/you wrong and tell us what we screw up as we screw it up. Uh, NA says Tim suggested there was some miscommunication from Bungie regarding Marathon's price, but the confusion surrounding Marathon being a full price game in quotes was not on Bungie. It was on GameSpot's preview mislabeled it. That's what I was saying. I wasn't putting it on them. I'm saying like when you don't come out with the answers, other people are going to say things and you lose the narrative. Exactly. They lost the narrative. 100%. Um, kebab says Joey Stars in the Bank message said Tim is losing all his stars. Stars in the Bank only allows Greg to take three and Tim has more than that. That's how math works. Which doesn't allow you to take three. No, that's true. And then Sloppy Topy says it's uh Mac Elhenny. Melhenny. Melhenny. Melhenny. There you go everybody. That's another episode of Kind of Funny Games",
            "start": 4078.48
        },
        {
            "text": "doesn't allow you to take three. No, that's true. And then Sloppy Topy says it's uh Mac Elhenny. Melhenny. Melhenny. Melhenny. There you go everybody. That's another episode of Kind of Funny Games Daily in the bank. But remember, we're a small business all about live talk shows. That means from here we're rolling into the kind of funny games cast where the one, the only, the best voice in the business, Paris Lily, is joining Blessing, Andy, and Mike Wright to talk about Marathon. He played it, what he thought about it, what those boys think about it, what they think this extraction shooter needs. Uh, after that, we'll be doing our screencast review of the premiere of The Last of Us season 2, and then streaming video games thanks to Nvidia. Uh, if you are watching later or listening later, remember you can get all of that on youtube.com/kindfunname.s. You could watch this recorded live on YouTube and of course twitch.tv/kindfunny games. You can get most of it as a podcast series. You",
            "start": 4117.6
        },
        {
            "text": "remember you can get all of that on youtube.com/kindfunname.s. You could watch this recorded live on YouTube and of course twitch.tv/kindfunny games. You can get most of it as a podcast series. You could get over to patreon.com/kindfunny. YouTube.com/kind kind of funny games. Apple and Spotify to pick up the kind of funny membership and get all 80 of our episodes each and every month ad free and get a daily dose of me, Greg Miller, in a series I call Greg Way. Today's is 19 minutes long. I uploaded it during the ad break. So come on now. Come hang out. Uh until next time. Hold on. We got one more here. I know I'm off cycle. I'm not using I'm breaking my own rules, you know, but there's just so much minutes late to the games cast. Like second best baby blues in San Francisco. More like first poopiest butt fart land. Also, I bet your hair doesn't even smell that good. Eat [ __ ] The king is dingus. Roger, my man. Dingus. Until next time, everybody. It's been our pleasure to serve you.",
            "start": 4158.88
        },
        {
            "text": "poopiest butt fart land. Also, I bet your hair doesn't even smell that good. Eat [ __ ] The king is dingus. Roger, my man. Dingus. Until next time, everybody. It's been our pleasure to serve you. [Music]",
            "start": 4199.36
        }
    ]
}