{
    "id": 13845,
    "video_id": "XakliEXDISw",
    "show_name": "Highlights",
    "hosts": [
        "Greg Miller",
        "Andy Cortez",
        "Mike Howard",
        "Kat Bailey"
    ],
    "title": "Duskbloods Switch 2: FromSoftware Expert Reacts",
    "description": "From Gamescast: https://www.youtube.com/live/jKmiXNXowQM?si=icI_NJ9JmAhcC6F4\nWishlist Lost Skies today: https://kindafunny.com/lostskies\nWishlist Monaco 2 today:\nhttp://kindafunny.com/monaco2\nGo to http://rocketmoney.com/kindafunny to cancel your unwanted subscriptions with Rocket Money.\n\nFOLLOW US ON EVERYWHERE!\n---------------------------------------------------  \nYouTube: Youtube.com/KindaFunnyGames\nTwitch: https://www.twitch.tv/kindafunnygames\nPatreon: https://www.patreon.com/kindafunny/\nTwitter: https://twitter.com/KindaFunnyVids\nInstagram: https://www.instagram.com/kindafunnyvids/\nTikTok:  https://www.tiktok.com/@kindafunnygames?lang=en",
    "published_at": 1743618639,
    "duration": 701,
    "transcript_chunks": [
        {
            "text": "The final one, not really, but their last partner title, the Dusk Bloods. Andy, take it away. Well, there's been a lot of I don't know if we have any press releases. I'm I was hoping you would just talk about what you thought so I could look for the press release. Still completely shocking. I didn't recognize the art style and just kind of the way their characters are rendered. And there was also a stunning lack of ah. So that's why I was like, this isn't a From Software game. We need somebody to say ah and then laugh at the end of their statement. But I'm still completely blown away. I thought it was going to be a Castlevania sort of remake. Weird sort of a a cool holy [ __ ] what an awesome joining of worlds. But yeah, a brand new IP, a brand new video game, not a sequel, just a new thing for exclusively on the Switch 2. Really quick, when you have a shot like this, it's like this is Castlevania game, right? Yeah. Yeah. We read from The Verge where Antonio writes, \"From Software is",
            "start": 0.08
        },
        {
            "text": "for exclusively on the Switch 2. Really quick, when you have a shot like this, it's like this is Castlevania game, right? Yeah. Yeah. We read from The Verge where Antonio writes, \"From Software is making a multiplayer Switch 2 exclusive called The Dusk Bloods. It's directed, of course, by Miyazaki. Uh, The Dust Bloods, a new game from From Software, is coming exclusively to Nintendo Switch 2. The teaser trailer debuted.\" Wait. Oh, see. Damn it. I thought I thought they had the press release. There's a press release over there. Somebody's calling out Melissa with a Y. Yeah. Many people are still uh there's a lot of people saying that it is a multiplayer PVE PVP game. So, like Elder Ring Night Rain. Well, no, that's not PvP. Yeah. Yeah. PVP. Uh yeah, that's PvE. So, this is P PVP PVE. So, it's like coliseum like we tal like I talked about with Nightmare. What's the elevations and different game plays? Here we go. Thanks to Melissa with a Y. I got your information here. Right. Thank you,",
            "start": 42.4
        },
        {
            "text": "like coliseum like we tal like I talked about with Nightmare. What's the elevations and different game plays? Here we go. Thanks to Melissa with a Y. I got your information here. Right. Thank you, Melissa with a Y. 2026. Uh developed for the upcoming Switch 2, The Dusk Bloods is a PVPVE title with online multiplayer at its core, where up to eight players v for supremacy among themselves and against challenging foes. Play as the blood sworn, a group that has transcended human strength thanks to their special blood and throw yourself into a violent fray for first blood as the twilight of humanity approaches. Currently 2026. Hope you look forward to it. Makes me way less excited. I don't want I don't want a PvP thing in my From Software game. Like obviously From Software have have always had duels and things like that, but I don't want that to be like a part of the core game. I want to experience a new universe with awesome new lore and storytelling and um not not what I want, but I'm",
            "start": 87.2
        },
        {
            "text": "duels and things like that, but I don't want that to be like a part of the core game. I want to experience a new universe with awesome new lore and storytelling and um not not what I want, but I'm still stoked to get What do you think? What do you think the chances are you eat those words that you get into this and you're like, \"Holy [ __ ] we did kind of eat them on Night.\" Um, I guess PvE has always been different for me because I've played multiplayer from software games and for me it was more of the the the worry factor for me for Night Rain was more of like ah you this feels like a a a bastardization of something that's so special to me and you're just kind of going for rogue light blah blah blah and it still obviously worked cuz we've played multiplayer Elder Ring plenty. We played seamless co-op plenty and it's always a blast to play Elder Ring and Souls games with friends. Um, adding the PvP nature of it I feel like just adds, you know, it depends on how it's implemented.",
            "start": 133.28
        },
        {
            "text": "seamless co-op plenty and it's always a blast to play Elder Ring and Souls games with friends. Um, adding the PvP nature of it I feel like just adds, you know, it depends on how it's implemented. Obviously, I think if you're constantly running around and you're seeing other people doing their thing, running around, I just don't know if I want that out of my out of my From Software experience. This episode's brought to you by Lost Skies. What would you do if you woke up and the world around you was now floating high in the clouds? Lost Skies is the new openw world survival like that puts the power of exploration and choice in your hands. Use the physics-based grappling hook, glider, and your own custom airship to traverse the remains of this fractured world and uncover its mysteries. You and up to five friends will harness the power of ancient technology to survive the hostile islands that scatter the horizon and the threats that lurk in the sky itself. The battles are intense, so it's",
            "start": 177.68
        },
        {
            "text": "up to five friends will harness the power of ancient technology to survive the hostile islands that scatter the horizon and the threats that lurk in the sky itself. The battles are intense, so it's up to you to build a sky ship to shelter you in fierce storms and take the battle to gigantic monsters. Want to take a break from fighting in the skies? Use the intuitive island creator and share your builds with the community. Head over to Steam and Wishlist Lost Skies today and discover what's lurking beyond the horizon. This episode's brought to you by Monaco 2. Gather your crew, plan your heist, and let the chaos unfold in Monaco 2. Return to Monaco, a city teameming with excellent scores and gullible marks right for getting parted from their prized possessions. Go it alone or tackle heist as a team of four with online and local co-op. Just remember, even the best laid plans can blow up in your face, so you'll have to stay on your toes. Monaco 2 is the sequel to the cult classic Monaco.",
            "start": 224.24
        },
        {
            "text": "a team of four with online and local co-op. Just remember, even the best laid plans can blow up in your face, so you'll have to stay on your toes. Monaco 2 is the sequel to the cult classic Monaco. What's yours is mine that expands on every aspect of the game. New characters bring unique abilities and play styles to help you escape the heat. And with new modes and procedurally generated levels, every run is full of surprises. The heist is on when Monaco 2 arrives on Steam, Xbox, and PlayStation on April 10th. Y'all know how important it is to wishlist these games. It helps the developers so much. So, please wishlist Lost Skies and Monaco 2. This episode is brought to you by Rocket Money. You sign up for something, forget about it after the trial period ends, and then you're charged month after month after month. The subscriptions are there, but you're not using them. In fact, 85% of people have at least one paid subscription going unused each month. Thanks to Rocket Money, you can see",
            "start": 268.16
        },
        {
            "text": "month after month. The subscriptions are there, but you're not using them. In fact, 85% of people have at least one paid subscription going unused each month. Thanks to Rocket Money, you can see all of your subscriptions in one place and cancel the ones you're not using anymore and save more money. Rocket Money has helped multiple members of Kind of Funny learn that they're still paying for things they totally didn't even realize. You know who I'm talking about. Rocket Money is a personal finance app that helps find and cancel your unwanted subscriptions, monitors your spending, and helps lower your bills so you can grow your savings. Rocket Money has over 5 million users and has saved a total of 500 million in canceled subscriptions, saving members up to $740 a year when using all the apps premium features. Cancel your unwanted subscriptions and reach your financial goals faster with RocketMoney. Go to rocketmoney.com/kindfunnday. That's rocketmoney.comkindfunn. I agree with the",
            "start": 317.04
        },
        {
            "text": "apps premium features. Cancel your unwanted subscriptions and reach your financial goals faster with RocketMoney. Go to rocketmoney.com/kindfunnday. That's rocketmoney.comkindfunn. I agree with the chat. Let me asaki cook. I I think that the online multiplayer space badly needs innovation. And I really appreciate that from software amazing, incredible single player with a actually pretty decent online pedigree is going and really trying to innovate in that space. First with Night Rain and now with this. And what it sounds like is that you have kind of an interesting world or arena that you're playing with other players. Maybe almost a battle royale situation filled with the classical from software level design enemies bosses question mark and that has to be right. Oh yeah, we definitely saw a gigantic wolf looking. Yeah. Yeah. It sounds like a really interesting mixture of elements and I don't know how confused it's going to be, but I mean from it's from software. I'm with you, Cat. I",
            "start": 362.64
        },
        {
            "text": "a gigantic wolf looking. Yeah. Yeah. It sounds like a really interesting mixture of elements and I don't know how confused it's going to be, but I mean from it's from software. I'm with you, Cat. I like when [ __ ] Andy. I like them. I want them to try different things, right? I think we know the bread and butter. We know they're going to go back to the single player games all the time. we're going to get those epic experiences, but to see them try something different and really try to innovate in the space that you and I, Andy, we want them to be better at, which is the online multiplayer connectivity and make that a little bit smoother. I love that like right now we are seeing them throw some things at the wall and say, \"Hey, how do we at least try?\" And so I love that Night Rain is that, \"Hey, PVE, we got squad of three. We're going to go out and have some fun.\" I'm interested in this of like is it eight solo combatants running around a giant arena and there's that fun push and",
            "start": 417.36
        },
        {
            "text": "that, \"Hey, PVE, we got squad of three. We're going to go out and have some fun.\" I'm interested in this of like is it eight solo combatants running around a giant arena and there's that fun push and pull that you always get in a Dark Souls game of somebody invades you and it's the tiptoe of who's going to who's going to strike first, who's going to step forward at me. I love the idea of maybe me creeping up behind someone, maybe looking across the battlefield at one or two other people and seeing how we're going to engage with each other. You talk about it, cat. Like Miyazaki and his team at From Software have really made an incredible combat system that is fun and difficult to master and it's so engaging moment to moment that I would love to be able to battle others. I I liked uh Dark Souls with their online arena combats and the idea of taking that to another level is cool for me. I whenever this would all be amazing to me if it wasn't the year 2025 because when I think of mult the",
            "start": 460.32
        },
        {
            "text": "with their online arena combats and the idea of taking that to another level is cool for me. I whenever this would all be amazing to me if it wasn't the year 2025 because when I think of mult the way multiplayer games work nowadays 3 days in there's like there's an established meta what's the meta what's the and that's like that's the thing that ruins the experience for me um and I think you have to take this game more seriously because they say it is led by Miyazaki this is the [ __ ] dude who could be working on whatever he wants right now and he's working on this game and And that adds a lot of pedigree and that adds a lot of excitement. But then on the flip side of it, the reason why I was a lot cooler with Night Rain is because I'm like, well, Miyazaki is not working on this. Miyazaki we know is cooking the next big thing. And it's very likely he likely is still making the next big thing over there. That is going to be their cross-platform gigantic uh experience. I just hope this",
            "start": 503.68
        },
        {
            "text": "we know is cooking the next big thing. And it's very likely he likely is still making the next big thing over there. That is going to be their cross-platform gigantic uh experience. I just hope this isn't the only thing he's working on. I just got to show some respect from software. a studio that is not going to rest on established franchises. It has a sty has a house style. It knows who it is. That's good. But it's innovating. It's trying new things. It's going out and making interesting experiences. And frankly, I'm here for it because too many studios are playing it really safe because they feel like they have to. From software is consistently playing with house money. So yeah, I'm in. Yeah, I want to see what this is. If anything, I'm with Mike where it's like this may not be the exact thing I want. I'm just excited that they are stepping out of their our multiplayer systems have always sucked. Yeah. Night Rain kind of being Well, Elder Ring making things easier and even then it's",
            "start": 551.84
        },
        {
            "text": "thing I want. I'm just excited that they are stepping out of their our multiplayer systems have always sucked. Yeah. Night Rain kind of being Well, Elder Ring making things easier and even then it's not easy to do. It's perfect. You have to go farm a little [ __ ] flower to summon a friend in like it's always sucked. And then when they talked about when they're asked, \"Hey, have you seen this the seamless PC mod?\" And they're like, \"Yeah, it's kind of neat. We're, you know, we would love to bring experiences like that in the future.\" Yeah. Night Rain gets debuted. And we're like, \"Holy shit.\" Whoa. They were serious. They had always been working on something to not make multiplayer a pain in the ass to join up with friends. And this being another option. Like if anything, this isn't exactly what I want from the next big From Software Miyazaki project, but it shows me that they're taking multiplayer serious, which makes me very excited that I don't have to go farm a goddamn jewel in a",
            "start": 596.48
        },
        {
            "text": "what I want from the next big From Software Miyazaki project, but it shows me that they're taking multiplayer serious, which makes me very excited that I don't have to go farm a goddamn jewel in a cave, you know? And I'm sure we'll talk more about it because we're kind of funny. We really love Souls games, so I'm sure we'll go deeper, but like the guns turning into a T-Rex, like these are things we're not really seeing often in the Soulsorn genre that we see in these games. So, I like this. It reminded me of making the dragon out of your hand when you're doing like dragon spells. You think it'll be like a battle royale where sometimes you're fighting each other, but then sometimes you find yourself in a situation where you're fighting an enemy together and maybe you can get some rewards for doing so. Oh, absolutely. Team Dark Zone. Yeah. I mean, yeah, it reminds me a lot of a lot of other PvP ve games where it's like, hey, I know you want to kill me right now, but there's this big",
            "start": 638.24
        },
        {
            "text": "for doing so. Oh, absolutely. Team Dark Zone. Yeah. I mean, yeah, it reminds me a lot of a lot of other PvP ve games where it's like, hey, I know you want to kill me right now, but there's this big thing that we could take on. Mhm. You know, we'll see how that stab me in the back. Yeah. A lot of my tactical crouching like please be on my team. Help me out.",
            "start": 677.68
        }
    ]
}