{
    "id": 13971,
    "video_id": "xbH8g-6AS5c",
    "show_name": "Highlights",
    "hosts": [
        "Greg Miller",
        "Andy Cortez"
    ],
    "title": "What We Want From Ghost of Yotei",
    "description": "From Gamescast: https://youtu.be/a5ogeVt3oR4?list=PLy3mMHt2i7RIn1aLupj0mSiSAETxwHDwm\n\nWishlist Now!\nEmpyreal Steam Page - https://nwzo.io/click/dzexr/\nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299\nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\nGo to http://auraframes.com and use code KINDAFUNNY to get $35-off plus free shipping on their best-selling Carver Mat frame.\n\nFOLLOW US ON EVERYWHERE!\n---------------------------------------------------  \nYouTube: Youtube.com/KindaFunnyGames\nTwitch: https://www.twitch.tv/kindafunnygames\nPatreon: https://www.patreon.com/kindafunny/\nTwitter: https://twitter.com/KindaFunnyVids\nInstagram: https://www.instagram.com/kindafunnyvids/\nTikTok:  https://www.tiktok.com/@kindafunnygames?lang=en",
    "published_at": 1745622063,
    "duration": 1049,
    "transcript_chunks": [
        {
            "text": "Sneak says, \"Rise of Ronin was a damn good time as well.\" I'm right there with you. If you remember that review conversation when we were all just a few hours into or whatever, I had a great time with Ronin because it was an Assassin's Creed style samurai playground where I'm running. I'm jumping off throw my thing. Come down. I'm assassinating people. But it was I'm clearing the map and I'm getting more powerful and I don't know what the story isn't. They're not trying to make a samurai movie with Rise of the Ronin. I was the one who like [ __ ] talked it the most because about 3 hours in I I said on kind of like that preview or whatever it was whether it was review or not you know this it just it's lacking sauce. Yeah. Yeah. And with Rise of the Ronin if I were to put like letter grades on [ __ ] their combat is a tier that I mean that's Coway Techmo that is it that combat is phenomenal right? It's what you expect with Neo with what I enjoyed about Wolong Fallen Dynasty, which is a",
            "start": 0.08
        },
        {
            "text": "on [ __ ] their combat is a tier that I mean that's Coway Techmo that is it that combat is phenomenal right? It's what you expect with Neo with what I enjoyed about Wolong Fallen Dynasty, which is a game that I at the time we had our rating system was different. So, I gave it a three out of five and we all did because we were like, \"Yeah, the combat rocks. It's just not much else is good in this when it comes to voice acting or uh cut scenes or cinematics or story.\" But like for me, Rise of the Ronin and Ghosts of Sushima, I'm looking at like a like [ __ ] S tier combat for Rise of the Ronin and A tier for Ghost of Sushima. Now, everything else in Ghost of Sushima is A as well for me. And Rise of the Ronin drops down to like the D's and the B's when it comes to story and characterization and compelling interactions, making me give a damn about what's happening in the world. And I just think back to my time with when I first tried out Ghost Sushima 1 and was like, \"This isn't hitting",
            "start": 42.32
        },
        {
            "text": "and compelling interactions, making me give a damn about what's happening in the world. And I just think back to my time with when I first tried out Ghost Sushima 1 and was like, \"This isn't hitting right now.\" Decided to go back to it a year later and completely fell in love with the experience. And a lot of it has to do with these characters that I grew to love. That game has some of the most [ __ ] gut-wrenching, heartbreaking side quests that really, really hit you in the fields. And a lot of that has to do with how gripping the dialogue is and these characters that you grow to care about man. These awesome twists and turns and backstabbings of charact like god damn dude it was just it overtook the last of us part two for go of the uh for that year for me and you know for anybody who says the combat gets repetitive it's my flavor of combat. So, it never became competitive or repetitive for me because I sought out every other battle cuz I was having that much fun with it. And",
            "start": 91.72
        },
        {
            "text": "who says the combat gets repetitive it's my flavor of combat. So, it never became competitive or repetitive for me because I sought out every other battle cuz I was having that much fun with it. And that's one of the things for me to take the baton for me for a second is the idea that I'm not the combat guy. I'm not the Perry Poppy guy or and I mean I like combat, but I don't like the challenge or this or whatever. I thought the combat was so good in Sushima that I also was seeking out challenge and I was also seeking out these people. And was it repetitive? I don't think so because for me it was always about getting better and finding the parry window and doing the thing and like what is the mechanic I'm going to use here to fight this and then you know those one-on-one samurai duels you'd have and stuff like I thought it was so incredibly special on that front. Yeah, it brought it brought the fun gameplay mixed in with a lot of other amazing, you know, what what brings the sauce,",
            "start": 144.2
        },
        {
            "text": "have and stuff like I thought it was so incredibly special on that front. Yeah, it brought it brought the fun gameplay mixed in with a lot of other amazing, you know, what what brings the sauce, the little those cinematic moments, the moment where you know, you get backstabbed by one of your by one of the homies and then it's the duel with the wide shot and the down like cinematography and everything just adds so much to help supplement how fun the combat can be. And so when Ghost 2 gets revealed that one time, obviously super pumped for it, want to see what the next adventure is. And after watching that, it's like, god damn, dude. This year is so [ __ ] stacked. Yeah. Yeah. I want to talk about that. Uh from if you didn't watch it or you want more, we're going to read from the one, the only Andrew Golar at the PlayStation blog, who wrote this two paragraph synopsis of what's going on there. 16 years ago in the heart of Izu uh called Hakeo in present day, a gang of outlaws known as",
            "start": 182.32
        },
        {
            "text": "only Andrew Golar at the PlayStation blog, who wrote this two paragraph synopsis of what's going on there. 16 years ago in the heart of Izu uh called Hakeo in present day, a gang of outlaws known as the Yote 6 took everything from Atsu. They killed her family and left her for dead pinned to a burning a gog ginko ginko tree outside her home. But Atu survived. She learned to fight, to kill, and to hunt. And after years away, she has returned to her home with a list of six names. the snake, the oni, the kitsu or kit kitsune. Kitsune. Uh the spider, the dragon, and Lord Sat. One by one, she's hunting them down to avenge her family. You mix it up right there. Yay. Is ei ai is sai. So it's or i. So it's Thank you very much. There you go. Okay, I like that. Uh one by one, she's hunting them down to a venture family armed with the same katana used to pin her to that burning tree all those years ago. That's so cool. So [ __ ] cool. It reminds me of when we first saw the glimpses of Robert",
            "start": 231.44
        },
        {
            "text": "down to a venture family armed with the same katana used to pin her to that burning tree all those years ago. That's so cool. So [ __ ] cool. It reminds me of when we first saw the glimpses of Robert Pat's Batman and we were like, \"Oh, that's a pistol. Probably killer.\" It wasn't, but it's still cool. Could be. They just never talked about it. Maybe. Uh, but while Atu's story begins with vengeance, she'll find there's more to her journey than just revenge. As she explores EO, Atsu will meet unlikely allies and forge connections that help give her a new sense of purpose. Over in the super chat, so many of you wanting to be part of the show. I appreciate that. Please come on with that. Uh, but Norman writes in and says, \"The story looks heavily inspired by '7s samurai movie Lady Snow Blood and that rules. In the same way I beat Ghost of Sushima or was playing it and got obsessed and started buying I hit up sucker bunch of people and I was like, \"What are inspirations?\" And I started",
            "start": 286.48
        },
        {
            "text": "and that rules. In the same way I beat Ghost of Sushima or was playing it and got obsessed and started buying I hit up sucker bunch of people and I was like, \"What are inspirations?\" And I started getting like comics and mangas and stuff, I would definitely want to watch Lady Snow Blood right now cuz that sounds [ __ ] rad, too. Um, where do you want to go from here, Andy? Because I want to talk about the release date. I want to talk about the competition this year. I want to talk about what we saw. I want to talk about I want to talk about hopes and dreams. What do you want to jump into? I I think um cuz I was really I was really stoked for whatever the concept and presentation was for Assassin's Creed Shadows and obviously this extremely similar coincidental thing of you go after the six people whatever that we go after the eight people whatever it may be. Um, and there's just something that I love that that's so easy to latch on to as somebody who enjoys media like this. It's such",
            "start": 326.0
        },
        {
            "text": "people whatever that we go after the eight people whatever it may be. Um, and there's just something that I love that that's so easy to latch on to as somebody who enjoys media like this. It's such an easily consumable thing. These six dudes, it reminds me of all the Metal Gear games, going after the Beauty and the Beast, going after freaking um uh the end. Are you talking about like I'm just talking about like the groups of the bosses like you know Fox Fox. Yeah. All that. Um, it's such a cool, easy, marketable way totally to have these characters with the, you know, the kitsune, the the the little fox mask and all that stuff. I just love the idea of it. This concept is just so it's such an easy win for me to hop in there and go, \"All right, this is what we're doing. I'm in already.\" Um, what I would love to see from it, however, um, because there are some aspects of Ghost of Sushima that I think of like what can we sort of, you know, improve here? What can we implement? Um, and I",
            "start": 367.04
        },
        {
            "text": "what I would love to see from it, however, um, because there are some aspects of Ghost of Sushima that I think of like what can we sort of, you know, improve here? What can we implement? Um, and I think we all go, you know, either raid WB and take the [ __ ] nemesis system. Take the nemesis system. Uh, because that's just like, can you even imagine how something like that would be implemented here? Are there any ways for Sucker Punch to kind of skirt those little IP law lines and maybe kind of implement anything like that? Because I, as much as I love this living, breathing world that feels so like it feels so immersive and so alive, I still feel like I got quickly tired of those emergent gameplay moments when homie is by his cart and is like, \"Help me out.\" And then he's really just there to try to kill you or whatever. How can we improve on those open world moments that kind of make you feel like I'm experiencing this and maybe nobody else has because this feels so singular? Andy,",
            "start": 417.44
        },
        {
            "text": "to try to kill you or whatever. How can we improve on those open world moments that kind of make you feel like I'm experiencing this and maybe nobody else has because this feels so singular? Andy, hear me out. They make their own proprietary like uh Nemesis systemm and then to skirt the line, they'll call it the the the meanie apparatus. Oh, okay. I love it. I love it. This episode's brought to you by Imperial. We've told you all how important it is to developers to wish list games you're interested in on Steam. So, if this game sounds cool to you, make sure that you wishlist it. In Imperial, you play as a mercenary sent to a distant planet to discover the mysteries of an ancient civilization. Powers unknown lie within the monolith, but those are no mere ruins as an expedition has already ventured inside with only a few survivors. Why was it built? What powers reside within? Who is at the center of the monolith? All these secrets and more will be uncovered if you are brave enough to",
            "start": 474.8
        },
        {
            "text": "ventured inside with only a few survivors. Why was it built? What powers reside within? Who is at the center of the monolith? All these secrets and more will be uncovered if you are brave enough to take on Imperial. Imperial features a unique blend of RPG systems and skill-based combat across three weapon archetypes. The acrobatic glaive, the defensive but devastating mace and shields and the powerfully ranged cannon. With a deep ability system, extensive customization, every battle is an opportunity to refine and optimize your combat style. form relationships with each of the few surviving expedition members who all have their own personal quest lines. Whether you choose to help or not can have drastic consequences for them. The monolith is guarded by powerful automatons, each with distinct attack patterns and weaknesses that demand precise execution and strategy to be victorious. Create your mercenary, enter the monolith, learn powerful abilities, defeat the automatons, and uncover",
            "start": 519.92
        },
        {
            "text": "attack patterns and weaknesses that demand precise execution and strategy to be victorious. Create your mercenary, enter the monolith, learn powerful abilities, defeat the automatons, and uncover the secrets that lie within Imperial. Imperial is available May 8th on PC, Xbox SNX, and PS5, but you can wishlist now. Do it. Wishlist Imperial. This episode's brought to you by Araf Frames. If you haven't called your mom in a while, here is your reminder to do it. But then, if you want to go above and beyond, Mother's Day is coming up and I have the perfect gift idea. Aframes are incredibly smart and easy to use, allowing you to upload unlimited photos and videos directly from your phone to the frame. Plus, you can order the frame online and preload it with photos and videos using the Aura app, so it's ready to go right out of the box. It's a gift so special, they'll use it every day. Trust me, Gia's dad does, Greg and Kevin, and a ton of people here at Kind of Funny are obsessed with their",
            "start": 568.4
        },
        {
            "text": "so it's ready to go right out of the box. It's a gift so special, they'll use it every day. Trust me, Gia's dad does, Greg and Kevin, and a ton of people here at Kind of Funny are obsessed with their Aura frames. It takes about 2 minutes to set up a frame using the Aura app. And I know that from experience. Aura has a great deal for Mother's Day. For a limited time, listeners can save on the perfect gift by visiting aframes.com to get $35 off plus free shipping on their bestselling Carver Matte Frame. That's a rframes.com. Promo code kind of funny. Support this show by mentioning us at checkout. Terms and conditions apply. Yeah, top of my list in terms of things I I would want to see strengthened cuz I think Ghost is so great. Ghost of Sushima. Uh, but it would be the idea of someone who platinum it and loved chasing all of that side quests, right? Making those less repetitive cuz it was okay cool. It's fun to go to the bath. It's fun to write the haiku. It's fun to follow the fox,",
            "start": 614.24
        },
        {
            "text": "platinum it and loved chasing all of that side quests, right? Making those less repetitive cuz it was okay cool. It's fun to go to the bath. It's fun to write the haiku. It's fun to follow the fox, but like your fifth time and maybe that it's not even the right number, but it was as you got deeper and deeper into it. That's where it started to wear me down. There's hope for that already, though. Of course, over at WCCF Tech, this is a September 2024 article. Uh, Allesio says, uh, Ghost of Yot will feature a less repetitive open world. Yot, I [ __ ] it up again. Uh, thankfully, developer Sucker Punch shared a few tidbits, uh, about this sequel in an interview published the New York Times. Creative director Jason Connell said, \"One of the changes uh, compared to Ghost of Sushima will be a less repetitive open world.\" Quote, \"One challenge that comes with making an open world game is the repetitive nature of doing the same thing over and over again. Uh, we wanted to balance that, balance",
            "start": 661.52
        },
        {
            "text": "repetitive open world.\" Quote, \"One challenge that comes with making an open world game is the repetitive nature of doing the same thing over and over again. Uh, we wanted to balance that, balance against that and find unique experiences. So, I like the idea that again, Sucker Punch, which in the grand scheme of studios is a small studio in terms of PlayStation first parties, uh, has enough time to sit there and really go, okay, we have, it's been 5 years, which both sounds so short, but also so long since Ghost of Tsushima. The fact they've noodled it and come up with this in this story and whatever they're about to do with this world is exciting. When you see that there, see her go to be the little girl there, that's that's such a deliberate choice. And I wonder we saw that with Jyn obviously where we would have flashbacks to it. But do you think is there a chance that's a game mechanic? Cuz the way they did it right there. I know they're they're like doing the water droplets. I",
            "start": 701.68
        },
        {
            "text": "obviously where we would have flashbacks to it. But do you think is there a chance that's a game mechanic? Cuz the way they did it right there. I know they're they're like doing the water droplets. I just think it's an interesting thing to call out there at the end here is like your stinger going into it. I wonder if that's actually going to be a mechanic or if that's just we're getting the flashback as always. you're 100% dead on there is I I feel it it's such a deliberate choice to have that be the stinger because at any moment a game can show a flashback that doesn't that's not going to blow anybody away but if you're showing it off in that way to where it looks like a mechanic and it very well may not be but that feels like such a choice to have that there in the chat caboose is saying it's a game mechanic they confirmed on the PlayStation blog which blog post did they confirm that on let me know cuz I don't even know what to Google change perspective [Music] Now when you switch",
            "start": 743.28
        },
        {
            "text": "it's a game mechanic they confirmed on the PlayStation blog which blog post did they confirm that on let me know cuz I don't even know what to Google change perspective [Music] Now when you switch was like of course if Sucker Punch is still watching and they want to just text me if that's does that one tree that was you know burned down has it grown back now like how I mean we're not talking like the medium right like dual world type things how deep can that even go because you mentioning that them being well aware about how their open world can become repetitive and how that can be a a a little point of, you know, all right, we got to improve this in the future. It it's just kind of, oh, that's a lesson learned. They know that. They are aware of it. Great. That's something they want to address. Oh, here it is. Yeah. Okay. Well, first off, I asked that the chat said it was in the most recent post. Another [ __ ] person from Sucker Punch, who will remain nameless, says it's in the blog",
            "start": 782.64
        },
        {
            "text": "Oh, here it is. Yeah. Okay. Well, first off, I asked that the chat said it was in the most recent post. Another [ __ ] person from Sucker Punch, who will remain nameless, says it's in the blog you were literally just reading for [ __ ] sake. Like, calm down. It's a [ __ ] live show. Jesus, you were reading it. But I didn't read that part cuz again then it g then go far starts doing is we hope you enjoy this brief [ __ ] off. I'm gone. I'm not I'm no longer listening. The comment if you're an audio listener does though. Uh I'll just read the whole thing. We hope the brief looks uh in today's trailer give you a taste for what you can expect from Ghost of Yote. Uh beyond our first look at the Yotay 6, you'll spot some of the gorgeous scenery of Izo, as well as a handful of Atsu's new weapons, a few of her allies, and even a new gameplay mechanic that will allow you to glimpse Atsu's past and understand everything that was taken from her. I would imagine it's Atsu, not a you know, I mean,",
            "start": 831.04
        },
        {
            "text": "a few of her allies, and even a new gameplay mechanic that will allow you to glimpse Atsu's past and understand everything that was taken from her. I would imagine it's Atsu, not a you know, I mean, I don't know, but obviously I'm saying it one way cuz I don't know. Yeah. So, you're saying ah, I'm saying, you're saying au was I was saying at au. I also think it might be ezo. I don't know cuz I think of the Edo period. Yeah, that makes sense. Yeah, that one I'm less sure about, but I feel like you're probably either reminds you of Element Zero Mass Effect. So, did you read about the mechanic or Yeah, I did there. Yeah, glimpse uh Atsu. Did I say it right there? Yeah, you nailed it past and understand. So, I mean, how how often are we even given the opportunity to do that? Is it Yeah, I know, right? Is it Yeah. This I know I'm calling out a game that's better than Resident Evil, but the medium like you know when we saw that in trailers and stuff we were like, \"Oh, cool. You're back and",
            "start": 869.44
        },
        {
            "text": "right? Is it Yeah. This I know I'm calling out a game that's better than Resident Evil, but the medium like you know when we saw that in trailers and stuff we were like, \"Oh, cool. You're back and forth, but it was very specific spots.\" So, yeah. Is this just going to be specific spots? I don't think we needed that at the front end. Everybody needs to know I know what I'm doing here. I'm calling out a game that's better than Resident Better than Resident Evil Village. I'm just saying, you know what I mean? Just putting out there. Um, yeah. You wonder if that is a momentary thing or if just after certain chapter points you have the opportunity to do that. Yeah. Either way it would be cool. But then it's not like a revolutionary gameplay mechanic. Yeah. But yeah, cuz I I think when I think of Ghost of Sushima and Jin story, I do think about hopping back and forth quite a bit. But that was never a voluntary thing. You know, you were they were shoving you in the past to I hate being",
            "start": 920.4
        },
        {
            "text": "of Ghost of Sushima and Jin story, I do think about hopping back and forth quite a bit. But that was never a voluntary thing. You know, you were they were shoving you in the past to I hate being shoved in the past. Yeah. And so I don't know. I I wonder how often that's something that can even be utilized. If you're even, you know, if you're even calling it out, not only as the singer, but then you're saying, \"Hey, you also probably noticed this thing.\" It seems like it's going to be maybe a lot more prevalent than than maybe even we think. I doubt it's like open world activity. Let's go to an anime camp and then turn back into Look, this there was a rock here before. They've really done a lot with the place. You know what I mean? She turned into a little girl. [ __ ] She's still fighting. Girl, it's time traveling. I can't kill the girl. I want to get into more super chats. I want to talk more about what we think this October did. I want to talk about all sorts of th stuff ghost",
            "start": 958.16
        },
        {
            "text": "Girl, it's time traveling. I can't kill the girl. I want to get into more super chats. I want to talk more about what we think this October did. I want to talk about all sorts of th stuff ghost related. But first, I'll remind you that this is kind of funny. Games cast, we couldn't do this without your support. Thank you for all the super chats. Continue to come in with what you want from this game, what you didn't like about Ghost of Sushima, and what you want out of this one. Uh, of course though, what you'd really do if you wanted to help us was go pick up a kind of funny membership. We're an 11 person small business all about live talk shows. You can go to patreon.com/kindfunny, youtube.com/kindfunname, Apple or Spotify. You can kick us $10. Get all of our shows ad free. Get your daily dose of me in a series we call Gregway and feel good for supporting some idiots you like on the internet. However, you're not supporting us right now. So, here's a word from our sponsors.",
            "start": 1001.84
        }
    ]
}