{
    "id": 13922,
    "video_id": "Y0Z_dVGgQKo",
    "show_name": "Gameplay",
    "hosts": [
        "Andy Cortez",
        "Mike Howard",
        "Tom Jackson",
        "Luke Williams"
    ],
    "title": "Andy Plays Lost Skies With THE DEVS! #sponsored",
    "description": "Wishlist Empyreal Now!\nEmpyreal Steam Page -  https://nwzo.io/click/dzexr/\nEmpyreal PlayStation Store page - https://store.playstation.com/en-gb/concept/10012299 \nEmpyreal Xbox Store Page - https://www.xbox.com/en-GB/games/store/empyreal/9nv4j14zzqqn\n\nGo to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\n\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1744789122,
    "duration": 4566,
    "transcript_chunks": [
        {
            "text": "Three, two. Yo, what the heck is going on? Kind of funny best friends. It's your guys Snowike Mike and Andy Cortez back again for another awesome afternoon stream. Yeah, it's a special one. Different timing as well. I know you're used to having games cast after games daily, but no, you get a fun special stream with me and Andy and some awesome developers for an awesome sponsored stream about a game we'll tell you about in just a moment. But after that, you will get the Games Cast. So, you get your normal kind of funny programming, but let's focus on the now because the now is where we're going to have a whole lot of fun. Andy, we're back for an awesome sponsored stream to play Lost Skies with the development team. How does that sound, Mike? I'm ready to get back into this game. I'm ready to get back into, you know, figuring out the Spidey grappling hook. Is that what really what you want right there? I mean, it was the most fun mechanic, you know? I'm going to put that as a for the",
            "start": 9.04
        },
        {
            "text": "to get back into, you know, figuring out the Spidey grappling hook. Is that what really what you want right there? I mean, it was the most fun mechanic, you know? I'm going to put that as a for the Smileys and your game game of the year awards. I'm going to nominate Lost Skies. I lost skies grappling as one of the coolest mechanics. Please don't invoke the smileys and game of the year so early. I'm going to put out there I'm going to put out the floating islands. Mike is exciting to get his own giant warship, but we'll talk about that cuz that's future endgame stuff. Of course. Of course. But of course, let me welcome in the dev team because why have me explain the game to you, which we've already played this game before. You guys have seen us on a previous sponsored stream show off Lost Skies and how much fun me, Nick, and Andy had. Today we're back again, but this time on this stream we have Tom and Luke from the team to play with us. So I'll start off Tom. How are you today?",
            "start": 54.64
        },
        {
            "text": "Lost Skies and how much fun me, Nick, and Andy had. Today we're back again, but this time on this stream we have Tom and Luke from the team to play with us. So I'll start off Tom. How are you today? Introduce yourself and maybe tell me what Lost Skies is. Hey man. Uh yeah, I'm Tom. I'm a principal developer at BA and for the last four years, yeah, we've been cooking up this uh this game Lost Skies for you. Uh so what is it to me? Um that's a that's a really loaded question to be honest with you man. Um we've basically had this vision in our head for going on 10 years. We brought out an MMO. Um yeah 10 yeah 10 years ago we started developing an MMO called Worlds of Drift and we were just so enamored by the concept by the world by everything that was in it that when we had to sunset it we wanted to we wanted it to not die. So Lost Skies is our sort of kind of I guess our attempt to to bring it back to life in a more sustainable way. So, it's not an MMO this time. It's something you can",
            "start": 94.24
        },
        {
            "text": "to we wanted it to not die. So Lost Skies is our sort of kind of I guess our attempt to to bring it back to life in a more sustainable way. So, it's not an MMO this time. It's something you can just play with your mates. Co-op sort of experiences are all the rage now. And it's it sort of felt like a natural fit. I like that. Yeah. Okay, Tom, that's a good runup. I think we got another guy here. He can do a good job as well explaining his thoughts on the game. We have Luke, the lead designer on the game. Luke, how are you? Uh yeah, I'm good, thanks. And uh yeah, like like uh Mike said, lead designer uh been going at this. Yeah, I mean we had the initial sort of concept just hit 10 years ago. Um and uh yeah, we kind of like I think we took stock. We had some pandemic time to think about it and uh kind of just like rebuild it, I guess, from the ground up using a lot of the core kind of concepts and themes. Um a little bit little bit neater, a little bit clean, a little bit more",
            "start": 149.04
        },
        {
            "text": "about it and uh kind of just like rebuild it, I guess, from the ground up using a lot of the core kind of concepts and themes. Um a little bit little bit neater, a little bit clean, a little bit more sustainable like Tom said. Um and here we are. Here is uh this is the result of this. Uh, it's been 3 years. We started work. I believe the prototype for this game was October 2021. We just wrapped up our previous game, I am Fish. Um, and then we moved on to make this kind of prototype. Then it got kind of green lit at the start of 22. Um, and so yeah, it's been about 3 years fulltime. Exciting stuff. I I mentioned Mike how much I love the the grappling hook and they told me that this that it was one of the first things that they developed. No way. uh for like and and that's why it it does feel so good because it's had so much time to cook which rocks. I love that. Well, Andy, just so you know, I'm already off and crafting. I'm out there crafting. You've been deep in your menus and like",
            "start": 195.2
        },
        {
            "text": "so good because it's had so much time to cook which rocks. I love that. Well, Andy, just so you know, I'm already off and crafting. I'm out there crafting. You've been deep in your menus and like Tom, Luke, and I, we're outside. We're getting after it. So, I encourage you to get after it with us. I'm trying I'm trying to get down my my mouse isn't mapping things correctly. I think my NGXT cam program is like not working. Mike, I've already made a makeshift makeshift glider. So, you know, I'm ready to rock and roll. I better go in. I better get out. No time. I won't wait for nobody. Like, they said, \"Mike, we're going to play through the first island. You guys have played before, so you should know what to do.\" And I said, \"I'm already ready.\" Yeah. You said, \"See you.\" Mike's already on the fourth island. Try to keep up, fool. Well, Luke and Tom, this is going to be exciting. We get to spend some time with all of you. Of course, kind of funny best friends out there watching and",
            "start": 237.92
        },
        {
            "text": "on the fourth island. Try to keep up, fool. Well, Luke and Tom, this is going to be exciting. We get to spend some time with all of you. Of course, kind of funny best friends out there watching and listening. This is Lost Skies. We have played this game before. We're back at it again with another fun sponsored stream. This time with the development team behind the game, so we'll be telling you all about it. We'll be learning more about the game and hopefully showing you a really fun time together with me, Andy, Luke, and Tom. If you have any questions for the dev team, a perfect opportunity to ask them any questions you want in the chat. They'll answer it whenever they like. And most importantly, if you want to support the team out there, you can type an exclamation point lost or click on the nightbot command every 5 minutes throughout today's stream. That will take you to the Steam page where you can wishlist the game. We talked about it before, Andy, and I'm sure these guys will",
            "start": 287.12
        },
        {
            "text": "on the nightbot command every 5 minutes throughout today's stream. That will take you to the Steam page where you can wishlist the game. We talked about it before, Andy, and I'm sure these guys will tell us, wishlisting of the game is very important to help out these devs all around the globe get their game seen in front of even more people on the Steam pages. Absolutely, Mike. Absolutely. I think I completely just screwed up all of my mouse rebound trying to do some special [ __ ] Uh-huh. You got deep in the You got deep in the menus. That's right. Yeah. I can't even leftclick anything right now, even on Windows. Yeah. Here we go. Okay. trying to reset some stuff. Oh, Andy, I hit rebind stuff in the NZXT thing and uh I think it just kind of screwed some stuff up for me. All right, Luke and Tom, I got bandages. I got myself a little glider action right now. I'm feeling good. Better than me. Yeah. Are you Are you on the second part of the island already? I mean, I could I could",
            "start": 326.08
        },
        {
            "text": "Luke and Tom, I got bandages. I got myself a little glider action right now. I'm feeling good. Better than me. Yeah. Are you Are you on the second part of the island already? I mean, I could I could technically leave, but I didn't want to leave Andy behind cuz he is still he's just he's keyboard muggling. I'm struggling right now. He's having a tough time. Yeah. What if I Let me just hit delete and reset all. Maybe that'll do it in the game. Are you one of those chronic rebinders? I need my I need my mouse buttons. I you know I use my uh my thumb buttons always need to be set. But yeah, right now I can't Okay, there we go. We're clicking now. I mean, I'm the same to be honest with you, man. But like I made this game, so these are the ones that I I need that the dodge button on my thumb mouse buttons and then probably grapple. Probably grapple. Okay. Yeah, I get it now, Mike. I don't have the finger dexterity to have to to be dodging on the control button. Not for me. I get it. I get",
            "start": 371.28
        },
        {
            "text": "buttons and then probably grapple. Probably grapple. Okay. Yeah, I get it now, Mike. I don't have the finger dexterity to have to to be dodging on the control button. Not for me. I get it. I get it. I get it now. I get it. That's a long stretch for me. You know, I already got the carb tunnel. My uh hunter dodging destiny is bound to the mouse button. Yeah, always has to be. M. Well, I'm with uh Tom across the way here. Andy will slowly get himself. Tom, let's go take a little walk right now. Let's go explore. Let's do it. Let's Don't worry about these other Oh, I'll wait for Andy. I'll wait for Oh, I Yeah, we just did the thing. I got to get across to the next island. I remember that's with that little boost over here, I believe. And so, Luke, I want to know, we talked about like an MMO here. When did you first come up with the idea for Lost Skies with the team? When was it like when you were like, \"Let's make a survival crafting game on this badass floating islands and have everybody",
            "start": 419.44
        },
        {
            "text": "When did you first come up with the idea for Lost Skies with the team? When was it like when you were like, \"Let's make a survival crafting game on this badass floating islands and have everybody running around different islands?\" Yeah. I mean, so I mean the the originator kind of concept I mean that came I mean it originally was the main references were uh Legend of Zelda Wind Waker and Skies of Arcadia. Um, and I kind of mashed the two. And at the time, Daisy was the only kind of major survival game. And we were like, \"Okay, like let's let's kind of like tap into that.\" Like, we like the idea of base building, but you know, what you find is you build your base and then you kind of just you you don't really go out much further. You kind of maybe once you've once you've planted your roots, you you kind of go out not too far, then kind of come back. And I think the the is almost like a little bit of a barrier when you're like, \"Oh, we need to go to this part of the world and build a a",
            "start": 467.2
        },
        {
            "text": "you you kind of go out not too far, then kind of come back. And I think the the is almost like a little bit of a barrier when you're like, \"Oh, we need to go to this part of the world and build a a whole new base.\" And I think part of you is always a little bit resistant to that. Um, so the core kind of conceit with this game is always, well, you take your base with you. Um, and and then how far can we push that? which is why you'll find, you know, not only is it your home in the sky, you you need it to travel to to other islands. Um, but also you'll need it to fight sort of, you know, sky filling world bosses and and other threats in the sky. Um, so with the way we've always sort of described it, it's like it's your home, but also your battleship. That's so cool. That that's how we so me and Mike felt kind of that way with uh a game that we that I love. Uh, I'm not sure about Mike, but I I love uh Valheim and I once we hit the moment where the base needs to move or the teleportation",
            "start": 514.88
        },
        {
            "text": "and Mike felt kind of that way with uh a game that we that I love. Uh, I'm not sure about Mike, but I I love uh Valheim and I once we hit the moment where the base needs to move or the teleportation kind of comes into play and you kind of go like, \"Ah, I spent a lot of time making this thing. I This is probably where I start to fall off, you know, and and the idea of the sort of ever moving base, I think, is just awesome as hell. I freaking love that.\" Yeah, that's where I like the raft, right, where you are the base and the base just moves with you. But uh yeah, I really like I really like that. That's a good call. Yeah, I mean the initial concept as well was a entire unconducted terrain kind of like how you would have in in Valheim, but it quickly it's like how do you constrain the player? Um how how do we stop them from just running off in every direction? And so this was kind of like a solution to that which is like well you can't you need a ship. It's it's uh you can't bypass",
            "start": 557.68
        },
        {
            "text": "Um how how do we stop them from just running off in every direction? And so this was kind of like a solution to that which is like well you can't you need a ship. It's it's uh you can't bypass that. I already have thing about Lost Skies is we have this sort of uh these big bosses in the sky now. And the only way to defeat them is with your ship. So, a lot of the game is like, you know, like weighing up that sort of, oh, I've spent a long time on this base, but now I have to go risk it to like to do this this this huge objective. So, you kind of like maybe it's a spoiler, but maybe you don't want to use the base the the ship that you've built that is your home for the uh for the big boss fight. Maybe you will make a a second ship for that particular or maybe yeah, you want to check out how powerful he is the first time. So you'll Yeah, you'll go make a a second ship for that perhaps. And the uh when we're fighting these air creatures, what is the like are there other moments where your",
            "start": 608.4
        },
        {
            "text": "powerful he is the first time. So you'll Yeah, you'll go make a a second ship for that perhaps. And the uh when we're fighting these air creatures, what is the like are there other moments where your squad is kind of uh like manning different parts of the ship for defenses? Like is that part of the mechanics or what what does an air battle like that look like? Yeah, as you'd expect there, man. You're you're absolutely right. So, you build cannons and machine guns on your ship. They're all mountable by different players. So, one person can be the pilot trying to avoid the attacks from the from the boss while the others are manning the things. Someone could just be on repair duty. Poor guy. But they could be running around with the repair tool just trying to make sure that the ship doesn't fall apart. Gotcha. Uh yeah, there's there's there's a bunch of different things you you kind of need to be managing during one of these fights. I just need We'll get you to the ships later and we can",
            "start": 652.48
        },
        {
            "text": "apart. Gotcha. Uh yeah, there's there's there's a bunch of different things you you kind of need to be managing during one of these fights. I just need We'll get you to the ships later and we can show off all the roles you you essentially have. I need everyone to know I almost killed Tom earlier. Some boulders came down a ramp coming right at Tom. Tom might have been talking. He wasn't really working and boom, almost ran him over. Yeah. Yeah. But if that did happen, he would have blamed you for that. Would have been Tom's fault for not looking Mike's fault. Oh yeah. Strike me with a question then kill me. I see. I see. Me and Tom got we got our pistols already. We're moving. It's great. You guys up? Yeah. Yeah, you guys caught up. Well, oh, thanks for taking on these turrets. Yeah, I was going to tell him the story about us dying to those turrets. These turrets gave us trouble last time. Compared to demo, we've um we've tweaked the damage values for like playing in groups. They were",
            "start": 698.4
        },
        {
            "text": "going to tell him the story about us dying to those turrets. These turrets gave us trouble last time. Compared to demo, we've um we've tweaked the damage values for like playing in groups. They were they were quite aggressive before. We really need a clip about that moment where Nick started shooting at me thinking that I was a He was like, \"Oh, there's guys over here.\" And he started shooting. I'm like, \"Dude, that's Yeah, I remember that. Make Make sure you get your your burning coral here. That's uh Oh, we've revamped the lighting since the demo. Things get a lot darker.\" So, some some coral well. I like the way Luke said, \"Make sure you get your coral.\" Drop. was about to pick it up. No, not you, Tom. No, no, you can figure it out for yourself. Yeah. Sharing is caring. Oh, thanks, man. Not for you. [ __ ] Oh, you know what it does. Oh, it wasn't for me. Okay. I love seeing these rocks already with gems in them cuz I'm like, I want to break those suckers apart. I can't wait to",
            "start": 743.52
        },
        {
            "text": "man. Not for you. [ __ ] Oh, you know what it does. Oh, it wasn't for me. Okay. I love seeing these rocks already with gems in them cuz I'm like, I want to break those suckers apart. I can't wait to break those apart. I want to break those suckers apart. What's this little flying guy? Uh-oh. Oh yeah. Watch out. You know the rules. They will mark you. There it is. Well, I feel like we're better now, Andy. You know what I mean? It's like we we're stronger now. Well, I mean, you know, guess who's not here? You know, we're going to put that on him like that. That's crazy. That's crazy. It's crazy we would do that. Oh, man. Just trying to be honest, you know? I'm just pointing out the obvious is what I'm doing. All right. So, I've been unlocking a lot of schematics. And one thing I love that uh I pointed this out when we played it, but it's something that to not to keep on bringing up Valheim, but I I love that the more you do things, the more that those skills progress. I think that's a",
            "start": 795.04
        },
        {
            "text": "uh I pointed this out when we played it, but it's something that to not to keep on bringing up Valheim, but I I love that the more you do things, the more that those skills progress. I think that's a kind of it feels like more of a lost art in a lot of survival games. like you're often just seeing games that are uh or or you're often going into talent trees and things like that that in order to progress those skills, but I love that the more that I keep sprinting and dodging that those skills will progress as well as like the things that you're continuously kind of working on. I really really enjoyed that system. Yeah. Yeah, I mean when we were coming back to this concept, we you know, we we already actually weirdly had influences from Zelda, which was Wind Waker, which I always find it quite funny that when when Nintendo announced their kind of where they went back to for Breath of the Wild, they cited Wind Waker, um as that kind of like here's a here here's an open world and there's",
            "start": 846.56
        },
        {
            "text": "funny that when when Nintendo announced their kind of where they went back to for Breath of the Wild, they cited Wind Waker, um as that kind of like here's a here here's an open world and there's landmarks and then you're kind of like free to sort of travel to them as you see fit. And that was always a core part of of of of this game was just I look out across the horizon and I can travel to anywhere I want assuming I buy a ship of course but or build a ship of course. Um but that was always the key kind of hook, an exploration hook, right? Um and again like you said this I've always I've not been a huge fan of survival games where they're like you need to spend a talent point to unlock like a pickaxe and things like this. it kind of and I really like the Valheim system of like hey when you get the materials you kind of automatically learn the the relevant things. So we do have a tech tree in this but it's it's for the way we frame it it's for actual technology because uh the the core",
            "start": 890.32
        },
        {
            "text": "get the materials you kind of automatically learn the the relevant things. So we do have a tech tree in this but it's it's for the way we frame it it's for actual technology because uh the the core kind of narrative of this game is you kind of wake up in this destroyed world that has a past and has has technology that used to be known but it's been lost. And so a a key part of you being able to, you know, take on these these bosses that ended the world is by using the technology of the old world. Um, and so when you do get your mining tools, uh, or harvesting tools, they're they're more like sci-fi tools, right? They're they're items that were used in the past that you've now unlocked rather than just, you know, you put some stone sticks together, right? I love that. Can we also I'm back with the grappling hook already. Tell us, Kev, can we talk about how like cool the hair dynamics is? Oh, yeah. Seeing Andy's character and the hair just little the little glo just fluff fluffing",
            "start": 937.76
        },
        {
            "text": "back with the grappling hook already. Tell us, Kev, can we talk about how like cool the hair dynamics is? Oh, yeah. Seeing Andy's character and the hair just little the little glo just fluff fluffing around. Love it. Yeah, if you got one of the long beards, they they also they have a nice little swish to them as well. Yeah, there you go. Physics in, man. And as we talked near the beginning, I understand that, you know, development's tough and there's a lot of um you're constantly bug fixing and prioritizing. Do we should we speed, you know, should we fasttrack this feature or should we try to implement uh, you know, fix these bugs or whatever? But I, you know, Mike, I mean, you could agree that the mustache and the beard disconnection. There's a big there's a big conversation that should probably be prioritized. Like, put that to the top of the Jira task list. I Yeah. Mark the one critical. Yeah. Yeah. Yeah. I think so. I think so. Critical is right. I think I messed up my keybind so",
            "start": 982.88
        },
        {
            "text": "probably be prioritized. Like, put that to the top of the Jira task list. I Yeah. Mark the one critical. Yeah. Yeah. Yeah. I think so. I think so. Critical is right. I think I messed up my keybind so bad. I don't even know how to grapple hook, Mike. Uh Q. You don't got Q on it. Oh yeah, cuz I mean pad 4. Oh, I got to put it in the thing. That's There you go. There's Tom getting my power for me. I always forgot to man. Okay, there we go. No worries. So I had to hook onto that middle part. That's what I was missing there, right? Yeah, you got to hit it right on the center. And there's that reel in. There it is. That's so cool. And now we're back outside. We are tearing it up. I think I think Andy's still lost in the ruins. I think he's way out. He's climbing now. He's upside down. Yeah, we're learn we're learn he's learning the buttons. Who's uh who's who's whose video is on the stream? Uh that is uh that's Andy's right now is live. Anytime there's a highlighted uh highlighted camera",
            "start": 1030.24
        },
        {
            "text": "learn we're learn he's learning the buttons. Who's uh who's who's whose video is on the stream? Uh that is uh that's Andy's right now is live. Anytime there's a highlighted uh highlighted camera over that person, that's the video you're looking at. Yeah. But be switch it to mic too. Also, Kevin, don't let him get self-conscious about this gameplay. Saying you were doing bad, man. That was There's a lot, you know. There's people are laughing at me already in here. Oh, Andy, you're doing so good. I was just curious which one we were watching. Who is this dude? This dude sucks. Who is this? Sucks, man. All right, let's see here. This rocks. We're back. Yeah, we're back. Now we got the grappling hook. It's a It's a You know, we we we tease you with it. It takes a little bit to unlock. It was uh you know, we we like to think you earn it. I thought that was pretty quick considering last time it took us a long time. It felt like Well, we got gunned down by the turrets 12 times. We got some",
            "start": 1080.4
        },
        {
            "text": "uh you know, we we like to think you earn it. I thought that was pretty quick considering last time it took us a long time. It felt like Well, we got gunned down by the turrets 12 times. We got some more turrets coming up for sure. God, the mobility looks so Okay. No, we're good. We're good. Do the old midglide shoot. Yeah. Oh, you can shoot while you glide. That's sick. Hold on. I just got I just got to let my let my stamina come back. There it is. Oh, I did put that. Okay, cool. So, grapple is on mouse 4 now. Who we missing? Oh, no. Everyone's here. Excellent. We're all together. Oh, big treasure chest. See if I can craft some armor. Oh, there you go. That's a good call. and the crap and cloth. Yeah. So, how are you crafting once again? So, there's a there's a a workbench right here. Oh, right there it is. All for your crafting needs. You might have lost your ping on the rebinds, but it is is like mouse button three, I think, or four. Oh, middle mouse. Yeah, I think so. Oh, it's not",
            "start": 1130.2
        },
        {
            "text": "right there it is. All for your crafting needs. You might have lost your ping on the rebinds, but it is is like mouse button three, I think, or four. Oh, middle mouse. Yeah, I think so. Oh, it's not for me. Maybe I changed. It's mouse four then. Mine's mouse four. Yeah. Yeah, it's mouse four. Yeah. If you hold it, you do like a longer ping. But yeah. Oh yeah, check that out. I'm pinging all over. You need to remove and then delete. I think removes that. That's right. We use the delete key. We're not afraid to use that one. Using the delete key. Yeah. Andy's getting lost in it. What are you building over there, Andy? What are you doing? Well, yeah. I was making the little uh the coral flares. Okay. I like that. Oh, yeah. Yeah. I want to make a battery. What are you going to do with that battery? I mean, might use it on some of my tools you don't know about. Damn. I'm holding out for the team. I'm holding out. Remember these floating shrimp that you were saying were not easy to find?",
            "start": 1194.08
        },
        {
            "text": "battery? I mean, might use it on some of my tools you don't know about. Damn. I'm holding out for the team. I'm holding out. Remember these floating shrimp that you were saying were not easy to find? Not easy to see. Are you seen the floating shrimp? Do you see them? It's been for years now. The back and forth between how visible these shrimp are versus not. It's Thank you. That's great. We don't excuse his babe. That's great. This is the endless thing, man. Yeah. Has anyone got any ammo? I need Oh, yeah. You need some ammo? I got some ammo. I got plenty. Oh, we've added since the the demo, we got split stacks now. So, you know, I got to eat some berries. I can't eat any more berries. Oh, so here's the elusive uh datab bank. This is what you scan. I just dropped 30 for you. the data disc with all the uh ancient goodies on. And these are kind of like I mean I I always describe them in development as like our Corox seeds. There's there's more than you'll ever need spread throughout the",
            "start": 1243.36
        },
        {
            "text": "with all the uh ancient goodies on. And these are kind of like I mean I I always describe them in development as like our Corox seeds. There's there's more than you'll ever need spread throughout the world. Um but they are the thing that you want. Cool. Oh, Mike Mike dropped some bullets over here. Anybody needs Oh yeah, I'd love some bullets. Drop 30 back there. Outside or? Yeah, right outside in the front door. Near me. Near me. Got him. Got him. Thanks for the team. God, he's right there with us. We've all got our data discs. Yeah. From the data bank. It's all nicely uh scanned. Yep. Scanned it up. Oh, I have now. Where is that once again? It's just inside the building. I'll put a ping. Yeah. You can't push one and then Spider-Man back to the back to the ark. Yeah. I mean, this whole sequence is purely for you to like kind of like brute force you into Spider-Man mode because we have this little drone and and the objective is like, hey, you've got this data disc, get back to the ark",
            "start": 1296.88
        },
        {
            "text": "is purely for you to like kind of like brute force you into Spider-Man mode because we have this little drone and and the objective is like, hey, you've got this data disc, get back to the ark and hand it in, unlock some new technology. Um, so this little guy is that little guiding help. He's like, okay, he's, you know, he's he's chilling and then he's going to suddenly fly across this massive gap and you're like, well, how do I do that? How do I do that? Conveniently placed some little row of floating rocks. All these floating rocks. Yeah, that was a this was a cool gauntlet for sure. This is like the the sort of learning moment where the hero says, you'll notice as well there's like another row of rocks below you because it was like it's like the training kind of course of like here's how you learn how to swing and if you if you mess up don't worry there's a little plet below you. If you mess up twice though you're dead. So I made it look good Kevin. Yeah, man. So much better. A",
            "start": 1348.48
        },
        {
            "text": "how you learn how to swing and if you if you mess up don't worry there's a little plet below you. If you mess up twice though you're dead. So I made it look good Kevin. Yeah, man. So much better. A little secret here is if when you're swinging, if you actually hold shift to reel in, you'll swing a lot faster. Y I think we were doing that last time. It does use a lot more stamina though, too, though, right? Uh no, you're just holding shift. Uh if you press F, that's like the hook shot ability. That will cost stamina. It's kind of It's similar to just cause, you know, uh in just Cause when you sort of grapple to something, it's like that. F is yank. Oh, that's sick. I've never pressed F. Show it again. Okay. Yeah, if you if you grapple first and press F, it will basically like shoot shoot you into your location. That's super cool. That cost that's cost a lot of stamina, but it's uh very precise. Awesome. Hell yeah. That rocks. That rocks. Are you back in the ark? I'm back in the ark.",
            "start": 1391.52
        },
        {
            "text": "you into your location. That's super cool. That cost that's cost a lot of stamina, but it's uh very precise. Awesome. Hell yeah. That rocks. That rocks. Are you back in the ark? I'm back in the ark. Nice. I've acquired new tier unlocked. Let's go. I think this is where we ended last time. No, this you you think we got past this? Yeah, we Okay. I was going to say, man, I'm excited cuz I don't know. I don't remember what's beyond this point now. Yeah, cuz we there was definitely some other areas that we were having to kind of like puzzle and and you remember that little uh the the green beam that you tie around the pylons. Remember that? Yeah, we me and uh me and Tom did that. Oh, you Oh, [ __ ] I didn't do that [ __ ] Yeah, we did that. Yeah, I wasn't there unless we did it for you. That's cool. There's the guy in the group project that didn't do anything. [Laughter] I mean, yeah, one of the like design goals with with every island is you you arrive there and you there's puzzles,",
            "start": 1436.88
        },
        {
            "text": "cool. There's the guy in the group project that didn't do anything. [Laughter] I mean, yeah, one of the like design goals with with every island is you you arrive there and you there's puzzles, there's enemies, there's treasure chests, there's resources. It's kind of like we like this idea of you arrive at the island and then everyone kind of like, you know, maybe someone's going to stay behind and and improve the ship and upgrade the ship, but like everyone else can kind of splinter off and sort of, you know, do their own little thing on the island and then sort of come back um having found a load of stuff. Craft an atlas lifter. Enter blocked ruins below the ark. Oh yeah, that's where we use like the There's that big rock, right? a big boulder. Yes, there is. Yes, that's kind of like our first uh tease at you like manipulating gravity. Um, obviously the islands can float. You know, your flying ship floats. Um, so you can make objects float, too. Are there any plans to allow multiple",
            "start": 1494.08
        },
        {
            "text": "first uh tease at you like manipulating gravity. Um, obviously the islands can float. You know, your flying ship floats. Um, so you can make objects float, too. Are there any plans to allow multiple people to use computers? Oh. Oh, yeah. Yeah. We There's some networking things we probably need to like, you know, iron out. Yeah. Yeah. iron out there. Um, but yeah, it it can be a little bit restrictive. Um, I love that you just you just brought that up randomly, right? That was nothing to do with the frustrations you were just having. Oh, no, no, no, not at all. Yeah. Yeah. Yeah. No, I feel you, man. That is annoying. I'm just scanning kind of everything, though. Scan it up. I just needed to make this cool face mask, so I apologize. It was important to me. Yeah. Can you [ __ ] stop? Dude, he looks so cool though. Can you let me do the mission critical things before you decide to make a damn uh you know waste [ __ ] face mask or whatever. He's so mad cuz he doesn't have a face mask. Look",
            "start": 1545.04
        },
        {
            "text": "looks so cool though. Can you let me do the mission critical things before you decide to make a damn uh you know waste [ __ ] face mask or whatever. He's so mad cuz he doesn't have a face mask. Look at how cool I look. You do look cool though. Thank you. Who's he again? We have made some adjustments like this like quest stuff. So like actually only one of us has to craft this lifter like Oh, there you So there's not like this requirement for everyone in the demo. So if someone crafts list, we can uh we can all Andy will craft it. I'm making Oh, he's making armor. He's being selfish right now. Don't worry about it. You just made a mask. Let me drop some dust for everyone cuz I did I did where I harvested some shrimp. So here we go. Does anyone mind if I answer a question in the chat? We want you to answer. Go ahead, please. Cool. Someone asked if there is controller support and yes, there is. Nice. That's that's that's the end of the the answer. It's a great question, Chad. I need to",
            "start": 1597.28
        },
        {
            "text": "you to answer. Go ahead, please. Cool. Someone asked if there is controller support and yes, there is. Nice. That's that's that's the end of the the answer. It's a great question, Chad. I need to go get two more dust. There we go. I'm stealing them from Andy. God, you son of a [ __ ] I have created the Atlas lifter. There is no one liftoff more uncooperative in a cooperative game than Mike. Like it is like it is unbelievable. That's why if you ever felt like that you can actually just go and punch them. Oh yeah, you did just punch it in the pool of God. Don't start. Okay. I know. I know it gets bit. So we have the Atlas lifter, right? We got the Atlas lifter. We're on the move. All right, let's go underneath. Mike nearly got decked by a deer. I just Oh, I tried to make it look as cool as they did. I did. I did not do that. I fell right to the ground. Hit the side of a building. Go make it fly. I like that your guy also like made a noise when he hit the floor. [Laughter] Just like",
            "start": 1650.08
        },
        {
            "text": "as they did. I did. I did not do that. I fell right to the ground. Hit the side of a building. Go make it fly. I like that your guy also like made a noise when he hit the floor. [Laughter] Just like knocks his air out of his his lungs. Wow. We can move this together, Tom. That's cool. Yeah, man. That's sick. Oh, okay. If you want, you can uh you can attach to the uh block and get your get your outer lifter back. You know, don't let it go to waste. But just look out uh that it doesn't fall on you. Yeah, it almost fell on you. Jesus call. If it was just slightly more over, it would have it would have for sure crushed you. Oh. Oh god. Uhoh. I just got shot real good. So, first introduction to the main bads called Serif. And as you see, they've infected these ruins. Well, we messed them up pretty good. Ah, easy. Serif complete. Did you take everything, Mike? No. No. Okay, I'm letting you go first. Thanks, man. I'm giving you the opportunity. There's a big ch a big growing moment for you.",
            "start": 1710.0
        },
        {
            "text": "good. Ah, easy. Serif complete. Did you take everything, Mike? No. No. Okay, I'm letting you go first. Thanks, man. I'm giving you the opportunity. There's a big ch a big growing moment for you. Exactly. Me, Luke, and Tom are judging you at every moment. So, we we're watching you. Andy, you're doing great. The one I'm getting scan the old datab bank. Got it. Scanned it. Unlock the shipyard schematic. Very cool. Oh, we got to the shipyard already. Excellent. Yeah, we definitely didn't get to this part. Oh yeah. Watch this. Oh my god. Watch that. Boom. Nice guys. Oh, eight. Nice. That's so good. It's so good. I probably go back to the ark, though. You might want to just wait here slightly. Okay. Oh, snap. Something's happening. We definitely experienced this, Mike. No. Yeah. There was like a big ass flying thing. Oh, yeah. Oh, yeah. I don't remember this. Oh, yeah. Oh. Oh, how big the serif get this. Oh wow. Oh, somebody's on it. Oh my god, he's gone. Oh my god. Don't go. I'm going too.",
            "start": 1772.24
        },
        {
            "text": "big ass flying thing. Oh, yeah. Oh, yeah. I don't remember this. Oh, yeah. Oh. Oh, how big the serif get this. Oh wow. Oh, somebody's on it. Oh my god, he's gone. Oh my god. Don't go. I'm going too. Why not? Get off. Get off. Really? Reel it in. Really? Oh, I remember that. You remember that, right? We try to catch up to it. Yeah. Oh, you can now. Yeah. Now we know we can. Is Right. That's awesome. That's crazy. That's what we're going to need a ship for. Yeah. Yeah. We got to go build a ship. Go defeat themselves. That's awesome. So, that was a baby Serif we killed in there. Yes. Yeah. The little drones. They're the same tech. That That one isn't even as big as they get, but you know, the biggest for now. They're killing the shrimp real quick. Oh no. Oh my god. Oh my god. Andy. Oh, there we go. I'm good. I'm good. Oh my god. Oh my god. Here we go. Kevin. There you go. I do love again. I love the the Breath of the Wild just climb everywhere. It's just so perfect and great. Um Okay.",
            "start": 1839.04
        },
        {
            "text": "we go. I'm good. I'm good. Oh my god. Oh my god. Here we go. Kevin. There you go. I do love again. I love the the Breath of the Wild just climb everywhere. It's just so perfect and great. Um Okay. Such a bold choice, you know? Love it. Yeah. Here we go. We knew we had to grapple. You can grapple to anything, so we were like, well, yeah, why not climb everything as well? It just seems like it makes things really complicated. Oh, just for tech. Yeah, tech wise. Oh, yeah. Yeah. Yeah. Tom will tell you all about that. I was going to say like while while Luke is there just going, \"Yeah, just to be able to climb every But it's so cool and satisfying.\" Five years to my life. Yeah. Yeah. Yeah. Luke going, \"Yeah, that [ __ ] It was super easy.\" I I walked in the room and I said to, you know, what if we climbed everything? Can our players climb everything? And he went, \"What the we climb everything.\" So you have to remember like a lot of these islands are made by uh the community cuz we have",
            "start": 1899.68
        },
        {
            "text": "if we climbed everything? Can our players climb everything? And he went, \"What the we climb everything.\" So you have to remember like a lot of these islands are made by uh the community cuz we have like an island creator. Yes, remember that. I remember that. So imagine that problem, but also you don't control the input. Basically, you're just like, \"Oh yeah, so you can climb everything, but people can use every single asset we've made in any way they want, and we still have to be able to climb everywhere.\" Cool. All right, Luke. No worries, man. I got you. Got you, big dog. I'll have it done by 12 by Tuesday. Yeah, it's not perfect. Like, you can break it in in certain situations, but like it's I think it's it's worth it for the sort of like freedom that it gives you. I think has everyone made their crafting tools. Uh I have not made the hammer. I need to go make stuff. Oh, the It's still flying over there, Mike. Holy [ __ ] It's going to be out. It's right. So cool looking. I need to",
            "start": 1946.88
        },
        {
            "text": "made their crafting tools. Uh I have not made the hammer. I need to go make stuff. Oh, the It's still flying over there, Mike. Holy [ __ ] It's going to be out. It's right. So cool looking. I need to get my hammer and saw going on right now. It looks like a giant sea monkey. Let me see what I got. Oh. Oh, the ones that you would from the commercials back in the '90s. Well, yeah. I mean, the commercial ones look different than like the the commercials. You like the animated one? I didn't. No, I was thinking of the things that Well, there was like an infomercial that as a kid when you're watching Nickelodeon, you would like buy [ __ ] where like Yeah. You mail it in and they like I think it was like $6 and they'd send you freeze-dried sea monkeys and you'd put it in water. Yeah. But like the actual animals don't like cuz those are anthropomorphic. Oh, I see what you're saying. Okay. Yeah. Yeah. But the actual they they're like krill so they're like little man. They were just selling a",
            "start": 1995.28
        },
        {
            "text": "actual animals don't like cuz those are anthropomorphic. Oh, I see what you're saying. Okay. Yeah. Yeah. But the actual they they're like krill so they're like little man. They were just selling a bunch of stuff to kids. Oh yeah. Selling whatever. Okay. So I couldn't make the hammer or What did What did you need? What resources did you need? Metal and a battery. Let's see. Oh, I have a battery if you need it. I need metal as well. Okay, let's Well, let's team up. Let's make it happen. That's right. That's great. It's a co-op game. Uh it's a teamwork game. I took the battery, Mike. All right. Well, what are you What are you looking for? Let's get uh let's get Andy to build. Okay. I need I need three more metal. Yeah, let's help Andy out. Battery. Now, metal can be found in caves, correct? Where can I find metal? I found a lot near that last sort of like uh kind of area where we're shooting the turrets and everything. I'll I'll leave I'll leave a couple of batteries uh in the in the",
            "start": 2041.12
        },
        {
            "text": "Where can I find metal? I found a lot near that last sort of like uh kind of area where we're shooting the turrets and everything. I'll I'll leave I'll leave a couple of batteries uh in the in the crafting bench. Okay. And then let me uh let me dump some metal on the ground. Andy, did you make both of them yet or not yet? No, not yet. No. All right. There's a metal here. Take that metal. You build them both and then I'll build whatever you got left. You leave me. Okay. And then I'll build after you. Sounds good. All right, there's the hammer. Okay, I have the hammer. Mike, why is your uh gauntlet like steaming? My data p my my That's my uh Oh, the grapple. Yeah, don't worry. It's just some visual effects. Okay. What the [ __ ] What? Sorry. What the hell? Why? That I thought he broke it somehow. You made both of yours? No, I I only made the the hammer. I don't have a What else do you need? The I need the saw. You haven't unlocked the saw yet? No. Okay. Oh, you should. Did you not",
            "start": 2086.72
        },
        {
            "text": "it somehow. You made both of yours? No, I I only made the the hammer. I don't have a What else do you need? The I need the saw. You haven't unlocked the saw yet? No. Okay. Oh, you should. Did you not unlocked it or you can't make it? Cuz you made the hammer. So, you should have the saw as well. They cost us They They require the same things. Oh, okay. I may not have had the the right amount of of things. I'll check. Yeah, you might need like another battery. Then you need a battery each and then some scrap and some Do you even have Oh, I need one more medal. One more metal. I got you covered. Another question in the chat that I can answer. The the game Hell yeah. Thank you. has asked if you can play solo and you you you can play solo. Like the game is we support solo up to six players. Like we've tested in terms of the balancing. Um and the enemies do scale like the more players. Yeah. in your in your quest in in your in your party. So solo should still be doable. There are certain",
            "start": 2148.56
        },
        {
            "text": "Like we've tested in terms of the balancing. Um and the enemies do scale like the more players. Yeah. in your in your quest in in your in your party. So solo should still be doable. There are certain things on a ship that are like a little bit harder because you're on your own like if you want to like you can't we've added Yeah. Yeah. We added solo mechanics to the ship so you can actually pilot from the helm. So if you are solo playing uh we've made the the combat a little bit it's almost like Black Flag if you remember um piloting your the the ship in Black Flag where you can kind of hold um like aim and it switches to the cannons. We We have that system in. Hold to drop. Oh, there we go. All right. I dropped a metal for you, Mike. And I think I dropped a battery for you already as well. But you may You're going to need more metal, too, Mike. I think. All right. So, now that we have now that I have the hammer and the saw, am I placing those anywhere or on the bottom bar? I guess",
            "start": 2192.4
        },
        {
            "text": "But you may You're going to need more metal, too, Mike. I think. All right. So, now that we have now that I have the hammer and the saw, am I placing those anywhere or on the bottom bar? I guess they should be they should be in your Yeah. Yeah. Equip like the like a weapon. Sick. Okay, perfect. Got it. And what else do you need, Mike? You need uh more metal, right? Yeah, I'll need a lot of metal. We We can go get some metal. We We have some. We have some. I've been I've been I've been hoarding. Okay. Oh, okay. Perfect. I'll drop some on the ground here. Perfect. I need a battery. Let's make a battery. I always tell Mike my favorite kind of like there's a lot of obviously there's a lot of things I love about video games but one of my favorite loops is just like the first four to five hours in a survival game. I just I it's just such a comforting thing for me. I really enjoy it and this game is kind of no different especially because of the traversal. I think that makes it all the more",
            "start": 2240.8
        },
        {
            "text": "in a survival game. I just I it's just such a comforting thing for me. I really enjoy it and this game is kind of no different especially because of the traversal. I think that makes it all the more enjoyable. I'll need nine more metal. I know. I agree with you, man. What do you need, Mike? Oh, no. They got it for me. Oh, okay. Yeah, I need nine more metal to get mine, too. Yep. Yep. There we go. Thanks, guys. I I think that's a really good point, man. Like the whole like that first initial like 3 to four hours in any game, more or less, like where you you're not really sure how all the systems work and you're just kind of like proddding at it and working it out. That's like that's peak for me. Yeah. There's just there's something about doing it in a survival game where like uh you know since Mike do our own personal streams, there's a lot of moments where if I'm about to stream I'm like what if I just kind of start up this survival game and I'll just play offline and it's just such a",
            "start": 2290.0
        },
        {
            "text": "Mike do our own personal streams, there's a lot of moments where if I'm about to stream I'm like what if I just kind of start up this survival game and I'll just play offline and it's just such a zen kind of relaxing moment, you know? Thank you, boys. Cool. So, now we can uh cut down some trees and get some wood. Oh, yes. We've added like this is what I mean. We didn't we didn't jump straight to like, oh, you need a pickaxe, you need an axe and all this kind of stuff. We kind of were like, oh, you know, you discover these kind of alien creatures and you're able to adapt their technology into like efficient tools. Um, and so we wanted like and because I guess we're so mobile in this game, it's why the the the saw and the cutting tool is like ranged. So you actually you can do it from range if you want. And there's a little like loop to it. So if you catch, you can throw it again um faster. Um, wait, let me let me do Wait, what? Hold on. So, you trick to return to your blade, but you",
            "start": 2341.44
        },
        {
            "text": "if you want. And there's a little like loop to it. So if you catch, you can throw it again um faster. Um, wait, let me let me do Wait, what? Hold on. So, you trick to return to your blade, but you can throw it again. It'll do more damage and it'll uh return faster. So, it's kind of like this little little loop. It's almost like the Fortnite like hit that little perfect spot is right. Yeah. Keep you active while you're doing it. That's cool. Whoa. I was just walking up to things thinking that it was just kind of a an up close thing, but that's so I'm chopping wood. So, hold on. I haven't been able to catch it, Mike. Yeah, get in front of it, man. Just f chase it and get right in front of it. You got to be patient. Yeah. If you keep clicking, you'll you kind of interrupt it. So, you want to click in like right as it gets back to you. Yeah. Yeah. Yeah. You You'll notice the kind of like the cursor like flash blue if you're aiming at a tree, and that's when it's Oh. Oh, I'm popping off.",
            "start": 2384.24
        },
        {
            "text": "click in like right as it gets back to you. Yeah. Yeah. Yeah. You You'll notice the kind of like the cursor like flash blue if you're aiming at a tree, and that's when it's Oh. Oh, I'm popping off. Holy [ __ ] I did it. That was sick. Okay, that's cool. We kind of wanted this idea of like harvesting is a little bit engaging and you can get good at it and and then you kind of feel like hell yeah I just harvested like a forest in like 2 minutes you know. Will the trees grow back? When we played Icarus remember we tore down all the forests in the game and we didn't have any more supplies. It took a while for them to grow back for sure. It will I think I mean like if you look on the horizon there's a lot of islands so we actually have a pretty long respawn timer. Like it's a few days. Yeah, it's like a day or two for the Yeah. Yeah. Yeah. for island. And that's kind of like part of the incentive where you can decimate an island, right? You can kill everything. You can harvest all the",
            "start": 2430.88
        },
        {
            "text": "it's like a day or two for the Yeah. Yeah. Yeah. for island. And that's kind of like part of the incentive where you can decimate an island, right? You can kill everything. You can harvest all the trees and you actually you can't just sort of wait for it to respawn. You you will have to journey to the next island. Um this the the core of this game is always about like your next destination, right? You take your base and you take all of the things you found with you. What's the um what is the my I just totally lost my train of thought because I saw somebody mention Blitz Ball Mike in the the comments. Um are you guys fans of Blitz Ball? Talk about Blitz Ball, man. Big fan of Blitz Ball. I love it, dude. I follow the UEFA league. All right, let's see. Um All right, cool. That's That's a freaking cool mechan I'm just So you just chopping wood now. getting good with your D. Yeah, if if you could gify and skillify, I guess uh mundane things like that, that's really damn cool. Yeah, I think",
            "start": 2472.8
        },
        {
            "text": "cool mechan I'm just So you just chopping wood now. getting good with your D. Yeah, if if you could gify and skillify, I guess uh mundane things like that, that's really damn cool. Yeah, I think that's part of it, man. Because like there is like the whole crafting loop and getting better technology kind of like spawned from Minecraft. That's kind of the the thing everyone uses as the benchmark, right? It's like, yeah, I need wood and stone, then I make a pickaxe, and then I use that to get better materials and get a better pickaxe. But it's like why not just make it more of a skill thing rather than a a gradual upgrade thing. So it's like your tool doesn't get any better the better you get at this game. You just get better with the tool. And I've always been a fan of mechanics that are skill rather than number based. And you see that in the the grappling hook, right? It's it doesn't change or improve. You don't level up your skill in it. You level up your actual, you know, ability to",
            "start": 2519.84
        },
        {
            "text": "rather than number based. And you see that in the the grappling hook, right? It's it doesn't change or improve. You don't level up your skill in it. You level up your actual, you know, ability to do it. Yeah. But actually if you cuz now we're now we're at the building and the world point. So, if you if you press your mouse key, press B, you'll build your build menu. You probably have a few things there now. Yep. Um, I'm breaking apart these little rockets. We We're looking to build a furnace. Um, you click on that and you can see what it kind of needs. Okay. Delve into some caves. Yeah, we need to delve some caves for sure. Coral. Yeah. And thankfully, there's a cave right here. Yeah. I'm bringing apart these rocks. I mean, is there a bad Annie's now deep into the sauces, right? when you've lost him like that is good. That's good. So you got like So this is this is like the next mini game which is uh if you bring out your mining tool which is like your Mega Man gauntlet. If you hold",
            "start": 2564.08
        },
        {
            "text": "lost him like that is good. That's good. So you got like So this is this is like the next mini game which is uh if you bring out your mining tool which is like your Mega Man gauntlet. If you hold this down it'll keep firing. Um so you don't actually have to let go and it's all about kind of clearing away the chunks of rock and then hitting the little ores to to harvest. Oh my god. Oh my god. Don't hit the Oh [ __ ] it's a bad guy. Oh my god, there's a lot of spiders. Wait, Andy, did you not realize that was going to happen? No, it was just like it looked like it was in the middle of the rock. Oh, I was just I was just shooting the thing. I got fixated. If you make if you make noise in the caves, whether it's firing your guns or your mining tools, then yeah, you can awaken you can awaken the bugs. Okay. So, what was the what was the the mini mining mini game? So, it takes a while to charge, but then you can kind of keep holding it down and it will fire a lot faster. and you're sort of",
            "start": 2606.0
        },
        {
            "text": "bugs. Okay. So, what was the what was the the mini mining mini game? So, it takes a while to charge, but then you can kind of keep holding it down and it will fire a lot faster. and you're sort of clearing away the rock and finding the little little pieces of ore, but if you hit the center of the rock too many times, you kind of agitate it and it will detonate and destroy all of the ore and minerals. So, you it's all about like you again like the cutting tool, you can get quick and efficient at it cuz if you keep it held down and you're quick at aiming, you can kind of hit all the the bits of ore without hitting the center and clearing the rock. So, it's just a little Yeah, I guess that's more similar to like kind of the Minecraft like hitting the points, but it's a little bit more I know it's a little bit more inworld because it's not a random UI element right on the on the ore. It's it's the actual physical piece of ore. It feels like it feels like Aim Labs or something. I love",
            "start": 2650.56
        },
        {
            "text": "know it's a little bit more inworld because it's not a random UI element right on the on the ore. It's it's the actual physical piece of ore. It feels like it feels like Aim Labs or something. I love that. I mean, similar to the Yeah. Mike mentioned it earlier, but the Fortnite thing of, you know, you could break down this wall faster if you hit those kind of points that pop up. Yeah. Yeah. Exactly. And I've always just engaging harvesting mechanics for us. That was our kind of main approach. I like that. keeping you engaging when you are just, hey, we're harvesting for multiple hours on end to do whatever we want. Let's have some fun with it. That's awesome. Mike sent us on a trip to get wood for him. Yes, exactly. God, he's done that so many times. I love it so much though, Mike. Dynamic you guys. Yeah, there is like mine deposits under the island if you're feeling daring as well. That's crazy. Don't tease us with that. You know, we got to do it. You shouldn't do it. Wait till Mike",
            "start": 2690.56
        },
        {
            "text": "you guys. Yeah, there is like mine deposits under the island if you're feeling daring as well. That's crazy. Don't tease us with that. You know, we got to do it. You shouldn't do it. Wait till Mike gets there. Oh man, they don't do it. I [Laughter] Did you just die? Oh man, I'm so low. I don't think there's ever coming back. I think come back. Shoot a rock. I don't know why you come back from this. Maybe. I don't know. I don't know. Oh, there. Uh, yeah. Now you look pretty far down. You You can grapple one of those rocks ahead and make your way back. It's so far away. It's really far away. Your stamina is nearly done, man. And I think you might be you might be out of that one. I mean, I warned you right beforehand that it's the more daring way of doing Yeah, but we got to play with risk. All right, Andy, you try now. Wait, so I Oh, I thought you were just trolling us. Oh, yeah. You got to get underneath there, bro. No, no, no. There are resour You swing around, you'll see some you'll",
            "start": 2736.0
        },
        {
            "text": "All right, Andy, you try now. Wait, so I Oh, I thought you were just trolling us. Oh, yeah. You got to get underneath there, bro. No, no, no. There are resour You swing around, you'll see some you'll see some resource. Oh, you're still falling. Oh, okay. When does Mike actually die? I'm still falling. Okay. Oh my god. So, when's that when's the floor? The death floor. Let's see. Here we are after all in the sky. You can always press escape and respawn if you Yeah. Yeah. We added the Yeah. If you feel death is inevitable. Let's see. I'm underneath now. I'm looking. Is it the light gray sp? I'll ping it for you. If you if you head towards the uh the boss loot pin. Okay. Okay. Oh, I see. [ __ ] I can't see you. See, I can see some people grappling around. I'm grappling. I got to just save myself. Hold on. Hold on. I got to walk. I got to walk away. I'm panicking. I'm switch over to Mike. I'm panic. You're doing great. You're doing good. I'm proud of you. I'm freaking out. Oh my god. Just",
            "start": 2783.76
        },
        {
            "text": "Hold on. Hold on. I got to walk. I got to walk away. I'm panicking. I'm switch over to Mike. I'm panic. You're doing great. You're doing good. I'm proud of you. I'm freaking out. Oh my god. Just mining tool. So, I'm just going to chill this. Yeah, I think I've lost all my Oh, is it this blue coral? No, never mind. Oh, did you see? Yeah. So, we do have the we have the belt at the bottom of the inventory that like that stuff's not lost on death, but I have a feeling your mining tool probably was not in that portion of your inventory. Yeah, I think I I think I've lost some stuff, but you know what? We'll ride on Andy. Andy will be able to get us out of this situation. I'm really bad at um at um transitioning from grapple to like magnetizing to a rock for climbing. Wait, can you hold F to like get sucked in? You can just press F. Oh, F. Okay, got something and press F. But watch and you'll you'll shoot right in and and grab on. Oh, does climbing not affect stamina? No, not the basic",
            "start": 2835.84
        },
        {
            "text": "like get sucked in? You can just press F. Oh, F. Okay, got something and press F. But watch and you'll you'll shoot right in and and grab on. Oh, does climbing not affect stamina? No, not the basic climbing. You have climbing jumps like you do in Breath of the Wild and that will cost stamina, but general climbing doesn't. Oh, that's nice. Yeah, I'm down here. Yeah, we made it. I'm living down here. Oh, you're just down. Oh, you're in Dude, I'm I am I am becoming Spider-Man. I'm the man right now. We never doubted you. Now [ __ ] it. That was so much fun. Oh, there's a lot of metal down here where we where we were earlier. Our next We have 30 more minutes with you guys. So, let's do something incredible. Let's get the ship. Let's get the ship on the go. Let's get I love that. That's a great idea. Let's do it. Yeah. Like that's a great thing you mentioned that cuz I would just would have I just would have kept on swinging and doing [ __ ] Like watch your stamina. Watch how you man. Like",
            "start": 2883.12
        },
        {
            "text": "idea. Let's do it. Yeah. Like that's a great thing you mentioned that cuz I would just would have I just would have kept on swinging and doing [ __ ] Like watch your stamina. Watch how you man. Like if you're having fun, then you carry on. You do you, you know. No, we we definitely we want to get to the meat and potato. Sure. Mike's doing a great job climbing. The the core part of the game is like if you can just have fun grappling around like that. That's mission accomplished right there, you know. Oh, you've achieved that mission. Yeah, you've achieved that. So, does everyone building up a furnace now? There we go. Interact with it. I I've pinged it here. Okay, perfect. on my way cuz yeah, if someone's got enough goodies to build a shipyard, we should do that. So, and if you have any ore and uh some dust, you can let me craft some some stuff, some resources there. Oh, I got some iron ingots. That was all a little harvesting expedition down there. So, we'll need it to build the",
            "start": 2933.36
        },
        {
            "text": "ore and uh some dust, you can let me craft some some stuff, some resources there. Oh, I got some iron ingots. That was all a little harvesting expedition down there. So, we'll need it to build the shipyard. Let's take a look. B to build. Go over to the shipyard. We're going to need 30 metal. one printing matrix, which I had two of and I lost both of them. And an atlas and an atlas crystal. You had two of them, huh? Not to worry. We've We've got some stuff. I was pretty nasty. I had a lot of cool stuff. It's crazy cuz you just jumped. I You have to believe what the You should have grappled, too. Just jumped. So, here you go, Mike. Right. Here's the printing matrix. Okay, let's give you an atlas. Not cheating these anyway. We're not We're not cheating. We've earned these. I've been harvesting. I've been harvesting. You've been hard at work harvesting. Yeah. Yeah. And then there's your ingots. Oh, there's a lot of ingots over here in the actual Oh, we we've been we've been I don't know",
            "start": 2976.72
        },
        {
            "text": "I've been harvesting. You've been hard at work harvesting. Yeah. Yeah. And then there's your ingots. Oh, there's a lot of ingots over here in the actual Oh, we we've been we've been I don't know if we need Oh, we do. Okay. Okay. Oh, wow. Those count as metal. Oh, watch out. Yeah. The way the crafting system works is it's not sometimes it is specific uh resources, but for the most part, and you'll see that when we start building our ship, is um there's various metals you'll find, various woods on islands, and uh it can accept any metal or any wood. That's cool. Um but but all the materials have different weights. They have different attributes. So, you'll actually affect the performance of the things you build depending on the metal you use. So, for example, gold is really heavy, but it's super conductive. Um whereas iron is like a good allrounder, very tough, very durable. And so you kind of you'll see when we start building ship parts that it does actually affect the the outcome of",
            "start": 3032.96
        },
        {
            "text": "super conductive. Um whereas iron is like a good allrounder, very tough, very durable. And so you kind of you'll see when we start building ship parts that it does actually affect the the outcome of what you build. Are we in here? He's building the ship in that. Are we building from the blueprint or are we going to uh create a new ship? Is that up to you, man? Yeah. And you've played a lot of Mass Effect. You love sci-fi game. Get the [ __ ] out of [ __ ] the [ __ ] out. I mean, one of the like definitely a core inspiration with this is one thing that annoyed me in Mass Effect was that the the interior of the ship didn't match the outside. The the like the size of proportions scale, things like that really bother me, you know, and and I and I and I remember like way back in Star Wars Galaxies, which was why we tried to it was like main inspiration for like making this an MMO originally. um that when they released their like jump to light speeded expansion, it was the idea that I was",
            "start": 3077.44
        },
        {
            "text": "which was why we tried to it was like main inspiration for like making this an MMO originally. um that when they released their like jump to light speeded expansion, it was the idea that I was inside a flying ship and I could look out the window. Like that always kind of stuck with me and I was like that's awesome. I like being inside a vehicle that's in the world. Um like realistically it's not like a a loading point and now you're inside kind of inverted combat, right? It's one reason why I love the ship building in Starfield. I I had such a great time with that knowing that I'm putting this little compartment here and I can stand out and look out at space with my my shipmates or whatever. Yeah. So, here you you get a little drone and you'll see me flying around with it. If you look up in the sky, I'll come say hello. Oh, yeah. Yeah. Might go get some wind stuff. So, this is what I use to basically build the ship and um you add sections to it and then you can kind of click bits of",
            "start": 3120.8
        },
        {
            "text": "in the sky, I'll come say hello. Oh, yeah. Yeah. Might go get some wind stuff. So, this is what I use to basically build the ship and um you add sections to it and then you can kind of click bits of it. Oh, hang on. That's cool. And that's kind of like you're free to really just mold it how you want. Um sort of shape all your various shapes and delete cubes and and and this this you expand over time. So you'll be a Oh, you grappled to me. I grappled. So you'll be able to like Yeah, you can kind of like you know shape it as you see fit really. Um so here I'll just I can model as a little Wow, this is flimle ship here. Um, and then you get the kind of like the crafting requirements. Um, which I am definitely going to cheat in because we do not have time. Oh, so that one's going to cost a lot. That's right. We have to go work that out. Exactly. Yeah. Yeah. Yeah. The the larger you make your ship, the more sections, the more Normally, you'd have to work for it. Now, once we build this",
            "start": 3163.68
        },
        {
            "text": "lot. That's right. We have to go work that out. Exactly. Yeah. Yeah. Yeah. The the larger you make your ship, the more sections, the more Normally, you'd have to work for it. Now, once we build this ship, right, can we work off of it and build more onto it? Absolutely. Yeah. We're not locked in. The uh it's called the kind of HMS kind of funny. Love that. I love it. Oh, nice. So, yeah. So, when you first build this blueprint, it is just your starter and you can build sections on when you redock it to another shipyard. Even in flight, you can you can redecorate it. You can put plants and trees and all the things that aren't functional. Mhm. Frame right now. But if you actually get out the same tool that you we you know, we built the shipyard with and we scanned the the data banks with, you can then start to kind of work it in. And uh yeah, we can delete a section a deck section here cuz obviously we need a way to get below deck. Wow. Might just fell. Do you see that? Oh my god, this is",
            "start": 3212.72
        },
        {
            "text": "can then start to kind of work it in. And uh yeah, we can delete a section a deck section here cuz obviously we need a way to get below deck. Wow. Might just fell. Do you see that? Oh my god, this is cool. This is cool. Build a half deck. So we uh we get some we get a little slot. We got a lot going on here, man. When does this game come out? Do we have a release date yet? When can we play? Uh Friday. Friday. Friday. Oh my god. All right, let's clear out the weekend. Whatever games I was playing for review, put them in the back burner. We're building a ship. Right. I got some stairs in. I'll help us get in between decks. Ah, this I don't know if everyone interact with the shipyard, but you we should be on the quest for a skyworthy vessel. If you haven't already, interact with the furnace in the shipyard now. Okay. Oh, yeah. I got to interact with the shipyard built on the island. Mhm. Oh, I love that it kind of creates like an artificial floor here. This is cool. Yeah. You see that",
            "start": 3256.88
        },
        {
            "text": "in the shipyard now. Okay. Oh, yeah. I got to interact with the shipyard built on the island. Mhm. Oh, I love that it kind of creates like an artificial floor here. This is cool. Yeah. You see that stuck on the floor? E is a building right there. Oh, it's like floor. Oh, that's so cool. This is cool. Yeah. It wasn't my prettiest move. Wasn't my prettiest move. Instead of grappling when you fall, why don't you pull out your I just love grappling. You grappled on the floor. You shot it out by the time there was force. So, yeah, it says registered a skyhip core. Yeah. Oh, who died? Let's not talk about that. I don't know what happened there. I got just stuck up in it, you know. Don't worry about it. I clicked away so we couldn't see. What the hell happened to you? He grappled to something. God, useless. If you see the dome of the shipyard, you can actually grapple to it. Yeah, he was hanging killed him. So, if we're on that quest, then uh yeah, we we need to basically build all the parts",
            "start": 3306.64
        },
        {
            "text": "useless. If you see the dome of the shipyard, you can actually grapple to it. Yeah, he was hanging killed him. So, if we're on that quest, then uh yeah, we we need to basically build all the parts that make this ship fly. No way. Okay, so we need a a helm and a core. We need a sail. Okay. Oh, a sail, too. Yeah, sail as well. Yeah. So, I'm going to uh down below deck here. I'm going to put the core. That's most important. So, we want to make it nice and protected. A core. Okay. This is our sky core using Atlas, which allows things to float. And if you actually uh now interact with it, you can register to the ship. Almost like registering to a bed. You can register to ship HMS. Kind of funny. Oh, that's cool. Cool. Okay. And if you die now, you'll have the option to respawn there. That's great. That's great. Like the the word atlas is so overused now in sci-fi and everything else. It's so weird cuz like obviously 10 years ago when we made Worlds of Drift like Atlas wasn't that much of a",
            "start": 3352.8
        },
        {
            "text": "That's great. Like the the word atlas is so overused now in sci-fi and everything else. It's so weird cuz like obviously 10 years ago when we made Worlds of Drift like Atlas wasn't that much of a used word and now and and our logic was that it's like it's the it's the mineral that kind of keeps the world like funny enough like Yeah. Yeah. Yeah. All right. Well, we need when we came up with that. Yeah. We need wood and cloths. Wood. Well, you're in luck. Yeah, because I have a dev console. Oh, he's he's typing in command. Oh, I love that. He's typing in commands for us. I will let I'll let you build it, though. We We'll You know, we'll give you uh Let me just throw out on deck here. Andy, you're making it. Get up there. You handle it. I'll throw out some cloth as well. I'm struggling. He's struggling to get on. Use the bubble. Remember, get up on that bubble. Oh, yeah. The bubble. Use the bubble. Yeah. Yeah. Yeah. You hit the bubble, then you get then you'll hit the scaffolding, we",
            "start": 3401.68
        },
        {
            "text": "struggling to get on. Use the bubble. Remember, get up on that bubble. Oh, yeah. The bubble. Use the bubble. Yeah. Yeah. Yeah. You hit the bubble, then you get then you'll hit the scaffolding, we call it. What a great design with that. A little run around. God, this is cool. Look at us. Woo. Okay, so now I got to make a base. Uh, let's do a triangle sail. Oh, okay. We will We will need both. Oh, okay. You get to put You get to place both of them, too. Doesn't matter which one goes. Do you put the triangle in the front? Do you put the big one in the back? What do you do, Mike? You know, it's up to you, man. Let's place it right here. Let's place it right here. on the front. All right. I reckon you probably want the helm at the front if you want to see where you're going. That's what I do. That's a very good call. Didn't think of that. Okay, cool. No, let's put the sail there. That's fine. Yeah. Won't block our vision at all. Doesn't the helm usually go in the back? Uh oh. Yeah, I",
            "start": 3453.6
        },
        {
            "text": "do. That's a very good call. Didn't think of that. Okay, cool. No, let's put the sail there. That's fine. Yeah. Won't block our vision at all. Doesn't the helm usually go in the back? Uh oh. Yeah, I suppose. Yeah, if it's raised. It's your It's your It's your ship. It's your design. You This is This is the HMS. Kind of funny. Fine. Yeah. No, you you Things will eventually not work. Yeah. Don't worry about we'll figure it out. It'll catch on fire. Okay. So, I made one of those. Andy, we're trying our best. We're doing our best here. I'm trying. Is that you guys motto? Yeah, that's definitely the motto. Trying our best. We're trying our best. Spent 20 minutes trying to figure out why the audio wasn't working. I walk in today, I start singing in the lab. Mike, you're somehow coming in through kind of funny games daily. It was the relay setup. It was the relay setup. Okay, here we go. All right, so now I need uh the basic square sail. I need cloth. What song were you singing? Little Jbug,",
            "start": 3496.2
        },
        {
            "text": "kind of funny games daily. It was the relay setup. It was the relay setup. Okay, here we go. All right, so now I need uh the basic square sail. I need cloth. What song were you singing? Little Jbug, Sunshine Girl. Damn, everybody loves JBug. We need some Let me get that cloth for my boy. Let me get that for you. Look at this. Turns out I've been busy harvesting and I've actually just Oh, perfect. I was wondering where you were. He's probably, you know, Luke's probably harvesting out there. All right, I was busy. I was busy. I was pre- fararmming. I I knew what we'd need. So pre farming. Yeah. I saw that teaag, by the way. Whoever did that. [Laughter] Someone's just using the dome for fun here. This is for building construction work. All over the dome. These are not allowed. These are too allowed. Construction only. These are two poorly placed sails. Hopefully this thing, man. takes off. The more sails you put, the faster they go. That's right. So, the ship is entirely physics driven.",
            "start": 3542.48
        },
        {
            "text": "allowed. Construction only. These are two poorly placed sails. Hopefully this thing, man. takes off. The more sails you put, the faster they go. That's right. So, the ship is entirely physics driven. The the more you weigh down the ship, the slower it's going to like turn them stuff you need to move it. Um, and your core will have limited power. So, thankfully, the sails don't cost any power because, well, their sails. They're very mechanical. Um, but they're heavy, but they are heavy. And later on as you try to get your your cannons and your guns on, you're going to have to sort of be a little bit smart on what you build them out of, where you place them, um, and and what the numbers are. So, it's all crazy. It's all pretty involved if you want to start, uh, yeah, going going deep into the ship building. The junction of like future technology with like old technology. So cool. Nice, man. I'm glad you like that because it is a really hard balance to sort of get right because it is",
            "start": 3595.12
        },
        {
            "text": "the ship building. The junction of like future technology with like old technology. So cool. Nice, man. I'm glad you like that because it is a really hard balance to sort of get right because it is like the the the inside of me just wants to make this game like completely sci-fi. I just love sci-fi and I'm just like why why are we using wood? Wood is not it's not a material. You can't even go fast. We use composites and yeah like but then it's like but then yeah no there needs to be progression. You've got to work. What is that progression arc? Like you will have a flying spaceship by the end. Like but you start with your wooden sails and and and your sort of junky junky storage barrels and things like that. All right. So now we need uh the helm. Place the helm, man. Put it down. How how would I make that? Do I go to like B for build or it's all in the build menu? Yep. Yeah. Oh, there is helm. Okay. It would be a survival game without storage. So I'm just going to place some barrels.",
            "start": 3640.96
        },
        {
            "text": "would I make that? Do I go to like B for build or it's all in the build menu? Yep. Yeah. Oh, there is helm. Okay. It would be a survival game without storage. So I'm just going to place some barrels. Got to have some candy. You can't put the helm on this the No, I'm not I'm not placing. I'm just building it. Or like he's just taking a look. Yeah. So, does the helm go like I guess wherever you want. Right there. Is that a bad spot? I like that. Like right here. You add glass to that so you're protected from the elements. You guys are so You guys supportive of each other. It's so lovely. Holy [ __ ] Moving it. Holy [ __ ] It's moving. It's moving. Oh [ __ ] [ __ ] Close the sails are open. The sails are open. Mike, close the sails. Close the sails. Close the [ __ ] sails. You know what I'm doing? This is a disaster. I don't know what I'm doing. What do you think? You grab the help. What do you think's going to happen? Andy, we need no open. Oh my god. He's opening him again. Hills are",
            "start": 3685.92
        },
        {
            "text": "doing? This is a disaster. I don't know what I'm doing. What do you think? You grab the help. What do you think's going to happen? Andy, we need no open. Oh my god. He's opening him again. Hills are closed. We're good. We're good. We're good. We got under control. You got some Yeah, you got some speed. Oh, nice. Oh, and I can hit the V button, Kevin. Kevin, to move the camera. I know, but I just like I'm watching Mike opening all the sails again. Cool. If you hold alt as well, you can look around when you're on the helm. So, you sick. Look at that. And get back to the bright place. So, where you like where you place the helm and like how much visibility you give yourself, but at the same time, you the helm could be vulnerable, right, to attack. So, you need to kind of like balance it. Holy [ __ ] You basically guys, we handled that really. We handled that. Perfect. Just slight panic. And we definitely hit like four trees on the way out. That's That was bad placement on my part. That's",
            "start": 3740.64
        },
        {
            "text": "[ __ ] You basically guys, we handled that really. We handled that. Perfect. Just slight panic. And we definitely hit like four trees on the way out. That's That was bad placement on my part. That's my bad. We are going down slightly. So, let's just So, space bar and control will actually adjust. This space is the uh the vertical control. There's a little crystal on your left like that shows you what your sort of vertical control is. So, if you put that crystal near the top with space, then the ship should start going up. And of course you need to pay attention to the wind direction cuz you know how you pick your destination with sail. It's it's like Sea of Thieves. You got to follow the wind right there. That's right. Sailing 101. But now for now we are bound by sails. So yeah, you could get engines later. They let you wind. So what if I let go? It's just going to keep flying or keep going? Keep going. Something else can take over. Look at this. Holy [ __ ] This is so cool. And then",
            "start": 3780.24
        },
        {
            "text": "get engines later. They let you wind. So what if I let go? It's just going to keep flying or keep going? Keep going. Something else can take over. Look at this. Holy [ __ ] This is so cool. And then when you got the helm Andy, did you notice when you have the helm there's a little wind indicator? Oh yeah. Oh yeah. So cool. Where's Mike? I want Oh, dude. I'm I'm grappling hooking all over the place. Yeah, that piston noise you're hearing is him grappling hooking everywhere. Oh my. Hit the delete button for me on the computer. Do you know where that is? Yeah. Hit that delete button. I just see Mike's name just flying around the screen. I'm not having fun. That's cool. He's having fun. He's having an absolute time of his life right now. Oh, Andy, I'm trying. I'm trying. Yeah. Look at that. Yeah. You know what I mean? Jump off the ship, come back. You can slow the ship down a little bit. You have an easier time getting on board. Oh, this is so cool. Yeah. So, that's the thing with a",
            "start": 3826.4
        },
        {
            "text": "Yeah. You know what I mean? Jump off the ship, come back. You can slow the ship down a little bit. You have an easier time getting on board. Oh, this is so cool. Yeah. So, that's the thing with a completely physics driven game. If you're going like 70 knots and someone's trying to get on your ship, they're not going to be able to. You got to slow down for them. So, it's like it is it has its uh pros and cons. Let's put it that way. Oh, wow. So, we'll slow it down so you can get back on. There you go. Oh, we got some music kicking in. Wow. Okay. Okay. And the And the journey begins. And where the journey begins. Which island are we going to? Andy, where are we going, Captain? That's where the wind is pointing at us. So, I figured I love that. Look at that thing all the way up at the tippy top. Whoa. What is that? What is that up there, y'all? Oh, that's a story spoilers. Uhoh. So, how many islands do you do we have, Luke? I think we can say that, right? In the in the early access. No,",
            "start": 3870.88
        },
        {
            "text": "top. Whoa. What is that? What is that up there, y'all? Oh, that's a story spoilers. Uhoh. So, how many islands do you do we have, Luke? I think we can say that, right? In the in the early access. No, we let's just say the demo had four islands. Okay. Um, and the the main world, as you can see, if you look out, you can see little fragments here and there. There's there's a good, you know, five times as many islands out there. Uh, for you to explore. 30ish. This is sick. Yeah. I'm trying to keep it like, you know, he's trying to make it half. He's like, \"There's four, but there's like five times that and I'm trying to add it up.\" Like, all right. Well, maybe 20, 25. Okay. It's it's it's vague deliberately, but then let's just say didn't brief me. I just like, yeah, 30 islands. Yeah, they are. We're getting excited over here right now. Andy, you check out the moon. It's all damaged. Broken apart moon. Wait a minute. Hold on. There's two. I just did like a like a like a tweet the other",
            "start": 3913.28
        },
        {
            "text": "are. We're getting excited over here right now. Andy, you check out the moon. It's all damaged. Broken apart moon. Wait a minute. Hold on. There's two. I just did like a like a like a tweet the other the other month that was like the meme was like, \"Oh, are you making like a mysterious like world like [ __ ] break the moon?\" Like that makes the moon. You got to break. But there's like a moon on the left and and then there's the broken one. Maybe that's a planet, Kevin. Yeah. Oh, we we went two moons. Yeah, we don't we got to go. Why limit yourself? Broken moon and second moon. It's like all the sci-fi tropes. Yeah. Not to do a skybox. God, this is so Which one is this one? Andy, can you flip the ship over? Yeah. Okay, see that's a good one. No, you can't barrel roll it. No, you can't yet. Uh, like we said, this ship is all physics driven. Um, you would unlock various parts. I think maybe we should when we get to this island, we'll we'll cheat in a little bit more of an advanced ship.",
            "start": 3967.6
        },
        {
            "text": "Uh, like we said, this ship is all physics driven. Um, you would unlock various parts. I think maybe we should when we get to this island, we'll we'll cheat in a little bit more of an advanced ship. It's got a few more parts. Pretty cool. Pretty cool, actually. Tom, is your little uh is your little jet in in this? Um I mean it is, but like do we did we want to do you want to [ __ ] with that? Like Yeah. I mean just why don't we put Mike in it and see what he does? We just we just you know we want to have a little comparison. This is our beginner ship. Where where could we go? You know, let's let's let's get to Shattered Peak and then the we'll spawn the little parking on the field here. Yeah. I like the physics differently. Yeah, we're gonna show off a little piece of it. We're teasing people. We only have a little bit of time left. Yeah, exactly. So, we we can we can mess around with it now. But yeah, we have a little ship that's basically the smallest, lightest ship possible with",
            "start": 4021.44
        },
        {
            "text": "people. We only have a little bit of time left. Yeah, exactly. So, we we can we can mess around with it now. But yeah, we have a little ship that's basically the smallest, lightest ship possible with but still has engines and wings and all the things that make it very maneuverable. And you can get some wild [ __ ] in there cuz it's basically like a it's like a little X-wing like when you're moving it. If Mike just shows the different sort of abilities just based on pure physics. If Mike accidentally destroys it, can you just make it again or I mean, we're gonna cheat it in. Yeah. Yeah. Oh, yeah. Yeah. Yeah. Yeah. We could let him loose. It's fine. Yeah. It's cool. Look at the sunrise coming up, guys. What a beautiful adventure it is. What's that towards? The wind in our hair. You know, we're flying. So, yeah. We arrive at the next island. Couple bad guys there. Pull pull our ship in. I already miss home. I'm not going to lie to you. I miss I miss where we were. The ship's your home.",
            "start": 4066.48
        },
        {
            "text": "flying. So, yeah. We arrive at the next island. Couple bad guys there. Pull pull our ship in. I already miss home. I'm not going to lie to you. I miss I miss where we were. The ship's your home. Wow. The ship is your home. I'm just going to start lowering the sails one by one a little bit. Can you add multiple of the things that make the chip the ship float? So, there will be upgrades. Oh, upgrades to it. So, you can only add one core, but as you progress through the technology tree, you can expand how big the core is and how much it can carry. You see this? This is my elk. What the hell, mate? This is mine now. What the [ __ ] did you just do? I just grappled on tough. Oh, okay. I was like, did you already like get animal teameing? What the? Yeah, that's my friend. You know, Eddie the ele slapped me pretty hard. Was not happy. I was on top of it. You'll notice a handy little beam back to your ship as well. If you go underneath it, you can uh just quick telephone beam. Yeah. Oh, Eddie",
            "start": 4109.04
        },
        {
            "text": "slapped me pretty hard. Was not happy. I was on top of it. You'll notice a handy little beam back to your ship as well. If you go underneath it, you can uh just quick telephone beam. Yeah. Oh, Eddie the elk. Okay. If the elk is is proving difficult. Don't Yeah. The elk is pissed. Got no ammo left. Oh, it's a quick little That's cool. All right, we actually murdered that elk. I thought he was a friend. Well, until he started going crazy. Oh god. I'm getting shot over here. I'm dealing with a turret. I'm dealing with a turret. I'm dead. Andy, where are you? He's dead. I'm like just right there. Right. Or a little elchus. We'll get you. We'll get you. Got him. Big res. Big resi. Oh wow. Resing your teammates's massive. Oh yeah. Look, I don't know if we told you this is a co-op game. And there's a data bank. So, we get a we get a little data disc for more technology unlocks. Oh, the main course. Yeah, this Yeah, you're looking for these on every island you arrive at. You want you want",
            "start": 4158.12
        },
        {
            "text": "a data bank. So, we get a we get a little data disc for more technology unlocks. Oh, the main course. Yeah, this Yeah, you're looking for these on every island you arrive at. You want you want those sweet sweet data discs right here. This this this like uh Yeah, the monolith. I love that. Yeah, the monoliths. Yeah, good to know. It's crazy. You just climb that little tree. Let's cheat stuff here, though. Yeah. Let's show you what could be here as we start to ramp down today's awesome sponsored stream. Mike, Andy, the development team. We got Tom and Luke from Lost Skies. You can wishlist the game. Uh the boys have already shared the game comes out Friday as well, so you could be playing this this weekend with your friends. Uh go out, explore, start an adventure, have some fun. Let us know if you're watching afterwards in the comments down below what you think of Lost Skies. And are you excited for the weekend? I know me and Andy will definitely be uh getting our crew together here to",
            "start": 4208.4
        },
        {
            "text": "if you're watching afterwards in the comments down below what you think of Lost Skies. And are you excited for the weekend? I know me and Andy will definitely be uh getting our crew together here to be playing this one. Yeah, you're already ready for that. You're already good at that, man. Oh, thank thank you. Thank you. Once I start bossing Andy around on items, I need that. I need wood. Go get wood. And then he gets what he wants and he goes, \"All right, I'm done with the game. I've created my masterpiece.\" Yeah, I'm out. How's the jet coming along? Oh, you want me to spawn one? Uh, hell yeah. Let's Let's show you what could be here, y'all. I'm just going to make I want to see. No, stop killing things. See, that looks good. Okay, super. This is not going to end well for you, just so you know. Oh, yeah. If I spawn the wrong thing, it will break the game. Oh, wow. Oh, wow. I got it. I got it. I got it. All right, cool. I got it. Did you both die? Everybody died. Yeah, but I Did we all",
            "start": 4253.28
        },
        {
            "text": "know. Oh, yeah. If I spawn the wrong thing, it will break the game. Oh, wow. Oh, wow. I got it. I got it. I got it. All right, cool. I got it. Did you both die? Everybody died. Yeah, but I Did we all die? Did you uh did you register with the ship? Cuz you can just spawn on the ship. Oh, yeah. Revive on the sky ship. Oh, yeah. Yeah. Yeah. But it won't let me on that. I see the ship though. Okay. Oh, you see it? Leave it there. Hold on. Hold on. Like on my on my death screen, I see the Mike. You didn't register the ship. I can't I was clicking on it. It won't let me. Are you clicking on it? Yeah. See, just like you did. You register on it. Like you have to register on the core of the ship. I thought I did. You have to do to complete the quest. Yeah. Yeah. Yeah. Yeah. It looks like Andy can't do it either. Yeah, we're kind of It's not clickable for me right now. Hey, don't worry, man. It's not like we're releasing on Friday. We got this. We got this. We won't talk about that. We We're",
            "start": 4301.68
        },
        {
            "text": "do it either. Yeah, we're kind of It's not clickable for me right now. Hey, don't worry, man. It's not like we're releasing on Friday. We got this. We got this. We won't talk about that. We We're just here. God, I hear the engines, too. I saw it like All right. So, whoever whoever's piloting this jet, can you uh pilot yourself in front of my death screen? I will I will do my best cuz I saw that [ __ ] or go get Mike. There's a purple. I'm using like a Twitch stream from 30 years ago, though. We uh we're in a whole another area now. It's super cool. We came out. Oh, I see the ship. I see the ship. Where is it? Oh, look. Yeah, there it is. Oh my god. Oh, yeah. Look at that. It's like a little X-wing. Oh, you guys have see it, though. Is it on the screen? Oh, yeah. The blue manta didn't kill you guys. Look at that. That's so cool. I've only got one engine cuz I I I broke one. I could have sworn I just saw two. Yeah. What happened to There was two. I I broke one. Okay. There was a tree a",
            "start": 4344.72
        },
        {
            "text": "you guys. Look at that. That's so cool. I've only got one engine cuz I I I broke one. I could have sworn I just saw two. Yeah. What happened to There was two. I I broke one. Okay. There was a tree a little closer than you thought. A damn. That's so Yeah. I don't know what killed me. I have no idea what killed. I'm pretty sure it was the blue mant you guys started harassing. I wasn't shooting anything. It was Mike shooting. I understand. But it was mad at both of you. But I died as soon as uh the thing was spawned in. So I thought uh I thought I can see the ship. I repeat, I can see the ship, ladies and gentlemen. It's right up above me. Look at it. Should it be smoking like that? That's probably not, but like, you know, it's fine. Well, that's where you could go. That's awesome. Uh Tom Luke, any last things you want to tell the audience watching live here on Twitch and on YouTube about the game, about the release, about Friday, anything at all? Let us know, please. Um, yeah. I'll just",
            "start": 4400.64
        },
        {
            "text": "any last things you want to tell the audience watching live here on Twitch and on YouTube about the game, about the release, about Friday, anything at all? Let us know, please. Um, yeah. I'll just say that the the release on Friday is early access, so it's not where the game will end up. It's the first step towards hopefully something massive towards you. Join us. Yeah, we got we got a huge world for you to explore. As you can see, the ship building and customization is very open and free. You're exploring all these islands on the horizon. finding new ship parts, new technology, new enemies, and you are going to sort of build your little uh homely battleship as you explore this world together and eventually take on um some screen filling bosses. That's fantastic. Andy, Tom, Luke, the audience out there. Thank you so much for watching today's awesome stream with Lost Skies. Thank you to the development team for coming by and having a fun sponsored stream with us. Thank you to all of",
            "start": 4446.48
        },
        {
            "text": "out there. Thank you so much for watching today's awesome stream with Lost Skies. Thank you to the development team for coming by and having a fun sponsored stream with us. Thank you to all of you for tuning in. Don't forget to wishlist the game right now to support these awesome devs. Get that game up on the watch charts so people can go out there and engage with it. And then of course Friday hopefully me and Andy will see you out there on one of the sky islands. You can come join us and have some fun. Uh with that, that will end today's awesome afternoon stream. We're going to move into today's Games Cast and even more kind of funny content live here on Twitch and on YouTube. So with that, goodbye gamers. We'll see you on the next show. Bye everybody. [Music]",
            "start": 4497.36
        }
    ]
}