{
    "id": 13824,
    "video_id": "zF6FwHeVYEM",
    "show_name": "Screencast",
    "hosts": [
        "Greg Miller",
        "Nick Scarpino"
    ],
    "title": "Superman Sneak Peek Live Reaction - Kinda Funny Screencast",
    "description": "Wishlist Lost Skies today: https://kindafunny.com/lostskies \n\nWishlist Monaco 2 today: http://kindafunny.com/monaco2 \n\nGo to http://rocketmoney.com/kindafunny to cancel your unwanted subscriptions with Rocket Money.\n\nLet's see what James Gunn has in store for us!\n\nThank you for the support! \n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1743723324,
    "duration": 2236,
    "transcript_chunks": [
        {
            "text": "[Music] Can you believe it? They put out the first scene from Superman. What's up everybody? Welcome to the kind of funny screencast. It's me, Greg Miller. It's Thursday, April 3rd. That is the producer/seducer, Nick Scarpino. Our time now, Greg. Tim's gone. We can talk about Superman all we want. No more Nintendo news. Get out of here. suffer through all this Switch 2 stuff forever just constantly saying, \"What's happening at Cinema?\" There's nothing more sweat. There's nothing more boring than a sequel or remake of a stupid thing. You know what I mean? Shut up. Thank you for ending your Pokemon stream early for me. It is, like I said, Thursday, April 3rd. This is the kind of funny screencast uh is a show we talk about movies and things on. Of course, you probably know us as in review cuz the screencast goes on the in review feed and we do we're doing Aliens in review right now, but you know, we are coming up on the best few weeks of your life. Superman in review leading in to James",
            "start": 1.06
        },
        {
            "text": "the screencast goes on the in review feed and we do we're doing Aliens in review right now, but you know, we are coming up on the best few weeks of your life. Superman in review leading in to James Gun's Superman film 2025 here. Uh, as I said, it has been Sicon over uh in the Hollywood areas. I don't even know where Sicon is. And so, there's been a bunch of different photos and James Gunn and uh Lois Lane, what's her name? I'm forgetting the name. Rachel Brzan and they're all and they all look great. Nicholas Holt is there. Everybody's having a great time in the I'm on the outside looking in Suzanne waiting and waiting and waiting and waiting and waiting and then here it is. I'm on a call. I open up the kind of funny subreddit and it says Superman sneak peek. I had to get you guys organized. Barrett stop what he was doing. He was doing important work to come in here, turn the studio back on. I had to have Joey open up the YouTube link of the Superman clip and I I walked to your desk",
            "start": 50.88
        },
        {
            "text": "Barrett stop what he was doing. He was doing important work to come in here, turn the studio back on. I had to have Joey open up the YouTube link of the Superman clip and I I walked to your desk so I didn't have anything ruined. I'm like, \"How long is it?\" She says, \"It's almost 5 minutes.\" And I'm like, \"Ah.\" Ah. A I'm so happy for you. I didn't I came there was so many moving parts. I didn't feel like I could come in and like give off the energy that I have for but here we are. This is a screencast. We do it uh you know whenever we need to. There's a screencast. There's definitely an in review every week. We come to you and hang out and talk about things. We've been using the screencast to talk about Daredevil which is also awesome. Born again. Keep looking for those things. Of course, Tim was in New York for Switch, so we didn't do one this week. Next week doing all of them. Very excited. We don't need Tim for this. Remember, we're kind of funny. We're an 11 person small business",
            "start": 91.12
        },
        {
            "text": "Tim was in New York for Switch, so we didn't do one this week. Next week doing all of them. Very excited. We don't need Tim for this. Remember, we're kind of funny. We're an 11 person small business all about live talk shows. It's 3:09. We interrupted one of the live talk shows to come in and do this talk show because we're amazing. So far today, you've already got Games Daily where we told you more Switch 2 News. You already got the Games Cast where we reviewed South and Midnight. You got the Kind of funny podcast where we talked about what we talked about. Then of course, you got the Pokemon stream. Now you're here to watch this Superman clip from a brand new Superman movie that looks [ __ ] amazing. I'm so excited. And you're hanging out with me, Greg Miller and Nick Scarpino. Remember, if you like what we do, patreon.com/kindafoney, youtube.com/kindfunny games, Apple, Spotify, you can get the kind of funny membership. You can uh support this dream that is just my dream come true",
            "start": 128.32
        },
        {
            "text": "if you like what we do, patreon.com/kindafoney, youtube.com/kindfunny games, Apple, Spotify, you can get the kind of funny membership. You can uh support this dream that is just my dream come true every day to get be able to come in here and talk about video games as Superman. Uh you get all of our shows ad free. That's more of course than 80 each and every month. Then of course you get your daily dose of me, Greg Miller, in a series I call Greg Way, which I have a feeling is going to be a different episode than I thought it was going to be because I I've been pushing I listen to all the Switch two stuff coming. Then I do the shows then I've had these backto-back calls and I was like I'll do the Greg way then it'll be more everybody. It's about Superman. Everybody, can I ask a question? Yeah. Do you get more excited for Superman news or Ghostbusters news these days? Oh wow. What a great question, Nick. I appreciate you being so insightful these days. I mean Superman, right? We've been",
            "start": 160.96
        },
        {
            "text": "Do you get more excited for Superman news or Ghostbusters news these days? Oh wow. What a great question, Nick. I appreciate you being so insightful these days. I mean Superman, right? We've been there's been a drought. Go I I mean I understand Ghostbusters Ghostbusters has been good. All right. I'm not going to get in the weeds and fight with you. Superman Superman has been disappointing. Yeah. At the very least, whether you loved it or hate it or whatever, it's like everything that happened with uh uh the Snider verse and everything else has been sad. The way they [ __ ] treated Henry Caval has been sad. The way the property So it's like the fact that we're here. James Gun's making it. That first trailer looked dope and it looked like, \"Hey, we're really setting up a DCU.\" That's the comic book DCU. Krypto, take me home. Come on. Thank you to our Patreon producers, James Hastings, Casey, Andrew, Carl Jacobs, Omega Buster. Today, we're brought to you by Lost Guys, Monaco 2, and",
            "start": 199.84
        },
        {
            "text": "comic book DCU. Krypto, take me home. Come on. Thank you to our Patreon producers, James Hastings, Casey, Andrew, Carl Jacobs, Omega Buster. Today, we're brought to you by Lost Guys, Monaco 2, and Rocket Money, but we will tell tell you about that later. Now, we're going to watch it. The chat is off. I will have nothing ruined for me. I can't believe I've made it this far. Shout out to Anthony Carboni, who did what many people don't do when they text me about stuff like this. Texting me all caps. Have you seen it? So, he was asking rather than blurting. Of course, I said no. I'm about to live react and I put my phone in D and D. I was like, I can't. No, I can't have any strays. I can't catch any strays. Mart, I'm ready. Greg, I am ready as well. Barrett, whenever you're ready, let's go into the sneak peek. Look at that logo of Superman 2025. Here we are. Oo, this is a new shot. I mean, it's a scene from the movie. It's not a trailer, right? Yeah. I just didn't know they were going to",
            "start": 239.84
        },
        {
            "text": "the sneak peek. Look at that logo of Superman 2025. Here we are. Oo, this is a new shot. I mean, it's a scene from the movie. It's not a trailer, right? Yeah. I just didn't know they were going to screw with us a little bit. Oh, we're going to have Okay. Okay. Here we are. We're going to see how fast Krypto can run. [Music] [Music] [Music] Such a He makes you want to get a [Laughter] dog. Stop. Stop. Stop. Stop. Let's play. Let's play. Dad, take me home. home. Like they didn't get it the first time. Home. Oh, shoot. It's a fortress. Is it hidden? Is it to stay hidden? Yeah, the door probably. That's why Lex Luthther could never find it. That's sick. This is all probably part of Luther's plan, right? Oh, maybe. That S is awesome. So cool. Get him into the healing chamber. Krypto Alex us sir as we will not appreciate it. We have no consciousness whatsoever. Merely automatons here to serve. Meet 12. She's new. He looked at me. [Laughter] 14. Damage to bladder, kidney, large intestine,",
            "start": 280.16
        },
        {
            "text": "sir as we will not appreciate it. We have no consciousness whatsoever. Merely automatons here to serve. Meet 12. She's new. He looked at me. [Laughter] 14. Damage to bladder, kidney, large intestine, lungs. With a healthy dose of yellow sun, we'll have you up and Adam in no time. That's awesome. [ __ ] yes. Level four. 292 times. Saharan prime. [Music] [Music] Please. Who's back? I never got a photo. You [Music] did get out there. [Music] Superman. [Music] Super. God, that looks good. God, that looks I mean, everything we just saw looks good, but I mean, just the logo treatment there on the yellow and blue. Yeah. Let's scroll back to that for just one second there. We'll go through this frame by frame every look. Yeah, if you can give me a pause on that right before that. Crazy. That looks nice. I love that it goes on the bottom from red to gold. The top stays blue, but it just fades into the gold like the sun. That's amazing. What did you think of that? I mean, I almost I almost wish",
            "start": 451.64
        },
        {
            "text": "nice. I love that it goes on the bottom from red to gold. The top stays blue, but it just fades into the gold like the sun. That's amazing. What did you think of that? I mean, I almost I almost wish I hadn't watched it. Now I'm like, we got to go radio silent on this going. We have great. I know. I know. I know. I know. But you know, you have to strike that balance between fan and uh obviously professional critic like we are professional commentators, some of the most respected in the cinema industry, super professional and the video game industry as well. Um I think it was great. I think that's so I think just that one little bit was silly and heartfelt and and very entertaining and exactly the vibe that I was hoping for out of a James Gun Superman, which is that it's a James Gun movie. We talked about we talked about this a little bit watching the original trailer that dropped a few weeks back um and how we were hoping it would have that silly almost too much comedy James Gun and",
            "start": 577.28
        },
        {
            "text": "We talked about we talked about this a little bit watching the original trailer that dropped a few weeks back um and how we were hoping it would have that silly almost too much comedy James Gun and this definitely does like the dog segment goes on like triple segment goes on for just a little too long and that's James Gun's hallmark and I'm not mad at it because when we get him in and the Alan Tudy uh what's the robot's name? Oh, Kell. Kell. It's going to be Alan Tudyk. Too many jokes, too many bad jokes. We're going to play some of those. But they're entertaining and that and some of them will hit. Yeah. All that stuff is uh it's silly and it's whimsical and it's fun and it's very comic booky. And the fact they have this like this crazy Kryptonian beautifully designed sort of like past future look of like a a sun gun that will heal him is great. Well, I mean, yeah, sorry. Go ahead. the fact that he can be hurt, the fact that he has injuries to his bowels and bladder and kidney and",
            "start": 624.64
        },
        {
            "text": "future look of like a a sun gun that will heal him is great. Well, I mean, yeah, sorry. Go ahead. the fact that he can be hurt, the fact that he has injuries to his bowels and bladder and kidney and all that [ __ ] is so much more fun than than not broaching that topic at all. Um, so I think this was this really made me wish that I really wish we were watching this movie like tonight. Can you imagine? It would be amazing. July 11th. It sounds so far away. It'll be here before you know it, of course. But yeah, I'm right there with you of like what a delightful treat. And then even yeah watching it like I think even for me as a Superman fan and a James Gun fan setting the tone so well of what you're getting right like I love that the you know one of my jokes was from the original trailer it was a man putting crypto into this yada yada yada a superpowered dogs never worked for me because what you know it's hard to believe that dog's going to listen and so for Crypto to run up and just be",
            "start": 665.52
        },
        {
            "text": "was a man putting crypto into this yada yada yada a superpowered dogs never worked for me because what you know it's hard to believe that dog's going to listen and so for Crypto to run up and just be a dog crypto runs up and is a dog he jumps on his own and does the thing and pulls the thing it's oh [ __ ] I'm broken why are you doing this you know what I mean amazing I love I love that and I think we all had the same sort of reaction cuz obviously the trailer the first thing we ever saw of this really other than stills and some behind the scenes footage is starts with that scene of him going into the snow and Crypto coming out but it's cut so much more like Krypto knows what's going on. It's cut very much like yeah that's a serious take yeah like this dog is going to be his sidekick and maybe like the the you know Watson to Holmes where he might be actually a little bit more confident than homes in in some areas. Uh no but in this you're like oh okay he's probably only in this for a",
            "start": 713.12
        },
        {
            "text": "maybe like the the you know Watson to Holmes where he might be actually a little bit more confident than homes in in some areas. Uh no but in this you're like oh okay he's probably only in this for a few scenes. We're gonna establish the dog in the Fortress of Solitude. The dog's gonna be kicking around. Maybe we get a beat in the third act where the dog saves something saves the day when Lex Luthther tries to raid the Fortress of Solitude for the Kryptonian tech or something like that. But for the most part, it's going to be a story about Superman and Lois Lane. And I think that's and the city of Metropolis. So, I I'm hoping that's what we get with this because I don't as much as I love the dog, if it ain't Rocket Raccoon, I don't need it in the movie the entire time. Man, I can't I want to watch it again. I want to talk about everything and why, you know, it's a top level why I love it again for a tone setter. It's got the comedy in it and then it's really is pulling from and this",
            "start": 746.72
        },
        {
            "text": "to watch it again. I want to talk about everything and why, you know, it's a top level why I love it again for a tone setter. It's got the comedy in it and then it's really is pulling from and this will sound crazy, the source material, the comic books that I think DC has struggled with. Yeah. Most of the people see comic book movies haven't. Would you like to pull from those? But I mean, like, you know, one of the things uh James has been so upfront about like is pulling from Allstar Superman and All-Star Superman is a tale of science fiction. It is like ray guns and weird stuff and you know cosmic juice you're drinking to give lowest powers and it's very golden agy while being there. So to have that level of comedy sure that's great but then to run into the fortress and have it be here's this psychotic weap like not weapon but sun gun like you called it that we're going to spin the fortress to bring it in the robots are there like that's awesome. It's cool. And you know in in this",
            "start": 784.72
        },
        {
            "text": "this psychotic weap like not weapon but sun gun like you called it that we're going to spin the fortress to bring it in the robots are there like that's awesome. It's cool. And you know in in this in this like I don't think the whole thing was how long was the scene? You said it was five minutes as Joey said about five minutes. About five minutes. end of the clip is probably about 3 minutes and some change, but in that time we've established so many interesting things to me that I have questions about. Um, we I've I've never seen The Forest of Solitude be hidden before. It's always been just out in the middle of nowhere. And you know, in the 80s it was like no one could possibly understand where the Arctic is. We we didn't understand how satellites work back then. Now we've got tech moguls who launch satellites into the [ __ ] sky every single day and there's not a single, you know, sector or inch of the of There's a way up in the Arctic right now. Yeah, exactly. Lost. And it's like,",
            "start": 823.04
        },
        {
            "text": "who launch satellites into the [ __ ] sky every single day and there's not a single, you know, sector or inch of the of There's a way up in the Arctic right now. Yeah, exactly. Lost. And it's like, I'll pick someone up here. I just have to wait 30 years um for the ice caps to melt. I got you warming. Yeah, it's bad. It's bad. Um we just lost 30 viewers. Uh no, but I think that's cool. It's like, oh, it wouldn't be hidden. Of course, why not? Why would it not be hidden? Like if you didn't want people to come into your ultra cool futuristic layer where you have like 5 seconds to yourself. Uh that's that's what you would do. But then the fact that it rotates, the fact that it can move, the fact that it is sort of like the whole thing isn't crystals. It's like it's Kryptonian technology. It's a machine. It's made out of the ice, but it's not really the ice, you know, that that that that stuff's cool. And then I I can't wait to go through and sort of frame by frame the interior of this",
            "start": 857.28
        },
        {
            "text": "a machine. It's made out of the ice, but it's not really the ice, you know, that that that that stuff's cool. And then I I can't wait to go through and sort of frame by frame the interior of this place because, you know, and again, you know, uh Zack Snder had a vibe and he had an aesthetic that I don't necessarily disagree with. I liked the tone of Man of Steel. I liked that it was a departure from what we had seen prior and I think that was very, very smart. It just didn't necessarily work. It didn't have it didn't have the longevity that we needed out of it because it wasn't starting from a basis of that like anything can happen to your creativity like we're looking at this. So I kind of vibe more with this. This feels more like a super a modern-day Superman movie than it than anything else that's come before it. Even even the the the Brian Singer Superman movie. Oh my god. Don't be sorry. We'll talk about that when we get to interview. Right now I want to talk about what makes the",
            "start": 895.36
        },
        {
            "text": "else that's come before it. Even even the the the Brian Singer Superman movie. Oh my god. Don't be sorry. We'll talk about that when we get to interview. Right now I want to talk about what makes the world go round. It's you supporting Kind of funny. a member, pick up that kind of funny membership either on YouTube, Patreon, Apple, or Spotify, so you can get all of our shows ad free supporting 11 person business and get a daily dose of me in a series we call Gregway. But right now, you're not using your benefits. So, here's a word from our sponsor. This episode's brought to you by Lost Skies. What would you do if you woke up and the world around you was now floating high in the clouds? Lost Skies is the new openw world survival like that puts the power of exploration and choice in your hands. Use the physics-based grappling hook, glider, and your own custom airship to traverse the remains of this fractured world and uncover its mysteries. You and up to five friends will harness the",
            "start": 935.2
        },
        {
            "text": "hands. Use the physics-based grappling hook, glider, and your own custom airship to traverse the remains of this fractured world and uncover its mysteries. You and up to five friends will harness the power of ancient technology to survive the hostile islands that scatter the horizon and the threats that lurk in the sky itself. The battles are intense, so it's up to you to build a sky ship to shelter you in fierce storms and take the battle to gigantic monsters. Want to take a break from fighting in the skies? Use the intuitive island creator and share your builds with the community. Head over to Steam and Wishlist Lost Skies today and discover what's lurking beyond the horizon. This episode's brought to you by Monaco 2. Gather your crew, plan your heist, and let the chaos unfold in Monaco 2. Return to Monaco, a city teameming with excellent scores and gullible marks right for getting parted from their prized possessions. Go it alone or tackle heist as a team of four with online and",
            "start": 970.96
        },
        {
            "text": "2. Return to Monaco, a city teameming with excellent scores and gullible marks right for getting parted from their prized possessions. Go it alone or tackle heist as a team of four with online and local co-op. Just remember, even the bestlaid plans can blow up in your face, so you'll have to stay on your toes. Monaco 2 is the sequel to the cult classic Monaco. What's yours is mine that expands on every aspect of the game. New characters bring unique abilities and play styles to help you escape the heat. And with new modes and procedurally generated levels, every run is full of surprises. The heist is on when Monaco 2 arrives on Steam, Xbox, and PlayStation on April 10th. Y'all know how important it is to wishlist these games. It helps the developers so much. So, please wishlist Lost Skies and Monaco 2. This episode is brought to you by Rocket Money. You sign up for something, forget about it after the trial period ends, and then you're charged month after month after month. The",
            "start": 1017.84
        },
        {
            "text": "Skies and Monaco 2. This episode is brought to you by Rocket Money. You sign up for something, forget about it after the trial period ends, and then you're charged month after month after month. The subscriptions are there, but you're not using them. In fact, 85% of people have at least one paid subscription going unused each month. Thanks to Rocket Money, you can see all of your subscriptions in one place and cancel the ones you're not using anymore and save more money. Rocket Money has helped multiple members of Kind of Funny learn that they're still paying for things they totally didn't even realize. You know who I'm talking about. Rocket Money is a personal finance app that helps find and cancel your unwanted subscriptions, monitors your spending, and helps lower your bills so you can grow your savings. Rocket Money has over 5 million users, and has saved a total of 500 million in canceled subscriptions, saving members up to $740 a year when using all the apps premium features.",
            "start": 1066.32
        },
        {
            "text": "grow your savings. Rocket Money has over 5 million users, and has saved a total of 500 million in canceled subscriptions, saving members up to $740 a year when using all the apps premium features. Cancel your unwanted subscriptions, and reach your financial goals faster with RocketMoney. Go to rocketmoney.com/kindfunnday. That's rocketmoney.com/kindfunn. Welcome back to your live reactionscreencast about this Superman 2025 sneak peek. I'm Greg. That's Nick. Of course, you want to write in to be part of the show, you can do it with your kind of funny super chats on youtube.com/kindfunny games, just like Mara did. I love that it seems to hurt when he's healing. Healing is a painful, stressful process on the body and it's really cool to see it portrayed like that. Yeah, Barrett, if you don't mind scrubbing around a little bit or just letting it play or whatever you want, but you can jump to that section. Yes. Something I think that's very neat about this and something you wouldn't talk",
            "start": 1110.56
        },
        {
            "text": "mind scrubbing around a little bit or just letting it play or whatever you want, but you can jump to that section. Yes. Something I think that's very neat about this and something you wouldn't talk about uh usually, right? Uh cuz you know, different ways of showing off how Superman uses his abilities, but the idea here, yeah, that all right, cool. We're going to dose you with 200% or whatever they say of sun that great that you're going to heal, but yeah, your bones are going to crack back into place, your bowels are going to remmend, all you know, your cells are going to come back together in a incredibly quickly fashion, right? rather than what normally it is in movies and stuff with Superman, right, where the cut on his face just goes and he's back to being Superman. Yeah, that would be a painful thing. And it's interesting to see to your point, um, what I appreciated about the Snider verse, as much as it wasn't what I, as I always said, it wasn't what I wanted was that, oh, you're",
            "start": 1158.16
        },
        {
            "text": "a painful thing. And it's interesting to see to your point, um, what I appreciated about the Snider verse, as much as it wasn't what I, as I always said, it wasn't what I wanted was that, oh, you're doing interesting things with the mythos here. You're you're do you're doing your own take. You're doing your own spin. To see James Gun step in and do similar thing of, all right, cool. Let's show Superman in immense pain as he heals instantaneously rather than, you know what I mean? Uh, yeah, I like that. I'm all for that. I'm all for seeing a a creative, I think, as talented as James, come in and really go, \"What are we going to do with this mythos?\" Yeah. I mean, for me, my my expectation would have been, okay, uh, he gets dragged back to the Fortress of Solitude and gets put in the chamber, whatever that I from like Yeah. death and return where he's just in the Kryptonian healing tank and Metropolis over my dead body. Yeah, Jimmy, whatever. Uh, so I assume that's what it would have",
            "start": 1194.4
        },
        {
            "text": "whatever that I from like Yeah. death and return where he's just in the Kryptonian healing tank and Metropolis over my dead body. Yeah, Jimmy, whatever. Uh, so I assume that's what it would have been. It would have been a boring like we're seeing him there and and uh all the robots were like, \"Oh, we don't know when he's going to wake up.\" This is much more fun. This is much more character building. It's much more vulnerable. What I love about this is of course when we did the big trailer breakdown, I immediately started spinning my wheels on what I thought the story was going to be. And what's great about seeing this sneak peek play out is that I'm wrong already. Now, I don't think I'm that far off the base. If you remember what I was saying was Lex comes to the fortress because we've seen that in promotional stuff. I think the trailer we talked about maybe even in this teaser at the end, right? Let I was saying Lex came to the fortress, [ __ ] up all the robots, lets out all the",
            "start": 1235.04
        },
        {
            "text": "seen that in promotional stuff. I think the trailer we talked about maybe even in this teaser at the end, right? Let I was saying Lex came to the fortress, [ __ ] up all the robots, lets out all the creatures Superman has beaten over the years that he's kept in his fortress. Similar to the animated series, they come out. That's what turns the world against Superman. At least enough to get a slushie thrown at his head, right? Because hey, Alex is like, this guy had all these things. Blah blah didn't kill him. He should have killed him, right? I still and so I thought that this was picking up with the breakout of the fortress. So for Crypto to take him home to the fortress, I thought Crypto was going to fly him all the way back to Metropolis. So bringing him back here is interesting. And I would imagine as I kicked off part of Lex's plan, you know, the Lex clip they showed here at the end that we've seen from the trailer, but I don't remember the line of the trailer is he Lex turning",
            "start": 1269.6
        },
        {
            "text": "I would imagine as I kicked off part of Lex's plan, you know, the Lex clip they showed here at the end that we've seen from the trailer, but I don't remember the line of the trailer is he Lex turning around and go, he's back. I wonder if that's him healing here right back to Metropolis to fight whatever just kicked his ass. Must be maybe it's that massive kaiju monster looking thing. That's my thought, which still for me tracks with my overall plan that it could be of all right, Superman's been putting them into the Phantom Zone. Lex got his hand on the Phantom Zone projector, maybe even broke in and got the Phantom Zone projector, right, and is letting all of them out and then doing the same plan or whatever, perhaps. Or I mean, my other thought process is we have a different team we're seeing here, right, with with uh Hot Girl and uh and uh Green Lantern and all this, and perhaps this was a mixup with them. He got his ass beat. He had to come back and heal and come back. I don't",
            "start": 1304.0
        },
        {
            "text": "seeing here, right, with with uh Hot Girl and uh and uh Green Lantern and all this, and perhaps this was a mixup with them. He got his ass beat. He had to come back and heal and come back. I don't know. I doubt that. But you have to imagine someone's running that team and you have to imagine Maxwell Lord is the Maxwell Lord. But but who's Yeah, that's a good point. Oh, Baron, I'm sorry. And this is on me. Can you bring the chats back up when you have time? I know I have you've been doing a bunch of stuff and I asked you to turn it off because I didn't want you to spoil anything for me. I didn't want your excitement. In fact, I mean, I know her. You do know her. It's Hawk Girl, right? Hot girl. Okay, that's why. Um, yeah, it looks really, really cool. I'd like to go back if we have a second. Yeah, let him shaking his head. Oh, he's so And here's the thing. One the one criticism I saw a lot of people saying in the original trailer was they didn't like his hair when he was Clark Kent.",
            "start": 1340.8
        },
        {
            "text": "Yeah, let him shaking his head. Oh, he's so And here's the thing. One the one criticism I saw a lot of people saying in the original trailer was they didn't like his hair when he was Clark Kent. Everyone, you don't understand what it's like to have a head of hair like that. Sure you don't. You got to put it out there for everyone to see. I had said that I the out the I don't like his hair as Clark Kent in the him that one the one shot we have of him outside. I think he looks fine. But something about that shot that just doesn't work for me. I will say also uh looking at in the trailer of the suit uh you know we they showed the still of him sitting in the suit look kind of baggy look kind of bulky look kind of a little too thick. Um seeing him moving around in it now seeing him moving around as he's getting healed even in this shot right here that's pretty cool. Yeah, I think the suit in motion I've come around to it. I really have like right here I like that you don't see any of those",
            "start": 1375.52
        },
        {
            "text": "as he's getting healed even in this shot right here that's pretty cool. Yeah, I think the suit in motion I've come around to it. I really have like right here I like that you don't see any of those like the ripples of the the actual fabric or anything like that. It looks good. It looks thicker, but it looks like, you know, we're not really going for he needs to be jacked out of his gourd for this, although I'm sure the man is huge because he's 6'5\" or some [ __ ] like that. What a movie we're getting here. Look at this. Again, these are shots that we've already seen. Uh they did I don't believe we had this line in the original one, right? I don't think it said anything. Yeah. So, I think that's that's new for this trailer. And then that's that big beast that we're looking at. Mhm. Mhm. Uh when we have a sec bear, let's go back to I just want to take a look as we walk into the Fortress of Solitude so we can kind of see this. I want to see the door first. Take a look at this. Just",
            "start": 1413.76
        },
        {
            "text": "Uh when we have a sec bear, let's go back to I just want to take a look as we walk into the Fortress of Solitude so we can kind of see this. I want to see the door first. Take a look at this. Just massive and big. Yeah, you let it play from here, Bear. Thank you so much, Krypto. You know, I tell you what, dog CG technology come a long way. Yeah, I thought it maybe didn't look as great when he was jumping on him. I mean, I like the bit, but I didn't know how. I hear it looks better. So, I mean, what's behind that door? Exactly. Is that where he sleeps? Is that his Is that where he just hangs out? Oh, no. He lives in Do you think he goes over to that? And there's just a bunch of old VHS tapes and he's like, \"This is my place. This is my man cave. My man cave.\" I always liked in, you know, the Death and Return times. He had like that half egg chair that he like floated in and watched all the screens. I always thought that was cool. That's pretty cool. I think might have even been",
            "start": 1447.12
        },
        {
            "text": "know, the Death and Return times. He had like that half egg chair that he like floated in and watched all the screens. I always thought that was cool. That's pretty cool. I think might have even been installed by the eradicator, but I I stand out. I think these look great, too. Yeah. I like the I like the eye the the uni eye with a little bit of blink in there a little bit. You know, it looks a little like Allen alien. Love that. Interesting. Back to my point about we've seen in this video, the robots [ __ ] up, right? Uh, and and like we know Lex's been to the fortress. I wonder if that ties into right there him saying, \"Oh, she's new.\" I wonder if it's because they already got assaulted at the fortress like right here. You think this happened prior? You think this happens like midway through? Maybe. Yeah, maybe. And maybe this scene's happening. Yeah, that would explain why you have a new robot in in the middle of uh the Arctic here at the a robot giving a little bit of love",
            "start": 1483.36
        },
        {
            "text": "through? Maybe. Yeah, maybe. And maybe this scene's happening. Yeah, that would explain why you have a new robot in in the middle of uh the Arctic here at the a robot giving a little bit of love interest for the robots. Oh, the robots are falling in love. I like I think so. I mean, there's a little there's a little I like how there's like, \"Oh, there's no need to thank us. We can't take gratitude.\" But instead, it's like, \"Oh, well, no, but we can fall in love and she can be impressed.\" But I'm I'm liking all that. I didn't clock her voice. If Chad, if you if you knew who that was, let us know. It's got to be someone of note. Yeah, I imagine. Yeah. Again, I I think one of the most uh boring takes on Superman is is that he's boring and can't be hurt. So, I do appreciate the scan here and show all the things that have been [ __ ] up and destroyed by Looks like we got taken down on YouTube, unfortunately. Oh, that happened a while ago. Yeah. You know how it is, though. It'll do the thing",
            "start": 1517.52
        },
        {
            "text": "all the things that have been [ __ ] up and destroyed by Looks like we got taken down on YouTube, unfortunately. Oh, that happened a while ago. Yeah. You know how it is, though. It'll do the thing where it's down and then hopefully they'll realize what we're doing and reinstated. But we're still live on Twitch and we're going to put this up as an audio no matter what. Oh god. Sorry. Oh yeah. Robots are strong enough to hold down KL. That's impressive. That's interesting. Yeah. Yeah. I love this. I love that. I will always love that. I will always love the the sort of rays of light going in and out of the the title treatment. It's so nostalgic. It's so perfect. Yeah. the Kaiju like we've talked about before. I'm very interested to see how that comes into play cuz clearly I think it's just going to be Lex's plan. He's released it. He's made it. You know, what's it actually going to be? But who's playing Maxwell Lord again? Uh James Gun's brother. What's his name? Shun. Shan Gun. Yeah.",
            "start": 1551.84
        },
        {
            "text": "going to be Lex's plan. He's released it. He's made it. You know, what's it actually going to be? But who's playing Maxwell Lord again? Uh James Gun's brother. What's his name? Shun. Shan Gun. Yeah. Look at this thing. Just spitting some fire. I mean, it looks like it's from the ocean. Let's be honest. Whoa. We're going to blame Aquaman right away. Yeah, I'm definitely blaming Aquaman. It looks like it's got some crustaceations on its arms. Maybe it's just like a skin condition it has. Yeah, exactly. Again. I mean, you know, Metamorpho in there. Maybe they're using his uh powers against uh they cloned off that. This is the shot you're talking about. Nobody liked with his hair walking into uh Yeah, for me. I mean, it's whatever. It's I'm sure whatever. Everyone needs to get over it. Kent, of course, love this actor from Constantine. Yep. Yep. Yep. Yep. Yep. The planet looking good. I never noticed out there that Guy Gardner was clocking that thing. Oh, yeah. Yeah. Green Lantern in the",
            "start": 1588.56
        },
        {
            "text": "of course, love this actor from Constantine. Yep. Yep. Yep. Yep. Yep. The planet looking good. I never noticed out there that Guy Gardner was clocking that thing. Oh, yeah. Yeah. Green Lantern in the back. Trying his best. Just doing no good. Giving Superman hope a second of downtime. What do we have? It's hard to see. He's drinking coffee. Does he? No, that's his belt. Okay. No, I thought he I thought he had like a canister or something on his belly. He brought the old Stanley canister out with him. Lois, I mean, interesting that he needs a coffee. Like he's drinking coffee, right? He doesn't really need food. Yeah. I'll tell you what right now. I'll tell you watch two attractive people kiss. That's the stuff. Well, people that have chemistry. Yeah. Did you ever feel See, that's one thing is too is like I never I don't know. I'm excited to see how these two react to each other. I love Amy Adams and I love Henry Caval. I just never really felt that relationship. I never felt the",
            "start": 1623.92
        },
        {
            "text": "thing is too is like I never I don't know. I'm excited to see how these two react to each other. I love Amy Adams and I love Henry Caval. I just never really felt that relationship. I never felt the chemistry. They have the se the sequins in the bathtub and I'm like h I don't know about this. Why you putting your shoe? Why are your shoes still on? Why you putting your shoes going on? Yeah. Makes me You got to take that bathtub out and put some bleach on it now. Yeah. Yeah. So, I'm excited to see these two and I love Rachel Brazan from uh from Marvelous Miss Masel from uh from that Netflix series she did. Yeah. So, yeah. Lots of love here. Lots to love. And we're into the same stuff. You can go watch our entire reaction to the long Superman trailer that had a lot of this in there. Nicholas Holding to kill it as Lex. Love him. Love that he took that role. Yeah. You know, could have been Superman. Could he have been? I don't know about that. But for him, uh, can we watch it one more",
            "start": 1661.52
        },
        {
            "text": "Holding to kill it as Lex. Love him. Love that he took that role. Yeah. You know, could have been Superman. Could he have been? I don't know about that. But for him, uh, can we watch it one more time, Barrett? Just watch it all the way through with the sound by watching it again. But I just want to see it again. I just need to see it and feel it again. Creed says, \"Will he get the power suit?\" I don't think he's going to Oh, Lex, I'm sorry. I'm I'm hung up on a heart Superman. Lex. Yeah, I think Lex gets in the power suit, by the way. The green power suit. Yeah, the green and purple. Interesting. I wonder if this is the aspect ratio of this. I didn't catch that the first time. Always been 169. Oh, with the bars. There are no bars. So, this is 169, right? You know better than me. No, they're still major. Okay. So, it's like uh I forget whatever that resolution is. [Music] Let me look it up. [Music] So you figure gets his ass kicked in Metropolis and crappily flies to the Arctic, right?",
            "start": 1696.0
        },
        {
            "text": "still major. Okay. So, it's like uh I forget whatever that resolution is. [Music] Let me look it up. [Music] So you figure gets his ass kicked in Metropolis and crappily flies to the Arctic, right? Of course. Yeah, you you imagine. So it' be very coincidental if they just happen to be fighting right above. Yeah. Yeah. That text. I'm just curious. This is the same way Cole wakes me up every morning. 185. I love the screams from Superman. Yeah, because you gotta figure the dog's strong. The dog is what? The dog is strong. Oh, yeah. Yeah. No, no, no. Yeah. Yeah. Crypto 185. Take me home. Can't wait to get call that dog tag. You know, you think they sell it? Oh, they're going to sell everything. Do you think they can sell it that big though? You can keep No. No, Cole will just drag his head on the ground. He never lift his head again. First time chatter XX260 says, \"My dog did this to me this morning.\" Well, exactly. So, and about the aspect ratio, they shoot a lot of like superhero like",
            "start": 1742.72
        },
        {
            "text": "the ground. He never lift his head again. First time chatter XX260 says, \"My dog did this to me this morning.\" Well, exactly. So, and about the aspect ratio, they shoot a lot of like superhero like movies in this aspect ratio, which is pretty much 16 to9 like your standard. Yeah. Because of the verticality of it. So if you put those bars there, you wouldn't have been able to see this. So they I think Jos Weeden did it specifically in Avengers cuz everything is very vertical. So there was no point to that. I think it's actually it's working beautifully here. If this is the actual aspect ratio, which is what it says on the tech specs, I love that tail wagon having a good time. He's a dog. Yeah, he's got a smell. He's a good boy. He did a good thing. He's got a smell. N you can't have a smell in this port of environment. He kills all the bacteria. Yep. Superman. Superman. And these colors look awesome. These look awesome. Hey, Carl. That is straight out of like classic Superman design.",
            "start": 1815.92
        },
        {
            "text": "in this port of environment. He kills all the bacteria. Yep. Superman. Superman. And these colors look awesome. These look awesome. Hey, Carl. That is straight out of like classic Superman design. Yeah. Thank you. No need to thank us, sir, as we will not appreciate it. We have no contact whatsoever. Merely automatons. Kind of annoyed by it. Meet 12. She's new. He looked at me. 14 fractured bones. Damage to bladder, kidney, large intestine, lungs. With a healthy dose of yellow sun will have you up an atom in no time. That's cool. Up an atom. Level four. 292 times more robots back there in the left. That's cool. Obviously 12 of them than we know of so far. Come on. What does that do to you? It makes me feel good. The low brass section kicking into high gear. The trumpets and the low brass. I guess the brass [Music] section. He's back. He's back. [Music] [Music] Superman. Superman. Superman. I can't [ __ ] wait it, Nick. I know, man. I'm eating popcorn at this one. This one's going to be",
            "start": 1868.08
        },
        {
            "text": "guess the brass [Music] section. He's back. He's back. [Music] [Music] Superman. Superman. Superman. I can't [ __ ] wait it, Nick. I know, man. I'm eating popcorn at this one. This one's going to be worth the calories. Look at how beautiful that is. I want to be just the guy that designed that right there. Just the Superman logo. No, this is beautiful. Raise a light behind him now in the chat. Yep. People love this. They were so happy. Ya. A lot of people have been saying they need to watch the Predator Badlands trailer next. We could watch this. No, but Chris Anka said screw Superman and he texted me. Uh, he would never say that. He said Superman's horrible dunking on it and said, \"Let's watch the Predator Badlands trailer.\" I I have it pulled up. Barrett, I'm going to slack in the eye. Do you know anything about Predator Badlands? Uh, I'm getting it confused with Aliens Earth. Okay. Okay. Predator Badlands, I think, is the next movie by Dan Tractenberg, who is the guy that directed",
            "start": 1937.6
        },
        {
            "text": "Do you know anything about Predator Badlands? Uh, I'm getting it confused with Aliens Earth. Okay. Okay. Predator Badlands, I think, is the next movie by Dan Tractenberg, who is the guy that directed Prey. Yeah. And Portal No Escape from back when we were at IGN. But do you know anything about the movie? I do not. I think it's Earth and I think it's like way later in the future after everything's been decimated. Baron, if you could bring that up for us cuz I know nothing about this movie. Yeah. Uh the link you sent, is that a new one? Cuz the most recent ones I'm seeing are from like weeks and months ago. I want to say it was I don't It's not a Today thing. I guess like they've never watched it. I've never watched it. I'm looking at the one I sent you is 2 weeks old. Yeah, Chris just sent me the new logo. So, I don't know if there was a trailer and he just sent me an article of discussing films like the new logo popped up at Cineon. I just clearly didn't know anything about this film",
            "start": 2024.72
        },
        {
            "text": "me the new logo. So, I don't know if there was a trailer and he just sent me an article of discussing films like the new logo popped up at Cineon. I just clearly didn't know anything about this film and I I would really like to watch this trailer uh with Nick. Let's watch it. Um this is going to be a joke. This I'm seeing all the comments. This seems like uh edited footage from a bunch of different movies. It doesn't that makes more sense then. Okay. I'm like, I don't know what the [ __ ] this movie. But here's my question. You say that there's one from 4 months ago. Are they all edited? I don't think there is that. I know that I have not seen a trailer for this yet. I think it's really far off. Okay. Okay. Okay. Okay. Is Schwarzenegger in it? I don't think so. Cuz all these screen grabs have him in it and I was like, \"What the fuck?\" Yeah. All of these videos are like fake AI trailers. Yeah. Okay. Okay. Okay. Okay. Okay. Thank you very much. Then uh we can look at the logo if you",
            "start": 2065.12
        },
        {
            "text": "have him in it and I was like, \"What the fuck?\" Yeah. All of these videos are like fake AI trailers. Yeah. Okay. Okay. Okay. Okay. Okay. Thank you very much. Then uh we can look at the logo if you want. It's not as I don't care. I people like you need to watch Predator Badlands. Like, oh, okay. Well, let's see what that is and then it's not real. Okay, well, oh, we could watch the new Naked Gun trailer though. Do you want to watch that one? Yeah, sure. Let's Have you watched Liam Niss? It gave me a giggle. I'll tell you that. I watched it uh during the podcast when we were on break and I was like, this is [ __ ] got me. It got me. I miss Leslie Neielson. I'll watch I'll to end the screencast that you can thank and support and all the jazz and see if we get double takedown. We get on double secretation with YouTube fully deleted uh our stream live on air. Runner, huh? Well, tough. Wait to see it. But here you are for Twitch people, you get it. Audio people, you get it. And here's naked",
            "start": 2103.6
        },
        {
            "text": "secretation with YouTube fully deleted uh our stream live on air. Runner, huh? Well, tough. Wait to see it. But here you are for Twitch people, you get it. Audio people, you get it. And here's naked gun. We're going to get it. Multiple SWAT units responding to hostage situation. Hey, little girl, stop. What do you want, little one? your ass. That's the sound that I sound. [Music] Who are you? Frank Dreban. Police Squad. The new version. They don't make movies like this anymore. This is what we need right now. This is exactly what we need. Frank Jun. Hey, Dad. Boy, do I miss you. [Music] That's what got me. That's what got me right there. I'm in. All right. You got me. You got me again. I'm in everybody. You got me. You're back, naked guy. What a fantastic trailer. Ladies, gentlemen, and enmies, that's been another kind of funny screencast in the bank. If you saw this before we arrested by WB, thank you so much for watching andor listening. And remember, we do shows like this each and",
            "start": 2138.64
        },
        {
            "text": "that's been another kind of funny screencast in the bank. If you saw this before we arrested by WB, thank you so much for watching andor listening. And remember, we do shows like this each and every day because we're a live talk show network. We couldn't do without your support. to pick up that kind of funny membership and know that until next time, it's been our pleasure to serve you.",
            "start": 2216.08
        }
    ]
}