{
    "id": 1391,
    "video_id": "94Wrg_X-9Z0",
    "show_name": "Gameplay",
    "hosts": [
        "Colin Moriarty"
    ],
    "title": "The Evil Within - Kinda Funny Plays Through Its Backlog",
    "description": "In honor of Kinda Funny Plays Through Its Backlog week, Colin plays Evil Within.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1449248400,
    "duration": 1788,
    "transcript_chunks": [
        {
            "text": "Hey guys, Kinda Funny is having a holiday sale, that's right. If you go to KindaFunny.com/store for the next week from Black Friday until the next Friday, you can get 10% off everything in the entire store, that's all the beautiful shirts that you know and love, that's the cups, the mugs, the stickers, all of that stuff is there, and the Let's Him Host shirts are there for this week only. You need that, you need that in your life. Oh, are these all the T-Shirt Tuesday shirts that we exclusively had only on those Tuesdays? Yeah, they're back for one week only, all of them in one place. Buy them for you, buy them for your sister, your friend, your neighbor, whoever you want to buy them for, even people you don't know, it's going to be great. 10% off KindaFunny.com/store. Greetings and salutations, welcome back to Kinda Funny Games. My name is Colin Moriarty, I'm here to do a let's play that I've been wanting to do for a long time with you. It's for uh Tango Game Works uh Bethesda published game The Evil Within, and I thought",
            "start": 0.08
        },
        {
            "text": "The Evil Within - Kinda Funny Plays Through Its Backlog with Colin Moriarty. My name is Colin Moriarty, I'm here to do a let's play that I've been wanting to do for a long time with you. It's for uh Tango Gameworks, uh Bethesda published game The Evil Within and I thought that would be fun to do for a backlog week here on Kinda Funny Games because this is a game that's been in my backlog forever. Um and uh I've just not gotten a chance to do it. What I'm playing right now is uh literally the first time I played the game or sat down with it at all except for at events um I played it I think the last time at E3 2014 maybe and I couldn't read anything that was going on on the screen so couldn't play it very effectively. Uh I've been super excited about this game The Game's supposed to be great I'm a huge fan of real survival horror games and a lot of people um have been saying that this is a real survival horror game so uh let's see what I think let's see what you think if you haven't played it and uh you know you can give me your feedback in the comments as",
            "start": 42.24
        },
        {
            "text": "\"Haven't saying that this is a real survival horror game, so uh let's see what I think, let's see what you think if you haven't played it and uh you know you can give me your feedback in the comments as well. Hospital 184 copy code 3 ETA 3 minutes copy all right, sorry detectives, I know you're just coming off a case but I'm afraid we're going to have to make a detour - sounds serious is it? A riot call one out, just before I picked you up said it was multiple homicides already on scene. I like how his hair is like fluttering around even though there's like no wind. Cho all those patients that's not what happened some patients disappeared some kind of scandal still gives you the creeps doesn't it? Please respond Joseph, you think there's a connection - it's a possibility I believe the records were sealed. Anyone one respond dispatch this is Detective Castellanos in 184, what's the situation over? Is there any... oh no God, oh no Jesus Keep Your Hands on the Wheel my friend, what city is this Jior?\"",
            "start": 82.16
        },
        {
            "text": "anyone respond dispatch this is Detective Sebastian Castellanos in 184, what's the situation over? Is there any... oh no God, oh no Jesus. Keep Your Hands on the Wheel, my friend. What city is this, detective K? Any nothing yet; I'm sure we'll know everything once we get there. Those look like almost like New York plates, I guess, but not really. All right, here we are. What do you make of it, Connelly? Contact dispatch and let them know what's happening. Joseph Keenan, you're with me; we're going to have a look around. Roger that. You don't seem to be much of a hustler, considering it's raining. I mean, doesn't seem a very comfortable situation to be in. All right, I got control. This looks like a totally normal kind of place that you want to be in. Can you run X? Doesn't do it; R-L no. Looks like this is fast. Buttons don't do anything yet. All right, so I guess I'm just running up to the... uh, I don't want to get wet. I want to just go in here. Can't do it. Smells like blood. All right, stay sharp. What does blood smell like?",
            "start": 143.32
        },
        {
            "text": "do anything yet all right so I guess I'm just running up to the uh I don't want to get dry I want to just go in here can't do it smells like blood all right stay sharp what does blood smell like I guess I don't even know they would know though oh my God all right there a straight up massacre here don't let anyone else through this door I can be an extra set of eyes we don't know what's happening here you're a backup okay not looking too good walk up to here and see what we can doesn't tell me anything did you hear something I'm just like walking on the bodies oh pardon me oh excuse me damn what the hell happened around here it's kind of crazy nice little touches here I like the blood dripping off this guy's arm pretty cool are you injured what happened here can't be real impossible Ryu is I've got him the security cameras might tell us something they might it's true check it out whoa yikes what the hell look ATO oh never mind oh I'm feeling the vibe of this game so far I'm I'm",
            "start": 252.4
        },
        {
            "text": "The Evil Within - Kinda Funny Plays Through Its Backlog\nI've got him, the security cameras might tell us something, they might. It's true, check it out, whoa, yikes, what the hell? Look at that, oh never mind. Oh, I'm feeling the vibe of this game so far; I'm digging it. Weird, both gory and psychological. It seems like that doesn't look like a normal person to me. Oh, I can grab that knife. I think I'm thinking I'm rotating the camera supposed to be watching this happening or I just want that knife. Can I swing that way? Oh, yeah, I guess so. Nice, okay, I got you almost there. We go, cut myself down. No gun, hold on to that knife, my friend. We just try to get out of here or sneak with R1. Okay, I want to stab him in his back. I guess I can't do that. Looks just crazy, oh, oh no, he's going to kill me. I probably **** up. Oh my God, I don't think I was supposed to do that. Oh my God, no, that definitely wasn't supposed to do that. Pushing it too far. I like the cool little um death animations though. Seems like they might uh be specific for certain",
            "start": 360.96
        },
        {
            "text": "was supposed to do that, oh my God, no, that definitely wasn't supposed to do that, pushing it too far. I like the cool little um death animations though seems like they might uh be specific for certain instances nice little production uh touch all right let's try is there anything over here bodies being deposited no oh wait locked **** locked okay oh looks like there's keys I see I didn't see that before I don't know how I missed that but ordinary Keys a key ring found in the mental hospital basement these were you used long I'm going to go back to the lock door there we go open that **** up my friend get the **** out of here can we shut the door behind me it'll make me feel a little secure no okay I understand sluggish movement to create tension and not ruin the scene but it is a little Annoying that you can't move a little faster I'm sure you can later but what the **** did I **** it up again sh oh okay now he's running he's just running automatically Jesus thank God",
            "start": 557.28
        },
        {
            "text": "a little annoying that you can't move a little faster, I'm sure you can later but what the **** did I **** it up again? sh oh okay now he's running, he's just running automatically. Jesus thank God these doors are open. Oh my holy ****, oh my God, what the **** is happening in this game, it's just insane, gross! Alright, what in the **** is going on in this place? My dude got slashed in the leg with a chainsaw; he's hobbled pretty badly but he's keeping on. He's deep within the bowels of this building now. Can I get out this way? There we go. I'm really feeling this so far. Is there anything in this I need, like a gun or something? I'm sure they'll just give it to me when it's ready. Do there's probably nothing in here of any use; got to check anyway. I'm thorough, do what you want about me but I'm thorough over here. Anything interesting in here? Room just exists for no reason. Alright, where's the exit? There's a little document here; let's pick it up. Old note from sewer beside the lock: gain at",
            "start": 662.8
        },
        {
            "text": "Over here, anything interesting in here? The room just exists for no reason. All right, where's the exit? There's a little document here. Let's pick it up. Old note from the sewer beside the lock. Gain at the far end of the sewer is a ladder which would take you to the old Ward. If you could make it through there, you'd find an elevator leading outside. You'd be the one who escaped; he might be the one who survived. Okay, good enough. Interesting to know. Another door over here – like it might be locked up. Yeah, these are all just shut. All right, let's take the ladder up. It'll be a tough climb for a man with an injured leg. Hang in there, my friend. I got into this room. Yeah, another document. Okay, some exposition. Nothing too useful for me right now. My dude is like straight hobbled though. Can I pick this up? I want to add it to inventory.",
            "start": 825.8
        },
        {
            "text": "In there my friend, I got into this room. Yeah, another document okay some exposition nothing too useful for me right now man my dude is like straight hobbled though can I pick this up? I want inventory items what does my inventory look like if I press the touchpad anything guess I can't open it yet all right it's pretty game it's definitely got a nice style I mean it's not the most technically astonishing game but it's pretty cool oh god what the **** was that oh Jesus **** Christ are you kidding me? Can I get out of here better hide my God it's starting with a Metal Gear game kind of frightening come on you have to know I'm in here right oh my God this guy's a nut job should have stabbed him in the back guys roiding out Jesus Christ all right is he gone oh **** oh no no no no no no no no can I go back in here trying to use the headphones to hear like how close or far is is he coming back this way yeah it sounds like it it's hard for me to tell all right I got to I'm just going to",
            "start": 918.28
        },
        {
            "text": "No, can I go back in here trying to use the headphones to hear how close or far is he? Is he coming back this way? Yeah, it sounds like it. It's hard for me to tell. All right, I got to... I'm just going to have to go. Yeah, **** this ****. I'm out. Can't let him... I know that was another place for me to hide over here. I guess now I have to go through the room that he's in. Where is he? This is starting to be a little frightening. Is there like anything hidden in here? Am I just going to get in and see? Oh Jesus, oh my god, oh no, oh man. All right, so you have to get in there to count the next... the next death. I thought I was going to have to sneak around. Jeez, I already died twice. Lord doesn't bode very well for me in this game. We'll try again, see what happens. Load times aren't that bad. Is he already in the other room? All right, okay... so go, go, go, go, go, go, can't let him see me. So I'm going to need to get in here and I think that's when he busts... that's like the trigger for him to bust that **** down.",
            "start": 1097.96
        },
        {
            "text": "\"Alright, okay so let's go, let's go, let's go, can't let him see me, so I'm going to need to get in here and I think that's when he busts the trigger for him to bust through that door down. We'll see, he's coming this way, there he goes. Alright, so he busted through the boxes, does he come this way now? Jesus, alright relax buddy, take it easy, guys got some anger issues. I'm getting out of here, this is ****, any way out of here, Jesus Christ, this is tense. I like it, I can see why people enjoy this game very much, can definitely see it. I need to get the **** out of this place, good Lord, that was scary. Alright, scary, frightening, like tense - The Evil Within definitely feels tense, reminds me a little bit of Outlast, almost just in that way you feel it. Alright, we hit a checkpoint here, anything in here? I have a bottle, I guess what can I do with this? Can I throw it or... looks like I just throw it, want to waste it? Any else in here for me? How's my...\"",
            "start": 1217.44
        },
        {
            "text": "Hit a checkpoint here, there anything in here? I have a bottle, I guess what I... what can I do with this? Can I throw it? Looks like I just throw it. Want to waste it? Anything else in here for me? Damn, how's my dude not bleeding out? Oh Jesus, is he behind me still? Oh my God, get up! Oh my God, the elevator serendipitously ready for you. This is crazy, this is cool, this is cool. Take a breather, my friend. What was... what the hell was that? Now we get a little bit of the proper intro. Now around the night, TI all right back in control. Is his leg better now? He's just walking normal. The hell is going on in this place? Right, I'm confused. This is a different character. Why is he... why is he okay now? Detective get in! Get in! Uh-oh, the whole world's going to **** Hey, where's Joseph man? I'm sorry but you never came out. I'd waited, but please settle down last night. Settle down, settle down, settle down... **** There's no going back. Some texture loading problems or something cuz the game.",
            "start": 1350.48
        },
        {
            "text": "I'm sorry but you never came out I'd waited but please settle down last night settle down settle down settle down **** there's no going back some texture loading problems or something cuz the game definitely looks uneven in these scenes sometimes looks really good sometimes doesn't yeah there definitely a lot of texture popping see it **** get damn it are we cut off from everyone everyone must be dead everyone all right back there just a few bumps we're fine fine fine fine we will be once we're far away fine a little further and we'll be fine who fine fine fine fine fine fine fine the texture po I can't I just keep focusing on it now it's bothering me holy **** look out all right maybe we should call it there I want to play more I'm going to dedicate some time before the end of the year to get through the rest of this game I hope you enjoyed it for our backlog week here on Kinda Funny Games thank you for supporting us uh as always uh new let's plays every week for you here at",
            "start": 1572.28
        },
        {
            "text": "year to get through the rest of this game I hope you enjoyed it for our Backlog Week here on Kinda Funny Games thank you for supporting us uh as always uh new let's plays every week for you here at youtube.com/KindaFunnyGames uh you guys are right about The Evil Within and I knew it was going to be a good game I was excited about I'm glad that it's as uh seems to be as good as I was hoping just been on that backlog forever it's one I have to carve off uh so we'll see you next time right here on Kinda Funny Games thank you bye",
            "start": 1753.88
        }
    ]
}