{
    "id": 1439,
    "video_id": "ImC76aJhbYk",
    "show_name": "Animated",
    "hosts": [
        "Pandamusk"
    ],
    "title": "The Shadow Boxer (Kinda Funny Animated Special)",
    "description": "Created by pandamusk:  @pandamusk\n\nSubscribe! http://www.youtube.com/subscription_c...\n\nGet the Shadow Boxer shirt! http://www.districtlines.com/83882-Scarpino-Shadow-Boxing-Assoc.-Tee-T-Shirt/kindafunny\n\nGet the Shadow Boxer Poster! https://www.districtlines.com/94568-T...\n\nThe spectacular '80s fueled adventure that is Nick Scarpino's life is finally revealed. This is based on a true story.\n\n\nWatch Pandamusk's last video \"Once upon A Tim\" https://youtu.be/k74yB2q_NZ8\n\n\n“Living Alive”\nby Danny and Tori / 2-Player Co-Op\nfeaturing Chris Dunleavy.\n\nGet the song on Bandcamp!: https://dannywiessner.bandcamp.com/track/living-alive-feat-chris-dunleavy-2\n\nGet the song on SOundCloud: https://soundcloud.com/danny-wiessner/livingalive\n\nMusic by Danny Wiessner @tuanews\n\nArt by pandamusk  @pandamusk",
    "published_at": 1450713600,
    "duration": 266,
    "transcript_chunks": [
        {
            "text": "in the you wake up to gravity each day a chance to bring you down a chance to bring you down we all have our heroes but where are they when you hit the ground you're on the ground but now you're getting back in the shadow the battle Your Shadow Boxing in the night a new fire within your eyes hard to kill that ember deep inside and now it's burning loud a new future in your sides you want that action behind the camera and Shining lights and all the lust of the crowd now you're a producer Seducer a true survivor in the fight against the darkness inside you open your eyes you look at this life we're living the sights and the sounds today is a gift we're given we're GI you're the champion the edge of the knife and the hero and the now is when you're living most a new rock producer Seducer a true survivor in the fight against the darkness inside you open your eyes you look at this life for the s in the today is a gift we're GI you're the champion",
            "start": 9.08
        },
        {
            "text": "rock producer Seducer a true survivor in the fight against the darkness inside you open your eyes you look at this life for the s in today is a gift we're GI Joe we're GI Joe you're the the champion the edge of the knife and the here and the now is when you're most most alive",
            "start": 148.84
        }
    ]
}