{
    "id": 518,
    "video_id": "oGOpcR-gMgM",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Ant-Man Trailer - The GameOverGreggy Show Ep. 58 (Pt. 1)",
    "description": "Get everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get you PC here www.ORIGINPC.com.\n\nTim Gettys reacts to the latest Marvel movie trailer.\n\nBuy our shirts! http://www.districtlines.com/kindafunny\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1421049602,
    "duration": 1782,
    "transcript_chunks": [
        {
            "text": "Heat. Heat. [Music] What's up everybody? Welcome to the Game Over Greggy Show. I'm one of your hosts, Greg Miller, alongside the producer/educer, Nick Scarpino. You going to say anything anymore? No, I couldn't remember what it was. It's too early. You have a new We finally made you a shirt. There's the produ Well, we had the shadow boxing one, but that sucked. Now you got the producer/seducer shirt. Yeah, we did. Um, how many times have you said that? 57 58 times now. And then Kevin Smith says it's cool. And then I was like, we got to get that shirt up. We got to get that shirt up. We didn't even promote it the day the shirt went live. Kind of funny.com/store. That's true. Over here, the pride of Long Island, Colin Morardi. Have to understand that I'm not anyone to trifle with. Yeah. So good. I want you to know that's prep today for the game. Thank you. I appreciate the app on Tim Getty's. Yo, you don't have to say let Tim host anymore. You host the games. Yeah. No, I'm hosting",
            "start": 0.0
        },
        {
            "text": "So good. I want you to know that's prep today for the game. Thank you. I appreciate the app on Tim Getty's. Yo, you don't have to say let Tim host anymore. You host the games. Yeah. No, I'm hosting things. It's pretty cool. Yeah. Pretty fun. Pretty. Mhm. It's not kind of kind of fun. Never going to get old. Never. Never. Ladies and gentlemen, thank you for joining us. It is if you're by the time you watch this, it'll been a full week since unless you're a Patreon guy. Thank you so much. Or Yeah. Uh but this is us recording three days. I guess more like two days and an hour into life after quitting IGN, starting a second Patreon, doing all these interviews, going on GameSpot, putting out these videos, doing the Kevin Smith podcast, having two more podcasts. [Applause] It's crazy. I remember over the weekend saying to Christine when I was working really hard on Sunday and like staying up to one in the morning, don't worry, after this it'll slow down. This week has been 99 miles an hour.",
            "start": 78.08
        },
        {
            "text": "over the weekend saying to Christine when I was working really hard on Sunday and like staying up to one in the morning, don't worry, after this it'll slow down. This week has been 99 miles an hour. Yeah, it's crazy. And I don't see any end. But it's fun though. It's so much fun. Unless we get the rhythm down of what we're doing. That'll be a different story. We'll see. You don't think so? I I think we're just going to find a rhythm and then add 10 more things. Sure. That's how we generally do it. But yeah, how's everybody holding up? Good. I'm tired, but tired. I'm excited. Yeah. Nick, how you holding up? You're riding the levels over here. Yeah. I'm still trying to get the hang of this new audio. That's what people want. Thank you for doing it. Yes. You know, I'm gonna say this, Greg. I was telling Tim this before, and I might have remarked this once or twice in private, but you know, I really have come to I guess I'm kind of like social media manager guy and uh I' I've developed an",
            "start": 121.44
        },
        {
            "text": "was telling Tim this before, and I might have remarked this once or twice in private, but you know, I really have come to I guess I'm kind of like social media manager guy and uh I' I've developed an incredible respect for that job. Yeah, it's really a straight pain in the ass. Yeah. And uh it's a lot of fun to see like people interact with yourself and how it drives numbers and stuff like that, you know, doing that and how you kind of deal with different communities and different platforms. But man, it's a much tougher job than I thought it was. It really is. Yeah. You know, and I I really uh Yeah. So, a shout out to all my social media guys out there. Um, it's a tough job. What we need to come up with, this is kind of funny in action right here, is a plan for the Patreon pages communicating to those people because historically it's always been me. And maybe this week will is not how every week will be, but there's like 186 emails in the business account. I'm trying to answer each",
            "start": 157.36
        },
        {
            "text": "to those people because historically it's always been me. And maybe this week will is not how every week will be, but there's like 186 emails in the business account. I'm trying to answer each one. All these kids are on Patreon. Last night I put up a letter on both Patreons thanking everyone for their support and apologizing for not being there cuz I'm usually every day responding to everything. But it's like this is the first time in a long time where I'm just like close the laptop and go to bed. There's things I did not get done and I will not get them done. I need to talk to all of you about two more conventions we've been invited to. Will we get to that? Who the hell knows? You know what I mean? It's just like oh my god, it just keeps coming. It's amazing. We love it. Thank you for the support. It's awesome. It's it's it is uh overwhelming in the best way possible. Exactly. Oh my god. Yeah. That's what I kept saying about uh Monday. You know, Monday went to bed at like 1:30 and I",
            "start": 203.92
        },
        {
            "text": "support. It's awesome. It's it's it is uh overwhelming in the best way possible. Exactly. Oh my god. Yeah. That's what I kept saying about uh Monday. You know, Monday went to bed at like 1:30 and I I was so tired but I didn't want to go to bed cuz I didn't want it to end. Like the day had been so amazing. Yeah. So, everybody talking to us, everybody sending us cool stuff, you know, being part of this community. Thank you so much for being part of it. Whether you're downloading podcasts, whether you're a Patreon person or you're watching them on YouTube, which by the way, it happened. Oh, yeah. You're an internet superstar. Been waiting for this my whole entire life. All you need to get was 100,000 subs. We've officially hit 100,000 subs on Kind of Funny. Thank you all so much for your support on that. It's amazing. Uh yeah, hopefully by now too, by the time you see this kind of funny.com is up and running the way we want it to. Yeah. One of the big the big concerns was I didn't this",
            "start": 240.56
        },
        {
            "text": "on that. It's amazing. Uh yeah, hopefully by now too, by the time you see this kind of funny.com is up and running the way we want it to. Yeah. One of the big the big concerns was I didn't this is another thing I didn't think through. We launched the second Patreon. We quit our jobs. Tons of people come to be part of that Patreon and they don't understand necessarily how Patreon works. So, a lot of questions about like I thought I was like, \"Oh, it's just like the game over Gregy show. You'll get it on every Friday. It'll be easy.\" So many questions which is understandable. And then it was just like it's hard to keep up with three streams of content. I was like, that's good point, too. We're on it. We're trying to fix it. Kind of funny. We'll get it there. It'll be okay. It'll be good. It'll be good. And like I The thing is we this week we're a little behind on everything because we've been doing so much. But as of right now, which by the time you hear this, it'll be a week ago, but",
            "start": 275.2
        },
        {
            "text": "be good. And like I The thing is we this week we're a little behind on everything because we've been doing so much. But as of right now, which by the time you hear this, it'll be a week ago, but as of now, it's two days late. Everything should be good. Yeah. Everything's on iTunes, right? Everything's on Patreon, right? Everything's everywhere, right? That's fun. And from now on, it should be that way because we're approved on iTunes. We're good on iTunes. We're doing really well on iTunes. So, thank you so much for that. This is great. Yeah. Sh. We're number three in comedy podcast on iTunes. We're number 13 overall. What? I got to start looking at the this podcast. There's there's just no way to get all the content. I've been wanting to make one tweet about the Kevin Smith YouTube link and the iTunes link and I just can't do it. Colin's so great at auto scheduling. Then there's something else I need to immediately talk about on Twitch and then it's just like, oh god, we're tell",
            "start": 310.0
        },
        {
            "text": "and the iTunes link and I just can't do it. Colin's so great at auto scheduling. Then there's something else I need to immediately talk about on Twitch and then it's just like, oh god, we're tell we're going to bed. It's a good life. We're excited for it. Thank you for being a part of it. Thank you for supporting us. Thank you for coming and growing alongside us. If you didn't know, ladies and gentlemen, this is the Game Over Gregie Show and the idea is simple. Each week, four, sometimes five best friends gather on this table. Each bring a random topic of conversation for your amusement. If you like that, there are a number of ways to interact with us. Number one, go to patreon.com/kindfunn. You can support us there and get the show early each and every Friday. It'll go up as an MP3 and a video for the Patreon supporters. If you don't want to give us any money, that's totally understandable. You can head over to youtube.com/kindfunny where we break up the show topic by topic, dayby",
            "start": 346.8
        },
        {
            "text": "a video for the Patreon supporters. If you don't want to give us any money, that's totally understandable. You can head over to youtube.com/kindfunny where we break up the show topic by topic, dayby day until we post the whole thing a week later on that Friday and on iTunes and podcast services around the globe. Bam. We also launch kind of funny games of course. Please go there. It's youtube.com/kindfunnygames. Support that Patreon. Kind of funny or just go to kind of funny.com and there are handy links to every Patreon, every video, every store. Yes. Also support Twitch. Colin and I do a live show there. In fact, we might be a hair late to today's show because we're recording this one in the morning and that's cool. Yeah, we're recording the Game Warggy show. Whoa. At 9:30 on Wednesday morning. That never happened. I have my Coke. I have a hot cocoa. Oh, hot cocoa. Cuz somebody's been drinking all the coffee and now we're replacing the cups. This guy. God damn, son. This is my last",
            "start": 384.4
        },
        {
            "text": "morning. That never happened. I have my Coke. I have a hot cocoa. Oh, hot cocoa. Cuz somebody's been drinking all the coffee and now we're replacing the cups. This guy. God damn, son. This is my last curry here. I got to make it count. I'll run to the store. They have the curry store right on the corner, right? Easy money's got to have third corner. Oh my god. No, they don't. Or we can go to this place. Or we can go to my favorite place in the world. Starbucks. Yeah, you're welcome to go to Starbucks for me after this. Tim, yes. What's your topic? So, Ant-Man trailer drop Paul Rudd. We could talk about it. Now we're allowed to talk about movie stuff and I'm excited about that. Paul Rudd is Ant-Man. Ant-Man is a superhero no one cares about. Right. So, now he has a movie. Yeah. Right. So, now this dropped last night while Colin was streaming Axiom Burge. It was in the Agent Carter, right? Yes. Which is getting remarkable reviews. Really? Yeah. I've seen my Twitter was blowing up with",
            "start": 422.4
        },
        {
            "text": "now this dropped last night while Colin was streaming Axiom Burge. It was in the Agent Carter, right? Yes. Which is getting remarkable reviews. Really? Yeah. I've seen my Twitter was blowing up with people like, \"Wow, this shows word of mouth.\" Yes. Like I give a [ __ ] what Alfredo thinks of Agent Carter. They dropped a teaser for this last week and this time I guess it would be two weeks ago, but uh they were saying it was coming in agent. Yeah, it was on IMDb. I saw this size teaser. It was said then they released a humansized teaser. Now this is the humansized trailer. Now if this would have dropped during normal hours, I imagine we would have done a kind of funny reaction. Yes. Exactly. Yeah. So that that's a new kind of funny pro the product that we're not doing. Instead we're going to camp on the news for a week. Yes. Yeah. kind of funny. All right, here we go. We're going to hit it. You can't You can watch it somewhere else, but now you're going to have to watch us watch it.",
            "start": 460.0
        },
        {
            "text": "to camp on the news for a week. Yes. Yeah. kind of funny. All right, here we go. We're going to hit it. You can't You can watch it somewhere else, but now you're going to have to watch us watch it. Get out of here, you goddamn be especially good for the people that are listening to the audience. Oh, yeah. Let's do the reaction. I just did. Well, I know. I like to sing for us. Oh, I see. Scott, I've been watching you for a while now. Is that Michael Douglas? It is Michael Douglas. It's the one and only. This is the game, too. Now, don't let anyone tell you that you have nothing to offer. Second chances don't come around all that often. I suggest take a really close look at it. There it is. That mar the Marvel Studios logo. Prince money. It's marvelous. We're talking about remember that. This is your chance to earn that look in your daughter's eyes to become a hero. that she already thinks you are. Oh no, it's that guy from House of Cards. Peter somebody or other Satara Evangel",
            "start": 497.2
        },
        {
            "text": "that. This is your chance to earn that look in your daughter's eyes to become a hero. that she already thinks you are. Oh no, it's that guy from House of Cards. Peter somebody or other Satara Evangel Evangelina Lily. Yeah, she's a She's some kind of like shape changer. She her face looks different all the time. The costumes looks great. [Applause] I think this is going to be [Applause] awesome. Retail is just so funny. They always have the obligatory Paul Rudd shirtless shot. He's ripped, man. He's 45. One question. Is it too late to change the name? It's cute. There you go. All right, I'll see it. I forget this this who's is not directed by Scott Alexander Wright. Yeah. No, and the expectation I mean I'm being honest. The expectation is people are going to go see this movie. Yes. I'm I'm not even trying to be like the expectation is that this is going to do it's going to do well. Yes. They're I think they're hoping for another sort of Guardians. Guardians or Iron Man where you're",
            "start": 547.92
        },
        {
            "text": "I'm not even trying to be like the expectation is that this is going to do it's going to do well. Yes. They're I think they're hoping for another sort of Guardians. Guardians or Iron Man where you're taking an obscure character from the Marvel universe. Not obscure. Ant-Man's obscure. Either it was Iron Man, but they were probably on the same Ant-Man. I'd put on the Yeah, I don't even know who the hell I I went Iron Man. I know who compared to Iron Man. He's just a little guy. Damn. Um 100,000 subs. Boom. Um yeah, I think they're trying. They're hoping to to hit lightning again. Strike Lightning. It did the exact It hit Hit Lightning again. Strike Lightning. Lightning ride. Ride lightning. No, lightning. Whatever. Anyway, chase the white dragon. Oh god. This is my life now every day. No. Um, watching it and it's the same thing as Guardians. I I beforehand didn't care and I watch I'm like that looks like fun. That looks I like the I like Paul Rudd period. Let alone being a little",
            "start": 623.84
        },
        {
            "text": "No. Um, watching it and it's the same thing as Guardians. I I beforehand didn't care and I watch I'm like that looks like fun. That looks I like the I like Paul Rudd period. Let alone being a little sarcastic there making fun of the name and stuff and then again it sounds stupid when a guy shrinks down but when then when you see him shrink down he's on the dirty floor and then he's riding a a flying ant. All right. Fly ants are weird. So I'm a big fan of little bug friends. If only I showed the kids taught me anything. It's I'm a big fan of the ants. But that's what it taught you. Yeah, it's exactly what it taught me. Not how to French kiss. No, no, not that. You already knew that. I knew all that. You were born with that knowledge. Yeah. Yeah. Yeah. But I I think this this looks cool. I like that it looks different than the other Marvel movies. I feel like 70% of that look just like them. There's a lot of computer screens and guys are talking being all ominous and [ __ ] But then the",
            "start": 665.92
        },
        {
            "text": "that it looks different than the other Marvel movies. I feel like 70% of that look just like them. There's a lot of computer screens and guys are talking being all ominous and [ __ ] But then the the effect shots look very different. Like we didn't we've never seen anything like that. That looks very Scott Pilgrim-esque like with the ant stuff. Yeah. Like the whole ant shot where he's riding the ant. Just the colors and stuff. Okay. Yeah. I thought it looked pretty video gamey. Yeah. U but not like in a cheap CG way. It just in a like feel way, which we haven't really seen in the Marvel universe. Yeah. It's usually just explosions and blue glowing things. I'd like to clear something up right now, too, for the record. Nick gets a lot of crap in the comments for checking his phone. I want to point out that he's always checking it with messages from Kevin about the audio, about the footage you're watching, because people just think he doesn't care. Colin on the other hand, he's just",
            "start": 703.68
        },
        {
            "text": "to point out that he's always checking it with messages from Kevin about the audio, about the footage you're watching, because people just think he doesn't care. Colin on the other hand, he's just texting whoever is lying [ __ ] about this. No. Yeah. I'm still trying to get used to this board. If everyone's out there listening, we'll we'll we'll make some some tweaks after this one. We'll get it for the next one. But it's distorting a little bit. We might have to go back to the big dog mics. Do you want to pause and fix it? I don't know how to fix it. It's a tech thing I got to figure out. I might have to pat it down a little bit. People I think Colin was saying before he had seen people complaining about the audio. Yeah, I think we should go back to the other mics. That's what I'm saying. I think we should learn this new thing. I don't see the problem. And I thought it it sounded fine before. Uh, it's just these mics aren't there's a lot of room tone in them. I might have to pat them",
            "start": 743.76
        },
        {
            "text": "I think we should learn this new thing. I don't see the problem. And I thought it it sounded fine before. Uh, it's just these mics aren't there's a lot of room tone in them. I might have to pat them down a little bit. If we want to pause. Sure. Miss the game over with me. Oh, so you wanted to like unpause. All right. Is that Do you think it's going to be better? I have no idea. All right. We're still working it out. I'm not giving up on these mics. People like being able to see our faces. That was the big thing. I do like that. If the quality is different than it was before with the big mics, a second to figure figure this thing out. Yeah. Why you Why are you doing this? To explain this thing. the 86 machine man over here. You're like the old Can we call it IG88? Yeah. Can we? It looks like them, right? Very similar resemblance to IG88. It does actually look You could line up 13 robots and I would not be able to pick out IG8. I think you you tweeted a a photo of a toy and said that's",
            "start": 774.56
        },
        {
            "text": "them, right? Very similar resemblance to IG88. It does actually look You could line up 13 robots and I would not be able to pick out IG8. I think you you tweeted a a photo of a toy and said that's my that's my dude. And I assumed it was IG88. And if that is ring correct, I think he looks a lot like Grim Famango in my mind. He does88. Okay. Like I guess that I would know his frame if they Yeah, he's he's like got a skinny little head like a pencil. He looks like a pencil basically with like arms and legs. Speaking of pencils, Greg Way, that Ant-Man can shrink to the size of a pencil. I think it's going to be good. I think Paul Rod's a great casting choice for this. I would have liked to have seen what Edgar Wright would have done with it, but apparently that's just not in the cards. That's really upsetting. When did he leave in the in it? Like at what point in the production? He was developing it, I believe. And I guess they got to some creative differences and they within the span of",
            "start": 811.76
        },
        {
            "text": "really upsetting. When did he leave in the in it? Like at what point in the production? He was developing it, I believe. And I guess they got to some creative differences and they within the span of a week he was off the project and I think they brought in I want to say Alexander Payne who now I have to major pain for major pain yes it was major pain major pain that's good I think it looks cool Damon Wayne is not direct because that shows that everything so far has been in New York yeah and like that type of area so it's like that gives us an excuse of why we saw absolutely nothing in that trailer unless I missed it linking to any of the previous Marvel universe at all. Yeah. So, it's like developing a whole other session. So, who do you think the reference they referenced in there is? Not I'm not talking about the after credit scene, but there has to be like I can shoot to the size of the That's crazy. That's what we used to say about the Hulk or something like that. Pton Reed, not",
            "start": 849.84
        },
        {
            "text": "I'm not talking about the after credit scene, but there has to be like I can shoot to the size of the That's crazy. That's what we used to say about the Hulk or something like that. Pton Reed, not Alexander Payne. Payton Reed. Pton Reed. Batman big. Also, I don't know if they're going to get into that. I bet at the very end, that's probably the big thing at the very very end where he's like this. He's just got a knob on his chest and he's like, I've been turning it this way. What happens if I turn it this way? You know what I mean? His voice gets bigger. He sounds like Sean Connory. That's what happens to him. You should come over to my house money. Yeah. In the Marvel universe, they've been doing a lot in the comics recently where it takes place in San Francisco. Like Iron Man moved to SF and uh Daredevil's SF. So, they're doing that. So, that's cool. I like that they're doing that also in the the movies, right? Um but what's interesting is Ant-Man was an original member of Avengers",
            "start": 888.56
        },
        {
            "text": "and uh Daredevil's SF. So, they're doing that. So, that's cool. I like that they're doing that also in the the movies, right? Um but what's interesting is Ant-Man was an original member of Avengers and he has nothing to do with Avengers in the movies, right? So, I wonder if they're going to like because Avengers got cool again. And they got back. It's like when the Justice League had booster gold in it. Like, oh, this is terrible. Can we please get Superman in there? All right, here we go. Yeah. So, so Colin, this does nothing for you. No, I'm a little confused by it because um you know, not being somewhat ignorant about comics. Uh I'm I'm happy if people are happy and excited about it, but this is this is the movie that Marvel wants to make. This is the movie. I like like just knowing what I know about Marvel and the characters just think about like half the X-Men. What about Bishop or Cable? What about like like Bishop do that. Why not? Just film rights. Marvel X-Men rights. Yeah.",
            "start": 924.88
        },
        {
            "text": "I know about Marvel and the characters just think about like half the X-Men. What about Bishop or Cable? What about like like Bishop do that. Why not? Just film rights. Marvel X-Men rights. Yeah. X-Men's all Fox. Oh, really? So, Marvel doesn't own their own No. So, what happened? I know Spider-Man was with Sony, right? Well, I'm going to slaughter this. Why don't you go ahead and tell it? No. I like I want to hear Well, now I definitely want to hear your interpretation. Oh, no. They just they were the the studio wasn't doing well, I guess, in the 90s, right? Yeah. Marvel went bankrupt. Even Yeah. Even early 2000s. Like, they had to sell. So they had they sold off the rights to all their major characters basically with the exception of I guess the biggest characters and Wolverine. X-Men. Yeah. Yeah. So they never can do X-Men again. They're never going to do No, they're not going to do X-Men. They might get Spider-Man back. Sony Sony Sony's hurting right now. Yes. They're not. So I",
            "start": 963.28
        },
        {
            "text": "Yeah. Yeah. So they never can do X-Men again. They're never going to do No, they're not going to do X-Men. They might get Spider-Man back. Sony Sony Sony's hurting right now. Yes. They're not. So I guess that that gives me a little bit of context as to why then much needed context about why they would go into the bowels of these. I I literally never heard of Ant-Man in my life. you you so like like the character I guess looks the character like looks cool the the suit looks cool but like this is this seems kind of corny to me like I I like I don't I don't know like to me this is like this is what you want to do the character I I don't know if I fully believe in giving all of these like when you start looking at what they're doing to like 2020 or whatever like some of these movies do not sound like something I want to watch at all but I respect their like Green Lantern. Yeah, that was a mistake. Uh, I thought you were going to come to the defense of Green Lantern. The movie? Yeah. No,",
            "start": 998.72
        },
        {
            "text": "like something I want to watch at all but I respect their like Green Lantern. Yeah, that was a mistake. Uh, I thought you were going to come to the defense of Green Lantern. The movie? Yeah. No, I mean, just if I was going to come to the defense of the Green Lantern movie, I would take off the mic and walk out. I would tell you all to remove your Patreon pledges. Walk right into the ocean. That would be it. Everybody's like, Greg's Greg and company has some really good Oh my god, he likes Green Lantern everybody out. Yeah. No, the character Green Lantern is awesome. Yes, they screw up the movie. But I digress. Back to this is the fact that I like the their commitment to like, no, we're going to flesh out the Marvel universe. We're not just gonna run Batman or like, you know, one character. Yeah, exactly. We're not gonna run one character into the ground. We're gonna see what happens all over the universe. Go to different places, do different things, find care, make people care about",
            "start": 1042.8
        },
        {
            "text": "Yeah, exactly. We're not gonna run one character into the ground. We're gonna see what happens all over the universe. Go to different places, do different things, find care, make people care about characters they didn't care about before cuz then of course merchandise goes up for those things that you know. Yeah. I I still think and I mean I said this and this is just my feeling is that this superhero movie thing is going to crater and you keep talking about it like the video game crash. Yeah. are just like oh like there's just there's such a thing as too much of anything and if you don't focus on the quality products that people want I mean there's going to be surprises like Guardians of the Galaxy obviously you have to take chances but when you're just when you're when you're so bold as to say like for the next five and a half years here are the movies we're releasing you have some balls and I'm really I'm really super interested financially to see where they stand at the end in",
            "start": 1079.68
        },
        {
            "text": "as to say like for the next five and a half years here are the movies we're releasing you have some balls and I'm really I'm really super interested financially to see where they stand at the end in terms of how much money they really made. I'm sure they're going to make a profit but like some of these movies are not going to make money. This movie, this movie, this movie struck me as, think about it this way. There are adult, like there are adults, right, that can go and see any movie they want and they have money and disposable income, right? But then there's there's children and young people and teenagers and their parents, whatever. It's the same thing we always talk about with Skylanders and and Disney Infinity and Amiios and stuff like eventually parents who are also going to bring their kids to see these movies because they're into comics. No matter how dark and macob some of these things are or whatever, people, you know, my nephews love this [ __ ] you know. Um, eventually my",
            "start": 1110.96
        },
        {
            "text": "kids to see these movies because they're into comics. No matter how dark and macob some of these things are or whatever, people, you know, my nephews love this [ __ ] you know. Um, eventually my my my sister said it to me with Skylander. She's like, I don't I'm not getting this Disney Infinity show. Like I already you already got all the stuff. I already got the Skylanders. And eventually like the there's just not enough time and money for all these people to give them $500 million over and over and over and over again. So I think it's different when it comes to movies though because that's it's just it's a movie. It's not like it's 12 bucks once and then you buy the DVD or whatever and the kid watches it a million. The layout of it right now, the landscape you guys are the movie dudes, correct me if I'm wrong, is like what maybe every six, seven months there's a new Marvel movie. Yeah. So, I mean, like, if you continue to have great times with those and great memories with those",
            "start": 1144.16
        },
        {
            "text": "correct me if I'm wrong, is like what maybe every six, seven months there's a new Marvel movie. Yeah. So, I mean, like, if you continue to have great times with those and great memories with those attached to them, maybe we'll say, I don't think they'll ever in the next couple years, I don't think there's any more than two years scheduled. Yeah. Right. And granted that you look at Kevin Kevin's looking at porn right now. Kevin doesn't want to know. Giant size. What do you think Ant-Man's power is? Uh, and his origin. Presumably, I was going to say presumably power is showed in the trailer you just watched. Well, presumably he can get small. Yes, you watched it happen. What do you mean presumably? I don't know. I don't know the hell was going on in that. That trailer was garbage. But the garbage. Yeah, that trailer. Michael [ __ ] Douglas. That's great. Michael Douglas, but all trailers all trailers. Catherine Zeta Jones today. All trailers are like to me are are just I'm just like I",
            "start": 1177.12
        },
        {
            "text": "garbage. Yeah, that trailer. Michael [ __ ] Douglas. That's great. Michael Douglas, but all trailers all trailers. Catherine Zeta Jones today. All trailers are like to me are are just I'm just like I don't even know what the hell I'm watching. Like it's just like, you know, I'm like, \"All right.\" Like like I just think I think I saw the whole movie there in 2 minutes. No, it's not garbage. Don't. It's I have no idea what the hell was going on. Like he sees the suit. Michael Douglas is there. There's a bunch of computer monitors. There's the dude from House of Cards. He walks in for a minute. There's this woman who I'm looking it up. There's a there's there's a shot of San Francisco coming from Marin. There's all It's like, okay, great. And then Paul Rosen, who's great. I like Paul a lot. Um, no, I have no idea. I assume he can get small and he rides an ant. Now, here's the here's now here's now here's the bigger mystery is that he's the Ant-Man, but he's riding the ant. Now, it looks",
            "start": 1214.96
        },
        {
            "text": "Um, no, I have no idea. I assume he can get small and he rides an ant. Now, here's the here's now here's now here's the bigger mystery is that he's the Ant-Man, but he's riding the ant. Now, it looks like he's riding either an ant that hasn't yet mated with the queen cuz the the ant has wings. And of course, as you know, ants lose their wings once they mate. No one does. Conversation with Colin. First ever episode. As far as I understand, male ants when they mate with the queen, like they mate, they there's some name for it. I don't remember what it is. They mate with No, there's like some they swarm or something like that. There's some name for it. And then they lose their wings and I think they die the males. Okay. Or maybe they just lose their wings. Something something of this nature. So this so and queens I think have wings too. So is this the queen ant that he's riding? And how is he so much smaller than the ant that he can get on it? So actually he's like he's almost like a",
            "start": 1256.4
        },
        {
            "text": "So this so and queens I think have wings too. So is this the queen ant that he's riding? And how is he so much smaller than the ant that he can get on it? So actually he's like he's almost like a subatomic particle at this point is I guess is what I'm saying. So there's a lot of scientific questions I know about. Every ant doesn't have wings though, right? Like the picnic ants in our house didn't start with wings on them. The m as far like there are different ants have different jobs. the scouts and the workers and the the you know the warriors and whatnot and the bees of course or another animal please. Um no I I think I think that as far as I understand anyway there's just a lot of scientific questions. If he's the ant man how is he riding an anti that question? Because they call them cowboys. They don't because they ride the cows. He's talking I'm talking about sizes though. That's a great point. But I'm talking about size of the ant. He's talking. No, they don't write cows. He's",
            "start": 1296.16
        },
        {
            "text": "cowboys. They don't because they ride the cows. He's talking I'm talking about sizes though. That's a great point. But I'm talking about size of the ant. He's talking. No, they don't write cows. He's talking as if he shaking his head. Apparently they do not write Christopher Walkin script. The Ant-Man. What do you Why do you call him the Ant-Man? He's Ant-Man. Like the people in the original Batman movie. The Batman. They're calling the ant cuz he can shrink down to the size of an ant. So he shrinks down to the size. He can control he can actually go smaller. He can actually go inside like in the go smaller, right? I don't know. I think he can go small. I think you're thinking of the limitations. I might be thinking of the atom actually. Better DC. So he gets small, but he retains his strength of his normal. No, he retains the he retains the proportional strength. Yeah. So he gets eight strong wings. So he goes This is so dumb. It's he can knock if he's this big, he can knock people",
            "start": 1339.44
        },
        {
            "text": "of his normal. No, he retains the he retains the proportional strength. Yeah. So he gets eight strong wings. So he goes This is so dumb. It's he can knock if he's this big, he can knock people out. Yeah, he he retains the strength. So it's not proportional. It's the opposite of proportional. No, cuz an ant has the can lift like a thousand. Well, this is what I'm saying. So So it's like an inverse proportion like the smaller that makes more that makes more. Anyway, the most important thing is his helmet allows him to talk to ants and control ants. Is that true? That part's real. Yes, he can actually. What a [ __ ] bag power. Now, again, most of this knowledge is from uh the Ultimate Universe, right? So, me and Kevin read all the Ultimate Comics, so we know that much. I don't I have no idea what the [ __ ] Ant-Man is in the In the Ultimate Comics, he's not a wife beater, right? That's only in the real No, he is a wife beater. That's where he's So, here's the thing. That's two different",
            "start": 1375.52
        },
        {
            "text": "what the [ __ ] Ant-Man is in the In the Ultimate Comics, he's not a wife beater, right? That's only in the real No, he is a wife beater. That's where he's So, here's the thing. That's two different characters. Yeah. So, this is Scott Lang, which is the second Ant-Man. The first one is Hank Py, which is Michael Douglas. Yeah. So, are we gonna have flashbacks of Michael Douglas beating the [ __ ] out of his wife? What kind of I doubt it. I don't think that's going on in comic books. I don't understand like what's happening. It's fiction. Um, it's just so weird to me because I I was thinking about it. He gets smaller so he becomes the ant. But I I was but but I was but I was I was He's not the ant, it's Ant-Man. But I was privy that that when he was the ant man that that the ant already has the superhuman strength. If an ant was the size of a human, an ant could just destroy this whole house. Yeah. It could just take it down like in like no problem. Like it would just take the entire",
            "start": 1418.48
        },
        {
            "text": "the superhuman strength. If an ant was the size of a human, an ant could just destroy this whole house. Yeah. It could just take it down like in like no problem. Like it would just take the entire building down. So like what? So why is he shrinking down? So he's shrinking down to become an ant with human strength. So he can like cuz he can like sneak into place. That's like the worst power. Another ant comes over to squash and kills him. I just uh there's some problems with this story. It's a representative Peter Russo. Thank you. Oh. Oh. From House, that's right. Peter Russo said, \"RP.\" So, he's yellow jacket at this, which is a bad guy. Oh, okay. Yeah. He's an interesting character. He's an interesting uhh actor cuz I watched him in the strain. And I would have really liked the strain had they just gone with his bald head, but they put him in a really weird wig. Oh, really? Yeah. Really weird. Bad bad hairpiece the whole time. And it it just kept throwing me off cuz you know he's",
            "start": 1459.4
        },
        {
            "text": "had they just gone with his bald head, but they put him in a really weird wig. Oh, really? Yeah. Really weird. Bad bad hairpiece the whole time. And it it just kept throwing me off cuz you know he's bald. Yeah. You saw him in House of Cards. There's no mistaking the fact that he's got no hair and he looks good. He's a good looking maned out, you know, addicted to, you know, and things like that. I already I think I already spoiled it just by saying RIP. Oh, now you really did. I didn't catch that the first time. You haven't seen House House of Cards, though. It's a fantastic Well, I also saw him in the movie Men, Women, and No, that's not right. Uh, this is where I leave you. This is where I leave. Jason Baitman, Jane Fonda. How was that movie? I enjoyed it. My wife did not. She read the book which that was said was really really good. Then watch the movie was like this is a really poor adaptation. See that's the whole thing though. That's like the that's the main problem with reading",
            "start": 1499.84
        },
        {
            "text": "which that was said was really really good. Then watch the movie was like this is a really poor adaptation. See that's the whole thing though. That's like the that's the main problem with reading a book and then going to see the movie. It's the movie is never going to be as good as the book because the book has as much you know get to tell you everything what's happening in their head and this that and the other. RP Harry Potter. RP spoilers for the end of book seven. Harry Potter ended. It's not the real ending. I don't know. I want I want to I'm going to tell you right now I'm going to see this film. You're going to watch. No. Remember we're all going to see movies now. Okay. cuz with all the free time we have. Yeah, we're going to watch that. Yes, Kevin, you can come too. We need someone to hold the popcorn. But, uh, you have to bring it to each of us. You have to sit in the in the row in front of us and just Don't look at us. I want you to look at us me a kernel of popcorn at a",
            "start": 1540.96
        },
        {
            "text": "to hold the popcorn. But, uh, you have to bring it to each of us. You have to sit in the in the row in front of us and just Don't look at us. I want you to look at us me a kernel of popcorn at a time. I just want to I want to like you're like you're getting the Eucharist again. And then have you just place it on the tip of my tongue and if it falls off, we have to start the whole process over again. Oh my god. Gross. If you're listening to the MP3 right now, thank God you are. It's worth a dollar just to not see that site. Uh yeah, I'm going to see it. I'm going to see it, too. Character is Wasp. Oh, is she really? Wow. So, everyone is just a bug in this universe. Bug's life. She just organically can shrink down to the size of a wasp, right? I I I do not I mean in this obviously they're [ __ ] with the continuity here and like yeah because I mean none of this makes sense because if he's with her Watts should be with Michael Douglas but she's not right. So yeah there's a whole bunch of",
            "start": 1574.56
        },
        {
            "text": "with the continuity here and like yeah because I mean none of this makes sense because if he's with her Watts should be with Michael Douglas but she's not right. So yeah there's a whole bunch of issues but I think it's fine because the movies so far have like dealt with it in a way. If you if you want to get a good good exposure to Hank Pim the Avengers Earth Mighty's Heroes series was actually good. He was the cartoon. Yeah the cartoon that's on Netflix now. Uh, I think Avengers Assembles on Netflix, but they did a season before that that was Earth's Mightiest Heroes, and it was about them coming together, which is odd because it should have been the opposite. Um, but Hank Pim's character is interesting because he's a pacifist, so he doesn't actually like to fight in in that series. I don't know how he is in the comic book, but he's like he's a scientist. He's working in like Africa to like, you know, feed people and and figure out new ways to to grow plants and [ __ ] Uh, and then",
            "start": 1621.76
        },
        {
            "text": "know how he is in the comic book, but he's like he's a scientist. He's working in like Africa to like, you know, feed people and and figure out new ways to to grow plants and [ __ ] Uh, and then in an industrial accident, he becomes the food shrinker. He makes that suit that he can he can like fix things and and go about and like help people. It's not about fighting. And then they they recruit him because because of his brain. And then he's like, \"Oh no, there's stuff happening.\" Crazy. I guess I'll get in this weird suit that can if I turn the knob this way makes me small. But if I turn the knob this way makes me the size of planet. Doesn't sound like a well-written story from what you just the dialogue you just receded. It is good. It is. It's it's good. But it's it's very it's kind of similar to what you would think of Fantastic 4's uh uh Reed character where he's sort of always he's always sort of buried in his work and kind of a little oblivious smoking hot wasp that's sitting",
            "start": 1659.44
        },
        {
            "text": "similar to what you would think of Fantastic 4's uh uh Reed character where he's sort of always he's always sort of buried in his work and kind of a little oblivious smoking hot wasp that's sitting next to him. She's like in the scantily clad outfits and trying to get his attention but he's like no science science the ant. I have to be the ant. I have to be the ant. I got to be the Scott Lang is different than that. He's he's more of like the bad boy criminal type. Like even in the beginning that you saw in jail and all that stuff. So, I'm pretty sure in the original story, and I could be wrong about this, but he steals the suit from Hank Pen becoming Ant-Man. Oh, interesting. The Ant-Man. I'll close this because I know I know we're we're in a crunch of time. We got to get back to the to the Twitch. Uh, you guys know my lifelong goal is to have someone pay me to be in a movie so I can get abs. Right. Sure. That's it. I just need to add that milestone to the Patre. I just wanted to",
            "start": 1698.08
        },
        {
            "text": "to the Twitch. Uh, you guys know my lifelong goal is to have someone pay me to be in a movie so I can get abs. Right. Sure. That's it. I just need to add that milestone to the Patre. I just wanted to reiterate that. No. No. Physically cast me in a Marvel movie so that I can I can do as the blob. Oh man, that's good. That's a That's a twist. Spoiler alert. In the Ultimate Universe, the blob takes the wasp and like bites her in half and it's extremely graphic and kills her. That's awesome. I want to see that. Well, I don't want to play that. How do they do that in the movie? Yeah, you do. You don't want to bite Evangelina Lily. Not in that way. [Music]",
            "start": 1738.8
        }
    ]
}