{
    "id": 303,
    "video_id": "EwC9QoFB81w",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Why Going To The Movies Sucks - The GameOverGreggy Show Ep. 26 (Pt. 3)",
    "description": "Full Episode Friday! Get it EARLY here! http://gameovergreggy.bandcamp.com\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1401865201,
    "duration": 1356,
    "transcript_chunks": [
        {
            "text": "Uh , time for my topic. I know it didn't make any sense, Damon. I'm sorry. Uh, Monday we had the day off here in America . It was great. America, **** yeah. And I went to the movies, saw two movies in one day. Saw that Godzilla. Yes. Saw the X- Men. Yeah, yeah. I'm, I'm with Damon. Damon sums it all perfectly. Yeah, I enjoyed that. It was, it was like the, yes. So many people are like, it's the greatest movie. Best word they say it. No, I said that. Why you say it like a tie accent? Kate and Leopold. That was a tie accent. Ty Ru . I thought you meant like T people. I was like, I definitely did not try to say it in an accent. I know you're about to. Just don't. I'm not going to do it. Okay, good. I felt the need to safety that way. I appreciate that. Thank you for doing that. Here's what I came up with though, is that we've talked a lot in our circles, one-on-one conversations about going to the movies. Yeah, yeah. I'm officially so **** over going to the movies, Greg. I'm, I'm ready for day and date. I'm sorry, go ahead. Where did you see",
            "start": 3.8
        },
        {
            "text": "a lot in our circles, one-on-one conversations about going to the movies. Yeah, yeah. I'm officially so **** over going to the movies, Greg. I'm, I'm ready for day and date. I'm sorry, go ahead. Where did you see these two movies? Saw them at the Metreon. Okay. When was the last time you went to a movie at the Kabuki theater? It's been a long time, but I had gone over the Christmas break to iPic in Seattle, which is, uh, I think a nicer version of Kabuki where you have like nice recliners, you sit, you, you buy your seats online ahead of time, you have your individual seats, they bring you popcorn for free, then they come up and they take drink orders. Free, yeah, thirsty. Yeah, smart. The drinks you got to pay for, get those drinks. That is an awesome theater, but it's just, I don't know, like, I don't know, something about the Kabuki seems out, out of the way and it's, I don't know, I don't know, it's something weird about it. Like, I'm excited for the Alamo Draft House, which is pretty much the same thing that's coming to the",
            "start": 52.76
        },
        {
            "text": "the Kabuki seems out, out of the way and it's , I don't know, I don't know, it's something weird about it. Like, I'm excited for the Alamo Draft House, which is pretty much the same thing that's coming to the mission. It'll be there, but I'm, I'm so over just going to a random movie theater and seeing a movie and having, you know, we got there and like first off, it's, you know, I had a, you're paying for parking that was like 20 bucks cuz you're downtown in San Francisco. Then we get in there and I don't, I'm not even **** validated. Can they, they do that some places? Yeah, bro, you got to get it validated. Uh, you go in the movies, you get there, you got to get early, you get there, you can't get the exact seats you want. You do get the seats you want, somebody's kicking you from behind. Strangers come and sit next to you. Uh, during Godzilla, there was this hillbilly couple at the end of it, like one, the guy had a mullet and they were like talking super loud and being annoying and I was like, ah, kids come in annoying",
            "start": 95.44
        },
        {
            "text": "you. Uh, during Godzilla, there was this hillbilly couple at the end of it, like one, the guy had a mullet and they were like talking super loud and being annoying and I was like, ah, kids come in annoying ass kids. But I think that's part of , that's part of the charm for me is **** off when, not, not all those things, but that when you don't get those things, it's awesome, right? When like it is a great movie experience, there's nothing better than that. And I also, I'm kind of the opposite, so I'm very competitive. I like, I like to get to the theater an hour ahead of time and I like to stand in that line and I count how many people from the front I am and I think to myself, I did a good thing because I'm going to get in, I'm going to get the seats I want, I'm going to lock these seats down and before I used to be non-confrontational, so when people would ask, can I sit there? I'd be like, oh, this is the worst thing. Now as I get older, I love telling people that I'm saving those seats and I love it even more",
            "start": 130.12
        },
        {
            "text": "to be non-confrontational, so when people would ask, can I sit there? I'd be like, oh, this is the worst thing. Now as I get older, I love telling people that I'm saving those seats and I love it even more when those, there are those two people that come in one minute before the previews start and they're like, is someone sitting there? And I'm like, yes, someone's sitting here. Are they really? I don't care, who cares? I was wondering, I wasn't sure. No, sometimes they are and sometimes they aren't. Is that, no, generally I only save seats for people if I absolutely need them. Like when I went and saw X-Men, Aransi was having, he had to put up the Daily Fix and so they had, they had some technical problems and they were late and this is a ridiculous story because it happened to me also that same night. We went and saw the movie at the Century Theater, which is right across from the Metreon. Yeah, which we have all been going to the Metreon for so long that we go on autopilot. I went up to the line at the Metreon",
            "start": 167.68
        },
        {
            "text": "saw the movie at the Century Theater, which is right across from the Metreon. Yeah, which we have all been going to the Metreon for so long that we go on autopilot. I went up to the line at the Metreon and was like, uh , oh wait, this is the wrong theater. Oransky is like, save my seat, I'm coming. And I'm like, get me some popcorn for saving receipt. And he goes, fine. And he goes, I've got the popcorn, we'll be in there in a second. And about 10 minutes go by. Now man, you, the popcorn is like 30 feet away from the theater. I'm like, I bet I know what happened. And I'm like, are you at the Metreon? He's like, yes. And I'm like, you're at the wrong theater. So Ransy and James and you know, Ransky and Ransky looks exactly like you would think Ransy would look like had to run. He said that's the second time he said this on the show. I love it. I had to run from the Metreon all down the street across the street with the popcorn, with the popcorn. He comes with two bags of popcorn. He goes, here you go. And and he got, they let",
            "start": 203.88
        },
        {
            "text": "the show. I love it. I had to run from the Metreon all down the street across the street with the popcorn, with the popcorn. He comes with two bags of popcorn. He goes, here you go. And and he got, they let him bring it in though. I don't, yeah, and it was weird. They don't, they don't care. It's just kids working there. Like, but we had that great, this is the thing about movie going experiences that I will miss once because movies are going to die one day. It going die is that you put all that energy into it and very often you don't get that energy back in the movie, right? It's never, it's usually these days the movie is like always just whatever. So, so but then you see a movie like it's a PG-13 movie, right? But you see a, what you think of Godzilla, by the way? I love, okay, so you see a movie like that and you're like, it's worth it, all that buildup, all that energy that went into it, I got it back tenfold and this is a great experience for me and you just won't be able to get an experience like that ever again.",
            "start": 241.56
        },
        {
            "text": "like it's worth it, all that buildup, all that energy that went into it, I got it back tenfold and this is a great experience for me and you just won't be able to get an experience like that ever again. I don't think. But Greg, for you, yeah, you are just a mile a minute, so you don't have any patience anymore for these things. You're right. I'm busy. It's, it, there had to be a day off of work for me to go see two movies. I was legit get really excited about Spider-Man. I will not see until it comes to instant. You're not Ming much with Spider-Man. It was pretty good. But this is my thing is if you released it, if movies came day and date digital, it's really good. That's a good Greg. Yeah, drew a good one there. If you, I'll take a photo and put it up and I, I'll forget actually all about that, so don't worry about that. Put a little shirt on. If you put Spider-Man day and date on digital streaming services, I would have watched it opening night here, but instead I don't and and I'll wait to rent it and I'm saying I",
            "start": 280.56
        },
        {
            "text": "put a little shirt on. If you put Spider-Man day and date on digital streaming services, I would have watched it opening night here, but instead I don't and and I'll wait to rent it and I'm saying I would have paid like what is it? It's 12, 13, 14 bucks to get a at a movie theater. Uh, it's like 11, yeah, 11 bucks maybe. I, I mean I would rent a day and date thing for $10. If you get your tickets ahead of time with the convenience fee, it's like 15 bucks right there. Yeah, yeah, that's AB, but on top of that too, it's like, and then like, you know, I don't know if you know this, I have a child, his name is Partillo. So if I'm going to go see a movie on opening Friday night, right? Like Christin, I have to sync up the fact that one of us comes home and gets the dog. God forbid I have to come all the way back here to get the dog, get back to the city to do this. It's just like, God forbid you asked me to **** walk that you hate that dog dog once in a while, you'll do it still cuz you, I know cuz I'll do it for you.",
            "start": 315.88
        },
        {
            "text": "get the dog, get back to the city to do this. It's just like, God forbid you asked me to **** walk that you hate that dog dog once in a while, you'll do it still cuz you, I know cuz I'll do it for you. You're one of those guys who's all talk. You like to act like a tough guy on the show, but you're, you're the sweetest, softest man I know. Ryan's a talk. I'm all, it's **** Co. Yes, it is **** Greg. I'm gonna one up you here. I'm gon, I'm gonna up the Annie here. Yeah, and say that I'm over movies period and I've been and I've been over movies for for several years. Even watch movies at home? No. Oh my God, I don't, I like the, I actually my girl made me watch Don Jon the other day, which was **** terrible. Uh, didn't you, you tweeted that you, you've now revoked her, she's no longer allowed to pick anything. Why was it terrible? Yeah, what, that movie sucks. Why? Cuz it paints New Jersey for the light that it should be painted. No, because it's just like, it's just a random ass super vulgar, don't want to. I, it's funny. I",
            "start": 353.0
        },
        {
            "text": "it terrible? Yeah, what, that movie sucks. Why? Cuz it paints New Jersey for the light that it should be painted. No, because it's just like, it's just a random ass super vulgar, don't want to. I, it's funny. I, I envisioned myself watching that for some reason with my father, but it was, yeah, it was like, oh no, but it had Tony Danza in it. It has, I did appreciate the inclusion of Tony Dan. I did a remark on that several times. But oh, oh hey, yeah, yeah, yeah, great actor. Thank love Tony Dan. But here's what I'm, here's what I'm going to say. So I don't watch movies anymore. Like I, I, I talked to Greg recently about this. The last movie I saw in the theater was Lincoln with me. So that was two years ago maybe. And to me it's like your problem, you, you watch that, that was a great movie. It was great. I like it and I fell asleep. But and before that, I think I saw American Reunion or whatever and then Batman. Yes, which one? The, the which one? The good one or the bad one? Batman, the best one, which was The Dark Knight Rises.",
            "start": 396.84
        },
        {
            "text": "asleep. But and before that, I think I saw American Reunion or whatever and then Batman. Yes, which one? The, the which one? The good one or the bad one? Batman, the best one, which was The Dark Knight Rises. There you go. Yeah, yes, that was the only good one of that trilogy. What you're on this, you're in that camp too? Team Bane, bro. Um, Team, uh, sane person. Yeah, team sane person. I was like, where you going? Oh, s person, that's where you were walking. But here, but here's where I'm at. So I don't watch movies, but I watch a ton of Netflix and a ton of Amazon Prime and I'm watching TV shows all the time and I, I've come to demand a really depth story and a lot, I want to get invested for a long periods of time. 90 minutes is not enough. 90 minutes is not enough to get invested in some of these stories and and I think about something like you could tell, um, Mad Men's story probably in a three-hour movie, right? You could do it like dude is an ad exec, he has a beautiful wife, cheats on his wife, marries another woman.",
            "start": 439.88
        },
        {
            "text": "about something like you could tell, um, Mad Men's story probably in a three-hour movie, right? You could do it like dude is an ad exec, he has a beautiful wife, cheats on his wife, marries another woman. Okay, like you can also has this invented history that they have to exactly, they got away from all that. It doesn't even matter anymore. Yeah, spoilers for Mad Men season. I, I like the idea of getting invested in finding something to like a movie just can't tell the same story. It can't, it cannot tell the same story. And so the great Cal, no, as as the rise of the Cal or the Reise of the cial in the last 10, 12 years, you know, has set the bar higher for multimedia storytelling. Yeah, and I go to a see a movie and I'm like, I just like, I, I really like the Bourne movies when I was younger. I really like those movies a lot and I think about them now and I'm like, those are really good. It's a tight trilogy, a tight story, but man, I would have loved a five season show of the Bourne movies, you know what I mean? Like",
            "start": 488.36
        },
        {
            "text": "a lot and I think about them now and I'm like, those are really good. It's a tight trilogy, a tight story, but man, I would have loved a five season show of the Bourne movies, you know what I mean? Like really get into the the nitty-gritty of it. Um, I'm with you on this. This is what I was talking about. So I just don't see movies anymore because I'm just like, I can't be satisfied by them. Well we, I was talk about it with, uh, and I know you'll scoff at this, but it's proving your point. So just give me a little bit of rope is the fact that I would say Smallville is the best live action interpretation of Superman in my lifetime. Pro probably ever because is great as better than Superman 4, better than Quest for Peace with John Cryer's breakout roll. No, it's just the fact that even though there's tons of shitty **** Smallville episodes, there was so much good of like defining that character and watching him grow up in quotes, you know what I mean? Like getting to know that that like a movie can't get you.",
            "start": 535.4
        },
        {
            "text": "**** Smallville episodes, there was so much good of like defining that character and watching him grow up in quotes, you know what I mean? Like getting to know that that like a movie can't get you. Watch Man of Steel and you're just like the **** who, yeah, whatever, whatever you doing it doesn't matter. I mean the only reason why I would come to movies defenses is because you're, you're pedop, you just can't get the budgets for shows that you can get with movies. Copile, I mean sorry, you're, yeah, that second one, not that first one. Um, you're not going to get X-Men Days of Future Past quality ever on TV. That's just the economics are never going to be there for it. But would you rather have Days of Future Past story in 24 episodes with 50% quality or 90 minutes of days of future? The problem is with the problem for me with TV and why it doesn't win out is because look at what's happening with Mad Men right now, right? Like they have to milk these things for so long in order to get the next thing on TV.",
            "start": 571.36
        },
        {
            "text": "problem for me with TV and why it doesn't win out is because look at what's happening with Mad Men right now, right? Like they have to milk these things for so long in order to get the next thing on TV, right? There, AMC's hurting right now. They don't know what they're going to do next. They have this, they got Turn , they have this cool, uh, is it, I, the computer in show? Yeah, Halt and Catch Fire, whatever, that looks, looks awesome. It looks pretty awesome. But um, the problem with I have Mad Men is they're forced to sort of drag these things out a little bit beyond where, beyond, thank you, drinking the bour where they should be, right? Mad Men does seven, seven or eight episodes and then we have to wait an entire year, second half of that. But that's AMC's technique, man. They've been doing that with everything they have, right? Bull, but also with Don Draper at this point, I'm like his character Arc for me should have ended, we should have come to a resolution on that by the third season. It's too long. How many",
            "start": 610.8
        },
        {
            "text": "they have, right? Bull, but also with Don Draper at this point, I'm like his character Arc for me should have ended, we should have come to a resolution on that by the third season. It's too long. How many times can you see a guy Cheo on his wife or you're like, I don't care about this character anymore. I just don't care about that's the critique of that show. I think that's where a lot of shows have to go. Look at Lost. Lost was amazing for three seasons, then it went two more seasons. But then look at Breaking Bad and like Game of Thrones so far has been impeccable. Sure, but for Every Game of Thrones , Breaking Bad, there's like 30 television shows that went way. Look at, look at How I Met Your Mother where was like season 19. Like you have the Shield, the entire episod about the wedding. You still have the Wire, you still have the Sopranos. The Wire's a great example. Wi SE went on too long. I would argue. I agree with you too, but I mean the Wire, the Wire would have gone on too long, but it got canceled. I",
            "start": 649.12
        },
        {
            "text": "the Wire, you still have the Sopranos. The Wire's a great example. Wi SE went on too long. I would argue. I agree with you too, but I mean the Wire, the Wire would have gone on too long, but it got canceled. I think they, I think they decided not. So the Wire was awesome, but, but assume, but assume what you're saying is true, but that L like the first, I would say the first two seasons the Lost were some of the best TV ever, really obsess with as the best TV ever probably. And but assume like let's just say that it was so, let's say it was three seasons total. So that's 24 epis, that's 50, that's 50, you know, 50, 60, 60, 72 episodes, something like that. So like, but let's assume they sto there, that's still 72 episodes, 44, 45 minute episodes as opposed to just a 90minut or 100 minute movie. I'm just saying in terms of caliber of Storytelling, I mean think about to me it's like I, one of my favorite shows of all time is is the Twilight Zone, which I think is **** brilliant, just absolutely brilliant show. Yeah, and you",
            "start": 684.12
        },
        {
            "text": "caliber of Storytelling, I mean think about to me it's like I, one of my favorite shows of all time is is the Twilight Zone, which I think is **** brilliant, just absolutely brilliant show. Yeah, and you know, Rod Sterling comes out, Rod Sterling comes out, you know, smoking a cigarette, talking about some ****, something crazy happens, then he comes back out, talks some more **** and it's over in 20 minutes and those are like tight little stories, but think about the nuggets they plant in your mind and then and then you know and but then you see like Ray Bradberry's writing episodes and all these brilliant sci-fi writers are writing episodes and St like that. I don't like these contained movies where it's just this 90-minute one-off thing, it takes all this time, they build it up forever, it's over before you know it, nothing to look forward two hours now they don't do. Yeah, that's the thing is like nowadays, but I, I get what you're coming from. I mean it's just my, it's just the way I look at story",
            "start": 724.6
        },
        {
            "text": "before you know it, nothing to look forward two hours now they don't do. Yeah, that's the thing is like nowadays, but I, I get what you're coming from. I mean it's just my, it's just the way I look at story time. Also, would you rather see Days of Future Past the X-Men movie or listen to Days of Future Past The Moody Blues record because that's really the question that that I really, I don't know what that second one is, but I'm intrigued if it's anything like D, it's a spoken word. So I mean the only thing is Con, let me put it in terms that I think you'll Vibe with me on, right? Okay, oh here's some vibing right in in the ter in the words of the inferior Batman movie, you either die the hero, you live long enough to see yourself become the villain and I feel like that's the problem with most TV is that they it lives long enough to see to get that law of diminishing returns, right? Where you're like, sure, I just want this to end. Like that's part of the reason why I couldn't get into Walking Dead. I've",
            "start": 761.2
        },
        {
            "text": "they it lives long enough to see to get that law of diminishing returns, right? Where you're like, sure, I just want this to end. Like that's part of the reason why I couldn't get into Walking Dead. I've talked about this, right? Cuz I feel like that show is going to go on forever. That's one of the things you love about it. Like it can go on forever. For me, I need the beginning, the middle and the resolution. That's how I like my storytelling. So I think when when it comes to the movies though is nowadays all the biggest things are like TV shows, they just last a lot longer because like X-Men is not just a standalone film. X-Men is a universe of films. The next movie is the next season. You're just getting it in a different potentially a different way like that, you know, it's going to keep going on forever. But at the same time, I want an end. I do want an end. I'm completely with you. It's like I want to know that there's a story being told and that eventually it will end. That's why I like Game of Thrones.",
            "start": 797.72
        },
        {
            "text": "but at the same time, I want an end. I do want an end. I'm completely with you. It's like I want to know that there's a story being told and that eventually it will end. That's why I like Game of Thrones. It's so awesome. There's going to be an end and I know it. So there's thought put into it. It's not like how can we just keep this thing going, right? Like even with the Beloved Fast and Furious series, that was a good impression of George R. R. Martin going, but uh, with Fast and Furious like I want an end to that. I want to know that there is someone putting thought into how this amazing series is. They weren't until they decided they need to. Oh, see you soon, Paul Walker. No, I don't mean the ending. I mean like the fact that like this one villain or whatever, did you cross yourself? I did. I only ever cross myself when when people die that I really appreciate. I always like the priest cross that I always wanted to do, which was the, yeah, like this, like the, like the like the Buddhist monk sort of like",
            "start": 831.72
        },
        {
            "text": "cross myself when when people die that I really appreciate. I always like the priest cross that I always wanted to do, which was the, yeah, like this, like the, like the like the Buddhist monk sort of like karate. No, that's not a Buddhist thing. I don't think the budist mon would cross himself might come at you with this. Wait, why is that Buddhist monk making the sign of the it was the karate. He was warming up his Buddhist monk karate. So the most important thing to me about movie theaters though is the experience of the before and after, the after where you you go, you talk about it and you're just like, what do you think? This is what I think. Oh, you catch this all that stuff and like you don't get that just sitting around no matter what you just don't. It's not I love I love digesting a movie with like five people, but there's also something about the fact that you just paid for this thing, you just all had to watch it, you weren't doing a bunch of other stuff, you're sitting here in this room, you",
            "start": 870.24
        },
        {
            "text": "like five people, but there's also something about the fact that you just paid for this thing, you just all had to watch it, you weren't doing a bunch of other stuff, you're sitting here in this room, you need to respect other people around you so you have to watch or is if we're just watching here, right? You know, oh, I'm going to go to the bathroom. Oh, I'm going to go chill. I'm going to text people. How many times you got, you got to pause your wife gets up and you're like, do you want, do you want me to pause it? No, it's okay. Are you sure you don't want me to pause it? All right, and then you pause it and then my wife, my wife always does this because we very seldomly rent movies like on Comcast. If you hit the button when you're watching normal TV, it goes back like 30 seconds. If you hit that same button when you buy something, it goes back like 15 minutes and you're like, why? Yeah, but also in addition to that, I think before the movie is so important with the trailers. Oh yeah, I think trailers are just",
            "start": 911.36
        },
        {
            "text": "when you buy something, it goes back like 15 minutes and you're like, why? Yeah, but also in addition to that, I think before the movie is so important with the trailers. Oh yeah, I think trailers are just as important as the movie is, but the problem is these days that's ruined. That's So Gone. I'm never in theater and like what is this ? What I think it is? Oh my God, it is like the internet gives you everything, gives you all the trailers. Last time the last awesome one was Chronicle. Um, Cloverfield. Cloverfield. Remember that we went and saw a movie together and you went to the bathroom to get popcorn or something and you came back and I was like trying to, it was Godzilla, it might be Godzilla, but I'm not sure and they threw the oh my god, oh that was a good one. They did a great job. But now it's like now allad time. Now the difference is like I'll be sitting there and like I'm with my friend, I'm like, oh man, it's the Ninja Turtles trailer and like I'm still excited to see now see it on the big screen. I",
            "start": 942.32
        },
        {
            "text": "allad time. Now the difference is like I'll be sitting there and like I'm with my friend, I'm like, oh man, it's the Ninja Turtles trailer and like I'm still excited to see now see it on the big screen. I toally, I totally know what you mean. I've had this trailer in my mind that I'll never get to see, but I think would be amazing if like you you go to the theater and you sit down, eat your popcorn and the lights them down and they show, they start to show the trailers and this trailer is for like it's like dark and there's this Broody music and there's you know lights up there's these two actors facing each other down and they have British accents and they're sort of circling each other and they're talking about some stuff and they're like blah blah blah I have to kill you because of this and like no no no no it can never work because of this and and then they're like okay and then it's like and they both light the lightsabers you're like oh my God new Star Wars movie that you",
            "start": 981.64
        },
        {
            "text": "of this and like no no no no it can never work because of this and and then they're like okay and then it's like and they both light the lightsabers you're like oh my God new Star Wars movie that you would never have that you would never have that surprise today. My God, I was really excited for a second. I was what that's coming how awesome would that be? Yeah, I mean can't have that anymore. There are then that's the thing this is why I hope that theaters never die even though I know they will is that uh they won't. I don't think they're going to die to die off. They'll die off. I don't know about so always be a little Art House like thing you could play movie would you rather watch like Godzilla opens would you rather watch it at home on this TV or I want to see I want to see it in something the biggest screen I could possibly see it at as long as it's not 3D and not IMAX not IM not shot in IMAX. I get you. I get you. Um, but no, I mean there are still those times where like I'll see it the",
            "start": 1016.12
        },
        {
            "text": "the biggest screen I could possibly see it at as long as it's not 3D and not IMAX not IM not shot in IMAX. I get you. I get you. Um, but no, I mean there are still those times where like I'll see it the trailer online I'm like that's really cool but like the I keep coming back to this I'm I forget what movie I was seeing I think it might have been The Dark Knight Rises but I think those that time he might be off and a trailer starts and my wife I was with my wife and she goes what is this she hadn't it and I was like I was about to say it's Man of Steel but I stopped myself and I was like just watch and she was like that looks really really good like I'm in let's go see that I'm like and it was not really really good noly it did not live up but the trailer was she talked about her dampest yeah hey my wife would that would be the thing who I was till I put on the mask time to go mobile no one cared who he was he pull so **** good I would want day day one digital and movie like I don't want",
            "start": 1054.2
        },
        {
            "text": "my wife would that would be the thing who I was till I put on the mask time to go mobile no one cared who he was he pull so **** good I would want day day one digital and movie like I don't want the movies to go away that's what I'm saying give but once that happens the movie theaters are going to slowly die they're and it it's the same thing that's happening with game stores right now right game stores are going to disappear yeah and because everything will be digital and anyone who's resisting that resist away it's going to happen and you know it'll make things cheaper and make games cheaper Blu-rays will disappear eventually too I don't know I think some a lot of theaters will go away but look at vinyl today vinyl is still a thing but that people enjoy it and vinyl is great and the sound quality on vinyls Is Awesome on always going to be some people who want to go to the theater sure but it's the same thing I think about with arcades arcad still exist but they really are like",
            "start": 1093.84
        },
        {
            "text": "sound quality on vinyls Is Awesome on always going to be some people who want to go to the theater sure but it's the same thing I think about with arcades arcad still exist but they really are like a niche kind of thing like I I like vinyl and you know have a lot of buddies that collect vinyl I don't because I just it takes up so much room but like you know to me I think it's a good thing because it will bring movie costs and prices down and then you'll be able to rent things day and day because I agree with with uh with Greg in the sense that there are certain movies that come out Godzilla is actually a good example where I'm like I probably see that I saw that garbage God Zilla movie in the theater in 1998 and please with me you know I love that song please know that the new Godzilla is world's better than I only saw I like that rap rock song oh so but you know there were movies where I would actually make you know I just hate go I I'm like Greg I **** hate the movies you know",
            "start": 1138.88
        },
        {
            "text": "is world's better than I only saw I like that rap rock song oh so but you know there were movies where I would actually make you know I just hate go I I'm like Greg I **** hate the movies you know like I like the experience I'm sitting in a theater and a quiet theater by myself or with just a few people and enjoying the movie on the big screen it's fantastic but it's never like that and you know I just I don't I don't enjoy watching with other people I don't enjoy the gasps and the laughter it's just like like I don't need like it feels like **** it feels like you know taped laughter on Golden Girls or something like I don't need that I want to be able to enjoy it on my own tour it's the opposite of tape laughter on Golden Girl it's real laughter there's people enjoying it with you the exception like to all of my bitching about movie theaters right is or was Avengers and like I love I usually go and see most superhero movies at midnight I've just been too busy this summer",
            "start": 1174.92
        },
        {
            "text": "you the exception like to all of my bitching about movie theaters right is or was Avengers and like I love I usually go and see most superhero movies at midnight I've just been too busy this summer blockbuster season and Avengers was the most electric crowd I've been in outside of a wrestling event cuz people were like freaking out but and I always tell the story of you know when we sat through the and got to the after credit scene with Thanos or whatever there was a girl in front of me who stood up SC screamed waved her arms like Kermit the Frog like she was at a at a Beatles show and I was just like damn Thanos's kind of sucks and you people are **** all in I love it awesome oh the dark side knockoff please oh my God okay read a comic every once in a while I would say I totally agree with Greg that going to the movie sucks in a regular theater situation but here in San Francisco we have Kabuki in uh in LA they have AR theaters if you can reserve your seat ahead of time if they're",
            "start": 1209.08
        },
        {
            "text": "with Greg that going to the movie sucks in a regular theater situation but here in San Francisco we have Kabuki in uh in LA they have AR theaters if you can reserve your seat ahead of time if they're serving alcohol yeah then then it's awesome see even that I don't want to drink cuz I had to pee no I I will totally drink to the movie but I also agree with Colin that the best entertainment for adults being made today is on TV unquestionably absolutely Colin's looking up something well I mean I also think that like they're not going to make movies for adults because that limits the audience I mean I think about all the time like or not all the time but on this one especially all the commercials they were showing for the theater and all these other things and like the way they they were talking to kids and **** about like graduation it was just like man that's right in high school all we **** did was go to the movies yeah Friday night go to Michael Bryan's house get a piece of pizza",
            "start": 1253.96
        },
        {
            "text": "to kids and **** about like graduation it was just like man that's right in high school all we **** did was go to the movies yeah Friday night go to Michael Bryan's house get a piece of pizza go to the movies you know Saturday probably go to the movies I think that's another thing too is like for me I grew up here in the Bay Area and well in San Francisco and I still go to the same theaters that I grew up going to in high school and stuff so there's something about I'm just like y this is this is right feel right and it's like I don't care that I'm growing up like it's still I feel like I'm surrounded yeah I loved Godzilla but the best best movie I've seen in theaters this year is The Raid 2 oh I did not see that super hard R I did not see that so good I love The Raid dude the Raid 2 is even better ah yeah you got to see it all right all right that's good topic P's got the goat over here he doesn't have the goat he's got the he's killing his toy Colin will continue to look for his",
            "start": 1295.36
        },
        {
            "text": "even better ah yeah you got to see it all right all right that's good topic P's got the goat over here he doesn't have the goat he's got the he's killing his toy Colin will continue to look for his sound bites until it's all done",
            "start": 1334.96
        }
    ]
}