{
  "id": 331,
  "video_id": "I9J9OK9oYic",
  "show_name": "The GameOverGreggy Show",
  "hosts": [
    "Greg Miller",
    "Tim Gettys",
    "Nick Scarpino",
    "Colin Moriarty",
    "Dameon Clarke",
    "Portillo"
  ],
  "title": "Borderlands' Handsome Jack, Dameon Clarke (Special Guest) - The GameOverGreggy Show Ep. 29",
  "description": "Full Episode Friday! Get it EARLY here! http://gameovergreggy.bandcamp.com\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1403852401,
  "duration": 6023,
  "transcript_chunks": [
    {
      "text": "[ Music] what's up everybody? Welcome to The GameOverGreggy Show. I'm one of your hosts, Greg Miller, alongside the producer, Seducer Nick Scarpino. Hey everyone, I'm back. Yeah, everybody missed you. A lot of people were like, \"Oh, Aisha Tyler is cool, but she's no producer.\" Let be 100% honest, she's way cooler than me, a thousand times better than day produc, way sexier, way taller. Like, I next you like a five solid 5'7\". I'm a good 5'8\". Thank you. Sun's shining and you're reaching for the after done yoga, you know, and Pilates , the Fine Art of Pilates. Pilates, the pure one, Tim Gettys. Let Tim host, let Tim host indeed. Uh, pride of Long Island, Colin, where already? Hello. Hey, how are you go Islanders? I'm good. They're not, no, that's over now. They don't have to worry about it. Are you already getting ready for gearing up? I can't wait for hockey to start again. The great thing about hockey is that it goes on for **** ever, so it's got to be starting up in a month. It does not go on longer than World Cup, as it turns out. World",
      "start": 1.07
    },
    {
      "text": "wait for hockey to start again. The great thing about hockey is that it goes on for **** ever, so it's got to be starting up in a month. It does not go on longer than World Cup, as it turns out. World cently goes on for like 19 months. Yeah, you'll have like two birthdays by the time World Cup gets started and finished and like, and then the United States still doesn't win. We're looking pretty good. Where is Canada? Why is Canada never in the World Cup? Do we even have a team? I don't know. I was surprised. Someone was like, \"No, we're Team.\" Someone like, \"Just suck.\" America's in contention, like we might do something. And I was like, \"I don't , I'll believe when I see it.\" They did win. I mean, I was at the bar and watched that game. It was very interesting. Well, they be gone, but G, let's not go into this. Sorry, continue your introduction. And the final one, a fifth guest, a fifth guest, the only one who sounds like a professional talker cuz he talks into mics all the time. Her dog in your lap? No, not my dog, my godam, Damen",
      "start": 49.36
    },
    {
      "text": "your introduction. And the final one, a fifth guest, a fifth guest, the only one who sounds like a professional talker cuz he talks into mics all the time. Her dog in your lap? No, not my dog, my godam, Damen Clark, everybody. Hello, that's a me. If you're not familiar, Handsome Jack in Borderlands. Mhm. Uh, you're in Dragon Ball Z, but who watches that? I, I think would be the right word. Dud, is that not going on? Okay, this is amazing. No, watch as we go through his resume, it's amazing. Okaying so excited for this. He actually stars in your life as you when you're not around. I'm sure he's much better looking. So watch, have you seen his hair? Look at his hair for Christ sake. Good hair, great hair. It's amazing. Good looking hair. This why we bring you. That's what the whole show is about. The whole show is about that. Yeah , we can tell you about the pants list section when everyone has to take their pants off. It's going to turn into a weird episode of Oz in here, which I'm not, I'm okay with. Listen, listen, that's the weird",
      "start": 85.04
    },
    {
      "text": "we can tell you about the pants list section when everyone has to take their pants off. It's going to turn into a weird episode of Oz in here, which I'm not, I'm okay with. Listen, listen, that's the weird crazy drinking Coke over there. So much anything can happen honest. Can I have an old fashioned? It would be closer to Orange Is the New Black than Oz though. No problem. You want one to start with him? Start with him, bartender. You want bourbon or Ry? Bourbon. Okay, good choice. I'm not wearing, not Greg, I'm not wearing Tut right now. What is Aisha Tyler said the same thing you're making fun of? I'm kind of a, it's because Ry tastes, it tastes like, can you do Manhattan or do we? No, you know what? No, old fashioned, **** it. Okay, no, no, let's do it. All right, let's do it. The more I drink the better smoother this is going to. You've been on 24, 24, Prison Break, uh, Prison Prison Break, yeah, Supernatural, uh, working on, um, why didn't you go to Smallville? You should have been on Smallville. Yeah, I'd love to do Smallville.",
      "start": 127.4
    },
    {
      "text": "going to. You've been on 24, 24, Prison Break, uh, Prison Prison Break, yeah, Supernatural, uh, working on, um, why didn't you go to Smallville? You should have been on Smallville. Yeah, I'd love to do Smallville. Yeah, it's long over. You guys had Michael Rosenbaum. We did. He sat in that very chair. He's, he's a stud. Uh, he's a cool dude. Do you know him? Uh, never met him, but I'm a bit of a fan. Um, you like, you like him though. He, he, you're not allowed to say that, Nick, so we've had to cut all of that out. I appreciate that. Michael Rosenbaum is a great dude, drives an awesome man. Yeah, he does the party man. He loves him. Ladies and gentlemen, if you didn't know, The GameOverGreggy Show is a weekly show where four, sometimes five, best friends gather around this table, each bringing a random topic of conversation to enjoy with you and each other. If you like that, there's a whole bunch of ways to get it. Every Friday, we post the full MP3 on gameovergrey.bandcamp.com for $1. If you say, uh-uh, you aren't worth the dollar, we",
      "start": 172.56
    },
    {
      "text": "you and each other. If you like that , there's a whole bunch of ways to get it. Every Friday, we post the full MP3 on gameovergrey.bandcamp.com for $1. If you say, uh-uh, you aren't worth the dollar, we agree and understand. I want that dollar. You do want the dollar. That's what you're saying. You need that dollar doll. You definitely need that dollar. Anyone needs the dollar. You've seen the facilities we have here, the dollar that P of those dollars. Uh, and then of course, if you don't want to pay for us, that's fine. Go over to youtube.com/gameovergreggy. We put up every topic one by one as videos until the whole show is posted on Friday for free. And there's also fun videos over there. I really privileged to be one of the best friends. Now guys, you made it . Thank you. You made it very much. It's you want, I don't know how it's going to pan out for me, but I'm really jazzed. Would you like to know a true story, Damen Clark? Depends on if it's a good story, not. It's a good, it's going to start in a bad place, but get to",
      "start": 220.28
    },
    {
      "text": "how it's going to pan out for me, but I'm really jazzed. Would you like to know a true story, Damen Clark? Depends on if it's a good story, not. It's a good, it's going to start in a bad place, but get to a good place. I'm in. All right, so, uh, you're going to come on the show. I'm very excited about. I'm like, great, blah, blah. I mentioned this to another friend in the industry at E3 and he goes, \"I've heard that guy's a dick in real life.\" Are you **** serious? I'm dead serious. And I'm like, and I'm like, what? No, like, no, that's going to, it's possible I've said some **** to some people. I'm like, that can't be true. Like, he's, and I'm like, wow, I hope, oh man, maybe I made a mistake and blah, blah. And then I was like, then got all defensive, but I'm like, wait, no, no, because when I booked him, he's the only guest who has ever called me. Like, you're, you're your manager, right? I talked to him about you coming on the show and then your manager gave your my number to you and you called me. You were straight up like, hey,",
      "start": 265.4
    },
    {
      "text": "has ever called me. Like, you're, you're your manager, right? I talked to him about you coming on the show and then your manager gave your my number to you and you called me. You were straight up like, hey, what's up man? Good to talk to you. Yeah, and I was like, wait, there's no way this guy is a bad guy. And then, and then since then you've been awesome on Twitter. I was like, no, I'm best friends with this guy. So I'm never talking to other guy in the industry. He doesn't know anything. **** him spreading lies. Can we, can we put that guy on blast right now? No, we cannot. Can we put him on blast? Do that. You know, we're just going to bleep it as always. That's true. Can we? No, it was secondhand information. Now we get to report back and we get to end this, this is a smear campaign. Well, even Megan at your office is like, \"I heard he's a real handful,\" which you know, I me Grand, I have been a **** nightmare this today, but I mean, hopefully in entertaining, yeah, in a fun endearing nightmarish way, like of just fun",
      "start": 302.08
    },
    {
      "text": "is like, \"I heard he's a real handful,\" which you know, I me Grand, I have been a **** nightmare this today, but I mean, hopefully in entertaining, yeah, in a fun endearing nightmarish way, like of just fun stuff. Sometimes you have nightmares and they're good. True. I don't know. Do you? I, you do that actually. Also one more plug, go to Districtlines.com/gameovergreg gy, buy all our cool shirts. A lot of you have been doing that lately. Thank you so much. Yeah, the Tim shirt is actually almost up at the shirt. I like that shirt. You should buy and look cool too. Do I get a GameOverGreggy shirt? Sure, we'll mail you one . I want you got to give me a dress. We don't, we, this is the big, the people always think we have them in the house. We don't have the house. You've seen how in this house. Yeah, Districtlines.com/gameover. They, they print them awesome that you can, you don't like that the wor who have the photo us that exist as a as a unit. I think so. Well, it's not even a real photo of us. It's different photos four really",
      "start": 339.68
    },
    {
      "text": "they print them awesome that you can, you don't like that the wor who have the photo us that exist as a as a unit. I think so. Well, it's not even a real photo of us. It's different photos four really bad photos bad together bad and it's not, it's not the Photoshop job. It's that it's we just look like dingleberries. Oh yeah, single photo a dingleberry. Oh yeah, I think it looks fine. No one wants to look like a dingle. I'm wearing an SEC shirt for some reason. Of course you are. Go Mizzou. Go Mizzou. Um, the old M izzou. What are they again? Is it, it's all right. Okay, yeah, there hit my hand. We have to do a video of us making these two people ask for the recipe. The recipe is in the first time we ever debuted the old fashion recipe. I know we'll put it in the description here. Remember the thing is, I don't think anyone could do it quite as perfectly as Colin doesn't. This is what science to this. He is saring at like a, like like a 16-year-old debutant like brushes her hair, you know, like 10 0 times to the right, 100 times",
      "start": 381.84
    },
    {
      "text": "do it quite as perfectly as Colin doesn't. This is what science to this. He is saring at like a, like like a 16-year-old debutant like brushes her hair, you know, like 100 times to the right, 100 times to the goes around so much that it starts to become a syrup like, yeah, exactly. You got to mix it. I learned that you got it's so this place hard water that I go to. I we talked about this, right? Talk with the ice and I I want to start doing that because I think it's a a more thorough way. I'm going there with Eric Cter on Friday. Eric Cter shout out everybody. Go to Polite Provisions, San Diego. We will be doing we are we doing that at Comic-Con? Yeah, yeah, yeah, we're doing that. We got a night like we do like Thursday night when nothing's going whatever cool. We'll do whatever we do. I like that. All right, is it all right? No, dude, it's delicious love. We have a lot of people to go through, a lot of topics to do, lot of topics to talk about. Let's start with Nick. Nick, we usually put you towards the end cuz usually",
      "start": 431.12
    },
    {
      "text": "all right. No, dude, it's delicious love. We have a lot of people to go through, a lot of topics to do, lot of topics to talk about. Let's start with Nick. Nick, we usually put you towards the end cuz usually you're a train Wreckless to put you towards the front. I think it's it's smarter to put me toward the front now just give my my last track record so we can just bleed the entire segment out and then was that your last was that the last you did? No, it wasn't the last one. I think there was one before that, but that was and that wasn't even your topic. It was just that you were so quick to start drawing on it. Sometimes the old brain doesn't hit the old filter before it comes out. Damen knows what I'm talking about like earlier in the show when you slander Michael Rosenbaum for Reas. I did not slander Michael Rosenbaum. I love Michael Rosenbaum, badass. Uh, so my topic it actually comes from Twitter. Remember guys, if you have cool topics like this and you guys have doing amazingly, please follow me on Twitter, Nick",
      "start": 470.6
    },
    {
      "text": "Ros Bob. I love Michael Rosenbaum, badass. Uh, so my topic it actually comes from Twitter. Remember guys, if you have cool topics like this and you guys have doing amazingly, please follow me on Twitter, Nick Scarpino. And for the love of God, leave the other Nick Scarpino alone. No, no, no, they're just, they're literally including him in the conversation now. They're like, \"Nick, what do you think of this all the time?\" Does he ever Tweet back? He does. He was like, he actually responds. He's a nice guy. Does he watch the show? You think has he ever watched one of the show? I guarantee he's watched at least like a minute of one of the shows before. Everybody tweet this Scaro, not Nick Scarpino cuz that's him. The baby's yours. Don't, don't tweeted him. He's a really nice guy. Please leave him out of this madness. Colin, you going to drink something, dude? You need a drink before we Che. I'll have a little one now. You want an old fashioned? Uh, yeah, sure. Oh, drink mean you're just like this all the time. I thought you were",
      "start": 507.48
    },
    {
      "text": "you going to drink something, dude? You need a drink before we Che. I'll have a little one now. You want an old fashioned ? Uh, yeah, sure. Oh, drink mean you're just like this all the time. I thought you were completely hammered. Oh, no, I'm hammered already produc. I woke up this morning and just threw the day away. Here's something I was thinking the other day. Yeah, a lot of people on the the, I thought you coming from my face. No, I'm not com. A lot of people on the YouTube moneyer, you know, they, they, they call their fans and their viewers and their Watchers stuff. What if we start trying to get scumbags to take off? No , no one wants to be called a scumbag. You're really har. I love scumbags. I think we should be calling them scumbag. We need to call our fans something cool like Nighthawks or like the Wolverines. Alfredo got the goats. That's where he got go on goats is greatest of all time. You got the goat herd Jo. That's really good. See my scumbags could be like that. No, no one wants to be called scumbags.",
      "start": 549.24
    },
    {
      "text": "Alfredo got the goats. That's where he got go on goats is greatest of all time. You got the goat herd Jo. That's really good. See my scumbags could be like that. No, no one wants to be called scumbags. A scumbag wear a shirt that says, you know what a scumbag is. You know the definition of AUM? I have no idea what a scumb ag is. What's the definition of a scumbag? The original scumbag was a term for a used prophylactic propyl condom used [Music] condom couldn't get that word out that didn't last very long that so on to my topic tonight which came from Twitter no not scumbags from uh Maverick Dark-Haven says that's hey Nick what would you rename the Earth if we made first contact with aliens and they said the name was already taken so if this like an AOL thing where it's like you tried to sign in to get the screen name and they're just like no right would you like Earth 294 to put it in terms that I can understand the Vulcans come to Earth they we we've hit warp capacity and they're like the human",
      "start": 593.48
    },
    {
      "text": "the screen name and they're just like no right would you like Earth 294 to put it in terms that I can understand the Vul cans come to Earth they we we've hit warp capacity and they're like the human beings we need to go say what's up to these guys and give them some tech and they come and they're like thank you so much for having us to your planet what's it called and we say well it's called planet Earth and they're like yeah I know that you guys have to we already one The Intergalactic Federation of planets already has an earth already has an earth and we want you to join and you'll get all this cool Tech stuff you guys need name are they holding like a laser gun to your head saying you got 30 seconds to figure out what because right now that's what you're asking us to do is come up with a a longterm name let our planet I I need months to figure this out I need right down it's like coming up with a name Jasper Jasper we're going to call it Jasper my mind Planet Jasper it totally",
      "start": 644.36
    },
    {
      "text": "with a a longterm name let our planet I I need months to figure this out I need right down it's like coming up with a name Jasper Jasper we're going to call it Jasper my mind Planet Jasper it totally represents everything we're about the whole land SE ratio thing j why does J the **** does that mean I actually don't hate it oh it works I actually don't hate it how does it represent land going K Planet Kevin you are now jar doesn't sound that bad this reminds me of a story I heard today at lunch about a certain voice actor's hometown being the most unimaginative name for HomeTown I'd ever heard of name ever where where did you grow up in know in a heavily wooded area well I'm going to give you the clues and you come up with the name I already know the answer so everybody else know the answer okay so I'm I grew up in a land that is heavily wooded Woodland yeah yeah talking ass on the end of it yeah you're right now that and so so Greg picked up guess what their job was there oh that's",
      "start": 680.2
    },
    {
      "text": "okay so I'm I grew up in a land that is heavily wooded Woodland yeah yeah talking ass on the end of it yeah you're right now that and so so Greg picked up guess what their job was there oh that's a good one too yeah LJ Lumberjack no **** that's awesome I'm into that I'm not saying they're the most creative people in the world but you know what it made sense and they went with it and that's where I grew up so you know what so I grew up in a place where your hometown is well his is you can't even pronounce his it's like it sounds like when you're trying to say something real when you're drunk and GL Allen Glen Allen thank you Colin uh my town my hometown truth truthly told is called Riverside and there is no River God damn it and it's not the side of anything that's so upsetting there's a lot of orange groves though so you think they would call it something like orange orange side or Orange County or something like that no it's Riverside a lot of that shit's already taken up though",
      "start": 732.36
    },
    {
      "text": "a lot of orange groves though so you think they would call it something like orange orange side or Orange County or something like that no it's Riverside a lot of that shit's already taken up though yeah but I think it's like the alien deal here they someone came we like what are you going to call some guys like Riverside why I don't know it just popped into my head you're safe with Jasper though no one's GNA don't Jasper's available congratulations um I think you guys are missing an amazing opportunity like when you know when you find a star you get to name the star after someone oh I would definitely push for Planet Nick Planet Nick because how hardcore would that be if it's like that was a thing on Nickelodeon in the9 Che yeah it was one of sweet thanks for coming thanks for coming out everybody either that or like Planet bre and Meer because that guy has not gotten enough recognition for his career that should have been your top guy from road trip bre and Meer gotten enough",
      "start": 781.76
    },
    {
      "text": "out everybody either that or like Planet bre and Meer because that guy has not gotten enough recognition for his career that should have been your top guy from road trip bre and Meer gotten enough recognition for his career drone that's that's generous yeah Greg one name I mean again and the aliens are not holding a laser to your head they're like we'll come back in a month you guys can figure it out just spit ball around some ideas right now give us your top five ideas Blue Marble GBM that's not bad it's a good acronym it's not terrible why did you have an evil laugh after cuz I like that everybody would sit there real quick and like okay good let us think and then I just blurt that out and I ruin it for everybody on the big white duck and they just and then they just n nuke the planet you're just looking at things right now and saying table you have some ideas I just no I mean besides Nick I would just be Nick it Nick that's it 100% or Scarpino would how other Scarpino is it Colin I",
      "start": 822.64
    },
    {
      "text": "just looking at things right now and saying table you have some ideas I just no I mean besides Nick I would just be Nick it Nick that's it 100% or Scarpino would how other Scarpino is it Colin I assume you have some insight into this the god are planets named after some **** Roman and Greek gods okay yeah but what happened when they ran Jasper a god they didn't run out they were all named Jasper is the name of a Labradoodle Mercury mer Mercury was the messenger of the Gods so he he's fast and Mercury goes around the song quickly so they Nam it Mercury because it had a quick orbit Mars was the the god of war and it's red and that's what they saw without so do we need to do we need to go through the Rolodex of Roman mythology sure we could do that I don't know Wonder Woman Planet Wonder Woman you guys are missing the obvious answers which is like which is you can name it Gaia or Tera which are like the other old names of Earth in Antiquity yeah but I they like it's earth like okay gu",
      "start": 870.84
    },
    {
      "text": "you guys are missing the obvious answers which is like which is you can name it Gaia or Tera which are like the other old names of Earth in Antiquity yeah but I they like it's earth like okay gu name it Gaia or terara okay you know like that I like Tera I dat a girl named Tera what about Nightwing Tera let's call it Nightwing Nightwing Planet night Cy Cindy I dated as Cindy call she was it a yend usually it started off with like a ladies and Gentlemen please welcome to the stage you could call it you could call the planet that but do we have to throw we have to throw the planet every time it comes around us do we really believe that the planet is going to like nursing school so what planet are you live on again it's really a long name super long s the other answer is we could just say we're the planet's name is Earth if you don't like it we have no interest in being party or organization see you're not negotiating this cuz Colin I love you you will mess this up you like no I don't",
      "start": 917.56
    },
    {
      "text": "we're the planet's name is Earth if you don't like it we have no interest in being party or organization see you're not negotiating this cuz Colin I love you you will mess this up you like no I don't we're not going to we will not negotiate away they'll destroy the orbit and fli us into the sun if I negotiate with them yeah that's bad they'll Death Star the **** out I would say I would say terara or Gaia that would be my answer sure oh my God what describe do I think the Russian just can you hear that you hear that thing this is can the viewing audience hear that I don't I heard it but I sounds like f veloca eating a lamb or something our old roommate Mike used to have this room and he used to talk about that all the time is that he would try to play video games or watch a movie or have a girl over and be you explain what it is no we see it's like a he's asking explain to the audience what it is oh it's a hacking noise yeah the guy's like clearing his throat down there there's a",
      "start": 967.16
    },
    {
      "text": "a girl over and be you explain what it is no we see it's like a he's asking explain to the audience what it is oh it's a hacking noise yeah the guy's like clearing his throat down there there's a bathroom like there it is 2 Ines away from where we're doing yeah the the game studios by the way are not exactly the it's not exactly NBC it's not 30 Rock up here no it's our spare bedroom he's got like TV or something like a black lung thing going on I'm not sure what's so okay I like that we invite guests real jobs actors and actress this guy is dying in the basement seriously should we call somebody you think he's okay this part for the course he's fine fine I'm going to do the right thing here by him anyway you walk over there soon you like at the mic okay what if you bought this show too discovered it this way Jasper yeah Teran NOA or terraa was it Terra it was Tera or Mana no Gia Gia Cindy no ladies and Gentlemen please welcome to the stage Cindy she's working hard for you guys show",
      "start": 1005.96
    },
    {
      "text": "discovered it this way Jasper yeah Teran NOA or terraa was it Terra it was Tera or Mana no Gia Gia Cindy no ladies and Gentlemen please welcome to the stage Cindy she's working hard for you guys show her you love her don't forget to tip she's looking for tips and tips alone guys we have an Allstar Buffet every day here at noon to one have a steak and sind the and Greg the big white duck was it the Great Blue Marble I think Colin wins this one no wait jper is a way better name Jasper Jasper wins I want I want it to be Jasper only if we specifically say Planet Jasper when you say Jasper does anybody else well I think of like unassuming a hillbilly like an old wiry hill billy man who's just in blue je the blue jeans the bib jeans that's what I'm thinking of uh overalls no no shirt got the big beard he's got the corn pip little Straw Hat he's our he's the mascot of our planet that's je dude yeah that's Jethro a Jed Jasper is like a designer dog name of some kind H up on to a dog a teacup",
      "start": 1053.4
    },
    {
      "text": "beard he's got the corn pip little Straw Hat he's our he's the mascot of our planet that's je dude yeah that's Jethro a Jed Jasper is like a designer dog name of some kind H up on to a dog a teacup Yorkie so that way when when they invade our planet they would be like Jasper please we can totally kick these guys'ass this is going to be a cake was these aliens are up to date and I won't we name our dogs oh they know talk about the planet name in general if we name it Jasper it's not it's not like I don't know Mega Death Ray there you go oh that's good Mega Death Planet mega death death St **** it let's just go death St death St yeah what about what about just something really ambiguous like like MLG you know 14 8.2 or something like that and then they don't have any idea what they're getting into when they see it on the star map and it's around you know our son and they're like what is this planet this these inhabitants we don't all the other ones in the solar system are Greek gods",
      "start": 1106.12
    },
    {
      "text": "into when they see it on the star map and it's around you know our son and they're like what is this planet this these inhabitants we don't all the other ones in the solar system are Greek gods this one's not supicious wait was was Nike Greek or Roman Roman I think so I think we should go with Nike cuz then at least like what about Nik more Mone yeah they make a ton of money verify that let's verify that real quick uh Jasper Jasper is the winner I don't know how was it the winner to you it's a great fun it's enjoyable yeah he wins so excited trying to clap I just punched everything off the dogs got me sitting far away Dam Greek oh see we can't use it then don't want to throw off everything no you can't I mean if you're going to call it something odd call it MLG 2.1 what if we just made up qu can we just call it 96.5 K K it's name it after radio station Striker that's a good Planet Striker Planet Striker Striker the problem with this I love and the aliens be like I'm not **** with",
      "start": 1158.56
    },
    {
      "text": "up qu can we just call it 96.5 K K it's name it after radio station Striker that's a good Planet Striker Planet Striker Striker the problem with this I love and the aliens be like I'm not **** with that planet I have no idea what's wrong with those people and I don't want any that the Mega Death Star stri Jaspers leave these alone we can name the moon Jasper yes and the planet can be Planet Striker the moon's Kevin Kevin Kevin jper Kev I get to name the moon if he gets to name the planet Kevin's perfect name for the moon true okay you both win yeah you're both my favorite Sons there we go perfect Damen speaking of being the guest yes what's your topic well it actually ties in quite nicely to what we're talking about right now and my query SL topic was do aliens currently live amongst us and if you believe yes can you cite some examples would you care to cite some examples now I'd like to start off with yes I do believe this is the case 100% true you're like you're not just going to",
      "start": 1204.88
    },
    {
      "text": "and if you believe yes can you cite some examples would you care to cite some examples now I'd like to start off with yes I do believe this is the case 100% true you're like you're not just going to a punch line no no no well no I'm not I 100% believe that aliens exist amongst us and they have for quite some time and I think a great example is the entire uh all the hosts of The View I think are see what I mean no I'm not **** around and then I think it's an alien do you think I'm crazy right now by say Ben do have a weird face he does have an otherworldly talent that Benedict and his whole yeah he I'm not screwing around see they call the entire view all of the view baras especially Barbara wall years you can dissect your brain just by looking at you every thought every memory youve ever had you'll just suck it into her Dam it her own you'll wake up confused and naked and sticky and you Joy beart is sucking in every memory you have are you kidding me I got to look at this picture",
      "start": 1259.92
    },
    {
      "text": "had you'll just suck it into her Dam it her own you'll wake up confused and naked and sticky and you Joy beart is sucking in every memory you have are you kidding me I got to look at this picture can is Shar and Osborne one of them no that's a different stupid she's think she she I think she's I think she's CBS talk with Aisha yeah she's on a daily likeor talk show she's not she's also on uh oh God the one with uh wow I'm really no you're thinking of fashion police she's on fashion police with Joe Rivers which Rivers is one of the funniest **** of all time K that's what you said think what'you say see I've never thought about this no she wasn't a VI mother was the vi it's never crossed my mind of the aliens being here already wait are you talking about the mother the Osborne mother are you still on the to she was on The View yeah she was for she a bunch of **** ridling kids what's her what's her name again Christ yeah we're trying to talk about aliens what do you think so it's",
      "start": 1314.68
    },
    {
      "text": "you still on the to she was on The View yeah she was for she a bunch of **** ridling kids what's her what's her name again Christ yeah we're trying to talk about aliens what do you think so it's never crossed your brain it's never crossed my mind like now that I think about it I don't think that they're here okay but I wouldn't be surprised if they were I think they're here I want them to be here and I want them to all be weener dogs and I want them to have come to this earth right now could be an alien serious like look at this thing though no look at this thing like look at him tell me that doesn't look like an alien like do you ever look at other species you're suggesting that that Portillo is from a species that made spaceships and went into space like an intelligent like like no I'm saying that's considering that there was only one that they don't have dogs on this Alien Planet well that's kind of like Falling Skies cuz there's like the aliens have have pets and you actually",
      "start": 1360.36
    },
    {
      "text": "I'm saying that's considering that there was only one that they don't have dogs on this Alien Planet well that's kind of like Falling Skies cuz there's like the aliens have have pets and you actually don't even see the real aliens until later like Portell is like Gathering intelligence right I would like to point out that I was correct gaor has never been a host of The View and in fact said on arino Hall The View can go **** themselves wait I don't know what's more what's worse that I was wrong or that she was on Arenal Hall canel again she's on again really that sucks the talk talk with Aisha Tyler that's what it is who we propelled her career Seven Degrees of Separation with we'll do the same for you my friend he need he needs our help there's no doubt about your opinion I don't think aliens already here do you think they exist yeah oh yeah big time yeah I mean it's so we do you think they've been hanging around for a bit though like watching us and stuff I'd like to think so but",
      "start": 1407.16
    },
    {
      "text": "aliens already here do you think they exist yeah oh yeah big time yeah I mean it's so we do you think they've been hanging around for a bit though like watching us and stuff I'd like to think so but I don't understand why they wouldn't have done something by now made it more of a what's up how you doing I there's the UFO stuff huh they've infil they've infiltrated us they have they've but they're not like making a big deal about it yet like what so you firmly believe this like this is something that you thought a lot about I waffle a little bit okay but I someone will pop up on my radar like a Bjork for example and I'll go come on do you know what I mean yeah I understand that where it's just so you think it's the weirdos that would be the aliens like it can't I think is a great example Al singing about it oh he's like yeah he has songs he was like hey man you know be cool aliens are people too like Starman for example you know like I don't know I what is happening downstairs today Ser",
      "start": 1450.96
    },
    {
      "text": "singing about it oh he's like yeah he has songs he was like hey man you know be cool aliens are people too like Starman for example you know like I don't know I what is happening downstairs today Ser we got to call somebody it sounds like that man is murdering another man Stand By and listen to this happen it sounds like he's strangling himself I hope like an autoerotic turn the shower off and back on I don't clear Kanye West does that too he sings about himself as an alien I don't think the song was about Bowie I think it was was about hey there's be cool to aliens yeah yeah they're hanging out and but if you really listen to the lyrics it's it's a little bit trippy oh no well everything Bowie is trippy are you sure it's not just a drug infused sort of like man I maybe I don't know but I mean look that my point is you look at that dude you look at Bjork you look at Benedict Cumberbatch and who are all very talented like hyper talented super smart like way too smart people they're they're too",
      "start": 1491.8
    },
    {
      "text": "mean look that my point is you look at that dude you look at Bjork you look at Benedict Cumberbatch and who are all very talented like hyper talented super smart like way too smart people they're they're too smart to be like people almost right that's my thinking so the answer question is would I be surprised no do I think it I don't really think so either I don't know I just thought I would throw it out there see who bit I would like to be I would like to to be because I love thinking that Men In Black the movie staring Tommy Lee Jones what's the other guy's name Will Smith I'm just seeing it pay that angered me that angered me a lot his color changed you are red his color hot in here too but man Nick loves to do that though he'll just throws something out there just to piss me off yeah I know you don't **** with Big Willie man I know that's big willly style uh and Will Smith I love that movie I I when I saw that movie I'm like that how how amazing would life be if that were real if we",
      "start": 1541.64
    },
    {
      "text": "you don't **** with Big Willie man I know that's big willly style uh and Will Smith I love that movie I I when I saw that movie I'm like that how how amazing would life be if that were real if we actually could well I don't if we just didn't know that all this cool stuff was happening around us see but I had problems with it because they kept neuralizing us I don't like my the idea of my mind being raped like that my thoughts are taken away forcibly if anyone's mind has been raped over and over and over again does does it you can't help there's no getting away see I I it's one of those weird things when you sit here and you think about Men In Black on like a critical level it's really perverse what they are really violating your personal they are it's messed up I wouldn't be happy with it but I like I would think that I would be the guy in the story that would be like the chosen one cuz I can run fast like can't run fast you can't what you know what I mean though like I had no",
      "start": 1588.96
    },
    {
      "text": "with it but I like I would think that I would be the guy in the story that would be like the chosen one cuz I can run fast like can't run fast you can't what you know what I mean though like I had no remember in Men In Black the whole reasoni the whole reason Will Smith like their prominence is he chased down that alosen one unbeliev good AR would you be Neo in The Matrix too do you think like as long as we're going for hero do I get to be Keanu Reeves in real life not personally Keanu Reeves but you're talking about being character in a movie like would you be Thor I'd be Thor I wouldn't be Neo because at the end of the day that world even if he won was still screwed up so hold on are you saying that you want to be them or that if the movie was based around this like you would be that character 100% the latter not the former yeah that second one yeah so like in Thor I would like to and I'm not saying I would be that guy but I would like to believe like when I dream and I fantasize about",
      "start": 1628.2
    },
    {
      "text": "100% the latter not the former yeah that second one yeah so like in Thor I would like to and I'm not saying I would be that guy but I would like to believe like when I dream and I fantasize about life and like Nelly Portman's like I'm looking up at the stars nothing Co I'm the one that drops down with the damn with Mjolnir and I'm like I can pick it up check this out sword out of the rock I used to think Men In Black was cool too yeah and then I thought about thing way and you gave it a critical analysis the personal did you guys watch the Men in Black anime series of course you didn't but you should have cuz it was awesome up there with Godzilla the animated series what was so awesome about it Tim it was just really good was that like a full Saturday for you back to back you watch it or goes Digimon and then it went to Men In Black and then it went to is Digimon sort of part of the Pokemon Universe it's not not at all Digimon is the worst dig not the worst I was too old for Digimon but",
      "start": 1673.64
    },
    {
      "text": "Digimon and then it went to Men In Black and then it went to is Digimon sort of part of the Pokemon Universe it's not not at all Digimon is the worst dig not the worst I was too old for Digimon but Christine and I were watching it like a few months ago which is whoa whoa whoa why you watching Digimon with my girlfriend don't worry about it yeah what want to watch it with you Greg but uh but what was so funny we were making fun of it because they have to constantly they have to constantly explain the rules of the game during the cartoon like cuz there it's a **** card battle or whatever it's a card really yeah yeah they were playing they were playing cards or whatever on talking about Yu- Gi-Oh maybe that's what I'm talking about y talking about Yu-Gi-Oh it's the same thing isn't it no no no Digimon and Yu-Gi-Oh are not the same Pokemon Yu-Gi-Oh and Digimon are the same thing right no and Star Wars game who's the guy who was the guy in the in the the show Fresh Prince of B wait what the hell",
      "start": 1718.24
    },
    {
      "text": "and Yu-Gi-Oh are not the same Pokemon Yu-Gi-Oh and Digimon are the same thing right no and Star Wars game who's the guy who was the guy in the in the the show Fresh Prince of B wait what the hell is Morgan Freeman tomag for dudes and then they made a TV show about it right when Pokemon was getting I thought that was a card game too Yu-Gi-Oh's a card game Yu-Gi-Oh's the card which is the card game where you you toss down the little ball and it like opens up and there's a thing inside of it Jumanji which one's the one I'm serious which is that we talking about Pokemon with the pokeballs no no no no no there's there's a card game with like magnetized cards you're playing playing your friend you toss a little guy down he splits open I don't know what they're talking about either I think it's like that's pass my was like my AG group like Bakugan or something yes Bakugan that's it how does he know this which one was the show that started off with where they throw the ball down and goes",
      "start": 1757.84
    },
    {
      "text": "like that's pass my was like my AG group like Bakugan or something yes Bakugan that's it how does he know this which one was the show that started off with where they throw the ball down and goes Pokemon Gotta cat what show what show was that what was the show with Sandy Duncan when she when I could be back at my hotel right now doing anything else literally anything else you could have had a salad you could have had a yoga it doesn't anger anybody else that they were ripping away your memories like we were pets we they are Pawns in their game the government's pets yeah well what are the government's pets right now no Barack Obama Don't Own Me here we go he's not neuralizing anyone shit's getting real uh no so the the uh the real answer to the question is that there's this thing I think I think it's literally called the zoo hypothesis which is that the aliens know we're here and they watch but they don't get involved because they are afraid it'll break up our revolutionary cycle um",
      "start": 1796.64
    },
    {
      "text": "I think it's literally called the zoo hypothesis which is that the aliens know we're here and they watch but they don't get involved because they are afraid it'll break up our revolutionary cycle um and so I think that that's possible but I we've talked on this show before I think if aliens were going to contact us so be to be hostile and so CU that that makes the most sense to me what about the cross DNA thing uh uh uh monkeys aliens equals us because there's a whole Missing Link thing is there still is the missing link still a part of they still have they yeah there's still a chunk missing out of the evolutionary scale and go we'll find it eventually but it it it hasn't surface so I think a solid idea and this is me watching too many documentaries but uh uh aliens come down a bunch of years ago and then they crossbreed monkeys with themselves and if you look at different areas of the world the monkeys kind of match up with yeah what would be kind of an alien crossbreed if you guys",
      "start": 1842.0
    },
    {
      "text": "years ago and then they crossbreed monkeys with themselves and if you look at different areas of the world the monkeys kind of match up with yeah what would be kind of an alien crossbreed if you guys came to Earth would you bang a monkey I'd have to be super hammered like really that's thing yeah the question of how this yeah **** horn you are so **** intelligent Spaceman that you can get here in a **** I'm pretty sure they could just inject it you know what I mean I don't think you have to **** a monkey like I think you need to say you I think you need to raise the bar of in here Intergalactic travel is tough man it's been alone for a long time want to put your penis in the first team that stumbles out of a **** what's funny is that the alien scien come here and they're like let's let's like cross synthesize these breeds and everyone all the aliens like that's great all right so we can use uh you know we have all this great technology whatever and they're like all right so",
      "start": 1885.52
    },
    {
      "text": "let's like cross synthesize these breeds and everyone all the aliens like that's great all right so we can use uh you know we have all this great technology whatever and they're like all right so we can use our technology to kind of do it you know like automatically right and they're like no that's crossing the that's too much that's like that's the physical equivalent we can't risk any of our tools being left on the planet in throwing off their evolutionary plan we have to get down there I think they've been architects in our Evolution we have to get down there to what Greg **** these monkeys you look at Greg though is it that far aap's oh Fashion oh man oh **** all right all right we really did it guys good topic I that happened and I'm I'm proud of this Con I need more you want me to make another one yeah Daddy you have to dispose of that stuff you want me to do on top you have a wedding tomorrow well I have to flight to a wedding tomorrow you one of the groomsmen I'm one of",
      "start": 1935.16
    },
    {
      "text": "to make another one yeah Daddy you have to dispose of that stuff you want me to do on top you have a wedding tomorrow well I have to flight to a wedding tomorrow you one of the groomsmen I'm one of the best men damn I'm one of best Kyle haes how many best does he have narcissistic you got to make a **** choice I made the cut so I didn't really care I was like whatever you didn't make the cut I don't want to push you cut I want Push I don't want to push it you didn't make a cut you didn't make the cut he was afraid to make the **** Choice here's let me tell you how you pick your best man this is very easy bonus who's going to throw the best bachelor party and you did that's just because you want to be everyone's best man if that's your qualifications hit me up on Twitter I'm available you got money I got the time God what if that happens what if you start getting hit up to be just and best man I would totally do it wow that's awesome I would totally be your but I I would be your",
      "start": 1989.24
    },
    {
      "text": "you got money I got the time God what if that happens what if you start getting hit up to be just and best man I would totally do it wow that's awesome I would totally be your but I I would be your best man Nick Scarpino Bachelor parties sounds like a movie plot are quite possibly like we earlier we were talking about Project X the movie yes that was supposedly based on a true story I he but there's no way the true story was the Nick Scarpino Bachelor parties cuz those things are insane it was there's been two so far we're this is a real thing these before I had my bachelor party which my brother who was just like more Nick Nick to is he dead no that was just me thinking God for letting me have a brother I thought I thought he was dead he saw him last week you bounc back from his death very quickly that's why I thought he was there we got to move D we got to move on no I love my brother he uh he's very much alive God Rest his soul he's very much alive uh he lives sorry to hear about",
      "start": 2032.56
    },
    {
      "text": "quickly that's why I thought he was there we got to move D we got to move on no I love my brother he uh he's very much alive God Rest his soul he's very much alive uh he lives sorry to hear about your unfortunate accent you haven't had yet but he threw a killer bachel the party and then I in turn because of all the things I learned from that through I was best man the next year and my friends uh wedding so I threw him a killer bachelor party and Tim was actually fortuned both of them but you didn't come to the first part I didn't oh but you had a fantastic time at the second one yes yes yeah it was great yes what do the keys do a good bachelor party you need everyone actually the most important thing is you need every single person that that comes to the bachelor party to be ride or die they have to all be there for the groom they have to all be there to have a good time you can't have any guys that are like I don't want to put any money down that I can't really do that I don't want",
      "start": 2077.2
    },
    {
      "text": "they have to all be there for the groom they have to all be there to have a good time you can't have any guys that are like I don't want to put any money down that I can't really do that I don't want to go to everyone at n the last two batch of parties I went to actually the last three were just throwing dollar it's not even I don't I'm not saying like throw thousands of dollars down I'm saying like when someone needs a drink you get the drink you know and have that mentality you go into that you're going to have a great weekend I think the second rule plan something cool and it needs to be at a at a cabana at an adult pool yeah okay CL optional clothing but what's they call it toptional important top that's what it's called that's what it's called Vegas they have so there's three Cabanas in Vegas that are toptional and if you go they're Al they're also the adult pool so you have the uh you have the advantage of not being around children if you're kind of drinking and going crazy you",
      "start": 2119.88
    },
    {
      "text": "in Vegas that are toptional and if you go they're Al they're also the adult pool so you have the uh you have the advantage of not being around children if you're kind of drinking and going crazy you don't want to be around kids so if you go to these you spend a little bit of cash and it's a little bit of cash but if you have 15 guys it's fine and you can get a cabana at a very adult oriented pool and it's super fun it's it's fun because there's no kids and you know you guys can just number three I'm going to say hang up custom t-shirts t-shirts are you need you all need to be rolling deep wearing the same shirt because then everyone like I want one of those shirts I want to be one so you're making a map that was a map that I made the first time too telling everyone again you need custom shirts for the guys and then a lotra Smalls for extra smalls so that's what you need a pool with no kids a T-shirt and uh don't be cheap yeah those are your three awesome fail safe Scarpetta or scario",
      "start": 2158.52
    },
    {
      "text": "for the guys and then a lotra Smalls for extra smalls so that's what you need a pool with no kids a T-shirt and uh don't be cheap yeah those are your three awesome fail safe Scarpetta or scario Scorpio that's your secret that's your that's your secret recipe to us that a secret for everyday life you think you thought it was awesome oh my God it was awesome apparently it works oh it works it's the Nick Gordo bachelor party sauce scar Pacha scars scarto what was you were like Scarpino and Gepetto combined equals scarpet great I really want someone to reach out to you to have them you either be the best man or just playing it just sounds like I'm telling you it sounds like a plot of a movie that like you have a service where you're the best man and you promise that like when Nick Scarpino made an innocent comment on a podcast things got out of control what I going to do H is in that movie is Kate Hudson if that gets made into a movie or Jennifer Lopez can you I'm I want I want to pay for play",
      "start": 2195.16
    },
    {
      "text": "an innocent comment on a podcast things got out of control what I going to do H is in that movie is Kate Hudson if that gets made into a movie or Jennifer Lopez can you I'm I want I want to pay for play offer right now I'll give you $1 to sign on to play me I mean how can a girl say no to that perfect bre and Meer will be in it oh bre and Myer's in it he's the guy getting married who's the that we we shout it out to today that used to work with you guys oh Andrew Garb hey Andrew Garb you're in it too goar's definitely not in my life story B can be like the Cabana boy he's like bring you knock him up in the air and you guys are going to get thrown out but Mike Tyson shows up and then Stephen Hawking rolls in he's like rolls in literally rolls in that is amazing what how do you I mean what he rolls in you went there all right it's is that is that is that a topic I this been this been a fun as side did you see Stephen Hawking on John Oliver I did no you told me about it though you were drunk",
      "start": 2249.2
    },
    {
      "text": "in you went there all right it's is that is that is that a topic I this been this been a fun as side did you see Stephen Hawking on John Oliver I did no you told me about it though you were drunk yeah yeah exactly you're telling me that in another in another universe that I'm I'm smarter than you yes and there's also another Universe where you're funny up awesome typed it in too really and it still had the delivery it had the delivery after he typed it it was like **** perfect woo I was going to do it a smart computer I was going to do it like a computer voice and I thought do it I me do do it and if it's if I'll be the judge of it if it's in poor taste we won't it I don't I don't know Family Guy ises the computer voice when they yeah but they're Family Guy you guys watch Key and Peele yes a while did you see that one with a burn victim in the comedy club where he's like dude he the guy's ripping apart everybody in the audience and he's like oh man you're super fat and you're a ****",
      "start": 2302.32
    },
    {
      "text": "a while did you see that one with a burn victim in the comedy club where he's like dude he the guy's ripping apart everybody in the audience and he's like oh man you're super fat and you're a **** you wore that dress and he looks over and there's a guy and he's like a w horrible burn victim and he's in a wheelchair and he's just **** up and he's like H oh and the guy's like then he goes it's like oh anybody else then he holds up like a mic to his throat and he goes do me do me and then finally he gets into this kit and he's like oh man you know I don't want to say anything CU I don't want you to haunt my nightmares cuz you're Freddy Krueger and he starts to cry he goes I'm sorry I thought I could handle it and the whole audience just **** turns on him and he's like ah **** that's awesome good J if you're not watching Key and Peele you should be watching key and there's a free plug for stop watching this watch Key and Peele they're on I don't think we're a conflict or you're a",
      "start": 2351.76
    },
    {
      "text": "awesome good J if you're not watching Key and Peele you should be watching key and there's a free plug for stop watching this watch Key and Peele they're on I don't think we're a conflict or you're a conflict we're always around you can find us anytime bu Key and Peele shirts on districtlines.com Key and Peele I wonder if that's a thing I hope all of a sudden there's just some random person just getting whoa who would have thought all right my topic Greg what's your topic my topic is this it's pulled from the headlines of my life today s it's like Law and Order exactly um I was Tex in this this schlub over here and he wasn't responding right away and this is I wanted to talk about texting and the downside to it cuz I think we will all agree texting is the universal Awesome form of communication it's perfected are you with me on that I am perfected can you suck a dick as far as you're concerned I'm not into it the texting is not texting is amazing okay but but continue no no no this is",
      "start": 2412.36
    },
    {
      "text": "it's perfected are you with me on that I am perfected can you suck a dick as far as you're concerned I'm not into it the texting is not texting is amazing okay but but continue no no no this is this is how we go okay so here's here's here's the couple things on the texting right there's two people in my life who and I just looked at one of them who continue to piss me off with text messages one is my mother because she cannot she never proofreads anything and when the text comes through incoherent garbage it is incoherent garbage and then when I don't respond correctly because I can't understand what the hell it says and by the way you can't correct my mother or she'll get pissed she gets pissed no matter what Miss giglia yeah mpio scario the second person in my life that pisses me off with text messages is Tim because Tim's phone doesn't get the text messages for like an hour and a half I don't want to interrupt you sometimes days sometimes days what is up with that why do you not",
      "start": 2456.08
    },
    {
      "text": "with text messages is Tim because Tim's phone doesn't get the text messages for like an hour and a half I don't want to interrupt you sometimes days sometimes days what is up with that why do you not get text M I've had the worst luck with phones my entire life I used to be poor like really poor couldn't afford phones so then I had to like mobile get yeah you got to **** like that like stupid cheap stuff and so I just got used to like phone's not working right so then now like I actually got a real phone and it still just doesn't work right but I still see it it's like oh this is how things are supposed to be so I won't get someone's text till like 3:00 a.m . the next night you're missing the humor oh by the way another amazing core tenant of the Nick Scarpino bachelor party methodology is have the group yeah oh **** you were way off they all sound like a candy bar it doesn't matter uh have the group text going oh have you done this group text are important yeah yeah I find that's",
      "start": 2500.92
    },
    {
      "text": "is have the group yeah oh **** you were way off they all sound like a candy bar it doesn't matter uh have the group text going oh have you done this group text are important yeah yeah I find that's a fe a strong female thing it's very true yeah I don't think a lot of dudes are on the group text no not true group really are you in the group text we you have a business to run I don't have that I'm like hey guys let's you're going to be you know what from now on you're going to be since he has your number you're on you our group text you're on him please here's a great moment from today's group text I know I'm serious I'm begging you Colin text me and he's like hey can we get my girlfriend some pizza and when we're talking on the group text about pizza and I'm like sure no problem then I continue to talk on the group text then for some other reason I get a notification that Colin just texted me and I go to that other text and it's off thread now about the same thing and he's like hold",
      "start": 2536.88
    },
    {
      "text": "to talk on the group text then for some other reason I get a notification that Colin just texted me and I go to that other text and it's off thread now about the same thing and he's like hold up my girlfriend doesn't need the pizza she's got leftovers and I'm like okay I didn't want to confuse the issue but at this point I already asked another question on the group text and so I read his text I go back to the group text he responds to that saying I just emailed you or I just text you off threat about this I'm like why'you go off threat to begin with it was because I went I mean I'll tell you exactly why if you want to know the **** minutia why I went off I want to know a lot of mina the minua it's because I got a couple other texts from other people while we were talking and so I went back to the message list and you were just there Greg Miller and I just clicked on it not thinking that it was everyone else um that sounds like a nightmare though well how text because like we're in",
      "start": 2577.72
    },
    {
      "text": "back to the message list and you were just there Greg Miller and I just clicked on it not thinking that it was everyone else um that sounds like a nightmare though well how text because like we're in the corporate world so we okay yeah so your dissemination of information essentially and plus there's always good to have a paper trail in case someone **** up yep okay so that's a great thing about texting in the corporate world now I'm far from the corporate world so if I've got more than three sentences I'm calling you yeah especially I'm I'm in my car constantly so I can't phone call sucks you're at your computer so you can I am and you can just **** do this all damn long but I'm in my car I'm I'm walking around and plus my eyesight's kind of going I hate to give away my age too much so I'm kind of like **** struggling a little bit with stuff they're doing the old thing call and I always make fun of you know what I mean but also I just don't logistically see how it it makes",
      "start": 2613.36
    },
    {
      "text": "so I'm kind of like **** struggling a little bit with stuff they're doing the old thing call and I always make fun of you know what I mean but also I just don't logistically see how it it makes sense TimeWise for me to say past three sentences I'm **** calling you like but think about how much there's always **** to a phone call there's always **** to a phone call before you get to the point a text messenger point point point I think conversation between guys are like and we're good you and I bullshitted around about you know I was your Uber driver when I called today we we made some jokes and some Haas and some gas but I was likeo **** sh we're coming **** picking you up do you want to you don't Pizza day but I enjoyed that conversation and I enjoyed our exchange and I'm sorry if you didn't like it so yeah earlier today Nick Nick wasn't here yet and I was I want to know when he was going to come and I was like I'm going to call him and see where he's here and I'm like",
      "start": 2658.12
    },
    {
      "text": "if you didn't like it so yeah earlier today Nick Nick wasn't here yet and I was I want to know when he was going to come and I was like I'm going to call him and see where he's here and I'm like he's going to get pissed if I call him why would I get pissed cuz you get all upset whenever I call you why didn't you just text me no I don't so then I texted you and then I was like great I wanted that conversation I would always I always the call when I'm driving especially except yeah no you can always call me I like when call yeah cuz I I prefer this calling thing cuz since I didn't have a phone for so long that could text I'm so used to calling people there's something nice about it I like conversations I like long conversations the dating thing though is weird when you texting texting texting and then people can proofread their **** and they can look stuff up and be witty and they can go oh I'm somebody that I'm really not and then you finally meet them and they're a **** bag of",
      "start": 2701.28
    },
    {
      "text": "and then people can proofread their **** and they can look stuff up and be witty and they can go oh I'm somebody that I'm really not and then you finally meet them and they're a **** bag of hammers they're just that's why you there needs to be a call in between them yeah you got to have a call in there somewhere right saying though there can be a series of texts and it's like this person is something they're not and yeah but yeah there absolutely has to be take this at face value though but I you're probably really good at texting cuz you're a witty guy I'm super witty so I would likey what's that word I'm super yeah witty witty and smart and stuff yeah yeah yeah so I think yeah yeah I I've been Le LED down a Garden Path once or twice with the texting and then I talk to the girl or meet her or what have you and she just like wow just sloth from or she **** texting the whole time that was another one oh yeah that's great uh-huh seriously that's awesome see I was actually thinking",
      "start": 2738.88
    },
    {
      "text": "her or what have you and she just like wow just sloth from or she **** texting the whole time that was another one oh yeah that's great uh-huh seriously that's awesome see I was actually thinking about this recently back in the day all my friends would text and I'd be hanging out with them and they're just texting I'm like who are you texting I'm with you your friends are with you I've always found that weird that people have this need to just like texting is an activity oh my wife hates it my wife hates that I'm constantly on the phone like doing something on my phone that Coca-Cola man there we go the pure man we should have a little cheers uh well I'm I'm going to do this one I did this on uh Up at Noon which was just a **** disaster um Monday I hear the producer of that show Monday doesn't even show up the work most of the time and if he does busy seducing if he does he's just like sleep wrecked hangover **** awful thank you for having me on the show oh my God I'm",
      "start": 2777.92
    },
    {
      "text": "show Monday doesn't even show up the work most of the time and if he does busy seducing if he does he's just like sleep wrecked hangover **** awful thank you for having me on the show oh my God I'm legitimately a fan so this is uh a a **** thrill and an honor thank you for it's great to meet you guys meet you too fun and we're we're best friends now best friend it's really really great you guys you've joined a Pantheon of best friends by the way it's not just the five what do pantheon mean lots of people it's like it's a place where all the gods go to hang out and party with disco balls it's paron I think we can say that just like every just like everyone watching just like everyone watching this video or listening to the thing you are a true scumbag you're going to make it happen but it's not you're wrong about that word it's happening scumbag I'm telling you vote right now okay # scumbag or # Wolverines what do you want to be called no you can't do that Wolverine yeah the dark",
      "start": 2817.96
    },
    {
      "text": "it's not you're wrong about that word it's happening scumbag I'm telling you vote right now okay # scumbag or # Wolverines what do you want to be called no you can't do that Wolverine yeah the dark we came up with the **** phone that's bril the hashtag Jaspers are we all scumbags or are we all Jaspers neither one of those are good what do we come up better the **** scumbag you had the goats let's be the goats Alfredo we're not stealing Alfredo we're going to steal Alfredo's thing because we do that all the time but oh man see you why don't we just call them you know fans of the show well they're friends it's like every other pod ast talk about Friends of the show Alexis has been trying to make this thing a thing that I don't want it to be a thing a thing when something's inappropriate you met Alex she tries saying in a proor and she wants that to be a thing like that's in a proor she just really trying to make it a thing no it's not going to be a thing it's like fetch in a pro I",
      "start": 2865.8
    },
    {
      "text": "you met Alex , she tries saying \"in a proor\" and she wants that to be a thing. Like, that's \"in a proor.\" She's just really trying to make it a thing. No, it's not going to be a thing. It's like \"fetch\" in a proor. I don't like that. So I used to date a girl, not date a girl, but I came close to dating a girl once that used to do that. She used to shorten everything like \"in a totes.\" I hated it. Well, it's like in hockey, like everyone, everyone has a \"y.\" That's such a strong word. So, and it's like you're instantly 12 if, if you talk like that. Dude, listen to, I like to \"cray cray.\" Like, no, you say \"cray\" on a daily basis. Do he really? Yes, I do say that. I say \"totes.\" I like \"totes.\" I like \"totes.\" I'm a fan. I like to say that. ****, czy, goat. I'm gonna quit this show. Get on with your **** life, man. Seriously, like what, what life choices led you to this? I don't know. I think about that. It's like episode 29. Think of the hours wasted. You am, all these guys are by far the smartest. Clearly you have the most going for you. You voted on that. You",
      "start": 2913.4
    },
    {
      "text": "you to this. I don't know. I think about that. It's like episode 29. Think of the hours wasted. You am, all these guys are by far the smartest. Clearly you have the most going for you. You voted on that. You weren't here. You got, you won. That's pretty in a proor to say. And you guys know you're bringing them down. And if you're a real friend, I say I should cray right now what talking. It's like after last week's episode, Tim and I were sitting there talking. It was like, it was cool to see somebody who knew the opposite of what Colin thinks cuz usually we're blank slates and I just like, you're **** full of ****. I'm going to tell you that. And not only that, she continued it when we had her on. When she came on the show, she immediately picked it up and she started dogging on your shirt, which is amazing. She's like, she's like Greg looks like he came from, she went down the line. Yeah, yeah, Greg looks like he up and starched this twice and then ironed it three times. And then she went to Dameon, who was, she was",
      "start": 2961.64
    },
    {
      "text": "like, she's like Greg looks like he came from, she went down the line. Yeah, yeah, Greg looks like he up and starched this twice and then ironed it three times. And then she went to Dameon, who was, she was like, you look like Captain Sergeant, whatever, cuz he had the military cod on it. It was funny when she said it cuz it was amazing and actually really funny. Uh, and then she went to Colin and then she told me she, I looked like I just picked up the nearest shirt that wasn't dirty off the floor and you're like, yeah, how, how did you know that? Steamed it in the shower. I steam away shower. That's my **** maneuver. And at E3, yeah, that **** works. That's why it really does. At E3, I **** up though. I had, uh, I only had two shirts left, a t-shirt that has a picture of France that says \"Losers of Both World War One World Wars one and two,\" which I was, I brought to wear to bed. I thought I'd offend someone with it. And then I had a button down and I put it in the shower and then when I was getting ready it fell",
      "start": 3003.2
    },
    {
      "text": "One World Wars one and two, which I was, I brought to wear to bed. I thought I'd offend someone with it. And then I had a button down and I put it in the shower and then when I was getting ready it fell in the shower and got all wet. So I had to wear that shirt to E3. You know, we had free shirts at, at the war room and no, like you're just living out of a van Hess. I don't have a lot of money. You got enough though. You have enough money. You have, well, that's all you know. It's all relative to pay the odd bill and get your life together. You got enough money, Jesus. We'll see. So here was the problem with texting you today though. One of the downfalls I felt is that we, we have a rapport, we're friends, but we're still in that best friend, you're one of, you're one of the scumbags. No one likes that name. You're the, he does scumbags. He's been trying to P. I mean, why not call them the, the **** heels or I mean, I don't, you can't put that on a t-shirt. Yeah, you can.",
      "start": 3039.84
    },
    {
      "text": "other scumbags. No one likes that name. You're the, he does scumbags. He's been trying to P. I mean, why not call them the, the **** heels or I mean, I don't, you can't put that on a t-shirt. Yeah, you can. ****, just go anyway. Anyway, I texted you a question about like, you know, what you wanted to eat and then if I could come pick you up and you didn't respond. Rapid fired them like within 30 seconds. You're like, why isn't he **** answering? Typing one answer and you're like already on the 13th question. Think a half an hour is an acceptable time to wait you back to me, Scarpo? First off, there was, I can show you the text log. There was 5 minutes between the text on what you wanted to eat. I'll show you right. I'll show you God. Fine, you did them. You like you chain mailed **** quick fired them. Now I know you're old so you can't see too well. Does it not look like 5:30 and 5:35? I was looking at the phone. I knew what I was doing. How did you get that up there? Swipe, swipe left. You were just staring at the",
      "start": 3088.52
    },
    {
      "text": "you're old so you can't see too well. Does it not look like 5:30 and 5:35? I was looking at the phone. I knew what I was doing. How did you get that up there? Swipe, swipe left. You were just staring at the waiting for the little the ellip to pop up that indicates this is dot dot dot. I still think that you're an impatient weirdo and then that's unreasonable. I think **** 20-minute window if you're going to text me is fine . But and this is what I'm talking about is that I don't think I was right. I understand this is what the whole thing is like we got into that weird area, the gray area of texting of what do I do here? I'm looking for immediate response but it's like I, I'm with you that text can be answered. Does your phone make noise every time a text comes in? No, I have a vibrate all the time. Okay, cuz mine's just off cuz it goes off all the time. So that's why I'll check it every popular. It's mostly you over the last **** two days. I popular. That's why I turn that **** off. It's Greg Miller.",
      "start": 3132.16
    },
    {
      "text": "cuz mine's just off cuz it goes off all the time. So that's why I'll check it every popular. It's mostly you over the last **** two days . I popular. That's why I turn that **** off. It's Greg Miller. ****, but this is my thing of like I hate being in that position of what do I do here? Well, you know, like should I wait? Should I call? I should have texted earlier. Obviously, what do I eventually called me? I know I had and then we figured that **** out. Yeah, and said I'm in the lobby drinking at the bar, come get. I just like this. I just like this. I have Greg. I'm trying to get over the **** nightmare that was up at noon today available on IGN.com Mondays a noon. Here's the problem. Here's the problem with text messaging in my, in my op, it makes it really easy. By the way, just as a quick aside, Greg's kind of a **** text messenger because he'll, he'll, you know, get , he'll text you or get into a conversation then he just gets real short and brief all of a sudden. It's like you're trying to",
      "start": 3175.68
    },
    {
      "text": "Greg's kind of a **** text messenger because he'll, he'll, you know, get, he'll text you or get into a conversation then he just gets real short and brief all of a sudden. It's like you're trying to elicit a **** conversation, try to get an answer out of him. He's like k, k, k a lot. I'm like, all right, **** you Greg. Never that. All right, so apart, apart from that, the problem, the problem with text messaging before, like when we had cell phones in the late 90s, early 2000s, when we were in high school, whatever, college, like you had to call people still, right? Like you had people numbers was like a dollar a text. Now text you were like going broke exactly. And text messaging has made people a little too familiar in my opinion. Now a lot of people are getting in touch with you and you haven't, you know, I don't mind people, you know, people from, you know, my past get in touch with me, whatever. It's just like I don't, I haven't talked to you in a long time, you're texting me. It makes it a little too easy for",
      "start": 3221.8
    },
    {
      "text": "don't mind people, you know, people from, you know, my past get in touch with me, whatever. It's just like I don't, I haven't talked to you in a long time, you're texting me. It makes it a little too easy for me to get in touch. If you had to call me and talk to me, you wouldn't, you wouldn't do it. So I'm just wondering like if it kind of has broken down that social barrier a little bit as well where I'd say **** yeah, you know, like where it's like like we could, it's great, but like if we had a phone conversation, we can refamiliarize ourselves with each other and all those things as opposed to like getting a text out of the blue from a person you haven't talked to in four years. A text out of, yeah, that, that I, I would, I wouldn't pull that text out to do that. I wouldn't go Conta. I, I've, I've had friends that, no, I, I know it's hard to believe that have like after with the rape beard, I don't know what do we do? It's a real conundrum. Sorry, go ahead. It was pre, he's just describing your facial hair, that's",
      "start": 3259.92
    },
    {
      "text": "that, no, I, I know it's hard to believe that have like after with the rape beard, I don't know what do we do? It's a real conundrum. Sorry, go ahead. It was pre, he's just describing your facial hair, that's all. Pre R beard and uh R beard. No, I've had friends that haven't talked to me in years and hit me up on Facebook messaging, like messenger, like dude, what's up? I'm in town and like I've missed it because I don't check my Facebook as much and I'm like Facebook. I'm like you still have like you can text me on my phone. They're like or call. No, see, I think there's different rules for these different things and I think Facebook is the right Avenue for that. Yeah, but I'm friends with these people. It's like if I haven't seen you in a year, you going hit me on Facebook, you're text me. Yeah, but I mean how close of a friend are you? Like good friends, like college buddies that like I haven't just seen since I moved up here and they're likey. Well, I mean that's I think that's far enough removed that Facebook is",
      "start": 3292.28
    },
    {
      "text": "of a friend are you? Like good friends, like college buddies that like I haven't just seen since I moved up here and they're likey. Well, I mean that's I think that's far enough removed that Facebook is the right Avenue because Facebook is to keep those relationships that are like, hey, you're kind of out of my life now. But no, but these are guys that I'm like I want you still to be in my life, like text me, we should text back and forth, like you know, text every. Don't the people you want to talk to already have your **** number? Yeah, I mean these guys still have my number. That's the thing . Why don't you just tell them I want to be friends, let's text every day, email dude. Well, because that with guys will eventually just turn into pictures that'll pop up during meetings and that's just bad, bad. You ever had those those friends that think it's really funny cuz they work from home and they're like dude, check this out and it's an animated gift of like the worst possible thing you could imagine in Ty.",
      "start": 3336.36
    },
    {
      "text": "had those those friends that think it's really funny cuz they work from home and they're like dude, check this out and it's an animated gift of like the worst possible thing you could imagine in Ty. Really? Tyro? Yeah, Ty does it to me all the time. Yeah, it's like when it's like when iPhones first came out and you get your friend's phone and go and put like a terrible pornographic picture on the background like when they weren't looking around their iPad. I used to do that Nate all the time. Uh, I would still do that to Nate if I could all the time. I think I accidentally once, I think it was with Ty, like one of those guys at one of his parties where I think we actually did accidentally did it to Andrew fun. That's not a good thing. Angie does not deserve. Everyone here is pretty much in their 30s, right? We, Tim is old, that's why he doesn't drink CU he's actually under. But I mean you're, you're 30 little north of. Okay, so we talked about this before too. So, uh, that whole sophomoric frat, I'm going to send",
      "start": 3370.32
    },
    {
      "text": "we, Tim is old, that's why he doesn't drink CU he's actually under. But I mean you're, you're 30 little north of. Okay, so we talked about this before too. So, uh, that whole sophomoric frat, I'm going to send you two girls in a cup during a meeting or whatever, that never goes away. No, no, yeah, no , it doesn't. That's the weird thing. You think you're going to **** hit 40 and then you'll just all of a sudden become Ward Cleaver. Uh, it's not going to happen. You'll be like this when you're 50. Good. I think that's a good. The most recent example is that the got like 10 years on you. This **** never goes away. Did you see our RoboCop remake? Wasn't that what it's called? Yes. You know, they just remade RoboCop with Michael Keaton . Andy, well, so there's a group of people on the internet that started a thing and this is not the first time this has been done so I can't credit them with this the the origination of this idea but they put it out and said, hey, we're, we're going to make our own version of RoboCop",
      "start": 3406.04
    },
    {
      "text": "this is not the first time this has been done so I can't credit them with this the the origination of this idea but they put it out and said, hey, we're, we're going to make our own version of RoboCop remake but we need your help and like uh something like 200 contributors just did they gave everyone a scene and said go do it and if you watch it it's it's different from scene to scene it's like some people went all out and were like literally got red the bud is like **** 1 0 grand yeah they they were like we're going to do this and then other people it's like his suits made out of like you know it's like whatever you could buy on the internet and then other people made like animated parts and like it just really cool people got really creative literally I mean and I probably I consider myself fairly mature yeah you're pretty solidly I talk like this sometimes Tim yeah we have to do this I don't like when you talk that way we Cann you said mature is that what I meant what was the word",
      "start": 3452.6
    },
    {
      "text": "fairly mature yeah you're pretty solidly I talk like this sometimes Tim yeah we have to do this I don't like when you talk that way we Cann you said mature is that what I meant what was the word that means that I still laugh at everything that's completely immature IM immature I am there's an I am in front of the word mature no but so truth truth phone now everyone I come in after seeing this and I'm like everyone shut up this is like what 9:30 9:45 in the morning whenever I just over and come watch this thing at my desk right now and it was the scene where RoboCop shoots the guy in the penis except in this version of it RoboCop shoots like 40 people in the penis and some of them are hanging out of their pants just going in a circle I haven't seen the movie yet so still laughing at the concept L to that act would you please so good and then the final one what what do they call the one guy comes in start at the very end totally naked with two women and it's like what a foremost rapist",
      "start": 3490.64
    },
    {
      "text": "L to that act would you please so good and then the final one what what do they call the one guy comes in start at the very end totally naked with two women and it's like what a foremost rapist or something is what it and so yeah and he's like do it do it just buck n he just blows the tip of it off it was it was one of those things that I I I can't remember laughing that hard and so long like I can't remember last time and then I came home and I'm lying in bed with with my girlfriend and we already good night good night and I'm in there and I started thinking of it and I just I she's like what is going on I'd explain it get the iPad out show it to her at like 2 : in the morning yeah I show it to my wife and she was like nope yeah I disturb me a little bit it yeah it's one of those things that you either think that is the funniest thing ever or you're like it's really funny **** up for real really funny it's a little too real I don't want no you know meop shooting my dick off so",
      "start": 3542.92
    },
    {
      "text": "that you either think that is the funniest thing ever or you're like it's really funny **** up for real really funny it's a little too real I don't want no you know meop shooting my dick off so happen to you a lot though where you just Happ constantly besides your obsession with your fenis but they you think of things randomly throughout the day and you just go yeah and you might be by yourself or there might be somebody behind you in the elevator and you're just clearly a crazy person but you're you're thinking about funny **** that happened or a joke or whatever I I do it way too much think I'm a **** weird that happens a lot to me yeah when that movie um Frozen came out and that song got really popular Let It Go it singing it in the elevator like I got out of my car and one of the good girls it just by yourself like fetto cuz I can't really belt that I like Let It Go Let It Go and I looked over and Angelique one of the girls from our our creative service department who's",
      "start": 3584.68
    },
    {
      "text": "the good girls it just by yourself like fetto cuz I can't really belt that I like Let It Go Let It Go and I looked over and Angelique one of the girls from our our creative service department who's she's a well put together woman sheit of a looker she just kind of comes around the corner and she I think he means like she's like she's not she's like an adult she's a very much an adult she's she's a normal human she's not a child okay and she yeah she wouldn't fit in with us walking around IDI I get it okay she waited for 5 Second as if she didn't hear it and then she was like it sounded really good nice nice oh sick burn sick Burn yeah so I say things a lot and sometimes I talk to myself and sometimes I say things that I think are funny I talk to myself constantly and then I laugh and then everyone can hear me do you have arguments with people from the past oh yeah out loud mostly my mother and you yeah using my dad holy **** we could have our own podcast oh my God we're doing it",
      "start": 3626.48
    },
    {
      "text": "everyone can hear me do you have arguments with people from the past oh yeah out loud mostly my mother and you yeah using my dad holy **** we could have our own podcast oh my God we're doing it right now you could do it by yourself yeah how about the mirror like how about the mirror and you're just like yeah well **** you no no **** you all right cool I totally won that one all right I'm like thank God no one's around here right now because they would think I was completely insane that's pretty much IG a nutshell yeah people you know tweet us and stuff that they bust up on the bus they'll be sitting there listening to this or one of the other shows we do and then they like lose it and like they everyone around them thinks they're see what's funny about that is people will tweet out stuff that we said that I totally forgot we said and then it makes me laugh later and I'm like does that make me an **** or just are we sometimes pretty funny with other make other things make you",
      "start": 3670.48
    },
    {
      "text": "stuff that we said that I totally forgot we said and then it makes me laugh later and I'm like does that make me an **** or just are we sometimes pretty funny with other make other things make you an **** yeah true but what I think is is it weird to laugh like if you're listening to something by yourself do you feel weird laughing cuz sometimes I do sometimes I feel weird if I'm listening to another person podcast and they say something funny and I'm in my car and I'll start laughing and I'll look over and someone will see me laughing yeah and you can't really explain it to the person laughter's a really weird thing and I've thought about this before do you laugh if you're alone like as much as you laugh if there's other people around cuz I feel like I feel like you when there's other people around you laugh as like a weird form of validation of I think this is funny you think this is funny is funny we agree it's funny but then there are certain things that if you hear when you're",
      "start": 3705.12
    },
    {
      "text": "people around you laugh as like a weird form of validation of I think this is funny you think this is funny is funny we agree it's funny but then there are certain things that if you hear when you're by yourself you do laugh and I think those are the things that are just on another level those are the really funny things yeah like RoboCop shooting dicks off you don't have to explain your sense of humor anything I'm going to pull it up right now for you no let's finish the show then we'll all watch it and enjoy it together Greg Greg showed it to me in the back of an Uber once he's like you got to see this so we're like going to dinner or something like that you can splice that comment you just made by the way into anything well done Greg showed it me I've seen it did I cut you up no that's it that's the entire story you yeah you were to your credit of what you just said you were disturbed by it you didn't want to finish it I was like At first I was laughing you got to see this get",
      "start": 3740.32
    },
    {
      "text": "it that's the entire story you yeah you were to your credit of what you just said you were disturbed by it you didn't want to finish it I was like At first I was laughing you got to see this get blown off I'm like Jesus Christ these these like prosthetic penises getting blasted off by RoboCop just not really doing it for me Greg let's go to dinner I'll tell you like that that that project was a testament to how creative people can be cuz there was actually one scene weird where you you meet Clarence Boder and he's like negotiating the drug deal and he puts I don't know if you guys remember it's a great scene where he puts his two fingers in some dude's wine and then like snorts the wine and the guy like drinks the wine it's like this big show off but they did that scene with all women it was cies and it was cookies instead and milk and it was so much funnier because it was just women it's just by by virtue of them being females and they were straight playing 100% straight they were",
      "start": 3780.44
    },
    {
      "text": "was cies and it was cookies instead and milk and it was so much funnier because it was just women it's just by by virtue of them being females and they were straight playing 100% straight they were women in mustach mustach bad hair they were like this sounds kind of Genius so one of the the big well the guy gets like blown to bits is an interpretive dance dance and there's like red scarves do you remember the P RoboCop where he gets like shot to Pieces by Clarence I've seen the original yeah that's the original so there's that part where he gets like they blow his hand off and like he's like no and it's like horrifying when you were a kid to see it well they decided to do that in interpretive dance with like you know fling these are Recreations on the first of the second first this is this is like the internet's remake of the first RoboCop back in the day Peter Weller yeah yeah all right all right right it's been a million freaking years since I've seen it have to revisit and then",
      "start": 3818.28
    },
    {
      "text": "this is like the internet's remake of the first RoboCop back in the day Peter Weller yeah yeah all right all right right it's been a million freaking years since I've seen it have to revisit and then watch the recreate they also did this for Star Wars for the first Star Wars A New Hope yeah there's there's a like a group of people like a little production company says hey give me your ideas and then takes it and I think there's I I think there's one like company that's organizing it and says hey we're going to do these scenes here are the rest of the scenes that are open and you go on people send them in they edit it together the internet has revealed for me two things a there are super smart and creative people out there that are capable of so many things out not in this **** room but in a lot of other if we just turn the camera on us and we talk a lot but there's a lot of people that are also really dumb oh there is but when you I hear the RoboCop stuff those are smartable yeah",
      "start": 3859.64
    },
    {
      "text": "in a lot of other if we just turn the camera on us and we talk a lot but there's a lot of people that are also really dumb oh there is but when you I hear the RoboCop stuff those are smartable yeah iFunny I'm addicted to iFunny uh what's iFunny it's just an app and it's it's got uh what do you call them memes mes oh it's like mimo I love this this this is my nightmare GS gifs whatever but I'm like just constantly M mes M mes they mes this thing for you he like a Tim is the internet guy Tim is like if you don't get it right he ostracizes you from his life but my point is this was the part where you waited out in front of thear I don't have in my life I'm going to **** shoot myself but my point is is that that was mean I'm sorry no no it's he didn't deserve that you don't know what a meme is I don't all right no you take a picture and then you put it you put a you take a picture and then you put a a funny stuff on it yeah that's a meme imp I have so I got it right yeah I am I am a",
      "start": 3900.92
    },
    {
      "text": "is I don't all right no you take a picture and then you put it you put a you take a picture and then you put a a funny stuff on it yeah that's a meme imp I have so I got it right yeah I am I am a meme but I funny what was my point so so the internet has proven two things to me people are either really creative and smart or super ignorant and dumb and they just send hate in that's that's my point okay like some people talk about you know smart things some people talk about what if the aliens came and **** monkeys um and didn't use their technology to avoid it yeah I love you guys yeah like right oh that was that was that was a that was a dig at me I'm saying I'm saying you would **** the monkey just like a few AG mean no Greg would a we had the conversation a few weeks ago was actually a few months ago where we talking about would we **** the goat yeah yeah that was a different story but yeah and you would **** the goat and I said no Greg said he wouldn't I said I would Greg",
      "start": 3950.08
    },
    {
      "text": "a few months ago where we talking about would we **** the goat yeah yeah that was a different story but yeah and you would **** the goat and I said no Greg said he wouldn't I said I would Greg would **** the goat said I said I said wait did I wait no no no you wouldn't **** the goat but everyone would think you **** the goat because you wanted that oh and I I didn't care I wanted so I'm just saying I don't see much different I was not if I'm the alien coming to Earth and I see all these monkeys and I'm like we need to cross breed and but all our cross breeding technology is broke and we need to go out there and inseminate them with our alien penises I'd be like I'm good why are we doing this why do we care so much about Earth why do we want these monkeys to that's also you're asking all these questions and they're like we never thought of that we do agree though that aliens have the technology to inseminate something without **** them I we have the technology so presumably",
      "start": 3998.8
    },
    {
      "text": "all these questions and they're like we never thought of that we do agree though that aliens have the technology to inseminate something without **** them I we have the technology so presumably that they presumably they've all got fingers I don't think that's really a conversation that they all got fingers I like that you can do it I don't think you need fingers what are they going to do with the fingers this is so dumb are they going to pick up the turkey baster or the fingers going to be the they got to have imposible these are real old fashion yeah they were not not old fashion Greg can I I know that we're supposed to do the Oreo oration with that box of Japanese Oreos over there but break those out right now that's not how oration work eat on the podcast yeah and that's also really shitty things is just drilling through my brain right now you only got two more let's move on to the next you're next what do you got for me super refreshing it's me yeah I'm up all right so I was",
      "start": 4032.4
    },
    {
      "text": "shitty things is just drilling through my brain right now you only got two more let's move on to the next you're next what do you got for me super refreshing it's me yeah I'm up all right so I was just thinking about something really quick we can go through this one quickly if you could have a j like we all have kind of our dream jobs I would say or like we're able to do kind of cool things that don't require massive intellect right and that's just being honest right like to to to produce or you know to to write about video games or you know um Act any of these things like you have to be good at those things and that requires talent but it doesn't require the genius Mena intellect right sure thank God if if we had if we had the ability to do anything we wanted to do and and have like a real academic skill like you were really good at science or math or something like that what would you do like what would your profession be would you be like you know I like for instance when I was",
      "start": 4073.68
    },
    {
      "text": "real academic skill like you were really good at science or math or something like that what would you do like what would your profession be would you be like you know I like for instance when I was younger I always knew I wanted to be an historian but I was always really fascinated with science we've talked about this in the past I just couldn't you know by the time I got to high school I just couldn't do the math like I could barely do pre-cal at all so like my dream of being like a physicist or like even a chemist or something like that even though chemistry m a little more straightforward it was was dead I couldn't do it even though I'm really fascinated by it so like if I could do anything like I would probably try to be one of a scientist like a you know an astrophysicist or something like that and so I was just curious what your guys answers would be to those that question as so the question is if I were smarter what would I have done with life that's exactly it because he just",
      "start": 4116.2
    },
    {
      "text": "like that and so I was just curious what your guys answers would be to those that question as so the question is if I were smarter what would I have done with life that's exactly it because he just said he didn't have the mental capacity to do that job right right exactly I don't have the mental capacity if the question should be if you have the mental capacity what would be sure like I I have the mental capacity to to I know I'm very right brained I'm a good writer and I know literature and history and all those things I'm left brained in the sense that I understand scientific theory I think to a degree but I can't write a proof I can't prove why Stephen Hawkings says certain things I just read what he says makes any sense so like that that's kind of where what are the options then it seems like it's just science stuff and math stuff could be blue collar could be you be a **** janitor whatever engineering you know that kind computer skateboarders like that yeah whatever does that",
      "start": 4149.72
    },
    {
      "text": "like it's just science stuff and math stuff could be blue collar could be you be a **** jan itor whatever engineering you know that kind computer skateboarders like that yeah whatever does that work like does that qualify no it ites I mean a trade I would say trade or yeah an actual something that could help in maybe an apocalypse situation yeah that's what I'm thinking that's where my mind goes too right like I always think about that if when I should say if when the EMP goes off and it all goes to **** I have nothing off soci but if I was a farmer a plumber a home Carpenter would be good Carpenter really high on my list right now like I I was always thinking my boss is a Jewish Carpenter Jesus J that was the longest silence I think we've ever had on the show so many so much **** ran through my brain in like a split second I was like where's this going to go talking about Jesus Christ talking about Jesus I actually I thought do Jews build stuff that's what I",
      "start": 4186.88
    },
    {
      "text": "so much **** ran through my brain in like a split second I was like where's this going to go talking about Jesus Christ talking about Jesus I actually I thought do Jews build stuff that's what I thought man Joseph was he was a builder too or a carpenter too they do they build they build things they build lots of stuff it was an obvious joke is like calling a big guy tiny okay my God you guys really brought the room down no I didn't I I understand it's it's a history joke it was obvious thing of course they build stuff Romans builds holy **** Colin builds things okay I still don't know that I have this question clear all right so if I was if I were smarter no because I don't think that I don't think it's necessarily about in it's about like it's not about it's more about capacity than than smarts right like you you have to have the capacity to learn all right so for instance when I went to Northeastern I was friends with a lot of pharmacy majors that's a **** serious major you",
      "start": 4234.08
    },
    {
      "text": "than smarts right like you you have to have the capacity to learn all right so for instance when I went to Northeastern I was friends with a lot of pharmacy majors that's a **** serious major you I mean I was like getting bombed most nights you know reading history books and these guys were like in the library all night like really reading and now they make you know hundreds thousand dollars a year doing thing that but that required that required like complete dedication to like understanding like so like if you you know like for instance we talking about a post-apocalyptic situation I think that just being a doctor like a general practitioner actually because no one's going to kill you if you're do I would say Carpenter that's my answer that's a super big awesome skill and it also makes me happy to do it or a mechanic because shit's still going to need to work yeah you're still going to have tractor car yeah mechanic or Carpenter that's my answer see for me thinking about this like",
      "start": 4281.52
    },
    {
      "text": "me happy to do it or a mechanic because shit's still going to need to work yeah you're still going to have tractor car yeah mechanic or Carpenter that's my answer see for me thinking about this like I do video stuff yeah you're a video guy this is much different answer than your guys is but for me audio has never made sense and I remember when I went to college there was like the two pads was you have do video or you do audio remember like the stuff gu the audio guys had to do like that just it doesn't the compression and all that **** that **** doesn't make sense to me like I know how to turn volume up it's really not that hard I just guess every week and it works out yeah but it works out like to make it really work like you need to know what the **** you're doing Craig Baron what's your answer audio guy like your apocal **** hits the you're the one that added the apocalypse okay what I mean is there's no **** power like there's no power the origin of the question smar",
      "start": 4323.84
    },
    {
      "text": "your answer audio guy like your apocal **** hits the you're the one that added the apocalypse okay what I mean is there's no **** power like there's no power the origin of the question smar there's no power it was more about just like what really it has no or well other than the fact that it's just like what would you do if you could really do it oh okay I think I think I would have actually I would have been would have liked to have a writer I've always I'm always envious of your both of your abilities to write and have that wealth of knowledge and you can take that to to uh a lot of different directions right novels you can write films if you want to write films TV things like that and I've always like been nvs people that have those sorts of careers so I wish if I had more dedication a little more smarts and I liked reading a little bit more writer reading is essential I read **** constantly I love reading do comic books count cuz I read a lot of those comic books don't count",
      "start": 4365.52
    },
    {
      "text": "a little more smarts and I liked reading a little bit more writer reading is essential I read **** constantly I love reading do comic books count cuz I read a lot of those comic books don't count okay well then we to still mate I just read like people a lot of people ask like I know a little bit about a lot of things because I just read a lot you it's like everyone's always like I like a lot of people put in comments like wish I knew this like Colin knew this or it's like I don't know these things like you think I do it's just like I read and try to try to if I'm curious about something I go and read about it and you can just gain a little bit even if you retain 10% of it you know like recently I was reading a lot about the French Revolution it's like really interesting now I don't remember everything I read about the French Revolution but I remember some of the things I read about the French Revolution you just have a little bit of understanding of it then like people people need",
      "start": 4415.04
    },
    {
      "text": "everything I read about the French Revolution but I remember some of the things I read about the French Revolution you just have a little bit of understanding of it then like people people need to give themselves a little bit more credit ohn is what I'm saying you know what I mean give yourself a little bit more credit you got to just open up a book is there any science behind the more you read the more you retain like if you read more do you retain nobody hear eating chocolate while you study helps you retain **** so you're saying in terms of volume like so for instance like one year you retain 10% and stuff but if you keep going you retain 15% that because I don't read books this is very obvious to everybody but I do read comic books and stuff and I find it hard to like think back to oh that story line from a year ago I'm like ah man I I don't remember what happens and it's crazy because you read too many comic books what do you read a lot of books like such as like some people",
      "start": 4450.12
    },
    {
      "text": "oh that story line from a year ago I'm like ah man I I don't remember what happens and it's crazy because you read too many comic books what do you read a lot of books like such as like some people like fiction non-fiction I read a lot of non-fiction okay so uh what are some examples Yellow Pages uh I was just talking about yeah I read a lot of history but I was just talking I was talking with someone on someone on Twitter was like you should read a book by this woman Mary Roach called Packing for Mars and I was like I actually I actually read that book already it's it's a book about like all of the things that NASA like the things that you don't think about that NASA has to deal with for us to go to Mars and it's like a really so like one night I was just online I was like hey really interesting and I just I just download a bunch of books I just **** read them you know it's just it's just I every night before I go to bed I just read and it's uh it's it's very valuable thing just",
      "start": 4484.96
    },
    {
      "text": "and I just I just download a bunch of books I just **** read them you know it's just it's just I every night before I go to bed I just read and it's uh it's it's very valuable thing just that even if you don't rain much of it wedding tomorrow **** what do you got to do besid I got to take the dog to Brian Alano's house tonight watch him but I also I also think this I I told I told people this in the past is that because of the internet age and our phones and all this stuff people actually read more than ever and I don't think a lot of people give themselves enough credit for how much they read yeah that number dwindles by the day I mean uh uh going through the dating thing what have you reading is kind of like a unicorn these days it's almost like reading is don't reading is what you reading used to be to what it do you watch reality TV or not you know what I mean like that used to be the bar used to be the bar used to be do you read and now the bar is do you watch reality TV does",
      "start": 4525.56
    },
    {
      "text": "used to be to what it do you watch reality TV or not you know what I mean like that used to be the bar used to be the bar used to be do you read and now the bar is do you watch reality TV does that make sense yeah yeah yeah do Colin were you're saying that like because there's so much articles and stuff people are reading more people are literally reading more but they're reading they're reading books it's just it's really interesting like we're actually probably we're easily one of the most literate societies on Earth and people are more literate than ever and it and becoming more literate has been compared to like say Europe uh yeah or really any other country I'm sure we're in the top 10 in literacy one of the most literate places in the world is um as far as I understand it is actually North Korea um I would I would yeah but it's mostly propaganda yeah but they can read and a lot of them can speak English too which is interesting a lot of like propaganda in English classes",
      "start": 4569.44
    },
    {
      "text": "actually North Korea um I would I would yeah but it's mostly propaganda yeah but they can read and a lot of them can speak English too which is interesting a lot of like propaganda in English classes propaganda he's chosen he's chosen look at this Port illo loves you now look at this he's showing you how tough he is by eating up his frog yeah but anyway yeah I I think just to that point like I think people just need to give themselves a little more credit like just crack open a book or read you know what you know website I love and I read all the time a lot of people give it yeah Drudge Report's awesome but Wikipedia But Wikipedia is awesome all people give **** to Wikipedia being like anyone can write it it's all and I'm like no you don't understand those people those people are **** crazy and like especially maybe with like smaller articles that are like less important maybe they go like and they get **** with or whatever and no one sees but if you're messing with like the",
      "start": 4611.76
    },
    {
      "text": "crazy and like especially maybe with like smaller articles that are like less important maybe they go like and they get **** with or whatever and no one sees but if you're messing with like the Alexander Hamilton Wiki or something like that like someone's you're going to get banned and they're going to fix it and like Wikipedia **** sweet yeah going be there for long and it's you know like there's it's funny W it's like I I thought I was going to **** make a singularity when I when I was reading about there's a Wikipedia entry about Wikipedia do that if you can do that make a singularity exception and uh yeah was like Inception I was reading about like Wikipedia like how accurate is Wikipedia and all those kinds of things it's very accurate you know and Wikipedia says Wikipedia is very accurate but like but like there's you know Wiki editors and all these kinds of things it's just it's we have so much knowledge and so many resources just like it out there and if you really want",
      "start": 4647.24
    },
    {
      "text": "accurate but like but like there's you know Wiki editors and all these kinds of things it's just it's we have so much knowledge and so many resources just like it out there and if you really want to get off Wikipedia just follow the hyperlinks for all the sources and go read the sources yourself like it's it's really that easy because there's some things on there I read and I'm like no there's no way you know I tweeted out the other day it was a really interesting thing um about um John Hancock and in the revolution he was you know he was the governor Metts and one of the richest men he was a Smuggler and all those kinds of things he he had 1700th the the the nation's wealth During the Revolution 1700th **** Beyond The Pale Rich yeah you know and like those are just little things and so like I read a lot about Alex about did also mention anything about the Illuminati no didn't anything about the Illuminati what have you learned from the Greg Miller Wikipedia page I'm on that I'm on",
      "start": 4681.96
    },
    {
      "text": "like I read a lot about Alex about did also mention anything about the Illuminati no didn't anything about the Illuminati what have you learned from the Greg Miller Wikipedia page I'm on that I'm on that I'm all over that **** am on my Wikipedia page says Dameon Clarke is an actor living in Los Angeles and he's represented by blank done can I edit it to and put in the word of my choice knock yourself the **** out son seriously if you guys you know here is here is the uh uh we can come out of tonight my Wikipedia page there's nothing on it so if you guys could help me with that yeah oh person the Army can help you with that look at the camera personal life Dameon Clark is a scumbag period don't do that you do way better than that no that's what we are you sp you do a pirate see the problem I wish that I cuz cuz I know that like I wish you could actually pay money and edit your own Wikipedia page anybody yeah but they fact check I can I can **** with my Wikipedia page yeah but they'll",
      "start": 4717.72
    },
    {
      "text": "I wish that I cuz cuz I know that like I wish you could actually pay money and edit your own Wikipedia page anybody yeah but they fact check I can I can **** with my Wikipedia page yeah but they'll go back and be like this guy didn't actually do this like I want legit and saved like 50 children from a burning buildings put that as a line his screen capet Nick saved like 50 children from a burning building like when you do I like I love when you do me I like when you do my the impression of me it's amazing I I got to be honest I'm not I'm not you know I I'm not bothered by things like this usually but a while a few years ago on Podcast Beyond we were talking about yeah um I'm like why am I not on the list of notable graduates of Northeastern University right and there's like a huge list of **** thousands of people on this **** list I'm like really I'm not one of those thousands of people you know like one of these th literally thousands of people of the University of Missouri",
      "start": 4767.52
    },
    {
      "text": "of **** thousands of people on this **** list I'm like really I'm not one of those thousands of people you know like one of these th literally thousands of people of the University of Missouri though don't you me and John Ham so other people too anyway grad people like put people put me on that list over and over again they kept deleting me off that list but I'm going to **** take it a step further now not only do I want to be back on that list I want my own Wikipedia entry Nick and I'm gon I'm gonna I'm gonna get it thing my I was I was born on Port Jefferson Long Island New York October 14 1984 when you say on it's like your mom just was on like a Dennis L **** level at some doesn't get angry yeah you get like angry ranish I like it and you're super smart so it comes off like these ideas come across super fast and I'm just like this is really intense well does this happen every podcast oh 100% I love it thank you he's a good kid so I'm just saying SW Kid K Mori no middle",
      "start": 4813.92
    },
    {
      "text": "these ideas come across super fast and I'm just like this is really intense well does this happen every podcast oh 100% I love it thank you he's a good kid so I'm just saying SW Kid K Mori no middle names a tradition in the Moriarty family for males not to have a middle name October 14 1984 Port Jefferson Long Island New York is the birth the key to not having a Wikipedia page deleted deleted is to multi have multiple sources back in the day I had one that got deleted because it was off from my cuz that's where all my information was surely we can find other sources once I Diversified it was easy you can you can site YouTube yep that's what a lot of people do I'm I have the little check mark on YouTube or on Twitter now yep you so that that you can site that yeah uh there's articles about you there's a Blog some kid interviewed you for a Blog on IGN recently I'm just saying I just need a little something just a little something and it's really more important for me to be on the",
      "start": 4861.76
    },
    {
      "text": "about you there's a Blog some kid interviewed you for a Blog on IGN recently I'm just saying I just need a little something just a little something and it's really more important for me to be on the Northeastern notable graduate that it is for I wonder if I'm on the I I probably am not because you guys like f the other Nick Scarpino I am not even Scaratti scar Scaris scar scarp jetti what the I don't know Nicholas scop poly chronopolis by the way I was watching this been the most fun I've had all day oh good good that sucks for you Greg that does but who what's he doing down there what's he pulling on he's fixing my day my God he's fixing to make it a good day Tu and rubbin tuing and rubbin Pinky Tu rubbing what you saying I was just saying I was watching Full House the other day this just a total nonse we have to bring it really is a great show I watch it probably like three or four times a night and twins it's literally on for like seven hours on Nick at night and Jess's I love how",
      "start": 4904.96
    },
    {
      "text": "a total nonse we have to bring it really is a great show I watch it probably like three or four times a night and twins it's literally on for like seven hours on Nick at night and Jess's I love how like early on they just changed Jesse's last name he has like a total like English or like Western European last name Cumberbatch Cumberbatch Nick Jesse Cumberbatch it was Jesse that's what was his last Spano is uh say by the Bell Scatti yeah something it was like yeah some and then there and then suddenly he becomes Greek like in like season two and they're like Spano Jesse Spano say by the Bell what was the English version of Jesse's name it was clearly like a greeky Italian dude which was the guy that saying don't understand Jesse Fairweather who is the guy that saying parents just don't understand wait did you see the show did you ever see show Full House or fresh PIR Full House I was Full House Full House but I got to know Uncle Jesse's last name now so call him what do you how do",
      "start": 4951.12
    },
    {
      "text": "understand wait did you see the show did you ever see show Full House or fresh PIR Full House I was Full House Full House but I got to know Uncle Jesse's last name now so call him what do you how do you pronounce the his real one Kopolos true story I did that that uh the movie debate the movie feuds thing over on movie fe uds on the YouTube and uh I had to make a Uncle Jesse reference and then in the script it had me saying his real last name and I took like four cracks at it and I'm just like not going to say it Everyone Knows by Uncle Jesse you don't need Jessie no no Stamos like Uncle Jessie in the show John Stamos is a beautiful I don't I couldn't pull that out if you paid me a million dollars right now he just did it Colin just did it because he has the internet chronopoulos no he knew it without it his hands now now he's out looking for the original one do you remember that guy sang that song that was like something like nightmare on my street oh my God shut up remember that he's",
      "start": 5001.0
    },
    {
      "text": "it without it his hands now now he's out looking for the original one do you remember that guy sang that song that was like something like nightmare on my street oh my God shut up remember that he's beating the dead horse God Dam it Tim I don't know yes what's your topic so my topic today is actually via Yesa Twitter if you if you have topics please follow Barrel is EMP tweet at us yeah no um I just decided not to Cochran really that was his **** name Jesse Cochran and then they probably changed it after the OJ well it's like I'm saying some like not Greek name **** it's American sound yeah like yeah like a some sounds like **** ring sorry I'm sorry to interrupt you Alex Price 19 wants to know who do we want to bring back from the dead so if we could bring someone back from the dead we're not talking zombies here we're talking besides human how long are they back for forever and definitely until until they die again until they die again but so are they coming if they died",
      "start": 5047.96
    },
    {
      "text": "dead we're not talking zombies here we're talking besides human how long are they back for forever and definitely until until they die again until they die again but so are they coming if they died at 74 are they coming back they comeing back at 74 and they have a lot then they just got to deal with the same **** they were dealing with it's just like yeah if they had cancer they have cancer well that's why it might be a good idea to bring someone back that had like an accidental death they live the rest their life so I feel like we have to give the shout out to Paul Walker immediately right go Walker only because I want like the Fast and Furious series is not going to end correctly without PA Walker I said it that's the person you're going to bring here time out real quick to bring you up to speed and everyone who doesn't know these two are the biggest fast and furious fans I've ever meta the world but that's the choice out of in the history of the world Paul Walker was a Saint Paul",
      "start": 5096.36
    },
    {
      "text": "to speed and everyone who doesn't know these two are the biggest Fast and Furious fans I've ever meta the world but that's the choice out of in the history of the world Paul Walker was a Saint Paul Walker I'm not arguing the like to live fast and and and drive fast the levity of Paul Walker almost said what I me that's your choice I mean we got to finish the series got to finish the series this is big on somebody else at this who you got col I don't know I'm thinking I just based on like how historically this would **** everything up and all also religious **** everything bring Jesus bring Jesus Christ back because like because this would for for Christianity to come to fruition right and like it you know he has to die and then come back right but he died and came back and then when he comes back again that is the apocalypse right like the second coming so the Rapture happens all things but you just bring them back and every and it just **** everything up and every like what are",
      "start": 5134.4
    },
    {
      "text": "comes back again that is the apocalypse right like the second coming so the Rapture happens all things but you just bring them back and every and it just **** everything up and every like what are you doing here it's not time yet like what are you doing dude like because he comes back as just a dude a carpenter like we were talking before he's got skills might not know how to use like some of the the the drills and things that we use today but yeah but I think carpentry is like it's like transcends yeah exactly so I would bring back Jesus Christ just because I you know and it's not a disrespect to anyone you know any religious person because as you guys know I don't disrespect religious people at all I actually respect them a great deal but I just think that it's it's a very interesting thing to to propose like to bring Jesus back into the fold I mean I think that's that's the answer some people were looking for but we all know that given the choice see a bit obvious but I like the",
      "start": 5179.16
    },
    {
      "text": "thing to to propose like to bring Jesus back into the fold I mean I think that's that's the answer some people were looking for but we all know that given the choice see a bit obvious but I like the **** out of it I think it's great I'm just going to say Kenny Kenny Loggins did he die no Kenny South Park Kenny yeah good I like that that's amazing I like Kenny Loggins I like that is watching it home he like I'm not even dead clearly I'm not watching this show anymore Matt Scardino no I like Jesus Christ I like Jesus Christ because it would completely alter our course and that would be crazy eradicate a complete religion if he was alive Christianity may or may not exist that's true right if you live for another hundred or so years but you're like a Rebel Rouser that's you live another hundred years I'm just more Curious you got a brand new actually you know what I've been having a couple of cocktails that's a that's a whole new ball game especially back then because no one Liv past 25",
      "start": 5212.36
    },
    {
      "text": "years I'm just more Curious you got a brand new actually you know what I've been having a couple of cocktails that's a that's a whole new ball game especially back then because no one Liv past 25 this guy is 40 years old holy gosh he's got to be this wait a minute what is your **** secet do you do yoga there is some Pilates are you are you in the c00 Years there's going to be this thing called podcast and YouTube and someone's going to wish me back you it's like another one of those moments where I sat it and I was like one guess as to who hates when I pronounce Pilates that way Pat Pilates no my wife oh Pontius Pilate I'm like uh I want to study the ancient art of Pilates she's like you're an idiot stop talking get the **** out stop saying this in the middle do you want to talk about your marriage real quick uh no no that's a topic for another day totally completely other day we can talk brought it up we'll talk about that later okay that's cool after the cameras are off",
      "start": 5257.12
    },
    {
      "text": "about your marriage real quick uh no no that's a topic for another day totally completely other day we can talk brought it up we'll talk about that later okay that's cool after the cameras are off real quick I just thought of something real quick again totally non SEC more about JC uh we know Jesus Christ was a real person oh yeah because of uh Josephus and other Roman historians religious are you religious person no he reads A Lot okay so like so like there's historians Roman historians who we trust with everything else that say Jesus existed Pon pilot killed Jesus and all those kinds of things what if you brought Jesus back though because a lot of people you know think back in historicity and are like maybe Jesus was no the Jewish faith doesn't believe Jes they believe Jesus was a holy man but not the Messiah right like he didn't have you know he turned water into wine or like all those kind of things that'll happen in the New Testament so what if you brought Jesus back",
      "start": 5304.76
    },
    {
      "text": "was a holy man but not the Messiah right like he didn't have you know he turned water into wine or like all those kind of things that'll happen in the New Testament so what if you brought Jesus back and you found out that maybe they were right you know like Jesus comes back and he's just a dude and he's actually delusional you know like like some people think Jesus was just totally delusional he's a magician but then like how would you get people to believe that right like so here's my thing no one knows what Jesus looks like right oh people would be very surprised with the way Jesus he look like it's orange like like super short and kind of orange colored you know what I mean he's a Jew in the desert I mean he's it's a million years ago anyway well all I'm saying is it would be easier to convince the world that Paul Walker was back because you just put him right back into the filming of Fast Seven you're good to go it would definitely be more important to bring Paul Walker back than",
      "start": 5340.48
    },
    {
      "text": "convince the world that Paul Walker was back because you just put him right back into the filming of Fast Seven you're good to go it would definitely be more important to bring Paul Walker back than Jesus he let's play this way **** Jesus Christ who do you think would would would would draw more at the box office honestly I think that if Jesus Christ came back the world would probably end but you know you continue when Jesus Christ back from the and and I'm a fan of Paul Walker but I mean dude here's what I'm going saying I'm going in a different direction than where you guys are doing break this up the best Jesus Christ comes back to throw one bachelor party fast in the Furious 14 that's where we be if Paul Walker was still alive by the way your the God's ears anyway please go keep going I'm going you know I get to go back and watch what happens when this person comes back from the dead I want to bring back from the dead as soon as he dies John F Kennedy so the assassination as",
      "start": 5379.92
    },
    {
      "text": "going I'm going you know I get to go back and watch what happens when this person comes back from the dead I want to bring back from the dead as soon as he dies John F Kennedy so the assassination as soon as he died so what I'm you guys are bringing Jesus he's in the hospital in Dallas and he comes back exactly and he's fine he's like what the exactly he's fine like you're he's a complete human being everything's fine and then it and it picks up and we see and but I I get to watch as an observer like the Watcher in Marvel Comics to see what happens in that what if Universe you know what I mean what is the course of American history and Vietnam and everything else with him Vietnam probably escalate not dead I I don't I don't know I mean that's a good one that is a good one it's a very it's a really good one because he was a **** hell of a president and a decent person that was eloquent I just in a in a selfish way like when we've talked about this before we talked about on a",
      "start": 5428.68
    },
    {
      "text": "it's a really good one because he was a **** hell of a president and a decent person that was eloquent I just in a in a selfish way like when we've talked about this before we talked about on a conversation with Colin which was like I'm one of the most annoying things that ever happened in history to me is Jack Ruby killing Lee Harvey Oswald that **** infuriates me like every time I see that footage I'm like what like the history and all the knowledge of what happened just died collapsed on that **** floor because this idiot you know walks this low-l mobster walks up to him and **** shoots him and that because that we'll never know like one of the great mysteries in American history was totally he **** ruined it you know like like so like I don't want to bring Lee Harvey Oswald back he's a **** Defector and a traitor and obviously all those things are murderer but you know that's one of the great Unsolved Mysteries because of that one event you think that was the Lynch pin in the",
      "start": 5466.48
    },
    {
      "text": "a **** Defector and a traitor and obviously all those things are murderer but you know that's one of the great Unsolved Mysteries because of that one event you think that was the Lynch pin in the cover up though I mean that's that's what indicates wasy that that we would know what happened I mean you know how much other evidence is surfaced over the years has been squashed by the FBI and the CIA and all that **** yeah but all the there's all that would have been squashed too that would have been handled but there was Congressional like all the conflicting Congressional reports I think there was a congressional report right afterwards uh or in the early 70s that said there wasn't a second shooter that it wasn't a conspiracy and then in the 80s and they do another one and they said there probably was they were like there was a second shooter like there is a conspiracy you know like and like you feel that was the one moment in time that solved the puzzle from well I just feel like if",
      "start": 5507.6
    },
    {
      "text": "probably was they were like there was a second shooter like there is a conspiracy you know like and like you feel that was the one moment in time that solved the puzzle from well I just feel like if you have the shooter alive then he's going to like he was already talking I'm I'm ay he would have given you breadcrumbs to go in the direction to raise the conversation spoilers we know from X-Men Days P though that he was a mutant so is that true in in that movie spoilers Le hary oswal's a mutant no Ken's mutant Kennedy's mutant oh that's bad I I wish the Jack Ruby was that would have been awesome Jack all right so so we've covered who'you bring back you brought back somebody JFK JFK literally the thing we're talking about topic listen you make strong **** you the one pouring straight bourbon into our glasses for last because honestly it's the only way that I can spend time with you people is **** lit it's not it's not a nice that's how that's how Tim does it he with no no but it is",
      "start": 5542.64
    },
    {
      "text": "into our glasses for last because honestly it's the only way that I can spend time with you people is **** lit it's not it's not a nice that's how that's how Tim does it he with no no but it is delicious everything you have in front of me is delicious I would say honestly I got nothing right now um would you guys is there anybody that you personally know oh yeah that like jumps to mind so that's good I mean the obvious choices are like you know my mom or uh something personal but I unselfishly wouldn't do that M that's that's a real selfish move that would affect only me and probably piss her off cuz she was like oh I was so happy I was bathing in the light and then you brought me back and now I'm old again you know so I'm not going to do that to her you know whatever so I would say **** JFK is a really good one you're welcome how do you top JFK Abraham Lincoln Jesus no I don't really know but dud Abraham Lincoln's a fascinating one though it is because there's a lot of mixed",
      "start": 5584.28
    },
    {
      "text": "**** JFK is a really good one you're welcome how do you top JFK Abraham Lincoln Jesus no I don't really know but dud Abraham Lincoln's a fascinating one though it is because there's a lot of mixed reports on him and but I feel like he would it's the same reason way I feel about a lot like a few presidents back in the day without term limits in the 186 0s he probably would have been president four or five times you know like four or five terms Li terms yeah like so like that would have changed everything it's the same way with FDR like he be like a dictator almost and it would actually help the country that's the way I felt about like I almost feel that way about Clinton like you could see a like even after Lewinsky like he was still popular Gore didn't really suffer because of him so he probably would have been president at least for one more term you know so there all those like weird things like if these like FDR died right after he was elected the fourth time and that gave us",
      "start": 5632.16
    },
    {
      "text": "he probably would have been president at least for one more term you know so there all those like weird things like if these like FDR died right after he was elected the fourth time and that gave us Truman and all these kinds of things which you know changed you I don't know that kind of stuff's really interesting to me you know the FDR was the reason we have that Amendment and the reason is FDR good HBA stin really and the what that's how you know the podcast has got long we brought back like uh a popular theorist or not necessarily political figure but uh like a Freud or young that'd be awesome Ein how would that Einstein no sorry well I mean Einstein we've been continuing on his theories right we've been enh we've been enhancing and then we've been improving on them but like what about something um I don't know like Theory driven or or sociologically driven I always want i'always I've always I've talked about this in the show before I've always wanted to bring Benjamin Franklin to",
      "start": 5670.16
    },
    {
      "text": "something um I don't know like Theory driven or or sociologically driven I always want i'always I've always I've talked about this in the show before I've always wanted to bring Benjamin Franklin to current present day and show all crazy **** we got what about Tesla he sucks Tesla sucks Tesla sucks he's all in bed with the no no he created AC he created AC is like the one thing that we all run out it's true okay he's cool yeah Ben FR Ben Franklin just because he was such a **** o Ben Franklin's an actual **** dick he's also really smart he's **** hella smart an OC hell he's OG no OC wh we now San Francisco yes noral nor yeah the bay the city by the bay yeah so you got you got Tesla and then youve got uh uh uh Ben Franklin and Ben Franklin was more of a DC and then you got Tesla was an AC right alter alter I know what you're saying I don't know I don't know who which would be which anyway continue your thought no that's that's a great that's I mean Greg did bring that up in",
      "start": 5718.8
    },
    {
      "text": "was an AC right alter alter I know what you're saying I don't know I don't know who which would be which anyway continue your thought no that's that's a great that's I mean Greg did bring that up in the past just with Franklin um just cuz he was such like an OG invent and like had his hands on everything was such a renaissance man post think of how he would flip the **** out of the kites we have no yeah that's definitely that's why he was interested in kites was just for the kites themselves he was like guys look you don't get it you put it up there and then there wind Mr. Franklin I have all the world's knowledge at my fingertips in the palm of my hand dope but I got to see this kite take me to Chy field right now and show me the dudes that are blazed out flying kites I need to see this the Kite Runner loved it not what I thought it was going to be a lot of really weird Indian **** going on but was I love the title wow wow was that too much no it's a podcast I don't know what can",
      "start": 5769.32
    },
    {
      "text": "the Kite Runner loved it not what I thought it was going to be a lot of really weird Indian **** going on but was I love the title wow wow was that too much no it's a podcast I don't know what can I not say I I don't know cheers to that complet cheers to that one more time cheers cheers you're at a Coca-Cola straight is that it Gregory and when Tim's out of Coca-Cola that's the end of GameOverGreggy Show thank you all for joining us right now remember it goes very simply every week four sometimes five best friends gather around this table above a guy with some kind of nasal problem we each bring a random topic of conversation for your amusement if you like that you can get the full show is in MP3 every Friday at gameovergreggy.bandcamp.com for $1 if we're not worth that dollar you go to youtube.com/gameovergreggy the next week every day it's broken out topic by topic until the whole show posts on Fridays one big episode I remember all that **** it's kind of impressive we just made it all up",
      "start": 5811.84
    },
    {
      "text": "gameovergreggy the next week every day it's broken out topic by topic until the whole show posts on Fridays one big episode I remember all that **** it's kind of impressive we just made it all up and then I've had like 30 weeks now to say over at districtlines.com I know don't buy the Gone Home shirt there you go to the Gone Home store Gone Home's a great and remember kids nasal rinse medot sence rinse whatever you got going on just take care of your science cavities I think is really an important lesson to it's essential yeah it really is MHM Dameon thank you for coming this has been enjoyable I enjoy you 10 like seriously don't sugarcoat it 859 I'll take it I was really thinking four or three was coming oh my God no this has been great swear to God thank you s thanks for joining us it's been a pleasure all day I've had your I do think you're sexy everyone everyone follow him on Twitter it's been alive across the screens here I think you're a good man he's in Borderland 2 he's in Tales",
      "start": 5871.12
    },
    {
      "text": "a pleasure all day I've had your I do think you're sexy everyone everyone follow him on Twitter it's been alive across the screens here I think you're a good man he's in Borderland 2 he's in Tales from the Borderland you I doed man I'm not a fan of are you are you wearing a TMNT bandage on your finger no I'm wearing one that says don't ask on my middle finger didn't mean to do that what happened is I went to a white elephant gift party at Dave Feno's house and I ended up with these B oh these drunk people bandages so they're all like **** show and don't ask and all these and I'm out of the normal Band-Aids so that's what you had to used to what that **** mean I'm sorry I'm out of the lot man don't ask ask what happened to your finger don't ask no no no no it's like they're they're in like serious no no I know you are they're like you know basically like if you saw something in the street with you know the wound it would say don't ask so don't ask but it is Donatello colored it is",
      "start": 5922.04
    },
    {
      "text": "like serious no no I know you are they're like you know basically like if you saw something in the street with you know the wound it would say don't ask so don't ask but it is Donatello colored it is it does look like how did you cut your hand I tried picking up the camera outside and like you saw me I had my hands full and you're like hold on Tim but before then I like scraped it just cut your little porcelain skin up beautiful baby do skin s Supple porcelain skin 12-year-old girl is ladies and gentlemen it's been our pleasure to serve you we'll see you next [Music] week you always got the cords wrong wake up late for school you don't want to go why did I AG I don't know a lot of people ask themselves that question",
      "start": 5963.92
    }
  ]
}
