{
  "id": 308,
  "video_id": "rQZ7ylVq2BA",
  "show_name": "The GameOverGreggy Show",
  "hosts": [],
  "title": "Not Wearing Underwear - The GameOverGreggy Show Ep. 27 (Pt. 5)",
  "description": "Full Episode Friday! Get it EARLY here! http://gameovergreggy.bandcamp.com\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1402556402,
  "duration": 1708,
  "transcript_chunks": [
    {
      "text": "My topic, oh goodness, is probably short. Mhm. And it's just let's talk about going commando. Oh, the I've never done it until yesterday and today. Wait. Why? Yeah. Why? Why did you if you're not if you're watch Well, I Okay, so if you're not if you're not one of these cool kids who watched the Friends back in the day, which is what debuted this with Ross and Rachel. Yes. Going Comm ando is not wearing any underwear. You're just wearing your pants or whatever you're wearing. Why did I go commando out of underwear? Oh, you laundry. It was This is I was waiting for my laundry to get picked up on Friday. Thursday was the last pair. Friday I was like, \"Well, you don't want to go bathing suit. I'm not going to double down. I'm not going to wear a bathing suit . You're going to flip it inside out and wear the disgusting as well. I just want to try every. It's not like it's not, you know, it's not like it's it's taboo for sure, but it's not something that's completely taboo. I think",
      "start": 1.1
    },
    {
      "text": "inside out and wear the disgusting as well. I just want to try every. It's not like it's not, you know, it's not like it's it's taboo for sure, but it's not something that's completely taboo. I think it's just I think it's liberating.\" Sure. Did you find it not like annoying? Like, do you not have like your jeans like rubbing up against it? See, this was my concern. Of course, I have metal teeth in front of in front of my penis in in my pants. And so, there was concern. Of course, would they zipper? Yeah, of course. No, I'm not like this is metal control. This isn't teeth. [Music] Where are those **** choppers? Why are they automated? Did you see the movie Teeth? You like I did see the movie Teeth. Actually, the movie freaked me out. Little weird. That one in Hard Candy. You were like, it's a little weird that a girl has teeth in her vagina. Yeah, it's a lot weird. It's a lot weird movie. It was odd. Don't cry. That's okay. No, I don't know. My contact just started messing. It's",
      "start": 41.68
    },
    {
      "text": "it's a little weird that a girl has teeth in her vagina. Yeah, it's a lot weird. It's a lot weird movie. It was odd. Don't cry. That's okay. No, I don't know. My contact just started messing. It's okay. No, I know commando is a touchy subject. She thought about your penis and then he instantly brought to tears. That's what most people do. Oh god. But yeah, that was a concern . No, my dick has not rubbed up against these teeth. Wait, are you currently doing it right now? I am right now cuz the laundry came the laundry came after I was dressed today. So, I'm I'm I'm a millimeter closer to to greatness right now is what you're telling me. And that was the thing. I forgot all about the episode where Kramer starts going commando. I'm out there and I'm loving every minute of it. So, wait, you tell us what what are your what are you feeling right now? I'm fine with it, but I'm gonna I'm gonna wear underwear tomorrow. Now, you wear tidy whies though, right? Or I wear boxer briefs. See, I wear",
      "start": 79.92
    },
    {
      "text": "us what what are you feeling right now? I'm fine with it, but I'm gonna I'm gonna wear underwear tomorrow. Now, you wear tidy whies though, right? Or I wear boxer briefs. See, I wear boxers. What's the difference between Oh, I guess just the longerness. Boxer briefs like they're tight shorts. Yeah, briefs are like tidy whies and boxer briefs go down a little bit. They're tighter than boxers. They're like Superman's underwear. Yeah. Well, I know boxers are loose. I know boxer briefs. I just didn't know about the There's multiple. There's also like European boxer briefs that are like smaller that Fran probably wears. Actually, I know he wears those cuz he wears it to the beach, which is ridiculous. Looks fantastic in him, which is I'm so jealous. He's a good looking man. He's good looking. The manini or the manthong or the what? The banana. Banana. I'm going to tell you right now. Has anyone ever tried that actually real quick? Oh, no. I don't have the balls to try that.",
      "start": 112.16
    },
    {
      "text": "good looking. The manini or the manthong or the what? The banana. Banana. I'm going to tell you right now. Has anyone ever tried that actually real quick? Oh, no. I don't have the balls to try that. I'm going blow up I'm going to blow up my dad right now and say that in in the late'80s and early 90s, he didn't wear a speedo. My dad wore the speedo all the time. A flying. My dad still wears that. He still wears the the speedo underwear where like you look at him, you're like, \"All right, it's all out there.\" So, one one of my stories that I swear I told before on the show, but there was one Christmas that my mom bought me and my my little brother's best friend thongs for Christmas, like as a joke. Male thongs couches and like she was like, \"Ah, this is funny.\" Like, you know, we're like, \"This is no freaking joke, Mom .\" So, we went on Are you guys kidding me? Of course. Yeah. So, we went to uh we went to Santa Cruz in the the summer that summer u as like a a family trip and his my",
      "start": 147.52
    },
    {
      "text": "\"This is no freaking joke, Mom.\" So, we went on Are you guys kidding me ? Of course. Yeah. So, we went to uh we went to Santa Cruz in the the summer that summer u as like a a family trip and his my friend came and we brought he brought the thongs. He's like, \"Tim, we're doing this. Your mom's out there somewhere. Please tell me it was Kevin. Was it Kevin the No, it was my friend True.\" Okay. True. His name is True. Sweet name. That's awesome. So, we went out in these thongs. Yeah. And we This was the with the handy cam. My little brother on the on the I would spell it T E U X like with an X like like a French true. Oh, that'd be amazing. Shut up. Nobody cares about you. Let the story happen with So, we we walked around Santa Cruz for like a couple hours just in thongs trying to find your mom. Yeah. Okay. And it it was just awesome cuz we were just doing it and like all of a sudden people start walking up to us and putting dollars in our thing and then it turned real and then we're just",
      "start": 190.56
    },
    {
      "text": "Yeah. Okay. And it it was just awesome cuz we were just doing it and like all of a sudden people start walking up to us and putting dollars in our thing and then it turned real and then we're just like I was like I was 15. I think he was 13. And we're just like doing this **** And like all of a sudden we started getting money. We're like we can get money from this. So, we went to the beach and then we like there was this old like Latin man. Please don't be good. Well, I was worried because I'm saying y'all are 13 and 15 walking around and I'm sure there's like this old it was like a old Latin grandma's birthday and she was so into it and like she just came over here come. So, we went over and we were just like talking to him and stuff and then all of a sudden the beach patrol comes up in their little in a truck on the beach. like and this guy's like hey guys you can't be you're panhandling we're like what he's like yeah you can't panhandle I'm like wait what if we don't ask for the",
      "start": 233.2
    },
    {
      "text": "their little in a truck on the beach. like and this guy's like hey guys you can't be you're panhandling we're like what he's like yeah you can't panhandle I'm like wait what if we don't ask for the money cuz we at that point we were asking for money and like if you don't ask for it and they just give it to you that's fine but also no girations and I was like damn like that really how are we going to ask how are we supposed to get it while we're doing this true is up on the um on his truck how true I don't know you and True would it be the worst I want to know true so he starts stretching on the truck he's like yeah is is stretching Okay. Is this okay? Like what's the limit? How what counts as giration? Is this too fast? And like doing all this stuff and then it was an adventure . We went on the boardwalk. They beat him with now. Now she was serving 13 to 20. We went to the tattoo like little like henna tattoo thing and he just straight up walks up to the girl's like, \"Hey, can I get a",
      "start": 275.52
    },
    {
      "text": "the boardwalk. They beat him with now. Now she was serving 13 to 20. We went to the tattoo like little like henna tattoo thing and he just straight up walks up to the girl's like, \"Hey, can I get a kiss on my ass?\" She's like, \"What?\" He like turns around. He's like, \"Give me some lips. I want lips on my butt cheeks.\" And so we used the money to buy that. Then we went to the arcade and played DDR. We made a lot of friends that day. It was You played DDR in the thongs? In the thongs. Yes. So now the beauty of this there's a video of all this on the internet. The great Santa Cruz thong adventure. Google it. Well, we can just link it, can't we? Is it on YouTube? My channel was taken down that it was on. There's a MySpace video of this. All right. Find it and we'll put it in the description. But this is the usual thing where I say you have to remember that cuz I'll forget it. Yeah. So, I feel like the the commando Wait, sorry, real quick. I just want to say Yeah. My first 500,000 views.",
      "start": 313.6
    },
    {
      "text": "But this is the usual thing where I say you have to remember that cuz I'll forget it. Yeah. So, I feel like the the commando Wait, sorry, real quick. I just want to say Yeah. My first 500 ,000 views. That was my first violent video. Wow. Yeah. That's also counts as porn. I want you to know that counts as porn. 13-year-old boys gyrating. Yeah, that's why they took it down. That's probably why they took it down. They're like, \"hm, this is child pornography.\" But I guess it doesn't matter if you make it whatever. Uh my only concern with the Commando would be that so I tend to wear my jeans for like three to like three to five days maybe depending on the activity and they're like, you know, they're jeans. I'm like, I can get a few days out of this. I would worry that the Commando might decrease the longevity of the jeans. Time out real quick, too. 3 to 5. How many how how many days you wear your jeans? Uh usually for like a work weekend and I'll I'll get rid of them. Okay. I'll do two to",
      "start": 351.92
    },
    {
      "text": "the longevity of the jeans. Time out real quick, too. 3 to 5. How many how how many days you wear your jeans? Uh usually for like a work weekend and I'll I'll get rid of them. Okay. I'll do two to three days probably. I don't really have them a lot. Really? I don't play by games. But by the way, they say forever eventually just builds up and like I've sat on a lot of MUN seats with these thing. That's almost like the second I smell jean cuz you know dirty jean where it has that sheen of like brown on it. If I touch it and I'm like oh this feels nasty or if I smell I'm like I'm done. I usually do a work week as well. Yeah. By the way, I just as a quick aside to this particular topic you're talking about, I was reading something with Tommy Hilfiger and a few other guys where they were saying like you should never wash your jeans. Just don't wash your jeans at all. And they had the head of Levi said that he's like, \"I've never washed these jeans.\" They say you could put them in a freezer",
      "start": 388.72
    },
    {
      "text": "like you should never wash your jeans. Just don't wash your jeans at all. And they had the head of Levi said that he's like, \" I've never washed these jeans.\" They say you could put them in a freezer to like to like kill whatever's on them or whatever. But like that a lot of jean manufacturers say like just don't wash your jeans. There's no reason to wash your jeans. That's gross. Wow . That's weird. That'd be bad. That'd be like wearing the same pair of underwear for like Yeah. So that's my problem is that you're collecting all of the the schmuts. That's the concern here, of course, is when you get the mud butt. Yeah. Oh, swamp butt's the worst. Yeah. You can't be you can't be having the any poop. And you get swamp butt a lot in this city because you get flash heat where you're like, \"Oh, it's so cold. I'm going to like I'm going to bundle up.\" And then all of a sudden it's super hot and you're like, I'm sweating and I'm getting the swamp butt. Yeah. It's not good. Sorry. So, do you do",
      "start": 426.8
    },
    {
      "text": "so cold. I'm going to like I'm going to bundle up.\" And then all of a sudden it's super hot and you're like, I'm sweating and I'm getting the swamp butt. Yeah. It's not good. Sorry. So, do you do commando? Swamp butt is I did I did commando for a while. Get an idea. Yeah, swamp butt's the worst. I did I did Commando a little bit I think in college where I was like I'm going to try this. This is cool. It is liberating but there are those concerns, right? Because the the underwear is there for a reason . It is supposed to serve as a buffer between the skin and whatever the harsh material on the outside is. Um I I my uh sort of uh the way I got around it was just by doing boxers cuz I didn't like briefs. I was like brief are too constricting. Yeah, of course. You know, and then every all the girls of course like boxer briefs. I like to see guys in boxer. Oh, that's so cute. Boxster briefs. You've run it around like your little mom. You said this many, many, many times, but boxer briefs",
      "start": 458.88
    },
    {
      "text": "girls of course like boxer briefs. I like to see guys in boxer. Oh, that's so cute. Boxster briefs. You've run it around like your little mom. You said this many, many, many times, but boxer briefs are the yoga pants for men. For men, they are. No, I haven't. I don't know. Have I heard that on the show? Yeah, I like that. You talk about yoga pants and stuff, but I'm pretty sure. My wife bought me a bunch of boxer briefs when we moved in together. That Michael Kors. Uh, no. They were That's what I wear. Send them for me for free. Boom. I need more clearly. I think they were just Gap or or Calvin Klein. And she was uh she was like, \"Oh, you look so cute.\" And I was like, \"I think you look cute.\" I'm like, \" I think personally,\" and this is a very intimate thing I'm about to share with you all. Also, I'm glad we're all super best friends. Cara, five best friends around this table. Five best friends around this best table. Five best is that I don't like that it accent uates the muffin top",
      "start": 500.4
    },
    {
      "text": "Also, I'm glad we're all super best friends. Cara, five best friends around this table. Five best friends around this best table. Five best is that I don't like that it accentuates the muffin top because the boxer briefs, they suck everything in just a little bit and they let everything kind of tumble out on top of it. Whereas the boxers tend to be a little bit more loose and by the end of the day when you when you kind of are just walking around the boxers, you get that cool like they kind of sag a little bit and it shows a little bit of the V that you didn't know you had and you're like boom, I'm a little I do not know that V. Colin knows the V. Colin's had the V before. Um, so yeah, he's never Well, maybe when he played. Sounds like a disease. He's had the V before. You got the V. But yeah, that was my thing is I I like my, you know, I liked the freedom of the Commando. But I found that now in the boxer. And the only thing my wife doesn't like about the boxer, she goes, \" You look,",
      "start": 531.68
    },
    {
      "text": "yeah, that was my thing is I I like my, you know, I liked the freedom of the Commando. But I found that now in the boxer. And the only thing my wife doesn't like about the boxer, she goes, \"You look, it's too military. You look like you belong in like Vietnam.\" Like walking around in his box. She's like boxer. Boxers just aren't very flattering for guys. You look like you're wearing shorts. I mean, you look like a little kid. That's my You look like a little kid. Maybe that's maybe that's what she used to say. I wear when I was a kid, I wore the white tidy. Sorry. Oh, I wore those until I was in high school until But I I started wearing I started in middle school wearing uh wearing boxers and I've never gone back really because first of all, it's just it's not possible for these boxer briefs to contain the Italian package that the Richiro family gave me. Yeah. Um and at the same time and then it gets uncomfortable and then you're constantly like you kind of have to rap, right? Like",
      "start": 568.24
    },
    {
      "text": "to contain the Italian package that the Richiro family gave me. Yeah. Um and at the same time and then it gets uncomfortable and then you're constantly like you kind of have to rap, right? Like he's just not he's going to fight his way out of I got to breathe. Aren't boxers harder for guys? I've heard because you have to like kind of push down the bottom part of the shorts. Yeah, you got to do you got to do the slide. Like you got to make sure you tuck everything in between so it like sits nicely. And it does suck a little bit with it. Rides up. It doesn't ride up. Not with jeans. Not mine. Do they get puffy? They get all puffy in your jeans. You got to You got to just You got to just get used to it. You can do a little shimmy to get them to go down. So Colin, have you ever gone commando? Um probably. I don't really remember specifically. It's not It wasn't a life-changing event. I mean, there was a time uh in high school and in Yeah, I guess depending on where I was living in college",
      "start": 605.12
    },
    {
      "text": "Um probably. I don't really remember specifically. It's not It wasn't a life-changing event. I mean, there was a time uh in high school and in Yeah, I guess depending on where I was living in college where I would I would sleep naked. That's about as far as I would go cuz I I just felt like Oh, see in pretty much all of high school I slept naked. I loved that was the one thing but that was that was basically so not commando but not wearing boxers at that particular time. We've talked about this a little bit. I used to love sleeping naked in high school cuz in high school I grew up I was in Riverside, California where like probably the temperature right now is about 200 degrees. It's the temperature of the sun in that damn place and it's super warm and so you you literally if you had clothes on you'd be sweating at night no matter what . I have a fan on me, windows open and my mother is one of those Italian mothers who's like if you turn the air conditioning on I will kill you. I will",
      "start": 642.96
    },
    {
      "text": "on you'd be sweating at night no matter what. I have a fan on me, windows open and my mother is one of those Italian mothers who's like if you turn the air conditioning on I will kill you. I will eliminate you because you are costing me money and there's nothing more important to my Italian mother than saving money. Was there a time where it would get too hot where you put the AC on? Because I was in a similar house and eventually everyone would break. We would feud and eventually my my it had to be all three. my my dad, my brother, and myself both like reaching that breaking point and then we'd all converge upon the ther thermostat and just kick the thing on. And then you inevitably hear this. You'd hear like, \"Who the hell? Who turned that on? Who turned it on?\" And we just like, \"Hold out for as long as you can.\" Like we'd be defending it until she came up. But around Yeah. You'd have like the three and we'd lose. I mean, we'd lose inevitably cuz my mother is just a force to be",
      "start": 677.36
    },
    {
      "text": "out for as long as you can.\" Like we'd be defending it until she came up. But around Yeah. You'd have like the three and we'd lose. I mean, we'd lose inevitably cuz my mother is just a force to be reckoned with. But yeah, so to combat that, I would sleep naked. And that had a fun sort of side effect with that my parents when I when I was in high school, I used to love sleeping till like 1:00 in the afternoon. And my mom would always be like, \"You got to get up early and you got to mow the lawn on Saturdays because it gets too hot otherwise and you're not going to do it and I can't I can't put you out there legally because it's like child abuse.\" So my dad used to have to come wake me up and he'd come up and he'd throw the covers off me until that one time when I was like, \"It's too hot. I'm taking everything off.\" And then he came in and he like, \"It's time to get up. I'm never doing that again . Got walked out because I was just like, who wants to spread the butter? And you had",
      "start": 716.56
    },
    {
      "text": "hot. I'm taking everything off.\" And then he came in and he like, \"It's time to get up. I'm never doing that again. Got walked out because I was just like , who wants to spread the butter? And you had morning. You had some serious morning. That was I was saluting the flag, so to speak. The flag is hilarious. Um I don't know why. Oh, yeah. So, I love And then I came up to San Francisco, of course , and if you sleep naked in San Francisco, you're going to die of hypothermia. It's too cold. I love it. What I what I like to do is I have a sliding door to the the porch in the back and my room is I no matter how cold or warm it is , I I have the door open all day, all night. really unless I'm out here freeze. And once we I like because when you're in the covers it I used to when I lived when I went to college in Boston which is truly cold. Uh I used to do the same thing. I'd leave the window open and then you get under the and it was like 0 degrees out in the winter, you know. But then when",
      "start": 753.12
    },
    {
      "text": "to college in Boston which is truly cold. Uh I used to do the same thing. I'd leave the window open and then you get under the and it was like 0 degrees out in the winter, you know. But then when you're under the covers and Yeah. And and you're just like and and the heat's on so it's kind of conflict. You still have that fresh air coming in. That's that's essential. See I noticed that Greg doesn't doesn't leave the door open usually ever and I have no idea how he's not sweltering in that room. I get hot in there, but Christine is one who runs cold. I run hot all the time. I'm always hot. That's the thing. So , like Christine's always cold. So, like the door can't stay open. So, like there's plenty of nights I just sleep sprawled out in the in the in the boxer briefs on top of the covers. Partillo next to me being a **** internal or external heater. And then I just eventually get cold enough. Why does he put out so much heat? He's like one pound. I don't know if you looked at him.",
      "start": 791.84
    },
    {
      "text": "Partillo next to me being a **** internal or external heater. And then I just eventually get cold enough. Why does he put out so much heat ? He's like one pound. I don't know if you looked at him. He's Well, first off, he's 11 pounds. He's pure muscle. Look at that. All he is is All he is is muscle. All he he's this is a dog bread to bread, man. That's all he's here for. And he's just ready to give it out. There it is. Look at that. Portill, you give out that heat. But yeah, he's a hot dog. Yeah, I like that. Thank you. Thank you for that. So, I recently started this sleeping naked thing. I had never done it in my life and then I was like, I'm going to try this. I'm going to do it. It's awesome. It's Never mind. It's cool. There's a story . Where is this going? Well, I mean, okay, there is there is a story. Can I tell the story? It's not even a bad story, I guess. Yeah, it's not a bad story at all. Um, so a couple times ago when I went to Texas, she was like, \"Oh, I have a bunch of",
      "start": 826.88
    },
    {
      "text": "is there is a story. Can I tell the story? It's not even a bad story, I guess. Yeah, it's not a bad story at all. Um, so a couple times ago when I went to Texas, she was like, \"Oh, I have a bunch of surprises for you.\" I'm like, \"Okay, cool. This is going to be fun.\" You're like, \"I sleep naked. Surprise. Slow down.\" Okay. Slow down and tell the story more slowly. So, so I was like, \"Cool . Like, this is going to be fun. Like, what are we going to do?\" Right. And then, um, say things like that. We get in the car. We start That's the source of this. We start driving and she takes me to this random place and she's like cracking up the whole time and I'm like, \"Where are we going?\" She's like, \"I'm not gonna tell you.\" And we pull into this like just there's a lot of trees and like a it's like a beach like a nature park kind of thing. Tell me it's a nude is a nude beach. And she's like it's a nude beach. And I'm like no I didn't say that. The lady at the freaking front goes Yeah. She",
      "start": 866.8
    },
    {
      "text": "like a beach like a nature park kind of thing. Tell me it's a nude is a nude beach. And she's like it's a nude beach. And I'm like no I didn't say that. The lady at the freaking front goes Yeah. She wanted to be a surprise. I wanted to surprise him and just like we'd be like walking through like the little hills and trails and all of a sudden like see like a naked person and have them be like what the **** Yeah. And have them just be like what the hell's going on? What the **** Yeah. Exactly. But we go in and the we have to like you had to pay $10 to get in . And the woman's sitting there and she's like, \"So, just so she's like, \"Y'all know that uh it's it's clothing optional, right?\" And I turned and looked at Tim and Tim's like I was like, \"Yeah, don't say that.\" And I was like, \"It was supposed to be a surprise.\" So, continue. Then we go and I'm just like, you wait, so did you immediately strip down naked? Well, so we get there and I'm like, first off, you realize I'm from San",
      "start": 901.44
    },
    {
      "text": "was supposed to be a surprise.\" So, continue. Then we go and I'm just like, you wait, so did you immediately strip down naked? Well, so we get there and I'm like, first off, you realize I'm from San Francisco, right? Like new beaches, like this is a thing. Go to Dolores Park. Yeah. I had never been to one. I had never been one of there. I'll tell. So, we go and we just start we just start walking. We're there and there's just a couple naked people and stuff and then like I mean they were just naked people. No, not really. Thanks for being honest. Yeah. So, um I mean you know how that but the guys were hung though. Yeah, that's the thing. Like the No. Did you like when you were you like I have to look at that when the guys walk by or were you like trying to not look? Yeah. It's pretty much like sticking out there at you. Pun intended. Yeah, like new new beaches are one of those things where it's just, you know, it's like a bunch of families, right, and like older people and then just",
      "start": 940.24
    },
    {
      "text": "like sticking out there at you. Pun intended. Yeah, like new new beaches are one of those things where it's just, you know, it's like a bunch of families, right, and like older people and then just dudes that know they look good naked. Yeah, that's basically what that was. Like hiking around like he just chose to hike like right in front of me. I'm like, they're just doing squats and you're like, why are you why are you He could have gone so many different routes, but he just chose to walk right in front of me. And it was Yeah, that's exactly what happened. And then eventually like she was taking pictures to send her mom and like she was just taking selfies and while she was doing this I dropped my pants and there's a selfie that I have of her reaction like looking down like oh my god. And then yeah then I was naked and it was awesome. So then we're like **** this I'm starting this lifestyle. I'm into this. I'm start sleeping naked and then that's that's the source of that. That's",
      "start": 978.8
    },
    {
      "text": "then yeah then I was naked and it was awesome. So then we're like **** this I'm starting this lifestyle. I'm into this. I'm start sleeping naked and then that's that's the source of that. That's fantastic. You like it now? So I like it but I'm not in like with it. You know what I mean? Like I'm not like super into it. It feels it's good, but then every morning I wake up regretting it. It's just like I'm cold now. Oh, I I like when I'm going to sleep it feels good. I I'm a big fan of sleeping naked at hotels for some reason. Well, me too. You shouldn't, but I like I walk around my hotel rooms naked. My big my biggest tradition even when I go to Tokyo or Germany or whatever for work is there's always a bath in the like a nice bath in my hotel room and I take a bath every **** night. I'm just like I got to live this up while I can. Walk around naked. Got the TV on, every light on. Yeah. Yeah. Radio bling. Okay. I'm done. What's happening? I thought the source of him sleeping naked",
      "start": 1018.48
    },
    {
      "text": "just like I got to live this up while I can. Walk around naked. Got the TV on, every light on. Yeah. Yeah. Radio bling. Okay. I'm done. What's happening? I thought the source of him sleeping naked was because I sleep naked to try it. Sorry. Yeah, that also kind of started it too. Sure. I didn't say that. But yeah. Okay. She didn't know if it was acceptable for her to sleep naked. So then Tim, do you go command? It's acceptable for Colin to sleep naked and myself to sleep naked. It's probably more so acceptable for you. Commando for girls though. I don't you don't know that's not a thing. Well, girls wear tight jeans, right? Yeah. So, and so it should be better to have everything be commando. No, because you have the tight of like the inseam on your Oh, it gets a wedge like you get a jean wedgie. Yeah, that is the camel toe they call it, right? The moose knuckle. Yeah, but it's like worse cuz it's that hard material. I'm like, no, there needs to be a separation in that. And I just",
      "start": 1059.52
    },
    {
      "text": "wedgie. Yeah, that is the camel toe they call it, right? The moose knuckle. Yeah, but it's like worse cuz it's that hard material. I'm like, no, there needs to be a separation in that. And I just don't feel as as that. But the only time I did do that was um my senior year prom. I had to wear an all-white dress. That was It sounds like the start of a horror story. No, no, no. That's what I was worried about. I was so worried because there was it was just tight and it just fit perfectly to where there was nothing and I had a really low back. I couldn't I couldn't wear anything underneath it. That was the one time I ever did. I was scared as **** that entire night that something might like accidentally happen or go wrong. But luckily everything was all right and it was a success. Yeah. Cuz like and that's the thing they say a lot a lot I watch a lot of award shows with my wife, right? And so you can't like when something's that skin tight, you can't wear anything under that. You have",
      "start": 1100.08
    },
    {
      "text": "like and that's the thing they say a lot a lot I watch a lot of award shows with my wife, right? And so you can't like when something's that skin tight, you can't wear anything under that. You have to have a lot even the support for the for the upper part of your body like built into the dress, right? Or sticky or sticky or sticky or those weird things that like sticky or a chicken cutlet some people call them. I like chicken. Have you seen those things? Well, they're basically like, you know, glued bricks that just stick under everything up, which is cool. Which is cool. I wore that underneath it. That works. Oh, there you go. I'm not down with the commando thing because I like I just I wear my jeans like not too high, but like higher than a lot of people do , but lower than not higher than Greg. No, what I mean is like I don't sag my pants, but like I don't pull them up all the way. So, I need some type of undergarment to like kind of come out a little bit at the top. You know what",
      "start": 1144.8
    },
    {
      "text": "Greg. No , what I mean is like I don't sag my pants, but like I don't pull them up all the way. So, I need some type of undergarment to like kind of come out a little bit at the top. You know what I'm talking about? Yeah. Crack showing. Is that Yeah. It's like I need that little line to like hide the the man crack the goods. Yeah. Yeah. Plumber crack. So , yeah. So, I need that. And also, I've had a couple horror stories with involving my wiener and the the teeth. The teeth. Oh, yeah. Have you done it? So, yeah. I mean , you know, all it takes is that one pain when you never want it. And this isn't related to zippers, but it it is a huge reason why now I'm like super scared of that type of stuff. Um , there was one time when I was studying for a test. I just told you the story recently. Um, I was studying for a test and I was take a break of paper and I was going to take a shower and um I had to take a shower. Are you naked? What? You're reading a piece of paper. I was reading a piece of",
      "start": 1185.68
    },
    {
      "text": "was studying for a test and I was take a break of paper and I was going to take a shower and um I had to take a shower. Are you naked? What? You're reading a piece of paper. I was reading a piece of paper and then I had to take a shower but I was like, \"****, I don't have much time to like, you know, study so I need to keep doing this.\" So I was just reading reading and I put it down on my sink and like the paper was kind of off and I turned on the radio and that everybody dance now and you started dancing. So I started dancing. I'm naked and you that's just what happens, right? Like there's just when there's a mirror. We were talking about this earlier. Guys really like their wieners. So I'm looking in the mirror looking at my wiener and I'm like this is cool. And I I just start like then I spin around at one part and it spins and I feel my wiener kind of hit the the paper but I'm just like whatever. It was fine. And I then I get blood all over the room. I get in the shower and like the",
      "start": 1228.32
    },
    {
      "text": "spin around at one part and it spins and I feel my wiener kind of hit the the paper but I'm just like whatever. It was fine. And I then I get blood all over the room. I get in the shower and like the water hits it and I'm like, \"Oh my god, what just happened?\" And I just realized I got a paper cut. And then I looked down right across the hole just freaking So it's like a plus sign. Yeah, there's a plus sign. **** So of course of course with my first cell phone I ever had I took a picture. So I'll always have that. What is wrong with you? Can I see the photo? I showed you it. I uh Not the picture. I cut my balls with a razor once but it was me too. Yeah, but it was it was unfortunate because I've always shaved with down there with like just a Mach 3 or whatever. And my girlfriend had this has this thing where it's like I don't know like what kind of it's like a special razor that 20 blades. No, it's not it's not the amount of blades. It's like something where it's like a little",
      "start": 1266.4
    },
    {
      "text": "this has this thing where it's like I don't know like what kind of it's like a special razor that 20 blades. No, it's not it's not the amount of blades . It's like something where it's like a little raised to I guess help like I think it's for men like to help like shave down a little bit but not all the way or whatever. So the blades like a little bit raised and she's like try using this thing instead. It came with like your Mach 3 set or whatever. I was like okay. Or like kind of extra teeth hanging off of it. The razor's underneath it. Yeah. Yeah. It's so it doesn't shave it bald. And I like use it, you know, you pull it taut. Pull it taut. You know, you got to get and I **** nailed it. Like and I got so I actually I feel bad cuz I took it all out. I'm like, why did you give me this **** thing? I've been doing this for years and years and days in it like slashed my ball. Like I was like I was in the shower and it was like the blood was just like coming down my leg and then in",
      "start": 1312.96
    },
    {
      "text": "**** thing? I've been doing this for years and years and days in it like slashed my ball. Like I was like I was in the shower and it was like the blood was just like coming down my leg and then in the and when the when the cycle hits it that's when you wake up that's when you're like something and I was scared because I'm like damn like this is it's a lot of blood flow. Yeah. I'm like Jesus Christ like am I like is am I okay? There's something about ball injuries that is just unlike any you're terrified that it's going to hurt you for later. Well, not only that though like the cut doesn't go away for so long like that. I think the only the only time this ever happened to me was when I first the idea of manscaping occurred to me back in the day. I think it was like early college. I was like, I will I would I should take care of that area, right? I'm sexually active now. I should probably I've become sexually active. I have to make sure my backyard is completely groomed if I want to",
      "start": 1352.08
    },
    {
      "text": "like, I will I would I should take care of that area, right? I'm sexually active now. I should probably I've become sexually active. I have to make sure my backyard is completely groomed if I want to have a barbecue. Um and so I was like, well, what do I do it with? I didn't realize you should probably use a razor because that's a more precise instrument. I tried to do it with just the Nurelco beard shaver. Like Oh, I thought you were going to say scissors. Yeah, me too. I didn't know where we're going with this. No, no. This is worse though because the beard shaver is you have to have a tight smooth surface that you roll over it with. Otherwise, like you know your skin on your face is different than your skin obviously on your scrotum where your skin on your scrotum is a lot more mal malleable in that it tends to get sucked up into things a little bit more. So you go you try like I was like all right I'll just try to this and then and I had the guard on, right? But what I didn't",
      "start": 1392.96
    },
    {
      "text": "malleable in that it tends to get sucked up into things a little bit more. So you go you try like I was like all right I'll just try to this and then and I had the guard on, right? But what I didn't realize was the guard wasn't going to wasn't guarding **** It's not guarding **** And so literally within like the first three seconds I was like we're done. That's it. And that thing bled and it just Yeah, because it the razors as they move this way it just sucked up the skin right into it. Oh my god. And just nice little have that and I can imagine pierce right across. I'm never doing this again. That's just a harsh reality of of you know grooming. You got to go slow and you have to be like deliberate. Deliberate. See at this point like like I said I've been really scared off this stuff. I essentially just leave my balls alone. Really? Yeah. I I like I like a a Sha scrotum. There's nothing quite as breathtaking as a Sha scrotum. Little Dr. Evil action. Uh yeah. I mean to like it's",
      "start": 1427.6
    },
    {
      "text": "I essentially just leave my balls alone. Really? Yeah. I I like I like a a Sha scrotum. There's nothing quite as breathtaking as a Sha scrotum. Little Dr. Evil action. Uh yeah. I mean to like it's it's dangerous down there, man. But you got to you got to take care of it. I think you got to take care of it. I've been getting you cannot fight that battle. I remember the first time I did it when I was in high school. I was like, damn, I gained a lot of girth down here just by getting rid of this thing. That's what I've heard from guys. And you don't and you don't realize it until it's until it's just bare down there. And you know, I've got a little at my old age. It's funny. I got, you know, I've gotten I don't take the grass out completely. I just keep Oh, I I do tight. But you just go bare. Yeah. Because And then I just let it grow back for like weeks and then I just let it go and then I do it again because otherwise it's like that's that's too much work . But talking about ball pain",
      "start": 1467.04
    },
    {
      "text": "Yeah. Because And then I just let it grow back for like weeks and then I just let it go and then I do it again because otherwise it's like that's that's too much work. But talking about ball pain real quick. I just I've been talking to my girlfriend about this recently because every once in a while she'll she'll like, you know, like tap me or go like that like like when I do something. girls have no and I'm like and she's and she'll yesterday just yesterday we were watching I said something snarky to her and she was just like that on my I was like and it's like and I'm like I'm like you don't understand it's that hollow it goes all the way up to your head and like it takes the part yeah you know it's coming you're like oh god here it's weird too it doesn't really hurt your balls it's all I'm curious about it makes it hurts your stomach and like like it makes you like almost nauseous Do you guys have the one friend? I have the I have the one friend that it's still a thing for like",
      "start": 1504.56
    },
    {
      "text": "all I'm curious about it makes it hurts your stomach and like like it makes you like almost nauseous Do you guys have the one friend? I have the I have the one friend that it's still a thing for like we're drinking and we'll all be like I haven't seen him in 6 months and we'll all be drinking and it's like haha and then you get that one second where he looks and you know and you're like I'm not I'm not fast enough to deal with it cuz I'm drunk. And he just lays into it tries to catch both at the same time and then it's a thing for the rest of the weekend if you're at a wedding or something the rest of the week you have to get each other back and like to the point where someone's bleeding on the ground like that's so not cool. There's like a a dude code. There's a **** that. There's a human code. You should not do that to anybody. But it's so funny to me. It's still so when it's not happening to me, I think it's the funniest thing when someone just walks by like, \"Hey, what's up?\"",
      "start": 1542.92
    },
    {
      "text": "human code. You should not do that to anybody. But it's so funny to me. It's still so when it's not happening to me, I think it's the funniest thing when someone just walks by like, \"Hey, what's up?\" and the guy's not looking and you just give them a little just backhand it and they they crumble. It sucks cuz I would never do that to someone and then **** just do it to me all the time. And I'm just like, great. Now I'm just in pain. See, you start that game though. That's that's You can't end that game ever. Once that game started, it's like a gang. You're in. You're in. You can't get jumped out. You're a jet for life. Well, this is actually a really funny segue. Did you hear about Gang Related? Segways. Gang Related. Yeah. No, the new game at IGN. There was a new game created by Kevin and Alex Salamita called Gang Related where they have this bean bag and then they sit and they just toss at each other's dicks. So, it's like it is the same exact thing. It's like a gang and they see",
      "start": 1580.24
    },
    {
      "text": "and Alex Salamita called Gang Related where they have this bean bag and then they sit and they just toss at each other's dicks. So, it's like it is the same exact thing. It's like a gang and they see how far they can get. Good story. All right. Just amazing. That's what we do. Ladies and gentlemen, that's another episode of The GameOverGreggy Show. It's been our pleasure to serve you this evening. Thank you, Nick. Thank you, Tim. Thank you, Cara. Thanks, Cara. Thank you'all for having me. Thank you for coming. I had a lot of fun. Y'all are very, very interesting. I like when you say y'all. It makes me really happy. I didn't even realize I'd do it, but I did meet a guy on the plane who said hella and I knew he was from California. Like, are you related to Tim Gettys? Yeah, right. Thank you, Colin. Thank you. Ladies and gentlemen, remember The GameOverGreggy Show posts every week. It is four, sometimes five best friends around this table, bringing random topics of conversation for",
      "start": 1613.84
    },
    {
      "text": "you, Colin. Thank you. Ladies and gentlemen, remember The GameOverGreggy Show posts every week. It is four, sometimes five best friends around this table, bringing random topics of conversation for your enjoyment. We post the entire show every Friday as an MP3 for $1 at gameoverg.bandcam.com. If you don't think we're worth it, we understand we don't think we're worth it. That's a great deal. Oh, we I mean , we totally are. We totally think we're worth it. Come to youtube.com/gameovergy. Monday through Friday, every topic gets broken out one by one until the entire show goes up. Then make sure you go to districtlines.com/gameoverg. Bu-shirts like this Oreo one . Oh, that's a great t-shirt. Look at me dance. That looks like heaven feels on people's skin. That made no sense. Nope. It's been our pleasure serving you. We'll see you next time. Bye. [Music]",
      "start": 1656.48
    }
  ]
}
