{
    "id": 304,
    "video_id": "VBpFM58pjEk",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Words That Disgust You - The GameOverGreggy Show Ep. 26 (Pt. 2)",
    "description": "Full Episode Friday! Get it EARLY here! http://gameovergreggy.bandcamp.com\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1401779459,
    "duration": 1016,
    "transcript_chunks": [
        {
            "text": "Um, Tim, yes, give me your topic. So I think it was last week we uh somebody mentioned, I think it was Colin, it sounds like a Colin thing to say, he mentioned the word damp and it upset me. It upset me dearly. Was it damp? It was damp, yeah. A lot of people were tweeting me the, I guess one of the quotes which was, \"Damn, girl, you're damp.\" Yeah, yeah. I don't know who said that though. I say said it turns out in England that's actually does mean that, that they say that, \"Hey, that girl's damp for you,\" or \"that girl's damp.\" Really? They say some weird **** in England, don't they? Yeah, I don't know about that. They can grab their bevvies and go do whatever they want. They got to go to the loo. Yeah, it's just my dad's name. Oh, wait, is Cheryl in the bathroom? Maybe she was probably thinking a shower, so you she go in. Yeah, girl, my girlfriend's in the bathroom, go in. She's fine, she's fine with it. She's taking a bath. Christine loves them baths. Pee in the sink. Yeah, we're fine. We're we're laid. Everyone pee in the sink. We",
            "start": 1.1
        },
        {
            "text": "girl, my girlfriend's in the bathroom, go in. She's fine, she's fine with it. She's taking a bath. Christine loves them baths. Pee in the sink. Yeah, we're fine. We're we're laid. Everyone pee in the sink. We all, we went to college. Yeah, I did do it in the sink once. I opened the bathroom door in college to the crappy Antler House bathroom and it was like, I don't know, 3:00 in the morning after some party, mean like in Missouri, you know, it's a million degrees in the summer, the windows are wide open, we had didn't have screens . And I open the door and there's just a bat flying on the thing and I shut it, went and peed in the sink, right back to bed. I was like, someone else can deal with the bat in the bathroom right now. There was one time when I was like, \"1...\" Do you pee in the sink before you go outside to pee? Yeah, I did this time. That that would have been a better idea,'cause my first thing would have been go out on the lawn. No, that's a great idea. I should have done that. You're right. Growing up in Riverside, I used",
            "start": 47.12
        },
        {
            "text": "I did this time. That that would have been a better idea,'cause my first thing would have been go out on the lawn. No, that's a great idea. I should have done that. You're right. Growing up in Riverside, I used to do that just for fun,'cause it would be so hot, you'd be outside anyway and be like, \"I'm not going to go inside, waste air conditioning,\"'cause you open the door. Yeah, you just go outside. That's a good idea. It's very liberating. Should have done that, shouldn't? There was one time when I was 1, I was sleepy and I woke up and I had to pee and I had some garbage I had to throw away. I went to the bathroom, threw the garbage in the toilet, went to the garbage and just started pee. I'm like, \"Oh my God!\" I realized halfway I started pe eing into the garbage. Yeah, that's really weird. It was really your parents should have given you back to the people that you stole from. Should have given you back to me. I was a little kid. Mhm. And I've never told anyone this story. Really? No, I don't think I've ever... You like to tell stories, so I",
            "start": 83.2
        },
        {
            "text": "you back to the people that you stole from. Should have given you back to me. I was a little kid. Mhm. And I've never told anyone this story. Really? No, I don't think I've ever... You like to tell stories, so I can't believe there is a story you've never told. Well, it's one of those things, we, how often do we just start talk about peeing in weird places? Doesn't every episode? Every episode. Never told. When I was a kid, for some reason, I had gotten it in my head, I don't know, monsters or ghosts or whatever, but I was like, I didn't want to go out of my room to go to the bathroom, so I'd pee in this Dixie cup I have and then I would toss it on the wall behind my dresser. You w-what? Wait, wait, there's two problems with this story. You were peeing in a Dixie cup? What, do you have the bladder a size of a walnut? And why do you have Dixie cups in your room? I don't remember that part of the story. I don't, I don't know. And then you would just splash it on the wall? Yes. You were like 16 years old, weren't you? Did",
            "start": 115.08
        },
        {
            "text": "do you have Dixie cups in your room? I don't remember that part of the story. I don't, I don't know . And then you would just splash it on the wall? Yes. You were like 16 years old, weren't you? Did your mom come in and just... No, no one ever called me on it. I I I was perfect. Then we moved out of the house, like that smell. And I guess I guess I didn't do it that much. It must have been only maybe three or four times my lifetime. That's **** weird . I know. That's a great... How old were you? I don't know. I'm I mean, I was young for sure. Is this what playing the Master System as a kid does you? I made a lot of bad decisions as a young child. Wow. I think the word Lube, that's a weird word. So yeah, good. Wait a minute. I cannot believe that that word bothers you. Lube. It does. It just bothers me a little bit. See, there's a lot of words to did I enjoy like you're very like I I do talk, you're lubby. You're very like crass, like easygoing, free-flowing person. Not a scumbag. That's just not a nice thing to say to",
            "start": 158.84
        },
        {
            "text": "there's a lot of words to did I enjoy like you're very like I I do talk, you're lubby. You're very like crass, like easygoing, free-flowing person. Not a scumbag. That's just not a nice thing to say to people, Greg. I like it. It shows my endearment. You're hurting his feelings. That the Producer Seducer is, it's accurate. Watch out, ladies. It takes a vill men and men. Lube. Um, lube, yeah. Lube's just a weird one. I don't know why. I just think that one. I don't think we ever officially said the topic. You did say the topic. No, didn't you? No , we went off talking about pee. I think people are assuming it's words like words we don't like to bother us. Okay. And all this stuff. Lube's one of those to me. Yeah, it's bothersome. Uh, if any of your viewers watch Gamescast, you know there are two words that I don't that I just don't say: poop and pee. I'll say that one. You don't say poop? Penis? I just don't. No, I don't see that. I also don't say the word for uh flatulence, fart. Really? I didn't know that about you. And fart, I will, I",
            "start": 202.08
        },
        {
            "text": "don't say poop and pee. I'll say that one. You don't say poop? Penis? I just don't. No, I don't see that. I also don't say the word for uh flatulence, fart. Really? I didn't know that about you. And fart, I will, I just do not say those two words. Whoa. My goal because they're'cause poop and fart, you feel like, makes me feel really juvenile. What's your stance on Butthead? I'll say butthead. But awesome. I'll say butthead. Whatever, **** you, man. I'll say butthead. I don't like saying that either. I don't. Yeah, poop, yeah, it's a little weird. I like saying that. I got a poop. What? I wonder what I actually... You don't say it that way though. You, I think a ****, I got a poop. He does say he he does say that. Yeah. I also like holding in my poop until the last second. You like that? You like it? Yeah. If I if I'm in the vicinity of bathroom and there's no like worries about me getting to the bathroom in time, I don't like sitting in the bathroom for **** 10 minutes waiting for it to come out, sitting there twiddling my thumbs,",
            "start": 250.32
        },
        {
            "text": "bathroom and there's no like worries about me getting to the bathroom in time, I don't like sitting in the bathroom for **** 10 minutes waiting for it to come out, sitting there twiddling my thumbs, reading the... I'll wait until like it's go time. Yeah, and I'll be like, \"All right, let's go,\" and I'm in and out of there in 45 seconds. Really? Wow, that's impressive. I don't that's the opposite of me. Doesn't it like , doesn't the pressure just build it into something that's like rock solid? You got to let out a little bit of pressure. Remember when we talked a few weeks ago about pooping your pants on accident? Yeah, sometimes you let a little pressure out and you let the pressure out, the F, you fart. Sorry. Yeah, you apologize. I just choose not to say. Sometimes you go to fart to let the pressure out and you accidentally **** your pants. So it's it's a whole risk, kind of risk-reward, kind of risk-reward. You're threading the needle on this. Oh yeah, no doubt. Like you're doing the River Run, man. I've given, I've",
            "start": 299.84
        },
        {
            "text": "**** your pants. So it's it's a whole risk, kind of risk-reward, kind of risk-reward. You're threading the needle on this. Oh yeah, no doubt . Like you're doing the River Run, man. I've given, I've like, I the River Run. This is the this is the Kessel Run. I don't even know what the River Run is , but sure. I mean, that's if that's what you want. I was say something about rapids, running the rapids. It doesn't matter. I just feel like you have to maximize your time, but the rest of us don't. You enjoy your time in the toilet. I love it. It's the only time I get to myself. Like not texting me or talking to me or ask... Text all time while you ****. My my my girlfriend doesn't understand it. She doesn't understand why you like spend time. I'll read a comic book in the restroom,'cause of course she does not do that. No, women don't do that. Women don't get so like, I'll go in there and I have a stack of magazines in the toilet and then she just doesn't understand what I'm doing in there. It it it boggles her mind. Yeah, I mean,",
            "start": 334.44
        },
        {
            "text": "don't do that. Women don't get so like, I'll go in there and I have a stack of magazines in the toilet and then she just doesn't understand what I'm doing in there. It it it boggles her mind. Yeah, I mean, I'm in and out. You're fast too. Yeah, I'll sit there. I'll I'll linger. I'll linger if I have a if my phone's on me, if I'm I'm like a for, I'll just scroll for, you know, I'll read, be on the internet. I don't like the word horny. I think it's another juvenile thing. It just s-I mean, there's it just like, \"I'm so turned on right now.\" Things like that. Is there's no good word for a lot, substitute for that. We really like there's no good word for. You could use, you could take a cue from Austin Powers and say, \"Randy.\" Randy. But he ruined it when he says it. Ruined. I think it outside. I used to say shag all the time. I love the shag carpet. That is. I don't say anymore. Yeah, you like to shag carpet? No, that's not what I said. You like to shag carpet? You're rubbing yourself on the carpet, Greg. No, you do what Forrest does,",
            "start": 370.68
        },
        {
            "text": "where he has to like scratch his butt, carpet himself on the carpet all the time. That's true though. There's not there's not \"I'm turned on.\" There's a good word for poop, but fart. There's no good word for. There's a lot of good for that. Like when we talking about these, is that a thing? I got to go scat. I'm going to go scat into the toilet wall. I think that's actually a type of porn. Yeah. What is when you **** on someone? Is that really? I didn't know that's real. That's real. Scat's from Germany. Scat is like vocal jazz. Oh, well, that too. It's also now it's type of vile porn. I'd watch the vocal version of. No, I probably won't. Look, have you seen have you seen the the the the classic pornographic film Two Girls One Cup? Yeah, well, that was scat. Okay. But see, there's no no good word for the anatomy of male or female. No, you",
            "start": 412.32
        },
        {
            "text": "know all of it sounds nasty or just too scientific. Yeah, I got a boner. I mean, all yeah, my penis is engorged with blood. I I have an issue with that too because I try every once in a while I'll try to talk dirty to my wife. \"Talk Dirty To Me.\" It's a great poison. Oh yeah. And uh what, talking dirty to my wife? No, the song \"Talk Dirty To Me\" is a great song by... Awesome song. Talking dirty to my wife likes that song. Yeah, no, it is a good song. But I like the they originally were going to call it \"Talking Dirty To My Wife.\" \"Talk Dirty To My Wife.\" It didn't have the same pizzazz as just they wanted to get the single young folk to come to the... Yeah, it was it was written originally for 45-year-old crises. No, I try every once in a while I'll try to say something. I I'll flirt with the idea of like throwing out some sort of kind",
            "start": 460.28
        },
        {
            "text": "of nasty phrase and I just it doesn't work. Like, what are you going to say? I'm going to... You you end up with like a mix of clinical terms and nasty terms and my wife's just like, \"Dude.\" Just give me an example. Like, \"Oh, babe, hold on. Let me shut my eyes so into this.\" But now get into it. Don't fake it. Don't **** her. \"I'm going to insert my penis into your vulva.\" Yeah, that sounds really weird. No, but you that's ****. You would not say that. I know. You actually, I would say that just because I make my wife laugh and laugh and completely ruin the mood. Yeah, she hates it. And you just go back to watching Law and Order. Like that's your sex. Only kidding. Just like stare into her eyes and then you hear the donk-donk and it's back to TV. The donk-donk actually. Now I'm on to Voyager. Have you watched Star Trek: Voyager? I",
            "start": 508.04
        },
        {
            "text": "haven't. It's actually not bad. Not bad at all. Don't believe that for a second. It's actually pretty good, dude. It's better than that rubbish Deep Space Nine. I've never watched Deep Space Nine. I don't know. I'm sure some fans are really upset now. Yeah, Nick really likes upsetting people when it... If you follow me on Twitter, if you don't, it's Nick Scarpino. But let me know if Deep Space Nine is better than Voyager or vice versa because I'm going to probably watch Deep Space Nine next, but that might take me 45 years because there's so many episodes of Voyager. So it's a big time commitment. Let me know. Colin, did we cover any words you don't like? No. Do you have words you don't like? You like the you like the English language so much. I'm a big fan of it. The myriads of the words, the equidistance, equidistant. Uh, the words that",
            "start": 550.56
        },
        {
            "text": "words you don't like? No. Do you have words you don't like? You like the you like the English language so much. I'm a big fan of it. The myriads of the words, the equidistance, equidistant. Uh, the words that actually bother me are would and could. W-O-U-L-D and C-O-U-L-D. Really? As a kid, I'd uh was confounded by why these words were spelled that way. And there are still moments of like of of there I have lapses of judgment. The way he said the it reminded me of like Michael Richards on stage when he went crazy. He's like , \"Some words, some words.\" Thank you for that uh comparison. Yes, that's a pretty bad comparison. Um, yeah, I just those words just... I mean, there's, you know, we talked about moist last week, which is a word that I force myself to be bothered by but then say all the time to bother people. Uh, but those two words, I have lapses of judgment every once in a while where I'm like , \"Is it spelled like this? Could it possibly be spelled C-O-U-L-D and W-O-U-L-D?\" So those are actually the words that bother me the most. Really? Yeah , you",
            "start": 592.76
        },
        {
            "text": "have been against those words, not the usage of those words. No, I mean, could I, would I? Uh, yeah, would, could, would. There's like a silent L I don't like. Yeah, not a silent L. I don't like that at all. Doesn't have to always be vulgar sometimes. Yeah, yeah, yeah. Just me pour myself a drink. Lube. Are you done with your Old Fashioned? You're out. You're out of business on the Old Fashioneds down there. I'm done here. Top me off too while you're in there. All right. Yeah, I have a long list. Let's hear it. That's why I made this. First off, the vulgar ones I do not like. I said I not like any of the the names for these things. Like I I hate when people say ****. Like that bothers me a lot. In what describe? Call'pussy'? Calling someone a **** or other stuff. Like I just I don't like that. I don't like that at all. And I like",
            "start": 643.68
        },
        {
            "text": "things like I I hate when people say ****. Like that bothers me a lot. In what describe? Call'pussy'? Calling someone a **** or other stuff. Like I just I don't like that. I don't like that at all. And I like there's a lot of other words. C-word. When you call someone a C-word, I'm like, \"So not down with that.\" Sure, sure , sure. What if a girl said **** to you? What she what if a girl was like trying to talk dirty to you? That's she that's hot. I like, \"I want you to I want you to ram your huge **** into my ****.\" You you would be like, \"Ew.\" I wouldn't be like, \"Ew.\" Be like, \"That's awesome.\" But then later I'm like, \"Why the **** are you talking like that?\" But it would be awesome at the time. The funny thing about the C-word to me is that in England, um, it's used like totally willy-nilly and it's not even that bad. Like isn't it a term of endearment almost like sometime for some people? Like the way I call Nick a scumbag. You'd be something that. Well, in England, the word bloody is a bad word. So bloody, yeah, is a bad word. Yeah.",
            "start": 684.32
        },
        {
            "text": "it a term of endearment almost like sometime for some people? Like the way I call Nick a scumbag. You'd be something that . Well, in England, the word bloody is a bad word. So bloody, yeah, is a bad word. Yeah. That's bloody. It means like ****. Oh, it means like it's like an mean that bad. It's like a... Well, I mean, it's like, you know, \"this bloody awful movie.\" It's like saying, \"this **** awful movie.\" Wow, that's crazy. But they'll throw around that C-word like it's no one's business. Meanwhile, in the United States, that word is like make, you know, people are gassed when you use that word. It is the worst thing you can say. Yeah. I I oh, Cheryl's out of the bathroom. It's go time. We had everybody. Bird is on the move. It's go time. It's go time. Damon just said this, but I also really don't like the word ****. Yeah, no, I don't either. Talking about ear. I think I said this before on the show. Alexis says it in the nastiest way . She goes, \"Cack!\" I'm like, \"You make it sound like there's a freaking L in there. Get out of there.\" When did",
            "start": 728.84
        },
        {
            "text": "she say that word to you? Like what that happen all the time before she does stupid dance. Oh, that dance is the worst. Yeah, it is. So, okay, but besides those things, I don't like smoothie. It doesn't describe what it is enough. Like smoothies are good. That's weird. You're like docking points from this word. I like that. Um, nook and cranny. It's a set of words. Yeah, nook and cranny. Like Thomas'English Muffin. They got nooks and crannies. That's nasty. That's where the the butter goes in the jelly. Usually it's bad stuff. Other than Thomas'English Muffin. Then it's like the nooks and crannies in your house that are dirty or whatever. But just sounds the nooks and crannies in your body. Yeah, a lot of people. Some girl, would that be a nook or a cranny ? The pee-hole. Cranny. That's a cranny. Cranny. That's the",
            "start": 770.96
        },
        {
            "text": "definition of a cranny. You remember last... Can I start referring to my penis as the cranny? The nook and the cranny. I need you to touch. Last week on the show we talked about uh boob sweat because I was like I I was talking about my own boobs. I'm sweat underneath your breast. And some girl randomly on Twitter tweeted, \"Boob sweat's just the worst.\" And then some fan from ours was like, \"Oh, they just talked about this on The GameOverGreggy Show.\" And the girl like, \"What? No idea who this is.\" That's awesome. That's her fault for not knowing who we are. So going back to moist, damp, don't like those. Pimple describes exactly describes what it is and that sucks. Like , would you prefer now if you had to go with one or the the other for the rest of your life, pimple or zit? Was pimple acne? Pimple's nasty. I like pimple. It's",
            "start": 812.64
        },
        {
            "text": "too. It's it's like onomatopoeia for what it is, right? Also the word frog and ointment. You have a long list of. Walk away. You're still going down your list. Frog. What's wrong with the word frog? It bothers me because of how accurate it is to what it is. That's it's like too it's too good. Like a frog could not be anything else. Toad. But it's just it's... Oh, I think said chode. I don't like chode either. Chode's an awesome word. Chode is the word I'll defend to the day. Grund le is my favorite. I like grundle. Squirts. No good. Bulbous is bad. Puss. Dripping. And panties. I'm going to end on panties. Panties. You don't like ? I like panties a lot. No, panties. I got I got to fight you on that one. Panties are the best thing on the planet. Panties are awesome. But they're just not good to talk about, right? What do you say? How do you describe a",
            "start": 853.64
        },
        {
            "text": "woman underwear? You can say underwear, right? Underwear is fine. How do you speak to your girlfriend? I don't know. How do you speak to any human being? I just... Why is he announcing it like that to his girlfriend? Because they're talking dirty to each other. The assumption is that if you're going to use a word like these sexual words, so sexually charged . If I was ever going to talk dirty to my girlfriend, I'd call Nick and ask him like, \"Nick, what should I say right now?\" Don't say, \"What should I say?\" Put his... Yeah , be like, \"Nick, can you talk dirty to my girlfriend?\" Hold hold on. Yeah. Oh, here you go. That's all you need. You will be getting laid. How happy would you be if somebody called you was like, \"Hey, Nick, I want you to talk dirty to this girl.\" Oh, that'd be it would be ridiculous. You should have heard some of. Oh my",
            "start": 901.4
        },
        {
            "text": "God. Tweet Nick Scarpino phone numbers. The first time Nick met my girlfriend, do you remember this? Uh, vaguely. In 2008. It it was at a Halloween party. I was dressed as Snake Plissken. Oh my God, you were terrible. It was amazing. It was awesome. It was so funny. Was'cause she's hot. I was like, \"Colin, no, no, this is the one you're dating.\" And you're like, \"Yeah, that's my girlfriend.\" I was like, \"No, she's too hot.\" And then I just pretended like you didn't exist for the rest. It's a term of endearment if I hit on your girlfriend. I know. I think this weekend I was looking through a bunch of old pictures and I found one from last Halloween where you were a **** Obi-Wan Kenobi with your arms around my girlfriend. Both of them. Was it a good embrace? Well, one no, one arm was posing. Yeah, you got to flex one arm. You never wrap both arms",
            "start": 938.76
        },
        {
            "text": "around the girls. Guys always flex one arm just in case the camera's on. Just in case. All right, all right. That one's in the bank, if I do say so myself. That's a word I like. Bank. Yeah.",
            "start": 983.48
        }
    ]
}