{
    "id": 138,
    "video_id": "Oj84yfunJww",
    "show_name": "A Conversation With Colin",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "What if Colin Moriarty was President? - A Conversation with Colin",
    "description": "With the government shutting down and all hell breaking loose, the question has to be asked: What would happen with President Moriarty? \n\nToday's topics were submitted by Chris Bloch. Leave your suggestions for future conversations in the comments below.\n\nSUBSCRIBE/LIKE/SHARE\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nSubscribe to our channel: http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Tim for filming.",
    "published_at": 1380805201,
    "duration": 612,
    "transcript_chunks": [
        {
            "text": "What if Colin Moriarty was President? - A Conversation with Colin\nEgypt gets a certain amount of money from the United States every year, yeah, you know why. What's up everybody, Welcome to A Conversation With Colin. I'm Greg Miller and this is my roommate Colin. Now sometimes Colin says crazy stuff, so every Tuesday and Thursday, I reach into my random topic pile, pull one out, toss it at him, we talk it out for your amusement if you like that. Like the video, subscribe to our channel, share it with your friends. Colin, are you ready? Yes. Today's topic of conversation is: If Colin became president, what would he do for this country? Submitted by Chris Bloch. Thanks, Chris. First things first, get rid of that Congress so I can be an actual dictator. You're gonna be king, no one... uh, I would um, the President doesn't have a lot of power, so you'd have to hope that I was elected with a like-minded House and Senate, and then uh, and then we would get down to business. Let's say it happens; what do you want to do? What are you going to do to this country? Uh, the first thing that I would do is try to...",
            "start": 0.2
        },
        {
            "text": "and Senate, and then uh, and then we would get down to business. Let's say it happens - what do you want to do? What are you going to do to this country? Uh, the first thing that I would do is try to um roll back the entitlement programs, uh, in a sense that so entitlement programs like Medicare, Medicaid, Social Security - not to get rid of them because we can't get rid of them now, like practically, in terms of like libertarian principle, like I don't believe these programs should really exist. Yeah, but to like they exist and people really like really a lot of people that don't like them deny the fact that people depend on them and like set up their whole lives and anticipation in them, like Social Security which is you know 80 years old now or Medicare which was in the mid-60s this isn't like a new thing where you can like take it away from someone now. But you have to you have to do something in these programs to make them more solvent um and so like one of the",
            "start": 47.04
        },
        {
            "text": "in the mid-60s this isn't like a new thing where you can like take it away from someone now but you have to you have to do something in these programs to make them more solvent um and so like one of the things that I would do like we often we hem and haw about raising the age of retirement like one year and like what we really need to do is raise the age of retirement like five or 10 years um what's it now 65, 66 you can retire I think it's early 62 and a half okay with Social Security but if you wait until I think you're even 67 or 69 you get more money every month but they tell you to just take it at 65 because your average lifetime will not likely not exceed the amount you were getting even if you were getting paid more per month so you would actually get paid more if you just took it to 65 whatever so I would say like you can't retire start getting benefits from the government till you're 70 or 75 um okay that would make the situation a lot more solvent for the",
            "start": 96.32
        },
        {
            "text": "\"Took it to 65, whatever. So I would say you can't retire and start getting benefits from the government till you're 70 or 75. Um, okay, that would make the situation a lot more solvent for the people down the road because like we're paying into these systems now, that that might not be there, certainly at this rate, not going to be there. So the one thing Portillo shut it, the one thing that we uh we brought we broke out these beef sticks right where we shot now now P's on Cloud9 running around here. The one thing that we don't like to talk about is um that we have systemic problems with these entitlement programs that need to be taken care of and and I feel like we either deal with them now when we can kind of deal with them in a way that best suits us, a series of bad situations or just let the situation play itself out. It's going to be worse, yeah, but if we let it play it out, it'll be just like the bank thing right where at the last second government steps in.\"",
            "start": 132.72
        },
        {
            "text": "of bad situations or just let the situation play itself out it's going to be worse yeah but if we let it play it out it'll be just like the bank thing right where at the last second government steps in makes some kind of giant move to save all this crap yeah but what are they going to do I mean like oh no like I was telling you the one where we were talking about the end of the world or whatever how is everything going to go to crap like I don't know it's the same thing as always there's always we're always teetering on the edge and then something always comes along to save us oh here's this thing yeah the banking situation was tough because that had everything to do with the economy but like and this isn't as serious in that specific way but there's more unfunded liability in Medicare and especially in Social Security that people just pretend doesn't exist like we make promises that eventually won't be able to keep in the intake and correspondence with the Congressional Budget Office",
            "start": 175.56
        },
        {
            "text": "in Medicare and especially in Social Security, that people just pretend doesn't exist; like we make promises that eventually the intake and correspondence with the system don't correspond with each other. Okay, so we have to do something about that. Raising payroll taxes to pay for it is not acceptable - I mean, we already pay way too much in payroll taxes. So, one thing I would want to tackle is taking care of our older senior citizens, but we just can't do it until 75; you've got to figure it out. With life expectancies going up so much, there are people that retire - back in the old days, especially in private companies, you could have retired at 50 or 55. There are people that are 90 years old that have been retired for 35 years, and on Medicare and Social Security for 25",
            "start": 207.6
        },
        {
            "text": "in private companies, you could have retired at 50 or 55. There are people who are 90 years old and have been retired for 35 years, receiving Medicare and Social Security for 25 years. When Social Security was created in the early 1930s, life expectancy wasn't 80 years old; we've never adjusted it to correspond with increases in scientific and medical advancements that save lives. Medicare was a product of the 1960s, when we wanted to take better care of elderly people who couldn't afford their medical care, even though medical care was expensive back then. I'd want to address those issues, but also get our taxation and spending problems under control; we spend too much money on things like foreign aid which we have an enormous amount of money for",
            "start": 248.92
        },
        {
            "text": "also want to get like our Notaxation and our spending problems under control as well we spend too much money um we have an enormous amount of money that we spend on things like uh foreign aid which we should be doing none of we should have no foreign aid at all there should be no foreign aid um and our for like and what I mean by that is like a country gets a certain amount of money from us every year like that doesn't happen for us like Egypt gets a certain amount of money from the United States every year yeah you know why if we have like a situation where there's a humanitarian crisis we can deal with that at that time and say like we're going to send $500 million worth the food here we're going do this or that but we don't have to have this predictable system in which we give away money that's not acceptable to me you know um so I I would try to you know nip that in the butt as well uh I think we can cut spending across the board I would love to cut spending in this country by 50%",
            "start": 290.8
        },
        {
            "text": "that's not acceptable to me you know um so I I would try to you know nip that in the bud as well uh I think we can cut spending across the board I would love to cut spending in this country by 50% I mean that would see things like that would hurt the economy but I feel like we would be better off in the long run what we really need to ask ourselves is like are we willing to hurt ourselves now to make sure we're not hurt even worse later yeah and these are the hard decisions that politicians must now make um they don't though they just sit there nothing happens and like so the problems are going to be bad if we take care of them now or they're going to be cataclysmic if we let if we don't take care of them in the future think about think about the situation I mean it's not it's not quite parallel but after World War I we had this thing called the Treaty of Versailles and Germany and Austria started this war with some of the Western Allied Powers whatever and they lost",
            "start": 326.64
        },
        {
            "text": "It's not quite parallel, but after World War I we had this thing called the Treaty of Versailles. Right? And Germany and Austria started this war with some of the Western Allied Powers, whatever, and they lost. They lost, and this war was useless; the line never moved more than like 15 miles, like the front line of the battle. It was a total waste of time, and a bunch of people died, and gas attacks, and trench warfare - it's some bad stuff. But this resulted in the Treaty of Versailles, in which Germany was blamed rightfully so for the war and had to pay reparations. And I almost look at our situation as having them know they had to pay for it, and they couldn't pay for it, and they didn't know what they were going to do. The situation they did was they printed money to pay for their debts, hyperinflated their money to the point where if you walked into a café to order coffee and then sat down and drank it, and then went to pay for it, it would cost more by the time you went and...",
            "start": 365.36
        },
        {
            "text": "their money to the point where like if you walked into a cafe to order coffee and then sat down and drank it and then went to pay for it, it would cost more by the time you went and actually paid for it. I'm saying a situation now where we have to pay for these different things and we know we have this predictable problem of money but we don't do anything about it. The only way out is to do something like really self-injurious, like print money. You'd never get elected because you'd be saying we have to take the hurt now - nobody wants that. I mean, there were people making that argument in 2008, talking about how much pain we would have been in if we let the banks fall, unemployment would have been 25%... yeah, rather it would be like 25%, we would have had",
            "start": 404.96
        },
        {
            "text": "pain we would have been in 2008 we would have been employment would have been 25% if we if we let the banks fall unemployment yeah yeah unemployment rather it would be like 25% like we would have had mass problems in this country the likes of which we've never seen before but that would have removed the systemic problems off of the books and we would have been able to start again and we would have been recovering and have a real recovery by now yeah yeah what we have now is like a patchwork where like yeah unemployment 7% but it's really not it's like 15% and they just lie to you and they mix the numbers up to not scare everyone and then we still have those systemic problems and at some point someone has to say and I would be that person I would like to be that person if I would have run for president would be like we have real problems and we need to deal with them now and it's going to hurt yeah you know it's going to hurt really badly but and it might actually hurt our entire",
            "start": 441.16
        },
        {
            "text": "run for president would be like we have real problems and we need to deal with them now and it's going to hurt yeah you know it's going to hurt really badly but and it might actually hurt our entire generation and make our generation the first generation that lives worse than our parents did but our kids will be better off because right now we're living better than our parents and our kids are going to live worse than we are and so like by tackling specific instances like that I think it would be the honest and right thing to do for posterity you know yeah the **** up thing is that we didn't do anything our parent's generation are the one that **** everything up thanks a lot mom and dad our grand parents for divorcing and our grandparents generation are the one that are taking everything from the system and not putting anything back **** grandma and grandpa so fought in World War II think they can do whatever they want you know I mean it's it's not it's not a matter of malice it's a matter",
            "start": 475.32
        },
        {
            "text": "and not putting anything back **** Grandma and Grandpa so fought in a World War II, think they can do whatever they want, you know. I mean, it's not... it's not a matter of malice; it's a matter of like that is the fact like they're taking out more than they put in. You can't do that, yeah. Because then the people behind you have to pay more. But there's a bunch of stuff I'd like to do like that. I mean, it's just... it's just I don't know, man. It's it's it's a it's a complicated problem. I think we can cut defense spending by 50%. You think you ever going to run for president? No, but yeah. I think like you know everyone like well what about defense? What about all the... yeah, cut defense by 50% whatever. We spend more than the next 10 countries combined on our military, you know. Okay, I I think we can do all sorts of practical things. But I would lower taxes; I would get rid of corporate tax completely. I would encourage companies to come here and build factories and have their corporate base here.",
            "start": 512.92
        },
        {
            "text": "do all sorts of practical things, but I would lower taxes. I would get rid of corporate tax completely. I would encourage companies to come here and build factories and have their corporate base here and not tax them at all that way we have uh people at work and they pay the taxes but at least they're working you know. Yep, well thanks Chris Bloch for that topic conversation every time we talk about this stuff I get so depressed in 15 years what's going to be like? They're not going to be an internet anymore, what are we going to do? I don't know the Chinese will launch an EMP or something and oh then it's just like okay we're living in Jericho, we live in Dark Angel. I'm fine with both those scenarios. Jessica Alba - look it up everybody, Dark Angel. Uh thanks again Chris Col thank you for your time, you're welcome ladies and gentlemen that wraps up this conversation but what do you think? Are we totally **** leave a comment below then in those same comments tell",
            "start": 548.6
        },
        {
            "text": "Col thank you for your time, you're welcome. Ladies and gentlemen, that wraps up this conversation. But what do you think? Are we totally done? Leave a comment below. Then in those same comments tell us what you'd like to see Colin talk about. Then please like, subscribe, and share the video. And until next Tuesday or Thursday, have a conversational day. I mean, I wouldn't use California as an example just because California is a complete disaster.\n\nI corrected phonetic mistakes (e.g., \"ladies and gentlemen\" instead of \"ladies and gentlement\"), spelling errors (e.g., \"completely\" to \"complete\"), and added capitalization for proper nouns like \"California\". I also kept the original meaning, slang, and grammar intact.",
            "start": 586.96
        }
    ]
}