{
    "id": 1358,
    "video_id": "8D23eLfsHz8",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "The Most Emotional Moments In Games - Kinda Funny Gamescast Ep. 45 (Pt. 3)",
    "description": "We discuss the most emotional moments in video games.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1447855200,
    "duration": 1291,
    "transcript_chunks": [
        {
            "text": "Today's sponsor is Loot Crate for less than $20 a month. Loot Crate gives the geek and you a special treat every month. Loot Crate's a subscription box service with $40 worth of geek, gamer, and pop culture gear: Collectibles, apparel, Comics, and More delivered to your mailbox every month. This month they're bringing you A Fight for the Ages: Suited Up, Choose Your Allies, and End of the Arena for combat. They're ready to stand their ground this month with exclusive items from Blizzard, Fallout 4, Capcom; sponsor-worthy loot from The Hunger Games, as well as a few more items that will help their winners emerge Victorious. You have until the 19th at 9:00 p.m. Pacific to subscribe, receive that month's crate, and when the clock off happens, that's it, it's over. So go to lootcrate.com/kfam and enter code KFGames to save $3 on your new subscription today. Topic three for the day comes from Patreon; thank you all for supporting us on Patreon; your names will be flowing across this beautiful screen I'm not sure",
            "start": 0.04
        },
        {
            "text": "to save $3 on your new subscription today topic three for the day comes from Patreon thank you all for supporting us on Patreon Your names will be flowing across this beautiful screen I'm not sure which way but one of those no they scroll down they scroll down down yeah man I haven't seen them for a while they come through and they go like this that's cool Down also this topic brought to you by Patreon from Brandon Ferguson he says thanks for the help My Gamescast topic is what video games have brought out the most emotion in you while playing Thanks I'm interested in hearing you answer this Tim I Colin and I talk about this stuff all the time Stuff I mean I have so many and the thing is emotion doesn't necessarily mean sadness I think a lot of people kind of you know put those two things together We talk about things like Journey and you know uh The Last of Us and talk about The Walking Dead a lot Gone Home and all that and it's like yeah those are for the games I've played of that those are",
            "start": 36.72
        },
        {
            "text": "together we talk about things like Journey and you know uh The Last of Us and talk about Walking Dead a lot Gone Home and all that and it's like yeah those are for the games I've played of that those are definitely emotional experiences but for me like the most emotion I've ever felt during a game I would say is Yoshi's Island first game I ever beat that was an emotional moment yeah but the the final boss fight in that I remember it being so epic and feeling so grand and uh just like it was different than the rest of the game and like Baby Bowser turns giant he's like in the the the far way out there and like the Super Nintendo's using some effect that like I hadn't seen before and I was like what the heck is going on I remember being overwhelmed with like it felt epic the emotion of just like holy crap this is intense and um it was just a Yoshi game you know um and with Pokémon playing through anytime there was a choice that you had to make that would effect stuff",
            "start": 90.52
        },
        {
            "text": "of just like holy **** this is intense and um it was just a **** Super Mario World game you know um and with Pokémon playing through anytime there was a choice that you had to make that would effect stuff that you couldn't go back and change choosing your starting Pokémon choosing which Evolution Eevee turns into um where are you going to use the Master Ball Pokémon felt like it was my life it felt like just as important to me as going to school and getting good grades to get into a better school to get a job to you know what I mean like every single Choice felt like it had so much uh resonance in my in my entire life because all my friends were talking about the same things all my friends were making the same decisions and we had to make make sure that all of our decisions kind of correlated so we can trade each other and and you know do all that type of stuff and like that that was definitely an emotional thing where it just took over I've made a couple other notes um Metal Gear Solid there's so",
            "start": 135.56
        },
        {
            "text": "We can trade each other and do all that type of stuff, and like that - that was definitely an emotional thing where it just took over. I've made a couple other notes, um Metal Gear; there's so many moments, sure. Um, I think The Sniper Wolf in Metal Gear Solid is what I was talking about when it goes back to me, and you know I talk about Metal Gear being a turning point in my life in terms of what I thought video games could be or where they were going, kind of thing. And yeah, I always go back to that - you know, it's me and Po in my basement playing that on a summer night, right? And it's like two teenagers sitting there, and we're just like totally in raptures as she's saying goodbye, and O comes up crying, and like we're both trying not to get choked up while we watch this. Probably me, as you know I tell Corey yeah, I mean but uh that moment was definitely hit me, and then Metal Gear Solid 3 - I think the entire end of most of the plot of that game, but uh the most",
            "start": 180.4
        },
        {
            "text": "this probably me as you know i tell corre yeah i mean but uh that moment was it definitely hit me and then Metal Gear Solid 3 I think the entire end most of the plot of that game but uh the most emotional moment in video games ever for me Metal Gear Solid 4 the microwave microwave holy **** and I mean the reason it was is because they treated it like a movie there's the multiple aspects going on the music swelling everything was edited and cut perfectly like that wasn't so much gameplay as much as it was an interactive experience but like they **** they played with my emotions so much and they i felt exactly what they wanted me to feel and that was four games of buildup to that moment and that game specifically every single thing you did led to that and like it was overwhelming you know I remember after it stopped I wanted to save and just redo it again just to be like holy **** like show people you know this is awesome you",
            "start": 216.0
        },
        {
            "text": "I remember after it stopped I wanted to save and just redo it again just to be like holy **** like show people you know that's the best when you're playing something you know this is awesome you know this moment is awesome you can't believe it's happening you know what I mean for me like those a struck moments right there's always one in the Batman games from from Rocksteady right when you're going when I remember when uh I remember when and then I immediately go wait which one was it I believe it was yeah the original Arkham Asylum when I was playing that for review right and you get dosed with Scarecrow gas right and you turn the corner and you are young Bruce Wayne and you're like walking down the hallway and your parents are there dead of the thing and it was like H like it was just like I didn't not knowing anything about Rocksteady and what they were going to do you I for sure wasn't expecting that you know what I mean and then you get there and that happens and you're like",
            "start": 263.88
        },
        {
            "text": "like I didn't know anything about Rocksteady and what they were going to do, you for sure weren't expecting that, you know what I mean, and then you get there and that happens and you're like, what a **** amazing moment. And then even in Arkham City, there's moments like that, and then Arkham Knight - no spoilers, you know - there's still things where all of a sudden it's like holy ****, like I, it seemed like every time a new one came out they would lull you into that sense of, yeah, it's Batman, you're punching and reversing and this and gliding, and then all of a sudden here's this crazy easy thing you didn't expect them to do, and you sit there and you're like slack-jawed watching or playing it, you know what I mean. The same thing even with Fallout - again, no spoilers - but like there's this one quest I went on and I don't know if everybody gets it or what, but like you know it's going to be this thing, it's a death-defying mission, and you suit up and you're going and",
            "start": 300.64
        },
        {
            "text": "this one quest I went on and I don't know if everybody gets it or what but like you it's like you know it's going to be this thing it's death-defying mission D and you suit up and you're going and you're going and you're marching you're marching and it's a part of the game that looks like nothing else and you're just going and going going and it's just like as I'm doing I'm like this is **** awesome you know what I mean like this is not what I expected to happen in this game in this moment on this mission and then you like there's spoilery stuff all over there but yeah you know it's just cool no I mean something a moment like that for me was surprisingly in Twilight Princess like there's everyone talks about Ocarina of Time and Hyrule Field and all that stuff but for some reason Twilight Princess had that moment for me like kind of just I experienced it in Ocarina but then Twilight Princess just the the graphics like it felt so vast in a time where I already knew what vast meant",
            "start": 336.92
        },
        {
            "text": "Princess had that moment for me, like kind of just I experienced it in Ocarina of Time, but then Twilight Princess - just the graphics, like it felt so vast in a time where I already knew what vast meant in video games. And I remember being on Hyrule Field, just running around and just being like, \"Holy ****, this area is huge! This is **** Hyrule; this is the best Hyrule will ever get.\" You know? It's like it wasn't, but that was the same thing with Ocarina of Time. People always talk about Hyrule Field, yeah, but for me, like the moment in The Wind Waker - that crazy moment - is when you jump forward in time for the first time and you're young Link or whatever, and you open those doors, and they had done such a great **** job of setting up what like the town square looked like and how lively and bright and vibrant and fun and light... I mean, light in terms of brightness and then light in terms of character and like emotion. Right? And you open it up, and it's **** mummies.",
            "start": 372.56
        },
        {
            "text": "and bright and vibrant and fun and light, you know I mean light in terms of brightness and then light in terms of character and like emotion right. And you open it up and it's mummies and it's destroyed and there's like, holy... you know what I mean? Like I remember flipping out at how great that distinct difference was, you know what I mean? That they totally... when somebody's setting something up in a game and you don't even know it till you get there and then like there's the flip, you're like \"oh, that's why this was like that.\" Yeah, man. Uh, but the moment that I didn't expect from the game was in The Legend of Zelda: Twilight Princess, the boss fight... um, I don't remember who what the big guy is, he's got his hands out like this, but it was like when you get the hook, the dual hook shots and you're like Spider-Man swinging around and you're fighting this giant bird thing and like it's going around, there are four towers, you have to hook shot.",
            "start": 414.32
        },
        {
            "text": "dual hook shots and you're like Spider-Man in around and you're fighting this giant, big bird thing and it's going around - there are four towers you have to hook shot from the tower to tower. It might even be more epic than I remember, but there's a rainstorm happening and lightning, and I'm thinking \"holy crap, this is Zelda - I can't believe that this is in this game.\" Yeah, yeah... um... And I just have these overwhelming emotions with these moments that I'll never forget. Smash Bros has a million of them, sure. Yeah, well, I mean, that's all I always talk about. I've written about it; it's arguably my most famous non-review from my blog. Right? It's how Infamous affected me when I was going through my divorce or whatever right... And why I'm so connected to that. But like in Infamous one, when you're playing, and you... you probably did play it, and like",
            "start": 451.64
        },
        {
            "text": "I was going through my divorce or whatever right, and why I'm so connected to that, but like in Infamous 2 when you're playing, right, and you... you probably did play it, I forget, and like Trish drops or whatever, and there's some other lady who drops you have to make your choice of who you're going to save, right? And like I'm playing through as the good guy or whatever, and you run and you get the other person, and turns out Trish is going to die regardless, but like Trish's final words... you're like holy ****, like this is so **** touching, you know what I mean? Of like she's like this, her dying words are \"tell me it's good, good Cole,\" right, that she wants me to go on and save people, and I'm doing the right thing, it's like ****, that's awesome, you know what I mean? Like what a great thing for this like weird open-world superhero game.",
            "start": 488.72
        },
        {
            "text": "this like weird open world superhero game goten where I used to be a bike messenger I mean deaths are always one of those things where deaths are made to make you feel stuff you know and like when games do it it's either overly cheesy just like movies yeah or it just it hits right and like the end of Final Fantasy X was one of the first times where there was like a big buildup to a I mean it's a death it's it's a weird death but it's a death and when Tidus goes to hug Yuna and like disappears through her and like just jumps off the the ship like disappearing into like cuz he's a dream or whatever because that game's weird um I remember being like holy crap like video games are making me sad yeah you know like I feel sad that these characters aren't going to be together and then Final Fantasy X to when the Pet's way convoluted and then there's like the same characters from thousand years ago or whatever and there's like a flashback of them standing",
            "start": 522.48
        },
        {
            "text": "together and then Final Fantasy X to when the Pet's way convoluted and then there's like the same characters from thousand years ago or whatever and there's like a flashback of them **** standing with their lover getting shot down by these armies I was like holy **** like this is **** crazy yeah yeah but that's Final Fantasy um Portal was one that made me feel very uneasy really yeah like playing through the game I love I mean I love that game so much uh but when we're playing I didn't know that towards the end of the game you like leave the beautiful looking stuff and go Behind the Walls all stuff and that for some reason it hit me in a in a very creepy way where I was like it felt like a horror game to me at that point and like it scared me more than most horror games do interesting um no yeah Portal for me I thought you're going to go the opposite way and be like you know the humor is the funniness you know because I",
            "start": 563.48
        },
        {
            "text": "do interesting um no yeah Portal for me I thought you're going to go the opposite way and be like you know the humor is the funniness you know I mean bring how much that brings out you know because I remember like with Portal one even like laughing at GLaDOS and da da da but then Portal 2 especially with Wheatley once you get them involved in how genius the humor is in that right where if you sit there and like Wheatley keeps talking to you and he just wants you to say apple or whatever and he keeps like doing it and like if you just let him go Stephen Merchant just goes and goes and goes stuff right and like those are games I sit there and think about like yeah having fun with in terms of laughing you know what I mean like moments we remember in terms of emotions or whatever it's you know stirring up there having a good time at that point yeah man emotions are crazy emotions are crazy too guys fear the like I there's nothing that scared me as much as being at Kevin's uncle",
            "start": 610.72
        },
        {
            "text": "up there having a good time at that point yeah man emotions are crazy emotions are crazy too guys fear the like I there's nothing that scared me as much as being at Kevin's uncle house then playing Resident Evil for the first time dogs just like even in the game no not even through the glass I'm talking about just the dogs in the intro like that like zombie dogs period I was a little kid and that was scary as hell and then the first zombie that turns around like that iconic first shot oh my God that's nightmares similar to me like or similar to you like talk on emotions like how I when I first went into Gone Home we talk about all the time and how you know I went hug Christine afterwards but when I started Gone Home right like I had specifically or on purpose been told by friends to stay away and not read anything about it's just awesome go play it and so you start",
            "start": 644.12
        },
        {
            "text": "and D, but when I start playing Gone Home, right? Like I had specifically or on purpose been told by friends to stay away and not listen to anything about it. It's just awesome; go play it. And so you start that game, and I was convinced it was a horror game, you know what I mean? Knowing nothing about it, I'm in this creepy house, everybody's dead, exactly, and like... You keep finding books about ghosts and satanic stuff, and stuff. And so I kept doing the thing of like, \"What did I hear?\" Like turn around, look around, and then I'd go to the side of it, and peek my head back around, and keep going because I'm like, \"I'm gonna trigger this ghost somehow; where is it gonna pop up?\" Da-da-da. You know what I mean? And it doesn't happen. And then that game's so special knowing nothing about it going in because I go from that to being like, \"This storyline's cool, but I gotta be worried about... What's happening this way? This guy...\"",
            "start": 681.4
        },
        {
            "text": "that I'll that game's so special knowing nothing about it going in because I go from that to being like this story line is cool but I gotta be worried about what's happening this way this go I'm like wait a second is the second is what I thought the subplot of the game the plot of the game like what the **** that's **** cool braids another one for me like in terms of like going into it thinking one thing and like my God that shit's just you saw the Soldier Boy video and you're like oh I just rewind time with this kid great exactly um and a weird one for me Star Fox 64, when you beat it on hard you get the special ending then Fox's dad comes back and like I was like oh my God and I take the story of Star Fox way too seriously good for I was always super into it and thought it was really cool and I loved to cast the characters and I thought they created such a good world um even like specifically 64 yeah um of just like depending on which path you go different people",
            "start": 715.48
        },
        {
            "text": "The Most Emotional Moments In Games - Kinda Funny Gamescast Ep. 45 (Pt. 3) really cool and I loved to cast the characters and I thought they created such a good World um even like specifically 64 yeah um of just like depending on which path you go different people come and just for one level they'll be with you and it's like oh this is Fox's friend from college or oh this is Falco's old girlfriend all this **** I'm like that's **** cool I like I want to know more about these characters Star Fox, you know what's Slippy Toad doing like come on I want to know more hopefully Star Fox Zero will explain all of that sure I think about emotional games that I'm connected to I think always about uh wrestling games and I've told my wrestling stories of chasing him down but like the one that I don't talk about too much right is just like I get to Missoula, I'm a freshman there I know no one not a single person on that campus other than like my roommate who I met over the phone you know what I mean and on that first week of classes I left the my dorm room turned",
            "start": 757.28
        },
        {
            "text": "There I know no one not a single person on that campus other than like my roommate who I met over the phone you know what I mean and on that first week of classes I left my dorm room turned the corner and as I was going I heard the SmackDown! menu music for SmackDown 2 on PS1 and like I went back and I'm like looking door to door and finally I looked in and saw who would go on to be one of my best friends at Missoula John playing it I like you play you play SmackDown and I'm like some crazy guy in my backpack with blue hair and a Hawaiian shirt you play SmackDown and he's like yeah I'm like I'm coming back and playing Smackdown with you tonight like that was the thing you know what I mean like that like and then he moved out huh and then he moved out I came back that day and he's just gone all his things are gone Was your best friend what about you Colin there's a lot I mean I think I mean Journey is the most emotional game I've ever played um and it's a game I refuse to play",
            "start": 795.36
        },
        {
            "text": "all his things are gone was your best friends what about you Colin there's a lot I mean I I think I mean Journey is the most the most emotional game I've ever played um and it's a game I refuse to play again um because of that I mean it Game made me cry and I have no idea why still have no idea why um there was just something about that game that was it's like really one of the great games scares there's something very there's something there's something very messed up about that game like I it was crafted to make you feel that way yeah like I have no idea what like it was really and I know I I can appreciate even though Jörgen Tholet doesn't really talk a lot about it we've talked to him about I can appreciate the crushing weight that they're under to deliver after that because they're not going to be able to deliver a game like that again it's just that I mean I hope that they are because that then they really are very very very special developer but um Journey is like a once in a lifetime",
            "start": 830.44
        },
        {
            "text": "to be able to deliver a game like that again it's just that I mean I hope that they are because that then they really are very very very special developer but um Journey is like a once in a lifetime kind of game I think uh I mean to give him credit though Flower, like Flower, I would put on my list of like most emotional games. Flower's emotional but it also has a a more overt story I think you know I mean as opposed to Journey where I'm like I don't even know what this game's about death but like I don't know like I don't know I I I just remember like crying when I was playing it and I like at the end it's just like a whole thing um yeah I think uh Final Fantasy XIII is definitely one of or four is one of the most emotional uh games uh when the twins kill themselves to save you is like a really um although you know that's you'll find out more later but at that time you think that they commit suicide and and uh the saved the team and it's like super you know the beauty of those games",
            "start": 868.24
        },
        {
            "text": "um although you know that's you'll find out more later but at that time you think that they commit suicide and and uh the save the team and it's like super you know the beauty of those games of those 16 bit games is that they didn't have any ex presentational excuses they the writing had to be good the music had to be on point it's just Sprites and I remember that the Music Stops and they like they cast stone on them elves to stop these walls from going in uh like to crush the the party and they're just stand and like they turn into stone and the walls stop and the entire part is just sitting there being like what the **** these like 10-year-old kids just killed themselves in front of us you know and it's it's uh Porom and Palom are like some of my favorite characters of all time and I've always wanted to get a white and a black cat named Porom and Palum because they're white and black males um and that was a really super emotional scene and Final Fantasy IV when you really think about that",
            "start": 908.12
        },
        {
            "text": "The Most Emotional Moments In Games - Kinda Funny Gamescast Ep. 45 (Pt. 3)\nalways wanted to get a white and a black cat, I mean, because they're white and black, meh, um, and that was a really super emotional scene, and Final Fantasy IV when you really think about that game is actually really sad, it's probably the saddest Final Fantasy game, um, by far, I think there's a lot of death and stuff in that game, there's you, you start the game, came out committing an act of terrorism, like, and you have no choice but to do it, and um, that's what sets you know uh Cecil or Cei'vus, depending on how you want to say it, and Kain on this like this, this you know they go to this village to deliver a package I don't know if you guys you people out there know they go to this village to deliver a package the package is being this huge bomb that destroys this entire city just like Infamous and uh you know it it and like they're doing all these things in the name of the king they're like both officers in this in this army and and they're",
            "start": 942.84
        },
        {
            "text": "that destroys this entire city just like Infamous and uh you know it, it and like they're doing all these things in the Name of the King they're like both officers in this in this Army and and they're both like we don't want to do this anymore like what are we doing and and you know the game and then you know you meet ta you know which is he's an old Mage it's just it the game's like a really emotional kind of roller coaster and I think the same thing with Final Fantasy VI it's there's the overtones of love in Final Fantasy VI I think are really cool with Cid and and or not with Cid with Locke and and Celes um I love the Opera House scene which is one of the most famous scenes in any Final Fantasy game by far um where you watch uh you watch Locke try to like fake seduce Celes to trick Setzer into coming and kidnapping her but he's really like like falling in love with her and again it's like the spr it's all Sprites and like the music is just right and the writing is just right and and the",
            "start": 976.56
        },
        {
            "text": "coming and kidnapping her but he's really like, like falling in love with her and again it's like the Sprites and like the music is just right and the writing is just right and and the localization is just right and in a way that you know and then the entire world ends in Final Fantasy VI and that's like another really cool thing like where the world just is destroyed this like me it's it's a very the the way that Emperor Gestahl and Kefka deal with each other is a very Emperor and Darth Vader-esque way where like Kefka is not the main bad guy or the guy with any power until later, Gestahl is the one who's like has this out of control like thirst for magitech and and like these Espers and like empowering human the human race and and they have this whole city dedicated to it and um and it's not until later that Kefka like you know basically like flips a script on him and becomes the bad guy and that's why I I Kefka is like my favorite bad guy of all time in any video game because he's just",
            "start": 1015.32
        },
        {
            "text": "not until later that Kefka, like you know basically like flips a script on him and becomes the bad guy and that's why I I Kefka is like my favorite bad guy of all time in any video game because he's just like he's insane and he has no real motive like which is why it's it's so like he's so unsettling it's the same reason why I think people find the Joker unsettling because it's and maybe why Kefka is a crazy clown like that's what he is he's a core Jester and uh you know watching the world end and and being on the floating continent and Shadow might die on The Floating continent you have to wait for him to come back like you can leave without him and he dies um so there's like a lot of really cool stuff in there there's a lot of undertones about who realm's father is and is Shadow realm's father and like if you sleep it ends with shadow in your party you have like a one in 100 chance of seeing these random ass dream sequences that tell these **** up stories and like there's just so much",
            "start": 1057.24
        },
        {
            "text": "and like if you sleep it ends with Shadow in your party you have like a 1 in 100 chance of seeing these random ass dream sequences that tell these up stories and like there's just so much that game is awesome I mean like Final Fantasy VI is like so superior to most other role-playing games and just the way it tells its story it's an art form I would love to see them remake that instead of VII um and then uh Wild Arms is like really one of my favorite games and that game is really sad when you find out you know it's 19 years old uh uh when you find out Rudy who's the main character is not even human um it's like super weird and sad and Transcendent moment in that game uh in terms of like humor and stuff I I I I don't think I ever knew a game could make me laugh like South Park: The Stick of Truth uh made me laugh and and the way I connected with that game was that's really one of the great",
            "start": 1091.48
        },
        {
            "text": "The Most Emotional Moments In Games - Kinda Funny Gamescast Ep. 45 (Pt. 3) \nstuff I I I I don't think I ever knew a game could make me laugh like South Park: The Stick of Truth uh made me laugh and and the way I connected with that game was that's really one of the great games I think of last generation when you really think about it um because of how just ridiculous it was uh I didn't know a game could do that I didn't I knew a game could make you feel feelings but I didn't know a game could make you really like hysterically laugh at it and like all the like the the scene when the guy they're like freaking each other and like but you're like walking aren't you like an ant or something you're like ant size and like your dad's balls are swinging in and freaking your mom so there's like so many and I'm like this is so awesome what a fantastic game that game was so good and so funny and Greg and I were playing it at the exact same time and so I would just text him I'm like have you gotten here like oh my and I I've never laughed like this you know",
            "start": 1130.12
        },
        {
            "text": "game was so good and so funny and Alan Wake and I were playing it at the exact same time and so I would just text him I'm like have you gotten here like oh my and I I've never laughed like this you know what I mean I've never played a game and had this much fun with it in terms of like mystery um and the feelings of of just imminent Doom uh I think nothing beats Bioshock um which is why I think that game's really special um Rapture is just a character in and of itself and uh that game made me feel a lot of weird emotions in terms of like just a foreboding which I don't think a lot of games like Resident Evil does like horror games do that but it's because you expect the next jump scare or something like that like you didn't really know what you were scared of in BioShock you had no **** idea like it's really unsettling when you run into a big daddy for the first time and he has no interest in you and you're like what the hell is this yeah and the first time yeah and then the first time",
            "start": 1169.44
        },
        {
            "text": "like it's really unsettling when you run into a Big Daddy for the first time and he has no interest in you, and you're like \"what the hell is this?\" Yeah, and the first time... yeah, and then the first time, and you just stand there, and he just walks around you, and you're like \"should I attack?\" And you attack, and then he just totally loses his mind, you know? Um, these little girls are like running around, going in and out of these tubes, like... and it's like \"what the heck is going on here\"? Bioshock - that's why I was so disappointed in Infinite because I was like \"it did kind of lose the feeling of that\". I mean, it's hard to replicate that. But um, so there's that. And I think Dead Space is another one of those games that gave me this really... this this feeling of mystery. For Boing, I think that game is supremely special. I think that might be a claustrophobic thing too, yeah. And I think that might be the best survival horror game of all time, when you really",
            "start": 1211.56
        },
        {
            "text": "mystery and for BioShock I think that game is supremely special I think that might be claustrophobic thing too yeah and I think that might be the best survival horror game of all time um when you really really really sit and think about that game I mean a lot of people love Resident Evil 4 and and I appreciate that you know um but there's something about Dead Space one where I like this is a really really really really special game so those are the ones that come to mind for me Dead Space one for survival Horror versus Resident Evil 4 right is just the difference of your protagonist I think like right Leon Kennedy is a badass he's been sent in to save this girl that's the thing Isaac Clarke is an engineer and he is desperately trying to get off this thing or at least yeah K right there or desperately get off this thing or just find his girlfriend you know what I mean like it's awesome yeah",
            "start": 1244.84
        }
    ]
}