{
    "id": 1352,
    "video_id": "gQ6iMgfjfAo",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Cloud In Smash Bros! Nintendo Direct Reactions - Kinda Funny Gamescast Ep. 45 (Pt. 1)",
    "description": "Our impressions on Nintendo's latest Direct.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1447682403,
    "duration": 2623,
    "transcript_chunks": [
        {
            "text": "today's sponsor Loot Crate for less than $20 a month Loot Crate gives the geek and you a special treat every month loot crate's a subscription box service with $40 worth of geek gamer and pop culture gear Collectibles apparel Comics and More delivered to your mailbox every month this month they're bringing you a fight for the ages suit up choose your allies and Enter the arena for combat they're ready to stand their ground this month with exclusive items from Blizzard Fallout 4 Capcom sponsor worthy loot from The Hunger Games as well as a few more items that will help their winners emerge Victorious you have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate and when the cut off happens that's it it's over Jack so go to lootcrate.com/kfam and enter code kfam to save $3 on your new subscription today what's up guys welcome to the first ever episode 45 of the Kinda Funny Gamescast as always I'm Tim Gettys I'm here with the coolest dudes in video games",
            "start": 0.08
        },
        {
            "text": "to save $3 on your new subscription today what's up guys welcome to the first ever episode 45 of the Kinda Funny Gamescast as always I'm Tim Gettys I'm here with the coolest dudes in video games Colin Moriarty and Greg Miller now doing something special today a Nintendo Direct just happened yesterday we recorded topics 2 three and four that you will hear in the future after this happens but for now we're just going to talk Nintendo we're getting right into it I am so excited that was a good one it was a good one y'all talking **** the whole time but I don't care we were it wasn't **** no it was a good one it was good it was fine it was good it wasn't just fine it was good big surprise there here's here's the thing yes of course it was the big surprise but my thing with the Nintendo Direct there's nothing besides E3 that gets me more excited in video games than Nintendo directs not playing Nintendo games you get more excited about the directs that's the thing I like announcements I'm",
            "start": 36.44
        },
        {
            "text": "there's nothing besides E3 that gets me more excited in video games than Nintendo directs not playing Nintendo games you get more excited about the directs that's the thing I like announcements I'm a big fan of announcements that's why besides the cloud thing my favorite announcement from the direct was the announcement of more announcements to come in December that's true that was the biggest pop you gave that whole thing is when at the end they're like the Smash Bros there's more smashboards coming December you're like you put up your hands that's great such a good sign SC man I just but I love it I love announcements and I love that there's this presentation and here's 45 minutes yeah we're going to see a bunch of **** we don't want sure but that's they need to do it's a press conference you know what I mean usually you have to wait for press conferences your games comes or whatever like yeah Nintendo comes out and they drop them and especially for you Mr",
            "start": 88.4
        },
        {
            "text": "you know what I mean usually you have to wait for press conference you got to wait for e3s your games comes or whatever like yeah Nintendo comes out and they drop them and especially for you Mr. Nintendo who you love Nintendo I'm not Mr. Nintendo I know I'm the NX's biggest fan yes but I'm not Mr I hear next week we're installing a Nintendo World Championship belt I wonder if who's going to win it yeah I don't know we'll have to see in the let's plays next week no but I thought I had a good time it was a fun conference I wasn't talking **** we're doing the same thing we do at every E3 just like Mystery Science Theater but I just you know I get really defensive over Nintendo I can see it in your eyes that's why I just back off a little bit sometimes no you don't need to do that like with the Star Fox game that looks like it's a GameCube game you know what we'll get to the Star Fox game but overall to me it's not just me because you go on Neo and there's 100 page threads very excited",
            "start": 126.16
        },
        {
            "text": "the Star Fox game that looks like it's a GameCube game you know what we'll get to the Star Fox game but overall to me it's not just me because you go on Neo and there's 100 page threads very exed Twitter in general was flame I mean I'll tell you right now I mean this just broke right before we started recording NPDs are out Yoshi's Woolly World was the eighth bestselling game at retail in the United States out the Y I've been telling it outsold Uncharted in Nathan Drake collection um which came in at number nine although uh it's worth noting that the NPD numbers do not count uh bundles um which I'm sure PS4 sold plenty of with the Nathan Drake collection but I I say that just to show that there is a group of people that are still buying these even more obscure um or not as desirable exclusives so when you see something like Zelda being confirmed is still a Wii U game which is not a huge surprise uh that shows that that game is going to sell very well when it comes out so let's just go",
            "start": 160.32
        },
        {
            "text": "so when you see something like Zelda being confirmed as a wii u game which is not a huge surprise uh that shows that that game is going to sell very well when it comes out so let's just go down the order of how things happened in this Nintendo Direct this beautiful beautiful Nintendo Direct Zelda Twilight Princess HD finally confirmed Greg owes me a burrito cuz he said this ain't happening I was like what wrong with you when did you say that why cannibal yeah but I thought why cannibalize your Zelda game that apparently is not coming in 2016 I don't care they said 2016 it's not coming in 2016 I'll double down I'll put another Burrito on the line that you're not getting your Zelda Wii U in 2016 now I mean I don't want to bet that if it doesn't come out 2017 in trouble I don't believe that I I'm still holding out even though they're saying all this stuff I'm still holding out that it's not coming to Wii U like and again I'm this is just my my warped thing I'm hoping it",
            "start": 200.52
        },
        {
            "text": "that I'm still holding out even though they're saying all this stuff I'm still holding out that it's not coming to Wii U like and again I'm this is just my warped thing I'm hoping it doesn't come to Wii U, I see them saying it's coming to Wii U, it makes no sense for it not to especially this direct confirms it to me, yeah absolutely so but I'm wait wait wait before we move why would you make that bet, it like conclusively leaked that like a month ago, I like making entertaining shows where Tim and I argue about things and I I'll buy a burrito anytime, yeah it's not like I bet him 100 bucks, I wasn't like I was like it's going to happen but so you make bets just to make them, your bets don't mean anything people get engaged they talk about it then on Twitter and they tweeted us about it, I thought it was a dumb move so but now if I if I really don't know if this Zelda game is going to be so far out yeah yeah so I mean yeah we got the release date of March 4th for Twilight Princess HD",
            "start": 240.52
        },
        {
            "text": "it was a dumb move so but now if i if i really don't know if this The Legend of Zelda: Twilight Princess HD game is going to be so far out yeah yeah so i mean yeah we got the release date of March 4th for The Legend of Zelda: Twilight Princess HD yeah I will say that looking at it didn't excite me the way of course not it's not a good Zelda game I mean it gets I think it gets shot on a lot it's definitely it's I think it's it's not it is good it's just not amazing forgettable it was definitely a decline in quality um that I think really actually started with more like The Legend of Zelda: The Minish Cap than anything else and then kind of just started like Wind Waker was to to me the last I **** love Wind Waker and and to me that was the last truly interesting just aesthetically pleasing really interesting looking different kind of Zelda game by the time I got The Legend of Zelda: Skyward Sword I just didn't care anymore because Twilight Princess I felt so burned on so twil princess was the first Zelda game that I sat down to play that I didn't with the exception of the 3DS",
            "start": 275.52
        },
        {
            "text": "Skyward Sword I just didn't care anymore because Twilight Princess I felt so burned on so Twilight Princess was the first Zelda game that I sat down to play that I didn't with the exception of the 3DS ones or the DS cuz he had to use a stylus I just didn't I was like no no way not for me so I I don't get I'm with you that I don't so you never beat it no no really no I did and all I remember is frigid fingers and turning into a wolf in the beginning like I don't remember that game I played that game sucked I played that game stem to and just don't know don't remember anything about it cuz I just meanwhile Ocarina of Time Majora's Mask uh Wind Waker these are things you know what I mean even uh The Legend of Zelda: Link Between Worlds recently right like I remember moments of how much fun I was having in this game and what I remember about Twilight Princess is getting stuck in one of the Dungeons and my girlfriend at the time quietly looking it up on IGN and then be like well what if you went over there and did",
            "start": 319.8
        },
        {
            "text": "what I remember about The Legend of Zelda: Twilight Princess is getting stuck in one of the dungeons and my girlfriend at the time quietly looking it up on IGN and then be like well what if you went over there and did that I'm like I've done that before like 10 minutes later she be I really think you should go do that like all right and it worked like God damn that's funny I I like Twilight Princess it's not my favorite Zelda game but I don't think it's as bad as people make it out to be but I will say that watching the HD trailer I was EXC cuz I knew this was coming I want a burrito off of it damn it but I was excited to see the trailer cuz I thought it was going to be impressive to me in the way that The Legend of Zelda: Wind Waker HD when I saw that trailer I was like o this looks good you know and yeah the cell shaded it cell shading works better in the HD flying of things yeah but I thought Twilight Princess was going to look a little better this looking at it I'm just like oh that's what Twilight Princess looks like I'm",
            "start": 360.28
        },
        {
            "text": "Shad works better in the HD version of things, yeah. But I thought Twilight Princess was going to look a little better than this. Looking at it, I'm just like, \"Oh, that's what Twilight Princess looks like.\" I'm sure compare him side by side; think totally like you think you remember it. I thought I'd get a little bit more of a wow factor, and I didn't. Yeah, um. But there's a Wolf Link amiibo, so Zigger's happy out there, of course. Zigger must be in a coma right now with all the amiibo talk and all these different amiibos. I'll say that I think it's a smart move for them to release the game because a lot of people do love it, and there isn't you know, there's a dearth of games on Wii U. So I mean, I think it makes perfect sense even if the new Zelda was going to come out in the summer or something like that. I don't think it affects it at all. But this was the least surprising news because this conclusively leaked, so I... I out of everything",
            "start": 398.36
        },
        {
            "text": "Our impressions on Nintendo's latest Direct.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames.\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus\n\nor something like that I don't think it I don't think that the release of it affects it at all but this was the least surprising news because this this conclusively leaked so I I out of everything that I thought we would see this was like the one I knew we were going to see M so I was glad that they open with it artwork leaks there was little like it was on the EOP it was like of course it's going to yeah and the the big thing about the direct for me is like there's there was so many games talked about some of them for just 3 seconds but like that's all I need it's just like there's a lot of Nintendo things happening not all of it's going to be for you but there's going to be a lot of it this direct had so many things that I was just like yes thank you this is what I care about maybe no one else does but I **** do um Moving On My Boy Bill Trine oh also they talked about the the new Zelda and they said 201 that it's coming it's coming to Wii U in 2016 still coming they showed like",
            "start": 432.0
        },
        {
            "text": "one else does but I **** do um Moving On My Boy Bill Trine oh also they talked about the the new Zelda and they said 201 that it's coming it's coming to Wii U in 2016 still coming they showed like 10 seconds footage of it it it was new footage but I mean it didn't show anything new link kind of like had a weird like on thing um have a lot I have a lot of Hope in that game actually I hope compatible with the wolf amiibo or whatever that's worth there's other you can put the other U amibos Zelda themed amiibos take your time with that game all the time you need on NX but they I mean it's I mean they they re I still think it might be on the NX to but if we believe the NX might come out next fall which I don't think it will I'm burping uh so I think that you know they you know there's no question it's coming to WiiU I mean there's just no question anymore we've definitely deated this in the past me it's coming to we yeah and it's upsetting but it's upsetting to me and I think I but I",
            "start": 466.92
        },
        {
            "text": "Our impressions on Nintendo's latest Direct. It's coming to Wii U, I mean there's just no question anymore we've definitely dated this in the past me. It's coming to Wii U, yeah, and it's upsetting but it's upsetting to me and I think I but I think for the like the success of the NX. I Think It's upsetting I wished that in the time we hadn't heard about the game they just completely moved over and started fresh on the NX. It's still possible that they're doing that again, remember like we said it before they're in the space in between right now and so they can't necessarily you know Twilight Princess was a GameCube in a Wii game and I I don't I don't necessarily think that it's not it's impossible that this is the same thing they just can't say that yeah yeah no and I I think I will be shocked if this game's not on NX in some form. My biggest question is if this is a 2016 game, the NX isn't in 2016 what do they do with it and the thing is they might not do the exact same they did with Twilight Princess they might do something more",
            "start": 513.6
        },
        {
            "text": "biggest question is if this is a 2016 game the NX isn't in 2016 what do they do with it and the thing is they might not do the exact same they did with Twilight Princess they might do something more similar to Smash Bros on the 3DS and Wii U where it's the same game but there's more stuff on the NX one and that's going to make people want to buy it either again or wait and buy that version yeah I think I just I don't believe that NX is going to come out next year simply because it doesn't seem it seem so back in like between the NES and SNES transition in 1991, the NES was still really viable actually for a long time, I mean they were releasing first-party Nintendo games in 1994 um so it was it was different then, the N64 was a little more tapered and by the time you got to GameCube, the N64 was basically dead um I remember the last N64 games I bought were in the spring of 2001 and obviously it was in the fall of 2001 that GameCube came out so I just when you think about the",
            "start": 551.96
        },
        {
            "text": "GameCube N64 was basically dead um I remember the last N64 games I bought were in the spring of 2001 and obviously it was in the fall of 2001 that GameCube came out so I just when you think about the transition from GameCube to Wii, 2004 and 2005 especially 2004 were really strong years for that console but by 2006 the console was dying or dead already and the release schedule of some of the games still on Wii U uh in 2016 indicate to me that NX it just wouldn't make sense to release NX then you know I don't think it's I don't think NX is a fall 2017 but I think it's probably maybe spring 2017 yeah I don't know I mean my money's on 2016 but just cuz we don't have anything besides Zelda left for the latter half of the year No but but still I just feel like you want it to taper and have some a vacuum of excitement before you you don't want to this was the same was the argument I made with why Zelda shouldn't move over to NX completely it's because you don't want to burn the people",
            "start": 592.88
        },
        {
            "text": "some a vacuum of excitement before you you don't want to this was the same was the argument I made with why Zelda shouldn't move over to NX completely it's because you don't want to burn the people that are guaranteed going to be there for you, the people that own Wii U. So it's as long as you treat them well towards the end of the life cycle like Nintendo's fan base is demonstrably shrinking and you need to take care of those people before you try to expand out with a Blue Ocean strategy - kind of thing only works when you have a strong foundation, which is why the Wii I think succeeded. Because I just don't feel like burning me hard, let's move on. I want good things. I think you're in the minority that I think you're in the minority on that but I mean as we're adults with some disposable income right like I just don't know that everyone's in the position where they they they don't want you know they don't want",
            "start": 636.92
        },
        {
            "text": "minority on that but I mean I as we we're adults with with some disposable income right like I just don't know that everyone's in the position where they they they don't want you know they don't want to be ripped off by Nintendo in terms of the Wii U or whatever like give it some time to die see my argument to that would be that the people that aren't adults with money aren't the people that are clamoring for this Zelda game like those are the ones that are playing all these other games that I don't care about like Animal Crossing: Amiibo Festival or whatever the hell it's called we'll find out I hope I'm I hope I'm wrong just in the sense that I want to see what the hell this thing is but and I I think we will see it at E3 but um it would be nice for it to come out in the fall I mean you know you don't want to be in a Dreamcast situation where you're coming out in the middle or towards the end of a generation because then you then you are in a weird space and there's really no",
            "start": 668.2
        },
        {
            "text": "you know you don't want to be in a Dreamcast situation where you're coming out in the middle or towards the end of a generation because then you then you are in a weird space and there's really no success stories of that happening uh when you think about it so um yeah yeah um so then Bill Trinen comes out talks about The Legend of Zelda: Tri Force Heroes, there's an update 3.0 stage free download talks about Splatoon new stages equipment tournament mode Mario Maker has a portal site where you can go on the internet and like look at websites that way download them and sync them to your console later hell yes all of this to me is great news this is what I want from Nintendo where it's these games are platforms you're not going to need to wait for 10 years for the sequel to come out or whatever you get these we're going to keep giving you updates some of them are free some of them paid whatever it's going to be worth it either way like you're getting stuff and how they're treating Mario Maker so far I am in",
            "start": 701.44
        },
        {
            "text": "going to keep giving you updates some of them are free some of them paid whatever it's going to be worth it either way like you're getting stuff and how they're treating Mario Maker so far I am in love with it's only been out a couple months we've already gotten multiple announcements or updates and stuff so very stoked about that then they started talking about some eShop titles Pokémon: Pocket Camp, which I've never been a big Pokémon: Picross guy no it's it's interesting to see that come out and it's a it's a you know this was this one of the free to start games Pig Ross yeah it seems like this is like a new model in conjunction with the the rumors that all the Nintendo mobile games are going to be free to play so this seems like they're just exploring not that this is the first time they've done it but to explore uh the the a different kind of pricing model whatever Picross games have been huge for Nintendo for a really long time just not like a really long time um just not in uh the West",
            "start": 741.16
        },
        {
            "text": "it but to explore uh the the a different kind of pricing model whatever pick cross games have been huge for Nintendo for a really long time just not like a really long time um just not in uh the West so it is cool to see um them kind of support that again but pit cross games uh Nintendo Pitfall! Cross games have been huge for 25 plus years Japan so then the ESOP title that I'm most excited about is the one called Fast Racing Neo we've seen it before a little bit but we're not getting a new F-Zero yeah like F out or something but it's like pretty much a spiritual successor to the N64 era of those games and oh my God looks that looks great **** four player split screen I'm not a racing fan so I really don't I see I love that type of stuff like I I love the futuristic Racers and I loved F-Zero so very stoked about that surprised they should slap F-Zero on it I know um then Yo-kai Watch and Animal Crossing they just you know did more bits on that which not for me uh then new bundles with",
            "start": 776.32
        },
        {
            "text": "so very stoked about that surprised they should slap F-Zero on it I know um then Yoai watch and Animal Crossing they just you know did more bits on that which not for me uh then new bundles with both Splatoon and Super Smash Bros. that's great you know let's just get as many we use out there and get people playing the good games that exist on it uh Pokken tournament we saw a new Shadow Mewtwo trailer that game looks amazing to me like I mean when I say amazing I mean very very solid eight out of 10 are you gonna fight yeah that looks awesome I mean it looks it's a fighting game that that's how I imagine Pokémon games would be when I was a dumb little kid you know like that's what the cartoons looked like you know just the Pokémon actually fighting with each other and stuff hell yeah that looks great very stoked about that um it's interesting the Tekken you know crossover and the name is horrible it is horrible I can't believe there're just because it's it's it's spelled Pokken so that's one",
            "start": 820.6
        },
        {
            "text": "very stoked about that um it's interesting the Tekken you know crossover and the name is horrible it is horrible I can't believe there're just because it's it's it's spelled Pocky so that's one one problem with the 2Ks Pocky, but it's uh it does look pretty cool uh I mean it's not for me either but it's uh they're taking advantage of Pokémon in weird ways I don't know what they're doing you know like just do what you need to do with this series put a full Pokémon game on mobile and make an MMO for your console just do it just **** do it already I don't NX NX bro we'll see Final Fantasy Explorers on the 3DS I think that can look cool yeah I don't really care too much but that definitely looks like a Colin Moriarty special, ior song yeah it's just cool little cool matchup I mean I I like I like that kind of stuff with uh kind of celebrating final fantasy's Heritage before it was uh what it is now so um yeah it's uh it's cool to see",
            "start": 865.12
        },
        {
            "text": "It's just cool little cool matchup, I mean I like I like that kind of stuff with uh kind of celebrating Final Fantasy's heritage before it was uh what it is now so um yeah it's uh it's cool to see those characters all in the same world. Not the first time we've seen that but yeah um yeah I mean it's a game that I'd certainly look to maybe play later, it's cool to see them all together in more of an actual RPG game, usually we see them together in fighting games or like music games or stuff like that. Then Star Fox, we saw a trailer April 22nd is the new release date, we saw more of the Walker, the Landmaster now has a Grav Master mode that like the tank kind of hovers and stuff, they went through the controls and stuff, that's just the normal thing it's always been right. They unfortunately and that's my biggest thing with this game is from every time I've played it it's not good, like just straight up it doesn't play right.",
            "start": 907.44
        },
        {
            "text": "just the normal thing it's always been right they unfortunately and that's my biggest thing with this game is from every time I've played it it's not good like just straight up it doesn't play right and you know Colin's biggest thing is that it looks like it just looks old and I I'm not I'm not in a I'm not a guy that really gets hung up on aesthetic I really don't like we're playing Fallout 4 now and I know a lot of people think that game's ugly but that's not really one of the problems with the game in my opinion um it's just that when you think about Star Fox's Heritage especially on Super Nintendo and N64 those games showcase those consoles in ways that other games didn't and they weren't necessarily the prettiest the most technologically advanced by the time you got to the end of the cycle but when you look back at what Star Fox was doing early on SNES uh early to mid through its life it was a pretty extraordinary game and um you still look at and you're like it doesn't",
            "start": 944.16
        },
        {
            "text": "cycle but when you look back at what Star Fox was doing early on SNES uh early to mid through its life it was a pretty extraordinary game and um you still look at and you're like it doesn't age very well especially at Star Fox 64 but they they these were kind of showpieces in their own way in their own respect in my opinion like I I just think that these were it's just disappointing to see a game that really straight up looks like it's a GameCube game like or a Wii game it really doesn't look like a Wii U game and some people are like well it's indicative that maybe it's been in development for a long time I don't I don't know anything about that I think it may might have been a Wii game but because they decided I mean think to think back on on the Super Nintendo version especially the the N64 version of Star Fox the polygonal way the ships were rendered was was due not only to an aesthetic choice but due to the fact that that's what those consoles could do so they decided to",
            "start": 979.0
        },
        {
            "text": "the N64 version of Star Fox, the polygonal way the ships were rendered was due not only to an aesthetic choice but due to the fact that that's what those consoles could do so they decided to keep the same shapes there's it's still angular and ugly and and I understand that that's kind of the known aesthetic the old school aesthetic of Star Fox, but it does not have to look like that like when I and when I look you know people on Twitter a few people were saying to me like well the Wii U just can't do that much and I'm like the Wii U Can Do way better than this I mean look at look at Zelda there's there's no there's no excuse look at Mario 3D World Bay yeah Bayonetta it's like it's like you can do way better this I'm I'm really shocked the way this game looks and I think it just the explosions the way like when you just I was paying close attention to just the little things in the trailer and like the explosions look awful the like when you destroy a ship and in its components",
            "start": 1015.68
        },
        {
            "text": "explosions the way like when you just I was paying close attention to just the little things in the trailer and like the explosions look awful the like when you destroy a ship and its component parts just disappear it's like I'm like textures are low res there's there's there's nothing compelling about it and I I like Star Fox and I kind of expected more about it it's I'm and what I said on Twitter was I'm sure it's gonna be fine I'm sure it's gonna be fun maybe the control scheme's not going to be great I have not gone Hands-On with it but certainly their aesthetic choice to stick with the way the ships always looked was a mistake in my opinion because they don't have to look like that anymore they did have to look like that you know and they just don't have to look you can have a like you don't have to have Sharp 90 degree angle angles on your ships all over the place anymore you can have curvature and and you know it's just I don't",
            "start": 1052.0
        },
        {
            "text": "look you can have a like you don't have to have Sharp 90 degree angle **** you know 90 Degree angles on your ships all over the place anymore you can have curvature and and you know it's just I don't know it it just bothers me so much that this game has been in development for so long and this is going to be a game that was released in 2016 I feel bad for Star Fox fans m i mean that's the thing is I I'm a huge Star Fox fan like I'm like that star is one of my favorite franchises of all time and I have a very special connection with the the series even like the ones that people don't like like Assault I think is one of the best Star Fox games just because of the the flight missions there's very few of them in the game and the on foot ones suck they're horrible but the flight missions seem like a sequel to 64 which is amazing SNES it doesn't hold up like it's great as a technological thing going back but like looking at it now playing it now it's it's not well nothing like that holds up",
            "start": 1088.84
        },
        {
            "text": "a sequel to Super Mario 64, which is amazing. SNES, it doesn't hold up like it's great as a technological thing going back, but like looking at it now playing it now, it's it's not well nothing like that holds up. It's the same thing with Pilotwings or anything like that, like Super Mario 64 does though, like I I think so to the degree that N64 games hold up at all, but but they hold up because of the gameplay and yeah the graphics and whatever it is what it is, and that's not a Nintendo 64 era thing, that is a polygonal PlayStation era thing too, yeah. Um no I I I I don't I don't disagree with you, it's just that like these were I was I remember being so impressed with Star Fox when I was a kid with like how it looked and and what it was doing and it's I don't know it's just it's just it's a disappointing thing to to tarnish the legacy of the games like that because I really want to see the graphics don't bother me like they're not good but they don't bother bother me cuz it's like at least it it does look like",
            "start": 1125.16
        },
        {
            "text": "tarnish the legacy of the games like that because I really want to see the graphics don't bother me like they're not good but they don't bother me cuz it's like at least it it does look like Star Fox, like you were saying it is very like that's how things look in the Star Fox universe and I know that that is just like it doesn't need to be that way and yeah if we got like a beautiful cell shaded thing and like there was way more going on that could be cool and I'd love to see that, that's not what we're getting. I wish perhaps we'd gotten that instead but looking at this I don't look at this and go oh I don't like I don't want to play this because of how it looks no I don't either but I I but it's definitely if you dropped that game on me like if you just showed me this game and you're like this is a canceled Star Fox game from seven years ago I'd be like I believe it 100% believe it yeah but I mean I think that's also one of those things like when people compare",
            "start": 1164.04
        },
        {
            "text": "game and you're like this is a canceled Star Fox game from seven years ago I'd be like I believe it 100% believe it yeah but I mean I think that's also one of those things like when people compare games like oh that looks like Twilight Princess looked back then it's like that's not true like this doesn't look like a GameCube game no it doesn't make me look like a GameCube looks like a Wii game uh I mean but it's HD and that's the thing is like that's all I Really Ever Needed from Star Fox all right cool I'm good yeah but to be I mean and to be fair to Star Fox I mean there's aesthetic choices being made and you can use Mega Man as an example of like well why do you make that you have to keep making 8-bit games when it's an eight-bit game and why would you keep going back to that but I still think we were playing Symphony the night when we did our our um on PlayStation one when we were doing our our stream for charity last weekend and I was talking to people",
            "start": 1195.24
        },
        {
            "text": "back to that but I still think we were playing Symphony the night when we did our stream on PlayStation one, when we were doing our stream for charity last weekend and I was talking to people in the comments about this is actually a technological feat and it's still pretty today because it's its beautiful pixel art and um these multiple layer parallax scrolling in the background and all these little secrets and hidden things whatever like that game still stands up, side scrollers typically stand up very well but when you go into the realm of 3D or whatever you have to keep kind of evolving um because there's just greater expectations and you see that Fallout with Fallout 4 right now um based on the way it looks compared to Dying Light in The Witcher in other words there's just no excuses anymore so when I see a game like this its just like well there's no excuse for this to look like this regardless of if they're making a",
            "start": 1228.48
        },
        {
            "text": "Light in The Witcher, in other words, there's just no excuses anymore. So when I see a game like this, it's just like, well, there's no excuse for this to look like this, regardless of if they're making a choice or not. It's I think, and I know I'm not the only person with that problem with the game. I mean, this is that's the thing though. But like my thing is just like those are all problems. But like to the hardcore Star Fox people, I don't think that that's that big of an issue. Like my issue is the gameplay. If the Star Fox gameplay is good, I don't care about any of that. And so far, it's not. That's my biggest issue with the game. And I wanted this direct to come out and be like, \"Hey, we're also adding just normal controls. You don't have to use the gyro thing.\" And I'm still holding out for that because I will be shocked if they release this game and it can only control the way that we've played it so far. No, I don't think they'll make that mistake with the thing cuz it's",
            "start": 1263.28
        },
        {
            "text": "that because I will be shocked if they release this game and it can only control the way that we've played it so far no I don't think they'll make that mistake with with the the Switch cuz it's like it's not good I straight wouldn't play it if it was that way me neither I mean that's I will not play it and like that sucks but I don't think they're going to do that I think I think they have extra time and they're polishing it maybe that was one of the reasons is that they had to go and that's what I'm expecting from it and I thought we'd have heard it in this but but maybe maybe it's a marketing thing too where you know they don't want to show the thing about Nintendo Directs to me which is which is awesome and both both awesome and funny is that it's also very markety like it's like don't forget you can buy byy byy by by by by by by by byy so like you know uh to me since it's so consumerist focused not consumer Focus but but about consumerism specifically it would be weird for them",
            "start": 1295.96
        },
        {
            "text": "forget you can buy byy byy by by by by by by by byy so like you know uh to me since it's so consumerist focused not consumer Focus but about consumerism specifically it would be weird for them it would be weird for Nintendo to come and be like by the way we know the controls suck and we fix them you know like that's something You' released like in a press release or something I'm still hopeful for the game and I am holding reserving judgments because I do not like it right now I want to like it right now the graphics aren't the thing holding me back and when with Star Fox Assault like you were talking about the Star Fox games have always been kind of a big technological meter for systems no but I even think like assault like assault graphically in a lot of ways no but assault was one of the first Gamecube one of the first Nintendo games to have a fully orchestrated soundtrack and like that's a huge deal like since then we've seen you know Galaxy do it in Galaxy 2 and like a lot of",
            "start": 1328.28
        },
        {
            "text": "the first Gamecube one of the first Nintendo games to have a fully orchestrated soundtrack and like that's a huge deal like since then we've seen you know Galaxy do it in Galaxy 2 and like a lot of the Zelda games and stuff so now it's fairly standard but that's a level of polish that most most games any developer don't really do you know we see it with Uncharted and we see it with some of like Sony's like top top tier things but Nintendo does that stuff in a very unique way because their overall polish of their games is it's special you know and we'll see how this all goes but I hope that I hope for you I hope for all the Nintendo fans out there it works we got some more Fire Emblem Fates details Birthright and Conquest two different games this it sounds less like a Pokémon Red and Blue situation more like a Zelda Oracle exactly what I was thinking and and ages thing that's exactly that's funny that's exactly the reference I was thinking but the discount that we didn't get with Oracle",
            "start": 1368.36
        },
        {
            "text": "situation more like a Zelda Oracle exactly what I was thinking and an Ages thing that's exactly that's funny that's exactly the reference I was thinking but the discount that we didn't get with Oracle is going to be here which is cool very cool so it's buy one and then you get the other one for $20 as a digital download it's two sides of the same story then there's a third story that is like a third perspective on the two things that's cool it's God's perspective I think I think it sounds really neat I'm not a huge Fire Emblem fan but I I think I think the sound this sounds really cool I think it's awesome to you know I know that there was a lot of questions when if this game was going to come out here at all and then uh which we knew it was you know a while ago but because of the two iterations how are they going to do this are they only going to release one are they going to somehow compound them I really think it's a thoughtful way for Nintendo to get both games out to be like you",
            "start": 1409.84
        },
        {
            "text": "how are they going to do this are they only going to release one are they going to somehow compound them I really think it's a thoughtful way for Nintendo to get both games out to be like you can just get the other one for half off yeah that's pretty cool I got to respect the **** out of that because um it's a lot of money to spend on a game that I I I assume will not be very different you know like the um I'm trying to think of an example came to my head oh it was Tales of Xillia the original Tales of Xillia which um on PS3 which could be played from the perspective of two different protagonists but the story was the same and you got some different cut scenes but the it was the same game and I my assumption is that these aren't going to be radically different again like Oracle of Ages and Seasons which might even be more different from each other than these are but that remains to be seen But it that definitely invoked those Capcom Zelda games to me yeah and you can",
            "start": 1448.08
        },
        {
            "text": "and Oracle Seasons, which might even be more different from each other than these are but that remains to be seen. But it definitely invoked those Capcom Zelda games to me, yeah. And you can get all three of them in the special edition for $80 on February 19th. I'm happy we got a release. It looks like I'm going to have a really fun spring 2016, a lot of games that I'm looking forward to. There uh games you're looking forward to, Mega Man Legacy Collection, yeah. Legacy collection's coming to 3DS, uh they get that amiibo too which I'm not I'm not super interested, I can just take one of my Mega Man amiibos and spray it with gold, a gold Mega Man amiibo, and it has an exclusive challenge mode that you well the challenge modes in the other ones too but there there are new challenges in this one and I made one of them so uh Mor's challenge will be in this uh and I'm excited about that uh it's really fun absurdly hard so I'll be interested to see what when I",
            "start": 1479.36
        },
        {
            "text": "new challenges in this one and I made one of them so uh Colin Moriarty's challenge will be in this uh and I'm excited about that uh it's really fun, absurdly hard so I'll be interested to see what when I designed it um I just went \"it's hard you know\" I couldn't go to their offices or whatever and so um I was talking to them over email and to Capcom and I basically just took a bunch of YouTube videos that were already existing and I'm like from this point to this point is the first phase and then from this point to this point in this video is the second phase and so on and so forth and it's really long and really, it's going to be quite difficult, classic call, really long it's going to be awesome um Hyrule Warriors Legends for 3DS we got some new character announcements we got T link Skull Kid a new character called Link looks like a female Link but instead of having a sword spin she has a spin kick yep yep Link Link Spin Attack you've got to be kidding me with that name, kick it's cool though",
            "start": 1520.48
        },
        {
            "text": "new character called Link looks like a female Link but instead of having a sword spin, she has a spin kick. Yep, yep, Link, Link Spin Attack - you've got to be kidding me with that name kick! It's cool that you know it was funny. I was just thinking about this not Linkle; what I was just thinking about was... and it's not gonna happen in this new Zelda game either, but it would be cool to roll out reverse Link, Zelda at some point, at some point, to make the female Link and still, I guess you'd have to roll with RSE their names maybe too, cuz you know you can't have like a male Zelda. I guess, but it would be cool to play as the female and go save the male, and I'm not saying that because you know I want you know uh an A diversity quota or whatever necessarily; I just think that that would be kind of neat. We've seen this one story so many times, you've heard that all the time - like they'd love it, I'd love to see a Legend of Zelda where you play as Zelda in your after and you play as...",
            "start": 1557.36
        },
        {
            "text": "Be kind of neat, we've seen this one story so many times. You've heard that all the time: \"They'd love to see a Legend of Zelda where you play as Zelda in your afterlife.\" And you play as she and all these kinds of things. But it's it's it would be cool to play, I guess. You wouldn't have to roll over even with names; it would be cool to just play as Zelda and go save Link. And it could still be a Legend of Zelda game. Yep, um... So I just think that that would be a neat perspective. Uh, because there does need to be some freshness thrown into the series. Although I think we're going to get that actually with the Wii U game. Because I really do believe that this is going to be like a true open-world RPG, yeah. A very Western-inspired game. I mean, I think it's... I think it's if they do that, that sounds awesome. I think it has the... It seems like that's what they're doing. And we've seen very little of the game, but it just... I think the reason we've seen so",
            "start": 1600.8
        },
        {
            "text": "It's I think it's if they do that that sounds awesome. I think it has the it seems like that's what they're doing, and we've seen very little of the game, but it just I think the reason we've seen so little of the game is because it's that you know, like the little things we've seen have just been kind of traveling around, and that's says a lot. My dream Zelda game is uh Romeo and Juliet 9s movie-style version of it where it takes place like in the future, and remember Romeo and Juliet, like the swords were guns and stuff like that. Yeah, you're talking about the Leonardo DiCaprio film adaptation. I'd be into that. Um, Dragon Quest 7 and 8 confirmed to come to 3DS early 2016. No one cares; absolutely no one it's a huge deal. Um, people probably don't care, but it's uh, Dragon Quest 7 especially, but Dragon Quest 7 and eight are games people really love. People really love those games, and one of my friends uses the",
            "start": 1629.64
        },
        {
            "text": "Dragon Quest VII especially but Dragon Quest, Dragon Quest VII and VIII are games people really love. People really love those games. And one of my friends uses the term JRPG as JRPG, meaning like it's a really... it's these are insanely deep games, like that Dragon Quest VII is 100-150 hour game. I mean, it's not that game's no joke. And a lot of people missed it because it was it was a PS1 game and it came out pretty late, I think it was a 2000 or 2001 even uh release. So it came out around one... like remember there were some late PS1 RPGs like Final Fantasy Origins and all that kind of stuff. This was around that era, a little earlier. And so people people missed out on it. Um, and that was a I if I remember correctly that was a pre-Square Enix game that was that was an NX published game. And that might be the last one of the last NX published games. Um, so uh it's cool to see that game again. And then Dragon Quest VIII was a PS2 game with a similar pedigree",
            "start": 1671.2
        },
        {
            "text": "that was an NX published game and that might be the last one of the last NX published games um so uh it's cool to see that game again and then Dragon Quest VIII was a PS2 game with a similar pedigree of just incredible depth and um I like Dragon Quest IX I thought it was a good game it was 3DS or DS exclusive I think um I reviewed it I think when we were at IGN but it it was missing like a certain something about squa that I think seven and eight had because seven and eight were bucking the trends of what was going on in RPGs around them by remaining very true and that's always been Dragon Quest's kind of Mantra until 10 which was like an MMO for some reason um so it's cool that these games are coming out people have been begging for these games the last time I was in Japan um which was over a year ago eight was about to come out I think on 3DS and and it just didn't seem like it was going to happen because these games are very dense and localizing them is not going to be easy so um or isn't",
            "start": 1713.56
        },
        {
            "text": "ago eight was about to come out I think on 3DS and and it just didn't seem like it was going to happen because these games are very dense and localizing them is not going to be easy so um or isn't easy but it's it's awesome that they're coming out um Dragon Quest is really um whether Dragon Quest Heroes on PS4 that Dragon Quest Builder game that's going to be on Vita um these Dragon Quest uh re-releases the PS4 and vita bundles that are in Japan whatever Dragon Quest is really living again plus the announcement that Dragon Quest 11 is going to be a traditional Dragon Quest game which got a lot of people very excited Dragon Quest is kind of going through a Renaissance right now in addition to like some of the games like Joker and all these kinds of games monsters that that are kind of the um the ancillary you know spin-off kind of games or whatever that are kind of still floating around so I have a real like a soft spot for TR Quest I always have it's one of its one of the",
            "start": 1755.4
        },
        {
            "text": "the um the ancillary you know yeah spin-off kind of games or whatever that are kind of still floating around so I have a real like a soft spot for Tales of Quest I always have it's one of its one of the games that got me into high fantasy and into role playing games so um when I was very young so it's exciting that these are coming out and that's I haven't played a 3DS game since Zelda so um so those will probably be the next two I play and I'll probably lose myself to them because I just they're grind fests and I like those kinds of games they're not like super story driven or very pretty or anything like that they're just fun you know um if you like that kind of stuff so I skipped over this somehow but Pokémon Red, Blue, and Yellow coming to Virtual Console on the 3DS I had no idea that they weren't out so Weird my God this this is huge news this is the first time a Pokémon game has been released digitally like on Virtual Console like an old one at least I didn't know that why I",
            "start": 1786.8
        },
        {
            "text": "that they weren't out so Weird my God this this is huge news this is the first time a Pokémon game has been released digitally like on Virtual Console like an old one at least I didn't know that why I didn't know that that was a thing so that's the thing because of how Pokémon work like the way that the there's so much trading and battling and how the games interact and all that stuff where you know Pokémon Red and Blue and then Gold and Silver those Generations happened and then when the GBA Generations happened it was kind of like a reboot of the series because you couldn't have GBA games and Game Boy games talk to each other so then they released Ruby and Sapphire and then they released Fire Red and Leaf Green which were remakes of Red and Blue and then that allowed you to catch all the the Pokémon like between the different you know Generations or whatever and then when the DS happened the DS could also interact with GBA games so that was never an issue okay you know I",
            "start": 1825.36
        },
        {
            "text": "all the Pokémon like between the different you know Generations or whatever and then when the DS happened the DS could also interact with GBA games so that was never an issue okay you know I got you and so Pokémon games are one of those things where they don't drop in Price ever because always need them you always need them so Nintendo has you know a very special thing with how they release games where their stuff just doesn't ever get cheap Smash Bros will always be retail price you know yeah and uh Pokémon's one of those things so to see them actually do this is huge I never thought that we'd see them on Virtual Console and I'm super excited this means that we might get to see gold and silver and I would love to play the original gold and silver again like as of now the only ways to play those games are either originally with the consoles which at this Point's hard because my batteries are all dead and stuff so it doesn't save right or emulation via PSP or however you want",
            "start": 1866.64
        },
        {
            "text": "play those games are either originally with the consoles which at this point's hard because my batteries are all dead and so it doesn't save right or emulation via PSP or however you want to do it I like that there's now going to be an official way to yeah you jump back oh I'm jumping in I think I might make Nick play too I want Nick to beat a Pokémon game specifically Yellow Version Pikachu edition if you didn't know you didn't know the Yellow Version me Pikachu it's so there's red and blue yellow was like the enhanced version of it that was based on the anime so you come across Team Rocket Jesse and James walks around follows you should I play one is there three so I can play one you do I need to play one y yeah you should we can need a different star we can trade wirelessly now which is a new function which is cool no link cables needed I'm very excited about this we had a date too what was the date hold on no linkle cables no link cables uh what a terrible name Link",
            "start": 1905.88
        },
        {
            "text": "Is a new function which is cool, no link cables needed. I'm very excited about this. We had a date too - what was the date? Hold on, no linkle cables, uh, what a terrible name Linkle. February 27th, Tingle came out back in the day, Tingle my talk... about Tingle, I dare. I am about this though, because Japan apparently is getting retail versions of Red, Blue, Green, and Yellow. We never got Green ever; we never did. Well, which was the original Pokémon? Yeah, we got Leaf Green when they remade it, but we didn't get a remake of Blue. It's weird. Yeah, it was always I was always fascinated by Pokémon Green because I was always like, \"What the... is it?\" It's just that was like the OG Pokémon game. Mhm. Oh well, then the biggest announcement all of a sudden Cloud Strife announced in Super Smash Brothers - what the... who saw this coming? Yeah, no one; it was weird. This is a weird one; this is a weird one because I think I think like we said we did a video about it.",
            "start": 1949.92
        },
        {
            "text": "announced in Super Smash Brothers what the **** who saw this coming yeah no one it was weird this is a weird one this is a weird one because I think it I think like we said we did a video about it and I said this could either have like deep meaning in terms of the future or this could really literally mean nothing at all and I think that's great because I think that this at least hints at Final Fantasy VII Remake coming to the Nintendo Switch, not NX, and I would love that that this is good signs for the future of the Switch right now not necessarily anything's going to happen I think I think you might be reading into it too much but I think that but I don't necessarily know if you are I mean that's the kind of the thing is I just this is such a weird one this is a weird one uh cloud has literally nothing to do with Nintendo has everything to do with Final Fantasy VII but it's like people have been comparing this on Twitter to like when Snake was in was in Smash and I was like well no it's not the same at all",
            "start": 1995.96
        },
        {
            "text": "do with Nintendo has everything theater Rhythm fantasy but it's like people have been comparing this on Twitter to like when Snake was in Smash and I was like well no it's not the same at all because Snake, from Metal Gear, and the first Metal Gear game was an MSX and NES game so it's there there's there's lineage there's a history there's like a definitive history there are three Metal Gear games that were on Nintendo platforms only um so including Metal Gear: Solid 3 as well so it's it's one of these things where I see Cloud and I'm like all right well Final Fantasy VII's only Nintendo connection in the main is that it was going to be a Nintendo game um and then it just wasn't it couldn't be um they couldn't you know execute their vision on a cartridge so it's it's interesting in that way my what I what I what I read into this is that it might not mean anything at all except for the fact that there's two things this is a clear shot at Sony if my if my mindset is",
            "start": 2038.36
        },
        {
            "text": "in that way my what I what I what I read into this is that it might not mean anything at all except for the fact that there's two things this is a clear shot at Sony if my if my mindset is right in the sense that Sony could not secure this character for PlayStation All-Stars or they just got Lightning no they they couldn't get anyone they couldn't get Crash if Crash comes to Smash Bros, ladies and gentlemen, and that's possible I mean you know that that's possible as well but it's you think that's the December announcement oh my God no I don't think they would I don't think they would do that but there was a lot of rumors or conjecture that no one wanted or a lot of publishers and IP holders didn't want their their characters involved in All-Stars because it wasn't a proven IP and this says that if that was the case with Square and we don't know if it was or not that they actually you know unlike All-Stars they see a lot of prize in Smash of course they do because",
            "start": 2080.56
        },
        {
            "text": "Cloud in Smash Bros! Nintendo Direct Reactions - Kinda Funny Gamescast Ep. 45 (Pt. 1) says that if that was the case with Square and we don't know if it was or not, that they actually you know unlike All Stars they see a lot of praise in Smash of course they do because Smash is a fantastic series and a fantastic game um but it shows that you know people were desperate for Cloud and for Crash um and they just got Cloud in the in I won't even say the competitor it's just the game that inspired all All-Stars in a way so I I think at the very least this is an overt shot at Sony um to get one of their characters, a character I mean there's there's really few characters that are more closely associated with PlayStation's history than Cloud um but again the conspiracy theorist in me kind of thinks that this means more than just uh than just getting and I don't know if it's I don't know that it's the the Final Fantasy VII remake, because as far as I understand that is a PlayStation first game um and it will come out on PC as well yeah exactly but I wonder if this",
            "start": 2114.96
        },
        {
            "text": "I don't know that it's the Final Fantasy VII remake, Neil because as far as I understand that is a PlayStation first game um and it will come out on PC as well yeah exactly but I wonder if this maybe insinuates that the Final Fantasy VII Port is going to come to Wii U that'd be great um so I I wonder if that might be a little more reasonable to assume than than um than the game being ported, yeah you know Smash has a weird history of kind of predicting what's going to happen and it doesn't necessarily like you're saying mean anything you know we saw Pit in Brawl and then we eventually saw Kid Icarus on 3DS but then we saw Ice Climbers still haven't seen them come back and do anything no they're still missing so they are still missing but there there's a lot of stuff like that that it really doesn't mean anything and I think Smash kind of gave up on the whole this needs to make sense stuff a while back like Snake was like what the **** even though he has lineage Nintendo.",
            "start": 2154.24
        },
        {
            "text": "that it really doesn't mean anything and I think Smash kind of gave up on the whole this needs to make sense stuff a while back like Snake was like what the **** even though he has lineage Nintendo really he's this the odd man out when it came to at least up till Brawl you know no he was but now that we have the Wii U one with Pac-Man yeah okay Pac-Man games were on Nintendo but that doesn't mean **** Namco made the game that's why that happened I think that's why I mean well that's what I'm that's what I'm saying is that you didn't have to there could have been deeper meaning in Snake or Pac-Man being on on the the systems except for the fact that there's just obvious reasons of why they probably were Snake with his lineage and Pac-Man just being a you know Bandai Namco's like icon as Pac-Man so of course they're going to shove him in there somewhere but then Ryu is another thing and he's a newer character that I could once Ryu was added I was like nothing makes sense I can no longer",
            "start": 2195.2
        },
        {
            "text": "as Pac-Man, so of course they're going to shove him in there somewhere, but then Ryu is another thing and he's a newer character. That I could once Ryu was added, I was like nothing makes sense anymore, I can no longer predict what's going on, this that that too. But again, there is a significant Nintendo legacy, like the original Street Fighter II was a Nintendo game and so it's you know that's an NES game and then Street Fighter II was at home on Super Nintendo, that's where everyone played the game because the Genesis version was so borked, you know with the control scheme. So again, there might be more to it or there might not, there clearly isn't with Street Fighter V because that's a PlayStation game but and a PC game, but that made sense to me too, I mean that's where I played Street Fighter II, Street Fighter II Turbo, Super Street Fighter II, like I played all those on Super Nintendo. So there is an obviously Street Fighter the original Street Fighter so that wasn't as",
            "start": 2229.76
        },
        {
            "text": "Street Fighter 2 Street Fighter 2 Turbo Super Street Fighter 2 like I played all those on Super Nintendo so there is a a uh an obviously Street Fighter the original Street Fighter so that wasn't as confusing to me the point I'm making with Cloud is that there's nothing yeah and also they overtly I mean there was Final Fantasy VII music like and they even showed the Final Fantasy VII logo like it was built up to make it kind of look like Final Fantasy VII was coming in some form before Smash even happened usually Smash trailers start off with the the Smash like like the fire burning thing and in the direct it didn't in the trailer if you watch on YouTube now it does but EXC me um that's interesting because they usually always show that first so they were trying to trick us um I'm so excited about this but like we were saying earlier I'm more excited the fact that we're getting a Smash Direct next month like that's huge what do you think it's going to be stages characters oh yeah I",
            "start": 2266.36
        },
        {
            "text": "this but like we were saying earlier I'm more excited the fact that we're getting a Nintendo Direct next month like that's huge what do you think it's going to be stages characters oh yeah I mean there's definitely characters definitely St we'll get a release date for Cloud it might I am willing to bet it will be one of those like they're available now and it's going to be Cloud Wolf will come back to promote Star Fox um Shovel Knight I'm going to be shocked if he's not in it like he has the amiibo um Ice Climbers for God's sake maybe I mean at this point the only characters in Smash that aren't back are Ice Climbers Snake Wolf Pichu I think that's it Pichu doesn't need to come back pichu's not coming that a waste I will be shocked I never thought Roy would come back either though so I don't know there's no no rules I know that there are some te I know there's some technical limitations with the Ice Climbers apparently I don't really believe that uh and making those characters run",
            "start": 2304.84
        },
        {
            "text": "don't know there's no rules I know that there are some tech limitations with the Ice Climbers apparently I don't really believe that uh and making those characters run on 3DS that that's the rumored reason why they or maybe that is the reason but I just figure it out you me like I I I know that they weren't very popular characters but those were my character and and I loved playing though you can't change your name on Sony because of tech limitations you can't play his Ice Climber I have a feeling that the reason I think that they're not there for a reason and that is they just want to bring them back at some point as DLC and I think that they will but it's not even that exciting for most people you know like this was something you should have done like immediately like this should have been the first piece of DLC because I think that I think now so deep it's like people are going to be like well they're just people are going to be disappointed and",
            "start": 2350.64
        },
        {
            "text": "immediately like this should have been the first piece of DLC because I think that I think now so deep it's like people are going to be like well they're just people are going to be disappointed and that and that's going to disappoint me but I think but I think that this is going to be like a Lucas announcement where it's just like yeah you get Roy well Roy is kind of a big deal coming back from melee and Ryu oh and Lucas you know so and Mewtwo as well it's like these returns they're not supposed to be the like oh **** things it's more like you also get this just so they can say there's three characters you know uh but the roster is getting ridiculous at this point yeah it's it's getting quite it's getting quite robust and there are there are some third parties that I would you know or some other I would I always really wanted Wii in the game um I would have rather had Wii than Mega Man uh but to play like I've always said to play like Pokémon trainer which I think would be fun with",
            "start": 2383.64
        },
        {
            "text": "other I would I always really wanted Wii in the game um I would have rather had Wii than Mega Man uh but to play like I've always said to play like Pokémon trainer which I think would be fun with the different Masters but you know we'll see they're probably rounding it out I can't imagine they're going to support this game for much longer after that I just don't not because it's not selling it's an extraordinarily popular game it's just like you got to kind of wait and let it breathe and maybe bring it to NX at some point I mean that so that's my thing is I can't believe that a Smash Direct was just announced like we got this is going to be the third Smash specific direct that we've gotten over the last couple years like right before one came out they had one and they announced I think was like 50 huge things coming for Smash Bros so not only did they give me a Smash Bros video they gave me a list video and now it's a whole bunch of **** I'm like what and now at this point we can play an",
            "start": 2418.4
        },
        {
            "text": "like 50 huge things coming to Smash Bros so not only did they give me a Smash Bros video they gave me a list video and now it's a whole bunch of **** I'm like what and now at this point we can play an eight player match where those players are Pac-Man, Mega Man, Mario, Sonic, Cloud, Ryu, and I don't know whatever Pikachu that's insane no Dry Bones though yeah not yet I doubt ever but then they had the other direct where it announced Roy and um Ryu and stuff that that's insane get another one this might be the last one like this might be that Here's the final thing but also I love that it's going right into the holidays I'm stoked it's fun to see you so excited oh this is so usually it's always just bad Nintendo news for you but here you are of sunshine so good out there but to about NX I think that there is a a chance for them to keep supporting this game and then somehow just transfer it over to NX I think that's probably the smart move I think that's probably the smart move and I",
            "start": 2454.48
        },
        {
            "text": "I think that there is a chance for them to keep supporting this game and then somehow just transfer it over to NX. I think that's probably the smart move. I think that's probably the smart move, and I wonder if Bandai Namco isn't already working on that. So it's uh yeah it's fun. I mean I I'm of two minds with the Nintendo Direct mentality like I said. Like I it's it's really a cool very cool way to speak to your fans um in a way that's unfiltered um and rehearsed so it's meaningful and impactful or whatever. I also like I was saying I always kind of make fun of Nintendo directors as well just because they are very like bye bye bye bye bye bye bye- bye and don't forget and don't forget and don't forget and you can have this this this this this this, and I'm like that's cool but I feel like because that's what games are right, that's what E3 every Sony conference every Microsoft conference is but it's not quite as like shoving yeah like I'm like it feels a little dirty.",
            "start": 2501.76
        },
        {
            "text": "I feel like because that's what games are right, that's what E3 every Sony conference every Microsoft conference but it's not quite as like shoving yeah like I'm like it feels a little dirty sometimes like I get it guys like the games are for sale let's talk about release dates but I don't have to kind of like you know it seems a little it comes off as a little much to me too but but that said like I do think it's it's extremely effective yeah I see I love it because we got to see it in a fun video that creates an event out of this thing or it's the same information in a press release that's just released with a price tag you know I would much rather hear stupid jokes and then this thing just because even though I would never have watched the trailer for some those things now I'm forced to see the Cloud Strife announcement you know and I love that it's 45 minutes it's not like it's no I mean it's not time-consuming it's fun I mean",
            "start": 2537.48
        },
        {
            "text": "the trailer for some those things now I'm forced to see the Cloud Strife announcement you know and I love that it's 45 minutes it's not like it's no I mean it's not time consuming it's fun I mean it's a fun we always said when Vita came out and really started to die immediately that that it would uh it would have been cool for them to have like Vita directs and stuff like that or that kind of style but it's just that's a Nintendo thing and I don't know if anyone can even really mimic it or attempt to mimic it because they'll be called out on it I think Nintendo kind of hit gold with with this notion of cutting the middleman they're good at that cuz the middleman are not that important anymore like it's it's more about just speaking directly to your fans you can find a group of anyone that likes go to the Fire Emblem people go to the Pokémon people you can just talk directly in them you don't have to filter it through like a bunch of other people so they they were really the first",
            "start": 2575.84
        },
        {
            "text": "that likes go to the Fire Emblem people, go to the Pokémon people. You can just talk directly in them; you don't have to filter it through like a bunch of other people. So they were really the first ones to realize it, and so you know more power to them for that. Yep",
            "start": 2609.56
        }
    ]
}