{
    "id": 1370,
    "video_id": "XJKahyJazMg",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "How To Decide Where To Eat - The GameOverGreggy Show Ep. 103 (Pt. 3)",
    "description": "Tim Gettys questions if there is a better way to decide where to eat.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1448438400,
    "duration": 1143,
    "transcript_chunks": [
        {
            "text": "Tim, yes, what's your topic? So you know how every day when it gets to lunchtime Kevin comes out and goes Tim, what do you want to do for lunch? Hey, do you want tie food? Do you want burritos? It's like I want burritos. Which burritos do you want? Do you want this burritos or that burritos? I don't know. I kind of want this burritos. No, I want the other burritos. Why uh and it turns out that fight was my topic the whole time. Kevin brought pizza; he just had pizza. The question is, he had like a thing of Tupperware with pizza in it. He's had it for like 12 years now over the span of four weeks. By the last time, the last piece of pizza was looking not good, buddy. But you still wolfed it down anyway. It's the pepperoni; it's all those salts. Where do we eat when it's lunchtime? How do you solve that problem? Where do we eat? Comp is one of the more complicated issues, Jesus Christ. We need contingency plans. Yeah, you know how the United States has contingency plans if China like invaded San Francisco well we need a",
            "start": 2.85
        },
        {
            "text": "\"Comp it's one of the more complicated issues Jesus Christ we need contingency plans yeah you know how the United States has contingency plans if China like you know invaded San Francisco well we need a contingency plan well we Havey plan for everything sure we have contingency plans for alien invasions it's it's a matter of yeah like you need contingencies because it is a **** complicated problem and it's a problem I feel in every stage of your life and with every group it's a different set of circumstances your girlfriend yeah exact I mean that's the worst because that then there's layers of like deep-seated problems that come out there where it's like I don't care it's like okay do you really not care or does that mean you want me to choose or does that mean you want me to remember a place that you wanted to go 2 weeks ago go that's and I just don't you know what I mean I I don't even **** know but the the biggest thing to me is the work group because you with these people\"\n\nI corrected \"Jes Christ\" to \"Jesus Christ\", which is a common phrase, and left the rest of the text as it was.",
            "start": 49.28
        },
        {
            "text": "a place that you wanted to go 2 weeks ago go that's and I just don't you know what I mean I I don't even **** know but the the biggest thing to me is the work group because you with these people every day and you have to eat every day that's how being a human works right yes and recently I was by IGN and I saw all the places that like we used to frequent every day and I was like man this was a big part of my life now it's not yeah and now I walk around these streets the streets as they're called there's some Z in the streets um and it's just like it's a lot of a lot of Asian food yeah and it's like a lot of them aren't really lunchy places so it's like most of them are off the list there's a Thai place that we go to all the time there's a like a bunch of Mexican places depending on where you go there's a Taco Bell which I put in its own category that doesn't count as Mexican of course yeah and uh um but then it's one of those things where it's like we just eat",
            "start": 86.88
        },
        {
            "text": "depending on where you go there's a Taco Bell which I put in its own category that doesn't count as Mexican of course yeah and uh um but then it's one of those things where it's like we just eat it we just keep eating it e eating and it's just like do you want to go somewhere else and it's just like that sounds stressful I don't know I get an about lunch I'll tell you that and dinner breakfast I got unlock it's usually just Starbucks or nothing but yeah uh your lunch is often Starbucks too I come out you guys are eating these weird ass sandwiches you got out of a Starbucks yeah chill box well the reason I like that is because then you know what you're sort of getting right like I get I get weird anxiety about lunches when people like you know we used to go to uh was like Mergan's yeah and that place was great but I'd have a salad and I was like this salad was $2 and it's got to be like 1,000 to, 1500 calories in this **** thing like it was so so rich and salty and like Crouton with",
            "start": 131.92
        },
        {
            "text": "that place was great but I'd have a salad and I was like this salad was $2 and it's got to be like 1,000 to 1500 calories in this **** thing like it was so so rich and salty and like crouton with all sorts of **** that don't belong in a salad and that's what I get weirded out about is that like when when I think about lunch is I like to know what's going into that meal and I like to know what I'm getting myself into that's why I like Starbucks because at least they have some semblance of like the ingredients consistency and like the calories and like how much fat am I getting versus proteins versus carbohydrates not that I really give a **** or really calculate any of that stuff but it's comforting right like every time I'm in an airport if they have a Starbucks I'll probably end up eating there cuz again it is like I know I like this uh the bacon guacamole chabata sandwich like I'm all set you know what Ian my business I have one of those today to be fair though Nick",
            "start": 168.08
        },
        {
            "text": "\"end up eating there cuz again it is like I know I like this uh the bacon guacamole sandwich like I'm all set you know what Ian my business I have one of those today to be fair though Nick you're different like you you have very strict eating habits and they do not change and when you have to change then you just kind of adapt in your own weird way but when we were at IGN everything I said does not apply you did one thing every day and getting you to change was like an impossible task you would only leave if like we had to go somewhere to sit down and like have like a business talk because all would do is go to this damn Embarcadero Center market and go and it was a garbage place that was way too expensive and you'd go to the stupid ass build your own salad thing with these weird ass salad pieces that are just like chilling for way too long and I'm like this is disgusting just lettuce and like well yeah but I don't did you even get the lettuce or boil eggs put them in some chicken\"",
            "start": 207.4
        },
        {
            "text": "pieces that are just like chilling for way too long and I'm like this is disgusting just lettuce and like well yeah but I don't did you even get the lettuce or boil eggs put them in some chicken breast I was doing a I mean I still do to some degree a pretty hardcore protein diet but um not not So Much Anymore like now I'll have the occasional burrito because man's got to live Colin man's gotta live lie **** that's the biggest lie I can't remember the last time I saw you eat a burrito we go out for buros last week and what did you get Nick got a burrito bowl thank you that is not a burrito you got all the components VAR **** ingredients put into a styrofoam container and just minus the tortilla I just didn't want the extra calories the best part it is the best part and the cheese but sometimes you have to limit yourself that's all the time I can't when when was the last time think you ate a burrito with us with you guys yeah uh the last time we went to Gordy's I had a burrito no",
            "start": 248.8
        },
        {
            "text": "you have to limit yourself that's all the time i can't when was the last time think you ate a burrito with us with you guys yeah uh the last time we went to Gordo's I had a burrito no the time before that I did time before that the time before that I had the time two times ago I had a bowl the time before that I had a burrito that was always burrito on Friday that we used to do the show after work and we'd come home and we would go to Underdog's you we'd all be like yeah we want a California BRE California BRE California and then I need two sides carada you got it lettuce and they're always like wait what are you or I'm like I'm building a salad sometimes you guys know how to do it it's you're going to have to talk to a manager I know go ahead but see this is why i have anxiety about all this stuff is because it shouldn't be that difficult to try and build something healthy for yourself at a restaurant but it's the extreme like it's so far out of the Norm for people that work",
            "start": 295.2
        },
        {
            "text": "this stuff is because it shouldn't be that difficult to try and build something healthy for yourself at a restaurant but it's the extreme like it's so far out of the **Normal** for people that work at these restaurants or these burrito shops or any of these places to attempt to try to get something healthy for someone that they think you're a **whacko** do right yeah like you go to Burrito you literally get and I'm not knocking this cuz it sounds amazing **French Fries** in your burrito that is a thing that you guys get on a consistent basis awesome it's amazing that is taking something that is traditionally fairly unhealthy and cramming something even more unhealthy up its ass but it's a replacement for the rice six of one half do and the other they're both they're both reps of the rice true enough but there but there but it's a replacement it's a starch replacement it is it is it's a **starch** replacement all right so here's the thing is that with food it's tough when I don't have I",
            "start": 336.08
        },
        {
            "text": "\"Rice true enough, but there, it's a starch replacement. It is, it's a carb replacement, all right. So here's the thing: with food, it's tough when I don't have to cook and I'm actually think I'm a really good cook, but when I and Greg - Greg's a good cook too; he's doing way more experimental stuff now than I've seen him ever do, but Rich every day, it's amazing. I have no reason to cook really anymore, you know? So it's like I just don't, and I eat the same five things over and over again, but I kind of like eating those five things over and over again. I buy sausages - hot pork sausages, slow down - I buy beef and make like burgers; I usually get 4 pounds, I usually wrap them in tortillas loaded with cheddar cheese, mayonnaise, and ketchup. Yeah, okay, and just eat those the same way. That's totally fine. So that's a great meal. Uh, I'll make chicken cutlets, mhm. Occasionally, I'll make sauce.\"",
            "start": 375.16
        },
        {
            "text": "**** Cheddar cheese mayonnaise and ketchup, yeah okay, and just eat. I eat those the same way; that's totally fine. So that's a great meal. Uh, I'll make chicken cutlets. Mhm. Occasionally, I'll make sauce, although I've not made sauce in a long time. You do uh, and then I'll buy like things like frozen pizza or then I'll just... I actually don't eat out very much. Um, because to Tim's point, the selection in this neighborhood is **** garbage. So like, but it's almost... but it's almost a blessing not only for my you know, I have high cholesterol; the doctor told me I have high cholesterol, not a huge surprise if I lived somewhere like Hayes Valley or the Haight, I'd be **** seven ways from Sunday with like the amount of the amount of food that I that like that I would have available. So it's almost... it's like if there was Five Guys or Chick-fil-A near me, it'd be over; it'd be over. Don't you understand that? So I have to so I have to so I have to just I have to take advantage of",
            "start": 424.16
        },
        {
            "text": "like if there was five guys or Chick-fil-A near me it'd be over it'd be over don't you understand that so I have to so I have to so I have to just I have to it's almost I have to take advantage of a blessing in disguise that there's so like if you want to eat anything that we really want to eat around here you're walking and it's like is it worth it today no in the problem for us is it's not so much a walk it's the fact that it's the food around here is it's a drive distance it's walkable but it's not walkable during a lunch break sure so it's like that's the big issue cuz like 10 blocks down there's it's a a whole bunch of food yeah but the problem is then you have to deal with like the lunch rush and all that other **** on top of parking yeah and that's that's a whole other **** issue the last last like four Gordo's trips have been great we've gotten spots no problem we just get right in there knock on wood yeah the problem is too is just what everybody wants differently you know",
            "start": 464.92
        },
        {
            "text": "the last few Gordy's trips have been great, we've gotten spots no problem, we just get right in there, knock on wood. Yeah, the problem is too is just what everybody wants differently, you know what I mean? I play lunch is I have food here to cook or make or whatever you know what I mean. But the only thing I will consistently if you say every day we're going to get a burrito, I'm out the door, I'm getting a burrito with you. But it's when it's something else that's when I can turn it down, I can go either way. I like going to Jenny's but the problem, the problem there is Burg place, the problem there is that it's it's small, like it's ****, it's just it's a spin of the you know of the wheel, it's a roll of the dice depending on if you're going to be able to dominate four people together. You can always sit by yourself in there but you know we could go to I miss the days of old when nothing around you had to go to the car, the mall, you had to get in the car, it was it was like the whole",
            "start": 505.32
        },
        {
            "text": "can always sit by yourself in there but you know we could go to I miss the days of old when nothing around you had to go to the car, the mall, you had to get in the car it was it was like the whole rigmarole of like who's going to drive and then shotgun if you didn't call shotgun you were just that was the rest of your day right there boom and then blast in Metallica oh man in his badass Civic didn't he have a like a Civic Si I don't know, you Civic Si uh yeah and then you'd go choices were either Tan France or Monte Carlo is never an option it isn't because they had the Rubios it was the Chevy what tan Frj we went to BJs all the time that was awful what are you talking about BJ Buffalo Chicken Pizza is The Only Thing Worth a shout out n the buffalo chicken pizza dude it it is funny back when I was when I was like really poor when I first moved here and going to BJs and and eating there like man I ate for four bucks like this is great I can't go back to those days I can't I won't go back to the BJ",
            "start": 540.36
        },
        {
            "text": "like really poor when I first moved here and going to BJ's and and eating there like man I ate for four bucks like this is great I can't go back to those days I can't I won't go back to the BJ lunches no you're up man when Nick and I went down for the Metal Gear Let's Plays we we we went out that night BJ's right there in the mall I got my buffalo chicken pizza happy is a pig and I'll tell you what sitting there no se I don't want the celery I don't want the onions the barbecue sauce replaced with buffalo sauce yes I know that's a lot of buffalo sauce on a pizza do it ma'am and a side of buffalo sauce please my God see this this is where I think you guys give me all this but you know that I secretly eat all the that you guys eat right no I eat it off of your plate no oh okay that's fine you literally were like are you going to have piece of this pizza I was like no and you're like are you saying no and you're really going to have a piece of this",
            "start": 590.84
        },
        {
            "text": "of your plate no oh okay that's fine you literally were like are you going to have piece of this pizza I was like no and you're like are you saying no and you're really going to have a piece of this pizza because I'll get the bigger one I was like get the bigger one I have a fantasy of of Nick where you know Nick and Nick and I have been many places together but Nick and I have never been to a Del Taco together and I have a fantasy of Nick and I going in and walking in and I just look at Nick and I'm like is it Go time and Nick Nick's like sure is and then we walk up and we order literally $45 worth of food because it's when I go to Del Taco like when I used to go to Insomniac there's a Del Taco right across the street from that and in Burbank it's like you know you stay in the same hotel when you go down there whatever and there's a lunch break I'm like I'm going to hit Del Taco yeah literally seven times in the next two days and there's nothing you can do to stop it",
            "start": 630.36
        },
        {
            "text": "same hotel when you go down there whatever and there's a lunch R I'm like I'm going to Del Taco, yep literally seven times in the next two days and there's nothing you can do to stop it there's nothing that can be done when we were in LA we were there for three days how many of those nights did we go to Del Taco think about that again no it was two it was two we went two nights in a row and just to balance it all out when I got back when we drove back on Sunday I went to Taco Bell just so I just felt like you know like I was neglecting her so much better than it is well it's a different taste it's a different flavor of life but I will next E3 we've got to do it we've got to go to Del Taco and it has to happen the problem is Del Taco is only good at at like 1 o'clock in the morning when you're kind of drunk it can't be light out no not I mean I'll agree with you as far as it cannot be light out but other than that it's you know it I don't know I I cuz my fantasy is like",
            "start": 669.64
        },
        {
            "text": "morning when you're kind of drunk it can't be light out no not I mean I'll agree with you as far as it cannot be light out but other than that it's you know it I don't know I I cuz my fantasy is like having a Chick-fil-A and Five Guys nearby and all this kind of stuff but I'm like that would be you so bad you'll die no I mean it's not even that like like one two in the neighborhood like five blocks away I okay do you have any idea how much I would eat at those places I'd be finished it would be over for me it would be over I would like a Chick-Fil-A around here like I that would be seven blocks somewhere our heads would explode if that suddenly happen somehow but once that'd be a once a weeker for me that would be a once I would have to myself because Nick judges me I judge all of you guys not because you guys go to Chick-fil-A because Chick-fil-A actually is not that bad as far as like you know caloric values are concerned they have like the grilled if you get the",
            "start": 709.88
        },
        {
            "text": "all of you guys not because you guys go to Chick-fil-A because Chick-fil-A actually is not that bad as far as like you know caloric values are concerned they have like the grilled if you get the grilled chicken sandwich probably yeah that's what I'm getting a chickf flake get the **** out of here Nick but it's the fact that when we were at MomoCon in Atlanta and there was a Chick-fil-A across from my hotel you **** went every meal not once a day every meal called someone it was like L's like I'm not even hungry someone **** brought him Chick-fil-A anyway he called Postmates and they brought him up Chick-fil-A and I was like Colin this is he just kept it on standby I'm like you going to eat this Chick-fil-A he's like I don't know maybe yeah I would buy more sandwiches than I needed just so I could have them in the hotel room the best is when we had it for dinner one day and when I was going to bed I was super excited to wake up and go get their breakfast biscuit chicken",
            "start": 756.76
        },
        {
            "text": "needed just so I could have them in the hotel room the best is when we had it for dinner one day and when I was going to bed I was super excited to wake up and go get their breakfast biscuit chicken sandwiches cuz we don't have it anywhere it's like when I go to I go home to Chicago for 3 days and I eat at Portillo's five times like that's just cuz it's there and I can't have it any other time that's my Del Taco I mean when I go to Southern California I'm like I went down for my brother's birthday and we went to Del Taco the first night and I was like what are the chances we're going to go back again tonight he's like what you out your **** mind we're not going again tonight and we didn't and it broke my heart Chang did he was like oh my God but yeah no I I get it trust me I mean I just I just never glommed on to Chick-fil-A like you guys do I don't know why I just I just don't think it tastes I think it's cuz the fries just don't do it for just stop talking it's those weird soggy",
            "start": 799.68
        },
        {
            "text": "I just never glommed on to Chick-fil-A like you guys do. I don't know why. I just, I just don't think it tastes good. I think it's because the fries just don't do it for me. Just stop talking about it. It's those weird soggy cold fries - they're always cold when you get them, depend on how long they've been sitting there. They're like limp. They're like a condiment for mayonnaise. Come on, come on, Nick. The there's so many better options. Tell you the Crispy Cup fry from Carl's Jr. - that's a fry too much. That just tastes like heat and salt and grease and crisp. You can't even taste the French fry because it burns your mouth before it actually gets even a millimeter in. No, what about the little grilled zucchinis? Whatever the heck they're called. I think they're zucchini chips or what they are. Yeah, those burn the heck out of your mouth. Yeah, zucchinis. I'd be like, you know, I'm not here for this. The conundrum of my mind is again, Chick-fil-A and Five Guys - these are the two things that",
            "start": 831.08
        },
        {
            "text": "Out of your mouth, yeah zucchinis, yeah I'd be like, you know, I'm not I'm not here for this. The conundrum of my mind is again Chick-fil-A and Five Guys - these are the competition for the throne in my mind. I don't know which one I would want more in the neighborhood. Chick-fil-A's got you say that, but there are downsides, you know? There's no Sundays, they're done. Yeah, that's the one day for your body to recover, Colin. That's true - it's my cheat day, yeah. My cheat days is what I eat healthy, yeah. Um, I saw you eat a salad the other day; you were like making this artisanal salad and it looks so good, and you're like, \"Yeah, I don't know...I think I'm going to make...I think make a salad today.\" You made a salad that day - I was so proud of you. And then I need to just eat green things because I don't well like the doctor told me you're fine; give me the whole rundown except you have high cholesterol and you basically have no vitamin D in your body at all, yeah. Oh my...well it's",
            "start": 874.36
        },
        {
            "text": "because I don't well like the doctor told me you're fine give me the whole rundown except you have high cholesterol and you basically have no vitamin D in your body at all yeah oh my well it's not a huge surprise I don't ever leave the house because I'm work in this place and it's any they said you know San Francisco not uncommon it's overcast all the time here and stuff like that I'm like yeah that's a good excuse that's the excuse um but like Five Guys is so dominant as well it's hard for me to like decide on anything else because Five Guys is so good it's so good I don't mess with the Five Guys from has the Five Guys they didn't if they did we would have been if they had I would have tried it a long time ago going to In-N-Out now it's like the saddest thing in the world it's just I don't know why anyone would want to be there that mall has always yeah malls are always sad yeah Mall sad I don't when Vin closed down it would get a little sad on that when they closed down the 50th Street that was",
            "start": 923.52
        },
        {
            "text": "why anyone would want to be there that mall has always yeah malls are always sad yeah Mall sad I don't know when Mervyns closed down it would get a little sad on that day when they closed down the 50th Street location that was a sad moment spot have The Elephant Bar though so everything's not all lost I had The Elephant Bar two nights ago and The Elephant Bar and BJ's are equal in my book uh **** you they really are BJ's BJ's is A Cut Above of The Elephant Bar yeah no they literally it's the ceremony and Tamp you go there you get the buffalo chicken pizza all the things I said before you get a Jeremiah Red and you **** enjoy your life all right I will I've never liked anything I got at The Elephant Bar ever whereas BJ's does have the Bazooki so give it to them thank you Santa I mean the the Wild Card of Santana is is the Buffalo Wild Wings now but that Buffalo Wild Wings is really not very good it's a pretty bad storm it's the only Buffalo Wild Wings in the Bay Area it's true but I remember going in there I tweeted out",
            "start": 966.68
        },
        {
            "text": "Buffalo Wild Wings now, but that Buffalo Wings is really not very good. It's a pretty bad storm; it's the only Buffalo Wild Wings in the Bay Area, it's true. But I remember going in there; I tweeted out pictures of it and they reached out to me. But I never even like talked to them; I was like, \"Whatever, it's too much work.\" Where I was like, \"I'm like this bathroom looks like a bathroom out of Fallout 4\"; I was like, \"You ****\" and it was like 11 in the morning; I'm like, \"What the **** is going on here?\" Your boy Colin has taken a ****, and he can't take a ****. You know that W comes out if it's dirty; he just put down ten mozzarella sticks and twenty garlic wings and like three glasses of Coke. Can the man take a ****? Yeah, the answer was no, yeah, no. And I had a **** scurry out of there real quick. You threw cash on the table and left 'cause when I got to go, I got to go. I understand; cuz sometimes we like to know that I like to wait until the very last minute, but sometimes there's you know.",
            "start": 1015.2
        },
        {
            "text": "quick you threw cash on the table and left cuz when I got to go I got to go I understand cuz sometimes we like to know that I like to wait until the very last minute but sometimes there's you know sometimes you you can't play around with that in public no no no that's that's the game is for here the game and it is a game it's a fun game in that Buffalo Wild Wings since it is where it is all it is is just a bunch of high school kids working and it's like they half of their job is is making sure that you're waited and the other half of their job is flirting with whoever else is working at the time I respect that half job I respect that hustle too and I'm I like half the fun of Buffalo Wild Wings is trying to see who's hooking up with who yeah who's who's with who and then as you go week after week you see things develop and like relationships change and like it's kind of like an open world game but it is interesting what I always observe with Buffalo Wildings especially that one is",
            "start": 1057.88
        },
        {
            "text": "Week you see things develop and like relationships change and like it's kind of like an open world game but it is interesting what I always observe with Buffalo Wild Wings, especially that one, is that I'm like there are way too many people working here. How can you possibly need this many people? Like how can you possibly need this many? There's like 17 people just behind the counter when I walk in. Yeah, there's like eight people at the merch store, and you're like, why is there a merch store at Buffalo Wild Wings? I went to my dad; this is right over there, and I went in there to buy the garlic sauce because we love the garlic sauce, and they only had one bottle left. Are you kidding me? I was ready to drop like $50 and buy like a case of this stuff, and like we only have one bottle. Do you want it? I'm like, yeah, I guess, and I took it. I couldn't come away empty-handed. All right, that's how you solve the food conundrum. Yeah, we've solved a lot of problems there in that one. No doubt about it.",
            "start": 1091.64
        }
    ]
}