{
    "id": 2497,
    "video_id": "oTzjP95hf-I",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Cars - The GameOverGreggy Show Ep. 172 (Pt. 3)",
    "description": "We talk about our car experiences.\n\nThanks to Dollar Shave Club for sponsoring this episode. Go to http://www.dollarshaveclub.com/greggy\n\nCheck out Wheelie Cool Videos: https://www.youtube.com/channel/UC8oap2DZlaSe_NHVb59lPMQ\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1490166009,
    "duration": 1984,
    "transcript_chunks": [
        {
            "text": "This episode of the Game Over Greggy Show is brought to you by Dollar Shave Club. There's no reason to use a cheap disposable razor or pay a ridiculously high price for gimmicky unnecessary nonsense. Make the smarter choice and join Dollar Shave Club. The key to getting a fantastic high-quality shave at an affordable price. And right now, they're giving away a one month trial of any of their razors for $1 with free shipping. How do you know these are good? Tim Getty's been using them. He's trimming up this whole section. Because you might say, \"Tim Gettys has a beard. What's he doing?\" But I guess if you have the beard, you still have to keep it in check. I wouldn't know because I'm like 13 when it comes to facial hair. There's no long-term commitments, no hidden fees, and you cancel whenever you want. Get your $1 trial at dollarshaveclub.com/gregy. That's dollarshaveclub.com/greggy clean. That's not their catchphrase. I just made it up. [Music] I'd actually like to tell a kind of",
            "start": 0.08
        },
        {
            "text": "you want. Get your $1 trial at dollarshaveclub.com/gregy. That's dollarshaveclub.com/greggy clean. That's not their catchphrase. I just made it up. [Music] I'd actually like to tell a kind of funny story. Oh, okay. If that's okay. Yeah. I'm help cuz it's all also related with Nick. But Nick was telling me about doing the show with this guy named Greg and Tim for years and he was working working at IGN. And Nick and I like we're we're very good friends, but we only see each other like once or twice a year. So every time we do it's like a big download. And Nick's like I was really proud of him. Moved up to San Francisco working at IGN balling. I was doing well with my IT career. So I'm like you know and then he starts telling me about this YouTube stuff he's doing. And I'm a I loved YouTube at the time. I'm a big car guy. So I was like I liked YouTube but I still didn't really understand what he was doing. And I was like oh okay. I supported him but I was like I don't really get it. And",
            "start": 38.56
        },
        {
            "text": "at the time. I'm a big car guy. So I was like I liked YouTube but I still didn't really understand what he was doing. And I was like oh okay. I supported him but I was like I don't really get it. And then, you know, that went on and then he I found out he was going to quit his job and do it. I was like, \"Dude, what is Nick doing?\" I'm like, \"That's terrible. This is kind of crazy, bro.\" Yeah. But no healthcare. Terrible. No. Okay. But, uh, he seemed really happy and you know, Danielle's a smart woman and she supported you. I was like, \"All right, do it, dude. That sounds great.\" So, it wasn't until I watched kind of funny live, the first one, where I realized what the hell you guys have done, and I'd like to pat all of you guys on the back. Thank you, Nick. Yeah, give me a moment. Pound it. Um Colin, yeah, I was going to say air pass to Colin. Um because I couldn't believe and Kev too, bro. Um the support you guys had from your fans. It just blew me away when you guys had people up on",
            "start": 98.24
        },
        {
            "text": "Um Colin, yeah, I was going to say air pass to Colin. Um because I couldn't believe and Kev too, bro. Um the support you guys had from your fans. It just blew me away when you guys had people up on stage and they were talking and like said how much you guys mean to them in their daily lives and like if they're having a rough day, they can put you and it's just like like I got teareyed. I was like, dude, they are freaking killing it. they have like this awesome subscriber fan best friend, you know, base and it's just like I couldn't believe it. So, like from there on and Nick has been telling me, \"Dude, you you like cars. You're always doing cars stuff and spending money on cars. You should like start a YouTube channel.\" I was like, \"Haha.\" And then like would say it multiple times and I would never really click. And then as soon as I saw you guys do that, I'm like, \"Dude, maybe I should do that.\" Like there's like real content. There's real people out there watching. like if I could",
            "start": 138.16
        },
        {
            "text": "would never really click. And then as soon as I saw you guys do that, I'm like, \"Dude, maybe I should do that.\" Like there's like real content. There's real people out there watching. like if I could even touch like half or a quarter of the people that you guys are doing like that would be freaking amazing and such an added benefit to besides doing what you love. So since then I have started my own YouTube channel. I finally took Nick's advice and um it's a carb based car reviews in in Southern California like modified car stuff driving cars. Tell me what it's called. Hold on. Time out. I think this is another easy topic break. Okay, cuz topic number three for this was going to be cars. Okay, so now we're moving into topic number three. Got it. Brought to you by Patreon producer. Salem Gollum. All gone. Gone. All gone. If I say it real fast, it doesn't matter if I scream, you guys. I Thank you for keeping me honest. Salem understands that I'm an idiot and he backs me for some reason.",
            "start": 180.72
        },
        {
            "text": "All gone. Gone. All gone. If I say it real fast, it doesn't matter if I scream, you guys. I Thank you for keeping me honest. Salem understands that I'm an idiot and he backs me for some reason. Stu, you're obsessed with cars. What's that all about? I am obsessed with cars. Uh, since I was a kid, I, you know, asked my mom to buy me car magazines. Always like cars. Always modified my cars. Just been a thing. kind of superficial, but you know, I've always liked it and always stayed with me throughout the years, except for about like a three-year period where I just drove a stock car. No cars. No cars. I was like, I need a break. But now I'm back. Okay. Um I just love them. So Volkswagen Audi is kind of what I grew up and doing. And like there's a big like a VW Beetle. Volkswagen Audi group. Uh I had like Jetto or GTI. Golf. Got the not necessarily a Beetle. Yeah. My dad had a Beetle. It was pretty dope. It was really loud. Never understood why anyone would ever choose that car. Why was",
            "start": 223.92
        },
        {
            "text": "Uh I had like Jetto or GTI. Golf. Got the not necessarily a Beetle. Yeah. My dad had a Beetle. It was pretty dope. It was really loud. Never understood why anyone would ever choose that car. Why was it so loud? Uh, was that the engine in the Yeah, everyone's engine was in the [ __ ] uh trunk and you would turn it on and it goes I'm like this is stupid. It's like a go-kart except it's like ugly and orange. Well, they were they were super easy to like fix apparently. The Beatles just weren't that that that complex of a car. So, a lot of people liked them because it was like if it broke down, you fix them pretty easily or you can do it yourself. Um I we had a couple friends in high schools that had Beatles and it was always and they broke a lot. Yeah, they broke a lot. It was always like but you can fix them easy like they would they would die and then so like does anyone have a paperclip paperclip they would fix it with some gum and [ __ ] and go on. Um I'll never forget though Steu's",
            "start": 263.2
        },
        {
            "text": "you can fix them easy like they would they would die and then so like does anyone have a paperclip paperclip they would fix it with some gum and [ __ ] and go on. Um I'll never forget though Steu's dad had a Jetta and this was remember when I had this horrible ugly sky blue hatchback Honda Civic that had four gears and Stu's dad had this dope ass like deep burgundy Jetta Jetta's cool. It was an 84 Volkswagen Jetta. Not anywhere near as cool as he's making out to see but probably I've never associated Jetta in cool. Like you never see a Jetta in Need for Speed Underground. Like we have a but Jesse drove a Jetta in uh in Fast and Furious. Yeah. Yeah, Jesse did. Fair enough. Touche. Touche. You kind of look like Jesse actually. No. But uh uh but Stu had this car and I was like so jealous because he tinted it out. He put the CAN&N air filter in it. He like lowered it. Did all this stuff. And then if anyone's ever had a Jetta, which is like a pre I don't know how they how good they are",
            "start": 299.68
        },
        {
            "text": "because he tinted it out. He put the CAN&N air filter in it. He like lowered it. Did all this stuff. And then if anyone's ever had a Jetta, which is like a pre I don't know how they how good they are now, but a pre-2000 Jetta. The the cars would just systematically start falling apart on you. And I remember there was one time when Steu and I were driving and I was like, \"Steu, that's a stop sign. Steu, you blew through the stop sign.\" And he goes, \"Bro, I can't stop. If I if I stop the car, it'll stall and we'll have to push it.\" Cruise three. Oh, dude. Right. No, it would not. It wasn't three. This is the thing with cars and stuff, and I want to get to your fancy YouTube channel. fancy cars, but the fact of like what you just said, were Jetta cool? Like I never understood what car was cool. I you know what I mean? I like cars that had personality fine, but I was never the car guy. And so I remember the only car I ever thought was cool was this guy Joe, I think his name was sat next",
            "start": 343.44
        },
        {
            "text": "I you know what I mean? I like cars that had personality fine, but I was never the car guy. And so I remember the only car I ever thought was cool was this guy Joe, I think his name was sat next to me in French class and he had um a Mitsubishi Eclipse that was all black and black on the inside. I'm like that looks like the Batmobile, so that's fine. Sick. It got real ugly after 98, but then but then it came back and I was like, man, but that was the thing is I drove a Ford Taurus forever and I like that that was the beater I got when I turned 16 and I that car was great cuz it was the perfect car for me. And the fact of like it was totally [ __ ] up so nobody really cared what happened to it. Like Po always jokes around about it when he'd come over to get a ride to school. We'd get in there and those Chicago winter mornings we'd get in there and you turn the car on and then if I always forget it now, but you could turn the radio on and then the heat. But if you did the heat and then",
            "start": 381.04
        },
        {
            "text": "and those Chicago winter mornings we'd get in there and you turn the car on and then if I always forget it now, but you could turn the radio on and then the heat. But if you did the heat and then the radio, it would die. You would just kill the [ __ ] I always made jokes that it was Apollo 13 where you're like watching the ampers, the amps to see how many amps you have to give on this thing. It's got to be the right sequence of orders. How long did you keep that car? I had that car from high school until I graduated college like 90. Well, I guess I not right away. So, or 20 200 to 2005 or six, we'll say something like that probably something like that. And what happened is I had this Taurus that I inherited from my parents that by the time I'm getting rid of it in Missouri, the deal was that it ate oil. Like, and my dad is Mr. car, Mr. Outside guy. And he got to the point of just like, I don't there's it's not going anywhere. It's just getting eaten by this car. So, when you fill up",
            "start": 416.96
        },
        {
            "text": "that it ate oil. Like, and my dad is Mr. car, Mr. Outside guy. And he got to the point of just like, I don't there's it's not going anywhere. It's just getting eaten by this car. So, when you fill up for gas, you need to put a quarter oil in every time. And I was like, \"Okay, cool.\" And like you did, and it just disappeared. And so, finally, my mom was getting rid of the the burning it. That's crazy. Yeah. Mom had this 1994 rag top Ford Mustang GT. She loved it. Took such great care of it. Leather interior, tan tan top, like pristine. And she was like finally like, you know, it was only, you know, rear wheel drive. So, it like kicked out all the time in the winter and it was a huge thing. So, she was moving over to some similar looking car but much bigger. A solar I think maybe if that makes sense. Toyota, something like that. Doesn't matter. And so, she was going to do that and she called me was like, \"Do you want to do you want the Mustang?\" like I'll you know I'll sell you the most",
            "start": 456.8
        },
        {
            "text": "sense. Toyota, something like that. Doesn't matter. And so, she was going to do that and she called me was like, \"Do you want to do you want the Mustang?\" like I'll you know I'll sell you the most like for like a dollar or whatever he was. And I remember to when like I was with my ex obviously back then I was just like do I want it? She's like yeah don't be stupid. Like car is way better than your piece of [ __ ] I'm like all right cool. So I got it and there's like you know again it's funny with Ste. We're talking about post so much. My you know high school best friend, childhood best friend. Um he always talks about it being like my he remembers that car and how my mom took care of it and then when I picked him up in it at uh SFO one year when when I had out here he said it was like Ghostbusters 2 when the Ecto1 comes in it's like filth fan cutting kicking out smoke cuz I I would park it and then like tree sap and tar would fall on it and I wouldn't do anything about it. So like the",
            "start": 498.8
        },
        {
            "text": "2 when the Ecto1 comes in it's like filth fan cutting kicking out smoke cuz I I would park it and then like tree sap and tar would fall on it and I wouldn't do anything about it. So like the rag top was ruined and it was so [ __ ] and I had no money cuz I was working at IG and living in San Francisco. I don't to put anything doesn't cost that much to wash the cart. Greg, come on. Well, that's what that's funny that you said cuz my I used to treat my cars like [ __ ] Like I I I always had crap in my cars and it wasn't until Stu got a a newer car. He got a I think it was a 95 or 94 96 Jetta 964 Jetta, right? And it was a [ __ ] cool car, man. Like it was badass. Black on black leather V6. I had the exhaust. It sounded amazing. It sounded disgusting. And it was a V6. The car maybe weighed like, you know, nothing. Yeah. And so I got in this thing for the first time. I'm like, \"This is [ __ ] awesome.\" And I saw how good Stu kept it kept his car. And so when it was time for me to get a new",
            "start": 535.36
        },
        {
            "text": "you know, nothing. Yeah. And so I got in this thing for the first time. I'm like, \"This is [ __ ] awesome.\" And I saw how good Stu kept it kept his car. And so when it was time for me to get a new car. Um, and by that I meant I got I was so embarrassed taking girls out in this car that I had that I just was like, \"Ma, I need like can I borrow $1,000 so I can just get a new car?\" Um, and I have a I had a job now at that point. So I upgraded to a Jetta VR6 also. Same car, but mine was white. Oh, and I did not realize that the white Jetta was Oh, it wasn't that. It was considered a girl car. So I was like, \"Way to get a white Jetta, Nick.\" But that [ __ ] was fast and it had dope tan leather interior and I didn't care. And I kept That's when the meticulous nick started. Oh. Where I was like, I got this thing I'm finally proud of. I'm finally like have a car that I I think it was cool and it was fast as [ __ ] So I took care of that thing. And that and from that point on, I never put any",
            "start": 578.16
        },
        {
            "text": "I got this thing I'm finally proud of. I'm finally like have a car that I I think it was cool and it was fast as [ __ ] So I took care of that thing. And that and from that point on, I never put any anything that goes in my car comes out. That's that's my rule. When I give it goes in, it comes out. That's what's happening. Um nice. But yeah, I remember that down. I've done it before. I left a comic book in the back of there one day and I noticed the next day it was there. I was like, \"Oh, sorry. I forgot that. Yeah, totally forgot. What's annoying to me is like when when I used to drive drive around with Tyroo, God bless Tyroo, but Ty is he doesn't give a [ __ ] about anything. He's kind of absent minded, cough drops, and he would just I would just be like I would go to clean my car out after Ty we had been caring back and forth for a week and there would just be rappers in every possible pocket like the backseat pocket of the car that no one ever uses. You put like your mom has a map",
            "start": 615.52
        },
        {
            "text": "Ty we had been caring back and forth for a week and there would just be rappers in every possible pocket like the backseat pocket of the car that no one ever uses. You put like your mom has a map back there. I would reach in and be like, \"Why the [ __ ] are these so many rappers back here? Beef jerky rappers. There would be [ __ ] tucked up underneath my [ __ ] visor the visor and I pull it down there would be like the top of a beef jerky wrapper. I'm like Tyson. Um he was like whatever man. Uh but yeah it was too it was hilarious cuz I remember when you first got that car remember remember the the Laughlin story we're going out to meet my brother and his then girlfriend in Laughlin Nevada and we are traveling faster than the speed of light. Very fast because Steu's car was so fast and it was so cool and I was like yes drive faster. And we got pulled over by an offduty sheriff's officer who was like, I have been tailing you guys for 10 minutes to catch up with you. You were driving",
            "start": 650.32
        },
        {
            "text": "it was so cool and I was like yes drive faster. And we got pulled over by an offduty sheriff's officer who was like, I have been tailing you guys for 10 minutes to catch up with you. You were driving really fast. Pull over. We pull over and Ste's like, \"Fuck.\" And I'm like, \"I know, man. Just going to get a ticket. Hopefully it isn't that bad.\" Yeah. And the guy walks up there. He's like, \"I can't write you a ticket because I'm a sheriff's officer, not a highway patrol officer, and I don't have my ticket book with me.\" But you see that guy all the way up there? And he pointed to like this little speck about 2 miles in front of us who happened to be a highway patrol officer that had pulled someone over. like, I want you guys to pull up next to that guy. And he ended up being a really nice guy, though, because we were so courty. The guy who pulled us over was really nice. The guy who we went and had who wrote us the ticket was a jerk. He walked up to the car. He's like, \"Oh, no. Front",
            "start": 690.0
        },
        {
            "text": "guy, though, because we were so courty. The guy who pulled us over was really nice. The guy who we went and had who wrote us the ticket was a jerk. He walked up to the car. He's like, \"Oh, no. Front plate. Oh, tin windows. Oh, ticket you for that.\" Lowered. Yeah. All this stuff. You got you got Oh, I felt so bad. So, wait. You just drove over there with the other guy on the shoulder like right Yeah. like up the road like a mile. And then he didn't give us cuz we were going probably double the speed limit on the freeway. It was it was completely the speed limit back then probably 55 and we were at easily 10500. We're not that old, bro. The speed limits was 65. Was it 65? Yeah. Yeah. Yeah. Okay. We weren't texting anybody. Either way, it was going Yes. Either way, we were going at one point. I remember looking at the speedometer. I was like, that says 100. Like this. We were over 100. The only time I've ever been over Well, there there's two times. One time I went over 100 was with with",
            "start": 723.76
        },
        {
            "text": "I remember looking at the speedometer. I was like, that says 100. Like this. We were over 100. The only time I've ever been over Well, there there's two times. One time I went over 100 was with with my friends in college, and this was during like the the WRX STI phase. So they they all had their fancy ass [ __ ] cars that go super fast. So we did like a one of those like drag race style things where we went out and it was just like how fast. No, we weren't racing anybody. It was just like pretending you're racing people. Like let's just go [ __ ] fast. And that was scary as hell. Uh but then the other time was on our our first trip down to LA. We all packed in Alfredo's uh Honda Odyssey. Um and that thing which is a minivan. It is it is the minivan of champions. And that thing was amazing. And somehow Toyota uh uh Sierra Sierra is the bomb.com. That is the bomb. If I'm not even kidding right now, if I could if I had the space for it to park that [ __ ] thing, I would drive that. Is",
            "start": 762.64
        },
        {
            "text": "And somehow Toyota uh uh Sierra Sierra is the bomb.com. That is the bomb. If I'm not even kidding right now, if I could if I had the space for it to park that [ __ ] thing, I would drive that. Is that the sonar one we had when we went to see Kevin Smith? It's the Cadillac of minivans. But we somehow pushed that thing to 110. Yeah. And was it worth it? No. No. That car is unstable at that speed. I don't want to see it. Yeah. No, no, no. But I mean it it felt fun at the time. That was the thing of like the when the speeding for me and like stuff like that like the my speeding stories all involved the tourists you know I mean I had the Mustang and I drove it on I7 in you know Missouri but that's like [ __ ] stay alive you know what I mean driving on it but like I'll never forget in the tourist when I was coming back from Missou to Chicago and it's a six-hour drive. At some point I was on the road and a cop was in front of me and he was speeding so I was like [ __ ] it I'll just pace this",
            "start": 805.6
        },
        {
            "text": "when I was coming back from Missou to Chicago and it's a six-hour drive. At some point I was on the road and a cop was in front of me and he was speeding so I was like [ __ ] it I'll just pace this guy right cuz if he's doing he can't get mad at me. And so forever I drove behind him and he would change lanes and I would change lanes and I was totally just hailing this cop at an excessive speed in the for Taurus and finally he just jerks it to the he like went and then he like faded me out and he slams on his things and then I'm like well I can't be matching his speed. I'll just I'll keep fall and I kept slowing like it was just me and him on like I55 I think in Illinois and I kept slowing down. We're doing eventually 20 on the highway with him a little bit in front of me and then and finally he stopped enough to get there and I turned and looked at him and he was screaming through the glass at me just like [ __ ] pointing and screaming like I got the message clear and he just [ __ ]",
            "start": 843.04
        },
        {
            "text": "he stopped enough to get there and I turned and looked at him and he was screaming through the glass at me just like [ __ ] pointing and screaming like I got the message clear and he just [ __ ] floored it and took off and was just gone. Why did you think that was You didn't even get pulled over. No, didn't even get pulled over for that. Yeah, that's a terrible idea. [ __ ] Yeah. What are you going to do? I think I got one. Yeah, I got another speeding ticket going down to Missou and it was totally the best thing because it was that I was I was 20 at the time and so I couldn't go out to the bars or anything when other the older antlers would go and in Illinois at the time I don't know what it is now. I got the speeding ticket and that meant they took your license and they gave you the ticket and this was now proof of your ticket. And so I got the ticket and I looked at it. I was like, \"Huh?\" And got back to Missou, busted out my checkbook with the carbon paper and made their their uh",
            "start": 884.16
        },
        {
            "text": "and this was now proof of your ticket. And so I got the ticket and I looked at it. I was like, \"Huh?\" And got back to Missou, busted out my checkbook with the carbon paper and made their their uh their three on 83 and 82. And then I just went around to bars and I'm like, \"Oh, that sucks, man.\" And they took my license. Here's my thing. And they're like, \"Man, Illinois is dumb. There you go. Have a good time at the bar.\" I'm like, \"Thanks.\" You are a crazy son of a [ __ ] I would never think to do that. My paranoid brain would be like, \"They're going to catch you.\" And they're like, \"They're going to arrest you for fraud.\" Yeah. Like you roll when you're dumb and young. Exactly. You don't You don't understand what you're playing with. Things happen. So So Stu, have you gotten all the cars that you want? Like your dream car, did that ever come to fruition? Yeah, I bought my dream car like three times now. It keeps changing though. You know what I mean? It's a problem. So, so tell me,",
            "start": 917.68
        },
        {
            "text": "that you want? Like your dream car, did that ever come to fruition? Yeah, I bought my dream car like three times now. It keeps changing though. You know what I mean? It's a problem. So, so tell me, you have this YouTube channel. The name's Your name is Wheelie Cool Videos. It's Wheelie Cool Videos. I took the word really. Oh, wheelie with my logo is sunglasses. I'm sorry. A wheel with the sunglasses on it. Yeah. Animated by Nick Scarpino. Thank you very much. You're welcome for that. Thank you very much for that. Um, so so you do you keep how many cars do you own or is that you keep trading the cars? No. Yeah. Well, I currently own three. Um, okay. I had just had a fourth that we sold, our Volkswagen Euro van camper. You know, the cool one with the pop top and all that stuff. We just sold that. Um, we just bought a house. So, we're like, lick, my wife's making me sell every car. That's not a necessity. Gotcha. But, um, no. So, I bought, as far as my dream car question, I bought a",
            "start": 953.6
        },
        {
            "text": "sold that. Um, we just bought a house. So, we're like, lick, my wife's making me sell every car. That's not a necessity. Gotcha. But, um, no. So, I bought, as far as my dream car question, I bought a Volkswagen R32 in 2008. Swear to God, you just move it around. Okay. Hi. Check. I got a 2008 R32 that I thought was my dream car, but it wasn't. And then I bought a TTRS Audi in 2012, which was very dream car. See, let's take a second and talk about this. Amazing $70,000 Audi that cost me like $1,000 a month. Stu buys this car and I was like, how [ __ ] like if you know anything about Audi's, like the the RS models of the Audi, like the top 3 horsepower, manual transmission, all-wheel drive. It's like a Subaru STI, but like luxury and lighter, tiny, super fast. And I'm like, how fast could it possibly be? It takes me for a ride in this [ __ ] thing. It's It does. What was the 0 to 60? 60 under four seconds. Under four seconds. Yeah. Yeah. You can launch this thing and just It's so [ __ ]",
            "start": 994.4
        },
        {
            "text": "possibly be? It takes me for a ride in this [ __ ] thing. It's It does. What was the 0 to 60? 60 under four seconds. Under four seconds. Yeah. Yeah. You can launch this thing and just It's so [ __ ] fast that it sucks you into the back of the seat and you're actually you get scared very quickly. And I remember we were up in uh we were up north driving around the whining roads in Northern California and I was like I was white knuckling it the entire time. I'm like, \"Ste, you've got to slow down. Like this thing is so [ __ ] fast.\" It is basically all engine with four wheels and like a seat. It's pretty much all it is. But it was so cool. It's a lot of fun. I drove it on the track um on the racetrack where you can do like track days which is awesome because you can like drive 140 150 mph and not worry about speeding tickets and stuff. Um but then I realized, you know, that's a lot of money and uh if I had that extra money, we could be like buy another house or something like more um",
            "start": 1044.56
        },
        {
            "text": "and not worry about speeding tickets and stuff. Um but then I realized, you know, that's a lot of money and uh if I had that extra money, we could be like buy another house or something like more um mature and fiscally responsible. So adult, but actually that's not why the reason I sold it. I found another car which was a 94 Volkswagen Curado. Do you know what that is? It's purple little hatchback. It's like a Sorraco in between a Sorco and a GTI. Gotcha. They only made them for four years. It's purple though. Purple sounds awesome. Dope. Yeah. Yeah, it's dope. Uh with a VR6 engine. Sounds good. Um so I I sold my TTRS and I bought that car. How fast is that compared to the TTRS? Oh, it's like half as fast. It's more cool cruisy than like super fast. But I learned with my fast TTRS that really having a fast car is fun and all, but how often you using it? Yeah. How often do you go from zero? It's so fast that you're going to going to go to jail or get a really big speeding ticket",
            "start": 1084.0
        },
        {
            "text": "really having a fast car is fun and all, but how often you using it? Yeah. How often do you go from zero? It's so fast that you're going to going to go to jail or get a really big speeding ticket eventually. It's just it's just too fast. And to drive it on the track, it was like almost too nice of a car to drive on the track cuz you feel like you're beating it up. Um or rock chips. So, you know, rock chips. I don't know about the rock chips. Are you getting the rock chips with your Toyota? Yeah, man. I got my dream car. Let me ask you this question. All you want it was obnoxious. The last time you washed the Prius. I I actually wash it fairly. Do you? Yeah. It's just the problem is everywhere that I've ever lived in the last like [ __ ] ever since I've had a car. Uh it has the problem of the sap and freaking Tell me you got the bright orange color. No, I got I got the obnoxious blue. It is. Yeah, I'm a big fan. If you go to the window and look out, you'll see it right away. Is it",
            "start": 1127.44
        },
        {
            "text": "of the sap and freaking Tell me you got the bright orange color. No, I got I got the obnoxious blue. It is. Yeah, I'm a big fan. If you go to the window and look out, you'll see it right away. Is it douchebag blue? Oh, it is. [ __ ] yeah. It's douchebag blue. It is like as douchebag blue as That's how I live my life, though. like a quarter mile. No, it's that blue. It's that blue color but with metallic [ __ ] in it. Nice. Yeah. No, it's it's you're sporting douchebag blue. What's Oh, I had sky blue. That was like your shirt. Oh, yeah. That's definitely douchebag blue. Um I only had I had a shitty 92 Camry and then a shitty 94 Corolla. And then eventually once I started all this, I was like, I I want to get a real car that doesn't break on me every two seconds. And I'm like, I'm going for the Prius C. And the only car I've wanted since a Prius C has been Bernie's Tesla. That thing's a [ __ ] that's just not it. Like that is a Batmobile. And you get in there and I'm like I feel like",
            "start": 1166.8
        },
        {
            "text": "the Prius C. And the only car I've wanted since a Prius C has been Bernie's Tesla. That thing's a [ __ ] that's just not it. Like that is a Batmobile. And you get in there and I'm like I feel like this is a good value. It's just a little too expensive. But one day they won't be expensive. Our Uber picked us up for when we were going to Puerto Rico in a Model X. Brand new Model X. Yeah. I'm like, dude, you are just going to thrash this thing. Yeah. Do you see yourself ever getting a Tesla? Uh, no. No. Maybe like as a fourth car or something like that. I'm in California where we can have as many cars as we want. Not like here in San Francisco where every car is going to cost you a million dollars a year just to park it. So then tell tell us about your channel. What are you doing on the channel? I specialize in like modified car reviews. I find all the coolest cars in Southern California, which there's a lot. There's a huge car scene down there. And I hit them up normally. Just slide",
            "start": 1206.16
        },
        {
            "text": "I specialize in like modified car reviews. I find all the coolest cars in Southern California, which there's a lot. There's a huge car scene down there. And I hit them up normally. Just slide into their DMs and uh arrange a car shoot. So it's like post pit my ride. Like you find the guys that went on the exhibit show and you're like, I want to look at your car. It's done. Yeah. More like your Let me see that PlayStation in the back. Yeah. Comes up. The screen comes up. Yeah. But they're really all like really nice. Some Ferraris, Porsches, nice like driver's cars that have been like tastefully modded. Sometimes very heavily modded. Um and I get really good audio and video of the cars, nice rolling shots. Um, I try and get really high quality audio and video content of the cars because there's a lot of YouTube car reviews. A lot of car content on YouTube, but very few little of it is high quality. Even like Jay Leno's Garage, which I like that show, but like they're filming in LA when",
            "start": 1245.36
        },
        {
            "text": "a lot of YouTube car reviews. A lot of car content on YouTube, but very few little of it is high quality. Even like Jay Leno's Garage, which I like that show, but like they're filming in LA when they go take the car out and do rollers. There's like tons of other cars in the background. It's like dirty shots. It's just not a clean, nice, pretty shot. You want to focus on the car. I don't want to see the reflection of the camera car in the car I'm shooting. You know, I'm trying to do it um high production value. And you're not a video guy. Like you just grew up around these guys, right? I'm an IT guy and I just uh you know, a little over a year ago decided I'm going to take my passion and start filming some of the stuff that I'm already doing. Um and the most impressive thing to me is that so you do really cool vids. Nick tells me about it. I met you at his bachelor party like years ago and and then he's just like, \"Yeah, so we're we're doing this thing where he's he's going to do the",
            "start": 1289.6
        },
        {
            "text": "so you do really cool vids. Nick tells me about it. I met you at his bachelor party like years ago and and then he's just like, \"Yeah, so we're we're doing this thing where he's he's going to do the really cool vids.\" I'm like, \"I'm sold on the name.\" And I was like, \"Okay, cool. Best of luck.\" But this is during the time when Nick's telling literally everyone he knows, \"You should make a YouTube channel. You should do this.\" cuz he was just converted and uh and then so then I'm like all right cool like good. You and Matt are two examples where I'm like we'll see how long this lasts. Midlife Ballers episode 50 something and you're like huh holy [ __ ] you're doing you look use that show and you're like man Midnight Midlife Ballers shout out to you. You how many subscribers you got? Uh like 8,500. Oh nice. Coming up on 10,000. What's your what are your views average for for your episodes? Uh it depends on the car cuz it's all depends on how interesting. So people, if I'm a if I'm a",
            "start": 1325.52
        },
        {
            "text": "like 8,500. Oh nice. Coming up on 10,000. What's your what are your views average for for your episodes? Uh it depends on the car cuz it's all depends on how interesting. So people, if I'm a if I'm a Porsche guy or something like that, I'm coming to see Porsche. I'm not chicken. So you're getting some good numbers on this. But yeah, I just like I'm at 1.1 million total views for the channel um in about a year, which is great. Well, we started off my show more like this podcast trying to emulate you guys. Um but sounds like another show people don't really found care who you are and what you have to say until they know who you are. So um I just went with my original focus, which is find cool cars, film them. Uh, I have my buddy Steven Hicks who's a excellent photographer. He comes out with me on the shoots and takes high quality pictures of the car which is awesome because then the owner of the car gets like this takeaway. They can print the images and hang them in their garage or",
            "start": 1361.2
        },
        {
            "text": "with me on the shoots and takes high quality pictures of the car which is awesome because then the owner of the car gets like this takeaway. They can print the images and hang them in their garage or whatever. Um, and just make awesome videos. There's really cool there's really cool guys in, you know, all these guys are really really nice and humble. They build all these cars and a lot of times they don't get exposure. Maybe they'll get posted in a magazine, maybe not. Um, so my channel gives them opportunity to come on tell us about the car. I get to drive it for an hour, but like I like to have them in the passenger seat so I can interview them and ask them, you know, like about the build and what it's like to own and drive every day. And was it hard? Is that the video then? Like you have like a GoPro or something in there and like I have three GoPros and normally I change them up. So there's like four to six different camera angles, plus we do external rolling shots of the car with",
            "start": 1402.56
        },
        {
            "text": "like a GoPro or something in there and like I have three GoPros and normally I change them up. So there's like four to six different camera angles, plus we do external rolling shots of the car with like my DSLR and a gimbal. So it's like high quality um nice lenses and stuff. And then I also cut in pictures that my buddy Steven Hicks takes of the cars to keep it, you know, fluid. So you're not like staring at just me talking in the car, which, you know, is boring. You want to see the car. That's why you're watching the video. And that's what I want to show you. And not just clips like 1 second, 1 second like teasers. I want to show you like if you were to see the car on the road, like breaking your neck, looking at the car. That's what the shots got. Got So when you first started, was it hard to get people to do it? Like was there like you want to come drive my car for an hour? I have a lot of car friends. In fact, that's what I call my subscribers and my audience. Again, you're just",
            "start": 1437.68
        },
        {
            "text": "hard to get people to do it? Like was there like you want to come drive my car for an hour? I have a lot of car friends. In fact, that's what I call my subscribers and my audience. Again, you're just ripping everything in homage to you guys. I I I was touched, you know. So, um my car friends, my viewers, which is a real term, you know, that's what I say to my my wife, you know, I have this car friend out. So, but yeah, I I hit my car friends up initially to start out and then um because I'm in the scene and I have a lot of buddies that have cool cars um after that then it would made it easier cuz I was looked established and like I wasn't just some random guy. Gotcha. People pretty much say yes. I haven't had too much push back and there's such awesome cars in Southern California. Um like the owner of Momo Steering wheels. Yeah, I'm reviewing his BMW M3 on this Sunday. How'd you hook up with them? Hit him up on his DM. Really? And there people are just so humble and nice. These guys",
            "start": 1474.88
        },
        {
            "text": "the owner of Momo Steering wheels. Yeah, I'm reviewing his BMW M3 on this Sunday. How'd you hook up with them? Hit him up on his DM. Really? And there people are just so humble and nice. These guys all follow you back. Uh I don't know. Yeah. To follow me back. I'm not sure. That's crazy. But they let me drive their cars and uh that's all you care. Me out when I do it. Yeah. So it's Have you driven an Ecto1 yet? Are you gonna do an ECOT one episode? Do an ecto one episode. Can you hook me up? Where do you have one? No, I don't. That was Yeah. No, that's one day. One day that'll be thing. Well, come on. Where am I gonna park? If you do buy one, can you uh Yeah, you can drive that. Yeah. Yeah. Yeah. So, we we should Can we lock down the Prius Cat? We should lock down the Prius. I would love to do that. That would be the best thing in the world. I got a super sweet subwoofer in the back. Oh, you got a woofer? Yeah. Oh, so it's modified it? Yeah, it hasn't been modified. Yeah, that's all",
            "start": 1515.04
        },
        {
            "text": "to do that. That would be the best thing in the world. I got a super sweet subwoofer in the back. Oh, you got a woofer? Yeah. Oh, so it's modified it? Yeah, it hasn't been modified. Yeah, that's all we need. So loud cuz the channels I've do many stock cars. They're all like modified cars. Sure. Um, that's I modified my uh my rearview mirror. I got one of them those aftermarket like longer ones with the widecreen the HD mirror. Yeah. Yeah. Nick, how have you tricked out your car? Oh, uh, I haven't. Oh, yeah. What kind of car are you driving? I drive a uh 2005 Honda Accord. Have you even been tinted the windows? Oh, God. You've been living with that car for like 12 years. No tint. I don't understand. Like, here's the thing. You don't understand tint? You understand heat? I understand all of that. But I live also a I live in San Francisco where this is as hot as it gets for one day. Uh and b I am a weird traditionalist when it comes to like modifying things. If I buy something, I like to",
            "start": 1554.08
        },
        {
            "text": "that. But I live also a I live in San Francisco where this is as hot as it gets for one day. Uh and b I am a weird traditionalist when it comes to like modifying things. If I buy something, I like to keep it in that exact shape. I don't want to like like I can't understand like why people would take those amazing like you for instance your your your Audi TTRS had awesome rims that came with it. You were like these aren't awesome enough. I'm gonna get even awesome rims with bigger tires. Sell those and get another one then sell those. Exactly. So I feel like there's a part of my brain is it's it's twofold, right? One, I like the like when I bought the thing, I'm like, I want to keep it in the exact shape that I I got it in, right? No reason to change it. And two, I feel like once I would once I do that, once I start down that road, there's no going back because I'm never happy once I start it. You know, you just got to call it like you see. I mean, for me, I was like, \"All right,",
            "start": 1592.8
        },
        {
            "text": "once I do that, once I start down that road, there's no going back because I'm never happy once I start it. You know, you just got to call it like you see. I mean, for me, I was like, \"All right, there's three modifications that need to happen in my car. One, I need the the the subwoofer and we're good. Two, I need my my nice HD mirror. And three, I accidentally spilled a vanilla latte all over my left door once and that'll never go away. So that's that's I cleaned the door, but it's in the speaker coil of one of the things so that it's like it got embedded into the thing. I went in with a toothpick one time. It's just it's you can take that. It'll never go away. I'll fix it one day. But like I you know, that's how I mod it. You won't though. I won't. Again, we're San Francisco. Why? I'm not going to tint. You have sunglasses. Do you have sunglasses? No. I'm not an [ __ ] when it comes to all that stuff. I like the music. Like I I'm not doing this to roll around and cruise and [ __ ]",
            "start": 1628.56
        },
        {
            "text": "not going to tint. You have sunglasses. Do you have sunglasses? No. I'm not an [ __ ] when it comes to all that stuff. I like the music. Like I I'm not doing this to roll around and cruise and [ __ ] be an [ __ ] in my car. I'm doing it cuz I like how it sounds. So it's like I'm not going to mod my [ __ ] so my Prius C looks cool. No, you should worry about cataracts. You're fair skinned. I mean True Sunburn. It's a [ __ ] thing. You're getting old, buddy. Yeah. I don't know what cataracts are. The thing about the thing about modifying the cars though for me was like I've never had a car that I even give a [ __ ] about modifying. So you had like when you have a $70,000 sport vehicle Yeah. It's fun to do that with, but like slamming out my Honda Accord, that's a plenty of people that do, bro. Yeah, but it's like an automatic and like why? Just why? I never saw I never saw the point it. So, Nick, where do you you've had your car a long time. What's What's your plan for? You just going",
            "start": 1671.6
        },
        {
            "text": "bro. Yeah, but it's like an automatic and like why? Just why? I never saw I never saw the point it. So, Nick, where do you you've had your car a long time. What's What's your plan for? You just going to run in the ground? Do you have a car you want one day? Yeah, I mean, I'd love to get a new car one day. It's just the the problem with having a new car in this city is that it's very it's cost prohibitive, but it's also, you know, in Southern California, your car might get dinged when you go to like park it at a shopping mall or something like that. But overall, you're going to park it in a big space and that's pretty much it. Like, no one's bumpers are [ __ ] up in Orange County. I could not handle having any of my cars here. I drove my Volvo up to San Francisco just cuz I didn't want to um expose any of my other vehicles to the harshness that is San Francisco parking. Yeah. I mean, people can't parallel park. They They park by feeling of your bumper. Basically, when we came up for",
            "start": 1708.32
        },
        {
            "text": "um expose any of my other vehicles to the harshness that is San Francisco parking. Yeah. I mean, people can't parallel park. They They park by feeling of your bumper. Basically, when we came up for your wedding, we were I was parked right outside like the street and I was like constantly checking on my car and there was people just like parked. They're touching. This is parked car. Yeah. with the bumper guards and all that. It's insanity. They don't care. They They actually used the bumper on the car as for what it's for. So, my car has I think 80,000 miles on it. It is almost 11 years old at this point and it's still going. I just spent a lot of money to fix it because it unfortunately had a big engine problem. Um, and the guy was like, \"Are you sure you want to do this?\" I'm like, \"I just look, A, I don't want a car payment right now cuz there's nothing better than having a car that works and you don't have to worry about a $500 payment a month. And B, insurance is nothing on it.",
            "start": 1744.56
        },
        {
            "text": "just look, A, I don't want a car payment right now cuz there's nothing better than having a car that works and you don't have to worry about a $500 payment a month. And B, insurance is nothing on it. And it's it's already like ex internally it's great. ex the exterior is just it looks like the [ __ ] Wolverine attacked it. It's terrible. Um and I just look like that. It would be heartbreaking for me to go through like buy a brand new Audi or something like that and then just see like the bumper systematically over a span of a year just get [ __ ] up. It would be terrible. That makes sense. I'm also just not a car guy so who cares. And you're you're with your previous I I am in love. What do you drive with a car? No. Zero bike out there. Yeah. Nice. Yeah. I uh when I those quads Yeah. And trust me, today was a great example of how bad the weather's been cuz like like leading I bought the bike uh like September of last year or whatever and rode for a bunch and then like the holidays",
            "start": 1777.12
        },
        {
            "text": "trust me, today was a great example of how bad the weather's been cuz like like leading I bought the bike uh like September of last year or whatever and rode for a bunch and then like the holidays came so we weren't you know I'm going here this is happening by then the weather gets bad and so like I think I rode like three times in February cuz it was so bad and we were on the road so much and then today getting out I was like it was like the hardest ride of my life trying to be able to do it. But no, uh, yeah, when I moved here, I moved here with the Mustang and then eventually was like sold this. But when I moved downtown and Ain was moving downtown, I was like, \"Well, I can walk to work.\" Do you use like Zip Car or any of those like I use Zip? Yeah, I'll do Zip. Yeah. For going somewhere, I Uber all the time. Stuff like that. And then, you know, if I need to, if I'm feeling like it, I'll MUN, but for sure like when I moved out when we moved out into the sunset and I was still down",
            "start": 1814.8
        },
        {
            "text": "I Uber all the time. Stuff like that. And then, you know, if I need to, if I'm feeling like it, I'll MUN, but for sure like when I moved out when we moved out into the sunset and I was still down there and I rode the MUN every day when we started. Kind of funny. That was the thing of like never again, you know what I mean? cuz we were working from home and then when we came here the bike offsets it enough but yeah no I I love my Prius C but there was a time like when I didn't when I wasn't able to get a car and it was just like whatever car was literally given to me for free. Uh I was just like all right what cars do I want? All my friends had cool cars and my friends were really into into that whole that scene. Um so they they all had like RSXs and the the STI and all that stuff and they they modified it and did all that. I knew I didn't want any of that, but I was like, I would give anything for a a 98 to 2003 Mustang cuz that's just [ __ ] dope. A 98 Eclipse or a 2001 Celica was my",
            "start": 1850.24
        },
        {
            "text": "they modified it and did all that. I knew I didn't want any of that, but I was like, I would give anything for a a 98 to 2003 Mustang cuz that's just [ __ ] dope. A 98 Eclipse or a 2001 Celica was my like cuz there is no blue more obnoxious than my Prius C blue than the 2001 Celica blue. The word Celica is just obnoxious. Oh, I love the Celica. It looks like the Pokemon Scyther if it was a car. And it's just the [ __ ] best thing ever. It's like that thing. Oh, it's so dope. So [ __ ] dope. I feel like the Prius C is like the less cool version. Like if you took uh the 2001 Celica and just kind of like squished it together. That's what a Prius C is. I've never heard it described that way. Probably never will get there. No, it is. If you look at them visually, like you can there was like definitely a through line of Toyota being like, \"All right, we're going to have some things and like gag.\" It's like it's it's there. Let me believe. Give me this, guys. Let him have it. Fair enough. Do",
            "start": 1888.64
        },
        {
            "text": "a through line of Toyota being like, \"All right, we're going to have some things and like gag.\" It's like it's it's there. Let me believe. Give me this, guys. Let him have it. Fair enough. Do you have a parking space? Like could you have a car if they wanted? No. I mean, it would be street parking now. I live in the house with Colin and before that have a car. No. No. Colin doesn't have a license. Uh before that a guy named Scott Brammley lived there and Brmley had a truck and he parked the truck he had agreement with the landlord to park it in the driveway and he did and then just never moved it for months. So when Brmley left a landlord was like and also no more parking in the driveway for anyone. Yeah. Yeah. Hey, thanks for watching. You can subscribe to the channel here. You can support us on Patreon there. You can go over to kind of funny games, support us there because we put up a whole bunch of other shows and things that distract you. And then you can click on that mystery",
            "start": 1934.24
        },
        {
            "text": "us on Patreon there. You can go over to kind of funny games, support us there because we put up a whole bunch of other shows and things that distract you. And then you can click on that mystery box. Kevin, what's the mystery box? The playlist. It's got a whole bunch of playlist of things we've done",
            "start": 1972.32
        }
    ]
}