{
    "id": 209,
    "video_id": "-25Qn1_MtPM",
    "show_name": "Oreo Oration",
    "hosts": [
        "Greg Miller"
    ],
    "title": "Cookie Dough Oreo Cookie Review - Oreo Oration",
    "description": "Can putting cookie dough in an Oreo cookie make it better?\n\nSUBSCRIBE / LIKE / SHARE / BUY A SHIRT: http://www.districtlines.com/gameovergreggy\n\nWhile you were living your life, Nabisco went crazy and made an army of Oreo cookies. Every Wednesday and Friday, Greg Miller tears open a new package and reviews a new version of Milk's Favorite Cookie. \n\nSubscribe so you don't miss a review: http://www.youtube.com/user/gameovergreggy?sub_confirmation=1\n\nLet us know what Oreo we should review next in the comments.\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy\n\nLike Greg on Facebook: http://facebook.com/gameovergreggy\n\nCheck out the Oreo Oration FAQ: http://www.youtube.com/watch?v=aO6zw2LeJ3c&list=PLOlEpGVXWUVseSo6bQHB1ad2cN_qV3aXs&index=1\n\nOur theme is \"Game-A-Tron\" off of Daemon Hatfield's album Colorbeam. Buy it on iTunes: https://itunes.apple.com/us/album/colorbeam/id426986325\n\nThanks to Nick and Tim for filming.\n\nMega-Thanks to Matt Gravish for making the Oreo Oration logo and intro.",
    "published_at": 1390721490,
    "duration": 420,
    "transcript_chunks": [
        {
            "text": "What's up everybody Welcome to Oreo Oration I'm Greg Miller and while you were watching Miley Cyrus dance all over the freaking Grammys, the fine folks at Nabisco were making endless variations to Milk's Favorite Cookie. So every Wednesday and Friday I tear open a new package and give you a tasty review without any calories. If you like that, like the video, share it with your friends, and subscribe to us here on YouTube today. We're reviewing cookie dough Oreos - yes, ladies and gentlemen, they are limited edition. Yes, I have heard your millions of tweets; your cries have been heard. It is time to finally see what these up... of course a beautiful package, and let's not lie, this is the most mind-blowing announcement you could imagine right now. An Oreo cookie with cookie dough in between - this is how you know we're in the end times; it's never going to get better than this, but also I like that they put here made with chocolatey chips. Oreo is always very good about not putting",
            "start": 0.59
        },
        {
            "text": "between this is how you know we're in the end times it's never going to get better than this but also I like that they put here made with chocolatey chips Oreo is always very good about not putting themselves in a corner right they always say flavored cream they spell cream different it's not real cream and then chocolatey chips is that a chocolate chip who knows we'll find out all right so every Oreo begins with the patented first look I mean I want to love these let's not lie get out of here cup but you notice already we have a few busted not bad but then this big old missing space here the smash cookie up there what happened there why you doing this but let me tell you the bouquet it's got me I'm pretty excited about these cookies like I've been saying all right so first look it's good you know I mean as far as what we've seen here on the Oreo Oration we've been doing this show a long time I'm saying it's one of the better looking first looks but let's get into of course taste",
            "start": 47.32
        },
        {
            "text": "you know, I mean as far as what we've seen here on the Oration we've been doing this show a long time, I'm saying it's one of the better-looking first looks, but let's get into, of course, taste that's what it all comes down to, that's the one we've been waiting for, it's going to require some research, I mean the first thing that hits me right is just that it's sweet, it's very sweet, I'm not, it's not, it doesn't taste like cookie though let's not lie, it's you know, everyone knows cookies are great, sure, but Cookie Dough Oreo knows where it's at, you know your mom puts raw eggs in it, she's like \"it will kill you\" and you're like \"I don't care I will eat this by the handful\" and that's how you lose your little sister, but this one I want to let it breathe, it's really sweet, I'm I'm losing the cookie-ness of it, I real it's not speaking to me saying Cookie Dough cuz obviously again we want it to be the two parts of the Oreo and your mom's cookie dough in the middle she's a sweet one I can I definitely",
            "start": 95.04
        },
        {
            "text": "of it I really it's not speaking to me saying cookie dough cuz obviously again we want it to be the two parts of the Oreo and your mom's cookie dough in the middle she's a sweet one I can I definitely taste the chocolate chips whatever the hell that means but it doesn't taste like cookie dunk I'm going do I'm going back in for more I'm crazy tonight I like it I would eat this cookie in a recreational fashion not just in my profession but again not very cookie doughy now I'm just getting some of the cream yeah I like it but I don't know let's see how it pairs with milk of course is a big part of cookie dough Oreo's test is how's it going to fair with a little bit of milk get the nice zoom going here all right we're doing the melty moment one two three it pairs well it pairs well like a fine steak with a glass of wine if I ate steak and wine a lot I'm getting more hints there's there's a definitely a new flavor texture smell coming out of this cookie now again I don't think it tastes like",
            "start": 160.48
        },
        {
            "text": "with a glass of wine if I ate steak and wine a lot I'm getting more hints there's there's a definitely a a new flavor texture smell coming out of this cookie now again I don't think it tastes like cookie dough but the milk brings out a texture in it that was missing before I'm again go back again I like these cookies I like these cookies a lot they're really good period end of statement all right like I don't I can't give you the full rundown of it tasting like cookie though which we're all expecting I got to get over that I guess we're going to twist test 1 two 3 perfect twist no remnants let's see of course we do best two out of three here on the Oreo Oration boom another perfect one um let's see if I can taste the cream a bit more like that you go like that say yeah you fat little man what do you think of that I like it I I want to suggest double stuff in these guys even single stuffed that's how God intended them that's why the god in Misko made him that way but again there it is",
            "start": 244.08
        },
        {
            "text": "do you think of that I like it I I want to suggest double stuff in these guys even single stuffed that's how God intended them that's why the god in Misko made him that way but again there it is on the back of the tongue it's almost like a Starbucks cappuccino kind of flavor right that's not cookie dough but that's that kind of chocolatey taste you're getting not cookie dough but something you get out of a coffee flavor or a chocolate flavored coffee drink good job Greg it's a good analogy sure this guy agrees with me too so final score for the cookie dough Oreo too sweet as a double stuffed great twists great tast taste as a single stuff I want to dock it for the double stuff but I'm not going to 9.0 an amazing cookie totally down with this limited edition go out to your store and get it I know it's brand new a lot of people don't have it just yet it is coming to everywhere as a limited time offer I like them quite a bit so that's the way the cookie crumbles for cookie dough Oreos",
            "start": 305.4
        },
        {
            "text": "it I know it's brand new a lot of people don't have it just yet it is coming to everywhere as a limited time offer I like them quite a bit so that's the way the cookie crumbles for Cookie Dough Oreos but what do you think when you get them in your neck of the woods let me know in the comments if you agree with my review then make sure you keep coming back to this channel every Wednesday and Friday most of the time we post a new review of an Oreo cookie for you you get to see if they're good or bad then you go spend your money everyone's happy you don't even get fat eating bad cookies only I do cuz that's life I chose for some reason God oh ladies and gentlemen like I said every Wednesday and Friday new Oreo review until then like the video share it with your friends subscribe to us on YouTube then go eat some cookies and keep on dunking",
            "start": 370.48
        }
    ]
}