{
    "id": 2527,
    "video_id": "-LIVLf7ZCDc",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Gaming As A Grown Up - Kinda Funny Gamescast Ep. 114 (Pt. 1)",
    "description": "We talk about what it's like to be a grown up gamer.\n\nThanks to Blue Apron for sponsoring this episode. Go to BlueApron.com/gamecast\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1491222600,
    "duration": 2214,
    "transcript_chunks": [
        {
            "text": "this episode of Kinda Funny Gamescast is brought to you by Blue Apron. Blue Apron is the number one fresh ingredient recipe delivery service in the country, the mission is to make incredible cooking accessible to everyone. Not all ingredients are created equal; fresh high quality ingredients make a real difference so it's important to know where your food comes from. For less than $10 per person per meal, Blue Apron delivers seasonal recipes along with pre-portioned ingredients to make delicious home-cooked meals. Greg Miller, you might know the guy from his world-renowned Instagram series Cooking With Gregy; he's all about this Blue Apron goodness. Check out this week's menu and get your first three meals free with free shipping by going to blueapron.com Gamecast. You will love how good it feels and tastes to create incredible home-cooked meals with Blue Apron. So don't wait, that's blueapron.com Gamecast. No s in there; Blue Apron is a better way to cook. What's up guys welcome wel to the first",
            "start": 0.08
        },
        {
            "text": "We talk about what it's like to be a grown up gamer.\n\nThanks to Blue Apron for sponsoring this episode. Go to BlueApron.com/gamecast\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\n\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nWelcome to the first ever episode 114 of the Kinda Funny Gamescast. As always, I'm Tim Gettys joined by one half of the coolest dudes in video games, Greg Miller. It's me. I put stuff in my hair 'cause I already had the stuff in my hair, but I've noticed recently in the morning shows I'm just getting too lazy about it. I'm just coming in; the hair is doing whatever it's too fluffy. I need to cut it, but I need to let it go a little bit longer. What's in it? What are you using right now? I'm using Garnier Fructis. Think of that when you hear \"old\" Garnier frizz. Yeah, the Diamonds and Guns album - a little frutis made its way into the ear canal. \"Diamonds and Guns\" by uh, The Transplants. Is this really the song? 'Cause I'm going to download this song about that album because of the G.A.N.G.",
            "start": 36.96
        },
        {
            "text": "a little fruit made it way into the ear canal Diamonds and Guns by uh The Transplants is this really the song cuz I I'm going to download this song about that album because of the G A no because they had a song featured on Tony Hawk's Underground called California Babylon now here's my next that heard the Gardiner Fruit song in I'm like holy **** here's my next question about shampoo you'll remember he's too young and we'll introduce you in a second doesn't matter till it does it doesn't matter till we get it was Herbal Essence right that was the one where they the girls would act like they're having an orgasm just making sure they would be underneath like a waterfall show like they're always like doing their hair like the airport bathroom or some weird thing and the husband would look in like what's going on **** my wife F it's all it's all good and joining us for the first time Patreon supporter himself Tom Bach hello everybody hello hello hello",
            "start": 91.72
        },
        {
            "text": "look in like what's going on **** my wife F it's just the shampoo okay it's all it's all good and joining us for the first time patreon supporter himself Tom Bach hello everybody hello hello hello Tom Bach thank you so much you of course supported us in patreon level over patreon.com/kindafunnygames to come on the show you've been supporting us a long time that's the thing you've been supporting us for a very long time we've done multiple Google Hangouts with you over the years it's been fantastic yeah in fact I think I was looking back I think it was February of 2015 is was that the original patreon I think that was really close well we yeah yeah January 15 2015 is when we launched Kinda Funny Games yeah yeah followed you guys at IGN of course like like most people did and thought you were insanely crazy to leave at the time and we were still are yep yeah yeah that's true I was at my 10 year uh anniversary in Cabo I'll never forget telling my wife the entire story wait wait wait",
            "start": 132.04
        },
        {
            "text": "We were insanely crazy to leave at the time, and we were still are yep, yeah, yeah, that's true. I was at my 10-year uh anniversary in Cabo. I'll never forget telling my wife the entire story. Wait, wait, wait, you're on your T, your decade, Cabo, you're on your decade anniversary in Cabo, and talking about Kinda Funny right in your pillow talk is hey honey these morons left a great video game job. My lovely wife Anna, yes, no we we were having lunch and we were just talking about you know what's coming in the future, talking about Job stuff, and I I remember telling her the whole story like there's these guys I was kind of watching they went off on their own, I have no idea what they're thinking like is this an actual business they can go do and at the time I think I don't know it was 20 bucks a month or 15 bucks a month on Patreon, and had no idea at the time what it was going to be. Yeah, and I'm I'm assuming she plays games, she was all over this, she wanted to get not so much, no, not her thing.",
            "start": 174.96
        },
        {
            "text": "or 15 bucks a month on Patreon and had no idea at the time what it was going to be, yeah, and I'm I'm assuming she plays games; she was all over this, she wanted to be in on it, not so much, no, not her thing, probably looks at me and like, \"what in the world's a grown man doing playing?\" I make my own money, woman, I'll do what I want, I'll do what I want; I'm gonna buy this huge TV and spend this, so I'm like the guy that has...and this is super embarrassing but I probably have a strategy guide for every single game that I own, like I'm that guy, okay? Wait still like now in 2017, like such nice coffee table books, well some of them, dude; there's some nice ones by the way, there's some really amazing ones, like I just got the Mass Effect: Andromeda it's like a nice hardback one, The Horizon Zero Dawn ones, like there's some really nice ones and not because I want to skip ahead and figure stuff out but I'm super interested in sort of what what are the developers intend to do and I usually don't look at them until the game's done with, yeah.",
            "start": 218.12
        },
        {
            "text": "not because I want to skip ahead and figure stuff out but I'm super interested in sort of what what are the developers intend to do and I usually don't look at them until the game's done with yeah but yeah it's I think my wife's embarrassed to have people what does she think of that collection no she she does not like the collection so I've got a room in the house it's the man cave room right you gotta have the nerd cave you gotta have the nerd cave it's got all the games it's got like its obscene amount of strategy guides I'll have to take a picture of I never had a thing for strategy guides is it crazy so I I will I will send a picture out you put if you can get it I guess in the next like 24 hours I I I I think I'm opening myself up to some huge criticism with it but it's I'm super interested in it like I don't know it's thing like I love I I almost it when I go buy and I'm still sort of a hard copy game guy so like I'll get them on Amazon and get the discount which is fantastic right",
            "start": 256.68
        },
        {
            "text": "in it like I don't know it's thing like I love I I almost it when I go buy and I'm still sort of a hardcore game guy so like I'll get them on Amazon and get the discount which is fantastic right and I always end up getting the like every single strategy guide I get really so then here's my question for you, how do you play games? Then are you do you have a backlog which then means you have a backlog of strategy guides that's like very meta - all you have the game still sealed in the rap and then you have the strategy guides still sealed in the rap. I do because I get them together, I always get them together, like very rarely will get a game and then two months later go \"you know I kind of want to get the strategy guide\" and sure, sure. Like the Zelda ones, and I actually show my wife often times the the strategy guides are insane. Have you ever like open the Zelda strategy guide? I mean it's like an encyclopedia. The Pokémon ones these days are insane too. I mean I remember back in the day like I was",
            "start": 297.88
        },
        {
            "text": "Strategy guides are insane. Have you ever opened the Zelda strategy guide? I mean, it's like an encyclopedia. The Pokémon ones these days are insane too. I mean, I remember back in the day, I was addicted to them. So, I mean, Nintendo Power was like my Bible, and they would have the player's guides and like they treated the player's guides, which was Nintendo strategy guide, they treated them as kind of extensions of the magazine. So, I would buy these strategy guides for games that I didn't even have just because I liked the presentation, I wanted the collection, and all that. And then when I got into the Final Fantasy games, like I remember the Final Fantasy X one from BradyGames was like it's like a Bible, crazy, and I loved them in the Pokémon ones, I was all about sure. And that was the thing is, I think so you're you want them for the insight into the game and what the developers wanted to do. I very rarely do them because I want to get everything right from the internet.",
            "start": 338.36
        },
        {
            "text": "and that was the thing is I think so you're you want them for the insight into the game and what The Legend of Zelda: Ocarina of Time - Master Quest wanted to do I very rarely do them because I want to get everything right, the internet's got it too, so why bother with GameFAQs or YouTube? How to get through this cool stuff right exactly. No, it's more it's more just for the devs to see what the whole thing comes out as at the end. So I don't I don't do it to kind of sneak ways into a game and find quicker ways it's more usually after I always think about the time Mike O'Brien gave me...",
            "start": 375.52
        },
        {
            "text": "time GoldenEye 007 and they had it for like five bucks and I was like no I'm good and he's like you're an idiot you gotta try this gave me his and he gave me the strategy guide because he's like there's just so much to do in this game you'll never find it all you need to go see what's happening I mean I remember when uh Best Buy every once in a while would do like at the end of the year they'd try to get rid of all the strategy guides that nobody bought and so they would have sales with like a penny each I remember just buying a whole bunch of them for games I was like I might get this one day and I just want to have it there's they're always cool as art books too and some of them are really nice like a lot of them will do some kind of artwork in the back or whatever I mean the Skyrim one that thing is like it is it's amazing that there's that much content in a game that you could write a book I mean that that's like a whole separate development just to do the book oh it totally is right",
            "start": 412.76
        },
        {
            "text": "thing is like it is it's amazing that there's that much content in a game that you could write a book I mean that that's like a whole separate development just to do the book oh it totally is right like who are I was who are these people who do these books who are these people who are these but seriously who who who sitting down with the developers on my bookshelf at home I do have my uh Super Smash Bros. N64 guide signed by the author Craig Harris that I'm always super stoked to have Craig Harris worked on that game there's a smash like that's a weird one to do a guide for I guess the Power Stars lot there's a lot of moves right how you do moves what are you going to do that I have that guide still I have my Superman 64 guide uh I remember I think the last guide I bought was Metal Gear Solid 4 because it was like end of an era this is it for Snake it came in it was hardcover it was an art book it had Hideo Kojima stories in it it was like that's really dope yeah it it is a it not that I read them all",
            "start": 450.92
        },
        {
            "text": "It was like end of an era this is it for Snake It came in, it was hard cover, it was an art book, it had Hideo Kojima stories in it. It was like that's dope yeah it it is a it not that I read them all cover to cover obviously but it's I don't know super interesting so I'll send a picture it'll embarrass me I'm sure to see. So the thousands of dollars I've spent on strategy guides that sit in a bookshelf you were talking about your you know the wife's been you know shoved you in a room that's where it's all got to stay and the kids come in though so I've got two kids they come in and are they allowed to play games uh sure yeah they so I have an 11-year-old and a seven-year-old about 10, 11 and seven right two girls and Lala yeah fantastic. And they they they're still doing a lot of like the RO bloxy kind of stuff right so they do a lot of I don't know if you guys know much about like LeapFrog crap boring LeapFrog crap that was always the worst right like oh my kids playing games oh what Leap",
            "start": 497.48
        },
        {
            "text": "kind of stuff right so they do a lot of I don't know if you guys know much about like LeapFrog crap boring LeapFrog crap that was always the worst right like oh my kids playing games oh what leap for I'm like get the **** out of here no no no they're like so they're like uh online Minecraft basically so they're browser based um where they can set up different trials to do different things so it's kind of cool like people will come in and invent stuff and so they're really into that kind of stuff NE they're also huge into watching which is insane they watch so many YouTube videos of Witches uh which is insane Witch is no is insane like what my kids are witches we sort of alt I have my neat nerd room my wife has her Witch Room with cauldrons up on the wall raising the kids as witches no they uh they log so many hours watching the the Minecraft videos stuff like that just endless but they're both Gamers Lego games which are great to play with kids right so we've got I think so",
            "start": 536.52
        },
        {
            "text": "\"No, they uh they log so many hours watching the the Minecraft videos stuff like that just endless. But they're both gamers who play Lego games, which are great to play with kids, right? So we've got I think so the kids playing with Legos though, like real Legos. They do yeah, they're both big Lego players. They have the new Batman Lego Dimensions from the new movie and stuff right, which we still haven't built all of it yet. But they're both gamers that I I'm sure as every parent will who's a gamer will admit there's some stuff I'm sure they've seen me do that I probably think back and go 'should they have watched me just decapitate this thing **** for health orbs?' Right, shout out War what do you want me to do? But in a funny way like my youngest is she's the one who really is desensitized to it. She knows it's not real and doesn't even affect her like she just says yeah whatever but like Resident Evil they were watching the other day.\"",
            "start": 582.72
        },
        {
            "text": "the she really is desensitized to it like the separation of it she knows it's not real and doesn't even affect her like she just like yeah whatever but like Resident Evil they were watching the other I'm like I probably shouldn't be letting watch too much put on the VR headset honey yeah yeah and and they do they they'll do VR they love it they'll get all kind of into just you know some of the have you guys seen like the new uh YouTube uh VR stuff have you seen any tried it so you can do videos now and there's on the PlayStation browser on the on the psvr through the YouTube app they have a whole section of and some of these are insane like someone jump jumping off the Dubai tower filming it right and it's it's it's a regular video that you would just watch on YouTube as any other video but it's in full VR it's crazy have you watched the VR porn yet uh I have not watched I did that I did that did you really yeah it's disturbing I don't I don't there's certain yeah I don't think IMX",
            "start": 627.12
        },
        {
            "text": "but it's in full VR, it's crazy. Have you watched the VR porn yet? Uh, I have not watched. I did that. I did that. Did you really? Yeah, it's disturbing. I don't... I don't think IMX is it. It's like IMAX except you're paralyzed with someone on top of you and then like when they get up close the perspective is all weird; their forehead looks like an iMac screen and that's what I'm looking at in porn. I'm judging your forehead, that's what I want to know. That that that can't lead anywhere good can it? I mean there's there's things for VR but that's that's not Ian well that's I get that that's the logical thing people would think but man that's I don't I don't that I don't want that. I mean that's where that VR will either succeed or fail based on porn like it they need to figure out a way to make it and every single every technological thing porn touches well maybe just what maybe like the the watching like the watching part of porn which is porn but the uh the",
            "start": 664.64
        },
        {
            "text": "to figure out a way to make it and every single technological thing porn touches well maybe just what maybe like the watching part of porn which is porn but the uh the YouTube video example maybe that's where rather than you being in it like I don't think I want to be in VR porn maybe the watching part of VR porn is where it so when you're jumping off the tower you're not in the first person perspective no you absolutely are you're 100% the guy like you can see your wings you can you you got to it's really pretty compelling strange they launched it about a month ago yeah I remember hearing that they were doing it but I haven't had a chance to over I still haven't played that Ghostbusters VR game I had no yeah I ne I had no idea I haven't played the Tim Schafer one either what is the Rus ruin yeah Rus R yeah good I mean it's it's longer than I thought it would be I haven't played the final version I've just played preview things of it and I'm it's interesting",
            "start": 704.56
        },
        {
            "text": "either what is the Russian ruin yeah Russian R yeah good I mean it's it's longer than I thought it would be I haven't played the final version I've just played preview things of it and I'm it's interesting that it's as long as it is I love they did that by the way that was a perfect thing for them uh I can't wait to check it out well I mean that's and that's you know when we had Tim Gettys on at launch to talk about it that's what I love about Double Fine is that they will take those chances and they will make connected games and they will do all even if it's not got a huge payoff it's a it's a thing the community and the fans want right no but there there's ones of you running like with elephant I mean you should you should definitely it's a little strange use of VR but it's you think I I always think about the places you're going to be able to the the the good stuff that VR can bring whether it's you can visit places in the world you've never even thought about visiting in a way that is not",
            "start": 745.24
        },
        {
            "text": "think about the places you're going to be able to visit in VR, whether it's visiting places in the world you've never even thought about visiting in a way that's not just looking at a picture - go to the Taj Mahal and walk around, go to Niagara Falls and walk around. There's some really cool stuff they're going to be able to do, we talked about this at the launch of it right when Colin was like the real applications are outside of gaming too. And I feel like that's a huge if - Sony this year, and I know we're going to talk about E3 eventually, but if Sony at this year's E3 doesn't have it put on your PlayStation VR headset and be in the front row and be backstage and be in the ring and do all the same stuff... if they don't have that, it's like what are you guys doing? That would be an easy dunk to connect those dots. It'd be amazing to have come and see exactly how",
            "start": 776.56
        },
        {
            "text": "guys doing like that's an easy dunk you've had connected that dot that would be amazing to have come come to see and that's the whole thing of like how do you make year I'm there watching exactly how do you make your presentation you know something that nobody else can do and that's one of the ways now here's my question though before we get off of you just being a family man having this stuff so the wife doesn't play games doesn't play games she'll play Overcooked okay yeah so we we do and we'll fight like cats and dogs because the kids love to troll so they are as kids bad advice you know the raccoon in the wheelchair oh yeah let something catch on fire raccoon wheelchair fire extinguisher spin around oldest daughter just laugh her ass off trolling and eventually we all get frustrated and leave okay good real quality family time quality family time good job but she will play Overcooked so that's good but the rest of it she'll watch a little bit watches Tomb Raider a little",
            "start": 814.4
        },
        {
            "text": "and leave okay good real quality family time quality family time good job but she will play overcooked so that's good but the rest of it she'll watch a little bit watches Tomb Raider a little how did she feel then about like the love of her life the father of her children being obsessed with video games and spending so much on strategy guys oh my God if we pinned her down like truth serummed her uh I don't know that I want to hear that answer necessarily you love me honey don't you yeah so what does she think about this then cuz this is another level of video game geekdom of like no no I like these idiots so much that I'm going to continue to give them money and then come on their show and just talking yeah yeah well she knows that I have sort of like the secret look i' I've been I've worked in IT industry work for a big IT company been there for 25 years great company etc etc she knows my secret dream is to do something in this industry like I would love to do something",
            "start": 854.36
        },
        {
            "text": "in the IT industry, work for a big IT company, been there for 25 years, great company etc. etc. She knows my secret dream is to do something in this industry, like I would love to do something, I don't know what it would be, given my background and what I've done, but she knows this is kind of my passion and my thing, yeah, and so I think because it's hopefully a non-destructive there's nothing bad that comes out of it other than me spending probably far too much money and time what I could be doing other things, she totally supports it okay right because she knows that like Greg I would love to find something to do in this industry that would you know be a passion of mine to go do it so she's cool with it but yeah I think she probably thinks it's well I mean you guys I mean obviously gaming in general that's what I kind of love about the generation, so I grew up with like the Inuyasha television show, you guys remember Inuyasha television way back when, I've read history we read about history books an actual",
            "start": 891.76
        },
        {
            "text": "General, that's what I kind of love about the generation. So I grew up with like the old television shows you guys remember from back when I've read history books - an actual thing that existed right? Think that was in 1980, I want to say, right? So been a gamer my whole life and gone through all the consoles and done all the kind of stuff you know - Ataris and all of that. Um, so many people are now old enough, obviously, you see the Uncharted series and these really deep stories. It's just a cool time to be a little bit older and see where this industry can go and where it has gone and the types of things that it's come up with. I think she knows that stuff exists - I mean, she just looks at it again and thinks about the thickness of these games like \"wow, that's not just you know a bunch of teens shooting each other in Call of Duty\" and it's like this hollow thing but that that exists too and she separates it out and like we all do.",
            "start": 929.56
        },
        {
            "text": "this isn't, you know, a bunch of teens shooting each other in Call of Duty, and it's like this hollow thing, but that that exists too, and she's aware of that, but I think she separates, and like we all do, right? I'm a little bit younger than you, not by much, but that is the thing of where I do count myself blessed that I've been in video games since you know Sega Master System, but NES was there too, I what it was so I I do have that timeline that context for where this all started and where it all went, and the fact that you know I did get to a point where I remember like I'm going to fall out of games, and it wasn't cuz here's Metal Gear, and like oh my God this is what it's going to be, and to stop and think about your children now growing up and only knowing that only knowing that this is what it can be to think about the games they're going to make when you talk to Neil Druckmann who talks about you know the games that inspired him right unbelievably complex storytelling",
            "start": 968.84
        },
        {
            "text": "this is what it can be to think about the games they're going to make when you talk to Neil Druckmann who talks about you know the games that inspired him right unbelievably complex storytelling and all the stuff that games can be um yeah so I think I think from that standpoint there's I think for all and and there is still that younger element too that is really pervasive and still always going to be there sure oh yeah yeah games are always and I mean that's the whole thing where people are like we need to change the name of this it needs to be interactive entertainment or something to get away from games because games does imply right a waste of time I'm going to be it's just a dumb kid thing blah blah blah blah but I know totally video games are always going to attract a younger audience but then there is now such a breath of them and like I always talk about this the Silly Putty that there's a game for every mood you're in and games mean games mean so much and what what's cool",
            "start": 1005.84
        },
        {
            "text": "but then there is no such a breath of them and like I always talk about this the Super Nintendo that there's a game for every mood you're in and games mean games mean so much and what what's cool for me is like growing up in it I you know I was born in '89 which means that the first system that I really kind of had was the Super Nintendo at the tail end like and then N64 was like I was five when it came out I graduated college in 90 but uh but I was I was in 1990 when you were graduating I was finishing first grade right kindergarten first grade yeah first grade there you go yeah there you go we got Generations here I feel really bad too for you that you know you got you were born '89 so you missed Ghostbusters II in theaters you never understood my fifth birthday was Power Rangers made it was fine but you know what's worth though I will say one thing not to interrupt you but the I in in what I do now with other you know 40-some men is there are definitely times I don't admit to",
            "start": 1039.56
        },
        {
            "text": "It was fine, but you know what's worth noting though? I will say one thing not to interrupt you, but the \"I\" in what I do now with others, you know, 40-some men is there are definitely times I don't admit to being a gamer really. Oh yeah, yeah, yeah, I mean you guys kind of live in this world right? So it's like we're in a bubble man in a bubble, so you don't...I mean, so there's lots of stuff. I mean, I'm sure there are people I work with now that would be...I mean, say they're offended is not the right word, but just be like really games? Games? You're a vice president of a big IT company and you're going to...that's what you do right? Right? Well, so many people I always talk about it right, that so many these people's education on GameStop at Mario they play that and they're like \"or Call of Duty\" and that's not for me right. For the bro exactly, BR shooter, the shooting each other mindlessly violent stuff they've seen on Capitol Hill when people have gotten into trouble for different things...they don't they don't know the The",
            "start": 1083.56
        },
        {
            "text": "for the bro exactly BR shooter the shooting each other mindlessly violent the stuff they've seen on Capitol Hill when people have gotten into trouble for different things they don't they don't know The Horizon there's such a big scope of what I was saying a second ago is that I kind of grew up with this place where Super Nintendo and N64 were my first real gaming systems but because of that that allowed me to go to garage sales and hang out with Kevin and get the NES and buy for $18 a box full of a bazillion different games catch up on and kind of like just binge through all these experiences and then to read grow up reading magazines and realize that I love video games as a culture more so than just a like oh there's like the way that I enjoy movies right they come out and I watch them and I love movies movies is unfair too cuz I'm also in that but with games I fell in love with the history of it the future of it the the entire industry and then it allowed me to do even though I didn't grow up",
            "start": 1120.72
        },
        {
            "text": "movies is unfair too cuz I'm also in that but with games I fell in love with the history of it the future of it the entire industry and then it allowed me to do even though I didn't grow up playing Metroid I went back and played Metroid and completely see the completely saw and fell in love with it in a way that I'm like okay cool like I get where the Colins of the world come from that's a fascinating point your living's the dream I always think of man wouldn't it be great to time travel to jump ahead 5 years and watch all of the DC Cinematic Universe just to see how it came out and not have to wait for these movies but you it's the same thing for games what is Sucker Punch working on blah blah blah blah what's Death Stranding like and the point I'm making is your kids growing up like yeah they're playing the Legos and that's where the games are to them but I do feel like uh all the major publishers specifically Nintendo and um PlayStation and Xbox two in extent",
            "start": 1168.44
        },
        {
            "text": "Kids growing up, like yeah, they're playing Legos and that's where the games are to them. But I do feel like uh all the major publishers, specifically Nintendo and PlayStation, and Xbox too in extent, uh actually no, Xbox is killing it as well in making sure that all of their iconic games are like this is where all these remasters and stuff, and while we all don't like them now, we hate the ports and all that stuff. Overall, in terms of like it's an easy talk if it's done in a cash-grabby kind of way, right? Yeah, but like I do think that with things like Virtual Console being ubiquitous and the fact that PSN has so many different games, and and a lot of them being PS1 Classics and all that. The fact that these kids growing up, if they do hit that point of \"I'm just going to play what's given to me\" and go from there, cool, that's your way to enjoy video games. But for the people that grow up, like I love this, I love it. What are what is the most important game of all time? Like what what games do I",
            "start": 1209.56
        },
        {
            "text": "go from there cool that's your way to enjoy video games but for the people that grow up they like I love this I love it what are what is the most important game of all time like what what games do I need to play to know where things came from because all of it is iterative right Kevin and I were talking earlier about how Horizon in particular the the the bar that it has set is so big right that it's either a great thing for the industry because now people are going to kind of see that and compare to that and and aspire to that yeah but it's also potentially really dangerous because think of the development dollars time effort that have to go into topping a game like Horizon I mean this puts developers in a really so so to go back and see that history and how it's all built none of it would be here without what came before it yeah sure all of it is built on that thing and so it's cool it I'd love to be able to go do that because if you're there for the ride you don't you don't you don't",
            "start": 1252.4
        },
        {
            "text": "be here without what came before it yeah sure all of it is built on that thing and so it's cool it I'd love to be able to go do that because if you're there for the ride you don't you don't you don't see the force for the trees you see Force for the trees right yeah exactly and and what's cool too is it it gives you everybody has their own perspective and they're allowed they're they're allowed to yeah they're allowed to uh kind of see see it through the lens of knowing it's important knowing that it's not going to hold up as well as the new version you that you you're familiar with now and all that right like when it comes to like thinking of Zelda for example right there are kids now they're going to grow up with breath of the wild and that is what they think can you imagine that being like your right same way that Ocarina of Time right oh I'm sorry go for it no this is when we were hanging out with Craig Glaser from ScrewAttack and he talked about how yeah he he's his",
            "start": 1297.08
        },
        {
            "text": "your right same way that Ocarina of Time right oh I'm sorry go for it no this is when we were hanging out with Craig from Screw Attack and he talked about how yeah he he's his daughter now he's taking her through the games and he sat down and they played The Legend of Zelda and they were enjoying it and then like two nights later what Breath of the Wild looks like and Pops that and her head like exploded and he killed his daughter and he had a barrier and then he hired a new daughter and this we've we've all been there we've all done that but you know I hadn't thought about that is going I that's one thing with my kids is BEC besides maybe occasionally diving into some of the stuff that may be on Virtual Console or like I was playing Metroid the other day which is still phenomenal I have Super Metroid I haven't I haven't taken them back through some of those I'd love to now because they're watching me do Zelda now but like you if that's all they're going to know that's crazy",
            "start": 1332.72
        },
        {
            "text": "I have Super Metroid. I haven't taken them back through some of those. I'd love to now because they're watching me play Zelda now, but like you, if that's all they're going to know, that's a crazy jumping-in point. To think of right here's my next question for you as a grown-up gamer, yes, that's and I think that's what this topic has become. Be like should probably be a Twitter hashtag \"grownupgamer.\" Grown-up gamer, your kids watching do they sit there and just watch for hours on in? Do they is it 15-minute increments, they're popping in, popping out, for do they want the controller are they being annoying? Um, cuz I'm in love with this French Canadian girl, and I'm probably one day going to have a kid with her. I love her so much. Are you speaking any yet? Are you picking any up? So I speak; I had like 15 years of French, so I can I can help. Oh wow, okay, thank you. But anyways, they've changed over time actually. So I it started where we would do a lot of like the Skylanders stuff right, so I've",
            "start": 1370.08
        },
        {
            "text": "Had like 15 years of French, so I can help. Oh wow, okay, thank you. But anyways, they've changed over time actually. So, it started where we would do a lot of like the Skylanders stuff right? So, I've got good Lord, I've probably got more Skylanders toys than I would ever want to claim that I've got. Um, do they still like Skylanders? Uh, they don't as of the last one. No, I think they kind of wore out a little bit. Got it. But they would put in dozens and dozens of hours into Skylanders for sure. Uh, the Lego games absolutely. Like, I mean we don't trophy hunt for platinums but we've put hundreds of sorry, some I do, they absolutely have put uh, and their attention spans are long as they've gotten older and a little more scattered. It probably is more 30-minute increments they'll jump in, they'll jump out, they'll do things a little more sporadic but they'll they'll sit and watch. I mean, they'll I mean my youngest daughter Lla will watch Horizon as long as I'll play it. I mean, I mean PS4 Pro Horizon is like",
            "start": 1409.04
        },
        {
            "text": "\"Do things a little more sporadic, but they'll sit and watch. I mean, my youngest daughter will watch Horizon as long as I'll play it. I mean, PS4 Pro Horizon is like a religious experience just looking at graphics. I mean, that thing is sickening. Yeah, I mean well speaking of that, we were talking about this a little bit earlier. So you have the LG OLED E6 series TV, C6 series and they same panel by the way. I don't know if you know, but it's just the difference. But I mean this is one of those things where it's like out of all the items that I've bought in the last 30 years of my life, not even I'm not even 30, but like this is how good this damn TV is. Wow, oh it's that it is that damn this is the curve one you have yes it is and it's only curved because that's the only it's whatever yeah yeah there's the B6 C6 E6 G6 all of them are fantastic and they're the type of TV that you dream of and when\"",
            "start": 1453.48
        },
        {
            "text": "one you have yes it is and it's only curved because that's the only way it is whatever yeah yeah there's the B6 C6 E6 G6 all of them are fantastic and they're the type of TV that you dream of and when you see it you're just like holy **** so I didn't I didn't know because the Pro launch was so bizarre I watched you guys the day you did the Pro launch right and it was such a **** show right it was like you you couldn't explain it over the I mean it was just bad right so I was really hesitant on the Pro yeah insane really to have a Pro on that TV I can't even imagine going back now and I'm I'm a multi console guy right so I usually choose which console I play on based on some really simple so I I was an Xbox guy last generation really because of the controller like just like the controller a little bit better it was not I'm not a fanboy of I just like games broadly right this generation was uh started off PlayStation and then I went back to Xbox solely because of the external hard drive",
            "start": 1496.84
        },
        {
            "text": "Little bit better, it was not. I'm not a fanboy; I just like games broadly right? This generation started off on PlayStation, and then I went back to Xbox solely because of the external hard drive. Because I got so tired of juggling stuff on and off of hard drive, and a lot of these patches - I mean, they're like 18 gig to reinstall a game, and you'd sit for however long. And now, thank God, they've gone with external hard drive support. So now I'm back fully PS4 Pro. It's... it is so you've got one the pro, I do yeah yeah. So Sony sent us one for review and stuff like that, and I've just been using it as my go-to. I had no idea how different it was like to see how I thought a little bit - I mean, I'm not a big graphics guy, far like that's gonna make the game. But man, it is again a religious experience for some games in HDR; it's just like... I'll stop and just watch, yep. And that's my thing with it is in terms of playing the games.",
            "start": 1543.04
        },
        {
            "text": "make the game but man it is again a religious experience good for some games in HDR is just like I I'll stop and just watch yep and that's my thing is with it is in terms of playing the games I've never really noticed enough to even really talk about that much on Gamescast of like holy **** this is a game changer because it's more just like wow this is really really pretty uh for me it's Horizon and Ratchet and Clank and I would even put Ratchet and Clank above it's unreal some of the particle effects in that game are I was showing Kevin it and like even just spinning the camera around and looking at all it was like I remember playing Ratchet and Clank on PS2 and being like this this looks like a like a Pixar movie you know and they had that I mean they had a hard time conveying that right I'm Sony obviously knew that when they were launching this thing and I'm sure Mark Cerny or whoever else was like if people could just see this at what we're trying to do here it I mean to me it's I",
            "start": 1588.92
        },
        {
            "text": "I'm Sony obviously knew that when they were launching this thing and I'm sure Mark Cerny or whoever else was like, \"If people could just see what we're trying to do here...\" I mean, to me it's... I was telling Kevin earlier, like there's times in Horizon where I will because that world is so alive that I'll just get up to the top of a mountain and just watch the dynamic weather stuff, the monsters kind of fighting one another, the storm in and out. Like what other game can you... I mean, or you sit there and just watch this world kind of play out in front of you right? It's it's phenomenal. Yeah, I don't know. It's the the PS4 Pro is so interesting to me because for those moments I feel like they're so not gameplay related and not even just with... I'm in terms of they don't really enhance the game at all. It's when you stop and you're trying to show off to your friends, like for me it's more like \"Oh my friends are coming over I'm\"",
            "start": 1633.4
        },
        {
            "text": "even just with I'm in terms of they don't really enhance the game at all it's when you stop and you're trying to show off to your friends like for me it's more like oh my friends are coming over I'm going to show them this thing and be like can you imagine games look like this oh yeah it's way less way quiet why put your hand on your hip like that when you say that I don't know I just I'm playing with your friend I do it that was but they they really like it though because they like oh my God this **** looks so good but my thing is I like it more when it does the performance enhancing stuff like with the when games have the better frame rate and so they're doing a lot of that too there's a lot of these patches coming out and have you guys seen any of that like on the old old old on the regular PS4 have you guys seen any of these enhanced burst boost modes have you seen I haven't I now yeah that's the thing I've heard about it and I haven't caught him I don't look I'm not a patch notes guy",
            "start": 1674.04
        },
        {
            "text": "PS4 have you guys seen any of these enhanced burst boost modes have you seen I haven't I now yeah that's the thing I've heard about him and I haven't caught him I don't look I'm not a patch notes guy right like I turn on it's oh physically seen him like have have you done any of those cuz a few games I think came out with a new there's so the thing with games now is you're so used to updating the games that it's just like that's just part of playing a game now that like you don't know whether or not which patch it is or whatever so but for me on playing with the Pro when there are those things most of the time I don't notice and like that's just thing is like really it's like like Zelda with the jump button did you see you can move the jump button now did you see that in the last do that you do from I'm I saw that last night I'm like fake gamer guy I saw it last night when I cuz it updated it I was trying to update on the plane I'm like oh no don't lock me out of the game and I saw",
            "start": 1709.0
        },
        {
            "text": "you do from I'm I saw that last night I'm like Fake Gamer Guy, I saw it last night when I cuz it updated it I was trying to update on the plane I'm like oh no don't lock me out of the game and I saw it said you can move the jump button to the bottom button I didn't I'm how **** that up I had no idea that was there been annoying me from the beginning I don't like I'm not a wi jump but oh no that's cuz it's it's **** of course but that that was of the things I I was so impressed with where I was like oh motion control oh jump button iol it's like do you not want this **** turn off oh great thanks cuz now now trying to relearn that can't I **** run with the stick but no big deal it sucks to relearn that after sure 40 hours of using I'm like **** then you play another game you try to climb every wall and it's like oh the amount of people who have tweeted I've seen tweets of like them trying to jump triangle now F yeah oh my god oh man anyways anyway so now though I think the",
            "start": 1745.56
        },
        {
            "text": "to climb every wall and it's like oh the amount of people who have tweeted I've seen tweets of like them trying to jump through Triangle now F yeah oh my god oh man anyways anyway so now though I think the wife's cool with stuff um that's back to that topic so that this topic is my work my work Community probably not as much are you going to show them this video uh I you know it's funny I thought about it um I don't know depends on who the person is Right depends on sort of where I think the reaction would be I I don't think the company would care but they still got a little bit of a stigma to it right just kind of like again again you guys are a little bit in the business totally again this is like the you're like no I I work in the real world sir I know what it's like You've never worked in the private sector dream to that like you know go like Shu and people at Microsoft, Greenberg I mean that's those they're living their dream they're working for a big company but also doing",
            "start": 1783.04
        },
        {
            "text": "the private sector dream is to work for a big company like Microsoft, people like Shu and Greenberg are living their dream, they're doing something in the industry, there's plenty of adult jobs in the industry but there's still a ton of people who think games are childish, I was talking earlier on the Morning Show about what your grandparents would think of some of this stuff, there's still that group of people that will never get past it, my mom understands games through me and what we do, she played Wii bowling with me and wanted one like it, got it and then bought a DS on her own, only bought one horse game with it ever but it doesn't matter, when she came to visit last time and we put her in VR",
            "start": 1825.12
        },
        {
            "text": "do and got it and then that led to her buying a DS on her own she only bought one horse game with it ever but it doesn't matter but then when she came to visit last time and we put her in VR and she did those VR Let's Plays you did or whatever and for her to freak out like I can see my hands oh my God my feet it was like that was awesome with the exception of the Call of Duty episode which was I mean those episodes are the best oh thank you thank you I love Call of Duty one was great yeah ladies and gentlemen this is a Kinda Funny Gamescast each and every week we get together to talk about video games all things we love about them you can get it early over on patreon.com/kindafunnygames or you get it late on youtube.com/kindafunnygames that was the latest episode ever done but you got it out of the way now we can move on to topic two E3 predictions ladies and gentlemen yeah it's going to happen in June this show by the way nobody knows what it is thank you to Salem Gamall for being our producer you are",
            "start": 1861.72
        },
        {
            "text": "We can now move on to topic two, E3 predictions, ladies and gentlemen. Yeah, it's going to happen in June. This show, by the way, nobody knows what it is. Thank you to Salem Gamallam for being our producer, you are the man, the myth, the legend. I want to talk about E3 predictions and I want to put this out there now. This is March 29th. I want to have a first round, let's start talking about E3 what we think is going to happen from a big perspective later, obviously we'll do more in-depth, we'll dive into what happens, we'll take bets, we'll make you know try to see what we think will happen. We should throw some things out there that we can loop back to as it were, that's where I'm at, that's where I'm at. And say did we get it, did we not get it? So all these topics that we're talking about today are topics that you have suggested to us over time that I've been bugging you about as the producer just shooting them out like crazy, like talk about this, talk about this and so now like cool you're",
            "start": 1899.56
        },
        {
            "text": "Today are topics that you have suggested to us over time that I've been bugging you about as Greg for just shooting them out like crazy, like talk about this, talk about this, and so now like cool you're here, talk we can. So E3, what I want to talk about is the press conferences specifically The Big Three: Nintendo, Xbox, Ubisoft, PlayStation - oh, PlayStation right? Sorry, my apologies, Ubisoft. I'm sure we'll bring those guys up as well, but I want to talk about what we think they're going to do at their conferences from a just overall perspective because last year and this year were very different landscapes. They were dealing with right last year Nintendo comes out; they had their one game which was Zelda - amazing booth for Zelda, but nothing else. Yeah, and people loved it - yep, game of the show from so many people, but not us - not us. We love Zelda, but yep... um, Zelda that was their game. They didn't even do a direct; uh, the previous years Nintendo's been doing directs last E3 conference was 2012 if not 2013 maybe no it was 2013 because",
            "start": 1949.68
        },
        {
            "text": "We love, but yeah, um, Zelda. That was their game; they didn't even do a direct uh, the previous years, Nintendo's been doing directs. Last E3 conference was 2012 if not 2013 maybe no, it was 2013 because '14 was the first time they did the ref were still yeah, so uh Sony comes out with games, games, games; they have to home run, home run, home run, Grand Slam. Sports references: you don't know how home runs are if you do four home runs in a row that's a grand slam right? Yeah, yeah, so there's that and then Xbox surprising everybody coming out and being like very solid, very solid conference; I'm out of order on this but very very solid conference. Announced Scorpio blowing people's minds nobody expected that everyone expected PS4 Pro that didn't happen but getting very technical on stuff Microsoft in there flops and all the **** them flops flops have them flops man got to have the FL you talk about it and that was the interesting thing right about both uh, PlayStation and Nintendo right where they",
            "start": 1996.72
        },
        {
            "text": "flops and all the **** them flops flops have them flops man got to have the FL you talk about it and that was the interesting thing right about both uh PlayStation and Nintendo right where they had to get out in front of those stories where Nintendo's like Switch will not be there in PlayStation like we're not doing the pro stuff like that's not what this is about for remind me we knew about we knew the Switch we knew something was coming from Nintendo but we knew NX we knew we knew that NX would not be at E3 and we knew that Nintendo was only going to have one game at E3 got and so they they had Zelda in addition to that during their so they did their they released the Zelda trailer I'm going to grab a computer I feel like I'm going to need a computer I need more historical information get yourself some data get some knowledge it was the it was yourself up the first Zelda Breath of the Wild trailer where they revealed the name of the game oh it wasn't the first trailer they revealed",
            "start": 2053.12
        },
        {
            "text": "yourself some data get some knowledge it was the it was yourself up the first Zelda: Breath of the Wild trailer where they revealed the name of the game oh it wasn't the first trailer they revealed the name of the the first trailer was at E3 2014 did they really show in that far back yeah it was 2014 yeah it must have been when we thought it was going to be Wii U forever so yeah it was a Wii U game link came out and like jumped and shot the Guardian with an arrow yep so but we knew it was Breath of the Wild then and then they went on to do the Nintendo Treehouse all day there the big daddy the the Treehouse all day where they they demoed Zelda and showed all the was that treehouse awesome by the way like to see it from from a distance phenomenal yeah they're they're so good they set me up Nintendo 3DS like the actual set is E3's lineup of PlayStation next to Nintendo is always such a a beautiful thing like their booths are awesome uh but they did announce a bunch of random 3DS games as well",
            "start": 2091.12
        },
        {
            "text": "83 like the actual set is E3's lineup of PlayStation next to Nintendo is always such a beautiful thing, like their booths are awesome. Uh, but they did announce a bunch of random 3DS games as well, but that was just during The Treehouse and it was like smaller titles here and there, and like some Wii U stuff too, but nobody gave a **** at all. Um, literally right? Yeah, so then PlayStation just straight killed it, but yeah Microsoft was the one that was a bit more like they had a lot of the big AAA third-party games. They had Final Fantasy XV showing, which was embarrassing, and then they showed Scalebound; they showed Scalebound, got cancelled, yep. Whole bunch of other stuff, Sea of Thieves... I think they did do a Crackdown teaser or was that at the very end of it? I want to say they did. Which I'm still questioning - we haven't seen Crackdown in a long time, that's the thing. I don't think Crackdown was there last year, was",
            "start": 2130.12
        },
        {
            "text": "very end of it I want to say they did which I'm still questioning where we are with we haven't seen Crackdown in a long time that's the thing I think I don't think Crackdown was there last year was it I think they skipped I mean they they Ann I I remember they announced it one year and then they skipped and everybody like where the hell is it let me hit yall with some of that sweet nasty nasty if you click right here you can subscribe to youtube.com/games for way more of this content click here for way more just other kind of funny content like I don't know the Morning Show and GameOverGreggy you can click here for Patreon and Bam you're giving us money we can do cooler stuff Andy Cortez can have a clone",
            "start": 2179.8
        }
    ]
}