{
    "id": 2570,
    "video_id": "DtzhW_7SduI",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Does Pineapple Belong On Pizza? - The GameOverGreggy Show Ep. 176 (Pt. 4)",
    "description": "Lines will be drawn.\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1492671600,
    "duration": 1057,
    "transcript_chunks": [
        {
            "text": "Tim, what's your topic? I want to start a war of epic proportions. I believe this war has already been waging; it's been waging, but I want to start a war at this table, okay? Do pineapples belong on pizza? Yeah, this debate again. Yes, oh man, we're already starting with the G. Be just like that. What do you fall down on this, Greg? Now it's a complicated question; it's a multi-faceted question. The question is, do pineapples belong on pizza? I of course am part of whatever gets you, yeah, let your freak flag fly if you want pineapple on your pizza if you want live mouse on your pizza, that's your choice, and I'm not going to get in the way of it. Would I put a pineapple on a pizza? No, I would not ever; I don't know, no, none of this Hawaiian style. I'm going to get it; I love Canadian bacon; I love Canadian bacon, but I like with some pepperoni, that's right, more salt and meat. What do I care? I enjoy pineapples on pizza; I don't say that they belong there; I enjoy them, okay. I like a good",
            "start": 2.85
        },
        {
            "text": "I love Canadian bacon, but I like it with some pepperoni - that's right, more salt and meat. What do I care? I enjoy pineapples on pizza. I don't say that they belong there; I enjoy them. Okay, I like a good Hawaiian slice. This is a thing that's been out of control in the Facebook group, on the forums everywhere else, and this is expanded - I mean it's not just we're you about on the stream a couple days ago, the whole world is joining in. Are they really? The world is getting divided. Yeah, where does he stand? Pineapple? He says yes. Troy Baker no, no pineapple. My God, was did I miss them? Other my apologies. Yeah, so this is this is a whole thing. For me, I've always stood that I like Hawaiian pizza. To me, it belongs in the world. It's not what I think of when I think of pizza. Sure, does it belong on pizza? You're right; your answer is correct, Greg. Wherever you need whatever you want on that pizza, you put on that pizza, but I think that when you think of pizza, you get the classic.",
            "start": 57.56
        },
        {
            "text": "on pizza you're right your answer is correct Greg where it's like whatever you need whatever you want on that pizza you put on that pizza but I think that when you think of Pizza you get the classic there's pepperoni obviously as an option sausage is an option just cheese as an option whatever Hawaiian is its own kind of sub genre that I feel totally deserves a place at the table sure everyone's just going to understand that it's going to be the least grabbed exactly more for me but exactly and the way I see it is I kind of look at it as a dessert it's a mini dessert pizza a little bit of sweet to it yeah you have a couple slices of your other stuff I feel like you have opinions on this I think I just figured out why I don't like Hawaiian so much because at Pizza parties was I the guy that came back to have a couple more slices when the party was done yeah and guess what was there Hawaiian Hawaiian and it was like so you OD I guess no it was always not ODed it was always like I mean I'll",
            "start": 103.36
        },
        {
            "text": "back to have a couple more slices when the party was done, yeah, and guess what was there Hawaiian pizza, and it was like so you'd OD, I guess no, it was always not ODed, it was always like, I mean, I'll eat it 'cause I'm fat, but you gotta eat something; I'm not going to enjoy it, I'm not going to enjoy it. I've been there, we've all been there. Now, real quick, did you lead in and say, \"I realize the reason I hate Hawaiian so much is because of the pizza\"? I think you left out the pizza part just to throw that out there. I thought we were coming right back hard on Hawaiian. I like, damn right off an entire populace; we need you to weigh in, yeah. Um, Hawaiian pizza, don't, yeah. Here's the deal: I like pineapple on pizza, yeah, I like it so much you'd staunchly stand for it, yeah, I absolutely stand for it. I think it's one of those pizzas that should be ordered in the lineup when you're ordering for a party of 10 to 15 or more; there's gotta be a pineapple there, got to be really, I'm not saying",
            "start": 150.84
        },
        {
            "text": "it's I think in the um the lineup of pizzas that should be ordered I feel like you're ordering for a party of like 10 to 15 or more there's gotta be a pineapple there got to be really I'm not saying predominantly I'm saying give the people a choice like my go-to pizza of course pepperoni pizza right yes large pepperoni pizza you love getting a pepperoni pizza scraping all the **** off of it eating it with your hands throwing away the crust like until I get eventually like that that wears me down and then I just eat a piece of pizza in peace by myself when no one sees me um if you're going if you're going to go a little more bland that of course the cheese pizza is like another staple right those are the two see that's the thing that's the answer I feel is that you I don't order a Hawaiian just to order a Hawaiian in there you order a cheese then you have your sausage you have your pepperoni maybe you're crazy with them put some spinach in there or something right and then",
            "start": 197.44
        },
        {
            "text": "order a Hawaiian just to order a Hawaiian in there you order a cheese then you have your sausage you have your pep maybe you're crazy with them put some spinach in there or something right and then you of course you've got you know the other Pizza which no one ever ends the white sauce Pizza no that that's see that's something that's outside of the norm right I feel like the pizzas that you should order the cheese the pep maybe the pep and sausage right uh maybe the sausage bell peppers onions like whatever that is which I never com Su someone always has to get that someone always likes that right and then if you you got to throw in the variety which is just the oneoff Canadian bacon pineapple pizza right you don't need to necessarily do the whole thing in that but you got to have half of it I would go do pizza party I like this variety of pizza that you have because here's how it's going to go yeah okay M start off straight up classic and to have a couple pieces of pepp relax",
            "start": 237.32
        },
        {
            "text": "it I would go to a pizza party, I like this variety of pizza that you have because here's how it's going to go, yeah okay, let's start off straight up classic and then have a couple pieces of pepperoni, relax, maybe grab a Coke, hang out with more people, then maybe in a piece of I'll get crazy, a piece of pepperoni and some sausage, then I'm like, a lot of salt intake right, I feel like I need something sweet and savory to wash that down. Boom, the Canadian bacon pineapple. I'm not saying that's my go-to, I'm not going to start there and end there. And these are lies if you go to a Nick party, he's going to be eating a goddamn salad, yeah that's true. I'm saying if it's a pizza party here's the deal what I've always wanted to do this for the last two years on my birthday but I've just never had the inclination or the energy to do it I've wanted to throw an old school let's go to a pizza joint like a Round Table or a Shakes' Pizza Party have all the friends come bring all the kids hats poppers the whole shebang",
            "start": 275.72
        },
        {
            "text": "the energy to do it I've wanted to throw an old school let's go to a pizza joint like a Round Table or a Shakey's pizza party have all the friends come bring all the kids hats poppers the whole shenanigan like the whole line yard we get like 30 pizzas that get delivered there someone kid is over there throwing up in the corner what the **** and we're oh and we all go oh but then in the back of our brain we're all secretly happy we don't have kids um real quick to shout this out I've never been and it was like an oasis maybe and I don't even know if you guys could help me remember it but over in Oakland I went to a Nicole Tanner uh I don't I don't think it was either a goodbye party for her or a birthday party for her kid and it was what you're describing where it was games all over the place and a pizza place but it was a pizza place and a fried chicken place oh wow so you got Giant Pizza plates you put down with the Giant Pizza on it and then **** giant thing of fried chicken I was like",
            "start": 314.04
        },
        {
            "text": "a pizza place but it was a pizza place and a fried chicken place oh wow so you got Giant Pizza plates you put down with the Giant Pizza on it and then **giant thing** of fried chicken I was like this is the best **place** ever let's do that that sounds great yeah there's a there's a couple places in the city we have to go to Oakland yeah I'm fine with that okay well the thing is I feel like you can't there's a couple places in the city that I would consider having it at but you need space you need kids running around you need Round Table need the arcade with the greasy ass I mean but like or **chew** cheese correct me if I'm wrong because I've only I've only tried to pick up pizzas from round table with Kevin or the one I used to walk by in like Burlingame um are they big enough for that though cuz I feel like there's like a few Bo and then like two Mach Round Table is made for for this type of small round tables but a lot of them have like section forties in Daly City going back to",
            "start": 353.04
        },
        {
            "text": "cuz I feel like there's like a few Bob and then like two Mach Round Table is made for for this type of small round tables in but a lot of them have like section forties in Daily City going back to the pineapple pizza thing if you want to give it a fair shake the Maui Wowie the round table Maui Wowie like they're they're like we're going in we understand people got beef with pineapple we're just going to do it right we're just going to toss some stuff on it we're going to give it some I don't even know but it's like that that to me I'm like oh this is more of a complete experience it's not just the you know just the ham and pineapple on normal Pizza calling it a day like there's something that brings it all together just the flavor profile where do we come down on buffalo chicken pizza absolutely see the problem is I think this is when we I'm I'm down hey do whatever the hell you want but we're starting to get to the point where it's just like there's all these different subgenres",
            "start": 387.84
        },
        {
            "text": "pizza absolutely see the problem is I think this is when we I'm I'm down hey do whatever the hell you want but we're starting to get to the point where it's just like there's all these different sub-genres where it's like cool there's a buffalo chicken there is the white sauce pizzas there is like whole throw feta on a pizza Greek pizza that's great I'm just saying that's that's that's not top tier that's like artisanal like we're getting into that Arugula that's good P arugula that's AR sea salt and it's great sea salt but it's delicious here's how I know it's Arugula because in order to do that right when they deliver it they give you the Pud pizza and a bucket of yeah and you got to throw it on top yourself like a peasant not a peasant they don't want it to be all soggy and gross when it gets God I want to go eat that rest of the only time I ever want to touch my pizza my own pizza is when I'm putting it in my mouth I don't want to put talking throw it up behind",
            "start": 433.04
        },
        {
            "text": "soggy and gross when it gets God I want to go eat that rest of the only time I ever want to touch my pizza my own pizza is when I'm putting it in my mouth I don't want to put talking throw it up behind on the big screen hold on I'm trying to you find it bigger he's yeah he's struggling but he's got it we got it here Tim let me ask you this question because I know the answer on my own heart and Chass this goes out to you as well sure how much scroll down to see more like here's the oh my God I'm getting car sick Maui zoi with ham it's two pixel well you got some jalapenos happening some red onion no no no I I don't think that's jalapenos that's uh chives Kevin leave this picture up can you find the ingredients I'll do it Kevin can't do it why can't I do it cuz you didn't do it hey what's on the Maui zi Pizza you went to Google image search you said let me see it you said put it up after you already had it I hate you damn he went deep on that he's a piece of",
            "start": 472.08
        },
        {
            "text": "hey what's on the Maui Zi Pizza you went to Google image search you said let me see it you said put it up after you already had it I hate you damn he went deep on that he's a piece of crap cool Greg he's visiting to eat some pizza come here man what are your thoughts on the war between pineapple pizza versus no pineapple pizza uh my thoughts on it yeah they're closer to the mic well remember remember the famous Jay Leno yes he was really a pineapple pizza fan Hawaiian pizza right when I was younger I never had had it I never barely even heard of it but I was like you know what I really want to be like Jay Leno so I always told people I liked it and then I wanted to get it and order it so I ordered a bunch more times and I actually wanted to eat it so I'm in support of it damn I ordered it a bunch more times I'm really surprised you'd eat it cuz you're from what I know about you from the few times we hung out you're a picky eater if mayonnaise gets on something",
            "start": 509.92
        },
        {
            "text": "it damn I ordered a bunch more times I'm really surprised you'd eat it cuz you're I from what I know about you from the few times we go out you're a picky eater if mayonnaise gets on something you won't you won't even clean it off for a week yeah you won't eat it and you'll never go back that place is dead to you mad person who's responsible for the mayonnaise yeah yeah but pineapples and mayonnaise too two different things you know it's true is a great point that is a great Point all right so we're at Round Table Pizza.com on the menu Maui 'i Catch the Wave of flavor tender ham why would you go to roundtablepizza.com menu to figure out what the ingredients are for one of the pizzas oh I didn't do that I said Maui 'oi round shape pizza and I found it immediately Cast wave what I I wanted you to be on the screen cuz I look over how mad you are Cat the Wave of flavor tender ham crisp bacon juicy pineapple tomatoes red and green onions available on Polynesian or zesty red sauce so it's the",
            "start": 557.56
        },
        {
            "text": "to be on the screen cuz I look over how mad you are at the wave of flavor tender ham crisp bacon juicy pineapple tomatoes red and green onions available on Polynesian or zesty red sauce so it's the bacon the bacon is what really brings it all see that I can see that Maui, Zoi man God no Joey Noel Kevin we need to figure out a way to get Round Table to sponsor us I don't think that that's possible that's a you kind of conversation we need to make that happen though cuz shout out to Round T shout out to pineapples on pizza that's like Coke in you know Jo Community manager Joey Noel how do you come down on pineapples and pizza it's disgusting God bless you she's right wait how many pro pineapple the whole table is at least okay with it it's not that I'm it's not that I'm Pro so disappointed it's not that I'm Pro St you **** it's that I'm I'm saying the option should be there you know what I mean why cuz what do I I don't care put whatever you on a pizza but it's just so gross I I don't",
            "start": 599.92
        },
        {
            "text": "not that I'm Pro St you **** it's that I'm I'm saying the option should be there you know what I mean why cuz what do I I don't care put whatever you on a pizza but it's just so gross I I don't I wouldn't order it ni ordering his own are you are you basing this off of site or have you actually tried the P I've tried it and it's disgusting it's horrifying it's good not to mention that ham is like a ble all right now that's some straight **** who orders Ham on Pizza outside of Hawaiian I order it all the time ham is pepperoni give me all the **** Meats triple meat no okay no yes if you're ordering triple meat then it needs to be pepperoni sausage and like bacon or something yeah there we go some other sort of sausage pit that I like P sweet and the Savory together on see I love that I love that see I'm I'm I'm bacon chocolate give me all the sweet and savory you possibly can that's fantastic you like baked chocolate B chocolate on Pizza no no not pizza just I'm saying I'm saying",
            "start": 654.96
        },
        {
            "text": "I love that, see I'm I'm I'm bacon chocolate give me all the sweet and savory you possibly can, that's fantastic. You like baked chocolate B chocolate on Pizza no no not pizza, just I'm saying I'm saying sweet and saory the same time. I love that, I love that salted caramel ice cream, I love that uh when they put the the sea salt on top of chocolate, I like that that hit of saory with I don't have a problem with that but it's on Pizza. That this is the same CU what's great what's great about it is the the ham brings out the the the savoriness of the sauce and the dough and then the pineapple actually brings back brings in those hints of sugar in the sauce that you're getting so it's nice, it's it's very it's like the sushi Pizza complex flavor profile. Thank you Greg, thank you Greg. Very sorry to disappoint I'm just to the earlier topic like I'm not going to be a dictator Superman I'm going to let you put what you want in your pizza you can put whatever you want in your pizza I'm just going to",
            "start": 709.68
        },
        {
            "text": "I'm just to the earlier topic like I'm not going to be a dictator Superman, I'm going to let you put what you want in your pizza. You can put whatever you want in your pizza; I'm just going to judge you for it. But would you ever order it? No, all right. So you're on our team; you just don't want to say it, you coward. I'm just saying the question wasn't should it burn in a fire and die or should it exist? Wait, that Andy Cortez, Andy Cortez. We're getting all the Kinda Funny people vote; you need to go, yeah, you can go. Everybody, Chastity has to go speak. You speaking engagement, I have to speak for kids. Yes, thank you for coming by, thank you for... we've been showing it but if they're an audio listen where can they keep up with you? Please check out Gamespot Universe; that's where I host most of my entertainment stuff for Gamespot. So that's our home for anime, wrestling, movies, TV, and Comics. It's Gamespot Universe on YouTube, so youtube.com/Gamespot universe, and follow me on Twitter @ChastityV there it is.",
            "start": 749.96
        },
        {
            "text": "stuff for Gamespot so that's our home for anime wrestling movies TV and Comics it's Gamespot Universe on YouTube so youtube.com/ Gamespot universe and follow me on Twitter Chastity V there it is thanks thank you so much for coming by thank you for having me no problem get the **** out now I'm leaving and you're going to sit in this seat get pineapples her final pineapples pineapples a good shout out you need to go to her Twitter cuz her pin tweet is get you a girl who can do both and it's her as Psylock and then it's her as a piece of pizza okay what kind of **** are we discussing here guys pineapple on Pizza a **** crime against humanity man no here's the real thing okay here's the real deal right now if we're being honest and I don't like to discriminate against topics on Pizza I don't I don't like to discriminate against anything but if we're talking about crimes things that don't belong on pizza **** mushrooms take the mushrooms take them that should be the real debate why",
            "start": 788.96
        },
        {
            "text": "I don't like to discriminate against anything, but if we're talking about crimes, things that don't belong on pizza are mushrooms. Take the mushrooms; they take them. That should be the real debate. Why? Here's why: because the mushroom doesn't age well on the pizza. You get a cold piece of pizza out, you want to eat it cold, you get the first bite and you catch a little slimy mushroom in your mouth that slithers down your throat makes you want to gag all over your own CR. You should eat a cold pizza; heat it up. What are you talking about? Cold pizza is okay. God, there's so many wars brewing in one topic. First off, I'm fine heating it up, but you know I like things cold because I'm lazy. How do you reheat your pizza though? You got to toast it, you got to put it in the microwave first, stop listening and then you toast it, you then you toast it that way it's warm inside, yeah, and outside. Now I'm going to graze; no, no Kevin, I need Sky Cam. I need Sky Cam, then you can come eat it. All right.",
            "start": 833.0
        },
        {
            "text": "listen and then you toast it, you then you toast it, that way I'll it's warm inside yeah and outside now I'm going to Grazza no no Kevin I need Sky Cam I need Sky Cam then you can come eat it all right cuz I'm so you don't I love mushrooms here's hold on though two seconds also tomatoes on Pizza got we ordered pizza lunch today we had a sausage or no we had a pepperoni a cheese and a sausage Icey and then we also had a specialty pizza what do you think left everyone gets too creative with pizzas well that's got giant chunks of garlic on it it's amazing though have you had it good I'm going to eat it right now that I'm talking about this is the white sauce see this is the what pizza are we looking at from Goat Hill here what is this one the the Pork Boy boy I'm going to be real I give me a pork boy I said this during our Patreon exclusive talking about food places in SF and now I'll say it again Goat Hill what no it's good Goat Hill had three SLI that I knew it was",
            "start": 870.76
        },
        {
            "text": "me a pork boy I said this during our Patreon exclusive talking about food places in SF and now I'll say it again **** Goat Hill what no it's good **** Go Hill had three SLI that I knew it was pretty good I had three sizes pretty good you're crazy dude no man I don't **** with it I don't **** with it at all **** with all so what you'd rather have in your eyes hell yeah dude this **** sucks it's so thin and it like it's the bread I don't like the bread I don't I don't like this the flaky **** and like crust that's the BB the that stuff reminds me of Peter Piper Pizza back home in uh South Texas RGV 956 we don't play no games what's funny about that is you went ghetto with it but you also went in Texas with it you were like that's right there let me little steer that g up word up G that is what I said that's exactly what you said have you finished uh the Fast movie the pizza smells amazing I'm on I'm on part part nine man go and finish faor my favorite part of today is",
            "start": 914.72
        },
        {
            "text": "up Greg, that is what I said, that's exactly what you said. Have you finished the Fast and Furious movie? The pizza smells amazing, I'm on part nine, man, go finish it for my favorite part of today is during the morning show we made thanks Andy, Andy uh, we told Andy he has to spend the rest of the day watching all the Fast and Furious movies. About midway through when we were prepping for the show, I hear Andy go \"Oh, Paul, you got a bad start\" - you got a bad start there, Paul. He's getting into it, yeah, he's still watching number one, still early, it's beautiful fall, it's pure. If you didn't know this has been The GameOverGreggy Show each and every week, four sometimes five best friends gather on this table. I had to do a little soft one because I got a pizza piece in my yeah, you're good. Each bring a random topic discussion for your amusement. If you like that, head over to patreon.com/kindafunny where you can get every episode early along with a bunch of bonus stuff perks goodies. You can be like Tom Brady",
            "start": 963.2
        },
        {
            "text": "Discussion for your amusement if you like, that head over to Patreon.com Kinda Funny where you can get every episode early along with a bunch of bonus stuff perks goodies. You can be like Tom Brady, the pizza is making me salivate, I'm very hungry right. If you got no money to toss, no big deal, head over to YouTube.com/KindaFunny where we put up the entire show topic by topic day by day until it goes live on Friday. Until next time, Bon Appétit! Boner Appetito, see ya later. I did okay, thanks for watching this junk sucker, click that up there to subscribe and watch other videos. There, support us on Patreon, that's what you don't like the sucker thing, junk sucker, I it was a comment. I know I got seconds then over here, there's a special Kevin Cole surprise, maybe it's Paul's phone number, probably won't be though, I'll give you Paul's phone number, it's",
            "start": 1004.8
        }
    ]
}