{
    "id": 2530,
    "video_id": "kJHvQWErcF0",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Early Predictions For Xbox's E3 - Kinda Funny Gamescast Ep. 114 (Pt. 2)",
    "description": "We give our early predictions for Microsoft's E3 conference.\n\nThanks to Blue Apron for sponsoring this episode. Go to BlueApron.com/gamecast\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1491309001,
    "duration": 1852,
    "transcript_chunks": [
        {
            "text": "this episode of Kinda Funny Gamescast is brought to you by Blue Apron. Blue Apron is the number one fresh ingredient recipe delivery service in the country. The mission is to make incredible cooking accessible to everyone. Not all ingredients are created equal; fresh, high-quality ingredients make a real difference. So it's important to know where your food comes from. For less than $10 per person per meal, Blue Apron delivers seasonal recipes along with pre-portioned ingredients to make delicious home-cooked meals. Greg Miller, you might know the guy from his world-renowned Instagram series Cooking with GameOverGreggy; he's all about this Blue Apron goodness. Check out this week's menu and get your first three meals free with free shipping at blueapron.com Gamecast. You will love how good it feels and tastes to create incredible home-cooked meals with Blue Apron. So don't wait; that's blueapron.com Gamecast, no S in there. Blue Apron is a better way to cook. We can now move on to the topic of the topic.",
            "start": 0.08
        },
        {
            "text": "and tastes to create incredible home-cooked meals with Blue Apron, so don't wait - that's blueapron.com. Gamecast, no S in there, Blue Apron is a better way to cook. We can now move on to the topic of topic two, E3 predictions, ladies and gentlemen, yeah it's going to happen in June this show by the way, nobody knows when it is than you Salem Gamallam being producer, you are the man, the myth, the legend. I want to talk about E3 predictions and I want to put this out there now, this is this is our right now March 29th, yeah I want to have a first round let's start talking about E3 what we think is going to happen from a big perspective later obviously we'll do more in-depth we'll dive what's we'll take bets we'll make you know try to see what we think is going to happen. We should throw some things out there that we can loop back to as it were, that's where I'm at that's where I'm at and say did we get it did we not get it so all these topics that we're talking about today are topics that you have",
            "start": 37.0
        },
        {
            "text": "there that we can loop back to as it were that's where I'm at that's where I'm at and say did we get it did we not get it so all these topics that we're talking about today are topics that you have suggested to us over time that I've been bugging you about as the for just shooting them out like crazy like talk about this talk about this and so now like all right cool you're here so talk so E3 what I want to talk about is the press conferences specifically The Big Three Nintendo Xbox Ubisoft PlayStation oh PlayStation right sorry my apolog Ubisoft I'm sure we'll bring those guys up as well but I want to talk about what we think they're going to do at their conferences from a just overall because last year and this year very different Landscapes they were dealing with right last year Nintendo comes out they had their one game which was Zelda amazing booth for Zelda but nothing else yeah and people loved it yep game of the show from so many people but not us not us we love but yep um",
            "start": 100.24
        },
        {
            "text": "comes out they had their one game which was The Legend of Zelda: amazing booth for The Legend of Zelda, but nothing else yeah and people loved it yep Game of the Show from so many people but not us not us we love but yep um The Legend of Zelda that was their game they didn't even do a direct uh the previous years Nintendo's been doing directs their last E3 conference was 2012 if not 2013 maybe no it was 2013 because 14 was the first time they did direct we still at yeah so uh Sony comes out games games games they have to home run home run home run Grand Slam Sports references you have not you don't know how home runs home run if you do four home runs in a row that's a grand slam right yeah so there's that and then Xbox surprising everybody coming out and being like very solid very solid conference Scorpio blowing people's minds nobody expected that everyone expected PS4 Pro that didn't happen but getting technical on stuff Microsoft in there tera flops and all this ****",
            "start": 144.56
        },
        {
            "text": "conference announcement for Scorpio blowing people's minds, nobody expected that everyone expected PS4 Pro, that didn't happen. But getting technical on stuff, Microsoft in there, their flops and all this **** them flops, flops got to have them flops, man. Got to have the FL you talk about it, and that was the interesting thing right about both uh PlayStation and Nintendo right where they had to get out in front of those stories. Where Nintendo's like switch will not be there, and PlayStation's like we're not doing the pro stuff, like that's not what this is about. For remind me, we knew about we knew the Switch, we knew something was coming from Nintendo but we knew NX, we knew was we knew that NX would not be at E3, and we knew that Nintendo was only going to have one game at E3 gotcha. And so they they had Zelda in addition to that during their so they did their they released the Zelda trailer I'm going to grab a computer I feel like I'm going to need computer more historical information get yourself some data",
            "start": 201.0
        },
        {
            "text": "addition to that during their so they did their they released the Zelda trailer I'm going to grab a computer I feel like I'm going to need a computer more historical information get yourself some data get some knowledge it was the it was yourself up the first Zelda Breath of the Wild trailer where they revealed the name of the game oh that wasn't the first trailer they revealed the name of the the first trailer was a E3 2014 did they really show in that far back yeah it was 2014 yeah it must have been when we thought it was going to be Wii U forever so yeah it was a Wii U game The Legend of Zelda: Breath of the Wild came out and like Link jumped and shot the Guardian with an arrow yep so but we knew it was Breath of the Wild then and then they went on to do the Nintendo Treehouse all day the big daddy the the Treehouse all day where they they demoed Zelda and showed all the was that Treehouse awesome by the way like to see it from a from a distance looked oh phenomenal yeah they're they're so good at Nintendo 83",
            "start": 240.44
        },
        {
            "text": "where they demoed Zelda and showed all the was that Treehouse Awesome by the way like to see it from a from a distance looked oh phenomenal yeah they're they're so good they set me Nintendo 83 like the actual set is E3's lineup of PlayStation next to Nintendo is always such a beautiful thing their boots are awesome uh but they did announce a bunch of random 3DS games as well but that was like just during The Treehouse and it was like smaller titles here and there and like some Wii U stuff too but nobody gave a **** at all um literally right yeah so then then yeah there was PlayStation just straight killing it but yeah Microsoft was the one that was a bit more like they had a lot of the big AAA third-party games they had that Final Fantasy XV showing that was embarrassing um and then they they showed Scalebound they showed Scale got cancelled whole bunch of other stuff Sea of Thieves they did did they do I think they did a Crackdown teaser or was that the very end of it I want to",
            "start": 279.0
        },
        {
            "text": "They showed Scalebound, they showed Sea of Thieves. They did, did they do a Crackdown teaser or was that at the very end of it? I want to say they did which I'm still questioning. We haven't seen Crack in a long time, that's the thing. I think I don't think Crackdown was there last year wasn't I think they skipped I mean they they announced it one year and then they skipped and everybody was like where the hell is it? So that must have been anyways getting to it now predictions what do we think is going to happen this year where do you want to start, Craig, wherever you want to big guy let's start with Microsoft okay let's do that. I think they open and they have they come right out with Scorpio uh top of the show do they tank us to death I mean I think it's one of those things that there's an argument to be made either way in the fact that hey 2016, I can't remember what year.",
            "start": 327.72
        },
        {
            "text": "Scorpio uh top of the show do they Terra flop us to death I mean I think it's one of those things that there's an argument to be made either way in the fact that hey 2017 doesn't look great for Nintendo or Xbox exclusives right like what are we talking about and that's been the thing when Scalebound went away right it was like don't no don't worry there's State of Decay 2 there's Crackdown and it was like well sure like you know Colin was right about it where it was like yeah well Greg's excited for State of Decay too I don't it's not that's not a Halo that's not that's not an anything like what we've seen with Sony's first party stuff here in the last little bit yeah not even close and so that's the thing of like I think you come out and while that press conference has to address the fact of hey there are still games this year I think you lead with the biggest story you have of like hey here's Scorpio",
            "start": 366.28
        },
        {
            "text": "I think you come out and while that press conference has to address the fact of hey there are still games this year I think you lead with the biggest story you have of like hey here's Scorpio and here's what it is and there's an argument to be made to put it at the end of the show and make a big deal about it but that's how they ended the show last time you got to think that not to interrupt you but you got to think that they they had to have learned from the initial Xbox One launch event yeah that was that really you know didn't didn't go the way they wanted and given the home run that Sony hit last year with games, games, games, games, I mean that whole press conference was wall-to-wall sure you had I mean that yes you want to talk about the new hardware but I got to think Microsoft's figured out that this is the time to talk about games too sure but I think they go hand in hand I think they go hand in hand cuz I think you come out and you're like Scorpio, this is why we've been",
            "start": 405.92
        },
        {
            "text": "figured out that this is the time to talk about games too sure but I think they go hand in hand I think they go hand in hand cuz I think you come out and you're like Scorpio this is why we've been quiet this and then you even Market it this way like this is why we've been quiet about what games are happening this year we're going to show you all these different games yes play on Xbox One and play are better on Scorpio I think that it needs to be the kind of the actual good parts of the Nintendo Switch January conference they did like the few good things the non campy straight right like that conference was so bad but again I always say that the announcements made in it were not bad specifically starting that conference off hey switch is coming March 3rd sooner than anyone thought it was coming Cal C weirdness right that's it but if Xbox comes out and it's just like Scorpio is this here's how much it costs here's the date it's coming let's talk about the games you're going to see I",
            "start": 445.56
        },
        {
            "text": "coming Cal C weirdness right that's it but if Xbox comes out and it's just like Scorpio, here's how much it costs, here's the date it's coming, let's talk about the games you're going to see. I wouldn't be surprised if they totally dodge the price save the price for the end of it or save the price for a event because I think that the big rumor and the thing about this is going to be super expensive because it is going to be the it's going to have awesome guts in it, I I can tell you from just the industry that I'm in component parts are really going up a lot, I mean they're they're going to be challenged to put this box out at a reasonable price, I mean it's going to be an expensive product, I mean what what they're trying to put in this thing, this is a genuine it's a PC, it is a very I say high-end it's a mid to Upper range PC it is and so it gets into the we this is where it gets into the weeds of since it's not a new console even though I on the show before I predicted",
            "start": 485.96
        },
        {
            "text": "a very I say high-end it's a mid to Upper range PC it is and so it gets into the we this is where it gets into the weeds of since it's not a new console even though I on the show before I predicted I think maybe it will be maybe they will ditch all that stuff my I don't even know where I sit anymore on those predictions what is Scorpio now now now that the PS4 Pro is out and now that we're getting these rumors and we know they're going to hit hard at at E3 I I honestly don't really know I feel kind of 5050 about the you know the rumors about Scorpio that were leaked I would say what in the last three to four months but then were from documentation at the reveal of Scorpio XIII we're saying basically it is PlayStation 4 Pro before we knew what PlayStation 4 Pro was it was doing the checkerboarding thing it was doing so like it's this weird how do you handle it and how do you learn from what Sony has and not even **** up right cuz you guys have pros and you're super excited when my",
            "start": 519.12
        },
        {
            "text": "\"Thing it was doing so, like, it's this weird how do you handle it and how do you learn from what Sony has and not even **** up right? Cuz you guys have pros and you're super excited when my PlayStation dies. I buy a PlayStation CU, yeah. Of I want the version I want the version. I'm just not motivated to run out and buy it. What have they learned from that? And I think that's why it has to be here's what the Scorpio is, here's how this is the teraflop thing. Let's look at 13 games that are coming to the Xbox One and the Scorpio but are better on Scorpio. Hope they demo it. I mean, that's the issue with a lot of that technology - it doesn't demo well. It doesn't... I mean, it's the same challenge VR had, it's the same challenge HDR has, it's the same all of it unless you have the right setup to see it. It rings really hollow like it. You don't get it so I think I think they I think Microsoft's got to walk a really interesting line of they have to hit the hardware because that's what looks good.\"",
            "start": 560.2
        },
        {
            "text": "see it, it rings really hollow like it, you don't get it, so I think I think they I think Microsoft's got to walk a really interesting line of they have to hit the hardware because that's what they're trying to go do, they need to sell consoles, they need to kind of get back yeah I mean they've got to get people excited about the Xbox brand again and that's where that's where there's this disconnect on how this is going to be handled if I'm there and I'm doing it I'm getting you excited about Scorpio so I'm opening with Scorpio and I'm saying Scorpio is this next Revolution it does all these different things look at all these different games blah blah blah blah blah if they're coming at it and they're thinking it is an incremental step it is like PlayStation 4 Pro then yeah you put that later mid in the conference somewhere I don't know man but I don't think you can do that yeah because everyone's expecting you to come if you don't hit it right away it's going to be a lot",
            "start": 601.48
        },
        {
            "text": "put that later mid in the conference somewhere I don't know man but I don't think you can do that yeah because everyone's expecting you to come if you don't hit it right away it's going to be a lot of people looking at their watch when are they going I I think what does it mean for these games that I'm seeing yeah I think it's somewhere in between the two where I forever thought that it was going to be the next Xbox system like like they're saying whatever the **** they want this is the Xbox 2 or whatever or just go back to calling it Xbox whatever it is right but I the the closer we get to this and where I'm at right now I do think that this is just a better PS4 Pro like I think that they'll be able to come out and say we have the most powerful system but if they don't hit that head on that's a problem because PS4 pro has been out for how long now and if they just say this is we're just playing catchup I mean but that's thing they can say whatever they want right so all they need to",
            "start": 636.36
        },
        {
            "text": "a problem because PlayStation 4 Pro has been out for how long now, and if they just say this is we're just playing catchup. I mean, but that's a thing they can say whatever they want right? So all they need to do is be stronger than the PS4 Pro to be able to say we're the strongest right? So that could be the thing they do with games though; they have to do it with games still. But what I imagine happening is they come out, they announce this thing, and there's an announcement at the beginning. You think I... I do think that like yeah, I mean that does make sense. But they come out, but I wouldn't be surprised if they come out with a price of $400 really. Yeah, and I'm putting this out there just being like I feel like they have to put it on the table first say we'll make a bet when we're closer, but but I bet you an Xbox Scorpio that where I'm at right now, I think that the Xbox One is a $400 product that is incrementally better and it is going to be stronger than the PS4 Pro, but it is still just just",
            "start": 672.32
        },
        {
            "text": "an Xbox you a Scorpio like where I'm at right now I think that the Xbox One is a $400 product that is incrementally better and it is going to be stronger than the PS4 Pro but it is still just just an incremental console 500 guys that's a big for for the non for the losing team that's a that's a tough and that's the thing I think that I think this might be like a PS3 situation where you they have to sell it at a loss they have to try to make up ground you know what I mean fine well like I'm saying you know PlayStation cut their price before they were able to do that here just cut it out the gate and be like yep we're doing this we have to we have to make it up and we have to make excd and we have to go do this thing and the fact that the switch was $300 I don't think 400 is that crazy and I think obviously people on the inside are going be like oh that 400's so cheap it should it's we think it's going to be 600 700 but like I just don't see that working out unless it is a brand new",
            "start": 712.72
        },
        {
            "text": "I think obviously people on the inside are going to be like, \"Oh, that $400 is so cheap; it should be $600 or $700.\" But like, I just don't see that working out unless it is a brand new console, and at this point, I don't see Xbox doing that. But getting into we're talking about games are necessary, what are those games? Because I do think that we're going to see Halo at E3. I think it's not going to come out this year, and it's I think it's going to be a late 2018 game, but Halo will be at E3. So what do I mean? First of all, what do we know is first-party end-of-the-year? What are the big Cornerstone games they can hang their hat on? That's the problem right there: is that we don't know because it is Crackdown; they've said Crackdown is coming this year. They said Star Wars is February... like, that war already came out. Came out. Oh, did oh god what the **** month I know Jesus Christ. You're 100% right, my apologies. You and I were like, \"It's Fe\" Jesus Christ, this year.",
            "start": 752.44
        },
        {
            "text": "Halo Wars is February like that war already came out, came out. Oh did oh god what the **** month? I know Jesus Christ, you're 100% right, my apologies. You and I were like it's Fe, Jesus Christ this year. Love Sunset Overdrive, one of my favorite games, that's why you're Spider-Man but there, that can't be close if there is a they're not going to do yeah right, yeah. Um so I don't I don't know what I mean. They have to show Halo there in that ve if I had if I Forza, I mean they're they're going to have some there's going to be Forza there's going to be cars everywhere, sure for Horizon but but with Halo I if I had to bet I would bet that they announced Halo 6, whatever that is. Um and and have some kind of playable demo. I imagine they were that they if I'm doing my math right yeah I am. Halo 3's 10th anniversaries this year they will do a a Halo 3 update in the same way that they've done um The Other Guys Master Chief col so Halo 3, I mean Halo 3 was part of the Chief collection but I think that they",
            "start": 795.4
        },
        {
            "text": "this year they will do a Halo 3 update in the same way that they've done The Other Guys Master Chief collection, so Halo 3 - I mean Halo 3 was part of the Master Chief collection but I think that they'll do remastered like focus on it let's add some tools right and I think that will either have a beta or some form of something for Halo Infinite and that'll be this year and then the beta will be there's really nothing I mean think of that's a pretty weird spot for Microsoft to be in Cuphead just before E3 to not have I mean think of Sony's they had a stable of games some of them were I mean last I mean Xbox is a third party when it comes to uh their conferences they've always done that so Assassin's Creed maybe they pull that in they pull the new Assassin's Empire Far Cry 5 is there a those type of games I mean obviously Ubisoft has its own conference but they pulled those in in the past and done fine with them so yeah but there's got to be some I mean there here's my bet they are going to",
            "start": 847.92
        },
        {
            "text": "Type of games I mean obviously Xbox has its own conference but they pulled those in in the past and done fine with them so yeah but there's got to be some I mean there here's my bet they are going to announce something big that'll be Bethesda style Fallout 4 style where they'll have a big game that'll come out this year there'll be something I have no idea what it will be cuz I was kind of going through as I was getting ready like what stuff haven't we heard about and I feel like the Halo 5 Anniversary is don't they have to I mean they have to have something I mean that's I'm you're Maybe I'm Wrong they have to do something though they no you you think that they do especially for Scorpio this is this game this is what's going to look amazing on this what it's going to be why else are you but it's in like you can make an argument with the Crackdown could be that and that's why you haven't heard from Crackdown is that they're doing Scorpio stuff to it um which is could that move",
            "start": 900.2
        },
        {
            "text": "you but it's in like you can make an argument with the Crackdown could be that and that's why you haven't heard from Crackdown is that they're doing Scorpio stuff to it um which is could that move the needle that far though I mean that I don't think Crackdown is that big of a franchise cra but I yeah we all love to jump around and **** grab orb Halo. Halo is the answer when it comes to this conversation and I I just I don't think I think that a new Halo on Scorpio pushed the right way and talked about the right way with a Halo coming this year to satiate people's needs I think that is big enough because that is what Xbox has like they have Gears they have all I mean I'm sure we'll see some Gears DLC Gears was good by the way don't you played Gears Gears was good I'm not Gears guy but yeah it was good it was good but I mean the thing is they already had that so it's like what what other big franchises does Xbox have Halo 5 2015 November so it's years so that's what I'm saying Halo's",
            "start": 946.08
        },
        {
            "text": "It was good, it was good, but I mean the thing is they already had that, so it's like what other big franchises does Xbox have? Halo 5, 2015, November, so it's years, so that's what I'm saying. Halo's gonna be there. Yep, October 27th, 2015. Yeah, and can you look up Halo 3's release date right there? September 2nd, 2011. They're going to have to lean heavily on third-party titles. I mean they've got to fill an hour and a half. They better not come out and just show hardware specs. Here's all the other non-gaming stuff that Scorpio can do. They've made that mistake again. I don't want to say it's a mistake because they're well-intentioned people who know their business way better than any of us do, but they've got an hour and a half to fill. They're going to have to come out with some you figure beefy announcements. They've done announcements of some indie games, yeah. That's the thing - it's not like the PlayStation has given up on the indie ground by any stretch of the imagination.",
            "start": 984.8
        },
        {
            "text": "Come out with some you figure beefy, they've done announcements of some. Yeah, that's the thing - I'm not saying they've given up on the PlayStation's ground by any stretch of the imagination; they still are the place to go. But like Xbox has made a big deal about Indies Forever at GDC. There was an Xbox indie event where I played Church in the Darkness and a bunch of other stuff. Um, when you go to PS, they have their off-site thing back at E3 - all I mean is it's a big part of their show. You assume that yeah, there are tent poles, and you can have it's just that I'm pointing to aren't your traditional tent poles of Crackdown and State of Decay 2 and Sea of Thieves, and then Halo. Sure, Halo's on another level if they do all that Halo stuff. If you can give people those signposts and then fill it in with and here are these great Indies and here are these amazing things here are",
            "start": 1028.24
        },
        {
            "text": "Sure, Halo's on another level if they do all that Halo stuff. If you can give people those signposts and then fill it in with great Indies and here are these amazing things, here are these plans for games to actually come out that are exclusive and you can't get these experiences anywhere else. Looking at this list right here, something interesting that I hadn't thought about is Perfect Dark. Yeah, now Perfect Dark - it's been way too long since we've seen one. So it's not the Juggernaut, not that it used to be sure, but it still has that name and that has a comeback like \"Oh, this is happening.\" Feel that is bigger than Killer Instincts that they have and they've been treating really well and kind of growing over the last couple years. But if we got a strong developer to come out and be like, \"We're doing a new Perfect Dark and we're doing it and we're really... yeah, yeah, we've been working on this a long time and it looks better.\"",
            "start": 1067.4
        },
        {
            "text": "but if we got a strong developer to come out and be like we're doing a new Perfect Dark and we're doing it and we're really yeah yeah we've been working on this a long time and it looks better in Scorpio and it feels to me like could be that could be very cool it just seems to me like especially in the last I don't know maybe four years there have been so many good press conferences and so many bad ones they all learn from each other right and I feel like this is the year where all of the things that people have learned are you know there's not going to be any mistakes anymore as far as totally missing the market but it's not even that thing of mistakes it's the fact of like on Crackdown State Decay awesome a Halo thing great but is that enough is that enough so that's why you got to hang your hat on Scorpio is this Revolution and then let's look at the developers we've partnered with and we have some kind of like you know where do they get their clocks cleaned it seems like",
            "start": 1107.36
        },
        {
            "text": "To hang your hat on Scorpio is this Revolution, and then let's look at the developers we've partnered with. We have some kind of like you know where do they get their clocks cleaned? It seems like there's always exclusive content this generation for PlayStation, so what do you have for you know? We have some deal with the next Battlefront, you know what I mean, like we're out there doing something into this yeah but yeah yeah matter those things you know they do add up here and there. But it's a here and there, it's not a change the game now Game Changer thing. The thing with Halo is it's been around for so long and it's had you know the five core titles ODST and Reach in addition to that, so that's that's six full games right? No sorry seven full like full real proper Halo games, five regular and then the two, and then of course there's the Halo Wars total totally different type of spin-off. I think it could be time for another Halo property that's not a Halo game you know that's",
            "start": 1150.48
        },
        {
            "text": "and then the two and then of course there's the Halo Wars, totally different type of spin-off. I think it could be time for another Halo property that's not a Halo game, you know, that's not what you think of first - set in the universe, different style of game. Whether it's an Uncharted-style game, which could be crazy cool, or something more Mass Effect-style, that's a bit more RPG because they went that way with all the TV stuff and they hired lots of big studios. I mean, they were going that way is awesome and people love the characters and they've started this arc with Halo 4 and five where they're moving past one two and three, built off and there are now all these different characters and classes and all this stuff and I think that the world is ready, especially now that Bungie's moved on to Destiny. Like 343 knows what they're doing with Halo and it is getting a bit stale, but the people that love it still love it, but I do think that Halo as a property can bring",
            "start": 1191.88
        },
        {
            "text": "now that Bungie's moved on to Destiny like 343 knows what they're doing with Halo and it is getting a bit syy the people that love it still love it but I do think that Halo as a property can bring back so many people that left and it can also bring so many new people in if they're just they're like hey this is different think the pitch sells itself if you come out and this is the Star Wars: XIII 13 uh Halo you are somebody else you're not a Spartan you're not in that part of the world you're Bounty Hunter whatever you're doing these different things going there the other thing that queued in my mind while we're talking about this um when we talk about something they could have stick with me because again I don't think this is that big of a deal based on how Xbox it's performed on Xbox before we we know in quotes of Shadow of the Tomb Raider what if Shadow of the Tomb Raider they reveal that there and it is once again it's this Xbox deal you can only get it here for this first year again",
            "start": 1236.56
        },
        {
            "text": "We know in quotes of Shadow of the Tomb Raider, what if Shadow of the Tomb Raider they reveal that there and it is once again it's this Xbox deal you can only get it here for this first year again not going to be the tent pole in the way of like that's going to sell a **** million units but hey we've got this we got quality game yeah what gets more interesting too is think about this okay they revealed at the PlayStation event or which one was it was it was E3 last year yeah E3 last year they reveal Spider-Man right did Xbox immediately run to Marvel and like oh you're doing this let's something Bill Let's Do Something Mike let's do something Marvel games these Marvel games people if you don't know what do you have that we could do and who we partner with and can we get one of our Studios doing it or another second party Studio to go off and make our thing and again it's similar to and you've got the I mean the movies are right I mean there's couple coming out here with",
            "start": 1275.36
        },
        {
            "text": "Studios doing it or another second-party studio to go off and make our thing, and again it's similar to the movies. I mean, the Avengers game is right; there are a couple coming out here, with one on PlayStation, I'll check uh but yeah, that's a really solid point. Like what if there was a potentially Guardians game that is rumored Square is doing, that isn't an Xbox thing? That's a great point. Yeah, it's Square Enix has announced the Marvel thing, which goes back to my point of course. With there being there's going to be some big announcement; I mean, I just feel it. There has to be there's just not enough here, I think otherwise for them they're going to have to come out with something. I mean Phil.",
            "start": 1319.32
        },
        {
            "text": "there's going to be some big announcement, I mean I just feel it, there has to be, there's just not enough here, I think otherwise for them, they're going to have to come out with something. I mean Phil Spencer is a gamer right at the core of that guy is a gamer, they know what they need, so I can't imagine this doesn't go something big, game-changing. I mean think of The Last Guardian, watch and it was this and it was that and when they finally did it, I remember, I think it was the year I'm a big Portal fan as well, that announcement was so awesome at E3 2010, I was there, I was at the conf, that was my first conference ever moment. Then again, for everybody huge, and again I feel like they've learned from Sony's moments where something",
            "start": 1363.96
        },
        {
            "text": "Conference ever moment 2010 then are like for everybody huge and again I feel like they've learned like everybody's watched this and seen it they got to have one of those moments where something is kind of a mind screw, crazy something. Those moments are just you remember them forever, yeah right like I'll never forget that glad like oh my God they totally nailed this like this is a perfect way to announce a game right it was I don't know and then they end that conference with JD Maddox riding out on a sweet tooth after you lie to our face. J David did you see that that's gonna be one of the free games, oh yeah Drawn to Death got announced a while back, yeah that it's going to be that's how they're going to do it wow that's amazing to me that a brand new game comes out right out of the gate as a free to play well for Rocket League yeah it worked for Rocket League it's impressive because like usually no offense",
            "start": 1409.56
        },
        {
            "text": "that's amazing to me that a brand new game comes out right out of the gate as a free to play well for Rocket League yeah it worked for Rocket League it's impressive because like usually no offense it's usually smaller games smaller Indie things that are getting out there right or not even Indie but second party and so yeah for them to do this with it's interesting and I think it'll be interesting have you played it no yeah yeah I played PSX that debut i it's what I always think with drawn to death is that it's totally a game that shouldn't speak to me on paper but playing it I was like oh this is fun and it's the same thing where like car combat you know usually isn't my thing but I L calling all cars you know Greg has something there he knows what he's doing multiplayer wise and so I'm interested to play the final product and see it and it'll be very fascinating to see if it it's not going to be rocket league but that hey we made here's this game that you've heard about for way too",
            "start": 1450.08
        },
        {
            "text": "interested to play the final product and see it and it'll be very fascinating to see if it it's not going to be Rocket League, but that hey we made here's this game that you've heard about for way too long for way too long that has been way too confusing cuz it was free to play and now it's not free to play but now it's just free-to-play you got it you already you're paying online right why not why not play this game online why not  does it does it seem like like what I only play one online multiplayer game DC Universe Online Battlefield okay my apologies it's the one that I've kind of because they're so freaking complicated not that one's Star Wars have fun yeah right no I mean the battlefield the the the battlefield yes not Battlefront Battlefield right which is really can be really like Battlefield 4 insanely I mean that that Community is really serious right but most of those games are not any fun because people spend thousands of hours playing them right and jumping in",
            "start": 1486.48
        },
        {
            "text": "really like Battlefield 4 insanely I mean that that Community is really serious right but most of those games are not any fun because people spend thousands of hours playing them right and jumping in and going 0 for 60 is not fun to get your ass kicked from every corner by people who just have learned that's why I can't play Call of Duty for more than 10 minutes does it have any of that is it more rocket league in the sense of it's casual and can be fun you don't put hundreds of hours into it that's the thing is I never jumped into the Beta and did any of that jazz you know what I mean so like I was just playing against people at PSX who didn't know what to do and that's the same way I played rocket League where I loved rocket league and then rocket League gets out and it's just like well I just went you know 22 and0 so this sucks uh I don't know how it's going to end up being in terms of that it seems like it's going to be pick up and play a run around and do it maybe you know with",
            "start": 1526.8
        },
        {
            "text": "I just went to 22 and so this sucks, uh, I don't know how it's going to end up being in terms of that. It seems like it's going to be pick-up-and-play, a run-around, and do it maybe you know with private matchmaking you'll be able to have more fun and keep it that way but we'll see. Yeah, yeah, you got me sold on this Greg. A Marvel game so far with me clicking around, it looks like Avengers Project has no platforms announced now I doubt that'll happen. I think Avengers everywhere, but then again if you would have told me they're putting on a Spider-Man game, I would've been like \"oh, it's going to be everywhere.\" All right, so that's interesting. Is there any last thoughts on Microsoft or Xbox? This is what I love about people - I hate when we go into E3 and people are always like \"what are you most excited about?\" And I'm always like \"I'm excited about not knowing,\" and that's why this episode is one of the things where us being like, \"not know year yeah, we're like...\"",
            "start": 1562.08
        },
        {
            "text": "Most excited about right, and I'm always like I'm excited about not knowing, and that's why this episode is one of the things of us being like \"not know\" year yeah we're like \"I don't know what the **** they're going to do but they need to do something.\" And I think that as you said, that's profound by the way. I don't know what you need to do, but you need to do something. Phil Spencer gets that the ID at Xbox team gets that the people who are going out making these third-party Partnerships and second-party Partnerships get that. And so I do think that yeah they understand where they're at; they understand that they've gotten their ass kicked this generation. Here's Scorpio, here's why you need it, here are these amazing games, and yeah hopefully here are these franchises announcements and Partnerships you never expect it. So Xbox two years ago backward compatibility boom - that was a big deal. Xbox Game Pass now I think do you think that they have something like that or",
            "start": 1601.12
        },
        {
            "text": "You never expect it so Xbox two years ago backward compatibility boom was a big deal for us. Now I think, do you think that they have something like Xbox Game Pass or maybe iterate on Game Pass a bit more at E3? They'll probably say we've had a really exciting year and everybody loves Xbox Game Pass, and let's talk about the games we're adding to it right now. You know, we're putting up and having this real thing I think with Scorpio. There's an opportunity for the Best of Both Worlds where you don't do the Xbox One thing and look at all the different things you can do that aren't video games. It's the opposite where it's like here's this new system, it's the best place to play games. Speaking of playing games, you can play a ton of games best on Scorpio using the Xbox Game Pass, which has this built-in library once you get it, and the stuff that they figured out that we always kind of crack on Nintendo for.",
            "start": 1635.28
        },
        {
            "text": "a **** ton of games best on Scorpio you using the Xbox game pass you have this built-in Library once you get and the stuff that they figured out that we always kind of crack on Nintendo for that they I bought the same **** game 50 times because they have no idea how to do DRM and they have I mean Xbox figured that **** out forever ago right so they so they they could yeah absolutely come out and do that the other big thing that we're not talking about because they have to have some kind of announcement some kind of partnership whatever and this is one of those flip of the coins up in the air who is going to have red dead o will will someone have red dead I think they'll be exclusive content some kind of Red Dead I think if Microsoft wants to make waves they have a they have a trailer there they do something rockstar that way and that's the thing rock rockstar knows they don't need them but it is that thing of like what if they they've done exclusive content they've done windowed",
            "start": 1674.12
        },
        {
            "text": "There they do something Rockstar that way, and that's the thing. Rockstar knows they don't need them, but it is that thing of like what if they've done exclusive content? They've done windowed things like that. No, not any so that's what I'm saying. Like I know when do we think Red Dead is though? Let's look at Red Dead. Does it come out this year? No, I wish. Don't get me wrong, I wish. I know that's what we're all talking about, but it's just one of those things - I can't see it. This goes back and forth to where like when we're talking about like Persona, and people like it's on their website the release date. I'm like games move all the time. My game moved 15 times in the history of Grand Theft Auto 5, and exactly. And that was the thing - Grand Theft Auto 5 was like here's what it's coming out, and that slipped you know what I mean? Like I would love Red Dead to come out this year. I don't know, dude. I mean the thing about Rockstar that's blowing my mind too, and I... I love GTA 5 as",
            "start": 1712.68
        },
        {
            "text": "that slipped, you know what I mean? Like I would love Red Dead to come out this year. I don't know, dude. I mean, the thing about Rockstar that's blowing my mind too, and I'm loving GTA 5 as everybody did - they're still releasing stuff, however far past this has been, and not just little play things like genuine completely new modes. I mean, they pour so much money after the fact into games from a and it's not even really DLC; it's just they just keep going. Well, I mean, like that thing is a cash cow - the people who play that game don't stop playing that game; they never stop. It's insane to even watch on Twitch, and to see. I mean, so I think Red Dead is easily a year off, and that, and that's the biggest thing about it - it's not even it's the business acumen of like they have no reason to rush this out, and so as with any other game, let alone a game following up on a master piece you're going to sit there and be like well we could do this better, we could do that better, well and the",
            "start": 1749.28
        },
        {
            "text": "\"Rush this out, and so as with any other game, let alone a game following up on a masterpiece, you're going to sit there and be like, 'Well, we could do this better. We could do that better.' And the Rockstar rush they have that ability - be like, 'We don't need it. Don't worry, there's nothing about Rockstar that indicates releasing anything quickly early.' So it'd be nice. And as much as we every year it's always like, 'The Rockstar doesn't do 13,' but maybe this year. And that's the thing - is like again I think Xbox isn't quote unquote desperate enough, but they understand they need to make waves, they need to punch this thing in the face, they need to make everybody go, 'Ho **** Xbox, that would be a punch.' Yeah, and if they're like, 'Hey, we get DLC early or whatever,' I mean it looks best on Scorpio. They're working part and parcel with us to make this game better. Let me hit y'all with some of that sweet nasty nasty - if you click right here, you can subscribe to YouTube.com/KindaFunnyGames for way more of\"",
            "start": 1791.64
        },
        {
            "text": "working part and parcel with us to make this game better let me hit y'all with some of that sweet nasty nasty if you click right here you can subscribe to youtube.com/KindaFunnyGames for way more of this content click here for way more just other kind of funny content like I don't know the morning show in GameOverGreggy you can click here for patreon and Bam you're giving us money we can do cooler stuff Andy Cortez can have a clone",
            "start": 1832.08
        }
    ]
}