{
    "id": 2577,
    "video_id": "Kxbvi4bN5c8",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Lorne Lanning Doesn't Believe In The Nintendo Switch - The GameOverGreggy Show Ep. 177 (Pt. 1)",
    "description": "Lorne Lanning does not believe the Nintendo Switch will succeed.\n\nThanks to Pro Flowers for sponsoring this episode. Go to http://www.proflowers.com and use promo code greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1493017202,
    "duration": 2687,
    "transcript_chunks": [
        {
            "text": "if I'm lying, I'm dying; The Pro Flowers I talked about last week are still alive, and it's been like 3 weeks. I have no idea how they're still going, so why not show some love to our sponsor Pro Flowers right now? Pro Flowers has a special offer just for you: get $10 off your purchase of $29 or more. To snag this deal, just go to proflowers.com and enter the code Greggy at checkout. Are they beautiful? Yes. Do they smell great? Yes. Do they live forever apparently like 3 weeks I'm not joking. Do yourself a favor and support our show by supporting Pro Flowers. There has to be a bee in your life that needs flowers or a person. Get $10 off your purchase of $29 or more at Pro Flowers. Remember, cuz I had the whole bee joke last time; last time around, I did the bee joke, I cut it out of all the other references except there. So just go to proflowers.com and enter the code greggy at checkout to get this special deal. If the flowers never die and take over my house, know that I die doing what I love getting",
            "start": 0.12
        },
        {
            "text": "except there so just go to ProFlowers.com and enter the code greggy at checkout to get this special deal if the flowers never die and take over my house, know that I'd be doing what I love getting asphyxiated by those flowers. What's up everybody? Welcome to The GameOverGreggy Show. I'm one of your hosts, Greg Miller, alongside our producer Nick Scarpino. We've got two Red Bulls in, maybe going for a third now. Talk to me about the Red Bulls again - you haven't had a Red Bull in quite some time, and here you are, no what happened? I've been gone for a while. We have a special guest, yeah, Lorne Lanning's here. Every time he comes over, he's like \"I'm like, would you like something to drink?\" We have only coffee, water, and maybe a soda, and he's like \"How about some sugar-free fruit Red Bull?\" And I'm like, \"You sir, are a champion.\" So did you bring them or did they just magically appear? Like, we got a whole bunch of people here working; they can send",
            "start": 43.32
        },
        {
            "text": "you sir, Champion, so did you bring them or they'd them and they magically magically appear like we got a whole lot of them in there now we've got a whole bunch of people here working they can send people out for anything we want it's really crazy you want a poodle Andy Cortez will go get your poodle that's what's weird about that uh we were commenting poke me again oh my God we were all sitting in the back room there now that we've moved back there we're the old people and we heard alling and I'm like wow they have a whole life of their own in there Kevin really need us anymore so we have to destroy them is what I'm thinking I'm thinking before they get too powerful we have to destroy them no it's it's awesome that they have their own life over there don't shake your head Kevin I can see you doing that don't be doing that oh getting blue over there uh of course joining us as always the pure one Tim Gettys that's most you're one day away from your first beard trim I'm",
            "start": 96.44
        },
        {
            "text": "Kevin I can see you doing that, don't be doing that. Oh getting blue over there. Uh of course joining us as always the pure one Tim Gettys, that's most you're one day away from your first beard trim, I'm excited professional. I'm going after Nick has recommended this a thousand times maybe for me to go to the people's Barber yeah do one of them douchebag Barber places super hipster Barber places now I hope you got the I don't know the person you're you're getting the cut from she has an amazing name I don't remember what it was but it was something like Destiny well hopefully she gives you the attention that you deserve because the thing I love most about these I don't know if you've ever been to Professional Barber before but they do they give it the hot towel with the Menthol they rub the face it's like it's very pampering for but in like a manly way so you don't feel emasculated by it same way like Portmandian yeah p yeah exactly exactly in rounding out the Forsome today the Legendary",
            "start": 137.44
        },
        {
            "text": "Lorne Lanning doesn't believe it's very pampering for but in like a manly way so you don't feel emasculated by it same way like Port Manteau, yeah, p, yeah, exactly, exactly, in rounding out the form some today the legendary game developer but more importantly a man who two years ago was on this very show Lorne Lanning yes, it's great to be here again thank you for having me guys thank you my condolences I can't for having me I can't believe it's been two years since you're on the show I know because we of course Fast Friends you and I in the whole group you you fit in with everybody you and Nick were out there just yucking it up like you guys having a great time but I think about when you were on the show and you did The Burning Man topic and we were in the spare bedroom life changing but then you better you've been such a such a supporter of us you show up and you do the E3 shows with us you come by when we have parties you hang out you're a bro well thank you why don't you know that oh right on like you a lot",
            "start": 172.36
        },
        {
            "text": "such a big supporter of us, you show up and do the E3 shows with us, you come by when we have parties, you hang out, you're a bro. Well, thank you. Why don't you know that? Oh right, I like you a lot, man. Yeah, I'm feeling it good. Okay, good. And you guys give us exposure, so I'll pimp myself everywhere. Alright, cuz you make this game called Oddworld, right? That's the thing that's happening there. A new one is coming up, right? That's where my life has been. Yeah, you can tell last time I was on a show, I had hair your color. Yeah, you look like you've lost weight by the way. I did lose 20 pounds because the last time to deliver the last game, I had to go live in England. Try staying thin in England, really? Heard the opposite, I've always heard that England's bad for that. Well, yeah, but they do have fish and chips. Would you like fish and chips for lunch or uh blood pie? I'll take the fish and chips. Blood pie is blood sausage and pork pie, it's like a pot pie with pork in it.",
            "start": 212.2
        },
        {
            "text": "would you like fish and chips for lunch or uh blood pie I'll take the fish and chips blood pie blood sausage sausage and pork pie pork P is like a pot pie is it like a thing with pork in it like a gel oh like like I don't know calories by the million per spoonful or something like I just I watched the talk that I did at uh gamescom or something back when I was at there I was like oh my God I was huge yeah yeah not in the right way literally CR crank up the microphone he could not get closer to the mic right now guys come on all right all right I'm with you I'm with you Kevin we understand you're doing your job we're not mad at you we love you very much all right take a breath Kevin thank you for the correction Kevin thank you very much Kevin is my voice now good yeah okay Nick you're also wearing your Beat Cop shirt for the first time since the Beat Cop let's play I am I just wanted to remind myself that we did that that was probably um that's either high or low art I'm not sure",
            "start": 252.6
        },
        {
            "text": "also wearing your Beat Cop shirt for the first time since the Beat Cop let's play I am, I just wanted to remind myself that we did that, that was probably um that's either high or low art, I'm not sure which one is yeah had a great time doing that I I wore it today um to pump myself up for the other let's play we did this morning oh sure yeah get ready for that felt like it a little low energy listen to some AC/DC on the way over on my third Red Bull Now red the problem is I mean what time it's Lorne's been here like 45 minutes how have you how are you on your third red this is my second I apologize I'm going to go for a third though he's already vibrating so quickly remember when we used to work at IGN they used to sell they had the Red Bull machine the problem I haven't had a Red Bull since oh man and I used to go around when I really needed one this is back when I used to smoke and there's nothing better than a red a sugar-free Red Bull and cigarette that go all together for a dollar I would",
            "start": 301.6
        },
        {
            "text": "man and I used to go around when I really needed one this is back when I used to smoke and there's nothing better than a red sugar-free Red Bull and cigarette that goes all together for a dollar I would go and I'd be like I don't have a dollar cuz who carries cash anymore so I would have to beg people in the office for like quarters to make the dollar and then I would realize I don't have any cigarettes left so I'd have to go bum cigarettes basically I was a big bum is what I'm trying to tell you okay yeah you're in right town pretty much right they take care of you here give you cell phones Greg had a little thing of quarters I did have a thing on my desk my change there was a whole bunch of times I'd be I'd call you and be like hey can I take one of your quarters like yeah sure yeah just do it I hate change hate paper money I hate change can you believe that some of these you know parking meters are still change based no one will give you change stores they want that don't trust",
            "start": 337.84
        },
        {
            "text": "just do it I hate change, hate paper money. I hate change. Can you believe that some of these parking meters are still change-based? No one will give you change; stores don't trust you. My wife has cash every once in a while, and I'm like, \"I don't.\" It's like it's befuddling to me: how do you have $320s? I don't understand how that works. Like she'll open up the wallet – you know, the big, beautiful one she has – and like, what are we talking about? Mean, I don't even have a wallet; I don't carry cash on me. I just carry like four cards with me in my pocket, just in case the power goes out. Well, I just don't need...like, people have these big chunky wallets, and I'm like, \"I don't carry cash,\" so I don't need any space for it right? And then I also don't need to carry 50 cards with me; I just have my license, two credit cards, and like an",
            "start": 372.04
        },
        {
            "text": "and I'm like, I don't carry cash so I don't need any space for it right, and then I also don't need to carry 50 cards with me, I just have like my you know my my license, two credit cards, and like an insurance card, it just seems so easy to lose them, I mean yeah, I guess but then the other the other alternative to that is you're not sitting on a giant hunk that's like throwing your back out every time you anyway it's on my desk let me see your wallet, you got your wallet with you, yeah it's not big at all, that's not that's not bad, that's easy, that's B See Fairy oh you got a metal case, oh see, yeah so so you know because now they so they can't steal from you they can't get that you're smart now they're lifting now they put the security chip in so you can be hacked a lot easier from someone else's mobile phone these sons of bitches, yeah God damn it if you didn't know this is The GameOverGreggy Show each and every week four sometimes five best friends gather on this table each bring a random",
            "start": 406.84
        },
        {
            "text": "mobile phone these sons of b**** yeah God damn it if you didn't know this is the GameOverGreggy Show each and every week four sometimes five best friends gather on this table each bring a random topic of discussion for your amusement if you like that head over to patreon.com where you well you got.com Kinda Funny. go Kinda I I missed that I wish more people still did that you and I do it all the time you and I are the kings of bringing back stupid **** that everyone wants to forget one of these days we'll sing the Clio's kids for kids commercial too that wasn't that was not they redid it that wasn't a Chicago thing when I was listening to radio instead KidsLine was remember Kids Line no call Kids Line any time of the day one quarter is what you pay and here's where it gets really bad need help and nobody's home call Kids Line on your T need someone's breaking into your house call Kids Line and pay a quarter wow no call 911 why would you say this Kids Line that's pretty terrible",
            "start": 447.72
        },
        {
            "text": "Need help and nobody's home, call 911. Need someone breaking into your house, call 911. Why would you say this? Kids line is pretty terrible. Suburbs Chic knows what's up. Uh, you can go there; he tosses a buck, you get bonus episodes. Then you can get each and every episode early for a few more bucks. But if you have no bucks to toss, no big deal. Go to youtube.com/kindafunny where we post the entire show topic by topic day by day until it goes up - one big MP3 and video for your listening pleasure. Lorne Lanning. Wow, what's your topic? Well, uh, uh, you guys were talking about Switch earlier. Oh yeah, we're big Switch fans. Nintendo Switch. No, you make games; you don't like the Switch. I don't have faith in Nintendo to come through with the games that you believe they can work out something with some third party. You're telling me that yeah.",
            "start": 489.24
        },
        {
            "text": "now you're telling me yeah that you don't have faith in Nintendo to come through with the games that you believe that they can to work out something with some third party you're telling me that yeah yeah yeah but it's uh it's you know it's it's due to experience so no here's my here's my uh forecast and I know this get me crucified but I see a similar level of success that they had previous generations sure right yeah what what previous generation you talking Wii U, Wii so perform Wii those are different two different we success uh that's a manner of speaking how successful was it for third parties okay but don't don't don't act like you just dropped a truth bomb on us no really who who really by the end of the life of the Wii who else was making money on the Wii aside from Nintendo how many titles sold for the Wii that weren't Nintendo first party sure okay so what happened so they started basically evaporating third party support right and we get to Wii U what happened same no third",
            "start": 536.64
        },
        {
            "text": "titles sold for the Wii that weren't Nintendo first party sure okay so what happened so they started basically evaporating third-party support right and we get to Wii U what happened same no third parties yeah third party so you would have thought let's just take a case case let's just take a case only matter of time before Kevin yells at me I'm sorry Kevin sorry look his eyes they're you would thought you would have thought that maybe if there's no games for sale on a network if people have a hardware device maybe they'd like to know that a game has become available yeah so I was thinking that you know in a silly me I was thinking that in our last game New 'n' Tasty we brought it to Nintendo yeah right now as indie developers so we're not even third party right we're like on the bus that showed up with all the tires or mismatch happy to be here made retreaded in Mexico before they brought it back over and uh so we're on that bus cuz we're indie developers right which means you",
            "start": 590.84
        },
        {
            "text": "that showed up with all the tires or mismatch happy to be here made retreaded in Mexico before they brought it back over and uh so we're on that bus cuz we're Indie developers right which means you don't stand a chance in hell unless you have store support now what that means is same as with everyone else Google Store Android store PlayStation store Xbox store steam right yeah if if you've got something really good for that Hardware platform they'll promote it not Nintendo unless you were day and date so even though they don't have a title to release to Their audience even though you might spend hundreds of thousand dollars to bring a title they're not going to tweet that when they have nothing to tweet I mean nothing when they were tweeting absolute absurdity cuz they had nothing to talk about cuz another first-party Nintendo title is probably not coming in the generation of Hardware whatever I mean based on what I saw at E3 right sure I think there was five titles on the floor yeah",
            "start": 635.04
        },
        {
            "text": "about cuz another first-party Nintendo title is probably not coming in the generation of Hardware whatever I mean based on what I saw at E3 right sure I think there was five titles on the floor yeah uh so out of that you would think that maybe just letting your audience know because they get 30% of everything sold Right congratulations you're allowing self-publishing but the policy is unless you release day and date with other skus they will not give you any promotion M now how many megabytes of of uh RAM how many gabes of Ram or in a new device Ram or storage Ram I don't know that's some techy **** I don't care yeah in storage yeah how much what 32 32 yeah and RAM I think is two right okay yeah how's the competitors a lot a lot more yeah so what does that mean for a conversion they're not portable that means no irrelevant so that means irrel for this reason for this reason because what it means is you're not going to ship titles day and date first of all you're not going to make",
            "start": 686.68
        },
        {
            "text": "not portable that means no irrelevant so that means irrel for this reason for this reason because what it means is you're not going to ship titles day and date first of all you're not going to make that underpowered of a title for the other systems anyway because you'll probably get slaughtered sure right and then if you do now you're going to have to spend a lot more time energy and money squeezing it in to the limited amount of ram that they decided to have in their cartridge now why are they doing cartridge why are they doing cartridge save on load times and no it's control manufacturing right that's it control manufacturing you don't have to worry about piracy and stuff like that it's a different a different degree so a premium on manufacturing cost it's all about Nintendo first sure the other companies are winning like similarly I have to say I think Microsoft had a bit of this problem before Phil Spencer took over right and then their policies changed right",
            "start": 733.92
        },
        {
            "text": "the other companies are winning similarly i have to say i think Microsoft had a bit of this problem before Phil Spencer took over right and then their policies changed right but they had like they were so tight in Microsoft-centric that they were losing the audience well thats whats going on now continually so you would think okay this switch youre looking at specs its mobile this is interesting how well are other Developers first party third party indie how well are they going to bring titles over not very well because theyre going to have to spend more time energy and effort to get it onto that console for an underpowered console thats going to have fewer units in the marketplace do you think it speaks to it though because this is you you have an ax to grind you got a vendetta pretty clearly well you know look its not like we lost money but we didnt but had you could done way better done way better you look at it forward and you go whats",
            "start": 777.52
        },
        {
            "text": "Ax to grind, you got a vendetta pretty clearly well you know look it's not like we lost money but we didn't make as much as we could have done way better, done way better. You look at it forward and you go what's the point because we're not going to be day and date because they built another console here's what I think and I agree that don't get me wrong the Switch is a wonky ass system I agree but I think the what excites me about the Switch and why I love the Switch is the portable aspect, it's being able to play but it's also this is the fact that since it's underpowered since it's this is it easier for indie developers who are making things like Shovel Knight like Axiom Verge, like these games that are smaller, it's easy for them to then get their stuff over there and get them on this unit and have them exist where cuz like for me I loved the Vita, loved loved the Vita as you know yeah and so when the Vita just got cancelled and Sony's like we're not doing this anymore",
            "start": 826.28
        },
        {
            "text": "and have them exist where cuz like for me I loved the Vita, loved loved loved the Vita as you know yeah and so when the Vita just got **** over and Sony's like we're not doing this anymore and you can't even tell have they given it up yet or haven't they it's still they gave it up yeah but then it's kind of like it's a little sure but I'm saying there's no more AAA games coming from PlayStation they're not committed to it right and it was like oh we got all these Indies that's good enough for me I feel like the Switch is the same story except that Nintendo can't back off of it Nintendo can't say no more AAA games for Switch until they're ready to launch the next thing and what's the OS for the Nintendo thing, crap it's crap is what it is thank you yeah right so why is it going to do Stellar I well I don't think it's gonna do Stellar right I think it's going to do better than I think it's going to do better than Wii U I think it's going to do I what are we talking just sales numbers",
            "start": 863.0
        },
        {
            "text": "I well, I don't think it's gonna do stellar right. I think it's going to do better than I think it's going to do better than Wii U. I think it's going to do... What are we talking just sales numbers like what is the metric of success here? Sales numbers end up doing way better than the Wii U at 13 million if we're going to destroy that, it's not going to hit the crazy numbers that the Wii did, but I think it'll I think it's definitely going to eventually outpace the 3DS. What about GameCube? Yeah, yeah, I think it's gonna be GameCube too. I think it's positioned better to take more uh install base than each of the ventures you just mentioned, but the the thinking has to change so the biggest problem I see at Nintendo is the thinking. I mean personally I think it killed Ian Alvarado really that he couldn't move the the organization into a a really successful era right and what what just happened with Mario and mobile not what they thought yeah right so what's really going on where are they really for",
            "start": 901.68
        },
        {
            "text": "the organization into a really successful arena right and what just happened with Mario and mobile not what they thought yeah right so what's really going on where are they really for the non-gaming audience what did happen on Mario with Mario it didn't set it came out it did really well but it didn't like set the world for the non-Gamecast audience so Pokémon Go you already had a property that was like enormously infectious at a very card-based level right so people are used to like gathering sharing trading stuff like that that's not Mario's history right so Mario is more a console experience right so the first time Mario basically goes to a non-Nintendo-centric piece of hardware what happens doesn't meet expectations right this is like the wake-up call to the new landscape because they're they're I think they're testing the waters on mobile because maybe they become a mobile only company",
            "start": 945.44
        },
        {
            "text": "to the new landscape because they're testing the waters on mobile, because maybe they become a mobile only company eventually, right, which is kind of what the Switch is indicating, and then they're building off of an Android-type environment, which is not the strongest for gaming. Sure, right? All the mobile back to I mean the wonky stuff and the OS and stuff, the fact that there isn't an online shop up and running in the way it should be with Virtual Console, there isn't an online infrastructure yet, it's going to be there Mario Kart we have crashes every 3 days so what you got you got to do like one of the things that helped Sony just blow past everyone else in the beginning of this console generation was their open approach for Indies to self-publish, really set that trend outside of Steam and then they gave you a platform to bring",
            "start": 994.04
        },
        {
            "text": "Generation was their how they just open the kimono fully uh for Indies to self-publish a really set that trend outside of Steam and then B uh they they did Pro they gave you a platform to bring awareness about the title that you can't afford any advertising on and when you're our scale you know and in the Indie scene uh we're certainly not the biggest but we're certainly not the smallest right and so but basically we're still in that space where we can't afford to do you know first week advertising we buy the store $250,000 we've pre-loaded that a year ahead of time like the big publishers do on all the stores now right so you have to rely on quality will rise your product to the top but if you have an organization that's so so embedded in this antiquated thinking of the 20th century we will control the hardware we will control the cartridge manufacturing if you don't release on our subpar hardware day and date with your other uh games that on your other platforms that you're going to",
            "start": 1033.12
        },
        {
            "text": "control the hardware we will control the cartridge manufacturing if you don't release on our subpar hardware day and date with your other uh games that on your other platforms that you're going to have to squeeze down to like a third of the capacity in them in running in memory and all and and that means you know rendering I mean it has a lot of implications right yeah Nintendo first so unless you do all that even if we have a total drought in the store and no products are available for our audience we really don't give a **** about them because we're not seeing what want as a policy and so therefore we're just not going to really talk about you and this is the you're talking about what you ran into on Wii U but are you see the same thing it's not like we saw any revolutionary change in management it's not like we saw any what we see is to me it's it's a tragedy because Microsoft uh Nintendo brought this business back right anyone who remembers what happened with Atari",
            "start": 1079.36
        },
        {
            "text": "management it's not like we saw any what we see is to me it's it's it's a tragedy because Microsoft uh uh sorry Nintendo brought this business back right anyone who remembers what happened with Atari uh the book game over was a great book on uh on the history of the game business Nintendo brought the business back right we're all playing today because Nintendo they didn't give up entertainment system and they controlled quality like they had certain controls that were really part of its longevity to stay in business and make the game business a valid space again right and now those controls they really need to get 21st century about it and they're not they're still thinking in this antiquated way and so what I see is I see the motivation as long as these policies don't change to be really 21st Century's policies or web 3.0 policies where you're looking at other companies to build businesses on the back of your business that's the key key right eBay figured it out pretty easily Amazon",
            "start": 1117.0
        },
        {
            "text": "21st Century's policies or web 3.0 policies where you're looking at other companies to build businesses on the back of your business, that's the key. Key right. eBay figured it out pretty easily, Amazon figured it out - you can go have stores there, you can do this; the rest of the networks figured it out and you can manage and you can get to know your customer better and you can use their platform as a Business Builder but you have to have some lenses to understand who your partners are because then you're really like a partner - like we're we're a nothing partner to Steam, but we're still a partner. Right? Same with Sony - like we don't show up on their on their sales enough to really make a difference but you got to change that thinking if you're going to get support so now you go okay can I make day and date squeeze am I going to delay the other titles on the other SKUs so I can squeeze in the Wii U, that'll have the smallest install base out of the other three competitors right and now we",
            "start": 1160.2
        },
        {
            "text": "and date squeeze am I going to delay the other titles on the other SKUs so I can squeeze in the Wii U that'll have the smallest install base out of the other three competitors right and now we got Scorpio it's pretty raging piece of hardware sure right right so can I accurately predict that we're either going to delay the release of the other platforms which is you know everyone's usually hungry for money like you got to get money back in the coffers right or uh are we going to uh just deliver late or do we think we can deliver on time with the other SKUs well anyone who's done lots of conversion on Big Data stuff you're trying to do AAA type quality you're not going to hit that so you just go you know what it's not a viable SKU so you're writing it off before you even had a chance to really test the market but do you think that like you in particular with what you guys are doing with Oddworld yeah I feel like that's a game that isn't necessarily a Switch game if that makes sense",
            "start": 1197.6
        },
        {
            "text": "to really test the market, but do you think that like you in particular with what you guys are doing with Oddworld? Yeah, I feel like that's a game that isn't necessarily a Switch game if that makes sense. I feel like when I'm thinking of my Switch games - and granted this is because of what they've shown me so or what I've played so far - yeah, I'm thinking AAA Nintendo game Zelda Mario Kart whatever, and then I'm thinking Mr Shifty and I'm thinking You Slay Zee Pass and I'm thinking about games that are smaller, simpler. I'm not thinking there's a third-party game. I'm not Insomniac is I don't think ever going to put out a Switch game unless they made a team that was like let's make a very small game - like let's what we did with Song of the Deep - let's make something even simpler and smaller, so then it's possible right? So now if you're doing that title exclusively on that platform, but would you write off the others? Yeah, right. Right, but I mean that's the thing with what's happening with the",
            "start": 1242.68
        },
        {
            "text": "\"Possible right, so now if you're doing that title on that platform exclusively, but would you write away the others? Yeah, right. Right, but you would. But I mean, that's the thing with what's happening with the NES right is like, like Puyo Tetris is already out on PS4 or coming out on PS4. Yeah, but it's usually they're usually on different SKUs, like this and that's a good example, right. I don't know the inside story on any of these things, I'm talking about, right? So you listen, he just winked at Tim, thank you, nice there you go. But uh, I don't know nothing, but but uh, you just touched on a really accurate point, you know. So for us, let's just take our last title which is I assume that developers in a similar situation we had to wrap up one right, we have limited resources, we're self-funded, we're we're struggling already, really. I mean, that's just game development, right? No one wants to buy the thing they bought yesterday, so it's got to be new and different and pretty good, which means you can't accurately predict.\"",
            "start": 1281.8
        },
        {
            "text": "really I mean that's just game development right no one wants to buy the thing they bought yesterday so it's got to be new and different and pretty good which means you can't accurately predict exactly how long it's going to take you yeah and uh so you get aew out and then you got to start generating some money now if you're if you're I mean I bump into the Indie guys all the time they're like what should I do here I'm like you have to get on these other SKUs you have to you're just leaving money sitting on a table and that money might be that division next year that you're not laying off because you got over to Xbox and you first you were only on PS4 right like it's it's money uh so if you're I think if you were Switch only right so now you don't have the day and date promotional problem with a really strong game you might do fine you might do better than you were on the others because you won't get as eclipsed by the big AAA's and stuff like that uh so there could be some",
            "start": 1329.28
        },
        {
            "text": "with a really strong game you might do fine, you might do better than you were on the others because you won't get as clipped by the big AAA's and stuff like that uh so there could be some advantages for some people but overall it's going to add up to the same thing smaller portfolio on the library period at the end of the day the the catalog is going to be this when it could have been this I agree with you, I don't think you're wrong and that's the thing is like I I always go back to DrinkBox you know they made Severed, they made Guacamelee uh they kept supporting the Vita and they did a GDC speech basically where they were like I know people ask us all the time why are you making games for Vita and the reason being is that there is an audience here, they they buy games there is an attach rate that's going and I feel like right now in the early days of switch that's what you're seeing is that there's people who have the Switch and are 1.04 how big is it the audience",
            "start": 1367.76
        },
        {
            "text": "an a attach rate that's going and I feel like right now in the early days of Switch that's what you're seeing is that there's people who have the Switch and are 104 how many how big is it the audience the audience exactly what is it two 2 million units million right they so let's take 2 million units right now what's your do you ever sell in 10% of the installed base supposedly Switch has a crazy attach rate with the so few so few available one of the highest IPS of all time right Nintendo Can Nintendo first party well Nintendo uh is it first party it's basically first in-house will will deliver IPS that the Nintendo audience is just frothing for right so they'll have the highest attach rate of any new console with their own specific IPS Zelda and Mario right maybe King and uh Donkey Kong and and uh so they'll have an unusually high attach rate but what's the chance of anyone else after the initial launch right cuz the first the Switch up there's only three titles available probably going to",
            "start": 1405.52
        },
        {
            "text": "and uh so they'll have an unusually high attach rate but what's the chance of anyone else after the initial launch right cuz the first the Switch up there's only three titles available probably going to sell super high attachment rate right but as soon as 10 are available how you going to do as soon as 20 are available how you going to do which is really the metric right if you didn't make a day one you're in the you're in the the higher numbers of competitive stuff and so so here's my argument here's my counter argument what I think is interesting if I'm a small developer and I'm making Snake Pass which they just did right but let's say I'm making Snake Pass months from now when there's more games out there right Snake Pass hasn't existed if I go with Nintendo and I do the whole all right cool day and date whatever I what Snake Pass you know Snake Pass published on everything but I publish on Nintendo and I publish on PC those are the two platforms I'm able to put out at day and date all",
            "start": 1452.56
        },
        {
            "text": "day and date whatever I what Snake Pass you know Snake Pass published on everything but I publish on Nintendo and I publish on PC those are the two platforms I'm able to put out at day and date all right cool I feel like it's a similar story where that can drum up in the Nintendo Switch audience drum up support so that in three months or whenever the window's up I can put it out on PlayStation 4 where there is this giant install base Xbox one bigger install base and get them to go get it in the same way like Limbo did where Limbo hey I'm only on Xbox this is great and by the time I got to PlayStation 4 everybody or PlayStation everybody snapped it up and I think it's a great comparison and it's true and how many cases will that happen for so when you look at a platform right it's like okay so those laser discs will sell some more but how many other people's right right you're still in that like it's going to be a smaller portfolio because some people",
            "start": 1492.92
        },
        {
            "text": "okay so those LaserDiscs will sell some more but how many other people are right right you're still in that like it's going to be a smaller portfolio because some people like if we were in like just getting started I might target the Switch first because there's less competition so I'll have more visibility as long as my game is good right if the game's not good I'm going to get destroyed by the IP because I'll get higher visibility and it wasn't there sucks yeah exactly we've seen that happen right on the PlayStation initial launch we saw that some games just tank really fast because they got they got awareness uh so you could if you look at it as an individual company small company in particular seeking strategy in a way to get more visibility on your brand well everyone's going to be reporting on Switch yeah right yeah and they're going to have to show some games what's the likelihood that you can get some of that screen time",
            "start": 1530.8
        },
        {
            "text": "visibility on your brand well everyone's going to be reporting on Switch, yeah right, yeah. And they're going to have to show some games. What's the likelihood that you can get some of that screen time? Which is exactly how I would be thinking about it. And to your point, I think that's a smart move for some people. But where is that going to leave you know for some groups? But where is that going to leave in 5 years from now? How much of a viable platform is it? Where is Nintendo? That was really you know the emperor of the industry how many it wasn't many years ago we were in the marketplace, The Hollywood Reporter was writing the most successful entertainment company at all time right of all time. I mean the the comprehension of that was unbelievable. So you go Paramount University move Universal get out of the way Disney Nintendo you're like what how is that possible and in this short amount of time how how quickly it all changes yeah so they have the cash to fix it they have to",
            "start": 1577.08
        },
        {
            "text": "War get out of the way Disney Nintendo, you're like what how is that possible and in this short amount of time how quickly it all changes, yeah so they have the cash to fix it, they have to have the will, so I think, yeah there's opportunities because of you know cases press is going to cover it if you get there early you might get coverage you never might have got on the PlayStation 4 or the Pro or the Scorpio, well I mean that's the other thing too is just the fact of like it's where you're going to be in five years, it's the same now you look at PlayStation 4, it's the same way right of like yeah there we made fun of it all on PS I Love You, the 30 games that came to PSN this week, you know what I mean, it's like well how the **** are you going to find the great games in there when there are there are so many garbagey games in there, this is weird It's Tricky, you can be too small like Nintendo or too large like Steam where it's even worse, yeah but Steam will still if you have a great game",
            "start": 1615.88
        },
        {
            "text": "there are so many garbage games in there this is weird It's Tricky you can be too small like Nintendo or too large like Steam where it's even worse yeah but Steam will still help you shape how to promote it you know I don't know if I get to the top but they'll at least give you advice they'll tell you Windows you should avoid you know they'll help work with you I'm not saying Nintendo won't sure but uh you know they will do that because and then and if it's really if it's making if it's making waves and it really shines they'll give you exposure and it won't be like well you released on PlayStation for so we're not going to promote you know and Apple's not going to do this if it makes the iPhone look good they'll give you some coverage that's their model not like here's all our rules so we win first and if you don't buy by them perfectly good luck with exposure but don't you feel like this this console generation is more closely mirroring",
            "start": 1655.72
        },
        {
            "text": "not like here's all our rules so we win first and if you don't buy by them perfectly good luck with exposure but don't you feel like this this console generation is more closely mirroring like the at least the cache of the Wii than the Wii U cuz I feel like the like from outside perspective there wasn't a lot of excitement around the Wii U but there seems to be a lot of excitement as far as just the consumer is concerned around the switch and and doesn't that count for something like in other words how much how much of this matters to Nintendo as far as like is this a strategy they have to shift or are they happy with this is their level of success that they want how can it be right they're a public company right M right yeah what a public companies need growth mhm that's it growth right so uh as I heard uh one person Within Nintendo say complaining about the internal policies they said we're not yes Mario he was smoking the crack pipe man he all should have been at",
            "start": 1692.92
        },
        {
            "text": "growth right so uh as I heard uh one person within Nintendo say complaining about the internal policies they said \"we're not yes Mario\" he was smoking the crack pipe man he all kind should have been at that party man no but you turn on the fame but uh uh sorry I threw you off yeah public company you're talking so they're a public company so they have to have growth right they have to have profit everyone's watching them this way they need to pull it off are they going to really pull it off at that next level or are they settling and you can't really settle in this business because someone's going to eat your lunch right Microsoft's a public company Sony's a public company they're all focusing on how to eat more of the other guys lunch right you come in with an underpowered piece of hardware doing it on a cartridge having different uh uh promotional rules and constraints that are policies none of those things are adding up to faster growth sure yeah I don't for me",
            "start": 1732.16
        },
        {
            "text": "piece of hardware doing it on a cartridge having different uh uh promotional rules and constraints that are policies none of those things are adding up to faster growth sure yeah I don't for me the whole thing is I want I'm I'm fascinated to know behind closed doors what their expectations are for it cuz I do think that they have a I I love my Switch right but I love it knowing its limitations at no point like I made the joke all the time like if if Mass Effect would have come to Switch as well day and date I would have bought it on Switch but I know that I don't I don't own my Switch saying man I can't wait to play the next Assassin's Creed Ubisoft's not going to give them anything you need like that maybe we get a UB Arts game similar like Valiant Hearts or something even if we got this Assassin's Creed you don't want that like anybody that thinks they want that like I'm sorry you're wrong like you why would you want to play The Dump down version when there is more powerful things",
            "start": 1777.72
        },
        {
            "text": "Assassin's Creed, you don't want that like anybody that thinks they want that, like I'm sorry, you're wrong. Like, why would you want to play The Legend of Zelda: Breath of the Wild down version when there is more powerful things out there? It's like if you have the Switch, you need to know what you're going to get from it, and that is indie games, that is first-party games, and now that eventually the 3DS will get phased out, that means you're also getting all of the smaller AAA Nintendo games that used to be the Fire Emblems and the top-down Zeldas, the 2D Marios. Like, you're still going to get those. So, and what I think is Nintendo is going to sell its first three to four million units fast no matter what, okay? Because as a game brand, my guess is Nintendo has more tattoos on skin than any other game brand console right. I see more NS tattooed on ankles, and you know, you've seen themes I many PlayStations and Xbox logos, I see let's get Smash Bros but the Nintendo fans are Nintendo logos right like they're hardcore they're die",
            "start": 1818.48
        },
        {
            "text": "NS tattooed on ankles and you know you've seen themes I many PlayStations and Xbox logos I see let's get Smash Bros but the Nintendo fans are Nintendo logos right like they're hardcore they're die hard and they're going to they're going to sell this three four million units but but six million units how long is that going to take after that initial audience Mario the Mario Kart bundle you need to smash bundle you just need to start bundling all of a sudden these people they're going to buy it what's interesting about it is again I think think you're right and what Colin's Point always was right is that Nintendo can't sell a Nintendo console on Nintendo Alone look at the Wii U that's what they did there and it just didn't work out that argument doesn't hold up because the Wii U didn't deliver the 3D Mario didn't give us the Metroid so it's like and you feel like the Zelda did right the Zelda oh my God I think there's a trend that could start where if Mario Odyssey comes out at the end",
            "start": 1859.0
        },
        {
            "text": "the 3D Mario didn't give us the Metroid so it's like and you feel like the Zelda did right the Zelda oh my God I think there's a trend that could start where if Mario Odyssey comes out at the end of this year and it is that 3D Mario that people want so that so that's kind of how I think about it is like I remember I bought the Sega Saturn because I thought you know what for the price of Virtua Racing as a just think of it like a coin op stand-up 3D good racing game it was worth it the Saturn I just thought of it like I'm buying an arcade machine for Virtua Racing and it's worth it right but I didn't really buy it for any other games just that game right and I thought of it like a coin op purchase of a real hardware machine you know and I think uh for Zelda games and stuff like that it's kind of like that the Wii U was kind of like that the Wii is kind of like that the games that are great first party boom people how many times did they play Bowling how many times did",
            "start": 1896.72
        },
        {
            "text": "like that it's kind of like that the Wii U was kind of like that the Switch is kind of like that the games that are great first party boom people how many times did they play bowling how many times did they play tennis you know like over and over but they were never motivated to buy another title and see my thing about it is I think this is them turning a corner on that respect you're right cuz I do think GameCube I'm thinking game pad Wii U like it was that thing where I think as you know not I was raised Sega I was a Sega kid so I don't have that Nostalgia for uh Nintendo and so when I looked at the WiiU I was like that thing is garbage and I play games I'm like these are great but I don't I'm not gonna go out and buy one of these I'm not I'm not that motivated for it you know what I mean and I felt like there were a lot of people like me and then there were the Nintendo people who peeled off and were just like this isn't great and then there were the people who Nintendo",
            "start": 1946.88
        },
        {
            "text": "what I mean and I felt like there were a lot of people like me and then there were the Nintendo people who peeled off and were just like this isn't great and then there were the people who Nintendo and bought it and loved the system were fine with it but I feel like switch has brought all the Nintendo people back but then me I'm this is I'm having such a great time being like man this is the first Nintendo console since N64 that I feel like a connection to where I'm like this is great and yeah when you put Mario 3 on it in Super Mario World I'm going to buy all those things again and I'm excited to play Mario Kart on April 28th because that is the game I love cart and I hated the Wii I hated everything about the Wii U so I didn't play cart on it that much and so like I'm stoked to have that but I I am in I bought in and got it with the expectation that I'm buying this and I'm going to play Zelda and then Cart and then Mario and then I didn't even think there'd be the the NES",
            "start": 1983.56
        },
        {
            "text": "that but I I am in I bought in and got it with the expectation that I'm buying this and I'm going to play Zelda and then cart and then Mario and then I didn't even think there'd be the the NES like there's been where it's like oh Snake Pass oh **** graceful explosion machine oh **** Mr Shifty like I'm I'm stoked that I only get there for right now and promoting those games really well so it's like they must be going through all the **** and doing all that stuff but early released title they have different motivations right sure I mean you know so it's going to work for some yeah I but I my my other thing is that I never think it's going to surpass PlayStation 4 it's never going to be that kind of machine for SNES right when you were on SNES you would have said uh GoldenEye you would have said other titles yeah uh sorry I just don't want the comments to go off yeah that was that was uh that was N64 right yeah so N64 I was going back to Donkey Kong Country sorry or F-Zero",
            "start": 2021.92
        },
        {
            "text": "Have said other titles, yeah, uh, sorry, I just don't want to get you off track, yeah, that was N64 right, yeah, so N64, I was going back to Donkey Kong Country, sorry, or Perfect Dark with the chip in there, but uh, Star Fox, it's like Red Bull, I'm telling you, sneak it up another one, it'll see what happens. We're talking about the real stuff that's happening, so you know it'll have its core fans, it'll have its core playability with key titles, but let's go back to that - N64 was like a system where you thought of many titles that you'd go back and have great memories for, and SNES as well, that weren't first-party Nintendo titles. But that's not true, like even with the N64, they didn't have the third-party support I feel like that was the first generation that was like, \"You can't only have this system; you needed to have at least two.\" And I think it was a kind of true thing then, but then by the time you hit the Wii, it was a definite like... the Wii 60.",
            "start": 2062.04
        },
        {
            "text": "only have this system you needed to have at least two and I think it was a kind of that was a kind of true thing then but then by the time you hit the Wii it was a definite like it the the Wii 60 was the the joke it's like you got to have the Wii and the 360 eventually PS3 came through but this year or this generation now it is PS4 switch like you cannot expect to get the AAA third party games on this thing because that's not what it is capable and this this strikes a chord with me in the same way PlayStation VR does in the way we've talked about PlayStation VR for a long time and you I think on E our E3 show for year one of Kinda Funny you were like you thought that PSVR had the best chance of succeeding out of all them because of the install base yeah when when we yeah when we were leading up to PlayStation VR kept driving home on all the podcast the message of like you need to understand you are buying genuine hardware and you're not going to get a a AAA game every week and da d",
            "start": 2105.56
        },
        {
            "text": "up to PlayStation VR kept driving home on all the podcasts the message of like you need to understand you are buying genuine hardware and you're not going to get a AAA game every week and da d d d da and people bought it and then I waited for like the Nintendo reaction like oh this sucks I wasted my money blah blah blah and it never came and it had I didn't hear anything so I had to start asking our listeners like what do you think and they'd write in like oh no it's great I love it I just don't play it all that often it's over there and I feel like Switch is a similar thing where I think people bought it and they were like all right it's my Zelda machine and as a joking fashion but then we're also like it's my Zelda machine maybe it's my Mr Shifty machine maybe I'll just wait till Odyssey they bought in knowing what they're buying into and this is what goes back to the real question I have is what did Nintendo think did Nintendo know what this was especially at launch or did did they",
            "start": 2146.88
        },
        {
            "text": "they bought in knowing what they're buying into and this is what goes back to the real question i have is what did nintendo think did nintendo know what this was especially at launch or did did they think it was going to be slam dunk runaway success i totally think that their their goal is to outpace their handhelds and to try to get back to the ds numbers which are crazy they're crazy and i i don't think that they'll ever hit ds numbers but i do think they can surpass 3ds numbers and at when the price of the machine is higher than the the 3ds that means more you know when you start selling way more games and there is only one system the attach rate is going to be higher so my question for you and this is definit like outside question then so is the is the idea that they're going to just do away with any of their handhelds and this is going to be the one nintendo unit that i me i think that that is the the goal of success if they get to that point then this will be a successful system",
            "start": 2180.72
        },
        {
            "text": "away with any of their handholds and this is going to be the one Nintendo unit that I mean I think that that is the goal of success if they get to that point then this will be a successful system interesting but then what happens to other markets you just enti market right but that is like I got a big idea you not eliminate you're just this is what that market is interesting right like I think the fact that they have announced in the direct today that they're selling the dock even though it's already been available on the back end of the store like they are gearing this as a thing where it's like yeah you can have it in multiple rooms of your house but also take it with you and I think that the more that they double down on that they need to keep supporting the 3DS right now because of the install base and because they there's money to be made they're also going to need to come out with a really really good battery pack for that thing battery pack today the thing as well is like",
            "start": 2220.12
        },
        {
            "text": "of the install base and because there's money to be made, they're also going to need to come out with a really good battery pack for that thing. The battery pack today is like crap - that was an hour ago. You build a title, right? Just think of the developer community, right? So you build a title; what's your chance of sales? Like maybe you get in early and maybe you ride some of that exposure, right? And we're all about... I'm trying to do that Xbox launch, whatever - let's get it new publisher. Yeah, let's get there; they need a success, you know. And you can get gains by that. But if you're tailoring the software to a specific piece of hardware, right, and that software is then not going to shine on other systems... so now you go okay, uh, how many Steam customers are there? I don't know - a million; they're all dorks too. Yeah, over 100 million, right? How many on PS4 now? About 70, is that right? Uh, Microsoft doesn't have the whole thing on it, right? So that's",
            "start": 2252.64
        },
        {
            "text": "are there I don't know a million they're all dorks too yeah over 100 million right how many off 4 now PS about 70 is that hear num6 uh Microsoft they don't 2 the whole thing on it right so that's so that's combined let's say you know 200 million units of install base that you could be selling to right granted some of those titles might sell well on Steam but steam is a different audience too right they're looking for different experiences different different things that push their PC power it's not going to be switched right sure sure so now you're a developer and you're choosing how are we going to spend all our time and energy over the next year and a half building the title or two years or more right how many units can we sell 100% no I you're I I totally understand those are so what I'm saying is those are decisions that uh regardless of what the consumer is doing that's going to shape what the development Community is doing and that's going to shape what Publishers are deciding",
            "start": 2294.24
        },
        {
            "text": "I'm saying is those are decisions that, regardless of what the consumer is doing, that's going to shape what the development community is doing and that's going to shape what publishers are deciding. Yeah, right, well, that's what that is for me, that's what's been fascinating about the launch - I thought for sure it would come out, sell how it's somewhere, and then have an opinion around it that was like negative more negative. And it's been so positive, but I do wonder if at EA, if at Ubisoft, they are like \"Should we get a team of 10 people to make some little thing that ties into whatever to put it over there?\" How often do we see those publishers targeting one platform? Yeah, super rare. Right, so they instead they've been looking at it like is it worth the cost of a conversion. But again, my my my question I guess or even point or whatever would be the fact that I don't think that if they're like \"I get 10 people to make an Uncharted Hearts\" but that can go everywhere because that's the whole",
            "start": 2349.44
        },
        {
            "text": "my question i guess or even point or whatever would be the fact of i don't think that if they're like i get 10 people to make an intrepid Hearts but that can go everywhere cuz that's the whole thing if you're making something for the least common denominator then it can be applied everywhere else it can but now you're in these other you're on these other systems where you know uh i mean we're we're small we put a few million dollars into a title right we try to make it look like 10 or more was put into it other people are putting in tens of millions those things look pretty great right now you're watching it on Hardware so your your device might play those games but is that the reason why you bought that type of a high powered device and that's and this is what you're talking about with the different communities and how they look at all different stuff cuz like for me you know i'm Mr PlayStation and like here's PlayStation 4 Pro and I'm like I don't need that yeah I don't have",
            "start": 2389.12
        },
        {
            "text": "with the different communities and how they look in all different stuff cuz like for me you know I'm Mr PlayStation and like here's PlayStation 4 Pro and I'm like I don't need that yeah I don't have I care if you were a company that had financing like let's say a VC funded your your game right yeah it's me it's Kevin Cole Industries there you go okay so what's his last name more well yeah that works also I like he's leaning back playing his switch he looks like he looks like a Kingpin over there cups all morning during the morning show so now he's like no he's taking all that suar energy we got Kevin pull up a photo of you in your suit to show Mr Lanning because he looks like Pablo Escobar in a suit he looks intimidating like he runs an Empire got to give him some gold plated 45s love that you ever see that gun collection wow wow man Priceless so I think you know that's what ultimately is going to be a big part of shaping it's success and if you're a de like if you were a developer",
            "start": 2430.2
        },
        {
            "text": "you ever see that gun collection wow wow man Priceless so I think you know that's what ultimately is going to be a big part of shaping it's success and if you're a dev like if you were a developer with an investor the Investor's going to be like so you're targeting the smallest system with the smallest install base that's capping our possible success at and you're not really targeting being competitive on the other 150 million it's that I hear you and I understand but I think it's just that you are in such a unique position in the kind of games you make where I I do think that it speaks more to the we got it look look at this guy look at this look at this you look like Pablo oh for a second I thought you were carrying a bag with someone's head in it Jesus does kind of look like he's pointing to like I cut your head off no that doesn't look like that at all why did I see that I went to Colombia a couple years ago like is the most amazing thing have you ever been to Colombia no okay",
            "start": 2472.72
        },
        {
            "text": "to like, I cut your head off, no, that doesn't look like that at all. Why did I see that? I went to Colombia a couple years ago; like, is the most amazing thing. Have you ever been to Colombia? No, okay. Closest I've been was Montreal. The shocking surprise right, most gorgeous women you will see walking per square mile anywhere on the planet, doubt period. I've seen NCOs, wow. I never saw Narcos, but I saw Colombia; oh my God, that's where the Victoria's Secret models come from. Like, interesting in as a herd, like unbelievable. I just never... it's a hard one to say. Montreal, uh, yeah, Montreal is pretty, pretty fabulous. So the thing I'm going back to is the fact that I think I'm I think it's speaking more to the fact of who a DrinkBox would be a company that's making these smaller severed like games; these that's and I think they can sit there and be like we're not no no we're not just targeting Switch, we're putting it everywhere. I understand for you guys are releasing Final Fantasy renders of Abe",
            "start": 2517.32
        },
        {
            "text": "That's and I think they can sit there and be like, \"We're not no, no, we're not just targeting Switch. We're putting it everywhere.\" I understand for you guys are releasing high-res renders of Abe, and like you can see all the pores on his skin, like you're making a game that is not at all like what the Switch's bread and butter is, right? Right, I think that's the difference. Well, I think you know it's uh yeah so I think it's all those numbers, all those trends are going to shape where people are laying their money for business, and that's going to shape a lot of what the audience has to pick from, sure. And then you know uh it's kind of like the other market is mobile right? You're making small games there's billions of mobile devices out there now I mean it's tough tough Market same idea that the market is just saturated with games like how do you get exposure when we go when we bring you know Strangers Wrath 10 years later over to uh Apple they're like \"My God, the iPhone looks",
            "start": 2563.28
        },
        {
            "text": "Idea that the market is just saturated with games, like how do you get exposure when we go to bring you know Strangers: Wrath 10 years later over to uh Apple, they're like \"my God, the iPhone looks great, we'll promote you day and date a decade later, you know makes the device look good, you know they're happy about it all right.\" But you mentioned Mass Effect, Mass Effect, not Mass defect. Alright don't get into I never ever trashed developers right but it should be an exception damn like I was looking at Lauren L, like I was like how do you get worse graphics than your last iteration, like how do you something inherently broken there? I mean I miss Ray and Greg, that's really what's going on. What happened, what happened? I think they sold to somebody who was uh Electronic Arts, wasn't it EA? Did huh something happen but I was watching these videos man, I mean I didn't play but I was like why why does everyone look like they got a load in their pants what's going on here man how did the",
            "start": 2599.48
        },
        {
            "text": "did huh something happened but I was watching these videos Man I mean I didn't play but I was like why why does everyone look like they got a load in their pants what's going on here man how did the what happened you were opening up they're going to come for you they're going to come for Oddworld next thanks for watching you can what no that's wrong here thanks for watching you can click here to subscribe you can click here to go to Patreon you can click here to watch something Kevin wants you to watch and then do something what's this one I don't remember Behind the Chair you're behind the chair the face people can't see where you're click click on my face to subscribe to subscribe oh I don't know click on the water there things here click on them you want to go to the Easter Egg website spoilers it's just going to be a subscriber you can't even hear",
            "start": 2648.64
        }
    ]
}