{
    "id": 2593,
    "video_id": "xY3IIpLc0lQ",
    "show_name": "AMA",
    "hosts": [
        "Tim Gettys",
        "Kevin Coello"
    ],
    "title": "Ask Kinda Funny Games Anything: April 2017",
    "description": "Subscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1493481605,
    "duration": 1835,
    "transcript_chunks": [
        {
            "text": "Oh what's up guys, it's me Tim Gettys here. You know, Kevin, you're not even on camera today, people can't even see you, they don't need to remember that. Oh good, well, it's nice. Why is it no? Why why is it that Here I am, your host, I love your question, I'm here to answer all of them. You are not answering any questions though, no he asked me anything for April 2017, I'll be answering all of your questions left over at patreon.com slash kinda funny games, having a pretty good day, I'm glad this is here, there's a Father's Day dance / - do it again, I believe this is yet another day, what's I mean April 17th? Oh how do you say ask me anything and ah so I'm gonna say a little more slangy but I want them in lo que se ho ho I throw buckets here right, ask me whatever you want, let's get right in here. Nicholas Price coming through with a dynamite question, he asks, I haven't even read it yet, I just assumed do you think Crash Team Racing will be released as DLC or would that be",
            "start": 0.06
        },
        {
            "text": "get right in here Nicholas Pritchard coming through with a dynamite question he asks I haven't even read it yet I just assumed do you think Crash Team Racing will be released as DLC or would that be its own project It won't be DLC and honestly I can't imagine that they actually re-release it or remake it already on PSN on ps3 I'm the Vita in certain territories I doubt they'll ever actually make it that would be a dream come true for me um if the Crash Bandicoot N. Sane Trilogy does well I think that that might up the chances did even then it just seems like a little bit too much of a grasp like the game is amazing but you know Trust Games is really known for its kind of original trilogy at games CTR was more for the fans when people bring it up Crash Bash like I mean no they're not get a remake crash bandicoot mass but CTR I one can hope I feel like a PSN release on PlayStation 4 is a bit more likely than a full-on remake and it definitely won't be DLC there's a totally different engine in the Crash games there's a",
            "start": 61.5
        },
        {
            "text": "CTR I one can hope I feel like a PSN release on PlayStation 4 is a bit more likely than a full-on remake, and it definitely won't be DLC. There's a totally different engine in the Crash Bandicoot games; there's a totally different system and different type of game that's not as simple as just porting it up. And also they've been putting so much love into the remakes – like every little trailer that released, I'm just blown away. Like this seems to be one of the best from-the-ground-up remake kind of remaster plus whatever the hell you want to say of a game I've ever seen. So I'm pretty stoked about that. Patrick Star (corrected from \"Canon\") – so hey Tim what Switch game announcements are you hoping the Nintendo makes? It's III, oh man I feel like I've talked about this a million times; I could talk about it a million more. I'm really hoping that they make a lot of announcements. I feel like it can't just be a trickle of a couple things – I think that they need to at least start laying out the next half year and the next year of",
            "start": 115.86
        },
        {
            "text": "hoping that they make a lot of announcements I feel like it can't just be a trickle of a couple things I think that they need to at least start laying out the the next half year and the next year of Nintendo's Switch it's been doing great so far we've been getting the trickle of games and it's admittedly pretty light we're getting about one game a month what's up Kevin it's just it has been light but I've played what three games at this point Zelda, Mr. Shifty, and Snipperclips and like I've thoroughly like I've got like a good amount of time out of each game and Mr. Shifty is a short game so I probably only gave me like like five days of playing you know a couple hours a day mm-hmm but just that it what it's been like they've got they have a good catalogue so if they do I mean that's the thing is it's like it's the the quality over quantity thing right now but with them it's going to be interesting to see from a triple-A space how much they can keep up this one game per month-ish",
            "start": 166.83
        },
        {
            "text": "the thing is it's like it's the the quality over quantity thing right now but with them it's going to be interesting to see from a triple-A space how much they can keep up this one game per month-ish average and then the Indies are going to need to come but yeah the lack of third-party support is an issue if that's something that you care about but again I always make the argument if you care about that stuff you should have another console like don't why would you want to play those games on the switch it just doesn't make sense to me so go back to the question III I'm hoping we get the Metroid announcement like I feel like you know what let me take that back retro we need the Retro announcement I want to see what they're doing whether it's a new IP or the Metroid Prime reboot or sequel that we all want I'm hoping we see that there I hope there's an announcement of the Super Smash Bros. like port like a Mario Kart 8 Deluxe style thing where it's the definitive edition of the Wii U and 3DS",
            "start": 221.82
        },
        {
            "text": "that we all want I'm hoping we see that there I hope there's an announcement of the Super Smash Bros like port like a Mario Kart 8 Deluxe style thing where it's the definitive edition of the Wii U and 3DS Smash Bros game, a Pokémon Stars announcement would be great. I got a we're getting a lot of port territory but I feel like Nintendo's in a weird place where this first year is going to be a lot of ports and we already know we got Mario Odyssey Zelda Breath of the Wild. There's not that I mean if Nintendo has a pantheon of established IP intellectual properties they definitely range in terms of their size and scope and their level of triple-A, right? So you have the big ones like the Mario Pokémon Zelda but then there's all the other weirder ones, the Mario Kart Smash Bros Animal Crossing and all of them have their own place that make sense in their own way. Animal Crossing and Pokémon are examples of not exactly system sellers but for as many systems sold they're probably going to sell a",
            "start": 262.49
        },
        {
            "text": "all of them have their own place that make sense in their own way Animal Crossing and Pokémon are examples of not exactly system sellers, but for as many systems sold, they're probably going to sell a good percentage of that number of that copy of game because so many people buy there; the adoption rates are so high. So once you get beyond the Zelda and Mario brand new big full adventure Zelda and Mario games this year, I don't know what else they can do. I feel for the core game or Metroid is the answer, but historically Metroid games haven't sold too well, so it's time for Metroid to come back, and I think that people will hopefully be hungry enough for it that it'll be a success. But in terms of you three announcements, I don't know; I hope there's just a lot of them, and I hope Nintendo surprises me and doesn't let me down. And honestly, I'm going into it like hoping for the best but expecting to be let down because that's what they've kind of done for the last couple years, and even with the",
            "start": 315.15
        },
        {
            "text": "me and doesn't let me down, honestly I'm going into it hoping for the best but expecting to be let down because that's what they've kind of done for the last couple years, even with the Switch when it comes to presentation - so far it's been a mixed bag: the indie presentation was so good, but then their first real reveal of the Switch was so bad. So somewhere in the middle, there... Let's aim for it. Christopher J Brennan says \"Hey Tim, I've been trying to wrap my head around this trend of these incremental console upgrades - ie PlayStation 4 Pro and Xbox Scorpio. What's the point of these upgrades, especially Scorpio? It is four times as powerful as Xbox One, but to what end? Developers aren't allowed to make games that take full advantage of the extra power because they need to develop for the lowest common denominator base consoles - it just seems like a huge waste of specs and makes the upgrade seem pointless. Microsoft has stated they believe the traditional console",
            "start": 367.89
        },
        {
            "text": "need to develop the lowest common denominator base consoles it just seems like a huge waste of specs and makes the upgrade seem pointless Microsoft has stated they believe the traditional console generation cycle as we know it is dead and they'll continue to make sure all future games work on all consoles so does this mean we'll never get games to take full advantage of newer hardware and that developers will always be restricted by older hardware do you think we'll ever see a PS5 and an Xbox Two or we will continue to get these pointless smartphone style updates PS I'd like to give a shout-out to my boy Josiah who also watches it your content shot out to Josiah this is an interesting thing so I have my PlayStation 4 Pro big fan of it I'm a tech guy I like my TV and that doesn't mean I'm a tech expert I am a tech enthusiast I would say I have a beautiful 4K LED TV and my PS4 creates a beautiful HDR image on it when you're playing the appropriate games Horizon Ratchet and Clank they are",
            "start": 414.69
        },
        {
            "text": "Tech expert, I am a tech enthusiast. I would say I have a beautiful 4K LED TV, and my PS4 creates a beautiful HDR image on it when you're playing the appropriate games, Horizon: Zero Dawn, Ratchet & Clank - they are breathtakingly gorgeous looking at them on the PlayStation 4 Pro with that TV. Having said that, those games are gorgeous on a PS4 on a 1080p TV as well. At what point do I not necessarily think we just need more and more and more teraflops and graphics and all this stuff? It is getting to a place where it's an optional upgrade if you are somebody that cares about that stuff. Xbox, obviously, is in a place that they're playing catch up a bit, and I think that having big announcements and headlines they can say the strongest console that will sell when people go into GameStop and the marketing all over is the most powerful system like that will entice people who are considering it, and like if you're not hardcore and super into it, like having exclusive games on the PlayStation 4 might not.",
            "start": 454.95
        },
        {
            "text": "all over is the most powerful system like that will entice people that we're considering and like if you're not hardcore and super into it like having exclusive games on the PlayStation 4 might not necessarily push you when you hear that oh but the triple A third-party games that you know and love are going to be better on the Xbox like think of the millions and millions of people that mainly only play Call of Duty and Madden and Assassin's Creed they could be enticed to convert to the Scorpio or if they're jumping in for the first time just generation to look at that and be like I'm gonna go there I definitely think we'll see a PS5 on what we see in Xbox - I don't know I feel like the market will have to dictate what we end up getting but I wouldn't be surprised if they do commit to the Scorpio thing if it's enough of a success and that is kind of their Xbox platform and that Sony then comes out of the PS 5 that is a little closer to the Scorpio and that will be where we're at",
            "start": 507.75
        },
        {
            "text": "the Scorpio thing if it's enough of a success and that is kind of their Xbox platform and that Sony then comes out of the PS5 that is a little closer to the Scorpio and that will be where we're at that'll be the next generation I'm not so upset about it because as long as we have the ability to play the games and the thing that I don't want to happen is for us to move console generation so quickly that there's never enough systems in a house that developers want to invest in making huge games for them that's a problem Switches are facing right now why would a third party want to be there when there's not an install base big enough to buy the game you're limiting the sales by by a fraction going into it so I think that this is going to help overall have more games be of a higher quality what you're saying about the lowest common denominator absolutely true it's a thing PC games have been facing for years however PC games on a high end look great and most games are developed with that",
            "start": 560.83
        },
        {
            "text": "you're saying about the lowest common denominator absolutely true it's a thing PC games have been facing for years however PC games on a high end look great and most games are developed with that high-end in mind and the low end right so if you end up not being happy with the experience you're getting on that low end maybe it'll be time for you to upgrade but I think the majority of people out there aren't even going to really notice Cassidee Pope says announces before to QA but I thought I bring it up again what would you say was the last 2D triple-A game 2D in terms of both graphics gameplay eg not something like Ori and the Blind Forest but something like Super Mario World it's so hard for me to look back on an old-school games and see what would have I considered triple-A at the time so I thought it'd be an interesting debate I don't know I mean triple-A it does get hard because there's like the Mega Man X Games jump to mind they were even on the PlayStation and Saturn generation and if a Mega Man",
            "start": 612.28
        },
        {
            "text": "be an interesting debate I don't know I mean triple-A it does get hard because there's like the Mega Man X Games jump to mind they were even on the PlayStation and Saturn generation and if a Mega Man game's not triple-A back then I'm not really sure what would be trending is anything cents then because yeah most of the games that come out nowadays that we would think like the Hotline Miami's and stuff those are Indies not necessarily they're not triple-A, triple-A to GM it's a semantic question because you know 2D games have existed forever but last Triple A one I mean I would say the Mega Man X games on those systems but if Yoshi's Island came out so late in the game on Super Nintendo but I mean mark you don't get much more Triple A and tender straights than Mario so yeah I don't know somewhere around there Andrew Christensen says hi Tim your moniker since the beginning of Kinda Funny has been led by Tim, host now 115 episodes and the Kinda Funny Games cast what has been the greatest",
            "start": 654.82
        },
        {
            "text": "around there Andrew Christensen says hi Tim your moniker since the beginning of Kinda Funny has been led by Tim, host now 115 episodes and the Kinda Funny Games cast. What has been the greatest obstacle you've had to overcome in order to become the awesome host that you are today? Thank you. What are the most important lessons you have learned along the way? I keep up the phenomenal work. Gosh, a sweet thank you for my wife and myself love to you guys as well. I don't know it's a hard question. I mean what is the the most important lessons and obstacles. The biggest obstacle for me has always been I have my own vibe and I have my own interests and Kind of corner of videogames and expertise that I have that does not line up with Greg Miller and Colin Moriarty, and I think the biggest obstacle I've ever had is that people want me to be Colin and Greg and I'm not and I never will be and I never was. And so when we would talk about things I am a bit more just excited about things and that's not to say",
            "start": 718.11
        },
        {
            "text": "Had is that people want me to be Colin and Greg, and I'm not, and I never will be, and I never was. So when we would talk about things, I am a bit more just excited about things, and that's not to say that I'm just positive about everything. And I like to just won't be critical because I'm very critical of things in fact I would say that I'm more critical of a lot of things than even Greg or Colin are sometimes when it depending on what it is. Because I feel like it does have a higher standard of things being amazing. Having said that, when you're talking on podcasts and stuff, a lot of times you speak in hyperbole. So me saying \"oh that's **** awesome\" isn't necessarily equivalent to a 10 out of 10; it's just the experience I had at the time. So the obstacle for me has just been getting over people's expectations of what I'm doing, what it's supposed to be. But I mean, I just keep doing it, and it's been working out. So I think it's only going to get better from here on out, Morgan Casey",
            "start": 768.72
        },
        {
            "text": "just been getting over people's expectations of what I'm doing what it's supposed to be but I mean I just keep doing it's been working out so I think it's only any better from here on out Morgan case says hey Biggs actually was listening to older Game Over Greggy episode specifically episode 22 in it you mentioned your Peruvian friend that had a rat named Pepe they would bring presents etc no that's the the Peruvian rat but I don't Bettis I was all negative it was our tooth fairy it didn't put together that his friend was Big Hefner himself until I realized into this episode man that episode cracked me up anyways just wanted clarification that you were in fact on my cab and I'd love to hear his side of it keep it tight well there was the side of it and yes I was talking about Kevin Israel Ken says hey Tim hope you're having a good weekend I did mid-march came along and I was finally able to get a PSVR don't play daily but appreciate it for what it is where the gaming or not",
            "start": 819.83
        },
        {
            "text": "Ken says hey Tim hope you're having a good weekend I did mid-march came along and I was finally able to get a PSVR don't play daily but appreciate it for what it is where the gaming or not it's all pretty dope my question for you what Nintendo IP would be good in VR I haven't played a Pokémon game on handheld since gold unless you can't Pokémon Go I think Pokémon Snap or Pokémon Stadium type of game would be a really fun experience Nintendo VR I feel like Mario Kart would be really cool because the thing with VR is you need to think of an experience where you can be in a seat you need to be like stationary and the things around you and moving cuz you can't be mobile what that's crazy and uh you know Mario Kart Mario Kart are we so much happening there would be so much happening but imagine seeing the blue shell does it feel awesome so that would be around you just having the thing above you or red shell coming from behind and actually having a look back to see things coming at",
            "start": 868.07
        },
        {
            "text": "imagine seeing the blue shell does it feel awesome so that would be around you just having the thing above you or red shell coming from behind and actually having a look back to see things coming at you I'd be nothing pretty cool I think that's that's my final answer duck hunt would be dope too but you know that's easy Jason mom says hey Tim do you think Nintendo might release a dock for the switch that has actual performance-enhancing hardware inside personally I'd prefer this over a new upgraded tablet portion in the console no I don't think so I think that kind of defeats the purpose of Nintendo's whole thing I think that we will see a portable only switch in the future because that makes sense for Nintendo and they're kinda 2d ideology hmm but the 2ds yeah yeah but you know we have a 3ds no one would have thought that they'd get rid of that like the 3d marketing angle why did I have to make it so flat I didn't like that right it was aimed at goods like it was aimed at kids",
            "start": 923.63
        },
        {
            "text": "Have a 3DS, no one would have thought that they'd get rid of that like the 3D marketing angle. Why did I have to make it so flat? I didn't like that right. It was aimed at goods like it was aimed at kids being able like did it hit there being more of a toy than anything. Oh, they hit their target. They nailed it. I mean, the 3DS sold super well, so I do think that we'll see that eventually and I think that's going to significantly boost Switch sales numbers a couple years in. Alexander Gates says, \"Is there a game or game series that you wish you had an interest in playing but you simply don't?\" What I mean by that is you wish you could be part of the conversation when people talk about Mass Effect or Fallout. I don't believe you've played either though. So I just wonder if you wish you had Dark Souls, is the immediate answer for me. I really wish that I got those games more than I do. I'm giving them shots and it's just I just can't wrap my head around it and like I'm just not good at games so those",
            "start": 976.71
        },
        {
            "text": "is the immediate answer for me I really wish that I got those games more than I do I'm giving them shots and it's just I just can't wrap my head around it and like I'm just not good at games so those things just kick my ass and it goes from being fun trying to not fun quickly I'm pretty good at smash but like to with my friends I'm pretty good you know when you get to that pro level you get I'm not a hunter I've only lost a hunter once kept like 6 I always had to be that Sean Finegan kid trumpeting I beat him a lot but he used to be some nice to Andre Lima Otto Rojas says hey Tim now that you guys have an editor ever thought of doing some list videos oh my god I know they're hard to craft but you guys and you specifically seem to be made for that type of content even though I do prefer your stuff to channels that only do list videos I love to see you try some and if not a new series what about some top ten videos of moments and jokes from previous Jay and game cast morning show",
            "start": 1017.03
        },
        {
            "text": "your stuff to channels that only do list videos I love to see you try some and if not a new series, what about some top ten videos of moments and jokes from previous GameCast morning show blah blah blah anyway just shooting some ideas to level up you do keep walking that sweet nasty chicken me too enlist videos has to happen at some point the problem is you're right they do take a lot of time and right now we're at a point especially with Colin leaving that and with Kinda Funny Live 3 coming up where we are at a reformation period of what Kinda Funny is from a content wide perspective having to figure out the PS I love you situation having to figure out what our new let's plays look like now that we have Andy and all that I think that we got to get the foundation solid we have Kevin working for us we have Andy we have Joey we need to really think about what is Kinda Funny for the future so that one day we can get to a point that maybe we have enough people doing all the",
            "start": 1082.86
        },
        {
            "text": "Kevin working for us we have Andy we have Joey we need to really think about what is Kinda Funny for the future so that one day we can get to a point that maybe we have enough people doing all the behind-the-scenes stuff that I don't need to worry about the foundation stuff that I can do that until then I don't think that it's going to happen we've been doing videos for GameStop where if you go to GameStop stores you can see us on the screen and I've been kind of using that as a way to get list videos out there we want to start putting them on the channel as well we did one recently not Rize there's a couple months back now this is before the Switch was formally unveiled but you should check it out it's it's on our Kinda Funny Games channel um I don't know what the channel was but it is cool Switch Press which someone intended I really wanted us to do list videos just because you're really good at them thank you in a way and I **** passionately enjoy watching list videos",
            "start": 1126.21
        },
        {
            "text": "it is cool Switch press which someone intended I really wanted us to do list videos just because you're really good at them thank you in a way and I **** passionately enjoy watching list videos you know like Mojo and Looper yep yeah I love like Screen Rants who like those are actually good the Mojo and Looper a little bit they're just there yeah yeah but like I don't think and ease our guy to be editing those yeah but you know I don't know I think you'd be great at it I think he'd be graded it that's not what I'm saying I'm not saying I can keep do a bad job I just think that like he'd serve a greater purpose doing Let's Plays let not not even just Let's Plays let's place and maybe the social videos oh yeah like that sure I think that someday maybe within like see you like a year away from having some like trying to make a list yeah yeah again it's just it requires a lot of time but some of the work I'm most proud of that I've ever done is the What to Watch series on IGN so if you",
            "start": 1172.8
        },
        {
            "text": "From having some like trying to make a list, yeah, yeah again it's just it requires a lot of time but some of the work I'm most proud of that I've ever done is the what to watch series on IGN so if you want to see an example of list videos that I'd like to make go on YouTube go to the IGN channel or just type in the search bar IGN what to watch, I did about ten of those videos and I'm very proud of them they're obviously IGN is a different place than Kinda Funny so there was some some choices where I had to like be diplomatic and I couldn't swear and a lot of the jokes I made were a little bit more PG than the things I would do here but I think they're a good example of the style that I would I would want to do. Let's see what we got going on, Jack Reynolds is hey Tim you **** legend, I know this isn't really your thing but what are your predictions for the new Ken Levine studio Ghost Story games if you can't answer that one I'd like to know how you see yourself in five years within",
            "start": 1219.3
        },
        {
            "text": "know this isn't really your thing but what are your predictions for the new Ken Levine Studio ghost story games if you can't answer that one I'd like to know how you see yourself in five years within the games industry cheers bud you guys keep talking that chicken ken levinne I'm really excited I'm hoping that we'll get something that is Bioshock asked in terms of storytelling but maybe a bit smaller of a project like I would love to see like a gone home style game from Ken Levine TT is a brilliant mastermind and I think that a super-tight three-hour experience from him would be like journey you know like something that's short and sweet and memorable is all **** where do I see myself in five years I don't know I hope kind of funnies doing some really cool crazy **** I'm hoping I'm making less videos probably won't be that maybe one day I think you will within five years I think I will - Adam Stewart so hates him first off mad love and appreciation for everything you do thanks on",
            "start": 1266.1
        },
        {
            "text": "less videos probably won't be that maybe one day I think you will within five years I think I will - Adam Stewart so hates him first off mad love and appreciation for everything you do thanks on them my question is how extensive do you think the Nintendo Switch Virtual Console could grow to be the wheel my first Nintendo console I got when I was eight or nine Wow but the only real game I even remember playing and loving was the first Mario Galaxy since I was mainly a PlayStation kid now that I'm 19 going on 20 and constantly took a chance on the switch I couldn't be happier Breath of the Wild is my first Zelda game and I'd be stoked if Nintendo could bring back the big hits and other games I've missed from the past years thanks again for all you do and know I'm sending some sweet nasty love from a new home in Hyrule thank you very much for the love dude the Virtual Console they better not **** this up they did such a good job retroactively with the Wii like looking back",
            "start": 1310.44
        },
        {
            "text": "love from a new home in Hyrule thank you very much for the love dude the Virtual Console they better not **** this up they did such a good job retro actively with the Wii like looking back and now the library that they had was **** extensive they had essentially had everything you could ever want Wii U they drop the ball entirely it was really bad why is there so many games missing and why are there games on the Wii that are on the Wii U didn't make sense and it was dumb I hope that the switch doesn't trickle too slowly whenever the Virtual Console comes out I hope that I understand not when he released everything at once it's not good marketing but do it in ways you know like maybe have a NES wave that is all right here's the the Mario NES tiles and Zelda NES and Metroid and a Super Nintendo wave where it's Super Metroid Link to the Past in Mario World and like kind of create events around that but get them out gotta get at least all the main hits out within the year of Virtual",
            "start": 1353.36
        },
        {
            "text": "Nintendo Wii where it's Super Metroid, Link to the Past in Mario World, and like kind of create events around that but get them out gotta get at least all the main hits out within the year of Virtual Console releasing if not sooner than that because we've played these games so many times before we've been able to buy these games so many times before that with the Switch people want the games now, so how they steady flurry week to week every Thursday when intend to release the stuff in the eShop you need to have games and I wanted them to come out swinging with it I want the first three Mario games to be out within a month don't make me wait a year. Thank you RJ Davis has a Tim when I was a kid my sister was obsessed with the Spice Girls and she wouldn't play it in the living room when I'd be playing Crash Bandicoot late and she would play it in the living room when I'd be playing Crash 1, and now whenever I hear any of the first album I think of Crash also when Smash Bros first came out.",
            "start": 1402.32
        },
        {
            "text": "playing crowd late and she would play it in the living room when I'd be playing Crash Bandicoot 1 and now whenever I hear any of the first Linkin Park album I think of Crash also when Super Smash Bros. first came out line 4 and I would listen to Hybrid Theory while playing the game do you ever listen to music while you play games there is music elicits memories of playing games thanks see you at KF L3 see you there J I don't listen to music while playing games I think that a game's sound effects and music are just as important as any other element of it and I really like the experience that the developers have created there and I also appreciate music too much too kind I can't multitask with that type of stuff I like to go all in on either side so yeah I don't think so although for some reason playing Twisted Metal - and Celine Dion's \"My Heart Will Go On\" are intrinsically tied in my brain that's really weird it is weird - hi my cousin I had one male cousin one female cousin I was playing with Twisted Metal with",
            "start": 1452.45
        },
        {
            "text": "and a Celine Dion's \"My Heart Will Go On\" are intrinsically tied in my brain, that's really weird it is weird - hi my cousin I had one male cousin, one female cousin, I was playing with Twisted Metal with my male cousin and my feet always listened, do it part will go on and any any time you talk about a cousin, always like oh I don't know, I know yeah you go crazy yes we're known you your whole life don't know your cousin's name mere I barely know it's all good I know you don't Kevin Coello says hey Tim did any guys really regret leaving IGN or you guys just excited to start a new adventure and really didn't think about it oh my god regret leaving IGN that's insane like from the moment we started Kinda Funny, I was like this I can't believe that this is my life like there is nothing to regret about leaving IGN I **** love them I owe them so much I had an amazing time there and I could have stayed there forever and been happy and been doing crazy cool **** but nothing compares to this this is so",
            "start": 1494.84
        },
        {
            "text": "Ask Kinda Funny Games Anything: April 2017. IGN, I love them, I owe them so much. I had an amazing time there and I could have stayed there forever and been happy and been doing crazy cool stuff, but nothing compares to this. This is so cool that we can just do anything that we want and as long as we believe in it, there'll be someone else that will believe out there. And the positivity that we get and the feedback of people actually wanting to like the content we make is a stark contrast to at IGN where you try so hard to please people and no matter what you're going to upset more people than anything. So uh I knew from you mean like hey Greg wants me to come over his house and help him film something and I was like dude take me with you please and you're like now it's gonna be too many people, take me with you please and like dude you work at a biotech place there's nothing you can do for us of that wrong content yeah here you are now you're just a big head on a TV Sean Bean says I don't know if you've answered",
            "start": 1541.4
        },
        {
            "text": "dude you work at a bioscience place there's nothing you can do for us of that wrong content yeah here you are now you're just a big head on a TV Sean bastante says I don't know if you've answered this before so sorry if you have what are your top three Final Fantasy games they don't have to be mainline titles mine are six tactics and nine I'm gonna I'm gonna stick to mainline titles just because I guys there's too many spin-offs and stuff but I count x2 as a mainline by the way I would probably say X 7-6 there's four ten seven six the sum of all fancy X that like makes it less of a Roman numeral more of a name but it's fancy ten yeah ten seven and six Nicole Humphrey says Tim I'm like Greg you do not have a journalism degree and reviewing background so do you feel this was a hindrance to your ability to discuss and critique games when Kinda Funny began if so how did you overcome it this kind of goes back to what I was saying earlier I don't think it's a hindrance at all I think that",
            "start": 1590.42
        },
        {
            "text": "ability to discuss and critique games when Kinda Funny began if so how did you overcome it this kind of goes back to what I was saying earlier I don't think it's a hindrance at all I think that I am good and explaining my opinion what I think about things I just don't have that level of scrutiny that other people do but I think I have a different level of screening it's just especially with IGN like they are trained to review games a certain way and I'm kind of happy that I don't have that that kind of framework behind my decisions like I've never had to play a game and give it a score that I didn't want to play anytime I played a game it's because I had an interest in playing it that's not to say it was good but there was something keeping me playing or if I stopped playing there's my review I didn't like it right I feel like that I enjoy and I definitely know think it's been hindrance but it has been a hindrance in the way that I get compared to Greg and Colin who are very",
            "start": 1648.38
        },
        {
            "text": "my review I didn't like it right I feel like that I enjoy and I definitely know think it's been hindrance but it has been a hindrance in the way that I get compared to GameOverGreggy and Colin Moriarty who are very different in that regard especially calling John VIX 32 says what's up Tim you guys have been killing it lately thank you The GameCast has been fantastic and I'm loving the guests you guys are bringing in it's been asked a bunch of times but who are some people that you would love to have on the show that hadn't been on before and you should do an exclusive with Andy about his gaming history like all of you guys have done in the past we just did that that will be the no I think that's different because case that what we just did the exclusive was which is coming out this Sunday yeah before this oh I guess the day after this video so tomorrow come tomorrow yeah you're gonna you're gonna hear it that what you want journey in the gaming in this I so he says uh let's do it like you guys have done in",
            "start": 1696.62
        },
        {
            "text": "guess the day after this video so tomorrow come tomorrow yeah you're gonna you're gonna hear it that what you want journey in the gaming in this I so he says uh let's do it like you guys have done in the past I did I did the exact same minded questioning where I was just like what was your first console how did you get to that well yeah so we totally did it so it was fun and man me and Andy share so many similarities with our gaming history it's fun but yeah get hyped about that guess that I want on games cast this is the last question by the way um there's so many i I really want to do a show with Kyle Bauman from easy allies Elyse Rowland's from Funhouse although she died probably rather her on game of her Greggy she's so funny a lot of the ones that I've wanted we've been getting recently like are going to happen soon like Marty Sliva I we've never done in games cast with him but he's going to be here next sometime in the next month yeah I don't know I'll leave it there I'll",
            "start": 1740.45
        },
        {
            "text": "recently like are going to happen soon like Marty Scorsese I we've never done in games cast with him but he's going to be here next sometime in the next month yeah I don't know I'll leave it there I'll leave it there I feel like I'm missing a whole bunch of people but it's okay that's just how things work anyways thank you guys so much for your patreon support it means the world to me and to kinda funny especially to Kevin we'll see you next month until then I love you",
            "start": 1796.55
        }
    ]
}