{
    "id": 1575,
    "video_id": "97CTRx1YquA",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "Kinda Funny Street Fighter V Tournament - Kinda Funny Plays",
    "description": "Kinda Funny has its first (and probably last) Street Fighter 5 tournament. We aren't very good. Except Colin. He is okay.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino",
    "published_at": 1456333201,
    "duration": 1546,
    "transcript_chunks": [
        {
            "text": "Greetings and salutations, welcome to Kinda Funny Games. My name is Colin, this is Nick, this is Tim, this is Greg, this is Portillo. Today we're playing a game that we're intimately familiar with and are all experts in, Street Fighter V, which recently came to PlayStation 4 and PC, console exclusive to PS4, but you can also play on PC. Uh, in reality, none of us really play Street Fighter. I, I might have the most experience with the series. You dabbled in it. I've dabbled it. I mean, I enjoy it. I think it's a great series. He was threatened to take on a guy at Underdogs. Yeah, that's true. Did you really? When the machine there, like, I'm going to go over there and get this guy. And then the guy took a bagel out of his pocket and made it, and we were like, well, he's too pro. I don't, yeah, he maneuvering. They, but I've always had a great, I've always had a great respect for the series. Uh, I was pretty good at it when I was younger, but I just don't play that much anymore. Street Fighter Alpha 3 is actually my favorite one. Um,",
            "start": 0.0
        },
        {
            "text": "had a great, I've always had a great respect for the series. Uh, I was pretty good at it when I was younger, but I just don't play that much anymore. Street Fighter Alpha 3 is actually my favorite one. Um, and uh, so I convinced the guys that maybe we should just do a little impromptu tournament and we broke out the Colin Greg Live whiteboard to do it. So we're all going to play each other once, have a little standing, just see what happens, see where we all stand at the end. We can use whatever characters we want. I suggest we just use the question mark in the middle to randomly select our stage. There's only seven options anyway. And then uh, we'll go from there. So the first battle is going to be Nick versus Tim. Let's do it. Nick, how badly are you going to pummel Tim? I'm going to get, I probably will get beaten this. I'm not, I've never actually been very good at Street Fighter, but I love Street Fighter. How can you not? It's a classic. Got to go with my girl Chun-Li. I'm going to go with my boy, my boy Ryu. True.",
            "start": 33.68
        },
        {
            "text": "this. I'm not, I've never actually been very good at Street Fighter, but I love Street Fighter. How can you not? It's a classic. Got to go with my girl Chun-Li. I'm going to go with my boy, my boy Ryu. True story, named my cat Chun-Li in 199. True story, the ashes are in his room right now. Yep. God, wow. So Nick, remember when you sang the Street Fighter IV theme song? Yeah, that was good, it's unstoppable. Heavy kick, my a medium kick. Yeah, yeah, it's fun. Sorry, I apologies everyone. Four. So Ryu versus Chun-Li. Four. No, what part were you apologizing for? So I like that they have likes. So Ryu likes Japanese desserts, martial arts, and Mizu Yokan, which, oh, I guess that's the Japanese dessert. And Chun-Li likes other things. He should like mochi. Mochi are much better. Uh oh. Now Tim, do you use the D-pad or do you use the actual analog stick? Uh, go back. Okay. Oh my God, look at them. The British, the character that I'm using to. All right, so Ryu versus Chun-Li in the Training Station. Ooh, now I heard there's an Easter egg in the.",
            "start": 65.64
        },
        {
            "text": "analog stick. Uh, go back. Okay. Oh my God, look at them. The British, the character that I'm using to. All right, so Ryu versus Chun-Li in the Training Station. Ooh, now I heard there's an Easter egg in the background. You can see the platform from Harry Potter. Oh, it's not true. Nice. But Greg got juiced when I said that. Wow. Okay, get that ass beat. So far, Chun-Li stepping in with their massive thighs, just like your cat. Yep. Chun-Li, my cat had massive thighs as well. What did I do? You hit. Did I do anything? Me? That was me. Wasn't me? Me? Might have been you. Just, just go back to it. What the fuck was it me? It must have, 'cause you're, it's on your. Just hit option. I option. We got, we got it. We got it. Ready? Not a good start. Well, it was a good start. It's actually a really good start for. Oh, there we go. The old step on your head. The step in the head. That, that was my, my go-to in Street Fighter. So obnoxious. Now Colin, you know a lot about British history, right? Do the Mounties in the back there, do they actually play?",
            "start": 108.52
        },
        {
            "text": "your head, the step in the head. That, that was my, my go-to in Street Fighter. So obnoxious. Now Colin, you know a lot about British history, right? Do the Mounties in the back there, do they actually play band stuff like this? I thought they couldn't move. Talk. They're not Mounties, but um, I think that's eye to the holder kind of thing. Canadian. Uh, but no, they usually don't rock out like this. This seems to be humorously British. Ow. Okay. Kind of like Gary Barlow. Exactly. God damn it. I keep hitting it from the analog stick. So it's weird that you hit it and then it's the player one that says it's a out of it. Well, because he has pause too. Because gotta, gotta, got, got me there. That threw me out for a second 'cause I'm like, I'm not hitting this. I don't think I used to hit it all the time when we were playing on Xbox 360. That was problem. I'm no more Xbox 360. All right, so Nick's up with Ryu, one nothing. You like using those soft, those light Dragon Punches, huh? Oh, they're annoying. They annoy more than anything.",
            "start": 170.52
        },
        {
            "text": "Xbox 360. That was problem. I'm no more Xbox 360. All right, so Nick's up with Ryu, one nothing. You like using those soft, those light Dragon Punches, huh? Oh, they're annoying. They annoy more than anything else. They don't really actually too much damage, but they're also easy. Pretty good. I can't use you. I can't, I can't really get the um, so how do you guys think feels? It's good. It's getting a lot of not the content so much, but the way the way plays, people are really liking it. Oh, oh, that was a nice timing on that fire. Damn it. I'm trying to do my special. Look, those punk rockers back there. I know they're got axe. They're bothering this old man. This old man just wants to watch a fight in the train station and these guys are like, hey man, you ever hear a Jimi Hendrix? Damn it. Right. Nick takes it. That special. I don't know how do you use V-Trigger again? It's just both heavies. I know it's supposed to be the, the Heavies, which are that's L1 and R1, but it wasn't doing. All right, Tim and Greg. Well, here, let's, let's skip.",
            "start": 218.68
        },
        {
            "text": "know how do you use V-Trigger again? It's just both heavies. I know it's supposed to be the, the Heavies, which are that's L1 and R1, but it wasn't doing. All right, Tim and Greg. Well, here, let's, let's skip over to me and Greg and we'll, we'll mix it up a little bit. Okay, this is the second win for player one. Kevin, can I trouble you to go and get my coffee? It's on the table. Daddy needs, Daddy needs some caffeine. It's how I compete. You just won without the caffeine. Nick's the caffeine. Seems like you should, you should just embrace your caffeine-free life if possible. Ken. Hey, I was waiting for you. I'm going to look for Ken. Looks demented as hell in this. Ken does not look. Who's this guy? New guy. I don't know who that is. Rashid. Rashid. Rashid. Now Ma, a professional wrestler. What's Laura's story? She's a Brazilian. She's a dancing stuff. That's fun. Karin. I knew a Karin was. Does it spell like that? Nash, like Kevin Nash. Why does Nash have half his face missing? Whoa. Birdie looks like my kind of man. All right, you like.",
            "start": 293.32
        },
        {
            "text": "she's a dancing stuff. That's fun. Karin. I knew a Karin was. Does it spell like that? Nash, like Kevin Nash. Why does Nash have half his face missing? Whoa. Birdie looks like my kind of man. All right, you like Birdie? Yeah, why not? Look at him. You like that Alpha? Oh my God, look at that. God damn, that's BDSM. He likes beef jerky. Just food, food. That's my kind of man. Yeah, you do like beef jerky. He likes beer, beef jerky, and food. Oh, fuck, this guy's my bro. It's on now. Birdie is one of the weird ones they brought back for sure. What is he from Alpha? Yeah. And then was in, was he in IV? Maybe one of like Ultra, Super, Mega Fight ever. Now Ken's your favorite guy, but you hate how he looks now, right? I love Ken, but he looks, I won't play Ken anymore because of how he looks. Refuse to. I'm just saying, people use Ryu and Ken. Come on, bro. What you think that there's a complete and total lack of uh, creativity in those two characters? They're classics, man. That was from the era of palette swapping. Oh, cool. That's a lot of.",
            "start": 345.48
        },
        {
            "text": "Ken. Come on, bro. What you think that there's a complete and total lack of uh, creativity in those two characters? They're classics, man. That was from the era of palette swapping. Oh, cool. That's a lot of damage. Oh God, you should go as this guy for Halloween. I know, right? I got to get out the corner. I kind of feel like I live my life one day as Birdie at a time. You got him in the corner. You got tie him up in the corner again. Oh, that was pretty, that was pretty Dragon Punch. You got closed with that nasty Dragon Punch. Got to get in, right? I'm trying to get it in all day. Greg, stop flexing your belly button and get in there. There you go. You got cover. You got, you got reach on him and about 300 pounds. Oh, oh no. Oh, that was close. Oh man, damn, you gave me a run there. Got corner. I like how they gave Birdie like, did he always had that mustache thing, beard thing? He liked to think he did. He did. In my backstory for him, he always did. Came out of the womb looking like this before his mom left him on a fire uh, department stairwell. A.",
            "start": 398.28
        },
        {
            "text": "that mustache thing, beard thing. He liked to think he did. He did. In my backstory for him, he always did. Came out of the womb looking like this before his mom left him on a fire uh, department stairwell. A beautiful human. It's like the beginning of Super Mario Bros. Movie. That was pretty. He has sheer girth. Colin getting nasty. He ain't trying to get hit once. Jesus. If only we understood what any of the letters at the bottom of the screen meant. It means I'm from California. It knows we're playing in California. It's pretty cool. It's pretty good. Are you kidding me? All right, so maybe me and Tim next. So Greg. Colin. Colin comes out, boy, you can eat. Where the heck are you pulling all that food from? That mean this is maybe one of his things in the game is like he pulls a hot dog out of his butt. Like a what? A hot dog out hot. You're player. All right, so now I assume you'll play as Chun-Li. Yeah, I like to keep a classic. I want to get that super at least once during this tournament. Can we take a second to.",
            "start": 449.52
        },
        {
            "text": "a hot dog out hot. You're player. All right, so now I assume you'll play as Chun-Li. Yeah, I like to keep a classic. I want to get that super at least once during this tournament. Can we take a second to realize that Portillo is wearing a Deadpool shirt and actually really likes it? Give me a rack zoom on him. No, can't afford the rack zoom apparently. Hey, I was waiting for you. They've been fighting each other for like 25 years. Yeah, she looks great for a 64-year-old. So to see that matter, this takes place in between Street Fighter III and IV. Does it? Yeah, really? Canonically? Yeah. You want to see my Kung Fu? No, I'll show you. Okay, be fair, you didn't wait for me to answer. I was give that question for a thought. Let's turn up round one with my man bun. Does that count as man bun? Looks like it's got like more hair coming up the top of it. Kind of like a high ponytail. It's more of a stiff, like a more of a ponytail. Damn, I'm just going to call this. I think that it might be fair to say at this point that Colin is a favored.",
            "start": 514.4
        },
        {
            "text": "up the top of it. Kind of like a high ponytail. It's more of a stiff, like a more of a ponytail. Damn, I'm just going to call this. I think that it might be fair to say at this point that Colin is a favored person win in this whole bracketed tournament. Sure. Not to discredit you and me both. I'm sure we'll give a rousing match toward one another. Our is going to be the stuff with Legend RX. They're going to call that Ali versus Foreman. Wow. Yeah, they didn't, I don't think they fought. I saw the 30 call getting lit up literally and figuratively. Look that guy in the back. He is dope about it. Oh yeah. What's that guy doing a little dance? If I saw two people, what's that guy doing a little dance? Could you imagine sitting at a train station and just seeing two people wreck each other like this? They're making, they're bringing fucking cosmic fire out of nowhere. Yeah, I wouldn't be playing music. I'd be running. No, yeah. Why is the British marching band again? Those guys are going to be in trouble with the Queen.",
            "start": 576.6
        },
        {
            "text": "they're bringing fuck cosmic fire out of nowhere. Yeah, I wouldn't be playing music. I'd be running. No, yeah. Why is the British marching band again? Those guys are going to be in trouble with the Queen. That was pretty, that was. Oh no, he's stunned. Damn. You better pull this out. Oh, fuck, Tim. Fuck. Stepped it up. He stepped up to the streets. Oh no, I, oh my God, he's right on the edge. The performance thing. I, you got one hit. You got to get just sweep the leg. Sweep the fuck leg. There you go. Punch the dick. Dick. The old dick blow. Dick punch for the win. I'm missing all the dick blow. I got my combo. That's all I wanted. Pretty final round. That was pretty. Get hype. Damn that recycling. Oh, the janitor fell down. All right, buddy, get back up. You guys, you have your reversal meter by the way. I just want you to know that it's almost there. Holy fuck. Yes, yes. Just kicked my foot hell hard like that. Trying to go soft like me, medium like me. Tim made me sweep that one out. All right, so why don't Greg and Nick go next? Hope.",
            "start": 629.44
        },
        {
            "text": "it's almost there. Holy fuck. Yes, yes. Just kicked my foot hell hard like that. Trying to go soft like me, medium like me. Tim made me sweep that one out. All right, so why don't Greg and Nick go next? Hope you're ready, buddy. Kids gloves are off. I have to pee. I don't like competition. It makes you want to pee. Who, who do you have your money on in this one? I'm going Greg. Now Nick, some way to go. I'm going sheer Greg. My, as in every fighting game, what I struggle most with is just moving forward at a normal me. Why? So I'm on the left and you're on the right. You did something controller. You did something controller. Is that wrong? Am I wrong? It's going to be easy for us now, but then yeah, the control, it would flip for the audience. That's how it's been the whole time. All right, whatever. I've always been on left. Uh, where's this my boy Birdie in your head, Greg? Is there a left advantage? I, there's definitely advantage. Yeah, 'cause you're always constantly, it's easier to do that than it is the other way. Seven foot one.",
            "start": 685.36
        },
        {
            "text": "on left. Uh, where's this my boy Birdie in your head, Greg? Is there a left advantage? I, there's definitely advantage. Yeah, 'cause you're always constantly, it's easier to do that than it is the other way. Seven foot one and 57. His job is family freeloader. Lot of uh, lot of parallels here between the two of you. Oh yeah, Birdie and Greg Miller. The GameOver Twitter handle. GameOver Birdie. The weird chains that you walk around with. I do like looking my chain. You know, imagine that Portillo is on the end of that chain. You look at the bar. The wait, which one is my Hard Punch? My hard look happy as fuck. Hard Punch should be uh, on the right and right and kick on. No, punches on their left and the triggers. We're playing with controllers, sticks. I'm also not nearly good enough to play with sticks. Any. Doesn't matter. This is a grudge match here. Oh man, that bear is just hanging out there. I'm more enamored by the bear. Fuck. Everything seems to be somewhat of a stereotype. All the backgrounds. There's people. There's Russian.",
            "start": 760.24
        },
        {
            "text": "match here. Oh man, that bear is just hanging out there. I'm more enamored by the bear. Fuck. Everything seems to be somewhat of a stereotype. All the backgrounds. There's people. There's Russian people doing Russian dances on top of fuck Russian dolls. Giants. It's awesome. No, there's a two bears in the background. One with a hammer, one with wheat. I looked away for one second. Next thing I know, Greg's freaking guy covers ground very quickly with this. Oh, fuck. Grab his fuck face, man. Swiping right through his hair. Nice. Tim, there's something about the modern Street Fighter and I just can't wrap my head around. Like for some reason, they just feel different. They do. They, yeah, they feel the game feels a little heavier to me, but I don't, don't know if that's really true. You know, like it's just weird. I don't understand how people can be as good as they are. Like it's crazy to see like not even top level, just like people that are proficient in this. Well, it seems like you were doing some, you know, you were.",
            "start": 820.48
        },
        {
            "text": "understand how people can be as good as they are. Like it's crazy to see like not even top level, just like people that are proficient in this. Well, it seems like you were doing some, you know, you were doing. That's all I do with. Hold on, can you give me one sec? Figure out what my Hard Punch is. Sure. Is it going to hit me? Is that it? There it is. Sorry. Fuck. My bad. Here. Now let me hit you once. All right. Now. All right, back. Oh, nice. Took me a second. I was walk around. He need to shit himself. He probably does 500 pounds. He, he must take massive shits. Birdie definitely takes massive dumps. Fuck. Oh, oh no. You can hear from the sound of Greg's controller that he, he has this under control. I was going to say, I've been sandbagging for a while, so you know, now it's nice to see it all start paying off. I can do that again. How can I do that again? That would have been. Oh, oh no, I lose. Damn. Good job, Greg. No problem. And Birdie got a thing going. I wear the pink. God damn. All right, look, Donuts. Let's do Nick and I now and then Tim.",
            "start": 901.08
        },
        {
            "text": "can I do that again? That would have been. Oh, oh no, I lose. Damn. Good job, Greg. No problem. And Birdie got a thing going. I wear the pink. God damn. All right, look, Donuts. Let's do Nick and I now and then Tim and Greg can end it. Nick on Colin. We're calling on Nick. Depends on what your preference. It's on you. Nope. Nope. I like the kind of wear like Flashdance. A little sexy. Oh, sexy doggy. Oh yeah. You need to hit start and go down the character stage. So right now Nick has one win. Colin has two. Greg has one. I have none. Let's make that clear. I think you got one over me. I think you pick it up. I don't know. So I guess I'm getting worse as it goes. Apparently, start off best game number one. Yeah, going downhill. Classic match up. What is uh, what's left trigger then? Does anyone know the R and L? R Fierce was all of them together. Them together. It makes sense. That's why I keep doing that special move 'cause I just keep, keep hitting that. Fuck. Whoa. We got some dancing ladies and men and and a two on the back there. The.",
            "start": 976.36
        },
        {
            "text": "together. Them together. It makes sense. That's why I keep doing that special move 'cause I just keep, keep hitting that. Fuck. Whoa. We got some dancing ladies and men and and a two on the back there. The classic match. This is the path, our friend versus friend. You think hair versus dope hair? Apparently he knew this was his path. I, is this like a knockoff Ryu? This is, I think, or did it makes me think of Fast & Furious. Yeah, it looks like a. Then that makes me sad 'cause I think of that Wiz Khalifa song. Oh, you got, you fuck, you, you gave me that one little delay of getting back up. That's cool. That spinning animation is really cool. I wish I had more time to dedicate to this. I really love fighting it. I just don't get him sense. Like I always like late night. Well, I mean, I haven't played this since Street Fighter. I got a long time ago now. Four years ago. I remember when my brother came home with ITC. Was awesome. Oh, son of a fuck. See, Greg, Chun-Li is a charge character. Means good. Her characters like charge up like.",
            "start": 1046.84
        },
        {
            "text": "I got a long time ago now. Four years ago. I remember when my brother came home with ITC. Was awesome. Oh, son of a fuck. See, Greg, Chun-Li is a charge character. Means good. Her characters like charge up like the quarter circle punch thing. I'm not good at it, but I like Chun-Li. You know, got to rep it for that. Scorpion, Sub-Zero, Reptile are all related somehow. They're, they were similar clothing. Exactly. They're all reskins of the same game. And Sub-Zero are brothers, I believe. Reptile, some kind of lizard guy who hung out. He's their pet. He got hit with the Ooze. Yeah, he was the iguana they all had. And then he took what he learned. You see the Ninja Turtles reference in The Division? No, it's a super small pizza box with Nunu on it. That cool. 'Cause in New York. Yeah, you assume the virus killed the turtles though. Nice. I don't know about that. I've been reading the all I know is that it's SE transmitted. The Batman/Ninja Turtles comics. Big fan. I'm enjoying them. They're really cool. I like they dark. Yeah, I like when he's like this. You.",
            "start": 1103.92
        },
        {
            "text": "about that. I've been reading the all I know is that it's SE transmitted. The Batman/Ninja Turtles comics. Big fan. I'm enjoying them. They're really cool. I like they dark. Yeah, I like when he's like this. You know, this city is just an open field in our universe. Beat the fuck up, Nick. You almost have this. This like when you put Goonies instead of Goonies II. That was crazy. That was close. Good. That was a close one. Final match. Uh, Tim versus Greg. Tim or Greg? You take M. Tim, you take Nick's. Keep you on the same side. You do everything 'cause you're first player, bro. H. I enjoyed fighting with you. Beats everyone. Do we all just tie for third or second? Two. Well, I think Colin won already just by default. Yeah, but Tim, if you beat Greg, then we're all have one win. Oh, if you win, you get second place. No pressure. God, no pressure. But you were the one before that started saying that you were like, you pull me aside. You threw up in the locker room. You were like, I don't want to go out there. I can't do it. I haven't played Street Fighter.",
            "start": 1165.84
        },
        {
            "text": "but you were the one before that started saying that you were like, you pull me aside. You threw up in the locker room. You were like, I don't want to go out there. I can't do it. I haven't played Street Fighter since the death of my parents. My parents were killed by superus. I could have got in a car with them, but I chose to play Street Fighter instead. I could have saved their life. Chun-Li versus Birdie is the final fight. And then we'll show you the records, the score sheet here. It's going to take place on a bustling side street. Yeah, just where we wanted it to end. Yeah. Chun-Li likes, look at my thing go through by a thing I often do. Whoa, look at your thing go. My thing. Whoa. You want to see my Kung Fu? I'll show you. I like, like how fight. I like, I was going to say, I like the art. Why can't like, yeah, the art's awesome. The animations are awesome. It's a lot of little things going on. It's just all completely absurd. All completely absurd. Like Chun-Li's quads. There's no way human being should have quads that way.",
            "start": 1221.68
        },
        {
            "text": "awesome. The animations are awesome. It's a lot of little things going on. It's just all completely absurd. All completely absurd. Like Chun-Li's quads. There's no way human being should have quads that way. Putting it out there. She's always had big quads because she's a kicker, just like her cat. Yep. How big were, how big were the quads? Not very big. She was a little, she was a little cat. She was a sweetheart. I miss her very much. She lived for 17 years. Oh, fuck. How'd you get that out of there? Come on now. Come on back at the end of it. What did, what did it look like for you there? What the cat? Yeah, she was skinny and and sick. You had her crated. Yeah, she actually died charging like you were talking about. You told, you telegraphed it from the start and I didn't even think about it. The charging. She was just riding her hog down the road. That was my trigger. She went the way she lived. How you do that? I, I hit all the shoulder wheels hard. Wait, who won that one? Oh, fuck. Tim. Tim looking for a win here. Just got on the.",
            "start": 1272.28
        },
        {
            "text": "her hog down the road. That was my trigger. She went the way she lived. How you do that? I, I hit all the shoulder wheels hard. Wait, who won that one? Oh, fuck. Tim. Tim looking for a win here. Just got on the board just for some respect. Oh, Tim actually gave me the hardest fight of all of you. He did. I rolled over Greg and I basically rolled over and show, showed you our. Now none of us are using. It's going to piss off every Street Fighter purist 'cause none of us are using whatever those things are at the bottom. Oh, we're not playing the shit. We're just having fun. Who cares? I've said that I could go MLG if I want to. Fuck, fuck, fuck. Oh, that was hilarious. I like when it degrades into a slapping match. We go. He does so much damage. Spinning Star Kick. Tim, I don't want to alarm you, but you need to not let him hit you anymore. No, final match. Damn it. Damn it. Damn it. All of it on the line. Tim, you're so close. You can pull this out, bro. We can all tie for second in a true Kinda Funny way. 38 tie for second, but.",
            "start": 1319.36
        },
        {
            "text": "hit you anymore. No, final match. Damn it. Damn it. Damn it. All of it on the line. Tim, you're so close. You can pull this out, bro. We can all tie for second in a true Kinda Funny way. 38 tie for second, but not with fuck like that. You got to get better immediately at the game. Whatever you're doing is not working. Maybe do some sort of counter or a combo break and press hit so hard. Fuck. Sorry. How was that happening? 'Cause I keep you trying to like do the damn thing. All right. I was hitting the play, but that's you have to do. No, you have to get, you got to do it. What do I? So hold on. No, don't. You won. Hold on. But V-Trigger. I'm hitting all the buttons. What, what the fuck? Your shit's not full. I have to what? Your shit's not full. Oh, wait, I thought it was close. Now it's full. It's not. It's not. I'm dead. I'm you're looking at the wrong screen. Oh, Tim pulled it out. Three ways high. Got fuck. Nick, you're saying it's full. I know it's not full. Fuck. I'm not that character. Nick, it's on the right side of the.",
            "start": 1377.8
        },
        {
            "text": "you're looking at the wrong screen oh Tim pulled it out three ways High got **** Nick you're saying it's full I know it's not full **** I'm not that character Nick it's on the right side of the screen the whole thing was full I'm not that character in the comments below tell Greg he's an a-hole everybody in the comments below please show Nick how to read the **** bars here we go the board my guy Le was on the left third win for one very compelling as you can see here everyone one and two mhm your boy Colin M dinino mhm no don't Don't Clap because that wasn't very good Vincent Janito **** you beat you Mark Ryan **** you Colin can beat you whoever plays is really good on Twitter **** you damn you guys are being really man we're hyped, man I'm gonna put it out there you know back in the day Greg when the Brazilians brought Jiu-Jitsu to the world they had a standing invitation anyone could walk into their dojo in Brazil and challenge them and they would beat the **** out of him right",
            "start": 1446.56
        },
        {
            "text": "Greg when the Brazilians brought Jiu-Jitsu to the world they had a standing invitation anyone could walk into their dojo in Brazil and challenge them and they would beat the **** out of him right now I'm throwing that out there to you you think you're good at Street Fighter someone we know preferably who already knows what this place is we don't have to go through that whole rigmarole challenge Colin yeah he will fight you Betty White he'll kick the teeth out of your **** face don't challenge me please challenge him we want to show you Street Fighter V on PS4 and PC it's available now it's pretty fun I know it's a little content light according to a lot of people so I don't have much of an opinion on that but it seems like it's a lot of fun and people are going to enjoy it so check it out if you want you don't want to oh well sorry we didn't play it very well but we like to see it anyway we'll see you next time on Kinda Funny Games bye J entro will man leave all I'm saying",
            "start": 1498.0
        },
        {
            "text": "it out if you want you don't want to oh well sorry we didn't play it very well but we like to see it anyway we'll see you next time on Kinda Funny Games bye J entro will man leave all I'm saying Betty White Sucks Betty White does not suck I like Betty a lot",
            "start": 1529.08
        }
    ]
}