{
    "id": 1542,
    "video_id": "_MlS1xqu6GE",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Socialism - The GameOverGreggy Show Ep. 114 (Pt. 2)",
    "description": "Colin Moriarty wants to know what everyone thinks about socialism.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1455004800,
    "duration": 1996,
    "transcript_chunks": [
        {
            "text": "Hey everybody, it's me Greg, and guess what? I am up for Most Entertaining Online Personality at the South by Southwest Gaming Awards, and it would mean the world to me if you went and voted for me. Of course, every time we win one of these things, it's a win for Kinda Funny, and it's a win for you because we get to go there and be like, hey, people who've never heard of us, guess what? People like us. And everybody goes, who are you? And they go, maybe I want to be a best friend, or they're jerks and they say, we'll stay away for everybody. So if you go to KindaFunny.com/SXSW and vote Greg Miller for Most Entertaining Online Personality, I would take it as a personal favor that I will never ever be able to repay you for. Colin, yes, what's your topic? Let me take you on a walk. Oh yeah, take my phone out. It's gonna be another juicy topic, isn't it? That last one was 45 minutes. So the caucus happened, the Iowa Caucus happened, and really before any of this happened, we're hearing a lot about the word",
            "start": 0.08
        },
        {
            "text": "out. It's gonna be another juicy topic, isn't it? That last one was 45 minutes. So the caucus happened, the Iowa Caucus happened, and really before any of this happened, we're hearing a lot about the word socialism, right? And what I'm realizing, you know, first of all, no one was talking about socialism in this way, maybe since before World War II in the United States with the labor movement, all that kind of stuff. But really like, you know, we're hearing this word a lot again, right? It's against, it's not an American really tradition, but there's always been socialist elements and communist elements in the United States. Um, and that's fine, that's your right to be a socialist or a communist. I'm not calling Socialist Communist, by the way. But what I saw this image going around today was on this hashtag socialism checklist, and this is because, you know, basically there was a virtual tie in Iowa and Bernie Sanders and Hillary Clinton both walked away with, you know, delegates and they're going to go to New",
            "start": 49.76
        },
        {
            "text": "checklist, and this is because, you know, basically there was a virtual tie in Iowa and Bernie Sanders and Hillary Clinton both walked away with, you know, delegates and they're going to go to New Hampshire. I'm sure Bernie Sanders will win there, and then we'll see what happens in the South. And there's these kinds of Bernie Sanders images going on around right now about supporting socialism, and they drive me **** insane. Okay, insane. So I wanted to talk about this image and then talk about the definition of socialism and then get your, 'cause I don't really actually know how you guys feel about the idea of socialism, and people know how I feel, so I don't want to get too deep into it. But here's what the image says, and this, let's unpack this because I have a bunch of questions for you on this topic. Yeah, and this is what, there's a lot of, you've probably seen these images on Facebook, on Twitter. There's a lot of different kinds, and it's the guy, the people are posting it, it says, 'Socialist programs in the'",
            "start": 91.8
        },
        {
            "text": "and this is what, there's a lot of, you've probably seen these images on Facebook, on Twitter. There's a lot of different kinds, and it's the guy, the people are posting it, it says, 'Socialist programs in the U.S.' with Uncle Sam pointing like this. Okay, and it says, 'The Department of Agriculture, Amber Alerts, Amtrak, public beaches, public busing services, business subsidies, the Census Bureau,' goes on, 'the CIA, the Department of Energy, FEMA, the IRS.' Me like, and then they get into things that are Social Security, are socialist, Medicare, Medicaid, um, the National Weather Service, prisons and jails, the sewer systems, the United States Postal Service, the White House. Is what of what is that? And this infuriated me because I wrote on Twitter, I spot about six things on here that are actually socialist. So things like, you mean NASA is not a socialist organization? No, it's not. Uh, snow removal, not a socialist thing. Sure. Um, and so I wanted to talk about this particular idea that of new socialism in the United States where or",
            "start": 127.24
        },
        {
            "text": "NASA is not a socialist organization? No, it's not. Uh, snow removal, not a socialist thing. Sure. Um, and so I wanted to talk about this particular idea that of new socialism in the United States where or just generally where the government spends money and therefore it's socialist, right? Is it, what is the point of this image? The image, the image is to say like, look at all the things socialism does in the United States and we already are socialists. But I mean, who's posting this and like, what's the, the, what camp is that coming? Is it, is it, it's from, it's mostly from Sanders or Sanders supporters, knock against socialism. Exactly. It's trying to diffuse the argument when people say, 'I'll never vote for him, he's a socialist.' The argument would be, 'But all these, you say that, but all these programs are social.' Right. Exactly. Thank you for explaining that much more. So before we get into that, I think that the, the, the, the concern I always see, and at least the one that I had to actually go look up and I",
            "start": 175.04
        },
        {
            "text": "social. Right. Exactly. Thank you for explaining that much more. So before we get into that, I think that the, the, the, the concern I always see, and at least the one that I had to actually go look up and I totally forgot the two definitions now, is that a lot of people mix up socialism with Communism. And Communism obviously has such a negative stigma, our history, disaster, right? That people automatically think, 'Oh, he's a socialist, that means he's, you know, we're, our entire economy is going to crumble because of, because it's exactly like Communism.' But the two are different. They are different. Socialism, the tenets of socialism come from Communism, right? Undeniably, unequivocally, historically, intellectually, 100%, no arguing that, right? The idea that the government spends money on something and therefore it is socialist is **** absurd. And it's, and it's this idea, the Romans had a military, the Romans had roads, aqueducts, the Romans had public entertainment at the Colosseum that was paid for by the government.",
            "start": 217.4
        },
        {
            "text": "socialist is **** absurd. And it's, and it's this idea, the Romans had a military, the Romans had roads, aqueducts, the Romans had public entertainment at the Colosseum that was paid for by the government. 2,000 years ago, were the Romans socialists? That's an absurd, not, you know, like, were the Visigoths socialist because they had a military? The **** Mongols. So where's the threshold? I want, yeah, time out and read your definition of socialism. So this is what, this is what socialism actually means, and this is why we have to have definitions of words. You can't just walk around, call yourself Socialism or say socialism is something. This is what socialism actually means, and you're not allowed to have your own opinion, like your own definition of it. It's just not the way it works. It's a now a political and economic theory of social organization that advocates the means of production, distribution, and exchange should be owned or regulated by the community as a whole. So it is a spin-off of the idea of",
            "start": 261.52
        },
        {
            "text": "and economic theory of social organization that advocates the means of production, distribution, and exchange should be owned or regulated by the community as a whole. So it is a spin-off of the idea of Communism where, um, each according to, each according to his means, each according to his ability, kind of thing, where it was basically like, you're going to do what you can and you're going to get what you need, and that's it. So this is, this is like a few steps away from that, basically saying that, um, we, the, the, the people or the government control the means of production, which isn't a reality in the United States or in most socialist countries in, in the world. Um, is or is not, it is not. I mean, the means to, there are certain European countries that are quote unquote socialists. Yeah, there's a lot of them that practice tenants of socialism, and that's where I kind of come in where we do have pieces of socialism. Medicare and Medicaid and Social Security and disability insurance and, and welfare, these",
            "start": 302.32
        },
        {
            "text": "that practice tenants of socialism, and that's where I kind of come in where we do have pieces of socialism. Medicare and Medicaid and Social Security and disability insurance and, and welfare, these are all socialist programs. There's no doubt about that. But just because the government spends money on something doesn't make it socialism. So I wanted to dispel this notion, first of all, that that socialism, that's not socialism. That's really not a very smart thing to say. Well, then what is it? Socialism is the idea. No, not socialism. What is, what they're saying, these are, these things are more like part of the social contract. It's part of the functions of a government, you know what I mean? Like, right, that's the whole point of having a government, right? Like the government collects taxes, the opposite of, you know, like it's, it's not to say that there's like these polar opposites of, well, without any government, there's no government. Obviously, there's Anarchy. I mean, that's true, true. But just because the",
            "start": 343.56
        },
        {
            "text": "you know, like it's, it's not to say that there's like these polar opposites of, well, without any government, there's no government. Obviously, there's Anarchy. I mean, that's true, true. But just because the government works on behalf of its people or does something for its people, whether it builds a road or it has a military to protect it or whatever, that's not socialist, that's a government. But the problem, the problem comes in because when you look at socialist countries, those are functions of, of the government. Exactly. And that's, and that's what I really wanted to get down to agree with you guys because I don't want to talk too, I mean, people can hear, I mean, I type especially on our Facebook group with our good friends there or whatever, I talk about it a lot and I talk about it on Twitter that I, I, I, along with 50% of Americans, according to Gallup, unequivocally would never vote for a socialist and never vote for socialism. I don't deny that we have pieces of socialism, yeah, but I do deny the",
            "start": 379.4
        },
        {
            "text": "I, I, I, along with 50% of Americans, according to Gallup, unequivocally would never vote for a socialist and never vote for socialism. I don't deny that we have pieces of socialism, yeah, but I do deny the revisionist history that says that FDR was a socialist or Obama was a socialist. FDR ran away from the, the term socialist. People called what he did socialism, and what he was doing was pieces of socialism. The New Deal was a socialist program, but he wasn't proud, he wasn't on the pulpit talking about how he was a socialist. And Obama, as we all know, certainly ran away from that term at a thousand miles an hour, and if he didn't, he would have lost. So people need to kind of like rein those things in. But what I'm more curious about with you guys is, and, and our view out there who have, you know, a lot of different opinions depending on where they are and everything, do you believe in the tenets of socialism and do you think that those going to work in the United States? And what I mean by that is, should",
            "start": 413.04
        },
        {
            "text": "opinions depending on where they are and everything, do you believe in the tenets of socialism and do you think that those going to work in the United States? And what I mean by that is, should we have the basic things that basic Democratic Socialist countries have, like in Scandinavia or England? Should the government give us all healthcare? Should they pay for college education? Um, should there be paid leave for women that have, uh, a baby? These are pieces of democratic socialism in Europe, for instance, that we don't have here at all. Um, and I'm curious if you guys think that that's what Bernie Sanders would say is a right, you know, um, or is it something that is not part of our capitalist Republic? You know, and I don't know if you guys have thought about it deeply or anything like that, but I thought about the healthcare issue very deeply now. I mean, I'm split on it. I, on the one hand, I'd love it if, uh, healthcare were socialized. I'd love it if the government just said, you know what, no more",
            "start": 450.28
        },
        {
            "text": "thought about the healthcare issue very deeply now. I mean, I'm split on it. I, on the one hand, I'd love it if, uh, healthcare were socialized. I'd love it if the government just said, you know what, no more insurances. You're just going to go and you're, we're going to tax you, you know, we're going to tax you another 10% on your, uh, uh, income tax, and guess what, that's going to go toward universal real universal healthcare. Not this Obamacare **** where the only thing Obamacare has really done, and to be fair, it's only been in existence for two years, the only thing that's really done is has allowed anyone who wants to get healthcare to get healthcare, which is a step in the right direction. However, it's super expensive and the coverage sucks. But I would just, just from someone who, you know, has a wife and I want to see her taken care of regardless of whether or not I'm on this Earth, I would love just a basic, basic, basic necessity of something we could all agree on is saying like, look, no matter what's",
            "start": 490.32
        },
        {
            "text": "I want to see her taken care of regardless of whether or not I'm on this Earth. I would love just a basic, basic, basic necessity of something we could all agree on is saying like, look, no matter what's happening in a person's life, no matter what their social status is or, or, you know, where they're at with the, in the cast system or the class system, excuse me, they can at least walk into a doctor and get medicine or get a treatment for something without having to worry about going bankrupt for that. Uh, now that goes against all of my capitalist tendencies because I, I would veer way more right when it comes to, to fiscal politics than, than I think most people would give me credit for. We own a business, we own a corporation, and a lot of the ways corporations are seen in this world, in this United States, are, you know, we're demonized very much so, uh, for being capitalistic, and that's just the way it goes because sometimes, guess what, capitalism does run amok. Um, but the only thing I, you know, college,",
            "start": 528.0
        },
        {
            "text": "are, you know, we're demonized very much so, uh, for being capitalistic, and that's just the way it goes because sometimes, guess what, capitalism does run amok. Um, but the only thing I, you know, college, I don't know, you know, I don't, I don't really see, I don't see the, the, the, the concept of the higher, uh, education institutions being what they used to be, especially in this day and this digital day and age where people can basically quit college, teach themselves everything they need to, to, to know to be a millionaire and go be a millionaire. Um, I don't think they need to necessarily subsidize, uh, schooling. But as far as, as healthcare is concerned, it would be, there's just a part of me that's that, and I know it's kind of irrational, I know it's goes against the system we have right now, and it'll probably never happen, but I'd love to see us mirror something like what Canada has, which I don't really know how, I don't know really hardcore details on how theirs works, but I do know that you get",
            "start": 568.24
        },
        {
            "text": "never happen, but I'd love to see us mirror something like what Canada has, which I don't really know how, I don't know really hardcore details on how theirs works, but I do know that you get taxed a lot, you can walk in and everything's paid for. Right, right. But there it's not as, and it's true, like I, if, see, here's the thing is, I'm not, I don't believe in complete or like political orthodoxy. I really don't. That's why I'm a Republican who believes in gay marriage, or I'm a Republican who believes in, uh, a woman's rights to choose, because I think these things are congruent with Liberty. Um, and so I've often said that even though I'm fundamentally against socialist programs, like new socialist programs, like Medicare for All, for instance, which would be like universal healthcare for 300 million people, something that's not seen anywhere in, in the world, um, on that scale, if I believed and trusted that our bureaucratic system could handle it, yeah, that's the problem. Then, then there's a different story.",
            "start": 605.92
        },
        {
            "text": "something that's not seen anywhere in, in the world, um, on that scale, if I believed and trusted that our bureaucratic system could handle it, yeah, that's the problem. Then, then there's a different story. But what am, who amongst us looks at the American government, the most inept piece of **** bureaucracy at the federal level that might ever have existed, that can't do anything right, nothing? And we just want to hand more over to them. That's the thing that scares me so much is the federal government is inept and they're corrupt and they are, they are greedy and they are insatiable and they want everything. That's the problem with your, your example of asking us what we think about it or whatever. I haven't thought too much about it because I don't think they can pull it off. That's the whole thing with Bernie Sanders, right? If Bernie Sanders was up against Donald Trump or, uh, Cruz, right, the crazy one we were talking about earlier. Yeah, Cruz is like the, it's like, well, I'm vote for Bernie Sanders out",
            "start": 640.4
        },
        {
            "text": "Bernie Sanders, right? If Bernie Sanders was up against Donald Trump or, uh, Cruz, right, the crazy one we were talking about earlier. Yeah, Cruz is like the, it's like, well, I'm vote for Bernie Sanders out of that. You know what I mean? Like, in the same way, I understand that like, I don't think, you know, Trump's wall or, you know, taking down Roe v. Wade and all these other things could happen on that side. I also don't think that Sanders would be able to come in and be like, 'All right, we're all socialists.' This is our, you know what I mean? Like, there's parts of it that work and make sense and, you know, I would like to see enacted. Sure. I, I think coverage for all would be great. You know what I mean? If that was how. But the thing is like, I, I think, I think that's great. I know it won't happen and it won't work and there's no way and our infrastructure couldn't handle it. Every time we talk, talk about these countries that do this, right? And how great it is, you're talking about a state that is, you know, the, that is",
            "start": 680.88
        },
        {
            "text": "there's no way and our infrastructure couldn't handle it. Every time we talk, talk about these countries that do this, right? And how great it is, you're talking about a state that is, you know, the, that is like the population of one of our states doing this now, times that, you know, 50 or maybe like 38, see some spread out. And that's when it gets just like, there's no **** way we could do it. That's the frustrating thing about the whole thing where it's like, you know, Bernie Sanders walk around, be like, 'Well, Denmark does it.' I'm like, Denmark has a population of New York City. So now let's, now let's like, let's back it up a little bit and figure out how we, how does our bureaucracy that can barely do anything right, nothing? Like, and, and I'm not, I'm not trying to be like over the top or hyperbolic in any, government sucks. Like, they're awful. And I don't, I don't, I don't think, I don't think the function of the federal government itself is awful. I don't think that a government is awful. Our government is",
            "start": 715.04
        },
        {
            "text": "government sucks. Like, they're awful. And I don't, I don't, I don't think, I don't think the function of the federal government itself is awful. I don't think that a government is awful. Our government is awful. And so like, we have an IRS that just exists just to tax you. We have these, like, we won't even audit like the way Congress spends money. They just give money away to anyone who wants it. They, they fill their coffers with pork barrel spending and just have these little pet projects and stuff. Like, we just, we just throw money like it, like, like it's nobody's business. Meanwhile, we passed 199 trillion in debt. Meanwhile, what Bernie Sanders is suggesting would basically double it. Yeah. You know, and, and we have, we, we just don't have this notion in our minds of like, well, we want these things. And these things in an ideal world are great. It would be great to say like, go to college, young man or a young woman, and we'll pay for it. You have a, you have a, a terrible illness, the government will take care",
            "start": 754.12
        },
        {
            "text": "things in an ideal world are great. It would be great to say like, go to college, young man or a young woman, and we'll pay for it. You have a, you have a, a terrible illness, the government will take care of you and all this kind of stuff. But where does the money come from? And why do we trust that the federal government that can't do anything is now going to suddenly take control of one sixth of our economy and more than it already has control of, which is an enormous amount of the economy already, and do it right? I don't know. It just like, oh no, there's no doubt. I mean, there's no doubt. That's the problem is that like, again, it's, it's always that constant struggle about the world you want to live in versus the reality of the world you live in currently. Like, I want, I'd love nothing more to live in a world where that, where the idea of just going to see the doctor was like not terrifying to me, you know? And I don't mean terrifying that I might have something bad, terrifying that like, I'm going to go",
            "start": 790.36
        },
        {
            "text": "world where that, where the idea of just going to see the doctor was like not terrifying to me, you know? And I don't mean terrifying that I might have something bad, terrifying that like, I'm going to go see a doctor who's got way too many **** patients and is so scared to render an opinion on what's going on because he doesn't want to get sued, um, that he basically just kind of prescribes whatever the **** antibiotic is of the day and that's it, right? Uh, you take this, I think it'll probably go away, but, you know, don't come back is always kind of what you get. Um, I would love to see that system change. I would love to be able to actually spend a half hour with my doctor, talk about nutrition, talk about what I exercise, talk about all these things that I know my doctor knows about, 'cause he **** went to med school and they studied that there. But he's not going to do that. How, when's the last time you spent more than five minutes with the doctor? It's rare. It's rare. And that is that, that is the",
            "start": 827.2
        },
        {
            "text": "went to med school and they studied that there. But he's not going to do that. How, when's the last time you spent more than five minutes with the doctor? It's rare. It's rare. And that is that, that is the end symptom of this, of this, this, this cancer that is the, that is, uh, healthcare in this, in this country. It's just doctors aren't empowered to actually take care of their patients and they, they couldn't even if they wanted to most of the time because you probably don't have the right insurance for it. Also, you pay a **** ton of money at insurance and the idea of insurance in general is a flawed concept, right? 'Cause it's basically gambling. It's gambling that there won't be some gigantic natural disaster or **** plague that sweeps over the country that, uh, just, you know, puts half the people in hospitals, in which case insurance companies would go broke like that. It just wouldn't, you know, it's completely absurd. So that system in general is just kind of like a, oh, it's, it's a yet another",
            "start": 865.68
        },
        {
            "text": "in hospitals, in which case insurance companies would go broke like that. It just wouldn't, you know, it's completely absurd. So that system in general is just kind of like a, oh, it's, it's a yet another example of like why our country is kind of **** in that we all believe in this idea of health insurance when in reality all it would take is one big natural disaster to potentially turn that **** entire system on its head and that would be bad. But we all pay into it every month, hope to God nothing get sick. And the part is, when it comes to healthcare, you're what most people will tell you, what most insurance brokers will tell you, what anyone will tell you is, don't get sick. That's, that's your only way to not get **** by the system unless you're a millionaire. And that sucks. That's the way it goes. What do you think, Tim? I think this is all ideals and I think that it's good things to strive towards and you know what we're all saying is right where it's like, all right, this shit's not going to",
            "start": 902.28
        },
        {
            "text": "What do you think, Tim? I think this is all ideals and I think that it's good things to strive towards and you know what we're all saying is right where it's like, all right, this shit's not going to happen and that there's no way to actually make it happen. I think it's good to at least look towards that though instead of running away just because it's broken. And like, I, I definitely do not know the intricacies of all this **** at all. But like something like Bernie Sanders to me, I'm like, all right, at least he's standing for something. It's like, it's crazy and it's not going to work. But like, at least there is a vision and it's a good vision. It's a good thing. He's crazy for it. Like, from what I hear from you, he's crazy because there's no way to actually make that vision work and it's just talking out of his ass. But like, I like what he's saying out of his ass. I think those are good things, you know, and I think that putting that, you know, people voting for him if he were to win, I think that's a",
            "start": 940.4
        },
        {
            "text": "out of his ass but like I like what he's saying out of his ass I think those are good things you know and I think that putting that you know people voting for him if he were to win I think that's a statement and what does that statement cly is a stat I don't know Obama was a statement too and I I yeah I think but I think that that it's it's good at least in my opinion I think it's a good thing because then yeah with the House and the Senate and all this other stuff like he's shit he's not going to get anything done because of you know where they all lean and all their political games and shit like that but I mean it is a statement in a very good way that the top Guy believes in this shit you know and that I think inspires a lot of other people and Greg always talks about this in you know terms of video games and all that stuff but like eventually the the old people that made the rules are going to die yeah and I think that putting someone like Bernie Sanders um as president sets",
            "start": 977.48
        },
        {
            "text": "know terms of video games and all that stuff but like eventually the the old people that made the rules are going to die yeah and I think that putting someone like Bernie Sanders um as president sets us uh standard that people growing up going to look at and think oh those are the ideals this guy is telling me that I should want these things and I should believe that they're my right and I think that's a good thing because that's going to the next maybe not this generation maybe not next Generation but at some point there'll be people that grew up hearing that these are options that you could get healthcare and you don't need to worry about all this stuff like I'd shit love that but I don't know I I understand that that's not the reality we live in but that also to me doesn't make me want to give up and put someone else there that's just going to keep things going the same way or take them in a slightly different direction that's also not going to change anything you know that was",
            "start": 1014.92
        },
        {
            "text": "to give up and put someone else there that's just going to keep things going the same way or take them in a slightly different direction that's also not going to change anything you know that was really good that was the first time I've heard I was like that's a really good point of how this all works like I feel like that was the thing with Obama that Obama got elected twice on the you know hope and this and change like this I'm a young president and things will be different and then it's all the shit yeah and that's when I really am like it just doesn't matter doesn't matter who's in office and again like not that this really means anything but like Obama to people that don't understand I'm talking about people that are not you that are not people that are reading about politics constantly that are only like I don't know what the shit Iowa Caucus was until last night when I read about it but but I mean honestly Colin here's my thing though all that stuff but here's my thing is it's",
            "start": 1054.28
        },
        {
            "text": "that are only like I don't know what the shit Iowa Caucus was until last night when I read about it but but I mean honestly Colin here's my thing though all that stuff but here's my thing is it's like this is by far the first uh election that I am actually educated on and I'm not the most educated but this show has inspired me to understand what's going on and to want to know what these things are and I think that that's good because I'm sure there's a lot of people out there that want to impress you in the same way I do you know what I mean just a lot of them hate me too yeah well I'm sure but but again but those are the people that already know the politics I'm talking about I think that it's a good thing and the more that are people are like oh this is important and I do have a say and whatever and even if your say doesn't shit matter because you're just some kid and that's kind of my point here is like the Obama thing so many of my friends oh my God hearing them talk about",
            "start": 1088.92
        },
        {
            "text": "and whatever and even if your say doesn't shit matter because you're just some kid and that's kind of my point here is like the Obama thing so many of my friends oh my God hearing them talk about politics I'm like stop like you don't don't know shit I know you don't know shit because you don't read this stuff you don't actually know this stuff you hear something you heard something from someone else that said something to this person and like you're just kind of regurgitating information but at the end of the day they believe that Obama's a good thing and that there was hope and that there's this and that there's change and there's all this stuff it's a good message and I'm I'm happy that they believe that things could change so I'd rather that than just everyone be like well we're shit so whatever let's just keep going this that's true in the sense that it's the apathy that really kills me we've talked about those Citizens United which is like I thing that Bernie Sanders",
            "start": 1125.56
        },
        {
            "text": "shit so whatever let's just keep going this that's true in the sense that it's the apathy that really kills me we've talked about those Citizens United which is like I thing that Bernie Sanders talks about a lot which is like you know corporations infusing money into into campaigns and basically buying elections and stuff like that which is possible but I think the only reason it matters is because no one shit pays attention like if if the people and that's really kind of it's that's the ironic kind of um uh contradiction in one of Bernie Sanders arguments which is like on one hand he's like the businesses and the banks are buying the elections and this is an oligarchy in the United States we're not a democracy we we're never a democracy but we're not a republic anymore we're an oligarchy and like we're losing our control to the rich people and I'm like and he's like so we have to we have have to be revolutionary and get on the streets and stuff like that and I'm like but that",
            "start": 1159.84
        },
        {
            "text": "and like we're losing our control to the rich people and I'm like and he's like so we have to we have have to be revolutionary and get on the streets and stuff like that and I'm like but that only happened because no one cares right you know like that and that's like it doesn't M like Walmart could put a $100 million in an election but if you're paying attention and you know they're doing it because it's shit public they can't hide it you know then you know like well Walmart's in on this and this is like terrible and so you vote against their interest if you care that much but the fact is is that no one cares this much you know or few people do um what was it in 01 like 100 million people voted or something like that and we have 300 million people not that many of are not eligible of course sure but like you know cuz they're children um or they're you know not citizens or here illegally whatever it is but you we probably could have gotten double them any people voted if you were",
            "start": 1192.56
        },
        {
            "text": "course sure but like you know cuz they're children um or they're you know not citizens or here illegally whatever it is but you we probably could have gotten double them any people voted if you were if they were just engaged um you know I voted for Barack Obama in 2008 and and uh the only time I ever voted for a Democrat because I really did believe in his message of postp partisanship and his message of Hope and change and he was going to change things that like this gridlock you know you have to remember that in the mid 2000s the Republicans were in a really bad place way worse than we are now in terms of like we were in the wilderness man in a way that like we hadn't been in a long time with the war in Iraq with Bush um a lot of controversy about what happened in Ohio in 2004 with the election and all this shit like we were in bad shape and we lost the House and the Senate and this man came out and you know said like we're we know put a hand on like we're not going to like shit",
            "start": 1228.48
        },
        {
            "text": "election and all this shit like we were in bad shape and we lost the House and the Senate and this man came out and you know said like we're we know put a hand on like we're not going to like shit on you anymore like we could all work together but he lied you know and it made it made things like more partisan and it made things like way more partisan to the point where it's not been like this in the country for a really long time do you think it's a lie and this is always the question that I have when I'm watch people make bold-faced promises that you know they they don't actually have the means of or it's not even economically viable them to keep do you think it's a lie like a bold-faced lie or do you think it is that is their best intention and they want to go in doing that and then the reality of the the the office is that they really can't affect change because of the way the Senate and Congress is set up uh perhaps but the well that's there's two answers that question a the",
            "start": 1258.96
        },
        {
            "text": "the reality of the the the office is that they really can't affect change because of the way the Senate and Congress is set up uh perhaps but the well that's there's two answers that question a the Executive is not supposed to have all the power the House and the Senate are supposed to be the seat of power in the United States that's the idea the Republic It's a representative Republic so like the Executive is not supposed to just go in and be like well this is what I want this is the problem with Bernie Sanders like the House is just going to laugh at him you know largely Republican right the House is Republican more Republican than it's been in a 100 years almost right so like they're going to walk in and and he's going to be like well now we're gonna have Medicare for all no we're not you know like and we just we just barely got Obamacare pushed through that was my point is like Obamacare is like 5% of universal healthcare and like they that passed by like one or two votes and the",
            "start": 1296.08
        },
        {
            "text": "you know like and we just we just barely got Obamacare pushed through that was my point is like Obamacare is like 5% of universal healthcare and like they that passed by like one or two votes and the shit Democrats controlled both the Senate and the House at that time that's what everyone seems to forget like it was a whole Democrat and they they could barely pass it and like so I look at it so I look at it from a pragmatic standpoint you know to Tim's point where it's like well let's not Retreat to to these bold ideas and that's the way I felt when I sported Ron Paul and all that kind of stuff back in the day but like I do believe in a more pragmatic solution now where it's like well let's have like incremental changes what I was talking about on a conversation with Colin during our stream where I was like well we can have these two extremes we can have like crazy Trump we can have crazy Sanders or like we can you know I don't like Hillary Clinton but she can at least probably get",
            "start": 1325.48
        },
        {
            "text": "where I was like well we can have these two extremes we can have like crazy Trump we can have crazy Sanders or like we can you know I don't like Hillary Clinton but she can at least probably get things done she can get things done and so too could maybe Marco Rubio or Jeb Bush she stay if she can stay out of federal prison yeah which who knows what's we'll see so like she got to love that you can actually legitimately say that about a presidential candidate that she's actually being like investiga by the FBI yeah it's what kind of fucked up system do we have and that's and this is and that's what I've said before and I'll say it again like this the distressing part about it is that this is the best and brightest we have and it's awful like like on both sides like none of the candidates on out there I'm like are you fucking kidding me do you think that that do you think that that is is a is a problem that we can ever change I mean is that is that the way we actually elect a president",
            "start": 1359.8
        },
        {
            "text": "on out there I'm like are you fucking kidding me do you think that that do you think that that is is a is a problem that we can ever change I mean is that is that the way we actually elect a president seems like such a ridiculously archaic process these days right with the Electoral College and with the way that I feel like you're stumbling into another topic here potentially but I just feel like I just feel like like people like Bernie Sanders all right you're right we are you know we're stumbling crazy let's put a button on socialism and then we can you can do that as a topic we move that's a topic perhaps for another day because this is not the last time we talk about politics sure talk about many times to the 2016 election I'll just say this yeah like I respect Bernie Sanders in a very deep way actually in the sense that he is he is an ideologue through and through but he really does believe what he says and he's always said it and it's one of those things where I'm like okay like I",
            "start": 1393.6
        },
        {
            "text": "way actually in the sense that he is he is an ideologue through and through but he really does believe what he says and he's always said it and it's one of those things where I'm like okay like I don't agree with anything that comes out of his mouth but he's consistent he really doesn't change his tune on very much and I and I do respect that I I respect the idea of socialism like a utopian kind of idea that we can all take care of each other and everything's going to work out fine we're going to have enough money and everyone's going to create but the reality of the situation is that the biggest economic engine in the world happened in a very rep in a very stripped down Republic that that preached capitalism that created the greatest wealth the world has ever seen with only 4% of the population right now and that much of what the world consumes in terms of entertainment in terms of technology in terms of medicine in terms of all these things comes from this country and it's not to",
            "start": 1439.88
        },
        {
            "text": "right now and that much of what the world consumes in terms of entertainment in terms of technology in terms of medicine in terms of all these things comes from this country and it's not to say other countries aren't doing things that are different or wrong it's what my big fear though is that we we Tri with it too much or we shit with it too much and we ruin it you know and there's some special energy in this country in terms of the way it works that does encourage entrepreneurship it does encourage um risk-taking and making great things and and working really hard to get what you want and you might lose or you might win right um but it also encourages a wealth Gap and it encourages uh a six of the population being you know at poverty basically it encourages all these bad things that we have to try to rectify too and I don't look at those things and think those things are positive all I'm trying to say is we probably shouldn't throw the baby out with the bath water that like",
            "start": 1476.16
        },
        {
            "text": "that we have to try to rectify too and I don't look at those things and think those things are positive all I'm trying to say is we probably shouldn't throw the baby out with the bath water that like something about this place works and and we we often ignore the the economic reality of that that like a poor person you know in the United States that makes 30 you know $30,000 a year or whatever considered you know an impoverished person would be rich in most of the world right you know would be Beyond rich in much of the emerging world and that we have different context for the things that are going on in our country because we do have what seems like a growing oligarchy which I wouldn't disagree with and like and you know a lot of money placed within a very you know very few hands and stuff like that and that's that's a problem there's no doubt about that but like can we solve it without blowing the entire system up the system that gave us and the world so much you know and it's not",
            "start": 1517.92
        },
        {
            "text": "stuff like that and that's that's a problem there's no doubt about that but like can we solve it without blowing the entire system up the system that gave us and the world so much you know and it's not like an American pride kind of thing it's it's more like hey guys like let's just look at the reality of what happened in this country over the last 100 years you know and it's it's unlike anything that's happened anywhere in the world and there's a reason but but this is my question for you and uh do you feel like the Socialist aspect is why Bernie Sanders is so popular or do you maybe looking at the two mo more most popular most talked about candidates feel like maybe the power lies in the fact that they're actually come off as honest yeah well that's that's why people like Donald Trump but that's that's my thing is right when you look at Trump there's no shit there's no Rhyme or Reason for why that person should be didn't he pull it like 3% or something like at the caucus in Iowa yeah",
            "start": 1555.24
        },
        {
            "text": "that's that's my thing is right when you look at Trump there's no shit there's no Rhyme or Reason for why that person should be didn't he pull it like 3% or something like at the caucus in Iowa yeah out of like 15 people that's absurd like that is absurd that that man is still that popular right in any state he's going to he's going to win New Hampshire this is nuts right so you've got this kind of far right ridiculous he's not even far right I I don't know how yeah he's a moderate so you've got this kind of crazy outspoken moderate sitting sitting uh on for the Republican side and then you've got this socialist like as far left as you could possibly go on in American politics in American politics on the Democratic side and those are the those are the two people that are most talked about that's crazy to me right but I don't think again I don't think that's necessarily because he's a socialist I really do believe that in this day and age where people I think people can see through",
            "start": 1595.0
        },
        {
            "text": "that's crazy to me right but I don't think again I don't think that's necessarily because he's a socialist I really do believe that in this day and age where people I think people can see through shit more than anything anything ever and those that are paying attention can look at someone like Ted Cruz and be like dude Jesus Christ he is shit pandering to the base like left and right yeah no you're right I think that I know we want to wrap up but I just think I want to leave it in two places a like I understand that this is confusing to the a lot of people in the rest of the world when I get into conversations a lot of people are mad at me all the time when I I speak out about it it's just that like we in the United States typically like socialism and the socialist ideology is just not part of our our culture and we have like little pieces of it and that's fine and what I want to see happen is the marketplace of ideas come with the winner not like and that's what it goes back to",
            "start": 1634.6
        },
        {
            "text": "part of our our culture and we have like little pieces of it and that's fine and what I want to see happen is the marketplace of ideas come with the winner not like and that's what it goes back to the image in the beginning like a lot of that shit's made up that shit's not socialism and like if you want to like have an argument about what socialist socialism does in the United States and what socialism can do in the United States let's have an honest argument about it but let's not circulate items that say the CIA is a socialist program I mean that's shit absurd it's kind of the opposite that doesn't make like that makes literally no sense and it actually hurts your argument one of the things that I really NASA for instance doesn't have any social just because the government's funneling money in the science doesn't mean it's socialism right so that's that we just not aren't allowed to make up definitions words that's just not the way words work you know and I was actually really",
            "start": 1666.72
        },
        {
            "text": "money in the science doesn't mean it's socialism right so that's that we just not aren't allowed to make up definitions words that's just not the way words work you know and I was actually really heartened to see even people like the socialist people that were kind of the liberal people that were tweeting these things out people in the comments were being like you're hurting us by doing this because like you make us look like you know it's like cartoonish to suggest that street lights are socialism you know like that just that doesn't make any sense based infrastructure but I want to say that I believe that I love the utopian ideal and I appreciate the Socialist ideal I just I just can't believe that we would want to take this federal government that does every everything wrong and just give them more money and more power and more control and just be like well with more money more power more control surely you'll figure it out you don't have enough money we only give you $4 trillion",
            "start": 1701.96
        },
        {
            "text": "give them more money and more power and more control and just be like well with more money more power more control surely you'll figure it out you don't have enough money we only give you $4 trillion a year you know you already take a third of what everyone owns we'll give you half of what we own and then certainly it'll be fine now and I think what you're going to see is a bloated bureaucracy that's even bigger and worse than it ever has been and it's going to crumble you know under its own weight and what we really should be doing is saying like what can we do to lessen the governmental burden on our lives in my opinion and democratize the idea of wealth and democratize the idea of um entrepreneurship and opportunity and stuff like that but I also want to say that the one thing I respect out of Bernie Sanders and his people very much is that at least they're engaged and I've been saying this over and over again like you can say what you want about these things and we do",
            "start": 1737.4
        },
        {
            "text": "I respect out of Bernie Sanders and his people very much is that at least they're engaged and I've been saying this over and over again like you can say what you want about these things and we do get in our in our political disagreements but at least you're engaged and that's what I appreciate if that's your candidate go for it and we'll let the marketplace of ideas sort this all out and it will um one way or the other um I'm confident that you know my side will Prevail in that in that in that uh Battle of ideas but if it doesn't then I lost you know like we didn't we weren't eloquent enough we our ideas maybe are just not in tune with 21st century America anymore and stuff like that but I just get concerned with the not the utopian ideal of socialism but the practical application of socialism in the United States we are not a country of 10 million people you know we are not a country of 50 million people or 35 million people like in Canada we are a country of 300 million people and",
            "start": 1777.72
        },
        {
            "text": "in the United States we are not a country of 10 million people you know we are not a country of 50 million people or 35 million people like in Canada we are a country of 300 million people and growing exponentially and there's no example in in the world in the history of the world of having a Denmark or Scandinavian style socialism at that scale anywhere and in and in those big countries like China for instance that are more communist you know they have a massive wealth disparity problem too it's not like it's not like the idea of socialism really aren't they capitalists now they are but the point the point I'm trying to make is like they have it's not like socialism just cures things there's plenty of examples in Central and South America in in Eastern Asia of socialist and communist countries crumbling under their own weight and it doesn't work so it is a marriage of this utopian ideal with pragmatic political solutions that I think is the solution and if some of these",
            "start": 1813.44
        },
        {
            "text": "countries crumbling under their own weight and it doesn't work so it is a marriage of this utopian ideal with pragmatic political solutions that I think is the solution and if some of these socialist ideas are jive with the American public then so be it but let's not like let's not just like pretend that everything we do is socialist and let not also pretend that like the capitalist ideals and the individualistic ideas ideals we have in the United States haven't worked they've worked wonders for us in this country and they worked wonders for the world as well so that's kind of like you know where I want to leave it but I wanted to see I never really talk to you guys about that so and I'm sure our audience will give me an earful about all as well so capitalism is good capitalism's greed is good what is what is the saying I'm not I'm not nailing it right it's like capitalism is the most perfect of all imperfect Solutions or something like that like you know like capitalism for",
            "start": 1851.16
        },
        {
            "text": "greed is good what is what is the saying I'm not I'm not nailing it right it's like capitalism is the most perfect of all imperfect Solutions or something like that like you know like capitalism for capitalism to win it has to have losers like that's that's that's the negative that's what a lot of people don't want to see right everyone wants equality in that regard and the problem the problem I've always had with that is while it's a beautiful notion and you're right we should strive toward that I just don't think it plays I don't think it plays into the basic human Tendencies which is that greed is a tendency the striving toward a better life is always going to be a tendency for people and when you when you have a system that plays into that you get great results but but you also get some horrible disparages speaking of capitalism Greg way this episode's brought to you by Squarespace building a website can be tough and even if you do know your way around coding creating something",
            "start": 1886.12
        },
        {
            "text": "some horrible disparages speaking of capitalism Greg way this episode's brought to you by Squarespace building a website can be tough and even if you do know your way around coding creating something that looks good and works well it's a time-consuming affair whether it's for your business site a portfolio a restaurant or whatever else in this day and age you probably need a website anyway well lucky for us Squarespace makes it easy to build beautiful websites without breaking a sweat Squarespace provides simple powerful and beautiful website tools that look professionally designed regardless of skill level no coding required not only does Squarespace provide you with intuitive and easy to use tools to create your website with Squarespace also has state-of-the-art technology powering your site to ensure security and stability and you know you can trust in Squarespace for your website needs when millions of people in some of the most respected brands in the world trust them too including",
            "start": 1916.96
        },
        {
            "text": "to ensure security and stability and you know you can trust in Squarespace for your website needs when millions of people in some of the most respected brands in the world trust them too including us we built the original KindaFunny.com with Squarespace seriously you can't beat the ease and simplicity of Squarespace Squarespace gives you 24/7 online support and a beautiful website so what are you waiting for start a trial with no credit card required and start building your website today when you decide to sign up for Squarespace make sure you use the offer code Kinda Funny to get 10% off your first purchase and to show your support for us Kinda Funny Squarespace you should build it beautiful",
            "start": 1953.56
        }
    ]
}