{
    "id": 1558,
    "video_id": "aqw1Xdu5up8",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "How Long Will Twitter Last? - The GameOverGreggy Show Ep. 115 (Pt. 2)",
    "description": "We all love Twitter, but does it have a future now that all the execs are leaving?\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1455609600,
    "duration": 1087,
    "transcript_chunks": [
        {
            "text": "Colin, yes, what's your real topic? This not just about you, excuse me, unless this one's about you. No, it's not about me. Twitter. Um, now we talked about Twitter before. What's the angle this time? Well, Twitter is kind of like falling apart in a corporate way and uh, the um, what? No, I'm just freaking out because I love Twitter. I do too. Um, but I want to talk to you guys about there's like this notion, this idea, you know, to catch people up, like Twitter's there been a lot of turnover in the executive areas of Twitter. Twitter's stock has fallen dramatically um, on the market about this new timeline layout. Yeah, they're they're making changes to kind of keep Twitter relevant and what surprises me is that I find Twitter to have the most utility and the most use. I think it's like the most diverse thing. Like people like, well, why don't you use Instagram? And because like, why would I use Instagram? Like it doesn't, I'm not saying there's anything wrong with Instagram, saying like it's just pictures, words",
            "start": 2.85
        },
        {
            "text": "like people like, well, why don't you use Instagram? And because like, why would I use Instagram? Like it doesn't, I'm not saying there's anything wrong with Instagram, saying like it's just pictures, words than Twitter. Well, it lets you write things underneath, but like the idea of Instagram was pictures or with with Vine, it's just these short clips of videos or Periscope as like live video, whatever. It's like I can just kind of all the Periscopes associated with Twitter, it's a bad example, but I can kind I can kind of like fold these things in, you know, um, Twitter like has Twitter, you can do everything you want on Twitter. I mean, I still think Twitter is just the most useful and the most compact and I find it has the most utility. I agree. Um, I disagree, **** you. But what I'm is if you know, there's this notion that Twitter can go away or disappear and my my whole thing is, you know, the people talk about Myspace and I'm like, well, Myspace is way different because um, Myspace was eclipsed by something",
            "start": 53.72
        },
        {
            "text": "notion that Twitter can go away or disappear and my my whole thing is, you know, the people talk about Myspace and I'm like, well, Myspace is way different because um, Myspace was eclipsed by something that was just like it but better and there's nothing like Twitter that's even remotely like Twitter or better than Twitter. So I'm not worried about it disappearing, but I'm wor I'm wondering what you guys think about its future and if you think it's still useful, if there's something that we don't even know about it yet, they we'll be using in the future because there are these ubiquitous social platforms that I feel like we're going to be using in 10 years. Um, and I think Twitter's one of them. I think Facebook's obviously the other one. I'm not so sure that any of the other ones will exist in the way they do now except for those two because those two have the most um, like long running tail like the Ze like Ze I like continues with Facebook. I mean, my my Facebook account is 10 years old, you know,",
            "start": 91.12
        },
        {
            "text": "they do now except for those two because those two have the most um, like long running tail like the Ze like Ze I like continues with Facebook. I mean, my my Facebook account is 10 years old, you know, that's like really scary when you think about that. Like it's 10 years old and I'll probably use it for another 10 years after that. And Twitter obviously is a 10-year-old company now, but um, seems to be falling. So I don't know. I just wanted to know your guys' thoughts on Twitter. I don't think this guy's falling on Twitter. I think people make mountains out of mole hill. They talked about this timeline. Everybody flipped out and it was like, I at no point was I like, oh, this is RIP Twitter, right? Was trending or whatever. I'm like, it's not going to die based on this. And they're like, and sure enough, yeah, this is an option. You can do this. All right, cool. I'll look into it and see what I care think about it and y y y. I don't mind. It's similar when I wake up in the morning. I look and now they have that new",
            "start": 123.32
        },
        {
            "text": "is an option. You can do this. All right, cool. I'll look into it and see what I care think about it and y y y. I don't mind. It's similar when I wake up in the morning. I look and now they have that new like what happened while you were away thing. I'm like, this is actually kind of cool. Thank you. I I do like seeing this. This is an interesting thing to see what people were up to while I was sleeping. Yeah, I still love Twitter. I still think Twitter is awesome. It's still my preferred social media platform. I like it like we talked about before. It's the easiest way to talk to to the best friends in the way of like you have 140 characters to make your point, you know what I mean? I have 140 characters to respond, which is great for what about what do you think of this? What should I play? What about? And I can give you short responses and go. Whereas on Facebook or even the Kinda Funny forums, I open up my DMs or whatever and it's just a wall of text and I'm like, I don't have time to read this or give",
            "start": 160.56
        },
        {
            "text": "can give you short responses and go. Whereas on Facebook or even the Kinda Funny forums, I open up my DMs or whatever and it's just a wall of text and I'm like, I don't have time to read this or give you the response you deserve. So I just won't and I move on. Yeah, you know, Twitter's my my favorite to use as well. Um, I when it comes to the Myspace and Facebook thing, I think that's a little bit different. Like until there is a thing, there's not a thing, you know, until there was Facebook, Myspace reigned supreme. So it's like, it's not like they they were competing and then one just went away. Like that happened pretty damn quickly, you know? And uh, with Twitter, I I think that it is a little bit different as well because Facebook and Twitter um, and Instagram and all the things kind of currently going on now, they rose with the iPhone and they are, you know, ubiquitous with people using their phones. Cause when iPhone came out in 2006 or whatever, there wasn't a Myspace app. There was a Facebook app. There was a",
            "start": 190.88
        },
        {
            "text": "they rose with the iPhone and they are, you know, ubiquitous with people using their phones. Cause when iPhone came out in 2006 or whatever, there wasn't a Myspace app. There was a Facebook app. There was a Twitter app when apps eventually became a thing. So I think it's going to be a lot harder to dethrone the big guys because they're there and also they're just kind of eating everything up. So yeah, now Facebook has Instagram and Twitter has Periscope and Vine. So it's like there's the main things of Facebook and Twitter and then everything else is just going to kind of feed into that **** and be like uses for it. Um, Twitter, I think we're in a bubble with Twitter. Like we all use Twitter, but Twitter is not the most used, you know, more people are on Instagram because because of Facebook and also just because that's how most people use the **** and I think the gaming industry specifically is very Twitter heavy, very Twitter focused, but you look at other stuff and it's that's just simply not true.",
            "start": 230.48
        },
        {
            "text": "because that's how most people use the **** and I think the gaming industry specifically is very Twitter heavy, very Twitter focused, but you look at other stuff and it's that's just simply not true. Sure. Um, I said that Twitter has made its way into like politics and **** and you they promote their Twitters and stuff like that, but a lot of things also promote Instagram and you know, it's it I think it really kind of depends on what what group you're talking about. Um, and the the versatility with all of them is is is really high and it's just different. It's a different lens to look through. All the different things. Do you think Twitter's going away anytime? No, definitely not. I I think they're I think all of them, all of the ones we were're talking about are here to stay for a long time. Um, specifically Twitter, Instagram, Facebook and uh, with Twitter, people are afraid of change and they're so irrational about and they're going to get angry about anything. Get the **** Moments thing off the",
            "start": 274.4
        },
        {
            "text": "specifically Instagram, Facebook and uh, with Twitter, people are afraid of change and they're so irrational about and they're going to get angry about anything. Get the **** Moments thing off the goddamn app. But it's like you just don't use it. So who cares? And like they move it around and I click on, yeah, and I hate stuff like that. But it's like, all right, then it's minor. Then you get used to it and then it's the it's the same ****. Um, in terms of their adding more um, character limits and stuff, I think it's a bad idea. That's what they have Medium for. That's another thing that they own that's under their whole umbrella. Yeah, I doubt they're going to do it. I actually that yeah, you can do surveys all you want. You can do test things and whatever and put it out there and see what the public reacts to it. They're not going to do it. And if they do, there's a lot of data backing up it's a good idea and eventually we're going to like it because that's how this thing works, you know, if they",
            "start": 311.92
        },
        {
            "text": "reacts to it, they're not going to do it. And if they do, there's a lot of data backing up it's a good idea and eventually we're going to like it because that's how this thing works, you know, if they added more um, character limits, if I had 140 characters plus a picture, I'd **** love that because that's the worst when it eats into that crap. I hate that. Or like if I can have character limit plus a link plus like it's things like that where I'm not against that. Like don't hold me to this 140 thing when there's all this other **** that things change, things adapt, you know? Um, and the the change with the the algorithmic timeline, make it an option. Just make it one of the tabs. I'd like that, you know, I'd like to be able to see the things that are tailored towards me just like the while you're were away. Those things are awesome. Everyone about it when it first came out. Why? It's just extra functionality. Sure. What's more interesting, I think, is what's going to happen at the top like you're saying.",
            "start": 348.92
        },
        {
            "text": "away. Those things are awesome. Everyone about it when it first came out. Why? It's just extra functionality. Sure. What's more interesting, I think, is what's going to happen at the top like you're saying. There was all this executive turnover. I was reading about it the other day. Who comes in? How now that these new people are in, what do they think? What does it do to the stock? Will Twitter ever really, is it ever going to be super profitable? Is it ever, I mean, are they are they headed for trouble? You know what I mean? It's just it's the nature of like overvaluing all these companies. Like Twitter's already on the market, so it's worth what it's worth now. But you see this with Snapchat. Like there's no way in God's green earth Snapchat's worth a billion dollars for instance. But like that's but they are a unicorn company because they are a privately held company with a valuation of over a billion dollars. Um, but they can't possibly make that much money in order to to like the nature of what they do is just it's",
            "start": 387.72
        },
        {
            "text": "because they are a privately held company with a valuation of over a billion dollars. Um, but they can't possibly make that much money in order to to like the nature of what they do is just it's just not possible to make that much money. Like it's not. And short of like having a a a service so great that you can get literally millions of people to subscribe to it and pay for it. Um, which is something that Snapchat's not going to be able to do or Twitter is going to do no matter how much people love these things. Like when you're asking to really pay for them, they're not going to do it. So, um, you know, I think that it's more about getting things in the line in terms of like what things are worth and Twitter is going to be, you know, can be targeted for a hostile takeover or something like that because it's public. So, um, I think that the company can very much change. I don't agree that Myspace and Facebook weren't competing with each other. They certainly were. They were concurrent to each other for a long",
            "start": 423.16
        },
        {
            "text": "public. So, um, I think that the company can very much change. I don't agree that Myspace and Facebook weren't competing with each other. They certainly were. They were concurrent to each other for a long time. And what's a long time? Three, I mean, three or four years before Myspace really got killed, you know? Because like, I don't know if it was three or four, it was more like two. Like once Facebook got going, like yeah, Facebook was existed, but like there was that that year or two boot up time where Facebook wasn't a thing until 2007, I would say. I'm talking an overall, I mean, not for you, but for people in college. I'm saying, yeah, like that it wasn't a thing that everybody used. Everybody used Myspace. No, of course. But but I do, you know, the reason my Facebook account is so old is because Northeastern was one of the very first schools on it. So my I made my account in early 2004. And I remember to your point, like the when people were finally allowed to sign up to it that weren't even in schools and like",
            "start": 456.36
        },
        {
            "text": "one of the very first schools on it. So my I made my account in early 2004. And I remember to your point, like the when people were finally allowed to sign up to it that weren't even in schools and like that like not didn't have .edu accounts. A lot don't even know that about Facebook anymore, 'cause that was such a long time ago. Like Facebook, you only could use Facebook if you had a .edu account from a very certain school. That was the first time Facebook, we all said it was dead. Oh, ex my mom's on Facebook. This is dumb. But they knew what they were doing and and they did it, whatever. But like Facebook changed and evolved um, in and stole Myspace's audience. I mean, that's what happened in 2007. Yeah, by 2007, I would say because even if you're in school and then if you're an alumni of a school or so like, but I mean, I was in high school in 2007 and I couldn't get a Facebook account until like I got it as soon as you could and that was either late 2006 or early 2007. Yeah, but my point is is that, you know, it's not",
            "start": 496.88
        },
        {
            "text": "mean I was in high school in 2007 and I couldn't get a Facebook account until like I got it as soon as you could and that was either late 2006 or early 2007. Yeah, but my point is is that, you know, it's not only for college kids, it was for people that were were in college or are going to college and get their .edu's finally when you get accepted or alumni alumni of the schools as well. So it was it just slanted older and it wasn't until it democratized that like it definitely started to eat Myspace's lunch. But by that point, like we had already known behind the wall at Facebook or whatever using it that it was way superior in a lot of different ways. But the site had the site had changed a lot. I mean, in 2004, your wall was a field that anyone could edit and write whatever they wanted. So like if someone wrote something, you'd have to like sign your name and then someone could just come in and delete it all and then like write something on your supposed to be like a whiteboard on your on your dorm",
            "start": 533.52
        },
        {
            "text": "wrote something, you'd have to like sign your name and then someone could just come in and delete it all and then like write something on your supposed to be like a whiteboard on your on your dorm room door or whatever. Um, so like that site has changed significantly. I think Facebook's kind of getting a little out of control, but it's so ubiquitous that it's never going to go anywhere. And that was like kind of what I was wondering is if Twitter is really the only other social network that really is not going to ever go anywhere because it's just too ingrained. And and more than that, it's too useful, you know? That's that's the thing that I talk about with Twitter a lot is that I just think it has exceptional utility um, as it is right now. And if they don't **** with it too much, it could stay that way. But it could also be ruined. It's like kind of a Razor's Edge where you start **** around with the timeline, you start **** around with how much people can say on it and and brevity, you know,",
            "start": 574.04
        },
        {
            "text": "way, but it could also be ruined. It's like kind of a Razor's Edge where you start **** around with the timeline, you start **** around with how much people can say on it and and brevity, you know, is no longer kind of the what makes Twitter run. Like figuring out what you want to say in a very distilled way. I think the facts get to the facts. No, I always talk about it when Twitter turned the corner for me because I remember not, I mean, I when did Twitter even come around? We want to say 2006, I think we want. So yeah, but no one knew used Twitter until I remember when I remember at IGN in the early going of the days or whatever when IGN set up its Twitter and that was the thing where we all tweeted to it. You wrote an article, we all signed into IGN's Twitter and would just tweet out the link or whatever, right? And there was no real thing to it. And I remember when they finally got the first social manager, right? And brought, we're like, all right, now submit your links this way. Not everybody's",
            "start": 605.76
        },
        {
            "text": "or whatever, right? And there was no real thing to it. And I remember when they finally got the first social manager, right? And brought, we're like, all right, now submit your links this way. Not everybody's going to Tweet. And I remember when they were originally said, all right, you know, you get you write an article, you put up a review, you do whatever, you go in there and you tweet tweet. I was like, Twitter's so **** dumb. Why would I ever do this? Da da da. And I remember when they like months later, they removed it. Like, okay, now one person's tweeting for IGN or whatever. And I was like, ****, I missed Twitter. And I got Twitter and I I'd already been camping on my name because I knew I'd give it eventually because I'm going to push over. Uh, or I was just learning to start camping on my name. Uh, started using Twitter then and it was just the dumb thing of this that and the other and da da da. And there's always this one moment in time, which is I think rare, where I it was on Christmas break one year. I was",
            "start": 643.36
        },
        {
            "text": "playing video games till the wee hours in the morning and I came down at like 3:00 in the morning to walk Pill on this when I live right by the Ferry Building. And I came down in the highrise and came out and I turned the corner and I turned the corner and it was just cops all the way down and they had like six guys pressed up against the glass of the post office with like their spotlights off their cars on them and people with guns drawn. Me and Pill are like, all right. And we 360 back and I went upstairs and I went on to the I was like, well, somebody's got to broken into coverage like this. Like there was helicopters and ****. I'm like, what is going on? And there was nothing there. I went on the internet. Nobody like, you know, SFGate didn't have an article up or breaking or anything like that. And",
            "start": 677.32
        },
        {
            "text": "was helicopters and ****. I'm like, what is going on? And there was nothing there. I went on the internet. Nobody like, you know, SFGate didn't have an article up or breaking or anything like that. And then I was like, wait a second. I open up Twitter and I put in like, yeah, my vague location of like Ferry Building shooting cops. And it was like, and there was all these, there's been a shooting at Sinbad's. This many people are hurt. Da da da. You I was like, ****, like this is so much more than the time wasting **** device I thought it was where I was sitting around being like video games and wings, you know what I mean? I was like, oh, like this is like now when something happens, that's where you go. And it still is for me. Like, you know, some like today, uh, a guy, a kid tweeted at us and was like, just wanted you to know that DMX is like on death's door. And I was like, what? They put DMX in the search and I get the TMZ article and all the thing. I'm like, all right, you know what I mean? Like it's a in the moment",
            "start": 713.52
        },
        {
            "text": "to know that DMX is like on death's door. And I was like, what? They put DMX in the search and I get the TMZ article and all the thing. I'm like, all right, you know what I mean? Like it's a in the moment Google. You know, Google's great. Don't get me wrong. And you can do it on Google as well, obviously. But it's more like, all right, this and then what's happened the last hour, the news this. Whereas this also then the downside of course is that it doesn't need to be verified. So rumors can spread like nothing. But exactly. You jump in there and there is that moment of like, this is what's happening. And now you know, like it's all I feel like 90% of the news that I can like big big news stories that have happened in recent years, right? Are broken to me by Twitter. You're scrolling and somebody's dead. This has happened. This, you know what I mean? Like holy ****. Yeah, it's a cool little device. I love it. I love it so much. I don't think any of them are safe. I don't think even Facebook or Twitter are safe",
            "start": 747.4
        },
        {
            "text": "has happened. This, you know what I mean? Like holy ****. Yeah, it's a cool little device. I love it. I love it so much. I don't think any of them are safe. I don't think even Facebook or Twitter are safe forever. I do think that there will be something at some point. Facebook's the weird one for me where I I, you know, for me, I I I gambled wrong where Missouri got into Facebook super early. I don't know what year, but right around the time Colin's describing because I graduate in 2005, right? But I remember and maybe it was 2004, maybe it was 2003 when Facebook, maybe it was even younger than that. But I remember the the my friends Parker and Booth who were a year below me, they got in. They were into Facebook huge. They were all over Facebook. And I was like, they're like, you should make a Facebook account. I'm like, I'm that's a young kids game. I'm not going to do that. I'm a senior. I'm grad or I'm going to be graduating here. That's what all you young kids are doing. You know what? I'm not going to do it. And I",
            "start": 784.32
        },
        {
            "text": "like, I'm that's a young kids game. I'm not going to do that. I'm a senior. I'm grad or I'm going to be graduating here. That's what all you young kids are doing. You know what? I'm not going to do it. And I didn't do it forever and ever and ever. And it was a similar story of uh, graduated and went to work at the newspaper and there was a a scandal about this uh, uh, there was a couple scandals, I guess, should say that broke through Facebook of like kids in college who were doing dumb **** and posting photos of it, right? And so there was like two or three times where I had to call my girlfriend at the time and ask her for her Facebook login to log in to get see stuff. 'Cause like there was a time like one of the baseball players was uh, you know, suspended from the team and uh, because he had done this that or the other and there was like a, you know, the cops had arrested him, whatever. And like everybody was trying to contact him for a story. And I was like, wait a second. I called the girlfriend, got it, got",
            "start": 823.28
        },
        {
            "text": "or the other and there was like a, you know, the cops had arrested him, whatever. And like everybody was trying to contact him for a story. And I was like, wait a second. I called the girlfriend, got it, got his got his phone number off his Facebook page and called him, got the comment, you know what I mean? It was like that thing of like, ****, there's really utility to this thing that I thought again, it was just like dumb kids putting up photos or videos of them playing beer pong or whatever. When in reality, it's like you can use this in so many different levels. Yeah, I mean, even to this day, again, we are so in this world where Facebook's kind of like a thing that we don't use anymore. But Facebook is in every age group on every platform the most used every single day. And it also it's the it more so than Twitter is the place people get news, right? Like everything you're just saying, that's what people I know. And that's the weird thing of like, I didn't it's one of those where I had moved away from",
            "start": 859.8
        },
        {
            "text": "than Twitter is the place people get news, right? Like everything you're just saying, that's what people I know. And that's the weird thing of like, I didn't it's one of those where I had moved away from Facebook or I got so I make the Facebook page back then, you know what I mean? Use it fine. Come to IGN. We start getting popular. I I accept all the fans from Beyond on it, right? And it gets all **** up. So I convert it to a fan page and then eventually make a secondary P, you know, blah blah. And so now I don't use it correctly anymore really at all. I just pop in once in a while. But no, what you're talking about is like, I'll be on the phone with my mom for the calls that I don't give her enough. And she'll be like, oh my God, and you see this? Did you see that John had this? Like she's talking about my high school friends that I have, you know, that I I'm so close with. And I'm like, no, did you go to dinner with them? She's like, no, it's all on Facebook. Oh, like my Facebook's still totally **** and it's",
            "start": 893.4
        },
        {
            "text": "high school friends that I have you know that I I'm so close with and I'm like no did you go to dinner with them she's like no it's all on Facebook oh like my Facebook's still totally **** and it's just like notifications from people I don't know no get hard to use especially when there's the page versus the profile whole thing and Pages like it just there's a lot of stuff that they don't do correctly but there's a lot of **** that they **** nail and I think video video is the other huge thing for them now that they have that that's a game changer they need to figure out the content ID they need to figure out all this stuff but I mean they're getting more views than YouTube whoever would have thought there'd be a video platform that gets more views than YouTube per month like that's insane I got to take the time cuz I see Colin on it all the time Colin lives on Facebook and and I look at I'm like I got to get I got to get back on the horse here at some point and figure out",
            "start": 924.0
        },
        {
            "text": "insane I got to take the time cuz I see Colin on it all the time Colin lives on Facebook and and I look at I'm like I got to get I got to get back on the horse here at some point and figure out what the **** I'm doing with it yeah I mean I I every single day I comment in the Kinda Funny Facebook group every day before I go to sleep I just kind of look through **** and I just like **** all of you yeah yeah it's just a good way it's just a good thing to use like Facebook's interesting in the sense that it does have like great reach like it's it's it's similar to Google in the sense that it just it's so ubiquitous that um it really will be impossible almost to displace like I I I do think I I think with great confidence Facebook will literally exist in 50 years like I I just can't imagine that like it's just too big you know it's too much part people it's too it's too part of the way people do things it's very similar to Google like or an Alphabet like in a lot of Alphabet's",
            "start": 958.88
        },
        {
            "text": "imagine that like it's just too big you know it's too much part people it's too it's too part of the way people do things it's very similar to Google like or an Alphabet like in a lot of Alphabet's properties where it's just like it's it's not going anywhere you know um but I think Twitter's somewhere in the middle where I don't think it's going anywhere but I think it's I think it's got to change and got to figure out a way I wouldn't be surprised if I'm trying see Twitter got scaled back you're going to hear about layoffs this you know I mean da but then again I just don't I think it's also there at times maybe overthinking what Twitter needs to be you know what I mean where it could just be what it is now and Grant I don't know if that lasts I'm not web developer I don't know that kind of stuff yeah because we've talked to people at Twitter and they some of the stuff they're talking about what they're going to be doing in the next six months to a year like oh that sounds **** cool",
            "start": 992.92
        },
        {
            "text": "stuff yeah because we've talked to people at Twitter and they some of the stuff they're talking about what they're going to be doing in the next six months to a year like oh that sounds **** cool you know sounds really cool and awesome and I think that they're focused on things like Vine and Periscope and Medium and stuff like that it's that's how you expand the use of Twitter give people apps to use within the app and you can go really far with that I think that their biggest problem is getting the people that aren't on Twitter on Twitter the people that are there lovin' they're going to be there but the people that aren't the millions and millions and millions of people that aren't that could be you know that they're on Instagram they're on Facebook why aren't they here and it's just not for them you know and uh or kids kids growing up aren't on Twitter like that's just the thing like the if you're looking at people like they're on Instagram 16 16 and younger yeah Snapchat it's",
            "start": 1029.72
        },
        {
            "text": "not for them you know and uh or kids kids growing up aren't on Twitter like that's just the thing like the if you're looking at people like they're on Instagram 16 16 and younger yeah Snapchat it's Instagram and it's Facebook but they're not on Twitter interesting so young kids get on Twitter it's enjoyable and follow GameOverGreggy",
            "start": 1060.0
        }
    ]
}