{
  "id": 1570,
  "video_id": "BHW0VN53CmE",
  "show_name": "The GameOverGreggy Show",
  "hosts": [],
  "title": "NES Music Quiz (Feat. Black Nerd Comedy) - The GameOverGreggy Show Ep. 116 (Pt. 1)",
  "description": "Andre of http://www.youtube.com/blacknerdcomedy quizzes the guys on their Nintendo music knowledge.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_c...\n\nBuy our shirts! http://www.districtlines.com/gameover...\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1456128001,
  "duration": 1560,
  "transcript_chunks": [
    {
      "text": "This episode's brought to you by Mack Weldon.com. Go over there and use the offer code Kinda Funny to get 0% off your purchase. Mack Weldon.com wants you to be comfortable, so if you don't like your first pair of underwear, you can keep it and they will still refund you, no questions asked. That's pretty cool 'cause I doubt they want your old underwear back. So go to Mack Weldon.com, use the promo code Kinda Funny, get 0% off and have a wonderful day in your new underwear. Oh, you look good. Oh, save this part for when you get the underwear. Okay. Oh, you look good in those underwear. I like that. What's up everybody? Welcome to The GameOverGreggy Show. I one of your hosts, Greg Miller, alongside the producer Seducer, Nick Scarpino. Get in there. I wouldn't he was he was clench tight. Now it's in there. There is you got to work it in. You can't just **** throw in there. I was jabbing. I remember that. I need to cut. I'm like in the border of need to cut my nails. If I cut them out, I feel like they'll be too",
      "start": 0.16
    },
    {
      "text": "is you got to work it in. You can't just **** throw in there. I was jabbing. I remember that. I need to cut. I'm like in the border of need to cut my nails. If I cut them out, I feel like they'll be too short, you know? And then they hurt and they like they sting for a couple days or what does the length of your nails have to do with I was jabbing it into no. No, I'm not saying that, but what is the length of your nails have to do with you cutting them to make them short? If the nail nails go longer, then you don't cut them shorter. That doesn't make any sense. I'm saying right now I don't think it's time to cut them, but I think we're almost there, probably tomorrow. So you he's trying to avoid the I think right now they're not cut. They're not too long right now. Write it out a little bit long. They're not too long. I sympathize with him. I don't I guess I just don't get it because if you cut them when they're too short, you run the risk of cutting too close to the cuticle and then it like **** stings",
      "start": 55.2
    },
    {
      "text": "too long. I sympathize with him. I don't I guess I just don't get it because if you cut them when they're too short, you run the risk of cutting too close to the cuticle and then it like **** stings every time you touch it. I hate I like to let it go a little too long. I did that with the thumb 'cause it's like it's the Clipper, not a precision instrument. No, it's not. Women's Clippers. Here's what I keep. You need to get them. They're so much better. They're like **** utility. They're like tools. What somebody needs to come up with, and I've thought about this, and this is now access my trademark on this pure one, Tim Gettys. Yes, Pride along onl callar already is that if we could invent some kind kind of acid or microbe that you put into a fluid that eats the dead part of the fingernail, so I just dunk him in there and then I got my fingernails all set. You're a **** up person. That'd be perfect. Think about you thought. Have you thought about this before or did you just right now? Oh, no, no, I thought",
      "start": 86.52
    },
    {
      "text": "him in there and then I got my fingernails all set. You're a **** up person. That'd be perfect. Think about you thought. Have you thought about this before or did you just right now? Oh, no, no, I thought about this a lot. Good Lord. And then I can get it for pilla's nails too, 'cause those ****. All right, so let me just ask this again because what you're saying still doesn't make any sense. I understand what you're saying. The the you cut your nails how long ago? I don't know, whenever I needed to. There's no schedule. When I need I don't schedule. Let's say a week ago and they were at a good length at that time. They were too short. Then they hurt. I hurt my nail. I'm I'm gunshy31 on Patreon.com/KindaFunny. Head over to YouTube.com/KindaFunny where the entire show posts topic by topic day by day until the entire thing is free as one big MP3 and one big video. I think that was the most solid disc table we've ever done. It was like perfectly in unison. I feel like this is going to be one of the best shows we've",
      "start": 125.8
    },
    {
      "text": "thing is free as one big MP3 and one big video. I think that was the most solid disc table we've ever done. It was like perfectly in unison. I feel like this is going to be one of the best shows we've ever done. Okay, just letting you know. Good. This is is this one? This is worth worth the dollar. Oh man, I feel good. You all seem like you feel good. Kevin feels good. He's in a good Superman shirt over there. He's drinking hot coffee. Learned likes Hot Coffee. I appreciate you. I'm going to begin the festivities. Let's do it. Now, as you know, ladies and gentlemen, you can support us on Patreon.com/KindaFunny and if you go to a certain level, you can support us and get your topic right on the show today. I'm blowing dust off in a topic that was given to us a long, long time ago but has never been read or done. Oh my God. It comes from the one and only Mike Ducker. Mike Ducker. Mike Ducker writes in and I said, what's your topic? And Mike Ducker said, Music Quiz. Can Colin name the NES game music based game based on music",
      "start": 187.32
    },
    {
      "text": "it comes from the one and only Mike Ducker. Mike Ducker. Mike Ducker writes in and I said, what's your topic? And Mike Ducker said, Music Quiz. Can Colin name the NES game music based game based on music alone? Start easy and get real hard. Yeah, I know how my prediction is that Colin's going to **** nail this. I don't know. I mean, out of 100, there's one thing I know about starts hard. I don't think I don't think I'm going to do as well on this as you think. Wait, now, is he asking us to play the music and Colin has the name of the game? Yes. Okay, we play the music. You listen to the music. You name the game. Oh, we all have to play. I well, I gave you all markers in a in a in no card this question. Are you **** stupid? Can I yeah, can I ask you this question? Is this does this game have a tremendous amount of kind of like really creepy white people that we could look at like the pictures of like Chad and Chester and like Heart Throb? We got to do a Let's Play of Heart Throb. Okay, what I love the smell of a",
      "start": 233.16
    },
    {
      "text": "kind of like really creepy white people that we could look at like the pictures of like Chad and Chester and like Heart Throb. We got to do a Let's Play of Heart Throb. Okay, what I love the smell of a Sharpie. Oh yeah, it's like gasoline. You shouldn't, but you have. It's good. There's some part of your brain that says, hey, hey kids, let's get super high off this thing. Don't listen to your parents. Listen to your boy Colin. No, I didn't say that you should do it. I'm just saying that it smell a Sharpie smells good. It does smell good. Now, all right, Mike's topic was play NES music, have Colin name the games. I'm expanding it to Tim and Nick because I want them to be a part of it. But as you may know, viewer and or listener out there, of course, Colin knows. Well, I'm Greg Miller. I was unfortunately raised a Sega kid. I don't have the affinity, the knowledge to go through and really take Colin to the limit. I'm Glass Joe. I needed a Mike Tyson for this Punch-Out!! So what I did is I reached out to our friend Andre",
      "start": 283.32
    },
    {
      "text": "kid. I don't have the affinity, the knowledge to go through and really take Colin to the limit. I'm Glass Joe. I needed a Mike Tyson for this Punch-Out!! So what I did is I reached out to our friend Andre from YouTube.com/BlackNerdComedy, BlackNerdComedy.com, and I had him submit videos for for Colin and you all to get tested. He's a big Nintendo guy. He is. He's a huge Nintendo guy. Well, this this is exciting. Yeah, I wasn't expecting to compete today. Luckily, I always I like keep you on your toes. So are we doing we're writing the answers on? We're going to use a bunch of index cards, right? I have a whole bunch here. So the idea here is that yes, you will write your answer down. You will let Andre go the entire time. He's made these videos for you and for you. Of course, you'll get to see him here. Thank you, Andre, for helping, by the way. Um, so I'll we'll do that. You let it play out until he says, what's your answer? And then we'll show each other what we said. What are you doing? Greg is a boner. This is a",
      "start": 332.28
    },
    {
      "text": "you Andre for helping, by the way. Um, so I'll we'll do that. You let it play out until he says, what's your answer? And then we'll show each other what we said. What are you doing? Greg is a boner. This is a wasted card. You right on the back of it now. Oh man, I hate no, I can't share answers. I'm seeing the imprint of what I wrote on the front. I'm probably not going to do very well here. Don't share answers. Andre is like, you know, legit. Yeah, I mean, I am legit too, I think, but maybe not as legit. Now, don't share answers. And I'm talking specifically to you because both these people cheat off of you. Okay? And I will let you know that as Andre, BlackNerdComedy.com, remember this in school? Yeah, of course, is a huge Nintendo fan. He's he's wanting specifics. Okay, so levels. He no, well, he put him in parentheses, but I'm I just the game is Mike Ducker. So I need the game. So give me like if it's a sequel, I need the numeral. Is it first party and third party? Let's find out. It's both. Okay, good. It's not just first part.",
      "start": 377.44
    },
    {
      "text": "I'm I just the game is Mike Ducker. So I need the game. So give me like if it's a sequel, I need the numeral. Is it first party and third party? Let's find out. It's both. Okay, good. It's not just first part. All right, so here we go. Super Mario Bros. Cranking this up. My prediction, start easy and get hard. I'm going to do the worst out of all of you on this. I hope you do the best. That'd be hilarious. Like really loved any. Three, two, one, go. Did somebody say Nintendo? What's up? It's Andre. I'm on YouTube YouTube and stuff. Uh, my YouTube channel is Black Nerd Comedy. I have a YouTube channel, but who doesn't have a YouTube channel nowadays, right? Oversaturation. I'm here because the Kinda Funny guys contacted me because y'all needed some Nintendo help. So I have here the 10 songs that I chose to play for you to try to guess. I'm going to play snippets of classic NES background music. I'm pretty sure that playing these songs on your video will definitely give you a copyright claim from Nintendo. That's all",
      "start": 419.72
    },
    {
      "text": "to try to guess. I'm going to play snippets of classic NES background music. I'm pretty sure that playing these songs on your video will definitely give you a copyright claim from Nintendo. That's all right though. We're gonna have fun. For everyone that you get right, uh, Greg has to give you a Kit Kat bar. So Greg, go out and buy a bunch of Kit Kat bars. Answer because Kit Kats are awesome. For everyone you get wrong, uh, I magically take a year off your life. If you get all 10 right, you are officially a presidential candidate. Okay, here we go. First one, get ready. Here it is. Play. Yeah. Is he going to play the whole song? Just what is it? See, he did that funny thing. I like the what is it he does at the end. Can I just let him? Can I have this one moment? I'm sorry. I'm not criticizing people's art. It seems like you are criticizing people's art. Hold on. Fine. I'm going figure out a better way to do that. All right, so now we're going to go through. Nick Scarpino wrote down Super Mario Bros. 15. Didn't",
      "start": 468.96
    },
    {
      "text": "like you are criticizing people's art. Hold on. Fine. I'm going figure out a better way to do that. All right, so now we're going to go through. Nick Scarpino wrote down Super Mario Bros. 15. Didn't know which one it was. So that doesn't count. That does count. No, I'm telling you. Okay, I'll wage your real guess. Super Mario Bros. One. What did you put? Is it three? Super Mario Bros. Colin gets the point. And you got Super Mario 3 Overworld theme. Now, I would appreciate next time, Super Mario 3. I'm not going to bust your balls on that one. It's fine. The name. I'm sorry. You're not going to bust his balls on that, but I don't get Super Mario Bros. 15. Yeah, no, you don't. He didn't. The Super Mario Bros. A whole different game. That's where they were just plumbers sitting around complaining about the **** their wives and ****. No, nothing. Okay, it's still Overworld, not the map thing in Mario. Was over. And number two, Kevin. Three, two, one, go. All right, number two. Play.",
      "start": 543.56
    },
    {
      "text": "complaining about the **** their wives and ****. No, nothing. Okay, it's still Overworld, not the map thing in Mario. Was over. And number two, Kevin. Three, two, one, go. All right, number two. Play. Yeah, this is **** dirty, man. This is this is the business. This is like training in a gym. I like his dance. He's Andre knows. What is it? I enjoy the what is it? I want to get to the what is it every time. Nick Scarpino said Mike Tyson's Punch-Out!!. He's correct. Thank you. Colin Moriarty said Mike Tyson's Punch-Out!!. He is correct. Mike Tyson's Punch-Out!! theme, says Tim. You are correct as well. Everybody gets a point on that one. Congratulations. Pat yourselves in the back. All right, moving on to number three. Three, two. Oh yeah, I don't I no, it's get a little. You just take half the stack over there, guys. That's good. That's good. That's smart. That's smart. Split the world. Three, two, one, go. Okay, number three. Here we go. Play. Is that right? I can't tell you. I can't show favor. Hey, let me",
      "start": 585.56
    },
    {
      "text": "guys. That's good. That's good. That's smart. That's smart. Split the world. Three, two, one, go. Okay, number three. Here we go. Play. Is that right? I can't tell you. I can't show favor. Hey, let me cheat with you. It's you got to hurry. It's almost up. I'm going. What is it? Damn it. I'm wrong. I think Nick Scarpino said guessing wild guess, Castlevania. And then in parenthesis, spelling, don't know how to spell Castlevania. It looks like you nailed it, but your handwriting all kind runs together. It is not Castlevania. You are incorrect. Colin Moriarty said The Legend of Zelda. He is correct. Tim said The Legend of Zelda dungeon theme. I like the specificity of it. I try specificity. You both got a point. Celebrate your points. God damn it. Not me. Not Tim. Right? Yeah, three and it's three. Three and one. **** tight Zelda. He said no, I'm sure. I can't wait till you get **** rock hard. Whoa. All right, here we go. Number four. Three, two, one, go. Okay, number four. Look at him. Go. Are you",
      "start": 660.24
    },
    {
      "text": "tight Zelda. He said no, I'm sure. I can't wait till you get **** rock hard. Whoa. All right, here we go. Number four. Three, two, one, go. Okay, number four. Look at him. Go. Are you going to get a real answer? Okay. Okay, going. I can't stop. I love him too much. He's too good at dancing. Literally, Nintendo on this one's going to like, really guys, really? 17 songs. Be they're going to have have **** war in total war with them. Like, who's Nick Scarpino says Super Mario Bros. 3. It is Super Mario Bros. 3. You get a point on that one. Your boy Colin Moriarty says Super Mario Bros. 3. Tim says Super Mario Bros. 3 Overworld theme. Love the specificity of it. It's weird. The images of that conjures of me sitting on my uncle's floor just **** wasting hours of my life. Yeah, yeah. All right, all right. Eating. Oh my God. Yes. I was like, pause. Number five. Yes. Three, two, one, go. Number five. Here we go. Let the bass drop. Yeah. What is it? I love. Can we fly him here? This the",
      "start": 739.24
    },
    {
      "text": "all right, all right. Eating. Oh my God. Yes. I was like, pause. Number five. Yes. Three, two, one, go. Number five. Here we go. Let the bass drop. Yeah. What is it? I love. Can we fly him here? This the first one I'm not sure of. We have at all. All right. Nick Scarpino said, no **** clue. No idea what that. Sorry, sorry. Colin Moriarty said Kirby's Dream Land, question mark. Incorrect. Nope. Tim Gettys said, don't know how to spell it. Balloon Fighter. He says that's not the G of the game, but I didn't think I'm gonna give it to him. It's Balloon Fight. It's Balloon Fight. Yeah, I wouldn't have remembered that. I haven't played that in years. So we're give him the point. We I give him the point. Okay, we're giving him the point. Balloon Fight was what you're looking for. How to spell balloon? How many else? How many else? I thought it was fight that you were caught up on me because he put fighter. I thought that. Yeah, I was just confused about that 'cause you got caught up on balloon. No, you nailed balloon. I mean, you ran it all",
      "start": 821.16
    },
    {
      "text": "it was fight that you were caught up on me because he put fighter. I thought that. Yeah, I was just confused about that 'cause you got caught up on balloon. No, you nailed balloon. I mean, you ran it all together, but I think you got I tried to do that in case I don't remember. Like, how do you know how do you I mean, I played that game when I was a kid, but I haven't heard that. Oh, okay. Yeah, I haven't heard that song. There you go. That's not that's not an iconic. I'm waiting for third party stuff. Okay, I'm waiting. I'm sorry. I'm waiting for third party stuff. Thank you, Kevin. Maybe I'm incorrect. Maybe there is no third party stuff. Maybe I was incorrect. Um, that sucks. That's the some most iconic music is why guest CIA. Hello. I think you're going to be okay. I think you're going to be all right. Oh, actually, yeah, 'cause here comes something. Three, two, one. Okay, number six. Really? I don't know which one. Really specifically which one? I franchise. Oh, sure. What is it? Nick Scarpino says BurgerTime. So",
      "start": 892.44
    },
    {
      "text": "comes something. Three, two, one. Okay, number six. Really? I don't know which one. Really specifically which one? I franchise. Oh, sure. What is it? Nick Scarpino says BurgerTime. So that song means nothing to you. Uh, I was it reminded me of Animaniacs or like Looney Tunes, but I couldn't remember which. I I don't know. Was game there or not? No, it's done time. Pencil's down, Mr. Moriarty. Yeah, I said Addams Family. The Addams Family. Incorrect. Adventures. That's what I thought it was too. It is Tiny Toon Adventures. I don't know which which one it was. It's just Tiny Toon Adventures. Damn it. That's what I **** started. Now, give me credit here. I started to I see it. You say tiny. There you go. And but then it was like The Addams Family and I was like, I could work too. AC University. We are our. Damn it. I'm losing. It's it's okay. That's the where is the really iconic music? God damn it. Point of clarification. Point of clarification. You're not losing. You're coming in a close second. I a distant distant right.",
      "start": 926.56
    },
    {
      "text": "losing. It's it's okay. That's the where is the really iconic music? God damn it. Point of clarification. Point of clarification. You're not losing. You're coming in a close second. I a distant distant right now. Tim has six points. Colin has four. And you how many Kit Kats is that? I think it's a full Kit Kat bar. I have to buy. So that's 4 Kit Kats. All right, Kevin. Number seven. Three, two, one, go. All right, number seven. Be ****. What is it? He's funny. Everybody subscribe to Black Nerd Comedy. I enjoy Andre. I'm just putting it out there. Pencil's down, sir. And you're just putting. Oh, okay. Spy Hunter. Incorrect. I know it's not Spy Hunter. I just wanted everyone to stop and think about Spy Hunter for a second. Great game. Colin says Ice Climbers. Incorrect. I thought that was it. Yeah, I put Rad Racer. I Rad Racer. We are looking, ladies and gentlemen, for Donkey Kong Jr. Donkey Kong. I wouldn't. Yeah, Jr. That's a ****. I knew it was a very old like an old one. The music was so. I'm sorry.",
      "start": 1004.32
    },
    {
      "text": "put Rad Racer. I Rad Racer. We are looking, ladies and gentlemen, for Donkey Kong Jr. Donkey Kong. I wouldn't. Yeah, Jr. That's a ****. I knew it was a very old like an old one. The music was so. I'm sorry. The music was too old. Thank you, Kevin. Number eight. In three, two, one, go. Number eight. Play. **** yeah. God damn it. Oh, I can see why people play NES. This one deep. What is it? What is it? Nick Scarpino. Chip 'n Dale Rescue Rangers. Incorrect. But you're on the right track. Colin says DuckTales. He is correct. Damn it. Tim says, what was it though? The I I don't know. I don't know what this one. I can't read. Kirby's Adventure. I Kirby's Adventure. It's DuckTales. The Amazon. The Amazon level. When you're playing in the Amazon level. Far into me. We are getting. I like I appreciate that he didn't go for the moon theme because that's the obvious one. Have as you two not because you and I have nothing to say about this. Have they been getting harder? Is he doing hard? I'm surprised of some",
      "start": 1077.08
    },
    {
      "text": "didn't go for the moon theme because that's the obvious one. Have as you two not because you and I have nothing to say about this. Have they been getting harder? Is he doing hard? I'm surprised of some omissions so far. Want to go easy? He doesn't want to go easy, right? Yeah, yeah. How many more are there? Uh, there's 10 total. So you're about to do nine and then 10. So you have two more left. Right now, Tim has a lead of one with six. Colin has five. Nick has two. Nick, I believe in you. You can get to four. They get back. No, not a chance in ****. Hell yeah. Beat him. Just mathematically not possible. I don't even mean that. I just three, two, one. Number nine. I'm going with it. Third time writing it down. Damn it. Damn it. I'm not sure which one. Look at him go. Go, Andre. What is it? H he's the best. He did all this for free. All right. He's way too much time. Nick Scarpino says Castlevania. He crossed it out and wrote Castlevania II. He's correct. Castlevania II. Now, Colin Moriarty says Castlevania II. He is correct.",
      "start": 1169.96
    },
    {
      "text": "all this for free. All right. He's way too much time. Nick Scarpino says Castlevania. He crossed it out and wrote Castlevania II. He's correct. Castlevania II. Now, Colin Moriarty says Castlevania II. He is correct. Tim Gettys says Castlevania: Bloody Tears is the name of the song, but Castlevania I. I know which one. Put two. That's heartbreaking. God damn it. Sorry about that. Colin then ties it up. Six all. **** goddamn it. Nick coming on strong to win this ****. Come right down to it. Now, I should preface on that last one that Greg actually went like this to wrote Castlevania. He's like, ****. And I just went two. He gave it two. Like, I like how you crossed out Castlevania and then wrote Castlevania. No, I was like, wait a minute, 'cause the Castlevania thing that I think of is and I'm like, wait a minute, but I remember this being in Castlevania game. And then I looked at Greg and Greg went like this. They gave me the **** two. Go to second. I was like, all right, all right, ladies. Technically, that was cheating, but",
      "start": 1246.84
    },
    {
      "text": "this being in Castlevania game. And then I looked at Greg and Greg went like this. They gave me the **** two. Go to second. I was like, all right, all right, ladies. Technically, that was cheating, but I'll take the point. This is number 10. I'm interested to see you guys tied. Yeah, they're tied. Six all. I'm coming at your heels too. 10, 15 more of these. I might catch up. Kevin. In three. And I'll do it on go this time. Sorry. I did the last one on one. I **** you. Three, two, one, go. Number 10. Play everybody now. Woo. ****. Yeah. Oh my God. No, please tell me it's that. Can't tell. God damn it. The game. This is not how the game is played. What is it? God damn. What is it? Scarpino says Valley High, Goonies. Incorrect. God damn it. It sounded like Cyndi Lauper. Colin Moriarty says StarTropics. Incorrect. I don't even know. I I didn't even have. Didn't even venture a guess. Don't even know that style. Didn't even sound familiar. The correct answer is The Goonies. ****. Are you kidding me? If you don't shout out",
      "start": 1303.4
    },
    {
      "text": "even know. I I didn't even have. Didn't even venture a guess. Don't even know that style. Didn't even sound familiar. The correct answer is The Goonies. ****. Are you kidding me? If you don't shout out what is that right? Maybe I would have thrown you the two again. Everyone was looking. Everyone was look. We're we're we're we're tied. What do we do? That's awesome though that he ended on Goonies II. That's a perfect. I haven't played that game in many. It was never meant to be a competition. It was meant Mike Ducker to test the one Colin Moriarty who has scored 60% here. So I don't I don't think there needs to be a declared. I'm not I'm not super thrilled to myself, but I am surprised by it. Doesn't this didn't work completely in my sphere. So I'm pretty proud that I got six out of 10 considering no Dragon Quest, no Final Fantasy, no Mega Man, no like no Ninja Gaiden, no like Faxanadu or or Crystalis or like anything that like I love love love. So I'm pretty Mario and like that played against you on that one.",
      "start": 1383.68
    },
    {
      "text": "no Final Fantasy, no Mega Man, no like no Ninja Gaiden, no like Faxanadu or or Crystalis or like anything that like I love love love. So I'm pretty Mario and like that played against you on that one. Yeah, yeah, yeah. How do you feel too? Castlevania II. Oh God. **** damn it. I would have had it. You would have had it. I would had. Feel like there needs to be winning too. Almost crushed that PR. That's excellent. When you get into Cyndi Lauperland, dude, that's we calling an I I never watched out. So let's see if he says anything in case there's a tie. Congratulations. You got way to go. I'm so proud of you for getting out of 10 correct. You're amazing or terrible. I just don't know. This was pre-recorded. Thank you everybody. Subscribe to my channel. Don't unsubscribe to theirs. They're awesome. I love you. I'm tired. Bye bye. Andre. A winner is you. Good job. That was an awesome. Thank you very much. I feel I I I love that Andre did that. I feel incomplete. We this is nothing. It's a competition. Do you want Kevin to look up",
      "start": 1428.16
    },
    {
      "text": "Bye Andre, a winner is you, good job. That was an awesome, thank you very much. I feel I I I love that Andre did that. I feel incomplete. We this is nothing, it's a competition. Do you want Kevin to look up? Kevin, find me an NES. I think we need to do round two at some point. Sounds like better deal. That sounds like a better deal. I think because I if there's something I know about Colin, it's that he's perfectly fine to wait. This won't grade on him at all. Next two or three weeks, this will be won be talking World Championship. Oh, maybe one of the rounds needs finally something, some way to screw me over out of my title. I like it. All right. I Kevin, can you do this? Because if you don't remember, ladies and gentlemen, I am the reigning Kinda Funny Nintendo World Champion. Where do you get that? You just carry that around with Tim just to remind Tim he's never ever won it, held this title, he never will. Oh, I will. I think you that title will be mine. So thank you to Andre, go subscribe to youtube.com/blacknerdcomedy.",
      "start": 1475.32
    },
    {
      "text": "that around with Tim just to remind Tim he's never ever won it, held this title, he never will. Oh, I will. I think you that title will be mine. So thank you to Andre, go subscribe to youtube.com/blacknerdcomedy and then of course thank you to Mike Decker who supported us over on patreon.com/kindafunny just like you can get your topic red, have a great time, be one of the best friends out there.",
      "start": 1523.76
    }
  ]
}
