{
  "id": 1571,
  "video_id": "ILT7OvWSFpM",
  "show_name": "Gamescast",
  "hosts": [],
  "title": "New Game Reviews and Impressions - Kinda Funny Gamescast Ep. 58 (Pt. 1)",
  "description": "We review and give impressions for all the latest games we have been playing.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
  "published_at": 1456149600,
  "duration": 1949,
  "transcript_chunks": [
    {
      "text": "What's up guys, welcome to first ever Episode 58 of the Kinda Funny Gamescast. I had to look at my phone cause I wasn't sure what you weren't here last week, so you're totally off. Yeah, I don't even know, anything could have changed. This show might not even be the same show anymore. I renamed it. What is it now? Kevin the Potato and his three best friends. Welcome to the first ever episode of Kevin and the Potato and his three best friends. Is that what we said? I like that. Yeah, so what, what's the source of this Kevin Potato thing? Is it the same potato thing that the internet has, the potato thing? Well, I started it and then they jumped on it. Got it. So Colin Glav, I started calling Kevin a potato because he kind of looks like a potato sometimes. He kind of does, like a sexy potato, like a fingerling potato. My God, fingerling potatoes are the bomb, putting that out there right now. Pretty good. Love a good fingerling potato. Ladies and gentlemen, as always, I'm Tim Gettys. I'm joined by the coolest dudes in",
      "start": 0.31
    },
    {
      "text": "my God, fingerling potatoes are the bomb, putting that out there right now. Pretty good. Love a good fingerling potato. Ladies and gentlemen, as always, I'm Tim Gettys. I'm joined by the coolest dudes in video games. That's going to stick one day. I want, I want, I know, but I want like the people that aren't our people. I want like other people to think that you guys are the coolest dudes. Okay, you know, like the other dudes in video games. I want them to be like, oh, one day I want to be great. What about the other dudettes in video games? Well, they get their own, their own scale. Okay, yeah, you can't be on that scale, Greg. Okay, just because the ego is getting in the way, you can't win that one. Oh, we'll see. Yeah, all right, yeah, I guess you're right. I guess you're right. So if you are not familiar, this is a show every week over here on youtube.com/KindaFunnyGames. We talk about video games and all the things that we love about them. We also do an iTunes and SoundCloud. There's a problem with iTunes. I don't know why.",
      "start": 44.0
    },
    {
      "text": "every week over here on youtube.com/KindaFunnyGames. We talk about video games and all the things that we love about them. We also do an iTunes and SoundCloud. There's a problem with iTunes. I don't know why. Really? Yeah, we should just start talking about this in all the shows. If you're subscribed to us, unsubscribe and resubscribe. Miss notifications. Don't know what's going on. I think it was an iTunes podcast thing across all the boards. I'm seeing a lot of people saying this stuff. So make sure you check that stuff out. Leave a review if you feel so inclined and uh just say something, say something about us, you know, let us know how we're doing and all that stuff. Are we allowed to talk about this shirt? I want to know more about this shirt. This is a very nice shirt. Where did this come from? This shirt came from Insert Coin Clothing. This is not a plug by the way. This is not an ad. This is not a land. Well, I mean, I like them. I'm just saying it was by the way, we're brought to you by this.",
      "start": 83.32
    },
    {
      "text": "came from Insert Coin Clothing. This is not a plug by the way. This is not an ad. This is not a land. Well, I mean, I like them. I'm just saying it was by the way, we're brought to you by this sponsored in the sense that I was not sponsored, but uh I saw a bunch of clothing from them like, I like this stuff. So I reached out to them like, hey, like I want some of your stuff. They're like, oh, we'll send it to you. I'm like, they were super nice. Shirt's awesome. I like it too. It's Hello Kitty. Hello Kitty's my my homie, so that's cool. Um I also got a rare shirt from them. Oh, that's what I saw you wearing yesterday. That was from them. That's over on featured on the GameOverGreggy Show. Go to youtube.com/KindaFunny to see that one. Um but anyways, yeah, InsertCoinClothing.com. Check them out. You'll probably like something they have over there. They sell the like Nathan Drake's scarf and like it's there's a lot of licensed stuff that's like actual game. They're the ones who did the cool Diamond Dogs.",
      "start": 118.68
    },
    {
      "text": "probably like something they have over there. They sell the like Nathan Drake's scarf and like it's there's a lot of licensed stuff that's like actual game. They're the ones who did the cool Diamond Dogs jacket, right? Yes, the Diamond Dogs, the PlayStation jacket. I got that one. It's pretty fun. Why haven't you worn that yet? Um cause I'm I'm waiting just build up, build up. Anyways, um more the rig moral, Patreon.com/KindaFunnyGames. You can get the show early and get exclusive episodes. I think that's the more cool thing. Only cost a dollar. This episode going to be worth a dollar. Yeah, I can tell you right now. Sure. I feel some good discussion coming on. I like it. Yeah, we've been playing a lot of video games recently. Let's start this one off right, just like right now. Topic one, we're going to give a bunch of reviews and impressions of games we've been playing. So this is a mix of a topic of what are we playing right now with, you know, more substantial thoughts on on games without having to give a full topic to the.",
      "start": 157.68
    },
    {
      "text": "and impressions of games we've been playing. So this is a mix of a topic of what are we playing right now with, you know, more substantial thoughts on on games without having to give a full topic to the games cause I feel like right now, especially with the games talking about, not all of us have played them or somewhere more Tim, more Colin and more Greg. So we'll just kind of give mini reviews slash impressions. You want to start this one off? Sure. How you doing? Good, good, good to see you. Uh my name is Greg. Uh lately I've been playing, I started Far Cry Primal last night, put about an hour and a half into it, maybe two. Uh played the night before that, Episode One of Minecraft Story Mode. Late to it on that one, but saw it on the thing and didn't want something, I wanted something that was going to end. I didn't want to jump in that night knowing Far Cry Primal's the next day and get into something that I wouldn't have time to actually done. And also beat Layers of Fear this this past since we've last done.",
      "start": 195.48
    },
    {
      "text": "want to jump in that night knowing Far Cry Primal's the next day and get into something that I wouldn't have time to actually done. And also beat Layers of Fear this this past since we've last done this or whatever. Cool. So I've enjoyed all of them. Um starting with Far Cry Primal, only an hour and a half in, right? Um I feel like I'm waiting for it to get amazing. You know what I mean? It's more Far Cry. It's Far Cry with the Primal skin, I feel like. And I know that that sounds like a knock and I know they went out of their way in the the event we went to to say that's not what this is, but it's what it feels like it is. You know what I mean? If if that makes sense. Like I'm playing it, it's like, okay, cool. Like the crafting system seems not necessarily deeper, but it's more late, it's laid out better, I feel like. Or at least I know where I'm going in terms of like before was like, I don't know if I'm going to get to this and you had to drill down into menus. Kind of everything's up there. Uh same thing with.",
      "start": 233.4
    },
    {
      "text": "like or at least I know where I'm going in terms of like before was like, I don't know if I'm going to get to this and you had to drill down into menus. Kind of everything's up there. Uh same thing with like the skills in terms of improving your character and doing this. I'm seeing it right, you know, on the the thing there. But the, you know, the the HUD, the little radar, the map, it all looks like Far Cry and it's the same idea of Far Cry and go here and take out these guys and light the bonfire to take that. And that's all great. It's all well and good. But like I was talking about it to Nick today, right? And he was like, yeah, okay, cool. And he's like, are you going to beat it? And I'm like, no, I'm not going to beat it. Like, you know what? Like this is a game I'm going to play for a while, I bet. But even tonight, I'm like, do I want to play that or do I want to play Episode Two of Minecraft Story Mode? You know what I mean? Like it it's this Far Cry Primal is checking the boxes of being, I'm a video game and you.",
      "start": 270.88
    },
    {
      "text": "I'm like, do I want to play that or do I want to play Episode Two of Minecraft Story Mode? You know what I mean? Like it it's this Far Cry Primal is checking the boxes of being, I'm a video game and you have all these question marks on the map. Don't you want to go investigate them? I'm like, I do. I do want to go investigate them. And don't I want to make the bigger uh quiver for my arrows? Like, God, I really do. So I do have to go hunt down these dingo or whatever the hell, however I pronounce this thing. And so there and that's all there. But for me in particular, and I wonder how much this will be for everybody else too. I you know, I always talk about being this story horror and this different thing. Like I don't feel a connection to these characters. You know what I mean? Like it is for me a a hurdle that I like, I'm reading everything, not that I hate reading, but just because like I I'd rather hear my character talk. I wish they would have done. I when we were when we were at the event, I talked to you.",
      "start": 301.68
    },
    {
      "text": "I like, I'm reading everything, not that I hate reading, but just because like I I'd rather hear my character talk. I wish they would have done. I when we were when we were at the event, I talked to you about like, are they going to transition at some point? You know how sometimes movies or cartoons or shows will do that where somebody's speaking Russian and then like the camera swings around and they start speaking English. So it's like, it's established they're not speaking English, but here you go, they're speaking English so you can understand. It's not doing that. So it's like, okay, cool. Like the whole time I'm like, well, and like also it's Primal, of course, right? So it's like, what's this girl's name that I'm helping? Like, what's her deal? I I got to go get a shaman or whatever. It's like, all right, you know what I mean? Like that's fine. The idea of building out the community because you have to go like, there's like side missions to go help, you know, whatever Wayward uh villagers or whatever. Then you.",
      "start": 335.4
    },
    {
      "text": "know what I mean? Like that's fine. The idea of building out the community because you have to go like, there's like side missions to go help, you know, whatever Wayward uh villagers or whatever. Then you can bring them back and put them in your village and build out your village and make it bigger. That seems cool. That seems like what's going to be different compared to Far Cry 4, the Far Cry we know before. But not having really invested that into that yet and investigated, I should say. I don't know if that's going to be enough. And I have such a bad taste in my mouth from Fallout base building. You know, I'm I'm not like jazzed to make a community. I'd rather roam the countryside. Like I you already, you're already running into like, oh, you don't have a grappling hook. And I'm like, oh, grappling hook's going to be dope to get. Yeah, that's going to be dope to get and shoot around here. But it is Far Cry. It is a video game. It is go do all these things. But even then, it's like, I think I pieced this together. I.",
      "start": 370.84
    },
    {
      "text": "be dope to get. Yeah, that's going to be dope to get and shoot around here. But it is Far Cry. It is a video game. It is go do all these things. But even then, it's like, I think I pieced this together. I think you and I were talking about. I was like, I think I beat Far Cry 4. I saw both endings. I watched Styer beat Far Cry 4. And then so I played Far Cry 4, but never finished it. But watch her beat it. And then I did the like the ending where you just sit there for 15 minutes in the beginning of Far Cry 4. That was all well and good. But now that I'm playing this, it's almost making me like, hmm, it'd be cool a wing suit and shoot and stuff. Maybe I want to go back and play that instead of this. You know what I mean? But I'm going to give this more time. But I in traditional, I think Telltale fashion, I'd let this uh, you know, Minecraft slept on it a bit. Like, you know what I mean? I was I was trying to just wait for it all to be done like to get till Episode 5. But Episode 5 nowhere in sight right now. They say, say.",
      "start": 402.96
    },
    {
      "text": "you know, Minecraft slept on it a bit. Like, you know what I mean? I was I was trying to just wait for it all to be done like to get till Episode 5. But Episode 5 nowhere in sight right now. They say, say soon. Um I was like, like, oh, whatever, I'll try it. Jumped in, tried that. It starts off like, who are these? What's happening? And then I really got into the characters and the the play between them, you know? Um this is their first one where they're really using like celebrity voice actors. You know what I mean? So there's like people in there other than, I mean, Scott Porter is in it and a bunch of the other Telltale people. But Patton Oswalt, you know what I mean, is like this main character of the game or whatever. And so I like him. I like where the story's going. Episode One did make me want to play Episode Two. So I think tonight I might actually just play that instead of Far Cry. I saw that you tweeted yesterday, you're like, oh, I'm happy to see that they did the the same type of intro that the other what.",
      "start": 438.64
    },
    {
      "text": "so I think tonight I might actually just play that instead of Far Cry. I saw that you tweeted yesterday, you're like, oh, I'm happy to see that they did the the same type of intro that the other what? What do you mean by that? Well, uh Tales from the Borderlands, when it started, you know, like I feel like, you know, for as much stuff as Telltale gets, they do evolve their product as they go, right? And Tales from the Borderlands was the first one where it was like, I feel uh we're going to give you uh this game that's light-hearted, fun. It's based around the story or whatever. And we're going to present it to you like you'd expect a really good TV show or a really good movie. And so what Tales from the Borderlands always did is that you'd start playing the episode and then there'd be this like critical moment, like maybe 15, 30 minutes into the game or whatever, where an awesome song would come in to set the mood of what the game's going to be. And then it would be like slow motion, funny, like the words and the.",
      "start": 471.28
    },
    {
      "text": "maybe 15, 30 minutes into the game or whatever, where an awesome song would come in to set the mood of what the game's going to be. And then it would be like slow motion, funny, like the words and the Gearbox logos or Gearbox logos are coming in and falling in like, you know, you're tumbling through the sky or doing this thing. And it was like, it was like this great breather all of a sudden after this short little appetizer introduction of like, now we're getting into like, this is what you're playing. Here's this awesome intro, you know, to establish what's happening. It was different for every episode because it wasn't like, you know, the Sopranos' opening that always is the same clip, right? It was this thing in the world of what's happening in the story. And so I I wasn't I wasn't sure if they if that was something they were doing for Tales from the Borderlands or if they were going to expand it to other things. And they have it in this game too. So like, you start it off and like, yeah, you know, you're.",
      "start": 509.92
    },
    {
      "text": "something they were doing for Tales from the Borderlands or if they were going to expand it to other things. And they have it in this game too. So like, you start it off and like, yeah, you know, you're this and Episode One, you know, tumbling through the air. This is coming in. Creepers are there, spiders are there. It's fun stuff. So Layers of Fear. Well, I'm not done with Story Mode. The thing about Story Mode that I find interesting though is when I'm playing it, it makes me really want to stop and play Minecraft if that makes sense. You know what? Like I'm enjoying the story part of it. And I think maybe now it's different based on the fact that I've beaten the episode, I'm even more. But in the beginning for sure, when I was playing like, you know, they're in the Minecraft world or whatever and they're they were going to a build competition and stuff. And I was like, hmm, I should probably start Minecraft on PlayStation 4 because I've been playing on Vita forever. And that's fine. But like, it's limited. You.",
      "start": 547.92
    },
    {
      "text": "were going to a build competition and stuff. And I was like, hmm, I should probably start Minecraft on PlayStation 4 because I've been playing on Vita forever. And that's fine. But like, it's limited. You know what I mean? I think that's hampered my excitement to go back to it just because it's a smaller world. Whereas PlayStation 4 worlds are crazier and better builds and, you know, caverns, better mines. You don't know what I'm talking about. Better mines, better crafts. Better crafts indeed. Then yeah, Layers of Fear. Layers of Fear. We did uh the sponsored Let's Play that's up over there. And when we went and played that at the Haunted Mansion, which you can go watch on youtube.com/KindaFunnyGames. It was fun because we were all being goons to each other and stupid. But it was like a relay thing. And Colin went first. So when I went in there and sat down to play Layers of Fear, no idea what the heck happening. You know what I mean? Like I'm playing it and it's just like, all right, collect this, do that. This.",
      "start": 578.4
    },
    {
      "text": "first so when I went in there and sat down to play Layers of Fear, no idea what the heck happening. You know what I mean? Like I'm playing it and it's just like, all right, collect this, do that. This guy's talking. Is is is this a random dude? I don't know. You know what I mean? And so last week when I got my code and sat down to actually play it, I was surprised by how much I enjoyed it and how actually interesting the story is of when you start in that thing, you're like, oh, the voice is me and I'm this character and this has happened to my wife and I had this daughter. And like, how does this all play into each other? And you're picking up notes and reading about this story of like, oh, like this is actually really, really interesting. And it's another, you know, game similar to Minecraft Story Mode, right? Where like even tonight, like I'd like to play something that has an end. So I'm done with it and I feel like I've completed a chapter and I put it away. Like Layers of Fear, you know, six chapters. You can.",
      "start": 611.92
    },
    {
      "text": "where like even tonight, like I'd like to play something that has an end. So I'm done with it and I feel like I've completed a chapter and I put it away. Like Layers of Fear, you know, six chapters. You can beat it in a night. I I think I spaced that out of to just I started late. But it's the same thing of like, I go through, I explore and I, you know, it's conquerable. And then when it's done, I feel like I've accomplished something. And I I if I want to go back and jump back in and do this thing, I could. You know what I mean? I want to get the whole story out of it. But it was fascinating. It was a interesting story. It runs like heck on PlayStation 4. Uh it it is it has scares. You know what I mean? When I was playing it for me, it is like that, all right, PT didn't happen, but this is like similar to it and it's going to give you the same kind of spooks and scares and stuff. I'm like, oh, okay, cool. You know what I mean? And when I dug about it, you know, on as I'm playing it, it occurred to me that like this is my.",
      "start": 648.76
    },
    {
      "text": "going to give you the same kind of spooks and scares and stuff. I'm like, oh, okay, cool. You know what I mean? And when I dug about it, you know, on as I'm playing it, it occurred to me that like this is my preferred haunted house. Like, you know what I mean? Like in Halloween, when you go to the haunted house and the guys in the mask jump out and stuff, it's like that thing of like, ah, that was funny, huh? But like, it wasn't great. You know, I don't know. It didn't it never really gets me that much. You know what I mean? Whereas this one, it's like, you know, you do something and you you turn a corner and you're like, it's a dead end. I'm like, I got to turn back around and the world's going to be completely different now. And something you turn, get you still get scared because you don't know what's going to be there because in the video game where literally anything can happen, except where the haunted house, it's just some heck broke ass college kid with a mask on. I did not enjoy it nearly as much as it sounds.",
      "start": 685.16
    },
    {
      "text": "because in the video game where literally anything can happen, except where the haunted house, it's just some heck broke ass college kid with a mask on. I did not enjoy it nearly as much as it sounds like you guys did play. I didn't I didn't beat the whole thing, but I don't I don't even want to. I got I played I played most of it. I I think most of it. Yeah. And it just I don't know. It felt like it wasn't what it was trying to be overall. Like it wasn't PT. And like I I really enjoyed PT and I enjoyed the story of PT and how like figuring out a little things. This to me kind of just felt like it was trying to just get all the big scare moments out. And it's like it felt like uh kind of just adding all the different things that we've seen from the horror games over the last couple years into one just thing. Just like, here's this moment, here's this moment. And it like almost becomes predictable of where the scares are going to be. Of course, yeah. Um and I think the greatest offense though is that the.",
      "start": 714.72
    },
    {
      "text": "thing just like, here's this moment, here's this moment. And it like almost becomes predictable of where the scares are going to be. Of course, yeah. Um and I think the greatest offense though is that the game while it was designed to just kind of like, you know, let you explore these areas and feel like you're, you know, getting the story and all this from the the the atmosphere and the environment, um it was tunneling you to get to this next moment, get to this next moment. And I feel like the game didn't do a good job of making sure those moments were optimized to be seen by the player. Like I feel like there was multiple times where like, I'm there and I know when I turn around something to be there, but I turned around and I wasn't exactly facing where the scare happened. You know, um or even in Colin's Let's Play, like there's a scene where you're walking down the the hallway and things like the paintings start like coming off and there's something there's something a little bit off about it that I.",
      "start": 754.96
    },
    {
      "text": "Let's Play like there's a scene where you're walking down the the hallway and things like the paintings start like coming off and there's something there's something a little bit off about it that I was like, that could have been scarier. Like that could have actually been a surprise instead of, all right, this is going to happen. Like I feel like it's really telegraphed and it just misses the mark in terms of the scares and in terms of the gameplay. It's like, I mean, it is very simple. It is just like a walk around, do things. So it's like, it's, you know, whatever, that's all fine. But it's just because we've seen so many scary games in the last couple years that are just you're walking around something and things are just happening. Like this kind of felt like a a bad greatest hits album. Um that's kind of my thoughts on it. Interesting. No, I and I don't think you're wrong. Like I saying, I think it is telegraphed at times. And I do think it, you know, like I say, it's like PT. It's not PT. It doesn't have.",
      "start": 793.52
    },
    {
      "text": "of my thoughts on it. Interesting. No, I and I don't think you're wrong. Like I saying, I think it is telegraphed at times. And I do think it, you know, like I say, it's like PT. It's not PT. It doesn't have the presentational value of PT, right? Like I think that like you're, you know, in terms of how it looks, how it runs, you know, the voice acting, it's like, okay, like this clearly isn't a AAA game. But I enjoy it. You played it. Well, just real quick, I think just what I was saying about like the just acclamation of all the stuff in one. It's just like, all right, here's baby dolls. Oh, here's a big face. Here's like scary paintings that do stuff. And it's like, man, it's really and oh, here's like goo. There's the black goo. And it's like, they just stuck to kind of maybe one aesthetic. I think I would have enjoyed it a lot more. Whereas this, it was just like so much different things. They're like, horror, it's horror. Yeah, you know. Um yeah, to reiterate, we we did have a sponsorship with them. So you can take everything we.",
      "start": 833.8
    },
    {
      "text": "lot more. Whereas this, it was just like so much different things. They're like, horror, it's horror. Yeah, you know. Um yeah, to reiterate, we we did have a sponsorship with them. So you can take everything we say about the game with a grain of salt if you want. But um I think the game's quite clever. Um and uh I think it's actually really good. Um and you didn't like PT? Uh yeah, PT was strange to me. I mean, this game is clearly inspired, very inspired by PT. I don't think it's like PT at all, but I think it's I think it's it's inspired by it. Um the game does a really nice job of rewarding exploration and rewarding uh being very thorough with the storytelling. And I actually find it quite engaging and captivating. I uh was playing it through all one night and I got distracted during the last chapter by a phone call. So I never went back to it. But uh I will. I mean, I just have to finish the last that sixth chapter. But so unless it falls off the cliff, I don't know that it's going to be any worse than what I.",
      "start": 871.56
    },
    {
      "text": "call so I never went back to it but uh I will I mean I just have to finish the last that six chapter but so unless it falls off the cliff I don't know that it's going to be any worse than what I think it is uh but I I do enjoy the uh rifling through **** and like being rewarded for finding and newspaper clippings and stuff like that and the story is really interesting about the the the surreal artist and his wife who gets into a terrible accident and I don't want to spoil too much of it but like you don't you could really go through the game without knowing any of the context at all if you're just not if you're not thorough it reminds me of Gone Home in the sense that um it's not nearly as good as Gone Home but it reminds me of Gone Home in the sense that uh the more you engage with the world around you the more you get out of it it's the exact opposite way I felt about Firewatch where it was Firewatch was just whatever like it the story was Bor like kind of boring to me it didn't",
      "start": 914.84
    },
    {
      "text": "world around you the more you get out of it it's the exact opposite way I felt about Firewatch where it was Firewatch was just whatever like it the story was Bor like kind of boring to me it didn't really matter what was going on in the game and there was no reason to really explore because the game didn't compel you to do so directly um and I think Layers of Fear does a really nice job of saying like you know maybe try rifling through some of the **** because most of the time you're not going to find anything and you actually start to get frustrated after a while opening everything and like there's nothing there but then like you see a newspaper clipping or you see a photo or something and it gives you a little bit of context uh for what what this this gentleman's going through in the game so I think that it's quite clever it doesn't run well on PS4 but um but I like it a lot like I think it's a I think it's I don't know if I'd say it's great maybe it is but I I think it's good I",
      "start": 948.56
    },
    {
      "text": "game so I think that it's quite clever it doesn't run well on PS4 but um but I like it a lot like I think it's a I think it's I don't know if I'd say it's great maybe it is but I I think it's good I think it's it's very good um if you're into you know the more walking simulator horror game and I actually think the horror is quite clever because it's it's it's very uh um what's a good way of putting it it's it's like chapter by chapter based in the sense that like with the baby stuff for instance like that's all that whole chapter is about the kid so like that like that's interesting to me it's not like a when we played at the the Mansion it did see like it seem like it was a greatest hits of uh you know like um of horror tropes or whatever but like in context it's I don't really see it like that at all I don't and I don't find the game the jump scares and stuff like I don't find any of them scary at all like I don't think that that's what the game's about uh and I don't think the",
      "start": 979.0
    },
    {
      "text": "like that at all I don't and I don't find the game the jump scares and stuff like I don't find any of them scary at all like I don't think that that's what the game's about uh and I don't think the game's about seeing everything that it wants you to see either in terms of like the things flying off the wall or people creeping around you or whatever I think it's more about the psychological horror of the the house and this guy's like this guy's like psychosis so I think it's quite I think it's quite good personally um I've been playing Saturday Morning RPG a lot on Vita and it's it's really good um what is that it's a it's an episodic so these guys did kick started for this game some time ago and they only raised $10,000 so it's a pretty low-budget uh turn-based role playing game based on this kid named Marty who's like an 80s kid and and uh it's it's all these 80s tropes in the game so it's it's five episodes each episode's like two hours long I'm on the fourth episode right now and uh",
      "start": 1017.48
    },
    {
      "text": "kid named Marty who's like an 80s kid and and uh it's it's all these 80s tropes in the game so it's it's five episodes each episode's like two hours long I'm on the fourth episode right now and uh you just like you're in a high school like an '80s high school or you're you know you're going through it's just it's very silly and like the bad guys are like the the G.I. Joes basically or Cobra they're called um like the the bad guys name is Commander Hood um um and uh the Transformers are in it and like there's all these like Back to the Future references and Etc and so on so it's but it but the gameplay is actually really solid explained a little bit on PS I Love You So I'm sorry if it's redundant for people that that have listened to that show as well but uh you have a Trapper Keeper like a binder and um it keeps you keep everything inside of it that you find so you find like stickers like scratch and sniff stickers or whatever and you can like use five of them at a time before each",
      "start": 1055.72
    },
    {
      "text": "a binder and um it keeps you keep everything inside of it that you find so you find like stickers like scratch and sniff stickers or whatever and you can like use five of them at a time before each battle to like raise your defense or like lower the hit points of an of a uhu awesome like they pop up on the Vita and you like scratch them like quickly and like you have 5 Seconds to get them all and then like some of them pop up and you like know the status elements and stuff and then you get into the game and you find like these these tools that you use so you can like just punch and fight normally or charge yourself up to to do more damage but you find like different items in the world that um you can use in battle as well a certain amount of times per battle so you can find like a basketball that if you like hit the enemy with it like it it it causes burn damage and you can find um uh like a Simon game that like if you keep doing it in order like it causes like random status elements",
      "start": 1092.68
    },
    {
      "text": "that if you like hit the enemy with it like it it it causes burn damage and you can find um uh like a Simon game that like if you keep doing it in order like it causes like random status elements to the end enemies or whatever and then you fail and it can cause like status elements to you basically um so like there's there's all sorts of like different tools the game's quite clever it's it's it's somewhat difficult again it's not pretty it's not like over the top or whatever but there's a lot of like funny references in it and for people that grew up in the 80s and the in the early 90s I think that it will really resonate with them as well and it's just uh it's just quite silly and and uh it's cheap so it's on PS4 and Vita you can play it on PC as well I think um I've been spending quite a bit of time with that and then I downloaded uh Trails of Cold Steel finally um which is a role playing game that people that's getting quite a bit of a claim on the Vita it's also on PS3 um",
      "start": 1127.04
    },
    {
      "text": "bit of time with that and then I downloaded uh Trails of Cold Steel finally um which is a role playing game that people that's getting quite a bit of a claim on the Vita it's also on PS3 um but I only spent about an hour with it it wasn't scratching the itch that I wanted right now but I am traveling right after the show so I'm going to start jumping back into it and seeing if it if it resonates with me because I do you know I do see something interesting there but I just it just wasn't resonating with me in that way Saturday Morning RPG on the other hand was like really scratching some itches for me and and uh really enjoyed I do highly recommend it it's the low times are a little slow on Vita um but there's something like really quite quirky and clever and I think it's it's uh it's a lot of fun you said uh what is it episodic or is broken up Saturday Morning RPG yeah like it's all within the same game but there's like five episodes how long are the episodes roughly two",
      "start": 1161.28
    },
    {
      "text": "uh it's a lot of fun you said uh what is it episodic or is broken up Saturday Morning RPG yeah like it's all within the same game but there's like five episodes how long are the episodes roughly two hours or so so uh yeah and then your stats carry over from one the next or whatever and you know it scores you based on how thorough you are and finding secrets and finding the stickers and the items or whatever so you can go back and play them again and there's like a battle mode and an endless mode and stuff like that so it's uh it's it's a it's a pretty good game uh I've definitely enjoyed it maybe maybe uh maybe my favorite game of the year so far when I really think about it it sounds cool yeah yeah it's neat I've been traveling a lot because of Philadelphia so there's a lot of flights and a lot of layovers a lot of **** um I told you I wasn't going to bring my Vita cuz I wanted to focus on Fire Emblem um Fates but I ended up bringing it and one one of the flights I played Fire",
      "start": 1197.28
    },
    {
      "text": "and a lot of layovers a lot of **** um I told you I wasn't going to bring my Vita cuz I wanted to focus on Fire Emblem Fates but I ended up bringing it and one one of the flights I played Fire Emblem Fates and Birthright and one of them I played Digimon Story: Cyber Sleuth and in between I was just on my phone I found this new mobile game that is awesome and I want you to try it Colin cuz this is one of those things where if it was on Vita you'd be all **** over it it's called Tomb of the Mask wait Tomb of the Mask and it's awesome it reminds me it's uh like if Pac-Man and Super Meat Boy **** like this would be the the result of it it's a really fast-paced thing where you know in Pac-Man you kind of just you just choose the direction he goes imagine if that had the like kind of just like SL like super fast just like splashing against thing nature of Super Meat Boy where you're in this Tower and you're just going up and uh there's like a right the bottom of the screen's Rising",
      "start": 1237.28
    },
    {
      "text": "like SL like super fast just like splashing against thing nature of Super Meat Boy where you're in this Tower and you're just going up and uh there's like a right the bottom of the screen's Rising like Tetris style kind of to get you and just keeps going faster and faster you're just collecting like little dots and coins and stuff but the game does a really good job of like rewarding you and making you want to keep leveling up and keep getting more points and stuff and every time you reach like a certain amount of uh little pellets or whatever you get like you reach a new level and like the screen explodes with like you're now level five you're now level six and it's like I don't really know what it means but I want it you know what I mean and it's like a perfect it's a perfect mobile game for me where it's like I keep finding myself laying in I'm like I'm going level up three more levels like just you know mash it out till then I'm I guess I'll keep going a little longer or like if",
      "start": 1279.68
    },
    {
      "text": "for me where it's like I keep finding myself laying in I'm like I'm going level up three more levels like just you know mash it out till then I'm I guess I'll keep going a little longer or like if I'm waiting in line for something and like it's one of it's a good game for that um and it was perfect when I was just on my flight just like in between doing other stuff like I I don't really want to invest in like an RPG right now so for right now I'm just going to bang this out and it's pretty fun and I want to I want to see what you have to say about it I'll play it on your phone if you um then there's uh Fire Emblem Fates what do you think oh I mean I love it's Fire Emblem Fire Emblem is one of my favorite franchises I think overall and it's such a surprise to me because I obviously got into it only after Smash Brothers because wasn't in America until then and um you know then I kind of went back and I've played all of the the American games that have come out and like I love them",
      "start": 1314.96
    },
    {
      "text": "it only after Smash Brothers because wasn't in America until then and um you know then I kind of went back and I've played all of the the American games that have come out and like I love them so much and this was the first time that a new one was coming out that I wasn't super super stoked for like I never really liked the look of it um there's and it was confusing to me that there's three games so there's Birthright, Conquest, and Revelation and it's the same the beginning of the games are always the same for the first six chapters but then there's uh like then it the story branches and it does different things based on which family you choose and then Revelation is kind of like the true ending like version where you don't choose either side and you just kind of like Do Your Own Thing you're playing the story yeah yeah and uh it's it's interesting that they they released it that way where it's two separate cards so it's kind of like Pokemon Red and Blue and I'm seeing a lot of",
      "start": 1352.28
    },
    {
      "text": "you're playing the story yeah yeah and uh it's it's interesting that they they released it that way where it's two separate cards so it's kind of like Pokemon Red and Blue and I'm seeing a lot of places review the game as if it's the same game which doesn't really make sense to me because it's more similar to Zelda: Oracle of Seasons and Oracle of Ages where they're two very different games they have similar you know things going on and the same characters and stuff but like it's very totally different game um once you reach a certain point or you can buy the special edition which is the one I have that has all three on one cart and that gives you the option to once you beat the game once you beat Birthright you can start from chapter 6 so you don't need to repl which is good and I was a worry I was going to have I was like I don't want to have to do that like the basically the tutorial missions again yeah so I'm happy you don't have to do that I I haven't beat any of them",
      "start": 1397.56
    },
    {
      "text": "I was a worry I was going to have I was like I don't want to have to do that like the basically the tutorial missions again yeah so I'm happy you don't have to do that I I haven't beat any of them yet I'm 85% through Birthright and um they they've made it really clear that Birthright is the easier of the two games and I wanted to you know kind of work my way out I think the proper way to play would be Birthright, Conquest, and then Revelation um and it's it's really it's really good you know um I the reasons I was trepidacious about it is I don't really like like the designs of the characters too much uh it has the the two families one of them has a more European flare and one has a way more old school Japanese feel whereas all the other Fire Emblem have been a bit more like anime style European Vibe you know and for all the reasons I wasn't excited about it playing it I'm like oh I like that this is different like I'm not just another guy with blue hair and a sword like your main",
      "start": 1436.2
    },
    {
      "text": "European Vibe you know and for all the reasons I wasn't excited about it playing it I'm like oh I like that this is different like I'm not just another guy with blue hair and a sword like your main character has white hair and a sword oh there you go no but it's but the main character isn't the kind of just Warrior style that you're used to having the Fire Emblem games um she or he mights as she turns into a dragon so it's like the in Fire Emblem characters that can like turn into animals and stuff so it's I like that there's just a kind of shift it'd be the equivalent going back to Pokemon of if they were to make a Pokemon game that you don't choose either a fire water or um Leaf starter you know like actually choosing different types and stuff and it's like I appreciate that they they tried to at least shift this core gameplay element a little bit enough that like it affects the story line and the actual gameplay of it instead of just having one character that you just have that",
      "start": 1479.32
    },
    {
      "text": "tried to at least shift this core gameplay element a little bit enough that like it affects the story line and the actual gameplay of it instead of just having one character that you just have that just goes through and destroys everybody and is obviously stronger than everyone on your team yeah um I'm really enjoying it Birthright I hear and from what I'm playing in the game it's it's way more straightforward than Conquest is in terms of the mission objectives it is just kind of go through clear the map go through clear the map um but even then it's interrupted with like kind of new twists on it that keep it interesting and I always like and appreciate the Fire Emblem does that like they they understand when it is becoming just the same game over and over um whereas Conquest I hear has like every Mission has a different like gimmick or twist to the mission that you need to think about and uh one of those that's across all of them is because you turn into a dragon there's these things",
      "start": 1522.04
    },
    {
      "text": "every Mission has a different like gimmick or twist to the mission that you need to think about and uh one of those that's across all of them is because you turn into a dragon there's these things called Dragon Veils I think where on the map there'll be squares that if you get on them you can like use your dragon powers to change the landscape so it's like if there's quick sand you can like shoot fire at it it like makes it hard so you can like walk over You'be able to move more spaces faster or whatever but if you do that it also affects the enemies that means they can get to you quicker and stuff and I it's really cool and it's it's one of those it's a nice little twist that they added to the game in the same way that last year or not last year's last games Awakening added the partner system where it's like it's the same **** you know but like it's a Twist that really does kind of change the Dynamics and flow of each match and uh they also improved the partner system that they",
      "start": 1563.52
    },
    {
      "text": "system where it's like it's the same **** you know but like it's a Twist that really does kind of change the Dynamics and flow of each match and uh they also improved the partner system that they had an Awakening where it's not overpowered like in in Awakening you kind of partner up and just like wreck hell on everything now it is a bit more there's two options there's more of a um offensive or defensive based on whether you partner with them or just on a space next to them and I like that it opens up a lot of strategic like elements to the game that really make you think about all your characters in in a way that I normally just focus on a couple and I'm like I don't really care what happens to the rest of them um having said that story is similarly like lame and you know just kind of like here it's fairly generic and here's your emotional moments and it's really kind of like paint by numbers um Awakening had the same issue like I kind of missed like Fire Emblem 9 had such an",
      "start": 1605.4
    },
    {
      "text": "of like here it's fairly generic and here's your emotional moments and it's really kind of like paint by numbers um Awakening had the same issue like I kind of missed like Fire Emblem 9 had such an awesome story like Ike's game I loved that and uh this is kind of just it's like all right I I I get what's going on um and I think my biggest complaint about the game is that the the characters are all so similar looking and have such weird weird names and there's two families and like they throw you into this in a way that the other games don't where I'm like I don't know these characters and they're not different enough looking so that I can be like all right that's the Healer that I really like need this is the Archer that I there's another a better one or this is the you know platin whatever and so it's like there'll be certain characters where before I'd be like all right I know who my go-tos are now I'm like oh **** I just leveled up this person when I meant to level up this person",
      "start": 1653.0
    },
    {
      "text": "and so it's like there'll be certain characters where before I'd be like all right I know who my go-tos are now I'm like oh **** I just leveled up this person when I meant to level up this person I'm really excited to keep playing though and it's definitely it got me in it Loop of like I'm addicted to it I want to keep playing and I want to keep I want I'm going to play through all three of the games and I like that the really the three games and since I have it on one cart it's just a super long ass game yeah of gameplay that I love so that's awesome that's cool and there's also a new defense mode uh where like there's a a castle you have to build a fort and stuff I hate that **** there's no game where I'm like this is what I want to do yeah um so that's that's upsetting to me but the mode in that's cool where instead of going off and trying to fight everyone you're defending so it's one of those things where like there's people come from all angles and you need to make sure you",
      "start": 1693.2
    },
    {
      "text": "mode in that's cool where instead of going off and trying to fight everyone you're defending so it's one of those things where like there's people come from all angles and you need to make sure you don't die for 11 turns and it that completely switches the way you think about the game and I like it a lot so I definitely recommend it um it adds to the 3DS's vast library in a way that was necessary over the last year so it's a meaty game people have been looking forward to it yeah it's really good and then yeah the last one Digimon Story: Cyber Sleuth oh yeah it's you know it's good you know uh I can understand people that are really into it it's not for me because because it is just it it's too long to be as generic as it is and I feel like it takes too long to get me to the parts that I want I'm a huge Digimon fan like the show and this game it it blows my mind that we're finally getting a Digimon game that like looks similar and like like I'm like oh this gameplay is is cool and it's good",
      "start": 1733.52
    },
    {
      "text": "a huge Digimon fan like the show and this game it it blows my mind that we're finally getting a Digimon game that like looks similar and like like I'm like oh this gameplay is is cool and it's good um because I played Digimon World the last Digimon game I played was Digimon World 1 on PlayStation 1 so I'm sure that they've gotten better since then cuz that one was really weird and all you did was clean up poop poop um but hopefully they've gotten better Digimon's always struggled with this thing where it started as Tamagotchi or before Tamagotchi there was Digimon where it's just like uh you have a monster and you kind of take care of it and feed it and all that stuff and that's not the type of gameplay that I like you know um I am more of a Pokemon guy I like this whole thing and this game it's Pokemon and I'm like ooh well I didn't want it to be just Pokemon like you're actually catching them and like they evolve and the whole thing about Digimon is they the Dig in things supposed to",
      "start": 1778.28
    },
    {
      "text": "it's Pokemon and I'm like ooh well I didn't want it to be just Pokemon like you're actually catching them and like they evolve and the whole thing about Digimon is they the Dig in things supposed to be like a status where they go up and then down um and this is more like that they're at that level and they stay there and it's like oh that's kind of kind of weird and um it's the turn-based thing it's very simple and the biggest problem is it's easy and even when I'm like 5 hours 6 hours in it's like man this is still like I'm def just rolling through enemies like with one or two attacks and like there's not even a chance of me losing and I'm sure it gets harder but at the same time like I'm not sure it's ever even going to get difficult enough that um it's going to be worth playing 40 hours for you know just for it to get kind of difficult sure cuz and it's not rewarding like I I don't feel the need to to level up the characters and whatever because I'm like it it's just generic is kind",
      "start": 1817.68
    },
    {
      "text": "for you know just for it to get kind of difficult sure cuz and it's not rewarding like I I don't feel the need to to level up the characters and whatever because I'm like it it's just generic is kind of the best way I can put it like the music sounds really generic um the look of it's great like it definitely looks nice um it's on Vita and PS4 I think I'd prefer it on Vita on PS4 it's a little like I I'm playing on Vita but I turn it on my PS4 just to see how it would look sure and it it's a little uh sparse is it is it the exact same game it's just yeah exact exact same game um this is a game that came out in Japan a year ago two years ago and it like people protested to get it to come here so finally did people are really enjoying and I'm happy about that but for me it's just it's such uh just I'm going to make a a JRPG here's what it is and you're just walking around it's very empty locations um the battle system it's it's as primitive as a turn-based battle system can be and I",
      "start": 1860.28
    },
    {
      "text": "uh just I'm going to make a JRPG here's what it is and you're just walking around it's very empty locations um the battle system it's it's as primitive as a turn-based battle system can be and I want to play with WarGreymon I don't really and like that's so many hours into it like I I can't even imagine how long I'd have to play to get to that stuff and that that doesn't make me want to keep playing yeah um but I I get why people would like it cuz the the story does seem you know like standard Digimon fair and the characters obviously are the characters you know and love so that's all cool but uh it's not for me but I get that it's for other people and I'm happy I put as much time into it as I did so good there's that",
      "start": 1900.36
    }
  ]
}
