{
    "id": 1563,
    "video_id": "lwbKjXk3OkI",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Sleeping Is the Best - The GameOverGreggy Show Ep. 115 (Pt. 4)",
    "description": "Tim would sleep forever if we let him.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1455782400,
    "duration": 827,
    "transcript_chunks": [
        {
            "text": "Tim, what's your topic? Oh man, you can't do that to me, Greg. My topic is sleeping. Now, I didn't have a topic today going in, so I was thinking, I was like, what, what do I want to talk about? I was like, I don't know. I was looking on Facebook, scrolling through some stuff, and all of a sudden it hit me of how much I want to be sleeping right now. I'm like, that should be my topic. And you said this applied to your hair somehow. Yeah, I really like sleep. I like sleep. You know, you guys know me, you all know me. There's a couple things Tim Gettys like. I like soda. Yeah, you like Coke. I like eating out in all senses of the word. A Jesus God. Um, I like that's pretty much it, and I like sleep. All right, so, so here's my about Nintendo, you're N. I like Pokémon. I like, I like a lot of stuff, right? But I really like sleep, and I think sleep kind of overcomes everything really. Like, I enjoy food. Hunger is definitely, you know, an emotion to me, okay, of just, you know, I need to to feed. It's its hunger. Yeah, um, but when",
            "start": 2.85
        },
        {
            "text": "and I think sleep kind of overcomes everything really. Like, I enjoy food. Hunger is definitely, you know, an emotion to me, okay, of just, you know, I need to to feed. It's its hunger. Yeah, um, but when it comes to sleep, it's like I could sleep forever. You know, there's people that are like, you know, if you sleep too much, you're like, you're just too, it get makes you more tired. No, I mean, maybe, yeah, I guess that's true, but I that's, that's just exciting because I get to sleep sooner, right? You know, and I, I could always sleep instead of doing whatever I'm doing at that moment. Okay, there's a lot of things I like to do, but it's like my perfect vacation, I've said this before, is to just sleep forever. You wake up, you eat with Kevin, you eat out Kevin, and then you, and then go back to sleep. Now, what's weird to me is the fact that I have trouble sleeping. Like, I don't sleep well. Oh, really? Yeah, I wake up a lot, and it takes a lot for me to fall asleep. I'm sleeping with other people, like they'll be conked, and",
            "start": 55.4
        },
        {
            "text": "me is the fact that I have trouble sleeping. Like, I don't sleep well. Oh, really? Yeah, I wake up a lot, and it takes a lot for me to fall asleep. I'm sleeping with other people, like they'll be conked, and I'm laying there for like a good hour. It takes me about an hour of laying in bed before, per, yeah, before I actually fall asleep. It's 'cause I'm always in my head. I'm always thinking about stuff, scheming shit, and doing all that. But I just, you know, the older I get, the more I realize how much I just appreciate sleep and how much it just makes everything better. And the hair thing is because, you know, getting my hair done is a, is a process, man. Like, it's worth it most of the time, but then it's that 15 minutes or like 20 minutes of shower and hair and all that. I'm like, I could be sleeping, man. And is that 20 minutes of sleep worth everything? No, it never is, but it feels real good. But it feels shit good. Sleep feels good. It feels like a minute, you know, like your alarm goes off, you're like, there's that",
            "start": 101.0
        },
        {
            "text": "20 minutes of sleep worth everything? No, it never is, but it feels real good. But it feels shit good. Sleep feels good. It feels like a minute, you know, like your alarm goes off, you're like, there's that literally just happened. How is this happening again? But man, sleep's so interesting to me. Like, I don't, I don't know any of the science behind it. I just know that I shit, no, no one's been able to figure out sleep. Yeah, those some say we, we never sleep, we just go to another dimension of blackness. I haven't heard that. I'm just letting you know that's something Kevin and I have been kicking around in our off time. You guys aren't here, we're doing experiments. I like his socks a lot. Swinging into the frame, Kev, show that American flag. And I'm proud to be. Uh, sleep for me is a means to an end. I wish I could, I wish I didn't have to sleep. I, 'cause like, I always have more to do. There's always more things to do. And like, I'm playing a game usually at night, you know what I mean? Like, I got to go to sleep. I have to",
            "start": 142.8
        },
        {
            "text": "wish I didn't have to sleep. I, 'cause like, I always have more to do. There's always more things to do. And like, I'm playing a game usually at night, you know what I mean? Like, I got to go to sleep. I have to go to sleep is my thing, you know what I mean? I enjoy the act of sleeping, fine, but I'm a morning person, so I like a good, I like a good 8:15 wake up, 8:30 wake up, get up, get a cup of coffee. I like a good weekend wake up. You wake up and go get a bunch of shit done. What was, oh, Saturday, right? Was it, uh, Saturday? No, Sunday. Sunday, we, uh, Saturday we went and did to shoot. Mhm. I don't think any of those videos are going to be up yet by the time this post. Sunday though, I woke up, and then it was Super Bowl Sunday, and I had a bunch of stuff to do, so I woke up later, but it still had a good morning, morning routine of that. I woke up, I went out, uh, you know, got a whole bunch. Was this, no, this was Saturday, shit. I'm so sorry. I'm pointing at Kevin as if he would be paying attention to the show, but of course",
            "start": 179.32
        },
        {
            "text": "routine of that. I woke up, I went out, uh, you know, got a whole bunch. Was this, no, this was Saturday, shit. I'm so sorry. I'm pointing at Kevin as if he would be paying attention to the show, but of course not. Saturday, I woke up early, and I went to the store and bought stuff I needed for Super Bowl Sunday. I came back, I prepped all my meals for the week. Like, I got stuff into like, you know, I'm going to do this, I'm gonna do that. I cleaned the kitchen a bit with like towels. I had a cup of coffee while I went, walked around the grocery store, and then we went to Brunch. It was like the best Saturday, 'cause I woke up and I was energized, and I went and knocked out all this shit that was chore-y but like fun chore stuff, you know what I mean? And then went and did other things. Like, I like that. I like waking up and doing things, but I like, I'm, you know, I feel like, um, I'm the law of diminishing returns. When I wake up, I'm at my best, and then from there out, I'm just Johnny 5 at the end of Short Circuit, and I'm just",
            "start": 218.24
        },
        {
            "text": "things. But I like, I'm, you know, I feel like, um, I'm the law of diminishing returns. When I wake up, I'm at my best, and then from there out, I'm just Johnny 5 at the end of Short Circuit, and I'm just the, I'm bleeding out, and I'm chasing Oscar and ding dinging ding, you know what I mean? Good Lord, Greg, you're a special shit, a hero. But yeah, like, I'm bleeding out, the battery is dying, so that when it gets to the end of the day, I'm garbage, you know what I mean? Exact opposite. I think that's where the sleep comes in is I will sleep all day. I a night owl. I'm just on like, I, I cannot work during the day. Like, I just found that over whether it was being in school and writing papers or being at IGN or even now, it's like I get so much work done between 9:00 p.m. and 2:00 a.m. that I just couldn't do during the day. And I feel like there's so much distractions and there's so much other shit, not to say there's not distractions at night, because there definitely is. I mean, have you jacked off laying down? I have.",
            "start": 252.84
        },
        {
            "text": "and I feel like there's so much distractions and there's so much other shit, not to say there's not distractions at night, because there definitely is. I mean, have you jacked off laying down? I have not yet. Shit. Shit. You've had one piece. Go into Colin's room right now and lay down, jacked off. So, you know, there's the internet, always the internet's always a distraction. But I feel like at night it's different, man. Like, things start to slow down, and I can just focus on doing stuff. And especially, I think, 'cause it's, it's darker, and I'm just doing one thing. There's no one talking to me, and there's, I'm in my own room, and I'm just doing shit. Yeah, and then I don't want to sleep. Like, that's the thing is I don't want to sleep until I'm sleeping. I love sleep. Like, it's once I'm in bed, I'm like, oh, this is the best thing ever. But it's like, I will put off going to sleep as long as humanly possible at night. During the day, any chance I get, I'll sleep. Well, that's the big thing. I feel like, you know, as",
            "start": 300.96
        },
        {
            "text": "busy as we keep ourselves and as much as we do. I forget when it, it was still at IGN, but there was a, a turning point where it was like, I can sleep wherever I, wherever I get the chance, you know what I mean? That was the thing with like planes. When I turned that corner, that's years and years ago, where it was like, oh hey, I'm exhausted, I can sleep on the plane, you know what I mean? Doesn't matter what position I'm in, I can actually nod off here. I wish I was here. And it's the same thing, yeah, where if we just had like downtime in the day, like you want to take naps, I'd be like, yeah, I'm going to take a nap. I'll fall asleep, no problem, man. See, that's the thing. I, I need that hour of prep time, and I also, I need to be comfortable. So, yeah, I've never slept on a plane. That's just not happening. Not my life. I",
            "start": 336.16
        },
        {
            "text": "I'll fall asleep, no problem, man. See, that's the thing. I, I need that hour of prep time, and I also, I need to be comfortable. So, yeah, I've never slept on a plane. That's just not happening. Not my life. I wish it was, 'cause like, that's so much time wasted. Um, and I, I can't just sleep in like the, Kevin can just sleep anywhere. Like, he'll just lay on the floor and just fall asleep. Like, not even lay, it'll be sitting on the floor. That, yeah, you have. Or like, Sean Finneran's another guy like that. Shit, if he is, if he doesn't have a screen in front of him for more than 10 seconds, he is knocked the shit out because he likes hiking, he's tired. Oh my God. But I just can't do it. Like, I need, I need more of like a, I need everything to be right. But when it's right, oh man, I never want to wake up. Mhm. Mornings suck. Mornings are the worst. Like, I cannot imagine being like you, like having all these things I got to do. Birds are like, I hate having anything to do before 10:00 a.m. I think 10:00 a.m. that's the reasonable time",
            "start": 369.28
        },
        {
            "text": "are the worst. Like, I cannot imagine being like you, like having all these things I got to do. Birds are like, I hate having anything to do before 10:00 a.m. I think 10:00 a.m. that's the reasonable time of like, all right, you only got 30 minutes for that McDonald's breakfast. I can, that's true. And I'm an old school guy. I know it's not anymore. Yeah, I, I that's when I begin to even function, and I don't really hit Peak mental shit until after lunch. Then you get something out of me, but it's not until at 9:00 p.m. when I just start giving gold. About you, Colin. I was going to say, you have a weird schedule, Colin. Yeah, my sleep schedule, I usually, I sometimes sleep like twice a day. So it's like, you know, last night I slept for like 5 hours. I'll probably go to bed after this, and then I'll get up at like 7:00 and go to the grocery store and, and like start doing work. I like working, working at night as well. I've always been that way, and even in college, I would, you know, I'd do my homework and stuff if I had",
            "start": 405.32
        },
        {
            "text": "and go to the grocery store and, and like start doing work. I like working, working at night as well. I've always been that way, and even in college, I would, you know, I'd do my homework and stuff if I had like homework, but I like write papers and do research at night, like in the middle of the night. I liked, I liked doing that. It made me feel like I can get more things done because there's fewer distractions. But, um, I rarely get like eight or nine hours of sleep at a time. I like, I have a problem where I have to pee at least once a night too, and, and that breaks, that breaks things up. And I don't even drink that much water at night. Like, it's just, just got to go, you know? Um, so I love to sleep. It's like the way I, I said an anxiety topic, it's the way I escape my anxiety as I sleep. Um, just close my eyes and, and, and get away from things. But I love, I love to sleep. It's just sad to think that we spend over a third of our lives sleeping, but we have to. It's, it's necessary. And reading about sleep and the",
            "start": 445.8
        },
        {
            "text": "biology of sleep and what, what it does, and what they think it is, because you guys are kidding around about, but they, we really don't quite understand sleep actually. And, uh, and why it happens, and why everyone does it. Like, like every creature like has some sort of way of sleeping or resting, and we don't really know. It's not, it's not a physical thing. You're not like, it's a mental thing. It's a way of making sense of data and like rejuvenation. Yeah, it's, it's, it's weird. It is very primal yet very complicated. It is, um, something we've been doing since we learn, you know, primordial, yet like we still don't quite get why it happens. And there's a lot of people have to spend their lives trying to study what, what's going on in your, you know, we understand the cycles of REM and all that kind of stuff now.",
            "start": 479.96
        },
        {
            "text": "quite get why it happens. And there's a lot of people have to spend their lives trying to study what, what's going on in your, you know, we understand the cycles of REM and all that kind of stuff now. But, and you're 90 minute, you know, you sleep in like 90 minute cycles. So they say it's best to get what is it, um, three, six, or nine hours of sleep. But like, or in like 90-minute increments as long as you're asleep. Because like, if you wake up in the middle of the cycle, even if you slept for like 9 hours, if you sleep in, if you get up in like the middle of your last cycle, you're shit more tired than if you got up after 6 hours. Um, so there's a lot of fascinating stuff scientifically and biologically about sleep that I think is, is quite riveting that I wish we understood better. But, um, it's still something that I totally embrace and I love, you know, I love to sleep. I always love to sleep. It reminds me of when you're young and you're growing up and you're expending a lot of energy and you're growing",
            "start": 518.36
        },
        {
            "text": "like literally growing. And, you know, I used to sleep for like 12 or 14 hours a day on weekends. It was awesome. I'd go to bed at like 2:00 in the morning and, and I'd get up at literally like 5:00 in the afternoon, you know what I mean? If it was winter break, done, done. Like, I was nocturnal entirely. Yeah, my family makes fun of me still. My sisters make fun of me especially because when I was in Middle School and High School, I used to like just sleep, and then I'd like go downstairs when people, when people, I do this all the time, but when they were visiting, I'd always bring my comforter everywhere with me, and I'd like just take my comforter and my pillow and then just like go on. And my dad just get so shit mad, be like, take your comforter upstairs. Like, my, my family still makes fun of me for that. I'm like, this is",
            "start": 554.16
        },
        {
            "text": "just take my comforter and my pillow and then just like go on. And my dad just get so shit mad, be like, take your comforter upstairs. Like, my, my family still makes fun of me for that. I'm like, this is just how I roll. Like, I got to do. That's how. 'Cause I'd sleep for like 12 hours and get up and like watch like daytime TV on like, on Christmas break or whatever. I'd be watching like Jerry Springer or like 3:00 in the afternoon, like in my underwear with like my covers over me and my pillow as if I'm still in bed. And I just can't sleep like I used to be able to really sleep forever, and I just can't. Um, I used to be able to sleep in like, I hope I never lose that. It's, I mean, I definitely have. I definitely sleep half as much as I used to. Um, I feel bad now if I sleep in on the weekends like too much, 'cause I, I feel like I wasted the day. I wake up 'cause I'm still going to try to get to bed at a normal hour, 'cause I don't want to throw off everything to where like I'll at 3:00 in the morning, then I'll wake. That's the",
            "start": 589.08
        },
        {
            "text": "like I wasted the day. I wake up 'cause I'm still going to try to get to bed at a normal hour, 'cause I don't want to throw off everything to where like I'll at 3:00 in the morning, then I'll wake. That's the key. But for me, it's I, I never feel like I'm wasting it. I always feel like I earned it. There's definitely, I mean, like when we come back from like E3 or like Comic-Con, like a big shit show, and you sleep, like that's like needed. Like, I know the battery's completely depleted, and like, that's a day. Yeah, you lose a whole entire day. Yeah, yeah. To me, it's, it's, I don't look at it so much as time wasted, because when I really look, and I'm not trying to be facetious, like when I look at how I spend my time, it's all waste anyway. It's like I'm playing video games, you know? So like, what is the playing a video game or, or anything like that is like not meaningful way of spending your time? What's the difference? So at that point, I'm like, I never feel guilty about sleeping. Well, it's one of those things up until right now,",
            "start": 623.96
        },
        {
            "text": "anything like that is like not meaningful way of spending your time. What's the difference? So at that point, I'm like, I never feel guilty about sleeping. Well, it's one of those things up until right now, I've never been, I could, you know, I could play a video game, right? And then I could talk about it and make money off it. I'm like, well, at least that I'm getting something out of it. Until now, I've never been able to sleep and then talk about sleep. But here we are. Here we are. Sure. But I'm not like, I'm not trying, you know, like Leonardo da Vinci like would take catnaps 15 or 20 minutes at a time because he was doing something useful, you know? He was going to die a lot quicker. He was staying awake and like, and building important things and figuring things out. Like, I'm getting up and and reading Drudge Report and playing shit, Dying Light. I mean, it's not like I'm, I'm solving anything important, so I might as well just be asleep. The world, the world won't be any different. Ladies and gentlemen, this has",
            "start": 663.0
        },
        {
            "text": "and playing shit, Dying Light. I mean, it's not like I'm, I'm solving anything important, so I might as well just be asleep. The world, the world won't be any different. Ladies and gentlemen, this has been The GameOverGreggy Show. If you didn't know, each and every week, four, sometimes three, best friends gather on this table. Each bring a random topic discussion for your amusement. If you like that, head over to Patreon.com/KindaFunny, where we can toss us a few bucks, get every episode early, get exclusive episodes, and get exclusive perks, just like drum roll please, Colin, just like our first ever Patreon producer of The GameOverGreggy Show, Jon Deos. Did Deos? Jon Deos. Jon Deos. Yeah, come on. I won't you. He doesn't make the rap art with his noise, his mouth anymore. He makes it with an app, which makes it 20 times harder to do on the command. Jon Deos, Patreon producer. No, no, no, no. Jesus Christ. That was, that was, you know, there, what's his name? Jon Deos. Jon Deos, Patreon producer of The GameOverGreggy Show.",
            "start": 695.76
        },
        {
            "text": "it 20 times harder to do on the command. Jon Deos, Patreon producer. No, no, no, no. Jesus Christ. That was, that was, you know, there, what's his name? Jon Deos. Jon Deos, Patreon producer of The GameOverGreggy Show because he supported us at that tier over on Patreon.com/KindaFunny. Uh, if you don't have money to toss us on Patreon, no big deal. You can head over to YouTube.com/KindaFunny, where we post every topic day by day until the entire show goes up as one big MP3 and video. Of course, we've done a terrible job of keeping you informed and letting you know that the new The Kinda Funny app has been updated and is amazing, and you should all go get The Kinda Funny app on your iPhones, on your Android phones. Ain't that right, Kevin? Kevin, what is wrong? What happened to you today? Are you sick? Who hurt you? Are you sad? Do you have a fight with Paula? Do you have a bad clam? What's, you're, you usually emote and say stuff. Where's the little giggle? Is this what happens when Nick's not here? I was when",
            "start": 739.68
        },
        {
            "text": "hurt you? Are you sad? Do you have a fight with Paula? Do you have a bad clam? What's, you're, you usually emote and say stuff. Where's the little giggle? Is this what happens when Nick's not here? I was, when did I say that? Been saying it too big. No, that's true. We haven't been saying that. Damn. For a second, I was super excited. Indeed. And then it was just you and a thong. Yeah, now so you're taking thong photos laying in bed, but you won't just roll over and jack off. Oh, Jesus. All I want until next time, it's been our pleasure to serve you.",
            "start": 786.36
        }
    ]
}