{
    "id": 1568,
    "video_id": "nJZJ_T1sTxA",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino"
    ],
    "title": "Let's Play Cyanide & Happiness' Joking Hazard - Kinda Funny Plays",
    "description": "Support Joking Hazard at http://kck.st/1mq3ril\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1455987601,
    "duration": 2044,
    "transcript_chunks": [
        {
            "text": "What's up guys? I'm Tim Gettys, this is Nick Scarpino, and this is Greg Miller. Today we are doing a kind of funny plays of a new card game, a tabletop game. Yes, people have always wanted us to do more tabletop board game stuff, here we are so we're doing it. Our boys over at Cyanide and Happiness are making a card game called Joking Hazard. Right now it's in Kickstarter. Yeah, they need your help. It's it's you know, oh they're struggling. They're goal they struggling $10,000. The goal for them is $10,000. There's a link that you can see there. There's also a link to click in the description for you to go support. If you want the game, you can buy it there. Their goal is $10,000. They are currently at $1,597. So why do this let's play? Why even help them? Because that's a testament to how many people want this game. And that's the thing when you said, hey we're going to do this let's play about signing out of happiness, I said I don't know who that is. You said, yeah you do and you showed me the cartoon I was like",
            "start": 0.08
        },
        {
            "text": "and that's the thing when you said, hey we're going to do this let's play about signing out of happiness, I said I don't know who that is. You said, yeah you do and you showed me the cartoon I was like oh right those guys, the comics guys. They have the YouTube channel youtube.com/explosm explosm expl exp. They're awesome. They do their their cartoons and stuff. Anyways, this looks like a lot of fun. I want to try it out with you guys. We have not ever played it so this going to be dry run just going in like we do. Now this is a game from the creative side Happiness where players compete to finish an awful comic strip because what they do is comics that are kind of you know whatever. So this is kind of like Cards Against Humanity in a way and creator of Cards Against Humanity says if you like sin and happiness you'll love this game. It gives you the feeling of being one of the creators without the burd of actually having to be funny yourself. Now I am very enticed by this cuz you have no talent you",
            "start": 44.72
        },
        {
            "text": "happiness you'll love this game. It gives you the feeling of being one of the creators without the burd of actually having to be funny yourself. Now I am very enticed by this cuz you have no talent. You can never create a car at best. I'm kind of funny at best. So Nick, what are you doing? I'm looking at the he's spoiling it as always want I got get Nick for ruining another game we are going to play together as friends. I'm going to take this mic what are you going to do with a tough guy and swallow it? No, you're going to listen to my stomach cuz I die. Here are the rules. All right, the game Joking Hazard is a party game for drunk and boring people alike where four or more players compete get me a beer to finish a three player a three panel comic. Now we're playing with three um I don't know if that's going to affect this but we're not drunk yeah but we're boring. I'm gonna get drunk yeah um setup one every player starts with seven cards visible only to them two the rest of the cards remain face",
            "start": 85.68
        },
        {
            "text": "going to affect this but we're not drunk yeah but we're boring. I'm gonna get drunk yeah um setup one every player starts with seven cards visible only to them two the rest of the cards remain face down in a draw pile three the first judge is selected thank by non violent means adios sorry guys muchacho who wants to be the first judge? I want to be the first judge. Nick will be the first judge so I get pick between who's funnier that's what I'm doing. I don't know we'll find out schon's on your mic. I got it all fast how to play one the deck plays first the judge flips the top card of the the drop pile blindly and plays it on the table face up okay if it's a red card read ahead to rule number five so the deck plays first so okay go for it the judge this is the deck okay these are uh B beta cards yeah right now this not how the fining going to be they sent us an early version obviously not fun it yet I haven't chugged a beer in a long time draw that so draw one card two cards three cards",
            "start": 125.48
        },
        {
            "text": "yeah right now this not how the fining going to be they sent us an early version obviously not fun it yet I haven't chugged a beer in a long time draw that so draw one card two cards three cards one card one card one card and flip it onto the table okay cool it says my butt suck my butt on my butt with a picture of a guy pointing pointing to the other guy okay is Kevin inserts should I take photos for inserts uh we probably should let's do that we're making the let's play for you right now but it's already time travel because you would have seen the insert see what I did there Nick time you know Nick's a dreamer got it cool two the judge plays second the judge chooses one of their own cards oh hold on hold on so here every player starts with seven so we need seven cards all right I'm going seven card each get seven okay this one I'm going to enjoy if it's all right with you Tim y enjoy it away again now Square cards a little harder to deal that's my first point of uh talking in the",
            "start": 175.84
        },
        {
            "text": "seven card each get seven okay this one I'm going to enjoy if it's all right with you Tim y enjoy it away again now Square cards a little harder to deal that's my first point of uh talking in the microphone stop making excuses my first point of feedback for you guys out there at uh cynicism and Cyanide and and cism is Cyanide and Happiness and these are beta cards they're probably not going to be shaped like this right? I don't think so or maybe they will be I bet they these are how many there I was talking and I can't count talking that's five five five six six this is what seven seven cardboard seven here's my other point of feedback for you guys I I don't know if you're going to have enough money to do this but maybe um like making the cards slightly more slippery with like a gloss or a semi gloss would be nice um really anything that's more than don't look I Dro one okay the judge the deck plays for also the presentation of this box well I'm actually liking it's like snake skin and",
            "start": 222.08
        },
        {
            "text": "semi gloss would be nice um really anything that's more than don't look I Dro one okay the judge the deck plays for also the presentation of this box well I'm actually liking it's like snake skin and I I appreciate that but I feel like you could spend $2 to $300,000 really going into box technology and uh and really get the best box out there all right the judge plays second so you choose one of your own cards to go on either side of the Deck card face up creating a somewhat sensible two panel setup okay I'm going to play this one it says you're freaking me out dude suck my butt you're freaking me out dude all right should we take a picture of this as well I'm sure I'm taking pictures for you insert into this let's play two seconds screen experience Kev Kev's running away oh cuz he didn't we told him he didn't need his notepad yeah wait hold on we should probably get a more face on do you want to just put a camera on these so we can cut it in yeah give me that GoPro super glue to the",
            "start": 279.24
        },
        {
            "text": "we told him he didn't need his notepad yeah wait hold on we should probably get a more face on do you want to just put a camera on these so we can cut it in yeah give me that GoPro super glue to the ceiling Kevin do you want to just prep the GoPro and save yourself a **** ton of work and we'll start over really yeah yeah I don't think we have to start over I think we just say we're putting a GoPro in okay we're getting right back into it set up a GoPro we're doing this right so you guys can see the stuff now can see the beers we set we set up a GoPro so we going have to take pictures but great can you take a picture of the GoPro so people can see good call so people can understand that we actually are fing with the GoPro we'll do we'll do it like this we'll do selfies yeah let's do selfies and then we'll do that and then you guys that I'm going to read through all of the rules before we start playing and I want everyone to know that the beers are hitting the bloodstream I'm getting",
            "start": 328.44
        },
        {
            "text": "and then we'll do that and then you guys that I'm going to read through all of the rules before we start playing and I want everyone to know that the beers are hitting the bloodstream I'm getting drunk I need another one Kev my God okay well when you **** cannonball them it took us three minutes to set this this uh this thing you're on everyone who watches kind of funny knows there's no **** way that took 3 minutes the the top card of the draw pile blindly and places it on the table face up if it's a red a red card go ahead to rule five I'm going to go straight to rule five right now just so you know red cards are the super **** up and weird ones and can only work as panel three as a result if you draw one as a judge you've broken the game and everyone needs to replace all their cards with seven new ones before the game continues now back to rule two the judge plays second the judge chooses one of their own cards to go on either side of the deck's card face up creating a somewhat",
            "start": 366.36
        },
        {
            "text": "with seven new ones before the game continues now back to rule two the judge plays second the judge chooses one of their own cards to go on either side of the deck's card face up creating a somewhat sensible two panel setup and that's where we are right now yes step three everyone else plays the punch line every player who isn't the judge plays the third and final panel he thinks the best face down then the judge who right now is Nick chooses which one he thinks is best and returns that card to the the winning player for scorekeeping it's the first to five oh that wins I like this game a lot or whatever number you want we're not your mom that's what they say okay then the next person's the judge and you continue going all right I think we're pros now so why did you drink some of it you could have just had your own just get your own beer last one oh really **** we drank a lot of beer last night I really want one of all right so I'm playing mine face down because I already have the",
            "start": 406.44
        },
        {
            "text": "could have just had your own just get your own beer last one oh really **** we drank a lot of beer last night I really want one of all right so I'm playing mine face down because I already have the winner yeah okay now you're going to shuffle them up right because I don't want I don't want you playing favorites to your old Love and Sex Stuff partner here. I mean you better know based on Tim's mentality which one he picked but that's not how random card games work. I know it though go go go okay so I look at both of them and I pick which one put them here by one so that people can see him on the GoPro okay so this is the first one yeah suck my butt you're freaking me out dude followed by boners two boners two big boners I'm we'll put it up there like that so you can see the it's like a br give me a read again for dramatic effect suck my butt you're freaking me out dude and then bend over look into my butt oh I like how both of us went for nonverbal M and I get to pick which one I like",
            "start": 451.76
        },
        {
            "text": "give me a read again for dramatic effect suck my butt you're freaking me out dude and then bend over look into my butt oh I like how both of us went for nonverbal M and I get to pick which one I like best I'm going to go with the most graphic the two you're such a son of a **** Nick usually does go straight for the butt. I thought that the two boners would I don't no I don't I lost I don't get it he he said Point see I like the story that this tells where it's the one that's that's getting freaked out that's like you know what my butt here's what happened with this let's bring this back for a second I'm going to explain to you the psychology of how this worked suck my butt it took a second for him to realize that that was something that he actually wanted to have done to himself he said you're freaking me out dude but somewhere in here there's nonverbal of you know what I accept this and I'd like to experiment I'd like to experiment with this here let me present to you like animals",
            "start": 491.44
        },
        {
            "text": "you're freaking me out dude but somewhere in here there's nonverbal of you know what I accept this and I'd like to experiment I'd like to experiment with this here let me present to you like animals do my butthole for you to either smell and or suck Jesus think animals present like you know the vagina here's my butthole for you to smell and or suck all right so I got a point no animal has ever sucked I got a point now I think we get rid they can't really suck I don't think they have the ability to pile all right their lips around thanks now you're the judge now that I am the judge we all draw one more card to bring it back to seven here you go thank you I don't like you picking for me I don't like how you're rushing me through this game I don't know if it's rushing or it's just coercing and playing the game man we're playing a card game here and you're after you're like you're like running it like it's a business all right Jesus so so that's the red card that's what we're deal Oh wait",
            "start": 535.16
        },
        {
            "text": "playing the game man we're playing a card game here and you're after you're like you're like running it like it's a business all right Jesus so so that's the red card that's what we're deal Oh wait **** that's a red card right yeah what does a red card mean I forgot I **** everything up yeah need to discard and cards oh really what that's what a red card means yeah well if the judge draws the red card otherwise autom panel three oh okay there you go discard so discarded I will deal these out to each other without speaking this time you know I'm a dreamer that look good I don't yeah it looks great but I don't even understand how I'm putting this together it'll be picture in picture and then people can see the cards what's so hard about that thank you it looks weird when you guys are like when it's just the card look hey everybody guess what we're doing dumb stuff here and it's going to look Goofy and **** have some fun Jesus how crazy this is going to be suck my butt says Nick",
            "start": 574.36
        },
        {
            "text": "like when it's just the card look hey everybody guess what we're doing dumb stuff here and it's going to look Goofy and **** have some fun Jesus how crazy this is going to be suck my butt says Nick it'd be awesome if you lost your balance went through the table table split in half deadly boy style this Ikea table will never break on us it is a very strong very sturdy very cheap particle board there we go I'm so happy right now a show look it says I'm so happy right now now you get to pick what goes before or after it yeah gotta I'm on my way I'm on my way home sweet home sorry Kevin you can't contain the music when we play sign out and happiness and you feed me beers against my will I'll put has become a uh also suck my dick also suck my dick I supposed before or after you choose oh that's awesome yeah so you guys need to choose what you want to end that **** I'm not going to look this is just a blank card I need to pick another one home sweet home tonight tonight spread them",
            "start": 622.44
        },
        {
            "text": "that's awesome yeah so you guys need to choose what you want to end that **** I'm not going to look this is just a blank card I need to pick another one home sweet home tonight tonight spread them around spread them around there he doesn't we don't have a bi to each other we host Love and Sex Stuff that post every Monday 9 a.m. kind 9 a.m.c it's the best show on the planet every episode loved by all no one's ever had a negative word to say about anything any advice that's ever been doled out on Love and Sex Stuff every single episode 100% like to dislike so I'll play again also suck my dick I'm so happy right now I need to pee or also suck my dick I'm so happy right now do me I mean he's got a Gun there's a clear answer here it's the one that makes sense so I'm going to go with the do me yes yes brother points for Greg Miller this how the game works I get it like to be fair to be fair I just wanted that to represent the fact that I do in fact have to pee right now and no one is",
            "start": 685.8
        },
        {
            "text": "do me yes yes brother points for Greg Miller this how the game works I get it like to be fair to be fair I just wanted that to represent the fact that I do in fact have to pee right now and no one is surprised you know taking it from you take that all right so it's one to one to zero right now what a surprise can you give me that discard pile this discard I thought that was a discard pile well it is now this is a blank one this is a blank this is do I get to draw my own yeah sure no oh draw sorry you good oh I'm the judge now yes you are so I I'm sorry I'm the judge now so I play whatever I want I draw one is that draw one put it down and if it's a red card everything's **** no it's not a red card it says I've learned a lot about myself today and I get to put one beforehand or before or after yes I'm going to put down guess what no one cares are we in frame CER or am I getting too far off should I Center a bit more you good all now you guys get I'm shutting my eyes so I",
            "start": 756.32
        },
        {
            "text": "or after yes I'm going to put down guess what no one cares are we in frame CER or am I getting too far off should I Center a bit more you good all now you guys get I'm shutting my eyes so I don't know what's happening I'm shutting my eyes so I don't know what's happening Greg I put down the card on the bottom what what letter does yours begin with why go for it give me the cards all right I learned a lot about myself today guess what no one cares I am the second coming of Jesus Christ I learned a lot about myself today guess what no one cares I saw you wearing women's clothes the other night H I'm going to go with Jesus Christ I learn a lot about myself today give it 15 seconds and either one of these guys can have the app that makes that noise up and running I'm surprised we didn't have that on right now so we all pick another card right mhm okay no no no no no right fine I want the lucky one myself okay and then we're back to nich we're back to me you pull one so I",
            "start": 802.84
        },
        {
            "text": "we didn't have that on right now so we all pick another card right mhm okay no no no no no right fine I want the lucky one myself okay and then we're back to nich we're back to me you pull one so I pull one from the deck put it here it says that was inappropriate I apologize okay okay this game is smart how it's set up because that that could be a good middle or beginning it could be I'm going to put this at the beginning I don't think we can be friends anymore that was inappropriate I apologize I'm not looking am I supposed to look what am I supposed to do here how do I not look I can't hear anything I'm mixing them up for you now you now you have no idea you can't play your little Love and Sex Stuff favorites there you go pick your winner yours which one's yours give me a wink mine's the winner I don't think we can be friends anymore that was an inappropriate I apologize wait who are you I don't think we can be friends anymore that was inappropriate I apologize I just jerked off 14",
            "start": 881.48
        },
        {
            "text": "winner I don't think we can be friends anymore that was an inappropriate I apologize wait who are you I don't think we can be friends anymore that was inappropriate I apologize I just jerked off 14 times clear winner clear winner aptim sorry Tim all right draw two to one to one draw a new one yeah your new one all right say do you have one yes all right we got twinsies on the board twinsies uh oh sweet you know what I'm just gonna do it dude vomits on dude twinsies let's see where I'll go from here close your eyes shut your eyes all right open your eyes pick a winner love how dude vomit on guy twinsies we have either it looks like got hit in the dick yeah or we got another dude this guy trying oh **** I mean honestly that one's the winner that's the winner that was great this wow like what are the chances of it being that perfect that's a comedy beat right there that's how go thank you I appreciate that they call that the front runner maneuver I'm now the front",
            "start": 940.8
        },
        {
            "text": "great this wow like what are the chances of it being that perfect that's a comedy beat right there that's how go thank you I appreciate that they call that the front runner maneuver I'm now the front runner draw another maneuver manouver it's the Hoover oh this is the one I put down well you draw one and you put one okay so I've drawn I've re completed my deck now I'm taking one from the box shut up Kevin they can hear me I have Kevin okay these faces that I'm not familiar with what are they is that a that's not like a Walkin I don't know let's make it a walk in okay it's fine it's fine what they're saying to each other don't worry about your forehead it's great shiny new I like your blue shirt and I'm putting down to begin it I'm proud of you son oh God I took the gate off the audio okay so you can hear the card shuffling now oh nice job and also when you're talking like over here oh okay I'm G shut my ass sorry all right shuffle them up as you see fit **** hold on I got it down",
            "start": 1041.84
        },
        {
            "text": "so you can hear the card shuffling now oh nice job and also when you're talking like over here oh okay I'm G shut my ass sorry all right shuffle them up as you see fit **** hold on I got it down yet good one I know but I just don't want to be spoiled when it comes down to it I only spoil when it comes down to Let's moin gay and get it home they down go for it all right I'm proud of you son maybe Christopher Walkin face it's fine I wish I could help you but I'm attracted to women or I'm proud of you son weird face you're such a Negative person well I feel like I can only blame myself for setting up a bad beginning part of the strip to come to a bad end part of the strip yeah I was such a Negative person God damn it God damn it out all right draw another is this me mhm okay oh my God damn I have the perfect ending to The Strip we just did what was it can't say just tell us I'll whisper it to you was aw the first card is I like your tits okay all right oh sorry was I like your tits",
            "start": 1110.12
        },
        {
            "text": "I have the perfect ending to The Strip we just did what was it can't say just tell us I'll whisper it to you was aw the first card is I like your tits okay all right oh sorry was I like your tits gross no one likes these tits the next card is gonna be that is great to hear Tim I know that's your card now you gotta let you're GNA Shuffle you **** there I can't I know I memorize positions very well I think what what what that even mean I'll know that card now I know the outline of the card shut your eyes totally worked there you go thank you thanks for putting your finger in my finger I like your tits that's great to hear check this **** out with yaked out ABS okay good I like your tits that's great to hear well that would explain this erection two solid choices this is a tough choice I got to give it to check this **** out though **** **** I hate you goddamn Love and Sex Stuff **** every goddamn Monday at 9:00 a.m. on kindafunny.com all right first we're going down there",
            "start": 1178.6
        },
        {
            "text": "got to give it to check this **** out though **** **** I hate you goddamn Love and Sex Stuff **** every goddamn Monday at 9:00 a.m. on kindafunny.com all right first we're going down there right then you heard that song Megan Trainer or some guy no I don't know the GU you took me make his Mickey tra of the it's all about that base about that b she's want a Grammy yeah I got a better idea don't ever tell anyone about this I'm excited for this one close your eyes all right all right I've got a better idea don't ever tell anyone about this okay we got I've got a better idea don't don't ever tell anyone about this that makes my tits hard with with the face M or I've got a better idea don't ever telling her about this and then a high five I got to admit I'm a little upset with these choices I don't think either are particularly how dare you particularly good um I was expecting you know what the plan was you know like what is the green guy gonna do what is it that he's not oh see",
            "start": 1251.08
        },
        {
            "text": "choices I don't think either are particularly how dare you particularly good um I was expecting you know what the plan was you know like what is the green guy gonna do what is it that he's not oh see when I read it I thought it was we were coming to the conclusion they've already they're finishing don't ever tell anyone about this and was like he had an idea and he I got a idea don't tell anyone about this here's the idea **** see I don't think any of my cars play into that yeah I get it I get it it's a it's a random card game you know what I mean oh yeah it's randomized I mean my thing is I like the tits one better but that's because it has the word tits in it but I also enjoy high five every once in a while your first gut reaction just go with your gut reaction do you want Nick to win do you want to go with your gut and have Nick win that's the big question I guess just go with your first gut reaction clear your mind clear the mechanism I'm clear the mechanism Kevin CER I'm",
            "start": 1331.08
        },
        {
            "text": "to win do you want to go with your gut and have Nick win that's the big question I guess just go with your first gut reaction clear your mind clear the mechanism I'm clear the mechanism Kevin CER I'm goingon to go with the high five makes more sense Tim you're not being true to yourself I guess you're right something something a sad song fair enough all right so I'm gonna I'm drawing my card first I for I have three **** and now I'm going to put down card number one you three too yeah I have three **** God I'm putting down these two guys they have a heart above their heads that to me means they're in love together um okay well hold on **** uhhuh uhhuh uhuh all right I'm putting down in the front then that's just the beer we were told to play drunk I'm the only one playing by the rules I'm bored we're boyfriend and boyfriend now heart I'm shut my eyes you're going to drink this beer go for it we're boyfriend and boyfriend now heart I regret nothing we're boyfriend and boyfriend",
            "start": 1378.08
        },
        {
            "text": "I'm bored we're boyfriend and boyfriend now heart I'm shut my eyes you're going to drink this beer go for it we're boyfriend and boyfriend now heart I regret nothing we're boyfriend and boyfriend now Hart the yeah one dude just pees on the other dude I don't think there's been an easier choice in this goddamn world that is the winner we're boyfriend and boyfriend now the guy pees on the other guy winner cuz that's how boy sex works right that's how I mean that's how boy girl sex Works in my opinion okay once you get through the what what's the process Greg you take off the pants M unzip the underwear okay massage open the vulva okay wait how many cards am I supposed to have right now seven all right I need seven this is mine right yeah all right here we go here's the base card the base base card I'm all about that P card you know who I don't like Mike Oransky **** him that's a l funny face is that really necessary nobody likes Mik Ransky nobody nobody my head hurts Kevin my",
            "start": 1429.68
        },
        {
            "text": "base base card I'm all about that P card you know who I don't like Mike Oransky **** him that's a l funny face is that really necessary nobody likes Mik Ransky nobody nobody my head hurts Kevin my eyeballs hurt a little bit you think maybe you're wearing a hat too tight like my Gansky it's POS there you go Nick pick a winner pick the right winner though pick the right winner funny face is that really necessary no it's not funny face but I want to clear that the guy saying no is the one that asked the question right is that really necessary Lick's face have to unfortunately give it to the face look face look was a really good one good I like that it matched the the P was that you Greg for me I felt like no that was him oh good job for mine I think I mine worked was that really necessary no no I get it it doesn't seem because you all of a sudden well no sometimes you get a random card damn I get it I get it and sometimes your random cards work out better for you Greg I'm going to",
            "start": 1494.28
        },
        {
            "text": "no no I get it it doesn't seem because you all of a sudden well no sometimes you get a random card damn I get it I get it and sometimes your random cards work out better for you Greg I'm going to light a candle and put on in your face not you so we're we're we're one away oh you're one ahead you're you're in the lead I am I'm one away from Victory good for you good FL you I need to pull one for my seven and pull one to put down for the thing I think I that right oh sorry ni just do that all right Nick this is the time we can't let him win so I think you should just let me win he can't win don't let him put it down I'm let me get caught up Nick so we're starting this off with the the green guy with little tiny face saying I don't care to the blue guy then I'm going to add **** I don't got gold for this I just want everyone to know oh but no you know make fun of Greg when that happens the RNG Jesus orang Jesus is what they call him orange Jesus random Rand who's orange Jesus Danny",
            "start": 1562.92
        },
        {
            "text": "got gold for this I just want everyone to know oh but no you know make fun of Greg when that happens the RNG Jesus orang Jesus is what they call him orange Jesus random Rand who's orange Jesus Danny Tambourelli all right one sec one sec because I want to I want to give you guys something I met him on the set of Up at Noon the only Up at Noon that never aired what didn't it is not a good interview went off the rails fast yeah fast I mean if memory serves I think we actually just lost the footage it got corrupted or something oh okay I don't careah I didn't have gold to work with so now I leave it to you gentlemen make me off go let's get it damn all right you guys you guys came through I'll give you that so I don't care then the green guy laughs at him and then the blue guy says I don't get it the green guy says me either makes sense I appreciate that then there's this I don't care and then there's dancing there's Boogie I got to go with the dance I got you guys I hate it I hate the I",
            "start": 1613.52
        },
        {
            "text": "it the green guy says me either makes sense I appreciate that then there's this I don't care and then there's dancing there's Boogie I got to go with the dance I got you guys I hate it I hate the I I'm trapped cuz you both have the same juvenile sense of humor you don't care about story structure I I appreciate the story structure apprciate I do but I'm was going to choose what do you want now you got to play to that though you got to be like what is going to get this idiot to laugh I'd rather play to the smart people out there in YouTube watching and understand what real Cy and comedy makes Greg I just want you to know that no matter what camera did I move with my mind no you push the table that's a good point mathematically you rotate it back in I'm touching it it's fine I'm doing it don't touch it I can't move it do the earthquake do the give him an earthquake it's only funny if there's nothing there the table still lose all right my turn I just want you to know mathematically Greg",
            "start": 1680.64
        },
        {
            "text": "touch it I can't move it do the earthquake do the give him an earthquake it's only funny if there's nothing there the table still lose all right my turn I just want you to know mathematically Greg you lost this game I want you to know don't ever tell me the odds oh I get what you're saying Yeah Tim wins **** I pulled a red one what happens oh it blows up we all have to we all have to discard D that sucks cuz man these red cards are **** you have red cards too oh I don't what's a red card then so red cards if you're not if you're not literally if you're not the um judge then you end it with this and that's like a automatic win I mean no but you'd assume oh okay you know what I mean you feels me I feels  you if I didn't live here I'd smash the bottle you cool you two more beers of Unown origin they're not sephos those are our beers do you want those I thought you get yourself one too baby there's two of us I wanted why didn't you **** say that before you made me drink it do",
            "start": 1725.2
        },
        {
            "text": "Unown origin they're not sephos those are our beers do you want those I thought you get yourself one too baby there's two of us I wanted why didn't you **** say that before you made me drink it do you want one I'll have one yes but I want you to have one too why do you not like IPAs now I do it's fine well these are way better cards than I had before so now I have to draw right you do yeah go for it go for it oh yeah wow all right and I'm putting it down and it's oh it's a red damn it it's a red one that means it's got to be blown up again son of a **** are we sure we're doing that right did somebody Shuffle these no we did not Shuff am I hitting the pile it's all red ones no okay I can you can you I'm going to put these back in there too no I want to win that's M there you go oh oh for a refreshing beer while you play Cyanide and Happiness racer 5 be Republic be Republic and racer 5 please send Kinda Funny free beer why don't we do this all the time I'm sick about talking and",
            "start": 1785.08
        },
        {
            "text": "oh for a refreshing beer while you play Cyanide and Happiness racer 5 be Republic be Republic and racer 5 please send Kinda Funny free beer why don't we do this all the time I'm sick about talking and trying to be interesting this is way more fun let's play games and drink wow wow how did I get good cards this time around holy **** all right all right so now I'm going to draw hopefully hopefully it ain't a red one mother **** come on where are you drawing from I'm drawing from the most immediate pile are they all reds they're definitely not shuffled that's just the red pile I told you Shuffle card I just put them in the thing here there you go now you're not going to just pick the **** pick another card don't blow it up I'm not dealing again wow sorry it was so hard for you to deal cards it actually is hard they're both all saying ha it was kind of a big deal and I get to pick what I want to put oh this is what you meant mathem I can't win mathematically I can't win I got it what",
            "start": 1835.0
        },
        {
            "text": "it actually is hard they're both all saying ha it was kind of a big deal and I get to pick what I want to put oh this is what you meant mathem I can't win mathematically I can't win I got it what you guys are getting harder and harder to deal with but we already made the joke we made three jokes I I made the same joke you made I know you did all right here we go here we go here we go haa but it's preceded by an old butt in the face I'm shutting my eyes Back Where I Come From they call this move anus eye the old anus there you go there you go kind of yep there yep anide hold on put on my hand ready let Mom get it home use that one this one right I don't know I don't know what it means I mean it looks like it means something cool yeah **** it well no yeah all right **** it all right ausi ha Jesus eat my AIDS wow Ani haa wck ashre sample text that's hella funny Jesus God a peer horn cuz you assume it's like every it's just every internet yeah yeah yeah a I mean hard one for you huh I",
            "start": 1889.84
        },
        {
            "text": "ha Jesus eat my AIDS wow Ani haa wck ashre sample text that's hella funny Jesus God a peer horn cuz you assume it's like every it's just every internet yeah yeah yeah a I mean hard one for you huh I got to go eat my AIDS but I'm not proud of it son of a **** you let him win dirty I feel really dirty you let him win damn cold world out there huh who would have thought the aids would have came to my Aid didn't mean to do that as a you know as a pun yeah but it worked and I'll **** take it Nick if you're going to text you have to put your phone under the GoPro so we can see you text no I mean ladies and gentlemen if you want to play this game go to the link in the description check it out it is called Joking Hazard by Cyanide and Happiness they're doing their Kickstarter they're being very successful right now and congratulations to them that is super super **** awesome this a lot of fun yeah I like this game a lot I'm going to back it I'm going to buy it I'm going to do it this is",
            "start": 1962.16
        },
        {
            "text": "successful right now and congratulations to them that is super super **** awesome this a lot of fun yeah I like this game a lot I'm going to back it I'm going to buy it I'm going to do it this is cool so thank you very much we'll talk to you soon",
            "start": 2022.04
        }
    ]
}