{
  "id": 1567,
  "video_id": "psp5AwvMYi0",
  "show_name": "The GameOverGreggy Show",
  "hosts": ["Greg Miller", "Tim Gettys", "Colin Moriarty", "Portillo"],
  "title": "Colin's Anxiety, Mike Tyson's Transgressions - The GameOverGreggy Show Ep. 115",
  "description": "A viewer wants to talk about anxiety, and Greg wants to talk about forgiveness when it comes to celebrities. (Released on Patreon 02.12.16)\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1455868800,
  "duration": 5505,
  "transcript_chunks": [
    {
      "text": "What's up everybody welcome to The GameOverGreggy Show. I'm one of your hosts, Greg Miller, alongside the pride of Long Island, Colin Moriarty. Go Islanders. I don't like when you do this because it either looks like Superman's gonna- Oh no. He's about to get his head cut off. I know it looks like that or he's Taz from old school ECW, he's coming out to fuck somebody up. It's one of the two for sure. And I don't want either of those to happen to Superman. No no no. Over there, the pure one, Tim Gettys. What's up, let Tim host. We just forced Nick Scarpino to go home early because he's sick, and thank you for addressing Elephant in the Room. I have not talked to you about this, and you've thrown me some curves. Because I'll never forget the first time at IGN you showed up and your hair was all nimbly bimbly, and I was like, what is this? Oh, this is what I do on haircut days. But then recently, you've just been a lazy fuck, and you come in with your hair not done. We'll get to",
      "start": 30.0
    },
    {
      "text": "hair was all nimbly bimbly, and I was like, what is this? Oh, this is what I do on haircut days. But then recently, you've just been a lazy fuck, and you come in with your hair not done. We'll get to that. That's topic four today, me being a lazy fuck. My topic. It's not really that, it's called something else, that's why I didn't know. Yeah, but I mean, it kind of goes into it, it's how much I like that, that causes this. But you know, this is a thing. It's longer than I've spent a long time. I'm channeling my little Dickie. You know, it's happening. But no, no, I'm going to good old Philadelphia, Colin's homeland of the East Coast, to visit my girlfriend. Sure. Now as the East Coast, you're going to count that as the East Coast? Yeah, Philadelphia is the original capital. I know that. I don't think you do know that. As East as you can go. Because if you did know that, you would know that it is a real East Coast city. I just know that you are so particular about everything. East",
      "start": 67.24
    },
    {
      "text": "I don't think you do know that. As East as you can go. Because if you did know that, you would know that it is a real East Coast city. I just know that you are so particular about everything. East Coast related. Right. Long Island related. Right. The Island related. Right. Brookhaven related. Right. I really doubt you're going to let anybody slide by on something that's not 100%. No, the original 13 Colonies, also known as real America. You know, Pennsylvania is part of that. So of course, Philadelphia, you know. Philadelphia was the, what was it? Fresh Prince of Bel-Air setting. What was the kind of, what was the statistic? For like three seconds of the theme song. Oh no. Not that it doesn't exist. The statistic was that, no, we talked about this on the show a few months ago that I was reading about old like Indian cities from like these extinct North American Indian tribes that had like capital cities of 0, 30, 40,000 people. One of those cities in Missouri that they found near",
      "start": 114.04
    },
    {
      "text": "reading about old like Indian cities from like these extinct North American Indian tribes that had like capital cities of 0, 30, 40,000 people. One of those cities in Missouri that they found near where you went to school was the most populated city in North American history until Philadelphia in like 1800 or something. That's what I was thinking. Did you see the Native American slash Indian commercial from the Super Bowl? That wasn't like a real commercial but went out on the internet. The Indian crying? No, no, not that one. It was a different one. It was really well done. It was really, really well done. No, I wasn't paying attention to the commercials. It wasn't, I don't think it was on during the Super Bowl. I caught it on the internet last night, but it's a shot at the Redskins. I was like, got to nail the bottom. I'm interested to see how long that goes on and if that can go on in perpetuity. Yeah. Cause I, you know, I don't know what the answer to that question is, but that's",
      "start": 155.32
    },
    {
      "text": "like, got to nail the bottom. I'm interested to see how long that goes on and if that can go on in perpetuity. Yeah. Cause I, you know, I don't know what the answer to that question is, but that's another topic. Rename it probably. Yeah. It's just, it's funny. They're doing everything they can to, you know, they like, they took the trademark away and stuff like you, like, it's so weird that the Redskins, like anyone could put Redskins on their shirt and sell it and make money on it. Like they can't, the team can't do anything about it cause you can't make a, what is considered a racially derogatory trademark or copyright. They've lost. So it's just like, how long have you done it? Just put their logo is still copyrighted. Yeah. I don't know if Dan Snyder's a proud man. It looks like, I would make, I mean, if it was like there was so much public pressure, you make a thing about it. You like, you know, yeah. Okay. I'm not saying he should or shouldn't change. I don't really, you know",
      "start": 189.48
    },
    {
      "text": "make, I mean, if it was like there was so much public pressure, you make a thing about it. You like, you know, yeah. Okay. I'm not saying he should or shouldn't change. I don't really, you know, have a strong opinion on either way, to be honest with you. I think that if people are offended by it, you see things both way where it's like, you know, some people, the Native Americans are, you know, Indians are offended. Some people aren't, you know, I, so I don't know the answer to that, but if I was the part of the thing, I'd be like, let's make this a big thing. A we can get the fans involved and pick a new name for the team or whatever, have this huge drawn out thing. And then, and then we sell mad merchandise. Everyone's got to buy new merch, change the colors, change everything. And you make up the new fucking make, you know, you get lemons, you make lemonade. Yeah. Well, I like your hair too. Thank you. Your hair has got a lot going on. It's got, it's got peaks and valleys. It's very Cory Matthews season. It is season. I'm growing my beard longer and my hair longer. Yeah. Okay. Good luck. And then what are you going to go through with the one setting? Get it all. I don't know. I'm going to see how long I can grow before it looks. You're kicking around the idea of going to get a real barber. Yeah. I haven't been to a real barber since 2007. You should do it. I'm saying that should be your topic. And we, we bring the guy that we almost brought to the Twitch thing and he cuts your hair on the show. We should all get haircuts and beard shaves and stuff. Oh my God. I like that. I don't know. I don't, I, it's just, I bought this $20 buzzer in 2007 at Target and I've been using it since then every haircut for everything, shaving my balls, you know, trimming everything and",
      "start": 222.84
    },
    {
      "text": "make up the new fucking make, you know, you get lemons, you make lemonade. Yeah. Well, I like your hair too. Thank you. Your hair has got a lot going on. It's got, it's got peaks and valleys. It's very Cory Matthews season. It is season. I'm growing my beard longer and my hair longer. Yeah. Okay. Good luck. And then what are you going to go through with the one setting? Get it all. I don't know. I'm going to see how long I can grow before it looks. You're kicking around the idea of going to get a real barber. Yeah. I haven't been to a real barber since 2007. You should do it. I'm saying that should be your topic. And we, we bring the guy that we almost brought to the Twitch thing and he cuts your hair on the show. We should all get haircuts and beard shaves and stuff. Oh my God. I like that. I don't know. I don't, I, it's just, I bought this $20 buzzer in 2007 at Target and I've been using it since then every haircut for everything, shaving my balls, you know, trimming everything and",
      "start": 254.16
    },
    {
      "text": "I don't know. I don't, I, it's just, I bought this $20 buzzer in 2007 at Target and I've been using it since then every haircut for everything, shaving my balls, you know, trimming everything and it's $20. I've gotten so much out of that $20. I can't stop. I can't stop. You guys have spent thousands of dollars in that time on your haircuts, thousands of dollars in investment. I'm here. Fucking sitting pretty. Not that pretty, but pretty enough. Pretty enough. Pretty enough. So as pretty as you need to be calling, we're talking about literally like at this point for how much I've used that razor, like 5 cents of the use. Yeah, I mean, yeah, no, I know. It's pretty awesome. If you didn't know, ladies and gentlemen, this is the GameOver Greg Show each and every week for sometimes five or three best friends gather on this table. Each bring a random topic of discussion for your amusement. If you like that head over to Patreon.com/kindafunny where you can support us. Get episodes",
      "start": 287.64
    },
    {
      "text": "best friends gather on this table. Each bring a random topic of discussion for your amusement. If you like that head over to Patreon.com/kindafunny where you can support us. Get episodes early, get exclusive perks and get an exclusive episode each and every month. If you have no bucks to toss our way, it's no big deal. Head over to YouTube.com/kindafunny where we post the entire show topic by topic day by day starting on the Monday after it goes live on Patreon until the next Friday when we put the whole thing up is one big MP3 and one big video. And here's what I got to tell you guys. Ooh, I'm gonna steal your stuff. Thunder here, Tim. Go for it. This episode is gonna be worth a dollar. I feel like we've all been wound pretty tight. I have a good feeling about where everything's going in this show. Okay. Good topics. We're here. Kevin's tired. He's sick too. What do you want to admit it? Cause he's Kevin, the Peruvian workhorse. You're sick too. How many DayQuil's",
      "start": 328.32
    },
    {
      "text": "going in this show. Okay. Good topics. We're here. Kevin's tired. He's sick too. What do you want to admit it? Cause he's Kevin, the Peruvian workhorse. You're sick too. How many DayQuil's you take today? Kevin, how do you say you're using both hands down with his hands. Kevin, how do you say Peruvian workhorse and Peruvian? Oh, he's opening the DayQuil. He's got no drink either. He's going to take it down like a man. I've been told by good authority that, and it's disappointing because I've used, I'm a big believer in DayQuil that it's totally placebo. Yeah, it's totally. That's fine. If it works, I don't give a shit. You know what I mean? I love it. Just get the job then. Our first topic comes from Patreon.com. Just like all these supporters. Do you remember you can support us on Patreon.com/kindafunny. Get your name up here. Like all these people did. And this is of course the January 2016 crew, which is the biggest crew we've ever had. They all came rolling deep this",
      "start": 366.72
    },
    {
      "text": "slash Kinda Funny. Get your name up here. Like all these people did. And this is of course the January 2016 crew, which is the biggest crew we've ever had. They all came rolling deep this month. Greg the rap lyric. Okay. Okay. We are rolling deep this month. Thanks to you supporting the animated show. Thank you to all these people and thank you to Greg Bullock. Greg Bullock's topic is a walk and I liked that. He gives us a whole bunch of context here, but his topic is anxiety, specifically how it affects us and how we deal with it. Stop here if you're busy. I know you are. The rest is just background in front of praise. Smiley emoticon. We're going balls in. You gave us money to get this topic read. We're reading it. Last year I finally made the choice to see a doctor, get a diagnosis and start taking medicine medication for my anxiety and OCD and my life has improved immeasurably. I'm turning 30 this year and I wish I had the kind of ball. I wish I had these kinds of balls to see a",
      "start": 408.84
    },
    {
      "text": "start taking medicine medication for my anxiety and OCD and my life has improved immeasurably. I'm turning 30 this year and I wish I had the kind of ball. I wish I had these kinds of balls to see a doctor and sort this out 10 years ago. I used to worry that taking medication for anxiety would stop me from being me or affect my performance at work, but none of that happened. In fact, it was the complete opposite. Hoping this toxic, I'm sorry, hoping this topic might help some of the best friends parentheses and maybe Colin M. who suffer from chronic anxiety. Understand that it can be managed and it's worth seeking help. Medication isn't the only treatment, so it's important to let a doctor help you figure out what might work for you. This isn't something Colin wants to talk about on the podcast. Totally understand and let me know and I'll figure out a different topic. Colin, do you care? No. Because you're an open book and you're Colin Moriarty. You're my boy Colin M. So it's unfair",
      "start": 448.88
    },
    {
      "text": "Totally understand and let me know and I'll figure out a different topic. Colin, do you care? No. Because you're an open book and you're Colin Moriarty. You're my boy Colin M. So it's unfair, but a lot of this has to be put on you Colin. You talk about your anxiety that you have, you have anxiety and you know this, that and the other. Right. I talk about it specifically so people know that they're not. They're trying to be a dick. No, just so they know that they have it. Yeah, that you're not alone. Here's my question for you. I want you to explain what you having anxiety and you always call it a debilitating anxiety. What does that mean and what does that feel like? Because I get it. You don't travel with us as much. You don't want to be in big groups of people. You don't want to do this kind of stuff, right? Yeah. I mean, the thing is, is that and it's not meant to be a dick is that you don't get it. And like that's and that's like, you know. That's the whole reason. That's why I'm",
      "start": 493.96
    },
    {
      "text": "kind of stuff, right? Yeah. I mean, the thing is, is that and it's not meant to be a dick is that you don't get it. And like that's and that's like, you know. That's the whole reason. That's why I'm putting all the work on you on this one. Because you say that and you retreat to your room or, you know, people are and I get all that that you for me, it's OK. Colin doesn't want to be around this thing, but I don't I don't know what it feels like. I don't know what it is. Yeah. And I don't mean that as a dick headed thing. It's like it's one of those things where it's like, you know, people like, oh, I know how you feel. And I was like, you really don't like, you know, like unless you do. Yeah. Unless you unless you have it, it's anxiety. Having crippling anxiety is awful. And the worst part about it is, you know, anxiety is triggered for many different people in many different ways. And I know people with anxiety that have anxiety that are close to me that are that are as bad and in",
      "start": 531.08
    },
    {
      "text": "about it is, you know, anxiety is triggered for many different people in many different ways. And I know people with anxiety that have anxiety that are close to me that are that are as bad and in some ways worse and in some ways better, depending on who you're talking to, what you're talking about. And everyone derives their anxiety from different things. So, you know, like generalized anxiety, which is like something I have, which is basically like everything makes you anxious. Like you can find anxiety and literally anything like you can talk to a person at a store and then be like, did that person that I had offended that person? Like you didn't even do anything. But it's like you like obsess over these weird things that like normal people don't. Obsess over. So having and that's just a random example, but having having anxiety is debilitating when you're when you're self-aware of it and you know that you're not normal and you actually feel crazy. And that's kind of the thing that",
      "start": 564.48
    },
    {
      "text": "a random example, but having having anxiety is debilitating when you're when you're self-aware of it and you know that you're not normal and you actually feel crazy. And that's kind of the thing that I suffer from is that I think I'm a pretty normal person on like, you know, outwardly. But on the inside, I I have like a lot of struggle and it's only gotten actually worse as I've gotten older. And the thing that I that that troubles me is that I've always dealt with this. I was talking to my dad a few weeks ago and I think I talked about on the show a little bit about we had like a heart to heart about it. And then I've always been like this and I've always been an anxious person. It's ravaged my body, actually. Like it's, you know, my stomach and, you know, I have, you know, IBS and and and ulcers and so like that. And that's how I feel things in my stomach. Some people feel that in their chest where they can't breathe. Some people like. I was going to say so. Yeah. I mean, I I'm",
      "start": 599.28
    },
    {
      "text": "and ulcers and so like that. And that's how I feel things in my stomach. Some people feel that in their chest where they can't breathe. Some people like. I was going to say so. Yeah. I mean, I I'm anxious about things, right? Like, I guess, you know, for me, I don't think I ever sit there. I mean, I'm anxious about this. You know what I mean? Like, I'm nervous about something. So, yeah. What for me, I'm right there with you. What's the difference between feeling stressed about something and feeling anxious? Like, are those totally different things? I think they're interrelated. I mean, anxiety is more to me is more and I'm not a psychologist or a therapist or a psychologist or psychiatrist rather in any in any respect. But anxiety, when you have anxiety as opposed to like having anxiety, I think there are two different things. You have anxiety or you're having anxiety. You know, like I have anxiety. I'm anxious every day, like almost every minute of the day. And people deal with it in",
      "start": 641.72
    },
    {
      "text": "think there are two different things. You have anxiety or you're having anxiety. You know, like I have anxiety. I'm anxious every day, like almost every minute of the day. And people deal with it in different ways. You know, having a mental I've always had a mentality since I was a young kid. I wake up in the morning. I feel fine. And then immediately I'm like, something's wrong, you know, and like and I won't even like move until I'm like, something is wrong. Like what am I worried about today? Like that's literally how I live my life. And I've always lived it like that. And I put myself in positions in situations where it makes it harder for me, but I do it to like confront the anxiety every once in a while. For instance, I'm like giving a presentation to like young kids, seven to eleven years old at a private school about video games and criticism and stuff like that. Something that immediately someone asked me that I'd be like, no, of course not. I'm not doing that. But like every",
      "start": 679.6
    },
    {
      "text": "years old at a private school about video games and criticism and stuff like that. Something that immediately someone asked me that I'd be like, no, of course not. I'm not doing that. But like every once in a while, like I'm just like, why not? Why not? You know, like why not just do it? It's the same thing I was saying about when I host an occasional PAX panel or something like that. It's like, I don't want to be here to do this at all. Yeah. But I don't even want to be at the show. You know what I mean? There's part of you that there has to be part of you that wants it though. Right. Because I mean, you, you, you do that whenever we need you to do that. You know what I mean? Like you don't go to VidCon, but yeah, VidCon is just socializing and bullshit and which isn't your thing. Right. No, I, I, there's a small sliver of me. I mean, like to be perfectly can with you if, if as a, as a consumer, I would never want to go to these shows ever. As, as, as a, as like a professional in the",
      "start": 722.28
    },
    {
      "text": "No, I, I, there's a small sliver of me. I mean, like to be perfectly can with you if, if as a, as a consumer, I would never want to go to these shows ever. As, as, as a, as like a professional in the industry, I guess like there's a small part of me that would want to go, like we're talking about our plans this year. And like my, my ultimate verdict I hope is that we just don't go. I know that's not gonna happen, but I'm just like, I don't want to go. Like I don't want to go to either. You know, like I don't like, I don't like being around people like all these people and you know, PSX was an especially trying experience for me. Not because I don't appreciate the fans we have because I do, I love them. They're, they're our bread and butter and I love doing this kind of stuff. It's just like being stopped every five seconds and, and, and, you know, taking pictures on stuff. I'm just like, I'm just not, this doesn't sit right with me and I don't know why it doesn't sit right with me. It",
      "start": 755.02
    },
    {
      "text": "being stopped every five seconds and, and, and, you know, taking pictures on stuff. I'm just like, I'm just not, this doesn't sit right with me and I don't know why it doesn't sit right with me. It just doesn't. But I try to like put on a face and do the best I can because the other three of you, especially you two, I don't know. Nick and I think Nick and I like you guys kind of, I always explain to you guys like you eat it up and like almost thrive on it and need it. You know what I mean? Like I don't need it. I don't think that's unfair to throw that on me. I'm not saying it in a negative way. I'm like, this is like what you, you do. You need it. I need to connect with our fans. I need to shake hands and hug people and tell them thank you. That's that for me, that's what I need. It's not that I need the slaps in the back and I'm awesome. I need to fucking to talk to the people who are out there consuming this content and going to shows. Right. To me it's, it's like a different",
      "start": 790.44
    },
    {
      "text": "not that I need the slaps in the back and I'm awesome. I need to fucking to talk to the people who are out there consuming this content and going to shows. Right. To me it's, it's like a different thing. Like that's why, you know, Aaron was talking to me about like what, like we're talking about Twitter and stuff like that. And I'm like, I like Twitter and Facebook because like this allows me to interact with our fans in a way that's like feels good to me. I'm, I think I had talked on our Facebook group many times more than all of the rest of us combined because that's, because that's like, but that's just a place where I'm like, okay, like I can show people I appreciate them and want to interact with them in a way that like is more on my terms. That makes sense. And Twitter is kind of the same way. And she was asking me like, well like it's so weird that you feel like this when you're in front of a camera and stuff all the time. And I'm like, yeah, but like we do a lot of VOD and",
      "start": 824.0
    },
    {
      "text": "the same way. And she was asking me like, well like it's so weird that you feel like this when you're in front of a camera and stuff all the time. And I'm like, yeah, but like we do a lot of VOD and like I feel comfortable in front of a camera and even doing like Twitch streams and stuff like that. Like it's fine. I don't like our long Twitch streams actually at all. Like they give me a lot of anxiety, but we have to, we have to like do them in order for us to succeed as a group and a unit. So like the, the, the answer to your question before was like, well why? It's like, because I have to like pull my own weight and like my own way and that's the best way I can, I know how to do it. But like my, my anxiety is just, is a product of unknown origins. Like I don't know where it came from. My siblings are not like this. My parents are not like this. My mother especially is a very outgoing like, you know, person. I think I'm a friendly person. I just don't know. And I think I have a good",
      "start": 854.56
    },
    {
      "text": "siblings are not like this. My parents are not like this. My mother especially is a very outgoing like, you know, person. I think I'm a friendly person. I just don't know. And I think I have a good personality. I just don't think that like, I just don't like interacting with people that much. And like it's just, it's weird because I do and then I don't, you know what I mean? Like I do and then I don't, depends on who I'm with. Like when I'm by myself, like I have to go to the supermarket later and I'm like, I don't really want to do this, you know, like, and that's like so weird. But I'm like, I don't want to go there and like be around people. But like if I'm with someone else, but I'm with someone else, then it's like, then I'm okay. You know? So I don't know. It's, it's confusing. It's, it's as confusing to explain as it is in my own head because I've been dealing with this for my whole life and it's, it's never gotten easier. You know, it's only gotten worse. Yeah. But it's like",
      "start": 890.08
    },
    {
      "text": "it's as confusing to explain as it is in my own head because I've been dealing with this for my whole life and it's, it's never gotten easier. You know, it's only gotten worse. Yeah. But it's like very selective too. Like I like going to meet and greets and talking to the fans, but like there's time where I'm like, I gotta go, you know, like I can't do this like every few weeks. I can't, you know, I don't know. It's just, I know it's a weird thing. Like I'm just a weird person. I, I, I, I, I, I don't understand that. That's the whole thing to Greg and I want to try his name again. Colin, actually I'll just let you do it because my mom called me. I just want to let you know. Sorry about that. Multiple times in a row. Yeah. I said it is Bullock. Yeah. Okay. I don't know if it's Bullock. No, I was like, okay, cool. No, I think this speaks to, you know, over the weekend or a couple of days ago, last week, whatever I put up the thing, I was like, you're not allowed to kill yourself post. This",
      "start": 926.08
    },
    {
      "text": "like okay cool. No I think this speaks to you know over the weekend or a couple of days ago last week whatever I put up the thing I was like you're not allowed to kill yourself post. This is very much in that vein. I think is the fact that like you're not weird because of it. You're you know you're not I don't know your experience cause I haven't had to deal with it but that doesn't make you weird. There's tons of people watching this right now who are totally relate and understand everything you're saying. And that's why I think it's important that Greg brought it up in the way that you know we are talking about the best friends and we're a family and this that and the other. It's like nobody's weird for feeling anxious for being you know you not wanting to go to every show like Tim and I do. That's not weird. You know what I mean? That's you. That's fine. That's what we don't look at you and go yeah no. I'm going to Comic Con. What a half-assing fucking. The way",
      "start": 963.28
    },
    {
      "text": "show like Tim and I do. That's not weird. You know what I mean? That's you. That's fine. That's what we don't look at you and go yeah no. I'm going to Comic Con. What a half-assing fucking. The way I see it as long as it doesn't you know hold us back from doing what we want to do then it doesn't matter. You know what I mean? Cause it's like we support you you support us like and all obviously there's a compromise that I'm not saying like if it was holding us back that'd be an issue even then because it is a compromise. It's this whole thing is really fascinating to me because I've never had to deal with it and I cannot fathom it. Like I cannot when you say the way that you're feeling I just don't I can't comprehend it. It doesn't make sense to me. And that's kind of it kind of troubles me in a lot of ways where I'll talk to people I'll talk to Kevin about it. I'll talk to you know some of my friends just about like trying to wrap my head around it and see how they",
      "start": 993.28
    },
    {
      "text": "of troubles me in a lot of ways where I'll talk to people I'll talk to Kevin about it. I'll talk to you know some of my friends just about like trying to wrap my head around it and see how they feel about things and whatever. And it's but anxiety or Colin um anxiety. Okay. Anxiety. Yeah. Just in general because I'm trying to see like and I alone in how I am I the weird one for not feeling this way. Cause I feel like so many other people so many people that's the default. And especially like maybe it's the generation I grew up in but everyone has ADD or OCD or this and they're taking medications for this or that or whatever. And it's like I I never did. And I stayed out of that and I don't think that there's a problem with any of that necessarily but it's weird and I don't get it and it's really hard for me to kind of discuss it without sounding insensitive because I feel like I'm very sensitive to people's experiences especially if I don't understand them or this. I",
      "start": 1027.36
    },
    {
      "text": "get it and it's really hard for me to kind of discuss it without sounding insensitive because I feel like I'm very sensitive to people's experiences especially if I don't understand them or this. I try to be I might say some things that come off insensitive but I don't mean it that way. I'm definitely I'm caring and I'm I try to be there for people in whatever way I need to. Um but with you specifically I always find it really really really difficult because I don't know how to be there for you in the right way. Cause like I'm just kind of there always. Yeah. You know? And it's like it's it's it gets rough for me because there's a lot of times where you you will bottle it all up you know and feel all these feelings that we don't understand and we don't even necessarily know you're feeling them. And then it usually ends in a very long written thing cause that's how you communicate. And I always feel bad cause I don't that's not me. I don't respond in a in a written",
      "start": 1068.4
    },
    {
      "text": "you're feeling them. And then it usually ends in a very long written thing cause that's how you communicate. And I always feel bad cause I don't that's not me. I don't respond in a in a written way. Like I'll talk to you or give you a look or like you know something a Musically video of you lip syncing his favorite song. Not even necessarily that but something something like different but I'm not really like I'm going to sit there and write something. But it's it's always interesting to me that you feel so much and then so eloquently explain it in an email or in a you know just some whether it's a Facebook post to the the group out there or to or the forums or this or that it blows me away how much you understand how you feel and how well you can put that into words because it does help me to kind of understand at least how you're feeling even though I don't understand how you could be feeling that. If that makes sense. Yeah it makes perfect sense. Like it's it's",
      "start": 1108.68
    },
    {
      "text": "it does help me to kind of understand at least how you're feeling even though I don't understand how you could be feeling that. If that makes sense. Yeah it makes perfect sense. Like it's it's the it's the it's the self awareness that a lot of people with anxiety have that is the worst part of being of being that way of knowing that you're debilitated for reasons that don't make sense. Anxiety comes from you can be anxious about legitimate things but typically anxiety is irrational. Like that that's that's the idea. Like fear and anxiety are typically irrational. Like there's isn't cause right now you're dealing with the fact that you're in a new relationship and it's awesome and you're worried about the other shoe dropping. That's what you always talk about right? Yeah. Like I like I was telling you the other day like and and you know it's like I was I was talking to my dad I'm like you know my business is too successful. My girlfriend's too beautiful. Like",
      "start": 1152.4
    },
    {
      "text": "I like I was telling you the other day like and and you know it's like I was I was talking to my dad I'm like you know my business is too successful. My girlfriend's too beautiful. Like things are too good. That's a weird fucking thing to be stressed about. But that's like that is you know what I am stressed about. Those are your real feelings. Like that's like really what I like and that's just a sliver of it. But like that's that's like what I fear on a day to day basis you know like saying something or doing something or being a way that ruined something you know like when things get better my anxiety gets worse. There's definitely a a a you know a power correlation there on the on the chart you know so that's a perfect example of something that I hear and I just I can't you know just doesn't click to me. Like it just doesn't add up. It's an equation that the equal sign is not right. You know I I hear that and I'm like dude just enjoy it. You know",
      "start": 1190.32
    },
    {
      "text": "just I can't you know just doesn't click to me. Like it just doesn't add up. It's an equation that the equal sign is not right. You know I I hear that and I'm like dude just enjoy it. You know what I mean? Like like cause I'm on the same same exact place with you. Like this year has been the best year of my life. Kinda Funny. He's been awesome. My girlfriend is awesome. My friendships are awesome. Everything. Awesome. Awesome. Awesome. Yeah. There's bad stuff. There's definitely bad stuff. There always is. Gotta hang out with Kevin. But overall it's like we live similar lives in the sense of like the good things that we share and all that. And when you say things like that it's like I get this guttural reaction of like just stop like just stop doing that call and like just let it happen and be happy because this is all good stuff. Like don't make trouble where there's not. And that's the moment where I'm like shit like I can't even understand thinking of this stuff as",
      "start": 1226.1
    },
    {
      "text": "it happen and be happy because this is all good stuff. Like don't make trouble where there's not. And that's the moment where I'm like shit like I can't even understand thinking of this stuff as a problem. So the just stopping me saying that I know it's not that easy but that's I guess the hard part for me where it's like it sounds very easy to me. It really sounds or just literally wake up and don't think about what's wrong. Think about what's right. Yeah. It's it's it's just like I'm not and I'm not saying this in any sort of self-aggrandizing way. Like I'm just not built to do I'm not strong enough to do that. You know like mentally it's like the I can turn myself a smart person but like intelligence can't overmatch being not being able to get out of your own head. Right. Right. Right. And and yeah like it's it's great. Like I was in a really bad place in a legitimately bad place for a while with you know other things in my life that were bad that really were",
      "start": 1267.98
    },
    {
      "text": "Right. Right. And and yeah like it's it's great. Like I was in a really bad place in a legitimately bad place for a while with you know other things in my life that were bad that really were bad. And it is funny that now things are better and really great. I have like you know I can't say enough about like how important like you know Aaron is to me you know and like I can't say how you know I can't say enough about how important this company is to me. You know I was really hurt last week when you know I emailed you or I talked to you guys or emailed you guys about it. Just talk. I think I talked to you about it Greg. Like maybe that was what it was about. Like people in the comments saying that like you know I don't care anymore about this company or like I'm not involved or invest in it. And I'm like how fucking dare you feel or say that you first of all you don't fucking know me. Second of all like you know I left my job too you know and like I came along",
      "start": 1310.44
    },
    {
      "text": "or invest in it. And I'm like how fucking dare you feel or say that you first of all you don't fucking know me. Second of all like you know I left my job too you know and like I came along for this ride too. And I am a draw to this company. I'm not just like along for the ride you know and that kind of shit like that kind of shit really bothered me because it's like I'm heavily invested. People are saying like oh he's probably begging for his old job. I would never go back. Like I like what I I like what I do you know like people make a lot of assumptions based on like a very very small window into someone's life and then paints a broad picture about them not knowing what they go through on a day to day basis. And like being the way that I am I try not to do that to other people because like you really don't know the struggles that people like go through behind the scenes or the good things that happen to people behind the scenes too. And of course good things happen",
      "start": 1355.84
    },
    {
      "text": "people because like you really don't know the struggles that people like go through behind the scenes or the good things that happen to people behind the scenes too. And of course good things happen to me. So like if I'm trying to pursue like happiness in my own way that doesn't that's not a reflection on the way I feel about my company or the way I feel about my coworkers or my friends. It's a reflection on like me trying to find that happy medium in my life. And that really bothered me in the sense that I was like well people have been talking shit for years about us on the internet and that's just the way it goes. And most of it is like whatever. But that really bothered me. I'm like you think I just blew up like my old career to like do something that I then hate and I just disappear and then I take advantage of my friends. Cause that was basically the insinuation. I just take advantage of people and then I just disappear and I still get paid and like I'm not invested like",
      "start": 1391.12
    },
    {
      "text": "and then I take advantage of my friends. Cause that was basically the insinuation. I just take advantage of people and then I just disappear and I still get paid and like I'm not invested like there. It's like like that kind of stuff sucks. You know? And sometimes makes the situation worse when people really feel like they know you but they really don't. You know? And you know the the the fact is is that like I've often put myself in situations that make me in some way feel uncomfortable. I've often talked about you know playing goalie in hockey which is a very high stress fucking position usually played by very weird people. And if you like you know goalies I'm not saying that to be funny. Like they are we're weird. Like we all have like these weird ticks or these weird OCD like the weird rituals. I've talked a lot about my own rituals going on like on the ice and like not wearing underwear. Yeah. Like I play naked under my gear. Like I you know I'd always bring two",
      "start": 1423.14
    },
    {
      "text": "like the weird rituals. I've talked a lot about my own rituals going on like on the ice and like not wearing underwear. Yeah. Like I play naked under my gear. Like I you know I'd always bring two sticks under the ice and throw one onto the bench even though like the equipment manager someone would just bring my sticks on the bench for me. I had to do it. You know what I mean? Like there was like weird things like that. And then it's like a position where you get a lot of praise and a lot of blame. And it's not like a position where you can disappear into the back you know background be a third round or third third wing. And like it's like you're on the ice for a few minutes. Like you're there. And so like putting myself in those kinds of positions was useful for me to like help me overcome the anxiety my anxiety which was much much lighter when I was a kid. And now that like I have I feel like I have a lot of responsibility and more pressure on me. It's like it's like",
      "start": 1459.36
    },
    {
      "text": "me overcome the anxiety my anxiety which was much much lighter when I was a kid. And now that like I have I feel like I have a lot of responsibility and more pressure on me. It's like it's like it's like it's like a cacophony like this maelstrom of of just like wanting to deliver good content to people like wanting them to like you in some way and like kind of feeling pressure to like be like I try to be yourself but also try to be what people want you to be you know? And like when I sit quietly sometimes like people get mad at me when I say too much people get mad at me when I like like you know it's like sometimes like you just can't please anyone and that just makes your anxiety worse. But you know that's the vocal minority. No I know. It's just it's just like there comes a point where I've accepted it and I've talked to people about it in the past but like I I'm just of the mind that like I really don't want to take meds. I'm not saying there's anything I'm",
      "start": 1492.2
    },
    {
      "text": "comes a point where I've accepted it and I've talked to people about it in the past but like I I'm just of the mind that like I really don't want to take meds. I'm not saying there's anything I'm not saying there's anything wrong with it at all. Like it really does help people. I know you know lots of people that you know take various medication I've had I have my whole life and it really does help them. I just it's just I just don't feel like it's my solution. Like I want you know cause I'm afraid of a dependency and I'm afraid of like yeah. And I know that that's not always a thing but I and I'm not afraid of it changing me. I want to be different. It's not like it's not like I want to be exactly the way I am. Like it doesn't make any sense. So like I just want to be able to solve it on my own. But I also know that like I need help and I do I do depend on people in different ways. But there comes times where I'm like I just have to go you know I deal with a lot",
      "start": 1531.24
    },
    {
      "text": "to solve it on my own. But I also know that like I need help and I do I do depend on people in different ways. But there comes times where I'm like I just have to go you know I deal with a lot of my anxiety by sleeping and disappearing. Some people can't sleep you know some people eat some people engage in really super destructive behavior you know or escape into a video game or do whatever they do and everyone has to deal with in their own way. I'm not judging anyone. I mean do you want I just like sometimes it's three o'clock in the afternoon. I'm like I got to go. Yeah. Like because like I start to to shut down and the reason I talk about it so openly is because I am not ashamed of it and be like the I want people out there to know that like I can't possibly be the only person that feels like this. Like I know that. And then when you really talk about it openly you realize that like there's a lot of us and it's not a small fraction or a small sliver of people. It's a",
      "start": 1566.12
    },
    {
      "text": "that feels like this. Like I know that. And then when you really talk about it openly you realize that like there's a lot of us and it's not a small fraction or a small sliver of people. It's a lot of people that deal with this. Some people deal with it way worse than I do. I mean really like and really need help. So so anxiety can be crippling and debilitating. I only ask people out there to like be a little more understanding not necessarily with me. You don't you know we don't we don't you know it's fine. You can say what you want about me but like more people in your life understand that if they have anxiety or they they're stressed out about something and you might not understand it like it's real to them. And I can sympathize with that because weird things can set my anxiety off and so too can other people. Like just the very act of having to go to the store or leaving the house sometimes is hard. But then there are other days where I'm like I want to leave and I want",
      "start": 1603.6
    },
    {
      "text": "off and so too can other people. Like just the very act of having to go to the store or leaving the house sometimes is hard. But then there are other days where I'm like I want to leave and I want to go out. So it's not always like this this murky dark place. I don't want to make it sound like that or seem like that. It's not it's just that like at my worst it's bad. You're like a light switch a lot of times. You're either on and you want to talk to us when we when you wake up and come out or you're off and you don't talk to anybody till Colin or your life starts. Do you feel like the the people aren't sympathetic to it? I think that my friends the people that are close to me are certainly sympathetic to it. But no I think generally I think that like there's a stigma against mental issues with people because it's it's looked at as a weakness and back in the day it was really looked at as weakness. I think it's gotten way better as time has marched on for sure. But no I",
      "start": 1636.22
    },
    {
      "text": "mental issues with people because it's it's looked at as a weakness and back in the day it was really looked at as weakness. I think it's gotten way better as time has marched on for sure. But no I think that like there is a there is a stigma to saying like I have anxiety or I have OCD or I'm depressed. Like yeah it's like there definitely isn't an understanding because people really don't understand about how like you can look around you know the United States and you have a you're you're a middle class guy or you have money or whatever. And like how can you how can you feel that way when X Y and Z are going so right? It's like dude like that's not what it's about. That's not real. It doesn't really make any sense to me either you know but like it's still it's still my reality. And again it is that self awareness that is so crippling you know where it's it's it can be devastating you know because I want to be out there. I want to be like you and Greg. I want",
      "start": 1671.06
    },
    {
      "text": "reality. And again it is that self awareness that is so crippling you know where it's it's it can be devastating you know because I want to be out there. I want to be like you and Greg. I want to like you know I know people really like what I have to say about games and like what I have to say about a lot of things and like really appreciate me. I know that and and I'm so thankful and appreciative of that. I want to be able to reciprocate that as best I can. And I hope that people don't think out there because I don't go to shows or whatever. People are disappointed when I was like where were you? And I got everyone to sign something but you and all this kind of stuff. And it's like dude like I'm sorry. You know like I appreciate that you appreciate me. I want to do the best work I can for you. Let's not let's not injure the connection we have with each other. But just understand that like my reality is just a little bit different than other people's reality. I'm not",
      "start": 1707.54
    },
    {
      "text": "work I can for you. Let's not let's not injure the connection we have with each other. But just understand that like my reality is just a little bit different than other people's reality. I'm not saying it's right or wrong. I I I want to be different you know but I have to deal with things in like my own way and I have good days and I have bad days and and certainly the condition in my real life is getting you know is are getting better and I have to learn how to accept good things. And my my that was my dad was saying to me is that I worked really hard to get to where I am. And and the fact of the matter is like I've always had this when I was at Northeastern I was always afraid of getting kicked out for no reason. It's like well I've arrived I've gotten here in this great fucking school. I've always wanted to go to in this in this very competitive atmosphere academic atmosphere and now I'm going to lose it. But there was no reason why that would have happened.",
      "start": 1742.18
    },
    {
      "text": "fucking school. I've always wanted to go to in this in this very competitive atmosphere academic atmosphere and now I'm going to lose it. But there was no reason why that would have happened. It's just like that that's not rational but anxiety isn't often rational. And when I got my job at IGN and I was so thankful for being there for so long and I'm so thankful for what they've provided me to this day I was worried every day that I would get laid off or fired like every day you know like I work weekends and like work at night. And I was the most read author in that site when when we left you know because on the game side because I like dumped a lot of my soul and my heart into it because I felt like that's what I had to do to prove that I was worth something you know? But even then you had that fear even after surviving layoff after layoff you still have that and feeling getting promoted and getting more money and all that kind of stuff. It's like you still have that",
      "start": 1775.3
    },
    {
      "text": "then you had that fear even after surviving layoff after layoff you still have that and feeling getting promoted and getting more money and all that kind of stuff. It's like you still have that feeling that like the other shoe is going to drop and that's like my whole life. You know what I mean? And like I don't I can't it's terrible. It doesn't mean that like I walk around in a fucking mope. I mean I don't I laugh and I have good times and I have good friends and I smile and I drink and I eat out and I do all these things. It's just to say like on those at those quiet moments sometimes and sometimes a lot of times like you have to deal with like these these murkier thoughts in your mind that don't really make any sense and they'll come from a reasonable place. And that like is where my anxiety comes from. But some people have anxiety for different reasons so I don't want to speak for them. Sure. You know thank you for speaking for yourself though. Yeah I don't know. I",
      "start": 1807.82
    },
    {
      "text": "where my anxiety comes from. But some people have anxiety for different reasons so I don't want to speak for them. Sure. You know thank you for speaking for yourself though. Yeah I don't know. I don't really know if anyone that many of that makes sense but it makes sense. It's just kind of made sense to make sense. I mean it does not make sense to me but what it makes sense for you. Sure. Exactly. Exactly. But I want that clear. Like that's like I don't it does not it still doesn't click you know but that's the thing is I understand. Yeah exactly. Like it's not rational and it doesn't make sense. Okay. Well thank you Greg for your topic your support on Patreon.com/kindafunny. Just like all the people I did earlier. Their names aren't there anymore but I'm still gesturing as if they were Colin. Colin. Yes. What's your real topic? That's not just about you unless this one's about you. No it's not about me. Twitter. Now we've talked about Twitter before. What's",
      "start": 1843.82
    },
    {
      "text": "as if they were calling. Colin. Yes. What's your real topic? That's not just about you unless this one's about you. No it's not about me. Twitter. Now we've talked about Twitter before. What's the angle this time? Well Twitter is kind of like falling apart in a corporate way and the what? No I'm just freaking out because I love Twitter. I do too. But I want to talk to you guys about there's like this notion this idea you know to catch people up like Twitter's. There's been a lot of turnover in the executive areas of Twitter. Twitter's stock has fallen dramatically. I'm talking about this new timeline layer. Yeah. They're they're making changes to kind of keep Twitter relevant. And what surprises me is that I find Twitter to have the most utility and the most use. I think it's like the most diverse thing. Like people are like well why don't you use Instagram? And I'm like cause like why would I use Instagram? Like it doesn't I'm not saying there's anything wrong with",
      "start": 1875.46
    },
    {
      "text": "like the most diverse thing. Like people are like well why don't you use Instagram? And I'm like cause like why would I use Instagram? Like it doesn't I'm not saying there's anything wrong with Instagram. I'm just saying like it's just pictures. It's more Vine is Vine. It's even more words than Twitter. Well it lets you write things underneath. But like the idea of Instagram was pictures or with with Vine it's just these short clips of videos or Periscope is like live video or whatever. It's like I can just kind of all the Periscope associated with Twitter. It's a bad example but I can kind of I can kind of like fold these things in you know Twitter like has Twitter. You can do everything you want on Twitter. I mean I still think Twitter is just the most useful and the most compact and I find it has the most utility. I disagree. Fuck you. But what I'm curious is if you know there's this notion that Twitter can go away or disappear. And my my whole thing is you know",
      "start": 1917.7
    },
    {
      "text": "compact and I find it has the most utility. I disagree. Fuck you. But what I'm curious is if you know there's this notion that Twitter can go away or disappear. And my my whole thing is you know the people talk about MySpace and I'm like well MySpace is way different because MySpace was eclipsed by something that was just like it but better. And there's nothing like Twitter that's even remotely like Twitter or better than Twitter. So I'm not worried about it disappearing but I'm wondering I'm wondering what you guys think about its future. And if you think it's still useful if there's something that we don't even know about it that we'll be using in the future because there are these ubiquitous social platforms that I feel like we're going to be using in 0 years. And I think Twitter is one of them. I think Facebook's obviously the other one. I'm not so sure that any of the other ones will exist in the way they do now except for those two because those two have the",
      "start": 1950.22
    },
    {
      "text": "Twitter is one of them. I think Facebook's obviously the other one. I'm not so sure that any of the other ones will exist in the way they do now except for those two because those two have the most like a long running tale like the zeitgeist like continues with Facebook. I mean my my Facebook account is 1 years old. You know that's like really scary when you think about that. Like it's 1 years old and I'll probably use it for another 1 years after that. And Twitter obviously is a 10 year old company now but seems to be fun. So I don't know. I just wanted to know your guys' thoughts on Twitter. I don't think this guy's following on Twitter. I think people make mountains out of molehills. They talked about this timeline and we flipped out and it was like I had no point was I like Oh this is like rip Twitter right? It was trending or whatever. I'm like I'm like I'm not it's not going to die based on this and they're like sure enough. Yeah this is an option. You can do",
      "start": 1982.94
    },
    {
      "text": "Oh this is like rip Twitter right? It was trending or whatever. I'm like I'm like I'm not it's not going to die based on this and they're like sure enough. Yeah this is an option. You can do this. All right cool. I'll look into it and see what I think about it and yada yada yada. I don't mind. It's similar. When I wake up in the morning I look and now they have that new like what happened while you were away thing. I'm like it was actually kind of cool. Thank you. I do. I do like seeing this. This is an interesting thing to see what people are up to while I was sleeping. I still love Twitter. I still think Twitter is awesome. And so I preferred social media platform. I like it like we've talked about before. It's the easiest way to talk to the best friends in the way of like you have 140 characters to make your point. You know what I mean? I have 140 characters to respond which is great for what about what do you think of this? What should I play? What about in that I",
      "start": 2020.46
    },
    {
      "text": "you have 140 characters to make your point. You know what I mean? I have 140 characters to respond which is great for what about what do you think of this? What should I play? What about in that I can give you short responses and go whereas on Facebook or even the Kinda Funny forums I open up my DMS or whatever and it's just a wall of text and I'm like I don't have time to read this or give you the response you deserve. So I just won't move on. Yeah. No Twitter's my my favorite to use as well. I when it comes to the MySpace and Facebook thing I think that's a little bit different. I go until there is a thing. There's not a thing you know until there was Facebook MySpace reigns supreme. So it's like it's not like they were competing and then one just went away. Like that happened pretty damn quickly you know? And with Twitter I think that it is a little bit different as well because Facebook and Twitter and Instagram and all the things kind of currently going on now",
      "start": 2047.18
    },
    {
      "text": "pretty damn quickly you know? And with Twitter I think that it is a little bit different as well because Facebook and Twitter and Instagram and all the things kind of currently going on now they rose with the iPhone and they are you know ubiquitous with people using their phones. Cause when iPhone came out in 006 or whatever there wasn't a MySpace app. There was a Facebook app. There was a Twitter app when apps eventually became a thing. So I think it's going to be a lot harder to dethrone the big guys because they're there and also they're just kind of eating everything up. So yeah now Facebook has Instagram and Twitter has Periscope and Vine. So it's like there's the main things of Facebook and Twitter and then everything else is just going to kind of feed into that shit and be like uses for it. Twitter I think we're in a bubble with Twitter. Like we all use Twitter but Twitter is not the most used. You know more people are on Instagram because because of Facebook and",
      "start": 2086.42
    },
    {
      "text": "like uses for it. Twitter I think we're in a bubble with Twitter. Like we all use Twitter but Twitter is not the most used. You know more people are on Instagram because because of Facebook and also just because that's how most people use the shit. And I think the gaming industry specifically is very Twitter heavy very Twitter focused but you look at other stuff and that's just simply not true. Having said that Twitter has made its way into like politics and shit and they promote their Twitters and stuff like that. But a lot of things also promote Instagrams and you know I think it really kind of depends on what group you're talking about. And the versatility with all of them is really high and it's just different. It's a different lens to look through all the different things. Do you think Twitter is going away? No definitely not. I think all of them all of the ones we were talking about are here to stay for a long time. Specifically Twitter Instagram Facebook. And with",
      "start": 2126.46
    },
    {
      "text": "you think Twitter is going away? No definitely not. I think all of them all of the ones we were talking about are here to stay for a long time. Specifically Twitter Instagram Facebook. And with Twitter people are afraid of change and they're so irrational about it and they're going to get angry about it. Get the fucking moments thing off the goddamn app. But it's like you just don't use it. So who cares? And like they move it around and I click on it. Yeah. And that hates stuff like that but it's like all right then it's minor annoyance. Then you get used to it. And then it's the same shit. In terms of their adding more character limits and stuff I think it's a bad idea. That's what they have Medium for. That's another thing that they owned. It's under their whole umbrella. Yeah. I doubt they're going to do it. I actually thought yeah you can do surveys all you want and you can do test things and whatever and put it out there and see what the public reacts to it. They're",
      "start": 2169.1
    },
    {
      "text": "I doubt they're going to do it. I actually thought yeah you can do surveys all you want and you can do test things and whatever and put it out there and see what the public reacts to it. They're not going to do it. And if they do there was a lot of data backing up. It's a good idea. And eventually we're going to like it because that's how this thing works. You know if they added more character limits if I had 140 characters plus a picture I'd fucking love that. Yeah. Because the worst one that eats into that crap or like if I can have character limit plus link plus like it's things like that where I'm not against that. Like don't hold me to this 140 thing when there's all this other shit that things change things adapt you know? And the change with the algorithmic timeline make it an option. Just make it one of the tabs. I'd like that. You know I'd like to be able to see the things that are tailored towards me just like the while you were away. Those things are awesome.",
      "start": 2205.9
    },
    {
      "text": "it an option. Just make it one of the tabs. I'd like that. You know I'd like to be able to see the things that are tailored towards me just like the while you were away. Those things are awesome. Everyone bitched about it when it first came out. Why? It's just extra functionality. Sure. What's more interesting I think is what's going to happen at the top. Like you're saying there's all this executive turnover. I was reading about it the other day. Who comes in? How now that these new people are in what do they think? What does it do to the stock? What's whatever really is it ever going to be super profitable? I mean are they headed for trouble? It's just the nature of like overvaluing all these companies. Like Twitter's already on the market so it's worth what it's worth now. But you see this with Snapchat. Like there's no way in God's green earth Snapchat's worth a billion dollars for instance. But like that's but they are a unicorn company because they are a privately held",
      "start": 2246.98
    },
    {
      "text": "see this with Snapchat. Like there's no way in God's green earth Snapchat's worth a billion dollars for instance. But like that's but they are a unicorn company because they are a privately held company with a valuation of over a billion dollars. But they can't possibly make that much money in order to like the nature of what they do is just it's just not possible to make that much money. Like it's not. And short of like having a service so great that you can get literally millions of people to subscribe to it and pay for it. Which is something that Snapchat's not going to be able to do or Twitter is going to do. No matter how much people love these things like when you're asking to really pay for them they're not going to do it. So you know I think that it's more about getting things in the line in terms of like what things are worth and Twitter is going to be you know can be targeted for a hostile takeover or something like that because it's public. So I think that the",
      "start": 2282.14
    },
    {
      "text": "things in the line in terms of like what things are worth and Twitter is going to be you know can be targeted for a hostile takeover or something like that because it's public. So I think that the company can very much change. I don't agree that MySpace and Facebook weren't competing with each other. They certainly were. They were concurrent to each other for a long time. And I mean three or four years before MySpace really got killed you know because like I don't know if it was three or four I was more like two like once Facebook got going like yeah Facebook was existed but like there was that that year or two boot up time where Facebook wasn't a thing until 007. I would say I'm talking an overall. I mean not for you but for people in college. That's what I'm saying. Yeah. Like it wasn't a thing that everybody used. No no I wasn't going to use MySpace. No of course. But but I do you know the reason my Facebook account is so old is because Northeastern was one of",
      "start": 2314.3
    },
    {
      "text": "Like it wasn't a thing that everybody used. No no I wasn't going to use MySpace. No of course. But but I do you know the reason my Facebook account is so old is because Northeastern was one of the very first schools on it. So my I made my account in early 004. And I remember to your point like the when people were finally allowed to sign up to it that weren't even in schools and stuff like that like not didn't have .edu accounts. A lot of people don't even know that about Facebook anymore. Cause that was such a long time ago. Like Facebook you only could use Facebook if you had a .edu account from a very certain school. That was the first time Facebook we all said it was dead. Oh my mom's on Facebook. This is dumb. But they knew what they were doing and they did it or whatever but like Facebook changed and evolved in and stole MySpace's audience. I mean that's what happened in 007. Yeah. By 007 I would say because even if you're in school and then if you're an",
      "start": 2354.18
    },
    {
      "text": "but like Facebook changed and evolved in and stole MySpace's audience. I mean that's what happened in 007. Yeah. By 007 I would say because even if you're in school and then if you're an alumni of a school or so like but I mean I was in high school in 007 and I couldn't get a Facebook account until like I got it as soon as you could. And that was either late oh six or early oh seven. Yeah. But my point is is that you know it's not only for college kids it was for people that were at war in college or are going to college and get their .edu is finally when you get accepted or alumni alumni of the schools as well. So it was it just slanted older and it wasn't until it democratized that like it definitely started to eat MySpace's lunch. But by that point like we had already known behind the wall at Facebook or whatever using it that it was way superior and a lot of different ways. But the site had the site had changed a lot. I mean in 004 your wall was a field that",
      "start": 2387.22
    },
    {
      "text": "behind the wall at Facebook or whatever using it that it was way superior and a lot of different ways. But the site had the site had changed a lot. I mean in 004 your wall was a field that anyone could edit and write whatever they wanted. So like if someone wrote something you'd have to like sign your name and then someone could just come in and delete it all and then like write something on your what was like supposed to be like a whiteboard on your on your dorm room door or whatever. So like that site has changed significantly. I think Facebook's kind of getting a lot of control but it's so ubiquitous that it's never going to go anywhere. And that was like kind of what I was wondering is if Twitter is really the only other social network that really is not going to ever go anywhere because it's just too ingrained and more than that it's too useful. You know that's that's the thing that I talk about with Twitter a lot is that I just think it has exceptional utility as it",
      "start": 2425.1
    },
    {
      "text": "because it's just too ingrained and more than that it's too useful. You know that's that's the thing that I talk about with Twitter a lot is that I just think it has exceptional utility as it is right now. And if they don't fuck with it too much it could stay that way. But it could also be ruined. It's like kind of a razor's edge where you start fucking around with the timeline you start fucking around with how much people can say on it. And brevity you know is no longer kind of the what makes Twitter run like figuring out what you want to say in a very distilled way. I think it's the facts. No I was talking about it when Twitter turned the corner for me. Cause I remember not I mean I when did Twitter even come around? We want to say 006 I think we were. Okay. So yeah but no one knew use Twitter until 009. I remember at IGN in the early going of the days or whatever when IGN set up its Twitter and that was the thing where we all tweeted to it. You wrote an",
      "start": 2459.62
    },
    {
      "text": "but no one knew use Twitter until 009. I remember at IGN in the early going of the days or whatever when IGN set up its Twitter and that was the thing where we all tweeted to it. You wrote an article we all signed into IGN's Twitter and we'll just tweet out the link or whatever. Right. And there was no real thing to it. And I remember when they finally got the first social manager right. And we're like all right now submit your links this way. Not everybody's going to tweet. And I remember when they were originally said all right you know you get you write an article you put up a review you do whatever you go in there and you tweet you're like I was like Twitter's so fucking dumb. Why would I ever do this? That and I remember when they like months later they removed it and like okay now one person's tweeting for IGN or whatever. And I was like fuck I miss Twitter. And I got Twitter and I had already been camping on my name cause I knew I'd give it eventually",
      "start": 2493.7
    },
    {
      "text": "it and like okay now one person's tweeting for IGN or whatever. And I was like fuck I miss Twitter. And I got Twitter and I had already been camping on my name cause I knew I'd give it eventually cause I'm a pushover or I was just learning to start camping on my name. I started using Twitter then and it was just the dumb thing of this that and the other and da da da. And there's always this one moment in time which is I think it's rare where I it was on Christmas break one year. I was playing video games. So the wee hours of the morning and I came down at like two in the morning to walk Portillo on this one. I lived right by the ferry building. And I came down in the high rise and came out and I turned the corner and I turned the corner and it was just cops all the way down. And they had like six guys pressed up against the glass of the post office with like their spotlights off their cars on them and people with guns drawn me and Portillo like all right. And we 360 back.",
      "start": 2527.82
    },
    {
      "text": "they had like six guys pressed up against the glass of the post office with like their spotlights off their cars on them and people with guns drawn me and Portillo like all right. And we 360 back. And I went upstairs and I went on to the I was like well somebody's got it broken into coverage. Like this is like there was helicopters and shit. I'm like what is going on? And there was nothing there. I went on the internet nobody like you know SFGate didn't have an article on or breaking or anything like that. And then I was like wait a second. I opened up Twitter and I put in like yeah my vague location of like ferry building shooting cops. And it was like and there was all these there's been a shooting at sin bad this many people are hurt data. You know it's like fuck like this is so much more than the time wasting bullshit device. I thought it was where I was sitting around and being like wow video games and wings you know what I mean? I was like Oh like",
      "start": 2565.42
    },
    {
      "text": "like this is so much more than the time wasting bullshit device. I thought it was where I was sitting around and being like wow video games and wings you know what I mean? I was like Oh like this is like now when something happens that's where you go. And it still is for me. Like you know some like today a guy a kid tweeted at us and was like just wanted you to know that DMX is like on death's door. And I was like what? They put DMX in the search and I get the TMZ article and all the thing. I'm like all right you know what I mean? Like it's a in the moment Google Google's great at doing wrong. And you can do it on Google as well obviously but it's more like all right this and then what's happened last hour the new yeah. Whereas this also then the downside of course that it doesn't need to be verified. So rumors can spread like nothing but exactly. You jump in there and there is that moment of like this is what's happening. And now you know like it's",
      "start": 2597.7
    },
    {
      "text": "course that it doesn't need to be verified. So rumors can spread like nothing but exactly. You jump in there and there is that moment of like this is what's happening. And now you know like it's all I feel like 90% of the news that I can like big big news stories that have happened in recent years right. Or broken to me by Twitter you're scrolling and somebody's dead. This has happened. This you know what I mean? The holy shit. Yeah. It's cool. Little device. I love it. I love it so much. I don't think any of them are safe. I don't think even Facebook or Twitter are safe forever. I do think that there will be something at some point. Facebook's the weird one for me where I I I you know for me I I I gambled wrong where Missouri got into Facebook super early. I don't know what year but right around the time Colin's describing because I graduate in oh five right. But I remember and maybe it was oh four maybe it was oh three when Facebook and maybe it was even younger",
      "start": 2630.58
    },
    {
      "text": "year but right around the time Colin's describing because I graduate in oh five right. But I remember and maybe it was oh four maybe it was oh three when Facebook and maybe it was even younger than that. But I remember the the my friends Parker and Booth who were a year below me they got in and they were into Facebook huge. They were all over Facebook. And I was like and they're like you should make a Facebook account. I'm like that's a young kid's game. I'm not going to do that. I'm a senior. I'm gradually I'm going to be graduating here. That's what all you young kids are doing. You know what I mean? I'm not going to do it. And I didn't do it forever and ever and ever. And it was a similar story of I graduated and went to work at the newspaper. And there was a scandal about this. There was a couple of scandals I guess you'd say that broke through Facebook of like kids in college who were doing dumb shit and posting photos of it. Right. And so there was like two or",
      "start": 2665.94
    },
    {
      "text": "this. There was a couple of scandals I guess you'd say that broke through Facebook of like kids in college who were doing dumb shit and posting photos of it. Right. And so there was like two or three times where I had to call my girlfriend at the time and ask her for her Facebook login to log in to get to see stuff. Cause like there was a time like one of the baseball players was you know suspended from the team and cause he'd done this that or the other. And there was like a you know the cops had arrested him whatever. And like everyone's trying to contact him for a story. And I was like wait a second. I called the girlfriend got it got his got his phone over office Facebook page and call them got the comment. You know what I mean? It was like that thing of like shit there's really utility to this thing that I thought again it was just like dumb kids putting up photos or videos and then playing beer pong or whatever. When in reality it's like you can use this in so",
      "start": 2701.82
    },
    {
      "text": "really utility to this thing that I thought again it was just like dumb kids putting up photos or videos and then playing beer pong or whatever. When in reality it's like you can use this in so many different levels. Yeah. I mean even to this day again we are so in this world where Facebook's kind of like a thing that we don't use anymore but Facebook is in every age group on every platform the most used every single day. Yeah. And it also it's the it more so than Twitter is the place people get news right? Like everything you're just saying. That's what people use Facebook for. And I know and that's the weird thing of like I didn't it's one of those where I had moved away from Facebook or I got so I make the Facebook page back then you know what I mean? Use it fine. Come to IGN we start getting popular. I accept all the fans from beyond on it right? And it gets all fucked up. So I convert it to a fan page and then eventually make a secondary page you know blah",
      "start": 2737.38
    },
    {
      "text": "to IGN we start getting popular. I accept all the fans from beyond on it, right? And it gets all fucked up. So I convert it to a fan page and then eventually make a secondary page, you know, blah, blah, blah. And so now I don't use it correctly anymore really at all. I just pop in once in a while, but no, what you're talking about is like, I'll be on the phone with my mom for the calls that I don't give her enough. And she'll be like, Oh my God, did you see this? Did you see that John had this? And like, she's talking about my high school friends that I have, you know, I'm so close with. And I'm like, no, did you go to dinner with them? She's like, no, it's all on Facebook. Oh, like my Facebook is still totally fucked. And it's just like notifications for people. I don't know. No, it gets hard to use, especially when there's the page versus the profile whole thing pages. Like it just, there's a lot of stuff that they don't do correctly, but there is a lot of shit that they fucking",
      "start": 2769.82
    },
    {
      "text": "hard to use, especially when there's the page versus the profile whole thing pages. Like it just, there's a lot of stuff that they don't do correctly, but there is a lot of shit that they fucking nail. And I think video, video is the other huge thing for them now that they have that that's a game changer. They need to figure out the Content ID. They need to figure all this stuff, but I mean, they're getting more views than YouTube. Whoever would have thought that'd be a video platform that gets more views than YouTube per month. Like that's insane. I got to take the time because I see Colin on it all the time. Colin lives on Facebook and I look at him like, I got to get, I got to get back on the horse here at some point, figure out what the fuck I'm doing with it. Yeah. I mean, I, I, every single day I comment in the Kinda Funny Facebook Group every day before I go to sleep. I just kind of look through shit and I just like fuck all of you. Yeah. That's just a good way. It's just a",
      "start": 2801.66
    },
    {
      "text": "single day I comment in the Kinda Funny Facebook Group every day before I go to sleep. I just kind of look through shit and I just like fuck all of you. Yeah. That's just a good way. It's just a good thing to use. Like Facebook's interesting in the sense that it does have like great reach. Like it's, it's, it's similar to Google in the sense that it just, it's so ubiquitous that it really will be impossible almost to displace it. Like I, I, I do think, I, I think with great confidence, Facebook will literally exist in 50 years. Like I just can't imagine that it's just too big. You know, it's too much, too big people. It's too much. It's too part of the way people do things. It's very similar to Google, like or an Alphabet, like and a lot of Alphabet's properties where it's just like, it's, it's not going anywhere. Yeah. But I think Twitter is somewhere in the middle where I don't think it's going anywhere, but I think it's, I think it's got to change and got to figure out a way to my, I",
      "start": 2833.42
    },
    {
      "text": "not going anywhere. Yeah. But I think Twitter is somewhere in the middle where I don't think it's going anywhere, but I think it's, I think it's got to change and got to figure out a way to my, I wouldn't be surprised if I'm trying to see Twitter got scaled back. You're going to hear about layoffs, this, you know what I mean? But then again, I just don't, I think it's also there at times maybe overthinking what Twitter needs to be, you know what I mean? Where it could just be what it is now in grant. I don't know if that lasts. I'm not web developer. I don't know that kind of stuff. Yeah. Cause we've talked to people at Twitter and they, some of the stuff they're talking about, what they're going to be doing in the next six months to a year. Like, Ooh, that's all this fucking cool. You're really cool and awesome. And I think that they're focused on things like Vine and Periscope and, and Medium and stuff like that. It's, that's how you expand the use of Twitter. It's give people apps",
      "start": 2869.7
    },
    {
      "text": "really cool and awesome. And I think that they're focused on things like Vine and Periscope and, and Medium and stuff like that. It's, that's how you expand the use of Twitter. It's give people apps to use within the app and you can go really far with that. I think that their biggest problem is getting the people that aren't on Twitter on Twitter, the people that are there loving, they're going to be there, but the people that aren't, the millions and millions and millions of people that aren't, that could be, you know, that they're on Instagram, they're on Facebook. Why aren't they here? And it's just not for them. Yeah. And or kids, kids growing up aren't on Twitter. Like that's just the thing. Like the, if you're looking at people like they're on Instagram, 16, 16 and younger. Yeah. It's Snapchat, it's Instagram and it's Facebook, but they're not on Twitter. Interesting. So young kids get on Twitter and follow GameOverGreggy next topic is mine and it's a walk, but I want to talk",
      "start": 2900.06
    },
    {
      "text": "Snapchat, it's Instagram and it's Facebook, but they're not on Twitter. Interesting. So young kids get on Twitter and follow GameOverGreggy next topic is mine and it's a walk, but I want to talk about forgiveness and I don't mean me forgiven Tim for being a jerk to me. I don't mean Colin forgiven me for always being mean to him. I don't mean Kevin forgiving us for all the things we say about him. I want to talk, what's wrong with you today? Kev, is it the DayQuil? Did the DayQuil ever, are you having an adverse reaction to the DayQuil? Something's wrong with him, Tim. You need to get to the bottom of this cause I'm not going to. That's the get asking him to get coffee. Isn't going to help you inside. I don't know, giving him tasks. I want to talk about forgiveness in the public eye and I'll tell you where it stems from and then I'll give you multiple examples of this, but the main example I'm going to use here is Mike Tyson. I was watching Vine compilations last night and I ran",
      "start": 2936.06
    },
    {
      "text": "and I'll tell you where it stems from and then I'll give you multiple examples of this, but the main example I'm going to use here is Mike Tyson. I was watching Vine compilations last night and I ran into one where he was, and I showed it to you guys before the show, getting interviewed in Canada and the guy is asking all these different questions, talking about a lot and then he talked, I guess he was there stumping for the mayor or some shit like that or he endorsed the mayor or something or this mayoral candidate and the guy's basically like, well, you know, some people are saying that because you're a convicted rapist, like this is, you know, against the, you know, this is going to work against him or whatever. And Mike Tyson loses his shit and calls him a piece of shit and all this stuff. You know what I mean? And like he says, a rat piece of shit, but that's the second one. The first one is just your real piece of shit or whatever. But like it brings up this interesting thing",
      "start": 2978.66
    },
    {
      "text": "stuff. You know what I mean? And like he says, a rat piece of shit, but that's the second one. The first one is just your real piece of shit or whatever. But like it brings up this interesting thing for me. And the other example, and this is a, this is an interesting one, I guess is O.J. Simpson. And now what I'm talking about here with is forgiveness, I guess, in the legal sense, Mike Tyson is a convicted rapist that happened, you know, if you want to argue, maybe it wasn't, maybe there was, he is in the core, in the eye of the law, convicted rapist, right? O.J. Simpson, innocent, found innocent, but everyone still believes he's guilty and all these different things. Right. And I remember this interview O.J. Simpson did, I want to stay on 0 0, but it was, I forget what it was and it was after the fact. And I remember he was walking, talking to some reporter, right? And this woman came up to him and was like, I just always want to shake your hand. I was wondering if I could shake your",
      "start": 3017.14
    },
    {
      "text": "the fact. And I remember he was walking, talking to some reporter, right? And this woman came up to him and was like, I just always want to shake your hand. I was wondering if I could shake your hand. He's like, sure, of course. And he shakes her hand and she just goes, thanks. I've always wanted to shake the hand of a murderer and walked away. And like, and like O.J. Simpson's just like, and the guy's like, what does that feel like? You know what I mean? And so like, my question here to go away from, you know, O.J. innocent, everybody believes he's guilty. Right. And I feel like that's a foregone conclusion. I think, I feel like people talk about it all the time that that's just what it is. You know what I mean? Swing back to Mike Tyson though, guilty. You know what I mean? Legally found guilty or whatever does his time. But is that enough? Is he then forgiven? He was, I've watched the 30 for 30. Fantastic. Of course, Chasing Tyson, right. Was the one a fantastic documentary, but covers",
      "start": 3055.76
    },
    {
      "text": "or whatever does his time. But is that enough? Is he then forgiven? He was, I've watched the 30 for 30. Fantastic. Of course, Chasing Tyson, right. Was the one a fantastic documentary, but covers, you know, goes to jail, comes back and it's a fucking event. Everybody's so fucking thrilled. He's back. He's, you know, we're, we're going to promote this. We're gonna do this. You know what I mean? You jumped to now awesome in the Hangover movies, did the pigeon show, did all these, everything's he was. He, I interviewed him on a, a IGN Comic-Con, right? For his animated show. I, and I granted my limited interaction with Mike Tyson interviewing him, seeing his, his breath of work, the Mike Tyson of today. I like, should I feel bad about liking Mike Tyson today? Cause, and this is, this also goes, I think it's like Michael Vick, Michael Vick convicted. He, you fuck these dogs died. You know what I mean? Like you ran a dog fighting ring, does his time, comes out, goes back to work. Yeah. And",
      "start": 3092.66
    },
    {
      "text": "I think it's like Michael Vick, Michael Vick convicted. He, you fuck these dogs died. You know what I mean? Like you ran a dog fighting ring, does his time, comes out, goes back to work. Yeah. And there's still that thing of like, am I allowed to be a Michael Vick fan? You know what I mean? And then, so like, I don't, I don't, I feel like are there some things that are not forgivable? You know what I mean? Like my, I was reading through Tyson's Wikipedia page, right? About all this just to make sure I had my facts right. He's convicted of rape. Right. So now he's a registered sex offender, right? So he has to report in like that now in the same vein, right? Like, if you're a pedophile and you're released and you have to report in and walk around and do all the Amber Law kind of stuff, like people aren't like, Oh cool. You did that 0 years ago. No big deal, right? You still have like the Scarlet Letter on you. Whereas like Mike Tyson is making a cartoon for a Cartoon Network. You know what",
      "start": 3137.0
    },
    {
      "text": "aren't like, Oh cool. You did that 0 years ago. No big deal, right? You still have like the Scarlet Letter on you. Whereas like Mike Tyson is making a cartoon for a Cartoon Network. You know what I mean? Like it's this weird thing. And I know double standards and a million things, but it's just fascinating. I think that forgiveness is not something that is earned through legal means. I think that, you know, when it comes to, he did his time. Does that mean he's forgiven? No, not at all. I think he did his time because that's his punishment. Sure. Him having sex offender as, you know, something that'll live with him forever. That's his punishment. Forgiveness is something totally unrelated. That's right. I think that everybody can be forgiven for whatever they do. I don't know how and I think it's all, you know, not everyone's going to forgive. It's a case by case basis, but I think that you also, this goes to even things that aren't necessarily forgiving, but it's like when you like",
      "start": 3174.6
    },
    {
      "text": "it's all, you know, not everyone's going to forgive. It's a case by case basis, but I think that you also, this goes to even things that aren't necessarily forgiving, but it's like when you like someone's music and we've talked about this before, you like their music, but you don't like their choices. You know what I mean? Like Kanye West is an example, right? Like you can be a fan of his music and not like him as a person, but can you like, how do you separate that? I mean, to that example is like, I agree with what you're saying there, right? Kanye spikes the camera and does all this shit and is like, he's, I don't know. I'm not super well read in Kanye, you know what I mean? But from what it is like, you know, like George Bush doesn't like black people. It's like, all right, you're, you're crazy. And you call the guy out on Twitter. So not like crazy, crazy, but you call, you know, you do all these crazy things or whatever. Right. But yeah, your music's cool. And like, whatever you",
      "start": 3214.84
    },
    {
      "text": "crazy. And you call the guy out on Twitter. So not like crazy, crazy, but you call, you know, you do all these crazy things or whatever. Right. But yeah, your music's cool. And like, whatever you were nice to Tim and Alfredo that one time you met him outside of Jamba Juice or whatever. Cool. Flip side of that, like Chris Brown. I'm like, no, thank you, sir. I don't, I, and I know very little about Chris Brown, the musician. Like I don't, I couldn't name you a Chris Brown song right now, but I've heard songs obviously were like that. But it's like, you go through all this Rihanna shit and I'm like, why do people keep fucking buying? You know what I mean? Like, why isn't something happening to you if that makes sense? And you know, why isn't there more of a public outcry? I mean, there is, I mean, there is still successful, but, but see, and then that goes back to the Mike Tyson thing of just, it's hard to separate, but it's like, that stuff doesn't change the fact that they're",
      "start": 3252.04
    },
    {
      "text": "is, I mean, there is still successful, but, but see, and then that goes back to the Mike Tyson thing of just, it's hard to separate, but it's like, that stuff doesn't change the fact that they're talented, um, and they're musicians or athletes or this or that. And that's an individual thing. Some people are going to forgive and some people aren't. And you never going to get full forgiveness from everybody. And like Chris Brown's never just going to be like people like you again overall. But I mean, guess what? There's still enough people that either don't care or, um, don't know enough or just like the music and can separate it. I don't know. It's, it gets really complicated with all that. I think that with, uh, with, um, Tyson, it's what he did horrible, inexcusable. And all of that is like, it's literally the worst. Yeah. But he knows that, you know, and it's like, so if we're not going to eventually forgive him when he's trying to be forgiven and he is trying his best to be good",
      "start": 3283.4
    },
    {
      "text": "like, it's literally the worst. Yeah. But he knows that, you know, and it's like, so if we're not going to eventually forgive him when he's trying to be forgiven and he is trying his best to be good and like trying to like, you know, admit what he did was wrong and move past it and do all that type of stuff, then why didn't we just kill him? You get what I'm saying? And I know that that's super extreme. No, no, I understand what you're doing. You're running into an extreme. Yeah. Like if, why we got to give people not the benefit of the doubt. This gets complicated because what they did is wrong and they deserve the punishment and they don't deserve everyone to be like, it's okay. Right. But they don't, they also don't deserve just being completely shut out of like, you are a rapist, period. It's like, and it's not to say you were a rapist, but I mean, that's really kind of what it is. It's like, if you change, people can change at any moment. People can change anybody. So you need to",
      "start": 3329.4
    },
    {
      "text": "It's like, and it's not to say you were a rapist, but I mean, that's really kind of what it is. It's like, if you change, people can change at any moment. People can change anybody. So you need to be at least open to that. And I think that it's, it's really about transparency. We've all made mistakes. We've all done fucked up things or stupid things or wrong things or whatever and apologized. And I think the more transparent and open and, and you know, just kind of real about who you want to be. I think that's kind of the key thing. It's who you are is different than who you were. And it's different than who you want to be and who you're trying to be. And I think that you got to help people try to be the person they want to be. No, you're making good points. Like, and that's just the weird thing of it though. So, I mean like to the example, to the even continue with Mike Tyson, like with any, you know, goes and bites off the guy's ear. You know what I mean? And like, these feel like",
      "start": 3376.12
    },
    {
      "text": "thing of it though. So, I mean like to the example, to the even continue with Mike Tyson, like with any, you know, goes and bites off the guy's ear. You know what I mean? And like, these feel like, why, why do we continue to get, but like, it's something about, there's two sides to Tyson. I feel like, you know what I mean? And I like, even like we watched another interview when we're going through the YouTube thing of like him getting interviewed by the British guy or whatever. And he's like, well, yeah, I guess I have changed because I'm not like attacking you right now. You know what I mean? These things have changed me. It's this weird thing of like the guy you see in the ring or the guy you hear these stories about like, and then when he talks about it like that, I guess that's the thing is like when I hear Mike Tyson tell his story, how he grew up, what he went through, you know, I've watched his documentaries or whatever and stuff like you feel for him. Not that that justifies",
      "start": 3415.96
    },
    {
      "text": "is like when I hear Mike Tyson tell his story, how he grew up, what he went through, you know, I've watched his documentaries or whatever and stuff like you feel for him. Not that that justifies anything he's ever done. Right. But it makes me want him to succeed. I want him to come out on the other side and be the guy in the Hangover and be this, you know, normal guy who finally gets a break or whatever. Finally gets a break after being a fucking world-class superstar who had all this stuff. You know, it's weird to talk about. I don't know. You know what I mean? And then it's the other thing of just like, so what does that mean for O.J. Simpson? You know what I mean? Like what is he supposed to apologize for? What is he supposed to do? O.J. Simpson fucked up later though. Even if he didn't. Right. No. Yeah. When he wanted his trophy back, just like it'll happen to me with my Trending Gamer of the Year. So the, the, the, I've looked at it and I'm not speaking about anything specifically",
      "start": 3455.16
    },
    {
      "text": "Right. No. Yeah. When he wanted his trophy back, just like it'll happen to me with my Trending Gamer of the Year. So the, the, the, I've looked at it and I'm not speaking about anything specifically, but I've looked at it this way. Like I've talked about this. This has been kind of part of the political conversation for a while, the cycle, because of the way felons are treated, the way our prisons work. Generally, we have more people in prison than any country in the world. And that's not per capita. That's actually literally more people in prison than any country in the world. And we only have 4% of the population. There are countries with over a billion people in them that have fewer people in prison, including a totalitarian communist dictatorship that, that in prisons political enemies has fewer people in prison than the United States. So we have a big problem in the United States with the way we label certain people. And I'm not talking about murderers or rapists or anything like",
      "start": 3487.32
    },
    {
      "text": "has fewer people in prison than the United States. So we have a big problem in the United States with the way we label certain people. And I'm not talking about murderers or rapists or anything like that. That's like, that's a class of criminal. We can all agree or pieces of shit generally. I mean, you know, not generally, I mean, you are a piece of shit. But we make it really difficult for felons in for a drug offense or in for, I don't know, like things that aren't violent. And I think violent crimes, you know, they should be punished. I think that nonviolent crime should be punished too. But someone buys, someone sells a Coke and they go to prison for 5 years, which is frankly ridiculous. And then they get out and they're a felon and they can't get a job because they're a felon. And that's why this whole movement of like, let's get rid of that whole checkbox. Like it's, it doesn't matter. You know, like, because my whole argument is this, it goes to what Tim was saying about, you",
      "start": 3522.12
    },
    {
      "text": "why this whole movement of like, let's get rid of that whole checkbox. Like it's, it doesn't matter. You know, like, because my whole argument is this, it goes to what Tim was saying about, you know, doing your time. If we as a society say you, this is what we mandate our justice system to, to, to punish you with for crime X, and then we let you out, then certainly we can't keep you down forever. Like it, like otherwise to Tim's points, like why not just incarcerate them forever? You know, or execute. So like there, there is a weird imbalance between the way we look at the criminal justice system and it's like you 0 to 5 years, but then you get out and it's like, you're doing another 0 to 5 years because you can't get a good job. Then you're in poverty, then you're committing more crimes. Then like, it's, it's, it's a vicious cycle in perpetuity. But I also am, and we did a conversation with Colin about this, a firm believer in the death penalty and that there are crimes so",
      "start": 3565.8
    },
    {
      "text": "crimes. Then like, it's, it's, it's a vicious cycle in perpetuity. But I also am, and we did a conversation with Colin about this, a firm believer in the death penalty and that there are crimes so serious that society should never forgive them. And maybe Mike Tyson's one of those guys. I don't know. I don't know the details of like his crime, but if you're a rapist, you're a piece of shit. You know what I mean? And so like for me, it's, it does Mike Tyson deserve forgiveness? No. Yeah. There are crimes so heinous that this, the system might've forgiven him and he might've gotten out and there might be people that have forgiven him and that's their prerogative. But I would certainly never look at someone like that on a human to human level, even if they've gotten better and if they improved and be like, well, you know, you're on the up and up now. Yeah. So what does that mean to you when he's in a movie or something? Do you care? Can you enjoy that? Can you check that at the side? I",
      "start": 3606.76
    },
    {
      "text": "and be like, well, you know, you're on the up and up now. Yeah. So what does that mean to you when he's in a movie or something? Do you care? Can you enjoy that? Can you check that at the side? I guess it's like, you know, there's two ways of looking at it. Like O.J. Simpson before the crimes against his wife and, and, uh, yeah. And Goldman and before, you know, we met great people like Cato Kaelin. Um, remember Cato Kaelin? Yeah, I do. She's the weirdest story ever. It's so weird. Um, you know, he was in like Naked Gun, which is like one of my favorite movie series. And you look back on it now and you're like, shit, like, does this ruin it now? Or some people look at Orson Scott Card, who's a great writer. Who's like hyper conservative, anti-gay marriage and all this kind of stuff. But people love it. He wrote Ender's Game and then people have a really hard time. Like, you know, like some people are, you know, Shadow Complex and all that kind of stuff. Like some people are like, some",
      "start": 3650.2
    },
    {
      "text": "love it. He wrote Ender's Game and then people have a really hard time. Like, you know, like some people are, you know, Shadow Complex and all that kind of stuff. Like some people are like, some people wouldn't buy Shadow Complex because on Xbox Live because of his stance on gay marriage, that is their prerogative. So, and he's not committing a crime per se either. What I'm saying is that there's like different optics in which you like can view the way a person feels or what they do. And it's up to you to forgive them or not, or look past their transgressions or not. I think you have to take that on a case by case basis. But I do think that there's a, they, they problem on both extremes in the systemic way we, we incarcerate, the way we try people. Um, because I do have an issue with drug offenders for instance, being stigmatized the same way a rape is to stigmatize. And I have a problem with, um, a murderer getting out of prison after 0 years, you know, when probably they should have",
      "start": 3689.0
    },
    {
      "text": "for instance being stigmatized the same way a rape is to stigmatize. And I have a problem with um a murderer getting out of prison after 0 years you know when probably they should have been executed. So it's it's like I think that there are crimes so extreme that society shouldn't even want them back but that's not every crime or even most crimes. Um it's a handful of crimes and it's those people you have to really look at and be like this is our society. Is it is it safer without them? Is it pure without them? Um and you know is there a level of forgiveness for the things people do? Yeah sure. It's just that there's a levels of there's degrees you know? And I can't it's hard for me to think of a crime worse than rape. Rape to me is almost is pretty much worse than murder in many ways you know or just as bad. You certainly killed a part of that person you did that to you know? And so does Mike Tyson deserve forgiveness? No. Would I if I was a uh the family of",
      "start": 3718.92
    },
    {
      "text": "in many ways you know or just as bad. You certainly killed a part of that person you did that to you know? And so does Mike Tyson deserve forgiveness? No. Would I if I was a uh the family of this woman he did this too. Would I forgive him ever? That's the thing that that's when it starts getting hard for me to like wrap you know what I mean? Like so the woman he assaulted sees him all the time being super successful and having TV shows and having documentaries and having this movie and it's like that's hard for me to justify the word deserve I think is the key thing. He doesn't deserve it. He never will but I think that he you know should be able to get it whether or not he deserves it. You know what you're saying? There's something about that that's really interesting to me where I on two ends of the extremes I kind of contradict myself because on one hand it's like you're talking about the these people have the stigma forever after they leave. I think that's",
      "start": 3762.84
    },
    {
      "text": "to me where I on two ends of the extremes I kind of contradict myself because on one hand it's like you're talking about the these people have the stigma forever after they leave. I think that's necessary. Like there there needs to be that stigma that this doesn't go away. This stays with you because um or else it just looks like a payment. It's like I can kill this person for five years in prison. You know what I mean? It's a transaction. But the point is is that if you kill someone that's such an extreme thing that you should never get out of prison. Yeah. Okay. And yeah so that's that's what it's like manslaughter or something. But then the other the other side of that is and man this sucks that unfortunately like people very close to my life like I've experienced different things that all relate to this but my brother for example is fucked because he has stupid felony shit for dumb things dumbest things that it's like little little fights you know or graffiti",
      "start": 3801.08
    },
    {
      "text": "things that all relate to this but my brother for example is fucked because he has stupid felony shit for dumb things dumbest things that it's like little little fights you know or graffiti stuff. And he's fucked. It's so hard for him to get jobs because people look at him like he's a rapist you know? And that's what I'm saying. That's why it's like I'm not talking about the most extreme of criminals that like probably should never be given employment because they probably should never be allowed out of prison. Um but I am talking about people maybe like your brother that make mistakes or like you know have like felony drug charges for buying like who cares? And then because then it perpetuates a criminal justice system that just keeps people committing crimes because they cannot provide for themselves. Like you can't blame a person you can and you should blame a person on a technicality for being like for going in a store and stealing food or something like that. But",
      "start": 3841.48
    },
    {
      "text": "provide for themselves. Like you can't blame a person you can and you should blame a person on a technicality for being like for going in a store and stealing food or something like that. But if that person went to prison because he had a heroin charge for buying or having a little bit of heroin on him and then he just can't get a job like what is he really supposed to do? I mean this is like this is this is like what it really does come down to at the end of the day is like is a is a disparity in the criminal justice system and the way we treat kind of all criminals equally. And that's kind of what I'm saying is that most people I I've talked about this if you you could probably let half of the people in prison go without any problem in the United States. Like and maybe we should like a lot of them are there for fucking no reason you know for petty drug crimes for little scuffles and shit like that. I'm not saying that you shouldn't pay the crime or you shouldn't have",
      "start": 3881.72
    },
    {
      "text": "like a lot of them are there for fucking no reason you know for petty drug crimes for little scuffles and shit like that. I'm not saying that you shouldn't pay the crime or you shouldn't have a civil suit or anything like that. I'm not saying doing drugs is okay or good. I'm just saying is that do we really need to lump these people in with the fucking hardened murderers and the rapists and the and these fucking devious people that are on another level that don't deserve society's forgiveness? How Mike Tyson even got out of prison so quickly is fucking beyond my comprehension you know for that crime. But like Mike Tyson should still be in prison you know like based on like based on rape charges. Yeah. See then the problem with the other extreme of that though is the whole thing of like all right so the murderer rape and I know we're taking this into a different territory now and we're talking about like they might as well die or whatever but it's like that's hard",
      "start": 3914.28
    },
    {
      "text": "of like all right so the murderer rape and I know we're taking this into a different territory now and we're talking about like they might as well die or whatever but it's like that's hard because another perfect example for me is one of my best friends in my entire life that I've ever known is not one of my best friends anymore because his life was fundamentally changed because in high school some girl said that he raped her and he was like what the fuck? I'll never forget when this happened because we were all like there's no way they're like this this doesn't even add up. There's absolutely no way. But because of how things work and just because the you know it's you're you're guilty until proven innocent with that type of shit. And I'm not trying to say that like the whole way things so complicated because people need to be able to feel like they can come forward and you know put like be able to freely communicate that these things are happening. And not have",
      "start": 3953.88
    },
    {
      "text": "whole way things so complicated because people need to be able to feel like they can come forward and you know put like be able to freely communicate that these things are happening. And not have everyone be like what were you asking for? Yeah. Make them feel even more victimized. That's horrible. But in the case of my friend man like he got like put down he got expelled from the school he was at. He got in jail. Like there was this whole fucking thing and years there was so many court fights so much money put into it. And like two years down the line she's just she just admits like she made it up all in her head. Like she felt bullied and didn't know how to handle whatever he is. He is fucked like fucked. Cause that's his Google search because because of all that. Yeah. There's fucking cases about all this shit everywhere. And he doesn't have a felony or anything. Like he was absolved of that but then he lost a shit ton of money and he changed as a person because he",
      "start": 3991.0
    },
    {
      "text": "fucking cases about all this shit everywhere. And he doesn't have a felony or anything. Like he was absolved of that but then he lost a shit ton of money and he changed as a person because he started questioning himself. Well he was like well shit. Like what's the point of living? If this can happen to me where I did I did nothing and I am now labeled a rapist you know? You know he started like just he he changed he fundamentally changed as a person and it's like it's that type of shit where it's like man like I don't know how to solve that situation you know but that should happen. And it's like he would have died if rapists got killed. You get what I'm saying? Well did he get convicted? Yeah. You would have got him convicted for it. But the I don't remember how it all went but like he he would definitely he was in jail for I think he was in jail as being held. Yeah. Okay. And he post bond. Sure. Like he he turned your drugs. Yeah. I mean it it just and that's",
      "start": 4037.72
    },
    {
      "text": "but like he he would definitely he was in jail for I think he was in jail as being held. Yeah. Okay. And he post bond. Sure. Like he he turned your drugs. Yeah. I mean it it just and that's the thing like that's the most ironic thing is it's like this shit made things bad. Yeah. And I'm not saying that we should throw the baby out with the bathwater and just throw like everyone in the same pool. You have to have levels of degrees and talk about what the highest penalty can be which is the death penalty which is which in most of the world and we have a lot of international listeners most of the world is just not something that happens anymore but in the United States it is part of the way we do things in most States. But is it the answer? I don't I don't know. To me to me I don't cause a lot of people look at the death penalty as something that's like well people are like well it's more expensive the death penalty than than keeping them in prison. And I'm like",
      "start": 4077.96
    },
    {
      "text": "I don't cause a lot of people look at the death penalty as something that's like well people are like well it's more expensive the death penalty than than keeping them in prison. And I'm like I don't care. You know like that's not why I'm that's not why I'm doing it. And they're like well it's not a deterrent. And I'm like I don't care. The question is is this a person fit to be in society ever again? And if not then like what and I'm not saying you do this for a person who's just a piece of shit in prison. I'm saying like the hardened fucking serial murderers the serial rapists the people that like just commit crimes that are fucking blatant about it that admit it that are proud of it. What we have some sort of principle argument against dealing with them. Like I just I that that to me doesn't like make any sense as a society. There's no shame in it you know but you have to make sure you get it right. I mean that's that's the big thing. And that's why I",
      "start": 4120.28
    },
    {
      "text": "I that that to me doesn't like make any sense as a society. There's no shame in it you know but you have to make sure you get it right. I mean that's that's the big thing. And that's why I think it's a whole I have this whole idea. We talked about it a little bit on Conversation with Colin where I'm like you'd I'd have a I'd engineer a second trial with you know looking at the evidence with a separate jury that would you know you're already convicted but now they're going to look at how you're punished instead of a judge handing it down. So like that would be a very serious and very very systemic way of looking at things. And the juries are probably get hung a lot because so many people are just fundamentally against the death penalty. So in a death penalty trial you'd then sentence the jury to being hung to death. Yeah. The jury would get hung. You guys can't come up with an answer. You'd die. But but yeah so this is a great question because I don't forgiveness",
      "start": 4152.04
    },
    {
      "text": "then sentence the jury to being hung to death. Yeah. The jury would get hung. You guys can't come up with an answer. You'd die. But but yeah so this is a great question because I don't forgiveness is going way away from the criminal justice system and just to your everyday life you have to just it's just the same thing. You have to look at it in a case by case basis. There are people that have done things to me that I will never forgive you know and there are people that have done heinous things to me that I never thought I would forgive that I don't even care about anymore. And so you have to just take it on a case by case basis. The fact of the matter is there's two ways of looking at Mike Tyson. One is that we don't really know Mike Tyson but we know what Mike Tyson has done. And there's no shame in judging him for that because that's not part of civilized society not even close. That's not even part of an uncivilized society to do something like that to someone. And I",
      "start": 4182.84
    },
    {
      "text": "And there's no shame in judging him for that because that's not part of civilized society not even close. That's not even part of an uncivilized society to do something like that to someone. And I don't think there's any any you know but clearly I must be in the minority because he's getting his you know he's broke but like he's still getting his deals and still living some sort of life. I mean he doesn't have he should have hundreds of millions dollars but he was an idiot you know with his money when when Don King was representing him and all that kind of stuff. I mean he had and when he got out and he fought Evander Holyfield he should have he was flush with money and he wasted it. I mean he had tens and tens and tens of millions of dollars at least. And way more than that probably. Michael Vick is a different story. I mean Michael Vick played for the Jets. And so this was a question that our fan base had to ask ourselves but what might like and I'm not I'm",
      "start": 4227.56
    },
    {
      "text": "that probably. Michael Vick is a different story. I mean Michael Vick played for the Jets. And so this was a question that our fan base had to ask ourselves but what might like and I'm not I'm not diminishing what Michael Vick did. What Michael Vick did was heinous but what Michael Vick did and what Mike Tyson did two totally separate things. You know Mike Vick to me is is deserved deserves forgiveness. You know he what Mike Tyson did is 50 times worse. I like I like I don't I don't maybe not 50 times worse but it's worse. I'm just saying I'm just saying that you know I'm just yeah I'm not forgiving what Mike Vick did. What Mike Vick did is disgusting. And Mike Vick did his time. And you don't have to like Mike Vick. There are a lot of people that don't there are a lot of Jets fans that used to really say shitty things about them all the time when they're playing. That's their prerogative but Mike Vick is able to get back in the way he can monetarily. You",
      "start": 4261.08
    },
    {
      "text": "a lot of Jets fans that used to really say shitty things about them all the time when they're playing. That's their prerogative but Mike Vick is able to get back in the way he can monetarily. You know he is you know gives funds to these these pet programs. I'm not saying that just removes the heinous thing he did at these these dog fights. And I I've still like a little disgusted by it when I think about it myself and I'm not even a dog lover. I don't think you'd be a dog lover to understand that like what he did is is not right but I don't put that on the same level that in other words there are degrees of crimes. And I just don't know that it gets any worse than like it's murder rape. And then like then like you come down to like all all of the other shit in my mind you know because that's like that's fucking serious. That's really fucking serious. And it's those types of people that commit those very what you might call capital crime that might not deserve",
      "start": 4302.28
    },
    {
      "text": "you know because that's like that's fucking serious. That's really fucking serious. And it's those types of people that commit those very what you might call capital crime that might not deserve society's forgiveness. And but that's not for me to decide because you're right. O.J. Simpson was clearly guilty like in my mind like as clear as the day is long. I've told the story. I was in sixth grade when he was when the trial was going on. I remember I was in Mr. Vincent's science class in sixth grade and the you know on the TV like the things were coming down. I remember him asking us like who thinks he's guilty? Who thinks he's not? And I was like I think he's guilty but he's good. It's going to be not guilty. I remember I was only one of two people in the class. I was like he's not guilty. Like it's not he's not guilty. It's clearly going to get off. And he got off for a you know presumably a series of you know technicalities and but that's the way the system works.",
      "start": 4343.32
    },
    {
      "text": "not guilty. Like it's not he's not guilty. It's clearly going to get off. And he got off for a you know presumably a series of you know technicalities and but that's the way the system works. And so through the eyes of the justice system he is innocent even though I think we all fucking know what happened you know but we can't prove it and you can't try them again. Double Jeopardy. So it is what it is but people still can that woman can still walk up to him in the street and say what she wants to. No no I know that. No that's the I'm not taking away her right to do it. It's just this weird thing of like we're talking about well you know Mike Vick give back to these programs and do all this stuff. But O.J. Simpson is just fucked. Yeah. I mean the system the different time system but just like the Hollywood system and stuff. That's why Mike Tyson will never not have jobs. You know what I mean? It's just people can make money off of him. And it's like whether or not",
      "start": 4380.92
    },
    {
      "text": "system but just like the Hollywood system and stuff. That's why Mike Tyson will never not have jobs. You know what I mean? It's just people can make money off of him. And it's like whether or not people are voting with their wallet because they don't support this and blah blah blah. They're people that will there's always going to be people that will. And when you have that level of fame people can make money off of you. People are going to make money off of you. And I think that's it's not about the are we forgiving him by watching his movies? It's people are forcing him to be in movies you know that we were whether or not we'd want to watch them like that almost doesn't matter because he will be there. You know Chris Brown is going to have music. Do we need to listen to it? No but people are going to like we can't stop everyone from listening to Chris Brown music. I'm not saying that you know you know what I mean? Cause my hope to go back all of this is like I you",
      "start": 4417.8
    },
    {
      "text": "No but people are going to like we can't stop everyone from listening to Chris Brown music. I'm not saying that you know you know what I mean? Cause my hope to go back all of this is like I you know I've read the Wikipedia. I knew about the rape charges. I knew about the Robin Givens stuff. I knew about the Evander Holyfield stuff but I still like Mike Tyson. You know what I mean? If it was like one of those clear your mind yes or no button things I'm going to hit yes. And then I'm going to think about it but I'm like huh is it okay to like Mike Tyson? You know what I mean? Like cause like and it's like you know he I was when I was leaving one of the filmings of Lip Sync Battle he was coming in for one. And so we passed each other at the airport. I was getting out of my cab as he was getting into his and everyone's like my chair but like he's like you know what I mean? It's just like this weird thing of like do people yell for O.J. Simpson when he you know what",
      "start": 4450.44
    },
    {
      "text": "cab as he was getting into his and everyone's like my chair but like he's like you know what I mean? It's just like this weird thing of like do people yell for O.J. Simpson when he you know what I mean? Like I don't I don't know. You know what I mean? Like I don't know what the right or wrong answers. Yeah. I don't think there are right or wrong answers. This is weird but what is wrong system is systemically is that with with Chris Brown with Mike Tyson with what's going on with Johnny Manziel right now what happened with Ray Rice what happened with all these people is that if they did these crimes and they were just normal people they'd be fucked. There'd be no conversation about getting back in the NFL or Johnny Manziel going to the Cowboys after you know beating his girlfriend apparently so bad that she can't hear out of her right ear anymore. You know if a normal person did that they'd be done. Right. And so there is but they have talent and they have exactly",
      "start": 4483.16
    },
    {
      "text": "apparently so bad that she can't hear out of her right ear anymore. You know if a normal person did that they'd be done. Right. And so there is but they have talent and they have exactly the same thing. Mike Tyson Mike Tyson went away for rape in the nineties and as a normal person then got out he'd be done. Right. And so there is an injustice to that as well. But that's not his fault. And that's not the justice system fault. That's society's fault because if society really did have a problem with Mike Tyson if society really did have a problem with Chris Brown or Mike Vick or any of these guys then they wouldn't have jobs. If if if if Woody Johnson on the Jets thought that there would be an uproar to sign Mike Vick he wouldn't have done it. And there was a little one but no one cared. Right. And I'm part of the problem. I was like great. We needed back or quarterback. I wasn't you know but so we have to put some of the blame on ourselves. No a hundred percent. Because",
      "start": 4518.68
    },
    {
      "text": "cared. Right. And I'm part of the problem. I was like great. We needed back or quarterback. I wasn't you know but so we have to put some of the blame on ourselves. No a hundred percent. Because if everyday guy applied to Kinda Funny and we saw that about him I'd be like I don't think so. I mean like that's the thing is like I like right now heaven forbid totally out of character for all four of you including Nick. If one of you guys raped somebody and went to jail for rape like I wouldn't want you back on the mic. I wouldn't want you in the room. I wouldn't want to talk with you ever again. Not ever again. You know what I mean? I don't know. Maybe ever again but not great. That's a different thing because we have an interpersonal relationship but if Mike Tyson saw this and was like I'd love to come on the show and talk. I'd be like yeah of course. Yeah. I'd love to talk to you about your career your life. And I guess these charges which of course you wouldn't want",
      "start": 4555.16
    },
    {
      "text": "was like I'd love to come on the show and talk. I'd be like yeah of course. Yeah. I'd love to talk to you about your career your life. And I guess these charges which of course you wouldn't want to talk about. They'll call you a fucking rat bastard or whatever. This topic was brought to you by Loot Crate. Loot Crate is a monthly subscription box service for epic geek and gamer items and pop culture gear. For less than $0 a month you get four to eight items that include licensed gear apparel collectibles unique one of a kind items and more. Make sure to head over to LootCrate.com/kindafunny. And there's the code Kinda Funny to save $3 on a new subscription. Loot Crate is more than just a subscription service. It's an entire community of fans that share their experience and interact with each other around the unboxing of each month's crate. And they guarantee more than $40 in value in every crate. Sometimes it's a lot more. Every month there's a different theme and",
      "start": 4590.28
    },
    {
      "text": "and interact with each other around the unboxing of each month's crate. And they guarantee more than $40 in value in every crate. Sometimes it's a lot more. Every month there's a different theme and all the items are carried around that theme. For February we've braved the dangers of Alexandria and bribe some mercs with chimichangas to bring you the finest loot this side of the afterlife. This month's theme is dead and reaches across genres to bring you five exclusives including a t-shirt and two figures to celebrate the new episodes of The Walking Dead in Deadpool's solo film debut. By the time this post I've seen Deadpool that's pretty fucking cool. Remember you only have until the 19th at 9 PM Pacific to subscribe and receive that month's crate. And when the cutoff happens Jack that's it. It's over. So go to LootCrate.com/kindafunny and enter the offer code Kinda Funny to save $3 on your new subscription today and The Walking Dead on Sunday. Yeah. The theme is pretty",
      "start": 4629.8
    },
    {
      "text": "it. It's over. So go to Loot Crate.com/KindaFunny and enter the offer code Kinda Funny to save $3 on your new subscription today and Walking Dead on Sunday. Yeah. The theme is pretty have you seen the leaked photo? Uh no. Oh don't look for it. Oh really? Yeah. Tim what's your topic? Oh man. You can't do that to me Greg. My topic is sleeping. Now I didn't have a topic today going in. So I was thinking I was like what do I want to talk about? Right. I was like I don't know. I was looking on Facebook scroll and do some stuff and all of a sudden it hit me of how much I want to be sleeping right now. I'm like that should be my topic. And you said this applied to your hair somehow. Yeah. I really like sleep. Sure. I like sleep. You know you guys know me you all know me. There's a couple of things Tim Gettys' like I like soda. Yeah. You like Coke. I like eating out in all senses of the word. I like that's pretty much it. And I like sleep. All right. So so here's my",
      "start": 4669.0
    },
    {
      "text": "a couple of things Tim Gettys' like I like soda. Yeah. You like Coke. I like eating out in all senses of the word. I like that's pretty much it. And I like sleep. All right. So so here's my Nintendo your Pokémon. I like a lot of stuff. Right. But I really like sleep and I think sleep kind of overcomes everything really. Like I enjoy food. Hunger is definitely you know an emotion to me of just you know I need to feed it's hunger. Yeah. But when it comes to sleep it's like I could sleep forever. You know there's people that are like you know if you sleep too much you're like you're just too it makes you more tired. No. I mean maybe. Yeah I guess that's true. But I just that's just exciting. Cause I get to sleep sooner. Right. You know and I could always sleep instead of doing whatever I'm doing at that moment. There's a lot of things I like to do but it's like my perfect vacation. I've said this before is to just sleep forever. You wake up you know with Kevin you",
      "start": 4715.88
    },
    {
      "text": "whatever I'm doing at that moment. There's a lot of things I like to do but it's like my perfect vacation. I've said this before is to just sleep forever. You wake up you know with Kevin you eat out Kevin and then you and then you go back to sleep. Now what's weird to me is the fact that I have trouble sleeping. Like I don't sleep well. Oh really? Yeah. I wake up a lot and it takes a lot for me to fall asleep. I'm sleeping with other people. Like there'll be conked and I'm laying there for like a good hour. It takes me about an hour of laying in bed before the wind down period before I actually fall asleep. It's cause I'm always in my head. I'm always thinking about stuff scheming shit and doing all that. But I just you know the older I get the more I realize how much I just appreciate sleep and how much it just makes everything better. And the hair thing is because you know getting my hair done is a is a process man. Like it's worth it most of the time. But then it's",
      "start": 4760.6
    },
    {
      "text": "sleep and how much it just makes everything better. And the hair thing is because you know getting my hair done is a is a process man. Like it's worth it most of the time. But then it's that 15 minutes or like 0 minutes of shower and hair and all that. Well I'm like I could be sleeping man. And is that 0 minutes of sleep worth everything? No it never is. But it feels real good. It feels fucking good. It feels like a minute you know like your alarm goes off. You're like there's that literally just happened. How is this happening again? But man sleep's so interesting to me. Like I don't I don't know any of the science behind it. I just know that I fucking love it. No one's been able to figure out what it's like. Yeah. Those bands didn't say we never sleep. We just go to another dimension of blackness. I haven't heard that. I'm just letting you know that's something Kevin and I have been kicking around her off time for when you guys aren't here. We're doing experiments. I",
      "start": 4800.28
    },
    {
      "text": "dimension of blackness. I haven't heard that. I'm just letting you know that's something Kevin and I have been kicking around her off time for when you guys aren't here. We're doing experiments. I like the socks. We get into the frame Kev showing that American flag and I'm proud to be a sleep for me is a means to an end. I wish I could I wish I didn't have to sleep. I cause like I always have more to do. There's always more things to do. And like I'm playing a game usually at night. You know what I mean? Like Oh I gotta go to sleep. I have to go to sleep is my thing. You know what I mean? I enjoy the act of sleeping fine but I'm a morning person. So I like a good I like a good 8:15 wake up 8:30 wake up get up get a cup of coffee. I like a good weekend. Wake up you wake up and go get a bunch of shit done. What was the Saturday? Right? Was it a Saturday? No Sunday Sunday. We uh Saturday we went and did the shoot. I don't think any of those videos are going to be",
      "start": 4841.32
    },
    {
      "text": "up and go get a bunch of shit done. What was the Saturday? Right? Was it a Saturday? No Sunday Sunday. We uh Saturday we went and did the shoot. I don't think any of those videos are going to be up yet by the time I suppose Sunday though. I woke up and then it was Super Bowl Sunday and I had a bunch of stuff to do. So I woke up later but it still had a good morning morning routine of that. I woke up I went out uh you know got a whole month. I'm like what's this? No this was Saturday. Fuck. I'm so sorry. I'm pointing Kevin as if he would be paying attention to show. But of course Saturday I woke up early and I went to the store and bought stuff I needed for Super Bowl Sunday. Came back. I prepped all my meals for the week. I like I got stuff into like you know I'm going to do this. I'm gonna do that. I cleaned the kitchen a bit with like towels. I had a cup of coffee while I went and walked around the grocery store and then we went to Brent. It was like the best Saturday",
      "start": 4876.12
    },
    {
      "text": "this. I'm gonna do that. I cleaned the kitchen a bit with like towels. I had a cup of coffee while I went and walked around the grocery store and then we went to Brent. It was like the best Saturday because I woke up and I was energized and I went and knocked out all this shit that was chewy but like fun chewy stuff. You know what I mean? And then went and did other things like I like that. I like waking up and doing things but I like I'm you know I feel like um I'm the law of diminishing returns when I wake up I'm at my best. And then from there out I'm just Johnny Five at the end of Short Circuit to you. And I'm just I'm bleeding out and I'm chasing Oscar and you know what I mean? Good Lord. You're a special motherfucker. But yeah like I'm bleeding out. The battery is dying so that when it gets to the end of the day I'm garbage. I mean exact opposite. And I think that's where the sleep comes in is I will sleep all day. I am a night owl. I'm just on like I I cannot",
      "start": 4914.28
    },
    {
      "text": "so that when it gets to the end of the day I'm garbage. I mean exact opposite. And I think that's where the sleep comes in is I will sleep all day. I am a night owl. I'm just on like I I cannot work during the day. Like I just found that over whether it was being in school and writing papers or being an IGN or even now it's like I get so much work done between 9 PM and AM that I just couldn't do during the day. And I feel like there's just so much distractions and there's so much other shit. Not to say there's not distractions at night because there definitely is. I mean have you jacked off laying down? I have not yet. Fucking shit. You've had one piece of going to Colin's room right now. Lay down. So you know there's the internet always the internet's always a distraction but I feel like at night it's different man. Like things start to slow down and I can just focus on doing stuff. And especially I think cause it's it's darker and I'm just doing one thing. There's no one",
      "start": 4949.72
    },
    {
      "text": "feel like at night it's different man. Like things start to slow down and I can just focus on doing stuff. And especially I think cause it's it's darker and I'm just doing one thing. There's no one talking to me and there's I'm in my own room and I'm just doing shit. Yeah. And then I don't want to sleep. Like that's the thing is I don't want to sleep until I'm sleeping. I love sleep. Like it's once I'm in bed I'm like Oh this is the best thing ever. But it's like I will put off going to sleep as long as humanly possible at night during the day. Any chance I get I'll sleep. Well that's the big thing. I feel like you know as busy as we keep ourselves and as much as we do I forget when it was still at IGN and I went wrong but there was a turning point where it was like I can sleep wherever I wherever I get the chance. You know what I mean? That was the thing with like planes. When I turned that corner that's years and years ago where it was like Oh Hey I'm exhausted. I",
      "start": 4993.32
    },
    {
      "text": "wherever I wherever I get the chance. You know what I mean? That was the thing with like planes. When I turned that corner that's years and years ago where it was like Oh Hey I'm exhausted. I can sleep on the plane. You know what I mean? It doesn't matter what position I'm in. I can actually nod off here. I wish I was. And it's the same thing. Yeah. Where if we just had like downtime in the day like you want to take naps I'd be like yeah I'm gonna take a nap. I'll fall asleep. No problem man. That's the thing. I need that hour of prep time and also I need to be comfortable. So yeah I've never slept on a plane. That's just not happening. Not my life. I wish it was. Cause like that's so much time wasted. And I can't just sleep in like the Kevin could just sleep anywhere. Like he'll just lay on the floor and just fall asleep and not even lay. It'll be sitting on the floor. Yeah you have. Or like Sean Finnegan's another guy like that motherfucker. If he is if he doesn't have a",
      "start": 5028.28
    },
    {
      "text": "just lay on the floor and just fall asleep and not even lay. It'll be sitting on the floor. Yeah you have. Or like Sean Finnegan's another guy like that motherfucker. If he is if he doesn't have a screen in front of him for more than 10 seconds he's knocked the fuck out because he likes hiking. Oh my God. But I just can't do it. Like I need I need more of like a I need everything to be right. But when it's right. Oh man. I never want to wake up. Mornings suck. Mornings are the worst. Like I cannot imagine being like you like having all these things I got to do. Like I hate having anything to do before 10 AM. I think 10 AM. That's the reasonable time of like all right. But you only got 30 minutes for that McDonald's breakfast. That's true. And I'm an old school guy. I know that's not anymore. Yeah. I that's when I begin to even function and I don't really hit peak mental shit until after lunch. Then you get something out of me but it's not until at 9 PM when I start giving gold.",
      "start": 5060.84
    },
    {
      "text": "anymore. Yeah. I that's when I begin to even function and I don't really hit peak mental shit until after lunch. Then you get something out of me but it's not until at 9 PM when I start giving gold. What about you Colin? I was going to say you have a weird schedule. Colin. Yeah. My sleep schedule I usually I sometimes sleep like twice a day. So it's like you know last night I slept for like five hours. I'll probably go to bed after this and then I'll get up at like seven and go to the grocery store and and like start doing work. I like working at night as well. I've always been that way. And even in college I would you know I do my homework and stuff. I like homework I like write papers and do research at night like in the middle of the night. I liked I liked doing that. It made",
      "start": 5098.28
    },
    {
      "text": "me feel like I can get more things done because there's fewer distractions. But I rarely get like eight or nine hours of sleep at a time. I like I have a problem where I have to pee at least once a night too. And that breaks that breaks things up and I don't even drink that much water at night. Like it's just just got to go you know? So I love to sleep. It's like the way I as I said an anxiety topic. It's the way I escape my anxiety as I sleep. Just close my eyes and and get away from things. But I love I love to sleep. It's just sad to think that we spend over a third of our lives sleeping but we have to. It's necessary. And so reading about sleep and the biology of sleep and what what it does and what they think it is cause you guys were kidding around about it but they we really don't quite understand sleep actually. And and why it happens and why everyone does it. Like like every creature like has some sort of way of sleeping or resting. And we don't really it's",
      "start": 5134.04
    },
    {
      "text": "really don't quite understand sleep actually. And and why it happens and why everyone does it. Like like every creature like has some sort of way of sleeping or resting. And we don't really it's not it's not a physical thing. You're not like it's a mental thing. It's a way of making sense of data and like rejuvenation. Yeah. It's it's it's it's weird. It is very primal yet very complicated. It is something we've been doing since we learned you know primordial yet like we still don't quite get why it happens. And there's a lot of people that spend their lives trying to study what's going on in here. You know we understand the cycles of REM and all that kind of stuff now but and you're 90 minute you know you sleep in like 90 minute cycles. So they say it's best to get what is it? Three six or nine hours of sleep. But like or in like 90 minute increments as long as you're asleep because like if you wake up in the middle of the cycle you're like even if you slept",
      "start": 5170.68
    },
    {
      "text": "is it? Three six or nine hours of sleep. But like or in like 90 minute increments as long as you're asleep because like if you wake up in the middle of the cycle you're like even if you slept for like nine hours you sleep. And if you get up in like the middle of your last cycle you're more tired than if you got up after six hours. So there's a lot of fascinating stuff scientifically and biologically about sleep that I think is quite riveting that I wish we understood better but it's still something that I totally embrace. And I love you know I love to sleep. I always love to sleep. And it reminds me of when you're young and you're growing up and you're expending a lot of energy and you're growing like literally growing. And you know I used to sleep for like 1 or 14 hours a day on weekends. It was awesome. I'd go to bed at like two in the morning and I'd get up at literally like five. You know like if it was winter break done done like I was nocturnal entirely. Yeah.",
      "start": 5206.92
    },
    {
      "text": "day on weekends. It was awesome. I'd go to bed at like two in the morning and I'd get up at literally like five. You know like if it was winter break done done like I was nocturnal entirely. Yeah. My family makes fun of me still. My sisters make fun of me especially because when I was in middle school and high school I used to like just sleep. And then I'd like go downstairs when people when I do this all the time. But when they were visiting I'd always bring my comforter everywhere with me. And I'd like just take my comfort of my pillow and then just like go on. And my dad just gets so fucking mad. Like take your comforter upstairs. My family still makes fun of me for that. I'm like this is just how I roll. Like I got to sorry Dan. That's how I roll. I sleep for like 1 hours and get up and like watch like daytime TV on like on Christmas break or whatever. I'd be watching like Jerry Springer or like three and a half to do like in my underwear with like my covers over me and",
      "start": 5240.44
    },
    {
      "text": "get up and like watch like daytime TV on like on Christmas break or whatever. I'd be watching like Jerry Springer or like three and a half to do like in my underwear with like my covers over me and my pillow as if I'm still in bed. And I just can't sleep. I used to be able to really sleep forever and I just can't. I used to be able to sleep in like I hope I never lose that. It's I mean I definitely have I definitely sleep half as much as I used to. I feel bad now if I sleep in on the weekends like too much because I feel like I wasted the day because I'm still going to try to get to bed in a normal hour because I don't throw off everything to work. I'm going to be three in the morning and I'll wake up. That's the key. But for me it's I never feel like I'm wasting it. I always feel like I earned it. There's definitely I mean like when we come back from like E3 or like comic like a big fucking show and you sleep like that's like needed. Like I know the battery is completely depleted",
      "start": 5276.52
    },
    {
      "text": "I earned it. There's definitely I mean like when we come back from like E3 or like comic like a big fucking show and you sleep like that's like needed. Like I know the battery is completely depleted and that's a day. Yeah you lose a whole entire day. Yeah. Yeah. To me it's it's I don't look at it so much as time wasted because when I really look and I'm not trying to be facetious like when I look at how I spend my time it's all waste anyway. It's like I'm playing video games or something. It's not meaningful. So I was like what is the playing a video game or anything like that? It's like not meaningful way of spending your time. What's the difference? So at that point I'm like I never feel guilty about sleeping. Well it's one of those things up until right now I've never been I could you know I could play a video game right. And then I could talk about it make money off it. I'm like well at least that I'm getting something out of it. I've never been able to sleep and",
      "start": 5311.24
    },
    {
      "text": "could you know I could play a video game right. And then I could talk about it make money off it. I'm like well at least that I'm getting something out of it. I've never been able to sleep and then talk about sleep but we are here. We are sure but I'm not like I'm not trying to you know like Leonardo da Vinci like would take cat naps fifteen or twenty minutes at a time because he was doing something useful. Yeah. You know like like he was going to dial up. He was staying awake and like and building important things and figuring things out like I'm getting up and reading Drudge Report and playing fucking Dying Light. I mean it's not like I'm solving anything important so I might as well be asleep. The world the world won't be any different. Ladies and gentlemen this has been The GameOverGreggy Show. If you didn't know each and every week for sometimes three best friends gather on this table he's bringing a random topic discussion for your amusement. If you like that",
      "start": 5346.92
    },
    {
      "text": "The GameOverGreggy Show. If you didn't know each and every week for sometimes three best friends gather on this table he's bringing a random topic discussion for your amusement. If you like that head over to Patreon.com/KindaFunny where you can toss us a few bucks get every episode early get exclusive episodes and get exclusive perks. Just like drum roll please call him just like our first ever Patreon producer of The GameOverGreggy Show. John Deimos did Deimos John Deimos John Deimos. Yeah. Come on. I won't do it. He doesn't make the rap air hole in his mouth anymore. He makes it with an app which makes it 0 times harder to do on the command. John Deimos Patreon producer. Nope no no no. Jesus. That was you know there you go. What's his name? John Deimos John Deimos Patreon producer of The GameOverGreggy Show cause he supported us at that tier over on Patreon.com/KindaFunny. If you don't have money to toss us on Patreon no big deal. You can head over to",
      "start": 5382.68
    },
    {
      "text": "Patreon producer of The GameOverGreggy Show cause he supported us at that tier over on Patreon.com/KindaFunny. If you don't have money to toss us on Patreon no big deal. You can head over to YouTube.com/KindaFunny where we post every topic day by day until the entire show goes up as one big MP3 and video. Of course we've done a terrible job of keeping informed and letting you know that the new the Kinda Funny app has been updated and is amazing. And you should all go get the Kinda Funny app on your iPhones on your Android phones. Ain't that right Kevin? Kevin what is wrong? What happened to you today? Are you sick? Who hurt you? Are you sad? Do you have a fight with Paula? Do you have a bad clam? What's your usually a moat and say stuff. Where's the little giggle. Is this what happens when Nick's not here? When did I say that? No that's true. We haven't seen that. Damn. For a second. I was super excited and then it was just a uni-thon. Now so you're taking",
      "start": 5429.4
    },
    {
      "text": "Is this what happens when Nick's not here? When did I say that? No that's true. We haven't seen that. Damn. For a second. I was super excited and then it was just a uni-thon. Now so you're taking thong photos laying in bed but you won't just roll over and Jack off. Until next time it's been our pleasure to serve you.",
      "start": 5472.36
    }
  ]
}
