{
    "id": 1577,
    "video_id": "uRwiV5ADX5k",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "How We Handle Video Game Sponsorships - Kinda Funny Gamescast Ep. 58 (Pt. 3)",
    "description": "We discuss how we handle video game sponsorship opportunities.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1456322405,
    "duration": 1484,
    "transcript_chunks": [
        {
            "text": "Topic three. Oh I thought you were saying giving me the the hold on. No I was giving you three. I was helping out. I was giving you visual aid for somebody watching at home. This one comes from the Kinda Funny Forums boy. Deuce. Deuce says \"Hey guys this question is about promoting video games. You guys do a great job and are able to reach a wide audience of gamers. Lately I've noticed that Greg has been talking about how excited he is for The Division after finally giving the beta a shot. He's also mentioned in a few episodes how he'll be playing it online having played the beta and heard many online commentators talk about how content weak it is currently and I agree with them. Now I understand that everybody's tastes are unique and to each their own. I also understand the Kinda Funny is a business and money needs to be made so no hate from me. I also noticed Tim subtly positioning the Coke bottle so the label faces the camera. Was he said he has an LOL after",
            "start": 0.31
        },
        {
            "text": "the Kinda Funny is a business and money needs to be made so no hate from me. I also noticed Tim subtly positioning the Coke bottle so the label faces the camera. Was he said he has an LOL after that? Was just wondering question. Is Greg getting paid to promote The Division by saying he'll be playing online repeatedly or otherwise? It's all perfectly legal after all. I thought this was a cool jumping off point especially given that we did one of our first video game sponsorships in a long time. And I just kind of wanted to talk about like our thoughts on the whole thing and just get everyone out there on the same page to know. Sure. We haven't talked about in a long time. We talked about how we were going to handle ethics and and sponsorships and stuff when we started. Kinda Funny but we didn't do it. As we said from the get-go if we're doing sponsorships right you'll never know. Yes I'm being paid by The Division and Play. No no no no no no. The whole point is we'll be",
            "start": 42.08
        },
        {
            "text": "we didn't do it. As we said from the get-go if we're doing sponsorships right you'll never know. Yes I'm being paid by The Division and Play. No no no no no no. The whole point is we'll be upfront about everything we do. And so no I'm not being paid to talk about The Division at all. So his point he's got it a little bit wrong. I played The Division beta for like 40 minutes. Got in it was exactly what I wanted and I got out. You know what I mean? My excitement around The Division first off is that it's third person action which is my my jam. XP popping off when I kill people. and the promise that I know Kevin's gonna play. Maybe I got to play a little bit with uh Colin Fredo's gonna be playing. I bet I can get Nick on board. Me and Mitch were talking last night about having a standing like Monday date. Like it's going to be and Scott Low is going to be playing it. It's like I'm going to be playing it's it's going to be it's the first game that I've seen from the",
            "start": 79.2
        },
        {
            "text": "having a standing like Monday date. Like it's going to be and Scott Low is going to be playing it. It's like I'm going to be playing it's it's going to be it's the first game that I've seen from the outside coming multiplayer that I'm like I like the gameplay. It's not space like Destiny which is a turnoff for me and I know that's dumb but it's not space like Destiny and it's like my friends are going to be playing it. So it's like I'm already invested in the fact that it looks like I'll be able to play through and gear up and get better and get XP and then it's going to be that Scott pops on and I can go help his mission or you know Christine and I keep talking about playing together right? That she chances are since knock on wood we'll have it before she will we'll be early that I'll be you know advanced and be able to come back and help out on her missions to go through or maybe roll a different character or whatever. Uh not paid haven't played that much. So he's",
            "start": 116.24
        },
        {
            "text": "that I'll be you know advanced and be able to come back and help out on her missions to go through or maybe roll a different character or whatever. Uh not paid haven't played that much. So he's talking about being content light. I don't know anything about that. That's not I don't know that. That's not a complaint I'm hearing from my friends who have like you know Scott played dozens of hours right? And it's like I don't know. He never he's never said it felt content light. He said it felt great and he loved it and he can't wait for the real thing. So it's like that's all I need to know from my trusted peers right? So yeah not paid for The Division to clear it all up. But in terms of sponsorships the idea has been you know when they do come up that we tell our audience about them. We never hide from that. We're not ashamed of it. You know what I mean? And the fact that we'll never do something or a sponsorship that does jeopardize our relationship with you. We'll never",
            "start": 148.0
        },
        {
            "text": "them. We never hide from that. We're not ashamed of it. You know what I mean? And the fact that we'll never do something or a sponsorship that does jeopardize our relationship with you. We'll never do something that we're that you're going to look at and be like \"That's fishy. That's weird. Why' they do that?\" A great example for us I always talk about is The Order right? We did that The Order sponsorship or integration or whatever you want to call it where Colin and I did like a Rewind Theater kind of thing on the website for The Order and talked about the hidden things and brought you up to speed if you didn't know any of the history about The Order. Then 3 days later we put up our review discussion and we were like \"This game's not that great.\" Yeah and that was the point is that we were being sponsored around content that wasn't a review that wasn't an opinion. It wasn't like we were the review us going through and looking at the you know the actual The Order website wasn't us",
            "start": 181.84
        },
        {
            "text": "were being sponsored around content that wasn't a review that wasn't an opinion. It wasn't like we were the review us going through and looking at the you know the actual The Order website wasn't us saying this game's good or bad buy or don't buy good or bad you know 7.9 or zero. You know what I mean? And it's the same thing even with the Layers of Fear thing we just did right? That was us doing a let's play of Layers of Fear but it's really more about us getting **** with in a haunted house and **** with each other and being stupid and talking to the spirit guide. I mean and even then it's like there was no never a point where they were like you know say these things about this game or whatever and we could have totally hated it. We could have like been making fun of it as we were playing and like it that's that's the way that cookie crumbles. We go in being us and like they paid for that opportunity. That's what they wanted. And the thing about it we keep saying they",
            "start": 212.96
        },
        {
            "text": "we were playing and like it that's that's the way that cookie crumbles. We go in being us and like they paid for that opportunity. That's what they wanted. And the thing about it we keep saying they and that you know the developers issued us a challenge is what we say in the video right? Even though the description says we're sponsored whatever. The interesting thing about it is we never had direct contact with the developers at Layers of Fear right? Contact. Yeah. I'm sorry I said content. contact with the developers behind it right? It was through Layer Media which is you know our friends and stuff who are also in the video production business who got this opportunity and then hired us to come be the guys because they like our content right? So it's that weird thing of like no everybody's been awesome about it. And when we talk about it you know what I mean? Like we've taken your feedback in terms of like well you say in the video that they've shooted you a",
            "start": 246.0
        },
        {
            "text": "like no everybody's been awesome about it. And when we talk about it you know what I mean? Like we've taken your feedback in terms of like well you say in the video that they've shooted you a challenge but you don't say specifically it's sponsored. It's like sure we put in the description. Colin's been great on every show we do saying you know hey this is what we think of Layers of Fear but take it with a grain of salt. Exactly. It's it's all very interesting to think about. Like I come from a totally different world than you guys do cuz you guys were the journalist side of IGN where I was the business production side of IGN. And it's like I don't think that any of us disagree on this because it is there is ethics. There is a clear right and wrong with a lot of stuff. And then there's stuff that's not so clear. But to me the clear thing is you can't buy opinions. That is when Oh yeah. Yeah. Yeah we're never going to do something or say something where it's like \"All",
            "start": 276.72
        },
        {
            "text": "then there's stuff that's not so clear. But to me the clear thing is you can't buy opinions. That is when Oh yeah. Yeah. Yeah we're never going to do something or say something where it's like \"All right we want to hire you to play this game but you're not allowed to say if you like it or don't like it.\" That's the big thing if you and I talked about before with this Final Fantasy event where it was like \"Sure we'll do it. Colin talks **** about Final Fantasy every chance he gets. I don't I respect it but I don't play it so I can't say anything.\" And Tim's going to be the fan. And that was the thing with like you know I can't tell you much about the event. But even when we're talking about like I'm not going I told them straight up if I play it and don't like it I'm not going to be like \"Well that's just great. What a You know what I mean?\" Like no. Yeah. No. And it's it gets really kind of complicated because you know people start feeling really entitled to um you",
            "start": 310.96
        },
        {
            "text": "to be like \"Well that's just great. What a You know what I mean?\" Like no. Yeah. No. And it's it gets really kind of complicated because you know people start feeling really entitled to um you know just being known when there there's a commercial in front of them. And it's like the what's really interesting is there's there's so many rules that people don't know about. And there's so many rules that no one even knows cuz they keep adapting and keep changing like with the FTC doing all all of its stuff in terms of advertisement. The rules on the internet there is rules. They are constantly being redefined course and what one group tells you is totally wrong than what another group tells you. And each establishment kind of just needs to come up with its rules and be transparent. I think that's what we have going for us is we're so transparent with the audience. Like we tell you guys like you're never going to not know if something's sponsored. Like and if it's ever not clear if",
            "start": 342.8
        },
        {
            "text": "that's what we have going for us is we're so transparent with the audience. Like we tell you guys like you're never going to not know if something's sponsored. Like and if it's ever not clear if someone asks you'll get the answer immediately. If it's ever not clear that it's sponsored we failed. That's the point. You know what I mean? And like so that whether it's something in the description whether it is you know audio in the the video which we're I think we're adding to video two right? to make sure that it's crystal clear for everyone there. Like we live and die by authenticity. That's the whole reason Kinda Funny works is cuz you out there care enough about our opinions. You're not coming here for uh a sexy face. No offense to him. You're not coming here for exclusive gameplay. Usually you're you know what I mean? Like like you're you the bread and butter of us is us talking to you about video games and you going I respect their opinions. Yeah. So the moment I'm like",
            "start": 381.84
        },
        {
            "text": "Usually you're you know what I mean? Like like you're you the bread and butter of us is us talking to you about video games and you going I respect their opinions. Yeah. So the moment I'm like let me tell you why I love The Division BTW. This is brought to you by Well **** me. You know what I mean? It doesn't make any sense then. Yeah. And that's that's the other thing there is it's like you know these opportunities we look at them as like a chance to do something cool that we wouldn't be able to do otherwise like we would have never done a let's play like would we have played Layers of Fear? Not for sure. Maybe you know horror games are great let's plays but it would have been on green screen and it would have been just a normal let's play. That was my favorite. Like all the comments are like these production values and it's like there you go. Like you see it already right? The fact that like when we can be part of something that isn't opinion based and it's going to be a",
            "start": 417.52
        },
        {
            "text": "are like these production values and it's like there you go. Like you see it already right? The fact that like when we can be part of something that isn't opinion based and it's going to be a sponsorship we can give you something different right? Because Layer Media which isn't related to Layers of Fear but confusing to someone just getting on has amazing cameras and a drone and all these other things that we don't have. We have Kevin. Yeah he's good though. He's great. I love him. But like if I was if I was to say \"Kevin give me a drone boom shot on that right now.\" He pick it up and slam it into the wall and then drop it on the ground and then you trip over the cord. Yeah. It's really it's a case by case thing. And I think something that uh I want to make clear to the the people out there is I do a lot of the the businessy like sponsorship deal stuff right? And we never do something without having a discussion about it you know? Especially if it whenever it starts",
            "start": 448.16
        },
        {
            "text": "people out there is I do a lot of the the businessy like sponsorship deal stuff right? And we never do something without having a discussion about it you know? Especially if it whenever it starts to get to the point of like an ethics question of like where do we draw the line? I'll talk to you guys. I'll bring you sometimes separately just to get your different opinions and be like you know is this all right? Like what what do you feel about this? How what's the messaging need to be on this? Do we need to say brought to you by? Do we need to clearly define it? Like all this stuff. And we'll go back and we'll tell them. And if they're like no then we'll be like all right we're not doing that then. You know it's like they play by our rules once it comes to a certain point. Or we just say no. Yeah. You know and it's like we can pass because we're in that position where we we we're not begging for money to these people. You know what I mean? It's like we're they're coming to us",
            "start": 486.0
        },
        {
            "text": "say no. Yeah. You know and it's like we can pass because we're in that position where we we we're not begging for money to these people. You know what I mean? It's like we're they're coming to us and we're being like \"Oh does this make sense for us? Can we do this?\" And also the other question is can we make it make sense? If it doesn't make sense and I think that's that's the thing is like you can't buy our opinion but it's like is there anything you like about this game? It's like I don't know. Let us see. Let us find out and then we can go from there. And like and you know with I think The Order is a perfect example. like he doesn't really love that game but it's like you guys did a video that's just doing a talking about the history of it and like all the the finding the secrets and stuff. That stuff is interesting. That stuff is cool and it is doing a service to somebody. Someone's interested in that content and that it's not like that stuff is being affected by getting",
            "start": 518.56
        },
        {
            "text": "and stuff. That stuff is interesting. That stuff is cool and it is doing a service to somebody. Someone's interested in that content and that it's not like that stuff is being affected by getting paid. You know what I mean? Or getting money for the content. And I think that is really kind of the the bottom line. And also it's like is it cool? Is it fun stuff? Is it something that we want to promote? A product we're proud of. Yeah. Yeah. It's like if this was I can't really think of an example off the top of my head but like the horror like us going to Haunted Mansion and ghost hunting I was sold instantly. Like that's awesome. But if it was something that we didn't want to do cuz we didn't think it would make great content even if it was funny we wouldn't necessarily do it. You know what I mean? Like we would have to have that conversation of does this fit our brand? Like I personally think this is one of the Kinda Funniest videos we've ever done. You know like this is what I",
            "start": 555.84
        },
        {
            "text": "what I mean? Like we would have to have that conversation of does this fit our brand? Like I personally think this is one of the Kinda Funniest videos we've ever done. You know like this is what I want to be doing is us being dumb shits playing games and having fun and whatever. There wasn't a single moment that we were doing that that I was actually thinking about like is this a good game? Oh sure. While we're playing you know what I mean? It was more like we're making content you know? Yeah. What do you think Colin? I mean I about the video itself I agree. I think it's a great video. Um but came out better than I thought it was. And I think that I think it's obvious that it's sponsored. That said like uh like even without any of the text like it's obvious that this isn't something we did by ourselves just based on everything we've ever done. Um but that said we can't make assumptions like that and it's not right to make assumptions like that which is why I've um you",
            "start": 592.4
        },
        {
            "text": "we did by ourselves just based on everything we've ever done. Um but that said we can't make assumptions like that and it's not right to make assumptions like that which is why I've um you know I always try to be clear. When The Order came out we did the same thing and with this game we're doing the same thing where I was actually unlike The Order I was which I knew I you know probably wasn't going to like very much. Um I was pleasantly surprised by this game. So it's but but I do want people to know that like well you know we did get money for this video about this game. So I really do authentically like the game but if you don't want to believe me I understand that and you should know that this this certain this certain set of circumstances exist. So and I don't and I'm allowed to say that right? No exactly. They're going to take all the money back. No. Um but but that's all of that said I do understand this uh this the heightened skepticism around what's",
            "start": 625.6
        },
        {
            "text": "I'm allowed to say that right? No exactly. They're going to take all the money back. No. Um but but that's all of that said I do understand this uh this the heightened skepticism around what's going on on the internet with advertising and stuff like that. And so I think um people have every right to be skeptical. People have every right to ask their questions. Um we have to be better not just us but I think everyone in terms of like you know highlighting when things are sponsored because um you know there is a lot of shady **** going on out there. Um I I proudly say that I've never been a part of it but um you don't know that and like I and I and I so I get that. I understand that but I think most people trust us and most people get what we're all about and yeah we wouldn't we wouldn't do something that um that would compromise our um ethical standing with you guys and our and and I wouldn't you know I think you guys know me you know well enough to know that I",
            "start": 658.8
        },
        {
            "text": "we wouldn't do something that um that would compromise our um ethical standing with you guys and our and and I wouldn't you know I think you guys know me you know well enough to know that I wouldn't do something that I thought compromised um my right and ability to say whatever the **** it is I want to say. So we wouldn't we wouldn't uh we wouldn't put ourselves in those kinds of positions. But again I get it. And I mean you see shady **** going on all the time especially on YouTube. So um and speaking of that like kind of the the seed of all of this was that there was a comment that was like \"Hey guys like you should make it a little more clear that it's sponsored because uh Machinima got in trouble whatever.\" So I read an there's an article I want to read a bit about it and then we can discuss it a bit. This is from Wired. Says \"Machinima has settled this from last year. Machinima has settled with the Federal Trade Commission after an investigation into",
            "start": 693.84
        },
        {
            "text": "bit about it and then we can discuss it a bit. This is from Wired. Says \"Machinima has settled this from last year. Machinima has settled with the Federal Trade Commission after an investigation into undisclosed paid endorsements.\" The FTC said today \"Earlier this year the FTC issued a complaint against Machinima saying that it had failed to disclose financial incentives regarding video content uploaded by its members channels in violation of the Federal Trade Commission Act. Microsoft through an outside agency paid Machinima to produce positive videos about the Xbox One gaming machine and many of the YouTube stars who accepted the deal failed to properly disclose that they were producing paid sponsored content not independent analysis. The incident in question happened in late 2013 following the launch of the Xbox One. According to FTC's complaint a number of YouTube channels they name a couple were commissioned by Machinima to produce videos featuring the Xbox One launch",
            "start": 727.6
        },
        {
            "text": "following the launch of the Xbox One. According to FTC's complaint a number of YouTube channels they name a couple were commissioned by Machinima to produce videos featuring the Xbox One launch title Ryse: Son of Rome in a way that showcased Microsoft in a positive light. The failures to disclose here um the failures to disclose here appear to be isolated incidents that occurred in spite of and not in the absence of policies and procedures designed to prevent such lapses the FTC says. And it all ended with just like a slap on the wrist. There was no fines there was no anything. It was just like hey you can't do this. What's wrong about all that? Well I mean the fact that these individual people aren't doing it. I think the fact that like the uh the intent is hidden. Okay. You know the intent there was I'm going to show I'm going to make a video showing you Ryse: Son of Rome is good. Like right when we make videos about games like you know you just did one with Nick about",
            "start": 762.88
        },
        {
            "text": "the intent there was I'm going to show I'm going to make a video showing you Ryse: Son of Rome is good. Like right when we make videos about games like you know you just did one with Nick about Far Cry the intent there is to put out us playing this game and hopefully it's funny. It's not to say I'm going to show Far Cry in its best light. I'm going to take Far Cry out at its knees right? It's I'm going to see what this game is. Yeah. And just to not to interrupt you but the game crashed during the during the uh Yeah. Far Cry crashed during our let's play. And that's in the let's play. I mean like we're going to talk about that in the let's play. We'll probably cut out the me rebooting because it's boring. But we talk about it crashing. It's not like we were like Oh sure. You know let's hide the fact we're jumping ahead now to show you something a little bit different. We got the game early too. So it's not like you know those the thing that's important is that there's",
            "start": 805.52
        },
        {
            "text": "let's hide the fact we're jumping ahead now to show you something a little bit different. We got the game early too. So it's not like you know those the thing that's important is that there's there's it's I I don't find it common at all. And I don't even know if I can think of a time when like you get access to a game early at least when we've been doing editorial when we were doing this kind of stuff and everyone's like well got to be positive you know like nothing I don't I I just cannot recall a situation like being I'm trying to think what was the game there was a game with reviews where there was a hullabaloo that if it was that if your game was if you were going to score the game above whatever you had but if you went below then you'd have held this embargo. Yeah. That's the one thing and I can't even name the exact game of what we're talking about and people they got eaten alive for it whoever won. Yeah. So it's just I just I think that people have to understand that there",
            "start": 838.64
        },
        {
            "text": "thing and I can't even name the exact game of what we're talking about and people they got eaten alive for it whoever won. Yeah. So it's just I just I think that people have to understand that there there's this idea that there's like some collusion going on and maybe there is. I don't know anything about that. I don't think there is really um with Publisher X and YouTube channel Y whatever. I just don't think that's happening because publishers are not stupid and they know what's going on and they know that like they're just going to turn the people off that play their games from ever playing their games if they put these like restrictions on that are maybe not even legal and at the very least unsavory. So um so people have to look at it in a like a more bird's eye view that like there's a symbiotic relationship between the publishers and the developers and the the press and the media and all that kind of stuff for sure because they make the games and we play the games and",
            "start": 873.68
        },
        {
            "text": "there's a symbiotic relationship between the publishers and the developers and the the press and the media and all that kind of stuff for sure because they make the games and we play the games and that's good for them. Um if we like the game and maybe bad for them if they don't like the game but it's like it's kind of a natural marketplace you know like I I don't really see it as like something that's really being the invisible hand like kind of works there. Like good games rise to the top bad games don't really get sent out because they know we're going to **** destroy them. So like it's and sometimes good games we don't like and sometimes bad games we do. So it all works out. But I just think that like there's a little much there's on one hand like I said earlier it's understandable with what has gone on over years past going way back to Kane & Lynch and all that kind of stuff at GameSpot um which was almost 10 years ago now. Uh but then going all the way forward to today",
            "start": 908.48
        },
        {
            "text": "with what has gone on over years past going way back to Kane & Lynch and all that kind of stuff at GameSpot um which was almost 10 years ago now. Uh but then going all the way forward to today with you know stuff like what happened with Machinima and the FTC getting involved and and people just kind of being skeptical of things. I understand that but at the same time it's very conspiratorial. It's it's like way over the top in terms of like like the conspiracy theories people really think are happening when people think you know when we were at IGN people were buying review scores that never happened you know like like that like that literally never happened. So like I don't I don't So like I want to say that as well like I understand your fears but I'm also telling you as someone who's been in this industry a lot longer than many people in the industry you know that that like this kind of conspiracy laden **** at least at the top level that we were at at the sites we were at and the",
            "start": 941.2
        },
        {
            "text": "in this industry a lot longer than many people in the industry you know that that like this kind of conspiracy laden **** at least at the top level that we were at at the sites we were at and the things we worked at just didn't happen like that you know so people have to like just kind of look at it through a a lens of less skepticism but always remain healthfully skeptical of Exactly. Exactly. There's a there's a difference there between a healthy skepticism and over the top. Definitely. So breaking down this thing for me I think there's a couple interesting things to look at. Is Microsoft buying this wrong? You know then you go down to that and it's like all right then there's the Machinima layer of they are technically the managers of and they are the ones that are issuing these contracts to these content creators. Are they wrong for issuing the contracts and not making it clear that they need to make this stuff like that's what they need to do? You need to say it's brought",
            "start": 973.6
        },
        {
            "text": "contracts to these content creators. Are they wrong for issuing the contracts and not making it clear that they need to make this stuff like that's what they need to do? You need to say it's brought to you by you need to say this or that. Then it gets to the content creators and it's like we're in an interesting world now where it's like you're right it is ethically wrong and like IGN and GameSpot whatever they can't do this. What if these people aren't critics you know what if these people are making content? They're just making entertaining content. Is it wrong to pay someone to make entertaining content that is favorably um talking about someone else's product and that's where the FTC gets involved because there are rules around that. Right. And that's because it's an advertisement. That's the different when you're passing it off as a product that isn't an ad. That's the problem. Yes. And so it really comes down to this thing of you are actually making an advertisement which is",
            "start": 1011.92
        },
        {
            "text": "That's the different when you're passing it off as a product that isn't an ad. That's the problem. Yes. And so it really comes down to this thing of you are actually making an advertisement which is different than making uh than reviewing something and how that affects the review and stuff right? So it it gets complicated and what's interesting is that it's Machinima that I think is the issue there because Machinima is the thing that need and again now they're they're better now like they got the slap on the wrist and what right this is years ago. Yeah. But Machinima is the one at fault there. They're the buffer. They're supposed to push back on Microsoft right? They're supposed to push back and they're also supposed to make it clear to the content creators that you're allowed to do what you're doing legally. You're allowed to but in order for it to be legal you need to have the fine print somewhere. You see this on commercials there's the fine print that'll say whatever is",
            "start": 1047.68
        },
        {
            "text": "what you're doing legally. You're allowed to but in order for it to be legal you need to have the fine print somewhere. You see this on commercials there's the fine print that'll say whatever is necessary for it to be said. And we do that. We live by that. like we like there is documents and legal things on every contract that we sign that it's like we are legally required to put X Y or Z in the description or in the video or here or there or whatever in order to be fined. And it's like that it's it's not on us you know like it's on whoever we're signing that contract with. It's on us to be cool with our audience and to make sure our audience is knows what's up. A perfect example is for this uh Layers of Fear thing we're talking about putting the intro tag on the beginning. and just say this is brought this is sponsored by brought to you by whatever uh Layers of Fear. We don't need to do that. Like legally we don't need to do that. And actually that's the type of **** that we",
            "start": 1083.04
        },
        {
            "text": "say this is brought this is sponsored by brought to you by whatever uh Layers of Fear. We don't need to do that. Like legally we don't need to do that. And actually that's the type of **** that we should charge Layers of Fear more for that because like that's giving them more bang for the buck every time you mention that we're sponsored by them on your on the other podcast and technically we should be getting more money. Like we not should be could be could be you know and it's like but we don't care because to us it's not about that money when it comes to their we want to do right by the audience and the audience was on episode one like it could have it maybe it should have been and they're like all right sure why not good point we'll think about that in the future and it definitely do it case by case um BTW Kevin remind me to record that after this. Oh yeah we were supposed to do that before this but no big deal. But I just think it's it's funny to look at it all because I mean",
            "start": 1124.4
        },
        {
            "text": "do it case by case um BTW Kevin remind me to record that after this. Oh yeah we were supposed to do that before this but no big deal. But I just think it's it's funny to look at it all because I mean Microsoft you know shady or not whatever it they're making commercials like that's all they're doing. So it's like personally from a business perspective them asking people to make advertisements that are favoring their thing. There's nothing ethically wrong about that at all. That's the point. They're literally paying content creators to make commercials for them to make content. Yeah. Paying off reviews and paying off stuff. Yes that is shady. That is weird. That is whatever. That's not what this is. That's a totally different thing. And like you're talking about that with IGN and stuff and like that doesn't happen cuz that is wrong. I think there's also a level of self policing that's required. I agree with you like Microsoft I'm not sure in that particular story not knowing like",
            "start": 1159.68
        },
        {
            "text": "and like that doesn't happen cuz that is wrong. I think there's also a level of self policing that's required. I agree with you like Microsoft I'm not sure in that particular story not knowing like everything about it didn't probably do anything wrong. They're trying to manipulate the market. Um and that's what businesses kind of do. You're not going to watch a commercial that's like it's all right. Machinima I think should have pushed back. That's what I always really respected about you know a lot of our experiences with with sales people in the past where they really do try to protect and many times the editorial like consistency of of a product be like well what you want is not acceptable. So we're just not going to do it. We'll leave the money on the table. We don't want it. Um and that was really up to Machinima to do that. And there is another layer where you either care about your your your ethical standards or not. If you're a YouTuber doing whatever you're doing a content",
            "start": 1196.88
        },
        {
            "text": "that was really up to Machinima to do that. And there is another layer where you either care about your your your ethical standards or not. If you're a YouTuber doing whatever you're doing a content creator. So there is there is an onus on the people at the very bottom as well to to say no to those things we would have said no to that as well. I mean it reminds me it reminds me of um if I don't have editorial freedom to say and do what I want and anything we do I'm not doing it. And and and I think we're all we're all very similar minded with that. And it reminds me I think more recently there was a a Star Trek MMO or something that that came out and these this third party Kotaku or Polygon wrote about it. Yeah. third party PR agency wanted people to like write about or or do videos about it and they're like you have to say this and use this and maybe we suggest that you say that it's fun for the f like whatever it is and I'm like if someone shove that directly in your ****",
            "start": 1226.88
        },
        {
            "text": "about it and they're like you have to say this and use this and maybe we suggest that you say that it's fun for the f like whatever it is and I'm like if someone shove that directly in your **** because I'm not I'm not doing that you know and like I don't think we would even get pitches like that because no they want to give them but like the fact that PR we don't like but again like I don't know that PR was necessarily wrong to do that because they're trying again to manipulate something for their for the benefit of their products because that's how they make their money. it is up to the other side to say like no like we don't do that and to set a standard and I think that you know talking about the honest of the people on the bottom like you know I developed a very close relationship with Insomniac Games I know a lot of people there and I'm like actually close personal friends with Marcus uh Smith and with and with Drew Murray who are the guy like the co-creative directors of",
            "start": 1261.84
        },
        {
            "text": "with Insomniac Games I know a lot of people there and I'm like actually close personal friends with Marcus uh Smith and with and with Drew Murray who are the guy like the co-creative directors of Resistance and Sunset Overdrive. Kevin and I are real tight with Ted Price wrote an elevator with him. Yeah. And you know I'm I'm on a first name basis with many people over there. I've been you know see many times and and I a long time ago no one even asked you to. I'm like I I'm I want everyone to know like I'm like I I think I can 100% be honest about the game. And actually when we gave Resistance I remember we g Resistance 3 a nine. They asked us like what would you give Resistance 3? I'm like a nine. Not knowing the score and they were like well that's what we're giving it. And I'm like so there you go. Um but you know I knew that like optically you cross a across a line where it's like I know in my heart that I can look at this objectively but I understand why you",
            "start": 1293.6
        },
        {
            "text": "it. And I'm like so there you go. Um but you know I knew that like optically you cross a across a line where it's like I know in my heart that I can look at this objectively but I understand why you think that I couldn't. And so like at some point you have to just be like that's not even worth a hill worth dying on at all even though I know what's in my heart. I'll just remove myself from the equation completely. So I didn't deal with Insomniac at all until Sunset Overdrive uh preview cycle um in which I had you know some things I liked about it and some things I didn't like about it but it was a preview. It was not a review. I would have never put myself in a critical position to to do that when I was a critic. So I guess the point I'm trying to make is like you have to you have to people have to be smart enough on themselves as individuals to know when they should remove themselves. Not because they're necessarily doing anything wrong because I don't think I I was doing anything",
            "start": 1327.2
        },
        {
            "text": "have to be smart enough on themselves as individuals to know when they should remove themselves. Not because they're necessarily doing anything wrong because I don't think I I was doing anything wrong at all by developing my friendships but by the the knowledge that if I were looking at someone with a relationship like that talking about something like that I might be like \"hm there's something I know he's honest but you should probably recuse yourself anyway.\" And that's it's like when a Supreme Court justice recuses him or herself because they have a vested interest in this thing like they could probably look at things objectively. That's what they do. They're judges but there's still the question on if it was ever ever happening. So I think that there's another layer below that. I think that's them making their judgment on the whole situation and like what's the best you know foot forward. And I think that we do that all the time. And I think that's why we are where",
            "start": 1363.6
        },
        {
            "text": "that. I think that's them making their judgment on the whole situation and like what's the best you know foot forward. And I think that we do that all the time. And I think that's why we are where we're at. It's because we're open with everybody and they're open with us and like we have that conversation and it's like all right cool. Well every single thing we think about going forward. There's not a single thing that happens when **** goes on where we're not like hm how do we feel about this? What should we do next time? And then it just is part of next time's whole planning process execution process everything. Yeah. the you know my closing thoughts I guess on this are I agree that if if we're doing something that's sponsored you'll probably know it in the first millisecond you know what I mean because I'm I'm super uncomfortable not making that clear which is why when I talk about Layers of Fear when we talked about The Order back in the day I always tried to make that",
            "start": 1394.8
        },
        {
            "text": "you know what I mean because I'm I'm super uncomfortable not making that clear which is why when I talk about Layers of Fear when we talked about The Order back in the day I always tried to make that clear and it wasn't so difficult with The Order because I **** didn't like the game at all that was bad but um so that would have been an ironic payoff wouldn't it have but uh with Layers of Fear we had to be a little more clear because I was actually quite pleasantly surprised by the game um so people are people are going to know but we would never put ourselves in in precarious or unsavory positions like that. I just know we wouldn't. So um you guys either trust us with that or or you don't but we should always be open and honest about those things as well. Amen. To be clear Microsoft paid you not to like The Order right? Yes. To be clear and also uh Resistance 3 uh available on PlayStation 3 by the way uh uh you're it's your fault that we didn't get another one. I like",
            "start": 1432.0
        },
        {
            "text": "paid you not to like The Order right? Yes. To be clear and also uh Resistance 3 uh available on PlayStation 3 by the way uh uh you're it's your fault that we didn't get another one. I like how Kevin threw that up on the wall. He's like straight enough.",
            "start": 1463.36
        }
    ]
}