{
    "id": 1556,
    "video_id": "XwGi5pB0ZpA",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty",
        "Deborah (Paranormal Investigator)"
    ],
    "title": "Colin Goes Ghost Hunting and Plays Layers of Fear (Pt. 1) - Kinda Funny Plays",
    "description": "Subscribe! https://www.youtube.com/user/kindafun...\n\nWatch us get the crap scared out of us as we play Layers of Fear in a real haunted mansion.\n\nThis video is the result of a sponsorship. (But it turns out Greg and Colin really do like the game. Check out the discussion on PS I Love You XOXO: https://www.youtube.com/watch?v=EDTiGKgCLOA)\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino",
    "published_at": 1455650879,
    "duration": 608,
    "transcript_chunks": [
        {
            "text": "What's up everybody? We're Kinda Funny and we're here at the very old, very historic, very haunted Jefferson Mansion somewhere in California. Now you might be asking, Greg, why the hell are you at a haunted mansion? Well, you see, the developers behind Layers of Fear have issued us a challenge. That challenge is for us to venture into that Mansion one by one, secure some relics. We got to go in there, we got to find some gameplay stations. We're going to play a chapter of Layers of Fear to secure some of those relics. Now this is all an effort to complete the collection in this Artist Satchel, which we will then give away to one of you lucky fans out there along with a copy of Layers of Fear on the platform of your choice. Sounds easy enough, but what can we expect inside Jefferson Mansion itself? We sat down with Paranormal Investigator Deborah Hogerty to find out more. Here's what she said. All right, Deb, so what are we getting into with Jefferson Mansion? So this place is amazing. You're getting",
            "start": 5.04
        },
        {
            "text": "with Paranormal Investigator Deborah Hogerty to find out more. Here's what she said. All right, Deb, so what are we getting into with Jefferson Mansion? So this place is amazing. You're getting into a town that was a military town. We had a hanging because Abraham Lincoln had given his very first order of execution here. The hanging was here, yes, on the on the location. Not not on this table, no. Okay, making sure. So when you do these ghost hunts, do we usually find friendly ghosts like Casper or like not friendly ghosts like the other ghost? It just depends. It depends on what kind of energy and what happened here. Is it is it true that wiener dogs and dogs and cats and just animals in general can sense things? Yes, absolutely. What are the signs I should be looking for in him that he senses? Whining and running out the door. Okay, so far, so far, so good. So far, so good. All right, I'm the tip of the spear. What advice can you give me when I go into the Mansion? If there is something there, you're going",
            "start": 43.76
        },
        {
            "text": "and running out the door. Okay, so far, so far, so good. So far, so good. All right, I'm the tip of the spear. What advice can you give me when I go into the Mansion? If there is something there, you're going to maybe encounter it. So don't feel like you need to run. Don't run. Don't run, Greg. Don't run either. I'm going to run. I'm going to sprint. I know you are. Well, don't don't overwork yourself. I don't know when the last time you ever ran was. All right, guys, I think we have all the information we need. Tim, are you ready? Let's get spooky. I'm feeling good. Nick. All right, Colin, you're going in for the first Relic. How confident are you that you're going to be able to do this, not get possessed? I'm very confident. I feel like I'm playing Legends of the Hidden Temple, so this is going to be great. Do you believe in ghosts? No. Let's see if you believe in after this. All right, all right, go, go, go, get them. Okay, go get him, Chief. Can you hear me? Yes, I can hear you, Colin. Yes, you've survived thus far. What do you",
            "start": 97.12
        },
        {
            "text": "in ghosts? No. Let's see if you believe in after this. All right, all right, go, go, go, get them. Okay, go get him, Chief. Can you hear me? Yes, I can hear you, Colin. Yes, you've survived thus far. What do you see? I see decorations, weird paintings. Are you feeling the spirits yet? No Spirit. I'm not feeling any spirits yet. This portrait may or may not be Millard Fillmore. I'm not really positive. Who the hell is Millard Fillmore? He's a Pres. Colin, watch out behind you. You can't that's not going to work on me. This ain't right. Do you want me to send Pell in? Are you being possessed right now? I'm just walking around. I'm trying to find the music. I think I'm supposed to go upstairs, but I really don't want to because it's freaking me out a little bit, guys. There's just a lot of creepy relics in here. There is a weird energy in here. Who the hell is this? This bust is definitely a U.S. General, but it kind of looks like Stalin when you look at it real quick. All right, I'm going upstairs. Be careful, Colin. This is this really",
            "start": 158.88
        },
        {
            "text": "in here. Who the hell is this? This bust is definitely a U.S. General, but it kind of looks like Stalin when you look at it real quick. All right, I'm going upstairs. Be careful, Colin. This is this really is creepy. All right, I'm in the room with the game. I don't like this. This feels like he's going to get murdered. Uh-oh. Oh, we're seeing some flashes. We're seeing some lights happening. That's either the orbs of the spirits or it's him entering that room. Oh my God, this is really creepy. You guys got to there's like a marionette, like a monkey marionette in here sitting on the chair next to me. I don't like that at all. Okay, I'm going to play. He's playing it cool, but I know him. He's kidding. The game's pretty cool. I like it. So I'm in a room with a painting of a guy stabbing what looks like a child with a sword. Stab for tell us. See something, Cy? What do you see? Tell us what you see. He either sees a ghost or he wants cake. No one knows. Find The Relic, Colin. Colin, you're looking for a",
            "start": 222.72
        },
        {
            "text": "like a child with a sword. Stab for tell us. See something, Cy? What do you see? Tell us what you see. He either sees a ghost or he wants cake. No one knows. Find The Relic, Colin. Colin, you're looking for a relic. Oh my God, the game's freaking out. Holy Christ. All right, have you ever played a video game before, Colin? It's rare that I play them. Oh my God, see, I can't handle this. He he senses something. Yeah, he senses a spirit. Yeah. Is Portillo freaking out down there? Whoa, a door just shut in real life or in the game? I think in real life. Okay, we heard it too. Oh, things are happening in the game. I just fell through the floor. I'm in a really dark room now. There's a light switch. I can turn it on, make it a little lighter. Oh my God, that was freaky. It's creepy. There's like real noises around me in real life. It's unsettling me quite a bit. Jesus Christ. I don't know if I should be more scared of the game or what's going on around me in real life. Colin, we've lost your feet. Anything could be happening to you. We've",
            "start": 295.76
        },
        {
            "text": "unsettling me quite a bit. Jesus Christ. I don't know if I should be more scared of the game or what's going on around me in real life. Colin, we've lost your feet. Anything could be happening to you. We've lost visual. There could be something behind you or to your left just out of your peripheral vision. That's not good. Makes so much scarier. We've got visual back. Okay, Colin, if you don't make it out, can I have your signed Resistance 3? Yeah, you can have both of them. Cool. I'm going to sell that. I hate that game and I hate him. And now I'm in a different room. I'm back in the Artist Room. There we go. And I can interact to the painting and I place the Relic down. The painting is changing in the Artist Room. Do you have the Relic? I grabbed something from a painting and put it onto the painting in the game and flamingos appeared. Just get out now. Run. I need to get the hell out of here while the going's good. We're going to save Colin. We're getting Colin out. 40. He really is the pride of Long",
            "start": 371.68
        },
        {
            "text": "in the game and flamingos appeared. Just get out now. Run. I need to get the hell out of here while the going's good. We're going to save Colin. We're getting Colin out. 40. He really is the pride of Long Island. Here he is, pride of Long Island. Colin, good job. Thank you. I have the Relic. Kinda Funny on 15. 1, 3, 4, 5, 6, 7, 8, 9, 10, 11, 1, 13, 14, 15. Come. All right, scale of 1 to 10, how scared are you right now? Zero. I've been preparing for this my whole life. I as a kid, I always wanted to be a paranormal investigator. I'm ready to go. I don't want to talk to anymore. All right, keep your Keep Your Head on a swivel. Yeah, don't worry about that. Good luck. And no final tips, right, Colin? Nope. Thanks, Colin. Have fun. Oh God, Christ. First of the day. The door. Greg, can you hear me? I can hear you. What are you seeing, Greg? Uh, I'm seeing a lot of knick-knacks, some Paddywhack. It's just, you know, I mean, there's a lot of well, this room is like creepy as 'cause it's got like all the creepy angel guys and not angel, not angel guys. So",
            "start": 431.12
        },
        {
            "text": "seeing a lot of knick-knacks, some Paddywhack. It's just, you know, I mean, there's a lot of well, this room is like creepy as 'cause it's got like all the creepy angel guys and not angel, not angel guys. So now I'll tell you what, like, I am getting creeped out. Oh, big tough talk from once you hear it starts going, you know what I mean? Yeah, fear level, give it to me right now. Fear level zero to 10. Fear level three. Fear. And it's not like I'm afraid for my life. All right, here's a piano. It's playing by itself. I think I'm doing a slow zoom with the night vision. Make sure to unzoom the camera. Yeah, zoom the camera out. I'm really worried about this camera zoom zoom. It's not it's not that zoomed. I'm going upstairs. Give me a slow rack zoom focus. You know, I don't understand that technical term. I'm upstairs. It's time to cut the s***. Do you guys see my light yet on your thing? No, but we see what's waiting for you and it's terrifying. I don't know which way to go, Greg. I want you to listen to my voice",
            "start": 503.84
        },
        {
            "text": "it's time to cut the s***. Do you guys see my light yet on your thing? No, but we see what's waiting for you and it's terrifying. I don't know which way to go, Greg. I want you to listen to my voice, but I want you to think about Nick. I want you to feel his voice, but see him. I'm going through the hallways very much like Solid Snake with a gun and a knife, but I have a flashlight and a camera. Here we go. All right, I'm there. I got a bedroom over here. Oh no. Oh no. What about who's the marionette man here? I don't know, but I wouldn't you know, sit next one. Yeah, why don't you go and sit down? See what happens.",
            "start": 556.6
        }
    ]
}