{
    "id": 2847,
    "video_id": "nK4RqLR7fTA",
    "show_name": "Animated",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Kevin Coello",
        "Colin Moriarty",
        "Zacq Wenzel"
    ],
    "title": "How Many 5 Year Olds Could We Fight? - Kinda Funny Doodles",
    "description": "Subscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1501005205,
    "duration": 81,
    "transcript_chunks": [
        {
            "text": "so my question is one on-one how many five-year-olds could we take on and survive and get out of like did they know they have to take me out or is it that I'm just walking into a Chuck-E-Cheese I walk in look around turn around junk lock the door I'm like when kid just still eat a piece of pizza it falls out of his mouth he's like oh [ __ ] it's on it's on Big Boy bring the pain I'm like I'm going in there I'm going just I just [ __ ] taking these K I'm grabbing him by the head I'm like is your still soft and they're like I don't know I'm like I'm trying to scare the other ones too I'm going to scream I'm going to scream with that like voice I do you know what I mean where I'm just like you don't get it I'm not trapped in here with you you're trapped in here with me and I'll do that laugh that you guys think scary but yeah these kids grab you on the legs that's like usually a cute kid move you know what I mean and rather than punch down what you got to do is just go up here and just",
            "start": 0.08
        },
        {
            "text": "that you guys think scary but yeah these kids grab you on the legs that's like usually a cute kid move you know what I mean and rather than punch down what you got to do is just go up here and just and like when you [ __ ] crack a [ __ ] 5-year-old like that that's like a skull fracture and an orbital bone he's at least he's going to forg like his alphabet or something like you just knocked out all the a through like M El like do your ABCs and like and means you mean the no [Laughter] o oh Christ oh my God",
            "start": 42.64
        }
    ]
}