{
    "id": 2799,
    "video_id": "rDTUBXYeOm0",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Greg Miller",
        "Danny O'Dwyer"
    ],
    "title": "WWE 2K18 on Nintendo Switch Terrifies Me - Kinda Funny Games Daily 07.10.17",
    "description": "Danny O'Dwyer's first episode of Kinda Funny Games Daily covers WWE 2K18 coming to Switch (as well as why Greg thinks this is a bad idea), Crash Bandicoot's impressive June, and more!\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1499720876,
    "duration": 3993,
    "transcript_chunks": [
        {
            "text": "[Music] What's up everybody? Welcome to Kind of Funny Games Daily for Monday, July 10th, 2017. I'm one of your hosts, Greg Miller, alongside for the first time. Oh yeah. My Irish cream Danny Odia. Whoa. Cream of the crop. Cream. Top of the morning. Never get a pig cuz a pig is a cop. Cheers, governor. Thanks for coming. Appreciate it. Sorry I'm late. Like I'm like a month late from my first Yeah, I know, right? Yeah. It's nothing like announcing two hosts at Kind of Funny Live 3 and then having one go on a monthlong vacation. I'm heading home. I'm heading home. I'm going to do E3 and then I'm getting the [ __ ] out for a couple weeks. So, where where all you go? Oh man, I'm myself. My wife went to England. We went to London. I lived there for the best part of 5 years. So, it's kind of like showing her around. Um she crammed in as much Harry Potter [ __ ] as you could possibly do. Yeah, it was it was real good. We did the Harry Potter tour like of the like lot uh which they like have",
            "start": 2.06
        },
        {
            "text": "showing her around. Um she crammed in as much Harry Potter [ __ ] as you could possibly do. Yeah, it was it was real good. We did the Harry Potter tour like of the like lot uh which they like have basically like all bunch of like Harry Potter stuff. We went to the show with Cursed Child which was really good. Um, and I think that might be it. But that's a lot of stuff. And then went to Ireland and saw some cattle. You were gone for like 17 or 14 days, right? It was something ridiculous. How do you feel? Cuz I've been out of the game. I I mean I, you know, I went to Missouri for 4th of July, but I left on Friday and then just got back last night. Now granted, RTX was in there, so I was somewhat connected to video games, but it feel it feels so weird to try to get back in the swing of this right now. I feel like we came back from summer vacation. I'm like, it's it's July, Greg. Like it's not even early July. We're in double digit July now. It used to be like there was a nice big 2 and 1",
            "start": 43.76
        },
        {
            "text": "now. I feel like we came back from summer vacation. I'm like, it's it's July, Greg. Like it's not even early July. We're in double digit July now. It used to be like there was a nice big 2 and 1 half month gap in the summer where nothing came out. Like we used to have that January gap like all these little pockets where like people in video game sites were like what are we going to write? Exactly the tennis ball off the wall trying to figure it out. Yeah. And I come home and it's like okay here's like five games I haven't played. Um and like you know DLC for Zelda and you know a million and one like new stories and announcements and like everything. It's I don't know. It's It's Yeah, it's weird playing catch-up. Like I basically spent three days just playing a bunch of games uh and reading news sites and trying to figure back. Yeah. Which is just so bizarre. Like I guess that's the video game world we live in now. So it's a good thing we have a daily video game news show. That's",
            "start": 80.72
        },
        {
            "text": "news sites and trying to figure back. Yeah. Which is just so bizarre. Like I guess that's the video game world we live in now. So it's a good thing we have a daily video game news show. That's right. If you didn't know, ladies and gentlemen, this is kind of funny games daily. Each and every day we delve into the nerdy news you need to know about from the video game landscape. Get really hands-on with it, talk to you about it, and then put it out there for you to consume. Remember, you can watch us do the show live over on twitch.tv/kindfunnygame. We don't use the chat because we're making a polishpodcast show, but we're going to get stuff wrong. So, I need you to be our stat boys like on PTI and go to kind offunny.com/you wrong. Tell us what we get wrong. No editorializing. I just want the facts we screwed up. I a lot of people getting in there and like, well, let me tell you a story. And cracking our knuckles and it's like that is not what we need at kind of funny.com/you wrong.",
            "start": 120.4
        },
        {
            "text": "the facts we screwed up. I a lot of people getting in there and like, well, let me tell you a story. And cracking our knuckles and it's like that is not what we need at kind of funny.com/you wrong. Remember Kind of funny games daily posts each and every day on youtube.com/kindfunnygames and podcast services around the globe. Please, we're a brand new show. Go subscribe to the YouTube channel. Subscribe to us on the podcast services. Maybe you watch us record it live. It would mean a lot if you subscribed in both places though to help those dang numbers. Remember bunch of Patreon perks too. You can go over there. $1 helps. Patreon. You know it well. Yeah, it's a good thing. I got the old stickers. I got people probably going to scream at me for using the old stickers. I know the old school Patreon thing. Of course, support Danny. youtube.com/noclip video. patreon.com/danny Odoire. Yeah, but Danny, let's jump into the news of the day. There's a lot. Are you ready to begin the show with",
            "start": 159.36
        },
        {
            "text": "Patreon thing. Of course, support Danny. youtube.com/noclip video. patreon.com/danny Odoire. Yeah, but Danny, let's jump into the news of the day. There's a lot. Are you ready to begin the show with what is and forever will be? Don't [ __ ] it up. The Roper Report. Time for some news. Getting better, Kev. He only needed a week off. Yeah. To really like, you know, he went and he listened to some Morse code just to make sure he could understand what it's supposed to sound like. Uh oh, hold on. There are four items on the Roper report. A baker's dozen. Thank you, Kev. Uh, we're going to start with, I think, the top story of the day. WWE 2K18 is coming to the Switch. Uh, they put out a video today. Danny Odwire, Seth Rollins, cover athlete, of course. And it's one of those like, oh, what an annoying ass video. Did you watch it? It's Seth Rollins. It's like an It's like a minute long video of him holding the Switch, playing it, and then looking up be like, \"Oh, hey everybody. I'm Seth",
            "start": 193.68
        },
        {
            "text": "an annoying ass video. Did you watch it? It's Seth Rollins. It's like an It's like a minute long video of him holding the Switch, playing it, and then looking up be like, \"Oh, hey everybody. I'm Seth Rollins. Here's this cool announcement. It's coming.\" It never shows the game on the Switch. Never shows anything. Barely shows the Switch. It's like, \"Hey, Seth, you got 5 minutes. We got to shoot a trailer.\" Yeah, it's like literally in the back of the literally a guy comes in and she tries to get get him to leave. I mean, it's like a bit and he comes back. Don't forget Switch. Forgot my Switch handheld. I got to bring it out. Let me give you the the rundown from WWE.com. Before I jump into why I am terrified of this [ __ ] game. Uh over on WWE.com, they say WWE 2K18 Switch debut marks the first time in 5 years that a new WWE video game has been released for Nintendo platforms. Thanks to the Switch's on the-go capabilities, it will also be the first portable WWE game or video game",
            "start": 237.52
        },
        {
            "text": "the first time in 5 years that a new WWE video game has been released for Nintendo platforms. Thanks to the Switch's on the-go capabilities, it will also be the first portable WWE game or video game available in six years. Rest in peace, PSP. Uh, Switch enthusiasts who choose to step into WWE 2K18's Ring can expect a flurry of new features in this year's game, many of which I want to I'm going to highlight that for you, Danny. Many of which were detailed recently in a 2K developer blog post. This includes matches featuring up to eight superstars, a more expansive backstage arena area, I should say. New weight detection and grapple carry systems, and much more. What's weight detection? You know, so like if you're like a little guy, right? You're trying to pick up Brock Lesnar. Yokuna. Exact. Exactly. Yeah. You're you're going to blow your back. I don't know if the Yokosun is going to be. Okay. Sure. Uh this is in addition to the more immersive My Career Experience, an allnew online",
            "start": 274.48
        },
        {
            "text": "Exactly. Yeah. You're you're going to blow your back. I don't know if the Yokosun is going to be. Okay. Sure. Uh this is in addition to the more immersive My Career Experience, an allnew online Road to Glory mode that pits your custom superstar against players around the world. WWE 2K Dean will it goes on all this stuff you'd expect. You can get the pre-order blah blah blah. Compete with this is still saying WWE 2K Switch players will be able to compete with or against superstars that will make up this year's ever growing roster. Coming out fall 2017 on Switch. Uh it's going to be on all the PlayStation 4, Xbox One as well. October 17th, 2017. It's probably a little bit later on Switch. Maybe couple week couple weeks later on Switch. Is that what you're saying? Or saying worldwide release date is Hold on. worldwide release in fall 2017 on Nintendo Switch as well as on Oh, so no, you're right. You're right. They word it weirdly. They They're trying to get They're trying to weasel out",
            "start": 317.36
        },
        {
            "text": "date is Hold on. worldwide release in fall 2017 on Nintendo Switch as well as on Oh, so no, you're right. You're right. They word it weirdly. They They're trying to get They're trying to weasel out of it. They got me on that one. They are. Well, here's the [ __ ] thing. All right, hold on. Okay, here we go. You have a lot of baggage for this. I'm surprised. The DCD Robert work. What up? Wrote in the kind of funny.com/kfgd just like you can because we need you to be part of the show each and every day. says, \"Why the heck would Greg be scared of WWE 2K18 when the Nintendo Switch needs as many third party hits as it can get?\" Also, hey, Andrea. Hey, of course, Workman knew it was you. He refrauded his whatever. It doesn't matter. Uh, Danny, as someone who reviewed all the SKUs of Smackdown versus Raw and all that stuff while I was at IGM and when I was still reviewing, I'm terrified of WWE 2K18 on the Switch because this is exactly the kind of [ __ ] the Switch doesn't need. I love the",
            "start": 354.4
        },
        {
            "text": "versus Raw and all that stuff while I was at IGM and when I was still reviewing, I'm terrified of WWE 2K18 on the Switch because this is exactly the kind of [ __ ] the Switch doesn't need. I love the WWE games, right? I I enjoy playing them every time they come out for a little bit and doing all these different things. Putting this version on the Switch is just going to make the Switch look like a PS2 to a PS3. You know what I mean? like this game is going to there's going to be something wrong. There's going to be so many things wrong with this game. And the fact that you know many of which you know the new features in this year again it's all wording new features many new features this year many of which means not all not all the new features that were detailed in that blog post are there. Is that what I'm to understand? Maybe take away from that cuz this is what's going to happen is I'm telling you now regardless of what this says this will not be a completely feature complete",
            "start": 401.44
        },
        {
            "text": "there. Is that what I'm to understand? Maybe take away from that cuz this is what's going to happen is I'm telling you now regardless of what this says this will not be a completely feature complete version of what you're getting and they're kind of trying to sell it as that. Exactly. So, okay. Rewind 5 years, right? So, you're reviewing I'm guessing, right? Five years is the last time it came to. So, this was a Wii game. This was skip. Yeah. I don't think they did Wii U ones. Correct me if I'm wrong. So, these were all like the uh WWE Allstars was I think the last one that came out. This is back in like the This is the horror show that everyone had for the Switch is that what essentially we're going to get on the Switch is hackneed versions of like the real versions of the games like the PlayStation, Xbox ones. I'm guessing that's what all the Wii ones were, right? 100%. And it was like they tried their best. Don't get me wrong, and I understand that the Wii had such an audience you",
            "start": 441.28
        },
        {
            "text": "PlayStation, Xbox ones. I'm guessing that's what all the Wii ones were, right? 100%. And it was like they tried their best. Don't get me wrong, and I understand that the Wii had such an audience you needed to do it. I don't think that's the case with the Switch. I think the Switch is the fact of the matter with the Switch is that it is a secondary system for most right now. If you own a Switch, you probably own a PlayStation or a PC or an Xbox. And I guess PC doesn't help you here, but it's the fact of the matter is like I this goes back to my argument of when the Switch got announced. I was like, I'm all in. This sounds awesome. I think it'd be in a perfect world. I would love to them to say day in and day you're getting Mass Effect Andromeda on it too. But I'm well aware that this machine is not a PlayStation 4 and Xbox One. It can't run those kind of games and I wouldn't want a dialed down experience. I'm talking in a perfect world to get the exact same same game. It'd be amazing.",
            "start": 477.36
        },
        {
            "text": "is not a PlayStation 4 and Xbox One. It can't run those kind of games and I wouldn't want a dialed down experience. I'm talking in a perfect world to get the exact same same game. It'd be amazing. You can't do that here. What should have happened here if you ask me is this and what I think would have blown people away and really [ __ ] moved some units is the fact of and I say it over and over again. They need to just understand that the best game they ever made was No Mercy/Wrestlemania 2000/WC or WCW NWO Revenge, right? And make that cartoony basic grappler there, but like with obviously better textures and everything like all these different things. What did you think about Allstars? All that was kind of that. It wasn't it wasn't right. where it was like, hey, we've got goofy action figures and it we hey, we've got over the top moves and they have rainbows coming off and all stuff and it's like, well, no, like Wrestlemania 2000 was trying to be the wrestling game of that era. You",
            "start": 512.4
        },
        {
            "text": "and it we hey, we've got over the top moves and they have rainbows coming off and all stuff and it's like, well, no, like Wrestlemania 2000 was trying to be the wrestling game of that era. You know what I mean? With and right right now, you know, this is an interesting time to announce this, of course, cuz tomorrow Firepro uh goes early access on Steam. That's insane. It's like Yeah. what a lot of wrestling fans consider to be the best wrestling game. Exactly. And that's a game that of course doesn't hang like here's the thing with what WWE 2K whatever you want to call it always hangs its hat on. It is the most realistic looking sports entertainment sim. Great roster. Exactly. Great roster. The moves I mean like I you know covering it for so long like that team cares and I know that it's it's a Madden syndrome right of like you put one out and you got nine months to turn the other one around. So like there's always these incremental things. They've heard you before with like you know",
            "start": 554.4
        },
        {
            "text": "it's a Madden syndrome right of like you put one out and you got nine months to turn the other one around. So like there's always these incremental things. They've heard you before with like you know how long animations take. So they shorten those downs. They put in the physics. They do the weight detection. They're making a sim game there, which is great and was going to shine on your PlayStation 4 Pro or your Xbox One X one day in 4K and all the chess. The problem is like if you're trying to do something that looks more real every year, to then take the most real version you've ever made and put it on the Switch means that there's going to have that stiff [ __ ] hair character create, it's going to load forever on character creation. Online is never been the Switch's uh, you know, great. I mean, we were trying to play on the plane last night Mario Kart and it's like, \"Oh, well, ad hoc doesn't go that far, you know, and like there's all these different things.\" It's like I mean, you",
            "start": 594.32
        },
        {
            "text": "I mean, we were trying to play on the plane last night Mario Kart and it's like, \"Oh, well, ad hoc doesn't go that far, you know, and like there's all these different things.\" It's like I mean, you were trying to play on a [ __ ] airplane. Yeah. Which should be easy. All right, I'm in this game here. There's no other signal to pick up. Let me play Grime Craft and I wanted to play Mario Kart. What's the worst that happens? They get a blip on the radar. It would have been fun. Uh, but no, it's the fact of just like this is going to be a lesser version and until I play it and I'm pro proven wrong, which I think you would have done with a trailer today to show me that if that's really what it is. I just the excitement I saw on my Twitter feed when I woke up for this today, I think is going to lead to so much disappointment when you see it and you're like, \"Oh, this is the same reason like I was happy they stopped making the PSP versions and the Wii versions.\" Just the fact of like, \"Well,",
            "start": 629.36
        },
        {
            "text": "lead to so much disappointment when you see it and you're like, \"Oh, this is the same reason like I was happy they stopped making the PSP versions and the Wii versions.\" Just the fact of like, \"Well, this game never looked that great and it you played it and you're like, \"Oh, there's things missing here.\" We won't know until we really get it. Obviously, you're going to get in there and be like, \"Oh, this match type's missing. Oh, these wrestlers are or not wrestlers probably, but these, you know, interactions you expect are missing.\" Yeah. Like backstage isn't here or something like that. But do you think that like game players now are at least weathered to that? Like nobody's people are coming to this, anyone who's like played any of any of those old games, they've been so used to getting that type of experience. You think like maybe now they're at least like anticipating it's probably not going to look as good, but like at least it has some unique setup points. Like the fact that",
            "start": 661.76
        },
        {
            "text": "that type of experience. You think like maybe now they're at least like anticipating it's probably not going to look as good, but like at least it has some unique setup points. Like the fact that you can take it, you know, portable. I'm sure like high school kids are like that'll be a cool thing to be able to go and play with your their buddies and stuff like that. I wonder if I I think actually if the the gap in time has been enough to make people forget that, right? I do you that's 5 years a long time and and for a general consumer who owns a Switch and just enjoys it or whatever. Do you understand what that is going to look like? Do you know the difference for if you are just a kid who's like, \"Oh man, I want I'm in fifth grade or whatever and I I'm going to Switch for Christmas and I want that game for it.\" Do you and I do they really care? Who the hell knows? But I just feel like it's going to be a clunky version based on how clunky the other versions always was where the ropes",
            "start": 695.04
        },
        {
            "text": "want that game for it.\" Do you and I do they really care? Who the hell knows? But I just feel like it's going to be a clunky version based on how clunky the other versions always was where the ropes don't look good. You know what I mean? Like that's my concern. Maybe I'm wrong. Maybe 2K will come out and crush it and it'll be awesome. But I was surprised by FIFA at E3. Yeah, that was the first game I went to play because I thought, okay, let's see how the Switch is able to. Let's because it's the exact same problem is that like they tried to make the Wii versions and eventually what they ended up doing was making specific Wii versions and the Wii version of Pro Evolution Soccer is like one of the best football games ever made. It's unbelievable. Um, they never went back to it again because it was for those controllers. But I went and played it and it actually ran pretty good and we played it on a screen, like a big screen and we immediately, me and my buddy Dennis went to the",
            "start": 729.6
        },
        {
            "text": "because it was for those controllers. But I went and played it and it actually ran pretty good and we played it on a screen, like a big screen and we immediately, me and my buddy Dennis went to the PlayStation 4 section to do some sort of sideby-side thing. Yes, there was a difference, but it wasn't the same ridiculous like deficit that I'd seen before. So, see, that's comforting. That's comforting cuz I'm not a developer and I don't know the differences between the Switch architecture and the PlayStation 4, but I for me when it was PS3 to Wii, there were such gaps of like, you know, like less people in the crowd. Like the weird thing for like again with a wrestling sim you're trying to make. If I was there and I know I've said this for years literally, but if I was there and like I'm talking to WWE especially right now, all right, I'd be like here is how well the NES Classic settled. Here's what people are projecting for SNES Classic. And here's the Nintendo Switch and how much",
            "start": 761.12
        },
        {
            "text": "talking to WWE especially right now, all right, I'd be like here is how well the NES Classic settled. Here's what people are projecting for SNES Classic. And here's the Nintendo Switch and how much goodwill is behind this. Right now, if we put up a poll anywhere, hit it under a different name and you put it up. What's the best wrestling game, right? People are going to say one of the, you know, AKI games for N64 or they're going to say, \"Here comes the pain on PS2,\" which I respect. Wrestlemania on Genesis. No, no one's going to say, \"Come on, Dwire.\" But they're going to say that and I would be like, \"So, here's what we do is like all Nintendo is is nostalgia. Let's double down and do that. Let's make a game that looks like Wrestlemania 2000 for the Switch. Have it be an exclusive. Work out a deal with Nintendo. I don't know how that works. Of course, I'm not I'm not a businessman, but there's got to be something there. And I feel like the team could be so small that you could make",
            "start": 799.12
        },
        {
            "text": "out a deal with Nintendo. I don't know how that works. Of course, I'm not I'm not a businessman, but there's got to be something there. And I feel like the team could be so small that you could make that work on a financial level and be like, \"Hey, what you love?\" Cuz I mean, like we just came from RTX, right? And like there we did the screw attack versus game attack versus kind of funny verse Mega 64 panel and of course we played Wrestlemania 2000. And it's the same thing when we go and there's PAX wrestling for League of Heels. It's like you're playing No Mercy or Wrestlemania 2000. Like everyone has a soft spot and a memory for those games. And with the amount of switches out right now, I think that you could easily move the spiritual successor to that and get that in people's hands and have them excited for it in a way that wrestle, you know, WWE 2K18 with Seth Rollins, with all due respect to Seth Rollins, isn't going to get like my friends, yeah, my friends who used to play, you",
            "start": 839.52
        },
        {
            "text": "have them excited for it in a way that wrestle, you know, WWE 2K18 with Seth Rollins, with all due respect to Seth Rollins, isn't going to get like my friends, yeah, my friends who used to play, you know, Wrestlemania with me, they're not going to get on board with this. That's not going to get them. I wonder if that brings up really you know awkward discussions within 2K though because you basically have I mean they are on a very specific path with the WWE games and have been for like the best part of a decade like they're trying to make this type of simulated like televisual experience right so then if they suddenly create an alternative version to that they're essentially like putting them up against each other and not not in terms of sales I mean in terms of like the sort of public discussion around it. So essentially what you might have is you might have like one creative director saying we're going to go this way and then putting up what a lot of people have said is what they",
            "start": 874.0
        },
        {
            "text": "discussion around it. So essentially what you might have is you might have like one creative director saying we're going to go this way and then putting up what a lot of people have said is what they actually want. And that might be like an I can imagine internally that being an awkward situation for people who are there to try and like wrestle the wheel away from somebody. The argument I'm not disagreeing. I think it's a good idea. But the the interesting thing there would be like well would that competition finally spur them to actually get the you know wrestle the the prime game back on its feet the way people want it to? Cuz the problem with the 2K whatever games is there's no competition and they are minor upgrades every year and but it is it's the same problem with Madden and it's one of those where they march and speak to such a specific audience that if I'm in there trying to explain to you how I'm going to make this game bigger and better. It's going to be incremental based",
            "start": 911.2
        },
        {
            "text": "one of those where they march and speak to such a specific audience that if I'm in there trying to explain to you how I'm going to make this game bigger and better. It's going to be incremental based on how good WWE is doing, how good this is going. I mean, now they're going with a Switch install base, you're going to see more units moved, of course, for this, but I feel like there's something there, even if it was the fact that you gave it a six-month exclusivity window in on this new version that's the throwback and then put it on PSN and Xbox Live, right? And it's that weird thing of Yeah, there it's a weird message, I guess. But I feel like I thought, you know, when they did All Star or whatever, WB Allstars, that was a weird message, too, of like it's these action figures and these epic battles, and it's like, well, can't you this isn't what we're asking for. Like if you were to take that and be like, \"All right, cool. It is like it looks like Wrestlemania 2000, so it is Cactus",
            "start": 945.2
        },
        {
            "text": "epic battles, and it's like, well, can't you this isn't what we're asking for. Like if you were to take that and be like, \"All right, cool. It is like it looks like Wrestlemania 2000, so it is Cactus Jack and Ric Flair and all these people and it's the four horsemen and it, you know, all this WCW stuff. You could finally bring in another one.\" I feel like that would be the game to be like, \"Hey, are you nostalgic for professional wrestling?\" That's where this is. Which, by the way, every wrestling fan, like 80% of wrestling fans are like even begrudgingly watching now because of that nostalgia. Well, I mean, that's the big thing I think of like with how they're pushing uh the the new the WWE 2K18 right now with Seth Rollins and like I don't know if you watch the announcement cover athlete video for him or whatever where he goes in he basically goes through like the archives of WWE where they have like all these like glass like Nature Boys like uh you know jacket and all these",
            "start": 980.56
        },
        {
            "text": "athlete video for him or whatever where he goes in he basically goes through like the archives of WWE where they have like all these like glass like Nature Boys like uh you know jacket and all these different things and he smashes it and he destroys everything in this museum, right? And the whole thing is is like this is what it is. I you know it's I forget it. It plays into his whole King Killer thing, but it's like it's also playing into the fact that the last few wrestling games have been sold on the back of The Rock and Stone Cold and Hulk Hogan. And it is like, \"Hey, do you remember the Attitude Era? Come relive it in this video game.\" And it's like, okay, but I'd much rather have it look like that cuz the problem with when I sit down with somebody and I want them to play WWE, 2K, whatever, with me is the fact that it's a it's a complicated control scheme if you're not into it, right? It is the same as like Madden. And this is the difference I think with like Wrestlemania 2000 to",
            "start": 1017.28
        },
        {
            "text": "with me is the fact that it's a it's a complicated control scheme if you're not into it, right? It is the same as like Madden. And this is the difference I think with like Wrestlemania 2000 to WWE 2K is the difference between a Techmo Super Bowl or Blitz to Madden, right? Where it's like, hey, here's this one to jump in and you Yep. There's four what you strong grapple and weak grapple and that goes out into four different strip is this and you don't have to worry about, you know, just any direction on a on a on a button and you're essentially doing something. Personally, I feel like that's how they should go, right? But they never listen to me. It's funny that I say this stuff year after year for a decade and no one ever does exactly what I want with the exception of Patapon coming out soon. Thank you for bringing that back. Small victories. Exactly. Uh Danny. Yeah. While we were both on vacation last week/ I was at RTX and you were doing over. You weren't on vacation. You were",
            "start": 1055.92
        },
        {
            "text": "out soon. Thank you for bringing that back. Small victories. Exactly. Uh Danny. Yeah. While we were both on vacation last week/ I was at RTX and you were doing over. You weren't on vacation. You were working. Whatever. Close enough. Uh I wanted to double back to the PlayStation blog. They put up and this is number two on Ropers Report. Uh the top PSN downloads for June 2017. Oh, I love this stuff. It's always so fascinating. I'm going to run you through the top 10 PS4 games and then I think I did. Yeah. The top 10 VR games. Don't really care about PS3. V is what you'd expect. Do they give the stats there for PS3? Oh, they don't give stats. They just give you the the games, but yeah, they put them up still like what the top downloads were off the PSM. Um, right now for PlayStation 4, number one, Friday the 13th, the game. Okay. Yes, we continue. How you doing, Jason? Still haven't played it. Number two, now this one's interesting. Crash Bandicoot Insane Trilogy. This is interesting, of",
            "start": 1088.32
        },
        {
            "text": "one, Friday the 13th, the game. Okay. Yes, we continue. How you doing, Jason? Still haven't played it. Number two, now this one's interesting. Crash Bandicoot Insane Trilogy. This is interesting, of course, because it came out on June 30th, right? It it had what is just one day? Can you look at a calendar? Was there a June 31st this year? I forget if there but I think it was one day and it got to the second most downloaded thing. What does that say about the rest of them? Ex say about three. Number three is Middleear Shadow of Mordor game of the year edition. Number four. That's cuz it was like being sold for like two cents. Of course. Did you see that? Yeah. Oh, yeah. Anytime you see something weird chart on here, it's always cuz there June 30th it was the Friday. So, one day. Okay. It just had one. There was no 31st. I almost bought it. It was It was $3 Shadow of Mortar on Steam. I went to buy it and I was like, I already own this game. Yeah, exactly. What a great What a great deal.",
            "start": 1125.76
        },
        {
            "text": "had one. There was no 31st. I almost bought it. It was It was $3 Shadow of Mortar on Steam. I went to buy it and I was like, I already own this game. Yeah, exactly. What a great What a great deal. Uh number four, Grand Theft Auto 5. Oh, man. GTA online. Jesus. Okay. It'll never stop. Number five, Grand Theft or sorry, God of War 3 Remastered. Number six, Battlefield 1. Number seven, Horizon Zero Dawn. Number eight, Tekken 7. Number nine, Minecraft PlayStation 4 Edition. And number 10, your friend in mine, Rocket League. Oh, yeah. Good to see Rocket League hanging in there. Big update as well. So, they added a bunch of stuff to it the past week. I think it's turned two years old, I believe, last week. That's right. Which it sounds crazy cuz it feels like it's been around so much longer, let alone the fact of how much it's grown. Where like last night, I got home and I was like, \"Oh, man. I I can still catch Samojo Brock Lesnar for Great Balls of Fire and turned it on and like they do",
            "start": 1162.32
        },
        {
            "text": "alone the fact of how much it's grown. Where like last night, I got home and I was like, \"Oh, man. I I can still catch Samojo Brock Lesnar for Great Balls of Fire and turned it on and like they do like the picture and picture and it was still sponsored by Rocket League. I was like god damn it. God damn. You know what I mean? What a [ __ ] success story for them. Unbelievable. I played that game more than any other game over the past two years. Wow. Really? Easily. Easily. Well, you did of course the NoClip documentary on Rocket. Yeah, it was great. Good job. Thanks so much. It was fun. Did that come How does that start then for you? Was it the fact that you were already a fan of the game and thought it was interesting or was it Yeah, it was that and also because the story of how Rocket League got to where it was is so funny because it involves a bunch of games that I love which have nothing to do with cars or football. Like it's basically an Unreal Tournament 2000 or 1999 like like",
            "start": 1199.28
        },
        {
            "text": "League got to where it was is so funny because it involves a bunch of games that I love which have nothing to do with cars or football. Like it's basically an Unreal Tournament 2000 or 1999 like like fan story like a bunch of guys who eventually like pitched it to Epic as yo you should put vehicles in your game and then that was Unreal Tournament 2004 which is like the second best Unreal Tournament game because of that mode because of conquest. So, it's just a a fascinating story and the game is brilliant. Like, I have not played like FIFA or Pro Evolution much at and these are games I played both of them every year for like 15 years. Yeah. Since Rocket League came out. I didn't buy them last year. It it it scratches that itch for me. Now, this will be an interesting comment cuz I know it'll catch flack from somebody out there until I explain myself. So, let me explain myself. Super excited for Rocket League on the Nintendo Switch when I know I just knocked the fact of like, why is",
            "start": 1230.88
        },
        {
            "text": "it'll catch flack from somebody out there until I explain myself. So, let me explain myself. Super excited for Rocket League on the Nintendo Switch when I know I just knocked the fact of like, why is this game getting ported? Obviously, Rocket League a little bit different. Not same graphical overhaul. not selling it on the fact of like, hey, look at how real Rocket League looks, right? Rocket League for me, I enjoyed so much uh in the preview phase of that game and then when we finally got it, played it on the first few days, went away for a weekend, came back and everybody was amazing. And there's nothing more like, oh, like I just don't I don't know how to be better. I don't and I like having it now on a handheld. If I can play it on a plane, I can play it with Kevin when we're killing time doing something around here. Like that's exciting. And like the local play, I feel like if we can get good at playing each other again will get me out to actually playing online. It's a tough",
            "start": 1270.24
        },
        {
            "text": "time doing something around here. Like that's exciting. And like the local play, I feel like if we can get good at playing each other again will get me out to actually playing online. It's a tough one. Yeah, cuz everyone got good at aerials and then that basically became the sort of massive thing you had to climb to get over. Uh and the bots in that game aren't great. Like the single player stuff, they're not that hard. Eventually it ends up being like you versus three other cars. That's how they do it. Like the hardest mode is you versus three cars. Um which is not exactly the right place to be teaching other people to do aerials either because then you're just floating in the air and there's three of them kicking the ball in. So yeah, I think I think that'll be a good shed. And also graphically like it's not that it's not. Yeah, that's the thing is I I play or got to see played for me at E3 or whatever when I swung by and saw Dunham and stuff and it looks good. Looks like Rocket",
            "start": 1303.52
        },
        {
            "text": "graphically like it's not that it's not. Yeah, that's the thing is I I play or got to see played for me at E3 or whatever when I swung by and saw Dunham and stuff and it looks good. Looks like Rocket League. You know what I mean? More crates. A third place to buy crates, Greg. I've got so many crates. Okay. I never buy crates in games. I can't stop. I've never gotten anything good from any of these [ __ ] crates. You keep getting them. Keep getting them. Yeah, keep buying them. Did you get the team team fat flag yet? I got the noclipip flag. God damn it. Pick it up. Don't clap for him, Kevin. Uh, but back to Crash Bandicoot number two with one day. Yeah, that's pretty good. I'm I think that's really good, right? And I wonder what the, you know, the leadup to this was, what does this mean for Crash? Like, what does this mean for a new Crash Bandicoot? What does it mean for Spyro as Tim keeps bringing up? I don't know what to take away. I know it's it sold really well in the UK. I saw",
            "start": 1337.44
        },
        {
            "text": "for Crash? Like, what does this mean for a new Crash Bandicoot? What does it mean for Spyro as Tim keeps bringing up? I don't know what to take away. I know it's it sold really well in the UK. I saw that, too. I saw that Activision put out some kind of comment being like, \"Oh, well, you know, we're going to see how this one does and then maybe we'll see what happens in the future, whatever.\" Right. It's interesting. Do you think we're going to get Crash 4 now or like I I feel really weird about these. Like I think I think there are some games like Sonic which are like they're done. We have passed and this isn't spiteful or me like I love Sonic and I like Crash, but like they were games that controlled in a certain era for a certain reason. And we've seen time and time again that you can't modernize them. And the reason I feel like this one works is because this is literally what people wanted. People don't really want a new version of Crash. They just want to play the old one and they",
            "start": 1372.16
        },
        {
            "text": "modernize them. And the reason I feel like this one works is because this is literally what people wanted. People don't really want a new version of Crash. They just want to play the old one and they want it to not look like garbage and they don't want to have to pull out their PlayStation one. Like that's all they've ever wanted. And I feel like that's the same with like loads of these games. Like nobody's crying out. I mean people there are like the vocal there of this world and like I'd say the same about like speedball or something. Whereas I'd love like new versions of all these games but what I really want if I'm honest or what most people want is to just have access to them in the way that like every other medium has music and film. games with accessibility, but if you stick a dollar amount of bucks on a new version of that, it doesn't have that same effect. So, like I'm sure they might take a swing at it now, but like I would I would imagine that this would be the most the",
            "start": 1409.12
        },
        {
            "text": "amount of bucks on a new version of that, it doesn't have that same effect. So, like I'm sure they might take a swing at it now, but like I would I would imagine that this would be the most the highest selling Crash Bandicoot, you know, that they'll have for if if they release another three more of them. Like, I just can't see. Well, I've I've heard so many good things about Crash Team Racing that I'd like to see someone try to re redo that or remaster of that. I never played it. So, was fun, but Cedar was fun when like everyone was making them and it was like not one of the [ __ ] ones cuz there were some really bad. There were some terrible Yeah. Car racers and like Sonic R and things like that which were like fine. Um, now back to your Sonic comment. Have you played Sonic Mania? No. Sonic Mania is fun. Like Sonic Man and like I'm I'm a guy who was grew up a Sega kid so I you know just blindly Is that out? No, no, no. It's coming out uh July something I believe, but you can look it",
            "start": 1451.44
        },
        {
            "text": "Mania is fun. Like Sonic Man and like I'm I'm a guy who was grew up a Sega kid so I you know just blindly Is that out? No, no, no. It's coming out uh July something I believe, but you can look it up on the internet or you can just go to kind of funny.com/ you were wrong and tell us. But he's already doing it. So I've seen a bunch of videos of it and that's that's basically like maybe the only way I could see a new one working is if it's identical cuz it'll scratch that nostalgia edge. But even in terms of gameplay, like have you have you gone back and played Sonic anytime recently? I mean it's [ __ ] impossible to play those games. Yeah. Yeah. Well, it's just running and it's like okay. But like playing Sonic Mania was the first one where I felt like there was the different pads and I was like okay. I understood in a way as a kid I don't think I did get cuz as a kid I was like how many rings can I get and let's get through this you know how fast can I complete this level exactly you",
            "start": 1489.84
        },
        {
            "text": "like okay. I understood in a way as a kid I don't think I did get cuz as a kid I was like how many rings can I get and let's get through this you know how fast can I complete this level exactly you got to go fast August 15th thank you very much for that uh and then yeah shout out to Friday 13th continuing to go uh PlayStation VR games top 10 number one Arizona Sunshine Launch Edition number two okay Star Trek Bridge Crew number three PlayStation VR worlds number four until Dawn five Batman six job Simulator seven Mortal Blitz which I'm not familiar with uh Number eight, Ancient Amulator, which we talked about coming out recently. And then number nine, Ghostbusters in is hiring Firehouse, which I still haven't played cuz so many people were like, \"Greg, don't do it. It'll break your heart.\" Cuz it's like whatever. 20 bucks for 15 minutes or something. And then number 10, Tumble VR. Mortal Blitz is a Time Crisis clone. Oh, okay. According to this, it's not what I thought, which was a",
            "start": 1522.4
        },
        {
            "text": "Cuz it's like whatever. 20 bucks for 15 minutes or something. And then number 10, Tumble VR. Mortal Blitz is a Time Crisis clone. Oh, okay. According to this, it's not what I thought, which was a mix between Blitz, the League, and Mortal Kombat. Mortal Kombat. Uh, interesting there. Uh, Arizona Sunshine, we did a let's play. You can check it out on kind of funny.com. Have you played on PlayStation VR? I played it on Vive that we played on PlayStation VR and it was like not that much fun. And the gun was super jittery and I'm like, \"Oh, it's because the studio lights and we turned everything off and it still wasn't great.\" And then I put up the thing and I put up the review or the review I put up the let's play and that was the thing of like going to the comments to see am I going to get punched over and over again if I [ __ ] it up and everybody was like I played it on Vive and that's the way this is not a great version of it. Yeah. Yeah. And then Star Trek Bridge Crew I haven't",
            "start": 1562.0
        },
        {
            "text": "get punched over and over again if I [ __ ] it up and everybody was like I played it on Vive and that's the way this is not a great version of it. Yeah. Yeah. And then Star Trek Bridge Crew I haven't played on PlayStation VR but that was our first party mode on youtube.com/confunn. I got to check that out. Is that's crossplay as well, right? So, Oculus Vive and PlayStation. I believe everyone's able because I heard somebody saying that uh you can see you can notice the Vive people because they're like woo with their hands. We got their fingers doing all the different stuff. Yeah, [ __ ] you PlayStation. Yeah, we played No, that's you say [ __ ] you PlayStation. It's fine. Uh we played it. Yeah, the same thing on PC. I assume Vive I forget. And yeah, it was like awesome doing that. I don't know how it would work as well with the move wands or whatever, but good to see people taking chances. I forget. Do you care about VR? I do. I have a Vive. I'm I'm I'm in. I have to care about VR",
            "start": 1598.32
        },
        {
            "text": "know how it would work as well with the move wands or whatever, but good to see people taking chances. I forget. Do you care about VR? I do. I have a Vive. I'm I'm I'm in. I have to care about VR now. Um yeah, it's in a bit of a weird spot at the moment. It it's had its second push and now we're waiting for the third thing and it's kind of stalling a little bit. So yeah, I'm interested to see what the next six months are going to be like. I mean, there was nothing at E3 basically. What a time there was tons of stuff at E3, was there? Yeah, PlayStation puts stuff up on their stage. And then I was surprised when I went to Judges Week, the I went and played Echo Arena. I played all these different VR games like, \"Oh, you guys are still making these?\" I because I was going I thought it was Yeah, I I was half expecting going to PlayStation. uh via our press conference and have them say nothing about it, right? Or like I said, I predicted five at the end there, but and we got them. So, in a",
            "start": 1633.84
        },
        {
            "text": "I I was half expecting going to PlayStation. uh via our press conference and have them say nothing about it, right? Or like I said, I predicted five at the end there, but and we got them. So, in a weird way, my brain like shuts off the PSVR stuff cuz I don't own it, which is really weird cuz I know the games are basically the same like or there's a lot of crossover. There's like 80% or something of the games are on everything cuz they have to be. Uh but for whatever reason, yeah, it's the type of thing where I keep going back to price one and I'm like, but how can I justify a second one? you know, maybe if the price dropped enough, which we'll get to, I'm sure, because one of them sure sure enough has. Um, yeah. So, for whatever reason, my brain in that console worry way just kind of goes. And that's what's interesting I still feel about this VR thing is that I like, you know, I talked about it, I think, with Andre on one of these shows is the fact that over on the kind of funny",
            "start": 1665.76
        },
        {
            "text": "goes. And that's what's interesting I still feel about this VR thing is that I like, you know, I talked about it, I think, with Andre on one of these shows is the fact that over on the kind of funny subreddit, a person had put up a question was just like, \"No [ __ ] Like, how do you feel about your your VR purchase?\" And everybody was like, \"I use it here and there and I like it.\" Like, it wasn't like it isn't sour grapes. I feel like the people who had the disposal income and the desire to pick this up picked it up with no false pretenses of oh yeah I'm going to get it and I'm going to get a million AAA you know I mean I'm going to pick it up use it every week there's going to be all these different experiences and we're all going to [ __ ] about how there's too many wires to set up ah it's too you know such a pain in the butt to do all this so I don't that's how I feel where I'm just like I'd love to play some of these games but I don't feel like dragging it all out right now. It's",
            "start": 1702.88
        },
        {
            "text": "too you know such a pain in the butt to do all this so I don't that's how I feel where I'm just like I'd love to play some of these games but I don't feel like dragging it all out right now. It's one of those things where you don't view very often but when you do it like it is significantly like more enjoyable. There is like a moment to It's like going out to a movie. You know, you're like going out to a movie and you're like there's something about just the whole like, you know, settling into your chair. Yeah. Like the experience. And for whatever reason, I mean, a year into owning a a VR headset, I still really enjoy that. And like, and it's really silly cuz the the most enjoyable thing you can do with VR is still show someone else VR, but it's still as enjoyable. I still get a massive kick whenever we people over and and give them a go of Google Earth. And that is the thing about it where in there for every game I I boot up good or bad like it is that thing of like oh man I told",
            "start": 1737.52
        },
        {
            "text": "kick whenever we people over and and give them a go of Google Earth. And that is the thing about it where in there for every game I I boot up good or bad like it is that thing of like oh man I told you you're suddenly not I'm suddenly not in the studio. I'm suddenly not in my living room. I'm in you know Faroint I'm in this giant world with his gun. It's like all right this is Zona Sunshine was a regular first person shooter. I feel like yeah exactly what some zombie game opening trunks. Yeah, but for whatever reason that whole thing is still like super I mean it's probably the reason why there's still like a million and one different shooting gallery games coming as well. And that was the thing at uh running through a bunch of them at uh Judges week for before E3 where Yeah. I don't remember which one, but it was one of the gun games I did where I was like, \"Oh man, I'm I'm playing, you know, on an Oculus or whatever. I'm using all these the animations are smooth, the guns are cool,",
            "start": 1770.0
        },
        {
            "text": "which one, but it was one of the gun games I did where I was like, \"Oh man, I'm I'm playing, you know, on an Oculus or whatever. I'm using all these the animations are smooth, the guns are cool, and it's just like I would never buy this, but it's like it's fun to play right now. I'm having that experience of like, oh, this is cool and whatever, but it's like I'm anxious to get over that hump and have, you know, more exper I think I Resident Evil 7 I thought was great. Resident Evil 7 so far is the best PlayStation VR thing. That's the problem. That's the game that makes me want to buy it. Have you played Super Hot VR? Uh, no. I love Super Hot. Oh, best VR game. Unbelievable. I played it right before E3 and I love Super Hot. It's a totally different game in VR. It is It is the best VR game I have played by a [ __ ] country mile. Excuse my Irish. No, that's fine. That's the one though that when they announced that a couple weeks ago, it's coming to PlayStation VR and I was like, \"Fuck",
            "start": 1810.32
        },
        {
            "text": "I have played by a [ __ ] country mile. Excuse my Irish. No, that's fine. That's the one though that when they announced that a couple weeks ago, it's coming to PlayStation VR and I was like, \"Fuck yes, done, Ian.\" Like, cuz I love Super Hot period. We done we had done let's plays of it back in the day. And so, Imagine how cool you remember how cool you felt playing that game. Imagine cool you feel when you're literally catching the guns and like throwing them and like just going you just like cut two video of you doing it in your watch. Yeah. Exactly. Exactly. Exactly. Punching Kevin in the head by accident. Not by accident. Number three on the roper report. Ding ding ding. Mega maker is a thing. This is Mega Man but Super. It's Super Mario Maker but Mega Man. Super Mega Man Maker, I guess, is what it would be. Maker Fair, right? Making a fair. It's like a management game where you're No, no, no, no. You're making Mega Man the games. You're making Mega Man games here. Yeah. Mega Mega",
            "start": 1845.84
        },
        {
            "text": "is what it would be. Maker Fair, right? Making a fair. It's like a management game where you're No, no, no, no. You're making Mega Man the games. You're making Mega Man games here. Yeah. Mega Mega Man. I'm going to read number nine. No somewhere. Call Mori Arti just rolled over in his bed. Uh, I'm going to read GameSpot's synopsis here. Sure. There's been a lot of news about fan-made recreations, tributes, or sequels to popular game stories. And recently, a trailer showed off a pretty awesome Mega Man fan game that's coming this week called Mighty Number Call. Shut up, Danny Odwire. Call the Mega Maker. It's meant to be a Mario Makeresque title for the Mega Man series, and it's currently scheduled to launch on July 15th. From the short look in the trailer, the game seems really cool. It allows players to build levels using the assets from the first six Mega Man games, and it contains 12 bosses you can choose from. It has its own Mega Man-like soundtrack as well. You can watch the",
            "start": 1885.84
        },
        {
            "text": "It allows players to build levels using the assets from the first six Mega Man games, and it contains 12 bosses you can choose from. It has its own Mega Man-like soundtrack as well. You can watch the trailer below. It's over on GameSpot, or you can Google it, too. It's a good trailer. Uh, the team of fans working on the game cannot charge for it as that would violate Capcom's copyright terms uh, since it uses Capcom made assets. Mega Makaker's website makes sure to say that the assets are property of Capcom as well as that the team won't commercialize the game. However, the developer is taking donations through a Patreon campaign to help fund the server costs. They're up to $26 right now. It will be interesting to see how much more they get. Let's make it 30. Dude, I'm I'm I'm not even a Mega Man fan and I watched this trailer. was like, \"Oh, this is [ __ ] really cool.\" Uh, Capcom could still shut this down. As we've seen, many of the fan games in recent years, titles that originated",
            "start": 1926.0
        },
        {
            "text": "Man fan and I watched this trailer. was like, \"Oh, this is [ __ ] really cool.\" Uh, Capcom could still shut this down. As we've seen, many of the fan games in recent years, titles that originated as Nintendo games are particularly vulnerable, as Nintendo has shut down Legend of Zelda, Breath of the Wild, 2D remake, Pokemon Prism, and Pokemon Uranium, among others. Again, this launches July 15th. Danny, what do you think of this idea? I think it's great, and I've just got them to their next goal of $30. Oh, you you gave them four bucks to get them up. [ __ ] yeah. Nice job, Dunzo. Now, now watch the Capcom lawyers come running. Yeah. And well, that's the thing is like I I mean I know Capcom has always had a different take on all of this stuff, right? Like that was the thing I remember when the first time I ever interviewed Megaan and hearing his story, right? Where he got that email from Capcom and he's like, \"Oh, fuck.\" And instead it was like, \"No, can we work with you on this?\" Like",
            "start": 1965.44
        },
        {
            "text": "the first time I ever interviewed Megaan and hearing his story, right? Where he got that email from Capcom and he's like, \"Oh, fuck.\" And instead it was like, \"No, can we work with you on this?\" Like this is cool. Community they have a Yeah. They're interested in people vibing off of their stuff in a way that like people especially like not to to paint everyone with the same brush, but especially in a way that we in the west consider Japanese developers to be quite slow on the uptake with especially you know Nintendo. Um yeah. So and there was that other the Mega Man when Colin always used to tell the story how when Mega Man's anniversary was coming around the fans were making a game and Capcom totally was ignoring it and then I think they published the fan-made game, right? Wasn't it? Oh, really? I thought so. That sounds familiar to you, C. goodness. We kind of funny.com/you wrong or I want to say it was Street Fighter cross Mega Man something goofy like that or whatever. Uh and",
            "start": 2003.68
        },
        {
            "text": "Oh, really? I thought so. That sounds familiar to you, C. goodness. We kind of funny.com/you wrong or I want to say it was Street Fighter cross Mega Man something goofy like that or whatever. Uh and they did it whatever. I I think Capcom will let this one stand cuz the trailer I urge you all to go watch it. Like it actually looks really good and it's really interesting. I didn't know it was fan. When I watched the trailer I was like, \"Oh, this actually looks like a, you know, cool throwback trailer for what they're making.\" And it's a real no-brainer of a like I'm not a huge Mega Man, but like the idea of those games was always like let's take different weapon types. Let's take different bosses, enemies, level types, and we're going to mix them around in different interesting ways. And like handing control over to players to do that like fits in almost the exact same way the Mario games. 100%. Yeah. And that was the thing of watching you immediately get it of like they shows them",
            "start": 2041.6
        },
        {
            "text": "like handing control over to players to do that like fits in almost the exact same way the Mario games. 100%. Yeah. And that was the thing of watching you immediately get it of like they shows them putting a platform and then drawing out a line and it follows the line. You're like, \"Oh yeah, that makes perfect sense.\" Especially for a game Mega Man that always wants to test your metal and can you get through this and can you do without getting hit? I think Capcom will let it go because I feel like it's not a game they could publish cuz it's or make and maybe they could pick it up now, but it is one of those things that's so blatantly a copy of Super Mario Maker. Like do you want to take that on? Do you need that kind of [ __ ] But like they could just let this go and hopefully it inspires people then to go back and remember pick up, you know, Legacy Collection and now Legacy Collection 2. Yeah. I don't know. Like I I feel like my only worry would be that this was something that they",
            "start": 2081.12
        },
        {
            "text": "people then to go back and remember pick up, you know, Legacy Collection and now Legacy Collection 2. Yeah. I don't know. Like I I feel like my only worry would be that this was something that they had written on a chalkboard somewhere, right? As as a maybe we could do this because this definitely does like cut cut them off in respect of that. Um and yeah, I don't know. Like to me, I totally agree that this is look like something that that they're copying somebody else, but that's so pervasive in games anyway that like and Capcom are in a position now where they can probably just take any good idea that works, they'd want to run with it. Yeah. Um that the I mean the ideal situation here is that they actually pick this crew up and that they do it. That would be nice. And that would be and that would be Yeah. Right. A fantastic way of doing like All right, cool. Well, you don't have to put this out or maybe put it out and we'll put out a super version or whatever. But yeah. Yeah. I hope",
            "start": 2113.68
        },
        {
            "text": "would be Yeah. Right. A fantastic way of doing like All right, cool. Well, you don't have to put this out or maybe put it out and we'll put out a super version or whatever. But yeah. Yeah. I hope they do. That'd be fun stuff. And then check it out. Then here's another one. Now, the final story on the Roper Report. There's a Netflix for game launching and it's called Jump. IGN's Chloe Rad has an extensive piece I want you all to go read over on IGN.com. Best name in gamesw writing by the way. Chloe Rad. [ __ ] Yeah. Uh, I'm going to do some uh cherry picking, though. Read sections of it real quick, too. It's a lengthy one, so feel free to lay back, get a cocktail. Wait, how early is it? That's a bedtime story. It's a Monday thing. All right, here we go. A new ondemand subscription-based video game service called Jump is preparing to launch, offering an initial library of 60 to 100 indie games playable for a flat monthly fee of $9.99 per month. After a closed beta period running between",
            "start": 2151.68
        },
        {
            "text": "game service called Jump is preparing to launch, offering an initial library of 60 to 100 indie games playable for a flat monthly fee of $9.99 per month. After a closed beta period running between now and July 24th with a sample library of 10 to 20 games, the full service will offer unlimited adfree play time for its quote highly curated library with about 10 new games added each month for Windows, Mac, Linux, HTC Vive, and Oculus Rift. Jump includes all the standard features of a Netflix or Spotify style service, including a way to browse game, browse recently added games, recently updated games, games with new content, and sort games by genre. Leaderboards, achievements, cloud saves, matchmaking, and multiplayer are all handled through the third party service called Play PlayFab, which would most notably allow your saves to carry over onto new devices. Here's where it gets interesting, Danny. It's already interesting, but continue. Unlike most ondemand gaming services, which suffer",
            "start": 2187.6
        },
        {
            "text": "would most notably allow your saves to carry over onto new devices. Here's where it gets interesting, Danny. It's already interesting, but continue. Unlike most ondemand gaming services, which suffer from poor latency due to their reliance on cloud streaming technology, PlayStation Now, Jump uses a web-based technology that allows them to launch the games directly in the Jump client. That way games don't need to in don't need to fully install on a user's hard drive and instead run locally by only pulling the assets they need. That's huge. That means that they're it's downloading game but like peace meal. Yeah. As you what you would need as you need it. Like it's going to be a little bit ahead of you. I assume getting it down. So the final cutscene will come. Yeah. Buffering. Uh the jump CEO said in the article, quote, \"We work with developers specifically to make sure they're bringing their game to us in the right time in their life cycle. We want to we want them to run their premium",
            "start": 2232.96
        },
        {
            "text": "said in the article, quote, \"We work with developers specifically to make sure they're bringing their game to us in the right time in their life cycle. We want to we want them to run their premium sales cycle on Steam or Xbox or wherever. And once those sales dip off to a certain point, then it's a better time to bring bring it over to us. Revenue is added up according to play time for an individual game, which the CEO estimates to be about 25 to 50 cents per 1 hour of player user time or play time per user. quote, \"We take just se we take just 70% of the full revenue and we pay that to the developer based on the amount of time that their game got played over all over overall the total minutes of gameplay.\" Uh, then this So, they take 70% of the revenue and that 70% gets split or I think that's what he's saying. I think I think it's a weird wording. I'm going to read it again. We take we just take the 70% of the full revenue and we pay that to developers based on the amount of time",
            "start": 2272.96
        },
        {
            "text": "that's what he's saying. I think I think it's a weird wording. I'm going to read it again. We take we just take the 70% of the full revenue and we pay that to developers based on the amount of time that their game got played. So, sounds like their cuts 30. Jump takes 30, developers get 70%. We just we just take 70%. No big deal. Uh this is another guy who I didn't get his title written down. The Peterson has said that uh it brings the issue of Steam refunds in the gray market. Steam keys sold on third party uh sites costing developers money. Quote, \"With Jump, there's no potential scenario where a user could play for two hours and then just refund it. The developer gets paid no matter what.\" Right. What do you think, Danny? Oo, I have some I have some like feelings about this. Um, I'm like a big I'm very anti like the race to the bottom that we see with all media. Um, and especially with games I think because games take small team like small games especially take small teams years of",
            "start": 2316.64
        },
        {
            "text": "a big I'm very anti like the race to the bottom that we see with all media. Um, and especially with games I think because games take small team like small games especially take small teams years of their life. Yeah. And you know right now the indie marketplace is a complete hellscape because you know it's overloaded with games. Totally. It's become so much easier to make them. um college graduates are now using indie games as a way of building their portfolio instead of what was usually the way of they would join a major studio and kind of get some experience that way. Um so it's kind of like flooded the marketplace in a way that is great for us because it means that the cream of the crop is incredible um but really difficult for for indie devs. So what when I see what is essentially you know Spotify is a bad deal for most artists. It's really good for people who have old cataloges or they're monetizing through regular radio ones as well. Although also sometimes not great for them in",
            "start": 2357.28
        },
        {
            "text": "know Spotify is a bad deal for most artists. It's really good for people who have old cataloges or they're monetizing through regular radio ones as well. Although also sometimes not great for them in the case of all the Taylor Swift stuff and but for the majority of musicians it's not particularly great at all. Um even worse in radio which has gotten really terrible. So that's I feel like is not great. And then when I look at something like Netflix, again, it's really good for long form big serieses, which is what most of the bread and butter on Netflix is. For individual movie, you know, developers and people who are putting out indie movies, it's not really great at all either. So, when I see something like this, I'm like, \"Okay, we've created basically the same marketplace that doesn't benefit those, but they're only focusing on indie games.\" And I was looking at some of the games. You kind of I couldn't really see exactly which ones, but I was watching some of their trailers to",
            "start": 2403.12
        },
        {
            "text": "benefit those, but they're only focusing on indie games.\" And I was looking at some of the games. You kind of I couldn't really see exactly which ones, but I was watching some of their trailers to see what games they were talking about. And these were like the games that they're launching with. I don't want to I haven't seen them all yet. That's why I can't say for sure, but from what I looked, they didn't look like very notable indie games that I would have maybe bought and would have considered playing. So, I I feel weird about it because I like the part where he says, \"Look, we're not trying to take away from their their first sales cycle. That's super important.\" Um, the traditional way for many indie games to then get secondary um uh sales is to wait whatever the amount is. I think it's something like 2 months um before they can change their price on Steam again and then push themselves into a sale or use the summer sale for instance to to get a bit more promotion uh that way and",
            "start": 2448.0
        },
        {
            "text": "something like 2 months um before they can change their price on Steam again and then push themselves into a sale or use the summer sale for instance to to get a bit more promotion uh that way and and get more and and you will find that a lot of indie devs sell more in their first sale than they did at the launch. Yeah. Um because well now you got word of mouth, right? The fact that this game came out, people really liked it, but I didn't want to invest the 20 bucks in it. And now you get there, you know, oh it's only $10 now. I've heard enough about this. I know because you've had like all the evangelists who bought it on day uh of launch or week of launch have been talking about it for two months. Yeah. It's what's interesting about this program for Jump is the fact that I like what they're saying but I feel like expectations might be out of whack and the fact that it's going to be okay cool I'm getting it but the way they're describing it right is the fact of like literally when",
            "start": 2485.92
        },
        {
            "text": "saying but I feel like expectations might be out of whack and the fact that it's going to be okay cool I'm getting it but the way they're describing it right is the fact of like literally when you've exhausted all your other options for a game bring it to us. And it's like, well, if I'm signing up for it, are people if I'm signing up for Jump and I know it's like this indie game, Netflix, great. But I get in and all these games are 5 years old and there's they are stuff that like I either played already or I don't I never was interested enough to do it. Are you going to give that $10 a month every time? Cuz it's like Xbox games library, right? I think that's a really great service that they're doing, right? And and I like PlayStation Now. Yeah. You know, PlayStation Now need to fix the time. Exactly. Exactly. But I think PlayStation now is so nickel and dimming you of like do you want this and okay blah blah whereas Xbox games pass games pass right is it's so easy of just like hey",
            "start": 2522.64
        },
        {
            "text": "time. Exactly. Exactly. But I think PlayStation now is so nickel and dimming you of like do you want this and okay blah blah whereas Xbox games pass games pass right is it's so easy of just like hey here it is download these games and again you're downloading to your system you're not having to worry about streaming latency and all that jazz it for that it makes more sense in the fact of hey here is this back catalog of stuff you might have missed and that we think is cool and worth it blah blah blah that's interesting if I missed part of the generation or if I you know I'm just getting into games like you know we I think most people. It's the the weird thing about the Xbox Games Pass is just the fact of it's such a cool idea on paper, but then I just don't know how many of us would use it or need to. If you're if you're watching this show, you're so into games, like I guess it's possible that you're going to see stuff on there and be like, \"Oh, here's a bunch of like mid-tier games",
            "start": 2560.08
        },
        {
            "text": "it or need to. If you're if you're watching this show, you're so into games, like I guess it's possible that you're going to see stuff on there and be like, \"Oh, here's a bunch of like mid-tier games or things I heard good things about, but I never want to invest any real money in, so why not jump into but like look at game video game playing in 2017 or like the patterns that we have as as consumers and also of players of of games. And look at what happened to mid-tier games. I mean, look what's happening this year. We've got like like like a half dozen different games that require you to play like 60 plus hours that have already come out this year. Like none of us are like looking for a game to score. I got some time to kill. You know what I mean? What can I play this weekend? There's nothing out. And what's happened is games have basically created smaller game um you know experiences that fill in those gaps. So you've got your big long games and then for a lot of people you've got",
            "start": 2597.28
        },
        {
            "text": "out. And what's happened is games have basically created smaller game um you know experiences that fill in those gaps. So you've got your big long games and then for a lot of people you've got games like for instance Friday the 13th Player Unknowns Battlegrounds Rocket League games where you can jump in and play I'm going to knock one out in like 20 minutes and then maybe I'll go do something else. So like the way we play games is about playing the best games all the time but finding where they like slot in like none of us are like looking for smaller games that we wouldn't have played otherwise. The the only reason I can see this working for some people is if for instance you had like you know a young you know daughter or son who wants to play games and you could just go here's 10 bucks a month you're on this service play whatever you want because then the expectation of a younger player is probably not as high and variety I think when you're a child and you have all that spare time",
            "start": 2634.32
        },
        {
            "text": "a month you're on this service play whatever you want because then the expectation of a younger player is probably not as high and variety I think when you're a child and you have all that spare time is probably a lot more valuable than it is when you're an old crony like us and we just want to have the best thing all the time and that and that's the whole thing of like even when you know I'm in college and I'm thinking about me when I had you know no you know disposable income or whatever Sure, I'm missing games that are coming out and I'm like I always heard good things, but then it was the thing by I was still investing my $60 into something I really wanted to play and they were immediate experiences. So, if it is I'm a college student nowadays and I have $10 to spared, am I giving it to Xbox? Am I giving to these guys? Am I trying to play these games? or am I hoarding those $10 to get to the point where hey I can buy Persona 5 or hey I can buy you know the next big thing this fall",
            "start": 2672.56
        },
        {
            "text": "Xbox? Am I giving to these guys? Am I trying to play these games? or am I hoarding those $10 to get to the point where hey I can buy Persona 5 or hey I can buy you know the next big thing this fall because there is no meaningful alternative to what a lot of us used to use which was like Blockbuster or Gamefly or something which was great which is like great I'll just you know as long as I get there first thing on a Friday or I guess Tuesday for you I'll stick in my you know6 and I'll be able to get this game for a week calling blockbuster you got any copies you got any copies they're like shut up we don't care about video games yeah exactly this will be your end this will be your end I'll put you out of business one day. Danny. Yes. Do you know what's coming out today? Uh, I do cuz there's a list in front of me. Mhm. What is that list called, Danny? I don't know. It's the official list of upcoming software across each and every platform is listed by the kind of funny games daily show",
            "start": 2709.04
        },
        {
            "text": "a list in front of me. Mhm. What is that list called, Danny? I don't know. It's the official list of upcoming software across each and every platform is listed by the kind of funny games daily show hosts each and every day. My throat hurts. I wasn't willing to take it on the first. I'm I got no upper register from screaming at RTX all weekend. Okay. So if I start lower the official list of upcoming software across each and every platform as listed by the kind of funny games daily show hosts each and every day out today anti-hero on PC I anti-hero for if you're in Europe I put another one on there but that's tomorrow I put I'm very excited for this fire pros I put it on there but that's tomorrow it's the 11th everybody hold your I couldn't believe it when you wrote that down I thought that was like oh that's like the default list you put in when you read the the running order the first time. No, I got so excited cuz I knew it was this week. Yeah, exactly. Exactly. I wrote it in so I",
            "start": 2747.76
        },
        {
            "text": "was like oh that's like the default list you put in when you read the the running order the first time. No, I got so excited cuz I knew it was this week. Yeah, exactly. Exactly. I wrote it in so I didn't forget. Firef Wrestling. Uh then for new dates for stuff to keep you updated, Neo DLC is coming out July 25th. Uh Battlefront Star Wars Battlefront 2's open beta is October 6th, but it's the 4th if you pre-order. Thimbleweed Park, Ron Gilbert's [ __ ] game coming to PlayStation 4, I think on PC. Did you play it? Um I played like the first hour or so. I liked it. Just not gone back to it. PlayStation 4 August 22nd. I'm very excited about that because I was when they hit me up like, \"Hey, we have review code for Xbox One.\" I was like, \"Great, give it to me.\" And it was like a million things were out obviously, so I didn't play it, but I was like, \"I'll get to it.\" And now it's on PlayStation 4. I'm like, \"I'll just wait.\" Like everything I super wanted on Switch. Yeah, exactly. I know.",
            "start": 2790.32
        },
        {
            "text": "were out obviously, so I didn't play it, but I was like, \"I'll get to it.\" And now it's on PlayStation 4. I'm like, \"I'll just wait.\" Like everything I super wanted on Switch. Yeah, exactly. I know. I know. And that was my thing too with PlayStation 4 even. I was like, \"Is it VA?\" Because it could run on a VA text be small. Uh, and then Dragon Ball Xenoverse 2 is coming to the Nintendo Switch on September 22nd. Bandai Namco says, \"Sweet.\" Uh, deals of the day. You mentioned this earlier. What a deal. Over on Amazon, you can get the Oculus Rift and Touch its Touch controllers for $399.99. 400 bucks. Usually, it's $600. So, that's $200 price cut for you. That's pretty good. Go jump. You won't go lower than that. Now, do you have the Vive? You don't have the I have the Vive, but I use the touch controllers. Um I did a we interviewed Palmer Lucky and I did a demo of when they had the original ones where they were doing the black box. It was the most amazing thing I've ever done. So, they",
            "start": 2826.08
        },
        {
            "text": "controllers. Um I did a we interviewed Palmer Lucky and I did a demo of when they had the original ones where they were doing the black box. It was the most amazing thing I've ever done. So, they are better than the Vive controllers. Oh wow. Um, and I mean the Vive is like a grand all in because you got lighouses and all that stuff. I'm not sure what else you'd need to buy with this to get it to work. Maybe you need to get light the camera probably is maybe not involved in this to to do the room space stuff. Um, but yeah, that's that's amazing. 400 bucks. That's You can't really You know, you could buy an Xbox One X for that. Could you even notice 500? How much is that? I don't know. Xbox One X. Oh, Xbox One X500 500. It was like, what's the most outrageous price point? It's that price. Yeah, that's the price point. It is. Uh, let's jump into reader mail. Cool. Mail call. See what you guys have to say. Remember, of course, you need to be part of this show. I need you to go to kind",
            "start": 2862.88
        },
        {
            "text": "Yeah, that's the price point. It is. Uh, let's jump into reader mail. Cool. Mail call. See what you guys have to say. Remember, of course, you need to be part of this show. I need you to go to kind offunny.comkfgd. There you can leave your questions each and every day. I gather them each and every morning. So, whatever the news is, make questions about that. You can also leave your bad PSN names. You can leave your Xbox Live names if you need somebody to play with. But right now, we're going to jump into the questions. Where do I want to start, Danny? I like that first one cuz he mentioned my name instead of calling me Andrea. Like that last [ __ ] [ __ ] workman. All right, we'll start there. Uh, Majid says, \"Hey, Greg and Danny, finally finally that you're here.\" Uh, I don't hear you guys talk about Py enough. What's the excitement level for Super Giants game? Uh, what's excitement level for Super Giant Games is upcoming Indie Darling. Hopefully, I'm stoked for it and plan to get it",
            "start": 2900.96
        },
        {
            "text": "talk about Py enough. What's the excitement level for Super Giants game? Uh, what's excitement level for Super Giant Games is upcoming Indie Darling. Hopefully, I'm stoked for it and plan to get it day one. Glad to have Kind of funny games daily back in my routine. We're happy to be back after a week off. Py is that thing where I forget about it all the time and we did a let's play of it and I see it every packs and I'm like, I'm in. I love Super Giant. Yeah. So, it's like, yeah, that looks awesome. Totally. I'm the same. Transistor um uh was one of my favorite games that came out that year. I got a big poster of it in my room. Love the soundtrack. I adored it. I hadn't played Bastion really at all. So, I think I enjoyed Transistor way more than most people did because See, that's the thing is I felt like there was that breaking point of like I was a huge Bastion fan. Still am. You know what I mean? When it came back came back to V, I played it again and it was that he's overpowered,",
            "start": 2939.44
        },
        {
            "text": "is I felt like there was that breaking point of like I was a huge Bastion fan. Still am. You know what I mean? When it came back came back to V, I played it again and it was that he's overpowered, but it's fine. Exactly. Exactly. And so, it was fun to play and then it was like, oh, Transistor came out and I was super stoked for it coming up to it and then when it came out, it was the same thing. It happens to me all the time. Put in like 3 hours and then got distracted and came back and couldn't remember how to play really and I was like, \"Yeah, I liked it enough.\" It was and I did I'll get back to it one day and I've never no chance. It's one of those games was like a little bit outside my comfort zone. So I like plowed through it to make sure cuz I knew I wouldn't finish it if I hadn't otherwise. But Py is like a totally different type of game. It's like a weird like football. Yeah, exactly. It's like a sport element to it. RPG and the story about it. I'm like, \"All right, cool.\"",
            "start": 2976.8
        },
        {
            "text": "otherwise. But Py is like a totally different type of game. It's like a weird like football. Yeah, exactly. It's like a sport element to it. RPG and the story about it. I'm like, \"All right, cool.\" Like yeah, I'm into it. But I just it's like it's for me it's one of those games where it's just like all right, Blackout. Same thing with [ __ ] Below. Just I don't know what the hell's going on with Below, but don't tell me anything else about it till you have a release date and then I'll play it because I don't want to know anymore. I don't need to see anymore. I forgot that wasn't. Every time I see Nathan Valer, come on. Every time I see Vela, I give him [ __ ] for it. He's like, I had a kid. I'm like, whatever. Stop having kids. DHC Canada wrote in to kind offunny.com/kfg just like you can and says, \"Should multiplayer betas occur closer to or further away from the game's actual release date, or do you believe it's fine either way? Both the Battlefront 2 and Destiny 2 betas give the",
            "start": 3007.12
        },
        {
            "text": "and says, \"Should multiplayer betas occur closer to or further away from the game's actual release date, or do you believe it's fine either way? Both the Battlefront 2 and Destiny 2 betas give the teams a little over a month to work on anything found during the beta before the game launches. There's like two types of betas. These are marketing. Yep. This is like these are demos. This is the demo of why you should play this game. And we're not saying that like they're not going to add in feedback, but it's a totally different kettle of ballparks to say, I don't know, let's look at early access games even like they're all ultimately player on battlegrounds. the the way that game is getting shaped is based a lot on feedback from players. Um but then like other you know betas that you get like the comedy a year before or like six months before um trying to think of like things like Overwatch for instance like that was a good you know situation where the team was essentially all in on",
            "start": 3038.68
        },
        {
            "text": "like the comedy a year before or like six months before um trying to think of like things like Overwatch for instance like that was a good you know situation where the team was essentially all in on reacting to what was going on and then they were applying patches doing feedback doing uh um sort of Q&A and stuff with the community at the same time. So they're two different things. Um, I think the problem is that the word beta has become this sort of like anything before the game came out kind of thing. Um, but I think once you have that expectation of like ultimately the game you play a month before comes out in the Battlegrounds beta or Battle Battlefront beta or Destiny is like that's 99.9% of the game you're going and that's the thing why it's like with these betas I I so rarely touch them, right? Because I just don't want the game spoiled for me. You know what I I don't need to play. I did with back in the day the DC Universe online beta which you know was like a rough thing but",
            "start": 3081.36
        },
        {
            "text": "them, right? Because I just don't want the game spoiled for me. You know what I I don't need to play. I did with back in the day the DC Universe online beta which you know was like a rough thing but it was the same thing of finally getting the game and having to play through that 20 hours of content again. I was like this kind of sucks you know all over again. Yeah. I'm the exact same. I've had that like it depends cuz some games obviously that doesn't matter so much but like yeah when Overwatch went back in and I got hit back to zero it was like I got unlocked. Exactly. and that and but it's a really interesting thing and I think it's uh lost a little bit in the narrative but I remember Destiny having such a crazy reveal of like oh my god Destiny and then it I always felt like Destiny kind of lost some of its momentum and then they put out their beta and I played it and I was like holy [ __ ] this game's awesome and suddenly I was stoked for Destiny. It does work. Yeah, it definitely",
            "start": 3122.24
        },
        {
            "text": "of lost some of its momentum and then they put out their beta and I played it and I was like holy [ __ ] this game's awesome and suddenly I was stoked for Destiny. It does work. Yeah, it definitely fans the flames and it gets people talking and it gets people excited, especially when it's something new and different. And for Star for Star Wars, people will be all over it want to do it and they need to stress test servers and stuff like that as well, which never works. Of course. Yeah. Yeah. Now, I'm so sick of that being the excuse for betas. It's like, well, it's not going to work. You they put these damn things out and this always blows up on launch day anyway. You want it to not work almost. But remember, Destiny 2, we'll be playing here launch day, me and Andy. When's it out? God, why do you keep doing that to me? Sorry. No, I want to say September. Look it up. But I want Don't Don't tell me. I'm thinking September 7th, but this is a good guess. Prices rent. Oh god. What if I told",
            "start": 3159.12
        },
        {
            "text": "do you keep doing that to me? Sorry. No, I want to say September. Look it up. But I want Don't Don't tell me. I'm thinking September 7th, but this is a good guess. Prices rent. Oh god. What if I told you September 7th was a I'm guessing a Wednesday. Then I I guess I would say September 6th. It's September 6th. It is September 6th. I was close though. That's all that really matters, right? Let me check if it was a Wednesday. That was impressive. It wasn't October for sure. Like Danny said, did I say October? Yeah. Go back on vacation. You know what I mean? September 6th is a Wednesday. I don't know. Games are weird now. They are weird. Put them out whenever you want. Yeah, and that's the thing. People are putting out things on Friday now here in the US. I don't like that one bit. Yeah, I like that. Ready for the weekend. I like I like it on a Tuesday torturing myself. I'm supposed to leave work early on a Tuesday. I know, right? Go get this game play. Usually it was like, you know, you",
            "start": 3190.48
        },
        {
            "text": "that. Ready for the weekend. I like I like it on a Tuesday torturing myself. I'm supposed to leave work early on a Tuesday. I know, right? Go get this game play. Usually it was like, you know, you do it and then maybe you had you like gotten the monkey off your back by Friday. You could still go out. You can still do something. Now you're shutting down. Do you do you work in retail? Uh I worked at I was cashier at Walmart for some reason. Okay. So, the worst thing I can possibly think of is going into work on a [ __ ] Monday and having the games coming out the next day cuz a Thursday in like the game I worked at GameStop before is like the worst day cuz that's when all the boxes come out and take all the discs out. Imagine on a Monday. It's upsetting. That's no good. That's no good. Retail's the future. It is not the future. That's a thousand% not correct. Uh the Calg wrote in to kind of funny.com/kfg with the final question of the show and says, \"Make it a good one.\" For years, I",
            "start": 3232.0
        },
        {
            "text": "the future. It is not the future. That's a thousand% not correct. Uh the Calg wrote in to kind of funny.com/kfg with the final question of the show and says, \"Make it a good one.\" For years, I would hear how people preferred the DS for its bite-sized gaming experiences. And what? Over what? Over well, he's let him Can Danny, let let the KG talk the I'll start again. Out of respect for the KG. For years, I would hear how people preferred the DS for its bite-sized gaming experiences and how it was perfect for their commute. They didn't want a AAA console style game like God of War on their PSP while they were on their way to and from work. And I get that. I didn't either. Fast forward 2017 and now people are celebrating how they can play the new massive open world Zelda game on the bus/ subway/air airplaneing. What changed? This isn't a Sony vers Nintendo thing. It's a console game on the go thing. I think you at the end you get it. Yeah, it's a console game on the go thing. Zelda is",
            "start": 3268.56
        },
        {
            "text": "airplaneing. What changed? This isn't a Sony vers Nintendo thing. It's a console game on the go thing. I think you at the end you get it. Yeah, it's a console game on the go thing. Zelda is not a Zelda is a game you play in five minute chunks. It's not The Witcher. It's not God of War, which is like a linear action game where you're race to the end. It's not Fallout where you're doing quests that last 25 minutes and have lots of story. Zelda is a game where you're basically like uncovering shrines, completing the shrines, which takes like 5 minutes, wandering around. There's very little like in terms of actual like story and chatter and things like that. you're not engaged in these types of things. It's not like where I took a giant Persona break and I'm coming back to it and I'm coming back like what was I doing and what was the story and why was I mad at this guy? You can't pick up Persona for 10 minutes. You can pick up Zelda for 10 minutes. The fact that you don't the fact that we",
            "start": 3319.36
        },
        {
            "text": "like what was I doing and what was the story and why was I mad at this guy? You can't pick up Persona for 10 minutes. You can pick up Zelda for 10 minutes. The fact that you don't the fact that we end up playing Zelda for like four hours in a row is because it's it's one of these games that is like, \"Oh, I'm going to go here. I'm going.\" It's basically a game of shiny things getting put up in your face and you deciding which one you want to do. So that's why it works that it's not like a traditional open world in the sense we think of things like Marowind or the Witcher or you know Skyrim or Fallout. It's not that type of experience where you're like you know that's like super difficult and has lots of buttons and has lots of things going on and multiple quests and all that. Like what are you really what quests are you want in Zelda? If you're ever on a quest even to like get things or do things, you're just fast traveling around the map. It takes like 5 minutes to complete anything",
            "start": 3366.0
        },
        {
            "text": "you really what quests are you want in Zelda? If you're ever on a quest even to like get things or do things, you're just fast traveling around the map. It takes like 5 minutes to complete anything in that game. Well, if you know, right? There's always the weird thing of like you're going to look for this guy and he's going to say this, but he could be anywhere. So, I think it's that thing where like instead of a game like if you went back to Persona, you're wonder where am I? What quest am I doing? What do I have to complete? In Zelda, you jump in and you're like, what was I doing? It doesn't matter. I'm going to go over there. And I think that's why it works. I think for the bigger question of like why are people excited for the switch in AAA sense in DS and byte size and that was the argument in PSP not is the fact that and I think you said it's a console on the go console game on the go thing in the fact that it's not even a console game on the go it's a console on the go jumping",
            "start": 3404.24
        },
        {
            "text": "in PSP not is the fact that and I think you said it's a console on the go console game on the go thing in the fact that it's not even a console game on the go it's a console on the go jumping back to the first news story from RERS report right when they put this here uh thanks to the Switch's on the go's capabilities it will also be the first portable WWE game available in 6 years even though I play my Switch primarily in handheld mode I don't Think of it as a handheld. And that's the thing is like Nintendo the, you know, when you're talking about the DS versus PSP, it's the fact that you played the PSP knowing you're playing a watered down console. This isn't going to be as powerful as my PlayStation 3, then eventually PlayStation 4 or whatever, or I'm sorry, you know what I'm saying, but it's not going to be powerful as my most current PlayStation. Um, applying to VA, but and the same thing with VA where it's like this is always going to be the redheaded stepson. It's never you're",
            "start": 3436.4
        },
        {
            "text": "it's not going to be powerful as my most current PlayStation. Um, applying to VA, but and the same thing with VA where it's like this is always going to be the redheaded stepson. It's never you're never going to give it all the attention and love it deserves. It's never going to be this thing. But Nintendo, the reason people are stoked about this on some level is the fact that, hey, this is all we got. This is the console and you can play it however the [ __ ] you want, but this is what it is and how we're going to do it. And that's what people are excited about is the fact that right now if my PlayStation 4 could be taken with me on the go. And I'd be like over the moon about it more than I already am about trophies and PlayStation. But it'd be like that thing of like for a life that is like you're going on the road for 2 weeks. I'm on the road for 10 days straight. Like I love having the Switch with me and I love being able to come home and plug it back in cuz it's the exact",
            "start": 3476.08
        },
        {
            "text": "is like you're going on the road for 2 weeks. I'm on the road for 10 days straight. Like I love having the Switch with me and I love being able to come home and plug it back in cuz it's the exact opposite of what we just talked about in the fact of I would [ __ ] be cruising through Persona right now if Persona could go with me everywhere. But Persona can't and that's why Persona 4 was such a great solution on the VA. But Persona 5 is me anchored to my PlayStation 4 and TV for 90 hours, which is really hard for me to do in this day and age with the exception of Friday the 13th where I make up all sorts of time. But Friday their 13th is a different experience because I can sit there and you know talk to Jen or do whatever and also [ __ ] around in this game and not have to worry about like wait why are they mad and what's going on? Well, I got to make a choice. Who's best girl? You know what I mean? Like it's a different experience. Totally. And I think you're you hit nail on the head",
            "start": 3510.32
        },
        {
            "text": "wait why are they mad and what's going on? Well, I got to make a choice. Who's best girl? You know what I mean? Like it's a different experience. Totally. And I think you're you hit nail on the head there which is that like Nintendo are bringing their agame to this. And also like Nintendo's first party a game like is better than Microsoft and Sony's first party a game. So it's like the best of both worlds. Well, Sony's first party a game is pretty good. Horizon Zero Dawn worked out cuz they took the leash off Guorilla for the first time in forever. Sure. We didn't get another Kill Zone. Yeah. Exactly. Exactly. Exactly. Do you think Nintendo's first party games better than Sony's personally? I think they're Yeah, I'd say so. Wow. Okay. I think they're they're level Don't get me wrong. I mean, the Nintendo first party quality is amazing. Like they do a lot of great stuff, but then it is that argument of like there's so many so many first-p partyy studios. I think usually they're pretty",
            "start": 3545.28
        },
        {
            "text": "the Nintendo first party quality is amazing. Like they do a lot of great stuff, but then it is that argument of like there's so many so many first-p partyy studios. I think usually they're pretty on point. So maybe it's a maybe it's an median quality over amount of quality. I'm aiming, you know. I see you're saying I see you're saying with a Nintendo game, you're always like, \"This is probably going to be pretty good.\" Sure. Okay. Yeah. Kirby looks great. Double Dash is a really good Mario Kart game. I don't know why people give you [ __ ] over this. Thank you very much. It's like a It's like a cuz a lot of these [ __ ] are Fran Mirabeller dick suckers out there. You know, they're just like, \"Oh, Fran can't be wrong. Fran was wrong with the 7.9. Never forget. Brown is wrong with his 4.0 for Friday the 13th. There are review scores I will die for now.\" Yeah. What was your first Mario Kart Double Dash? It was Yeah. Yeah. Might have been one of my first. Probably the reason why we love",
            "start": 3579.84
        },
        {
            "text": "for Friday the 13th. There are review scores I will die for now.\" Yeah. What was your first Mario Kart Double Dash? It was Yeah. Yeah. Might have been one of my first. Probably the reason why we love the first Mario Kart was your favorite. Well, it was also just cuz it was I mean like I thought the controls were so much better. It was just a better 3D space. You know what I mean? And that having the two item thing was always really interesting. Going back and trying like cuz that was the thing is like you know the Gamecube in our college house is owned by my friend Kyle. And every so often he'd go upstairs and just play 64 Mario Kart with our other roommates too. And I'd go up there and try to play. I'm just like this is clunky as [ __ ] compared to what we're playing downstairs. I can't do it. Great try. Great battle mode and you got rid of the red shell problem. Just always have a green shell. Yep. Always have Wario or Waluigi. Perfect team in that game hanging on their green shell.",
            "start": 3616.64
        },
        {
            "text": "it. Great try. Great battle mode and you got rid of the red shell problem. Just always have a green shell. Yep. Always have Wario or Waluigi. Perfect team in that game hanging on their green shell. Donso. I was using babies, but no big deal. Um Danny, it's time to squat up. All right, which means I need you to go over the kind of funny.com/you wrong. Tell me what we screwed up today. And if these kids are editorializing, just ban them. Just banan each and every one of them. No, want me to go? I don't think you have that part. No, I'm going to squat up first. You You give a read through and that way you know what we actually got right and wrong. Yes. Uh, ladies and gentlemen, of course you can write in to kind offunny.com/kfgd and tell us who you want to squad up with. I'll need your name, then your PSN name, your Steam name, whatever the hell name it is, what game you're playing, and the reason why people should come squad up to help you out. This is probably my favorite squad up so",
            "start": 3649.44
        },
        {
            "text": "then your PSN name, your Steam name, whatever the hell name it is, what game you're playing, and the reason why people should come squad up to help you out. This is probably my favorite squad up so far. This is amazing. This squad up comes from James G. James G is looking for friends on the PlayStation 3. James G is literally the perfect name for what's about to happen. James G needs help. I'll give you his PSN name here at the end, but uh he needs help on PlayStation 3 with this. And he says, \"I know this one is a long shot, but did anyone play 50 Cent Blood on the Sand on PS3?\" Probably not. The first 50 Cent game, Bulletproof, wasn't very good on PS2. And by the time Blood on the Sand came out, 50 Cents Mass Appeal was on the decline. But if you did play this game, I'm sure you are aware that there was a surprisingly good third person thirdp person score-based shooter. Anyways, I'll cut to it. I want to play through the game for the third time on the hardest difficulty. However, I",
            "start": 3686.88
        },
        {
            "text": "that there was a surprisingly good third person thirdp person score-based shooter. Anyways, I'll cut to it. I want to play through the game for the third time on the hardest difficulty. However, I have never played through the game in online co-op. A as parenthesis, funnily enough, I can't find anybody else with a copy. So, I figured this would be the best way of finding someone to join me in my third playthrough of this masterpiece. Thanks, kind of funny, fam. # make make 50 Cent Blood in the sand, too. Uh, I remember 50 Cent Blood in the sand. Eric Brvig and Hillary Goldstein were obsessed with this back in the day at IGN and they would grenade [ __ ] They'd yell around saying that because that was like one of the lines which is the one with [ __ ] where my skull remember? Oh, this is it. This is it. Yeah. You run around looking for golden skulls or whatever in this game. Diamond skull. Yeah. Yeah. Yeah. Yeah. Uh so now if you want to play with James I'm going to read you his PSN",
            "start": 3730.88
        },
        {
            "text": "it. This is it. Yeah. You run around looking for golden skulls or whatever in this game. Diamond skull. Yeah. Yeah. Yeah. Yeah. Uh so now if you want to play with James I'm going to read you his PSN name here. Strong PS. It's the type of PSN name you would get from somebody who's playing this game. Exactly. It's Kill It Bang forever, I believe, but it's with a C. So it's C I L L I T bang forever which for a while I was like [ __ ] no and then I was like sill it bang forever. I'm sure there's something I I'm missing but c I l I can literally tell you if you want number four ever. This is why you need a European once in a while. Silit bang is the name of a popular uh like toilet cleaning like spray and there's this guy called Barry Scott who does like commercials for it. He's like, \"I'm Barry Scott and this is Silit Bang.\" And it became like basically a meme in television advertising and you need to watch the Silang. I actually thought it did say Kill It Bang, but then when I read it, I",
            "start": 3775.12
        },
        {
            "text": "Scott and this is Silit Bang.\" And it became like basically a meme in television advertising and you need to watch the Silang. I actually thought it did say Kill It Bang, but then when I read it, I was like, my European part of my brain lifted up again. This guy really loves Bang. Your European spider sense went off. Exactly. Yeah. The number numeral four in there forever. Shout out to Barry Scott. Uh Nanny. All right. What are we getting wrong? Not too much. Okay, good. All right. First one. Snarky Starky says, \"Greg asked if there was a June 31st this year. There is never a June 31st, even on Leers.\" Thank you. Thank you, Trevor. Little fact. Um, it Street Fighters, Mega Man, Cross Street Fighter. Remember that came out Cross Street Fighter. Okay. Yes. A bunch of people um talked about it. I'm going to do this one for Alan McAdams. I believe it is. Mega Man X Street Fighter. Cross Street Fighter was created by Singaporean fan developer Sio Zong Hui. I think it is. Initially",
            "start": 3820.56
        },
        {
            "text": "about it. I'm going to do this one for Alan McAdams. I believe it is. Mega Man X Street Fighter. Cross Street Fighter was created by Singaporean fan developer Sio Zong Hui. I think it is. Initially developed as a fan game and later received support from Capcom who assisted in the production of the game. Street Fighter Course Mega Man was released as a free download from Capcom Unity on December 17th, 2012. It celebrates the 25th anniversary of both Capcom's Mega Man and Street Fighter franchises. Nice work. And the last one comes in from Capitalist Pig, who kind of looks like John Vignyaki. Very much so. Right. I'd say it. Destiny 2 is coming out in September 6th, 2017 for the PS4, Xbox One, and PC on October 24th. I feel like you pulled the trigger too quick on that. We got that. Yeah. Yeah. But thank you for keeping it honest and everything. Ladies and gentlemen, this has been kind of funny. Games Daily 4 Monday, July 10th, 2017. What' you think? Your first show. That was fun. Yeah.",
            "start": 3862.96
        },
        {
            "text": "But thank you for keeping it honest and everything. Ladies and gentlemen, this has been kind of funny. Games Daily 4 Monday, July 10th, 2017. What' you think? Your first show. That was fun. Yeah. Let's do it four more times this week. Yeah, exactly. Andrea is on vacation now, too. I think it's next week everyone's officially here and the real like schedule of how it all works. But yeah, thank you for coming through. Pleasure. Thanks. Or support Danny over on patreon.com/dananiel. Support him on youtube.com/noclipvide. Support us on kind of funny.com. You can go there. Please, like I said before in the beginning of the show, kind of funny games daily, a brand new show. We need your support. So, please subscribe on YouTube. YouTube.com/kindfunnygames. Rate it over on iTunes. Subscribe there. Even if you're just watching us when we do it on Twitch, do it that way. And of course, if you could all give us a dollar on Patreon, that'd be as well, too. Uh Danny, it's been a pleasure.",
            "start": 3907.2
        },
        {
            "text": "there. Even if you're just watching us when we do it on Twitch, do it that way. And of course, if you could all give us a dollar on Patreon, that'd be as well, too. Uh Danny, it's been a pleasure. Pleasure. Until next time, ladies and gentlemen. It's been a pleasure to serve you. Then we handshake. That's the thing we do. Oh, yeah. Yeah.",
            "start": 3945.28
        }
    ]
}