{
    "id": 2861,
    "video_id": "sEnHuZfXiYI",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Who Should Play The Next Batman? - The GameOverGreggy Show Ep. 191 (Pt. 1)",
    "description": "Thanks to Beach Body for sponsoring this episode. Text Greggy to 303030\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1501484404,
    "duration": 2338,
    "transcript_chunks": [
        {
            "text": "[Music] Hey, did you see that our own Kevin Koella was losing all sorts of weight for his wedding? Why don't you join him and use today's sponsor, Beachbody on Demand. Beachbody on Demand is an online fitness streaming service that gives you unlimited access to a wide variety of highly effective, world-class workouts personalized to meet your needs, plus extensive nutritional content, all proven to help people achieve their health goals, fitness goals, and not look like this. Plus, P90X is there, and so is Insanity. Kevin used P90X a little bit. You got step-by-step program that guides you. You have workout calendars, comprehensive nutritional plans, an innovative portion controlled focused cooking show called Fixate, and the motivation and support of a growing community. Beachbody on Demand is the total package, and you can stream it all to your computer, smartphone, or any other web enabled device. This is a brand new service, but it already has more than a million members. So, claim",
            "start": 0.0
        },
        {
            "text": "is the total package, and you can stream it all to your computer, smartphone, or any other web enabled device. This is a brand new service, but it already has more than a million members. So, claim your free trial membership and join Kevin on his quest to not look like this by texting Greggy to 303030 to get full access to this entire platform for [Music] free. What's up everybody? Welcome to the Game Over Greggy show. I'm one of your hosts, Greg Miller, alongside the producer/seducer, Nick Scarpino. Hello. The champ. That's right. I forgot. It's almost like um when you wake up and someone reminds you that you're the Nintendo World Champion that you Christmas all over. We finally were both sitting at our desks, you know, cuz Nick and I's desks face each other, but we have our monitors there. All of a sudden, I just see him over the monitors lift the world title up. Just his hands in the belt. No Nick standing with it. Just a reminder to me that that had happened. I hate it so much.",
            "start": 42.8
        },
        {
            "text": "All of a sudden, I just see him over the monitors lift the world title up. Just his hands in the belt. No Nick standing with it. Just a reminder to me that that had happened. I hate it so much. More is Nick's new like just he went off the deep end with his [ __ ] voice. Kevin, where's your Yeah, I hate it. Stop. Stop. Take your out. Oh man. Over there. The PR and Tim Getty's blood host. And for the first time ever on a real show, not the drunken whatever crazy shows. The glue Kevin. No, that's right. I thought you been on one. Have you been comic book girl? Yes, that was a weird episode though. It was different. Yeah, exactly. I think everybody's gone and, you know, we had to make it happen from people who like comic books and like comic books girl and that was you. She was so cool. Welcome back, Kevin. I want to say the whole reason you're here is because of a tweet yesterday. Uh yesterday you put up that you were finally under 200 lb for the first time in how long? Uh like probably",
            "start": 102.08
        },
        {
            "text": "back, Kevin. I want to say the whole reason you're here is because of a tweet yesterday. Uh yesterday you put up that you were finally under 200 lb for the first time in how long? Uh like probably four no well two years was the last time. But like that I was doing like a really aggressive diet as a competition with my family. Sure. But like and it didn't last. Sure. It's weird that the last time you were under 200 lb was right when you started here and then you ballooned up largely due to the stress and abuse. Ballooned. It was definitely balloon watching kind of life. I peaked at 220. So the during the wrestling bit of Count of Play 3 when you came out with the You are a barrelchested young lad. And you're very proud, very boisterous. And my brother just let me go. Oh, Kevin was a was a lot bigger. Yeah. Uh, so you lost all this weight and as you know the game over Guggy show is no fat [ __ ] So now you're allowed I'm just kidding. No. Uh, what happened is you tweeted about it. You",
            "start": 148.64
        },
        {
            "text": "lot bigger. Yeah. Uh, so you lost all this weight and as you know the game over Guggy show is no fat [ __ ] So now you're allowed I'm just kidding. No. Uh, what happened is you tweeted about it. You tweeted about it and uh, then Joel C. Mccclure hit you up on Twitter and said, \"I am proud of you and I demand that kind of funny vids have you on the Game Over Gregory Show. Let Kevin host.\" Let me see that real quick. Oh, sorry. I shut it down. No, it's okay. And I said, he's got three likes. I'm sure one of those is mine. Yeah. And I said, \"You know what? I concur. Kevin's on the show tonight. Big dick swing. Kevin Coella getting married soon. Yeah. Cutting his hair soon. We got a bachelor party coming up. I know. Right around the corner. Two weeks. Is it really that close? That's terrifying. You excited about it? Can't wait. You kidding me? Now, here's the Cuz what happened is I was talking to maybe one of you clowns about it, but I forget who. And what I finally I was like, \"Oh, yeah.",
            "start": 193.92
        },
        {
            "text": "You excited about it? Can't wait. You kidding me? Now, here's the Cuz what happened is I was talking to maybe one of you clowns about it, but I forget who. And what I finally I was like, \"Oh, yeah. You know, we're going to Vegas for Kevin's Bachelor Party. I'm super excited.\" I'm like blah blah. I'm like, \"I like I like going to Vegas and I like playing blackjack, but I only know the\" And I'm like, \"Wait, I'm going to get awesome at blackjack. I still have time. I want to read a blackjack book. Yeah. I want to come in there, get a cigar, and just [ __ ] clean up. Are you really going to have a cigar? I'll sit on the table and play with you. Now, now I like doing the video. I like doing the video blackjack, right? That way there's no other No. When you go to Vegas and you do blackjack, I've had I It was in St. Louis, but it was It counts where I was at the table or whatever learning how to play and I'd be hitting and the guy next to me got all mad cuz I was taking his cards. But [ __ ]",
            "start": 232.56
        },
        {
            "text": "had I It was in St. Louis, but it was It counts where I was at the table or whatever learning how to play and I'd be hitting and the guy next to me got all mad cuz I was taking his cards. But [ __ ] him. That's not like his right. Like the table, you know, part of the luck is who you sit next to, you know? And if you're unfortunate and there Yeah. I'm on the same boat, Greg. I don't know how to play. What's amazing to me, Greg, is that you're like, you're you said that scary. You said I'm going to read a blackjack book and get all good at blackjack. Like, you're the first human in the history of gambling to ever think about. No, there was another person who did it. Her name was Mrs. Katon on Family Ties, and she won a whole bunch of money. Yeah. Okay. And I have to imagine I could relive that. Yeah, you cuz most people go to Vegas and they don't think to read the book beforehand on what to do, what not. That's true. You know what I mean? I need to figure out splitting. I need to",
            "start": 265.28
        },
        {
            "text": "that. Yeah, you cuz most people go to Vegas and they don't think to read the book beforehand on what to do, what not. That's true. You know what I mean? I need to figure out splitting. I need to figure out splitting. That's not that hard to Well, I need to figure it out a little bit more, right? I hope we sit next to someone who's like an expert, okay, to lose money, and ready to give us advice. I think we should all go all four of us should go there and sit there and do it together with you. Now, I'll tell you this right now. Just for fun, just for fun. You go in there, $5, you lose it immediately. [ __ ] off. That's That's the way I go in there and watch and root for you guys and cheerlead and stuff. But no, if I'm going to waste my money, I'm going to waste money. Especially if I'm going to be smoking a cigar with this guy. Yeah, we love We haven't done that in a Yeah, it's been a long time. I don't like it. I don't like how long. Do you like them cigars, Nick? Uh, I used to. Yeah,",
            "start": 303.76
        },
        {
            "text": "to be smoking a cigar with this guy. Yeah, we love We haven't done that in a Yeah, it's been a long time. I don't like it. I don't like how long. Do you like them cigars, Nick? Uh, I used to. Yeah, but I don't I don't smoke anything anymore now. I have some friends that are like, \"Hey, I quit smoking cigarettes, so let's smoke cigars.\" And I'm like, \"It's the same thing. You're just It's cuz I'll inhale the tobacco. You're not supposed to.\" And I just love it. And then I'll go straight back down to that mistress. You know what I mean? What are the odds you smoke a cigarette at the special party? Cigarette. No, I won't do it. I haven't smoked in two years. A year and a half. A year and a half. What are the odds you put your tongue in an ashtray at the special party? 50 ashtray. [Laughter] Sorry, I thought you said if you didn't know this is the game over Greggy show each and every week. Four, sometimes five best friends gather on this table. Each bring a random topic and discussion for",
            "start": 335.6
        },
        {
            "text": "I thought you said if you didn't know this is the game over Greggy show each and every week. Four, sometimes five best friends gather on this table. Each bring a random topic and discussion for your amusement. If you like that, head over to patreon.com/kindfunn where you can get each and every episode early. You can get it so early we get it while we're recording it. You can go over there right now. You can get a piece of the original wall signed by all of us. It's the fan mail. If you do that, you can get early access to Kind of funny live 3. If you don't want to, it'll be up next week. Don't worry. And if you have no bucks to toss our way, it's no big deal. You can go to youtube.com/kindfunny where the show goes up topic by topic, dayby day until one big video and MP3 posts the following Friday. Nicholas. Yes, sir. What's your topic? Uh, my topic today is Batman. Now, as you all know, you're going outside your comfort zone. All right. Yeah, that's why I like to write what I know.",
            "start": 374.96
        },
        {
            "text": "Friday. Nicholas. Yes, sir. What's your topic? Uh, my topic today is Batman. Now, as you all know, you're going outside your comfort zone. All right. Yeah, that's why I like to write what I know. Um, Ben Affleck, who the [ __ ] knows how long, how much longer he's going to play Batman. People are saying he's into it. We are saying he's not into it. He's going to do Justice League. He's going to do the Batman. Exactly. We're recording this after, this is the Monday after Comic- Con, right at Comic-Con. We had done the Friday leading into Comic- Con, the whole thing about like, oh, he's trying to get out of the role again. Then at Comic-Con, he's like, I Batman's the coolest [ __ ] character. I'm in for the Matt Reeves thing. That's as far as it went. I think that's as far as it goes. He's going to do Justice League if and then he'll do Yeah. If he has a cameo in something while in that time, fine. But I think that's it. Batman, the Batman, I think is going to be Ben Affleck's Batman",
            "start": 412.56
        },
        {
            "text": "going to do Justice League if and then he'll do Yeah. If he has a cameo in something while in that time, fine. But I think that's it. Batman, the Batman, I think is going to be Ben Affleck's Batman flick. So that I agree and I so so knowing that I asked you guys to prepare a little bit. There's some homework for this one. So I want to go around the table and see who are y'all's like top pick for Batman. Who is the actor that could dawn the cape and cowl and be either better than Ben Affleck or at least as good as Ben Affleck at Batman? And I actually hold Ben Affleck you started making some really good. So I asked you guys to put together three top three. One that's good, one that's off the wall, and then one that's just a think kind of a think piece. I love it. Let's go. Let's You want to kick it off? If you want me to. Yeah. Where do you want me to start? Let's start with You want to start with the real the real Okay. The real pick I have to pick up The Cape and Cow. Stick with me.",
            "start": 445.68
        },
        {
            "text": "kick it off? If you want me to. Yeah. Where do you want me to start? Let's start with You want to start with the real the real Okay. The real pick I have to pick up The Cape and Cow. Stick with me. And I don't I mean this is I I want you to know I had to search long and hard for this cuz you know I'm not like I am not like you. I don't have an encyclopedia knowledge. If I see some people in a movie I'm like they're good. Great. You know what I mean? I'm picking personal friend of mine, Anthony Gruber. I expect none of you to know him. Anthony Gruber. You would know him and I'll tell you the way I know him and stick with me because high school. Exactly. High school. He was great in our production of Guys and Dolls in ninth grade. Nathan Detroit. Anthony was slash is the Joker in Telltales Batman. Okay. But he is also a real actor. And I'm that sounds insulting, but you know, not just a voice actor where nobody would understand where he's from. He was also in Age of Adeline where he was",
            "start": 487.76
        },
        {
            "text": "Okay. But he is also a real actor. And I'm that sounds insulting, but you know, not just a voice actor where nobody would understand where he's from. He was also in Age of Adeline where he was young Harrison Ford. So if he can play young Harrison Ford and I'm talking Harrison Ford in like his 20s or whatever, right? Did a great job. Has that all American Playboy look to him, I would say. You know what I mean? And so here like as I feel with all of my picks, we need to talk about what is the DC extended universe, which by the way, I [ __ ] hate that they call that. It's just DCU. DCCU Cinematic Universe. Marvel had it. Why do we why do we worry about that? or just the DCU, then it would get confusing with comics. I understand Columbia universe. Anyways, the way we all know this is going to go Batman the Batman happens then this Flashoint movie is going Flash is going to go back in time and reset the timeline and we get new actors. We do whatever we have to. So, I like the fact that",
            "start": 530.64
        },
        {
            "text": "to go Batman the Batman happens then this Flashoint movie is going Flash is going to go back in time and reset the timeline and we get new actors. We do whatever we have to. So, I like the fact that Anthony would be younger than Ben Affleck. He'd be able to be in there. I don't want him to already be the seasoned Batman. He's been at a year two. I don't want I don't need a year one Batman. I don't need Batman Begins again. You know what I mean? Just get me in there. Usher me Batman begins again. Get me in there. And I think I think he could do it. I mean he's he does a great Joker that sounds nothing like him. So he's got range. So I think he could do the I'm doing the cuz like his age of Adeline Harrison Ford is a little bit like like you know Bruce Wayne would be or whatever. So he bounces does that face. Okay. And then he gets serious and he does he does what he's got to do you know. So in that world see look at him right there. Jeffrey Dean Morgan the dad. Yes. I I mean let's talk",
            "start": 570.96
        },
        {
            "text": "does that face. Okay. And then he gets serious and he does he does what he's got to do you know. So in that world see look at him right there. Jeffrey Dean Morgan the dad. Yes. I I mean let's talk about how how much we're actually going to [ __ ] up. Yeah. No, he could I could see him. How much we're really going to [ __ ] up uh the universe. I'd like to imagine Yes. I'd like when they do this Flashoint thing that we do get to see Jeffrey D. Morgan in the At least as a plot point, right? At least as a thing that maybe that lasts 10 minutes and it's just like in this universe, this is how it happens. Yeah. Exactly. Jump back over to whatever his name is. Yeah. See, I like this choice and here's why. Because I feel like there's a lot of people that this is this is shedding some light on my list. A lot of the guys on my list are are AAA celebrities. Guys that you would that that can open a movie, so to speak. guys that you know are are leading men already in Hollywood and I feel like",
            "start": 607.92
        },
        {
            "text": "my list. A lot of the guys on my list are are AAA celebrities. Guys that you would that that can open a movie, so to speak. guys that you know are are leading men already in Hollywood and I feel like that is a problem for Batman. Like Henry Caval I think was good casting because you didn't really know who he was. We've seen him in a couple movies. He was in the tutors. I think my wife wanted to have sex with Yeah, he was in Stardust. Was he in a great movie? The Neil Gaiman movie. Oh, that was a great movie. His last name. No, I think or G. Some people say G. The Sandman. Um uh but I like this because this is a role he could he could really own for a very long time. Yeah. which I think is cool. Similar to like when Chris Pratt, everyone's like, \"Oh, we kind of know Chris Pratt.\" And then he gets Star-Lord and you're like, \"That's that's he Batman's different though.\" Like I I feel you think you need you need that like Hollywood star as Batman. I mean, Batman is Batman and Bruce Wayne",
            "start": 644.16
        },
        {
            "text": "he gets Star-Lord and you're like, \"That's that's he Batman's different though.\" Like I I feel you think you need you need that like Hollywood star as Batman. I mean, Batman is Batman and Bruce Wayne are such defined characters that I almost feel like an unknown person being them is going to be weird. Like I feel like you need it justice. I I think it needs to be there's that that X factor of an actor playing a the characters. We know the characters. It hadn't dawned on me that it didn't do it justice. I hate you so goddamn I knew it was coming somewhere. I knew it was coming. God, he's horrible. Sorry. Continue. I apologize. All right. But you see what I'm saying though? I feel like Batman is a I mean I feel like there's a Who deserves to be Batman? I feel like you needed to have accomplished some real AAA [ __ ] Okay, you say that, but I mean like so what was Christian Bale's the whole claim? Momento? No. Uh that was Guy Pierce. Christian Bale had been in American Psycho. He had",
            "start": 681.92
        },
        {
            "text": "some real AAA [ __ ] Okay, you say that, but I mean like so what was Christian Bale's the whole claim? Momento? No. Uh that was Guy Pierce. Christian Bale had been in American Psycho. He had done great point. Great. I was like, wait, he's pretty sure he was No, he wasn't in Momento at all. You're right. Yeah. No, he wasn't. Um you were so upset about it. Well, I saw American Psycho is what I must have. I mean, you were thinking America. I knew he had done one. Christian Bale even done a lot of things. He was and at least thought of him as an actor like Sure. Well, this I mean Anthony is an actor. But Christopher Nolan picked him because AAA he was not aa not that I think that really put him into the before Batman. If you were to be like, \"Hey Tim, who's Christian Bale?\" I'd say an actor. If you said, \"Who's this guy?\" I'd say, \"I don't remember.\" That's fair. So, I mean, the the thing with uh Ben Affleck, who is a big actor and was at the time that he got cast and still is now, like I",
            "start": 728.48
        },
        {
            "text": "you said, \"Who's this guy?\" I'd say, \"I don't remember.\" That's fair. So, I mean, the the thing with uh Ben Affleck, who is a big actor and was at the time that he got cast and still is now, like I felt like going in I was like, \"Oh, that's going to make it weird for me to watch.\" But then watching the movie I was like, \"Nope, [ __ ] nailed it.\" So, yeah. I I don't know. I like what Tim's saying where it's like the actor if there's a like All right. All right. I have other I have other real picks. I got two other real picks. I thought we were supposed to have one of each. I'm Greg Miller. I like to get after it's a Batman. You know what I mean? I'm going to toss out this one and you'll need to stick with me cuz the name won't ring a bell, but you're going to know his [ __ ] face. Mhm. Michael Hughesman. Huisman. Was he also in a battle? The guy actually he was. Yes. Actually, but you'd also know him. He is an awesome. You would know him as the Game of Thrones guy who replaced that",
            "start": 770.24
        },
        {
            "text": "Michael Hughesman. Huisman. Was he also in a battle? The guy actually he was. Yes. Actually, but you'd also know him. He is an awesome. You would know him as the Game of Thrones guy who replaced that other Game of Thrones guy and then went on to keep [ __ ] Kesi. He was a right-hand man and got the old man on all mad at him. [ __ ] great. He's a different take like now now he's an older Batman, a more brooding Batman, a more cocky Bruce Wayne as well, which I enjoy quite I think he'd be a great looking and Dutch. My wife likes Dutch people. Okay, good. Yeah, that's the thing is like I think he'd be he'd be a real solid pick. That's interesting, dude. He's a great pick. That's a damn good call. Yeah, call. But see, keep the hair. I can't imagine without the hair though. I feel like the hair begins Batman, you know? It doesn't matter though. But like Caval has longer hair as Superman, right? Like Superman I feel like can get away with it. Batman. Christian Bale seemed like not like long",
            "start": 804.88
        },
        {
            "text": "begins Batman, you know? It doesn't matter though. But like Caval has longer hair as Superman, right? Like Superman I feel like can get away with it. Batman. Christian Bale seemed like not like long hair, but he had longer hair. He started long. It was sllicked back. Long long. Yeah, you guys outside the box. I mean, this is what's going to stop you is the fact that he's I mean, I can't picture. I mean, I like this. This is a great call. Okay, good, good, good. Fantastic call. I mean, it's goes back to what I'm saying about like he's not that known, but it's like I think he looks the part. Yeah, he's a good actor. And then my third real pick. Yeah. Which will be laughed out of the room. I understand. But real pick that I think he has the range. He could do something. Zack Efron. Zack Zack Efron has been in comedies. I know. Don't get me wrong. He's He's a really goofy guy. We know he can get yacked though. I think he I think he can pull off Bruce Wayne no problem. I think the the",
            "start": 849.72
        },
        {
            "text": "Zack Efron has been in comedies. I know. Don't get me wrong. He's He's a really goofy guy. We know he can get yacked though. I think he I think he can pull off Bruce Wayne no problem. I think the the whole him getting yacked like really shows like I mean Yeah, I could see that. It's one of those he it would be I mean with all due respect it would be very much a Michael Heaton situation where you cast him and everybody goes oh that guy from [ __ ] Mr. Mom and all this [ __ ] and they only know him from the goofy movies he's done Bosom buddies. No that was Tom Hanks but that was I didn't know Zack I'm not on fire not on fire with my call back ability to put people in the movies but I'm saying it could work. All right Tim what are your who are your real choices? So I got skipped. Why are you going around? He calls the ball. It's his topic going around. I can see you're letting the alcohol seep. Can you be pouring the glass, please? I got I got three. I don't want one. I got three. Yeah,",
            "start": 886.88
        },
        {
            "text": "going around? He calls the ball. It's his topic going around. I can see you're letting the alcohol seep. Can you be pouring the glass, please? I got I got three. I don't want one. I got three. Yeah, give it to me. What are you doing? So I I don't want to take any of Kevin's. So Kevin, if one of the ones I say is yours. Yeah. So I have one. That's That's fine. Actually, let's go with Kevin cuz I want to Kevin, let me Damn it. I'm looking at your list right there. Yeah. Yeah. Give it to me. Give it to me. Don't hide it. There's no reason to hide it. Yeah. It's not a [ __ ] homeless. And Greg walks away now. So, my my choice, John Ham, I feel like especially after seeing him in Baby Driver. Oh my god, I want to see him as Batman cuz his performance, he went from silly Playboy to like I'm going to [ __ ] destroy you. He can get jacked. Yeah, he's so good looking. He's rugged. He has the hair. His hair has emotion and movement. He has the face jaw. He hasn't I mean Baby Driver was good but",
            "start": 928.0
        },
        {
            "text": "to [ __ ] destroy you. He can get jacked. Yeah, he's so good looking. He's rugged. He has the hair. His hair has emotion and movement. He has the face jaw. He hasn't I mean Baby Driver was good but he hasn't done like a leading role in all except for keeping the Joneses which was not that good. His performance in Baby Driver I love that he went from being this [ __ ] slick ass John Ham and then ending terrifying because of Baby Driver is why I put him on the list. See my problem with the John Ham pick cuz I love John Ham. I wanted to be Superman. Yeah, I agree. Yeah, I agree. But Flashoint, he goes back and he gets to be Superman. Yeah, John Ham's my number one. That's funny. Uh, Dunham's a great choice. I would say my number two is a tie. Okay. Between Colin Frell. Ooh, he would be [ __ ] as Batman. Interesting. Keith Urban, very different Batman. Carl Urban, I think you met. Yeah, Keith Urban's a country music star. I was super interested. Awesome. Carl. Carl Urban would be a great",
            "start": 967.44
        },
        {
            "text": "as Batman. Interesting. Keith Urban, very different Batman. Carl Urban, I think you met. Yeah, Keith Urban's a country music star. I was super interested. Awesome. Carl. Carl Urban would be a great Batman. Yeah, that's really good. Dread, right? Wasn't he? Dread is what sold the hell out of that. Is not the law. Yeah. Who was your before Carl Urban? Who was it? Colin Frell. Colin Frell. No way. Get him out of here. Oh, you didn't see Fantastic Beast, man. So good. I did see Fantastic Beast. I think I saw with all you. I did. We saw it together. Yeah. I thought he was great in that. Yeah. Like and that that again puts me in the place where it's like I could totally see that guy being Batman. I mean, I think there's a there's something between the two of those where it's they start off and they're cool and collected and by the end of it they're [ __ ] crazy. And I'm like, that's the Batman, right? As long as he can make that switch. Here's my problem with your picks and I don't know",
            "start": 1018.76
        },
        {
            "text": "they're cool and collected and by the end of it they're [ __ ] crazy. And I'm like, that's the Batman, right? As long as he can make that switch. Here's my problem with your picks and I don't know enough about Carl Irvin to weigh in on this because I think he's in Thorn and he looks pretty great in that two seconds we saw in the trailer for both mainly John Ham being a huge John John Ham fan and maybe a little bit of Colin Frell. Aren't they aren't we getting into the same problem we have with Ben Affleck right now that he's just too old. No offense to Ben Affleck in the way that like Ben Affleck it is the one of the reasons why it is you want to get out of this. There's it's hard on your body. He's almost 50. He's doing a million things. It's possible. You're I mean you're right. You're bringing up good points in when you think of these movies as episodes series. They just need to keep going forever and ever. But as we're getting into this DC thing, I think that we're that we have to",
            "start": 1060.08
        },
        {
            "text": "up good points in when you think of these movies as episodes series. They just need to keep going forever and ever. But as we're getting into this DC thing, I think that we're that we have to hit a point that they're just going to focus on good movies like that. I think that the I don't I don't know about that. All right. I think that the fad eventually has to stop because Marvel's going to keep going. But I think that what could happen when the Marvel ship ends, like phase 4 ends or whatever, instead of rebooting the whole thing, they go back and they're like, \"All right, cool. We're just going to tell individual stories, like graphic novel style things, like getting the Dark Knight return.\" I'm totally down. I I, you know, I've talked about that before. I love that idea of like, \"Cool, here's Last Sun. Here's Red Sun. Here's The Killing Joke.\" And it's just like we're making movies. on casting these movies with these people because how amazing would it be if uh Matt Reeves' Batman",
            "start": 1091.52
        },
        {
            "text": "here's Last Sun. Here's Red Sun. Here's The Killing Joke.\" And it's just like we're making movies. on casting these movies with these people because how amazing would it be if uh Matt Reeves' Batman the Batman didn't have to do with any of the DC CU I mean it wouldn't tie in to Justice League and there wouldn't be Superman I mean I want I want that I want I want the comic universe that's why I just want them this is why I'm so mad today as we record this with this [ __ ] Mission Impossible garbage they're doing all these re-shoots for Justice League and because of the [ __ ] Mission Impossible movie Henry Caval can't shave off his beard so they're going to have to [ __ ] digitally put his face in there like this what I'm talking DC, you sign all these people, you say for a year, you're only making these movies. We're just going to make every DC movie in the world. Let's just That would probably like kill some people though. I working that much like on one movie. What? How long do",
            "start": 1129.28
        },
        {
            "text": "only making these movies. We're just going to make every DC movie in the world. Let's just That would probably like kill some people though. I working that much like on one movie. What? How long do people like roll on movies like if you're a lead? If I mean, but you're not working. Are you talking about actors? Are you talking about like stuff? Actors? I'm more concerned about the grips and stuff. Henry Caval coming out of his [ __ ] trailer to be like, \"Well, I've worked out for four hours.\" Martha, that's fine. I think you can [ __ ] pull that off. I don't know. I think that that's like you guys should know how much work being in front of a camera is and like you guys aren't acting. You guys are just being yourselves in front of Lord of the Rings though. They shot a year straight for Lord of the Rings to make three movies. It's not it's not impossible. True. True. It's a possibility. Wait, they didn't take a break between one and two. I thought two and three were they shot I think",
            "start": 1167.76
        },
        {
            "text": "of the Rings to make three movies. It's not it's not impossible. True. True. It's a possibility. Wait, they didn't take a break between one and two. I thought two and three were they shot I think they shot for like a year and a half. That's insane. God, that is I'm looking at him. I like how Yeah. Michael Hooman over there like, \"Wait, was he an age of Adeline, too? I'm like, you know who should be Lois Lane? Like live. Greg, did you watch Age of Adeline last night? Did you go home and do the homework we asked you to do? Just watch Age of Adeline. Oh, man. That's so good. So, Nick, who's your Wait, no, we're still Oh, you gave your Sorry. No, I gave John Ham. That was Oh, right. Cool. Um, I have I have quite a few on my list of people that just popped in my mind for for actors that could easily that could easily step into the role right now. Um, top of my list. I'm just going to give it to him. The gauze. Ryan Gosling. Oh, interesting. Ryan Gosling's on my my list of no. I think he",
            "start": 1205.2
        },
        {
            "text": "easily that could easily step into the role right now. Um, top of my list. I'm just going to give it to him. The gauze. Ryan Gosling. Oh, interesting. Ryan Gosling's on my my list of no. I think he could bring something. Wait, your list of no. The the wacky like Oh, okay. That would be a different ass Batman than I I feel like he could be pretty good at it. There's something about his speaking voice that just doesn't work for me. Like in LA works for me. I love him. I love him so much, but he's not Bruce Wayne. Fair enough. Like I just I the way he talks that's why I think he's best in movies where he doesn't talk. I think he could play Bruce Wayne. I don't know that he'd be great in the Cape and Cowl, but I feel like he could do it cuz he's a great actor and he would find that character somewhere. I mean he [ __ ] played piano and tap dance. I think he could do that. [ __ ] yeah, dude. He he [Music] tak it for real. I thought you were going to [ __ ] around with it again. I don't",
            "start": 1247.04
        },
        {
            "text": "somewhere. I mean he [ __ ] played piano and tap dance. I think he could do that. [ __ ] yeah, dude. He he [Music] tak it for real. I thought you were going to [ __ ] around with it again. I don't [ __ ] around with it. You never [ __ ] around with the guys. Now, because this actor is uh in my brain from last weekend, and I thought this would be an off-the-wall choice, Tom Hardy. I think Tom Hardy as Batman would be [ __ ] awesome. I think he think he's too like imposing as a but like as Bruce Wayne. Like I've never seen Bruce Wayne as this giant Hulk of a man. Sure. I mean, Ben Affleck was big. Yeah, but Ben Affleck's a Bruce Wayne of an older he's an older Bruce Wayne. He's not as intimidated or not meant to be like the playboy. Hey, I'm just going to Bruce Wayne's sleek, you know, not like the animated series. Right. Right. Right. Right. Too square jaw. That mean that Well, if you're talking sleek, I'm going to throw this out. This is my thing. It's none sleeker than Michael",
            "start": 1288.08
        },
        {
            "text": "not like the animated series. Right. Right. Right. Right. Too square jaw. That mean that Well, if you're talking sleek, I'm going to throw this out. This is my thing. It's none sleeker than Michael Fastbender. Now, Michael Fastbender is tall, super skinny. So, if you wanted that different opposing body, if you wanted the the just that tall just ridiculously skinny Batman version instead of big like a gothic college in my opinion too serious to ever play Bruce Wayne. I can't ever see him being the swave like cool guy cuz the roles that I remember him from are where he's being like really straightfaced and very serious. Now Fast Better also on my short list for uh The New Bond. It's better. Oh, okay. Oh, throwing another uh Daniel Craig. I'd love to see what he does with with Batman. He would, but he's Yeah, he would be good, too. He's getting a little old there. He's unfortunately a little old. I feel like the same actors that we would say about any role. Now, let's go into That's",
            "start": 1341.84
        },
        {
            "text": "would, but he's Yeah, he would be good, too. He's getting a little old there. He's unfortunately a little old. I feel like the same actors that we would say about any role. Now, let's go into That's fair. Now, let's go into the second choice. Okay. Which one's this? This is the Let's say the off-the-wall wacky choice for the third. The second choice is one that you wouldn't necessarily think of, someone who you think would be good person. Wild choice. The wild card. Thank you. I apolog choice. Well, I put it in there because we talked about it the other day and I got super excited for it. We keep going younger. What if we went older and it's Michael Keaton? Somehow Flashoint resets everything to Michael Keaton, which I like a lot. That's when we were talking about that. You know what I mean? That when we talking about Batman uh Beyond, like what you could do with it and [ __ ] around with it, especially if you're telling your old things of if you were to blow it up and they're now",
            "start": 1387.92
        },
        {
            "text": "mean? That when we talking about Batman uh Beyond, like what you could do with it and [ __ ] around with it, especially if you're telling your old things of if you were to blow it up and they're now making uh Red Sun, they're now making all these graphic novels into it or just they're going to have multiple things going to say, \"All right, we're making Batman Beyond. Michael Keaton is Bruce Wayne. This is the spiritual, as I said, we have Tim Burton helmet again. And because, and don't get me wrong, well, see, that's my thing is like I I don't know if personally I I I love Batman Beyond. I would love to see a faithful adaptation, but I have the cartoons. I don't need it. I I'd love to see the idea of that because I think we're to that point in the comic book life cycle, right, of you know I I mean it's too late now obviously with Richard Donner to have him do another Christopher Reeve movie, but for Tim Burton to be like I we're teaming back up. We're making this thing. It's going to",
            "start": 1427.28
        },
        {
            "text": "I I mean it's too late now obviously with Richard Donner to have him do another Christopher Reeve movie, but for Tim Burton to be like I we're teaming back up. We're making this thing. It's going to be my Batman Beyond set in that universe that everybody did love. We're ignoring Forever. We're ignoring Batman and Robin. We're picking up from Were those canonical? Yeah. Right. That wasn't just a reboot. I mean this is the whole thing of like I mean they Yes. They had the same Alfred so Yeah. They did have the same I'm pretty sure they had the same Commissioner Gordon. It's been a long time. I don't think they ever got away from Commissioner Gordon. I mean, I feel like if they were to do this, it'd be the only way to m to make Michael Keaton good as Batman. What a joke on Greg's oversized. We've tal. But like I just I never bought it. I didn't get it. I didn't like it. I love those movies. And no, I watch those movies later in my life. I'll agree that like didn't didn't feel right at",
            "start": 1465.28
        },
        {
            "text": "We've tal. But like I just I never bought it. I didn't get it. I didn't like it. I love those movies. And no, I watch those movies later in my life. I'll agree that like didn't didn't feel right at all. atrocious. Yeah. But with with Michael Keaton, I'm just like I love Michael Keaton. Seeing it was Vulture, I'm like, you [ __ ] nailed that. Batman. My thing about what you're saying is even watching them later in life is the fact that I it's a while ago. We've been doing kind of funny, but I went to LA to do something and I in the hotel room that night, uh, Batman 89 was on and I hadn't seen that in forever. And watching it, you're like, \"Wow, the scope and scale is so much smaller.\" Just because that's what movies were involved. And so like to sit here and compare it to any other superhero movie now, it doesn't work. They're not they're not contemporary. But I think that's why I think it'd be awesome to see we're picking this back up and doing this in a in in this world that exists",
            "start": 1504.2
        },
        {
            "text": "movie now, it doesn't work. They're not they're not contemporary. But I think that's why I think it'd be awesome to see we're picking this back up and doing this in a in in this world that exists now where there are these budgets and all these Well, also I mean Batman Beyond in that universe I think is really interesting cuz it is super Tim Burton creepy and kind of gothic weird [ __ ] I think that Tim Burton would go too far with it and make it like modern. Yeah, modern Timur. Absolutely. He's actually backed off a lot from that style though lately. What's the last movie he's done? He did two or something. No, he did. Oh, you know what though? Did he do Alice in one? He's done like 10 Alice in one of those. Yeah, never mind. I I resended that statement. He's still apeshit crazy. I think there's two of them. Yeah. Okay. So, that's what my first my wild card. My next wild card is let's go even further back and really [ __ ] up the multiverse. Flash points there. We're resetting",
            "start": 1546.08
        },
        {
            "text": "think there's two of them. Yeah. Okay. So, that's what my first my wild card. My next wild card is let's go even further back and really [ __ ] up the multiverse. Flash points there. We're resetting everything. We're really [ __ ] with it. We cast David Muz. Who the [ __ ] David Muz? David Muz is the kid who's been playing Bruce Wayne on Gotham this entire time. He's now 16. You sunset Gotham or you have it all [ __ ] exp. And I'm getting crazy cuz it's a wild card. You have it all explode. Flash runs back. [ __ ] Ezra Miller runs into the Gotham thing and like it all collapses upon itself. Pulls him out. Well, no. It all just collapses upon itself. But like I I don't know. I've only seen a little bit of Gotham with the kid like when he was a super small kid. Now he's still there from everything I hear. He's doing well. That I saw a head a tantalizing headline on IGN today about the premiere of the next one. I was like I just I just feel like people want to hate kids so much. Sure.",
            "start": 1583.68
        },
        {
            "text": "I hear. He's doing well. That I saw a head a tantalizing headline on IGN today about the premiere of the next one. I was like I just I just feel like people want to hate kids so much. Sure. Especially kids acting as people like Bruce Wayne. That'd be like getting Carl Carl from Carl be a cool guy. Uh Robin Hole. I I can't separate in a different world. Exactly. In a different world. He's too connected. You hate Carl? No. Well, yeah. I hate the character of Carl, but I'm like two seasons behind. So, okay. Yeah, Carl's cool. I like Carl. Tim, who's your wild card pick for Wildard Wildard? I'm just like I'd love to see this Mark Walverick. Let's just [ __ ] go Mark. I hate how much you hate him. I don't hate him. I don't I don't I just don't I don't enjoy his working. I don't Is that Yeah, you're right. There's something I can't get over. Oh, I just love it. I like how I didn't like how he didn't get along He didn't get along with Eminem. Hey, does he have a card? What's he putting the",
            "start": 1622.64
        },
        {
            "text": "you're right. There's something I can't get over. Oh, I just love it. I like how I didn't like how he didn't get along He didn't get along with Eminem. Hey, does he have a card? What's he putting the card up there for? Hey, is that guy robbing a bank? I should go stop him. I'm Batman. Hey, this is Batman. Stop robbing the bank. So, how do you mother for me? I hate when Nick goes into like My thing is there's a movie called The Happening and that movie [ __ ] sucks. But I could watch Mark Wahberg act surprised with nothing happening around him for [ __ ] hours and I have all of that made sense. He was perfect in that role in the field and he's just like nice. Yeah, I do. I didn't want to grab it cuz you guys are all like hating on me touching you. Who's your wild card spot? Edward. Edward. Edward. Edward. Edort. I [ __ ] love Edward Norton. Edort. And I haven't seen him in movies in a long time. He [ __ ] up all that Hulk stuff. Yeah, he really did. That That was really unfortunate cuz",
            "start": 1667.28
        },
        {
            "text": "Edward. Edward. Edort. I [ __ ] love Edward Norton. Edort. And I haven't seen him in movies in a long time. He [ __ ] up all that Hulk stuff. Yeah, he really did. That That was really unfortunate cuz I thought he was great as the Hulk. I forget what happened. Why didn't he come back? He wasn't like uh the director of Avengers. What's it? Yeah, they have an issue where they don't clash. Well, Edgorn's hard to work with. Yeah. Yeah. That's He's famously hard to work with, which makes me sad. It's too bad that there's certain actors that are awesome. We know something about that. and Haway was supposed to be famously hard to work with. It's like also I don't we haven't called this out in any of our things. Oh man, I just jumped out of the plane without my parachutes. Stick with me. I'm with you. I'll go with you. Michelle Fefeifer just got cast in something that everybody's excited about. It's one of the superhero movies plummeting towards Earth. It's something Marvel. Not Miss Marvel.",
            "start": 1711.84
        },
        {
            "text": "you. I'll go with you. Michelle Fefeifer just got cast in something that everybody's excited about. It's one of the superhero movies plummeting towards Earth. It's something Marvel. Not Miss Marvel. Uh what's that? It's not Black Panther, is it? No. Captain Marvel. No, it's not Captain Marvel. We hit the ground. Yeah. [ __ ] that one up. [ __ ] But I know how we like we like the the old Batman's. So Michelle Feifer getting and the Wasp and Lawrence Fishb She's the original She's the original Wasp. Oh, that's awesome. Oh, that's really interesting. She was so good as Catwoman. Oh my god, she's amazing. Batman Returns I [ __ ] with. You don't [ __ ] with Batman 89. Yeah. Batman Returns. Is that the one that had his face in it? But also Christopher Walkkins, Bruce Wayne. Why? Which again? I think he did it as Marone, right? Boom. I need to rewatch those movies. Wait, no, he was Max Shrek. Max, not Marone. No, he was Mac. He played Max Shrek. Spine. Yeah, that's right. Bruce Wayne. The",
            "start": 1748.48
        },
        {
            "text": "I think he did it as Marone, right? Boom. I need to rewatch those movies. Wait, no, he was Max Shrek. Max, not Marone. No, he was Mac. He played Max Shrek. Spine. Yeah, that's right. Bruce Wayne. The winking. The winking. It's like I don't even think it's Winky. I think at that point it's blinking. It is. I just It's, you know, it's walking. It just is 89 Batman on Netflix. It is. Uh, no. It's on HBO right now. I don't think HBO has all the Batman Batman's. Cool. Batman's Batman's I think it would be hard for Edward Norton to to play the like cool suave guy though. I could see him. He could be swave. I I've never seen him in a role where he plays that. But like I believe in Edward Norton so much that I know that he could kill it. But see, I like that because you don't have two people on screen that are kind of the similar. Like right now we're like we're basically trying to come up with an analog or at least in my brain I'm like I'm going to try to come up with an analog for Henry",
            "start": 1798.76
        },
        {
            "text": "screen that are kind of the similar. Like right now we're like we're basically trying to come up with an analog or at least in my brain I'm like I'm going to try to come up with an analog for Henry Caval. like who would be like Henry Calv because they're like kind of the same person, right? I like Ed Norton because he would be totally different on screen. They would have a way different dynamic. See, Edward Norton or anybody of that ilk when I'm talking about a very lean physique, I could see being the super like you'd have some awesome [ __ ] of him with the the flashlight in his mouth like digging around like, you know, like noir detective real work, you know what I mean? and not being able to engage, which is like kind of weird because I feel like Bale was like just a middle of the, and this isn't an insult, a middle of the road Batman where he wasn't super lean, but he wasn't super buff. He was cut, don't get me wrong, and he looked great and and for the first two movies, the",
            "start": 1841.68
        },
        {
            "text": "and this isn't an insult, a middle of the road Batman where he wasn't super lean, but he wasn't super buff. He was cut, don't get me wrong, and he looked great and and for the first two movies, the fight scenes looked awesome. And then Ben Affleck Batman, right? Like, shut up. He's like huge and he's doing the video game takedowns and all this awesome [ __ ] we we've never seen before. But to have a Batman who would be more like like [ __ ] think of it, Ed Norton Batman would be like Batman Noir doing this a real basic suit on him, right? And then he'd be the Batman from like the opening of the animated series where he's he's dodging fists rather than engaging rather his fighting style isn't getting up. It it isn't getting up and beating you. It isn't Bales like hanging above you and doing something. It's letting you make all the mistakes and then [ __ ] one punch and knocking you out or he sleeps in the shadows. He's very much about the subuge. Punch the dick. Block dick. Punch punch",
            "start": 1876.0
        },
        {
            "text": "something. It's letting you make all the mistakes and then [ __ ] one punch and knocking you out or he sleeps in the shadows. He's very much about the subuge. Punch the dick. Block dick. Punch punch punch man the most effective. What was your wild card? I got two wild cards. I'm going to throw these out at you guys right now cuz I think that it would be [ __ ] awesome to see either of these guys dawn the cape and cowl Idris Elba. Another example of these are just people that you would put in any role in most roles. But I would love to see like it would be fascinating to see a black Batman like to see Idris Elder this giant hulk king of a man cuz like we always think of Bruce Wayne as white but there's nothing necessarily in his past that dictates that he has to be a Caucasian male right see if we're if like if we were to choose an African-American man as Batman yeah specifically this is where like I already know who I'm choosing so Will Smith I want to see him do it cuz he Yeah he's",
            "start": 1913.52
        },
        {
            "text": "see if we're if like if we were to choose an African-American man as Batman yeah specifically this is where like I already know who I'm choosing so Will Smith I want to see him do it cuz he Yeah he's got the cool swave and he can play the like scary guy. So, man, like he could be that would get interesting in the in the universe. Flashoint. Well, I mean, let's be perfectly honest. Floyd Lton is now Batman. Flash point. Do we really feel like we're going to see a lot of Floyd Lton in the rest of the like was that that Okay. I mean, um I'm also going to shout give a shout out to our boy, The Rock, who I think could play Batman. I think he could. This is Yeah, this is just a list of let's put people we like in movies. Um and don't get me wrong, my fun movies. Talk about the people that we like are excited to see in movies and stuff. So that makes sense that we're throwing the actually is my is my wacky choice. BT dubs branch for a second. How was ballers episode one? Don't spoil it.",
            "start": 1951.12
        },
        {
            "text": "like are excited to see in movies and stuff. So that makes sense that we're throwing the actually is my is my wacky choice. BT dubs branch for a second. How was ballers episode one? Don't spoil it. Great. I can't wait to watch it tonight. Idris Elba in that Dark Tower movie looks awesome. Looks [ __ ] awesome. But it's like I feel like that's what I want from an interesting looking movie. Yeah, it is. But where it's like a role where it's like I mean I'm sure there's many people that are huge fans. I know there are. I'm not. I don't [ __ ] know anything about that. So I see this slowly the book's amazing is now making this character for me. Like I'm going to think of this character as you're not a huge fan of Dark Tower. I just don't know what it is. I I'm not familiar with it that much. I thought you said I thought you meant but you're not a fan of him. Oh, who the [ __ ] not a fan of? Yeah, he's a bad [ __ ] No, he's like perfect. Um The Rock is probably my wild card like or my my",
            "start": 1997.04
        },
        {
            "text": "I thought you said I thought you meant but you're not a fan of him. Oh, who the [ __ ] not a fan of? Yeah, he's a bad [ __ ] No, he's like perfect. Um The Rock is probably my wild card like or my my zany pick. I like putting The Rock in as Batman is completely absurd. Of course it is very absurd. Do Do you remember Can I talk Can I continue on the rock? Do you do you do you remember the first time The Rock hosted SNL? Cuz it was a huge moment for me in my WWE brethren cuz he was there. No, that wasn't that one. But he did a sketch where he was Clark Kent but Superman, you know what I mean? Or whatever. And so it's him at the Daily Planet typing and he's in this way too small dress shirt and tie and like you can see the Superman thing and like everyone's [ __ ] with him cuz everyone's like, \"You're obviously Superman.\" And so everybody's like making comments about Super. He's like defending him or whatever. It' be the exact same thing of like Batman's [ __ ] huge Samoan and then then",
            "start": 2036.24
        },
        {
            "text": "\"You're obviously Superman.\" And so everybody's like making comments about Super. He's like defending him or whatever. It' be the exact same thing of like Batman's [ __ ] huge Samoan and then then and then Bruce Wayne shows up in parties like scraping every like uh I noticed you have a [ __ ] arm tattoo just like when Batman's out of got ripped away. That is fair. That is fair. Um my last pick just going younger is an actor that I love and I want to see him do more stuff is Nicholas Hol. Are you familiar with this guy? Is this a real one? He's a real This is This would be kind of like a throw in there. He's very young right now. Now he looks pretty like he's the guy he plays the young he plays young beast in Jazz. I didn't realize I didn't like I didn't think he'd be a valid choice until I realized that he was 6'3. So I feel like if you can get him jacked with this baby face. Oh, he'd be a good looking. It's crazy what studios can do to actors bodies with enough money and time. Like",
            "start": 2075.2
        },
        {
            "text": "I realized that he was 6'3. So I feel like if you can get him jacked with this baby face. Oh, he'd be a good looking. It's crazy what studios can do to actors bodies with enough money and time. Like tell me that's not a great Bruce Wayne right now. That's a phenomenal guy. We're looking at search and you'll find it. Write it down. Just say it right now. Okay. I'm going to do my crazy one. All right. Give me your crazy. I'd really like to see Jude Law, okay, play the role because I think his overthe-top I'm a huge fan of Jude Law in the same way that I am with Edward Jude Law. I love Jude Law. I'm I think the only person in the world that's watched uh New Pope Young Pope. You're not the only person, but there was there's a handful of young go. I really want you to watch it cuz I think that like the way it's shot, every shot I look at in that thing, I'm like, \"Oh my god, looks beautiful.\" Dian Katon's in it. I just think that he'd be so kooky. Yeah. You know, he'd make a great I don't",
            "start": 2112.56
        },
        {
            "text": "like the way it's shot, every shot I look at in that thing, I'm like, \"Oh my god, looks beautiful.\" Dian Katon's in it. I just think that he'd be so kooky. Yeah. You know, he'd make a great I don't think Batman. I think kooky. Hey, he said this is the fun. All what I'm saying is like he could play the like playboy aspect really well and he also plays a crazy psychopath like super serious like I'm super determined role also really well. But Jude Law I feel like doesn't look anywhere near the right like aesthetic for it. No, he's probably a little too small for but again and Norton he could fit in that. There are lots of different types of Batman. And then my like second pick for the crazy one is I'd really like to see um and we're talking about Batman Beyond. Yeah. Jack Nicholson playing Batman, which I know is crazy cuz old Batman the actor who I can't remember his name right now from uh Baby Driver being the lead of Baby Driver being Terry McInness. That's handsome. I could see that",
            "start": 2156.8
        },
        {
            "text": "which I know is crazy cuz old Batman the actor who I can't remember his name right now from uh Baby Driver being the lead of Baby Driver being Terry McInness. That's handsome. I could see that duo being really [ __ ] cool. Yeah, that's good. Yeah. Cool. Did we go through your everyone's picks already? No, we haven't done We haven't done crazy. What's your crazy pick? What's your fun one? Oh, Mark. Oh, I thought it was your wild card. Oh, I didn't define these very well. Yeah, that's my bad. What's the difference between crazy and wild card? Crazy is Yeah, it doesn't matter. Doesn't matter. I mean, for Yeah, I for what I had written down and fun and then the one I really want and then wild card. And so for fun, which is it'll never happen. It's stupid. I put Michael Sarah. I I mean I don't want that to happen, but I mean that's what we're talking about here. I was thinking Seth Rogan earlier. Uh well, he already got to be Green Hornet, right? He did. That was that was the movie. No, I",
            "start": 2201.36
        },
        {
            "text": "want that to happen, but I mean that's what we're talking about here. I was thinking Seth Rogan earlier. Uh well, he already got to be Green Hornet, right? He did. That was that was the movie. No, I mean I didn't think that movie was that bad. And I thought like his character It's so funny how similar his character is to Bruce Wayne. Oh yeah, that that aspect of it. Not the the Batman cuz he wasn't taking it serious. And thank God for what's the other guy's name? Ken No. Ko. Ko. That's it. Oh yeah. Yeah. He saves his life every time. Sure. Yeah. Did you do your crazies? I think so. I think my rock's the craziest. Okay, cool. We all They got looped together at the end. We just started throwing out actor names. Originally for the crazy, I was going to say Joe Peshy cuz Kevin Spy. That would be [ __ ] Kevin Spy is an old. That would be really cool. God, Kevin Spy, another actor. I love Kevin. Yeah, I just believe. You ever watch Beyond the Sea? No, I did not. You got to go. Well, go",
            "start": 2249.44
        },
        {
            "text": "be [ __ ] Kevin Spy is an old. That would be really cool. God, Kevin Spy, another actor. I love Kevin. Yeah, I just believe. You ever watch Beyond the Sea? No, I did not. You got to go. Well, go watch Beyond the Sea. Oh, that's the uh it's a biopic, right? Yeah. Yeah. about uh it's him and Kate Bosworth and it's Yeah. Uh Bobby Darren. Bobby Darren. Yeah. And god damn that turned me around in Kate Bosworth cuz Superman returns. She burned a lot of goodwill with me. You did not like her after that. And Kate Bosworth, she did turn. Thanks for watching this episode of the Game Over Greggy Show. Click here to subscribe to us. Click down here to go to the Patreon and support us. Click over here to go check out youtube.com/kindfunnyames. And click down there to subscribe to youtube.com/kindfunny games. Like if you just want to subscribe to both. Is that what you said? Cuz that's not I've never done that. It is a playlist. It is a playlist. Yeah, that's a playlist.",
            "start": 2288.6
        }
    ]
}