{
    "id": 14217,
    "video_id": "-WeAee44FY0",
    "show_name": "Kinda Funny Podcast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Joey Noelle"
    ],
    "title": "Root Beer SUCKS! - Kinda Funny Podcast",
    "description": "Go to http://kindafunny.com/XREAL to grab yours now!\n\n00:00:00 - Start\n00:03:00 - Root Beer  Sucks\n00:30:00 - Dont eat gum\n00:33:54 - Isabela Merced is making music and hilary duff got robbed\n00:40:00 - Nick and D long drive\n00:45:00 - Bad theaters experiences\n00:49:05 - We did it! And superman toys\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1748899769,
    "duration": 4128,
    "transcript_chunks": [
        {
            "text": "[Music] [Music] What's up everybody? Welcome to the Kind of funny podcast. I'm one of your hosts, Greg Miller, alongside the producer/seducer, Nick Scarpino. Hello. Now, are these chinos? What are these khakis? What kind of pants am I dealing with here? Uh, I mean, this is a green. Yeah, but I mean like what is this a style? Oh, this I think is like a carpenter pant. Carpenter pocket over here. Let me see. Oh, it's got them where you hang the hammer. You can put a hammer hammer. What do you put in a workman pant? Would I put in that slot? My cigarettes. Nick, you know, we've worked together a long time. Sure. Uh, have you ever grabbed Tim by the back of the neck right there? Cuz do it. It's got It's got He's got a girth and it's got a feel to it. Yeah, he does. You don't expect it. You know what I mean? It's all that tension. He keeps it all right here. You know what I mean? Grab him during games cast. I was like, is this a [ __ ] bull? You know what I mean? What am I grabbing over",
            "start": 0.23
        },
        {
            "text": "know what I mean? It's all that tension. He keeps it all right here. You know what I mean? Grab him during games cast. I was like, is this a [ __ ] bull? You know what I mean? What am I grabbing over here? He's got a what? He's all shoulder. He's all shoulder. There's no neck back there. God, he's for 30 under 30, aka the second best baby blues in San Francisco. Aka the second place Game Showdown season 3 participant at Tim Getty's. Let him host. I've never actually checked. Were you second place or third? Did Andy beat you in the finale? He did not. I think we tied. Oh, well then tied. I should start introducing Andy. I was in third. I know that. Okay, fair enough. And then of course, rounding out the quartet, it is for the first time Christmas in June. Joey Noel. It is. Hey, the first Well, you know, it's the second of the It's the first. I had to change the month. I had to think of it while I was changing. How you doing? I'm good. I like this X-Men shirt a lot. Thank you. I'm",
            "start": 55.52
        },
        {
            "text": "Well, you know, it's the second of the It's the first. I had to change the month. I had to think of it while I was changing. How you doing? I'm good. I like this X-Men shirt a lot. Thank you. I'm wearing an awesome Superman shirt. You're wearing an awesome X-Men shirt. You like how he was fishing for a compliment there, Joey? What? He complimented your shirt, but he really he wanted you just on my shirt. I've been getting compliments all day long in the shirt. It's been getting comments all day long. Compliments actually. Comments? No. No. Comments? I complimented you on. Yeah. What is the shirt? Is it the new Superman? Yeah. Yeah. It's just James Gun Superman, but it's it's black. So, I mean, I guess kind of looks like King Kong, but yeah. Look up. Look up. It's from the collection. I I've been giving you shouts the entire time. Yeah. Cuz as soon as I walked in, Roger immediately was like, \"That's a great shirt.\" I'm like, \"Thank you. I'm like, \"It's from DC Comic Shop.\" Uh, and he's",
            "start": 99.76
        },
        {
            "text": "been giving you shouts the entire time. Yeah. Cuz as soon as I walked in, Roger immediately was like, \"That's a great shirt.\" I'm like, \"Thank you. I'm like, \"It's from DC Comic Shop.\" Uh, and he's like, \"Oh, man. You had those other ones, too, right?\" And I'm like, \"Yeah, Tim hated them, remember?\" He's like, \"No.\" I'm like, \"Remember the first time I wore them?\" I said, \"What do you think of this, Tim?\" And Tim went, \"It actually looks like really low quality.\" And I was like, \"It is.\" And they've all [ __ ] fallen apart. This one does is a comfort color shirt, which I'm a big fan of those. And so far, I think the screen I think this isn't the screen printing nonsense that the other ones were. It looks better. I like this one. Okay, good. I'm glad about that. Uh, let's talk about things we don't like. All right. And we're start we'll get to the rig and roll and all that and the housekeeping. We're gonna start with a tactical takedown. All right. A kind of funny precise attack on",
            "start": 133.76
        },
        {
            "text": "we don't like. All right. And we're start we'll get to the rig and roll and all that and the housekeeping. We're gonna start with a tactical takedown. All right. A kind of funny precise attack on root beer. Root beer. Root beer. Kevin, throw up the BS I put up. All right. I put up a blue sky over the weekend. I sent it to assets and I was like, if you are a a sicko who likes root beer, show yourself. Cuz we were driving up the coast of California. If you drink root beer regularly, show yourself, you sicko. Driving up the coast of California, past an A&W, which I didn't know these things existed anymore, let alone one tucked away here in California. There's one singular one. I think I'm saying I'm already making my point. Here's root beer [ __ ] But it could also be bad. Mug exists. We all understand that. Like there's tears to this [ __ ] Like mug is pretty I'd say mug is the one of the more offensive flavors of a thing compared to the other versions of it that we've ever had. Like",
            "start": 165.36
        },
        {
            "text": "understand that. Like there's tears to this [ __ ] Like mug is pretty I'd say mug is the one of the more offensive flavors of a thing compared to the other versions of it that we've ever had. Like Barks has bite. Barks is top tier. Barks. Barks is the coke of the situation. Sure. And then AW or A&W. A uh it's somewhere in the middle. I do appreciate that they have their own stores and that they have like, you know, the fancier version of it that does taste a little different. So, they understand. It's just one of those things. And I, you know, I'm being a bit over the top as I tend to be, Nick. It's why I was trending gamer. But it's that idea of like it's just mindboggling to me that root beer exists out there and is making a killing enough that there's multiple brands of it because I just don't ever hear anyone sit down and order a root beer. I hear people sit down and order a Coke. A Sprite. Sure. That's it though. Adults don't order Sprite. Huh? You hear you. Was it a great while?",
            "start": 208.48
        },
        {
            "text": "don't ever hear anyone sit down and order a root beer. I hear people sit down and order a Coke. A Sprite. Sure. That's it though. Adults don't order Sprite. Huh? You hear you. Was it a great while? Yeah. Po's a big Sprite kid. You know what I mean? Yeah. I mean, I do feel like that the cola and the lemon lime are the the chocolate and vanilla, but I think the root beer is the strawberry. And I Dr. Pepper you think Dr. Pepper? Well, no. I I would Dr. Pepper I feel like is an offshoot of root beer. See, when I when you when we when we go somewhere and you order a Dr. Pepper, I'm like, \"Wow, fancy.\" And when you when you order a root beer, I'm like, \"Ah, you poor person. Get out of here.\" You know what I mean? The opposite with you. Okay. Dr. Pepper to me seems weird. Root beer seems like Americana, but that's Are you talking about the A&W? Have you seen there's an A&W kind of up near Napa area? Yeah. So, it's always hilarious cuz I always see that and I go, \"Oh, I'm I'm staying with you",
            "start": 254.24
        },
        {
            "text": "but that's Are you talking about the A&W? Have you seen there's an A&W kind of up near Napa area? Yeah. So, it's always hilarious cuz I always see that and I go, \"Oh, I'm I'm staying with you where I go, oh, interesting.\" and AW is still around and then I immediately go to Taylor's refresh or the God's roadside which is so much better place way better ambiance more expensive but they have all the [ __ ] like artisal soda like nobody likes places with [ __ ] organic artal [ __ ] the root beer root beer is pretty good nozzle gats and I know this because I haven't we don't do diet coke that much anymore but the other last time me and D were up there she was like should we get crazy should we get a diet coke Coke and we did the thing where we got one and then I we each drank five refills of that one Diet Coke and I was like I got to tip these people now. As a quick aside, still in the same conversation though, went to Costco as well this weekend. Had a delicious piece of pizza. You know",
            "start": 302.32
        },
        {
            "text": "that one Diet Coke and I was like I got to tip these people now. As a quick aside, still in the same conversation though, went to Costco as well this weekend. Had a delicious piece of pizza. You know what I mean? Had a strawberry Sunday. Is that your default at Costco is a slice of pizza, not a hot dog. Yeah, 100%. Again, if I I Portill's ruined me. I want I want that kind of hot dog in a Costco hot dog. Isn't that I'm not insulting you. I'm yucking your yum. You know what I mean? But if I'm at Costco, you bet your ass I'm getting a piece of cheese pizza. Cheese? Yeah. I don't think their pepperoni adds anything. I'm on this for a while. I think the cheese is perfect. It doesn't need to be. They perfected it. Mr. Costco or Mr. Co. I'm not sure. Was like, you know, bam, we crushed this. Anyways, though, why are they still serving Pepsi? I remember we had a big celebration through the end of the summer, I think, is when they're supposed to. You know what I mean? They'll figure it out. I",
            "start": 345.52
        },
        {
            "text": "though, why are they still serving Pepsi? I remember we had a big celebration through the end of the summer, I think, is when they're supposed to. You know what I mean? They'll figure it out. I remember going to Costco when I was a kid and being so excited that I could probably talk my mom into letting me get a hot dog and a chicken bake. Oh wow. Yeah. Hot dog. A chicken bake. Yeah. The latest Scarpo was just like whatever this kid wants to shut him up. Shut him and his brother up. And man, that was a lot of food cuz I'm I'm a hot dog slice of pizza guy at this point in my life. Both. Yeah. I don't necessarily finish both, but I want I have at least But at that price, at that affordable price wasn't bad. Literally all in with a soda. I would say probably the moment I became an adult and Greg you'll appreciate this. I will appreciate that everyone was when I got a hot dog and I remember thinking to myself, you know the little spets they have where you turn them and the onions come out.",
            "start": 385.12
        },
        {
            "text": "you'll appreciate this. I will appreciate that everyone was when I got a hot dog and I remember thinking to myself, you know the little spets they have where you turn them and the onions come out. Yeah. Yeah. Gross. And I was like, I kind of want relish and onions on my hot dog. And I remember thinking eating it and being like, I'm a man. I'm a man. You're right now. You're [ __ ] right. And I should probably go to war. I have a refined I should probably fight for my country now. I have a refined pallet. Unlike the people who drink root beer, I think even even taking a step further with what you were saying, I'd go as far as saying enjoying the taste of mustard means you're a man. You're a grown up. Being discerning mustard then you're a grownup like this where you go, should I have the mustard? I don't know. Even asking the question. I'm just a hind ass yellow ass mustard. I feel like that was an acquired taste as I got older. I didn't really [ __ ] with mustard until I don't know,",
            "start": 423.2
        },
        {
            "text": "mustard? I don't know. Even asking the question. I'm just a hind ass yellow ass mustard. I feel like that was an acquired taste as I got older. I didn't really [ __ ] with mustard until I don't know, maybe I was like 28. I thought when you started it. Yeah. And I was just like, maybe I should try this again. I was like, damn, it's kind of good. Yeah. I don't have a turning point with mustard. I feel like that's always been pretty iconic with me. Yeah. Is it just the ketchup? Yeah. The ketchup mustard pickle hot dog order has been the same since I was a child. So, yeah. I don't know why I turned the corner. But root beer sucks. It just doesn't. It's not even again. It's not even sucks. Let's just talk about barks. Barks root beer. Yeah, it has bite. But again, it's just like who's who needs this? Who's like I I I You don't want a coke. You don't want to spray that. You don't want a Dr. for pepper cuz you mean like but Ruby what do you not like about cream soda I love I love cream soda",
            "start": 466.8
        },
        {
            "text": "this? Who's like I I I You don't want a coke. You don't want to spray that. You don't want a Dr. for pepper cuz you mean like but Ruby what do you not like about cream soda I love I love cream soda once in a great while sure kick your heels up but what you said something I forget who it was I apologize that oh there's something Americana about root beer and that's one of our big problems as a country we've solved a lot of things racism classism we're in a great spot everywhere else right but the real thing is like when I go to the [ __ ] baseball game and I still buy Cracker Jackack I'm like we got to get over traditions nobody wants Cracker Jack it's Why do you keep buying? No one is just enjoy Ben needed it. You know what I mean? Ben want 17 other snacks you can get my He ordered them all, Joey. I'm broke. Please go to Patreon. I've never once in my life eaten a Cracker Jack and not to myself. I just wish this was caramel corn. But it kind of is, right? Kind of not though. I",
            "start": 506.48
        },
        {
            "text": "them all, Joey. I'm broke. Please go to Patreon. I've never once in my life eaten a Cracker Jack and not to myself. I just wish this was caramel corn. But it kind of is, right? Kind of not though. I appreciate that Cracker Jack the nuts and all the garbage in it and now there's like, you know what, it is just caramel corn now. It's just like but it but it's like caramel but like when you go and you get the bin of the that no matter how hard I try always permeates our studio during Christmas five six bins come in and you eat the caramel corn it's not as like dark as the Cracker Jack the Cracker Jack's like a burnt caramel taste and I like Cracker Jack. I'm not saying that but every time I eat it I think to myself. Have you ever eaten crack outside of a baseball game? Cuz I made when I was at the baseball game recently I made a big stink about this. So, I was like, not a big a BS. But then I noticed at Target the other day, they actually had him at checkout and I was like, I'm [ __ ]",
            "start": 545.76
        },
        {
            "text": "at the baseball game recently I made a big stink about this. So, I was like, not a big a BS. But then I noticed at Target the other day, they actually had him at checkout and I was like, I'm [ __ ] impressed that I see this all of a sudden. I I remember my dad eating a like a box of Cracker Jack, but like not finishing it and like saving it for later. Yeah. Like Lou would just have a He was just like, oh, take a box out. Yeah. Yeah. I was like, is that the same box you've been eating for 6 months? This My thing with the Cracker Jackack versus just like caramel popcorn. Like obviously the caramel popcorn's better, but I feel like it it just gets too seamy too fast. I like the Cracker Jackack has a little bit of a difference. It's like Lucky Charm. We're like, \"Yeah, everyone just wants the uh marshmallows.\" You don't, though. The moment you try that, you get They sell just the marshmallows now. It's too much, man. That's why I had them on ice cream for John Andre's daughter's birthday.",
            "start": 586.16
        },
        {
            "text": "uh marshmallows.\" You don't, though. The moment you try that, you get They sell just the marshmallows now. It's too much, man. That's why I had them on ice cream for John Andre's daughter's birthday. Pretty good. In the chat here, a drug addict named Ja021 says, \"I had a THC root beer recently, and that was actually pretty solid.\" Well, yeah, it was drugs. You were on drugs. Not your father's THC root beer. Really good. Dude, Greg, I think you're wrong on this one. Mainly because barks exist. If barks It's not even that I'm wrong. It's just bewildering that the there are people enthusiasts out there that are like, let's Yes, there's a bunch of psychos who answered my blue sky of like, I [ __ ] have a a mug from 1956 that I keep in my freezer so I can pour it like they used to at the restaurant. I'm like, wow, man. Get a hobby. You know what I mean? Get a hobby, you [ __ ] loser. Have you tried the root beer cookie pieces from Trader Joe's that they have? So hot. Jesus Christ. Put your",
            "start": 620.0
        },
        {
            "text": "I'm like, wow, man. Get a hobby. You know what I mean? Get a hobby, you [ __ ] loser. Have you tried the root beer cookie pieces from Trader Joe's that they have? So hot. Jesus Christ. Put your hand on his hand. Give me your hand. It is hot. It's a hot man. Why are you Why are you so warm? I just burn out, man. I'm cooking my right now. Sweating. Like, why is my knees sweating right now? We got a water. What are you asking? Ruby or the ruby? They have these. Kevin, can you pull up a tweet again? cuz I replied with a picture of these. Trader Joe's right now has these like root beer cookie pieces. They're like vanilla cookie sandwiches that are covered in like a root beer candy uh like coating and then they have pop rocks on the inside and it's very fun. And I think that you should try them cuz they're very good. And I will say root beer flavored things. These are these are the exception. These are actually good. What about those little Coke bottles you used to get? Remember those",
            "start": 668.16
        },
        {
            "text": "them cuz they're very good. And I will say root beer flavored things. These are these are the exception. These are actually good. What about those little Coke bottles you used to get? Remember those little gummy Coke? I love those. I remember root beer were always a big deal with the kids for some reason. Not my not me. The other kids. Yeah. barrels. That's those not as good. The Coke bottle gummies I think are top tier. And see, throw it back up. Like this is another interesting thing. Speaking of throwing up, too. Root beer floats. I feel like a lot of people have some like this was a thing of ice cream and soda mixed together. So that was a big deal. Maybe that's where this all goes wrong cuz when I went to a sleepover at Travis's house when I was like five or six, yeah, I had one of those. I [ __ ] barfed. You know what I mean? Wow. So I just Maybe that's where I went wrong with root beer overall. I do think that they're complimentary flavor though. That's why I feel like I look",
            "start": 713.68
        },
        {
            "text": "those. I [ __ ] barfed. You know what I mean? Wow. So I just Maybe that's where I went wrong with root beer overall. I do think that they're complimentary flavor though. That's why I feel like I look at root beer and like cream soda is a cousin of it and cream soda is essentially just trying to get a root beer float into soda form. What do you compliment it with though? When you're drinking a root beer, what do you want? Vanilla ice cream. See, that's the thing. That's not true. I mean, I would be down for that though. It's been at least 20 years since I've had a root beer float. But if you have root beer float, just have a Sunday. Yeah. The root beer had fudge Sunday on that. What do you do on the weekends? I take care of a three-year-old. You want to hear? You have to eat what he eats. Do you want to No, it's just fun. It's better. So, let's This will be a fun one for you. So, you know, Jen, you listened in this past weekend. You were like, \"Pizza.\" Costco. Yeah. Yeah. The pizza.",
            "start": 750.0
        },
        {
            "text": "Do you want to No, it's just fun. It's better. So, let's This will be a fun one for you. So, you know, Jen, you listened in this past weekend. You were like, \"Pizza.\" Costco. Yeah. Yeah. The pizza. Yeah. Uh, you had the rubber float. What else did you get with the pizza? Uh, I had a Well, he had a Sunday. He had a strawberry Sunday there. And you had some of his strawberry, of course. Yeah. Yeah. The kid on Saturday. I had a hot fudge. Wait, you on Saturday? At Saturday, he had the strawberry sundae. On Sunday, I had a hot fudge sundae. All right. At the ice cream shop. Walk me up to the ice cream shop. What was the decision making behind? I've never seen anyone order like an actual Sunday. That's insane behavior. Cuz you just order like scoops of ice cream like a normal person. A banana split. Okay. Okay. Hold up everybody. All right. Cuz you're all starting to throw strays. You don't understand what was happening here. For some reason, Jen and I are insisting on being amazing",
            "start": 788.24
        },
        {
            "text": "split. Okay. Okay. Hold up everybody. All right. Cuz you're all starting to throw strays. You don't understand what was happening here. For some reason, Jen and I are insisting on being amazing parents. You know what I mean? Checking all of our wants and desires at the door to take care of this little goblin. Okay. So, yeah, se Sunday's plan was pretty spectacular. They started planning on Saturday a little bit while we were at Costco. But Sunday, we woke up and we went to the beach. Oh, I drove up north. Went to the beach. Yeah, you saw pictures. It was cold, but it's still nice. He We did sand castles on the beach. We sat there. We Jen made amazing sandwiches. cuz you saw the video probably of the talking. I showed it to my mom. She thought it was very funny. Mr. S. If you go to my Instagram, Kevin, we can look at it looking on Mr. S, who you might remember from this show. Of course, reference. Exactly. Who, by the way, I tagged the author in this video and I'm like, this will",
            "start": 833.04
        },
        {
            "text": "Instagram, Kevin, we can look at it looking on Mr. S, who you might remember from this show. Of course, reference. Exactly. Who, by the way, I tagged the author in this video and I'm like, this will definitely get her to respond, which will open up the door for me to find out what Mr. S's real name is. She has not responded to this day. So, she is bad at Instagram, apparently. We'll see. Oh, definitely. That's the only reason. It's the only a lot of people making high quality content about our goddamn sandwich. She playing this with some sound. Here's Jen making the sandwich from the book. Mr. S is here. Oh, Benny, I'm so excited to go to the beach. It does look like a really good season. It was It was amazing. And credit to Jen. Like, she said that exactly the way I would think that sandwich would sound. She animates them, too. Is here. My favorite thing about all of these videos that y'all post and send me is that, and I'm just going to say this, and I don't want you to confirm or",
            "start": 872.16
        },
        {
            "text": "would sound. She animates them, too. Is here. My favorite thing about all of these videos that y'all post and send me is that, and I'm just going to say this, and I don't want you to confirm or deny this, okay? But sometimes, Joey, it feels like they're having a laugh on top of having a laugh. And then sometimes it feels like, and again, I'm not saying this is a thing or not. It seems like that laugh might be fueled a little bit by alcohol. Just a little bit. Little morning mimosa. No, don't give me Don't give me every once in a while I get one of the uh my godson, you know, Ben and I like I can tell Greg's we've had a couple IPAs laugh. I'm trying to raise him, right? Pizza and ice cream both days. Anyways, though we went to the beach, had an amazing time there. The idea was that we were going to go uh we were over in Stinson Beach, right? We've all been there, right? Lovely. Very small beach community here in the California Bay Area. And there's the snack bar there, but we had",
            "start": 913.6
        },
        {
            "text": "were going to go uh we were over in Stinson Beach, right? We've all been there, right? Lovely. Very small beach community here in the California Bay Area. And there's the snack bar there, but we had parked kind of far from it. So, we're like, \"Oh, we'll drive.\" I've never been to Stinson Beach. Really? Oh, it's lovely. You should go. Maybe like a long long time ago. Maybe we drove, but there was no spots when we left. And so I was like, \"All right, you know what? We'll just get ice cream back towards home.\" And then we when we hit the highway, Jen was like, \"What if though?\" We went to that really fancy banana split place up even further. We're like, \"Yeah, what if it's Sunday? We're killing the time or whatever.\" So, we went over there to get that. And the fancy banana split place. Oh god. It's up north. Uh San Raphael Silberman's I think. Sberman's. It's like an old timey ice cream shop up in the Marin area or whatever. We drove up there. Ben fell asleep. So, he got to wake up to",
            "start": 959.12
        },
        {
            "text": "god. It's up north. Uh San Raphael Silberman's I think. Sberman's. It's like an old timey ice cream shop up in the Marin area or whatever. We drove up there. Ben fell asleep. So, he got to wake up to ice cream which is always exciting obviously. But on the drive there Jen was like fancy banana split. She's like let's all split a banana split cuz we've done that before in the name. And I was like adamant of I will not be doing that. It's like I am I know I mean put your foot down somewhere. I'm a big fat guy. I know. But I'm not a sweets guy. I'm not a sweets guy. So when I'm in the mood for something sweet like I want and I was like I want a hot fudge [ __ ] sundae. I And she's like okay well me and Benel split the banana split. I'm like I don't give a [ __ ] what you do. I'm getting a hot fudge sundae. So we pull that's a for you guys to order a hot fudge Sunday and a banana split is kind of crazy. Egregious. Those are the things. I hate those things. Yeah, these aren't that great. I",
            "start": 991.36
        },
        {
            "text": "fudge sundae. So we pull that's a for you guys to order a hot fudge Sunday and a banana split is kind of crazy. Egregious. Those are the things. I hate those things. Yeah, these aren't that great. I cannot. My dad used to love these and I always try. If you're an audio listener, these are dad's oldfashioned root beer candies. Oh god. little barrels. Yeah, I was like stuck in your teeth. We pull in and we park, you know, uh Jen wakes up Ben and I'm like I Cole was with us, of course. Cole's got to be there. You know what I mean? We got the dog and I'm like, \"Cool. You guys go in and order and then come out.\" She's like, \"All right, what did you want?\" I'm like, \"I want a hot fudge sundae, noon nuts.\" She's like, \"All right.\" She goes in and orders. I'm sitting there with Cole. Ben comes out, but I don't realize it's Ben at first because I'm like on my phone or whatever. And but I'm at a little table like right in front of the door and another little girl just says to a little boy,",
            "start": 1039.36
        },
        {
            "text": "out, but I don't realize it's Ben at first because I'm like on my phone or whatever. And but I'm at a little table like right in front of the door and another little girl just says to a little boy, \"What ice cream is that? Is that blueberry?\" And I look up and it's Ben. And he comes to me and he sits and I'm like, \"Well, I wasn't even there.\" I'm like, \"Ben, is it blueberry?\" And he's like, \"No, it's bubblegum.\" And and he's like, \"No, it's bubblegum.\" You're horrified by this. Yeah. Yeah. Me, too. A bubble gum banana split with No, no, no, no. I'm sorry. This is just a He has a bubble gum and a cone. Oh, that's fine. Yeah. Yeah. Yeah. Still gross. But like I don't like bubble gum ice cream person. Exactly. Exactly. And he definitely went for it because it's blue. He loves blue. Yeah. And then this little girl's like, \"Good kid. Is it blueberry?\" No, it's bubblegum. She goes, \"Can I smell it?\" Random girl off the street here. Just random little girl and older than Ben. God, Ben's got",
            "start": 1079.28
        },
        {
            "text": "then this little girl's like, \"Good kid. Is it blueberry?\" No, it's bubblegum. She goes, \"Can I smell it?\" Random girl off the street here. Just random little girl and older than Ben. God, Ben's got some red. Seven. And I'm like, \"Ben, can she smell it?\" And he's like, \"I guess.\" And so she leans in and smells it. And she looks at me. She goes, \"It doesn't smell like bubble gum.\" And I'm like, \"I don't know what to tell you. It's ice cream.\" Girl walks away. Not less than two minutes later back. Can I smell it again? Yeah. Okay. Smells it again. And I I'm like, I'm drawing the line at licking it or putting your nose in it. And then she just walked off. And that was the end of that little girl. Jen Jen comes out now. She's got a little cup with coffee ice cream in it. And then she's got a a cup for me of banana split and she puts it down. Cup of banana split. I'm sorry. God damn it. Hot chocolate hot fudge Sunday. She puts it down and it's like a a soft drink thing with a top on it.",
            "start": 1114.4
        },
        {
            "text": "a a cup for me of banana split and she puts it down. Cup of banana split. I'm sorry. God damn it. Hot chocolate hot fudge Sunday. She puts it down and it's like a a soft drink thing with a top on it. Like not. And she's like, \"They asked me if I wanted to to go and I panicked.\" And I said, \"Okay, no big deal.\" And she's like, \"Yeah, but I got you the chocolate you wanted.\" And I'm like, \"I didn't? What do you mean?\" And she's like, \"Well, they I they asked if you want vanilla hot fudge sundae and vanilla or chocolate ice cream.\" I'm like, \"I I don't care.\" And she's like, \"And it's got nuts in it.\" I'm like, \"All right, well, you know what I mean. We got I got a hot fudge sundae. It's got nuts in it. It's no big deal.\" I You end up getting a hot fudge Sunday with chocolate ice cream and nuts. Vanilla and chocolate ice cream. Vanilla and Okay. All right. So, it worked out in the end. We all net it out evenly. But I'm I [ __ ] crushed my thing and I'm happy as a clam. She She's eating",
            "start": 1150.96
        },
        {
            "text": "nuts. Vanilla and chocolate ice cream. Vanilla and Okay. All right. So, it worked out in the end. We all net it out evenly. But I'm I [ __ ] crushed my thing and I'm happy as a clam. She She's eating mine, too. Of course, I didn't remember saying I was going to share it with her. But she's eating you explicit that you weren't going to share. And then she And then I'm like, \"Oh, wait. You didn't get a banana split?\" She's like, \"I had no partner.\" She's like, \"I couldn't get a fancy banana split by myself.\" I'm like, \"Well, sucks to suck. What are you going to do?\" Anyways, so then we go home. What do I do on the weekends? Then we go home, right? We get there. We're going to start Jen's going to start cooking a bit. She wants to walk home. I'm like, \"I got Ben for a bit.\" I'm like, \"Ben, do you want to have a big super surprise?\" And he goes, \"Yeah, I want to have a super surprise.\" I'm like, \"Okay, great. Hold on one second.\" And I went to the kitchen. I unboxed all the Superman toys",
            "start": 1189.92
        },
        {
            "text": "you want to have a big super surprise?\" And he goes, \"Yeah, I want to have a super surprise.\" I'm like, \"Okay, great. Hold on one second.\" And I went to the kitchen. I unboxed all the Superman toys I had bought him, right? And I laid him on the table. Then I came down. Then I had him watch the Superman trailer again on the big screen this time cuz he only seen on my phone, right? And I was like, \"Go to the kitchen.\" And he went to the kitchen, lost his mind because all the Superman toys were there. And we just played with Superman toys. We got the Kaiju Battle one. You see that? Like the slime falls out of them. And we played with that. Ben's having a great time. We're having so much fun. You know, then you know, Jen comes home, she makes dinner. We go up there and we sit down and we're just like, \"What a lovely family day. What a fun time this has been.\" And Jen goes, \"Ben, did you have a good time today?\" And he goes, \"No, I didn't like the day.\" I didn't like the day. Awesome.",
            "start": 1223.04
        },
        {
            "text": "just like, \"What a lovely family day. What a fun time this has been.\" And Jen goes, \"Ben, did you have a good time today?\" And he goes, \"No, I didn't like the day.\" I didn't like the day. Awesome. Peach ice cream Superman not good enough. Then we ran through all the different things we did. How could you not like that little girl? He was cold at the beach. He said was his one his one point that ruined the entire thing here. But the thing is your son Ben is saying it with a this little smirk he does when he's saying the opposite. So we know he's joking or whatever. We break the reaction. We break into teams. I go tackle the dishes. Jen starts the put down process and you know giving him his bath or whatever. Eventually, Ben starts calling to me and I come back uh to the room, which is, you know, if you not if if you at home haven't been to my house, it's his room and then the bathroom. And Jen's in the bathroom brushing her teeth with I'm not having this face. And I look in there and",
            "start": 1252.88
        },
        {
            "text": "know, if you not if if you at home haven't been to my house, it's his room and then the bathroom. And Jen's in the bathroom brushing her teeth with I'm not having this face. And I look in there and Ben's all alone. I'm like, \"What's going on?\" or whatever. And Ben's like, \"Nothing.\" And I'm like, \"What's going on?\" And finally he he told his mother back to back, \"I don't love you. I don't like you.\" And then he doubled down when he was asked about Oh my god. That kid has no idea what that was. But he's doing the thing with his little G. You know, I I remember doing stupid [ __ ] like this, too, when you're a kid. You know, I I stuck my mom my my tongue out at my mom once when she was already not happy. That did not go well with big old Jamie Kennedy. Don't worry about that. So, like I went in there, you know what I mean? I shut the door and I'm trying he's I'm trying to explain like I'm doing stern dad voice now, which I don't do often, right? But I'm working on it. And it's just",
            "start": 1303.12
        },
        {
            "text": "went in there, you know what I mean? I shut the door and I'm trying he's I'm trying to explain like I'm doing stern dad voice now, which I don't do often, right? But I'm working on it. And it's just like, you know, you can't do that. you got to do this blah blah. We're back and forth, back and forth, and he's just not grasping it. He's just not grasping it. And then he's like, \"Well, read a book.\" And I'm like, \"We're not reading any books now. You, you know what I mean?\" And then he's like, \"No, read.\" And then he starts crying and this that and the other. And he goes halfass apology to mom. That doesn't count. He comes back and he's sitting there and f and then my favorite part was in one of his when it was he realiz when he realized how much trouble he was in just goes, \"Why did it go from being a good day to a bad day?\" And I'm like, \"You did?\" And I'm like, \"Literally, you did this. You did this all to yourself. It was great. I had a good day. No, it's a bad day. I'm like, I'm",
            "start": 1342.0
        },
        {
            "text": "from being a good day to a bad day?\" And I'm like, \"You did?\" And I'm like, \"Literally, you did this. You did this all to yourself. It was great. I had a good day. No, it's a bad day. I'm like, I'm sorry, man. You What happened to being cold? How cold is the beach now? Next time, put a sweater on. Everybody, this is the kind of funny podcast. Each and every week, four, sometimes five best friends gather around this table. Come to talk about whatever it is going on in their life and shame you for drinking root beer. If you like that, pick up a Kind of funny membership. $10 a month gets you all of our shows ad free. The ability of course to see me each and every weekday from my car and a 15 to 20 minute podcast we call Greg Way. And of course you'd get good karma for supporting an 11 person small business. You'd get 80 episodes ad free. You'd get more than four hours of exclusive podcast from me and you could say hey I did something good mom. Why won't you hug me now? Of course you got",
            "start": 1376.96
        },
        {
            "text": "small business. You'd get 80 episodes ad free. You'd get more than four hours of exclusive podcast from me and you could say hey I did something good mom. Why won't you hug me now? Of course you got no bucks toss away. No big deal. YouTube.com kind of funny games podcast. It's all like I don't love you and I don't like you. It's like so cold. So cold and mean. You know what I mean? And you can imagine I don't like you that really cuts and he you know this is a cut only you can join me on. He has when he when he does that when he said when he does it and he does a little grin he's doing the little fat kid from League of Their Own. Remember when he was like he's like kind of doing that kind of face. We're going to get it out of him. Don't worry. He'll he'll learn quickly. What the hell was that kid's name? Sawyer baby or something like that. Something like that. Soy. Yeah, it might have been Sawyer. It was something else. Something baby. Cuz remember at the end when they show him it's",
            "start": 1415.28
        },
        {
            "text": "that kid's name? Sawyer baby or something like that. Something like that. Soy. Yeah, it might have been Sawyer. It was something else. Something baby. Cuz remember at the end when they show him it's the big guy from Big Yeah. She goes, \"Oh my god, it's so and so.\" And then you go, \"Is that Gina Davis or is that not Gina Davis?\" Gina totally different name. No, it's not. No, it was Gina. Everybody else was different. Gina Davis was aged up. Is that what it was? They put a bunch of stuff on her. League of Their Owner review when you get on it. Uh yeah. Yeah. Anyways, get the the thing on patreon.com/kindfunn youtube.com/kindfunny games. Apple on Spotify. Get your membership. Uh like, subscribe, share if you don't want to. Uh housekeeping. Stillwell Angel. Stillwell Angel. Crush it. That was close. Uh we're throwing a Switch 2 launch party this Wednesday. We're going to through Thursday morning. Tune in as we pick up, unbox, and play our Nintendo Switch 2Os for the very first time. I'm",
            "start": 1461.76
        },
        {
            "text": "close. Uh we're throwing a Switch 2 launch party this Wednesday. We're going to through Thursday morning. Tune in as we pick up, unbox, and play our Nintendo Switch 2Os for the very first time. I'm very excited about this. Oh yeah. We talked a lot about how we haven't launched a console traditionally is kind of funny. And so to we're, you know, this big old team now. I mean, we were here for the Switch one, but it was a different company at that point. Whereas now in the pandemic, obviously, so to be able to do this where Roger and Mike will be live all night long until we come back to do games daily. Obviously, when we come at 9:00 with the systems, it'll be a whole bunch of us. But it's going to be a really fun party. It's going to be awesome, man. I can't freak. Are you going to come, Nick? I'll probably drop you. It's Wednesday or Wednesday night? Yeah, Wednesday through Thursday night. Yeah, I'd like to. Uh Roger told me that I could play Cyberpunk on a Switch, too. So, I can",
            "start": 1501.68
        },
        {
            "text": "Nick? I'll probably drop you. It's Wednesday or Wednesday night? Yeah, Wednesday through Thursday night. Yeah, I'd like to. Uh Roger told me that I could play Cyberpunk on a Switch, too. So, I can just put my save over onto that. So, I'll probably Yeah, I'm sure that's exactly how it'll go. It's probably going to be pretty easy and not hard at all. Is it? Is it cross save? That's what Roger said. Oh, then we'll be. It'll be fun. Oh, you're right. It is. Yeah. [ __ ] him. Yeah. Uh, of course, after this, you've been getting a bunch of live shows. You'll still get more. Uh, if you're watching live, we'll be streaming some Elden Ring Night Rain. Of course, the day kicked off with kind of funny games daily running you through the nerdy news you need to know about. Then it was the games cast with our final SGF predictions. Uh if you're a kind of funny member, Snowbike Mike goes big with this month's Patreon exclusive poster made by the incredible Panda Musk. You can shred the narnnar on",
            "start": 1538.56
        },
        {
            "text": "with our final SGF predictions. Uh if you're a kind of funny member, Snowbike Mike goes big with this month's Patreon exclusive poster made by the incredible Panda Musk. You can shred the narnnar on Patreon before the month ends. Go to kind of funny.com/premium where you of course can sign up for the premium tier and get all the different posters we've uh made and done. And Panamus is doing a bunch for the 10th anniversary. Doing all of them this year. Yeah. Uh and then of course uh Greg today is my 20-minute review so far of Fantasy Life. I the girl who steals time. Laugh at it now, too. I'm gonna continue to laugh at it. I've heard good things about fantasy life. Hell yeah. You taste I thank you. Doesn't have some skate boring steals. Yeah, long name. It is. Is this made for 11year-olds? Made for Craig. Blues Clues, bro. I watch it, too. It's touching, man. Whatever you used to watch, Louie. Blues Clues is totally different. Uh, thank you to our Patreon producers, James Hastings,",
            "start": 1570.24
        },
        {
            "text": "Made for Craig. Blues Clues, bro. I watch it, too. It's touching, man. Whatever you used to watch, Louie. Blues Clues is totally different. Uh, thank you to our Patreon producers, James Hastings, Carl Jacobs, and Omega Buster. Today, we're brought to you by XR Real. And hey, since you're not using your membership benefits, let's check in with them right now. This episode's brought to you by XRE. Y'all know that a few months ago, my life changed forever when I brought a pair of XRE1 AR glasses on a long flight to New York. I legit could not believe how easy it is to use and high quality my experience was playing games, watching movies, TV shows on the plane without just too much extra stuff around me or especially not a giant goofy headset around my head. No joke, this is my favorite new tech product in years and it has earned a permanent spot in my travel bag. It is only hard to believe that it works as well as I'm saying until you try XR1 AR glasses for yourself and then you will see",
            "start": 1613.88
        },
        {
            "text": "product in years and it has earned a permanent spot in my travel bag. It is only hard to believe that it works as well as I'm saying until you try XR1 AR glasses for yourself and then you will see that the future is now. The tech is here. Connect XReal 1 glasses to wherever you are playing. Whether it's a handheld console, a PC, phone, home console. You just get a massive 150in virtual screen anywhere, anytime for any game. Gaming on the go like a long haul flight? You need the XR 1. Neck starting to hurt from staring down at your handheld? We've all been there. You need an XR1. A screen as big as your wall. Instant plugandplay with all of your devices via USBC. Built-in audio with sound by Bose anchoring your screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full HD. These are what make XR1 a musthave. And we hear XR1 Pro is coming soon with an even bigger virtual screen. Hit our link below to get your XRE glasses today. There's nothing better than when a",
            "start": 1662.48
        },
        {
            "text": "HD. These are what make XR1 a musthave. And we hear XR1 Pro is coming soon with an even bigger virtual screen. Hit our link below to get your XRE glasses today. There's nothing better than when a sponsor of Kind of Funny is something that we are legitimately obsessed with, and that is exactly the case here with XRE. You're going to hear me talking about these forever. Go to xreal.com for more. While we were in Adbreak, we're having a conversation about bubblegum. Bubblegum ice cream. The edibility of the bubble gum ice cream. And we looked it up and it turns out ice cream. Bubblegum. You're allowed to eat it. Whatever. So, my question to y'all real quick. That's Can you eat bubble gum? Yeah, you can. This is in blowing my mind. You're not It's not toxic. Yeah. No, but you should. The stomach thing is like not Why would they call it the same thing as gum then? Like they don't recommend that you eat bubble gum though. It's not. It's for chewing and spitting out. Hold on. Bubble gum and",
            "start": 1710.8
        },
        {
            "text": "thing is like not Why would they call it the same thing as gum then? Like they don't recommend that you eat bubble gum though. It's not. It's for chewing and spitting out. Hold on. Bubble gum and gum are the same thing. You can eat small amounts of gum and you're fine. You shouldn't. Okay, but then the bubble gum in an ice cream you are just allowed to eat. I think it's a different Yeah, it's not the same. It's designed to be eaten. I don't think so. I think it's just normal gum. I think it's just normal gum. Because again, what I read you there was yes, you can and often do chew and swallow the gum in bubble gum ice cream. But as it goes on, it's not saying it's a special kind of gum. It's just like, well, chewing gum is designed for chewing and not swallowing. It's generally considered safe to swallow small. That's [ __ ] wild. So, I don't think I don't think it's a specific special thing. I think it's just whatever. That seems so like such a bad idea to be like, \"All right, kids,",
            "start": 1759.28
        },
        {
            "text": "safe to swallow small. That's [ __ ] wild. So, I don't think I don't think it's a specific special thing. I think it's just whatever. That seems so like such a bad idea to be like, \"All right, kids, you're not supposed to eat gum unless you do and then it's okay.\" That's crazy. I mean, but that's not the case. Like Ben didn't eat the bubble gum ice cream gum, right? He spit out. Yeah. No, I didn't even know what it was. I just put it on the plate. I like small amounts of gum. Were you going to keep going, Kevin, or no? No. Okay, I think we got it right. I guess so. I I I literally You guys know this. I have a problem. If I chew gum, I have to swallow it. No, I didn't know that about you. Wait, I'm sorry. Just to be clear, I had never heard that before. I have literally never heard you talk about generally speaking if I there'll be moments where I go I'll start chewing it and it'll taste so good and I'll go don't swallow this and I'll swallow it. I didn't I probably have a solid right",
            "start": 1795.52
        },
        {
            "text": "about generally speaking if I there'll be moments where I go I'll start chewing it and it'll taste so good and I'll go don't swallow this and I'll swallow it. I didn't I probably have a solid right now quarter pound of gum in my stomach. See that was the thing when we were growing up, right? It was like Kevin just brought that up. It was the urban myth that stays in your stomach for seven years or whatever. No, your stomach acid can burn through anything. So, how much gum are you swallowing a quarter? Enough to clear me out, you know. Let's see. Kev's got a pulled up. My six-year-old accidentally swallowed a wad of chewing gum. Should I be concerned? Although chewing gum is designed to be chewed and not swallowed, it generally isn't harmful if swallowed. Folklore suggests that swallowed gum sits in your stomach for seven years before it can be uh digested. But this isn't true. Can you scroll down one sec? Let me read this next paragraph just for anecdote. It is true that your body",
            "start": 1841.44
        },
        {
            "text": "gum sits in your stomach for seven years before it can be uh digested. But this isn't true. Can you scroll down one sec? Let me read this next paragraph just for anecdote. It is true that your body can't digest you in gum, but if you swallow it, the gum doesn't stay in your stomach. It moves relatively intact really through your digestive system and passes out of your body or sto Okay. So your stomach acids don't break the gum down. So if you ate enough gum, you would basically just poop out a stick of gum. Yeah. And this is the Mayo Clinic, so I think they know what they're talking about. Yeah. But unless you unless you uh RFK, then they don't whatever. Uh Kevin. Yeah. To clear our pallet, I sent to assets a photo of men. Could we put that up? Uh yeah, one second. Thank you very much. Of course, you meant to talk about Blueie, but instead you talked about blues clues. And Ben's not huge into Blues Clues, but he is enough of a fan that when we were up in Montreal, he flashed the guy",
            "start": 1879.12
        },
        {
            "text": "course, you meant to talk about Blueie, but instead you talked about blues clues. And Ben's not huge into Blues Clues, but he is enough of a fan that when we were up in Montreal, he flashed the guy over. I don't know why he did this. I don't have an answer. He is a young boy. But it was it it's one of those like That's weird. Why would he randomly take his shirt off at inopportune moments to embarrass everyone around him? I don't imagine where he learned that from. I can't fathom what that must be in his bloodline. Jen, man, she's a wild one. And then I also sent you a link to the Superman uh Kaiju battle commercial for the toy. Have you seen this? This is his thing from now on. Are we worried about this toy taking us down? Are we worried about it? It's not a Mr. Bubble. This is actually on TV. So they for the Superman Kaiju battle, they did like a classic toy commercial for it. Like it's the new toy. This is what me and Ben were playing with. But it's like Yeah. Man movie. Watch out.",
            "start": 1919.36
        },
        {
            "text": "TV. So they for the Superman Kaiju battle, they did like a classic toy commercial for it. Like it's the new toy. This is what me and Ben were playing with. But it's like Yeah. Man movie. Watch out. A giant kaiju monster is destroying the city. I love this voice for Superman. He flies in with a powerful punch. Why is this 480 match slime explosion? How does How do you put the slime back in? The Kaiju is reloading for a bigger battle. Call in the Justice. Get him, Green Lantern. Terrific teams up. This First off, all these clothes look amazing. Yeah, they're really And I want them all. Did you buy them already? Uh, currently I have not been able to find Hawk Girl or Metamorpho. Uh, I have uh had uh the campfire designs uh found me Hawk. No, he found me the engineer uh and he's going to send that to me. So, I'm tracking those down. Everything else I found on my own. That's really cool. Y'all know Isabella Merced's out here making music. No, I brought this up a couple days ago and I want",
            "start": 1965.2
        },
        {
            "text": "that to me. So, I'm tracking those down. Everything else I found on my own. That's really cool. Y'all know Isabella Merced's out here making music. No, I brought this up a couple days ago and I want her to She can make whatever she wants. I support that. Um Dina from The Last of Us. She's Hot Girl and this one. What What was the other thing we know her from? Dora the Explorer Alien Romulus. and Alien Romulus. Um, but yeah, I like I just randomly was suggested a video and it looked like her and I'm like, \"Wait, she sings and I watch her. I'm like, \"Oh my god, she's like pop star status.\" Oh, good for her. Yeah. I mean, yeah. Yeah, I'll give it to her. That doesn't mean much, but like, you know, she's not like top tier pop star, but like she looks like a classic network TV pop star. A little higher. It looks like she could have skipped that baby step. Maybe she had that baby step, but I just don't know. But like she's straight into the like, oh, you're you're doing this for reals for",
            "start": 2014.88
        },
        {
            "text": "higher. It looks like she could have skipped that baby step. Maybe she had that baby step, but I just don't know. But like she's straight into the like, oh, you're you're doing this for reals for reals. like, you know, good for her. You always got to you it's always a thin line, right? A a dangerous proposition because like there's been so many stars that try to dip the toe into music and they just get laughed right out of there. Olivia Rodrigo, Sabrina Carpenter, let's go back though, Joe. Miley Cyrus. All right. Hillary Duff was Lizzie McGuire, right? And then infamously gave us nothing. will always be Liz McGuire. Girl, there was nothing was dual Lia though, wasn't it? Well, I know. But then like it all sourced from the Exactly. her doing the dance and it's like, \"All right, cool.\" But like it's crazy to think back at like And again, I'm not talking [ __ ] about my girl. Love her. Love her music. We love Hillary Duff. We're still in the Duff. We're still in the duff. We love",
            "start": 2055.76
        },
        {
            "text": "But like it's crazy to think back at like And again, I'm not talking [ __ ] about my girl. Love her. Love her music. We love Hillary Duff. We're still in the Duff. We're still in the duff. We love Hillary. I just like I love that they were so confident in Hillary Duff as a performer and singer. Like the entire movie was like, \"Okay, but what if she also had a twin that was actually a real performer? This is a wild plot, Joey, for Hillary Duff who's voiced by her sister.\" Like in Exactly. Insane that they're just like that. That is how confident they were, but also they were like, \"But we know that this isn't actually going to work this way.\" But then again, voice of a generation. Clear. She the theme song to Laguna Beach. What dreams are made of, man. Yeah. Nick is just looking at us like, \"What?\" No. No. I swear I I like Hillary Duff. I never I don't really have a touchstone for Hillary Duff and she's just always been adult Hillary Duff to me. Always. She She will always be middle",
            "start": 2101.52
        },
        {
            "text": "\"What?\" No. No. I swear I I like Hillary Duff. I never I don't really have a touchstone for Hillary Duff and she's just always been adult Hillary Duff to me. Always. She She will always be middle school Hillary. Really? No, I just remember like I just remember seeing Hillary Duff like growing up and she was like, you know, doing the child actor thing and then one way at some point she got married like the hockey player guy and then I was like, \"Oh, she's an adult now.\" And now she's like all jacked. Is she? Yeah. Oh, yeah. What? Oh, yeah. She's [ __ ] Buff Duff. Buff Duff is like prime Hillary Duff. Buff Duff, dude. That's Kevin, let me see. Buff Duff, please. Be very careful though. While you do that, while you do that, there's a super chat from Benny B. Good says, \"Canadian A&W is better. Canadian Taco Bell is not.\" Do you remember? I'm going to take I need you to do some real on the boots or on the ground. Thank you. Yeah. Journalism for us next time we go to Canada. I will. And",
            "start": 2142.72
        },
        {
            "text": "Canadian Taco Bell is not.\" Do you remember? I'm going to take I need you to do some real on the boots or on the ground. Thank you. Yeah. Journalism for us next time we go to Canada. I will. And when I was talking, I told Jen in the car, hold on, I'll get there. A&W Canadian A&W is better. Canadian Taco Bell is not Oh, I thought he said Canadian Taco Bell is better than than American. I see you were activated. I knew you. Oh my god. I was about to I told Jen in the car on Sunday on the drive. I was like, \"Hey, we're about You'll see that this is going to become a [ __ ] She's got a booty. I'm going to go after this A&W business. Look at the gun though. Yeah, she got Look at that shoulder. She's got She started doing some She started doing a Hillary Duff Renaissance. She They robbed it of us. Robbed us of it. It's true. You're supposed to get it, man. Adult Lizzie Magcguire. And then they canceled it cuz they didn't want her to [ __ ] I hate that. Isn't that insane? Wait, they didn't",
            "start": 2182.48
        },
        {
            "text": "us. Robbed us of it. It's true. You're supposed to get it, man. Adult Lizzie Magcguire. And then they canceled it cuz they didn't want her to [ __ ] I hate that. Isn't that insane? Wait, they didn't want any [ __ ] Lizzie McGuire to [ __ ] Yeah, it was going to be like the a follow-up franchise of her like as an adult and it was going to be like they're like, \"Yo, we're handling this real.\" This is like when Disney Plus first launched. It was one of the first shows. Cocaine addiction. They announced co Kenobi. Lizzie McGuire is coming back. We got Kenobi. Oh, that's a bummer. They'll they'll get around to it though. No, I don't think so. Okay. They went through some real bad like like the creator was like, \"Fuck you.\" Oh, really? It was like I Because it was like inactive production, right? I don't think they I think they shot like a teensy bit of it. They did. Yeah. Sad. No, we'll never get it. Not what dreams are made of. Anyways, Jen pointed out that the she was like I was making",
            "start": 2224.16
        },
        {
            "text": "I don't think they I think they shot like a teensy bit of it. They did. Yeah. Sad. No, we'll never get it. Not what dreams are made of. Anyways, Jen pointed out that the she was like I was making fun of A&W and she was like with the bear. What the No, what are you talking No, there's no bear. She's like, wasn't his name Barry or some [ __ ] like this? Like no. It turns out the Canadian A&W has a Why do they always have that? A bear root bear. Is he everybody's You're not wrong. I think that was his [ __ ] name. The great root bear. Bear. Okay, I just turned a 180 on that. That's a great mascot. I was going to talk so much [ __ ] to root bear, but that [ __ ] right. I wish we had root bear. Yeah, dude. How come we don't have root [ __ ] bear? Cuz that's just [ __ ] Yogi in a different colored sweater, man. How dare you about us? No matter. But I don't trust him, you know. Shout out to Boo Boo. Hey Boo Boo, let's do some picking egg baskets. I knew them well. You ever see Meet the",
            "start": 2262.32
        },
        {
            "text": "colored sweater, man. How dare you about us? No matter. But I don't trust him, you know. Shout out to Boo Boo. Hey Boo Boo, let's do some picking egg baskets. I knew them well. You ever see Meet the Beatles? No. It was a Paul Walker classic. I loved it growing up. John William Scott. Is that who else it was? Uh you know what? I think you're right. I You are in fact correct, Joey. Yes, it is the two of them. There's a bunch of prairie dogs. They call them Pa Dogs. Pety the Pa Dog. Uh Yogi and Boo Boo make a cameo as real bears. Hell yeah, they do. Can we give a shout out to Sean William Scott for basically carrying 2000 like the the late 90s to early 2000 on his [ __ ] shoulders? Not Shawn Williams. In fact, let's give a shout out to Let's give a shout out to Bre Myers then. the other the other Sean Williams guy. Let us go rogue on in review cuz I want you to let us pick like everybody gets weird things and I want to make everybody watch Rat Race again because it is still crazy any day",
            "start": 2307.84
        },
        {
            "text": "Sean Williams guy. Let us go rogue on in review cuz I want you to let us pick like everybody gets weird things and I want to make everybody watch Rat Race again because it is still crazy any day of the week. I love that. If you watch Rat Race, we have to watch the Cannonball Run. I love the Cannonball Run. I've said this a million times, but Rat Race ends with all of them crowd surfing while Smashmouth plays Allstar. That's the sole reason that I wanted to reach out to them for prom and I I can't believe it happened. It's like we created the end of rat race. That was a weird moment in our lives. It's definitely weird. It's also cuz the Baja men were very expensive. The Ba There were too many Baja men. There's so many Baja men. I don't. You know how many Baja men? Bahamas. Nine. Which one's the Bahamas? It's 11. Who let the dogs out? And a couple other songs. Why did I always Cypress Hills? I do not know. I do not know. No. What a different vibe that would have had. a different Cypress",
            "start": 2356.32
        },
        {
            "text": "the Bahamas? It's 11. Who let the dogs out? And a couple other songs. Why did I always Cypress Hills? I do not know. I do not know. No. What a different vibe that would have had. a different Cypress Hill closes out kind of funny prom. Oh my god, I'd love that. You tear the [ __ ] place apart. I was listening to on the weekend I was driving around with D. She had to do some returns of the Nordstrom and uh I put on a '9s playlist, which is funny cuz I I love I I've been with my wife for a long time. We've been together almost 20 years at this point. Wow. Yeah. It's crazy. Married for a lot of that, but you know, we met each other. Thank you. Christ. And it's it's so weird to be driving around with someone you've spent a majority of your adult life with for all intents and purposes. And then you turn on she was like, \"You want to listen to some '9s?\" I was like, \"Yeah, listen.\" And that was when we both of us were in high school. So we're listening to this playlist on Spotify and I just",
            "start": 2396.56
        },
        {
            "text": "you turn on she was like, \"You want to listen to some '9s?\" I was like, \"Yeah, listen.\" And that was when we both of us were in high school. So we're listening to this playlist on Spotify and I just I turned her I was like, \"I kind of feel like I'm driving my high school girlfriend around right now.\" That's cute. And she's like, \"I know. I like that a And then and then Rage Against the Machine came on and I was like because my last touchstone for them was I bought those tickets for my brother and for Stu and I was going to take my my two best friends from high school which my brother and Stu and I was like I got you guys rage tickets. We're going to go and that's when the [ __ ] pandemic hit and I got like a million times million times. Then like two or three years later I finally got that money. They were just like we're not doing it anymore. So, it was bittersweet. But it was so funny to hear her D just singing to songs that were like her jam in high school and I'm like, \"Yeah,",
            "start": 2443.28
        },
        {
            "text": "that money. They were just like we're not doing it anymore. So, it was bittersweet. But it was so funny to hear her D just singing to songs that were like her jam in high school and I'm like, \"Yeah, [ __ ] yeah, dude. This is I love that.\" What vertical of '90s music were you covering? Cuz there's a lot of different 90s al rock. Okay. So, every like we don't get me wrong, ' 90s hip-hop, '90s R&B, that is always covered. And we always get on the subject of how Danielle went and saw uh Janet Jackson live in concert and she was like, \"It was the greatest experience of my life.\" followed up with Prince in concert, which is also the greatest experience of life. And she was like, \"Did you go any concert?\" So I was like, \"No, I was lame.\" Uh, but no, this specifically, I was just in the mood. I was like, I want to listen to like Sound Garden, The Verve. Sort of like that alt but really contemporary 90s. Yeah. Kind of feel the 94 to 98 music that I grew up with. A little Nirvana mixed in",
            "start": 2479.68
        },
        {
            "text": "I was like, I want to listen to like Sound Garden, The Verve. Sort of like that alt but really contemporary 90s. Yeah. Kind of feel the 94 to 98 music that I grew up with. A little Nirvana mixed in there, but for the most part like Puidas, stuff like that. This weekend, uh, G and I also drove around a lot and we were listening to a lot of music and, uh, I How many ice cream Sundays did you? Uh, no ice cream Sundays. We did end up at Fenton's ice cream. Oh. Uh, which is like from Up the Movie. Oh, okay. Sure. Um, but they it was too busy, so we couldn't get any. Um, so no ice cream for us. Uh, they have good hot dogs, too, you know. Shout out to the dogs. Um, but we we put on the This is Dual Lia playlist on Spotify. So, just playing all of her songs and the entire weekend we just put it on and then just didn't think about it. So, it just played every Dual Lia song in existence. So, I think we listened to probably like four or five hours uh total of Duual Lia music. No repeat songs.",
            "start": 2516.96
        },
        {
            "text": "on and then just didn't think about it. So, it just played every Dual Lia song in existence. So, I think we listened to probably like four or five hours uh total of Duual Lia music. No repeat songs. And yet, it sounded like the exact same song was playing the entire time. And I'm not complaining about that at all. I love Duual Lia. I love Dual Lia to an extent that you guys shouldn't appreciate or care about. Give me Give me I know the name for sure, but I don't know. I She did the Barbie song, like the song from the Barbie movie, Dance the Night. I get I I don't pay attention to a lot of anything. Mhm. Contemporary music being one of those things. I I couldn't pick Duual Lia or Charlie XEX. Like, I don't know which which song is which. They always They always They sound radically different. They sound different. Okay. She's British. Charlie, aren't they all British? Isn't I don't know anything about dual. I just told you I know the name. Did you not listen? She makes [ __ ] bangers",
            "start": 2566.48
        },
        {
            "text": "They sound different. Okay. She's British. Charlie, aren't they all British? Isn't I don't know anything about dual. I just told you I know the name. Did you not listen? She makes [ __ ] bangers though. Only makes but they just all sound exactly the same. She makes good 90s dance music. That's fair. '90s pop dance. Just one move. Craig. Oh yeah. Mhm. Oh yeah. But has G ever grabbed the back of your neck? Ever do it tonight? Not in a weird sex way either. Just like just you know. I like to think that Gia kind of like yodas him every once in a while. Wouldn't you? I don't. Yeah. Cuz the other day G and I and and Tim Gia came to a movie that we were at. Yeah. And I'm always struck by like the the size difference between her and Tim. Went on a double date. They gave her a booster chair. That's adorable. And she's just she's just this like she's just like she just floats. And then every time I say anything I'm like I wish I hadn't said that in front of you. Not cuz it's a bad thing. I just",
            "start": 2609.92
        },
        {
            "text": "adorable. And she's just she's just this like she's just like she just floats. And then every time I say anything I'm like I wish I hadn't said that in front of you. Not cuz it's a bad thing. I just think I'm stupid. I'm just talking like to be with Gia. I don't want to say that anymore. She's too smart. Damn it. Imagine having to live with that 247 like Tim. Well, Andy was there, so it really benefit. Sure, sure. Sure. 100%. That makes sense. Andy, Andy. Yeah, it was great. Uh, Greg, I don't know if you already heard this. I don't remember where uh Andy recalled the story that he told. Actually, it must have been review, so you weren't on it. Um, but G walked in like five minutes late to the movie uh to come sit next to me while we were watching Karate Kid. And Andy like leans over Nick and to me and goes like, \"Who who's that?\" mocking Nick for what he had done earlier in the day doing the podcast and uh we had guests pop in your demo popped in. Yeah. Um and uh it was just it was",
            "start": 2652.4
        },
        {
            "text": "and to me and goes like, \"Who who's that?\" mocking Nick for what he had done earlier in the day doing the podcast and uh we had guests pop in your demo popped in. Yeah. Um and uh it was just it was great because I don't think Nick realized in in the moment that that's what cuz he he just rep Oh, it's Chia. Did you catch it? Oh, I caught it. Okay, good. I catch that. That was funny. Yeah, that was that was fun. That that whole experience I wish there was cameras and audio recording us during that entire film when we went and saw The Karate Kid. Sure. Because there was so I heard something about this. I was out there listening in when I was doing what? You had some bad audience experience. Everyone in the audience was misbehaving, including us. Okay. They were He and Andy were so giggly. Well, because the movie is outlandish in the best possible way. Yeah. There's things that happened in this film that you cannot help but giggle at. Okay. But then we also had two dudes to the left of",
            "start": 2693.84
        },
        {
            "text": "Well, because the movie is outlandish in the best possible way. Yeah. There's things that happened in this film that you cannot help but giggle at. Okay. But then we also had two dudes to the left of us. One of whom was a you could tell was a diehard Copra Kai fan and the other was I've never seen a movie before. just first experience as a as a human straight up just came from from from planet Zandu and just walked in and was like I don't understand what's happening the guy was like that's the bad guy from the and just talking like that but we were all just but there was no whisper to his voice it was like one of the more bizarre experiences I've ever heard where he was talking without whisper but it also wasn't like he was just using his normal talking voice like he was trying to be aware of not being loud but he was so loud like do you get what I'm saying like he was having full on conversations that I feel like everyone in the entire theater would be able to hear every word of what",
            "start": 2734.16
        },
        {
            "text": "of not being loud but he was so loud like do you get what I'm saying like he was having full on conversations that I feel like everyone in the entire theater would be able to hear every word of what he was saying. It wasn't like so crazy cuz I was on the other end didn't hear any of it. That's nuts. Um I except for the lady that was shushing everybody. Yeah. Well, that was a shusher because this is this is so me and by proxy all you guys cuz you're my friends and you choose to do experiences like this with me. I'm giggling with Andy and we're talking a little bit to the point where I'm like I should probably not be talking this loudly, right? And then someone behind us up in the top row was talking and I'm like, \"God, that's annoying. I wish someone would shush that person.\" And then I kept talking to Andy and then the guy talked again and the lady shushed him and I was like, \"That's what you get.\" And then I just kept talking to Andy. Yeah. And in my brain, I'm like, I don't I",
            "start": 2777.12
        },
        {
            "text": "I kept talking to Andy and then the guy talked again and the lady shushed him and I was like, \"That's what you get.\" And then I just kept talking to Andy. Yeah. And in my brain, I'm like, I don't I probably should shut the [ __ ] up, too. I'm here. I'm just like, Nick just loves to talk. Nick just loves to talk. And like what I don't even fully blame him because turn the [ __ ] lights off when we're watching the trailers. There has to be the delineation between here's the commercial preview going and now we're in sacred times where it's if you're gonna make a comment or reference, use your your quiet hush voice. You know, we're not just [ __ ] here making jokes and [ __ ] but no, Nick loves to make the jokes and I get it. I'm here for the jokes, but hearing other groups start to talk, I'm like, it's not just us, you know? It was it was it was definitely there was a a consensus in the theater that we were going to be a little rowdier than normal. And then the lady shushed everyone and",
            "start": 2817.6
        },
        {
            "text": "like, it's not just us, you know? It was it was it was definitely there was a a consensus in the theater that we were going to be a little rowdier than normal. And then the lady shushed everyone and I was like, \"All right, we should probably shut the [ __ ] up.\" What I don't like though is I think that that shush lady thought that we were with the the guys that were talking too much. We weren't I don't think she was shushing those guys. You guys better not [ __ ] I don't want to stop getting invited to premieres on the the precipice of Superman. This was at 4:30 showing your own idiots. Then you're fine. I was told many times, don't don't misbehave at the at the at the press screenings. Not that I ever have, but I never would. Just be clear that wasn't a press screener. Some people misbehaved during press screener and then we had to tell you guys that now. Who's that? I'm not going to name names, but you were involved. That was Mike cuz he was changing seats. But also, you you you",
            "start": 2854.32
        },
        {
            "text": "during press screener and then we had to tell you guys that now. Who's that? I'm not going to name names, but you were involved. That was Mike cuz he was changing seats. But also, you you you were doing something where you kept giving him snacks or something and he got upset and left. I was there for that. That was Flash. It was Flash. And then we had the when we had the whole thing about I Mike said, \"I'll get you M&M's and then they came back with Junior Mint. Nobody wanted them. But Mike wanted the Junior Mints, but Andy thought it was a joke that they were passing it to Andy, so he just started putting it on the floor. Yeah. And then Mike got really upset. Part of that was my fault. We don't need to get into it. But that that was when I asked Mike to get a stuff and Mike just got mad and then Mike just left. Well, children, now that we're here in the movie vein, I want to remind everybody you're very close to Superman. July 11th. Get ready. Yeah, no problem. So, what? You're one",
            "start": 2895.36
        },
        {
            "text": "and then Mike just left. Well, children, now that we're here in the movie vein, I want to remind everybody you're very close to Superman. July 11th. Get ready. Yeah, no problem. So, what? You're one month and nine days. That's math. Uh, the tickets go on sale soon. That's great. And I need you to make it as big a success as you all have made the Tomorrow War. Kevin, I put in assets here. Uh, Tomorrow War did get put into trending. It got it made it to trending on Amazon and I assure you that's because of us. No joke, no cap, no nothing. that no one else is watching the I sure I I throughout since we talked about this on the kind of funny podcast and of course recommitted ourselves to the tomorrow war and told you this is not a bit stop trying to throw it in our faces first off right there four point what you almost got four full stars out of five up there what are you talking about Mhm. Anyways, we talked about it and yes, I've gotten non-stop BS's about people watching the Tomorrow",
            "start": 2938.48
        },
        {
            "text": "four point what you almost got four full stars out of five up there what are you talking about Mhm. Anyways, we talked about it and yes, I've gotten non-stop BS's about people watching the Tomorrow War, enjoying the Tomorrow War, and then yes, we're not doing BS's. We are. I'm not call I'm not I'm not calling them skates. Just I mean [ __ ] BS's bs's cuz I'm I'm loses. Yeah. Can't we just call them tweets? You said no cap. We're going to gloss over that. We're going to [ __ ] gloss over the fact that he said no cap. We just call We're just taking my basis back. Take back the [ __ ] tweet, dude. That's what the majority of people are going to do. This is every day at this point. Why didn't you ask me to touch you more? I'm so hot. I dish all the time. I don't want to ask. It's like when it happens. I'm just saying you did this. Uh, the Tomorrow War is happening. Joey, what is the update on the shirt? I don't have a design. I want white text that says I liked the Tomorrow War. White",
            "start": 2984.8
        },
        {
            "text": "it happens. I'm just saying you did this. Uh, the Tomorrow War is happening. Joey, what is the update on the shirt? I don't have a design. I want white text that says I liked the Tomorrow War. White text on a black shirt. Okay. Andy still has to make that for me, but we'll work on it. This is a a fiery thing. I'm going to say that I I don't mean as a bad thing. This is more just a genuine observation that I have. I don't look at the Superman movie as something that's going to make kids happy. And it's interesting that they're like the commercial, the marketing, the toys, all all that stuff like that. To me, I'm like, \"Yeah, that's the right direction.\" Like get the get get kids liking this Superman. But like there's just something about all right, they're all wearing these like white suits and stuff. It doesn't feel very kid-friendly. Is that a bad read? No, I don't think so at all. Uh, I think, you know, 100% like I'm excited for the toys obviously, but Ben's favorite toy is Superman",
            "start": 3023.52
        },
        {
            "text": "and stuff. It doesn't feel very kid-friendly. Is that a bad read? No, I don't think so at all. Uh, I think, you know, 100% like I'm excited for the toys obviously, but Ben's favorite toy is Superman and the giant kaiju, right? Like he's got Guy Gardner bowl cut. Yeah. Like I when you lay them out too, the toy like the the you saw the pretty much the we've talked about it. You didn't see them all, but yeah, the the main toy line, right, for like full-size figures is Superman obviously Mr. terrific guy, hot girl, metamorpho, um, uh, the engineer. And like when you look at that, you're like, \"Holy [ __ ] what a lame lineup for toys.\" Yeah. You know what I mean? Imagine if it was a Batman film and it was Batman, Joker, the penguin, you know what I mean? Like here are people that are popping off this the engineer as a toy there. You're like, \"Huh?\" I don't know what Batman would also have the always the variants of Batman even though it's not in the film, right? Batman would have the",
            "start": 3064.08
        },
        {
            "text": "off this the engineer as a toy there. You're like, \"Huh?\" I don't know what Batman would also have the always the variants of Batman even though it's not in the film, right? Batman would have the Arctic Batman water. There's multiple Superman, don't worry about it. There's one where he's got blue fists. He's punching so fast and hard. Then there's the one that comes with the kaiju that you swing around and he does automated punch and then you just have a normal figure. Then on top of this, they have I always hated this. Yes, but Yes, but I was I was going to get there. Thanks for beating me to it. Uh they have Crypto. Yeah, they have one that has like a helicopter on his back that you like throw up in the air and he spins kind of thing. Yeah, crypto spins. Yeah. Well, the the thing spins so he like flies. Yeah. Um, then they have, so they have the 12-in figures that I hate. You've seen these for sure and just in general, they look stupid. Then they have the sixinch ones, which is the",
            "start": 3114.32
        },
        {
            "text": "so he like flies. Yeah. Um, then they have, so they have the 12-in figures that I hate. You've seen these for sure and just in general, they look stupid. Then they have the sixinch ones, which is the the ones that I like and I'm I I bought for Ben or whatever. And then they have 3-in little guys. Here's one of my big problems. Target has an exclusive Luther Core Lab one that's, I believe, Metamorphos, Superman, Baby Joey, uh, Krypto, and Lex Luth. This is the only Lex Luthther toy I've seen in the entire [ __ ] run. Like, what are we [ __ ] doing? Why is there not a 6-in Lex Luthor? What are we doing? I mean, at least he's iconic. You look at it go, \"Oh, Lex Luthor.\" Nobody's walking down the al. Oh, [ __ ] Is that the engineer? Kevin, can you bring up Baby Joey again? Thank you. Oh, I have seen this and I hate it. What the hell is that? I don't really understand. The iconic DC character. Oh my. No, no one said that. Well, there's a toy gran character. the iconic Superman movie that",
            "start": 3149.6
        },
        {
            "text": "seen this and I hate it. What the hell is that? I don't really understand. The iconic DC character. Oh my. No, no one said that. Well, there's a toy gran character. the iconic Superman movie that we haven't seen. Car, I'm with you. I'm with you. I'm going to be making a Baby Joey making. Stick with me. It looks like those little aliens from Galaxy Quest that were cute at first, but then ate one of their own. Yeah, I don't remember that. You guys need to make Baby Joey as popular as Lab Boooos. Start putting on your backpack. Maybe they'll start selling knockoff versions at the liquor store. Crypto is about a shot at that. I'm I need however many crypto plushies, action figures, whatever they have, we need triple for you. Yeah, there's not enough of them. Oh, okay. I think that that needs to be the through. I'm running to the bank. I was going to hit up the Target over there to see what they got. So, I'm going to try to find you any crypto stuff. I'll tell you, somebody from the Spin",
            "start": 3198.4
        },
        {
            "text": "to be the through. I'm running to the bank. I was going to hit up the Target over there to see what they got. So, I'm going to try to find you any crypto stuff. I'll tell you, somebody from the Spin Masters made a big mistake here cuz like I connected with them a long time ago. Uh like their head of PR and was like, \"Hey, you know, Ben loves monster trucks and the monster truck stuff great.\" I had hit them up like, \"Hey, I want to buy all these goddamn Superman toys. Can you throw me a [ __ ] bone here? Never got a response. Then today the PR for Spin Masters hit me up was like Superman. I ran through what I need. I'm like, here's what I haven't been able to find. Itemized list that I need. You know what I mean? Help me out person. This Baby Joey situation like I I understand some context. The problem is we don't have it for you. Oh, baby Joey James Gun created thing. the rumor that I don't think what people are saying that you we just all run with is maybe it's Metamorphos's kid",
            "start": 3241.12
        },
        {
            "text": "The problem is we don't have it for you. Oh, baby Joey James Gun created thing. the rumor that I don't think what people are saying that you we just all run with is maybe it's Metamorphos's kid because what would make sense here is as you I know you watch you watch my hourong breakdown of the last Superman trailer where I called out Metamorpho turning his hand into kryptonite to hold Superman there but then turning his body into light to I this would make sense that oh Metamorpho's kid is being held hostage by Luthor and that's how he's getting him to work against Superman or Stag is somewhere or not. You know what I mean? There'd be something going on there. My question is, does Baby Joey hit? Like, are we going to see Baby Joey? And like, I'm not expecting a Grou level of success here, but like I'm hoping for more than Baby Garfield. The fact that they're doing this again, the the McFarland thing, the little toy, like apparently Baby Joey is important enough to the plot and they",
            "start": 3277.76
        },
        {
            "text": "but like I'm hoping for more than Baby Garfield. The fact that they're doing this again, the the McFarland thing, the little toy, like apparently Baby Joey is important enough to the plot and they think enough of it that people would want to buy Baby Joey stuff. Baby Groot worked. And again, I don't I don't know what we're getting. But baby Groot and Baby Garfield and Grou all cute. I wouldn't necessarily call Baby Joey cute, but when Baby Joey saves Lois Lane or something, I don't know. Baby Joey kind of looks like, you know, how in like in like uh medical shows like someone will have a baby and it comes out and it's like perfect, maybe a little stuff on top of it, but that's not what real babies look like when they're born. Real babies look kind of like aliens when they're born. That's what that thing looks like. We'll see. Tim, you make you make a great point of will kids be drawn to this? Like I think here's the the in the plus column, Kaiju Battle going to be cool for a kid to",
            "start": 3320.88
        },
        {
            "text": "what that thing looks like. We'll see. Tim, you make you make a great point of will kids be drawn to this? Like I think here's the the in the plus column, Kaiju Battle going to be cool for a kid to watch, right? Plus column, Superman alone, cool and he lift [ __ ] and heat vision, whatever. Then I believe it's Walmart is selling an exclusive toy that's like it's a Superman playset of him like fighting an abominal snowman kind of thing. So, if we've got like multiple monsters for Superman just to punch. And keep in mind, too, this Kaiju, you know, you punch it under its chin and its chest opens up and blurts out slime. So, you imagine he's Superman's got to [ __ ] the kill this thing, right? [ __ ] kill him. Slime everywhere. And there going to be slime everywhere in Metropolis. Kids like that. Ben, I like I have an ooze. I haven't used Which Metamorpho looks exactly like Zordon. I haven't used ooze slime, whatever you want to call it, in a long time, right? And I was shocked to open",
            "start": 3364.88
        },
        {
            "text": "that. Ben, I like I have an ooze. I haven't used Which Metamorpho looks exactly like Zordon. I haven't used ooze slime, whatever you want to call it, in a long time, right? And I was shocked to open up that packet for Kaiju and find that it smells exactly the same. It still has the same properties that I teach Ben of like we had like little bits. I'm like, \"No, take the big bit and touch it to little bits and then it's Oh, wow.\" I'm like, \"Yeah.\" And then for literally turns out you can eat that too. Yeah. Of course they can't sell toxins. Crazy. Uh but yeah, he sat there for a good hour and a half playing with the kaiju slime, just putting it all over stuff. Yeah. But then to your point, we've all been there. We have now we have two Mr. Terrifics, right? We have a 6 in and a 3-inch Mr. Terrierfic, right? And while we were watching, I put Superman the animated series on the TV and it was the Lobo episode, of course, classic, right? Where you know Lo, the guy the collector pays the",
            "start": 3405.04
        },
        {
            "text": "Terrierfic, right? And while we were watching, I put Superman the animated series on the TV and it was the Lobo episode, of course, classic, right? Where you know Lo, the guy the collector pays the Lobo to come get Superman, but then he also takes Lobo. Awesome. Ben looked up for saw three seconds of Lobo was like, \"Who's that?\" I'm like, \"That's Lobo.\" Then he picked up Mr. Triff. He goes, \"This is Lobo.\" That's how little my son cares about Mr. Terrific right now. He got recast. He has been has been uh frozen an action figure yet. No, we haven't done that. No, he's got color changing cars he loves a lot. That's pretty sick. Now, this is I I This is a very cool Lex Luthor. I agree. This is the McFarland. Like, you know, these are the Porsche of action figures. These aren't the ones you're just buying. There's the Porsche of Baby Joey's. I hate that. This is when you're at Target, you've got the toys Ben has in the kids aisle, and then this is across the section in the, you know, uh",
            "start": 3440.08
        },
        {
            "text": "just buying. There's the Porsche of Baby Joey's. I hate that. This is when you're at Target, you've got the toys Ben has in the kids aisle, and then this is across the section in the, you know, uh books and uh video game aisle for the adult collector. Greg, this guy starts small and gets big. No, I think this is them just being like, \"Man, we can make some money off this guy with cute eyes cuz people are going to love [ __ ] punching this thing.\" Really likes characters with like the the eyes and the sides of the thing with the weasel. Yeah. Look at Metamorpho doing his thing. That's really cool looking. Look kids, you thought the thing you think you thought the thing was cool. Two months. This is all the things Zordon from the 95 movie and this is another one Clark from Secret Invasion. This is one where I was like, man, I got to I I had to stop myself cuz again, Ben, the Superman and Batman superpowers I brought back from Canada are definitely for dad. Ben has shown no real interest",
            "start": 3481.28
        },
        {
            "text": "is one where I was like, man, I got to I I had to stop myself cuz again, Ben, the Superman and Batman superpowers I brought back from Canada are definitely for dad. Ben has shown no real interest in those. Let's see tonight how interested he is in the Superman toys that he we got yesterday. Even though this morning, first thing we did was play more. You know what I mean? He's real big right now on all the quote unquote bad guys getting into the Ecto-1 and they drive away and my Superman has to come in to stop them. So that's cool. Oh, they still Ecto1. Those bastards. Can you give me a picture of uh Metamorpho again? I just the one you were looking at with the big team lineup there. Actually, that's fine, too. How do you feel about the shorts, Nick? Yeah. Oh, I kind of love them. I kind of love them. They're they're they're like Mu Thai shorts. They're definitely MMA training shorts, you know? Is that part of his character? I imagine. Apparently from the movie. Yeah, cuz all the",
            "start": 3522.32
        },
        {
            "text": "of love them. They're they're they're like Mu Thai shorts. They're definitely MMA training shorts, you know? Is that part of his character? I imagine. Apparently from the movie. Yeah, cuz all the action figures are like Here's Metamorpho in his sleep shorts. You know what I mean? Cuz you saw you called it out in the superpowers one, too, right? They look out of place. They're boxing shorts, aren't they? Yeah. Yeah, it's still just it's like backyard wrestling superhero. You know what I mean? Like everybody else has got a cool suit and he's just got shorts. I'm sure they'll make it make sense. You know, going back to the kids Superman conversation. What is the new Superman movie rated? We have Great question. Probably PG-13. Yeah. So then I feel like that may play into the I don't know how many people are going to take their kids to see a PG-13 movie. It's not really geared towards kids. Yeah. I think it's an interesting one. I I Yeah, I don't know. It's especially being here with us",
            "start": 3559.6
        },
        {
            "text": "many people are going to take their kids to see a PG-13 movie. It's not really geared towards kids. Yeah. I think it's an interesting one. I I Yeah, I don't know. It's especially being here with us not having anything. It's PG-13. PG-13, not having seen it. You know what I mean? Like I feel like But it's I felt the same way with um uh I lost it. I was going to say what maybe even Man of Steel. No, Zod. That was cool. Man of Steel was Man of Steel was way less accessible for kids. No, no, but I meant the toys in terms of walking to the toy aisle and be like, I don't know. I just feel like kids are going to like these better because they're colorful. Yeah, of course. They look more fun to play with than the Man of Steel toys. But that's I guess that's my problem is that they're not like break like the the squad Superman. Sure. But like then it's just a bunch of dudes in white outfits. Yeah. You know what I mean? I think Tim, I think that you are not I think you're discounting how much",
            "start": 3603.36
        },
        {
            "text": "like the the squad Superman. Sure. But like then it's just a bunch of dudes in white outfits. Yeah. You know what I mean? I think Tim, I think that you are not I think you're discounting how much kids are into motocross. You are correct. You're correct. They do. It is doing the thing where the 6-in figures all come with a part of robot 4. Yep. So, you buy them all, you assemble the robot. Yeah, Ben's pretty stoked about that. Robot four. I got a torso. We're about to learn so much, Joey. I I do think about the kid the Superman toys. I used to play with the classic toys. Hawkman. Yeah. Green Lantern superpowers. They were so much more fun to look at. Tim's right. Yeah. Yeah. I hear you. We'll see. I don't know. I'm hopeful they'll see the movie and like it, you know, or you know, people like me buy him for some other kids throws. Yeah. We'll get there. Are you going to feel like are you still like Are you giving Ben the choice though? Is he going to get some Fantastic 4? Oh yeah. Oh my",
            "start": 3646.4
        },
        {
            "text": "me buy him for some other kids throws. Yeah. We'll get there. Are you going to feel like are you still like Are you giving Ben the choice though? Is he going to get some Fantastic 4? Oh yeah. Oh my god. Totally. If he I'm not I Here's the thing about Ben. Yeah. Ben is still car obsessed. Like if it's about a car, this kid a monster truck, he is all about it. The action figures like Yes. Yeah. Oh yeah. He's got he's got Fast and Furious cars. The action figures. Yesterday was our first breakthrough where we watched the trailer. I primed the pump, you know what I mean? And then we got him in there and he played all and Jen was like, I can't believe he's still playing with these because it's just not so out of the ordinary. And so to wake up again and play with those. He's had action figures. Lord knows I bought him every Ghostbusters action figure. You know what I mean? But it's the cars that keep going. Not not the Ghostbusters themselves. Even yesterday at one point when we were using",
            "start": 3688.88
        },
        {
            "text": "Lord knows I bought him every Ghostbusters action figure. You know what I mean? But it's the cars that keep going. Not not the Ghostbusters themselves. Even yesterday at one point when we were using the slime, he finally connected it and he was like, \"It's Slime like Slimer.\" And I'm like, \"It is Ben.\" Yeah. And he's like, \"Oh, they need the Ghostbusters help.\" And I was like, \"Yes, you keep your Ghostbusters over there in that big Lego brick.\" And he goes, \"Just the car.\" And he drove the Echo One over. And I was like, \"Okay, well, we're making I'm like, \"Don't forget you have the entire Spangler family in there.\" Phoebe, Trevor, they're all there. Gary Guben. Of course I do. And don't even get me started on the fact that action figure, huh? Gruntilda. What's the name of the bad guy? Garanka. Garuda. Garuda. His name was Garaca. Gara. That was so close. I like that. I know. You don't have one. Thank you very much. Cuz they didn't do it. You want to talk about a toy line done dirty?",
            "start": 3729.52
        },
        {
            "text": "Garuda. Garuda. His name was Garaca. Gara. That was so close. I like that. I know. You don't have one. Thank you very much. Cuz they didn't do it. You want to talk about a toy line done dirty? Okay. When I I remember and this is one of the things I was telling I I think I talked about in the show like I was actually depressed after I went to Target last weekend and they didn't have Superman action figures. We talk about I don't remember. I've been I've been I mean like we're there. We're there. Every feed I follow right is like the How much of your day do you think about the Superman movie? Like percentage wise. You don't want to know, Joe. I really do want to know. The other day we finally had a break. I don't. Maybe Ben was asleep when we were in the car and Jen just goes, \"So, what's on your mind?\" I was like, \"Oh, man. Joey, I know it is. Well, I know that's always on your mind. What else? What else is on your mind?\" Anyways, Gaka, what a horrible question, by the way. What's on",
            "start": 3767.36
        },
        {
            "text": "on your mind?\" I was like, \"Oh, man. Joey, I know it is. Well, I know that's always on your mind. What else? What else is on your mind?\" Anyways, Gaka, what a horrible question, by the way. What's on your mind? Every time that Gia asked me that, it's always just like it is whatever the Superman thing of the moment is. Like, yeah, chances are I'm thinking about the Switch, too, to some extent. The classic meme thing of like, he's probably thinking about another guy. It's like, no, no. Then he asked J. She's got she's anxious about something 3 years from now. I'm like, \"Oh my god, I don't know.\" Anyways, though, Ghostbusters Afterlife. Oh, let me let me epilog it. Sorry. So, yeah, last weekend I was like I trying to find these Superman toys. We I I don't want to I didn't want to order off Amazon. I wanted to walk Ben down the aisle because, you know, we get there and it's usually like you can get a car, you can get a thing, and instead be like, \"Look at all Superman [ __ ] We can get it",
            "start": 3805.52
        },
        {
            "text": "I wanted to walk Ben down the aisle because, you know, we get there and it's usually like you can get a car, you can get a thing, and instead be like, \"Look at all Superman [ __ ] We can get it all.\" You know, like kind of supermarket sweeping kind of thing. Uh, and so like it wasn't there and I was like so bummed about it. And I got in the car and I'm like I need to tell somebody this and I know how stupid it is. Like I know and I'm like it's a heart head thing. I'm just like I it doesn't matter. I don't care. But I was like I am legit. When they weren't there I was legitimately crestf fallen that they weren't there about the Reddit and the Instagram and blah blah blah. And so like uh it was just so heartbreaking to have that and I was like one of my comparisons was do you remember right when we had Ben? Obviously, you all remember cuz you went, but Ghostbusters afterlife had just happened and going down that Target aisle and having all the Ghostbuster mint on card and like Jen has",
            "start": 3844.08
        },
        {
            "text": "when we had Ben? Obviously, you all remember cuz you went, but Ghostbusters afterlife had just happened and going down that Target aisle and having all the Ghostbuster mint on card and like Jen has that photo of me with my arms and I'm like debating what in Ben's in a stroller, right? When Ghostbusters [ __ ] Frozen Empire came around. They just [ __ ] put out the goddamn There's Gaka. Look at him. They just put out the [ __ ] family again and they didn't even carry those in stores. I had to order all I got those from the people. Kevin says, \"What kid wouldn't want to play with the entire Spagler family?\" No, no, it's I said that on purpose because it is such a joke. So funny. It is like you break these people out. You're like, who are all these nameless white people? They just all mixed together. You know what I mean? I could not have named a single one of them for the life of God. Is Finn Wolfhard coming back for the last season of Stranger Things? He must. I'm not a Stranger Things",
            "start": 3880.96
        },
        {
            "text": "You know what I mean? I could not have named a single one of them for the life of God. Is Finn Wolfhard coming back for the last season of Stranger Things? He must. I'm not a Stranger Things person. So Oh, that's right. Another you, Tim. Right. Dang. Kevin, of course, has Ghostbuster news up. That is a great outlet you should be following on Instagram, on wherever you can get your Ghostbusters news. I was looking at all the tadam stuff that came out this weekend and they were talking about Stranger Things and I was like it's crazy that this show started before I lived in San Francisco and I've lived here for like eight years now. Damn, that's true. Oh, that's I still living in Orange County when I tried to watch Cameron says he is he was at the dumb thing. Yeah, nice. He's in the trailer. I have not watched the trailer yet. Chris Anka in my brain I don't watch trailers until Tim tells me I can watch trailers cuz we have to react to them. Very true. And then I forgot Tim's not a",
            "start": 3920.8
        },
        {
            "text": "I have not watched the trailer yet. Chris Anka in my brain I don't watch trailers until Tim tells me I can watch trailers cuz we have to react to them. Very true. And then I forgot Tim's not a Stranger Things guy. Just to end it all too, like you know how we got 28 years later coming up. I've never seen those. Are they good? They're really good. But what Jen was like, I'm in the mood for something spooky. And she was like, what if we rewatch 28 Days Later? And I was like, you never have to ask, but so I don't burn you out. Let me make sure it's not an interview. And then when I looked through the interview schedule and it wasn't on interview, I got so offended. We have a new [ __ ] What the [ __ ] Tim? You know what I mean? Anyways, we watched you guys would want to go to Huh? What's that? I said, \"Is that a screener you?\" Oh, yeah. Yeah, for sure. Me and J, we babysit for that one. Cuz the first one wasn't available for like a long time, right? Is that the whole deal? But now it is.",
            "start": 3960.08
        },
        {
            "text": "I said, \"Is that a screener you?\" Oh, yeah. Yeah, for sure. Me and J, we babysit for that one. Cuz the first one wasn't available for like a long time, right? Is that the whole deal? But now it is. Yeah, you can get them on Amazon. Or if you like me have the DVD, which I did not go dig out. I just bought it again on Amazon. I was like under no circumstance. And I was all stupid. I'm like cuz I'm an idiot. And Jen's like I'm like, \"Oh, I guess I could go get the D.\" She's like, \"We're upstairs. There's no DVD player.\" And and I was like, \"You're right. Plus, it would be shitty quality of the in like the the movie was still garbage like whenever 2000 shot as a independent movie or whatever. It's like crap. Yeah, they shot that. I want to see they shot that on like a digital video camera of some sort that was like proumer. It's [ __ ] great. And obviously it's just Killian Murphy is just so goddamn good in it. So good. Yeah. Just like this episode of the kind of funny podcast was.",
            "start": 3996.0
        },
        {
            "text": "of some sort that was like proumer. It's [ __ ] great. And obviously it's just Killian Murphy is just so goddamn good in it. So good. Yeah. Just like this episode of the kind of funny podcast was. Everybody, we hope you enjoyed it. Of course, if you did, why not pick up the Kind of funny membership? patreon.com/kindfunny, youtube.com/kindfunny games, Apple or Spotify, you could give us $10 and you'd get all of our episodes adree plus the ability to listen to me each and every weekday. Why aren't we doing 28 anything in review? You know what I mean? We were trying to we were actually supposed to um during the pandemic before another one was even part of the whole thing, but there's just too many movies coming out. It's impossible. Okay. I wish it was possible. It said you're doing Ballerina. Yeah, that's John Wick. We have Well, here's pulling the curtain aside. We have to support ballerina because we want John Wick 5. I get that. We absolutely do. I think they're doing it. If you",
            "start": 4029.84
        },
        {
            "text": "Yeah, that's John Wick. We have Well, here's pulling the curtain aside. We have to support ballerina because we want John Wick 5. I get that. We absolutely do. I think they're doing it. If you didn't know, this is kind of funny podcast each and every week. Four, sometimes five best friends together around this table coming to hang out and talk about whatever it is they want to talk about. If you like talking with us, you can hang out with us live. YouTube.com/kindfunnygames. Of course, twitch.tv/kindfunny games and podcast services around the globe. No matter where you get the show, thank you for supporting. Like, subscribe, share, ring the bell, use your Twitch Prime if you got the Amazon Prime. But for now, get ready for some Elden Ring Night Rain. And until next time, no, it's been our pleasure to serve you. [Music]",
            "start": 4072.36
        }
    ]
}