{
    "id": 14275,
    "video_id": "1l80dq9ZzoQ",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller"
    ],
    "title": "Greg's LATEST Superman Trailer Reaction & Breakdown",
    "description": "Go to http://kindafunny.com/XREAL to grab yours now!\n\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1749681271,
    "duration": 2889,
    "transcript_chunks": [
        {
            "text": "[Music] What's up everybody? Welcome to another Greg Miller Superman trailer reaction. Perhaps your last one for 2025 as we hurdle towards James Guns Superman on July 11th, 2025. I'm your one host, Greg Miller. Kind of funny's resident super fanboy as you are all well aware. I am sure I bid you a fair and welcome and healthy day. I hope you're having fun out there. I sure am because of course we are exactly one month from the brand new Superman motion picture starring David Kornsweet of course Rachel Broahan. Uh the one the only Nicholas Holt all by the one the only James Gunn. Uh if you have been following my 18-year journey on the internet you are no stranger to my obsession with the Man of Steel. I have loved Superman my entire life. don't have any recollection of when I found him the first time cuz it's been with me that long. Uh you've probably seen me nerd out talk about uh Superman and casting choices and all sorts of things here on youtube.com/kindfunny games. Maybe uh when I",
            "start": 0.93
        },
        {
            "text": "first time cuz it's been with me that long. Uh you've probably seen me nerd out talk about uh Superman and casting choices and all sorts of things here on youtube.com/kindfunny games. Maybe uh when I was doing the original Gregways on the original channel. Maybe you hear about me at IGN talking about it. Maybe you've been with me since the Columbia Daily Tribune when I reviewed Superman Returns for them. They did a whole multimedia presentation on it too. Lost to the Ages. if you can find it. Good. I'd love to see it again. But they did a whole thing where they sent a photographer with me and I did a VO and there was like it was a whole thing. It was really cool. But yeah, that site's been changed a million times. But good luck looking into it. Uh, as I said, it is Wednesday, Jul. Uh, we are one month away from July 11th when you will see Superman. Of course, tickets are on sale for the motion picture. A final trailer came out. If you're like me and you're an Amazon Prime member, you",
            "start": 57.6
        },
        {
            "text": "are one month away from July 11th when you will see Superman. Of course, tickets are on sale for the motion picture. A final trailer came out. If you're like me and you're an Amazon Prime member, you have Twitch Prime and you should give Kindfunn over on twitch.tv/confunname TV/confunname your free Amazon Prime Twitch Prime subscription that you probably don't even know you have, but you have it and it expires every 30 days. So, you need to give it to somebody. Give it to us. Anyways, if you're an Amazon Prime member like myself, you may have bought tickets like I did to see Superman on July 8th. There's a lot going on as you know, but more importantly, there is a trailer here. This is all very kismmet because of course I had done today's Gregway about, hey, it is one month from Superman's release date. And if you don't know, Gregway is one of your perks if you are a Kind of funny member. Of course, the Kind of funny membership is you giving us $10 a month, getting all of our shows.",
            "start": 96.96
        },
        {
            "text": "release date. And if you don't know, Gregway is one of your perks if you are a Kind of funny member. Of course, the Kind of funny membership is you giving us $10 a month, getting all of our shows. That's more than 20 a week, more than 80 a month ad free, and a daily dose of me, Greg Miller, and a 15 to 20 minute podcast I do each and every weekday, adding up to four hours of exclusive podcasts, all from my car. Uh, today's is about though, Superman, and how we're a month away. And I'm now at that dangerous part where I don't want to know more, but I still need to know more. And I will continue to consume and buy everything. I'm wasting so much money on this motion picture. I of course am currently planning to see it five times. And those are just the planned. I have dates and times in mind versus when I will actually get pulled in to see it again. But beyond that, they keep putting out popcorn buckets. I just shared on Instagram my stories. The cinemark one of they've got now one of",
            "start": 135.68
        },
        {
            "text": "versus when I will actually get pulled in to see it again. But beyond that, they keep putting out popcorn buckets. I just shared on Instagram my stories. The cinemark one of they've got now one of their popcorn buckets. is crypto holding a popcorn bag that you put the popcorn in there. And then they've got other ones that look like dog bowls. You know, I'm going to have to get two of those to give to my dog Cole. You know, I'm going to need the crypto holding the popcorn for myself. The Canadian Superman popcorn buckets are in fact uh these Daily Planet newspaper stands. Apparently, I'm going to need one of you Canadians to send me that. I will continue to burn money on Superman. This shirt, I bought it as soon as they put it up from dcccomics.com. And look it, it's already broken up. I will just keep buying them. It doesn't matter that it was a bad print on demand shirt. I will keep buying them because I have no self-control when it comes to Superman the movie. Uh before we go any",
            "start": 175.6
        },
        {
            "text": "will just keep buying them. It doesn't matter that it was a bad print on demand shirt. I will keep buying them because I have no self-control when it comes to Superman the movie. Uh before we go any further, I'll remind you of course uh housekeeping. I already promoted the fact that you can go get your Kind of funny membership to get it ad free. But maybe you're watching or listening to this screencast on youtube.com/kindfunname uh Apple or Spotify or any of the other podcast services where you can get this show completely free. If you are, please like, subscribe, share, leave a review, leave a comment for the algorithm. Of course, tell your friends that there's this nutball Superman fan uh that everybody should come watch and do stupid stuff with and and and enjoy. Kind of funny. Uh, of course, like I said, spend money if you got it and if you want to do that. Uh, you know, we're usually we do these things live. We can't live react to movie trailers because that's what gets us banned",
            "start": 213.68
        },
        {
            "text": "like I said, spend money if you got it and if you want to do that. Uh, you know, we're usually we do these things live. We can't live react to movie trailers because that's what gets us banned from YouTube. It turns out putting them up later, fine. Watching them live screws everything up. But of course, you've already got the Kind of funny games daily. You've already got the Games Cast. They're over there streaming Dune Awakening right now. There's a lot of great content and it wouldn't happen without our Patreon producers Carl Jacobs, Omega Buster, and Delaney Twining. Today, we're brought to you by XRE and Factor. We'll tell you about that later. For now, it's time for me to watch this Superman trailer and then react. I have been reacting a lot to these. You'd think that would make them shorter. It often makes them go longer. So, Barrett is going to hit it. We're going to see it. I've never wa I have not watched this trailer. I don't know how much of it is new. I hope not that much",
            "start": 249.04
        },
        {
            "text": "shorter. It often makes them go longer. So, Barrett is going to hit it. We're going to see it. I've never wa I have not watched this trailer. I don't know how much of it is new. I hope not that much is new. I hope We come out of it, I say ads, we come back and I'm like, \"Hey, that was that was pretty chill. See you later. I didn't ruin the movie for myself, but let's see what we got.\" Superman [Music] is [Music] the most powerful being on planet Earth. [Music] We finally meet now as planned. Exactly what I said would happen. I'll destroy you. And of course that reporter you always do interviews with who raised you as a child. I'll kill them, too. [Music] No matter what you do to me, Luther, your plans will work. Wrap it up. Good luck with that. [Music] Make a move, big blue. Oh, [ __ ] yeah. [Music] Ah, baby Joey. Baby Joey made it. If Joey, [Applause] they chose him. Let them die. Hey, quit messing around. I'm not messing around. I'm doing important stuff. A simple [Music] open eyes",
            "start": 288.0
        },
        {
            "text": "[Music] Ah, baby Joey. Baby Joey made it. If Joey, [Applause] they chose him. Let them die. Hey, quit messing around. I'm not messing around. I'm doing important stuff. A simple [Music] open eyes up here. [Music] All right, Barrett. There's what I like to call no Tim here. There's no time to [ __ ] around. Now run it back right away. Run it back, please, with volume and everything else. Superman. [Music] I was so lost in the sauce. I didn't read the words. Being on planet Earth. [Music] We finally meet now. As planned. I'll destroy you. And of course, that reporter you always do interviews with. That chemistry between who raised you as a child. I'll kill them, too. What is going on in front of Luther? I can't wait to see when we go back for frame by frame. [Music] No matter what you do to me, Luther, your plans will work. Wrap it up. Good luck with that. [Music] Make a move. Big blue [Music] soundtrack. Baby Joey. [Music] You're goddamn right. We will. They chose him. Let them die.",
            "start": 390.94
        },
        {
            "text": "to me, Luther, your plans will work. Wrap it up. Good luck with that. [Music] Make a move. Big blue [Music] soundtrack. Baby Joey. [Music] You're goddamn right. We will. They chose him. Let them die. Nicholas holding it up. Hey, quit messing around. I'm not messing around. I'm doing important stuff. Hey, buddy. Eyes up here. [Music] That's a hell of a trailer. Uh, it gives me more without ruining much. Okay. So, it's expanding it seems on a lot of scenes we've seen before, which I appreciate without giving me too much more to go on. Uh, when you see Superman here on all fours, but upside down holding this building. This is one I've seen kicked around a lot in terms of screenshots. I think one of the TV spots is using it. I've stayed away from the TV spots. Don't need to do this. Of course, Miss Tesmacher, Lex the Engineer, and Ultram Man entering into the Fortress of Solitude. something, you know, I've pretty existed since the first trailer, killing all the robots. Sure, why not? Uh,",
            "start": 499.44
        },
        {
            "text": "Miss Tesmacher, Lex the Engineer, and Ultram Man entering into the Fortress of Solitude. something, you know, I've pretty existed since the first trailer, killing all the robots. Sure, why not? Uh, well, the things I have questions about are going to be freeze frame stuff. We'll get to uh, you know, him punching the one Luther core guy seems interesting. Why would he punch that guy who his powers? Cuz, you know, I was thinking, is that Ultram Man, but it isn't because he's got the Luther core [ __ ] on. Then right there, I want to know who's in front of Lex. We'll get to it in a second when we do frame by frames. Uh, and then there was the other one that was catching me off guard. Um, [ __ ] I've lost it, but it's about to come around in the trailer again that I don't need ruined. And I'm not I'm glad they're not ruining it, but they're giving me more mor more souls to chew on. Oh, Mr. Terrific yelling, you know, get up here and I'm doing important stuff or whatever. Very funny, very",
            "start": 590.48
        },
        {
            "text": "not I'm glad they're not ruining it, but they're giving me more mor more souls to chew on. Oh, Mr. Terrific yelling, you know, get up here and I'm doing important stuff or whatever. Very funny, very cute. Very good. Very James Gunny, right? And again, leaving Superman. Oh, I know what I was get to. It's right up here in a second. Don't pause it yet, though. But we have an Ultram Man fight coming up here between Superman and he's using heat vision. He's using Heat Vision. Of course, as we've all talked about on these things, as you know, there's the Luther core guy. Lu, I'm sorry. Ultra Man, uh, comic-wise, usually just the mirror verse, you know, Earth 2, whatever, evil Superman. So, there's been so much conversation of who's going to be under the mask as Ultram Man. Is it just going to be David Corin sweat again with a different haircut when he pulls it off? Is it going to be Henry Caval, which a lot of people have been theorizing on again? Seeing the heat vision on Heat Vision there",
            "start": 624.16
        },
        {
            "text": "David Corin sweat again with a different haircut when he pulls it off? Is it going to be Henry Caval, which a lot of people have been theorizing on again? Seeing the heat vision on Heat Vision there definitely seems to drive home the point that they're not getting maybe the other one, of course, that's been out there that I'd float as well, but I've been burned on this prediction before. Maybe it is Bizaro. Maybe Lex cloned uh this Superman. That's who he's running as Ultram Man. The mask gets removed. It's him. And that sends him off to be. But I'm getting too into it. I want to know all this stuff, too. I I assume these are Lex guys. But we'll get into all that right after. We of course remind you that we couldn't do this kind of stuff. We couldn't have this kind of set. We couldn't have this amazing tech. We couldn't have this amazing team without your support on patreon.com/kindfunny. YouTube.com/kindfunny games. Apple or Spotify on all four platforms. You can pick up the kind of",
            "start": 658.64
        },
        {
            "text": "this amazing tech. We couldn't have this amazing team without your support on patreon.com/kindfunny. YouTube.com/kindfunny games. Apple or Spotify on all four platforms. You can pick up the kind of funny membership. Get all of our content ad free. Of course, get your daily dose of me. And of course, get good karma for supporting a business you hopefully love. But right now, you're not using your benefits. So, here's a word from our sponsor. This episode's brought to you by XRE. Y'all know that a few months ago, my life changed forever when I brought a pair of XRE1 AR glasses on a long flight to New York. I legit could not believe how easy it is to use and high quality my experience was playing games, watching movies, TV shows on the plane without just too much extra stuff around me or especially not a giant goofy headset around my head. No joke, this is my favorite new tech product in years and it has earned a permanent spot in my travel bag. It is only hard to believe that it works",
            "start": 690.4
        },
        {
            "text": "not a giant goofy headset around my head. No joke, this is my favorite new tech product in years and it has earned a permanent spot in my travel bag. It is only hard to believe that it works as well as I'm saying until you try XR1 AR glasses for yourself and then you will see that the future is now. The tech is here. Connect XReal 1 glasses to wherever you are playing. Whether it's a handheld console, a PC, phone, home console. You just get a massive 150in virtual screen anywhere, anytime for any game. Gaming on the go, like a long haul flight, you need the XR 1. Neck starting to hurt from staring down at your handheld, we've all been there. You need an XR 1. A screen as big as your wall. Instant plugandplay with all of your devices via USBC. Built-in audio with sound by Bose anchoring your screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full HD. These are what make XR1 a musthave. And we hear XR1 Pro is coming soon with an even bigger virtual screen. Hit",
            "start": 731.84
        },
        {
            "text": "screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full HD. These are what make XR1 a musthave. And we hear XR1 Pro is coming soon with an even bigger virtual screen. Hit our link below to get your XR glasses today. There's nothing better than when a sponsor of Kind of funny is something that we are legitimately obsessed with, and that is exactly the case here with XR. You're going to hear me talk about these forever. Go to kind offunny.com/xreal. That's kind of funny.com/xr. I promise you, you are going to love these things. This episode's brought to you by Factor. Summer GameFest is here. The Switch 2 is here. The sun is here. So many summer things are here. And the number one thing you don't want to be doing all summer, spending hours cooking inside. That's where Factor comes in. Factor chef crafted dietitian approved meals are ready in just 2 minutes. taking the hassle out of eating. Well, we love Factor here at Kind of Funny and Greg's often making and",
            "start": 781.92
        },
        {
            "text": "Factor comes in. Factor chef crafted dietitian approved meals are ready in just 2 minutes. taking the hassle out of eating. Well, we love Factor here at Kind of Funny and Greg's often making and enjoying meals quick in between shows here in the studio. I just had a roasted garlic chicken and I'm telling you, you would have loved it. Factor meals arrive fresh and ready to eat, perfect for any active lifestyle over summer and beyond. With 45 weekly menu options, you can pick gourmet meals that fit your summer gains and goals. Choose from options like calorie smart, protein plus, keto, and more. Get started at factormeals.com/kindafoney5050 off and use code kind offunny50 off to get 50% off plus free shipping on your first box. That's kind of funny 50 off at factormeals.com/kindafoney5050 off for 50% off plus free shipping. factomeals.com/kindfunn 50 off. And you're back with me Greg Miller for more Superman trailer reactions. Bear what do they call this trailer? I don't ever want to get",
            "start": 830.4
        },
        {
            "text": "for 50% off plus free shipping. factomeals.com/kindfunn 50 off. And you're back with me Greg Miller for more Superman trailer reactions. Bear what do they call this trailer? I don't ever want to get spoiled. never look at it. They call it Superman the final trailer. They call it just says on YouTube, Superman tickets on sale now. Okay, the Superman ticket is on sale. Capitalism trailer. Got it. Perfect. Love that. Um, of course, like I said, one month removed. You already heard all that. Let's jump back into it. You can let it play and I'll tell you when to stop if and rewind and I'll try to be very nice about it. Um, first off, stop and rewind. Can you go back? Uh, I imagine Okay, cool. Yeah, just [ __ ] falling out of the building there. I was like, you know, obviously the DC EU and Snider versse got so much [ __ ] in Man of Steel for the destruction of Metropolis and the deaths it would have caused. I'm looking forward to seeing how they've evacuated all those buildings already, so",
            "start": 876.08
        },
        {
            "text": "versse got so much [ __ ] in Man of Steel for the destruction of Metropolis and the deaths it would have caused. I'm looking forward to seeing how they've evacuated all those buildings already, so nothing bad would happen. Also, this kid should be running with more pep in their step from it. Uh, I digress though, more stuff falling down. You see Superman going out of his way to save this one uh lady in a car here. Good for him. And yeah, doing this all four cat pounce flight maneuver. Uh, you know, worth calling out from the overall here. God damn does Nicholas Holtz Lex sound good. He's just doing a great performance there of somebody pissed off at Superman. Of course, here it is. Miss Tesmacher herself, Alex, entering into the Fortress of Solitude to kill all these robots. Uh, and again, we'll see what they're up to here. You'd imagine this is to get the Phantom Zone projector or whatever they call it. Uh, based on the fact that it does seem Phantom Zone's pulling a big part of",
            "start": 918.48
        },
        {
            "text": "we'll see what they're up to here. You'd imagine this is to get the Phantom Zone projector or whatever they call it. Uh, based on the fact that it does seem Phantom Zone's pulling a big part of this. Uh, most combat we've seen here is all the robots. If you want to rewind and just do a couple takes of the robots getting destroyed there. Of course, I'm well verssed in robot number four. That's Alen Tudek, right? Uh, I want to pronounce the name right. It's not that I don't know who it is. Uh, I have him at home because I bought all the Superman action figures for my son and then was able to assemble the robot. But you see the engineer tossing a disc here, just cutting this. Lex doesn't even [ __ ] blink. You know what I mean? Ice cold and getting up to this Kryptonian console that of course we've already seen the robots used to heal Superman. And I think you see later in this trailer. I do believe we're playing that out of order. It would strike me that the crypto home moment that",
            "start": 952.0
        },
        {
            "text": "we've already seen the robots used to heal Superman. And I think you see later in this trailer. I do believe we're playing that out of order. It would strike me that the crypto home moment that we're all so wellversed in would come before this, probably introducing the Fortress of Solitude. Uh that way we understand when Lex gets here later. Again, as you look at this just gorgeous set design in something I don't think we see period, let alone in what we've seen live action Superman to begin with. Right. Of course, as you probably hopefully I hope are aware, tomorrow on Thursday begins kind of fun kind of funny Superman in review where we watch and rank all the Superman movies leading into this Superman one. Uh I just watched it last night so it's fresh on my mind. I'm sure you've seen it before, but as much as we all sit here and love the Richard Donner Superman the movie and we'll see what Tim and Andy who have never seen it before are going to think which is mindboggling to me.",
            "start": 988.64
        },
        {
            "text": "it before, but as much as we all sit here and love the Richard Donner Superman the movie and we'll see what Tim and Andy who have never seen it before are going to think which is mindboggling to me. that so set us on the course of the Fortress of Solitude is this and it's ice crystals and it's it's a weird Kryptonian crystal tech or whatever. I love this look cuz it looks so pulled straight from Allstar Superman uh and what the consoles kind of looked like there. this weird alien future, but also kind of retro. And you also see all these crystals poking out of it, like a nice way to give it more of a a James Gun look to it, but I mean a look all its own, which I really appreciate as this looks so science fiction, which really isn't what we've seen before, whether I'm talking about uh Superman the movie, whether I'm talking about Smallville, what their cave or Fortress of Solitude looked like, even if I'm talking about what it was like. Uh, and I know I'm getting mincing and getting",
            "start": 1031.2
        },
        {
            "text": "the movie, whether I'm talking about Smallville, what their cave or Fortress of Solitude looked like, even if I'm talking about what it was like. Uh, and I know I'm getting mincing and getting weird with the, you know, the Kryptonian ship and all that jazz from the Snider verse and all that jazz, but I digress. Let's keep it rolling. Thank you, Bear. Ultra Man is slamming him down here again. Can we pause this because this daily Let's talk about the Daily Planet. This is something I, as a kid, could only dream of when I was watching the Christopher Ree movie, right, of like the Daily Planet just not having a dope ass globe on top of it. the fact that they they have it here. Again, the style of Metropolis, the color palette of this movie. So into it. Love what I'm seeing out here. Can't wait to see it all in motion. How they go. Thank you, Barrett. You may roll with this. I will stop you again right here. Let him lip. Yeah, there you go. The the chemistry, but these two have. You might",
            "start": 1073.36
        },
        {
            "text": "to see it all in motion. How they go. Thank you, Barrett. You may roll with this. I will stop you again right here. Let him lip. Yeah, there you go. The the chemistry, but these two have. You might say, Greg, you've only seen the trailer. How do you know their chemistry? Well, first off, the conversation in the last trailer, right, where she's interviewing him and he gets angry. I love that from a you're in a relationship and this is how it kind of works, right? as he goes into super mad mode, she goes into reporter mode, and then he gets mad cuz he's going into boyfriend mode, she's in girlfriend mode. But, uh, Entertainment Weekly put up yesterday, uh, a whole bunch of, they started putting out a whole bunch of stuff about Superman. Uh, and one of them was, uh, this scene of scene I use, it's, you know, a promo shot or whatever, but it's three phone booths next to each other. Rachel Bros hands in one like interviewing somebody, taking notes, and then the camera pans to the second",
            "start": 1111.28
        },
        {
            "text": "it's, you know, a promo shot or whatever, but it's three phone booths next to each other. Rachel Bros hands in one like interviewing somebody, taking notes, and then the camera pans to the second one. Corin sweats in there getting ready. She comes in like pushes him up against the wall and like fixes his tie and does it and it's like damn like they don't even kiss in this cuz it's just what but it's like it's [ __ ] hot and then they go one over and it's James Gun. I was like I didn't need to see James. Yeah, I love James. James is great. You had me going here in a certain direction then you you you swerved me with James Gun. I don't know how to watch them Greg. It wasn't a cuck booth. All right. Three side by side. You couldn't see Ian. And then they also put up one that's the entire cast doing a tug of rope with Krypto which I thought was really cute. Please play. But the chemistry these two have. Of course, here we go. Yeah. Again, this is something I've come back to as I always",
            "start": 1147.68
        },
        {
            "text": "doing a tug of rope with Krypto which I thought was really cute. Please play. But the chemistry these two have. Of course, here we go. Yeah. Again, this is something I've come back to as I always try to ruin the movie for myself and figure out exactly what's happening. Clark hurting here back in Smallville, laid on the bed, MPA rubbing him. Uh, and he's got some kind of it looks like almost the doomsday virus creeping up his neck. I doubt that's what it is, of course, but something to that effect. Is it just kryptonite poisoning? You know, has he just broken out of the glass box we've seen him in before? I highly doubt that. That seems like he breaks out of that to have to stop the villain in the final third act. Uh, but still interested to see where this is again. Maybe this is back to the crypto home thing, but I doubt it. Maybe Superman's just eating [ __ ] this entire movie as he needs to so the world understands that Superman is not a boring and vulnerable character who can",
            "start": 1181.36
        },
        {
            "text": "to the crypto home thing, but I doubt it. Maybe Superman's just eating [ __ ] this entire movie as he needs to so the world understands that Superman is not a boring and vulnerable character who can rewind time. Barrett, back to you. Iconic. Now, pause here. I need to We got a lot of lights on studios. I got to see is this just a statue? Cuz it strikes me. What? Oh, no. No, no. Okay. No, no, no, no, no, no, no, no. I was going to say, is it just a statue? this being in front of Lex here. But no, this it is moving and we are in Lex's holding cell for Metahumans. So, we've seen this one where this is the one if you've seen the other trailers. If not, spoiler or my trailer breakdowns cuz there's more intense in the trailer. This is where eventually Superman's going to be penned up with Metamorpho while Metamorpho is doing kryptonite to wound him. Right. So, as I look here, like this person thing, it could be metamorpho, but it doesn't look like it's at the I mean, and they can do",
            "start": 1219.44
        },
        {
            "text": "Metamorpho while Metamorpho is doing kryptonite to wound him. Right. So, as I look here, like this person thing, it could be metamorpho, but it doesn't look like it's at the I mean, and they can do anything in color gradient gradients, but they haven't. I I'm going to say it's not metamorpho, and I don't think it's baby joey. It looks too lanky, too tan. Let Let it move it back and forth, Barry, because there the thing's dancing. The thing's moving. Oh, so does Baby Joey get bigger? Who knows? We don't know. Baby Joy's an original James Gun creation. We're not sure. Joy's power set yet. We will. You know what though? Here's something interesting you keep in the back of your head as I've only watched this trailer as much as you have in this video. It looks like there's tendrils which I was like, \"Oh, maybe that person is tied up.\" I know when we see Baby Joey's big screen debut here in a second. I It's Superman, Baby Joey, and Metamorpho. And there's a bunch of tendrils there, too.",
            "start": 1262.4
        },
        {
            "text": "was like, \"Oh, maybe that person is tied up.\" I know when we see Baby Joey's big screen debut here in a second. I It's Superman, Baby Joey, and Metamorpho. And there's a bunch of tendrils there, too. Maybe this is the tendril creature. Maybe this is Brainiac. It isn't, but maybe it is. Let's keep going. Superman get his ass kicked. Of course, needs to get his ass kicked. We need to reset the power balance here. Lex looking smug as [ __ ] Robots picking him up. We've seen this. We know this one. Director James Gun. This is This is a great just a great bit here of him healing. Uh, pause. Yeah, you know, I'm going to want to try to read everything. The Big Belly Burger there. We got the MTA, Metropolis Transit Authority. I'm going to run up on the screen. Leave it right there. Okay. Uh, Barrett, tell them about your favorite album while I'll be off mic. Uh right now everybody I am listening to Turnstyle's new album, Never Enough. And it's very good. It's one that I weirdly think Nick",
            "start": 1305.92
        },
        {
            "text": "tell them about your favorite album while I'll be off mic. Uh right now everybody I am listening to Turnstyle's new album, Never Enough. And it's very good. It's one that I weirdly think Nick Scarpino would be into. It's a lot of like uh older vibes of uh a bit more hardcore, but then a bit more like weird and viby, a little bit Rage Against the Machine that I think I think Nick Scarpino would be kind of into. So I'm listening to that a lot uh right now, and it's very good. I highly recommend it. All right. Pretty big waste of time for me to go up there. Great. You're great, Bar. And I've been listening that Turnstyle album, too. It's good. Uh the the stuff up there is called Sphere and it looks like some kind of apartment complex. I wonder if somebody's Lex or some other science fictiony person has started a Sphere condominium, you know, private world or whatever. And then Metropolis Transit Authority just says take public transit and it's like save some money or some [ __ ] I was",
            "start": 1348.48
        },
        {
            "text": "person has started a Sphere condominium, you know, private world or whatever. And then Metropolis Transit Authority just says take public transit and it's like save some money or some [ __ ] I was thought there might be a play on Superman or something there. There wasn't. But this is the Kaiju we know well from the toy that Ben has. That's when he eventually, spoilers, this guy's going to get punched underneath the chin and his belly is going to open up and slime is going to pour out. Ew. That's what the toy does. I assume that's what this does. I also assume there there's supposed to be a baby kaiju, I think, too, based on toys. But maybe that's You think it's Baby Joey? No. Okay. This is not Baby Joey. Okay. I will be horrified if this is Baby Joey. But who knows what Baby Joey Hey, you know, rewind it there. Let me see what that blue billboard said, too. I might have to get over this. What am I going to like frame back? What does it got there? No, maybe that's just a baseball team.",
            "start": 1390.4
        },
        {
            "text": "know, rewind it there. Let me see what that blue billboard said, too. I might have to get over this. What am I going to like frame back? What does it got there? No, maybe that's just a baseball team. It's got like a Z there. Yeah. Um, Zoro was a part of this. DC, right? Yeah. Batman was watching it when his parents got killed. I mean, like I mean theoretically, who knows what they'll make the movie here, doesn't roll with it. What a music. What a what music. Of course, here we got the hammer blowing up the building, pissing off. He's mad that Super here. This is the big part. This is the big one here. So, rewind me. Yeah, good job. Even further, please. Cuz this is going to be This is the first time we've seen this battle. That is Yeah. Oh my god. Look at how [ __ ] good. It's hulking like uh calm the [ __ ] on right now. It's what now? Uh hulking like caval a little bit, dude. That that bodybuild, dude. It's like dude, like I don't that would that would make me so happy, but I don't",
            "start": 1425.6
        },
        {
            "text": "uh calm the [ __ ] on right now. It's what now? Uh hulking like caval a little bit, dude. That that bodybuild, dude. It's like dude, like I don't that would that would make me so happy, but I don't want to confuse audiences, so I just don't think they do it. He's got long hair, too. I got to get up. Um, besides that, uh, I have I I don't have too much else to say about this album. Uh, but I am very excited for Hot Mulligan's uh, the Oh, One More Frame, Greg. Keep going. Keep going. Now I'm over here. Hot Mulligan's new album and new song are also very good. Or the song is good. The album comes out in a couple months and I'm very excited about it, you know? I mean, like I just I'm excited for this. I hope if right now Greg Miller who cannot stop consuming content for Superman the movie is his suit changing is his like no it's just his arm moving hard to go off some stills here my hope here is that this does not get ruined for me and doesn't turn out lame as [ __ ] but again he is",
            "start": 1469.92
        },
        {
            "text": "is his suit changing is his like no it's just his arm moving hard to go off some stills here my hope here is that this does not get ruined for me and doesn't turn out lame as [ __ ] but again he is shooting heat vision now so I love the idea of caval because I think that would be so fun but again I think there's you know the general Well, consensus is there's bad taste in audienc's mouth about multiveres already. So, do you really want to introduce that right away? But we're introducing a [ __ ] alien dog. So, like if anybody could do it and make it just be like, oh, that's how it is. James gone. Maybe in the very beginning they mentioned that they've dealt with Earth before. So, that'd be cool. I could also see some kind of Zod connection here. I don't know how if Lex is going to get to Fortress with him to get the Phantom Zone projector, how he would maybe Zod got out of the Phantom Zone and is playing as Ultram Man and using Lex to get up there to get the Phantom Zone projector.",
            "start": 1522.72
        },
        {
            "text": "Fortress with him to get the Phantom Zone projector, how he would maybe Zod got out of the Phantom Zone and is playing as Ultram Man and using Lex to get up there to get the Phantom Zone projector. Maybe it won't be at all. I mean, I still think it's Ultram Man, it's just going to be a reveal. I think it's just going to be Cor sweat. I think it's the easiest thing. You take it off, it's corn sweat with a mustache and his hair parted the other way or some [ __ ] and they're like, \"Oh my god, it's I'm from Earth, too.\" Or some [ __ ] But again, I wouldn't put it past this universe already knowing about multiple Earths and it not being that weird. And again, maybe we'll get a taste of that. I like the idea of Bizaro because I do think that could fit in thematically of like him being kind of mindlessly told what to do and stuff like that. Yeah. Yeah. Being under Luther's thumb or whatever. Yeah. And that being kind of like the the core thing of him going like from the last trailer where",
            "start": 1569.92
        },
        {
            "text": "mindlessly told what to do and stuff like that. Yeah. Yeah. Being under Luther's thumb or whatever. Yeah. And that being kind of like the the core thing of him going like from the last trailer where it's like, oh, like you you went off and did this without like government approval and all this stuff and like his whole arc is I mean that the the Bizarro thing immediately starts to make sense, right? Cuz what would Lex what's the weapon of the future in this world? Metahumans Superman. So if Lex is cloning Superman that he can control like Ultram Man, he shows that to the governments of the world that are not terrified. You can all have your own Ultram Man. You can all have your own thing. And it is a Bizarro. That'd be that would be dope and would make sense. But we'll see. Keep pushing just a little. Okay. The way it tears there kind of makes it look to me like it's a heat vision for heat vision, but I don't think it is. I think I'm reading too much into that. It's just him getting",
            "start": 1604.96
        },
        {
            "text": "just a little. Okay. The way it tears there kind of makes it look to me like it's a heat vision for heat vision, but I don't think it is. I think I'm reading too much into that. It's just him getting blasted there. Uh the bruised eyes are brand new as of today as well here. So, you imagine that yes, at some point Superman is in a heat vision battle with Ultram Man, and he gets wamped in the eyeballs and gets his [ __ ] kicked in. Again, this floor here is what I assume is Phantom Zone. We've seen Phantom Zone uh with in the last trailer, right, where Mr. Terrific and Lois Lane uh use the T-Mobile or whatever and like, well, you're about to see it in a second. Uh but show up in the Phantom Zone through the portal or whatever. I'm assuming it's the Phantom Zone. Again, there had been some thoughts and rumors last time we did this that developed live on air as we went. First off, just look at the [ __ ] texture of his cape, too. Awesome. But that it was maybe, you know, more multiple",
            "start": 1638.24
        },
        {
            "text": "thoughts and rumors last time we did this that developed live on air as we went. First off, just look at the [ __ ] texture of his cape, too. Awesome. But that it was maybe, you know, more multiple Earth [ __ ] or pocket dimensions like in Peacemaker. But I'm pretty sure it's Phantom Zone based on it. But I'm interested to see who he's yelling at here and what's going on if it is just Ultram Man or more Kryptonians. Go for it, Bear. Thank you. Here we are again fighting in the in this crack. This is the one thing too that I've not come up with a good theory for on what's going on with this crack in Metropolis. We've seen it in multiple things. Again, it does it has a color to it. And in the other trailers, it kind of dominoes out, which again, not having the ins and outs. Look at that's not like exposed pipes. That's like they're cutting through the dimensions. So again, maybe this is part of this Phantom Zone thing, too. I know I'm just using Phantom Zone as an out right now for",
            "start": 1679.04
        },
        {
            "text": "not like exposed pipes. That's like they're cutting through the dimensions. So again, maybe this is part of this Phantom Zone thing, too. I know I'm just using Phantom Zone as an out right now for everything. But again, the blocky Minecraftness almost of it matches I feel like what you see inside of these Phantom Zone things if that's what this is. Uh as it cuts through the ocean as it cuts into Metropolis. I don't know what's going on with it though. We'll have to wait till we see it on July 11th. July 8th for me. Maybe earlier if somebody would [ __ ] send me the premiere. Here we go. We got what? Superman's punching. Oh, just a just a regular old Lex guy. [ __ ] Because this is going to be the Lex core army that comes up. Uh then you got Yeah. the helmet getting torn off this dude. Him getting clocked and his teeth popping out. Ah, now you see bear. This is where Well, first off, where did those teeth come from? I guess his back jaw. Back jaw maybe. Oh, the side jaw. I don't know",
            "start": 1719.6
        },
        {
            "text": "getting clocked and his teeth popping out. Ah, now you see bear. This is where Well, first off, where did those teeth come from? I guess his back jaw. Back jaw maybe. Oh, the side jaw. I don't know about that. That doesn't James Gunner, you're going to have to re-edit that. That doesn't make much sense in the way he got punched. Um, lots of questions here for Greg already. So, I I I've seen the Lexicore armor, of course. Spoilers for this movie that you if you're not paying attention. Spoilers for this movie if you haven't been paying attention. Uh, one of the Target exclusive toys has Lex in this armor. Yes, I have it. Don't worry about it. Um, and so I've known there'd be battle suits. My thought, of course, though it' be a human being in a battle suit, which makes me very interested in Superman punching the [ __ ] out of this dude and knocking his teeth out. Now granted, maybe Superman's saying I'm only punching at 15%. But I don't know about that. Maybe he's weakened from the",
            "start": 1759.12
        },
        {
            "text": "in Superman punching the [ __ ] out of this dude and knocking his teeth out. Now granted, maybe Superman's saying I'm only punching at 15%. But I don't know about that. Maybe he's weakened from the Kryptonite, too, and whatever battle he's been in. I know we're about to see a bunch of dudes that he's going to unleash, I think, heat vision on it, if I remember correctly from what we saw. But I I wonder what's going on with these dudes. Is the suit augmenting them? Are they Is this a digital enhancement and this is another Ultram Man clone? I doubt it. I doubt it. I doubt it. But I'm just putting it out there. I'm just putting We're here in the This is the brainstorm tree. We didn't see the movie. We didn't write the [ __ ] movie. We don't know. Calm down, everybody. Jesus. Barry, let it play. Oh yeah, because then what they what I'm punching at 15% and then I'm [ __ ] sky tackling guys at 5%. Can we go back and see that sky cack? I mean, he's taking that man on. What is his battle suit",
            "start": 1803.28
        },
        {
            "text": "Oh yeah, because then what they what I'm punching at 15% and then I'm [ __ ] sky tackling guys at 5%. Can we go back and see that sky cack? I mean, he's taking that man on. What is his battle suit doing for this man? Shout out to him and Krypto [ __ ] people up though. Yeah. Okay. Okay. He takes him back to the I do like the idea of like maybe it's an army of the Ultrammen cuz Yeah. Like this also this shot of the the person's face here does kind of look a little weird. Oh, dude. No, look. Stop right there. And then look at his ear and look at his his hair. Like that's like a square like they they like Photoshop masked and put it on there. Yeah. Yeah. Yeah. It's Ultra Man then. That would make sense. It would be nice. Or it's just like this is what it looks like when we're doing frame by frame whereas like in motion, right? Like Sure. They're cutting down on that just to cuz in motion it's less noticeable. But yeah, but I feel it's more so the lighting for me. The lighting looks",
            "start": 1842.0
        },
        {
            "text": "by frame whereas like in motion, right? Like Sure. They're cutting down on that just to cuz in motion it's less noticeable. But yeah, but I feel it's more so the lighting for me. The lighting looks weird. Yeah. Look at his ear right there. It's like clipping through the suit. His right ear. But if you would go back and forth with it. Yeah, this is a cover up, everybody. Everybody, we got a big cover up here. They're hiding something. James Gun, what are you hiding? Well, they're all caval. Nobody's going to be Caval, but still. Okay. Okay. Yeah. Let it on July 11th. See, here we are again with the world getting ripped open with this blue stuff. I don't know. I I I don't know. Do we think it's like if we're going to go with the uh Phantom Zone theory, do we think like maybe it like breaks open and then causes this rift or something like that? Yeah, I'm trying to my you you know I feel like here's the the disconnect for me in the plot is this. I don't understand why Luther wants the",
            "start": 1887.04
        },
        {
            "text": "open and then causes this rift or something like that? Yeah, I'm trying to my you you know I feel like here's the the disconnect for me in the plot is this. I don't understand why Luther wants the Phantom Zone and why Ultram Man's helping Luther. If he's a clone and he's mindless, whatever. Great. Oh, but you know what? Like Bizaro's whole bit is being blocky. So maybe Bizaro would be helping him to then make the Bizarro Earth. That's getting really out there. I'm getting really out there. But you figure like maybe this is something's just gone wrong. But even then it seems like it's the big thing. So like even if Lex's plan goes ary and starts splitting the world in two. Maybe that's maybe that's part of it too. If it's if it is an Earth two thing they're trying to do the this is one that I can't give you any any real guidance on. There's a lot of interesting things this could be doing right here but I don't know what they are and I won't till July 8th. I love this. Of course I think",
            "start": 1932.72
        },
        {
            "text": "I can't give you any any real guidance on. There's a lot of interesting things this could be doing right here but I don't know what they are and I won't till July 8th. I love this. Of course I think we've all known uh it is point if you're if you have not been watching uh everything like I have. It is confirmed now that this is not the Justice League. This is the Justice Gang. Uh the Justice League does not exist yet in this universe. So you of course are waiting for Superman, Batman, and Wonder Woman to get their [ __ ] together to start the Justice League. This is in fact the Justice Gang. Uh yeah, but Guy Gardner facing off with Superman. It looks like we're in that stag uh building uh lobby that we've seen so many times where they're having a heated exchange, and this time Guy Gardner is actually starting to talk some [ __ ] but he'd get his ass kicked. Batman knocked him off with one punch. Ultra Man Superman fighting in the Meteor uh stadium. We've seen this a lot. Doesn't mean",
            "start": 1990.4
        },
        {
            "text": "is actually starting to talk some [ __ ] but he'd get his ass kicked. Batman knocked him off with one punch. Ultra Man Superman fighting in the Meteor uh stadium. We've seen this a lot. Doesn't mean it ain't cool. Soda Cola in the background, of course. Always huge. Weber wireless. Something else there. I can't read. Douglas man just [ __ ] gonna suplex this man with all with all his strength. Entire world. Really quick, this is a nerdy baseball field thing. I'm wondering which baseball field this actually is cuz it looks this layout. I believe might be Cleveland. Cleveland. Yeah, I think they shot I'm pretty sure they shot in there. Yeah, because Cleveland's cheap. Yeah, like the the meteor sign is uh kind of uh covering like the the glass windows for that section. That always seems like a little too like like rich people go over there to like eat and and watch and stuff. But hell yeah. Yeah, this definitely is. [ __ ] yeah. Hell yeah. Of course, Cleveland, where Superman was",
            "start": 2028.88
        },
        {
            "text": "like a little too like like rich people go over there to like eat and and watch and stuff. But hell yeah. Yeah, this definitely is. [ __ ] yeah. Hell yeah. Of course, Cleveland, where Superman was created. Woo. Uh then this one shot we've seen of the Daily Planet a million times. I'm not against it by any stretch of the imagination. I'm just like I'm ready to see more on the Daily Planet, but I also wonder how much I'll get in the Daily Planet. Uh go Yeah, go forward again for me, Bear. We go in here. Mr. Terrific sending out his stuff from his chair. I'll tell you what, I said this at home, too. Uh you know, to get all the exclusive things, you got to buy packs that So, you have multiple figures. If you would have told me five years ago, let alone for so 30 years ago, whatever, that I'd have multiple Mr. terrific action figures in my living room. I would have been like, \"Wow, I must have thousands of action figures that are based on way cooler heroes.\" But here it is. Mr. Turfic",
            "start": 2079.52
        },
        {
            "text": "I'd have multiple Mr. terrific action figures in my living room. I would have been like, \"Wow, I must have thousands of action figures that are based on way cooler heroes.\" But here it is. Mr. Turfic sending out his stuff. And here we are. So again, this is the newest scene we've seen in this trailer. And so yeah, we have Baby Joey in Superman's hand. We have Metamorpho over there with many tendrils of Metamorpho, it looks like, coming out. So maybe Metamorpho had to sacrifice himself here. And then to the left, what that looks like? Maybe a hairy arm. Oh, crypto. That's crypto. Yeah. Yeah. I'm going to say that's crypto. That's Krypto's paw and arm. And then bar. And you have a full screen. So, let me know if I sound stupid. That looks like a crypto paw. And then maybe his cape sneaking out from there. Yeah, that's my best. And then Yeah. A million blocks again with the blocks here. All the blocks out there making me wonder if that's a Phantom Zone projection or yeah, a Bizarro thing",
            "start": 2119.44
        },
        {
            "text": "from there. Yeah, that's my best. And then Yeah. A million blocks again with the blocks here. All the blocks out there making me wonder if that's a Phantom Zone projection or yeah, a Bizarro thing or whatever. But there's Baby Joey. Everybody crying, not having a good time out there. theory. Yeah, cuz Bizaro is kind of like that gray green, right? Like it's been a minute for me. Yeah. Usually white. Baby Joey. Uh-huh. A baby clone. Okay. See, the rumor has it that it's Metamorphos's kid, and that's why Metamorpho is being forced to work with Luor cuz Metamorpho not a bad guy, but it looks like he's been like, you know, I'm going to kill your kid kind of thing. Or maybe I maybe not even kill, maybe I could cure your kid. Maybe Lex is just dangling that kind of [ __ ] in front of him. Gotcha. While this But maybe these are baby Joey powers, you know? Maybe he's saving dad and Superman as they are what in space it looks like. Maybe you got a blue rim there in the lower right corner that",
            "start": 2162.56
        },
        {
            "text": "While this But maybe these are baby Joey powers, you know? Maybe he's saving dad and Superman as they are what in space it looks like. Maybe you got a blue rim there in the lower right corner that I can see. Maybe that's the we're above Earth or something. Looks like we're in zerog. Oh, nice. Okay, so the freeze frame there, which I appreciate quite a bit. One further uh is uh Lois flying the terrific mobile. What is it called? Terrific G or whatever. But look, he's got she got Okay. Yeah. [ __ ] I didn't notice this before. Okay, so it's the planet with her here. You got Perry White back left smoking a cigar. You got Cat Grant in the very back. You got Jimmy Olsson there. You got I assume Ron Troop in the very back there. And I saw uh Steve the sports reporter getting on earlier. Maybe they don't let him on, which would also be [ __ ] funny as hell. Oh, and then hold on. Can you give me back to that freeze frame? We got Jimmy on a laptop. That is a That is a That Yeah, that's a",
            "start": 2208.0
        },
        {
            "text": "they don't let him on, which would also be [ __ ] funny as hell. Oh, and then hold on. Can you give me back to that freeze frame? We got Jimmy on a laptop. That is a That is a That Yeah, that's a Justice gang laptop. That's the same logo that's on their outfits, of course. Oh, hold on. I'm gonna He's got a board to his right too of like the kind of Let me go look at that. Okay. Tell them about uh your favorite hat. Uh my favorite hat I'm not going to tell you about today. Uh one artist that I would recommend all all y'all listen to if you like the recommendations I've talked about earlier is uh an artist named Ekka Vandal. Her single Cruising to Self Soothe. Very good, very fun. Um I highly recommend checking that one out. It's a song I have on the playlist often. I'm of course doing what I can off of a freeze frame. What I think's interesting is that over on that B bulletin board closest to the right side of the frame there, we got a man in his military dress outfit. I don't think it",
            "start": 2251.28
        },
        {
            "text": "I can off of a freeze frame. What I think's interesting is that over on that B bulletin board closest to the right side of the frame there, we got a man in his military dress outfit. I don't think it is, but it looks a little bit like Rick Flag. Not Rick Flag Senior, who's the new uh guy in this, right? The God, I can never remember his name. Uh Gerillo. Uh Frank Gerillo. Uh he's the he's he's Frank he's Rick Flag Senior from Creature Commandos as well. Remember he is the dad of Rick Flag from Suicide Squad who spoilers for Suicide Squad got killed in that by Peacemaker, right? Kind of looks like him. Could be because some and we already know that's already in universe. That wouldn't be a big reveal or anything like that, but maybe that's what the board is doing. I wonder if this is I obviously the planet's going to be goofy. I mean the Daily Planet, the fact they're all up here together. I wonder if this is actually their board rather than like the Justice game. And let me let me",
            "start": 2296.64
        },
        {
            "text": "obviously the planet's going to be goofy. I mean the Daily Planet, the fact they're all up here together. I wonder if this is actually their board rather than like the Justice game. And let me let me look at the computer. Yeah, I assumed it was their board as well. Like it it seems like they're fully uh putting up shop in in this uh in this ship. Also, uh listen to heart attack man ride the pale horse. Everybody, I want to put a little bit of question on me calling out that that was the Justice Gang logo on that computer. It looks it's again a shaky little screenshot I got here. It looks like it might not be, but maybe it's from Maxwell Lord's brand of electronics kind of [ __ ] Maybe that's the whole thing. So, we'll find out when we watch the movie July 11th. Don't forget. Pre-order your tickets now. I got tickets to 4K. No, no, for Rumbly or whatever it is. Oh, yeah. Look, Steve in the background is not sitting down. He's getting bumped around. Nobody likes his ass. All right.",
            "start": 2341.84
        },
        {
            "text": "your tickets now. I got tickets to 4K. No, no, for Rumbly or whatever it is. Oh, yeah. Look, Steve in the background is not sitting down. He's getting bumped around. Nobody likes his ass. All right. Superman now back into Looks like he's in the gap here. Yeah. Spinning this thing around. Who the [ __ ] is that? I believe Ultra Man refer to go off of like in that shot where his uh laser eye heat vision where it kind of looks like he's got longer hair. This kind of looks like the same build. Again, I think they're blocking out his face, right? Oh, yeah. 100%. But he looks bulkier than he did elsewhere. Interesting. He looks pretty bulky in those other shots, too. Those other action shots 100%. Maybe it's just the helmet or like the thing they put over his head is giving like juggernaut vibes here. I thought Yeah, Superman beating the [ __ ] out of him as he should. The you know our beginning conflict of the civil war. Superman stops the kaiju smashing down Superman saving this girl.",
            "start": 2383.76
        },
        {
            "text": "here. I thought Yeah, Superman beating the [ __ ] out of him as he should. The you know our beginning conflict of the civil war. Superman stops the kaiju smashing down Superman saving this girl. Then this scene here again I think so yeah we're so interesting interesting. So, let's talk about what we got here just from this little tidbit. This is inside the chasm of the blocky [ __ ] that look that I've been saying looks like cuz that's Metropolis behind Mr. Terrific as he's yelling into the chasm here where clearly like space. But there's that ring over there sucking [ __ ] in which is what I thought last time around when people were like they're going through dimensions. It looked like Mr. Terrific and Lois were coming out of a ring very similar to that. So yeah, I got to imagine this is the Phantom Zone sucking in Metropolis. They've jacked up the the Phantom Zone projector. I don't know. Maybe it's just some other plan. Are we going backwards or forwards right now? Backwards. Okay,",
            "start": 2432.64
        },
        {
            "text": "the Phantom Zone sucking in Metropolis. They've jacked up the the Phantom Zone projector. I don't know. Maybe it's just some other plan. Are we going backwards or forwards right now? Backwards. Okay, cool. Just make sure. Just make sure. But it's sucking things in. It's terraforming. It's doing this. Yeah, I could if he gets put into the Phantom Zone at one point like something that happens outside of it, someone trying to break him out or something and then it goes it gets [ __ ] up and then starts sucking in the planet cuz yeah, when Mr. Terrific and Lois were in there, they were in complete darkness and it looked like they were inside the Phantom Zone. Maybe they were deeper in this chasm. I don't know more than I'm glad I don't know. I don't need to know everything yet. July 11th. I need to know. I like this line. I'm doing important stuff here. And he's tired. You can tell he's tired then. Yeah. Look at all this. So yeah, thank you Barrett. Thank you. First off, crypto [ __ ]",
            "start": 2489.12
        },
        {
            "text": "I need to know. I like this line. I'm doing important stuff here. And he's tired. You can tell he's tired then. Yeah. Look at all this. So yeah, thank you Barrett. Thank you. First off, crypto [ __ ] people up. Hell yeah. Then yeah, all these Lex core battles suits that. Yeah, you have to imagine cuz I'm looking what's interesting right as we watch this. Everybody keep me honest. Barrett, keep me honest. I'm looking at everybody's feets and backs and I am seeing no jetpack, no jet boots. So, you would imagine that, yeah, if these are all Ultram Man style clones, they'd have their own flight capabilities, but I don't see any Iron Man. Like, with the Lex toy, I always just assumed, oh, he's going to have jet boots or something. Good catch. But yeah, they're all they're all independently flying right now. And Superman is not holding back whatsoever, which of course, is he cutting people in half? No, just knocking them down because if they're just clones, he doesn't have to worry about",
            "start": 2530.56
        },
        {
            "text": "right now. And Superman is not holding back whatsoever, which of course, is he cutting people in half? No, just knocking them down because if they're just clones, he doesn't have to worry about it, right? They're not people. [Laughter] What if the second half of this movie gets into the It goes like whole Bladeunner like Superman, you said you'd never kill anybody. They're not people. They're clones. Wait, but no, Clark, they have souls. No, they don't. There's like this whole philosophical debate. Crypto's just eating people. What is a life? Yeah. Yeah, exactly. They're my life to take them. They're based on me. Yeah. I don't know if that's true. I don't know. Good catch on the no uh jetacks or anything. Okay. Yeah. No dismemberment or anything. Yeah. Yeah. Yeah. Yeah. Usually, not usually, I guess. You know, a way around it obviously is always like they only maybe they need the suits to stay sustained or something. You know what I mean? Like they break down if they don't have the",
            "start": 2582.88
        },
        {
            "text": "I guess. You know, a way around it obviously is always like they only maybe they need the suits to stay sustained or something. You know what I mean? Like they break down if they don't have the suits. They're obviously the clone has to be imperfect to do this and work. Very cool. Very very cool. Very very cool. That's a great looking shot, too. Oh, interesting. Too, huh? Rewind. Do we We don't get a shot of his face here, do we? At the very beginning. I know. We get his beautiful chest. David Korn sweat. Whenever somebody shows you this video, you have a gorgeous chest. Thank you for working out so hard for this role. Okay. No, I was going to say maybe his eyes bruised from here, but they're already bruised. They're already bruised. He's just laying it on him. Okay. I'll tell you who will be excited about that scene right there. Uh my son Ben. Uh, I showed him Superman the movie, not last night, but a couple nights ago when we had our Mario Kart date and uh, I was like, \"You want to",
            "start": 2633.92
        },
        {
            "text": "be excited about that scene right there. Uh my son Ben. Uh, I showed him Superman the movie, not last night, but a couple nights ago when we had our Mario Kart date and uh, I was like, \"You want to watch Superman the movie?\" He's like, \"Yeah.\" And we started going and he, you know, 78 they were making movies a lot different. Uh, so he hung in there for a long time before he asked to fast forward and he wanted to fast forward to Baby Cowell, which we did. And then eventually he's like, \"Where's Superman?\" We fast forwarded from the Smallville stuff. But then even once Superman was doing stuff, you know, his whole montage of saving people, you know, uh, you've got me, who's got you? Uh, and so when that was ending, Ben turns to me, he's like, \"I want to see him fight somebody.\" buddy. And I went, \"Oh, buddy, that's not this movie.\" So, I was like, \"Oh, no, no, no, no, no, no. He's not going to throw a single [ __ ] punch in this movie. Don't worry about that. That's not That's not what",
            "start": 2679.52
        },
        {
            "text": "went, \"Oh, buddy, that's not this movie.\" So, I was like, \"Oh, no, no, no, no, no, no. He's not going to throw a single [ __ ] punch in this movie. Don't worry about that. That's not That's not what they wanted in 78.\" So, Ben will be excited that people are [ __ ] fighting in this movie. So, that's good for him. And I guess I did it to myself by showing him [ __ ] Civil War. Like, you know, that kid he expects superheroes are going to throw down as they should. And as it looks like they will in Superman out July 11th, one month from today. Uh, ladies, gentlemen, and NBS, thank you for going down this rabbit hole of Superman content with me, uh, both now and through the 18 years of my career and every time I've ever done something like this. Of course, you will be getting more Superman content than you could possibly want from us, but I won't let it stop me. You can't stop this train or this dream. Remember, tomorrow, Superman in review begins with 1978's Superman the movie by Richard",
            "start": 2711.2
        },
        {
            "text": "than you could possibly want from us, but I won't let it stop me. You can't stop this train or this dream. Remember, tomorrow, Superman in review begins with 1978's Superman the movie by Richard Donner. uh watch it right now so you can watch us watch or watch us live record it tomorrow when we go through and then set off to review and rank each and every Superman movie. Of course, as Tim talked about today, things are always changing at kind of funny. Right now, the plan is this. Superman the movie in review. Superman next week, Superman 2 in review. Superman 3 in review. Superman 4: The Quest for Peace in review. And then Superman 2025 in review because of the way the the chips uh fell on this one. The, you know, the way the cookie crumbled. We're going to do that and then the week after come back in the afterlow and do Superman Returns. If you're one of those people going, \"What the [ __ ] What about Man of Steel?\" Man of Steel, of course, is in DC EU in review. We've already ranked",
            "start": 2748.88
        },
        {
            "text": "come back in the afterlow and do Superman Returns. If you're one of those people going, \"What the [ __ ] What about Man of Steel?\" Man of Steel, of course, is in DC EU in review. We've already ranked and reviewed that in the DC cinematic universe. This is strictly these Superman movies. And if you really want to get mad like me and say, \"Where's Supergirl?\" Remember, of course, Supergirl has her own movie coming. So, I don't know if we're going to put him in here or do that, but I assure you I will make Tim watch Supergirl. Will I make watch Will I make him watch Superman 2? the Richard Dunner cut. Not right now, but I will. I I'll get them. I'll get them all on that one. Don't Don't you worry. I'll get them. Like I said, there'll be more live reactions, more stupid stuff like this. Maybe I get to sneak my way to the premiere. Maybe we just review it. Maybe you hear me talk about seeing 40x with Tim, seeing it with my kid, seeing it with my wife. Probably sneak it off and seeing it by",
            "start": 2792.0
        },
        {
            "text": "I get to sneak my way to the premiere. Maybe we just review it. Maybe you hear me talk about seeing 40x with Tim, seeing it with my kid, seeing it with my wife. Probably sneak it off and seeing it by myself again. Whatever. We don't know. But if you care about Superman like I care about Superman, we'll be talking about here on youtube.com/kindfunnygames. Spotify, Apple, every podcast service under the sun as a screencast/inreview. I think it's on the in review feed is the easiest way to keep up nowadays. And of course, embarrass thumbs up. Yeah, just do the in review feed. Don't worry, the screencast go there. All the movie content goes there. And of course, if you really like what we do here, pick up a kind of funny membership. patreon.com/kindfunny. YouTube.com/kindfunnames. Apple and Spotify. Get all of our shows. ad free support a small independent business and of course get your daily dose of me Greg Miller in a series I call Greg way where hey today's is 19 minutes about",
            "start": 2828.8
        },
        {
            "text": "and Spotify. Get all of our shows. ad free support a small independent business and of course get your daily dose of me Greg Miller in a series I call Greg way where hey today's is 19 minutes about Superman the movie being one month away and there's a bunch of other ramblings in there but you know how it is for now I will bid you a do and say until next time it's been our pleasure to serve [Music]",
            "start": 2866.0
        }
    ]
}