{
    "id": 14214,
    "video_id": "4PDoPpIN_cU",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Andy Cortez",
        "Blessing Adeoye Jr."
    ],
    "title": "Our Xbox Showcase 2025 Predictions - Kinda Funny Gamescast",
    "description": "Go to http://kindafunny.com/XREAL to grab yours now!\n\nGC060325A\n00:00:00 - Start\n00:03:00 - Housekeeping\n00:05:15 - Topic of the show \n00:08:45 - Round one predictions\n00:20:00 - Round two predictions\n00:33:15 - Round three predictions\n00:48:30 - Round four predictions\n00:57:15 - Round five predictions\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1748980901,
    "duration": 4838,
    "transcript_chunks": [
        {
            "text": "[Music] What's up and welcome back to the kind of funny games cast for June 3rd, 2025. Of course, I'm your host Tim Gettys. I'm joined today by blessing at YoYay Jr. Good day, Tim. Greg Miller. Good day, Tim. The order is restored. The seating order and Andy Cortez as well. Uh, if you have Amazon Prime, you have Twitch Prime. That is true. Don't you ever forget it, everybody. Sometimes you're out there and you forget. You're like, \"What's that thing always says?\" They don't want you to remember. Amazon Prime, you have Twitch Prime. Set a reminder so you don't forget. Set the reminder, everyone. It is Summer GameFest season. It is announcement season. It is Switch 2 season. It is PlayStation season. It is Xbox season. It's all the damn seasons. It's exciting times for everybody. Um, we didn't know that a State of Play was happening until we did. Uh, so we just did a kind of funny Games Daily where we gave our predictions, me and Bless, of what we might see at tomorrow's uh, PlayStation",
            "start": 2.24
        },
        {
            "text": "know that a State of Play was happening until we did. Uh, so we just did a kind of funny Games Daily where we gave our predictions, me and Bless, of what we might see at tomorrow's uh, PlayStation event. But we're doing a full ass Xbox showcase prediction. Each one of us bringing five predictions for what we think Microsoft has up its sleeves on Sunday. Uh, when of course we'll be live reacting to the showcase. Then after that doing our Games Cast breakdown, analysis of all of that. Um because this is the kind of funny games cast where each and every weekday we get together to talk about the biggest reviews, previews, and topics and video games live on YouTube, Twitch, podcast services around the globe. If you love what we do, please support us with the kind of funny membership. It's the best time of the year to do that because we have so much great Summer Game Fest coverage, so much great Switch 2 launch coverage that you're going to want to get ad free, and you get the daily",
            "start": 49.44
        },
        {
            "text": "the best time of the year to do that because we have so much great Summer Game Fest coverage, so much great Switch 2 launch coverage that you're going to want to get ad free, and you get the daily exclusive Gregway. So get on all that stuff for a chance to be part of this show. Submit your YouTube super chats. If you have predictions or things you want to see at the Xbox Game Showcase this weekend, please let us know so we can get through all of that. Um, little housekeeping for you. We're throwing a Switch 2 launch party this Wednesday, aka tomorrow. Can you believe it, boys? Can you believe it? Tomorrow, we're going to get our hands on the Switch 2. That's incredibly exciting. Uh, Wednesday night going into Thursday morning, tune in as we party all night long. We're going to pick up, unbox, and play our Switch Twos for the very first time. And the part is not going to stop until 10 in the morning when Games Daily starts. And we're just going to keep the day going. Um, so it's going",
            "start": 91.28
        },
        {
            "text": "and play our Switch Twos for the very first time. And the part is not going to stop until 10 in the morning when Games Daily starts. And we're just going to keep the day going. Um, so it's going to be a non-stop Switchathon. Uh, remember we are an 11 person business all about live talk shows. You already had Games Daily about PlayStation State of Play predictions. And then you're having this amazing games cast right now talking about Xbox predictions. But guess what? The fun doesn't stop there. instead of a stream today because there's just news out the wazoo. We're going to do another games cast that is going to be uh Blessing and Andy and whoever else wants to join them talking about the Witcher 4 tech demo that they showed today. That looks Andy, you want to tease it? Um well, all I can I'm sorry, Tim, I can't even think about that right now cuz now I'll just have to take on the celestial pest or whatever that thing is later. Bless. Oh, I mean I can help you out. What's the third",
            "start": 132.32
        },
        {
            "text": "I'm sorry, Tim, I can't even think about that right now cuz now I'll just have to take on the celestial pest or whatever that thing is later. Bless. Oh, I mean I can help you out. What's the third boss called? I forgot what it's called. No, you're close. It's not the celestial pest. This is something pest test something. Remember the pest with John Leguisama? I know you do. I only saw screenshots from this Tim. I haven't watched the thing. Excited watching the fact like all the murmuring, all the sort of buzz around it. It seems like Okay. It seems like another one of those, you know, CD Project, right? We love y'all. We've been tricked before. I I had that exact same thought. First of all, it's called Sentient Pest. Secondly, I did watch like the first like 5 minutes of it and to spoil a part of it, there's a part where they zoom in to the horse and show its muscles. Like it's in like the inside of its leg to show how like detailed the horse muscles move. So, it should be a fun",
            "start": 175.84
        },
        {
            "text": "a part of it, there's a part where they zoom in to the horse and show its muscles. Like it's in like the inside of its leg to show how like detailed the horse muscles move. So, it should be a fun episode. Kevin loved the pest, Greg. I That's who it was. I knew it was one of y'all loved it. Good job, Kevin. Yeah, Sean's a Johnny L man. I don't know that I don't remember anything about the past. Oh, really? I love John Leamo. Yeah, your family in the past are like connected in my mind. There's Latino Latinos and Liquisamo who like go together really well. Like my Yeah, I knew knew a lot of friends growing up who love Luisamo. Uh then if you're a kind of funny member, Snowbike Mike goes big with this month's Patreon exclusive poster made by the incredible Pandam Musk. Uh you can shred the Narn on Patreon before the month ends. You can check out this beautiful poster made by Pandam Musk. Each month he is celebrating one of the members of kind of funny and you get all that on Patreon. And",
            "start": 218.0
        },
        {
            "text": "on Patreon before the month ends. You can check out this beautiful poster made by Pandam Musk. Each month he is celebrating one of the members of kind of funny and you get all that on Patreon. And today's Greg weighs Greg's review of the Raj Ally X so far. Uh which is really exciting on the the heels of what is probably an announcement of the Raj Ally 2. Don't get ahead of yourself. We got plenty we got plenty of things to predict here. We got plenty of things to predict here. Whoa, whoa, whoa. Thank you to our Patreon producers Carl Jacobs, Omega Buster, and Delaney Twining. Today we're brought to you by XRE, but we'll tell you all about that later. Let's get to the topic of the shows. The Xbox Game Showcase 2025 predictions. Let me read a little bit from xbox.com for you. Make some space on your calendar. The Xbox Game Showcase 2025 will be live streamed on Sunday, June 8th at 10:00 a.m. Pacific, which means we will be live around 9:30 a.m. Pacific uh to react to what we're about to",
            "start": 262.4
        },
        {
            "text": "on your calendar. The Xbox Game Showcase 2025 will be live streamed on Sunday, June 8th at 10:00 a.m. Pacific, which means we will be live around 9:30 a.m. Pacific uh to react to what we're about to see. Following in the footsteps of the 2023 Starfield Direct and the 2024 Call of Duty Black Ops 6 Direct, this year we will again have a double feature with the Xbox Game Showcase immediately followed by the Outer Worlds 2 Direct. It all begins with the annual Xbox Game Showcase bringing you a look at upcoming titles from across our first party studios. In addition to incredible new titles from our thirdparty partners across the globe, this year the show will be digital only. Our live stream will bring you everything you need to know about what's next for Xbox, no matter where in the world you're watching. Immediately following that, the Outerorlds 2 Direct. We'll bring you inside the walls of Obsidian Entertainment, revealing new gameplay details, and developer insight straight from the",
            "start": 308.32
        },
        {
            "text": "watching. Immediately following that, the Outerorlds 2 Direct. We'll bring you inside the walls of Obsidian Entertainment, revealing new gameplay details, and developer insight straight from the people making the sequel to the award-winning first-person sci-fi RPG that we just reviewed again. That's right. Check out last Thursday, me, Andy, Stella, Outer Worlds. touching hand. You know what I mean? Oh, thank you. Uh so yeah, check that out. 9:45 Pacific time. That's when we're we're going live with that one on on Sunday because it's a crazy weekend. I said 9:30. I was wrong, everybody. Somewhere around there. You'll be somewhere around there. Uh and then the post show after, of course. So before we get into our predictions, I want to have a top level conversation. Digital only. Do you think that has any effect on the announcements or anything of the showcase? No, I don't either. No, not at all. Yeah, I mean you could was last year's in person. I think all of them had some level of an",
            "start": 350.72
        },
        {
            "text": "that has any effect on the announcements or anything of the showcase? No, I don't either. No, not at all. Yeah, I mean you could was last year's in person. I think all of them had some level of an inerson like they Well, they did the in-person events. They they like showed the they showed the digital thing that Yeah. No, I don't give a [ __ ] about that. You're fine. You're good. Yeah, I'm with you. I feel like it's a cool thing that they did and I I don't really understand why they're not doing it, but return on investment. Maybe live events are hard and expensive. We know this all too well. That's true. Are they really getting out of this? And I think I've seen community members already stepping up and doing a community. I think also possibly we see a similar thing that Sony's done in the past and and other outlets where it's, you know, the green screen presentation thing, but then, you know, introducing the next game would be here's a dev with not a whole lot to say, but it's",
            "start": 399.68
        },
        {
            "text": "in the past and and other outlets where it's, you know, the green screen presentation thing, but then, you know, introducing the next game would be here's a dev with not a whole lot to say, but it's enough to, you know, put a face to the name and make it a little bit more personal, you know. Sure. So then let's do it. Let's get into our predictions. Each one of us will bring five predictions to the desk right now. Andy, one thing I do want to call out is that once you put this set up and you get the green a flowing on kind of funny, you can't keep Paris Lily away. True. As much as you want to, as much as you try to, it's bad. He infiltrates. So, I do have Paris's six predictions. Six predictions from Paris. I love that. I love that. Um, and then Mike is sick, so he sadly can't be here. Yes, you can't keep him away. Just let him go to Disney land and lick everything and lick everything. I started to say world and I stopped myself. Paris points out he's hosting an Xbox community event.",
            "start": 441.92
        },
        {
            "text": "you can't keep him away. Just let him go to Disney land and lick everything and lick everything. I started to say world and I stopped myself. Paris points out he's hosting an Xbox community event. I wasn't sure if that was public because I had gotten emailed about it. So yes, Paris is in fact hosting one you could go to in LA if you're there. Andy Cortez. Hey Tim, I'm going to start with Blessing. Oh, in your face. I hate that cuz I was literally I was about to type in what are some Xbox games last God damn it says we're starting you did your homework I did but I don't like what I wrote there been there take it all back um I have a I have kind of a weird one that I think will throw people for a loop even title out loop it's nothing even title-wise it's nothing IP wise I think that we will get PlayStation mentioned four plus times. So, okay, you will see logos. You will see an Xbox person say come to every like they are not going to make this just play Xboxcentric. Amp it up. Amp it",
            "start": 491.0
        },
        {
            "text": "get PlayStation mentioned four plus times. So, okay, you will see logos. You will see an Xbox person say come to every like they are not going to make this just play Xboxcentric. Amp it up. Amp it up. Shu. Hey, Yoshito be there. Mario's going to walk up. Doug Bowser. I think you're going to see PlayStation being mentioned four plus times. Four. You know what? 4.5 plus times. And then you take over under. Here's my thing. I think logo wise, yes. But like my one thing for you to make this like spicier, will we hear the words PlayStation even once? Cuz I think that's where I'm a little bit more trepidacious. Okay. Well, that that's where I want to like lean back a bit. That's where I want to like, okay, I'm cowering. Homer going back into the bush because now it it well that also just kind of goes against their sort of mantra play anywhere. And we know what they mean by play anywhere and you know maybe when they say play anywhere then like you get a quick little one frame of Jim Ryan or",
            "start": 540.0
        },
        {
            "text": "goes against their sort of mantra play anywhere. And we know what they mean by play anywhere and you know maybe when they say play anywhere then like you get a quick little one frame of Jim Ryan or something like that. But I I don't think I'm going to say yes just to be extra spicy. I'll say yes. All right, Greg, what's yours? The Outer Worlds 2 releases on September 4th, 2025. Oh, [ __ ] I like this. Thank you. Why? Uh, I think I'm trying to I'm very much uh cribbing the homework from Starfield. Remember when they did the Starfield Direct? Obviously, they then put the date on it there, which was September 5th, 6th, 7th, somewhere in there or whatever. So, I'm picking the Tuesday that I think lines up with that to get that out. I also looked at, you know, the release dates, uh, obviously for the rest of the industry. seems like a good enough time to drop in open world RPG to get it out there and get it uh some limelight before the next big thing comes. I like that it's such a specific",
            "start": 600.48
        },
        {
            "text": "the rest of the industry. seems like a good enough time to drop in open world RPG to get it out there and get it uh some limelight before the next big thing comes. I like that it's such a specific date. Thank you. That's good. I wanted to be specific. I I have many specifics here. I give you an extra point. Yeah. If you get that exact though, Yeah. you get an extra point. I like that a lot. Extra point. Yeah. See, I feel like if he gets it wrong at all, you should not get any point. Get zero after one day off. It's a prediction. Well, I mean, I guess yeah, technically. Well, like I I don't know. I just think him try him going the extra mile like that's you deserve a bonus point if you get it exactly. If you don't get it exactly, then you're you get I feel like I need like five more sentences before I'm like when the entirety of the prediction is that Well, the prediction could be that Outer Worlds 2 gets a release date. [Music] Oh, I'm hanging brain here saying September 4th. All",
            "start": 646.96
        },
        {
            "text": "before I'm like when the entirety of the prediction is that Well, the prediction could be that Outer Worlds 2 gets a release date. [Music] Oh, I'm hanging brain here saying September 4th. All right. to fix your prediction. You should say Outer Rolls 2 gets a release date. That release date is the fall specifically September 3rd. Hilarious. I I will stick with September 4th there and let that go. Yeah, there are so many other things I started kicking around. I'm like, \"Oh man, well, how would I put this? Where would I put that?\" See, this is fun cuz I do have a theming for my predictions, at least for a portion of them, because I've now started remixing some of these because I want to get more exciting. But the theming overall for my Xbox predictions is that 2026 is a banger year for Xbox. And so to start off, we're going to start off with Out of Worlds 2 since Greg mentioned it. Out of Worlds 2 impresses at the direct at the Outer Worlds 2 direct. It gets a fall release date, but then",
            "start": 689.44
        },
        {
            "text": "And so to start off, we're going to start off with Out of Worlds 2 since Greg mentioned it. Out of Worlds 2 impresses at the direct at the Outer Worlds 2 direct. It gets a fall release date, but then later this summer it gets delayed to 2026. No, adding to the banger year that 2026 is going to be for They can't do that. They can't delay it to 2026. on I don't you dare out worlds dude it's an IG in first Obsidian delaying a big first person RPG that's coming out in the fall that was different though Avow had no juice they knew they had no juice with Avow they needed to make the juice I I don't think they would do the direct with without it being imminent I agree look at Starfield look at um Call of Duty that's their mo right now yeah I think to to the point I remember the rumors were last year with a vow getting pushed right it strictly because of how crazy everything was, thus giving Obsidian more time to work on Outer Worlds 2. So, it didn't seem as tight a timeline as it actually uh",
            "start": 737.76
        },
        {
            "text": "with a vow getting pushed right it strictly because of how crazy everything was, thus giving Obsidian more time to work on Outer Worlds 2. So, it didn't seem as tight a timeline as it actually uh is Yeah. as it would have appeared. I I can't I'm with I I think I you know, when they said when they put a vow at the beginning of this year, I was like, well, there's no way Out of World 2 is coming this year. And then the doubling down on it and giving this, you know, direct presentation, I'm like, no, I believe now. They can't do it. They can't take it away from me. Well, see, I'm trying to spice up my predictions. I understand. I hear you. What what exactly do you think we get delighted by in this in Outer Worlds 2? Oh, I like that question. Um, have you looked at the IGN coverage? No. Okay. Sadly. So, no. That's good cuz I I think IGN's coverage you go, \"Oh, like I perked up listening to Michael Haim talk about it because I'm already somebody who's I'm all the way into Outer Worlds",
            "start": 785.04
        },
        {
            "text": "Sadly. So, no. That's good cuz I I think IGN's coverage you go, \"Oh, like I perked up listening to Michael Haim talk about it because I'm already somebody who's I'm all the way into Outer Worlds because I [ __ ] loved Outer Worlds one.\" Um, and I'll say one of the things I liked a lot about Outer Worlds one is how much you could how many of like the scenarios you can like solve with permutations. Yeah, permutations like conversation stuff or like you know knowing the engineering stuff or whatever. So like I think maybe more permutations as far as that stuff. I'm sure that's already been covered and so people people in chat are probably going to be like oh they've already announced that. But I'll say that I'm going to say they show us some kind of dialogue sequence and like show us how things can go differently. I'll tell you this way that yes coverage has touched on that but it hasn't been as deep as you think. So I think this is going to be the deep dive of here's what it is. It's",
            "start": 822.48
        },
        {
            "text": "can go differently. I'll tell you this way that yes coverage has touched on that but it hasn't been as deep as you think. So I think this is going to be the deep dive of here's what it is. It's also the idea that like Ha in his the preview I watched, right, didn't even get to play. He went there and saw a bunch of stuff but didn't get to play it. For me, I think the the surprise and delight of it is going to be how good combat is. I think combat's going to look good. I think guns are going to be more crunchy. I think melee is going to be more physical. Even me listening to the stuff, I didn't watch a lot of it cuz I wanted to have that reaction to the direct. It already looks miles better. Obviously, that just comes with time and that comes with engine upgrades. And you know, I I want to say they're using Unreal Engine 5, uh, somebody will correct me on that, but I, as much as I like The Outer Worlds 2, and I think it's like a really fun, good video game, World Outer Worlds one, it",
            "start": 858.16
        },
        {
            "text": "say they're using Unreal Engine 5, uh, somebody will correct me on that, but I, as much as I like The Outer Worlds 2, and I think it's like a really fun, good video game, World Outer Worlds one, it uh, it looks really bad in some moments, and sometimes you go outside, it's like not like I should, this whole place looks like it's just lit. Like there's like they turn shadows off. Like there's a lot of moments like that in the game. And already with what we've seen with with the IGN first um sort of the footage that they provided to them like walking through those interiors look freaking fantastic. I really want more what what I'm hoping to see to kind of go off with the combat is I want to see more like gravity gun type [ __ ] You know, we talked about in the review how I kept on being asked while I was playing it on stream, have you found any uh science weapons? Yeah. And I didn't and I didn't really know how to, but people telling me, \"Oh, that's where you shoot a thing and then it's",
            "start": 893.68
        },
        {
            "text": "while I was playing it on stream, have you found any uh science weapons? Yeah. And I didn't and I didn't really know how to, but people telling me, \"Oh, that's where you shoot a thing and then it's like an anti-grav thing.\" Like, that's the stuff that I want more of from these games. Wacky. Yeah. I want us to just see bodies flying and like telekinesis type powers. You know, them, y'all are out here doubling down on Outer Worlds, too. You're going to triple down. And that's fine. Double fine. He's doing it. He's doing it. He's crazy. Here's the thing. Double Fine announces their new game. But I want to get a little spicier than that cuz I think that's a little boring people named Paris Lily who wrote and says Double Fine's new game announced. Thanks. All right, Paris. Point blank. It's going to happen. It's going to happen. Double Vines game will be here on Sunday. But I want to add a little like extra wowy zowi factor to this. This is based on nothing, but my mind and my mind thinks",
            "start": 941.68
        },
        {
            "text": "to happen. It's going to happen. Double Vines game will be here on Sunday. But I want to add a little like extra wowy zowi factor to this. This is based on nothing, but my mind and my mind thinks about numbers a lot. and thinks about success and thinks about the business of all this. And I think you're getting there that he's tiptoeing. Microsoft is gonna want a successful hit from Double F. I like where you're going. Not just a good game cuz good games aren't good enough these days. Critical acclaim can only do so much. Lie lie. I don't know. I don't know what Greg's doing. I don't know what you're I don't know. I don't know. I don't know. Licensed. You're going to say license jam 100%. Yeah, tell me. I thought he grabbed the back of his neck and tell me how close it back of his neck. I don't know if I want to grab it. I I I I don't know necessarily about licensed. It'll be an existing IP. It'll be a known IP, not a double fine IP. It won't be Brutal Legend 2. It could be Xbox. It",
            "start": 989.04
        },
        {
            "text": "I don't know if I want to grab it. I I I I don't know necessarily about licensed. It'll be an existing IP. It'll be a known IP, not a double fine IP. It won't be Brutal Legend 2. It could be Xbox. It could be Marvel. It could be whatever. I do think though it's more likely it'll be a I do have something from you know a banjo a Spyro or this whatever but I don't think it's necessarily going to be those things. I'm just saying Double F's next game based on an IP that's not a Double Fine IP. I like that. I hadn't thought about this either until I read you know this Milk Toast Paris prediction cuz he's not here. He knows the rules. If he's not in the room he gets dunked on. Uh I like that where you know immediately when you started to jump in there and we went the licensed route or whatever. I agree. It could be anything, you know, video. I just want to clear I went the license route. You went the Cuz you were right there. You were about to say it. I was helping you out. I was helping you",
            "start": 1040.8
        },
        {
            "text": "agree. It could be anything, you know, video. I just want to clear I went the license route. You went the Cuz you were right there. You were about to say it. I was helping you out. I was helping you out. I think, you know, you know what would be a fun one for them to do? I think a fun one for them to do if they did like and this is not my prediction, but I'm tossing there's just spice to keep you excited. You know what I mean? Keep you up, keep you at midnight. You know what I'm saying? I I think them teamed with Marvel for a M Marvel game could be really fun. A Kamala Khan game of some kind. not like, you know, behind the back third person straight up, but like she's so creative with her and big and powers and stuff. I think you could do something really fun. I was way off cuz I thought you were going to say Viva Piñata. Like I was I mean, oh my god. Yes. A Viva Piñata. Yes. That's I mean, you want to talk about a cult classic so many people say they want what Double Fine's take on",
            "start": 1084.48
        },
        {
            "text": "you were going to say Viva Piñata. Like I was I mean, oh my god. Yes. A Viva Piñata. Yes. That's I mean, you want to talk about a cult classic so many people say they want what Double Fine's take on Viva Piñata would be would be fantastic. Do you think Tim that during whatever this reveal is that we get a glimpse at who the main character is? cuz there's or actor cuz there's always, you know, they always kind of have little celebrity cameos or just actual, you know, I think of Elijah Wood with Broken Age. Is it is it going to be one of those level of actors? You know, I'm not saying Jack Black asmus Marvel now we're talking. Come on. I honestly I don't know where a lot of my thoughts are coming from, but I really feel They're not my thoughts. I guess I stay up at night scared. And it was like the stilted way he said it as if he's fighting back. I'm not holy. He controls my body. I just I just And again, maybe Double Fine's doing [ __ ] great and like these games are like successful",
            "start": 1120.0
        },
        {
            "text": "like the stilted way he said it as if he's fighting back. I'm not holy. He controls my body. I just I just And again, maybe Double Fine's doing [ __ ] great and like these games are like successful financially in a way that like is all good. Something just tells me they're not. So, it's like I I just feel like anything that might be a risk they're not going to do. So, I don't think it's going to be a Jack Black, you know what I mean? Like I think that's a little too big at this point. So, something smaller perhaps, but I I don't think that's what they're going to hang their cap on. I think it's going to be more just like, yo, we make good games and this one's going to sell well. How well did Psychonauts 2 sell? Maybe it sold great. I mean, it was critically very successful. Exactly. And I'm not talking about the the quality of the game. Like, we know they can do that. 1.7 million copies by April 1st, 2022. Interesting. And that's sold, not played. Good for them. Yeah. By what date?",
            "start": 1178.08
        },
        {
            "text": "I'm not talking about the the quality of the game. Like, we know they can do that. 1.7 million copies by April 1st, 2022. Interesting. And that's sold, not played. Good for them. Yeah. By what date? April 1st, 2022. So that's like eight eight months, nine months. They got to be like at 2.5, maybe three now. Seven months. That's pretty good. Yeah. Six months. Andy, we back to you. [Music] And here's the thing. Here's the thing. Halo Studios pops up, right? It's their first game being called Halo Studios. No longer 343. They are the Halo Studios brand. And we are going to get get a game that is going to be it's going to be Nathan Fillian's character from ODS from Reach. Oh [ __ ] ODST. ODST. ODST. I think it's going to be like a sort of side campaign off of one of those characters, like a prequel type dealing with ODST. I think they're going to like go away from Chief for just a little bit. It's going to be a short little romp. Don't expect this expansive open world thing. I think it's",
            "start": 1219.2
        },
        {
            "text": "type dealing with ODST. I think they're going to like go away from Chief for just a little bit. It's going to be a short little romp. Don't expect this expansive open world thing. I think it's going to be like, \"Hey, let us prove you. Let us prove to you what we can cook with this project. I don't know what it's going to be called, but it's going to be a Halo game with Nathan Fillian.\" Crazy. You're [ __ ] great. Going back to what I was just saying, they need to just make a Halo game that people love. And you don't do that without the Chief. And I understand even with the Chief, it doesn't mean people are going to love. And that's where we're at. That's where I'm at. Like, you know, Andy, I'm just I'm just like, what? I'm This is your prediction. We're having we have that discussion all the time when it comes to tired of these remakes and new IP or tired of movie remakes and new IP and then when there's a new thing, people don't do it. Anyway, so it's like at what point do you I it",
            "start": 1279.28
        },
        {
            "text": "the time when it comes to tired of these remakes and new IP or tired of movie remakes and new IP and then when there's a new thing, people don't do it. Anyway, so it's like at what point do you I it doesn't right now Halo's in a state that I'm it's always sort of like up and down. Are people angry in the community? Are people happy with where Halo's going? I just feel like this is like their new slate. Infinite gone. How do you how do you just like actually make the most people happy with the product? You just remake the first one, Unreal Engine 5, and it's on every console. I'll add that to my prediction. Tack it on. Nathan Fing in it. Real talk, I think that's way more likely. Yeah. Paris Lily chimes in. Future of Halo is teased. Yeah. What does that mean? Exactly. You know what I mean? Feels like we're going to make more Halo. Shut up, Paris. I mean, real talk, I do I do think that like there's like Paris is on to something of like the there is a high likelihood that if we get",
            "start": 1316.32
        },
        {
            "text": "Feels like we're going to make more Halo. Shut up, Paris. I mean, real talk, I do I do think that like there's like Paris is on to something of like the there is a high likelihood that if we get something from Halo, which I think we will, it is just a actual official announcement that a game is coming in the future. Is there just an announcement not we're not getting like Chief in the poncho? Well, because we already got Chief in in like the picture of him in the Unreal Engine 5, you know what I mean? Like that feels so early that like that game unless it's a remake I don't or a smaller project like Andyy's saying like we're not getting that game any crazy to think that whatever the next Halo thing is going to be next gen like that's going to be for whatever the next thing is. I don't think that's crazy in terms of like what Paris is talking about here. I don't think that's out of the realm possible cuz I I wonder if like it's too early to talk about that unless Xbox I mean we've",
            "start": 1370.64
        },
        {
            "text": "think that's crazy in terms of like what Paris is talking about here. I don't think that's out of the realm possible cuz I I wonder if like it's too early to talk about that unless Xbox I mean we've talked about how maybe Xbox could be trying to get ahead of it right as far as when they launch next gen could we see a new gen Xbox Xbox and I mean next year feels fuels early but in the next two years does that mean you announce a Halo now I mean again I I'm standing by I think that whether it's just Master Chief Collection being ported or Halo 1 remake which I do think is happening in Unreal 5 on every console I think that's that is the next step for Halo to be able to rebuild if they want to or if they they possibly even can. I think that's the bigger question. Can they? I think that I think there's going to be a lot of studios that the reason why I I'm leaning towards these smaller projects is I think a lot of these big ass studios are going to have smaller teams working on smaller",
            "start": 1412.4
        },
        {
            "text": "there's going to be a lot of studios that the reason why I I'm leaning towards these smaller projects is I think a lot of these big ass studios are going to have smaller teams working on smaller things while the big thing is cooking, while the big thing is being made. So whenever that next big project happens, we would have already had something to come out. So it doesn't, you know, like yesterday on the Games cast, uh, us talking about these studios taking seven years to make their next big game because they're so expensive and things take so much time. Having these smaller, more mobile, more mobile teams within your squad to pump out something that can at least get some revenue in and not make people question whether you are existent, you know, whether you exist anymore, you know. Yeah, Gregory. The Xbox Crossro Ally gets a trailer commercial like uh I slurred all that. I haven't been drinking. I swear. The Xbox Cross Rag Ally uh gets a trailer/commercial like the console options",
            "start": 1452.8
        },
        {
            "text": "Gregory. The Xbox Crossro Ally gets a trailer commercial like uh I slurred all that. I haven't been drinking. I swear. The Xbox Cross Rag Ally uh gets a trailer/commercial like the console options one from last year. You remember this? It was a 45se secondond. Hey boom, space black Xbox Series X. Here's the white one and all that jazz, right? They show that again. They come out. You're looking at the rag the rag spinning. It's got the nubs on it like we know from the leaked image, right? It's got the Xbox OS running on it. That's a big deal for everybody that you know blah blah. Uh but more importantly, I want to make this spicier since we know this is happening for all intents and purposes, right? I think they also tease the next gen Xbox here as well. I don't think they put a date on it and say next year or anything like that, but I do think that they are open about similar to how they've been open about this to a degree, but then that they are working on a handheld. Phil's talked",
            "start": 1500.84
        },
        {
            "text": "and say next year or anything like that, but I do think that they are open about similar to how they've been open about this to a degree, but then that they are working on a handheld. Phil's talked about that on a this that the other right I think they get into a little bit here of like we are hard at work on the nextG Xbox and I think they probably confirm that it is going to be what we're talking about what the rumors have been right of it will be an Xbox and it will also dual boot it'll I don't know if they'll mention Steam. I don't know if they'll mention Epic Game Store, but I think they'll make it clear that more than ever, what they're working on is the continuation of their promise that everything's an Xbox and now we want to make the Xbox everything kind of thing. What do you think, Sam? You're not you're nodding. You're you're you're percolating. You're thinking I mean, I like where your head's at. I I I want those answers. I want that conversation to happen. More than",
            "start": 1550.48
        },
        {
            "text": "think, Sam? You're not you're nodding. You're you're you're percolating. You're thinking I mean, I like where your head's at. I I I want those answers. I want that conversation to happen. More than anything, I think uh one of the things I'm most excited for this week in a very exciting week is Xbox OS and what we get from that. Sure. But I'm also just not expecting to get much from it from this showcase. I definitely think that's a blog post. That is a Don't you think that the showcase kicks it off though? This how they do this a lot of times and they do like deep dives and they do whatever. So I could see you get the 45se secondond thing. Kevin, I just dropped in ex assets uh the uh purexbox.com article. I mean to you you show what the handheld looks like, right? Scroll down a bit, Kev. Right. This guy here that we've seen leaked around. I think that's better. Get up there. Corox wipe. Jesus. I know. Uh but you have the nubs on them. You show that. You show the OS on it. And then I",
            "start": 1591.44
        },
        {
            "text": "Right. This guy here that we've seen leaked around. I think that's better. Get up there. Corox wipe. Jesus. I know. Uh but you have the nubs on them. You show that. You show the OS on it. And then I think Yeah. At the same time, a trailer or I'm sorry, the trailer and the blog post go live on the wire that are really detailing what it is and when it's available and what you're doing with it. The thing that I've ever seen in my life is is you bringing up the um the next gen console announcement. I think that does more harm than good. Yeah. Yeah. There's too much ammunition to everything. Yeah. I think it just pisses people off. Like I don't think there's any benefit to that for like what there would be especially in one of these showcases that not just traditionally like I don't think ever has focused on ecosystemy stuff like this. You know, I understand but I think ecosystem for Xbox is more important than ever. when we talk about everything as an Xbox and we talk about the app and we",
            "start": 1633.68
        },
        {
            "text": "has focused on ecosystemy stuff like this. You know, I understand but I think ecosystem for Xbox is more important than ever. when we talk about everything as an Xbox and we talk about the app and we talk about when I feel like what's more important than ever is that their games are selling. Sure. You know what I mean? Like actually selling I just think it's a good way especially if you're talking about the OS you know the Xbox whatever handheld OS saying Paris his first prediction on his list was new Xbox experience for Windows that scales to handhelds and cloud devices. So wrapped right in here with what I'm talking about with what the rag ally would be cuz I think it's going to be this machine that runs this OS that I think is going to be available for your Steam Deck, for your existing Rag Ally, etc., etc., etc. Like I think it I think when they make this move and they talk about this, they need to talk about it. And I think part of the conversation is this is the evolution and",
            "start": 1674.0
        },
        {
            "text": "Rag Ally, etc., etc., etc. Like I think it I think when they make this move and they talk about this, they need to talk about it. And I think part of the conversation is this is the evolution and proof of our plan. But that doesn't mean we're abandoning the Xbox. In fact, we're making the next Xbox right now. when we're making it so it's your traditional Xbox experience, but taking what that is and bringing in PC gaming at large. I'm so hopeful, man. I I really I they need to fix the Windows gaming side of things on handhelds. And I think that I don't know why I believe in them so much, but I do with this. I think that the Xbox OS is going to solve these problems. I think you believe in them because seems so early. I can't believe we're here. I I feel like you believe in them on this one as I do too for something we don't know but because they've seen the success of all this stuff and again now they're they are everywhere like the cloud gaming is everywhere the app is everywhere",
            "start": 1710.32
        },
        {
            "text": "one as I do too for something we don't know but because they've seen the success of all this stuff and again now they're they are everywhere like the cloud gaming is everywhere the app is everywhere everything is a [ __ ] Xbox more than ever they need to bring over what Microsoft and Xbox is good at and that's you know getting you into this ecosystem and making you feel welcome and natural and having it be that it's pulling everything it is showing my Steam games and my Epic games and whatever but it's giving me a not just desk desktop icon Plus, Blade shows up. Sick. It gets a new trailer. It's a gameplay trailer. It's first person. It's more detective than you might expect. I would say it's doing for Blade what Machine Games did for Indiana Jones where you're hunting down I mean, you're doing the hunting down zombies, right? But it is more figuring out like vampires or vampires. Sorry, I said zombies, but yeah, you're hunting down vampires and like it is more so like following",
            "start": 1753.36
        },
        {
            "text": "doing the hunting down zombies, right? But it is more figuring out like vampires or vampires. Sorry, I said zombies, but yeah, you're hunting down vampires and like it is more so like following trails like you know actually like hunting these [ __ ] uh uh vampires. Blade colon redfall. Exactly. Well, speaking of which, the art style is very arcane. Uh but I'll say it's fitting for Blade. Uh the three words I use are dark, cool, and bloody. Um Blade, the character, is voiced by Tommy Earl Jenkins. Oh [ __ ] And it's dated for Tommy Earl Jenkins. Death Stranding Die Hardman. It's dated for 2026. I like this bless. This is a fun one. That's the full lot of stuff to think about there. That would be some fantastic gameplay. I'm 50/50 on Blade showing up here. I think it's time. Definitely could. I mean, it's time. I just worry. Is it actually Are we there? I want this to happen really badly. Also, I take back the first person part. They already confirmed. Yeah, they did. I was I was",
            "start": 1800.24
        },
        {
            "text": "could. I mean, it's time. I just worry. Is it actually Are we there? I want this to happen really badly. Also, I take back the first person part. They already confirmed. Yeah, they did. I was I was googling it. They switch like you're trying though. Yeah, actually they switched it up. They It's going to be like It's going to be like a vow. First and third person. They're adding first. Timothy. Oh man, he's thinking Expedition 33. Last year it was announced at the showcase. Now it's a mega hit. Xbox is going to want to continue that relationship, partnership, association to some extent. It does feel a little early though to announce anything to announce DLC or something like that. You know what I mean, Andy? And the creator did say that there's no DLC planned. [ __ ] up at the time. Yeah. You know what I mean? Give me Expedition 60, the DLC. So, what I'm saying is I think we will get the announcement of DLC, but it is going to be such a vague just we're doing it. We do it, you know,",
            "start": 1849.76
        },
        {
            "text": "You know what I mean? Give me Expedition 60, the DLC. So, what I'm saying is I think we will get the announcement of DLC, but it is going to be such a vague just we're doing it. We do it, you know, it's just a confirmation. Something is happening. Something something new is coming to Expedition 33. We DLC, that's how they say it. Yes. Yes. Yes. No, just two. Just two yeses. Anybody anybody of note announcing it? An Xbox head or is it somebody from I think it'll be from a message from Sandfall. Okay. Message from Sandfall. Is it a big group of all of them in front of a camera? Perhaps. Okay. I like Are they speaking in French but with English subtitles? Ah, just a little bit. A little bit of both. I don't buy it. Yeah, I'd like to. I just don't think that they whipped it up fast enough to get to this point and even then to confirm like, hey, we're working on it. Feels soft for Yeah, it does. It'd be cool to have some DLC, a new hat, a new beret, too many hats in that game. Green, you I",
            "start": 1906.24
        },
        {
            "text": "to this point and even then to confirm like, hey, we're working on it. Feels soft for Yeah, it does. It'd be cool to have some DLC, a new hat, a new beret, too many hats in that game. Green, you I don't know. Too many hats in because I do think the next big announcement for that game that needs to happen is a Switch 2 port. So I I almost imagine that would happen before a DLC because they're going to sell so many goddamn units on that thing. Oh yeah, I might replay it on the Switch, too. Andy Cortez, I think that we get a real big because Outer Worlds is getting the big treatment. Outer Worlds 2 is getting the big sort of deep dive treatment. I think we get the most of a deep dive in this presentation is going to be for State of Decay 3. Yeah. Damn it. And let's [ __ ] go. And it will be crossplay everywhere. What the [ __ ] Everywhere. They're going to show some like it's going to be the I don't know lengthwise if I say it's going to be the longest part of just the standard showcase,",
            "start": 1960.8
        },
        {
            "text": "everywhere. What the [ __ ] Everywhere. They're going to show some like it's going to be the I don't know lengthwise if I say it's going to be the longest part of just the standard showcase, but they're going to show off the most because it's like we really have to show off that this thing is real and it's happening and um I I'm not confident enough to put a date. Ah, see I I got my mind's on there that extended gameplay for State of Decay 3 and I said ends 2026. I got bullish for a second and I went and I was like October 14th. I'm like, \"No, no, we're not there yet, sadly.\" But I mean, it's just crazy. State of D2 was 2018 or Yeah. Like it was it was a good while ago. Yeah. Yeah. And this one's been through a lot to get to where it is, but last year they did have that nice uh presentation, that trailer that led into some gameplay. I think this is the year. Yeah. You show it, you do it. And I imagine early next year, 2026 is when we see that we're actually playing it. But I love that",
            "start": 2017.76
        },
        {
            "text": "that trailer that led into some gameplay. I think this is the year. Yeah. You show it, you do it. And I imagine early next year, 2026 is when we see that we're actually playing it. But I love that crossplay everywhere. Everywhere. A lot more. I would say you we see a lot more not just combat but survival type things when it comes to like but but I mean like leaning so heavily into more of the survival side of things. I think there's such a gulf in what we think of. So you're talking like bringing away like more rust mechanics and things like that. Yeah. Like adding that into the formula. not straying away from what makes State of Aay what it is, but also I always just think back to Blizzard cancelling their big um survival game and how how stoked a lot of people were to go, man, it's going to be really cool to see what a big AAA studio can do with this genre cuz it's always a studio of seven people working on a early access beta that pops up on Steam and maybe it never really goes",
            "start": 2061.36
        },
        {
            "text": "to be really cool to see what a big AAA studio can do with this genre cuz it's always a studio of seven people working on a early access beta that pops up on Steam and maybe it never really goes anywhere or becomes anything. Yeah. But to be able to put a genre like this on this big of a stage, I think would be really cool. Yeah, that'd be awesome. I would really like that. It's also just me really rooting for it cuz I I'm It's something I want to get into. I'll get into it with you. Thank you. Greg be the Division 2 DLC first. I know. Well, you're playing on PC. We got to do the whole thing. You can play on PC. Well, it's on Game Pass, too. We can just both start fresh and jump right in. Go there. Okay. I mean, I don't care. We just figure it out. Um, I'm not State of Decay was on here. Of course, I'm not keeping it. Don't worry about it. Instead, we'll go to Starfields latest DLC/update. You okay, Andy? [ __ ] ice cubes. They'll get you, man. They'll [ __ ] get you, dude. uh it's",
            "start": 2111.36
        },
        {
            "text": "Of course, I'm not keeping it. Don't worry about it. Instead, we'll go to Starfields latest DLC/update. You okay, Andy? [ __ ] ice cubes. They'll get you, man. They'll [ __ ] get you, dude. uh it's latest DLC/update and the PlayStation 5 and Nintendo Switch 2 versions are announced and they're show they show the thing and it's just a trailer. It's really quick. We're not spending a lot of time here and it's uh winter. I don't I don't know if the trailer will say winter. I think the Xbox Wire post might say winter in there or hint at that end of the year winter time frame. Maybe even early next year somewhere in there. I'm saying winter. You can interpret how you want to. All right. blessing [Laughter] August. But yeah, I don't think it gets a lot of stage. I don't think the DLC is big. Like I I don't know. I don't I don't think we're getting another Shattered Space as much as I want that. I just don't think that moved the needle. And I think they're probably all heads down or want to",
            "start": 2155.04
        },
        {
            "text": "I I don't know. I don't I don't think we're getting another Shattered Space as much as I want that. I just don't think that moved the needle. And I think they're probably all heads down or want to be all heads down on Elder Scrolls 6. So I think there is an update here that is the final Starfield whatever. That way they can say here's the PlayStation 5 and Switch copies that ship and we're not doing anything beyond creations. I buy that. I buy it, too. Thank you. Thank you. Do you buy it? Sure. I heard a lot I heard a lot about this mod that people are really into. Oh, yeah. I talked I talked at length about it. Homie Washurn is like creating ship fleets and things like that. Exactly. Yeah. Yeah. Give it a shot. Bless. Remember when I when you raided me the other day on Twitch and I was streaming the Outer Worlds to or the Outer Worlds and then somebody randomly in chat popped up and said, \"Andy, why don't like why don't you so you're what? you're not into Starfield. Oh, yeah. And it",
            "start": 2207.04
        },
        {
            "text": "the Outer Worlds to or the Outer Worlds and then somebody randomly in chat popped up and said, \"Andy, why don't like why don't you so you're what? you're not into Starfield. Oh, yeah. And it was just a random person. A random person and I was like I didn't I'd never seen them in chat, but I was also like I don't what I I haven't mentioned that at all yet. And then Blessing immediately popped in with like, yeah, Andy, why don't you [ __ ] with Outer Worlds? And it was such a weird sort of thing thrown at me, but I I've loved Starfield a lot. Like I played a lot of it. I was not happy with how a lot of the missions went, but it's always something I want to go back to because I I love that sort of fantasy of this is my ship. I made my moonlight greats sword like the the soul's weapon and it was I just I love that create that creativity part of it. I did a Greg on the latest update from the creation suite to get into, right? Um, but yeah, you'd especially love this one as much as you",
            "start": 2247.92
        },
        {
            "text": "it was I just I love that create that creativity part of it. I did a Greg on the latest update from the creation suite to get into, right? Um, but yeah, you'd especially love this one as much as you [ __ ] around with ships because the idea is that you're now taking your NPC, your companion characters and assigning them to the ships you have to make the fleet. And then the idea is that you have to go off on these missions on the ground, right, where you're attacking these bases. And now again, then remember everybody, I know I'm I rant and rave. I'm actually put over the Watchtower update because it's made by the Fallout 4 mod people, like the people who are the most famous for community mods. So, this isn't a Bethesda thing. You land, you go down with your ship and your companion or whoever, right? They have now these mechs that the creation people bu You have to then call in air strikes from your fleet in the sky by throwing the grenade, lighting them up. Then the air Yeah, exactly.",
            "start": 2291.52
        },
        {
            "text": "right? They have now these mechs that the creation people bu You have to then call in air strikes from your fleet in the sky by throwing the grenade, lighting them up. Then the air Yeah, exactly. that blow up those guys so you can infiltrate and do it. I would make a little fighter ship uh kind of reddish maroon looking. Call it the reduvia, the dagger ring. I would just make every ship out like that. Oh man, that would be cool. We are exactly halfway through our Xbox predictions, everyone. So, here's a word from our sponsors. This episode's brought to you by XRE. Y'all know that a few months ago, my life changed forever when I brought a pair of XRE1 AR glasses on a long flight to New York. I legit could not believe how easy it is to use and high quality my experience was playing games, watching movies, TV shows on the plane without just too much extra stuff around me or especially not a giant goofy headset around my head. No joke, this is my favorite new tech product in years and it",
            "start": 2332.0
        },
        {
            "text": "movies, TV shows on the plane without just too much extra stuff around me or especially not a giant goofy headset around my head. No joke, this is my favorite new tech product in years and it has earned a permanent spot in my travel bag. It is only hard to believe that it works as well as I'm saying until you try XR1 AR glasses for yourself and then you will see that the future is now. The tech is here. Connect XReal 1 glasses to wherever you are playing. Whether it's a handheld console, a PC, phone, home console. You just get a massive 150in virtual screen anywhere, anytime for any game. Gaming on the go like a long haul flight? You need the XR1. Neck starting to hurt from staring down at your handheld? We've all been there. You need an XR 1. A screen as big as your wall. Instant plugandplay with all of your devices via USBC. Built-in audio with sound by Bose anchoring your screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full HD. These are what make XR1 a",
            "start": 2378.16
        },
        {
            "text": "with all of your devices via USBC. Built-in audio with sound by Bose anchoring your screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full HD. These are what make XR1 a musthave. And we hear XR1 Pro is coming soon with an even bigger virtual screen. Hit our link below to get your XR glasses today. There's nothing better than when a sponsor of Kind of Funny is something that we are legitimately obsessed with, and that is exactly the case here with XRE. You're going to hear me talk about these forever. Go to xreal.com for more on this thing. Blessing. You got to go first. You got to go first, dude. You got to go first. I got to order this hand roll. Bless Jordan some sushi. It's a big day for me. I got three things back. I got it, dude. So, I was also going to predict State of Three or State of Decay 3. Um, and so I'm not going to do that now. Oh, cuz Andy took that. And that was going to fit within my theme because of course we could go half and half on it.",
            "start": 2427.76
        },
        {
            "text": "State of Three or State of Decay 3. Um, and so I'm not going to do that now. Oh, cuz Andy took that. And that was going to fit within my theme because of course we could go half and half on it. All of my predictions, I mean, do you want half this hand roll I just ordered? Um, you know, my predictions have had the theme of 2026 being a banger year for Xbox. So, I'm gonna take a vacation from that theme instead. This is a tough one cuz I actually don't expect this to happen, but I'm going to predict predicted anyway to get it out of there. Right. Fallout 3 remaster. It's happening. We know it's happening. When there's smokes, there's fires. Smokes and fires. It's going to be announced and it's be it's going to be called Fallout 3 Remaster, but when we look at it, we're going to go, \"That's a remake.\" Oh, Jesus [ __ ] Christ. Can we not do this again? Continuing the trend of nobody knowing the difference between a remaster and a remake. Um, if all the 3D assets are remade, it's a remake.",
            "start": 2478.24
        },
        {
            "text": "remake.\" Oh, Jesus [ __ ] Christ. Can we not do this again? Continuing the trend of nobody knowing the difference between a remaster and a remake. Um, if all the 3D assets are remade, it's a remake. I'm going to say that it's out this fall. Wow. Yeah, that would be such an insane remake year for Xbox. Not that that's a problem, but we got Oblivion. We're getting Gears of War. That's the thing is I say it even though like the reason why I say out this fall is because it's been rumored for so long and it feels like they've been working on it forever. It at the same time doesn't make sense cuz like would you drop it at the same time as you're dropping Outer Worlds 2? But also just this this first half of the year they dropped Avoued in Oblivion and Expedition 33 the same day. I had on here too that they teased the Fallout 3 remaster. My reasoning being of course this is different than Oblivion, right? Oblivion of course was the worst kept secret and then they shadow dropped it the best",
            "start": 2524.88
        },
        {
            "text": "too that they teased the Fallout 3 remaster. My reasoning being of course this is different than Oblivion, right? Oblivion of course was the worst kept secret and then they shadow dropped it the best they could. Right. I think here this is a remaster and I do think it's a remaster again. I think it's like in the same way that Oblivion is. Exactly. Exactly. It's Unreal 5 running on the Fallout 3 thing so it all looks beautiful and yada yada yada. Mhm. But I think what's different here is you are trying to hype the people who love the Fallout TV show. When the Fallout TV show hit, everybody was caught off guard and everybody went to play Fallout and there was no new Fallout. So that meant Fallout 4 spiked through the roof and New Vegas was suddenly super popular again. Even 76 got this huge breath of life, right? I think now coming in they want to have something ready for those people. And where I'm at with it is I don't think you put a date on it, but I do think it hits around the show",
            "start": 2568.48
        },
        {
            "text": "breath of life, right? I think now coming in they want to have something ready for those people. And where I'm at with it is I don't think you put a date on it, but I do think it hits around the show and season 2 premieres in December. Mhm. So, I don't know if you premiere it at the beginning of season 2, at the end of season 2, somewhere in the middle of season 2, but I do think the idea here is you watch the show. Holy [ __ ] I can't believe how good Fallout is. I want to play Fallout again. And this is there for you. So, I guess it is then premiere. I'm going to adjust Yeah. my fall thing into a December thing. I'm with you. I'm right there with Bless everybody. We did it everybody. And I also love the idea that them going, man, we saw so many people hop into Fallout when that when the TV show came out, but that game is only 20 bucks. Imagine if we had a $50 title. Yeah. Yeah. No, no. This is here to make money. Tim Gettys. Tim, he's making a face right now. I'm making a face cuz",
            "start": 2611.44
        },
        {
            "text": "TV show came out, but that game is only 20 bucks. Imagine if we had a $50 title. Yeah. Yeah. No, no. This is here to make money. Tim Gettys. Tim, he's making a face right now. I'm making a face cuz you know what? He licked his lips. I have to say this. I have to. Somebody has to. every prediction season at kind of funny/theorld. And I don't think you all see what I'm about. Do you have any Do you have thoughts of what I'm about to say, Greg? Yeah. Hollow Night. No, the sword. Ever Wild. It's a different sword. Different sword. Super Monkey Ball. It's black. And all of a sudden, you hear [Music] three green dot splitter cell remake actually shown. Everyone's saying it looks so good. Oh my god. And there's no Ubisoft Showcase for them to announce a game that's probably not anywhere close. Xbox. Damn, that's not bad, dude. That's really not bad at all. Again, there's been a lot of I've been seeing Sam Fischer on my feeds a lot recently. Why is it just because it's the season we all have",
            "start": 2653.52
        },
        {
            "text": "Damn, that's not bad, dude. That's really not bad at all. Again, there's been a lot of I've been seeing Sam Fischer on my feeds a lot recently. Why is it just because it's the season we all have to have this conversation? Probably. I mean, didn't Ubisoft tweet out the Sam Fischer thing? I think they did. It's an image of Sam Fisher. Look at this man. Yeah. Okay. We'll look at him. But Tim will look at him. We'll do it. Tim, I'm sorry. So yeah, then Ubisoft not having a showcase. I feel like they're most likelywhere here and and you know, maybe I'm just a [ __ ] old ass man and I am, but I'll always associate Splinter Cell on Xbox. So yeah, I'm going to drop the tweet in assets from Ubisoft. It is kind of a bizarre tweet from Ubisoft. This looks like almost Kevin. Yeah, the asset is now in assets. This almost looks like a Fortnite Sam Fischer from the tweet. Not what we're seeing on screen from Kevin right now. the tweet the tweet he's about to pull up I I assumed this is from some",
            "start": 2706.0
        },
        {
            "text": "in assets. This almost looks like a Fortnite Sam Fischer from the tweet. Not what we're seeing on screen from Kevin right now. the tweet the tweet he's about to pull up I I assumed this is from some older Splinter Cell thing. Yeah. Yeah. Yeah. Now again coming to Fortnite again this version of it I want I want to add some fun to this because I feel like that's it's spicy. That's if that happens I'm sure everyone's going to be excited but like that's not enough. It won't just be the three green lights. I think that we will see this game. We will see the game. Wow. Otherwise don't [ __ ] do it. Here's here. Don't do it. Let me tack on to it then. Let me tack on to it. back away. You you've noticed a sort of a running theme with all the Hollywood. It's always an actor. There's always a somebody. Mhm. I would love and I hope that in this prediction, what we see on screen would be similar to when you beat the the uh freaking PT demo and that sort of zoom up and you're like, \"Holy [ __ ] is",
            "start": 2753.76
        },
        {
            "text": "Mhm. I would love and I hope that in this prediction, what we see on screen would be similar to when you beat the the uh freaking PT demo and that sort of zoom up and you're like, \"Holy [ __ ] is Silent Hill what's going on here?\" Oh, I guess we didn't know that. But then the camera moves up and turns around and it's Norman Reedus and you're like, \"Whoa, what the fuck?\" I expect that to happen here with whoever Sam Fischer is. And I think it's going to be John Ham. Wow. Just like 3D rendered. You're like, \"What the [ __ ] is John Ham?\" Hell yeah. Missou's own John Ham. Yeah, dude. I love that we're just casting everybody. It's the I love it. Are they going to Yeah, I'm not going to say that. Remember when Kefir Southern? I'm going to say I'm going to stand as Hog. Whoa. They got to scan the hog. Do we have the technology? You need the bulge tech. You need Oh my. You're right. You need the bulge tech. He's wearing a tight little suit. Damn fisher. I'm scrolling through Ubisoft's",
            "start": 2794.8
        },
        {
            "text": "scan the hog. Do we have the technology? You need the bulge tech. You need Oh my. You're right. You need the bulge tech. He's wearing a tight little suit. Damn fisher. I'm scrolling through Ubisoft's Twitter just to like get a vibe of how do they be tweeting? And it makes the the the tweet weirder for the Splinter Cell thing. It's like when someone tweets you a questionable thing, you're like, \"All right, what side are you lying on?\" And I go to their profile. I'm like, \"Oh man.\" Because I don't want people to be caught up in the pool. cuz I think Kevin brought up like zoomed in on the or not zoomed in but like brought up the image and I think people are like oh he looks weird or whatever and I don't want to be caught up on like the quality of the image cuz it's very obviously just a screenshot of an old Sam Sam Fisher thing. I'm more so caught up in just the text of the emoji of like they do two eyes and then like a mouth between it kind of memey kind of thing and then hashtag",
            "start": 2845.12
        },
        {
            "text": "a screenshot of an old Sam Sam Fisher thing. I'm more so caught up in just the text of the emoji of like they do two eyes and then like a mouth between it kind of memey kind of thing and then hashtag splinterell that's not within the tweeting philosophy of how Ubisoft does things on their X.com. somebody hacking this like it's very much like a oh look at this and it's like why why are you telling us to look at this right look at this man it's happening I was I'm with him and Cortez we finally see Ever again and it is starring No I'm kid Zena it is Zenaia we finally see Ever again and for me If I were to guess, if I were to just sort of put myself in the executive, if you were to predict on say a kind of funny games, if I was to predict what was happening behind the scenes that this project has seen is like something that just has to come out and we got to like just move on to something, you know, like we've worked we've stewed too long on this. I think it will disappoint. I think",
            "start": 2877.68
        },
        {
            "text": "has seen is like something that just has to come out and we got to like just move on to something, you know, like we've worked we've stewed too long on this. I think it will disappoint. I think we'll be excited that it pops up, but ultimately by the game play, it's going to be one of those by the end of our predictions where we or by the end of the games cast where we're like, yeah, just not a not really a whole lot shown there. We don't really get what it is or what they're going for. I think it's going to be very survivalish co-op, massive multiplayer, kind of like a Destiny shared world shooter type deal, but with whatever they're doing in this world of Ever Wild and we're going to be really disappointed with it. Wow. And I'm sad. Real quick, Paris did have Ever Wild gameplay is one of his predictions. I hope if we see it again, if it's like if it's what Andy's talking about where it's like I just get this thing out situation. I just want them to cancel it so bad and just have rare",
            "start": 2932.68
        },
        {
            "text": "his predictions. I hope if we see it again, if it's like if it's what Andy's talking about where it's like I just get this thing out situation. I just want them to cancel it so bad and just have rare work on something that we care about. Cuz like Rear is one of those studios where I'm like they mean so much to the industry and they have like I mean they put out CFS, right? Like they obviously have something there. Yeah. Put them on something that matters. What what what I think they're going to be going for is going to be Oh gosh, what's the what was the Pokemon ripoff? Power World. Power World. I think it's going to be something along the lines of Power World where in that first trailer we saw one of the creatures helping the main characters and I think it's going to be a lot about like having a couple of different creature friends to run around the world with you and their creature friends and you're taking on bosses or you're solving puzzles. Um, but I think it'll ultimately be",
            "start": 2977.2
        },
        {
            "text": "having a couple of different creature friends to run around the world with you and their creature friends and you're taking on bosses or you're solving puzzles. Um, but I think it'll ultimately be like, h, man, that's what it was. But I also don't hold that hope. Yeah, me neither. I'm I'm more leaning towards the game's done. Cancelled. Oh, yeah. You'd think so, right? Especially as we've I mean, we joke, but the dominoes are falling. Xbox is doing really well right now. Great games. It seems like really solid games. So, like to put one out there that's just like me. Yeah. And but I I'll also say though, like to Andy's point, like I feel like we had that reaction for the most part to Sea of Thieves as well. um of looking at and just being like, \"Sure, we don't want Rare doing this.\" And then they turned it around and made it work and now it's majorly uh successful for them. So, they could do that, but I'm not betting on that. Greg, what's your next prediction? Indiana Jones and the",
            "start": 3015.68
        },
        {
            "text": "then they turned it around and made it work and now it's majorly uh successful for them. So, they could do that, but I'm not betting on that. Greg, what's your next prediction? Indiana Jones and the Great Circle: The Order of the Giants gets a trailer and a 2025 date. I don't think they I don't think they go into specifics. I could be swayed that they do this, but I I get it gets weird for me where I feel like with these games, Xbox is pretty great about DLC's and that's such a vague thing to [ __ ] say, but like I feel like it would make sense to time it out kind of with Indiana Jones's uh anniversary, so December, but that feels too late for me in terms of it. So, but then it's like if I'm predicting Outer Worlds too for September, I'm a little wishy-washy on where I want to put this. So, I'm just saying they say 25. Okay, Andy, I'd like to tack on to my previous tack away. No, it's my time now. Tack into mine. Talk to me. I guess we I did the same thing yesterday on the Games Cast",
            "start": 3057.6
        },
        {
            "text": "I'm just saying they say 25. Okay, Andy, I'd like to tack on to my previous tack away. No, it's my time now. Tack into mine. Talk to me. I guess we I did the same thing yesterday on the Games Cast where after the fact I had a little little kind of funny wrong. Um this was a interview from uh Phil Spencer. This is this article is from February 17th day after my birthday of this year. And Phil Spencer was talking about the various studios and said State of the Decay is just one of the franchises I love back from the original one. So that stays on the board. I do think that the work Double Fine's doing and how Tim Schaefer kind of solicits feedback from the team. And the other one I'll say because I was recently out of out at Rare, it's nice to see the team with Ever Wild and the progress that they're making. That is him volunteering info. Yeah. I think usually, you know, things are [ __ ] whenever Mum's the word. Yeah. And that gives me more hope. I'm with you now. Luckily, Phil's never",
            "start": 3100.72
        },
        {
            "text": "they're making. That is him volunteering info. Yeah. I think usually, you know, things are [ __ ] whenever Mum's the word. Yeah. And that gives me more hope. I'm with you now. Luckily, Phil's never gone back on his word. If there was a camera over there. Oh god. That it's one of them good Greg faces that is not being seen. Right. Plus, what's your uh fourth prediction? I'm abandoning the 2026 thing. I want to get more. Yeah, cuz the more I think about it, the more I'm like, uh, the far out predictions are more exciting. And so, I'm going to do one that would excite me a lot, which would be uh coming off of Machine Games, uh, Wolfenstein 3 finally gets announced from Machine Games. Uh, we don't see much. which is just a short cinematic with the logo. The world wants it. Everybody wants it. Everybody wants Wolf so bad. People want it so bad. I want it. You've never played a first-p person campaign in your life. All right. The people who have won it. Yeah. What do you think of Titanfall",
            "start": 3141.28
        },
        {
            "text": "Everybody wants Wolf so bad. People want it so bad. I want it. You've never played a first-p person campaign in your life. All right. The people who have won it. Yeah. What do you think of Titanfall 2's campaign? Man, I had such a overblown. It was the multiplayer. Exactly. I had such a banger joke yesterday on the stream. We need to clip that out when uh somebody was like, \"Andy, are you going to play the Hell is Us demo when we were playing um Elden Ring on the stream yesterday?\" And I was like, \"Oh, [ __ ] yeah.\" Like it's something that I was always stoked for and now it's Greg's most anticipated. I was like the game is cooked then. Like this game's going to suck. This game's going to be six and a half out of 10. Oh man. To me, you know, it's just like that point in the predictions where we've said so many things already and there are the the games that are like, I'm sure we got to talk about Gears. I'm sure we got to talk about Forza, but I don't want to do that right now. I",
            "start": 3190.16
        },
        {
            "text": "where we've said so many things already and there are the the games that are like, I'm sure we got to talk about Gears. I'm sure we got to talk about Forza, but I don't want to do that right now. I don't want to do that. Um, what do I want to do? [ __ ] it. More spice. And this is one of them ones. I'm saying it because if it does happen, it's going to change the world. Bless. I think it's very unlikely it happens at this showcase. I think it'll happen somewhere else if it ever does. But that's not the spirit of this. I'm sticking to it. I'm wasting one of my spots on something that bless Lock [ __ ] in. Rare replay. with Donkey Kong 64 coming to the Nintendo Switch 2, baby. I don't think it's time. Maybe that's a later down the line thing, but I do think we will see that at eventually a rare replay with rare Nintendo games on the Switch, too. Don Countries 1 through 3, BK64. Mhm. With Dinosaur Planet. Mhm. That was that wasn't in Rare Replay, right? No, it was not. Dinosaur Planet",
            "start": 3232.8
        },
        {
            "text": "a rare replay with rare Nintendo games on the Switch, too. Don Countries 1 through 3, BK64. Mhm. With Dinosaur Planet. Mhm. That was that wasn't in Rare Replay, right? No, it was not. Dinosaur Planet never even officially released. What What am I thinking of? I'm thinking of Star Fox Adventures. Yes. which was Dinosaur Planet. Yes, that one. Put it in there. Yeah, crazy dream [ __ ] But like that can't happen. The thing I mean, I think it's just a little too early cuz I firmly I'm standing on the dev kit theory of the Switch 2 and it seems like Xbox either didn't have the dev kits or just was like not prepared because they're still dealing with a lot of so many different things at once. But, um, we're going to clearly get a slate of Xbox games coming to Switch, too. And Microsoft and Nintendo have had a healthy relationship in the past. Uh, they made Banjo happen in Smash Brothers. And since then, I do feel like there's going to be a bit more actual love given to the Nintendo side of",
            "start": 3281.36
        },
        {
            "text": "have had a healthy relationship in the past. Uh, they made Banjo happen in Smash Brothers. And since then, I do feel like there's going to be a bit more actual love given to the Nintendo side of things. I just don't know when that's I mean, Switch Online has had quite a few Xbox owned IPs now. So, makes a lot of sense. Maybe not for now, but like makes sense in the future. I'm just throwing it out there because they might get spicy. And it's weird that I thought for a while there we were going to have so much more Xbox and Nintendo love for those earlier type of entanglements and then Sony just like releasing Horizon Lego on there. I was like, \"Yeah, god damn.\" Like I really thought Xbox this was Xbox moment to kind of make this relationship stronger. Then Diddy Kong Racing, dude. Oh my gosh. Real quick, we have Michael in chat saying, \"Didn't Tim forget this is an Xbox show, not Nintendo show?\" And then uh Commtock says, \"Nintendo stuff's announced during Nintendo things.\" Yes. And I",
            "start": 3328.0
        },
        {
            "text": "Real quick, we have Michael in chat saying, \"Didn't Tim forget this is an Xbox show, not Nintendo show?\" And then uh Commtock says, \"Nintendo stuff's announced during Nintendo things.\" Yes. And I I absolutely agree with you that Thank you, Kevin. I do think that Nintendo uh not only tends to, but like almost exclusively controls their own stuff and only talks about their stuff there. But remember when Star Fox showed up at a Ubisoft press conference, things happen. Before you pivot back to Andy, I do want to give you one of Paris's here. Okay. Uh Clockwork Revolution gameplay. I don't even remember what the [ __ ] Clockwork Revolution is. Yeah. Can I see whatever footage we have? Is that the single game clock exile I believe? Yeah, kind of like Bioshock vibes. Yeah, like Bioshock Infinite. Yeah. Finding a lot of automatons. Yeah. Game looked really cool. Yeah, it's a gear game. Picking up. Oh, a lot of gears going. A lot of gears. I thought you meant like purple and blue and rarity",
            "start": 3369.68
        },
        {
            "text": "Yeah. Finding a lot of automatons. Yeah. Game looked really cool. Yeah, it's a gear game. Picking up. Oh, a lot of gears going. A lot of gears. I thought you meant like purple and blue and rarity picking up. No, no, no. Okay. Andy Cortez, what's your final prediction? All right. It's kind of a bummer. We don't see any Fable 4 and that's because this is a I get extra points if this happens later on in the year. So, this has to be like put into effect retroactively. Sure. Because it becomes the after Xbox Game Showcase showcase next year. Next year. Okay. Before it comes out. I agree with that for sure. Really good. that becomes that becomes the next big thing. But we don't even get a we maybe see it in a sizzle room of like and we're the the teams are so excited for what we're working on and and it's just kind of you get a glimpse of it, but it's maybe show footage that's already been shown in in a past showcase or something just as a reminder. Hey, it's still cooking, but no mention",
            "start": 3413.92
        },
        {
            "text": "and and it's just kind of you get a glimpse of it, but it's maybe show footage that's already been shown in in a past showcase or something just as a reminder. Hey, it's still cooking, but no mention of it. Yeah, I agree with that. I almost put that down there. I I talked myself out of it. Greg, final prediction. I want to point out this is my seventh prediction on the list. Uh because of course we've been chiming in. So this is like my [ __ ] limpest of dicks. All right, but it's the fact that uh both Elder Scrolls Online and Fallout 76 are limited to trailers talking about things that have already happened. Uh Worm Cult season of season of the Worm Cult for ESO, which just dropped episode one, and it's June 18th, right? That that's coming to consoles. And then Fallout 76 just put out that fishing update. That'll be it. So, it's just like traditionally I feel like we get here and we do have something. You know what I mean? Last year with Skyline Valley for 76, ESO is always cooking",
            "start": 3470.24
        },
        {
            "text": "fishing update. That'll be it. So, it's just like traditionally I feel like we get here and we do have something. You know what I mean? Last year with Skyline Valley for 76, ESO is always cooking on something. I don't I don't I guess my prediction here is no big news from them because they've kind of just played a card and I think they just need to remind you that that's happening which isn't super exciting. Just like this prediction. Yeah. Give me the points. Give them the points. I mean, again, Greg, you're you're you're saying things that I think are very important to to remind people, but like now that Bethesda, Xbox, Activision are all part of the same thing. Like what used to be multiple showcases is now one showcase. And now that Xbox is also publishing on multiple consoles more often, it's like there's just going to be endless things to talk about in the way that there seemingly was endless Bethesda stuff when they would get into the nitty-gritty of all these games. But I also",
            "start": 3515.36
        },
        {
            "text": "it's like there's just going to be endless things to talk about in the way that there seemingly was endless Bethesda stuff when they would get into the nitty-gritty of all these games. But I also don't see them retreating from doing that still. So, I think you're right. like we will still get those little updates, but I do think they'll be condensed even more. While we're here, I'll give you Pers Liy's final update as well. Or final prediction. Uh his sixth one on his list here was they close the show with Elder Scrolls 6. That is a wild one. That is a wild one that I don't agree with. I don't think it's ready for prime time. I mean, we've already had that tease. It's already there. I think the less you say about Elder Scrolls the 6, the better until you're like, \"Hey, it's time to talk about Elder Scrolls 6 because we are talking about it because it's imminent, right?\" Yeah. Hopefully two years from now, it's the showcase at the end of the Xbox presentation. Yeah. I'm way more sold",
            "start": 3555.12
        },
        {
            "text": "about Elder Scrolls 6 because we are talking about it because it's imminent, right?\" Yeah. Hopefully two years from now, it's the showcase at the end of the Xbox presentation. Yeah. I'm way more sold on on Blessing's earlier prediction about a Fallout big Fallout remake cuz I prediction, too. Oh, sure. Yeah. But I just I I don't think Bethesda wants to wait into the Elder Scrolls waters again this year. I think that's like three is our showcase right now or Oblivion 4 is that's still our game. That's the thing that we still want to be talking about. Bless. All right. This is the last one, right? It is last dance. Cuz I did have Clockwork Revolution is coming out in 2026 as part of my trailer for Clockwork Revolution. Um, since I don't have that one, I got two left and and one less exciting one. And I don't want to do the bundle thing. Actually, no, I'm not going to do the bundle thing. Toys for Bob. Oh, you [ __ ] They show up. And you know what? They're showing up with Banjo M [ __ ]",
            "start": 3591.52
        },
        {
            "text": "one. And I don't want to do the bundle thing. Actually, no, I'm not going to do the bundle thing. Toys for Bob. Oh, you [ __ ] They show up. And you know what? They're showing up with Banjo M [ __ ] Kazouie. All right, it's been long enough. I know people want to crash. I know people want to Spyro, but Banjo's been gone for too long. And Phil Spencer's heard the cries. All right, do you know what? They're still asking Phil Spencer. They're not asking him for a [ __ ] Spyro Crash. They're asking for a [ __ ] banjo Kazoui. The fan base is raiding for it. Thank you, Kevin. Everybody wants it. They're getting a banjo. I like where your head's at to go right up to go right up against Don Gong Bonanza there. I love that. I um I think Toys for Bob will be there. I I think it's Spyro 4. Boring. Don't be Spyro 4. That's not boring. How's that boring? the first new Spyro in like what three years since like Spyro Reignited Trilogy. It's not a new one. Yeah, but it's it's new enough. Even though",
            "start": 3641.8
        },
        {
            "text": "be Spyro 4. That's not boring. How's that boring? the first new Spyro in like what three years since like Spyro Reignited Trilogy. It's not a new one. Yeah, but it's it's new enough. Even though even Even give me a Banjo remake at least. You know what I mean? Like Banjo's been gone since like 09 or whatever. What was Nuts and Bolts? 06. It's been too long since Banjo. I'll tell you what, the Skylanders kids, they're all grown up now and they got they have minimum wage jobs and they have money to spend. Spyro actually really do love Spyro. I don't know why I went anti-spyro for No, I get it. I'm with you in the sense that like there is a lot of internet demand for Banjo Kazouie and there's a lot of love for Banjo Kazoui. I think that Banjo it it is going to be harder to get that game great than it is for a Spyro or Crash. And uh I think that Banjo needs to be better than a Spyro Crash to matter. So I don't think that they like just get that out. And with everything we know about what",
            "start": 3691.6
        },
        {
            "text": "than it is for a Spyro or Crash. And uh I think that Banjo needs to be better than a Spyro Crash to matter. So I don't think that they like just get that out. And with everything we know about what Toys for Bob's been up to slashnot up to and all the shakeups, like if they're working on a banjo, I'm concerned about that game. Really? Yeah. No man. And because only because like I feel like if they announce it here, it's coming out this year. And I don't Oh, I wasn't even thinking that. I was thinking Yeah. Maybe like next year or the year after. I was thinking you just come out and just say Banjo is returning. I mean then then I'm I'm I'm hyped on that. That'd be cool. [ __ ] That was going to be my last one though. I mean, you can still do it and say, um, Spyro, Spyro, that's not No, no gear. Like, no Eay. No, that's too easy. No, I'm not here for easy points. I don't believe that. I'm here. I'm here. I'm here to tell you that Tommy Earl Jenkins is voicing blade. No, Ninja Giden 4",
            "start": 3735.12
        },
        {
            "text": "gear. Like, no Eay. No, that's too easy. No, I'm not here for easy points. I don't believe that. I'm here. I'm here. I'm here to tell you that Tommy Earl Jenkins is voicing blade. No, Ninja Giden 4 shadow drop. No. Yeah. What is the shadow drop? There has to be a shadow drop, right? Well, so okay, I'm just gonna like I have a list of just [ __ ] to talk about here and I I'll figure out where my prediction is as we go through this. But um Ninja Gaiden 4 will be talked about. We'll get a release date for that for sure. I don't think it's Shadow Dropped, but I think we get the date. Persona 6 very like or sorry, Persona 4 uh remake or Persona 6, one or the other very likely to be here, I would say. Um forts of Horizon 6 is the big question. And I tried writing down some dates here. Um, it's been four years since Fortza Horizon 5. It was three years between Fortza 4 and 5, so we're due for that announcement. My hesitation is Playground having just ported Fortza to PS5. I don't know what",
            "start": 3777.52
        },
        {
            "text": "been four years since Fortza Horizon 5. It was three years between Fortza 4 and 5, so we're due for that announcement. My hesitation is Playground having just ported Fortza to PS5. I don't know what that looked like, you know, but I also don't think it's like that heavy of a lift. So, I think it is time for Fortza Horizon 6. I mean, I'd love it, right? I mean, I I want it. It feels about time. like if we're going. But I guess Fable is the thing that colors my opinion on it where I'm like, \"Yeah, how much how much time are you spending working on that?\" I know it's multiple teams or whatever. Multiple teams though, I don't even think that's the same teams at all. Panic Button was the main lead dev on the on the port with in partnership with Turn 10 and Playground, but Panic Button was like the lead. Um, other things I got here is Final Fantasy 7 remake and Rebirth finally coming to Xbox, Game Pass, Shadow Drop, all that stuff. I'm still not convinced that it's coming to Xbox. We'll",
            "start": 3825.04
        },
        {
            "text": "the lead. Um, other things I got here is Final Fantasy 7 remake and Rebirth finally coming to Xbox, Game Pass, Shadow Drop, all that stuff. I'm still not convinced that it's coming to Xbox. We'll see. Um, so my prediction that I'm actually going to stick to. It's pretty boring, but I made some crazy ones that I'm not going to win. So I I want to win here. Gears of War Reloaded Beta Shadow Drop. Oh, you can download the demo demo right now. Yes, that'd be fun. There has never been a better time. Yeah, I was so bummed out that I played that game on Xbox. I wish I would have waited for this version. I wish I knew. I'm just so bad at controller now, man. It's just really sad. It's a sad state of affairs, man. I want to get through all the super chats y'all have been sending through so I can uh get your opinions on if you think that these things are going to happen here. Um I mean, let's start off with Gears of War eay. No one's uh super chatted about that, but we didn't talk about it.",
            "start": 3873.84
        },
        {
            "text": "uh get your opinions on if you think that these things are going to happen here. Um I mean, let's start off with Gears of War eay. No one's uh super chatted about that, but we didn't talk about it. What do we think they're going to have or not have? I think it'll be gameplay and I don't know how long it lasts, but it's definitely more than last year's mainly sort of cinematic cut scene that they were showing us. Like we see kind of in motion and we see the roadie run. Love it. Man, I really going back playing Gears recently. really wish we had accessibility on the mind a lot more back then cuz the roadie run camera the rod run makes me nauseous like your camera shakes like crazy. Let me tune that down. Nathan Maloney writes in and says Transformers War 4 plus Fall Cybertron remaster. I would mark the [ __ ] out for that. I would a remaster of those games I think would be vastly preferable to just them showing up on Game Pass or whatever. But even that I'd take at this point. But yeah,",
            "start": 3922.4
        },
        {
            "text": "mark the [ __ ] out for that. I would a remaster of those games I think would be vastly preferable to just them showing up on Game Pass or whatever. But even that I'd take at this point. But yeah, that'd be very cool. I don't think it's impossible either. I do think that we're at a point that inevitably we're going to see those Highman Studios games. You think so? Do what about my Ultimate Alliance? We get an Ultimate Alliance ever. That stuff gets more complicated. I know it does. Yeah, I'm aware how complicated. I'm not sure. Damn it. Don't do this. Guitar Hero Arrow says, \"We finally get another Elder Scrolls 6 trailer. No gameplay, but it's all an engine. No subtitle yet. Trailer ends by revealing a 2027 window. It's just we don't need to see it. I I want But it's like to to do it and then say 2027 like don't even don't even talk. Don't even talk. Don't do it. I don't think so. Anything with Perfect Dark gameplay deep dive? I hope be better, right? But like when is that game",
            "start": 3974.96
        },
        {
            "text": "and then say 2027 like don't even don't even talk. Don't even talk. Don't do it. I don't think so. Anything with Perfect Dark gameplay deep dive? I hope be better, right? But like when is that game coming out? Like they showed a bunch of that game last year. If we're talking about the second half of next year for Perfect Dark, do you show even more gameplay this year? But the thing about Xbox showcases the last couple years is they have no fear about showing the games like every time as they're like getting ready for release. Like think about the South of Midnight and stuff. Like what would you show for Perfect Dark? I guess maybe story related stuff cuz my thing is like if you just show more gameplay then I think that's a boring showing unless unless you have something that's like a set piece moment that's going to blow people away. Yeah. Yeah. You have to have concrete information. That's another one. Next time we see it, it needs to be that it's imminent. I feel like, okay, cool.",
            "start": 4018.72
        },
        {
            "text": "piece moment that's going to blow people away. Yeah. Yeah. You have to have concrete information. That's another one. Next time we see it, it needs to be that it's imminent. I feel like, okay, cool. Here's the set piece and guess what? We're doing a direct on its own and this that the other. It'll be developer direct where we get the deep dive next year on like Yeah. Our mantra, our you know, we get the actual studio looking our mantra. Uh Danesta says, \"What are the chances for Horizon 6 gets announced? Will it be on PS5 day one? And what do you guys want from new forts game?\" I think uh chances of it getting announced are higher than not. Um, I think it will be on PS5 day one. And um, Japan. Japan. I mean, Japan would be that' be really cool. Japan. I don't know why I'm not feeling the PS5 on day one thing for for I guess I I need that band-aid to be ripped off like for like a major like, oh, this is an Xbox ass game and it's coming to PlayStation day one type thing. I know. Well,",
            "start": 4060.0
        },
        {
            "text": "PS5 on day one thing for for I guess I I need that band-aid to be ripped off like for like a major like, oh, this is an Xbox ass game and it's coming to PlayStation day one type thing. I know. Well, Gears of War, but still that's a remaster. I don't know. We'll see. I I I get this is uh I mean, [ __ ] it. You know what? Actually, let me take back my forts of prediction. All right, I take Can he do that? Can he do that? Can I do it? Is it legal? Everybody, I mean, it depends what we're about to say. I'm gonna take it back and I'm gonna stand by. This is going to be the Xbox showcase that every Xbox game announced is going to be day one on PlayStation 5 as well. Wow. Everyone. Everyone. Everyone. I love that. That's bold. That's spicy. Yeah. You know what's another one? Some vow DLC. Have they teased that? Have they said it? I was going to say South of Midnight DLC. That's a good one. That was going to be part of my 2026 year bangers, but I was like I don't know if a three-hour DLC for",
            "start": 4104.16
        },
        {
            "text": "teased that? Have they said it? I was going to say South of Midnight DLC. That's a good one. That was going to be part of my 2026 year bangers, but I was like I don't know if a three-hour DLC for South of Midnight is like but like my idea for it would that would be that they finally flesh out the villain character that they have in the game that I felt like by the end of the game they didn't really do as much with as they probably should have cuz let's let's talk about my my prediction for a second here. Yeah. PS5 day one. Back to me. Back to me. No, because I I want to make sure I'm not crazy about this because I don't think I am. I was so shocked last time when we they did the little developer direct thing and South Midnight was the only one that wasn't day one PS5, right? What were the other games? Um, yeah, the Ninja Giden third party, what I think being published by Xbox. That's right. Um, I forget everything else that showed up. I don't remember either. I'm looking it up. I just",
            "start": 4149.84
        },
        {
            "text": "other games? Um, yeah, the Ninja Giden third party, what I think being published by Xbox. That's right. Um, I forget everything else that showed up. I don't remember either. I'm looking it up. I just think that we're at the point of like any game coming out this year, I mean, we already know Gears of War the remake and and things like that. So, it's like what else this year is there even anything that's already confirmed that it doesn't have a PS5? Yeah, Doom of the Dark already kind of there. Doom the Dark Ages, which was PS5, and then you had Expedition 33, which is like third party, but I think Doom the Dark Ages is a big one. Yeah, cuz that is an Xbox game, but it's also technically Bethesda, which I know, whatever. But I just think that Gears is very clearly Xbox and I know it's a remake, but I just think we're at a point that if South of Midnight was announced, this weekend, it'd be announced on PS5 day one. Very interesting. I like that a lot. I like that. That's a good one.",
            "start": 4187.04
        },
        {
            "text": "remake, but I just think we're at a point that if South of Midnight was announced, this weekend, it'd be announced on PS5 day one. Very interesting. I like that a lot. I like that. That's a good one. It's a good wrinkle. Out of Worlds 2 was PS5 also. Yes. Damn. Yeah, you're right. I'll see. I'm going to say at at the normal Keley showcase, add this to my SGF ones predictions because it wouldn't be mentioned here necessarily, but at the SGF one, we'll get Halo Infinite payable everywhere. Dang, cuz I don't think Xbox would want to like have that. Hey, guess what? That I was going to say that for a Halo Master Chief Collection. I feel like Chief Collection's more likely just because of the Switch, too. Yeah. But yeah, I mean I haven't even thought about infinite. I like it that way. I mean, I would love that. I like it. I'm I'm an infinite truther. Me, too. What the [ __ ] happened? Although, you know what? I never beat the infinite campaign. No, I barely touched the campaign, but like",
            "start": 4230.24
        },
        {
            "text": "I would love that. I like it. I'm I'm an infinite truther. Me, too. What the [ __ ] happened? Although, you know what? I never beat the infinite campaign. No, I barely touched the campaign, but like that multiplayer was [ __ ] sick, dude. Yeah, it was really good. Kyle says, um, wait, no. Kasa says, \"Sorry to crash the Xbox episode with PlayStation off the bat, but bless insider trading with this prediction on the 2D God of War. seeing people like Grub murmuring about it now too. That's been the conversation. Like that's been in the the vibe since the I think I think my prediction came off of Grub. I think Grub was the one who originated the report and like said like a God of War side thing but then came back and said it's a game and then I just added some sauce maybe some things by saying 2D. But I think we had that conversation. Uh Zach says, \"I think we'll finally see Forts Horizon 6. I desperately want to be in Japan but I predict it'll be Germany.\" Oh. Uh, I see weiner says,",
            "start": 4276.96
        },
        {
            "text": "2D. But I think we had that conversation. Uh Zach says, \"I think we'll finally see Forts Horizon 6. I desperately want to be in Japan but I predict it'll be Germany.\" Oh. Uh, I see weiner says, \"Will snowike Mike be around tomorrow night?\" Hopefully, we're going to check in with him and see how he's feeling. He's in the Iron Lung right now, you know, trying to get back on his feet because what's tomorrow night, Tim? Switch to launch party, baby. Hanging out right here, Twitch and YouTube. Kind of funny games. Kevin, Kevin, you can throw up the blue sky putting assets. We can officially confirm we are streaming from the Nintendo store. So, tomorrow at 7:45 Pacific time, uh, we will go live, probably Roger, hopefully Mike, in the studio, then kick to Tim and myself and Kevin behind the camera over at the Nintendo store as we build up to that 9:00 launch from there. So, we're very, very excited for that. Pretty cool. Like, I I doubt anyone else is going to do this just because we're so",
            "start": 4318.48
        },
        {
            "text": "over at the Nintendo store as we build up to that 9:00 launch from there. So, we're very, very excited for that. Pretty cool. Like, I I doubt anyone else is going to do this just because we're so weird and we're like, let's try something. You just told the story recently, Greg, but 10 years ago, we were like the first people to ask um who even was making Rock Band at that time or Guitar Hero Live Activision. Um we're like, can we do a let's play and just post that as our preview? And they're like, that's weird, but sure, why not? And it's our to this day most popular kind of funny games video. Uh this feels like the same thing of us being like, can we live stream from the thing? Which doesn't sound like that novel of an idea, but I don't think anyone else is going to do it. And we got approval. So, Greg and I live streaming from the Nintendo store in San Francisco for shenanigans. Lots of high jinks and shenanigans you want to see as we build up to buying. And then, of course, we will",
            "start": 4361.2
        },
        {
            "text": "So, Greg and I live streaming from the Nintendo store in San Francisco for shenanigans. Lots of high jinks and shenanigans you want to see as we build up to buying. And then, of course, we will buy those systems and drive back here to the studio and unbox them, play with them, hang out. I will be in studio with Roger as well. Uh, if I hope Mike doesn't isn't here sick. Yeah, I will be masked up most likely if Mike ends up showing up. But if you get sick, can I go in your place? Of course. Okay, cool. With nothing stopping me. CJ Splitz on says, \"Will games be reintroduced with PS5 and Switch 2 logos?\" That's what I'm most interested to see is like how they handle all that stuff. I don't think it's going to be a big pomp and circumstance, but that's and we also have Keyy's show that I do think can handle some of the heavy lifting of just hey, these games are also coming to different platforms. Uh, Pretty Dude says, \"I understand Xbox is basically third party, but I don't want this show",
            "start": 4398.72
        },
        {
            "text": "can handle some of the heavy lifting of just hey, these games are also coming to different platforms. Uh, Pretty Dude says, \"I understand Xbox is basically third party, but I don't want this show to be filled with tons of port announcements of older games. New games is fine.\" Yeah, I mean I like we were just saying that like it's going to be a mix, man. Xbox just has too much. I will say Paris Lily on u one of these social media apps uh said there's too many uh did say that this showcase was going to be another 9.5. I love that when he said it last year he was right. I hope so. And also that at this point if Xbox has a bad showcase that is entirely on them and they [ __ ] up. They have so much. They just have so much like they have too much. It's constantly good things to get people stoked. to ask a question that we can have. This is a conversation for maybe another Games cast because I agree about how hyped that showcase was for last year and I expect a similarly hype thing. Do we",
            "start": 4438.56
        },
        {
            "text": "to ask a question that we can have. This is a conversation for maybe another Games cast because I agree about how hyped that showcase was for last year and I expect a similarly hype thing. Do we feel like we're basking in the Xbox hypeness though? Like post showcases, you know what I mean? Like do you guys feel like you're feeling do you feel like you're feeling the results of like I guess the hype like the highs of the showcase? Does that sustain you in your day-to-day of like I guess your hypness around Xbox games? Yes. Yeah. Yeah. Okay. Again, like I'm in a weird spot right now as I'm more Xbox than ever thanks to Play Anywhere and the the ROG talking to the Xbox Series X and trading my saves back and forth and doing all that. Like I think this is this weird thing of like Tim being like, \"Oh yeah, this is going to be the one where you know everything comes to PlayStation.\" It's like awesome. It won't affect me. I will play these on Xbox because I want to be able to play them on my",
            "start": 4482.16
        },
        {
            "text": "\"Oh yeah, this is going to be the one where you know everything comes to PlayStation.\" It's like awesome. It won't affect me. I will play these on Xbox because I want to be able to play them on my rag as well. Same thing when you're talking about uh SATA Decay 3, right? And us being stoked for that crossplay everywhere. That's fantastic. I will play it on Xbox so that I can play it on the rag, I'm sure, at 24 frames a second and it won't, you know what I mean? Who knows what the performance will be, but that ability to have it on a, you know, I'm right, that's what I want. My number one and two game of the year so far, South of Midnight and Expedition 33, both from the showcase last year, right? I mean, I get South Midnight's been in a couple as well, but like Yeah. Wait, South of Midnight's your game of the year. Oh, sorry. My number two you Expedition 33 and South of Midnight. Yeah, he said it opposite and I was like, I'm not crazy, right? Okay, fine. I just said the two. I don't",
            "start": 4520.0
        },
        {
            "text": "your game of the year. Oh, sorry. My number two you Expedition 33 and South of Midnight. Yeah, he said it opposite and I was like, I'm not crazy, right? Okay, fine. I just said the two. I don't know. Well, whatever. Whatever. Tim, you got a great neck. You got a great grab his neck. Grab his neck. Grab his neck. I'm not grabbing his neck. Grab his neck. I draw the line. Gain says, \"Birthday tax. What a great week for video games. Happy birthday, Mr. Saints.\" Birthday to Mr. Rivia says, \"Greg, I need a DLC for Minds Eye called Minds Eye Hanging Brain.\" You're not going to get it. I mean, we are not exactly sure what this game is. And it sounds like you can make your own [ __ ] So maybe you can do it. That's everywhere. Everywhere you can make your own [ __ ] Mine's eye. Mine's Eye was made in everywhere. Mine's Eye was made in everywhere. Think of it like Roblox or Dreams or an Unreal Engine. I don't know what it is. Uh Jean Sandival says, \"Fuck Blast. Can you help me here?\" Um, cockto",
            "start": 4557.36
        },
        {
            "text": "in everywhere. Mine's Eye was made in everywhere. Think of it like Roblox or Dreams or an Unreal Engine. I don't know what it is. Uh Jean Sandival says, \"Fuck Blast. Can you help me here?\" Um, cockto like the French playwright. The rest or the pest. It's a quote from the past, I guess. But it's French. [ __ ] What's it mean? I don't know. Can't be good. Yeah, I might have said something. I hate that you know way more French than I'd expect, but not enough to be impressive. You know what I mean? I think it's just the last is actually very true. Well, it's part of the Jean Jean Ku. Teddius says, \"French poet, playwright, novelist, designer, and film director.\" A banger outro to this episode. Teddius says, \"Sorry if you already said this, but do we get Game Pass support for Steam Deck announced? Xbox and Steam seem to be playing very nice recently.\" I don't I think that the Game Pass stuff is just over complicates things. I think they got to figure out the Xbox OS stuff and we need to",
            "start": 4602.8
        },
        {
            "text": "Xbox and Steam seem to be playing very nice recently.\" I don't I think that the Game Pass stuff is just over complicates things. I think they got to figure out the Xbox OS stuff and we need to see how that works before we can start figuring out how it works with Steam. Makes sense, right? Yeah. Yeah. Yeah. Starwolf says, \"All I want is Halo Master Chief Collection in Gears of War on Switch 2. I don't care what they add to Game Pass or Xbox consoles. Just port every 360 game to Switch 2.\" Yeah, it might be a little too early for the Switch 2 stuff, but maybe not. Yeah, that was my I put, you know, I tacked that on there for Starfield. That's why I really pushed it out to Winter because if it's not if it's just P if it's just the DLC/update and a PS5 version, that could happen imminently, right? But I feel like you would put Switch on there. Alec Bobco says follow season two trailer. No god don't think. No no no not not big enough station. I honestly that I think you have a better shot",
            "start": 4655.04
        },
        {
            "text": "But I feel like you would put Switch on there. Alec Bobco says follow season two trailer. No god don't think. No no no not not big enough station. I honestly that I think you have a better shot at SGF which I also don't think is going to happen but I think Keely's got a better shot at getting that than Xbox does. Pugles says Call of Duty announces Zombie Chronicles 2 for July adding Berry to Transit Mob of the Dead Call of the Dead Rise and Nuke Town. Cool. I understood some of those words potentially. Yeah. I don't think we're gonna get too much Call of Duty from this thing. We'll get some, but I don't think it's I I think Call of Duty Can we go back to like how Call of Duty has done it year to year where they have their own event? I think we have to. Yeah. Uh Trevor says this probably won't happen, but they show Fable gameplay and it's announced for February or March next year, which will give enough time before GTA 6. Crazy prediction. Final Fantasy 7 remake finally coming to Xbox.",
            "start": 4696.24
        },
        {
            "text": "happen, but they show Fable gameplay and it's announced for February or March next year, which will give enough time before GTA 6. Crazy prediction. Final Fantasy 7 remake finally coming to Xbox. My only thing about Final Fantasy 7 remake and Rebirth is I do not think it'll sell well enough on the Xbox. The only way I see this happening is if it's a game pass deal. [Music] That makes sense. There's also Final Fantasy 16. That's another one as well. An Metal says, \"Killer Instinct 2.\" I don't think so cuz Iron Galaxy is working on uh Tony Hawk. Yeah. Diego review says, \"High off center, so I'm going to predict some gameplay from Arcane's Blade.\" That'd be sick. I was just saying. And then Thunder Boy ending here saying, \"Flight sim DLC that lets you fly around the Halo ring. Oh, that would be neat. Yeah, it could be cool. We'll probably see Flight Sim to some extent. Yeah, 100%. All right. Yeah. What it'll be? Who knows? I don't think it'll be the ring, but that is a cool idea. I sure",
            "start": 4739.92
        },
        {
            "text": "be neat. Yeah, it could be cool. We'll probably see Flight Sim to some extent. Yeah, 100%. All right. Yeah. What it'll be? Who knows? I don't think it'll be the ring, but that is a cool idea. I sure don't know. Do you know everyone? If you do, let us know in the comments below. Thank you so much for hanging out with us for this fun predictions. If you want more PlayStation predictions, check out Games Daily that we did earlier today. If you want summer Gamef Fest predictions, check out our Games C we did yesterday. And if you want to hear us talking all about the Witcher 4 tech demo that they showed today, you got to stay tuned to Twitch. Stay right where you are. If you're on YouTube, make the jump to the next Gamescast video where Bless and Andy are going to break all that down. Until next time, I love you all. Goodbye. [Music]",
            "start": 4786.64
        }
    ]
}