{
    "id": 14190,
    "video_id": "6P_Oxzazkjk",
    "show_name": "Gamescast",
    "hosts": [
        "Tim Gettys",
        "Andy Cortez",
        "Blessing Adeoye Jr.",
        "Mike Howard"
    ],
    "title": "Xbox Games Showcase 2025 REVIEW - Kinda Funny Gamescast",
    "description": "Go to http://kindafunny.com/XREAL to grab yours now!\n\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\nTime Stamps:\n00:00:00 - Start & Housekeeping\n00:02:03 - Xbox Showcase 2025 Review\n00:22:33 - SuperChats\n00:28:51 - Breaking Down the Showcase\n01:29:01 - SuperChats\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1749416475,
    "duration": 5751,
    "transcript_chunks": [
        {
            "text": "[Music] What's up and welcome back to a kind of funny games cast breakdown of the Xbox game showcase for 2025. Of course, I'm your host Tim Gettys. I'm joined today by blessing Addio Jr. Good day Tim. The master of hype snowike Mike. Great to see you, Tim. And the nitro rifle, Andy Cortez. No Bloodborne. No Bloodborne. No Bloodborne, but a surprising amount of Hollow Knight. So shown. Uh we're going to talk about all of that cuz of course this is the kind of funny games cast each and every weekday. We get together to talk about the latest in video games. And we do it live on YouTube, Twitch, and podcast services around the globe. If you love what we do, please support us with the kind of funny membership on Patreon, YouTube, Spotify, and Apple Podcast to get all of our shows ad free and you get a daily exclusive show. For a chance to be part of this show though, YouTube super chat in. Let us know what you would grade this Xbox showcase. And also, what games are you most excited for?",
            "start": 6.44
        },
        {
            "text": "you get a daily exclusive show. For a chance to be part of this show though, YouTube super chat in. Let us know what you would grade this Xbox showcase. And also, what games are you most excited for? Get all those super chats in and we'll talk about them throughout this episode of the show. Uh, a little housekeeping for you. If you can't make it to Greg Miller's Game Showdown Championship Parade on June 28th in San Francisco, don't worry. You can celebrate at home with our new limited time merch drop by Campfire Design. Celebrate like a champion. Kind of funny.com/shop kind of funny.shop to grab yours. Um, I think both will work, but go there and buy the shirts if you need to. I don't really recommend it, but you can if you want to. They're such good shirts, though. I've always wanted Game Showdown merch. So, I'm happy that Greg decided to take over the first three shirts that we dropped show the show that I, you know, put in blood, sweat, and tears. We're home, man. Every They're all",
            "start": 57.44
        },
        {
            "text": "Showdown merch. So, I'm happy that Greg decided to take over the first three shirts that we dropped show the show that I, you know, put in blood, sweat, and tears. We're home, man. Every They're all just Greg Miller shirts. Uh, thank you to our Patreon producers, Carl Jacobs, Omega Buster, and Delaney Twining. Today, we're brought to you by Exreal and Factor, but we'll tell you about that later. Let's get into it. The topic of the show, Xbox Game Showcase 2025. No longer are we in a world where Activision shows up at a couple different places, Bethesda gets its own showcase, and Xbox does its thing. Now, it's all part of one giant experience. Um, featuring a direct after. This is our third year we've now seen this uh this time featuring on uh Obsidian Games is Outer Worlds 2 and the surprise of Grounded 2. Um, overall Xbox Games Showcase. What are your top level thoughts? Snowike mic. Ooh, Tim, coming to me first, of course. Uh top level thoughts, Tim, you know what? It was a really",
            "start": 101.68
        },
        {
            "text": "of Grounded 2. Um, overall Xbox Games Showcase. What are your top level thoughts? Snowike mic. Ooh, Tim, coming to me first, of course. Uh top level thoughts, Tim, you know what? It was a really nice afternoon being spent with all of you. So, always remember that. I really love seeing games and hanging out with you. But for me on the Xbox Game Showcase, I was going to say this, Tim. Um you know what, the opening was really weak and I think the first party promotion was also on the weaker side. I think first party was lacking this year when we come to promotions, trailers, get hype moments. And so I just didn't feel like the oh snap, Xbox has got the games. We know they have the games, but this summer showcase didn't show we got games, right? And so I'm a little lacking on that one. Also, a lot of the games that were shown aren't my style. I actually come out of this enjoying Jeff Keelley Summer GameFest that had more games that spoke to me than this one. Unfortunately, I thought the",
            "start": 146.4
        },
        {
            "text": "a lot of the games that were shown aren't my style. I actually come out of this enjoying Jeff Keelley Summer GameFest that had more games that spoke to me than this one. Unfortunately, I thought the third party support was pretty strong with Persona and Final Fantasy. There was a day back in the day with XCast that Barrett never thought Persona would be on an Xbox. Now we get Persona 4, which is great to see him happy about that. And Xbox fans can be very excited about Final Fantasy coming to their consoles with 16 today and then of course this fall uh we will get Final Fantasy 7 which is like hey finally that's a big help and we knew Phil was bringing that team over to help us out and get over there. Um man oh man Tim I thought we would see more EA or Ubisoft here. We did not see those two big parties present on this. So I thought the overall third party support was kind of mid this year. wasn't blowing uh me away on this one. I also thought that we had a very weak Call of Duty",
            "start": 192.64
        },
        {
            "text": "two big parties present on this. So I thought the overall third party support was kind of mid this year. wasn't blowing uh me away on this one. I also thought that we had a very weak Call of Duty reveal. That was a crazy way to end this showcase of like, hey, 25 years of Xbox, we got Fable, we got Gears of War, and we got one more that's been with us ride or die. And you're like, okay, Phil, what are we talking about? And then we just got a Call of Duty reveal that was not exciting. Right? When I think Call of Duty, I want guns. I want action. I want COD. And that was not it. Uh, I do want to give major shoutouts to, of course, uh, Obsidian who was putting out three games this year. That should be applauded. And also Clockwork Revolution from In Exile that absolutely showed up with a mega kind of breakdown show up that I thought for sure we'd be showcasing this game for this year with the release date. Kind of tough that it's like, hey, we'll be there when we'll be there. And so this",
            "start": 234.88
        },
        {
            "text": "kind of breakdown show up that I thought for sure we'd be showcasing this game for this year with the release date. Kind of tough that it's like, hey, we'll be there when we'll be there. And so this year for me is falling in the mediocre to okay range, a five to six area for putting it on the kind of funny scale. Uh, like I said, first party, I think Xbox has got ahead of it, saying, \"Hey, we want you to love us again. We got the games.\" And for the past two years, we've seen those games, but they're not ready yet, or we know they're coming. And so, we kind of got to this moment of like, man, how much can we show? We're not there yet. And so, we can show only so much. And so, you got DLCs that will hold you over. When I look over, I I don't want to talk too long, but you look at the end of 2025. I don't think this will go down as like a strong end. It will be a good end because when you really look at it, we have a whole lot of games to play. You're backed up, but I don't I think it's",
            "start": 281.36
        },
        {
            "text": "2025. I don't think this will go down as like a strong end. It will be a good end because when you really look at it, we have a whole lot of games to play. You're backed up, but I don't I think it's missing one piece to be like that was a really good another year to end this off, but we have so much games. We know there's more games coming. So, for me, right down the middle, mediocre to okay, wasn't blowing away. I think next year will be better. Let down on it. Uh before we get to everyone else's thoughts, I do want to say that the homies over at Activision have sent us a ton of codes for the Tony Hawks Pros Skater 3 and 4 Foundry demo that's now available on PlayStation, Xbox, and PC uh for people that pre-order the game as well as select Game Pass subscribers. But if you just want it for free, if you're not one of those people, um Roger is going to be dropping the codes in the chat uh throughout this episode of Gamescast. You need to go to tonyhawkthegame.com/preorder uh to redeem",
            "start": 325.2
        },
        {
            "text": "free, if you're not one of those people, um Roger is going to be dropping the codes in the chat uh throughout this episode of Gamescast. You need to go to tonyhawkthegame.com/preorder uh to redeem the access code. So you get to choose what system you want the demo on. Um so these codes they need to be used. tonyhawk.com tonyhawktheame.com/preorder. Go there look at them in the chat. Bless. Yeah. Where you at with this one? Um I will say that I was surprised and delighted um during a lot of this showcase. I would personally give it an eight out of 10. I thought it was a solid great. Um, I go through announcements that were here. Games like Super Meat Boy 3D was a surprise that delighted me. Right. You get to Clock Clockwork Revolution and I'm with Mike as far as, oh, I thought you you would have ended this trailer with a date because this is a longass trailer where you're showing us a lot of the inner workings of the gameplay. And I think my main critique with this trailer is that it",
            "start": 366.08
        },
        {
            "text": "have ended this trailer with a date because this is a longass trailer where you're showing us a lot of the inner workings of the gameplay. And I think my main critique with this trailer is that it was a load blown way too early. Like, if this was the trailer you wanted to show, you should have waited until the last last moment. We got to follow up next year with this. It's like you already showed way too much. Like this is the trailer you show when the game is out this fall. Like this is the trailer you show but right before the game is out. And so I think we might have seen too much of it, but I'm not going to complain too much because every moment of this game that we saw was pretty fantastic. Um Ailion from Don't Nod was a surprise, right? Like I know there are plenty of people that love don't nod that are Don't nod fans. But don't nod now means more things to more people as far as you know their history with games like Life is Strange but then like now recently being doing things",
            "start": 412.64
        },
        {
            "text": "don't nod that are Don't nod fans. But don't nod now means more things to more people as far as you know their history with games like Life is Strange but then like now recently being doing things like Banishers and then also just uh I'm somebody who's always you know on the lookout for what this studio is doing next and this game looks really different and really cool and I like the direction of it. Mudang Two Hearts is another one that uh looks really cool, right? Giving us kind of that like third person action shooter slash undead slash, you know, stealth sci-fi thing. Like it looks like it's taking a lot of inspiration for a lot of different places. But even as we were watching it, one of the things I mentioned is like it felt it feels like we're not getting a lot of games that look like this anymore as as far as like the third person campaign um like action shooter game, right? Like if you're not Capcom, like you know, I feel like we're not getting as many of these. And so this",
            "start": 448.16
        },
        {
            "text": "like this anymore as as far as like the third person campaign um like action shooter game, right? Like if you're not Capcom, like you know, I feel like we're not getting as many of these. And so this looks cool. It has some Splinter Cell kind of energy to it, but then yeah, a lot of weird supernatural stuff going on. And this looked really cool. And then you get games like At Fate's End and Persona 4 Revival and Invincible Versus and Keeper. Like this showcase had a lot of announcements that really spoke to me, right? For I think for a lot of this is going to be determined down to what is your taste in video games? What are the kind of games that you're looking forward to? And a lot of the games that showed up here are games that I look forward to. I think at the same time for me though I have questions of where was Fable, where was Perfect Dark, where was Eday, where, you know, what's going on with Forza? Are we gonna see a new Forza Horizon type thing, right? It what's going on with",
            "start": 486.88
        },
        {
            "text": "have questions of where was Fable, where was Perfect Dark, where was Eday, where, you know, what's going on with Forza? Are we gonna see a new Forza Horizon type thing, right? It what's going on with anything Halo? You know, I I think if I'm coming into this with the mentality of somebody who's a first party Xbox fan, then I totally understand the disappointment as far as what are the big dogs doing? But I think overall though, I had a good time. And I think the only times where I felt any sort of bored was when they were doing what feels at this point like housekeeping. I think we have to have a discussion around the Fallout 76s and the Elder Elder Scrolls Onlines and those the Sea of Thieves the games that you know are mainstates because they're at every single Xbox showcase and I understand that. But those are the parts where now I'm like every time I'm like all right cool like Sea of Thieves is back. We know we're going to get an update. Like I understand why you talk about it but",
            "start": 524.32
        },
        {
            "text": "that. But those are the parts where now I'm like every time I'm like all right cool like Sea of Thieves is back. We know we're going to get an update. Like I understand why you talk about it but I get bored. Like that's just the reality. you bring that up cuz I think they've finally found a a better rhythm for them. They're shorter, they're in, they're out. I think back in the day we used to clump them all together and we would really sit there blessed. So, I think you know their main stays. They're going to be there. And if you're a fan of that, you're excited, right? Because these games are getting content. They're staying in the mix. And I think they've done a better job of like, let's space them out. Let's get in. Let's get out. Sure, fishing stayed at 12. Fishing did not get in, but like Sea of Thieves that came in. It showed you smugglers, got you out and made a way out of its way. ESO, you probably don't even remember what ESO showed you because that's how fast it was, right?",
            "start": 565.68
        },
        {
            "text": "like Sea of Thieves that came in. It showed you smugglers, got you out and made a way out of its way. ESO, you probably don't even remember what ESO showed you because that's how fast it was, right? And so I think they've at least done better at how they show that is right. Yeah. And also the there's a there's a argument back and forth of which had the worst ending between this and SGF in my opinion. Right. SGF at least we got Resident Evil 9 which is exciting, but the the buildup to that was terrible. This year the Yeah. to Mike's point of, oh, we got something, you know, that's been with us since the for for the history of Xbox and you have a really really cool cinematic opening and it ends up being a Call of Duty. I understand Call of Duty biggest game of the year every year. The it is a fantastic cinematic, but it is a big letdown when I am looking at this trailer. I'm like, \"Oh, what is it? Is it a New Prey? Is it Perfect Dark? Is it a weird fable thing? Like, what the [ __ ] is",
            "start": 600.0
        },
        {
            "text": "a fantastic cinematic, but it is a big letdown when I am looking at this trailer. I'm like, \"Oh, what is it? Is it a New Prey? Is it Perfect Dark? Is it a weird fable thing? Like, what the [ __ ] is this?\" And it turns out to be a Call of Duty Black Ops thing. I love Call of Duty Black Ops, but I don't think this is the way to show this. I think this was them showing you, hey, you should be interested in the in in our campaign. Like I think this was their attempt at saying, \"Hey, that thing you've been drinking, by the way, sugar-free, caloriefree, would you believe that?\" And you go, \"Oh [ __ ] I I didn't know it was so delicious. I think the trailer looked awesome. It it looks great. And if it's anything like Black Ops 6 and how amazing that campaign was and that's such a such an underrated campaign, I think that's something that people should definitely play. And this looks like, hey, you know, it's not just bro army shooter. Look how weird this can get and how kind of supernatural",
            "start": 640.08
        },
        {
            "text": "campaign, I think that's something that people should definitely play. And this looks like, hey, you know, it's not just bro army shooter. Look how weird this can get and how kind of supernatural and very remedyyl like that this can get. Uh, I thought that looked pretty great. I'm I'm with bless. I'd give it I'd go eight, maybe 8.5. I'm I you know, it it's up there. I really think that this game this uh showcase had a lot of awesome surprises. Um, and I and some things that we did know still looked amazing. Clockworker Evolution looked fantastic like you had mentioned uh at Fate's End was it? Um and the that the Mudang game of course looked really really fantastic but there was also just a lot of you know Planet Alana 2 was such an awesome little announcement to happen. Uh there was a lot of unknowns showing up here that really looked great and I think they knocked out of the park. I I I do you know I won't disagree that when you say the developer that's been with us from the",
            "start": 680.48
        },
        {
            "text": "a lot of unknowns showing up here that really looked great and I think they knocked out of the park. I I I do you know I won't disagree that when you say the developer that's been with us from the beginning like oh [ __ ] Halo like oh my god that's all this can be but you know it it it's Call of Duty and not everybody's going to love that. But just real quick like one thing that I think is important to note and I think it's just weird because they had the the inerson on or sorry not in person the on on site on camera uh bits with the the you know with with Sarah and Matt and and Phil. All of those I feel like they didn't really do a great job of making it clear of what exactly they were talking about. It kind of just feels like buzzwords buzzwords. But the quote here that Phil said was in 2026 Xbox will have a new fable, the next Fortza, Gears of War Eday, and the return of a classic that's been with us from the beginning. So that's not what that's not what Call of Duty is. But that",
            "start": 727.2
        },
        {
            "text": "2026 Xbox will have a new fable, the next Fortza, Gears of War Eday, and the return of a classic that's been with us from the beginning. So that's not what that's not what Call of Duty is. But that was Yeah. Like have that be the setup into the next thing. Yeah. Sarah Bond talking about Silkong a whole bunch and then us being like, wait, did you know, did she mean later this year that the game is also coming that year? I think the the ROG Ally Series X or whatever they're calling it got me really pumped up as somebody who is, you know, three plus years into owning a Steam Deck and I still love the damn thing, but I would love more power at this point. And when early on when we're hearing about this Xbox handheld, I go, \"No, that sounds like an absolute no for me cuz I don't want to just use the Xbox launcher.\" The fact that this is going to be this Windows mobile thing, including every launcher that you could want and it doesn't just look like a Windows desktop, you know? Did they",
            "start": 768.4
        },
        {
            "text": "use the Xbox launcher.\" The fact that this is going to be this Windows mobile thing, including every launcher that you could want and it doesn't just look like a Windows desktop, you know? Did they name Epic? Huh? Did they name Epic? I don't know. I didn't I didn't get they said I mean like the fact that they said Ubisoft, Steam and everything. Okay, Epic is missing. I mean I don't Epic is missing. I feel like that is something that could easily be done with with this sort of launch. I I either way I'm like, \"Oh, this really really turned around my hype levels for what this handheld is because I'm always caught in between that weird area of like my Steam Deck has all of my my Steam games.\" And yes, I can easily put a Ubisoft loader like I tried doing with Prince Persia Lost Crown before they eventually went to Steam or I could get the Epic Store on there going through the desktop mode or whatever. It's annoying to do that [ __ ] Like I like I love tinkering with [ __ ] I don't love",
            "start": 817.76
        },
        {
            "text": "they eventually went to Steam or I could get the Epic Store on there going through the desktop mode or whatever. It's annoying to do that [ __ ] Like I like I love tinkering with [ __ ] I don't love doing that level of tinkering when it's like I have to plug this into the HDMI to like type on the screen. It's just it's annoying, right? This seems like this could be the solution. And immediately turned around how hyped I was and I think it looks awesome and the UI looks really sick. I imagine the other launchers are going to work just through Windows, right? So like Epic should work. Yeah. Well, and that's kind of what I'm assuming is like I'm sure there will be a solution there. Maybe it's just Epic didn't agree to the marketing or the mentioning or whatever. You know, I also I also want to go back to the Call of Duty thing cuz I totally agree with you as far as getting people in and being like, \"Oh, this looks cool. Oh, this is Call of Duty.\" I think my main critique now I think",
            "start": 867.04
        },
        {
            "text": "to go back to the Call of Duty thing cuz I totally agree with you as far as getting people in and being like, \"Oh, this looks cool. Oh, this is Call of Duty.\" I think my main critique now I think about it is the fact that it closed the show. I would have had this be I don't open the show or open that. This would have been a sick show opener. I think the it being the show closer kind of sets expectations. Yeah. Well said. Double finds game looked awesome. Yeah. Yeah. Tim, what' you think? Yeah, this one uh I I feel like caveing this with uh last year, I'm pretty sure I gave the Xbox showcase a 10 because I think that that was a a masterpiece of a showcase. Um and I feel like with that context, I put a 7.5 on this. I think it's between good and great. I can see an argument for saying it's great, but personally, like I'm not that interested in most of these games. So, um I'm I'm sticking with my 7.5 there. Game Freaks game, baby. Uh I mean that absolutely wild, right? Yeah. Looking",
            "start": 905.68
        },
        {
            "text": "great, but personally, like I'm not that interested in most of these games. So, um I'm I'm sticking with my 7.5 there. Game Freaks game, baby. Uh I mean that absolutely wild, right? Yeah. Looking through here, a lot of really quality stuff. I think overall that was a great presentation. It was well paced. Like we moved pretty quickly through things and there was a lot of like oh oh moments through that which was cool. Um I do think that some of the on camera stuff actually probably all of it was not right. Like they it was a little bit like what are you telling me right now? Like Matt Booty or whoever it was I think I think it was Matt in the center of it talking about Game Pass and stuff. It's like what? Like we know. And I get that you're going to remind people things, but I feel like we're still a little bit there's just too many brands. There's too many things to keep track of when it comes to the this is an Xbox and Xbox Game Pass and the cloud and all that stuff. And it makes",
            "start": 944.48
        },
        {
            "text": "we're still a little bit there's just too many brands. There's too many things to keep track of when it comes to the this is an Xbox and Xbox Game Pass and the cloud and all that stuff. And it makes sense and it works, but I feel like we're still not quite there of I understand what that means, you know? Um not just me, but I feel like normal people watching the stuff that if they're going to talk that way, it's for them. Um but a lot of pretty big surprises. Did not expect to see Final Fantasy. I really thought that if we ever did it would be a game pass deal and it's not these. It's not Game Pass. It is coming to Xbox. You have to buy it. Um and Xbox 16 or sorry, Final Fantasy 16 Complete Edition coming out today. That's awesome. I want to see that game find as much success as it possibly can. Um the Tony Hawk stuff obviously I'm going to pop off for the secret characters and the the three new levels look awesome. Um Ninja Giden getting a date. It looks great. Like there is a lot of",
            "start": 984.48
        },
        {
            "text": "can. Um the Tony Hawk stuff obviously I'm going to pop off for the secret characters and the the three new levels look awesome. Um Ninja Giden getting a date. It looks great. Like there is a lot of stuff here that is cool, but to me, Super Meat Boy 3D, that's the one that I'm like the big surprise and delight of like, oh yeah, never would have saw that coming and I'm stoked for it. Um, and I am very excited that they did talk a little bit about the Xbox OS and that they're taking that stuff seriously because I think that that is very very important for um the strategy of Xbox to be successful. And I think that it's proving to be successful. This was a very, very, very good show of just showing that they have a ton of games, a ton of great partners when it comes to Persona and Final Fantasy. Um, ending on Black Ops, again, I think it's the placement more than anything that's the problem there. That is interesting. I do think it's cool that the big budget AAA uh shooting games are still",
            "start": 1027.28
        },
        {
            "text": "Um, ending on Black Ops, again, I think it's the placement more than anything that's the problem there. That is interesting. I do think it's cool that the big budget AAA uh shooting games are still having campaigns cuz that wasn't always the thing. And um the campaign last year was awesome. So, if we can focus more on that stuff and actually like tell people, \"Hey, we we're taking this stuff seriously and so should you.\" I think that's cool. But not as a show closer for an Xbox showcase when you have so many cool games to talk about. Um, I do think they're definitely teeing up for an amazing 2026 after an amazing 2025. I'm not taking away from where they're at here. Um, but yeah, them hyping everything up for next year. I think it's going to be a banger showcase next year. It's really interesting to me. Uh, I know we're all giving our quick thoughts and we're trying to keep it short, but you guys not really mentioning many first party titles, right? Bless highlighted clockwork. And I",
            "start": 1069.68
        },
        {
            "text": "to me. Uh, I know we're all giving our quick thoughts and we're trying to keep it short, but you guys not really mentioning many first party titles, right? Bless highlighted clockwork. And I know Andy likes that. We're keeping it short, but like all of you are highlighting third party games here and it's like that's where I'm coming from. Like feels like we missed on that front for an Xbox showcase. Yeah. Well, it depends on them not, you know, if the games aren't ready. I think Eay I'm more and more thinking that EDay will be a game that they shut off that initial teaser and we won't see that for a couple years. Like I'm getting I'm closer and closer to that sort of line of thinking in a similar vein to where you get a little tease of Wolverine and Wolverine's been gone for a long time. Um, and I'm also kind of used to this sort of showcase for the last couple years of the first parties just aren't, you know, they're they're cooking elsewhere and we'll let them cook for a while. But,",
            "start": 1111.04
        },
        {
            "text": "and I'm also kind of used to this sort of showcase for the last couple years of the first parties just aren't, you know, they're they're cooking elsewhere and we'll let them cook for a while. But, you know, I I'm not basing this on where are the Xbox first party games. I'm still just basing this on are they showing cool [ __ ] or not? You know, I think my thing is I I came into this not really having the big expectation for all right, what are the the surprises that we don't know about? I feel like there's I feel like there's a good majority of Xbox studios that are working on games that we already like know what they are. And then the ones that we don't know of, they just released games. Like I don't I don't know what could have been here aside from an Ever Wild or like if Rare decided to scrap Ever Wild and they were doing something new that could have shown up as an Xbox first party thing that I would have wanted to know about. And then as far as the things that we do know, I am",
            "start": 1153.92
        },
        {
            "text": "to scrap Ever Wild and they were doing something new that could have shown up as an Xbox first party thing that I would have wanted to know about. And then as far as the things that we do know, I am like where are those things? But at the same time, going back to the predictions that we did last week for Xbox, my big the theme of my predictions was that Xbox was going to have a banger 2026. I'm coming out of this showcase being like, \"Yeah, Xbox is going to have a banger 2026, right?\" Like, when I'm thinking about 2025 for Xbox, I'm like, \"Man, this this is Obsidian.\" Like, this is Obsidian's year. Like, this isn't Xbox. This is Obsidian. And then also, of course, Doom and Sent Midnight and stuff we've gotten, right? But like, you know, I feel like we are I feel like right now Xbox is loading up. I don't want to compare it to the Dominoes cuz I'm tired of the Domino. the dominoes on the table. I mean, they're [ __ ] going like like it's been done at this point. Like now it's just like",
            "start": 1197.52
        },
        {
            "text": "up. I don't want to compare it to the Dominoes cuz I'm tired of the Domino. the dominoes on the table. I mean, they're [ __ ] going like like it's been done at this point. Like now it's just like the next wave of banger games. But yeah, 2026 feels like I guess a landmark for where we're at with the dominoes falling. Yeah. I mean, I got to bring up one thing that I don't think we've said so far on this show. No State of Decay. Yeah, that was surprising. That's That's a really good point. Crazy. It was odd that it was shown last year after what we knew about the studio and what was going on inside of the wall. So, it was like, okay, that's interesting. I mean, you could go down the list, Tim. Where's Contraband? We talked about that partnership with Avalanche. State of the decay is one of those. Of course, you look at uh I mean, Perfect Dark. Why do we keep showing Perfect Dark? Why did we show gameplay last year if we're not going to be getting into it? And it feels like like Blessing",
            "start": 1231.92
        },
        {
            "text": "Of course, you look at uh I mean, Perfect Dark. Why do we keep showing Perfect Dark? Why did we show gameplay last year if we're not going to be getting into it? And it feels like like Blessing is saying, we've shown you these, we're loading them up for a big 2026, 2027. Are we holding things back for a Gamescom or a Game Awards? And then of course we know they kick off the year with ID at Xbox the IND whatever the the developer direct there's like they already have a lot of announcement moments here and it feels like now we're kind of spreading them out and maybe that's where we see some more. I think we'll see Fable at the Game Awards. I think we'll see something big for Fable at the Game Awards. I mean Crow in chat says where is OD? That's another one. It's interesting that he doesn't bring that up at all. He has been on stage. He has talked now and it's like, \"Oh, we're talking about this. We're talking about the next cool Metal Gear S game, but where's we're not speaking about",
            "start": 1271.04
        },
        {
            "text": "bring that up at all. He has been on stage. He has talked now and it's like, \"Oh, we're talking about this. We're talking about the next cool Metal Gear S game, but where's we're not speaking about OD?\" It's an odd one time, man. I'm telling you, it's death running 2 marketing and and the fizz announcement that's a separate thing that's announcing a many years down the line ending a state of play. Like, we'll get OD. I think OD is going to be a very small project that there's just going to drop. I imagine that maybe I'm wrong about this, but I see that as like a 10-hour thing max. Wow. But oh yeah, I agree with post death training too. I think that's when you start to actually talk about it more. Uh, a couple super chats that I wanted to get to here. The House has spoken says, \"Could have been a nine out of 10 show, but ending with Call of Duty is total whiff for me. Eight out of 10.\" Uh, Bobby Joe says, \"Where's Fable?\" I feel like we didn't expect Fable to be here. The the vibe of",
            "start": 1313.68
        },
        {
            "text": "been a nine out of 10 show, but ending with Call of Duty is total whiff for me. Eight out of 10.\" Uh, Bobby Joe says, \"Where's Fable?\" I feel like we didn't expect Fable to be here. The the vibe of this office at least. Like I think that it not being here not a surprise to me because I I do feel like that's a later down the line thing. Uh, Matt Sanders says, \"I'm so sad we didn't get to see Silk Song. I just want the constant demand to end. Um, yeah, it's We saw them. We saw Yeah, we did. It's just like It's that weird thing. It's coming out the same day as the Xbox Ally X, right? Okay. What was that phrasing? Yeah, let's talk about this. Playable day one when the Xbox when it releases on the Xbox Raga is how I took that later this year. Cuz I took it I took it as it was gonna be a lot. I know. It was a very weird that another one of those like Tim said, it's like you're not making this very clear. We got to rewrite this and figure this out because Yeah. You walk away going, \"Okay,",
            "start": 1354.96
        },
        {
            "text": "I know. It was a very weird that another one of those like Tim said, it's like you're not making this very clear. We got to rewrite this and figure this out because Yeah. You walk away going, \"Okay, well, she said day one.\" She meant day one. When the game releases, it will be on them. We got to get the people who are on like the writing team for the like out of out of world out of world showcase. Uh out of words. Out of words. Uh we got to get the people who write that to like write the base Xbox. Should we go back and listen to her wording? Yes, please. Okay, I'll find it'll the writing for the Outer World Showcase. So phenomenal. It's phenomenal. So phenomenal. That was a note that I I wrote down is that whoever the team is on these like the post Xbox Direct X, they're three for three of each one's been a banger showing us the team, getting to know their personality. All of them had a different style, but all three have done something that I'm so incredibly impressed by, which is",
            "start": 1395.68
        },
        {
            "text": "of each one's been a banger showing us the team, getting to know their personality. All of them had a different style, but all three have done something that I'm so incredibly impressed by, which is getting these devs to look like professional actors speaking. They are so good about talking about the games and the way it's shot and like every take and read that they have is like perfect. We do teleprompter stuff all the time. We don't sound that good. I don't know how they get this from people. It's awesome. diverse lineup of games from the biggest franchises to critically acclaimed indie hits. This is the freedom we believe players should have any game anywhere. And we are giving it our all every day to make this vision real. But it all comes back to the games. From Dead to Rights on the original Xbox to Armor Core 6. I might have gone too far. Hold on a second. That's how big Silk Song is on the left. How big Hornet is, man. From Xbox and Battleet to Steam, GOG and Ubisoft Connect.",
            "start": 1433.76
        },
        {
            "text": "original Xbox to Armor Core 6. I might have gone too far. Hold on a second. That's how big Silk Song is on the left. How big Hornet is, man. From Xbox and Battleet to Steam, GOG and Ubisoft Connect. And the highly anticipated Hollow Knight Silk Song will be available at launch and in-game pass when the ally releases later this year. Wait, crazy statement. At launch of the hardware or at launch of the game. It'll be it'll be at launch when the hardware releases this year. See, that's what I that's what I took it as. Yeah. I mean, that there's no way you can misinterpret that. Like that is saying that this year you can play Hollow Knight on this thing when it launches. Yeah. Yes. Okay, I'm listening to it one more time. Do one more. And the highly anticipated Hollow Knight Silk Song will be available at launch and in Game Pass when the Ally releases later this year. Yeah, when the allies I mean, she says when the it should be when the game releases, it will be on all that. But I mean,",
            "start": 1475.84
        },
        {
            "text": "available at launch and in Game Pass when the Ally releases later this year. Yeah, when the allies I mean, she says when the it should be when the game releases, it will be on all that. But I mean, yeah, now we're expecting 2025 this holiday. That's it. In the next 12 months. Yeah. Define this year. Jplays casual says was a good showcase. Not great. ending with Black Ops 7 was kind of meh. Would have been nice to see a gameplay reveal of Elder Scrolls 6 instead. Yeah. Also, uh Greg gave his score in the the chat uh an 8.5. He said it was great. A lot of stuff uh he really [ __ ] with it in this show. Hell yeah, dude. At Fates End is the one that I'm just Oh my gosh. Goodness. We're going to break down every single thing that we saw in the showcase right after a quick word from our sponsors. My foot's asleep. This episode's brought to you by XRE. Y'all know that a few months ago, my life changed forever when I brought a pair of XRE1 AR glasses on a long flight to New York. I legit",
            "start": 1523.28
        },
        {
            "text": "My foot's asleep. This episode's brought to you by XRE. Y'all know that a few months ago, my life changed forever when I brought a pair of XRE1 AR glasses on a long flight to New York. I legit could not believe how easy it is to use and high quality my experience was playing games, watching movies, TV shows on the plane without just too much extra stuff around me or especially not a giant goofy headset around my head. No joke, this is my favorite new tech product in years and it has earned a permanent spot in my travel bag. It is only hard to believe that it works as well as I'm saying until you try XR1 AR glasses for yourself and then you will see that the future is now. The tech is here. Connect XR1 glasses to wherever you are playing. Whether it's a handheld console, a PC, phone, home console. You just get a massive 150in virtual screen anywhere, anytime for any game. Gaming on the go like a long haul flight, you need the XR 1. neck starting to hurt from staring down at your",
            "start": 1566.64
        },
        {
            "text": "home console. You just get a massive 150in virtual screen anywhere, anytime for any game. Gaming on the go like a long haul flight, you need the XR 1. neck starting to hurt from staring down at your handheld. We've all been there. You need a next real one. A screen as big as your wall. Instant plugandplay with all of your devices via USBC. Built-in audio with sound by Bose anchoring your screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full HD. These are what make XR1 a musthave. And we hear XR1 Pro is coming soon with an even bigger virtual screen. Hit our link below to get your XRE glasses today. There's nothing better than when a sponsor of Kind of funny is something that we are legitimately obsessed with. And that is exactly the case here with XRE. You're going to hear me talking about these forever. Go to kind offunny.com/xreal. That's kind of funny. I promise you, you are going to love these things. This episode's brought to you by Factor. Summer",
            "start": 1615.2
        },
        {
            "text": "going to hear me talking about these forever. Go to kind offunny.com/xreal. That's kind of funny. I promise you, you are going to love these things. This episode's brought to you by Factor. Summer GameFest is here. The Switch 2 is here. The sun is here. So many summer things are here. And the number one thing you don't want to be doing all summer, spending hours cooking inside. That's where Factor comes in. Factor's chef crafted dietitionian approved meals are ready in just 2 minutes, taking the hassle out of eating. Well, we love Factor here at Kind of Funny. And Greg's often making and enjoying meals quick in between shows here in the studio. I just had a roasted garlic chicken m and I'm telling you, you would have loved it. Factor meals arrive fresh and ready to eat. Perfect for any active lifestyle over summer and beyond. With 45 weekly menu options, you can pick gourmet meals that fit your summer gains and goals. Choose from options like calorie smart, protein plus, keto, and",
            "start": 1665.36
        },
        {
            "text": "active lifestyle over summer and beyond. With 45 weekly menu options, you can pick gourmet meals that fit your summer gains and goals. Choose from options like calorie smart, protein plus, keto, and more. Get started at factormeals.com/kindfunny50 off and use code kind of funny 50 off to get 50% off plus free shipping on your first box. That's kind of funny off at factormeals.com/kindfunny50 off for 50% off plus free shipping. backtomails.com/kindfunn 50 off. Kicking off the show with Outerworlds 2 coming October 29th. Obviously, we had the whole uh direct as well, but we can kind of just talk about Outer Worlds 2 as a whole here. Bless. What this do for you? I mean, we're including the direct show. Yeah. Uh I mean, it did a lot for me, but it did a lot for me in the way that already I was sold on this game. Even during the direct, I was like, I mean, I don't even want to watch this because I just want to go into the game having all this stuff fresh. But I think the thing that um",
            "start": 1707.28
        },
        {
            "text": "I was sold on this game. Even during the direct, I was like, I mean, I don't even want to watch this because I just want to go into the game having all this stuff fresh. But I think the thing that um stuck out to me was how much they talked about the um flaws system where the more you do something, the game will give you a choice if um as to if you want this as a like a flaw or not. Um I forget one of one of the examples they gave. Bad knees was the one that was hilarious. Staring in the sun. Yeah. So, like um if you say yes to having bad knees, you can crouch and move faster, but then when you uncrouch, you make like a cracking noise in your knees that will alert uh enemies. And then, yeah, staring at a sun is another one that like kind of uh messes with the vision of how how everything looks. Um I love that [ __ ] I think that shit's awesome. And I during the showcase, I looked at Andy. I was like this like these sound like rog light upgrades in the ways that they're like quirky and",
            "start": 1760.32
        },
        {
            "text": "Um I love that [ __ ] I think that shit's awesome. And I during the showcase, I looked at Andy. I was like this like these sound like rog light upgrades in the ways that they're like quirky and weird and fun. Uh but within an a big action RPG, which is super cool, right? Uh game looks fantastic. I love how much they talk about like factions and what they're doing with the world to kind of move it forward and stuff. For me, this this is kind of I think what I want out of a post Starfield Bethesda, you know, like I think one of my things when I look back at Starfield and what I would have wanted more out of that game was like less scope, more focus in on story and moment to moment gameplay and all this stuff. And I'm looking at Outer Worlds, too, and I'm like, this feels so like full and rich of just fun [ __ ] and like fun energy and good humor and writing and yeah, like I'm I'm so stoked on this game. Mike. Uh Tim, I'm still on the fence on this game. Uh I know that Outer Worlds 2, I",
            "start": 1798.4
        },
        {
            "text": "of just fun [ __ ] and like fun energy and good humor and writing and yeah, like I'm I'm so stoked on this game. Mike. Uh Tim, I'm still on the fence on this game. Uh I know that Outer Worlds 2, I got a good feeling that it's going to be good. It's going to be a lot of fun. I'm just in my world of a lot of video games. It's not high on the priorities list. Um I fell off Outer Worlds one, Outer Worlds 2, I haven't been super excited about hearing Andy and Greg and Stella on the re-review. It's like, okay, yeah, this is going to be a good time, but still right now, this is not on my got to play for the year. Andy, super pumped, man. I mean, just like Blessing, I was I've already been sold on it, knowing uh a after replaying Outer Worlds one and realizing, you know, how how much I enjoy the writing style and how much I enjoy the characters and interactions and then coupling that with the awesome combat and traversal from Avowed. I I just, you know, this is super high on the anticipation",
            "start": 1843.12
        },
        {
            "text": "writing style and how much I enjoy the characters and interactions and then coupling that with the awesome combat and traversal from Avowed. I I just, you know, this is super high on the anticipation list. Um yeah, I'm really pumped about it. Looks great. Yeah. And it looks way again I know 2019 was a long time ago and that's when Outer Worlds one came out, but it was like it was always kind of an unattractive game. Yeah. Even the when I was enjoying it back then, it just was never really pretty uh in a lot of moments. And newer engine, newer tech. Uh finally the the game looks awesome. And I'm yeah, I'm just kind of excited to see what sort of weird decisions can be made cuz Outer Worlds one really surprised me with a lot of character decision moments that were like, \"Oh [ __ ] that this is possible. I really like that.\" And I was always bummed out by the charact the people I couldn't shoot and kill. Similar to um in Balders's Gate 3 where you're like, \"Oh, you could just kill that",
            "start": 1893.28
        },
        {
            "text": "is possible. I really like that.\" And I was always bummed out by the charact the people I couldn't shoot and kill. Similar to um in Balders's Gate 3 where you're like, \"Oh, you could just kill that dude. That's awesome.\" really really bummed out in Starfield when I was, you know, the the controls were pulled away from me at any moment where it's like I'm shooting this bad guy's head and the bullets are going through his head and he's just sitting there cuz he's got to be alive for the end of it. I totally understand why, but I I love the player freedom in Outer Worlds. Yeah, the [ __ ] gun that shrinks people is so [ __ ] cool. Um, and then yeah, them adding those little tweaks and upgrades as far as like being able to mantle and Did they say slide? You can like double jump as well. Double jump, right? Third person. Really neat. Yeah. Yeah. adding third person. Like these are all the things that I think the fans of Outer Worlds 1 would have wanted out of an upgrade for this game. And",
            "start": 1940.32
        },
        {
            "text": "jump, right? Third person. Really neat. Yeah. Yeah. adding third person. Like these are all the things that I think the fans of Outer Worlds 1 would have wanted out of an upgrade for this game. And so yeah, I'm I'm so excited for it. I think the one thing I'm still I It's been a minute since I played Outer Worlds 1. And I remember there being like characters that I attached myself to. Like they had the dude that was kind of like Rick from Rick and Morty. That was like one of the main Yeah. He's the main dude. Yeah. Yeah. Yeah. One of the main dudes, right? Not a companion, but he's like the Yeah. Yeah. And like I feel like I'm I'm not seeing that yet out of this. So, like I'm excited to see are there outside of the companions that they showed off, right? Like is there going to be a central cast or like a central character I should say that's like, oh, this is the guy like this is either the antagonist or this is like the, you know, one of the main people that going to stick with you",
            "start": 1979.44
        },
        {
            "text": "cast or like a central character I should say that's like, oh, this is the guy like this is either the antagonist or this is like the, you know, one of the main people that going to stick with you or are they lying relying on the companions to do that for you once you get further into the game? I'm excited to see. And then we had High on Life 2 coming winter. Kind of a major surprise. Yeah, did not expect to see another High Eye on Life game, especially coming off of what went down with Jo Justin Royland like a month after the last one came out. Um, if you remember Justin Royland, I believe, and you can double check me on this, left the studio, um, when all that stuff came out, right? And like I would have thought that you do whatever your follow-up project is, it's something to separate from that since Justin voiced um, was did he voice the gun? He like the Yeah, he voiced the main little gun. Yeah, the main little gun. Um, cuz there was three of them and one of them was JB Smooth.",
            "start": 2013.36
        },
        {
            "text": "from that since Justin voiced um, was did he voice the gun? He like the Yeah, he voiced the main little gun. Yeah, the main little gun. Um, cuz there was three of them and one of them was JB Smooth. Yeah, which I think JB Smooth, we saw him in this trailer. Um, but yeah, to return to this world, like I'm somebody who I liked High on Life. Like, it's not wasn't like the best first person shooter, but it was a fun time, right? I like this humor. I like this world. I like something goofy. Um, I like the improv style comedy that they got going on where you can tell that they're just in the booth booth riffing off of whatever, right? Um, and so I'm down for it, but it is a weird one. I would not have expected this game. Yeah. My biggest takeaway from this is it's a surprise the game's getting a sequel. Um, but at the same time thinking it through it's like well this was like a big game pass push game and I feel like maybe that kind of like gave them the numbers that they're like yo it's",
            "start": 2054.16
        },
        {
            "text": "a sequel. Um, but at the same time thinking it through it's like well this was like a big game pass push game and I feel like maybe that kind of like gave them the numbers that they're like yo it's worth doing something here. But this type of trailer just kind of rubs me the wrong way where it's like a CG trailer that's made to look like the gameplay. Like I don't know. It reminds me a lot of like 2006 Sony where it's like Killzone stuff where I'm like what are we doing? Like we we should have moved past that at a certain point. Yeah. And especially because High and Life was like it's it's a good enough looking game. I I just wonder maybe there wasn't a whole lot to show. I I don't know. It's very very bizarre. Mhm. Uh then we had Resonance: A Plague Tale Legacy coming everywhere 2026. Yeah. Kind of weird. Wasn't expecting that. And it didn't look like really anything out of a plague tale. Um, I I didn't get to part two, but I'd be part one and seeing this large ass mythological kind",
            "start": 2093.44
        },
        {
            "text": "Kind of weird. Wasn't expecting that. And it didn't look like really anything out of a plague tale. Um, I I didn't get to part two, but I'd be part one and seeing this large ass mythological kind of weird creature at the end was kind of surprising, but I mean really cool for the studio. I'm already blanking on the name. Is it? No, yeah, cuz I was thinking like Soie, but different. Um, yeah, really shocking it them going for this sort of more third person action focused video game. very had a lot of Tomb Raider vibes as well. Mike Tomb Raider Rome. Yeah. Rise, son of Rome. I I This one was all over the place, right? This trailer uh now this is where I come in of like the beginning didn't hit for me here on this showcase of like Outer Worlds 2. I know we're excited for it and I did I think they did a good job on the deep dive, but it just didn't hit with maybe the music, the sound, whatever they showed and then into High on Life, uh Resonance, A Plague Tale. Like the first three were",
            "start": 2136.32
        },
        {
            "text": "they did a good job on the deep dive, but it just didn't hit with maybe the music, the sound, whatever they showed and then into High on Life, uh Resonance, A Plague Tale. Like the first three were not solid. Let's get excited. Let's get up for a nice afternoon and then we went into the handheld and more. But like, yeah, this one didn't speak to me at all. It didn't have the plagues tail vibe like the last one did. I think when you saw the sequel, you knew what you were getting into. The beauty that we saw in it, it was like, nah, this one just didn't happen. Where are the rats? Yeah, where are the rats? It kind of reminds me of seeing um the the game from yesterday or two days ago blessing where we were like, \"Oh [ __ ] they made a part two and then they made a shared world shooter MMO RPG shooter of this atomic.\" Atomic Heart. The atomic universe. Yeah. The Plague Tale universe. It's like I like Not everything needs a universe. I don't know. What was the other game that got like",
            "start": 2187.68
        },
        {
            "text": "RPG shooter of this atomic.\" Atomic Heart. The atomic universe. Yeah. The Plague Tale universe. It's like I like Not everything needs a universe. I don't know. What was the other game that got like books and a comic and seven TV shows? N Unknown Nine or Unknown. Yeah. Really? Oh, yeah. Oh, I didn't know that. They won a whole universe. I thought you were talking about Yeah. Yeah. I still think it's funny that this game either leaked or was teased on threads and nobody noticed for like two or three days. Be a game of the year contender. By the way, this is going to be one that shows up at the Game Awards and we're like, \"Oh, really?\" On the Silk Song release date. Uh then yeah, speaking of silk song, the Xbox alley ally alley outer words. You know what guys, it's a Sunday. We're having a good time here. Uh the Xbox ally officially actually revealed. Um it has two SKs. Uh and Hollow Knight was being shown on it. And like we talked about, it seems like it's going to be playable whenever",
            "start": 2229.6
        },
        {
            "text": "time here. Uh the Xbox ally officially actually revealed. Um it has two SKs. Uh and Hollow Knight was being shown on it. And like we talked about, it seems like it's going to be playable whenever this thing launches or whenever it launches somewhere in between there. Um cool stuff. talking about the the OS. Uh I'm excited to go home and watch deeper dives on this from people that got their hands on it already% very very excited for this one. I know when it first started leaking, everyone was talking [ __ ] about the handles. I love this. This is what I want one of these things to be. Um but I want more info, no date, no price, no any of that stuff. Maybe that'll come be coming soon. But overall, very excited for this. I do I I love me some ASUS. I've been yeah buying ASUS [ __ ] since I worked at Best Buy. Like back when they were like on the come up. I was like, \"You all need to know about ASUS.\" I love their [ __ ] I wish it wasn't so ASUS branded. I wish it was more of the Xbox",
            "start": 2279.36
        },
        {
            "text": "I worked at Best Buy. Like back when they were like on the come up. I was like, \"You all need to know about ASUS.\" I love their [ __ ] I wish it wasn't so ASUS branded. I wish it was more of the Xbox fonts with the Xbox buttons in the same way that the PlayStation Portal looks like a Sony device. I' I don't love like the shapes of the buttons or the the you know this the super sci-fi looking font on the on the back paddle or on the uh the bumpers and the triggers and even the front faces. I wish it was. I get it, ASUS. You're like, you're putting your name out there. It's It's our device still, but I I don't know if I need like the ROG in the front with the with it looking so much like an ASUS device. I wish it was a bit more Xbox code. I wonder if that's like more on the Xbox strategy of how they're doing this cuz like, correct me if I'm wrong. They're going to we're going to see more of these from other hardware manufacturers or the handheld manufacturers. Wasn't there like one",
            "start": 2326.08
        },
        {
            "text": "of how they're doing this cuz like, correct me if I'm wrong. They're going to we're going to see more of these from other hardware manufacturers or the handheld manufacturers. Wasn't there like one other one that we thought was going to happen later this year? Well, I mean, not later this year, but they there was the rumor they were working on the Xbox thing, but it sounds like they're backing off of that. And now the way they're talking about this, it sounds like this is their like official partnership, but also with the Xbox OS, I do think that that will end up on and that's what I thought. I thought like in the rumors and I probably got this wrong, right? I thought there was like one other hardware um company that was working on their own thing, right? Yeah, like I I would have to Andy's point, I would have loved if this is the one like go all in on on ASUS being the all right, this is the official Xbox handheld as opposed to trying to like have your cake and eat it too. I mean, I",
            "start": 2368.4
        },
        {
            "text": "point, I would have loved if this is the one like go all in on on ASUS being the all right, this is the official Xbox handheld as opposed to trying to like have your cake and eat it too. I mean, I think they are. I just also think that there's going to be this is the Xbox ally. The leaks of this also had the just Raj Ally uh 2. So, I think that they're just they look identical, but yeah, just the ally branding. Uh then we had the blood of Dawn Walker 2026 everywhere. Game looks great. This is the Witcher devs or former CD Project Red Devs. And um it's a it's a really fascinating game in that it's going to take place over a 30day span. So there will be missions and things to do that are timesensitive. And it really seems like they're doing like a Majora's Mask type deal. Like I think you will be able to manipulate time in some ways, but uh it seems fascinating. The first trailer was a lot cooler than this though. I'll say the the first reveal trailer was a bit more stunning, but it is",
            "start": 2404.56
        },
        {
            "text": "be able to manipulate time in some ways, but uh it seems fascinating. The first trailer was a lot cooler than this though. I'll say the the first reveal trailer was a bit more stunning, but it is kind of cool to see some enemy variety and exactly what you'll be taking on. But uh if y'all haven't seen the first debut trailer, go check that [ __ ] out on YouTube. It was really, really awesome. Yeah, this one uh was kind of hard to watch coming off of a week of a lot of Witcher stuff, right? So, just didn't hit the way I wanted it to and it make it makes it sound cool, but didn't see much of that coming out of this one. And this one for me, uh, still on the slow opening and just kind of heard of like, man, we're still here and I'm looking for something to wow me right now. Uh, well, then I was wowed with Super Meat Boy 3D 2026 coming everywhere. Uh, looks awesome. Looks like a It's Super Meat Boy, but the Mario 3D world kind of a gameplay. I love the homage to the beginning of Mario 64",
            "start": 2457.6
        },
        {
            "text": "was wowed with Super Meat Boy 3D 2026 coming everywhere. Uh, looks awesome. Looks like a It's Super Meat Boy, but the Mario 3D world kind of a gameplay. I love the homage to the beginning of Mario 64 here. And it's not Team Meat. They did notice that. Yeah, they uh during the description of it, we all kind of had a wait, who's working on this? And I don't remember who it was, but it was like spoke about it. Yeah. Something different. I'll say it at the end of the show. That was really fun. Yeah, this is something we've been overdue for a long time. Like I love this style of video game and I think especially in this dimension, it just it looks like a really fun kind of uh even Astrobotesque type of video game seeing the levels of platforming you're going to be getting into. I do love how much the gameplay looks authentically Super Meat Boy, right? Like when we say when we compare it to Mario 3D World, right? Like it's not like um well what was the Little Big Planet um Sack Boy's Big",
            "start": 2501.12
        },
        {
            "text": "much the gameplay looks authentically Super Meat Boy, right? Like when we say when we compare it to Mario 3D World, right? Like it's not like um well what was the Little Big Planet um Sack Boy's Big Adventure where it's straight up a 3D world. This looks inspired by 3D World, but when I look at the gameplay, I'm like, \"This looks [ __ ] tough. This looks fast-paced. This looks insane. This is Super Meat Boy.\" Yeah. And like especially like keeping like I assume this is you looking at all of your runs again and stuff like that. Like all of those little things. It's just like Yeah, they got it. Yeah. That's why I thought it was multiplayer at first cuz I only somehow saw three or four of those little guys and then I saw eight now and I'm like, \"Oh, never mind. Multiplayer.\" Brad stuff. Uh then Ninja Gaiden 4 October 21st. October's busy. It's going to be a busy month. Yeah, man. It's going to be an awesome game, but I I enjoyed this less than Sorry, really quick. Uh just uh we don't get",
            "start": 2547.28
        },
        {
            "text": "Ninja Gaiden 4 October 21st. October's busy. It's going to be a busy month. Yeah, man. It's going to be an awesome game, but I I enjoyed this less than Sorry, really quick. Uh just uh we don't get too far away from Super Meat Boy. In the far or bottom right, we have uh Blugger Sluggerfly head is on there. So, I I assume they're they're helping out with this in some way, shape, or form. Yeah, it was the Sluggerfly. That's the one where we were like, \"Oh, oh, damn. I thought it would only just be a a team meet sort of project. Yeah. Sorry about that. I'm right there with you though, Andy. Like this looks awesome in Ninja Sty 4, but like something about this trailer didn't have the same oomph that the the first one did. And it's not just the surprise of the announcement. Like it's all right that like cool, but also I'm super happy with it. Like this looks exactly like I want a Ninja Gaiden 4 to look. Like I said this while we were reacting, but like I just love video game ass video games",
            "start": 2583.2
        },
        {
            "text": "like cool, but also I'm super happy with it. Like this looks exactly like I want a Ninja Gaiden 4 to look. Like I said this while we were reacting, but like I just love video game ass video games and this this looks like that. So unapologic like it too. Yeah. Uh then we had Indie the Order of the Giants coming September 24th. Uh or September 4th, sorry. Um you you ended up getting into Indie, right? Yeah. I I I liked Indie. Never beat Indie. Barry, did you beat Yeah, that it was on my top 10 last year. Indie was [ __ ] great. Uh, I think once you give into more of what that game is and not the expectation of it being a like a machine games Yeah. like a machine or something inspired by like Uncharted. Yeah. Like once you get into the nooks and crannies there, I think indie is fantastic. And that last like hour or two like really reminded me of like oh [ __ ] it. Like I do really love these movies and how they play with a lot of like history and uh you know like uh religious like",
            "start": 2629.76
        },
        {
            "text": "And that last like hour or two like really reminded me of like oh [ __ ] it. Like I do really love these movies and how they play with a lot of like history and uh you know like uh religious like mythology and all this stuff. It's really [ __ ] good. So uh and I'm really into those systems like Blessing and I really do like the kind of um immersive sim immersive sim type of stuff. So I'm I'm down to get back into that. Uh and like Andy said it's it's insane of like how much Troy Baker sounds like him. It's like I forgot how good he is in that role until we heard him in the trailer. But yeah, I'm really looking forward to that. I'm It's a bit farther away than I expected. I feel like September is like a little like I I would have kind of expected this kind of summer, especially with it just coming out to to PS5 and stuff, but um I'm just a little worried for that just in terms of time like Mike has been saying, just like there there's a lot of gaming right now. So yeah. Uh then we had",
            "start": 2677.76
        },
        {
            "text": "coming out to to PS5 and stuff, but um I'm just a little worried for that just in terms of time like Mike has been saying, just like there there's a lot of gaming right now. So yeah. Uh then we had Beast of Reincarnation. This is come game from Game Freak. What? That's [ __ ] awesome. What the actual [ __ ] Like it's in collaboration with some other teams I saw there, but like this looks really really cool and kind of unbelievable. I just don't understand Game Freak as a studio and like what their like what's their deal? What is their deal? What is your deal? Is this like your vacation from Pokemon? What are we doing? Yeah, cuz once Yeah, it happens once every few years. It feels like once every four years we get like a Game Freak game that's not a Pokemon thing and it's like, \"Oh, all right. Here's Little Town Hero that's now just called Town. All right, here's Beast of Reincarnation.\" And it looks AAA and because it's an on Xbox it actually looks great. Like it has fidelity to it.",
            "start": 2722.64
        },
        {
            "text": "Here's Little Town Hero that's now just called Town. All right, here's Beast of Reincarnation.\" And it looks AAA and because it's an on Xbox it actually looks great. Like it has fidelity to it. Um this is them just proving the haters wrong. Like they saw the reviews of Scarlet. Quit coming at us, dude. We don't have We have 12 month we have like eight months to make a Pokemon game. Yeah. This is Yeah, this is them saying [ __ ] y'all. Like this is what we can do. Looks fantastic, man. There's something about the the visual style looks even, you know, I know when Blackmint Wukong was coming out and how visually stunning that game looked. Th this game is like at that level, I would say it's where it's one of the better looking one of these, you know, in terms of one of these being like an action Soulslike, whatever you want to call it. You see those those uh those parries earlier in the trailer, the the combat looks fantastic and I love sort of this weird implementation of sort of",
            "start": 2764.88
        },
        {
            "text": "an action Soulslike, whatever you want to call it. You see those those uh those parries earlier in the trailer, the the combat looks fantastic and I love sort of this weird implementation of sort of sci-fi elements with this weird mech dude. But yeah, I think the game looks really damn good. Lot of striking visuals in this that look very interesting of like, oh, this is a game that I want to play. So, good for them. I'm stoked on this one. If it wasn't for the Game Freak, this would fall into the category of another Souls Born Samurai. We got to get a super cut of this week of all of these games. There's got to be like eight to nine of these of like you could put all these together in a blender. It's like, yeah, that's the same. But the positive is it's like they might not be for you or you're interested. the good ones shine, right? When there's a good one, it shines. But when you watch those, you're like, I've already seen 10 of these this week, you don't stand out besides the name",
            "start": 2806.96
        },
        {
            "text": "you're interested. the good ones shine, right? When there's a good one, it shines. But when you watch those, you're like, I've already seen 10 of these this week, you don't stand out besides the name Game Freak. See, take Game Freak out of it. Game Freak definitely for me is the thing that's like, what? I'm more interested. But this I put more on the Devil May Cry side of things, which speaks to me a lot louder. And also, I'm getting a lot of Canon vibes. I'm getting a lot of that like more there's some artsy like we're trying to [ __ ] say something here type stuff. Oh, there's also just a way you present a trailer and that I think this is the best way that or this is the best version of one of these I've seen in a while. Like a lot of these games with a lot of these smaller studios that are making these, you know, they're going after the the From Software sort of golden goose. And when we saw, you know, a game that's very similar like that is a game that has a demo out right now,",
            "start": 2846.4
        },
        {
            "text": "are making these, you know, they're going after the the From Software sort of golden goose. And when we saw, you know, a game that's very similar like that is a game that has a demo out right now, which is um Morbid Metal, the one that Ubisoft is publishing. And that game looks amazing, but because it's just I I I don't know if there's like a certain science to it. There's no real way that I can give you the explanation, but there are some Souls likes that should be really awesome and I should be super pumped up about, but the way that they're being shown off, not necessarily. This one for whatever reason, like, and it's not even the game. It's not like I'm expecting, oh [ __ ] Game Freak, they're known for games like these. No, it's not that. This isn't a oh, if you took the Mario name off of it, you wouldn't give a [ __ ] about Mario. Like I don't give a [ __ ] that Game Freak is making a game like this. I give a [ __ ] that the game looks awesome and I think visually it stands out",
            "start": 2884.32
        },
        {
            "text": "of it, you wouldn't give a [ __ ] about Mario. Like I don't give a [ __ ] that Game Freak is making a game like this. I give a [ __ ] that the game looks awesome and I think visually it stands out way more than the other ones. Having said that, I will be utterly shocked if this game is better than a six out of 10. Really? Really? Yeah. I don't think that they have the stuff. We'll see. It looks great. It looks great. We'll see. Cuz I can tell in a lot of games like this where it's like, oh, it's a person standing there. The art direction looks fantastic. This looks great. And then you see it in action, you go, ah, the animations aren't quite there. This doesn't like I think this looks insane. I I think it'll be better than what we expect it to be, but I think it won't run great. We'll see. I don't know, man. I totally understand as far as like I think what I'm seeing in the trailer, I don't know if I don't think I'm going to get I guess I look at the trailer and I'm blown away. I'm",
            "start": 2925.52
        },
        {
            "text": "I don't know, man. I totally understand as far as like I think what I'm seeing in the trailer, I don't know if I don't think I'm going to get I guess I look at the trailer and I'm blown away. I'm like, man, this looks like a [ __ ] fantastic game, but I don't think I'm going to this game's going to come out and it's going to be a 10 out of 10 or a nine out of 10. But I do expect an eight out of 10. You know, I expect like a good I look at that and I'm like, there's an art direction here that's good. There's like the gameplay being presented looks fun. Like it looks like they're doing something here. That feels fresh and fun. I'm I'm about it. Me, too. Hopeful. Uh then we got In Exiles Clockwork Revolution Media trailer, uh coming in due time. So much good stuff here. Yeah, dude. This is one that went on so long that I ended up loving it again cuz around the middle I'm like all right we've been here for quite some time and then they start introducing an the time element and the way",
            "start": 2969.36
        },
        {
            "text": "one that went on so long that I ended up loving it again cuz around the middle I'm like all right we've been here for quite some time and then they start introducing an the time element and the way that that little you know eye of Agamoto [ __ ] time stone works how cool that you how cool that looks and how creative you can be with it. Super awesome. Yeah. By the midway point, they had shown so much that you were like, \"All right, well then show me how the game works.\" And like, \"Show show the game in motion. Let's get this going.\" And they were like, \"Oh, well, we got that.\" And there was just so much good here. It's exciting to see an exile and what they're going to build with this world. I can't wait. You brought up Bioshock, Andy, right? Like, I just replayed Bioshock Remastered and it's like, I want more of that. I can't wait to see that. So, this looks right up that alley. And what a killer. This was probably the trailer of their show. This really showcased. I I agree with that.",
            "start": 3008.72
        },
        {
            "text": "like, I want more of that. I can't wait to see that. So, this looks right up that alley. And what a killer. This was probably the trailer of their show. This really showcased. I I agree with that. Right. This this to me feels like a mixture of multiple games that I love, right? Whether you want to say uh Bioshock Infinite or Dishonored or Outer Worlds, right? Like it feels like a melding of all those things with still some originality left to to to shove in there as far as what they're doing with time and stuff. And for me, like when we get got to that part of the trailer, I was super in. I think the thing that got me in um even earlier than that was seeing the dialogue dialogue stuff and you know the the the ways that the characters having the back and forth the choice of um the NPC character being like yo don't talk to him talk to me and then the dialogue options come up and you can still talk to the dude that's behind him and that resulting in the dude in front killing the dude in",
            "start": 3054.64
        },
        {
            "text": "being like yo don't talk to him talk to me and then the dialogue options come up and you can still talk to the dude that's behind him and that resulting in the dude in front killing the dude in back and like leaving some of his brains on the [ __ ] thing and being like oh brains that's surprising what the [ __ ] Like that is that's a cool scene. That's fun. Like I I love that kind of [ __ ] Um, this game is doing a lot more than I expected it to be doing when we saw it last year. When we saw it last when we saw it last year, like the trailer was [ __ ] dope, but a lot of that was stylistic and getting getting to like, you know, see what this world looked like. Jumping into this trailer and seeing Yeah. all the upgrade [ __ ] that we're doing, the gun customization, the time stuff. This uh scene that I just talked about, I cannot wait for this. This seems insane. Yeah. Only downside, I think we we have to address it, is that not having a date with a trailer that meaty Yeah. deflating.",
            "start": 3091.28
        },
        {
            "text": "scene that I just talked about, I cannot wait for this. This seems insane. Yeah. Only downside, I think we we have to address it, is that not having a date with a trailer that meaty Yeah. deflating. come back. I mean, thankfully we'll forget about it in six to seven months and it'll come back next summer and we'll go, \"Oh my god, it's back and this is awesome.\" Yeah. What is the next trailer that we see for this? Uh, like what's left to show off in this? The dates. That's all. It will just be the dates and we'll be ready. Yeah, I think it's I think it's probably something like that. I think the next spring direct. The only thing next is like Yeah, you're making a direct, right? It's the post direct, but we kind of know next year probably not getting that time slot yet. Developer direct, but like yeah, that's the only way you can come back from this. Get in the show. Just give us a game. Let's go. Game Awards. Yeah, the January direct and you say this game is out in February or",
            "start": 3128.16
        },
        {
            "text": "but like yeah, that's the only way you can come back from this. Get in the show. Just give us a game. Let's go. Game Awards. Yeah, the January direct and you say this game is out in February or something. I think the reason why I'm so pumped up about this game is the same reason why I'm excited for um 007 First Light where it's like I haven't had an Uncharted experience in a while. I haven't had a Bioshock sort of firsterson shooter like that in a while. And this is doing a lot more than that, right? With all of these different towns people and choices being made and the the weapon customization looks really awesome. I'm excited to see how deep that mechanic goes where you're finding these different parts and kind of fitting out the weapon how you want it to be. But I love the creativity with the time manipulation. I think it looks really great. Zika says February versus RE9. There's going to be a big problem when we get to putting release dates onto things cuz I'll prefer versus RE9",
            "start": 3166.32
        },
        {
            "text": "with the time manipulation. I think it looks really great. Zika says February versus RE9. There's going to be a big problem when we get to putting release dates onto things cuz I'll prefer versus RE9 than versus GTA 6. Like those are the choices that these companies are going to have to start making as far as when these games are coming out and you're going to end up in a situation next year where every single month there's going to be a [ __ ] banger ass video game. I also I mean I also for someone like me who isn't I know I'm in the minority where I'm like I'm not a a a Resident Evil fan. I don't know if I I think those are different. Yeah. I don't know if if I wouldn't put that on the level as like, oh, you're putting that out then that's kind of a crazy move. It I I don't think they really worry about that. You know, our audience is going to be playing Resident Evil 9. The different audience, different experience, I would say. Uh, and then we got Grounded 2 coming July 29th, game",
            "start": 3207.36
        },
        {
            "text": "worry about that. You know, our audience is going to be playing Resident Evil 9. The different audience, different experience, I would say. Uh, and then we got Grounded 2 coming July 29th, game preview. Um, there's Buggies as the mounts. What a great name. This is my Obsidian game right here. I know we had a vout earlier in the year. We have Outer Worlds 2 that people are excited about, but this is my Obsidian game, right? That sandbox fun survival crafting game. They've done a great job pushing the narrative and really moving you throughout the backyard. And the idea of wow, Grounded is coming back. A team of like 13 people made this. We sung we, you know, we cheered them on of like, wow, they made Pentiment, they made Grounded. They're pushing these smaller love story games that like they're like, \"Oh, this shouldn't be a thing, but they're making it.\" The idea that they're making a Grounded 2 is special and awesome. There's a big audience for this. The idea of going out to the park",
            "start": 3250.32
        },
        {
            "text": "like, \"Oh, this shouldn't be a thing, but they're making it.\" The idea that they're making a Grounded 2 is special and awesome. There's a big audience for this. The idea of going out to the park now and really expanding upon that and hearing the team taking in all the feedback from Grounded One and what they're going to do with game preview, again, of course, it's going to grow with you. it will evolve, but the idea of kind of frontloading more of the narrative at the beginning is big because they know we dive right into that. We want more. The moment we finish, people will either fall off or they'll be die hards and they'll stay in it. So, having more of the narrative at the beginning, I think is a big win. The idea of being able to ride certain, you know, pests out in the park is going to be a big deal. Having kind of class specific builds is very cool instead of just the generic. You'll be able to put points on, build out your cool assassin or your sorcerer. I think that's an",
            "start": 3294.72
        },
        {
            "text": "to be a big deal. Having kind of class specific builds is very cool instead of just the generic. You'll be able to put points on, build out your cool assassin or your sorcerer. I think that's an awesome idea. And so, yeah, Grounded 2, congratulations, Obsidian, this is crazy. And the Grounded team, this is so fun. I think it makes a lot of sense, too, right? It's a game that had a lot of success. Um, and you have a lot of assets to still play with. you have a lot of bug assets and and grass and you have all the things to kind of make another game like this with, you know, of course you're going to make your own bespoke assets and things like that, but you have stuff to make a sequel with and it already had success. So, yeah, keep on doing it. So, we're 11 games into this and this is the first one that is not coming to PlayStation 5 and I think that has to do with the game preview, right? So, you got to imagine when this does hit 1.0 then it will go more more multiplatform. But I also",
            "start": 3330.96
        },
        {
            "text": "one that is not coming to PlayStation 5 and I think that has to do with the game preview, right? So, you got to imagine when this does hit 1.0 then it will go more more multiplatform. But I also want to point out uh no Switch logo so far. And even throughout the entirety of this whole showcase, there was a Switch One logo for Planet of Lana 2 and then Tony Hawk had the uh Switch one and two logos, but otherwise no Switch at all. Um which goes back to me being a little sad about the state of where the dev kit seemed to have went out. Uh then we had Blubber Team's Kronos, the new dawn fall 2025. Hell yeah. It looked cool. Yeah. Yeah. Blubber team. Uh, you know, we've followed this team from the medium and onward, right? It's like they built up some momentum that I'm on their side. I'm excited. I love a Dead Space type vibe. And yeah, this has got some really scary looking good tone to it that uh I can't wait to try this. It's like the third time we've seen this and I I I really hope",
            "start": 3377.52
        },
        {
            "text": "I love a Dead Space type vibe. And yeah, this has got some really scary looking good tone to it that uh I can't wait to try this. It's like the third time we've seen this and I I I really hope that this could be another big sort of surprise from Bluebird. know the medium kind of bums a lot of people out with how you know just the game itself except for Greg Miller of course and then people having their doubts at Tilon Hill 2 and that game coming out and really kind of shocking everybody and going oh [ __ ] they actually they nailed exactly what they were going for. I love a team expanding upon what they are known for and kind of man we've always wanted to make this style of game. What if we can do it? You know, this is it's it's got to be super exciting for their team to be working on something that's still very scary cuz that's usually where they lean towards, but now doing this third person, you know, survival horror shooter looks really damn cool. Yeah, this one looks very cool. Uh",
            "start": 3424.0
        },
        {
            "text": "that's still very scary cuz that's usually where they lean towards, but now doing this third person, you know, survival horror shooter looks really damn cool. Yeah, this one looks very cool. Uh then we had Elder Scrolls Online June 18th for whatever it was they showed. So, uh the update for you, of course, uh Cult of the Worm little uh Cult of the Worm is coming out. So, you'll have that at the beginning of June. I kind of have your end of Xbox 2025 we'll wrap up with uh and then we'll talk about when we get past all this. But that's June 2nd and June 18th on console. If you're an ESO fan, you'll be excited. If you want to jump into ESO, this will be one of the larger milestones of things going on. Uh it's very cool new area with a giant wall uh dividing the area up into two sections. So, you'll be on one section, then eventually you'll get past the wall. We'll learn more. But me and Greg had a really great deep dive with them on a Games cast where we went through Elder Scrolls from",
            "start": 3471.92
        },
        {
            "text": "you'll be on one section, then eventually you'll get past the wall. We'll learn more. But me and Greg had a really great deep dive with them on a Games cast where we went through Elder Scrolls from the beginning to now and I highly recommend you all to check that out. But if you're an ESO player, you'll be excited. If you like MMOs, ESO is probably one of the most welcoming MMOs you could ever jump into. So, nothing but cool things to uh look forward to and say about that one. It kind of reminds me of the how welcoming like the Fallout 76 fan base is when when newcomers want to join the game and there's so many people out there willing to help and sharper you through experiences. We had Don't Nod's Ailion in collab with the European Space Agency. So it looks kind of neat. I [ __ ] with it. Unless they got a really good call out of a Justant. You saw a lot of that kind of like climbing aspects into this one. It's kind of interesting. Yeah. But then somebody in chat mentioned that it",
            "start": 3516.72
        },
        {
            "text": "it. Unless they got a really good call out of a Justant. You saw a lot of that kind of like climbing aspects into this one. It's kind of interesting. Yeah. But then somebody in chat mentioned that it this made by the banishers team and I don't know if that was like a confirmed thing or if that's just them guessing as well. But I I I I like the direction that Don Nod's taking as far as trying to figure out how to diversify their portfolio. A while ago they put out a uh it was either a press release or something like an update. Maybe it was like a financial call talking about their three pillars. And I can't remember exactly what those pillars were. I think it was like RPG narrative and then I think like a third weird pillar. Climb mountain. climb climb mountain. Um, but like I like that they're trying to figure out like these different kinds of games to make and Banishers came out and I don't know many people that [ __ ] with Banishers, but I know a lot of people that [ __ ] with just",
            "start": 3559.68
        },
        {
            "text": "trying to figure out like these different kinds of games to make and Banishers came out and I don't know many people that [ __ ] with Banishers, but I know a lot of people that [ __ ] with just in Zach Johnson who's the one that said that uh it was Banishers uh says it was a guest to be honest. Okay, dude. Vanishers like could be one of my favorite games if it it was the game that was the behind the third per behind the back third person sort of looking God of War game with a lot of pairing and Soulslike stuff. Mhm. Mixed with some of the best writing and acting you'll experience in a video game. And and I just didn't love the combat enough. Like the combat was like not good enough and frustrating enough to where I dropped to it easy just to get to story stuff. And then some people in chat were be were telling me like, \"Oh yeah, like I I just finished the game 62 hours in.\" I'm like, \"Dude, this does not need to be that long of a game.\" And I that's if you go the extra mile and try to",
            "start": 3600.32
        },
        {
            "text": "were be were telling me like, \"Oh yeah, like I I just finished the game 62 hours in.\" I'm like, \"Dude, this does not need to be that long of a game.\" And I that's if you go the extra mile and try to do everything else. But like legitimately, if you have the means to and try out Banishers, it's some fantastic writing and amazing decision making. And I I I just loved the bones of it, but it's just like the combat was like ah this could be a 15-hour experience and would have blown me away. My and I'll say my beef with Banishers and this isn't real beef, but like my be they [ __ ] broke into my house, stole my [ __ ] Uh my beef with it is that I think the trailers just didn't do a good job of making that game stand out, right? Like we're talking about we're talking this year about all the Souls links, right? And like I feel like there's always the trends that come in and make the games that we see in trailers kind of, you know, um, mold together. And Banishers was for me where I saw it",
            "start": 3643.76
        },
        {
            "text": "links, right? And like I feel like there's always the trends that come in and make the games that we see in trailers kind of, you know, um, mold together. And Banishers was for me where I saw it and I'm like, cool, this game looks exactly like so many other games that I've seen. That's why I really like this game for Aelion where or this trailer for Ailion where we look at this and this looks fresh. This looks different. This looks interesting. Um, and so I think it I would say this if this is the Banishers team or if this is a collab between the Banishers team and just in the Jant team because honestly like it looks like it has stuff from both those. Uh, I'm all about it. I think this is a great direction for what Donut should be doing. Damn. Shout out to Paul Jeremiah. First time subscriber using Prime. Thank you, Paul Jeremiah. First timer. You can be cool like Paul. Uh, next up we got There are no ghosts at the Grand. Interesting. This was a a unique trailer. I'll say that. You",
            "start": 3687.44
        },
        {
            "text": "using Prime. Thank you, Paul Jeremiah. First timer. You can be cool like Paul. Uh, next up we got There are no ghosts at the Grand. Interesting. This was a a unique trailer. I'll say that. You know what I mean? It had us captivated the entire time. Uh, the There are no ghosts of the Grand is a unique narrative-driven musical adventure set against a spooky British seaside town that's bursting with supernatural secrets. Uh, it's day one on Xbox Game Pass, Ultimate, and PC. Uh, this is another one that, uh, not coming to PS5. This was a ride. I still don't know what genre this is. Yeah. First, we thought it was hotel renovator and then, uh, it built off of that of now you're going to renovate the whole city. Of course, you're going to have some fun mystery to it of your father or grandfather used to be the guy and he was helping everybody out. And then all of a sudden, you kind of see there's some clues. You open up a scary door passage and there was a scary like ant monster spider",
            "start": 3721.92
        },
        {
            "text": "used to be the guy and he was helping everybody out. And then all of a sudden, you kind of see there's some clues. You open up a scary door passage and there was a scary like ant monster spider looking thing. So, yeah, we'll see. I I It gave me a We Happy Few uh kind of look from Compulsion Games and I was like, \"Okay.\" And I like Hotel Renovating. I like these Sim games, but the musical game that Tim just read, I was like, \"Okay, well, maybe that's not my game.\" I don't know. Yeah, I really thought it was going to be, hey, every day we open up Steam and there's a new renovator slash, you know, store simulator slash what pawn shop simulator game that's always in the top of the Steam charts. What if we did one of those with narrative kind of being first and then it just turned into a bunch of other stuff? And I'm just still kind of fascinated by the blending of genres. Yeah. Uh then Age of Mythology Reload coming fall 2025. Mike, hey, if you like RTS games, Age of Mythologies is back",
            "start": 3766.64
        },
        {
            "text": "of other stuff? And I'm just still kind of fascinated by the blending of genres. Yeah. Uh then Age of Mythology Reload coming fall 2025. Mike, hey, if you like RTS games, Age of Mythologies is back with uh a whole lot more. I try to read up the small Xbox wire, but it seems like there's a lot coming to that one. Uh Chris tried to get me into Age of Mythology. I'm more of an Age of Empires guy, but it's always cool to see more updates from this. Uh then we had Muang Two Hearts. This is a Korean game 2026 coming everywhere. Looks very special. I I what I really need is a press release for this game. Yeah. I need the description for exactly what it is they're going for and what they're trying to do because we see a lot of vibes. Random gal doing like sneaking stuff. Kind of like the Mary Jane missions in in Spider-Man gave me. I was like, \"Ooh, people didn't like that.\" And then we see crazy supernatural third person shooting with just weird freaky remedy like vibes and I it looks",
            "start": 3815.76
        },
        {
            "text": "Jane missions in in Spider-Man gave me. I was like, \"Ooh, people didn't like that.\" And then we see crazy supernatural third person shooting with just weird freaky remedy like vibes and I it looks awesome. It looks stunning. So Aaron Garst at GameSpot writes about it and says Ever Studio refers to Muang Two Hearts as an immersive blend of tactical stealth, visceral combat, and cinematic storytelling set on a politically volatile uh Korean peninsula. Get that politics out of my game. The nar narrative follows the unification of North and South Korea as a treaty promises to end decades of division. Things aren't as they seem, though. A terrorist organization attacks the South Korean National Assembly on the day the bill was meant to pass, setting off a series of chaotic events across the peninsula. The plot follows the main characters of Xi Jang T, a North Korean soldier who comes to South Korea as part of a military exchange program. Gavei, a member of a K-pop group named Ordo and a",
            "start": 3866.24
        },
        {
            "text": "peninsula. The plot follows the main characters of Xi Jang T, a North Korean soldier who comes to South Korea as part of a military exchange program. Gavei, a member of a K-pop group named Ordo and a terrorist who is known as ID Ghost. That is ID colon ghost. Sick. Players will switch between players switch between the perspectives of Xi Jang T and Gabi throughout the narrative and that's pretty much it. Then they go into the um the studio itself. I'm going to take a guess all three of those characters will meet. Oh [ __ ] Crazy. Whoa. Crazy. Nuts. What a what a wild call by me. 2026 is what they're saying here. Looks cool. Looks awesome. Keep your eyes on this one. Uh, next up we had Thunderfall's Planet of Lana 2: Children of the Leaf. Cool, man. Shout out to Thunderfall continuing to do really really cool special stuff in the indie scene and getting sequels not always guaranteed. So, that's that's a cool thing to see this. What's the time to beat on Planet 11? One to two nights",
            "start": 3911.12
        },
        {
            "text": "do really really cool special stuff in the indie scene and getting sequels not always guaranteed. So, that's that's a cool thing to see this. What's the time to beat on Planet 11? One to two nights maximum. Oh, I think you say hours. It's like it's like 3 to six hours. It's not that much fun. You'll get through it. Yeah. Yeah. If you if you you sit down one night, you'll probably But if not, I think I beat it in two bear when you and I when you were pushing this on me, I I got it. You're still playing vagrant story. Uh I beat in like two or three sittings, I think. Uh taking a small chunk at a time. Uh there are some puzzle things, Andy, but they're like very very light uh kind of thing. Uh good for stupid people like me. I still got to play that despote. Dude, I'm so I'm like halfway through Despote, which means I have like 30 minutes left. I refuse to beat it. Anyways, this is awesome. I love that they're continuing the story with the characters that we knew from the first game and",
            "start": 3961.84
        },
        {
            "text": "Despote, which means I have like 30 minutes left. I refuse to beat it. Anyways, this is awesome. I love that they're continuing the story with the characters that we knew from the first game and not just doing like uh here's a story from somewhere else in the world or something like that. This is really cool. I'm excited to see them built off uh build off these characters and the the lore that gets revealed slowly throughout the first game. Bar, I just added Planet of Lana to my backlog. Good. Add it on there. That's a good game. Play it. Play it. Then we had Fallout 76 gone fishing. Uh fun. I mean another It's interesting when we talk about Microsoft Xbox and the umbrella how they have found these live service games and somehow got them into the fold and they have just survived and thrived. And I think that's a big deal with Game Pass. A lot of Tied IP that people know and love and want to get involved in and they just continue to have updates. Like I said, I think they personally",
            "start": 4004.56
        },
        {
            "text": "And I think that's a big deal with Game Pass. A lot of Tied IP that people know and love and want to get involved in and they just continue to have updates. Like I said, I think they personally did a better job at pacing these all out away from each other, giving them their little quick moment and getting out. Fishing stayed too long, but also at the same time, they were showing, hey, settlements, you can build more stuff in your settlement with the fishing village. I think uh if you like this, you'll enjoy it for sure. Uh and then solo level solo leveling Arise Overdrive coming to uh in 2026. This is another one that is no PS5. Um, we need it. You know what I mean? Solo loving popular anime. It needs a game. Huge. Yeah. So, this is it. Who's Who's making this? Do we know? We can maybe Yeah. Pull up the Let's get to the Oh, damn. I meant to And I I This isn't even the first solo leveling game in the last like six months. I feel like that's been talked about. Uh, at the bottom there.",
            "start": 4045.04
        },
        {
            "text": "Pull up the Let's get to the Oh, damn. I meant to And I I This isn't even the first solo leveling game in the last like six months. I feel like that's been talked about. Uh, at the bottom there. I'll full screen it for you. Marble. Is that what it is? Sounds right. Do. Yeah. If you put a net in front of it. Yeah. Yeah. Uh then we had uh Animo, another one without a PS5. This is that uh weird semi-pokemon like like what is this? Is this AI? Is it not? Who knows? Kind of pal world vibes as well. Um yeah, just make Viva Piñata. Somebody call them up. Give Viva Piñata out there. There's nothing like crazy bless. It has nothing to do with when people come to Xbox for a showcase. They think cute animals. They think bring us Viva Piñata, Phil. That's like me being when they're showing the 007 game being like, \"Yo, where's Banger?\" Cuz I was like, \"No, no, bring back.\" No, no, no, no. It's a colorful game. Yeah. So much of this just like it so many of the visuals look too good to be real at",
            "start": 4093.36
        },
        {
            "text": "being like, \"Yo, where's Banger?\" Cuz I was like, \"No, no, bring back.\" No, no, no, no. It's a colorful game. Yeah. So much of this just like it so many of the visuals look too good to be real at first. That do feel, right? They're just like, \"No.\" And Infinity Nikki a little bit, too. All right. I [ __ ] with it. This will be like POW World where it comes out and they're like 25 million people played it at launch. It's crazy right now. And we're all going to be like, \"Oh [ __ ] that's nuts.\" Yeah. I don't know if it gives me that. And then they'll be sued by somebody 6 months later. I This This is going to be a bold prediction. I think this comes and goes. I don't think we're Do you think it comes? Uh for like a day. For a day. That's a dangerous question to ask him. Uh next up, we got little Tony Hawk. Uh the man himself was there. Little Tony Hawk. He's so small. We got big Tony Hawk at the end with the pinball level. But yeah, this is uh the launch trailer kind of giving us all",
            "start": 4144.32
        },
        {
            "text": "little Tony Hawk. Uh the man himself was there. Little Tony Hawk. He's so small. We got big Tony Hawk at the end with the pinball level. But yeah, this is uh the launch trailer kind of giving us all the little things that people like me have been waiting for. Uh we knew there was going to be three new levels. Now we know what they are. Water park, pinball, and Hollywood Studio, Hollywood movie studio. Uh which looks pretty freaking cool. Um this was the first time we saw a couple of the levels like uh London Zoo and Shipyard from four. So obviously I'm very excited about that. But the big thing is Michelangelo from the ninja turtles, which makes me think we might get the other turtles as well. I love that he has his mutant Mayhem art style. Hell yeah. Could not be more hyped for this little drawn on sort of uh pad still. Yeah, it looks great. Yeah, I'm excited for the demo today. Demo today. We knew demo was coming but didn't know the date. Makes sense for it to be today. What you",
            "start": 4188.16
        },
        {
            "text": "drawn on sort of uh pad still. Yeah, it looks great. Yeah, I'm excited for the demo today. Demo today. We knew demo was coming but didn't know the date. Makes sense for it to be today. What you got? Do we think Spongebob is another secret character? Just cuz they're teasing. Like the other trailer showed that like weird little area got because like we're doing more Nickelodeon collabs with uh TM and T, right? So yeah, I don't think you do a Spongebob level or without the sponge himself. Yeah, you would. You really would hope, dude. I would love Patrick. He shreds. Damn. Uh then we had at Fate's End, dude. Oh man, this legitimately this might be my game of the show. like amongst a lot of amazing looking games. Uh yeah, you know, to see I'm so happy that the Spirit Far team isn't work isn't only working on 33 Immortals just because I am worried about that game uh and and its viability, but to see a a sort of sidescrolling looking game with this level and quality of of animation, it",
            "start": 4232.72
        },
        {
            "text": "only working on 33 Immortals just because I am worried about that game uh and and its viability, but to see a a sort of sidescrolling looking game with this level and quality of of animation, it looks so sick, man. This looks great. Yeah. and mechanically like can we scroll forward? I want to see what's going on in the combat because there was like a weird card thing going on. It looked like there I just the the movement looks fantastic but I I think more importantly a lot of the sort of Yeah, look at that. What is that? Is that just you choosing abilities? Looks great when they zoom in on these sort of um not quite quicktime events, but just, you know, when you mash up with somebody and they just like show that close animation like this. This looks so great, dude. Choosing dialogue right there in that moment. Awesome. Yeah, that's the coolest part for me. Uh then we had Gears of War Reloaded coming August 26th. my friend Saita's birthday. Nice. Happy birthday. Happy birthday. It's",
            "start": 4284.08
        },
        {
            "text": "there in that moment. Awesome. Yeah, that's the coolest part for me. Uh then we had Gears of War Reloaded coming August 26th. my friend Saita's birthday. Nice. Happy birthday. Happy birthday. It's huge. Yeah, I didn't think we'd see this. I thought we'd get EDAY. Um I think this is kind of known. It's interesting on a Xbox showcase. We're showing you, hey, this is coming to other consoles. It's already been here. But I think it is the excitement of hey, if you've never played Gears of War, if you want to get into Gears of War, now is the perfect time to because we're going to put this out everywhere on PlayStation and beyond. And it's going to have a major fan base. People are going to be playing this. You need to get involved with Gears if you haven't already. There has never been a better time. And honestly, Gears of War is one of the best. Man, multiplayer on this was groundbreaking. It was so much fun. It changed the game. I can't wait to see a big player base on this one. All",
            "start": 4337.76
        },
        {
            "text": "time. And honestly, Gears of War is one of the best. Man, multiplayer on this was groundbreaking. It was so much fun. It changed the game. I can't wait to see a big player base on this one. All playing these old school maps and going back. It was the best. How many players can play the co-op campaign? Two on this one. Only two. Okay. Yeah. I'm so pumped to see what accessibility settings there are here because I mentioned in the last time we talked about this the roadie run not like I'm sure at the time while you're watching it's like having a the a [ __ ] ton of motion blur. The roadie run really hard to to look at while you're doing your run and the camera's shaking like [ __ ] crazy. It's in it really it hurts to watch. Uh then we had Persona 4 Revival. No date on this one. Very little actual info shown. Uh Barrett, what what's this do for you? Uh obvious we expected this from the whole voice actor debacle in the last week that people were theorizing it might be like a marketing",
            "start": 4380.32
        },
        {
            "text": "actual info shown. Uh Barrett, what what's this do for you? Uh obvious we expected this from the whole voice actor debacle in the last week that people were theorizing it might be like a marketing beat for this game, but now that we've gotten this reveal, it doesn't feel like that. Uh seeing um is this Inaba uh blessing? Yeah. seeing that like fully realized in the more like uh like Persona 3 Reload uh like uh using I think Unreal Engine like art style and all that stuff. It's like holy [ __ ] this is really cool. This looks really pretty. Uh, the fact this is we've we see so little in this trailer makes me feel like this is this is maybe late next year at the earliest because last year when we got Persona 3 or two years ago when we got Persona 3 Reload announced, I think they said like early 2020 uh or early next year, right? Uh the fact that we saw so little of this and we kind of no uh window here um tells me this is a little bit farther out and tells me that Persona 6 is even",
            "start": 4427.28
        },
        {
            "text": "early 2020 uh or early next year, right? Uh the fact that we saw so little of this and we kind of no uh window here um tells me this is a little bit farther out and tells me that Persona 6 is even farther than that which is uh I don't know. I have a mixed bag of feelings here. Yeah, there's Yeah, I'm with Baron as far as the mixed bag of feelings. I'm regardless [ __ ] excited for this cuz Persona 4 Golden I I would have said if you asked me a year ago I would have said was my favorite Persona, but Persona 5 is kind of creeped up. Um like as I've listened to the soundtrack more and more just thought about that game, but Persona 4 Golden is a [ __ ] specialized video game. Uh but yeah, with how little we we're seeing it feels further out. Uh and then also there was a um a post they made um on I believe this is from their website where they say uh hello this is uh Wada from the Peace Studio. Uh, we are very pleased to announce the release of Persona 4 Revival. We look forward to sharing",
            "start": 4479.2
        },
        {
            "text": "on I believe this is from their website where they say uh hello this is uh Wada from the Peace Studio. Uh, we are very pleased to announce the release of Persona 4 Revival. We look forward to sharing even more information in due time. Persona 4 has spawned numerous spin-off works, including TV anime, Persona 4 Arena, Persona 4 Arena Ultimax, and Persona 4 Dancing All Night, and is a special title uh that has been a part of Atlas for many years and holds a personal place in my heart. We're currently working on this project with all our passion and love. We are confident that this will be a fresh and surprising product for both newcomers and long longtime fans, and we look forward to sharing it with you all. Additionally, we are actively preparing for the future development of the Persona series. As a studio, we're working hard to meet the expectations of fans around the world, and our work is progressing well. Please stay tuned for more updates. We look forward to our to your continued",
            "start": 4521.84
        },
        {
            "text": "As a studio, we're working hard to meet the expectations of fans around the world, and our work is progressing well. Please stay tuned for more updates. We look forward to our to your continued support of the Persona series. So, they're still giving hope for, hey, there's going to be a future of Persona. But, yeah, to Barrett's point, this makes it feel like it's pushed even further out, which on one hand saddens me a little bit, but on the other hand, like, I'm down to play Persona 4 Revival in the meantime. I think my one other thing with this, too, is well, two other things. One, the voice actor debacle now actually feeling like a debacle is weird with how that all happened. Um, but then also this being called Revival. I don't know how I feel about that title. Like I don't know how that relates to rewind and re rerun would have been much better. Revival feels thematically that doesn't feel appropriate unless they are doing the conspiracy theory thing that we that I think I talked",
            "start": 4559.2
        },
        {
            "text": "relates to rewind and re rerun would have been much better. Revival feels thematically that doesn't feel appropriate unless they are doing the conspiracy theory thing that we that I think I talked about last week with the prediction of oh you're doing more to this game like you're doing more than just um porting the original story. Maybe you're going in and adding changes cuz Storm could use some changes. Yeah, the story could use some some major changes. You know, there's also been the the the theory from Andrew Goldfarb for years that I love that maybe Persona 6 is going to start including a a lot of elements uh story elements from Persona 3, four, and five and maybe they add in stuff here to build up to that. Uh that's a big hope though and um we'll we'll see if that actually happens, but um yeah, revival. Don't love the don't love the title there. Yeah. Uh then we had Sea of Thieves Smugglers Tide season 17. We've got a big pop out everybody. Season 17. Uh keeping up with it.",
            "start": 4601.84
        },
        {
            "text": "but um yeah, revival. Don't love the don't love the title there. Yeah. Uh then we had Sea of Thieves Smugglers Tide season 17. We've got a big pop out everybody. Season 17. Uh keeping up with it. Another one, a live service game that is thriving. It is a lot of fun. Sea of Thieves is a really good time with your friends if you ever want to jump in. I am more of a Sea of Thieves when they have the big Pirate Life update where they had it with Disney and Pirates of the Caribbean, Monkey Island. Like that's when it pulls me back in. But you always have a really good game here just sitting there ready for you to play and now it's out on more consoles, more uh more times to play. Uh and then Invincible Versus coming 2026, a tag team fighting game that looks awesome and uh sounds great. Like I'm very happy that Invincible is popular enough that it could be pulling off projects like this. I am a little concerned about it being a tag fighting game when we just had a brand new Marvel one from",
            "start": 4645.52
        },
        {
            "text": "very happy that Invincible is popular enough that it could be pulling off projects like this. I am a little concerned about it being a tag fighting game when we just had a brand new Marvel one from Arc System Works being announced. And also just out of all the things I I love Invincible, love the show, love the comic, I don't know that this is like something that makes sense to me with the IP based on the characters, there are a ton of characters in the world, but I don't know. A lot of them are viltrrammites, you know, a lot of them kind of have that same all right, you got Superman powers. Yeah. Yeah. And even but even on the superhero side, there are like there's like analoges to all of the superheroes we know across Marvel and DC. But like I don't know where's the where the beast what's his name? Battle Beast. Battle Beast. Where's Battle Beast? Why wasn't he in here? He'll be there. Yeah. This seems like someone you got to show up like you got to have some more I would say like",
            "start": 4695.28
        },
        {
            "text": "his name? Battle Beast. Battle Beast. Where's Battle Beast? Why wasn't he in here? He'll be there. Yeah. This seems like someone you got to show up like you got to have some more I would say like diversity in the trailer cuz it's like three Viltromites against Rex Explosion, Adam Eve, and and Invincible. I just I thought we'd see a lot more, you know, clips and and u um footage of other heroes, but just seemed like Oh, wow. It looks cool, though. It looks great. Yeah. Yeah. I I I mentioned this uh during the live reaction, but I got to go down uh and play this game. I can't talk anything about it, but maybe later. You might hear me say something. Maybe later. Maybe later. Yeah. Damn, you're embargoing us. That's crazy. Yeah. Then next up, it's finally happening. Final Fantasy 7 Ingrade remake integrade coming this winter and Final Fantasy 16 Complete Edition drops today on Xbox. Hell yeah. I think that this is a sign that Rebirth will also come and probably part three at launch",
            "start": 4736.4
        },
        {
            "text": "remake integrade coming this winter and Final Fantasy 16 Complete Edition drops today on Xbox. Hell yeah. I think that this is a sign that Rebirth will also come and probably part three at launch hopefully, but depending on PlayStation's exclusive deals, who knows how that'll go, but I think this is an incredible sign. 16 coming is an incredible sign. Square said that they are going multiplatform and that that's going to be the strategy going forward. I love to see that actually happening. I think it's going to be very key to their franchises being able to find the support that they need to continue to be made on the insane budget level that they they have been. So I I urge anybody who's in a character action games to play Final Fantasy 16. I know Final Fantasy 16 gets a lot of hate for what it is and it not being the classic sort of combat. I get that. I I enjoy Final Fantasy 7 Rebirth and Remakes combat more. However, if you're the type of person that watches footage of Final",
            "start": 4784.64
        },
        {
            "text": "for what it is and it not being the classic sort of combat. I get that. I I enjoy Final Fantasy 7 Rebirth and Remakes combat more. However, if you're the type of person that watches footage of Final Fantasy and maybe goes like, I don't want to do these like little like silly activities and writing a little segue to like if you're not into that type of stuff or if you're not into how goofy anime can get tone-wise, 16 is the one for you. You don't got to know [ __ ] about anything. Just play 16. It I love the story so much. Like, the characters are so great. Ben Star is so [ __ ] awesome. And this game has some amazing relationship moments and some awesome characters and hype moments with crazy amounts of budget put into some of these boss fights. New cast of villains. Yes. And like good beef between characters. We don't talk about like how important beef is enough. Yeah. Like when two characters just [ __ ] hate each other. Oh, shout out to 16. Shout out dude. Uh and then we got Double",
            "start": 4827.04
        },
        {
            "text": "between characters. We don't talk about like how important beef is enough. Yeah. Like when two characters just [ __ ] hate each other. Oh, shout out to 16. Shout out dude. Uh and then we got Double Finds next game, Keeper, coming October 17th. This is another one without PlayStation 5 on it. Um, my prediction was wrong. It's not a licensed game, but it looks cool. You are a lighthouse. It looks very double fine. Very double fine. Lot of colors. Lot of the great visuals. Got my eye out for this one. Great visuals, man. Like, I think my, you know, I I don't think Psychonauts 2 was ever the best looking game, but it's an awesome video game in its totality. This game looks really visually stunning in some of these moments where it's the lighthouse is crawling through like that little tunnel and the water looks great. Every this looks radar. Uh yeah, I'm super stoked for this. Uh again, like that I appreciated that uh that prediction uh Tim, but like Double Find just doesn't seem like the",
            "start": 4880.56
        },
        {
            "text": "the water looks great. Every this looks radar. Uh yeah, I'm super stoked for this. Uh again, like that I appreciated that uh that prediction uh Tim, but like Double Find just doesn't seem like the studio to want to work with like other IP. like let them let them get weird with their their own imagination and creations and this being something that like feels like a total like in between of like kind of what people expect from them from Psychonauts in terms of just being like kind of a 3D action or not even action but 3D adventure game but just being something super weird. Uh I love that like I think this whale might be pulling from the one of the game jam things from uh that we saw in uh Psych Odyssey. So, I wonder if this game is pulling uh a lot of ideas from that original concept, which I'm really excited about. Um, yeah, I highly recommend I I forget to uh what Fortnite um documentary it is, but I I think we see a little bit of that in there if anybody's interested. Um, and then I",
            "start": 4927.2
        },
        {
            "text": "I'm really excited about. Um, yeah, I highly recommend I I forget to uh what Fortnite um documentary it is, but I I think we see a little bit of that in there if anybody's interested. Um, and then I also just wanted to see this is also just uh as far as we see Xbox Series X and S, which I do wonder as why of like the the visuals of this looking much better, right? cuz Psychonauts 2 I think was last gen as well. So um them kind of focusing just on kind of current gen hardware I think is uh giving them the kind of fidelity push that uh we want from them. Did you say Fortnite? Yeah. The their game jam stuff is called Fortnite. Not Fortnite as in the video game, but Fortnite as in the actual word Fortnite. They get two weeks to develop little game projects. Double fine being double fine. Love that. Don't change. Hello. Elbow in chat says, \"I'm not playing as a lighthouse. Sorry.\" Oh, man. I can't wait, brother. Have some whimsy. Whimsy. Get out of your comfort zone, man. Like, I know you",
            "start": 4977.12
        },
        {
            "text": "that. Don't change. Hello. Elbow in chat says, \"I'm not playing as a lighthouse. Sorry.\" Oh, man. I can't wait, brother. Have some whimsy. Whimsy. Get out of your comfort zone, man. Like, I know you don't like lighouses, but like give it a chance. I need a screenshot of just bless him where he is right now with like, you know, the meme format where it's just a quote and say, \"Brother, have some whimsy.\" Cuz I agree. I agree. [ __ ] whimsy. I totally agree. Uh, and then we got Call of Duty Black Ops 7 to close the show out here. I got a little rundown from the blog. I'll give you the full updates on that because we do have the blog post over on Call of Duty's blog. Uh, this is Call of Duty Black Ops 7 from Treyarch and Raven Software. This is a full package again for the first time in franchise history. They're going back to black backto back with Black Ops uh games set 40 years after Black Ops 6. So, welcome to 2035. Max Cox's general manager uh talked to the team and the blog a",
            "start": 5027.52
        },
        {
            "text": "franchise history. They're going back to black backto back with Black Ops uh games set 40 years after Black Ops 6. So, welcome to 2035. Max Cox's general manager uh talked to the team and the blog a little bit more about the how they're planning the Black Ops 7 full package so you can it says prepare to squad up with friends or play solo in a thrilling and innovative co-op campaign. Harness near future weaponry in a signature multiplayer experience packed with brand new maps and descend into the next twisted chapter of round-based zombies in the heart of the dark ether. I mean, I wish they have all the time that they needed to work on this, Mike, because by the end of this, by the end of Black Ops 6 and playing that story. Like, everybody in the chat who had never experienced that campaign, including me who was experiencing it with them, was like, \"Holy [ __ ] let Raven make a campaign game. Let them just like really, really work hard on doing an awesome single player experience.\" And",
            "start": 5072.64
        },
        {
            "text": "including me who was experiencing it with them, was like, \"Holy [ __ ] let Raven make a campaign game. Let them just like really, really work hard on doing an awesome single player experience.\" And like again, everything that they showed so far until we had the Call of Duty thing. We're like, nah, multiplayer, whatever, whatever. This looks like it's gonna be awesome as hell. I want to see them continue to get super creative with their campaigns. Yeah, Treyarch has been cooking. We love the Black Ops universe. This is kind of one of those of everybody's been screaming, \"When do we get off the hamster wheel and give the teams a little more time and let them build stuff out?\" But of course, we know the annualized franchise of Call of Duty is a juggernaut. We're never leaving that. So, it's wild to see this team have back-to-back at bats. Hopefully, the next team is getting more time and hopefully this has got a lot of time because Andy, you're so right. The campaign of Black Ops 6 was",
            "start": 5126.24
        },
        {
            "text": "wild to see this team have back-to-back at bats. Hopefully, the next team is getting more time and hopefully this has got a lot of time because Andy, you're so right. The campaign of Black Ops 6 was awesome. You got to play that. The issue that I read here is, you know, me, I love playing with friends. I like the idea of a co-op campaign. My worry though is we saw them try to get innovative or innovate and they tried to do a co-op campaign in Modern Warfare 3 and everybody said, \"Oo, that was a miss, right? That was the shorter one that had the open world missions and we said, \"Oh, you can beat that in one sitting.\" That wasn't it, right? Like coming off of Black Ops 6, I want this campaign to be awesome and great. The idea that it could be co-op. Hey, that's even better for me. I love that experience. I really hope that it gets the time and I hope that it's awesome. The idea of building off of multiplayer, sure, we're going to add in futuristic guns. Who knows if we'll have wall",
            "start": 5168.4
        },
        {
            "text": "that experience. I really hope that it gets the time and I hope that it's awesome. The idea of building off of multiplayer, sure, we're going to add in futuristic guns. Who knows if we'll have wall running and crazy stuff like that. You would assume we'll get to the future stuff, but the idea of let's let's just build off of Call of Duty, give you some like DLC. It's going to be a new name and a new buy, but like we're just building off of Black Ops 6. That's great. You know, it'll be interesting to see. The chat just went by, so sorry I don't have the name on it, but uh apparently Hollywood Reporter uh just announced that Michael Rooker, Milo, and Kieran Shipka are going to be in Black Ops 7. That's pretty cool. I mean, there's a couple things to talk about. Jaw, shout out to Jaw for that. Black Ops is exciting, but that Phil message is where we got to hang. That Phil message that got us confused with Black Ops, but saying, \"Hey, we're celebrating 25 years, and there's a team here.\"",
            "start": 5213.68
        },
        {
            "text": "Black Ops is exciting, but that Phil message is where we got to hang. That Phil message that got us confused with Black Ops, but saying, \"Hey, we're celebrating 25 years, and there's a team here.\" He brought up Gears and Fable. There's one more. Morta and you're like, \"Oh [ __ ] Phil. What is that, Phillip?\" I mean, you know what it is. Yeah, but is it Halo 1? Are we rebooting? Is it Halo something else? It's exciting, too. It's Halo 1 remake. 25 years of Halo 1. It's going to be Halo in um Unreal Engine 5. It just makes too much sense. Like, they put out that Unreal Engine 5 image of Chief or was it even a short video or something, right? Like a clip of him doing that. I think I think it was just the image, but but it was the OG armor. Yeah, exactly. Like I I feel like that's gonna they're going to put that out and then eventually the Halo Next or whatever is is later. So yeah, I'm I'm stoked for that and yeah, I love it. I Fable for Gears and Halo all in one year celebrating the",
            "start": 5254.72
        },
        {
            "text": "going to put that out and then eventually the Halo Next or whatever is is later. So yeah, I'm I'm stoked for that and yeah, I love it. I Fable for Gears and Halo all in one year celebrating the 25th year of Xbox. That feels right. That's exciting stuff. That's wild and it's going to be awesome cuz that's definitely going to be multilat which means it's going to have an insane install base. Everyone's going to be jazzed up on it. You're giving Gears of War and Halo a really great chance to kind of reemerge, get a new player base, and really come back and be great. It's going to be awesome to see those two games thrive. Uh, we got a bunch of super chats I want to get through to close out the show today. Uh, Braden Mark says, \"I thought Call of Duty was going to stop being annual.\" Never, buddy. When did they say that? That will never happen. Small Hands TV says, \"Le from Team Cherry confirmed Silk Song's coming out before the holiday.\" So, getting a lot of confirmations here from",
            "start": 5299.52
        },
        {
            "text": "buddy. When did they say that? That will never happen. Small Hands TV says, \"Le from Team Cherry confirmed Silk Song's coming out before the holiday.\" So, getting a lot of confirmations here from people. Yeah, I can't imagine uh Matthew Griffin, who was the the lead PR of that as well as the lead PR of um the other very Hollow Knight looking game with the Crow Mask. Well, Crow sworn. Um I got to imagine the DMs are blowing the [ __ ] up right now. We'll see. Mhm. Uh RDJ says, \"No Starfield DLC or PS5 launch date. pretty surprising, right? But I like it's weird because I think I I was bringing up that, you know, are we going to get PlayStation being named here like, you know, or are we just going to see logos? And that was one of the discussions and we did get Gears of War remastered saying like it's going to be playable everywhere to everybody on whatever you know and if PlayStation's really the only place that Starfield is not at, I wouldn't I'm not surprised that you aren't on an",
            "start": 5346.2
        },
        {
            "text": "like it's going to be playable everywhere to everybody on whatever you know and if PlayStation's really the only place that Starfield is not at, I wouldn't I'm not surprised that you aren't on an Xbox showcase saying, \"Hey, remember that one game that you bought your Xbox for? It's also going to be on PlayStation.\" I'm not super shocked by that. I am surprised by a DLC sort of announcement and I think that we'll get whatever Starfield DLC or or Starfield on PlayStation news in a press release or in a tweet or in a whatever some sort of announcement maybe Gamescom the DLC. Uh and then we got uh Cody Brandon saying no Starfield DLC in Elder Scrolls 6. I think the show is crazy. Also, Obsidian going hard to clean the slate almost guarantees they're making Fallout, right? I feel like Fallout's common. Um, but yeah, Elder Scrolls 6, like no one should have expected to see that here. Yeah. No, Starfield. Yes. I I I'm surprised it wasn't here. No. Replaced. That's a great call out. Rabbit on",
            "start": 5402.96
        },
        {
            "text": "common. Um, but yeah, Elder Scrolls 6, like no one should have expected to see that here. Yeah. No, Starfield. Yes. I I I'm surprised it wasn't here. No. Replaced. That's a great call out. Rabbit on crack. Last time we saw replaced because I I feel like I gave up hope a while. It was at Summer GameFest playable last year. I played I played it last year. They were playing it. Oh, well, I'm bad. My bad for giving up hope. I'm a bad replace team. I mean, well, I have Well, you know what? I'm thinking of the other game. What was the game that was announced in like 201? That's what I'm thinking of. No, Replace is the one that looked like the last night. I was like, oh, cool. We're getting a different dev working on this on a a game of that style. Uh, and then I played it and I was like, h, combat's kind of whatever. And I I hope that, you know, things are are in the oven right now cooking. Uh, and then Elite Tub says, will we ever see Crash Team Racing 2? Am I holding false hope? We got",
            "start": 5457.76
        },
        {
            "text": "kind of whatever. And I I hope that, you know, things are are in the oven right now cooking. Uh, and then Elite Tub says, will we ever see Crash Team Racing 2? Am I holding false hope? We got Crash Nitro Kart on the PlayStation 2. I think that was the closest we'll ever get. I don't think we're seeing a Crash Team Racing sequel at any point. Lucky if we ever get another just Crash Bandicoot game that isn't uh what was it a uh it's about time moa. Oh, Crash. We'll definitely get Crash Rumble. So, well good time. We were number one. Yeah. Top team NA. And then we played a team that knew what they were doing. Turned it off. Started the next game. Uh, Alec Taylor says, \"So, is this Xbox Play Anywhere just cloud gaming or do you natively play Xbox games on it?\" And this is what I was talking about of how confusing all this branding is. So, Xbox Play Anywhere just means that you could buy the Xbox game via Xbox and you can play it on your PC or your Xbox or get rid of that device. You got",
            "start": 5501.44
        },
        {
            "text": "about of how confusing all this branding is. So, Xbox Play Anywhere just means that you could buy the Xbox game via Xbox and you can play it on your PC or your Xbox or get rid of that device. You got to get rid of that. It should just be your Xbox. You can't play it on PlayStation. Like, that's PlayStation does not is not part of Xbox play anywhere cuz that's not how that works. Is Nintendo part of Xbox until they put their games? No. until they have that feel. When did play anywhere start? I feel like was that one Xbox was a cloud thing. No, no, you're right. It's PC. Exactly. And the cloud's a separate thing. And then then the the RO the Xbox ROG the Xbox ally uh can natively play Xbox games. It can also remote play via the cloud. Yes, they got to get rid of it because of like cuz this is the reason why you're able to play Xbox stuff on this one is because Xbox partnered but also it's just a PC thing to download the games. Yeah. Yeah. Cuz it's a PC. Yeah. Yeah. Exactly. That should",
            "start": 5547.04
        },
        {
            "text": "is the reason why you're able to play Xbox stuff on this one is because Xbox partnered but also it's just a PC thing to download the games. Yeah. Yeah. Cuz it's a PC. Yeah. Yeah. Exactly. That should be expected. Yeah. I know. But that that's the things the Xbox play anywhere just means when you buy the one code Yeah. you you have it on console and the PC anywhere that has the it's got a different skew. But that's been true for all Xbox games, right? Since they've introduced Play Anywhere, which is why they keep pushing that. Yeah, I think it was it was a marketing push that made sense when it was new back in 2013. I don't think we need to keep pushing it now. I agree. I like it. No, I think Yeah, you're going to push this forever. They're welcoming you to the ecosystem. And when we bring bring that up, it's like you buy this once on an Xbox branded storefront, it's going to be on those anywhere you want to play. I think it makes sense except they're also pushing a bunch of other",
            "start": 5594.16
        },
        {
            "text": "bring that up, it's like you buy this once on an Xbox branded storefront, it's going to be on those anywhere you want to play. I think it makes sense except they're also pushing a bunch of other things at the same time. Like that's where I 100% agree with Tim where you have Xbox play anywhere like in between all these trailers and I'm like I know like I already know that I can play the stuff anywhere. I feel like you just have to I think I feel like people at this point understand that when you buy something on Xbox that means you're buying it on PC as well. I don't know. I think they're going to be I think they're going to say this for the next five plus years. They'll probably say this forever. Bless like they're getting a new fan base. They're trying to garner a new fan base to come in to a losing platform that was Xbox proper with the consoles and say, \"Hey, we're here. We want to encourage you that if you spend your money, it's going to be everywhere.\" And they have to They're",
            "start": 5635.68
        },
        {
            "text": "in to a losing platform that was Xbox proper with the consoles and say, \"Hey, we're here. We want to encourage you that if you spend your money, it's going to be everywhere.\" And they have to They're going to do that forever, bro. They'll do that forever. Yeah. Yeah. They're never dropping it. And we people will always be confused like Alec Taylor, right? Again, like this is an Xbox is a better branding slogan. Uh and then we have the final one of the day. Mr. Nice Guy Ryson, you guys crushed it all week. Welcome back, Mikey. Thank you so much. And thank you everybody for hanging out with us this week and for continuing to hang out with us each and every weekday. Uh we're all about live talk shows. We do games daily, breaking down the biggest video game news every morning. Games cast talking all about video game reviews, previews, predictions, big topics in gaming. We do a whole bunch of games streaming as well as in review where we review, rank, and recap different movie franchises.",
            "start": 5673.12
        },
        {
            "text": "all about video game reviews, previews, predictions, big topics in gaming. We do a whole bunch of games streaming as well as in review where we review, rank, and recap different movie franchises. We're kicking off with Superman in review this week. And a little tease this week we're also getting our Mario Kart World review and our Nintendo Switch 2 review so far. Uh in addition to a whole bunch of other great content. Thanks for hanging out with us. Have a fantastic day. Goodbye. Bye everybody.",
            "start": 5713.6
        }
    ]
}