{
    "id": 14212,
    "video_id": "9_QULa8rBAY",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Blessing Adeoye Jr."
    ],
    "title": "Unboxing the Nintendo Switch 2! - Kinda Funny Games Daily 06.04.25",
    "description": "Go to http://kindafunny.com/XREAL to grab yours now!\n\nWe have the Nintendo Switch 2, Ubisoft is officially not having a showcase, and what is happening with MindsEye??\n\nToday after, KFGD, you’ll get:\n- Ballerina in Review\n- LATER, at 1:45pm we’ll react to the PlayStation State of Play\n- After that is a Gamescast breaking it down.\n- TONIGHT, going into Thursday morning, tune in as we pickup, unbox, and play our Switch 2's for the very first time!\nIf you’re a Kinda Funny Member:\n- Today’s Gregway\n\nTime Stamps:\n00:00:00 - Start\n00:04:33 - Housekeeping\n           -  The Roper Report   -\n00:06:26 - Let’s unbox the Nintendo Switch 2\n00:37:13 - More Switch 2 Coverage\n00:39:03 - There will be no Ubisoft Forward this year, for the first time since it started\n00:46:03 - MindsEye studio execs depart Build a Rocket Boy, one week before game's debut\n00:50:50 - Sydney Sweeney’s ‘Split Fiction’ Movie Lands at Amazon\n00:54:02 - Phasmophobia Movie Coming From Blumhouse To Haunt Theaters\n00:59:33 - Surgent Studios announces horror game Dead Take with Pocketpair Publishing\n01:03:08 - Required Reading: An Update from Aggro Crab\n01:05:43 - Wee News!\n01:07:29 - SuperChats & You‘re Wrong\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1749061840,
    "duration": 4503,
    "transcript_chunks": [
        {
            "text": "Today in the nerdy news you need to know about, we have the Nintendo Switch 2. We weren't expecting it. Throw the runner show out the window. We'll have all this and more because this is kind of funny games [Music] daily. What's up everybody? Welcome to Kind of Funny Games Daily for Wednesday, June 4th, 2025. I'm one of your hosts, Greg Miller, alongside Forbes 30 under 30, aka New York Game Awards nominated, aka Dontober Fiend. Blessing, Eddie Yoay, Junior. I woke up this morning and I was ready to come into this episode being very gloomy, being very upset and sad cuz I saw online other people like Jordan Midler already had their Nintendo Switch twos. Sure. And I was like I was going to come in I was going to be really like, \"Oh man, what's going on here? I can't believe I don't have I don't believe I can't believe we don't have ours yet.\" Yeah. And the fact that I'm looking at the boxes right now warms my heart. Uh yeah, ladies, gentlemen, NBS, you may have heard that of course",
            "start": 3.76
        },
        {
            "text": "I don't believe I can't believe we don't have ours yet.\" Yeah. And the fact that I'm looking at the boxes right now warms my heart. Uh yeah, ladies, gentlemen, NBS, you may have heard that of course Nintendo Switch 2 weren't going out for review ahead of time. That was a well-known factoid out there. We had been told by Nintendo at some point in the launch window. We would get units from them, a couple of them. We we have two, one to me and one to Tim. Uh that we would then be able to use. We didn't know when that would be. We didn't expect it right now because of course uh we are going to the Nintendo store tonight. Uh we are streaming from the Nintendo store tonight for the actual worldwide launch and stuff. So, a lot of interesting things happening. But we do in fact, if you are an audio listener, have the Nintendo Switch 2 regular, no Mario Kart, Nintendo Switch 2 Pro Controller, Nintendo Switch 2 camera, and the Joy-Con 2 wheel set of twos. It feels like Christmas. It does.",
            "start": 62.08
        },
        {
            "text": "audio listener, have the Nintendo Switch 2 regular, no Mario Kart, Nintendo Switch 2 Pro Controller, Nintendo Switch 2 camera, and the Joy-Con 2 wheel set of twos. It feels like Christmas. It does. Christmas in June. Yeah. Yeah. 100%. How How do you feel right now? I love We live for this. Yeah. Right. Like this is like I My whole Gregway is about um what a day to be a gamer, right? Because of course it's the kickoff of this, but then of course there's SGF, but then there's the Microsoft. There's so much happening at once, right? What an embarrassment of riches. And so, I'm so excited to be part of this and have the excitement. And then, of course, today they're like, \"All right, well, what do we do with the rest of the day?\" Cuz there's no embargo now. We have it. We can go like, \"We're going to we're going to open it up. We're going to look at it. We're I've never touched the Nintendo Switch 2. We're going to get online. We're going to see what we can get, what we can't get all the",
            "start": 99.84
        },
        {
            "text": "going to we're going to open it up. We're going to look at it. We're I've never touched the Nintendo Switch 2. We're going to get online. We're going to see what we can get, what we can't get all the stuff.\" And then it's like, \"Okay, well, Ballerina in review. We moving that. Are we sticking with that state of play? We are going to do that big uh skip the state of play. You're going to do the best that's PlayStation play the Switch. We were going to do our kind of funny uh launch party for the Nintendo Switch 2 all night into games daily, but I feel like that's changed now, right? So, at the very least after the reaction, the Games Cash reaction post show to State of Play, we're starting the launch party early going into this. Will it only be we're playing like the Pokemon game with the updates or checking out Mario Galaxy? Maybe, probably, whatever. But we're going to ride the lightning. Yeah, it's special to be in a time where everything is happening at once the way you're talking",
            "start": 140.8
        },
        {
            "text": "updates or checking out Mario Galaxy? Maybe, probably, whatever. But we're going to ride the lightning. Yeah, it's special to be in a time where everything is happening at once the way you're talking about cuz all that stuff plus it's all the games that are coming out, right? Cuz there's the Switch launch lineup. The Toby Fox tweeted out that Delta Rune is available right now. So, I'm I'm trying to get answers for can I play chapter 3 if I just play if I boot it up on my Switch 2 or do I have to like go to like my computer at home has the save data from beating chapter 2 and all that stuff? I'm trying to figure that out. And at the same time, we have codes for like a big game coming out that I also want to put a lot of time into. That's too we can do I appreciate that. I appreciate you hiding that. Yeah. Yeah. So, I'm like juggling all these things and it's like the it's the gift of um is it Sabrina the Teenage Witch all the pancakes. Yeah. Yeah. That's what I That's how I feel feel",
            "start": 174.32
        },
        {
            "text": "that. Yeah. Yeah. So, I'm like juggling all these things and it's like the it's the gift of um is it Sabrina the Teenage Witch all the pancakes. Yeah. Yeah. That's what I That's how I feel feel like right now. Well, of course, everyone's here to see this unboxed. Uh I see the Twitch chat popping off demanding, of course, that I rip it open as I've been known to do on one or two things, but that would be rude. Blessing. You go ahead and unbox it. I know how much the Nintendo Switch means. I had a story number one. We can do it right now. Oh, you want me? I can do it. Okay. Sure, sure. Sure. I'll give you the rigor. Remember that this is kind of funny games daily each and every weekday on a variety of platforms. We run you through the nerdy video game news you know about live on twitch.tv/kindfunnygames. YouTube.com/kindfunnyames and of course podcast services around the globe. If you love what we do here, these kind of shenanigans changing our entire programming day on the whims of",
            "start": 214.0
        },
        {
            "text": "YouTube.com/kindfunnyames and of course podcast services around the globe. If you love what we do here, these kind of shenanigans changing our entire programming day on the whims of Nintendo, why not toss us a couple bucks? Of course, over on patreon.com/kindfunny, youtube.com/kindfunny games, Apple and Spotify, you can pick up the kind of funny membership. Of course, with the kind of funny membership, you get all of our shows ad free. That's more than 20 a week, more than 80 a month, and you get your daily dose of me, Greg Miller, in a series I call Greg Way, which is 15 to 20 minutes of me answering your questions, talking about what's going on, giving you reviews of The Rock Ally, or maybe a different game like Fantasy Life Eye, which I can't wait to play on my Switch, too. Let's go. Also, Barry, is there if there's like a small knife we can get? You want you want to do like the Greg way. You don't want to do Yeah. Yeah. No, I'm not doing that thing. Open like a good old rib cage.",
            "start": 252.12
        },
        {
            "text": "Barry, is there if there's like a small knife we can get? You want you want to do like the Greg way. You don't want to do Yeah. Yeah. No, I'm not doing that thing. Open like a good old rib cage. Of course, no bucks toss away. No big deal. Like, subscribe, share. If you're watching on Twitch, remember if you have Amazon Prime, you have a free Twitch Twitch Prime subscription that we'd love you to give us. They don't remind you. It doesn't autorenew. It happens every 30 days. You got to give it to somebody. And we think it should be us. Uh housekeeping for you. Remember, we're an 11 person small business all about live talk shows. today after kind of funny games daily. You're supposed to get Ballerina in review. Maybe we push it m to play more Switch. Maybe we find out there's not enough going on in Switch and we just instead Ballerina in review, take our break, come back for a pre-show to State of Play uh at 1:45, react to the State of Play, do the Games Cast after, and then after that",
            "start": 288.64
        },
        {
            "text": "on in Switch and we just instead Ballerina in review, take our break, come back for a pre-show to State of Play uh at 1:45, react to the State of Play, do the Games Cast after, and then after that jump into a very long Nintendo Switch 2 stream where we go into the night, we broadcast from the Nintendo store, we try Pokemon, do that, and then figure out what's going on from there. And of course, tomorrow streaming it all day long. But I digress. Uh, we will be figuring that out with you. Remember, if you're a kind of funny member, today's Greg Way is about what a time it is to be a gamer. I want to say it's like 17 minutes, but I didn't write that down because it's been a crazy morning. Thank you to our Patreon producers Carl Jacobs, Omega Buster, and Delaney Twining. Today, we're brought to you by XRE. We'll tell you about that later. For now, let's begin the show with what is and forever will be the Roper Report. Time for some eight items on the rope report does it. I'll tell you",
            "start": 325.76
        },
        {
            "text": "to you by XRE. We'll tell you about that later. For now, let's begin the show with what is and forever will be the Roper Report. Time for some eight items on the rope report does it. I'll tell you straight up. They're not all getting equal time. Number one, let's unbox the Nintendo Switch 2. Hold on, Bless. I'm coming. Are you going to Sky Cam? What are you doing? Oh, you're going to you're going to come the camera, but I'm going to give him something uh to use to cut. Yeah, the Switch two box itself doesn't need a knife. It's the other ones I do. So, I can get a Hold on. Let Let him get out of here with his You come with a camera. What are you doing? But or is it you're using the same knife? I think he's going to come. I thought he was coming out. He's going to come rock camera three manually over here. Gotcha. Gotcha. Gotcha. Bar Courtney, everybody. Round of applause for him making it happen out here. All right. There he is. It's upside down. I'm holding it. I'm holding I'm holding",
            "start": 362.0
        },
        {
            "text": "over here. Gotcha. Gotcha. Gotcha. Bar Courtney, everybody. Round of applause for him making it happen out here. All right. There he is. It's upside down. I'm holding it. I'm holding I'm holding it. Yeah. Open that upside down. There we go. So, we got the Joy-Con grip. Nobody wants this crap. Unbox the Switch. All right. Show me. Show me. Show Listen, the switch is ready. Show me. Show me the cable. Here's the cable for the thing. Actually, we do have to start charging. Oh, this is the dock. We got the Oh, I'm not seeing Is this your first time holding a dock? This is my first time holding the dock, and it feels more expensive. You ever had a dock that big? I mean, it's arguable. Put that to the side. Let's see how Oh, there's the switch, too. Hold on. Hold on. Hold on. Just loose. Loose like trash. You left. Yeah, they packed this in a really interesting way. You did it though. You did it the crazy way. Oh, you should open the small side, not the big side. That's on you. And here's",
            "start": 404.4
        },
        {
            "text": "like trash. You left. Yeah, they packed this in a really interesting way. You did it though. You did it the crazy way. Oh, you should open the small side, not the big side. That's on you. And here's the here's the base itself. Here's the console itself. I feel bad for touching the screen. Got to. You got to. It's the only only way to do it. Now, should I remove the film? The protective film. Hold on. Before I hold it up, I'm going to uh unbox the JoyCons and connect the JoyCons. God, this is so nice. It really does feel like Christmas. All right, here we go. I'm going to clap on the first magnet. I got to take You want to read the instructions? Yeah. Let's bust out the instructions. Oh, there we go. No, that clapped on. There it is. [Music] The Nintendo Switch 2. It's upside down. The Nintendo Switch 2. Oh, shoot. Hold on. Hold on. Hold on. Hold on. There we go. The Nintendo Switch, too. There you go. Oh my gosh. All right. Now, hold on. I've never held one. Yeah. There. There you go.",
            "start": 454.56
        },
        {
            "text": "Switch 2. Oh, shoot. Hold on. Hold on. Hold on. Hold on. There we go. The Nintendo Switch, too. There you go. Oh my gosh. All right. Now, hold on. I've never held one. Yeah. There. There you go. Oh, man. Okay. It feels thinner, does it? I from from somebody who was using the my Switch last night. Yeah, I think it it's the way maybe the the Joy-Cons definitely feel slimmer in my hand, making the whole thing feel slimmer, even though I don't know if that's accur actually accurate. Huh. Oh, the sticks. I like that. Oh, I like that stick. Now, where is where's the where is the the block? It's right next to you. I put the charging I put the charging cable into it so we can keep it charging. Perfect. Okay. Yeah, you read my mind. I I don't know Baron if we can get a stinger out here like a extension cable to get it up higher in in the center because right now it's we can plug it in over there. I Yeah, you can feel free to pull it out of the dock, the power cord and put it into the system",
            "start": 516.32
        },
        {
            "text": "cable to get it up higher in in the center because right now it's we can plug it in over there. I Yeah, you can feel free to pull it out of the dock, the power cord and put it into the system itself. I just put it there so it didn't keep sliding down on you. That way we could do more with it. Log in there and see what's up. You've held the Switch too. Now, how does it feel? I like that a lot. I like that. Again, I feel like it feels slimmer for me. It just feels more expensive. Like I think technically I guess I I I see what you're saying as far as the Joy-Cons. Like I think there's a sleeker feel to it that makes it feel a little bit a little bit more Yeah. I guess yeah. Slimmer. But overall like I think my thing is I like how I like how much bigger the screen is. Oh my god. It just turned on. It just turned on. I I didn't even press a button. Hold on. He's so happy to see it turn on. Now do you want to go through the first steps because I if this is going to be your switch. This is",
            "start": 581.84
        },
        {
            "text": "on. It just turned on. I I didn't even press a button. Hold on. He's so happy to see it turn on. Now do you want to go through the first steps because I if this is going to be your switch. This is a great question. So what are we doing here? Because Yeah. I are if this has been a big conversation of what we're doing. What the [ __ ] are we doing? What are we doing? Like I have no I So you don't think you're Would you You're going to go to volleyball tonight? I got volleyball tonight. Okay. Okay. And I I Here's the thing. I would skip volleyball. I know people are probably like volleyball. I skipped I missed the last two weeks cuz sure and I'm the captain so I got my The whole plan tonight for the marathon stream was me to leave my Switch here. So, I I don't know if that's still the plan because I I would have Mario on Pokemon and I guess you would too, though, right? Like, are you would you be leaving your Switch when you go to this? Are you taking your Switch with you or what are you",
            "start": 617.68
        },
        {
            "text": "I I would have Mario on Pokemon and I guess you would too, though, right? Like, are you would you be leaving your Switch when you go to this? Are you taking your Switch with you or what are you going to do? That's a good question. That's a good question. Here's the thing. My my first few hours with the Switch needs to be an intimate affair. And that's my thing. I feel like that's as somebody who is excited for the Switch but not it isn't a sacred experience to me. me letting everyone have a turn with my Switch. You know what I mean? Unlock things and do things and I don't I don't care. You know what I mean? Maybe it makes sense just to leave it with me. Yeah, we can call this your Switch. Okay. Now, do you want me to Do you want to do the opening things? Oh, hell yeah. Yeah. Well, again, we don't know what we're plugged for a little bit. Can we jump into this and then be like all set and it's like we're you know what can we play? Is this is it a brick like you know the ones that were",
            "start": 655.84
        },
        {
            "text": "we don't know what we're plugged for a little bit. Can we jump into this and then be like all set and it's like we're you know what can we play? Is this is it a brick like you know the ones that were out early early? I don't know. Now, what are your plans for it as far as the first games you're booting up on this thing? when I'm when I have my intimate alone time with it. Yeah. I mean, I hope Mario Kart obviously will be uh the talk of the town and I will love it as much as I loved every other Mario Kart uh and me and Ben will play it and have a great time with it. If you're talking about getting beyond beyond uh that, right, like I am going to be a big dork and I want to see how Fantasy Life runs on it compared. It's got the cross save, right? So, which I think is so cool. As I was talking about today on my raw alley, there's no load times. It just instantly goes. I never get to read the load screen. So, I'd like to see what that's all about. Um, and then I I need to finish Pokemon",
            "start": 696.72
        },
        {
            "text": "about today on my raw alley, there's no load times. It just instantly goes. I never get to read the load screen. So, I'd like to see what that's all about. Um, and then I I need to finish Pokemon Violet, right? Like I'm at the endame of Pokemon Violet and I stopped. I want to see what that runs like and looks like I know that game pretty well from this, right? I do want to go back to Link's Awakening. Oh, dang. Okay. You have like a checklist. I do. Well, there's so much stuff I slept on on the Switch that I'm like, \"Oh man.\" But then, of course, we're reviewing Death Stranding. So, it's like my Switch gets this golden time with me right now all the way through SGF and when I land back on Sunday, we are heads down on Death Stranding 2 and nothing else. Yeah. All right. Pass her over here and I'll start setting her up. You got to talk, though. I'm really excited about this. She came 75% loaded. We're looking good. Um, yeah. It's funny cuz I I guess I don't have as extensive of a to-do",
            "start": 732.96
        },
        {
            "text": "and I'll start setting her up. You got to talk, though. I'm really excited about this. She came 75% loaded. We're looking good. Um, yeah. It's funny cuz I I guess I don't have as extensive of a to-do list with my Switch to. I'm going to play a a lot of Mario Kart World. And then I also played I plan to play Delta Rune. But beyond that, like I'll peek into old games that I want to see like how they feel and how they feel upgraded and all that stuff. Like for now, I'm not in the mood to replay Tears of the Kingdom or Breath of the Wild, right? I never finished Tears. I know. It's one of my big dark problems. So, it's like I know I I I deserve that. I deserve that. So, yeah. Yeah. And it's like, you know, I'm not I don't have a hankering to check out Welcome Tour necessarily, unless like news comes out that Welcome Tour is actually filled to the brim with like crazy [ __ ] in it, which I don't think it is. Like I, you know, that's not necessarily going to be one for me. And so I think my",
            "start": 767.92
        },
        {
            "text": "comes out that Welcome Tour is actually filled to the brim with like crazy [ __ ] in it, which I don't think it is. Like I, you know, that's not necessarily going to be one for me. And so I think my time starting off with it is going to be focused in on just Mario Kart and Delta Rune. And then from there, yeah, I'll be back to reviewing Death Raining 2 until like more and more stuff comes out. I know there's a tune playing right now. What the [ __ ] This is a beat right here. Nintendo knows how to do it. They do know how to do it. I like that. Now, what are you doing? Walk us through. I right now I have uh I've set up the time connected to the internet and then it's telling me how I can play games however I want to. With the Nintendo Switch 2, you can play games wherever you want to, however you want. They got the kickstand telling me about that. They're talking me telling me how to detach. Hold the release button up there. Boom. Oh, that feels good to me. Yeah, right. That did feel",
            "start": 811.2
        },
        {
            "text": "you want. They got the kickstand telling me about that. They're talking me telling me how to detach. Hold the release button up there. Boom. Oh, that feels good to me. Yeah, right. That did feel good. Yeah. And you just clap it right back on. Oh, okay. Now, let me see. Let me see. I'm going to hop into super chat to see what people Please, please. Yeah, every different kind of show as you. I'm sure you all know. Um, of course, Fox Steve writes in and says, \"Congrats on your first instudio console launch.\" I didn't think about that. Yeah, the fact that we weren't in studio for the PS5 um and Xbox Series X. And then, yeah, PS4 was before kind of funny started. Downloading uh update data. We are at 9 minutes left. It's It's cooking. It said 14 a second ago. Now, it's next thing I really want to do is feel how the controller feels. Oh, yes. We should start that. I mean, you can start that right now as I read through some of these super chats. Game over Amy writes in and says, \"Birthday",
            "start": 850.64
        },
        {
            "text": "to do is feel how the controller feels. Oh, yes. We should start that. I mean, you can start that right now as I read through some of these super chats. Game over Amy writes in and says, \"Birthday tax.\" Uh, what a birthday. I get Switch 2 tonight. Happy birthday, game over Amy. Happy birthday, game over, Andy. Uh, Kab Jesus Christ. Kebab says, \"Are you going to open it with a chainsaw, Greg?\" Question answered. Don't worry about that. All right. I gave you your little Switch moment. Audio listeners, he just tore open the Pro Controller box. Oh, yeah. Yeah. Tim kept saying it felt silky. Okay. I'm glad I pre-ordered one of these. It feels nice, doesn't it? I don't need it. It totally don't need it, but that actually feels really nice. Yeah. Uh Lans 97 uh writes in and says, \"Glad to be here with y'all for the Switch 2 launch. 2025 has been a rough year for me. Thankfully, I always have KF to look forward to during the week. Thank you for being here. Thank you for being a kind of funny",
            "start": 896.72
        },
        {
            "text": "with y'all for the Switch 2 launch. 2025 has been a rough year for me. Thankfully, I always have KF to look forward to during the week. Thank you for being here. Thank you for being a kind of funny best friend and glad to have you here for the Switch 2 launch.\" Um Tom Plexco, I know you're doing a lot over there. Thank you so much. When you get the chance, could you bring me a regular Pro Controller off my desk? I have them all stacked by my consoles. Tom writes in says, \"Nintendo dodging the weak launch lineup criticisms.\" I feel like for a good launch lineup, you just need one banger. You think Mario Kart's it? Oh, Mario Kart for sure. I saw I saw the Simon Cardi IGN thing yesterday. Like, yo, this open world sucks. I mean, he didn't say, \"Oh, wait. Yeah, I didn't see Simon Cart. It was Simon Carti.\" Simon Carti was like, \"Hey, this is really empty. Like, I don't know why.\" But I expected that. You know what I mean? Yeah, but that sucks. I don't want I I hope they were going to, you",
            "start": 938.16
        },
        {
            "text": "Simon Carti.\" Simon Carti was like, \"Hey, this is really empty. Like, I don't know why.\" But I expected that. You know what I mean? Yeah, but that sucks. I don't want I I hope they were going to, you know, exceed my expectations on that. Sure. But like you're I feel like because this is the first Mario Kart with this mode, like I don't necessarily think about Mario Kart being something that I'm booting up for the open world, like I'm booting up for the Grand Prix and all that stuff. And it'd be cool. Best. Thank you so much. It'd be cool if the open world stuff. It'd be cool if the open world was the level of Odyssey or something like that, but like we're not there yet. Yeah. And the previews were also saying like, yeah, like the the stuff what Mario Kart has done in the past is still [ __ ] fantastic. So yeah, Knockout Tour. That Simon Carti's thing was like they should have just called this Mario Kart Knockout Tour cuz this thing's awesome. Oh my god. Yeah. Yeah. So, like I I feel",
            "start": 975.84
        },
        {
            "text": "fantastic. So yeah, Knockout Tour. That Simon Carti's thing was like they should have just called this Mario Kart Knockout Tour cuz this thing's awesome. Oh my god. Yeah. Yeah. So, like I I feel like between that and then all the other stuff you got going on as far as like third party stuff. I know on the first party side, it's not like there's a million things happening, but that's always the case. Uh first hands on sexy. All right. Not touch this. Not touch. Oh, it's big. It's big. I like it. I like it. Yeah. 9000. Like it feels thinner, but I know it's not. Yeah. How many Zeldas you going to play on this? Two. All of them. So many. Is that a tease for a future video? I already did that. Are you going to do it again on the Switch the Switch 2 version? You should probably do a Switch 2 version. Do a Switch 2 version. But yeah, like I I I don't know how you can call this a week launch lineup. Like if there wasn't a a Mario Kart World, but like how many launch lines do we get to have a",
            "start": 1009.6
        },
        {
            "text": "Do a Switch 2 version. But yeah, like I I I don't know how you can call this a week launch lineup. Like if there wasn't a a Mario Kart World, but like how many launch lines do we get to have a million first party games? Yeah. Yeah. Or have even like recently for sure recent like usually even for Nintendo games or Nintendo consoles historically you're getting like one or two first party launch things and then in the months after they start to fill up. But this is kind of part for the course as far as what we're talking about with launch lineup. Yeah. This so back back to uh the controller. It's another one where the form factor seems exactly the same, but for some reason this one feels smaller with the with not having like the leathery kind of grip on it, having that silk grip that I don't know. It's just I mean, I think does it just feel more ergonomic? Did they move the stick? Would they do anything differently? They move things closer like by Does it just feel more natural to hold?",
            "start": 1058.96
        },
        {
            "text": "know. It's just I mean, I think does it just feel more ergonomic? Did they move the stick? Would they do anything differently? They move things closer like by Does it just feel more natural to hold? Maybe. I mean, this one never felt unnatural. Yeah, it does feel cuz I always I I like the Pro Controller, but I never it never hit that level of, oh, this is perfect. Yeah. Like there was always something off with the Nintendo Switch. The Amazon Luna controller that you see me use all Exactly. I do like my Amazon Luna controller, but like Yeah, the Pro Switch Pro Controller to me still felt a little bit toyish as opposed to like technologyish, you know what I mean? And like I think the Switch 2 Pro Controller gets us a step closer to what I want. Now, here this is this is one of those things that keeps me awake at night worrying about this. You can transfer data from a Nintendo Switch to Nintendo Switch 2. I'm not going to do that because it would just sit here and take for do that the",
            "start": 1107.76
        },
        {
            "text": "that keeps me awake at night worrying about this. You can transfer data from a Nintendo Switch to Nintendo Switch 2. I'm not going to do that because it would just sit here and take for do that the like why not just redownload the few games I want as I go. Yeah. Yeah. It's just like it's to save a step, right? Um and yeah, I feel like if you do that you're you technically delete your profile off of the old switch if I remember correctly. chat. Remember, you can kind offunny.com/rongme. Uh there Corey says, \"Your saves.\" Yes, I am in the cloud with all my saves except of course for Animal Crossing and of course for Pokemon. But PO but I can there's a thing on Pokemon of send your save to another system. So once I'm up and running here, there should be no problem just going boop and booping it over. I I don't want to sit here for 20 minutes and it's going to it's got like Monster Jam. It's got a million Ben games on there that are going to take forever to go. I don't want to do that.",
            "start": 1149.2
        },
        {
            "text": "it over. I I don't want to sit here for 20 minutes and it's going to it's got like Monster Jam. It's got a million Ben games on there that are going to take forever to go. I don't want to do that. I'm not going to do that. Uh, we got another one from Admiral Redbeard who writes in and says, \"This $5 goes toward the Superman bomber jacket, Greg. Also, how many Switches came in for you guys?\" I think Greg mentioned this, but yeah, two came in the mail for Greg and Tim. And then later tonight, you guys are going to the Nintendo store. Yeah. To pick up some more. Bear the cable short. Also, I like the banana here. Like, what what is the shirt? Um, [ __ ] I'm forgetting the artist. uh famous artist, does a lot of uh back from like the 60s. This is like the uh cover of the Velvet Undergrounds uh album, and I'm forgetting his uh Andy Warhol. Thank you so much. Uh but yeah, at least for my uh setup at home where I'm planning to put my Switch. I I don't know if this HDMI is going to have the",
            "start": 1192.88
        },
        {
            "text": "uh album, and I'm forgetting his uh Andy Warhol. Thank you so much. Uh but yeah, at least for my uh setup at home where I'm planning to put my Switch. I I don't know if this HDMI is going to have the length to to get over to where it needs to go. Sounds like you got to get on Amazon, get a long cable. How would I not do that? Um Gregy's in everybody. It was that easy. Let's see here. Jackiem says, \"I've had the Switch 2 for 5 hours. My limited time I've had with it. Switch one games with no upgrade I find are better on Switch OLED due to scaling.\" Oh. Oh dear. Um, Alex Fraser says, \"Open the Pro Controller and give us a review of the control sticks. How do you feel about the sticks in particular?\" I liked them. Yeah. No, that's what I was saying when I started moving around. Uh, Dante the clerk says, \"You guys should time how long it takes to download Mario Kart World. excited for all your content on the Switch 2 today. Well, we're gonna have to see if we if we even have access to",
            "start": 1238.0
        },
        {
            "text": "the clerk says, \"You guys should time how long it takes to download Mario Kart World. excited for all your content on the Switch 2 today. Well, we're gonna have to see if we if we even have access to Mario Kart World, right? [Music] Oh, there it is. We load it up. Now it's trying to teach me about the their [ __ ] cards. Oh, the virtual game. Thank god they have a tutorial for it. We're going to go Barrett. When you did This is just powered, right? Not HDMI. Yeah. Okay. We're going to jump right into the eShop then see what's up. Oh yeah. Can I buy Mario Kart World 2 right away? Mario Kart World. Yeah. Sorry everybody. I didn't mean to insult you Nintendo people. Enter the pin to sign. As we do that, Fatneck writes in and says, \"Birthday tax. How are we letting no rhythm Miller lead a parade? He can't two-step. Let Tim lead the parade. It's his birthright.\" # [ __ ] loser who didn't win so he doesn't get to lead the parade on one hand and on the other I won't have to twostep. I'll be",
            "start": 1285.6
        },
        {
            "text": "He can't two-step. Let Tim lead the parade. It's his birthright.\" # [ __ ] loser who didn't win so he doesn't get to lead the parade on one hand and on the other I won't have to twostep. I'll be being carried in this parade. Josh Horton writes in and says, \"Your uncle that works at Nintendo here. Our Switch 2 articles on our support site are going live, so if you run into any kind of issues today, head over there. Have fun with the launch, everyone.\" Yay. Thank you, Uncle. Uh, and then one more from Norman who writes in and says, \"All console launches are a little underwhelming because the hype comes from promise for the future. Weak launch lineups are no big deal in my opinion.\" I still I I still hold the thing of like compare this to any previous like Nintendo launch lineup. There's always just one like featured game and then in the months after like you look at the Switch one, right? It was Breath of the Wild for day one or Yeah. for day one and then Mario Kart 8 was Mario Kart 8",
            "start": 1330.64
        },
        {
            "text": "just one like featured game and then in the months after like you look at the Switch one, right? It was Breath of the Wild for day one or Yeah. for day one and then Mario Kart 8 was Mario Kart 8 was the next month or two, right? Yep. Like this line this year we're getting Mario Kart World on launch. Next month we're getting Donkey Kong Bonanza and then yeah, the months after you're getting things like Metroid Prime, um that Kirby game and more Kirby Kirby. Uh so far everything Switch 2 on here in the store is in fact pre-order only. Um, so yeah, we can we we can boot into the stuff we already have. Look up Delta Rune for me. Just see see if I can play that right now on the Switch, too. If I can't, I might have to steal that from you. That might turn into my Switch. Big uh drum roll, please. Delta Rune is in fact on a pre-order for the Switch 2 version. You said it is a pre-order. Yeah. Oh, you can't play. We couldn't buy and have you playing it right now. Damn. Hate to see it. You",
            "start": 1374.24
        },
        {
            "text": "Delta Rune is in fact on a pre-order for the Switch 2 version. You said it is a pre-order. Yeah. Oh, you can't play. We couldn't buy and have you playing it right now. Damn. Hate to see it. You hate to see it. You hate to see it. is the so the storage faster. It runs faster. Yeah. I mean, still not like instant IMO, but it's running faster. Oh, yeah. This is like This is way better. Yeah. The bar is so low for Nintendo Switch. I redeemed a code the other day for uh PP Stre and that was my first time on the Nintendo store in quite a while. I was like, Jesus Christ, this is rough. Yeah. You go to recent releases at the very top you have fantasy life the girl who steals time the very very top the card I got for $70 for the bundle I mean I you know then it's going to be $7259 remember oh they got monster train too right down here at launch that's cool unless this is a pre-order hold on hold on don't take my word for that it runs like trash yeah uh M says IMO buying a console day one isn't",
            "start": 1416.96
        },
        {
            "text": "got monster train too right down here at launch that's cool unless this is a pre-order hold on hold on don't take my word for that it runs like trash yeah uh M says IMO buying a console day one isn't worth it and That's your opinion. You're allowed to have it. Uh I think you know lots of times there's a game that's fun to play. I mean like there again so much of a console launch is the hype and is the promise as was said there and what you're getting excited for. Uh but I've I don't know. You have one game in your Nintendo wish list and it's the sexy Brutal. Yeah, I saw that. Oh, it's a good game. Exactly. Say no. No, I'm not judging. Like I've heard good things about this. I just I guarantee you that's a fat finger move. Well, that wasn't just you. You have one wish list. Sexy sexy brutal. Not clearly not a Greg game. I mean, is it not? No. Isn't it uh fighting like, isn't it a science? No. What is that? That's like a From what I remember, that was like a puzzle kind of murder",
            "start": 1469.64
        },
        {
            "text": "brutal. Not clearly not a Greg game. I mean, is it not? No. Isn't it uh fighting like, isn't it a science? No. What is that? That's like a From what I remember, that was like a puzzle kind of murder mystery type of thing. Honestly, I think it is a Greg game. Yeah, I remember Dornbush reviewed that back when I was at IGN. Yeah, it's from uh Tequila Works. Um, the sexy brutal, a never-ending masked ball featuring intrigue, murder in quite in the quite possibly sorry, in the quite possibly oult. Uh, relive the same mysterious and murderous masked ball as the story unfolds in real time. Honestly, I think you probably [ __ ] with this game. Yeah, you might [ __ ] with this game. Art style is cool, too. Like, well, there you go. There's the camera. Oh, shoot. I didn't realize we got the camera, too. We have the camera, too. Yeah. Yeah. Yeah. There was a super chat asking us to hang dong in front of the camera, but I was I don't know if we should do that live on air. There's a lot of things",
            "start": 1518.8
        },
        {
            "text": "too. We have the camera, too. Yeah. Yeah. Yeah. There was a super chat asking us to hang dong in front of the camera, but I was I don't know if we should do that live on air. There's a lot of things we shouldn't do, but it is a launch lineup. We need to get in there and do it. You know what's up. Delta Rune uh 34 is available on stream. The chat is reporting on Steam. Oh, I know that. Okay. Yeah. It's just a there's there's something that hits different on playing something the for playing something on a new console versus playing something on a PC. like if the Switch one version could you get the Switch one version downloaded on the Switch 2 cuz that is also out you know it's a good question that question a question to think about you know that's a good question I would imagine so because you should be able to play like the Switch one versions of Breath of the Wild and Tears of the Kingdom unless you get the upgrade pack right listen this is math that I've not thought about too",
            "start": 1566.64
        },
        {
            "text": "you should be able to play like the Switch one versions of Breath of the Wild and Tears of the Kingdom unless you get the upgrade pack right listen this is math that I've not thought about too deeply This is like these are Tim Getty's questions cuz he stays up at night thinking about that [ __ ] Okay, hold on. Now I'm doing something here, guys. What? What are you doing? I was trying to load up Pokemon on my my game card and it says to load a virtual game card on the system. You'll need to link it with the other system being shown. So, I got to open up the my OLED over here. Go next. Now, systems close. I've brought them close. Bear King8 says, \"Will there be faster download times on the Switch, too?\" God, there [ __ ] better be. Yeah. I mean, hit download on Mario Kart World and then put a timer to it and let's see what happens. Well, that'll be tonight, right? Cuz I you pre-ord right now. Download the sexy brutal and put a put a timer to it. See how long it Do the following on the",
            "start": 1608.28
        },
        {
            "text": "a timer to it and let's see what happens. Well, that'll be tonight, right? Cuz I you pre-ord right now. Download the sexy brutal and put a put a timer to it. See how long it Do the following on the other system. Open the virtual cards. Bam. Uh, and then the on screen thing. Select link. I do this. Yeah. Me. Yeah. Uh, now are you are you planning to use these wheels or is this just a Ben thing? I mean, I wasn't planning on getting them and then as soon as I touched them, you might even go back in the footage and see me go. And then I was like, \"Oh, wait. I do have a three-year-old.\" You might actually [ __ ] think it's dope as [ __ ] to drive Mario Kart that way. Why is my hair [ __ ] up in the back bar? Yeah. No, he would probably He would love this. And this is Guys, we're linking We're linking the systems. We're moving. It's happening. Linking systems. Keep the systems close to each other and wait. I'm waiting. It's loading the virtual game card. Maybe it's saying I have Pokemon",
            "start": 1649.2
        },
        {
            "text": "linking the systems. We're moving. It's happening. Linking systems. Keep the systems close to each other and wait. I'm waiting. It's loading the virtual game card. Maybe it's saying I have Pokemon abilities. They have been linked. Okay. Yeah. So, eject from the other system and load it on this system. Load on the system. Home menu. So, now you don't have that game available on the first system. Eject that. Yeah. What a system. What a weird little idea they had. What if you took digital games and just turned them into made them a little bit more complicated? What made them weird? It's like one of those things like I agree it's a little weirdest a little whatever but it is also like a great visual representation of something we know from going into our PlayStation to be like going oh ladies gentlemen and Mr. Nintendo himself. Timmy is here. I'm [ __ ] stoked, y'all. I mean, on the whole drive in I was watching you guys. What an exciting time we're here. This is big kid Christmas. You",
            "start": 1687.92
        },
        {
            "text": "gentlemen and Mr. Nintendo himself. Timmy is here. I'm [ __ ] stoked, y'all. I mean, on the whole drive in I was watching you guys. What an exciting time we're here. This is big kid Christmas. You know what I mean? Get a microphone. Come over here. Unbox some stuff. Start it up. Start loading your virtual game cards. Pokemon. I'll send over Mario as well. I love how much this episode of Games Daily is barely an episode of Games Daily. This is us hanging out with microphones in front of Y. This is what it is. This is This is a special day. You got a great games daily every other time. You know what I mean? Now you're getting us here figuring this out together, having some fun. Isn't that what you want? Kilgrim writes in and says, \"Birthday tax. I recently brought uh bought first of all, happy birthday. Happy birthday.\" Happy birthday to you. I recently bought a Steam Deck and my wallet is dreading when something drops to entice my entice me to buy the Switch, too. Listen, just do it.",
            "start": 1734.32
        },
        {
            "text": "birthday. Happy birthday.\" Happy birthday to you. I recently bought a Steam Deck and my wallet is dreading when something drops to entice my entice me to buy the Switch, too. Listen, just do it. Just buy it. Spend the money. Uh, Red 13 says, \"Can we get a Mario Kart competition between Barrett and Logan Plant from IGN?\" Sounds like that would be some great content. I like that a lot. I mean, I think we're going to do the tour of going to different outlets and taking them out one by one. Exactly. You and me. And we actually visit all of the spots. Yes. Like we go down to IGN, we go We go to GameSpot. Gamespot. Yeah. That should probably be our first stop. Yeah. They're closest. Oh, right. We should do that. We drive to Did you get out of Mario Kart? I I like Mario Kart and I think I'm good at Mario Kart. I'm not I'm not Barrett, but I'll get I'll get down. Yeah. Yeah. We'll we'll walk to Jeff Grub's house. Where do you guys want me to lick it? Everyone wants to lick. Did you lick yet?",
            "start": 1775.84
        },
        {
            "text": "at Mario Kart. I'm not I'm not Barrett, but I'll get I'll get down. Yeah. Yeah. We'll we'll walk to Jeff Grub's house. Where do you guys want me to lick it? Everyone wants to lick. Did you lick yet? I didn't lick. I pantoime. But you should do it. I'm going to lick. I'm going to lick it. But everybody, where do you want him to lick right now? I'm going to lick the back of it. I don't want to lick the screen. Okay. Yeah. Lick the back. Oh my god. That was like one of those licks that get you to a Jesus. I put my tongue to a veto once. I didn't do any of that. Oh, bye Tim. I thought you going to hang out. Yeah, you tasted that. He [ __ ] is inside it. Wow. That's They shared DNA. So now is where I'm So Mhm. Speak your mind. Animal Crossing. Yeah. I'm getting my save over here. Animal Crossing is a weird one. Do I still have to use the virtual island uh moving box thing or can I just load the game card and then tell it to send the save to the system? See, I feel like that's one of those",
            "start": 1820.64
        },
        {
            "text": "is a weird one. Do I still have to use the virtual island uh moving box thing or can I just load the game card and then tell it to send the save to the system? See, I feel like that's one of those ones where you're going to have to answer for yourself. Like I feel like you're not going to know. I looked at chat and they're like, \"Motherfucker, you've got the system.\" They don't know. We don't know what we're doing. I think they know. I don't think Nintendo's communicated this part that well. And they Yeah. Zo says they've got it's got a specific system. I know they do. I have let loaded here. But with virtual game cards, does that change anything any other way? I don't think that it does. I don't think it does. I don't think that. Yeah, cuz you have to imagine like a physical game card of like what would happen if you just It's not like the save data is on. Well, it's the same thing here with like Pokemon. So, let's try this. Okay, so I got Pokemon over there. It's downloading. It's",
            "start": 1866.08
        },
        {
            "text": "like what would happen if you just It's not like the save data is on. Well, it's the same thing here with like Pokemon. So, let's try this. Okay, so I got Pokemon over there. It's downloading. It's taking forever. None of these games will be downloaded by the time this episode of games. Roger Davis says system transfer will move the island. Yeah, I know. But we're not doing the system transfer. No, you have to use the island transfer tool. Okay, but then the Pokemon, right? So, I hit options and I say save data and I say manage transfer your save data. I hit A on that and then send it to another console, right? Yeah, send to another console. And I say this and I say Gregie, this is just for Pokemon which is still installing over here. Send. It says sending G. I say select all. No. Whoa. Whoa. Whoa. Wait a second. Whoa. Whoa. Select all save data. No, I just want that. But maybe I can get Animal Crossing here too and really confuse things. This is why we make the big bucks. This is why",
            "start": 1906.56
        },
        {
            "text": "Whoa. Wait a second. Whoa. Whoa. Select all save data. No, I just want that. But maybe I can get Animal Crossing here too and really confuse things. This is why we make the big bucks. This is why we make the big We love you. audio listeners, you they're chill. They understand that this is a special day. Animal Crossing not popping up on my list of saves. So, I think you will have to use the but I still wonder what does that mean? Ready to target system. Speaking of it being home menu here, select system settings. Alex writes in and says, \"Happy Switch Day, y'all. Happy Switch Day, Alex.\" And then also Conman 1192 writes in and says, \"Do the new game cards still taste bad?\" I don't believe we have access to game cards at this current moment. Um, we'll see if we ever get a physical game in this office. You have an office. full of digital people. Uh Tim will probably buy some physical games. We're getting one tonight. I think he's buying Mario Kart physical tonight. I think to try to",
            "start": 1947.2
        },
        {
            "text": "in this office. You have an office. full of digital people. Uh Tim will probably buy some physical games. We're getting one tonight. I think he's buying Mario Kart physical tonight. I think to try to avoid hopefully downloading everything. Gotcha. All right. So, Pokemon is sending over perfectly. So, that's all I need on that one. That's good. I got that going. We'll worry about Animal Crossing later. Is there anything left to unbox? Is that everything? No, this is all the unboxing stuff. Okay. So, we can move on if you want. That was fun. That was real fun. Nintendo Switch 2, everybody. Like I said, we will be streaming it today for our big Nintendo Switch 2 launch party. uh at the very least it'll go live after uh that we do the State of Play stuff. Then it'll lead into us being at the Nintendo store and getting it. That might also change. We do have to have a conversation, I think, as a team of So, we don't have the Nintendo Switch 2 games. So, are we really going to go live and",
            "start": 1987.12
        },
        {
            "text": "Nintendo store and getting it. That might also change. We do have to have a conversation, I think, as a team of So, we don't have the Nintendo Switch 2 games. So, are we really going to go live and not stream Mario Kart until 9 and then only stream Mar? Like, there's a conversation to be had that we'll have, right? We'll start that conversation right now. Uh when I say, of course, everybody this is kind of funny games. Uh we have a great time here. here. We love hanging out with you. We have so much video game news to tell you about that we'll get to right after we tell you about our sponsors because of course we wouldn't exist without them. And what that one? No. No. Tim's here. Tim's here. Come here. What are you doing, Tim? You're getting bar. Oh, you're coming all the way out. Yeah. Great. This leads to my question then for you. So, when we got him, we're all very hot on it. Cool. Let's get him set up. Stream after State of Play. We do uh Pokemon, we do Mario, blah blah blah. Is",
            "start": 2023.6
        },
        {
            "text": "Great. This leads to my question then for you. So, when we got him, we're all very hot on it. Cool. Let's get him set up. Stream after State of Play. We do uh Pokemon, we do Mario, blah blah blah. Is that the right move to stream old games updated for Switch up until we get it at 9ine and then only stream for like probably a couple hours and then go to bed? Or do we stick to the plan of go off air after? I I'm starting to be swayed. Go off air after everything. Do the normal nighttime stream like you're planning. Okay, cool. You tell the kids that. Not the kids. Our kids, but our kids. Okay. Yeah, cuz you know Roger out there, he doesn't know what the [ __ ] going on. Yeah. Yeah. What are we doing? There's a lot going on. everyone. Uh, right now I'm going to tell you, of course, about patreon.com/kindafoney, youtube.com/kindfunname, Apple and Spotify. Over there, you can pick up the Kind of funny membership. You can get all of our shows adree. You can get your daily dose of me, Greg",
            "start": 2061.52
        },
        {
            "text": "youtube.com/kindfunname, Apple and Spotify. Over there, you can pick up the Kind of funny membership. You can get all of our shows adree. You can get your daily dose of me, Greg Miller, in a series we call Greg Way. We're 15 to 20 minutes each and every day I talk to you in my car. It adds up to a 4-hour long podcast every week, but you know how it is. Uh, everybody, for now, you're not using your benefits. We're going to reset and get ready to tell you the real gaming news. Uh, so here's a word from our sponsor. This episode's brought to you by XRE. Y'all know that a few months ago, my life changed forever when I brought a pair of XRE1 AR glasses on a long flight to New York. I legit could not believe how easy it is to use and high quality my experience was playing games, watching movies, TV shows on the plane without just too much extra stuff around me, or especially not a giant goofy headset around my head. No joke, this is my favorite new tech product in years and it has earned a",
            "start": 2106.44
        },
        {
            "text": "TV shows on the plane without just too much extra stuff around me, or especially not a giant goofy headset around my head. No joke, this is my favorite new tech product in years and it has earned a permanent spot in my travel bag. It is only hard to believe that it works as well as I'm saying until you try XR1 AR glasses for yourself and then you will see that the future is now. The tech is here. Connect XR1 glasses to wherever you are playing. Whether it's a handheld console, a PC, phone, home console, you just get a massive 150in virtual screen anywhere, anytime for any game. Gaming on the go like a long haul flight, you need the XR1. Next, starting to hurt from staring down at your handheld, we've all been there. You need an XR1. A screen as big as your wall. Instant plugandplay with all of your devices via USBC. Built-in audio with sound by Bose. Anchoring your screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full HD. These are what make XR1 a musthave.",
            "start": 2145.04
        },
        {
            "text": "of your devices via USBC. Built-in audio with sound by Bose. Anchoring your screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full HD. These are what make XR1 a musthave. And we hear XR1 Pro is coming soon with an even bigger virtual screen. Hit our link below to get your XR glasses today. There's nothing better than when a sponsor of Kind of Funny is something that we are legitimately obsessed with. And that is exactly the case here with XRE. You're going to hear me talking about these forever. Go to xreal.com for more. And we're back everybody for our continuing Nintendo Switch to pre-launch day coverage as we figure out what we're doing. Tim's setting his up about to recover his thing. We got a little nice We didn't talk about this. Nintendo sent a nice checklist. Checklist. You know, I was hoping there'd be some codes on it. There's not. Yeah, I know. I was like, \"Oh, they sent us this thing. Clearly, this will all be in the box.\" I'm like, \"Oh, no. It's",
            "start": 2195.68
        },
        {
            "text": "Checklist. You know, I was hoping there'd be some codes on it. There's not. Yeah, I know. I was like, \"Oh, they sent us this thing. Clearly, this will all be in the box.\" I'm like, \"Oh, no. It's not. It's just advertising cases and uh memory games or what's on there?\" No, it's even Don't knock the camera on you. Game cap. We're game chatting with somebody. We should figure that out. Who can we game chat with right now? No, it goes all the way to advertising drag and drive. See, this reminds me of like one of those uh like holiday wish list kind of cards. Totally. Yeah. Where you would like give it to your mom and she wouldn't buy anything. I've got amiios on here. Let me tell you, the amiibo door has been open for me in like a really dangerous way. It's the worst time. I now start thinking about the fact that there's a Solid Snake amiibo that I don't own yet. And I'm like, why don't I own that Solid Snake amiibo? I should have that. That was where that was my tipping point where I",
            "start": 2244.24
        },
        {
            "text": "about the fact that there's a Solid Snake amiibo that I don't own yet. And I'm like, why don't I own that Solid Snake amiibo? I should have that. That was where that was my tipping point where I bought the Solid Snake. Oh, yeah. And I had that for a long time. And then when we moved, I think I gave it away or something. The problem is they're so expensive now. Like not only just the tariff stuff, like that sucks, too. But just for some reason, the latest round of amiios are like $10, $15 more than they ever were and then they're even more now cuz the tariffs. It's bad stuff for everybody. I did just ask really nicely uh if um we can get a code early and he said no. No. Yeah. 9:00 p.m. 9. So yeah, I think we're leaning more towards maybe keeping the all night stream going. So everybody stick with us. We'll figure out as we go. There's going to be fun times here to be had for everybody. Don't worry about it. Uh for now, we'll move on to number two. Some nice little Nintendo Direct music",
            "start": 2280.8
        },
        {
            "text": "with us. We'll figure out as we go. There's going to be fun times here to be had for everybody. Don't worry about it. Uh for now, we'll move on to number two. Some nice little Nintendo Direct music going on. Crank it up. We were bopping to it earlier. Yeah. Hell yeah. Uh number two on the Roper Report. There will be no Ubisoft Forward this year for the first time since it started. This is Chris Skullian at VGC. Ubisoft has confirmed that its annual Ubisoft Forward presentation will not take place this year. Game file journalist Steven Totillo, who was on kind of funny games daily just last week, posted on Blue Sky that a Ubisoft representative confirmed to him that there would be no Ubisoft forward this summer. I Greg aside, I assumed I would I would have heard about it by now. Oh yeah, for sure. I assumed that as well, but like going into it, I assumed that definitely they were going to do one because they're Ubisoft and I don't think they should have they won't they won't admit",
            "start": 2317.12
        },
        {
            "text": "for sure. I assumed that as well, but like going into it, I assumed that definitely they were going to do one because they're Ubisoft and I don't think they should have they won't they won't admit defeat. Uh instead, the company will participate in other summer GameFest shows such as the PC gaming show and IGN Live as well as Gamescom in August. Quote, \"We are always eager to connect with our players and showcase our games. We are continuing to explore opportunities to share updates and we look forward to providing more information at a later date,\" the representative to told Toillo. Totilla noted that Ubisoft may not have many games planned for the rest of the year, making a full presentation as opposed to showing trailers at another show potentially unnecessary. The news marks the first year without a Ubisoft forward since the show made its debut in 2020. The company generally saves its biggest game reveals and announcements for its Ubisoft Forward presentations. This saddens me a",
            "start": 2356.24
        },
        {
            "text": "year without a Ubisoft forward since the show made its debut in 2020. The company generally saves its biggest game reveals and announcements for its Ubisoft Forward presentations. This saddens me a bit, not because I was looking forward to see what's up with Animal Animal Crossing Assassin's Creed. Yeah. more so because I it this feels like another check mark I guess or another chapter I'll say in the story of Ubisoft's downfall. Yeah. Like the downward spiral of all right like when I look at the rest of this year for Ubisoft, what are we talking about as far as game releases? Do they have anything big announced for the rest of the year? Have they even announced the Just Dance for the for the for the fall season? Like usually that would happen at the Ford or at a summer Nintendo Direct, which I'll still guess would happen at a Nintendo partner direct if they had like a smaller one in like July or late June or something. But um the fact that you don't have a Ubisoft forward makes me",
            "start": 2397.12
        },
        {
            "text": "which I'll still guess would happen at a Nintendo partner direct if they had like a smaller one in like July or late June or something. But um the fact that you don't have a Ubisoft forward makes me really worried about their output for the next I'll say 12 months. And if they don't have anything major, this feels like a all right, we're planning on wrapping this [ __ ] up. Like we are in I know they've talked about being in the process of trying to sell or trying to do something with it, right? also doubling down on the their established IPs, right? That's what they've talked about as well. They're one of those folks who have been like, \"We're going to, you know, stick to X, Y, and Z.\" Where are the established IPs, you know, like what's up with the next Assassin's Creed, Black Flag remake or whatever. Yeah. We we went through it on uh our prediction shows, of course, available as Games Cast for both the Xbox showcase and SGF of predicting things like Splinter Cell, right? They were",
            "start": 2442.96
        },
        {
            "text": "or whatever. Yeah. We we went through it on uh our prediction shows, of course, available as Games Cast for both the Xbox showcase and SGF of predicting things like Splinter Cell, right? They were out of pocket with that tweet. Why are they putting up the eyes in the little mouth thing when they're talking about Sam Fischer's face? What's going on with that? Something's happening there, right? Yeah. I mean, and I'd be excited to get like a SWAT announcement, but even with that, it's like I feel like we're the slowdown of output from Ubisoft, I think, is the thing that worries me. Yeah, sure. Cuz I even even when you're a focus, but isn't that the right thing to do? Are they trying to make in theory better quality games? So, they should But you believe that's going to happen? I mean, if it does, are they not going to just close the damn studio? I be I believe they're going to be sold. Yeah. And then a lot of closures and layoffs and stuff. Yeah. Yeah. I don't know. I I'm if this is",
            "start": 2479.12
        },
        {
            "text": "it does, are they not going to just close the damn studio? I be I believe they're going to be sold. Yeah. And then a lot of closures and layoffs and stuff. Yeah. Yeah. I don't know. I I'm if this is more of a shift in terms of the ethos of Ubisoft and like focusing in and working on quality like really focusing in on quality then I think that's good and I'm happy and that becomes a bit more sustainable than putting out just mid after mid after mid. Sure. Sure. Sure. I just don't I don't have the belief yet in the quality. What about Far Cry 7? Do you think there's a chance we see that at any of these shows? No. I don't feel like Far Cry 7 is around the corner. Do you? No. But I I also don't have a great reason as to why. Like I say, they usually talk about them pretty close to going, right? What 2021 was last Far Cry? That was Far Cry 6. Those are supported for a while after the fact, so it's not like they weren't doing anything. Speaking of uh Barrett, Assassin's Creed DLC, is that",
            "start": 2516.08
        },
        {
            "text": "What 2021 was last Far Cry? That was Far Cry 6. Those are supported for a while after the fact, so it's not like they weren't doing anything. Speaking of uh Barrett, Assassin's Creed DLC, is that something they've teased for Shadows? I have food in my mouth. Sorry. It's fine, bro. A lot of crazy things are happening over here. I get it. Oh, he's chilling. I believe they have a road map. Yes. Sorry. Okay. Okay. Okay. So, you get that out there somewhere. That game sold well. So you're f you're happy with this news? Yes. I I mean do I wish we had a flourishing games industry where everyone was doing a 45 to hour long presentation of an amaz all these amazing and they were all getting bought and everything was going well. Of course I'm much I don't trust Ubisoft as far as I can throw the downtown office. So I'm happy they're not going we're doing another forward and it's just trash updates that like for games nobody cares about. We're all watching going why are we wasting our time? Why",
            "start": 2556.8
        },
        {
            "text": "office. So I'm happy they're not going we're doing another forward and it's just trash updates that like for games nobody cares about. We're all watching going why are we wasting our time? Why are we here? I'd much rather them do this of like, yo, this ain't our year and whatever we do have, we're going to go pop it into Xbox, pop it into SGF, pop it into PC Gamer. Yeah. Now, does how much do your feelings change if we get past this next week and we barely we don't see a peep from Ubisoft? No, I do think we're on our way out. You know what I mean? I do think that Yeah, we're not talking about or promoting future things. And what But even then, you'd be promoting talking about future things because you'd want to sell the company for more money. Sure. If that's the case. Yeah. Tim, what do you think? Yeah, I I feel that we're not going to see much from Ubisoft, but I don't really think that it's that that is a concern. I think that uh we've talked about this a lot that Star Wars Outlaws",
            "start": 2601.84
        },
        {
            "text": "think? Yeah, I I feel that we're not going to see much from Ubisoft, but I don't really think that it's that that is a concern. I think that uh we've talked about this a lot that Star Wars Outlaws and Assassin's Creed Shadows are the two biggest things uh Ubisoft has ever done uh in terms of a giant Star Wars game and the Japan Assassin's Creed, right? So, I feel like we kind of knew they were going to be in a bit of a lull period this year forever. Um, so I I'm not surprised that we're not getting a forward. I'm happy about it because I did think that they were going to just put something together and, you know, just because they it would not they have a lot of things to update. Like I'm sure we'd still get more Fore Honor, you know what I mean? Like they they love to talk about just like all that stuff, right? So they could have pulled something together and we would have freaking hated it. So I'm happy that they did this. Um, but I don't think that even if they did that I would",
            "start": 2642.32
        },
        {
            "text": "like all that stuff, right? So they could have pulled something together and we would have freaking hated it. So I'm happy that they did this. Um, but I don't think that even if they did that I would have been expecting big games coming from it. Like so I I don't think we're getting any big Ubisoft game at any showcase uh this this week. Yeah, I think the only possible one would be a Splinter Cell thing, but even that I'm like, \"Oh, sorry. There's that.\" Yeah, that's a new thing we're getting. I'm like half I'm like 50/50 on it. But but that's the thing is Splinter Cell remake and Prince of Persia remake. It's like we know it's not that's not a new thing at all. Like we've known it's been existed and we've also seen them kind of reannounce both of those separate times. So unless we get like gameplay of Splinter Salad and which was going to be incredibly exciting, but it's also a known quantity from every perspective. It's a game, it's a remake of a game that we we know and also we",
            "start": 2685.28
        },
        {
            "text": "like gameplay of Splinter Salad and which was going to be incredibly exciting, but it's also a known quantity from every perspective. It's a game, it's a remake of a game that we we know and also we already know the announcement. So it's like and what the other one I'll put out there too is Black Flag Remake because that's been rumored. But I notice how everything that we're saying are remakes as far as what the games are putting out are, right? It feels like there's not really an air of oh, we got really big new exciting things happening. It very much feels like we're in cruise control until we're able to find somebody to really buy up this company and save us from our downfall. 100%. There's room as a Rayman, our savior. He'll save it. He'll save. That'll save us. Speaking of saving the day, number three. Mind's Eye Studio execs depart Bill the Rocket Boy one week before the game's debut. What a what a what a great weird. We did it everybody. See you later. Uh this is Victoria",
            "start": 2725.2
        },
        {
            "text": "the day, number three. Mind's Eye Studio execs depart Bill the Rocket Boy one week before the game's debut. What a what a what a great weird. We did it everybody. See you later. Uh this is Victoria Phillips Kennedy at Eurogamer. The chief legal officer and chief financial officer at Mind's Eye developer Bill the Rocket Boy have left the company a week before the game's release. Writing on LinkedIn, former CLO Riley uh Gravenner uh said he was proud of what the team has accomplished during his time there, stating that during his tenure, the company had doubled in size to over 450 employees. Uh Grabner uh did not give a reason for his departure. In addition, uh, Build the Rocket Boys CFO Paul Bland. Oh, man. That's a rough one. You know what I mean? Yeah, sucks. You got Bland is your last name. You got Paul Blart happening on it, too. I'm sorry. Paul also left the company after two years embarrassed by his name. No, I edited that part. Over on the Mind's Eye Discord, many have expressed",
            "start": 2762.56
        },
        {
            "text": "You got Paul Blart happening on it, too. I'm sorry. Paul also left the company after two years embarrassed by his name. No, I edited that part. Over on the Mind's Eye Discord, many have expressed concern that two key members of the Build a Rocket Boy team are leaving so close to the game's release. As a reminder, Mind's Eye is launching on June 10th across PS5, Xbox Series X and S and PC. Quote, \"It could be a sign of very troubling internal affairs or they don't want to deal with potential legal issues if Mind's Eye comes out broken.\" One member speculated. This is Mind's Eye here if you're unfamiliar. Uh, quote, \"Trying to keep an open mind, but that's sus indeed,\" wrote another. \"Uh, people don't bail right be right before they think they're releasing a hit. Usually, if you were the CFO at Rockstar a week from GTA 6 launch, would you resign? Word of Grabber and Bland's departures uh from Build a Boy Build a Rocket Boy come days after the studio's co-CEO Mark Ghard suggested the",
            "start": 2816.08
        },
        {
            "text": "CFO at Rockstar a week from GTA 6 launch, would you resign? Word of Grabber and Bland's departures uh from Build a Boy Build a Rocket Boy come days after the studio's co-CEO Mark Ghard suggested the negative reaction to Mind's Eye so far has been paid for in a conser concerted effort against the studio ahead of its release. Who could have paid for it? In an exchange on the Mindsey Discord server, Ghard was asked if he believes, quote, \"All the people who reacted negatively were financed by someone.\" To which he replied, \"100%.\" That's the part I want to talk about. Wait, what? God, I Oh my god, I love a good conspiracy theory cuz then like But do you love delusion? Do you love delusional? Cuz I want to know. No, please let this trailer keep going. I People need to know what Mine's eye is cuz like I want to know who he thinks. Oh, come on. Bless. You know, like Rockstar does he think our employer? Yes. He thinks he thinks Rockstar is paying every games media journalist or whatever who",
            "start": 2855.92
        },
        {
            "text": "cuz like I want to know who he thinks. Oh, come on. Bless. You know, like Rockstar does he think our employer? Yes. He thinks he thinks Rockstar is paying every games media journalist or whatever who they sent the preview to to talk [ __ ] about the game. Mhm. Could happen. Rockstar's got deep pockets. They weren't We weren't invited to the preview or we didn't accept. I'm not sure because we can't be bought. Right. Fair enough. Fair enough. It also doesn't help that like this game was originally a campaign within the game everywhere, which was supposed to be adult Roblox essentially, but then they're like, \"Never mind. Mind's Eye is going to be like its own thing. But now they're also trying to sell Mind's Eye like it's going to be adult Roblox again.\" So, it's just like, \"What the the [ __ ] are we doing?\" Well, obviously like it seems like a lot of [ __ ] fell through, right? Like the the [ __ ] Everywhere thing was confusing from the get-go and didn't sound realistic from the",
            "start": 2909.92
        },
        {
            "text": "[ __ ] are we doing?\" Well, obviously like it seems like a lot of [ __ ] fell through, right? Like the the [ __ ] Everywhere thing was confusing from the get-go and didn't sound realistic from the get-go. And then it's like I still have questions of was this still made in everywhere and if so like what the like what the [ __ ] what is everywhere is still my question. What is who is publishing this? IO right? Yes. Yes. IO interactive is publishing this game on all platforms except for maybe the switch too. Um, yeah. Like I just don't how did A to B to C get there as far as this being a thing within everywhere. This now being separate from everywhere and also like this being from people who yeah used to work at Rockstar and we're making Grand Theft Auto and now 100%. Like what the [ __ ] what the [ __ ] happened to this game? I can't. There is a fascinating story here that I want to know. Uh Jason will get it for you. I hope so. June 10th, we'll find out how mines are. And this game",
            "start": 2955.44
        },
        {
            "text": "what the [ __ ] happened to this game? I can't. There is a fascinating story here that I want to know. Uh Jason will get it for you. I hope so. June 10th, we'll find out how mines are. And this game comes out in like six days. Yeah, we will find out pretty quick. Uh, and also there's that IO presentation, too, where they talk they're going to show more minds. So, yeah, we're get a lot of Mind's eye. What was the Was it the day before? Was that the game that like they had to shut down like take off of stores and refund everybody like literally launch day or something? I get the feeling here. You feel that? I feel in my stomach. Yeah. Look at how Oh, damn. I got in battle. I was going to say, look how poorly Scarlet and Violet runs on the Switch one. Get ready for a brand new world over Switch. Speaking of a brand new world, number four, Sydney Sweeney split fiction movie lands at Amazon. This is Jennifer Moss over at Variety. A film adaptation of the hit video game Split Fiction",
            "start": 3001.08
        },
        {
            "text": "Switch. Speaking of a brand new world, number four, Sydney Sweeney split fiction movie lands at Amazon. This is Jennifer Moss over at Variety. A film adaptation of the hit video game Split Fiction starring Sydney Sweeney and directed by John Mchu has landed at Amazon MGM Studios. Variety has confirmed as Variety first reported last month along with the news of Sweeny's casting. Uh the actress signed on the project March 6th, the day the game launched, and Chu directing. The script uh for the movie is being written by Deadpool and Wolverine screenwriters Rhett Ree and Paul Wernernick. Uh it has yet to be decided whether Sydney will be playing Zoe or Mio. And the film is actively looking to cast her co-star. This girl be out there, man. Sydney Sweeney, she's producing. She's acting. She's making she's making baths over. Wait, she You say she's producing? Yeah, she's producing a whole bunch of Not this one, but other movies and stuff. Oh, good for her. Good for her. That's her whole",
            "start": 3046.08
        },
        {
            "text": "making she's making baths over. Wait, she You say she's producing? Yeah, she's producing a whole bunch of Not this one, but other movies and stuff. Oh, good for her. Good for her. That's her whole thing with why she didn't regret Madame Web, right? Is that I got her in at Sony, so she was able to make the picture she wanted to make. One of Gia's friends wrote a movie that she's producing. No way. The only reason it's happening is because she's attached as producer. Wow. Yeah, that one friend. Who do you think she's playing between Zoe and Mio? We talk about this every time. Tough to figure out. Yeah. Yeah. She's the country. She's the She's the the fantasy fan. Yeah. Who for some reason couldn't get along with a sci-fi fan. Um, I know we've probably talked about this, but who do you think is playing? You put it in my The room put it in there yesterday. It has to be Jenny Ortega. And I agree. Oh, Jenna Ortega. Yeah. I don't think so. That'd be amazing. It' be perfect. I mean, I don't",
            "start": 3088.16
        },
        {
            "text": "is playing? You put it in my The room put it in there yesterday. It has to be Jenny Ortega. And I agree. Oh, Jenna Ortega. Yeah. I don't think so. That'd be amazing. It' be perfect. I mean, I don't think that someone said Isabella Merced, which I know we're just casting her and everything now, but like it's her. Like I when we were playing that game, I thought it was her. No. Jenna Orga doesn't give me the vi like that's Jenna Ortega. She's a little goth and like like all mad with her emotions. I feel like she's more Aubrey Plaza type as far as like kind of like a little goth and also like kind of apathetic and kind of like you know she can do other things. Let her go. You know, Aubrey Plaza that's all she like I love Jenna Ortega but like it doesn't sound like you do. I mean sounds like you're doubting her right now. I don't know man. I feel like now she's been very typ cast as that Aubrey Plaza type role and that's I don't think that fits Mio I forget which one. Mio they really made",
            "start": 3128.16
        },
        {
            "text": "doubting her right now. I don't know man. I feel like now she's been very typ cast as that Aubrey Plaza type role and that's I don't think that fits Mio I forget which one. Mio they really made an impact on us storywise. They're just making they're just making games now or adaptations I should say. They're just letting anything turn into a movie. Oh, are you running out of battery? No, just making me connect. Tim just pouting and I look at connect an AC adapter. I go there. See, this is the thing though. Aubrey, this is all she can do now. What do you mean? You heard me. You watch your mouth. All right. Great. This is what she does, though. This is You watch your mouth when it comes. She let herself get pushed into a corner and Jenna's breaking out of that corner. All right. Is she? She wasn't the so wrong about this. She wasn't like that in the the one movie where it was the porn they were shooting, then the old woman started killing people. Wait, X. Was that it? Damn it. How many AC",
            "start": 3163.68
        },
        {
            "text": "the so wrong about this. She wasn't like that in the the one movie where it was the porn they were shooting, then the old woman started killing people. Wait, X. Was that it? Damn it. How many AC adapters do I need? Hold on. I'm looking this one. I'm looking up Jenna Ortega film. We're on top of this out here. Don't worry. We got this done. I'm on her. I am. Okay. First of all, I just type in Jenna. All right. Wednesday. Beetlejuice. Beetlejuice. Miller's girl. Scream six. Scream. Scream six. She wasn't like a exact Aubry Plaza knockoff. I feel like they're just putting her in horror movies. She's the what do they call it? Scream queen. Mhm. Yeah, she's a scream queen. Tasted. Number five on the roper report. Phasmophobia movie coming from Blumbhouse to haunt theaters. You should be in that. Yeah. Mark Delaney at GameSpot. Phasmophobia, the popular ghost hunting sim from Kinetic Games is being turned into a horror movie. The film is coming from Blumbhouse, a production company that has",
            "start": 3199.6
        },
        {
            "text": "Yeah. Mark Delaney at GameSpot. Phasmophobia, the popular ghost hunting sim from Kinetic Games is being turned into a horror movie. The film is coming from Blumbhouse, a production company that has made a great number of horror movies in recent years, including Five Nights at Freddy's, Paranormal Activity, The Purge, and Insidious, among many more. James Juan's company, uh, Atomic Monster, is also attached to the project. Uh, the games studios direct the game studios director and lead developer Daniel Knight said in a press release that his team is thrilled to announce the movie is in the works. Connected to the Nintendo Switch, data will be received. Badass. I've never had so much FOMO in my life watching this unfold in front of me. We had to go to volleyball. It's thrilling. It's turning this channel. Yeah, your volleyball saga is wild. Well, I get it though. It's the fact that I'm I'm the captain of the team. I missed the first two weeks of the season cuz I've been in LA doing",
            "start": 3241.68
        },
        {
            "text": "this channel. Yeah, your volleyball saga is wild. Well, I get it though. It's the fact that I'm I'm the captain of the team. I missed the first two weeks of the season cuz I've been in LA doing things, seeing things that I can't talk about yet. Well, one of the things I can is Riffbound, but yeah, I I got to be there today. Riftbound, the um Riot. You said Earthbound. I was like, \"Oh, yeah, I saw the Earthbound, too.\" Um but yeah, I I got to go to volleyball tonight. You know what I mean? The other thing is there's also like a Magic the Gathering Final Fantasy Magic Arena event that I like is streamable, like exclusive to streamers that I could be doing as well. And I'm like, \"No, I got to go to [ __ ] volleyball cuz I for some reason decided to do the season on a Wednesday instead of on the Tuesdays. I have a responsibility.\" Jenna Ortega was Wednesday. Jenna Ortega would also be great in this Phasmophobia film. Are you calling a volleyball player? Who are you doing? A volleyball",
            "start": 3284.4
        },
        {
            "text": "on the Tuesdays. I have a responsibility.\" Jenna Ortega was Wednesday. Jenna Ortega would also be great in this Phasmophobia film. Are you calling a volleyball player? Who are you doing? A volleyball player. I thought he was calling Jenna Ortega. Who could he be possibly calling? I just dropped out of a hell divers game for this. This is better be good. Yeah, it is. It's going to be me asking how needy can you be. All right. What do you mean? You You know what I do for a day job? You could turn on Twitch right now and see that we're live. But instead, you 9:40. We're getting the show ready. Twitch chat. You would see that I'm in there chatting and I'm [ __ ] fully aware of it. What do you want me to do? I'm hosting a show, Gary. You can't text me at 9:40. I'm taking my lawn chair to Best Buy tonight, lols. And then an hour later say, fine, I'll just go [ __ ] myself. I'm sorry. I'm sorry I couldn't stop everything to text you back, Gary. me. Why? Why would you do that to me? You're",
            "start": 3323.04
        },
        {
            "text": "Buy tonight, lols. And then an hour later say, fine, I'll just go [ __ ] myself. I'm sorry. I'm sorry I couldn't stop everything to text you back, Gary. me. Why? Why would you do that to me? You're supposed to be my friend. I am your friend, but it's been an hour. I didn't know you were on the ledge. Jesus. An hour is a reasonable amount of time to expect. You see me on You're in the chat. You see me on the show. We got to switches. Come over and see them. Well, why why would I want? No, I don't want to do that. No. Meet me halfway. You want to be this friendship? Come to my job. Interrupt me. I don't Do those things even work? Do you have the the patch that unlocks it or are they just bricks? We're on the store, buddy. We are on the store. All right. Don't worry. It's all working. You can only pre-order games. You can't like We get the old games with the new updates, but we can't get the new games. Did you know that these were coming? Yeah, kind of. But we didn't know when. Okay. All",
            "start": 3366.8
        },
        {
            "text": "only pre-order games. You can't like We get the old games with the new updates, but we can't get the new games. Did you know that these were coming? Yeah, kind of. But we didn't know when. Okay. All right. Thanks to a bunch of people, a bunch of the press people's showing them off. We're going to do a late night stream tonight, uh, where we play late, so you should come home. So, what what time do you think I should get to Best Buy? They open at 9:00, but there should be a line, right? I haven't done I haven't stood for anything since actually it was the original Wii. Okay. I I I actually did an overnight at um at Best Buy, however many years ago it was for the original Wii, which is why I got one at launch even though they were hard to get. I don't know. What do you think? Like seven, eight? I've got a little launch here. Yeah. Seven. Seven sounds good. Yeah. Sevenish. Yeah. Sevenish. Yeah. Yeah. All right. Give us updates and then come over. All right. I'll let you know. All right.",
            "start": 3407.52
        },
        {
            "text": "I've got a little launch here. Yeah. Seven. Seven sounds good. Yeah. Sevenish. Yeah. Sevenish. Yeah. Yeah. All right. Give us updates and then come over. All right. I'll let you know. All right. Bye. Love you. All right. Bye. He does not need to be there at seven for the to pick up the switch from Remember he's got a kid. He could just go park it Park the kid in the chair. Wait, what? Yeah, the kid the kid holds his I forgot about that part. The kid holds his Easy peasy. You know what I mean? A real Baby Joey situation. Oh god. Making it happen. I hope that I hear about Baby Joey every day for the next year. I'll let you know. I thought you were about to pull out a Baby Joey. Baby Joey, of course, is from the hitman Superman. No, hit film Superman. You'll see it on July 11th in theaters only. Um, he's a little green guy. We've been talking a lot about him on shows recently. Uh, I brought home coming Superman. Not like an old Superman movie. The new Superman movie. Okay, I missed this.",
            "start": 3446.48
        },
        {
            "text": "Um, he's a little green guy. We've been talking a lot about him on shows recently. Uh, I brought home coming Superman. Not like an old Superman movie. The new Superman movie. Okay, I missed this. Uh, Bear, when you get a chance, throw up a picture of maybe Joey, please. Um, I brought home a new uh bunch of toys last night that you all made fun of me cuz I got a box from Target. You thought maybe my Switch got early delivered, but no, it was Superman toys. And Ben had a lot of questions about Baby Joey. And but like the first question was, \"Who is this?\" Yeah. And I said I said, \"It's baby Joey.\" I have more questions now. I said I said, \"No, hold on one second though.\" I said, \"It's baby Joey.\" And he looks at me dead in the eye. He goes, \"Oh, like you're Joey.\" I was like, \"Yeah, I'm glad you associate baby Joe with Joey Noel. That's what I want. That's what I want out there.\" Poor Joey. Baby Joey's going to be very important to the film. Don't worry about it. I need to rewatch those",
            "start": 3489.44
        },
        {
            "text": "you associate baby Joe with Joey Noel. That's what I want. That's what I want out there.\" Poor Joey. Baby Joey's going to be very important to the film. Don't worry about it. I need to rewatch those trailers. I do not remember this guy in the trailers yet. He's just making 10 different pieces of birch for Baby Joey. He's very He's going to be very important to the story. I don't want to ruin it for you. There's like seven action figures and Baby Joe is one of them. Do you know him from the comic? No, he's a new creation. Oh, okay. All right. All right. But like the the kids activity book has given us new insight into what's going on in the film. So, we have some confirmation on who Baby Joey is officially. More questions about the hammer though, but we'll get to that later. Number six, James Gun is going crazy. Number six, Sergeant Studios announces a horror game, Dead Take with Pocket Pair Publishing. This is Jordan Middler over at VGC. Uh, Surgent Studios has announced its next",
            "start": 3525.68
        },
        {
            "text": "James Gun is going crazy. Number six, Sergeant Studios announces a horror game, Dead Take with Pocket Pair Publishing. This is Jordan Middler over at VGC. Uh, Surgent Studios has announced its next game, Dead Take. Uh, the game, which Pocket Pair Publishing will publish, will be released this year. Quote, \"In Dead Take, you play as an actor who becomes uneasy when your friend won't answer the phone,\" reads the description of the game. Uh, I thought Joey was mad about the Baby Joey thing, which she's warning us about communal Doritos on the table. Quote, \"Deve into the gilded rot of the entertainment industry and show up at the last place he was before he went quiet, a dark, opulent mansion.\" Uh, haunted by mysterious and humanlike figures, you advance into the house by solving object-based puzzles and splicing together the video clips you find along the way. Oddly quiet for uh the sight of a glamorous party just hours before the house is now populated by the figures that seem to turn",
            "start": 3562.72
        },
        {
            "text": "puzzles and splicing together the video clips you find along the way. Oddly quiet for uh the sight of a glamorous party just hours before the house is now populated by the figures that seem to turn up where you least expect them. This sounds [ __ ] dope. Quote, \"We are being secretive for a reason,\" said Abu, CEO of Surgeon Studios. Uh, the subject matter of this game is delicate and it hits close to home. When it comes out, and it won't be long until it does, I want players to think, I can't believe they actually did this. That sounds [ __ ] awesome. It sounds really cool. It sounds like immortality matched up with just like a puzzle Poppy game out there for you. Yeah. No, I'm all about it. And I'm all about the fact that Surgeon Studios is out here doing their thing. Of course, it's such a quick turnaround cuz um Yeah, ex Yeah. Tales was last year. So to already be be out here a year later talking about your next thing in detail as far as what it is really exciting. There's an",
            "start": 3605.52
        },
        {
            "text": "such a quick turnaround cuz um Yeah, ex Yeah. Tales was last year. So to already be be out here a year later talking about your next thing in detail as far as what it is really exciting. There's an energy to this show. Oh, okay. Yeah, sure. Yeah. I don't want to take it. I just want No, here Tim is doing it. Me and Joey are all Did you hear that? Ben now Yeah. We were like that's kind of crazy. Did you hear that Ben is now associating baby Joey from the Superman movie with you? It's happening. It's happening everybody. That's you. That's you now. Baby Joey right there. Yeah. Well, it happened. Don't worry about it. Yeah. I feel like Oh, you're not They can't hear you. You're not the mic. Yeah. I feel like we people at kind of funny are often matching. I don't think it's ever been you and I. That's true. I love that. A new dynamic duo was born today. Just me and you, Joey. It's the There's on the top there's a little trigger. Yeah. Uh I'll break my own. Uh my question for y'all about",
            "start": 3643.84
        },
        {
            "text": "I. That's true. I love that. A new dynamic duo was born today. Just me and you, Joey. It's the There's on the top there's a little trigger. Yeah. Uh I'll break my own. Uh my question for y'all about uh this game here from Surgeon, of course, like we said, Tales of Canera. Um the you won't have to wait and it won't be long until it does. You think we're getting a shadow drop at SGF? Oh, that would make you get out here, you make the waves, you say we got a cool game, you get all the news out so that when you shadow drop it there, people like, \"Oh [ __ ] that was that was fast.\" I mean, remember Abu came out at Game Awards Achilles show. So, I can see him coming out again at Summer GameFest. Hell yeah. I like the shadow drop. That's very smart. Showing all the all the different things. Yeah, I was uh looking to see if there was like a indie show specific or anything like that. Isn't the future showcase always Sunday? Is that is that happening? I don't see that here. Although I feel like",
            "start": 3681.76
        },
        {
            "text": "I was uh looking to see if there was like a indie show specific or anything like that. Isn't the future showcase always Sunday? Is that is that happening? I don't see that here. Although I feel like a Boo would fit on a Summer GameFest stage. Yo, this [ __ ] looks good. I'm just letting y'all know right now. This home screen, there's just subtle differences, but like the curved squares on the icons. I like that. That's interesting. So, you did the system transfer. Yeah. And so, it just threw all your cards over there. And now it's downloading everything, I think. Yeah. Yeah. Okay. That would have not taken nearly as I thought it would. You having regrets over there? Oh, no, not at all. I've already got my Animal Crossing island thing installed on this one. I'm I'm set to go on the games I really care about. I'm fine. Don't worry. Oh, yeah. I do like this home page. Don't you sweat about it. Now, do they have more themes? Not yet. What does that mean? Potentially never because I can",
            "start": 3731.92
        },
        {
            "text": "I really care about. I'm fine. Don't worry. Oh, yeah. I do like this home page. Don't you sweat about it. Now, do they have more themes? Not yet. What does that mean? Potentially never because I can see Tim screen is dark. Dark baby. The light screen. While they go through that, I'll give you number seven. Required reading an update from Agro Crab. This is from their Steam blog post. Uh the bullet points are goes as follows. Late last year, they announced they're working on game three after in a game. By the way, Aggro Crab, if you're not familiar, are game I loved going under, which many of you didn't play. And then of course, they did not Another crabs treasure, which was the crab souls like that broke out and already talked about. Anyways, late last year, they announced they're working on game three. After a few months, they lost funding because their funding partner had different visions of what they saw in game three. That game was going under two. [ __ ] Agro Crab has shelved",
            "start": 3771.76
        },
        {
            "text": "on game three. After a few months, they lost funding because their funding partner had different visions of what they saw in game three. That game was going under two. [ __ ] Agro Crab has shelved the game indefinitely. [ __ ] Partly because of the funding, but also because the team was burnt out. Understandable. As a studio, they decided they needed to change what they were doing to remain sustainable. Uh they did a game jam and made two games, Peak and Crash Out Crew. They're calling these small projects in Aggro Crab Side Hustle. Once those are done, uh they also have a third larger project that they plan to start this year. Yeah, I put it as required reading because it's I mean this is really the boil down of it, right? But like if you go in and read this this Steam post, I think it's just interesting from the perspective of saying how an indie game studio works and functions and how funding can can really dramatically change what your feature output is. And they all they were",
            "start": 3809.68
        },
        {
            "text": "just interesting from the perspective of saying how an indie game studio works and functions and how funding can can really dramatically change what your feature output is. And they all they were also very open and transparent as far as like, oh yeah, once funding was pulled that kind of made us take a look around and realize, oh, we are burnt out. We've been working on this project for or we've been working on big project to big project and like after three years of working on this, we're actually kind of over the idea or at least burnt out on this idea for now. And so we're shelving this game and this is why this is how we reset. This is why we did a game jam. These are the ideas that we have and now, you know, we're going to work on our big game three uh starting this year. I really want to figure I really want to see what this Crash Out crew thing is because that's a good title for a game. Yeah, really good title. Yeah. Interesting. Uh good for them again identifying all of that",
            "start": 3850.0
        },
        {
            "text": "to figure I really want to see what this Crash Out crew thing is because that's a good title for a game. Yeah, really good title. Yeah. Interesting. Uh good for them again identifying all of that uh and then be able to sustain so far, right? Usually hears something like this and it's the studio's closing, these people are leaving, we laid people off. It seems like that's not the case yet. It just seems like, hey, cards in the table. We were working on going under two and that's not going to happen and now we're pivoting to this and we're burnt out. So, more power to them. Of course, uh, you know, that clarity is rare sometimes from game developers for many reasons. So, it's nice to see somebody go this way with it. But Tim, yes, us getting the switch to Aggro Crab pivoting, all these things. It's huge news. It's big news. It's too big. If I wanted smaller news, say the tiniest news I need to know about, where would I go? You'd go to my desk where I'm going to go right now because I'm",
            "start": 3887.04
        },
        {
            "text": "It's huge news. It's big news. It's too big. If I wanted smaller news, say the tiniest news I need to know about, where would I go? You'd go to my desk where I'm going to go right now because I'm going to plug into Ethernet. So my stuff will download faster cuz I have too many Switch games. Um, but Bless, where would you go for small news? Well, you would go to our last news story, the Wii News Channel, where we cover all the small news items you need to know about. Thank you. Uh, at number eight, the Wii News, uh, from the No Man's Sky website. Expand your planetary empire and No Man's Sky beacon. Become overseer of multiple planetary planetary settlements and discover the townships of the secretive robot autophase. uh introducing improved settlement balance, more variety of management decisions, building upgrades, infestations, new base parts, and more. No Man's Sky, the game that continues to keep on giving. How much of the the development time do you think they spend on trailers?",
            "start": 3921.52
        },
        {
            "text": "building upgrades, infestations, new base parts, and more. No Man's Sky, the game that continues to keep on giving. How much of the the development time do you think they spend on trailers? Cuz like they got to have the trailer guy on retainer at this point. Like, yo, just don't leave. Yeah, we're going to need you about every two months to put put together a banger. Yeah, good for them. What a game, man. Every time something happens, I go, man, I really want to get deep into it. And I do it and I play for like four or five hours and then I get to that first thing where you really got to build the base. I'm like, \"Oh man, I hate base building.\" And stop. Yeah. You know, the same thing happens. Well, the same thing happened to me, but then I stopped afterwards. It was like the big No Man's Sky update in like 2019 or some [ __ ] like that. And I was like, \"Oh, this sounds really cool.\" And I tried playing it. I I had to come to the realization that it's just not a game for me, even",
            "start": 3963.36
        },
        {
            "text": "Sky update in like 2019 or some [ __ ] like that. And I was like, \"Oh, this sounds really cool.\" And I tried playing it. I I had to come to the realization that it's just not a game for me, even though I respect the [ __ ] out of it and think that what they're doing is extremely cool. Uh, for Mario 64, Super Mario 3D Allstars, a D-listed and out of print game, by the way, got an update for Switch 2. Quote, \"Several adjustments have been made to improve gameplay on the Nintendo Switch 2.\" End quote. It's the weirdest company ever. Update Mario Allstars 3D. They had to do something, you know. Uh, Fortnite on the Switch 2 will support game chat and mouse controls. There you go, Andy. And then Madden 26 launches August 14th. Love it. And that's it for we news. Uh we asked people watching live to super chat to be part of the show. Obviously so many of you have. Let's jump in here and see what's been going on. Lots of stuff. Oh my gosh. I'll start at the end and go there. Uh Cindy Swinny",
            "start": 4000.56
        },
        {
            "text": "to super chat to be part of the show. Obviously so many of you have. Let's jump in here and see what's been going on. Lots of stuff. Oh my gosh. I'll start at the end and go there. Uh Cindy Swinny got introduced to gamers with split fiction and she found out gamers love bathwater. Got to respect her for honoring the culture. I mean Tim um you know explained how she's doing all these things, right? And is making making moves. There is a big I feel like a big market for Sydney Sweeney just attaching herself to video game movies. Like I don't think I don't know if anybody there's not the trend yet of like a specific actor doing it, but like as soon as an actor realizes how many money in those hills. Yeah, there's money in those hills. What if I just star in every single video game movie and become the video game person? Sydney Sweeney, you might be the person. You might be the person. Go do it. Uh Jackie M says in a super chat, \"Twitch two servers are [ __ ] It's nine hours to download",
            "start": 4042.72
        },
        {
            "text": "become the video game person? Sydney Sweeney, you might be the person. You might be the person. Go do it. Uh Jackie M says in a super chat, \"Twitch two servers are [ __ ] It's nine hours to download split fiction.\" Well, damn. We all predicted it and we'll see what happens. Maybe it's just a Pokemon stream tonight. Nobody knows. Uh, Jack Hill says, \"Originally came over to Kind of Funny after Tim was on Woods Nintendo podcast. Uh, talking Switch Pro predictions. Everyday listener since then. Y'all rock.\" Thank you, Jack. Jack Black, that's a good point. Yeah, Jack Black already is has a head start on the video game thing. Sure. Yeah. Yeah. Okay, I get that. Cuz he was Was he in Borderlands? Clap. Oh, yeah. He's been in Mario, Borderlands, and Minecraft. [ __ ] dude. Shout out Jack Black, the trilogy. Yeah, he already figured it out. Um, Icy Weiner says, \"Tim's shirt looks good. Please do the dong test.\" That's for sure. That's what Tim's doing at his desk right now. Don't worry about",
            "start": 4082.16
        },
        {
            "text": "the trilogy. Yeah, he already figured it out. Um, Icy Weiner says, \"Tim's shirt looks good. Please do the dong test.\" That's for sure. That's what Tim's doing at his desk right now. Don't worry about that. Uh, com man 1192 says, \"Office Smash Brothers tournament stream.\" Oh, please. I've Are you a Smash guy? I didn't know. Yeah. No, I [ __ ] love Smash. I've been waiting for about 5 and a half years of working here to prove my Smash ability. Really? When I would listen to the podcast before getting hired, all I heard about was people playing Smash, you know, between between podcasts and I'm like, \"Oh, I want to get I want to do that. I want to get into that.\" And then I came and then the [ __ ] pandemic happened and then Smash never happened. I came back and we were all boring. That's my hope. This is if you remember when we announced the studio in the in the trailer, Andy's thing was, I hope we get a big TV and all play games around it. And that's never happened. So, what I would",
            "start": 4127.12
        },
        {
            "text": "my hope. This is if you remember when we announced the studio in the in the trailer, Andy's thing was, I hope we get a big TV and all play games around it. And that's never happened. So, what I would like to do is I'd like to set up one of the little [ __ ] coffee table, the little folding dinner tables out there, and put it under there and put a switch there and a bunch of controllers once we're done with the stream and we're using every controller. But like, so you could play Mario Kart over there. You could do an office switch that just stays there. Yeah, let's do it. We got them out, right? Figure it out. Um, Jay Sandival super chats and says, \"Cue to Greg, happy switch day to you.\" Happy Switch Day to you. Happy Switch Day. I like that. Thank you. Good. Uh Tom says, \"Does Nintendo ever go back to a pure console?\" Oh, I see what you're saying. Then he says, \"On Ly?\" I don't know what that means. Only only. Yeah. Yeah. Uh yeah, maybe. Who knows? I mean I mean you could I definitely",
            "start": 4164.32
        },
        {
            "text": "go back to a pure console?\" Oh, I see what you're saying. Then he says, \"On Ly?\" I don't know what that means. Only only. Yeah. Yeah. Uh yeah, maybe. Who knows? I mean I mean you could I definitely could see it. I don't think it would necessarily happen. I yeah I kind of lean toward no more than yes but like the industry moves and changes and the needs of the audiences change, right? So like right now the need for I think the Nintendo audience is for a handheld thing, right? Because Nintendo was serving those two audiences for a very long time between handheld and home console and then that split their development teams put them in a weird place especially how with how the industry evolved with mobile and how um you know consoles got more powerful and Nintendo kind of got left behind. this was the perfect solution to all of that, right? To go, hey, we'll just do it all, right? Like we might not have the fidelity of a PS of a PS4 or an Xbox One, but we can get you to good enough and",
            "start": 4209.56
        },
        {
            "text": "was the perfect solution to all of that, right? To go, hey, we'll just do it all, right? Like we might not have the fidelity of a PS of a PS4 or an Xbox One, but we can get you to good enough and then also let you take your games on the go and then also have the first party stuff. Like turns out that was the magical formula to make Nintendo like as powerful as they've ever been. Sure. Um, and I think that's it's hard for me to think of a future, at least a near future, where that doesn't remain the case as far as that being the most viable thing. But never say never as far as how things move and change. Like, who knows? Maybe cloud does become the next big frontier and everybody's chasing after that and Nintendo finds something that there that turns their whole business into something else. But right now, I would lean on handheld being, yeah, just the for the foreseeable future, I think for sure. Uh, but yeah, I think anything can change and anything can happen. So, yeah, who knows",
            "start": 4259.36
        },
        {
            "text": "But right now, I would lean on handheld being, yeah, just the for the foreseeable future, I think for sure. Uh, but yeah, I think anything can change and anything can happen. So, yeah, who knows where it's going to go one day. Uh, final two super chats come from AK98 who says, \"Rest in peace, Exeantiant. Shut down forever this morning.\" Yeah. And then Joshua says, \"Blessing. No need to prove your smash ability, my dude.\" I appreciate it. Thank you. I also appreciate the comments on my shirt. There are people that are like, \"Where'd you get this shirt? It's cool.\" Uh, you know, that's a really good question. I think this is one that was sent to me by Nintendo years ago that I rarely ever wear because I don't dress like this, but on occasions like today, special days. Yeah. Uh, we asked you if you're watching live to keep us honest at kind of funny.com/you wrong. Uh, Brad said, \"Undead Undead Labs, let's go.\" And then link to uh, Clo Brilly on Twitter. Undead Labs working on State of",
            "start": 4298.72
        },
        {
            "text": "if you're watching live to keep us honest at kind of funny.com/you wrong. Uh, Brad said, \"Undead Undead Labs, let's go.\" And then link to uh, Clo Brilly on Twitter. Undead Labs working on State of Decay 3 posted a new picture one hour ago and it's got some writing on it that I don't understand and like a sandy crop circle or whatever. So, they're doing something over there apparently. That's makes sense. Of course, the Xbox showcase is Sunday. We will be live reacting and doing a post show. Get ready for that. And then Kabs points out, \"Worth noting that the No Man's Sky update also makes cross-save functionality available to all players. It was in beta before this, but now it works with the new Switch 2 version, which is pretty dope.\" Yeah, big fan of cross save. Uh, everybody, that's another episode of kind of funny games daily in the bank. Remember, this is just the start of your programming day here. It's been confusing, but we're resetting to what it was before. So, from here, we",
            "start": 4335.6
        },
        {
            "text": "episode of kind of funny games daily in the bank. Remember, this is just the start of your programming day here. It's been confusing, but we're resetting to what it was before. So, from here, we will roll out into in review for the ballerina, the John Wick thing. There will probably be a little bit of a break and then we will come back around 1:45 for your pre-show to the PlayStation State of Play. There'll be a live react to the State of Play at 2 o'clock. Then there'll be a live Games cast post show for the State of Play. We will then sign off for a few hours and come back around 7:45 with Roger and Joey here and Andy and a whole bunch of people in studio. Uh Tim and Kevin and myself will be at the Nintendo store for the 9:00/midnight launch. We will get those. We will come back. People have already downloaded things here. We're all going to play games all night long leading into, of course, tomorrow's games daily leading into a whole big stream about Nintendo Switch 2. So,",
            "start": 4379.52
        },
        {
            "text": "People have already downloaded things here. We're all going to play games all night long leading into, of course, tomorrow's games daily leading into a whole big stream about Nintendo Switch 2. So, tonight's stream, the big one, only available on Twitch because it'll be so long. Uh, obviously all subject to change if Mario Kart just suddenly goes live and we can play it. So, whatever. Don't just don't. We're the only tab you need on your computer. Be cool. We're the only tab we need on your computer. Just constantly be checking on twitch.tv/confunny games, youtube.com/kindfunnygames. If you like us having no rhythm because we're just pivoting to the news, whatever it is, whatever it is, freestyle, get a kind of funny membership, youtube.com/kindfunname, patreon.com/kindfunn, Apple and Spotify. You give us 10 bucks, we give you 80 episodes a month ad free. We give you a daily Gregway podcast each and every day. Of course, that adds up to four hours of podcasting each and every month.",
            "start": 4418.64
        },
        {
            "text": "You give us 10 bucks, we give you 80 episodes a month ad free. We give you a daily Gregway podcast each and every day. Of course, that adds up to four hours of podcasting each and every month. You also get good karma. You could also get posters and stuff, but we're not going to get into that right now. Instead, we're going to figure out what the hell's going on around here. It's Nintendo Switch 2 day. It's SGF week. It's Xbox week. It's Outer Worlds week. We didn't even talk about the PlayStation State of Play. Oh my god. That's happening later today. That's exciting. Until next time, everybody. It's been our pleasure to serve you. [Music]",
            "start": 4460.32
        }
    ]
}