{
    "id": 14207,
    "video_id": "ap4Slrs9jZU",
    "show_name": "Gameplay",
    "hosts": [
        "Barrett Courtney"
    ],
    "title": "Mario Kart EXPERT Plays Mario Kart World for the FIRST TIME",
    "description": "Go to http://kindafunny.com/XREAL to grab yours now!\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1749152063,
    "duration": 3206,
    "transcript_chunks": [
        {
            "text": "What's going on everybody? My name is Barrett Courtourtney. You might know me here at Kind of Funny as the resident Mario Kart 8 expert. Uh I've put hundreds of hours into Mario Kart 8 over the years. I have, as we've talked about on other pieces of content, 29,000 uh coins that I've collected throughout uh races uh throughout the years. I have three stars on every Grand Prix in 150cc, mirror mode, and 200cc. And this is my first time booting up and actually playing Mario Kart World. I picked up my Switch 2 last night. If you watched our launch party stream last night, I was purposely uh not joining uh the fun because Mario Kart means a lot to me and I I wanted this to kind of be a a personal kind of uh intimate moment with myself and the first new Mario Kart in over a decade. Uh and so here here I am. I've I've downloaded a bunch of games last night. I was up until 2 a.m. uh downloading a bunch of stuff. Uh you might be wondering why Persona 5 Royal. I was just kind of curious uh",
            "start": 0.24
        },
        {
            "text": "here here I am. I've I've downloaded a bunch of games last night. I was up until 2 a.m. uh downloading a bunch of stuff. Uh you might be wondering why Persona 5 Royal. I was just kind of curious uh because I know uh some games, especially Persona 5 Royal, look a little fuzzy on the Switch one. So, I was just curious like of a game that doesn't look, you know, the best on Switch One, not getting any upgrades on Switch 2, what's that difference there? Stuff like that. Uh and just other games I'm uh interested in in in playing uh soon. Got Delta Rune. I'm very excited for. But it's time for Mario Kart World. Um, I'm excited. I'm I've feel like I have forgotten a lot of the things that I've I've watched. Obviously, there's like systems and new things that uh have stuck with me, but as far as like courses go, I don't feel like outside of the Donkey Kong one uh that looks really really cool. I don't feel like I really like have taken any of that in. So, this is going to be me going in this",
            "start": 53.6
        },
        {
            "text": "like courses go, I don't feel like outside of the Donkey Kong one uh that looks really really cool. I don't feel like I really like have taken any of that in. So, this is going to be me going in this with uh with fresh eyes. So, here we go. I'm very excited. I'm very tired because yeah, I stayed up until two in the morning downloading a bunch of games and getting excited for this. And oh, look at that map. Now, I'm I'm interested to see uh what the open world is like. I don't think I'll do that on this let's play uh here. Um Oh, hold on. Yeah. Yeah. Let's let me let me take this in. There's that boy. There's that little Italian man. Mario Kart [Music] World. This is a great tune. It was one of those I love the Mario Kart 8 soundtrack a lot. I love the main theme for Mario Kart 8, but this is just this is an energy. This is a vibe. This feels like a new era truly. Uh this new uh Mario Kart World theme song. Oh, you waved to the cow. That's so cute. O it it I I don't know what track",
            "start": 99.68
        },
        {
            "text": "is just this is an energy. This is a vibe. This feels like a new era truly. Uh this new uh Mario Kart World theme song. Oh, you waved to the cow. That's so cute. O it it I I don't know what track this uh what uh song this reminds me of from Mario uh Odyssey, but there's just something about it that like this feeling of less so of like a new Mario Kart and more of like a new Mario Kart uh Mario uh game. Uh this song, if that makes any sense. But let's get in here. God damn. Uh, and so I think what I want to do, we got single player. What I want to do, cuz I'm, you know, I'm I I love the Grand Prix. That's, you know, what we've always played Mario Kart 4, right? Uh, but we've got the open world, we've got Knockout Tour, all this stuff. I think for the first half of this Let's Play cuz I I think we're going to go roughly an hour. Um, we're going to start with the first half being Grand Prix, taking in some of the new tracks, and then I want to try Knockout Tour maybe for some of the",
            "start": 169.92
        },
        {
            "text": "I think we're going to go roughly an hour. Um, we're going to start with the first half being Grand Prix, taking in some of the new tracks, and then I want to try Knockout Tour maybe for some of the later uh uh things. I don't know how Tour works in terms of like are they just the Grand Prix interconnected? Are they different uh kind of tracks from different Grand Prix interconnected? Uh again, this is uh this is all new to me, so I'm going in here uh fully unknowing. So, we've got our roster. We got a lot of people going uh on here. Uh got a lot of unlocks that we have. God damn. God damn. Um yeah, some some like I already see Waluigi. I see another Donkey Kong here. Yeah, I'm interested to see how like the costume system and character system works. And so here's the tough thing, ladies, gentlemen, NBs. I had a man for 150cc and his name was Link, last name unknown. But in this game, only the core Mario characters essentially are in here. No outside Nintendo characters. And so I felt",
            "start": 218.88
        },
        {
            "text": "gentlemen, NBs. I had a man for 150cc and his name was Link, last name unknown. But in this game, only the core Mario characters essentially are in here. No outside Nintendo characters. And so I felt a little bit lost of like, oh, I don't have my boy Link anymore for 150cc. He's my main. I like his speed, especially with his bike. Uh, that always felt good to me on 150 C. And so I was starting to think, all right, well, on 200cc, the mode that I played on the most, my my main was actually someone different, cuz Link to me felt like he was a little bit too fast for me for 200cc to be able to actually uh get around some of uh some of the crazier turns in the game. And so I went with my boy Shy Guy. And I just learned last night on stream that we don't have the color variants for Shy Guy because in Mario Kart 8, my main was black Shy Guy because his color represented the color of my soul. I also wear a lot of black and so that like he he felt like a a little a little homie and his black",
            "start": 270.84
        },
        {
            "text": "in Mario Kart 8, my main was black Shy Guy because his color represented the color of my soul. I also wear a lot of black and so that like he he felt like a a little a little homie and his black get up but from what I understand we're not getting that today which is very upsetting. Um smart steering we're going to turn off and then yeah all this other stuff I think is fine. Dash food transforms doesn't transform. Oh, interesting. You can just like uh do the dash food just to collect and not necessarily transform mid mid race. That's neat. Um all right, we have smart steering off. Now we have to look at our carts here, which we don't have a lot of. My instinct is to go with a motorcycle, honestly. Um, I like the basic cart with Shy Guy, but again, 200cc because I think that those are fair speeds to recognize what you need to do for 200cc. So, I think I kind of want to go with a uh with a motorcycle here cuz yeah, that uh I mean, a lot of the the speed on that motorcycle isn't great.",
            "start": 332.64
        },
        {
            "text": "speeds to recognize what you need to do for 200cc. So, I think I kind of want to go with a uh with a motorcycle here cuz yeah, that uh I mean, a lot of the the speed on that motorcycle isn't great. The acceleration is good. I mean, yeah, even the the cart. You know what? We're going to go basic cart. I like the, you know, I like the the black uh kind of pipe cart kind of contrasting with Shy Guy here. Um here we go. I don't even want to like look through the rest of them. Like again, I'm I I truly feel like I don't um haven't really taken in all of the tracks here. So, like I just want to just jump in here. Here we go. My first time playing Mario Kart World and seeing how it truly feels. Can't tell if this is just like a pre-rendered video because it doesn't look great. Looks a little pixy and and soft. God, that DK one is uh is going to be so fun. Yeah, here we go. This looks [Music] better. Power of the Switch 2 can't handle pre-rendered uh cut scenes. get that bit ex export that uh",
            "start": 398.56
        },
        {
            "text": "and and soft. God, that DK one is uh is going to be so fun. Yeah, here we go. This looks [Music] better. Power of the Switch 2 can't handle pre-rendered uh cut scenes. get that bit ex export that uh that pre-rendered video Nintendo at like uh a higher bit rate, you know. Let's get some of that lossless uh quality [Music] there. All right. Feels like it takes a little longer to get [Music] the question blocks. So, yeah. Oh, the grinding, right? I feel that the the question blocks take a little bit longer. Oh, wait. Can I not hold the Oh, interesting. I'm so used to just like holding the um Oh, Bowser went another way. Interesting. Okay. Oh, that's cool. All right. wasn't very effective, but again getting a sense of like what to use the little uh uh feather for. Roger, go to bed. You've been streaming all night. Jesus. Okay, so items automatically. Yeah. So, is there any like balancing here that I have to like really pay attention to? Oh. Oh, I like that. uh animation for the lightning.",
            "start": 457.88
        },
        {
            "text": "streaming all night. Jesus. Okay, so items automatically. Yeah. So, is there any like balancing here that I have to like really pay attention to? Oh. Oh, I like that. uh animation for the lightning. Oh, we came back really quick. Interesting. I wonder if lightning now is more of just like to to stop you in your place cuz like the the big thing with lightning in the past was to make you small for a long time. Yeah, we're going to go this way now. Ooh, hammer block. A hammer is cool. All right, here we go. Now's our time to [Applause] shine. Uh-oh. Uh-oh. Oh, not the blue shell. Getting blue shelled so early on. Or not early on. Sorry. Uh, getting blue shelled when I'm finally in third or uh in first place in the third lap. God damn it. I'm getting distracted. Oh. Oh, I love the animations. That sucks. But, you know, you're you're used to everything being so clean in Mario Kart 8. And I love the a bit more of the animated style here for some of the stuff in uh in World. All right, here",
            "start": 532.92
        },
        {
            "text": "That sucks. But, you know, you're you're used to everything being so clean in Mario Kart 8. And I love the a bit more of the animated style here for some of the stuff in uh in World. All right, here we go. Third place. That's okay. We're still learning. You know, I wasn't an expert at Mario Kart 8 right out of the gate, right? It took time. You know, I studied the blade for years and years. uh until I would I would claim to be an expert in Mario Kart 8, at least comparatively to uh you know the rest of my cohorts here. Kind of funny. Oh, interesting. So, we This is We're starting off where the first race was and now we're going Oh, okay. This is cool. This is fun. Oh, we got cars. Oh, we're going to go get that bag. And we got goombas. See, that's the cool thing. Like I love that there's enemies kind of like in the open world that are like going to kind of mess with you. Oh, see I like the pick crew shy guy. That's cute. Damn it. Yeah, drifting feels a little a little different. But I",
            "start": 609.12
        },
        {
            "text": "kind of like in the open world that are like going to kind of mess with you. Oh, see I like the pick crew shy guy. That's cute. Damn it. Yeah, drifting feels a little a little different. But I wonder if that's just because the animation looks different that it only I'm only perceiving it as feeling different. I I definitely get what Tim's saying here with these like wider tracks. It definitely feels like uh a bit slower there, like even at 150. But that's proven. You know, just because it's slower doesn't mean I'm going to be great at it right away. So, there's still a lot to learn here. Oh, you got that boost off of me. [ __ ] Donkey Kong. Oh, yeah. Let's get him. Let's let him get blue shield here. Love that. So, this is kind of more of like the um Wario um mountain thing. I forget what it's called. So, how do you jump? I forget. Is there a dedicated button for that? Oh, yeah. Okay. R2. Okay. So, I can't jump that high. [Music] Okay. I always forget that jump is just kind of the the",
            "start": 678.56
        },
        {
            "text": "it's called. So, how do you jump? I forget. Is there a dedicated button for that? Oh, yeah. Okay. R2. Okay. So, I can't jump that high. [Music] Okay. I always forget that jump is just kind of the the same one as uh drifting. Oh, and then the like the terrain the map changes with each lap cuz that's how long it is. That's cool. Whoa. Cool. Oh, we're collecting more coins more than 10. Interesting. I wonder what we can go up to. And does that actually affect the speed? Who knows? Still yet to be determined. I thought we were going to fly [Music] there. All right, I'm getting into the groove. We're grooving. Oo, I think that was a red shell. Oh, now we're flying. Now we're flying [Music] high. There we go. Feels right. Being first feels right. Now there's going to be a lot of pressure for me. Like uh right now I'm recording this during uh Games Daily and then we're doing like kind of our switch to continued launch party after that. Um, and I feel like there's going to be a lot of",
            "start": 746.84
        },
        {
            "text": "for me. Like uh right now I'm recording this during uh Games Daily and then we're doing like kind of our switch to continued launch party after that. Um, and I feel like there's going to be a lot of expectation when I leave this room and go on to the stream that I'm just going to kick everybody's ass right away. And then I just want to let you know it's probably not going to happen. There's probably going to be a good back and forth in these first couple of weeks, but then they're going to everybody else is going to get focused on other stuff, other games, and I will still be playing Mario Kart World, and eventually I will be uh too good to keep up with for these jabronies at least. Oh, what? Oh, what the [ __ ] I assume that would have taken me to where I needed to go, but I guess I guess not. I guess I was wrong. Again, a lot to learn. Bayside Coffee. I can't believe uh Nintendo's uh old school pop punk fans there. Oh, we're going to get another another bag here. Nothing. Okay. All",
            "start": 822.8
        },
        {
            "text": "not. I guess I was wrong. Again, a lot to learn. Bayside Coffee. I can't believe uh Nintendo's uh old school pop punk fans there. Oh, we're going to get another another bag here. Nothing. Okay. All righty, Donkey Kong. I need you to chill out. I love just flying around. It's very peaceful. Flying in real life. Awful. Terrible. One of the most nerve-wracking things. Oh, come on. Oh god. ice balls. That's cool. Oh god. And then Yeah. Oh, we come back so fast. I'm not used to that with the with the lightning. I like it. The lightning is annoying for other reasons though cuz I think it still takes away um your items if you're holding any items. I'll have to pay attention to that next time I get zapped. [Music] Ooh, this is a fun vibe. Again, like they're they're already nailing this, right? Like the the magic of Mario Kart, at least especially with Mario Kart 8, is kind of the the theme park vibe of it. And just like getting to this like train castle thing is awesome. It's so It's so",
            "start": 873.76
        },
        {
            "text": "Like the the magic of Mario Kart, at least especially with Mario Kart 8, is kind of the the theme park vibe of it. And just like getting to this like train castle thing is awesome. It's so It's so theme park coded. Look at it. It's It's the I don't know if it's the same exact train from Calamari Desert, but you know what? In my heart, it's the same exact train. Same driver in there, too. So, you get a little boost when you do a jump on the rail. I like that. Oh, [ __ ] Whoopsies. I didn't have that many coins. Crazy. Cool. Almost lost that one, but we got there. We got there, chat. There's no chat. We got there comments. I like the little crown on him. I feel like that was I don't think crowns were a thing when you finished a race. At least like in the game. Crowns were definitely a thing playing online. Feels like an idea where they're like, \"Hey, the crowns are kind of neat. [Music] I'm fascinated to learn how online works, like getting rooms together, all that stuff. All right,",
            "start": 963.44
        },
        {
            "text": "playing online. Feels like an idea where they're like, \"Hey, the crowns are kind of neat. [Music] I'm fascinated to learn how online works, like getting rooms together, all that stuff. All right, here we go. Final race. Yeah, this is so cool. It does remind me that like even like doing this stuff for the Grand Prix of like going from or literally starting from this track to go to the next one is a reminder of like how much this was built for Knockout Tour. I feel like ah the music it's so good and Boo King Buu really like wasted that jump there idiot. Oh, and there are the little booties. [Music] Now, I wonder if you play as a gloomba. Probably not, just cuz, you know, they they gota even though Mario Kart is all about the chaos, they got to make it fair. But it would be funny if you played as a gloomba and then the glmbbas in the open world didn't come after you cuz they're like, \"Oh yeah, that's the homie.\" But if they still come after you, maybe they're thinking in their head, \"Yo,",
            "start": 1030.96
        },
        {
            "text": "as a gloomba and then the glmbbas in the open world didn't come after you cuz they're like, \"Oh yeah, that's the homie.\" But if they still come after you, maybe they're thinking in their head, \"Yo, this gloomba is out here having a fun time with Mario and [ __ ] and he's our sworn enemy.\" I've talked about this on my own personal streams, but I I do wonder how the glmbbas see Mario, you know, and I think it's a serial killer, honestly. Unprovoked, just stomping on glmbbas all the time. It's messed up. God, I'm I got to get used to that. I want to hold L2 to like [ __ ] Was that my own green shell? God damn it. Oh no, this is bad. Ah, my first time doing this course too. What a moment that was too of DK like uh Robo DK there. Yeah, this is fun. This is good. Yeah, I got to get used to this drift. It feels a little bit It's hard to describe how it feels compared to Mario Kart like uh Mario Kart 8. Like it Mario Kart 8 is definitely um Oh, that was the wrong time to do that. um tighter.",
            "start": 1105.84
        },
        {
            "text": "drift. It feels a little bit It's hard to describe how it feels compared to Mario Kart like uh Mario Kart 8. Like it Mario Kart 8 is definitely um Oh, that was the wrong time to do that. um tighter. I don't want to say that this drift feels floaty, but there's something about it that feels different. I don't know. Like I I I don't want to necessarily call it like a bad drift yet. Obviously, it's very it's still very new for me. So, maybe once I get used to it, I'll uh you know, feel a little bit more of the the vibes there. But Oh, come on. A red and a blue shell. Come on. That's crazy. That's crazy talk. Nintendo, you're trying to get me with the boomerang, too. Oh, King Buu snuck past us. Oh my goodness. Yeah, leave that bomb behind. All right, last lap. Oh my god, they're the barrels have gotten so big. Oh [ __ ] I knew that was going to happen. God damn it. No. Come on. Oh my god, he had so many red shells. [ __ ] you, Boo. A [ __ ] [ __ ] Boo. Better not have ruined my chances at",
            "start": 1168.88
        },
        {
            "text": "gotten so big. Oh [ __ ] I knew that was going to happen. God damn it. No. Come on. Oh my god, he had so many red shells. [ __ ] you, Boo. A [ __ ] [ __ ] Boo. Better not have ruined my chances at first place here. the math maths everybody. You love to see it. It's going to take a Do they still have like stars in this? Like do I get like two stars off of this Grand Prix cuz I got first but I didn't like get all 60 points. Is like is that still how it works? Is that still how we're rating things? [Music] I need to know. Yeah. Here we go. First shy guy. You love to see it. I miss the like Mario Kart 64 like let's or even like Super like the classic of like hey we're we're going up to like a podium and we're giving Shy Guy a a cool little trophy. All right. We've unlocked Donkey Kong. No stars. No 200cc, which I had to accept. And I had a feeling that that was going to happen. No link. I get it. I get it. You want to You want to start fresh. You want to start new. you want to like uh you",
            "start": 1241.12
        },
        {
            "text": "No 200cc, which I had to accept. And I had a feeling that that was going to happen. No link. I get it. I get it. You want to You want to start fresh. You want to start new. you want to like uh you want to like keep it to the core Mario thing and maybe expand later. Shy Guy only being red was a little bit of a almost of a breaking point for me. There is something about the not having stars for Grand Priest there. There's just something about like the completionist in me that like it it kind of breaks my brain a little bit of what? What do you mean? What do you mean? Also, so how do the costumeuming how does the costumeuming work? Okay, so here we go. We have this shy guy up here now. [Music] Okay. Oh, that's tough. Yeah, it just says that I did it. [Music] Man, take more of the wind out of my sales, Nintendo. It's okay. It's still a fun game. Yeah, it definitely feels like they're they're they're trying their best to or not trying their best, they're they're they're getting away from",
            "start": 1332.96
        },
        {
            "text": "my sales, Nintendo. It's okay. It's still a fun game. Yeah, it definitely feels like they're they're they're trying their best to or not trying their best, they're they're they're getting away from Mario Kart 8 of the kind of the sweaty competitiveness that that uh presented. Um trying to be less of a, you know, Mario Kart has always been a weird, at least to me, in between of Mario Party and Smash Brothers, right? And it seems like for this one, they're trying to lean a bit more into the casual fun of Mario Party and less of the like um super competitive let's let's get super serious about this uh vibe of Smash Brothers, which is okay. I can learn to love. And I know a lot of the other the the completionist side of this game is going to be the open world stuff, but that stuff interests me way less than like trying to perfect uh you know like uh how I drive in a Grand Prix, you [Music] know? All right. So, we'll probably do depending on how long this Grand Prix takes cuz that's the",
            "start": 1392.36
        },
        {
            "text": "me way less than like trying to perfect uh you know like uh how I drive in a Grand Prix, you [Music] know? All right. So, we'll probably do depending on how long this Grand Prix takes cuz that's the other thing. These like Grand Prix feel a little bit longer than your typical uh Grand Prix from games past. And I think that's just because of the the breadth of how big and long these uh some of these courses can be. So, we might just do one more grand this Grand Prix. Maybe we'll do one more after that and then we will take a break and then come back with some knockout tour. I love Shy Guy on this. Like I don't know. I don't know if I love the trade of not having black Shy Guy, but getting the pick crew Shy Guy. But you know what? I'll I'll take the P crew Shy Guy, you know? I I'll take that. I got to turn off notifications off uh on this Switch. I would have assumed that that setting would have transferred over, but apparently [Applause] not. Oh, they're coming. Those big boys, they're",
            "start": 1446.16
        },
        {
            "text": "I got to turn off notifications off uh on this Switch. I would have assumed that that setting would have transferred over, but apparently [Applause] not. Oh, they're coming. Those big boys, they're walking. [Applause] [Music] Now, as far as first time Mario Kart World experiences go, the screen that I'm playing on feels a little bit too bright. And I see my gameplay on OBS and like all that stuff. It looks good there. It's specifically this screen. Can I adjust settings here? Hold on. It's in cinema picture mode. What the [ __ ] are we doing? God damn it, Nick. Standard. Thank you. Jesus Christ. Just a absolute joke of a company here. Why are we putting We play video games on these on these screens. Who's putting this in cinema mode? Crazy. Insane. All right, the game looks much better now. All right, here we go. Time to lock [Music] in. Oh, big sand worm. Do you think we'll find Lisa and Al Gaib here? Just want to get a feel of how the jump Oh, I just changed back to normal Shy Guy.",
            "start": 1510.4
        },
        {
            "text": "All right, here we go. Time to lock [Music] in. Oh, big sand worm. Do you think we'll find Lisa and Al Gaib here? Just want to get a feel of how the jump Oh, I just changed back to normal Shy Guy. All right, I guess. See, I I just love him so much. He's just having such a fun time. Yeah, that's [ __ ] cool. He's so big. Is Paul riding him? Like, this feels slow, but it's like it's pe it's like a good it's like a good like break, you know? It's like a a calm before the storm. Yeah. I wonder what the coin limit is up to. I wonder if it's 20 now cuz we got 14 at one point. Oh, two in a row. Come on, Roselina. You got to you got to chill the [ __ ] out there. Oh, this is cool. Just cars just throwing uh just shooting [ __ ] bullet bills. Oh, okay. Don't hit L2 Barrett. Don't do it. That's That's going to take some deep reprogramming for me. [Music] Let's grind again. Ah, damn it. I missed it. And again, I'm like I'm so I I've tried to kind of wipe my memory of the courses themselves in",
            "start": 1597.04
        },
        {
            "text": "going to take some deep reprogramming for me. [Music] Let's grind again. Ah, damn it. I missed it. And again, I'm like I'm so I I've tried to kind of wipe my memory of the courses themselves in this game just to have a little bit of a a good wonderful feeling booting it up for the first time of just like taking it all in. And and Tim was saying that apparently there are some tracks that are like either remixes or what have you from older games. And I haven't recognized any. I think like if anything this one might have been the most that I've like recognized that like feels familiar. Wait, god damn. I like here's the thing. I was kicking the rest of the people's uh the the the racers asses here, but like Roselina was keeping up or uh not Roselina. God damn it, I've been calling her Roselina. Daisy has been keeping up with me. God damn. And I'm wondering I I saw them play a little bit, I think, of this Grand Prix last night. I'm wondering if this is because this is my first time playing",
            "start": 1686.32
        },
        {
            "text": "Daisy has been keeping up with me. God damn. And I'm wondering I I saw them play a little bit, I think, of this Grand Prix last night. I'm wondering if this is because this is my first time playing this Grand Prix and because she's unlockable in this one that she's just a bit more intense on the first goound cuz just her keeping up with me seems a little bit weird. Oh [ __ ] Oh god. I thought I spun out there. Whoa. How did Luigi do that? Oh, he did the like big jump here maybe. Oh, this is the It leaves a It leaves a bunch of coins behind and I got absolutely none of them. [Music] [Music] All right, seventh is not acceptable. We got to lock in. Maybe I don't win every race, but I would like to get first in this Grand Prix. You know, the bad use of the uh Oh god. Come on, Wally. Waluigi, be cool. [Music] God, the boomerang does not go nearly as far as I ever want it to. Oh, they replenish. Uh, replenish. Did coins replenish in the other games? Like lap by lap or whatever? Oh, here we",
            "start": 1764.64
        },
        {
            "text": "be cool. [Music] God, the boomerang does not go nearly as far as I ever want it to. Oh, they replenish. Uh, replenish. Did coins replenish in the other games? Like lap by lap or whatever? Oh, here we go. Wario Stadium. [ __ ] yeah. [Applause] [Music] Oh, they like when they get hit by the shells, it makes the tiny little like the OG [ __ ] shell uh noise. Hell yeah. That's awesome. [Applause] This is the track. This is the Mario Kart track for me. Boom. Back. Oo, did we grind a little bit on the that edge there? Are all edges uh grindable here? There we go. Oh, that's cool as [ __ ] Let's go. All righty. All righty. getting getting a bit more used to the the drifting here. His little song. Look at him. Look at him. He's a precious little boy. I love him so much. I love him so much. All right. Where are we going from here? [Music] All right, Ros or Daisy. God damn [Applause] it. Let's grind a little bit more. Let's see. I'm still trying to get a a feel on like what I should be doing",
            "start": 1859.2
        },
        {
            "text": "right. Where are we going from here? [Music] All right, Ros or Daisy. God damn [Applause] it. Let's grind a little bit more. Let's see. I'm still trying to get a a feel on like what I should be doing while grinding. Should I just not be touching the stick at all? Whoa. God damn, that took so long. God, that's cool. Oh, I want to get that question block. What are you? Ah, I still got some coins though. That was [Music] interesting. Oh, he didn't turn into anything. So, okay. So, that that's going to be the allure of openw world stuff. for maybe just like doing all the Grand Prix stuff with like all of the characters because certain characters are only going going to have certain costumes based off of certain locations. Okay. Okay. We're going to let this uh blue shell get Daisy here. Oh, god damn. Oh, okay. I still I I kept that item, but I think that's because that item technically came in. Yo, this is cool as [ __ ] Oh [ __ ] Oh [ __ ] This looks rat as hell. Final lap. Time to lock",
            "start": 1975.76
        },
        {
            "text": "damn. Oh, okay. I still I I kept that item, but I think that's because that item technically came in. Yo, this is cool as [ __ ] Oh [ __ ] Oh [ __ ] This looks rat as hell. Final lap. Time to lock in. Whoa. We're going up here. Oh, the little Monty moles. Just like the uh what Mario 3 uh Bowser ships. Oh, Daisy. I swear to [ __ ] God. Don't ruin this for [Music] me. I should not be in front of her right now. God damn it. I knew it. God, she sucks. I hate her so much. She's my new en enemy. [Applause] [Music] All right. Where we at? Where we at? Come on. Get there. Let's go. Woo. That felt good. Look at my little dude. Look at my little dude. Chill out, Daisy. It's your boy's time to shine. Oh, that that Grand Prix ruled. Oh, I loved this last course. That was so fun. All right, that's another Grand Prix in the books, which means I think we're only we're already like I forget how many Grand Prix there are, like six. We're already of the uh third of the way through the Grand Prix here.",
            "start": 2080.6
        },
        {
            "text": "Grand Prix in the books, which means I think we're only we're already like I forget how many Grand Prix there are, like six. We're already of the uh third of the way through the Grand Prix here. Uh and with that, we're actually going to take a word from our sponsors now. And then when we come back, uh, I will try my my hand for the very first time in Mario Kart World's Knockout Tour. This episode's brought to you by XRE. Y'all know that a few months ago, my life changed forever when I brought a pair of XR1 AR glasses on a long flight to New York. I legit could not believe how easy it is to use and high quality my experience was playing games, watching movies, TV shows on the plane without just too much extra stuff around me or especially not a giant goofy headset around my head. No joke, this is my favorite new tech product in years and it has earned a permanent spot in my travel bag. It is only hard to believe that it works as well as I'm saying until you try XR1 AR glasses for",
            "start": 2172.76
        },
        {
            "text": "this is my favorite new tech product in years and it has earned a permanent spot in my travel bag. It is only hard to believe that it works as well as I'm saying until you try XR1 AR glasses for yourself and then you will see that the future is now. The tech is here. Connect XRE1 glasses to wherever you are playing. Whether it's a handheld console, a PC, phone, home console. You just get a massive 150in virtual screen anywhere, anytime for any game. Gaming on the go like a long haul flight? You need the XR1. Next, starting to hurt from staring down at your handheld? We've all been there. You need an XR1. A screen as big as your wall. Instant plugandplay with all of your devices via USBC. Built-in audio with sound by Bose anchoring your screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full HD. These are what make XR1 a musthave. And we hear XR1 Pro is coming soon with an even bigger virtual screen. Hit our link below to get your XR glasses today. There's",
            "start": 2222.16
        },
        {
            "text": "Zero latency at 1080p full HD. These are what make XR1 a musthave. And we hear XR1 Pro is coming soon with an even bigger virtual screen. Hit our link below to get your XR glasses today. There's nothing better than when a sponsor of Kind of funny is something that we are legitimately obsessed with, and that is exactly the case here with XR. You're going to hear me talking about these forever. Go to xreal.com for more. Okay, we're back. Before we get into knockout tour, I do see the stars now. I do see the stars now. The two stars up there. Interesting though. New character. Daisy. It like I'm wondering. What's up, Greg? Don't you [ __ ] dare grab those controls. You make me my goddamn video. Uh, I've collected 100 new coins, which means I got a new vehicle. Um, okay. So, before we go into knockout tour for the very first time, yeah, we've unlocked Daisy. [ __ ] cool. Whatever. Um, let's go back to Shy Guy, we got a new cart. It's the the bitty Boogie. Um, I kind of want to look at the",
            "start": 2272.48
        },
        {
            "text": "knockout tour for the very first time, yeah, we've unlocked Daisy. [ __ ] cool. Whatever. Um, let's go back to Shy Guy, we got a new cart. It's the the bitty Boogie. Um, I kind of want to look at the the bike settings here. Um, yeah, we're going to go back to this basic cart. Um, man, it's getting all the controllers. It's time, isn't it? Yeah, it's a big day. So, oh, I see the two stars there. So, damn, I did so bad on the first Grand Prix that I didn't even get a star. Damn, you hate to see it. God, I'm not used to coin collecting anymore. That's what it is. Cuz I'm so used to So, in 200cc to three star the Grand Prix, you just have to get first in every race. But in 150cc, you have to get first in every uh race. and then also collect the most amount of coins. Uh, all right. I'm gonna have my work cut out for me in this game, which is good. That that groan there was like We're back. We're so back. I'm so tired. But let's go. All right. We're going to try Knockout to for the very",
            "start": 2330.24
        },
        {
            "text": "have my work cut out for me in this game, which is good. That that groan there was like We're back. We're so back. I'm so tired. But let's go. All right. We're going to try Knockout to for the very first time. I kind of want to try a standard bike. I want to see how a bike feels. God, the speed is so bad, though. Let's just Let's do Let's do the piston here. I like that. Yeah. So, it's it's not the typical Grand Prix like uh all stuck into each other. Okay. Oh, this is this is going to be fun. Okay. So, what what have we played? What have we seen already? So, we we've seen these first two tracks, but we haven't seen those like last four tracks. Maybe I'm trying to get something completely new. Let's do this one. I think this second one I don't I don't think I've seen any of these courses. We're going to start this knockout tour. I also need to slack [Music] Andy. All right, here we go. This is going to be a big one. All right, my first time with Knockout Tour. This is the This is the",
            "start": 2385.48
        },
        {
            "text": "We're going to start this knockout tour. I also need to slack [Music] Andy. All right, here we go. This is going to be a big one. All right, my first time with Knockout Tour. This is the This is the chaotic fun that everybody is really enjoying in Mario Kart. His feet are just kind of like they don't they're not even they're just kind of dangling when he's going forward and it's the best. Okay. I like the drift for the bike. Yeah. Speed is uh We need to get some more coins here. God. Yeah. I I I need this game in 200 CC already, I think. Oh, we're going to go big boy mode. [ __ ] yeah. That's awesome. See, now the track feels good. [Music] Oh yeah, that got me a lot of coins. Ooh. Okay, so 20 is the max. Good to know. It's dolphin. That like kind of like short loss of momentum after a jump is kind of weird feeling. Who is that up front? Is that King Buu again? God damn. King Buu kind of goed. I love seeing the dolphin here. That kicks ass. He's just floating on top of his vehicle.",
            "start": 2438.96
        },
        {
            "text": "jump is kind of weird feeling. Who is that up front? Is that King Buu again? God damn. King Buu kind of goed. I love seeing the dolphin here. That kicks ass. He's just floating on top of his vehicle. It's awesome. All right. I I forgot I was doing knockout tour. I was like, \"Wait, what's happening? Oh, [Music] fireballs. We're going down like a Oh, it's called DK Pass. Hell yeah. I love this. And my little Shy Guys. So, here's the [ __ ] up thing. Here's the [ __ ] up thing. Why don't I get more Shy Guy colors? But I see more Shy Guy colors just hanging out in the game. What are we doing here? What are we doing here, Nintendo? I I see a blue shy guy, a red shy guy. If I see like a like a a a black shy guy just hanging out snowboarding, I'm going to be [ __ ] furious. I'm going to be furious. God damn. Boo just knows what's up. H Okay. All right. Oh, we're we're we're finally on the water a little bit. I don't know if I've done that yet. Maybe I have. I love that animation. Lightning's",
            "start": 2547.68
        },
        {
            "text": "God damn. Boo just knows what's up. H Okay. All right. Oh, we're we're we're finally on the water a little bit. I don't know if I've done that yet. Maybe I have. I love that animation. Lightning's still annoying as [ __ ] Okay, so that does get rid of our items. I just finally clocked that. Finally took a moment to understand how that works still. Yeah, we come back so fast from being tiny. All right, it's you and me, King Buu. You might be you might be the enemy of this game. There's always one There's always one character that I go back and forth with throughout the years. Oh, I wanted to make that. It's okay. It's okay. That is like the fun new like added thing of just like the the like amount of options you have in terms of what you want to do to get from point A to point B. And I love that. I love that for us. Where are we going? Where are we going? Holy [ __ ] What the [ __ ] is happening right now? Oh my god. This is so cool. Whoa. We're just go We just fully went off book",
            "start": 2626.28
        },
        {
            "text": "love that. I love that for us. Where are we going? Where are we going? Holy [ __ ] What the [ __ ] is happening right now? Oh my god. This is so cool. Whoa. We're just go We just fully went off book there. Well, it was the game telling us to go off book there, but like still. That was fun. That was [Applause] exhilarating. Oh, I missed that bag. Maybe that was the other Shy Guy bag. God damn it. [Applause] I wonder if I can do the rewind feature in single player mode. I know that's an option here. Hell [Music] yeah. Oh, god damn. Coming out of nowhere. Princess Peach. All right. Thank you for taking that blue shell for me. Whoa. He He made me think he was a ramp, but he wasn't. That was [Music] crazy. Okay, I adore this game already. This game kicks ass. It was a good game, everybody. I know that I was the one uh out of all of the uh trusted uh voices and opinions out there, I was the one y'all were truly waiting for. I know. Still feels a little slow. All right, let's try this uh",
            "start": 2705.6
        },
        {
            "text": "I know that I was the one uh out of all of the uh trusted uh voices and opinions out there, I was the one y'all were truly waiting for. I know. Still feels a little slow. All right, let's try this uh this bag here. [Music] I appreciate the uh the food still gives you a little bit of a speed boost. Like they're primarily for [Music] um costumes, but they they still have some sort of benefit. All right, here we go. Top eight. How far are they behind me? All right, not too bad. [Music] Not great, but not terrible. You know, it's hard to tell on the the the map here like uh how far ahead I am. So, if I just jump up here. No. Huh. I thought I did it earlier. That's probably what the the feather is for. Stuff like that. Also obviously shortcuts and [ __ ] but if you need coins and you happen to have a feather. Oh, ran into that car. Did not like just completely crash. Interesting. Okay, car is acting a little bit differently this time around. I think I like that. [Music] Damn. Top four. All",
            "start": 2801.68
        },
        {
            "text": "have a feather. Oh, ran into that car. Did not like just completely crash. Interesting. Okay, car is acting a little bit differently this time around. I think I like that. [Music] Damn. Top four. All right. I feel another red shell. I feel another red shell, everybody. Okay. All right. No, this is a this is going to be a fun chaotic uh All right, we we know this. We know this map. Oh [ __ ] Oh, totally [ __ ] wiped out on that. All right, that's going to cost me. I need I want to figure out where that one rope go. Like where should I be going after that one rope? Oh no. Mario, get the [ __ ] out of here, sir. Oh, it kind of it it dragged me over to it. It kind of like I it magnetized towards the the rail there, which is nice. Wasn't sure like how like pixel perfect I needed to be for that. All right, here we go. I think this is [Music] it. And that was my first time with Knockout Tour. First, baby. That was fun. It'll be like this one feels a little bit uh playing solo like a little",
            "start": 2881.32
        },
        {
            "text": "All right, here we go. I think this is [Music] it. And that was my first time with Knockout Tour. First, baby. That was fun. It'll be like this one feels a little bit uh playing solo like a little bit long in the tooth. Um this feels definitely intended for for multiplayer here cuz I can see like the the chaotic potential [Music] here. There we go. The boy Wario, the boy [Music] Mario, and the king. My little shy guy. And there we go. That was my first time with Mario Kart World. Played a couple Grand Pris. Oh, we get stars for the Knockout Tours as well. Okay. All right. All right. There's going to be a lot to do. There's going to lot There's going to be a lot for me to conquer here in Mario Kart World, which I am excited about. Um, ladies, gentlemen, and NBS, that has been my first time with Mario Kart World. Uh, I am so beyond excited for the first Mario Kart in over a decade. You know, I've loved Mario Kart 8, but you know, the last couple of years it's felt like, man, I I I",
            "start": 2993.84
        },
        {
            "text": "time with Mario Kart World. Uh, I am so beyond excited for the first Mario Kart in over a decade. You know, I've loved Mario Kart 8, but you know, the last couple of years it's felt like, man, I I I really want something new and fresh, and this is already delivering that uh for me. You know, definitely a lot of learning curves, uh, a lot of things I have to accept, like no 200cc, hopefully one day. Um, no link, hopefully one day. Um, but I'm still really really enjoying this. And again, Mario Kart is at its best. Um, when when you feel like you're driving through a theme park and it's already accomplishing that uh for myself, I am so excited to play with the the rest of the crew here. Uh, so I'm going to end it here and edit this video, get it up, and go join them on stream and then do a games cast and all that stuff. Uh, and so yeah, keep it tuned here. Uh, keep it locked here at Kind of Funny. uh for all of your Nintendo Switch 2 uh coverage, Mario Kart World coverage. Uh I think",
            "start": 3062.0
        },
        {
            "text": "a games cast and all that stuff. Uh, and so yeah, keep it tuned here. Uh, keep it locked here at Kind of Funny. uh for all of your Nintendo Switch 2 uh coverage, Mario Kart World coverage. Uh I think we're going to do like our kind of first impressions on today's Games Cast of the Switch 2 overall. Uh I think we're going to do more of a week uh uh kind of a review after our first week. Uh next week, uh stuff like that. And then also it's SGF. So if if you just happen to click on this video and aren't aware, um we are covering Summer GameFest. So, uh, Friday, uh, tomorrow, we will be live reacting to, uh, Jeff Keelley's Summer GameFest Showcase, uh, reviewing it afterwards as well. We'll be probably playing some Mario Kart, uh, before and after that as well. And then we'll be back here Sunday, uh, for the Xbox Game Showcase uh, for 2025 with the Outer Worlds 2 event afterwards, which we'll be live reacting to and reviewing that as well. And then in between all that, I'll be probably",
            "start": 3113.68
        },
        {
            "text": "uh, for the Xbox Game Showcase uh, for 2025 with the Outer Worlds 2 event afterwards, which we'll be live reacting to and reviewing that as well. And then in between all that, I'll be probably just playing a [ __ ] ton of Mario Kart World, maybe a little bit of Delta Rune as well. But God, there's just there's so much to to unpack here with Mario Kart World that maybe other games take a a step to the side for a little bit. Anyways, I've been Barrett Courtney. Thank you so much for watching this. It has been my pleasure to serve you. [Music]",
            "start": 3160.8
        }
    ]
}