{
    "id": 14246,
    "video_id": "AtHb74GHn_g",
    "show_name": "Shorts",
    "hosts": [
        "Greg Miller",
        "Blessing Adeoye Jr.",
        "Jerica Hannah"
    ],
    "title": "Death Stranding 2: On the Beach Quick Review",
    "description": "The Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1750710303,
    "duration": 87,
    "transcript_chunks": [
        {
            "text": "give me your top level synopsis and score for Death Training 2 on the Beach. I love this cast so much. And I think narratively, the themes that they're tackling, the tone that they have, like I think it's really unique. I think it's really interesting and I think it's really special. Gameplaywise, it's more Destiny, but in all the best ways where they have figured out how to make this the best truck simulator meets thirdp person action game in the weirdest world possible that they could have made. And I with it so heavy. If I'm going to give this a score out of 10, I'm going to say it's a 9.5. the the fixing of the pacing, the introduction of the narrative, and how they sort of set you up for success based on that next mission is really well done, and it's way easier to follow. I think this is going to be more of a hit with more people now. What's your score? 9.5. Damn, you're right there with bless. I love it. I want to get back to it so bad. I'm ready to do it. plenty of criticisms",
            "start": 0.16
        },
        {
            "text": "is going to be more of a hit with more people now. What's your score? 9.5. Damn, you're right there with bless. I love it. I want to get back to it so bad. I'm ready to do it. plenty of criticisms on it, but I found myself even in the car talking about it. I would make the criticism and then go back to like what the mission statement of the game is like what what is he trying to say? What is he trying to do here? So, for the things that bump up against me here and, you know, 40 plus hours of it, like it's a great game. I think it's a great great game. I'll be interested to see when I finally roll credits and obviously go back and plow through some more side stuff what I'm going to feel like. I'd be leaning towards 8.5, but I'm also hot on the ending as I build to the ending. So, I'm interested to see if the ending actually pays off and",
            "start": 44.4
        }
    ]
}