{
    "id": 14222,
    "video_id": "CJN8GIsg7wA",
    "show_name": "Highlights",
    "hosts": [
        "Tim Gettys",
        "Blessing Adeoye Jr.",
        "Tamoor Hussain"
    ],
    "title": "Sonic Revolution Game Reveal - Kinda Funny Live Reaction",
    "description": "Sonic Revolutions really took Bless by surprise! \n\nFOLLOW US ON EVERYWHERE!\n---------------------------------------------------  \nYouTube: Youtube.com/KindaFunnyGames\nTwitch: https://www.twitch.tv/kindafunnygames\nPatreon: https://www.patreon.com/kindafunny/\nTwitter: https://twitter.com/KindaFunnyVids\nInstagram: https://www.instagram.com/kindafunnyvids/\nTikTok:  https://www.tiktok.com/@kindafunnygames?lang=en",
    "published_at": 1749222031,
    "duration": 541,
    "transcript_chunks": [
        {
            "text": "[Music] What's up and welcome back to another kind of funny Games cast live reaction. Uh it's summer gamefest season. We are having a ton of uh live reactions and breakdowns. Whether it's summer gamefest uh the kickoff live or the Xbox showcase or the PlayStation State to play coming up uh as of recording in about an hour. It's also Switch 2 launch day. There's so much happening. Yeah. I don't even know what day this is coming out. I know. Yeah, that's a good point. Like, this is embargoed, so we don't know exactly when it is going to to come out. Um, but what is your your hype levels in general right now? Bless. I'm really excited. I don't know what we're about to see. I just know that it's a new Sonic thing. And so, we're about to watch the trailer. I Yeah, I'm very excited cuz I I guess for me, the thing that blows me away is that I didn't expect a Sonic thing. I thought for this year it was just going to be Sonic Cross World. Yeah, crossroads. Cross worlds. World roads. Um, so I'm",
            "start": 0.84
        },
        {
            "text": "for me, the thing that blows me away is that I didn't expect a Sonic thing. I thought for this year it was just going to be Sonic Cross World. Yeah, crossroads. Cross worlds. World roads. Um, so I'm surpris I didn't think we would get like any new major Sonic thing until like maybe next year. I thought maybe if we did it would be Sonic Heroes or something like a Sonic Heroes remaster. Yeah. I mean, what would get you the most excited for Sonic? What is this? Revolution. Uh, I don't that's the thing is I don't know. Like going into it blind, I would say I really liked Frontiers. Mhm. But if if this is going to be more Frontiers, I would have expected it to just be called Frontiers 2. Mhm. On the other hand, I like I mean we everybody loves Mania. We all love Mania, man. And so if you told me that Sonic uh Revolution is going to be like a 2D like a return to 2D Sonic, right? Like and give me like the pixel art even though I like the last Sonic Superstars game that we got, but like I",
            "start": 49.92
        },
        {
            "text": "me that Sonic uh Revolution is going to be like a 2D like a return to 2D Sonic, right? Like and give me like the pixel art even though I like the last Sonic Superstars game that we got, but like I want that classic pixel art look and feel. I'd be excited for that, but I don't get that vibe from this title. Yeah, Sonic Revolution. Yeah, it's a very it it feels more AAA, I would say, than like a mania. But I mean, hey, I mean, is this the Adventure 3 that we've all been waiting for? I mean, real talk, Sonic Revolution does sound like a adventure style game. Yes. All right. Well, are you ready to watch this trailer? I'm so ready. All right, let's get into it. First, there was a hedgehog. Already, I'm hyped. Roger. I think it's Roger Spin. There was Spinball. It is Ro. Eventually, we went to Saturn. There was an adventure. Before we got to Mania and explored new frontiers, but now it's time for a revolution. Notice how they mentioned all of the major reolution. Jesus [ __ ] next. Jesus",
            "start": 93.28
        },
        {
            "text": "Saturn. There was an adventure. Before we got to Mania and explored new frontiers, but now it's time for a revolution. Notice how they mentioned all of the major reolution. Jesus [ __ ] next. Jesus [ __ ] [ __ ] I [ __ ] know. Blessing, blessing, blessing you for I played you. You know, blessing, I'd like to share a revelation that I've had during my time in the games industry. It came to me when I tried to classify your species, Sonic fans. I realized that you're not actually mammals. Every mammal on this planet instinctively develops a natural equilibrium with the surrounding environment. But you, you Sonic fans, do not. You move into an area and you multiply and multiply until every natural resource is consumed. Is this how you feel? The only way to survive is to spread to another area. There's another organism on this planet that follows the same pattern. Blessing. Do you know what it is? A virus. Sonic fans are a disease, a cancer on this planet. You are a plague. And we I hate",
            "start": 140.48
        },
        {
            "text": "There's another organism on this planet that follows the same pattern. Blessing. Do you know what it is? A virus. Sonic fans are a disease, a cancer on this planet. You are a plague. And we I hate my life so much. The real gamers are the cure. What the [ __ ] Where is he? Is he here? All right. Well, now this makes sense again. I love it. It's back to making sense again. that can now explain explain more of what happened here. Okay. So, is this confirmed that it's not real whatsoever? It's not real at all. So, at the Wise A preview event, right, me and Andy are hanging out. We're we're hanging out with Tam and a group of people. Tam starts telling uh Andy about this game called Sonic Revolution. He's like, \"Yo, you hear the rumors? You see the rumors about Sonic Revolution?\" And he's like, \"Yeah, it's going to be this big crossover game, yada yada.\" And I'm looking at I'm like looking at T. I'm like, \"You're [ __ ] with me. There's no I've not heard a peep about this. This isn't real.",
            "start": 208.64
        },
        {
            "text": "\"Yeah, it's going to be this big crossover game, yada yada.\" And I'm looking at I'm like looking at T. I'm like, \"You're [ __ ] with me. There's no I've not heard a peep about this. This isn't real. And Tam's like, \"Oh, I'm surprised.\" Yeah, you haven't heard of it. It's like is, you know, Sonic. He's making crossovers with other Sega IP or whatever and doing all this stuff like, and I'm like, \"No, like this.\" And he's he go he doubles down on it so strongly that and that I was like, \"Oh, all right. That's crazy.\" And then he's at the last second he's like, \"No, I'm [ __ ] with you, dude. That's not real.\" I was like, \"I [ __ ] knew it.\" All right. All right. The next day, I get a message on Slack from Greg Miller where he says, it was something along the lines of, \"Do you want the Sonic Revolution remote appointment for Summer GameFest?\" And you go, \"Yeah, sign me up.\" And he gives you the thumbs up. Yes. And like it's funny cuz I get that message as I'm still hanging out with Tim",
            "start": 266.32
        },
        {
            "text": "Revolution remote appointment for Summer GameFest?\" And you go, \"Yeah, sign me up.\" And he gives you the thumbs up. Yes. And like it's funny cuz I get that message as I'm still hanging out with Tim and I look at Tim and I'm like, \"Did you hit up Greg?\" Like something. Are you [ __ ] with me still? Wednesday, May 14th, at 11:05 a.m., Tam texts Greg Miller, can you do me a favor and send Blessing a message asking if he wants to do the Sonic Revolution remote appointment for Summer Gamefest? And Greg goes, \"When is it? Why don't I just book it for him?\" And Tam goes, \"Firstly, it doesn't exist.\" Greg goes, \"Why are you asking us about it? Lol.\" And he goes, \"I'm just [ __ ] with him. Lol. I told him about it and then told him it's fake and then told him I was joking. It's real.\" So, he's very confused. Greg says, \"Weirdo.\" I love it. I And Tam says, \"I told him it's got campaigns for all the characters and one of the levels is Jetset Radio.\" He's all over the place. I can't believe I've",
            "start": 304.64
        },
        {
            "text": "confused. Greg says, \"Weirdo.\" I love it. I And Tam says, \"I told him it's got campaigns for all the characters and one of the levels is Jetset Radio.\" He's all over the place. I can't believe I've been got this [ __ ] hard. This is the hardest I've ever been got maybe in my life. Yeah. And I want to let you know, Bless, I want you to know that there is a Slack thread that might be the most insane thing I've ever been a part of. It was like, it felt like 1000 p.m. a couple nights ago. Uhhuh. And it was pretty much the entire company except you obviously. That's amazing. And um it escalates so quickly of you know people putting out ideas and stuff. Greg wrote that script. Yeah. And it was so perfectly off where it's like why would they name the games this way? And he was like, \"Do you have any notes?\" I'm like, \"No, you got to leave it exactly as it is.\" He then reached out to Roger Craig Smith, the voice of Sonic the Hedgehog, and he recorded the lines. Bless. That's [ __ ] insane.",
            "start": 346.32
        },
        {
            "text": "any notes?\" I'm like, \"No, you got to leave it exactly as it is.\" He then reached out to Roger Craig Smith, the voice of Sonic the Hedgehog, and he recorded the lines. Bless. That's [ __ ] insane. And Roger's entire workday while you were on content all day was making this fake trailer. You people are [ __ ] insane. We decided to actively do this during the week of SGF at Twitch 2 launch week cuz I want you to know like even after I knew this was this I was like I was like did TM do a perfect Roger Craig Smith impression? I need you to know I was like I'm still to this point rattled by this a Tamolution. I can confirm this was a 9:30 p.m. Slack Tim where this all started two days ago. And I assume this started up again because I looked at Andy, I was like, \"No, it's real.\" And that that is my favorite part is Yeah. on uh on our Summer GameFest predictions episode, we we're you know, making our predictions and as always, we always say if we know something, we don't say it. Yeah. And",
            "start": 393.2
        },
        {
            "text": "is my favorite part is Yeah. on uh on our Summer GameFest predictions episode, we we're you know, making our predictions and as always, we always say if we know something, we don't say it. Yeah. And you know, that's normally Greg. Normally Greg is the one that has all the secrets, whether it's booking stuff or just people he's talking to. I have never seen your cocky ass come out like that. You're you're normally pretty humble and cool and chill about stuff. You're on the show like I know everything. I know everything. And we're sitting there like we don't know [ __ ] First of all, first of all, I still do know a lot of [ __ ] Just not the Sonic [ __ ] Notice how I didn't predict a Sonic. Remember you're at the Lies of Pee event when this is happening. Tam is texting Greg about this while Tam is at the Lies of P event. Greg tells us in the weekly meeting that week that like, hey, we're on the books of [ __ ] with Blessing. And so like three weeks go by and all of this has left our",
            "start": 440.64
        },
        {
            "text": "Tam is at the Lies of P event. Greg tells us in the weekly meeting that week that like, hey, we're on the books of [ __ ] with Blessing. And so like three weeks go by and all of this has left our minds. So when you and Andy bring it up, Andy also thinking that this was real until yesterday. Uh I had to run out of the room while y'all were uh doing the Games cast predictions and go to Roger and Joey be like, \"Hey, remember we we were supposed to [ __ ] with Blessing? Uh we might need to start game planning that now.\" That's insane. And here we are. The fact that I stopped Andy from saying it. Yep. God damn. Amazing. God damn it. It's art. Everybody, let us know in the comments below uh what you think about Sonic Revolution. Are you hyped? I [ __ ] hate you all, but it makes so much sense that it's not real now. I cuz it never made sense. It never made [ __ ] sense. And I was like, why would they release two Sonic games in the same fall? Jesus Christ. Stay tuned for all of our real",
            "start": 478.88
        },
        {
            "text": "that it's not real now. I cuz it never made sense. It never made [ __ ] sense. And I was like, why would they release two Sonic games in the same fall? Jesus Christ. Stay tuned for all of our real Summer Game best coverage. Until next time, I'm so sorry. Bless. I'm so sorry. This makes so much [ __ ] sense. Awesome.",
            "start": 520.24
        }
    ]
}