{
    "id": 14251,
    "video_id": "Cq6nLMjEQ6s",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Greg Miller",
        "Blessing Adeoye Jr.",
        "Cole"
    ],
    "title": "Metroid Prime 4 is… Out Now?? - Kinda Funny Games Daily 06.20.25",
    "description": "Go to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\n\nA big ad for Metroid Prime 4 says it’s out now, a new game could be the next Uncharted, and the future of Rematch could look very bright.\n\nToday after, KFGD, you’ll get:\nBarrett’s video on replaying every Naughty Dog game https://www.youtube.com/watch?v=olgVvZLQR6A\nToday at 1:30pm after Barrett’s Naughty Dog video essay, we’ll be teaming up to compete against some of your favs in the video game space in an epic 24 person race to raise money for Point of Pride!\nIf you’re a Kinda Funny Member:\nGregway today 59 minutes of Mike and Roger reacting to all of the Death Stranding 2 trailers to get ready for the June 27th Walkathon!\nThank you to our Patreon Producers: Karl Jacobs, OmegaBuster, & Delaney Twining\n\n00:00:00 - Start\n00:11:00 - Housekeeping\nThe Roper Report   -\n00:14:05 - Metroid Prime 4 ad on London Underground claims the game is ‘out now’ - Jordan Middler @ VGC\n00:31:13 - NetEase's Surprise Reveal Of New AAA Wuxia Game Blood Message Has Fans Comparing It To Uncharted And Tomb Raider - Vikki Blake @ IGN\n00:45:20 - Two big sales numbers stories\n00:47:20 - Thanks To Borderlands 4 Fans, This Handy Feature Has Been Added To The Game - Darryn Bothuys @ Gamespot\n00:49:25 - Fortnite Has a Hit New Mode — and for Once, the Game's Main Battle Royale Option Is No Longer the Most Popular - Tom Philips @ IGN\n00:53:45 - Wee News!\n00:56:00 - SuperChats & You‘re Wrong\n\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1750443009,
    "duration": 3610,
    "transcript_chunks": [
        {
            "text": "[Music] Today in the nerdy news you need to know about a big ad for Metroid Prime 4 says it's out now and it's not. A new game could be the next Uncharted and the future of rematch could look very bright. We'll have all this and more because this is kind of funny games daily. [Music] What's up everybody? Welcome to Kind of Funny Games Daily for Friday, June 20th, 2025. I'm one of your hosts, Greg Miller, alongside Forbes 30 under 30, aka New York Game Awards nominated aka Gas Lighter Blessing Eddie OJ. First of all, you sound crazy saying that. You must be out of your mind calling me a gas lighter. I can never. Uh, but also, yes, I brought up the song cuz I just I literally just saw your Instagram story doing like the Batman meme of like, you know, Alfred put on this gas lighter song by the chicks. So, I just wanted I wanted to get the vibe of like what is this song? Like, let's go on a walk, everybody. It's me, Greg Miller. Of course, I'm holding Cole the wiener dog. As you know, we I",
            "start": 0.15
        },
        {
            "text": "chicks. So, I just wanted I wanted to get the vibe of like what is this song? Like, let's go on a walk, everybody. It's me, Greg Miller. Of course, I'm holding Cole the wiener dog. As you know, we I we're you know, Cole has been coming to the office more and more because Jen has been getting more and more family emergencies and you got to take care of this anxietyridden dog, right? But he hasn't acquiesced to just being a hey, I'll sit in your lap and do he he'll sit in my lap, but the problem is the new studio doesn't have a great lap sitting situation for a dog. You know, the old tables, the old studio, great for portillo, but this one with the bars and stuff, like it just doesn't work for me giving him a good perch. So then I'm constantly trying to get to, hey Cole, sit in the middle of the table. Except we don't have a dog bed here, which I should buy and bring in because this is happening more and more. And that would even then I bring in these blankets. He doesn't want to just",
            "start": 66.8
        },
        {
            "text": "of the table. Except we don't have a dog bed here, which I should buy and bring in because this is happening more and more. And that would even then I bring in these blankets. He doesn't want to just sit in a blanket. So then he's just I'm holding him here like like you know cuz he's like he's crawling out of the blanket. Wouldn't we not just do the same thing with the dog bed? Celeste, we got to break this dog down and build him up just like the Marines do to people. Mhm. You know what I mean? Basic training and stuff. Is the dog bed going to break him down? I mean, we got we got to walk him through this process. We got We just got to train him to be like, \"Okay, hold on. Look, this is comfy.\" Cuz does the dog bed come with like walls? Is it like a dog little dog prison putting him in a kennel on the stage? No. Oh, yeah. Cuz he looks around and he's like, I want to escape, but I see that thing. Well, he hates the studio. Like he he the office in general, not a fan of. Always trying",
            "start": 107.76
        },
        {
            "text": "kennel on the stage? No. Oh, yeah. Cuz he looks around and he's like, I want to escape, but I see that thing. Well, he hates the studio. Like he he the office in general, not a fan of. Always trying to get me out of it. But the studio in particular is and so if you didn't know, Cole's on many shows except he's right there in that bag on the floor. Nobody sees cuz if I leave him out there he cries for me but in here he he can't sit with me. We're figuring out as we go. So yes, blessing gas lighter as you know. I like the country music. Mhm. I had for a long time. The Dixie Chicks now the chicks. They dropped it in 20. They dropped Dixie in 2020 when everybody's like, \"Hey, maybe we should rethink everything.\" And they were like, \"You know what? Yes, we're progressive. We'll do that.\" And then I'm sure the world will keep up with us and not totally voted all the way back in five years. No, it doesn't matter. Wow, I just looked up Dixie. I'm learning a lot right now. Yeah, a lot of",
            "start": 144.8
        },
        {
            "text": "And then I'm sure the world will keep up with us and not totally voted all the way back in five years. No, it doesn't matter. Wow, I just looked up Dixie. I'm learning a lot right now. Yeah, a lot of people trying to A lot of people try to get out of that. Same thing with Lady Antabbellum. They just went to Lady A. But then it turned out that there was a a vocalist who was also black named Lady A who never copyrighted her name. So Lady Antabellum got out of one controversy right into another. That's amazing. It was what I feared when the worst possible situation. It's the exact thing I feared when you were like, \"Oh, I'm doing the Greg Miller parade in June.\" And then like the scheduling got close to Pride and then you're like well let me dodge Pride and I thought you were going to go right into Junth for a second. I thought you were going to hit the exact same errand. Thank God. Just you're like I'm feeling things Greg can't throw a parade on. Yeah. You're like you know what Pokémon",
            "start": 185.2
        },
        {
            "text": "into Junth for a second. I thought you were going to hit the exact same errand. Thank God. Just you're like I'm feeling things Greg can't throw a parade on. Yeah. You're like you know what Pokémon Go Day is the one that we can take away. Remember a week from tomorrow it's the 28th. Yeah. The 28th we're doing a parade San Francisco, California. The details are as follows. 10:00 a.m. in front of the ferry building. Meet us there. We will walk the sidewalks to Square Pie, guys. We're doing basically a parade 10 to 12. It's not the par. We'll start at the Embaradera. We'll start in front the front of the ferry ferry building at 10:00 a.m. We will then walk with our signs mocking Tim and celebrating me to Square Pie Guys and then just party in front of Square Pie guys till 12. I'm excited for that. Uh Dixie Chicks though slash the chicks. Yes, I they are from a country music era that I wasn't that involved in, but I always appreciated the chicks cuz remember they were the ones who were",
            "start": 226.72
        },
        {
            "text": "that. Uh Dixie Chicks though slash the chicks. Yes, I they are from a country music era that I wasn't that involved in, but I always appreciated the chicks cuz remember they were the ones who were like he's not our president about George W. Bush and the war in Iraq and then like the entire country music industry turned on them and D and so like I'd watched their documentary back in the day or stuff but like music I never would. So then yesterday on or two days ago on discover weekly on Spotify they're like you like this gas lighter song I was like I you know I'm like I would and then I was like wait this is the chicks okay wait and they is the one singing and wait wasn't she married to the guy from Heroes and brother she was and then they got divorced she wrote a whole [ __ ] album burning this guy down and I went down the Wikipedia rabbit hole where like when they were getting divorced this guy tried to pull out that like I also like in whatever court document it was this is on",
            "start": 267.84
        },
        {
            "text": "this guy down and I went down the Wikipedia rabbit hole where like when they were getting divorced this guy tried to pull out that like I also like in whatever court document it was this is on Wikipedia he's like I need access to all of her unreleased music to make sure there's no secrets about me in it. And I love it. She was like, \"Fuck you.\" And wrote an entire album burning them down for cheating. Damn him. I mean, don't cross an artist. That's why That's why I was like, I got to know more about the chicks, Alfred. And that's when that's amazing cuz I, you know, I was that thing I thought about I originally the tweet was almost going to be Kevin, pull up everything you can of the chicks. I need to know. But then them changing their name also I feel gets in the way of the joke. Good chicks. Who are the chicks? Yeah, that's why that's why I open people. If I knew it was the Dixie Chicks, I would have been like, \"Okay, that makes sense. Greg is making a weird Batman reference to the",
            "start": 305.12
        },
        {
            "text": "Who are the chicks? Yeah, that's why that's why I open people. If I knew it was the Dixie Chicks, I would have been like, \"Okay, that makes sense. Greg is making a weird Batman reference to the Dixie Chicks.\" But yeah, I I did have the moment where I was like, \"Well, now I got to check out this Gas Light song cuz I thought you were putting me onto a new artist.\" Oh, no. It's an old artist. Yeah. And this is an old album. I think this is like also 2020. Yeah, it says that on the thing. Yeah. And that that but that also raises so many questions for me as an outsider who's looked in before on the on the chicks. It's hard to stop saying. Yeah, dude. I know. is at least it's not like a slur and people know we're trying but it's like I've looked in on and then me saying I looked in on the chicks doesn't sound right either. Whatever. Uh you you did some research and I was just like well wait this is like how many albums have they made? Like they haven't made as many as I thought through. I",
            "start": 342.72
        },
        {
            "text": "doesn't sound right either. Whatever. Uh you you did some research and I was just like well wait this is like how many albums have they made? Like they haven't made as many as I thought through. I thought they'd be very prolific. Really? They haven't. So there's like I got to I I got to drill in more and that's why I need Alfred/K to find everything he can of They have like a big gap in their resume. Like they stopped making music. I think this is pretty recent. I mean for them 2020. How many albums they put out since 2020? I mean, oh, I mean, I'm looking at it now, right? 2020 was Gas Lighter. They've not released a new album since then, but before that was a 2018 looks like a live album. And then before that, 2006 was taken the long way. And so, yeah, that you're talking about a 14-year gap between albums there, which I love when that happens. I was talking yesterday to Tim about Slick Rick, the opposite of the Dixie Chicks, or sorry, the Chicks. The Chicks. Um, the opposite of",
            "start": 376.0
        },
        {
            "text": "gap between albums there, which I love when that happens. I was talking yesterday to Tim about Slick Rick, the opposite of the Dixie Chicks, or sorry, the Chicks. The Chicks. Um, the opposite of he'll just be Rick. Honestly, I could see it. He just called goes by Ricky now. Um, but it was the same thing where he hasn't released an album in 20 years and like hasn't missed a step. Been listening to the Slick Rick music. Oh my god. Greg, you might like a Slick Rick. Okay. Have you Are you familiar with SL? I'm not. I mean, I'm sure. Give me one. Give me the most popular mainstream thing he's done. Oh my god. Cuz if you gave me that, I could probably help you. I don't know what the most popular Slick Rick song. Oh, the Children's Story is the one I know, but I feel like he's like I think you have to know hiphop to some extent to know Slick Rick. It's not like the chicks where I I don't think I've ever like listened to a a chicks song, but you know of them. But I know I know I've heard of",
            "start": 409.68
        },
        {
            "text": "have to know hiphop to some extent to know Slick Rick. It's not like the chicks where I I don't think I've ever like listened to a a chicks song, but you know of them. But I know I know I've heard of the Dixie Chicks. Like I've heard that name before. Yeah. Champagne, Illinois. They were talking about the Dixie Chicks. They probably were. Yeah. Just like they're always talking about Ario Speedwagon, right? But like that's not even joking. I think they're from Champagne. You couldn't have nailed a more Midwest. We're at a tailgate. We're playing some Mario Speed Wagon. Yes, we're still talking about Mario Speed Wagon. Um, but yeah, Slick Rick I think was one of those ones where it's like you have to you have to at least be through that first saying la d. Yeah, that was like a that was his that was the thing he would always repeat. We would always rhyme with that. Okay. If you heard the voice, you might recognize I'm opening my own Spotify here to figure out what's going on this when",
            "start": 446.24
        },
        {
            "text": "that was the thing he would always repeat. We would always rhyme with that. Okay. If you heard the voice, you might recognize I'm opening my own Spotify here to figure out what's going on this when you say it makes me think of Miley Cyrus. We like dancing with Miley doing whatever we want. Maybe she was influenced by Slip. She probably was. Yeah. But yeah, I I I think honestly, not even a bit, I think you might like some Slick Rick's like classic content because he was a storytelling rapper. All right, we got it turned on. Oh, that's this is how we do it. This is children's story. And here's Aida. Maybe he sampled it or the other way around. I'm sure audio listeners can't hear it, but Oh, okay. Okay. Okay. That part got me. Yeah. Okay. I'm I'm adding Slick Rick. I I'll listen to some tonight and get back to you. Awesome. You know what? I'll listen to some some of the chicks. Do the Gas Lighter album and like it's the first two tracks flow really well of Gas Lighter and then of course",
            "start": 485.12
        },
        {
            "text": "and get back to you. Awesome. You know what? I'll listen to some some of the chicks. Do the Gas Lighter album and like it's the first two tracks flow really well of Gas Lighter and then of course just the fall. I think it's Liar Li or whatever afterwards. Again, it's if you just want a vicious takedown of her ex-husband from Heroes, go for it. Let's go. Cool. I'm sure this man's acting and other things. I don't know. And I don't know any of these people from Adam, but I'm on the chick side because this music's [ __ ] dope. Oh yeah. Everybody, we're gonna stop talking about music. We're going to start talking about games because this is kind of funny games daily. Each and every weekday on a variety of platforms, we run you through the nerdy video game news you need to know about live on twitch.tv/confunnyames, youtube.com/kindfunnygame, and of course Spotify and Apple and podcast services around the globe. Uh if you like what we do, we'd love you to pick up a kind of funny membership.",
            "start": 535.04
        },
        {
            "text": "youtube.com/kindfunnygame, and of course Spotify and Apple and podcast services around the globe. Uh if you like what we do, we'd love you to pick up a kind of funny membership. Your $10 a month supports us, an 11person small business all about making live talk shows, hanging out with friends, and doing cool [ __ ] in an amazing studio. Of course, for $10, you get all of our shows ad free. That's more than 80 a month. And you get your daily dose of me, Greg Miller, in a series we call Gregway, where I podcast from my car, but it's also a video and everybody has a great time. Plus, you get good karma for supporting us. So, thank you for that. Of course, no saucer way. Like I said, like, subscribe, share, twitch, YouTube, everywhere you get the podcast. Leave a review, leave a comment. It's all over the place. We look at it. We love it. But if you want to go that extra mile and you're watching live, youtube.com/kindfunnygames, your super chats so you can be part of the show as we go",
            "start": 574.48
        },
        {
            "text": "all over the place. We look at it. We love it. But if you want to go that extra mile and you're watching live, youtube.com/kindfunnygames, your super chats so you can be part of the show as we go just like our Turotron robo bartender did who said, \"Walking into a call back interview for an important job opportunity. Wish me luck. I need ones in the chat. We're sending good vibes to Arturotron Robo Bartender.\" Good luck. I'm seeing if anybody's talking. Okay, I was I was Jordan White's not talking about Slick Rick or the Chicks, but Shay Lelay is and says, \"My college roommate played this one Dixie song on repeat daily. Not as bad as him spending an hour on the phone reporting his daily activities to his parents. Was it gas lighter that he played on repeat?\" Cuz I like that song. I don't know if I could take it, you know, on repeat forever. But I I'm I'm a weirdo. Your roommates's walls just every single day. I had a moment this morning where like usually I like to like listen to music",
            "start": 616.4
        },
        {
            "text": "if I could take it, you know, on repeat forever. But I I'm I'm a weirdo. Your roommates's walls just every single day. I had a moment this morning where like usually I like to like listen to music and shut up. Well, it's the thing where I play music on my phone through the shower and I don't think it's that loud, but then like I went to the bathroom, put on the music and then realized I forgot my towel in my room. So, I like I leave it on and then I leave to go get my towel and then I hear the music through the door and I was like, \"It's that loud every morning.\" Like, damn. I'm putting Michael through it. But I got a good music taste, so I'm sure he likes it. He probably does like it. Yeah. He's like, \"Oh, that's sick boy.\" He's always like, \"Oh, that's what's up.\" Yeah, he says that a lot. He does say that a lot. Uh, we say a lot of things here on kind of funny cuz we're a live talk show network after kind of funny games daily. It's a very, very, very special day. Barrett's video",
            "start": 658.8
        },
        {
            "text": "lot. He does say that a lot. Uh, we say a lot of things here on kind of funny cuz we're a live talk show network after kind of funny games daily. It's a very, very, very special day. Barrett's video essay about replaying every naughty dog game is going live as your kind of funny games cast. It is a live premiere, I believe, set for 11:05 today. So, we're in we're in a we'll keep this games daily snappy for you. All right. We're already doing it. We're already doing it. Who? We needed to tell you about the chicks and this drama from 2020. you need to know. This is the news you need to know about. Uh it's a big deal though. Barrett of course worked so hard today. Today at I'm sorry. So he's doing that. Then at 1:30 after Barrett's Naughty Dog video essay will be teaming up to compete against some of your favorite video game personalities in the one, the only Mario Kart World. An epic 24 person race to raise money for Point of Pride. This is of course Alana Pierce's uh video game",
            "start": 695.12
        },
        {
            "text": "against some of your favorite video game personalities in the one, the only Mario Kart World. An epic 24 person race to raise money for Point of Pride. This is of course Alana Pierce's uh video game industry Mario Kart World tournament. We're very excited to participate. Blessing. Are we going to win? Oh, we're for sure going to win. We got a squad. Yep. Yep. Yep. Uh if you're a kind of funny member, your today's Greg Way is actually 59 minutes of Mike and Roger reacting to all the Death Stranding 2 trailers to get ready for their June 27th walk-athon. Of course, they've been trying to stay radio silent because they are Death Stranding nuts and are getting ready to walk once again while they play through all of Death Stranding 2. So, a great special Gregway from Mike and Roger. Yesterday you got a special Roger Gregway explaining how the Caroline Pich interview came to pass. Of course, an amazing Games cast interview I hope you check out. But behind the scenes over there with him, I",
            "start": 736.8
        },
        {
            "text": "you got a special Roger Gregway explaining how the Caroline Pich interview came to pass. Of course, an amazing Games cast interview I hope you check out. But behind the scenes over there with him, I also did one because I've been short on my 15 to 20 minutes lately. So, I patted in there. But then also the day before that, Blessing Addio Junior had a Greg way that was awesome about Pride. I really really like that one yesterday when I got to listen to it. Thank you. I appreciate it. No problem. It was cool. It's It's interesting to listen to that and be like, \"Oh man, me and Bless never talk.\" And I I mean there's part of that of like you know the job and whatever and the roles but to hear you just open up and podcast all by yourself like damn I really like that. Thank you. I appreciate it. It's also the thing where I'm never on kind of funny podcast also. So like I only really talk about video games. I put you on the podcast. You you had a stretch where you're on the podcast. Okay.",
            "start": 780.0
        },
        {
            "text": "it. It's also the thing where I'm never on kind of funny podcast also. So like I only really talk about video games. I put you on the podcast. You you had a stretch where you're on the podcast. Okay. You're on two weeks from now because I think next week's booked with a guest. But you're on two weeks. I think two weeks from now I'm out. Oh no. That's the That's the short week, isn't it? Oh shucks. I don't know how that works. I don't know. We'll figure it out. We we have a schedule. We'll look at we'll get you on there. Uh today, of course, we're brought to you by our Patreon producers Carl Jacobs, Omega Buster, and Delaney Twining. But we're also brought to you by Shady Rays, but we'll tell you about that later. For now, let's begin the show with what is and forever will be the Roper Report. Time for some news. Seven items on the Roper Report. [Music] Baker's dozen. Number one on the roper report. We've known for a long time. England is a backwards ass country, but now they're",
            "start": 816.0
        },
        {
            "text": "Report. Time for some news. Seven items on the Roper Report. [Music] Baker's dozen. Number one on the roper report. We've known for a long time. England is a backwards ass country, but now they're playing with time. Metroid Metroid Prime 4 ad on the London Underground claims the game is out now. This is from Jordan Midler at VGC. Can we trust his reporting? He's from over that way. You know what I mean? He's playing it right now post. He beat the game. A poster for Metroid Prime 4 Beyond has been spotted in the London Underground, which claims the game is out now. An image of the ad captured by VGC at Oxford Circus Tube Station in London, gives information on Metroid Prime 4 along with an out now message. At the time of writing, Metroid Prime 4 Beyond doesn't have a release date, and the game hasn't been shadow dropped on the Nintendo Switch 2 eShop. VGC has visited the London Underground station in question and can confirm that the poster doesn't see indeed say out now as seen in our",
            "start": 846.08
        },
        {
            "text": "hasn't been shadow dropped on the Nintendo Switch 2 eShop. VGC has visited the London Underground station in question and can confirm that the poster doesn't see indeed say out now as seen in our photo at the top of this article. In an update to this article, a Nintendo spokesperson has told VGC the advert date is quote unquote incorrect and Metroid Prime 4 is not quote unquote out now. Quote, we can confirm that the out now message in this advert is incorrect. Metroid Prime 4 Beyond and Metroid Prime 4 Beyond Nintendo Switch 2 Edition are not yet available and are scheduled for release in 2025. End quote. Of course, I toss in the blue sky. That's a BS. Tim, uh, from Imran the Don Khan, pointing out, of course, that alongside this, there's also a Mario Kart World one that says out now, and he assumes that this is just a layers in Photoshop [ __ ] But people are saying that yeah, like the out now on the Mario Kart World ad is identical to how it looks on the Metroid Prime 4in. And so",
            "start": 906.56
        },
        {
            "text": "he assumes that this is just a layers in Photoshop [ __ ] But people are saying that yeah, like the out now on the Mario Kart World ad is identical to how it looks on the Metroid Prime 4in. And so yeah, Immrron is like saying it was probably just somebody forgot to um mute a layer on Photoshop. Uh and then I think he says that it seems like something's under the out now, right? Proofing. You know what I mean? They're just ready for it to go or whatever. Yeah. Well, yeah. Now you don't have to take this down. Now you just leave this up until fall. Leave it up like that. It's going to be true at some point. What is it? It's like the Lee Summit, Missouri uh GameStop that still has the Halo 3 window wrap on it. There's always I see it through my Reddit every so often. It's been up for 20 whatever years. Um the real question of course then blessing is where the [ __ ] is Metroid Prime and when are we playing it? I mean that's a good question. If we really wanted to dig into it, I would",
            "start": 955.28
        },
        {
            "text": "years. Um the real question of course then blessing is where the [ __ ] is Metroid Prime and when are we playing it? I mean that's a good question. If we really wanted to dig into it, I would open up the calendar and be like, \"All right, N how like what are the first party Nintendo games coming out each month? Which months are empty?\" Well, I got to tell you, you don't have that much coming up. So it gets pretty easy to open it up cuz for this year you have Kirby Air Riders 2 that's going to land somewhere. I we have a date on So yeah, let's let's play this game. Of course, I want to play the game with you. Super chat in with your release date pick for the one, the only Metroid Prime 4 Beyond. Does Pokemon have a release date? I believe it does. Pokemon Z. Well, let's just go in order. All right. Don't Don't try to get all What did you say to me? What the [ __ ] I said go in order for me. I'll [ __ ] fight you right now. Of course, next month, as we know, Donkey Kong Bonanza, July",
            "start": 990.72
        },
        {
            "text": "All right. Don't Don't try to get all What did you say to me? What the [ __ ] I said go in order for me. I'll [ __ ] fight you right now. Of course, next month, as we know, Donkey Kong Bonanza, July 17th. So that right there, you got your next one right in terms of your big one. Uh then of course we get into just a slew of games. I'm going off of games uh informers amazing as always.com/2025. Welcome back game informer. So happy you're here. Uh Pokemon did they find they put one on the last one, right? Yeah. So the Pokemon legend Zah is October 16th. Oh, okay. Cool. What is the game with the wheelchair basketball? Um Dragon Drive. Drag. Does that have a release date? No, I'm just double checking. This is one, you know, obviously where it would be helpful if Tim was here, but he's got to have a life. Drag cross drive is is listed as a TBA. So then you know June uh July we know October. Uhhuh. When you start looking at this. So the games to place like the big games to place would be um",
            "start": 1028.56
        },
        {
            "text": "a life. Drag cross drive is is listed as a TBA. So then you know June uh July we know October. Uhhuh. When you start looking at this. So the games to place like the big games to place would be um Metroid Prime and Kirby. Kirby I think does have one too. No I don't think Kirby has no way Kirby has a release date. Okay. You're you are correct. I apologize. Yeah. Kirby does not. I think Kirby's imminent. You really I would say that's because that's like still the Nintendo Switch one plus content thing. It's like an old game is new. You're saying Kirby and the Forgotten Land. I'm saying Kirby Air Riders the racing game. Got it. I apologize. Which I think is further is further out because we've not seen anything like That's why I was confused. Forgotten Land is August 28th. Gotcha. Gotcha. Gotcha. Gotcha. Um I think with that being the case, I would say Kirby December. That strikes me as like a that strikes me similar as how they did Smash Brothers, right? of like yo like this is the game",
            "start": 1070.8
        },
        {
            "text": "Gotcha. Um I think with that being the case, I would say Kirby December. That strikes me as like a that strikes me similar as how they did Smash Brothers, right? of like yo like this is the game that not as I I don't want to say it's like less priority right because even Smash Brothers is super high priority when you talk about like what it means for the Nintendo first party portfolio but I don't think that's a game that is necessary for that Black Friday push I think that's a game that is very much like you know we think there's an audience for this but this audience will find this game no matter where we land it uh and if they're confident for 2026 which I would or for 2025 which I assume they are I think that makes sense right like I think that out of all the games to put in that time in that time period I think Kirby makes sense. Metroid in that case like it sounds like Yeah, I was going to say it sounds like we don't have anything right now. Currently, you would say September,",
            "start": 1117.68
        },
        {
            "text": "in that time period I think Kirby makes sense. Metroid in that case like it sounds like Yeah, I was going to say it sounds like we don't have anything right now. Currently, you would say September, November, and December are open slots for Nintendo with Donkey Kong being July, Kirby and the Forgotten Lands August, Pokemon in October theoretically. Then you have that other air you have Air Riders, you have Dragon Drive, and then you got Metroid. Yeah. And Dragon Drive I think can drop whatever. I don't think there's like a big I'm sure there's a strategy around that. I'm just putting out the games that we know or whatever is going on. Yeah. But yeah, I Metroid I think is the one that you want to create a moment for and give space to. So I would I want to say September, but I would almost like lean I think November could work for it as well, right? Like my problem with November, and I know it's a quaint thing at this day and age and world the world has moved on, but Black Friday, how",
            "start": 1160.08
        },
        {
            "text": "like lean I think November could work for it as well, right? Like my problem with November, and I know it's a quaint thing at this day and age and world the world has moved on, but Black Friday, how much time do you want before then? Like are you putting on the front of November? I guess that would make sense. You could do that. I'll tell you what, my granted my heart dreaming. Mhm. But my thing to move units and what is going on within Animal Crossing Nintendo Switch 2 edition. Every time I bring it up, Tim says, \"No, this is what should have happened. It's a good thing, Greg. You're going to get a they're going to give you a Nintendo Switch 2 edition with more with a new thing or new what?\" Like, yeah, if that's really happening, is that happening this year? And because I would say if you want to bury the needle like and you want people buying this thing that already loved Animal Crossing, you do that. And if I if I'm Nintendo and I'm doing that, I'm putting that out in November",
            "start": 1200.88
        },
        {
            "text": "you want to bury the needle like and you want people buying this thing that already loved Animal Crossing, you do that. And if I if I'm Nintendo and I'm doing that, I'm putting that out in November when people are going to the stores, those more quote unquote casual fans going to the stores. You want to be able to see a Nintendo Switch 2 uh version of Animal Crossing. I think that's a it's a good point to make, but I can also see Animal Crossing being like a a bomb that you save for 2026 as far as of course. Yeah. You can unleash that whenever you want to. Yeah. Yeah. like that is like an unleash situation, right? That's not a release. That is all right, unleash animal crossing because that's going to do something for it. One thing I want to bring to the equation that I totally forgot about and I knew I was forgetting something in this was Hyrule Warriors. That's also another one that's going to be um I think treated as a big first party drop that you want to be able to give the",
            "start": 1245.36
        },
        {
            "text": "about and I knew I was forgetting something in this was Hyrule Warriors. That's also another one that's going to be um I think treated as a big first party drop that you want to be able to give the space, right? And that that will be the big Zelda for the year. That being the case, like I think I do lean towards September for Metroid, November for Zelda Hyrule Warriors, and then December for Kirby. That would be my I don't hate that. Uh from the chats, cognitive clip says, \"For what it's worth, the art book for the Prime Trilogy got delayed from June to October. Eyes, but I like it tomorrow, please.\" Uh an interesting one here from Kebabs. He I'm sorry. They are saying April 4th, 2026. If I'm right, pay the super chat back for what? For Metroid. Metroid. I love Kabs. I'll tell you straight up if you if you are. Yes, I will. Would someone write that down or clip this for me right now? That's going to spice right now. They are saying April 4th, 2026. Not only will I pay back your $2 New",
            "start": 1281.36
        },
        {
            "text": "up if you if you are. Yes, I will. Would someone write that down or clip this for me right now? That's going to spice right now. They are saying April 4th, 2026. Not only will I pay back your $2 New Zealand super chat, I'll triple it. Oh, they're from New Zealand. Apparently, that's what they're paying him. Maybe they're just, you know, how much is that in American dollars? I mean, by then we'll all be dead of the nuclear fallout. It won't matter. I think it's going to be worth I can either afford the six New Zealand Joey bucks, whatever the [ __ ] they're called, or I'll be dead. I don't have to worry about it. Look at that. Oh, I was not far off. 60 cents on the dollar. I was making a bit. That's crazy. Yeah. 60 cents for the Oh, for one. Okay, that actually makes sense. Um, yeah. No, I think Metro Prime is coming out coming out this year. We've had too much marketing for it. And I think that's one like I think you could I think as a Nintendo you could delay Kirby Air Riders. You",
            "start": 1329.12
        },
        {
            "text": "I think Metro Prime is coming out coming out this year. We've had too much marketing for it. And I think that's one like I think you could I think as a Nintendo you could delay Kirby Air Riders. You could delay like other games like a Dragon Drive I guess, right? But like I think Metroid the the ship is already gone. Like the there's so much in movement. I don't think they would confidently put it put it up front like this if they weren't sure this game was coming out upfront. How though? Just the ad? I mean the ad in general I don't think you'd be doing Oh, not even the ad. I'm talking about Well, I think one the ad, but all the marketing involved, right? I think it being in the in the Nintendo Directs, it being so present this year in the Switch 2 stuff, Metroid Prime is one of those games that because of what it's been in the last, I'll even say decade um from announcing it for Switch One, it disappearing, it's starting over developers, all that stuff. I don't think they want to",
            "start": 1374.0
        },
        {
            "text": "games that because of what it's been in the last, I'll even say decade um from announcing it for Switch One, it disappearing, it's starting over developers, all that stuff. I don't think they want to create another scenario where they have to announce a delay for this game because I think that turns into really bad press for Metroid Prime 4. Here's my counter to it. Not that I think you're wrong. I think and I think the ad if I if I'm Nintendo and there's even a hint of us delaying this to 2026, not even the out now business, 2026. I'm not putting ads up in the tube. I'm not worried about it. London Underground, which is a crazy name for it. They call it tube, too. Yeah. But I mean, I just for when I read London Underground, I think I knew it was called that, but I was like, man, that's a that's a cool name for your subway. You want to I'll tell you right now. Why don't we call it Why don't we call it the BART if we named this thing rapid transit? Yeah, but like we're naming it after",
            "start": 1415.44
        },
        {
            "text": "that's a cool name for your subway. You want to I'll tell you right now. Why don't we call it Why don't we call it the BART if we named this thing rapid transit? Yeah, but like we're naming it after a Don't get me started. I got plenty of problems. The London Underground. What I'd like So that's like news to you. The underground thing, right? It's not news, but I'm just thinking about it deeper now. Like there was once a heated argument at the Miller James house where Lucy James I forget even how we must have been 19 bottles of wine deep on a COVID night of like her talking about how iconic the underground and the logo is. And I'm like no one here knows anything [ __ ] about that. Like the New York subway is the subway people think of. She's like, \"No, they think of the underground.\" I'm like, \"I assure you, no Americans are jumping to So,\" and I know I'm being very I was being very pjorative with my no Americans, but like people aren't thinking of the underground. They're thinking of",
            "start": 1455.76
        },
        {
            "text": "\"I assure you, no Americans are jumping to So,\" and I know I'm being very I was being very pjorative with my no Americans, but like people aren't thinking of the underground. They're thinking of this. And we just argued and argued and argued around about it. Here's the thing is I only know of the London Underground because I love my I love my my UK like dramas. I love watching Luther. I love watching these shows, right? And like they'll mention the London Underground. And I think here's the thing. I think this is like the first time I've heard it in the context of being like, \"Oh, this actually exists.\" You know what I mean? Like I think I re I watch it in my shows and I'm like, \"Damn, the London Underground, that's [ __ ] crazy.\" And then like I go on with my day. This is the first time where I'm like, \"Oh, that's a real place where they're putting real Nintendo ads in.\" Yeah. Yeah. Yeah. And it's such a it's it's such like a like I was going to say upside down from Stranger Things",
            "start": 1493.2
        },
        {
            "text": "where I'm like, \"Oh, that's a real place where they're putting real Nintendo ads in.\" Yeah. Yeah. Yeah. And it's such a it's it's such like a like I was going to say upside down from Stranger Things scenario where like Metroid Prime 4 is out now in the London Underground. You know what I mean? [ __ ] insane over there. Good for them. Uh, all right. So, we're saying Donkey Kong July, obviously. Kirby and Forgotten Lands August. You're saying Metroid Prime 4 in September, which I like. Yeah. But then I think what So, I like that. And what I think's interesting about it is if I was going to have it in September, I would really I'd probably kick off that announcement next month, right? Like, so I mean, you figure get Donkey Kong out of the way and then start talking about that coming. Yeah. And so that would make sense why they're getting ads up, even though I don't think the date would have been there, but you get ads up. So people are stoked about that. And you're all right. Then",
            "start": 1530.08
        },
        {
            "text": "And so that would make sense why they're getting ads up, even though I don't think the date would have been there, but you get ads up. So people are stoked about that. And you're all right. Then October is Pokemon. Uh November, you were putting Hyrule, you said. Yeah. And then December is Air Riders. Yeah. Dragon Drive somewhere in the mix. Dragon Drive. Yeah. Anywhere. Dragon Drive could be tomorrow. Either tomorrow or December 31st. I don't hate that. Somewhere between that. Uh Logan Fel says, \"November release date for Metroid Prime 4. Period.\" But then goes further and goes maybe the Game Awards. Not a chance. This is a physical game. This is a big deal for Nintendo. They are not going to shadow drop this. If anything, I guess I every year we're reminded that they no one really does care, but I care. So, I'd be like, get this out before Game Award nominations are cut off. Hopefully hoping it's that good. Get it out in early November because that's always such a bad call, actually.",
            "start": 1573.44
        },
        {
            "text": "but I care. So, I'd be like, get this out before Game Award nominations are cut off. Hopefully hoping it's that good. Get it out in early November because that's always such a bad call, actually. You know, everybody loved Indiana Jones, so I'm sure it'll be nominated of this year for Game Awards. Yeah. Yeah, for sure. For sure. All right, we're in we're in agreeance here. Sounds good. We've laid out Nintendo slate. Dose of Nostalgia super chatted and said, \"Late June, early jer July direct for Metroid Prime 4.\" Okay, hold on. They're trying to get it all boiled in with this few characters. Late June/ear early direct early July direct MP4 announced for September 3D Mario in November. Animal Crossing Spring 2026. Let me be delusional. You are incredibly delusional. Not a chance. No 3D Mario. super delusional, but I don't I don't doubt the Metroid Prime 4 specific direct. If you're going to do multiple of these like game focused directs, this is the year to do it. And Metroid Prime 4 for",
            "start": 1611.44
        },
        {
            "text": "super delusional, but I don't I don't doubt the Metroid Prime 4 specific direct. If you're going to do multiple of these like game focused directs, this is the year to do it. And Metroid Prime 4 for sure is the kind of game you want to do it for, right? Like that is a game that you want to drum up the audience that's going to have a hardcore core audience for that game that's like excited, that wants to see the nuts and bolts, that wants to see the mechanics, and like I think us here would be so down to live react to that, especially if you have it be anywhere near as exciting as the Don Kong Bonanza one was, which I expected to be. Yeah. Like for sure do a 20 minute direct about Metroid Prime 4 in July announcing the release date. We will wait and see. Mike super chats for our final Metroid one and says, \"Imagine there being a London Underground Easter egg in Metroid Prime 4 in light of the situation. It would delay it even longer. Nobody wants that. Just get it out. Just get it",
            "start": 1657.68
        },
        {
            "text": "Metroid one and says, \"Imagine there being a London Underground Easter egg in Metroid Prime 4 in light of the situation. It would delay it even longer. Nobody wants that. Just get it out. Just get it done. All right, it's time.\" London Underground. That's so cool. It's a cool name for sure. Yeah. Yeah. Like we have, you know, Mind the Gap. Does that mean anything to you? Mind the Gap? No. Thank you. Another thing I was arguing, this might have actually be where the conversation started with Lucy. Oh, I'm like, no, that's not nobody here knows about that. Nobody cares about that here. If you've gone and you've done it or you've seen or you met a Brit, you understand it, but like whatever. And don't get me wrong, I'm not talking [ __ ] about the tube about the underground. I [ __ ] hate public transit in the United States. It's ridiculous that we didn't do this. But of course, we're ruled by car companies and the oil barons, so that's why we can't hit nice things. But is that just a",
            "start": 1694.08
        },
        {
            "text": "public transit in the United States. It's ridiculous that we didn't do this. But of course, we're ruled by car companies and the oil barons, so that's why we can't hit nice things. But is that just a thing of like don't [ __ ] die as you're going? Oh, yeah. There's a gap there. You could die. Oh [ __ ] Yeah. Yeah. mind the gap. You should do something about that. I mean, you know, they just made tough people who don't or maybe are getting games earlier than us. We're not a thousand% sure what's going on. It doesn't matter. Blessing Greg, I want to talk about the next story, which I think would push us too far in for the ads. So, let's just do the ads here. I'll remind you, of course, that we couldn't do this and have shenanigans and have fun and talk about the chicks. The chicks. Slick Rick. I don't feel comfortable saying I'm talking about the chicks. You know, they got Well, it's a proper noun. You know what I mean? Put the cool chicks in there or something. Put something else in",
            "start": 1729.92
        },
        {
            "text": "Rick. I don't feel comfortable saying I'm talking about the chicks. You know, they got Well, it's a proper noun. You know what I mean? Put the cool chicks in there or something. Put something else in there. The cool chicks. The D chicks. You know what I mean? Okay. Well, I the D chicks I don't think rolls off the tongue. I should have been in there to try to spitball some new names. Uh we couldn't do this kind of stuff without you. So, thank you for your support. Remember, you can grab a membership for 10 bucks a month. Get all of our shows ad free. That's more than 80 episodes a month. Of course, a daily podcast with me each and every day that adds up to four hours of exclusive podcasts a month. And of course, just get good karma for supporting a small independent business. But right now, you're not using the perks you can get on patreon.com/kindfunny. youtube.com/kindfunnygames, Apple or Spotify. So, here's a word from our sponsor. This episode's brought to you by Shady Rays. Get",
            "start": 1765.68
        },
        {
            "text": "you're not using the perks you can get on patreon.com/kindfunny. youtube.com/kindfunnygames, Apple or Spotify. So, here's a word from our sponsor. This episode's brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized shades that won't break the bank. Shady Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people. They have hundreds of options to choose from, so you're bound to find the perfect pair to match your style. If you don't love your shades, exchange them for a new pair or simply return worry-free within 30 days. There's no risk when you shop. Their team are always there to have your back with personal and fast support. Y'all know I've been outside a lot playing Pokémon Go, and it's such a great experience wearing Shady Rays when I'm out and about looking dope. Exclusively for you, Shady Rays is giving out their best",
            "start": 1797.6
        },
        {
            "text": "know I've been outside a lot playing Pokémon Go, and it's such a great experience wearing Shady Rays when I'm out and about looking dope. Exclusively for you, Shady Rays is giving out their best deal. Head to shadyrays.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. Again, go to shadyrays.com, use code funny to get 35% off polarized sunglasses. And we're back. Thanks, Tim. Number two on the rope report. Net eases surprise reveal of a new AAA wia wia wia wooa wooa. That's how I would think. Okay. Wooa game blood message has fans comparing it to Uncharted and Tomb Raider. This is Vicky Blake at IGN. You say let's react to this trailer. I say let's [ __ ] roll. But my question is should I read the article first or you want to just go in blind on the trailer? Let's go in blind on the trailer because I've not watched I've seen clips of the trailer but I've not watched the full thing. I better see some gameplay.",
            "start": 1842.16
        },
        {
            "text": "you want to just go in blind on the trailer? Let's go in blind on the trailer because I've not watched I've seen clips of the trailer but I've not watched the full thing. I better see some gameplay. Yeah. Whoosha. Yeah, it looks like Uncharted already. Yeah, a scorpion coming out in the desert sand. Good call for audio listeners. Yeah, there's some when the Tang Dynasty rained. The lights along the silk road shown from the western region all the way to the capital star dynasty gone. Will the gods and Buddhas still favor the hex? I'm serious. I still want to give it another try. Cinematic trailer so far. The blood we shed today is for bringing the Tang Dynasty. 24 entertainment. Who does um Naka Blade Point? Okay. Get Ning out of the city before it's destroyed. Oh [ __ ] So we're looking at gameplay now. Assassin's Creed. Yeah. Not Uncharted. Sure. They're like drawing. Yeah. This is Yeah. Very much gives Yeah. Uncharted Assassin's Creed vibes. Third person action. Looks really good. A",
            "start": 1895.76
        },
        {
            "text": "gameplay now. Assassin's Creed. Yeah. Not Uncharted. Sure. They're like drawing. Yeah. This is Yeah. Very much gives Yeah. Uncharted Assassin's Creed vibes. Third person action. Looks really good. A lot of melee combat we're seeing. Way more cinematic than I I thought it was going to be. Yeah, me too. It looks great. Father, I decided to join the Shazaw to the tank. That's a suicide mission. Some sword combat. [ __ ] This looks good. Yeah, this looks really good. Oh, that brings back a good Wow. Victory defeat our butt. Towers of sand scattered to the wind. Only the suffering of all living things remains to heaven and earth. Oh, catching the door. I was just playing charted with barrier. Come home. Your mission is meeting. So, it's a father-son journey, too. Fate will show you that I have the greatest. It seems like sword combat is the main method of combat. Yeah, it definitely vibes. I mean, it has the cinematic feel of Uncharted, but it's got that Assassin's Creed look. Nothing will",
            "start": 1968.48
        },
        {
            "text": "the greatest. It seems like sword combat is the main method of combat. Yeah, it definitely vibes. I mean, it has the cinematic feel of Uncharted, but it's got that Assassin's Creed look. Nothing will change. More people die. [ __ ] but it's like Assassin's Creed via like how Naughty Dog where it's like actiony, but you can kind of see those cinematic moments interrupted. [Music] Get out of the desert without my help. Oh [ __ ] Oh [ __ ] Found like a tomb or something. Just climbing stuff. Oh, here we go. Here's a sunlight mirror puzzle. Hell yeah. Now it's uncharted. It's a really good trailer for a brand new game. Yeah, you just go father. Al, I'm sure we'll talk about this in a second, but like this is the kind of kind of trailer that should have been in a showcase. Oh, yeah. Jeff, if Jeff's got to have this for some people, if the gods won't save our tribe, I will. And she's walking on fire. [Music] [Applause] [Music] Fire and stuff's falling. A big guy and a sword standing in the",
            "start": 2042.32
        },
        {
            "text": "got to have this for some people, if the gods won't save our tribe, I will. And she's walking on fire. [Music] [Applause] [Music] Fire and stuff's falling. A big guy and a sword standing in the flaming wreckage. I mean, Lucid Dream says that costs several hundred though. I'm not saying Jeff showcase specifically. I'm just saying like this is showcase quality as far as what this trailer is. 10 of me. Each and every one of them is prepared to die. Oh, that's cool. That's cool. Like this would have been a great get for any showcase. Imagine the 6180 showcase. That's like on you Kyle. Now for the now for our favorite independent developer Net Ease and closed out the wholesome direction. [Music] This is the end of the You see some dust fading off the wall revealing images. You wouldn't call those hieroglyphics. I forget what you would just call them. Oh, it's just art paintings. Coming to PC. So, the game is called Blood Message. I forget if we mentioned that earlier, but Oh, [ __ ] Oh,",
            "start": 2114.08
        },
        {
            "text": "those hieroglyphics. I forget what you would just call them. Oh, it's just art paintings. Coming to PC. So, the game is called Blood Message. I forget if we mentioned that earlier, but Oh, [ __ ] Oh, you getting an alert. Is that your alarm? Somebody calling you? Uh, hello Lucy James from GameSpot and from Britain. You're on kind of funny games daily. I know nothing. I was just recounting how it was so funny to see you from your little popper nation come over here and think people understood the tube or mind the gap or the underground. What do you mean? It's so easy and intuitive. No, no, no, no. Not that how to use it. I remember I remember us having a drunk argument during COVID about how iconic the tube was and how iconic the underground was and me being like people here don't know that and with the mind the gap thing and all that jazz really. Yeah. So you guys you guys want to like co-op the royal family and you have little viewing parties for the royal wedding or whatever",
            "start": 2193.2
        },
        {
            "text": "that and with the mind the gap thing and all that jazz really. Yeah. So you guys you guys want to like co-op the royal family and you have little viewing parties for the royal wedding or whatever whatever and you don't appreciate a real cornerstone. Hold on. I've never had a viewing party for the royal family. Yeah. Blessings never had a viewing party. But it's here's the thing is like that's See, let me let me take you on a walk here. Are you familiar with the bottle city of Canandor? Are you are you are you familiar with the bottle city of Canandor? No. What's that? This is from Superman. Of course, it's a it's a a city that Brainiac bottle that he had to keep in the fortress. People like to look through the bottle at the city, but nobody wants to live in Canandor. So, like we like to look at y'all doing this thing, but nobody knows anything other than you boil all your food. That's like what we know, you know? You know, legitimate complaint there about boiling, but at the same",
            "start": 2237.76
        },
        {
            "text": "to look at y'all doing this thing, but nobody knows anything other than you boil all your food. That's like what we know, you know? You know, legitimate complaint there about boiling, but at the same time, do you know how difficult it was for me to go from living in a city where I could get anywhere I wanted to for really cheap, really quickly to the land of the car, and I don't drive. This is a slight on me, this America, but you guys just don't have good enough public transport. That's 100% correct. You're correct on that. But you should learn to drive. Like, you know, if you bought a car, once you made that initial investment of like $30,000, then it's pretty cheap to use except for the smog stuff and the registration, the license, the insurance, all that. But I mean, like, still. Yeah. Yeah. Yeah. That's right. I mean, you really got me there. The tube is great. You've been on the tube. I love it. No, no one is insulting the tube. The tube is amazing. I wish we had that. It has a",
            "start": 2280.24
        },
        {
            "text": "Yeah. Yeah. That's right. I mean, you really got me there. The tube is great. You've been on the tube. I love it. No, no one is insulting the tube. The tube is amazing. I wish we had that. It has a cool name. It has a great name. Yeah. Yeah. Tube. All right. Thanks, L. I don't know. Someone messaged me and they were like, \"You're slagging off the tube.\" And so, I came on to defend. But if that's not the case, then now I'll tell you right now as an American as as an American slagging off the tube. I was gonna say it. I'm like you said it. All right. Loose. Love you. What to the tube? All right. Bye. You want to do what to my tube? That's crazy. You want to slag off my what? Slag off the what? That game look awesome. Uh, you have a press release here. I assume we covered most of it, but surprise Net East or Oh, this is Vicky Blake at IGN, not the press release. Surprise! Net Ease Thunder has just revealed Blood Message, an allnew action adventure game that looks like a Wooa. Wooa.",
            "start": 2324.56
        },
        {
            "text": "surprise Net East or Oh, this is Vicky Blake at IGN, not the press release. Surprise! Net Ease Thunder has just revealed Blood Message, an allnew action adventure game that looks like a Wooa. Wooa. Uncharted. What is Wooa? I don't know. Okay, I just know how to pronounce things. That's fine. I like that. Uh, described as a story-driven single player action adventure set in ancient China, Blood Message, will feature cutting edge technology to heighten immersion in an epic blockbuster experience. Woo, literally martial hero, is a genre of Chinese fiction that focuses on the adventures of martial artists in ancient China. That's awesome. That's [ __ ] rad. I'm a Wooa fan. I didn't even know. Uh players can expect a deeply emotional journey with gameplay quote anchored in cinematic storytelling and quote in visceral realistic combat that blends stealth and survival mechanics. You'll visit diverse landscapes right across right across Eastern and Central Asia. Blood Message is an upcoming",
            "start": 2364.32
        },
        {
            "text": "and quote in visceral realistic combat that blends stealth and survival mechanics. You'll visit diverse landscapes right across right across Eastern and Central Asia. Blood Message is an upcoming thirdp person linear action game developed by 24 Entertainment Studio and Net East Thunder. It introduces a forgotten odyssey of loyalty and survival where players join uh Dong Huang's uprising uh taking control of a nameless messenger and his young son in an son in an immersive third-p person action adventure. Quote, \"Caught in the crossfire of a righteous uprising and driven by loyalty to both family and country. Players will embark on a perilous eastward journey to deliver a message that holds the fate of the wartorrn homeland,\" teases the blurb. Amidst the shifting sands of history, they will etch a final tale of loyalty. Now, that's a [ __ ] lie. That is a bar right there. Uh, Blood Messages coming to PC and consoles, although a release date has not yet been confirmed. Um, I have quite a",
            "start": 2402.56
        },
        {
            "text": "etch a final tale of loyalty. Now, that's a [ __ ] lie. That is a bar right there. Uh, Blood Messages coming to PC and consoles, although a release date has not yet been confirmed. Um, I have quite a few thoughts, please. Um, I'll start off with what a hefty trailer for reveal uh that showed us both a lot of cinematic, but then also a lot of gameplay stuff, which makes me not feel like this game is like far far away, right? Like I wouldn't be surprised to see this come out in like the next couple years, maybe next year or the year after. Yeah. Would that be crazy to say? No, I don't think so. I mean, this is always that problem. I would start the conversation with what is everyone's interpretation or a take on Net Ease? And I think that's the thing is that you're seeing I feel like Net Ease start to make these moves where they're not just the mobile game thing. They're just not this mobile tie. And whether it's successful or a game for you or whatever, you have to recognize that it",
            "start": 2446.96
        },
        {
            "text": "Ease start to make these moves where they're not just the mobile game thing. They're just not this mobile tie. And whether it's successful or a game for you or whatever, you have to recognize that it seems like they're trying to shift a bit into a a console PC landscape, they're usually not. And that's known for that's one of the other thoughts I have on it is it's so interesting and cool seeing this coming off of what Blackmth Wukong did last year. Like when you want to talk about what the AAA space is right now and how much the AAA space is growing in countries like Korea and also China when we're talking about this and talking about Blackmith and talking about other things, right? Yeah, I think this Net Ease, if I know Net Ease for anything, right, it is the mobile stuff, right? But it's also like they know how to make money. Net Ease goes where the money's at. And seemingly right now in the the China China EOS, China ecosystem of video game development. It seems like the money is",
            "start": 2488.8
        },
        {
            "text": "also like they know how to make money. Net Ease goes where the money's at. And seemingly right now in the the China China EOS, China ecosystem of video game development. It seems like the money is there as far as one AAA video games and how much that audience has a growing hunger for that evident by how much we how well we saw Blackm Wukong uh uh do, right? But then also games that take place in China. Blackmmith Wukong I think was great did well and all that stuff because of Chinese developer but also they used Chinese mythology to really build up this ground swell of interest and passion coming out of that audience. This being a Wooa game, right? Like I think it's going to speak to that same exact audience. And I wouldn't be surprised to see this do very similar numbers as Blackm Wukong as long as it's backed up by good gameplay and good graphics and cinematics and a story that's there which is a big ask. But even like what's our um slogan when it comes to Blackm Wukong? Was",
            "start": 2529.68
        },
        {
            "text": "Wukong as long as it's backed up by good gameplay and good graphics and cinematics and a story that's there which is a big ask. But even like what's our um slogan when it comes to Blackm Wukong? Was Blackmmith want was Blacksmith combat? Was Blackth Wong combat bad? No, it's just not great. Exactly. That's a game that like I think really excelled w with cinematics and presentation and like the gameplay was fine, right? Um, I think if this game comes out and already we're seeing the cinematics, already we're seeing the setting. We're seeing like them lean into the Uncharted Cross Assassin's Creed style of like how good the game looks and how how high fidelity and high budget it seems. I think that's almost enough. Like I want the gameplay should be good too as well, right? But like already you're starting off on a foot where I'm like, \"Oh, that's going to sell millions and millions.\" Yeah. No, if they can live up to what they showed there, that seems like a great game. That seems like",
            "start": 2573.68
        },
        {
            "text": "you're starting off on a foot where I'm like, \"Oh, that's going to sell millions and millions.\" Yeah. No, if they can live up to what they showed there, that seems like a great game. That seems like a great time, a great thing that appeals to not only just fans of, like we said, Uncharted or Assassin's Creed, but yeah, if you can bring in the Chinese audience with like, hey, we're in this genre y'all love clearly, then yeah. Yeah. And so I I I hope that's right. And I hope to see NEIS continue to do that. I think we talk about so many people who in companies and all these things and I'm not saying Netis is a great company but I'm saying we talk about all these companies that are just making the mobile game to make the money to do the thing to keep going keep like if they're turning around investing that into bigger experiences and trying to grow their portfolio and make really good games that's great for them and I hope that's what we see out of it. Yeah, it strikes me again similar",
            "start": 2617.36
        },
        {
            "text": "investing that into bigger experiences and trying to grow their portfolio and make really good games that's great for them and I hope that's what we see out of it. Yeah, it strikes me again similar to uh Blackm and also like similar to Stellarblade of seeing 20 was it 24 entertainment studio uh in Net East Thunderfire, right? like 24 Entertainment coming off of NRAA strikes me as um the stellar blade studio coming off of their Nikking into the AAA space in the likes of P studio doing it um as well right of having these titles that are way different like I might be mobile focused or multiplayer focused or smaller scale popping into the AAA space and doing something special like I think we're going to see more of these types of games from these kinds of studios that do have funding from like Net Ease or these other places make these levels of AAA game experiences with probably more capability than we're seeing from a Ubisoft or like a lot of Western studios that I think are struggling",
            "start": 2650.8
        },
        {
            "text": "Net Ease or these other places make these levels of AAA game experiences with probably more capability than we're seeing from a Ubisoft or like a lot of Western studios that I think are struggling right now with with making that work for them. Sure. Yeah. Yeah. You've got that financial backbone, right? Whereas it's not the reverse of it where the giant places that have been doing it forever like, \"Oh [ __ ] well, how do I make money in between those things?\" Or I'm chasing trying I we tried to make a Fortnite that failed now we're [ __ ] versus we tried to make a Candy Crush and we made 19 of them. You've never heard of them, but they're killing everywhere. So great. Exactly. Uh let's talk about some more success stories. Number three is two big sales number stories. Uh number or 3A rematch has 1 million players. We go to their official Twitter at play rematch. 1 million unique players in 24 hours. Seeing so many of you jump into rematch on day one is incredible. The heart emoji we",
            "start": 2690.48
        },
        {
            "text": "has 1 million players. We go to their official Twitter at play rematch. 1 million unique players in 24 hours. Seeing so many of you jump into rematch on day one is incredible. The heart emoji we use the hands. Uh the whole team is super grateful and already hard at work on fixing and improving the game. We are just getting started. Soccer ball emoji. I've been saying this uh since the betas, but this game is going to be super successful. Yeah. Um, I've had back and forth conversations with people about like whether it should have been free to play or or not. And like I really lean on I'm glad they're uh charging the price for it. I forget Jack can correct me if I'm wrong, right? But like it's like $30 or $40 to buy. Um, but then also it's on Game Pass. 30 bucks. Thank you. It's on Game Pass, which is going to be really good for it. Um, but I think even beyond that, this is the kind of game that I think people will spend money for. Like I think people It's soccer. It's fun. I think it",
            "start": 2727.12
        },
        {
            "text": "which is going to be really good for it. Um, but I think even beyond that, this is the kind of game that I think people will spend money for. Like I think people It's soccer. It's fun. I think it uh it presents really well. It has that social media um like badge of like it's it's a really sharable game as far as what you can do with clips, as far as like I think how you're gonna uh capture people with that element of it. Like this game is built for success and I hope for success cuz I want to see it continue to build. I mean, slow clap, come on. The seafood devs, they deserve it. They're very talented studio. Uh you're of course trying to review this for us next week on a Games Cast, correct? Yes, I'm looking forward to that. I got many thoughts already. Oh. Oh, yeah. He's percolating. Uh, and then 3B of course is lies of P has sold 3 million copies. We go to the Lies of P Twitter. 3 million puppets or three million humans matters not. We hope you enjoyed your stay on Karat. Thank you",
            "start": 2771.68
        },
        {
            "text": "and then 3B of course is lies of P has sold 3 million copies. We go to the Lies of P Twitter. 3 million puppets or three million humans matters not. We hope you enjoyed your stay on Karat. Thank you from the bottom of our hearts. # Liesofp # Thank you. Hell yeah. Congratulations to them. Yeah. I wonder how much, if anything, the DLC pushed that final number here. I mean, for sure. Like it must have done quite a bit for it. Did you go to back the DLC? Have you had time? I know you've been busy. I I've not had time. And this also this is the thing that comes back to like my struggle with DLC where it's so hard to put myself back into the mind frame of a game that I beat years ago. I know it well. Uh number four on the roper report. Thanks to Borderlands 4 fans, this handy feature has been added to the game. This is Darren over at GameSpot. Following a recent wave of Borderlands 4 previews, Gearbox boss Randy Pitchford has confirmed that one fan requested feature will be in the game when",
            "start": 2808.16
        },
        {
            "text": "to the game. This is Darren over at GameSpot. Following a recent wave of Borderlands 4 previews, Gearbox boss Randy Pitchford has confirmed that one fan requested feature will be in the game when it launches in September. While a mini map won't be in the looter shooter, a radar will, making situational awareness of the battlefield much easier. Uh, in a lengthy thread, Pitchford spoke about how fans have been asking Gearbox to add this feature to the game. Many people from the European, US, and Asia preview tours were advocating for it, Pitchford said. So, the studio managed to make this happen. Uh, Kev, if you if you're able to, could you do me a favor and like go to the tweet and then scroll up to like the top tweet just to show people how long this [ __ ] thread is? 32. You don't need all the first of all, Randy Pitchford. Randy, they'll never make me like you. But there there's you you have the check mark. You have more space to tweet, I'm pretty sure. Right. You have more",
            "start": 2855.04
        },
        {
            "text": "need all the first of all, Randy Pitchford. Randy, they'll never make me like you. But there there's you you have the check mark. You have more space to tweet, I'm pretty sure. Right. You have more characters to tweet with. And then also, if it's this long, just put in a blog post. I know you have access to a blog. I just don't I just don't [ __ ] with the framing of this. Why are you Why do you have a 32 tweet tweet thread? End of rant. But hey, good on the developers for adding this. We talk all the time about, oh, we're doing an alpha, but it's not really an alpha. You're shipping in two weeks. You're not making any changes. I like that just based on previews and fans talking on whatever. They're like, okay, we can do that. It It's a great feature to have. Also, I'm so excited based off of the previews we got the other day for Borderlands 4. Now, everybody's saying really good things about it. Yeah. Yeah. I mean, you know, I'm a Borderlands guy and I, like I said, coming to this",
            "start": 2898.0
        },
        {
            "text": "off of the previews we got the other day for Borderlands 4. Now, everybody's saying really good things about it. Yeah. Yeah. I mean, you know, I'm a Borderlands guy and I, like I said, coming to this one, I I haven't been starving for it, it feels. So, I've actually been blackout on it. I didn't read the previews. I didn't do anything with it. So, I'll be excited to just get my hands on it when it's time to get my hands on it. Hell yeah. What? Oh, nothing. He started grinning early. I did something that you didn't view. No, no, I was thinking about I was thinking of war Randy pitch for dunks, but I was like, I got to hold myself back. Listen, being somebody's number one hater is a full-time job. You know what I mean? And I'm trying to put work to restrain myself. I appreciate that. Uh, number five, Fortnite has a new hit mode, and for once, the game's main battle royale option is no longer most popular. This is Tom Phillips at IGN. Log into Fortnite right now and you'll find the",
            "start": 2934.48
        },
        {
            "text": "number five, Fortnite has a new hit mode, and for once, the game's main battle royale option is no longer most popular. This is Tom Phillips at IGN. Log into Fortnite right now and you'll find the game's most played mode is very unusually not the main battle royale option. Instead, it's the new Blitz Royale. It's Instead, the new Blitz Royale is currently ruling the Roost. But what is it? And why is the fresh offering from Epic so popular? As the name suggests, Blitz Royale matches are meant to take less time overall and power up players much faster than in classic Battle Royale offering. The game's the mode's map, currently based on Fortnite's classic OG island, is a fraction of the size, including building is disabled, and there is an in-match leveling system to grant weapons and power-ups, meaning there's no need to spend time scrging for loot. That said, other battle royale staples remain. a fastmoving storm circle limited inventory and uh need limited inventory and there's",
            "start": 2970.16
        },
        {
            "text": "power-ups, meaning there's no need to spend time scrging for loot. That said, other battle royale staples remain. a fastmoving storm circle limited inventory and uh need limited inventory and there's something about how Darren wrote this in a way or Tom wrote this in a way that's breaking my brain and I it's it's a Greg problem not a Tom problem a fastmoving storm circle limited inventory and need to be the last player standing over the next four weeks Epic Games has yet to specifically state that Blitz Royal will be permanent edition various loot pools will be offered including items and power granting medallions from classic Fortnite eras. Um, we talked about this a little bit the other day of like them um, adding this. Yeah. An announcement. I made sure I got it into the games daily uh, thing and I also tossed in the streaming thing. I'm like, \"This sounds cool.\" Like I I haven't had time to kick the tires. I've been in Death Stranding review mode. But I was like I mean now I have",
            "start": 3015.2
        },
        {
            "text": "thing and I also tossed in the streaming thing. I'm like, \"This sounds cool.\" Like I I haven't had time to kick the tires. I've been in Death Stranding review mode. But I was like I mean now I have now I'm like, \"Oh, I should really check this out. This sounds fun.\" And seeing that it's successful and people are lacking it makes me want to jump in more. What was interesting about it, and I'm sure you I know you read the stuff that I sent over and you saw it yourself, but they were so clear of like it's this new thing. Perfect for mobile, of course, celebrating the fact that they're back on mobile devices and phones like that, stuff like that. Like, I wonder how much that's kicking it up, right, of the return to the phones. People are excited to be back in that. I still haven't I want to try it, but the problem is I don't want to buy the Superman battle pass cuz I'll never use the Superman skin, but then someone sent me the Lego Fortnite tweet where of course if you unlock it on the",
            "start": 3058.8
        },
        {
            "text": "try it, but the problem is I don't want to buy the Superman battle pass cuz I'll never use the Superman skin, but then someone sent me the Lego Fortnite tweet where of course if you unlock it on the battle pass, you get it for Lego Fortnite. And I'm like, I also don't play Lego Fortnite, but there's a chance one day I will. Like, do I need to futureroof Lego Fortnite by getting this Superman set? I say you do. Thank you. I that, you know, that's I mean, honestly, this is one of those things where I'm with you. I think you should do it. Future proofing. [ __ ] That's important. That's great. Hey, you talked me out of buying that $50 Captain America skin for that mobile game one time. Yeah, you were. Yeah. No, that was a great You were right. But Fortnite is timeless. You were right. Oh, yeah. That Listen, I'm here to enable and disable when when it doesn't make sense. When it does make sense. And I think this one does make sense. You're going to play Fortnite forever. It's It's a game",
            "start": 3089.04
        },
        {
            "text": "That Listen, I'm here to enable and disable when when it doesn't make sense. When it does make sense. And I think this one does make sense. You're going to play Fortnite forever. It's It's a game that's going to be around forever. Your son is going to want to play 5 years from now. And he's going to see that Superman skin and go, \"Oh, we have that.\" That's a really really good point. Do it for your future. I like that. So, a similar similar thing. Uhhuh. Don't worry, we'll get you out of here. Bear Hasbro has done another full-size proton pack. This one 1984 proton pack that like is I have, you know, you've seen my I have multiple proton packs, but you've seen the most recent one and it's like beat up cuz it's supposed to look like an afterlife proton pack, right? They've now done a new one, but it's also then $300. No. Okay. No, it's like a physical. My thought was, of course, I have my other proton pack that the Arizona Ghostbusters made for me and I paid for, but like that one's",
            "start": 3123.52
        },
        {
            "text": "one, but it's also then $300. No. Okay. No, it's like a physical. My thought was, of course, I have my other proton pack that the Arizona Ghostbusters made for me and I paid for, but like that one's really heavy. So, one day Ben is going to need a fullsize proton pack. I mean, when you put it like that, you know, when you put it like that, cuz I could go back to the heavy one, but I'll be so much older at that point. I am all for future investments. Okay. And so, I said it to Jen and she just laughed. She didn't say no. But then I got to the pre-order page and I was hovering. I was like, \"Oh man, $300 right now.\" I'm not as gung-ho on this one compared to the Superman battle. I don't think this one's gonna go anywhere. You know what I mean? Also, I have the two packs, so it's not like a uh blessing. Yeah. Me buying a Superman skin, me buying a proton pack, me listening to the chicks. These are all huge stories. If I wanted something smaller, say the tiniest news you needed to know",
            "start": 3162.08
        },
        {
            "text": "a uh blessing. Yeah. Me buying a Superman skin, me buying a proton pack, me listening to the chicks. These are all huge stories. If I wanted something smaller, say the tiniest news you needed to know about, where would I go? You'd go to our last story, the Wii News Channel, where we cover all the small news items you need to know about. Number seven, Wii news. Uh, publisher tells Nintendo to pull its own game from Switch to eShop while it waits for backwards compatibility patch to go live. This is Vicky Blake at IGN. Limited Run Games has asked Nintendo to remove the Gex trilogy from sale via the Nintendo Switch to eShop until there's clarity on when a patch will be deployed to address the problem, the game's backwards compatibility. That was story number six that's been demoted to I have good news. Is there an update on this? Is is it back? Do they fix it? I've been only lightly paying attention. You mean Gex guy? No. Well, I mean you some of you idiots wanted codes, so then I got to",
            "start": 3202.88
        },
        {
            "text": "good news. Is there an update on this? Is is it back? Do they fix it? I've been only lightly paying attention. You mean Gex guy? No. Well, I mean you some of you idiots wanted codes, so then I got to I'm on every Gex goddamn email now. So, here we go. I have breaking news then from the Gex people in my inbox. Nintendo updated the Switch 2 firmware last night and we're happy to announce that this has resolved the backwards compatibility issues with the majority of our carbon engine titles. Nice. Since we do not have clarity on when Gex Trilogy, maybe it's not the same thing. Since we do not have clarity on when Gex Trilogy on Switch 2 will be fixed in firmware, we submitted our own patch last week to correct the issue due to the Junth holiday patch approval this week's delayed, but we expect that to be able to issue the patch early next week. So, they fixed other games they have. In the meantime, we have asked Nintendo to remove Oh, no. This is just for this is the new story. This was",
            "start": 3251.92
        },
        {
            "text": "that to be able to issue the patch early next week. So, they fixed other games they have. In the meantime, we have asked Nintendo to remove Oh, no. This is just for this is the new story. This was before I deleted all the rest of the story, but yeah, the rest of the story did clarify all of this. Y'all, if you're a Geck sicko, it [ __ ] sucks for you right now, but it'll get good one day. Don't worry, you'll be okay. Don't worry about it. I'll let you know that. Once human is getting custom servers, uh, and their annual showcase has been announced for July 2nd, 2025. Uh, POW World Cross Tides of Terraria launches on June 25th. Maf the Old Country has gone gold. [ __ ] yeah. God damn, that's coming quick, isn't it? And from Sega, we are excited to announce a new partnership between Sega's iconic ninja franchise, Shinobi, and Dirty Magic, the upcoming apparel brand from Young Dirty Bastard of the Wuang Legacy. Is that what they call themselves now? Woo Legacy. I mean, Young Dirty",
            "start": 3292.56
        },
        {
            "text": "iconic ninja franchise, Shinobi, and Dirty Magic, the upcoming apparel brand from Young Dirty Bastard of the Wuang Legacy. Is that what they call themselves now? Woo Legacy. I mean, Young Dirty Bastard, I assume, is the son of Old Dirty Bastard. So, I wonder if Wuang Legacy is like, got it. That makes sense. Plus, limited release merchandise is now available at Hot Topic. Hell yeah. Okay. Of course, Barrett's massive games cast. I I replayed every Naughty Dog is coming up as a live prayer momentarily. So, let me truck through some super chats for you. Okay. Uh up here, we missed one. Uh yeah, Jordan White wanted to make sure we saw the blood message trailer. We did and we enjoyed it. Have fun. Uh hey guys, I'm going to Japan this winter and have never owned a portable console. What is the safest bet to buy for the flight? And do you have game recommendations? I'm open to most genres. Thank you for all the content. Oh wow. Um tough question. Yeah, it depends on like what you're what",
            "start": 3330.0
        },
        {
            "text": "safest bet to buy for the flight? And do you have game recommendations? I'm open to most genres. Thank you for all the content. Oh wow. Um tough question. Yeah, it depends on like what you're what ecosystem you're in. I really I vibe with the Steam Deck cuz I'm now I'm just strongly in the Steam ecosystem rather than having a PC at home and then Steam Deck for on the go. So my automatic recommendation would be Steam Deck and as far as a game blueprints would be automatic, but also I'll throw in there Bellro uh or even I've been playing Hollow Knight on the Steam Deck and it's been a pleasant experience. So those are my three recommendations. Uh yeah, for me I would go the opposite of worrying about the device and worry about the game. What game would you want to play on this trip? Right. You know, I'm I'm obsessed with my ROG Ally, of course, I have Steam. I have Windows through that or whatever. So, if I was doing that and just sitting down and playing a giant open world RPG on the",
            "start": 3371.12
        },
        {
            "text": "You know, I'm I'm obsessed with my ROG Ally, of course, I have Steam. I have Windows through that or whatever. So, if I was doing that and just sitting down and playing a giant open world RPG on the plane, buy a battery pack or make sure they have plugs. I would do that. But if it is that, hey, you want to be playing Metroid in that side or you want to be playing Animal Crossing or you want to do that switch too. There's a million great. You can't go wrong. But I would build it around what library you want. My computer is wigging the [ __ ] out on Here we go. Is it scrolling through the thing? Yeah, it was like locked. Right. There it goes. Mine does that all the time. Wow. I've never had that happen before. There's a birthday tax down there. Oh, from Cider of Fries. Cider of Fries right says, \"Birthday tax. Enjoy the weekend, everyone.\" Here we go. Happy birthday, Sider of Fries. Uh CJ Splitzon says, \"Well, Intergalactic looks similar.\" I assume they're talking about similar to blood",
            "start": 3408.72
        },
        {
            "text": "\"Birthday tax. Enjoy the weekend, everyone.\" Here we go. Happy birthday, Sider of Fries. Uh CJ Splitzon says, \"Well, Intergalactic looks similar.\" I assume they're talking about similar to blood meal called Blood Message. Yeah, Blood Message. Not a great name for a game. No, in my opinion. No, I agree with that, but maybe it'll grow on us. Um I mean similar how in terms of fidelity or style. I think it'll look better. We'll see. Yeah. Mr. Hawk says, \"Any chance of making blessings pride Greg Way available to everyone? an honest account from a perspective we don't see a lot. It's a great one. W and I were talking about this last night. Yeah. Spoilers. Next week we'll make it live for you while we're still celebrating uh Pride and everything else. But for now, act surprised when that happens. Yeah. Uh and then S'mores and Oreo says, \"Lies of P devs got a bonus switch and a paid holiday for hitting the sales milestone. A huge win in my books. Nowits in round eight are killing it.\" We did",
            "start": 3441.76
        },
        {
            "text": "Yeah. Uh and then S'mores and Oreo says, \"Lies of P devs got a bonus switch and a paid holiday for hitting the sales milestone. A huge win in my books. Nowits in round eight are killing it.\" We did talk about the Switch 2 bonus um I think yesterday or the day before. So uh but that's really cool. really awesome for them to buy like 300 dubs switches and give them all bonuses for uh the game doing well. I think every company should do that just like kind of funny did. Yeah, that's right. There it is. Yeah, you guys got me switched too. It's great. Kebabs writes in for a you're wrong just like you can at your Wrong or kind of funny.com/you wrong and says more whoosha. It typically involves lone warriors traveling the land and using their mystical powers as they encounter people in need across the land. Works like Journey to the West, Crouching Tiger, Hidden Dragon, and Dragon Ball are three of the most recognizable WooA works in the West. We need more, and this is going to be me",
            "start": 3476.96
        },
        {
            "text": "across the land. Works like Journey to the West, Crouching Tiger, Hidden Dragon, and Dragon Ball are three of the most recognizable WooA works in the West. We need more, and this is going to be me speaking from a complete place of ignorance. I was going to say we need more story like genres within genres. You know what I mean? Cuz I love it when people talk about aa or a spaghetti western or isai, you know what I mean? When it's such a specific thing, but then a million stories spawn from that like premise. I always find it cool. Hell yeah. I agree with that 100%. That's cool stuff. And that everybody is your kind of funny games daily. Right on time for you to go watch the premiere of Barrett Courtney's massive video essay. I replayed every naughty dog game. Please check it out on youtube.com/kindfunname where it's premiering momentarily. Of course you can listen to a version of it on the podcast if you'd like to on the gamescast feed. Remember we've been kind of funny games daily.",
            "start": 3519.52
        },
        {
            "text": "where it's premiering momentarily. Of course you can listen to a version of it on the podcast if you'd like to on the gamescast feed. Remember we've been kind of funny games daily. We're kind of funny. We're all about live talk shows. Couldn't do without your support. So pick up a membership. patreon.com/kindfunny youtube.com/kindfunname Apple Spotify. 10 bucks helps us stay in business, buy these people switch to make news and content for you and entertain you uh live on twitch.tv/confunnames, youtube.com/confunnames and podcast services around the globe. No matter where you get the show, thank you for your support and until next time, know it's been our pleasure to serve you. [Music]",
            "start": 3561.04
        }
    ]
}