{
    "id": 14326,
    "video_id": "f2kM8k1JEJ4",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Blessing Adeoye Jr."
    ],
    "title": "Ranking EVERY Hideo Kojima Game - Kinda Funny Gamescast",
    "description": "Download Cash App Today: https://capl.onelink.me/vFut/7u0sm0fp #CashAppPod Sign up with our exclusive referral code KINDAFUNNY in your profile. Send $5 to a friend within 14 days, and you’ll get $10 dropped right into your account. Terms apply.\n\n*Referral Reward Disclaimer: As a Cash App partner, I may earn a commission when you sign up for a Cash App account.* #sponsored\n\nGo to https://mood.com and use code KINDAFUNNY to get 20% off your first order.\n\n00:00:00 - Start\n00:02:30 - Housekeeping\n00:20:40 - Topic of the show:Shit list! \n00:29:18 - Ads\n00:31:34 - Superchat\n00:49:20 - Every Hideo Kojima Game Ranked\n00:53:00 - The Ranking! \n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1751052968,
    "duration": 3362,
    "transcript_chunks": [
        {
            "text": "[Music] Yo, what's up? Welcome to Kind of Funny Games Cast for Friday, June 27th, 2025. I'm one of your hosts, Blessing Addio Jr. Joining me is Lacroy Poppy Tim M [ __ ] Yeti. Oh man, this weekend Pokemon Go Fest is going to be\n also my parade. Everybody, don't forget everybody, it's going to be my parade. San Francisco 10 a.m. Come hang out with me and Tim.\n I'm going to hit level 50. Bless.\n I'm very excited.\n Officially tomorrow.\n 10 excellent throws away. I had to do 999. I am 10 away. It will happen at Greg's parade.\n That's of course\n there'll be a lot of people to celebrate you. It's a great consolation prize. You know what I mean?\n Yeah. Because remember, bless this is everybody.\n You can buy the shirt.com. Of course,\n team up. This this means I get to wear my bomber jacket that I bought a year ago.\n Oh, are you wearing that tomorrow?",
            "start": 0.33
        },
        {
            "text": "You can buy the shirt.com. Of course,\n team up. This this means I get to wear my bomber jacket that I bought a year ago.\n Oh, are you wearing that tomorrow?\n Two years ago. Well, I'm not yet, but then I will wear it when I get level 50. Cuz once I get level 50, I unlock the jacket at the game. I'll put it on my avatar and then I will have Greg put it on my back.\n I like that. Nothing can go wrong with that plan.\n Wow. Of course, that's WWE legend Greg Miller. Hello, Blessing. How are you?\n I'm doing well. I do like seeing that belt.\n It's h I'm happy to have it. You know, I didn't want I didn't want to play it out before the parade.\n So, I'm happy that here we are parade tomorrow 10 a.m. Biggest thing happening. Kind of funny this weekend. Very excited for it.",
            "start": 56.72
        },
        {
            "text": "So, I'm happy that here we are parade tomorrow 10 a.m. Biggest thing happening. Kind of funny this weekend. Very excited for it.\n It reminds me of It was a few weeks ago where Randy Jordan attacked John Cena and took the belt and then like posed with it. And I like I had the moment where I was like, \"Man, that looks so good on Randy Jordan.\" I'm having the moment right now where I'm like, \"That belt does look good on me. It's meant to be with me.\" You know what I mean?\n You have like a specific pose that you do. I feel like every wrestler has like a pose. My favorite thing about the belt that we don't talk enough about is that it's broken in.\n I hate when you see the straps at a WWE event. Somebody bought the replica belt, but it's just out of the bag and it just doesn't flop. This one has such a good This has got like the stone cold movement to it that I love.\n It's a great belt. I'm happy it's home.",
            "start": 89.44
        },
        {
            "text": "It's a great belt. I'm happy it's home.\n Are you bringing it tomorrow? Of course I'm bringing it tomorrow. You know what I mean? Tomorrow. Just for tomorrow. Just from 10 to noon during the meet and greet/parade. Right. This belt is more important than Ben. Okay, this is what I need to worry about and keep my eye on. All the other dozens of kind of funny best friends, you keep your eye on Ben. I'm not I'm not busy about that. This is what I got to worry about.\n Thank you, Kevin. This is the jacket that I I will be adorning my\n Does it have those same patches on already? It does.\n Awesome. That's I mean that's a really cool thing.\n Oh, yeah.\n Very exciting.\n Not as cool as this, but I mean the fact that Pokémon Go has that kind of like, hey, get it in the game when you get this thing, you buy it, too. That's cool.\n Pretty cool. They also know how to make money very well.",
            "start": 124.96
        },
        {
            "text": "Yes, 100%. Remember this is the kind of funny games cast. Each and every weekday we get together and talk about the biggest reviews, previews, and topics in video games live on YouTube, Twitch, and on podcast services around the globe. If you love what we do, support us with the kind of funny membership on Patreon, YouTube, Spotify, Apple Podcast to get all of our shows ad free. Watch us record them live and get a daily exclusive show for a chance to be a part of the show. Submit your thoughts and opinions as YouTube super chats as we go. Housekeeping for you. We're in 11 person business. All about live talk shows. KFGD recap Capcom's Direct. After this, Mike and Roger are embarking on the biggest stream Kind of Funny has ever done. They'll attempt to play the entirety of Death Training 2 while Mike goes step forep with Sam Porter Bridges on a treadmill with a couple of surprises that might change everything. With your support, they're determined to make it past KHD on Monday and of",
            "start": 164.32
        },
        {
            "text": "2 while Mike goes step forep with Sam Porter Bridges on a treadmill with a couple of surprises that might change everything. With your support, they're determined to make it past KHD on Monday and of course, order a lot of food exclusively on twitch.tv/kindfunn. TV/ kind of funny games.",
            "start": 209.36
        },
        {
            "text": "It's going to be insane.\n The things that they have planned. I don't know everything, but I do know a lot. And my god, you guys are going to want to just not do anything this weekend, unless you're in San Francisco and then you go to the parade. But if you're not in San Francisco, just stay tuned to Twitch all weekend long. They have some shenanigans and a half planned.\n I have shenanigans planned for them.\n Oh, great. I'm going to be doing this handing them an envelope and it will be very specific of open when you're the most vulnerable. Okay, that's scary. Yes, it is.\n That's really scary about that. Okay.\n Uh, Greg, what are the details of the parade for tomorrow?",
            "start": 226.48
        },
        {
            "text": "That's really scary about that. Okay.\n Uh, Greg, what are the details of the parade for tomorrow?\n Uh, 10:00 a.m. ferry building tomorrow on the Embaradero. We will gather outside. I have made some signs as you may have seen on Games Daily. I encourage you to make your own signs and bring those as well. They can either celebrate me or boo him. Uh, we'll meet outside at 10:00 and then we will walk the Embaradero uh with I have a speaker I'm going to bring so I can play some music. I have a playlist. I got my I haven't built it yet. I'll you know, we'll see what I what I'm feeling. It's it's I you know what's the vibe? You know what I mean? Are these kids here to party or they just here to worship? I'll accept either\n worship. All I say I I would think a Get Low by Lil John could help set the mood.",
            "start": 252.32
        },
        {
            "text": "worship. All I say I I would think a Get Low by Lil John could help set the mood.\n What I'll probably do is do one of those things is open up the Spotify where people can put in their own songs, you know, so we can go and then you can all be part of it. Uh but yeah, 10 o'clock in front of the Ferry Building, we'll post. We'll take photos. I'm sure the mayor will show up. I've I've tagged him in a few of these posts. I've tagged Hunter Pence. I'm sure he'll show up.\n Sure. Uh then yeah, we will walk the Embaradero to Square Pie guys down on Beach Street where we will get some pizzas and we will hang out. We have a great time.\n Man, that's funny you're talking about walking because me and Roger are going to be doing some walking here.\n Yeah, we finished that housekeeping. We did that. We put it over. We\n It's the most important thing of the weekend. Okay, there might be a three-time champion here, but this man, I mean, look at this beast right here. Watch out. I've walked",
            "start": 290.64
        },
        {
            "text": "It's the most important thing of the weekend. Okay, there might be a three-time champion here, but this man, I mean, look at this beast right here. Watch out. I've walked\n That could have ended the stream right there. Okay, you see this donut blast? I'm going to go fuel up with some In-N-Out right now. Let's do this. Okay.\n Well, if you're going to get In, get me some. But also, think about ordering a pizza. Roger. Why are all the donuts\n in Out It is, y'all. We love you. Tune in.\n Oh, yeah. I I got 12 donuts. And she was like, \"What do you want?\" I'm like, \"All chocolate for Mikey.\" You know what I mean? Cuz that's all he likes. That's all he likes. What are you going to What do you want? Vanilla.\n I want a like a regular glaze.\n There's a regular glaze in there.\n Not anymore. Oh. Uh, that's on him.\n Regular glaze.\n You guys got to fight. You nerds got to fight. like six chocolates in there.\n That's how it works.",
            "start": 325.44
        },
        {
            "text": "There's a regular glaze in there.\n Not anymore. Oh. Uh, that's on him.\n Regular glaze.\n You guys got to fight. You nerds got to fight. like six chocolates in there.\n That's how it works.\n Yesterday on his Instagram story, uh Roger shared private messages between him and Mike Howard. Mike uh texted Roward and how they Howard Roward Bower Roger and said, \"It's crazy cuz tomorrow I prove to the world and myself that I can do really anything.\" Then a new text message. Next time I might free solo a mountain or like write a book. next message. Really, anything I want that's the kind of humorous you have to stop and that's what I will be doing with my manel envelope. Thank you very much.\n God,\n Mr. Hawks writes in with a super chat and says, \"Can't believe Tim is trying to take parade day away from Greg by focusing on some jacket. Have you no shame, sit down, be humble,",
            "start": 362.96
        },
        {
            "text": "God,\n Mr. Hawks writes in with a super chat and says, \"Can't believe Tim is trying to take parade day away from Greg by focusing on some jacket. Have you no shame, sit down, be humble,\n Mr. Hawks, you know, you play Pokemon Go. You know the importance of this moment. You know the time and more importantly money that I've spent to make this happen.\" And then Reslu writes in with a super chat and says, \"Greg, steal the jacket and put the belt in the jacket on the line. Winner takes all.\"\n Belt of the jacket. Greg gets my level 50. You shouldn't even put that out there. That is insane work.\n I did when he said that come up with a different idea that I'm going to work on while you keep doing your house.\n Great.",
            "start": 405.12
        },
        {
            "text": "And then on Monday, Tim is premiering his wedding finally. Yeah, we were uh it's been a long time coming. The one-year anniversary of my wedding is this Sunday, which is insane. And then Monday is my birthday and uh it makes more sense to put content out on on workday. So we're doing that on Monday. It'll probably if you all support the way I expect you will be during the Death Stand Death Stranding marathon stream, but the this will be on YouTube. That'll be on Twitch. This will also be a VOD you can watch later. But it is the fully edited wedding including uh Greg's speech, Nick's speech, like all the speeches um and the performances. It's like so it's the the ceremony that some of y'all got to see live when we were live last year, but then also Cisco performing, Tona performing, and all the other extra stuff. It's about an hour 45 total. Um the last 45 are like the speeches and stuff that if you don't want to have to sit through all of them, you don't need to, but they're there",
            "start": 439.6
        },
        {
            "text": "all the other extra stuff. It's about an hour 45 total. Um the last 45 are like the speeches and stuff that if you don't want to have to sit through all of them, you don't need to, but they're there for you if you want to. And uh it's going to be a ton of fun. I worked very hard on this and I can't wait for y'all to see it.",
            "start": 482.08
        },
        {
            "text": "Hell yeah. If you're kind of funny member,\n what day is tomorrow for Pokemon people?\n Pokemon Go Fest.\n Thank you. Day one.\n Today's Gregway is all about which era of gaming Greg is in.\n Thank you to our Patreon producers Carl Jacobs, Omega Buster, and Delaney Twining. Today we're brought to you by All Wait, are you trying to get the same bomber jacket that Tim's getting?\n Don't worry about what I'm doing over here.\n I'm not I'm like trying to get into Greg's brain where I'm like, what could he be trying to do right now?\n Yeah.\n Today we're brought to you by Cash App and Mood, but we'll tell you about that later. For now, let's start with topic of the show. The [ __ ] was that? Why is that? Why is that a button?\n I literally was like, \"Have I been gone from the show or that's the new tots noise?\"\n What was that, Kev?\n Um, I was uh pausing the IGN video that auto plays instead it made the the volume go up and that was the intro",
            "start": 499.04
        },
        {
            "text": "What was that, Kev?\n Um, I was uh pausing the IGN video that auto plays instead it made the the volume go up and that was the intro\n cuz that was kind of a jam. I kind of like that is the topic of the show jam. But okay,\n today's topic of the show is the [ __ ] list. Of course, the [ __ ] list is a special segment of of Games Cast where I go online, I find a top 10 list, I bring it back to the panel, and we judge it for your amusement. Today's [ __ ] list is every Hideo Cojima game ranked.\n A [ __ ] list title so tantalizing that Greg, who usually isn't like a [ __ ] list guy, was like, \"I'm going to be on this one. We're going to we're",
            "start": 541.84
        },
        {
            "text": "A [ __ ] list title so tantalizing that Greg, who usually isn't like a [ __ ] list guy, was like, \"I'm going to be on this one. We're going to we're\n Yeah, you guys usually do [ __ ] list and they're great. I love these episodes, so I'm excited to finally be on it.\" Thank you very much, Tim. I know you don't like giving me the spotlight, you know what I mean? Uh but no, usually you're doing like you know Mario games what you know the [ __ ] lists are that you guys are doing are very much about your games and your nostalgia and this that the other which of course many times aren't mine but I mean Kjima come on",
            "start": 571.2
        },
        {
            "text": "so this is fresh of course death training 2 just came out uh this list is from IGN got a lot of people tagging us in this one of like oh you got to do reaction you got to do reaction every Hideo Kojima game ranked is the name of the IGN list is written by Matt Kim at IGN it was posted June 20th 2025 I think it is very safe to assume that Death Stranding 2 doesn't make this list because it's beforehand. So, every Kojima game ranked.\n Every Kojima game ranked.\n This means most likely it's IGN. They do their homework. So, I imagine this isn't just every Kojima game you know of.\n You know, it's not just the Metal Gears and Death Stranding one. It'll also include Boktai.\n I was going to say thank you. I was googling Kojima game Sunlight.\n And um\n now we don't Google on this show. You got to put away",
            "start": 600.0
        },
        {
            "text": "I was going to say thank you. I was googling Kojima game Sunlight.\n And um\n now we don't Google on this show. You got to put away\n Yeah. Yeah. No Googling. No, no, no, no, no. Well, to get the name of the game is all I'm googling. I'm well aware of the the game that needed the sunlight. It was a big deal. I just want to make sure I done the right thing.\n Be careful around there. You know what I mean?\n Trying to go. Psychonauts. Not psychonauts. Police. Police knots. And then uh\n snatcher. Snatcher. Don't. You're looking at the chat.\n I'm not looking at the chat. You're telling me I can't star a [ __ ] thousand mile gaze over there. Okay. I was like trying to close my mind.\n Wait. So, it's police kneie and then snatcher. Snatcher. I don't know snatcher. I've heard the other two. I'm going assume Snatcher is at the bottom. Having not known Snatcher.\n Sure. Tim, what are you that's what are you thinking right now?\n I wonder too if like Well, those are the oldest games too. I don't know.",
            "start": 635.92
        },
        {
            "text": "Sure. Tim, what are you that's what are you thinking right now?\n I wonder too if like Well, those are the oldest games too. I don't know.\n Well, they're not. Right. Cuz we have the best\n like the older versions.\n Right. Right. Well, [ __ ] [ __ ] You're right.\n I don't know if they're going to include multiple versions cuz there's the NES one and then there's the MSX one and they are Don't put that under one.\n You think?\n I do. There's no notable differences. Like big notable differences different. I could be wrong about that, too.\n So, we got two Metal Gears. Metal Gear one. Metal Gear 2. Have you guys played I remember playing the original Metal Gear on like NES, but I never\n I never completed it.",
            "start": 677.92
        },
        {
            "text": "So, we got two Metal Gears. Metal Gear one. Metal Gear 2. Have you guys played I remember playing the original Metal Gear on like NES, but I never\n I never completed it.\n I never I was so into Solid that Yeah, I went back on FAF. Shout out to FAFS NES. He had it and I was like, \"Oh shit.\" And I borrowed the whole thing and played I dropped off and then collections have had them again where it's the same thing. You started up as like, \"Ah, I really don't need to do this.\"\n I'm pretty sure the Metal Gear Solid 3 subsistence came with\n Yeah. version there are three Metal Gears. Is that true? Well, because I'm pretty sure, I might be wrong about this, but I think on MSX there's Metal Gear 1 and then Metal Gear 2 Solid Snake.\n Yeah.\n And then on NES, I think one of them is the same and then there's a second one that's like a different game\n really.",
            "start": 700.32
        },
        {
            "text": "Yeah.\n And then on NES, I think one of them is the same and then there's a second one that's like a different game\n really.\n But I I definitely definitely could be wrong about that. I just feel like there was enough difference between them. I don't know. Someone's going to have to correct us here.\n Two has two versions. chat is saying interesting. Okay.\n Yeah. Okay. So, maybe I'm right.\n I like that we're starting with all like all the games around the edges before we get to like the core stuff cuz then what are you about to say?\n Well, I just want to make sure we're not missing anything here cuz obviously there's Metal Gad 1 2 3 4. Mhm.\n Beast Walker. Um but there's a couple that I just don't know if he worked on or not. Did he work on Ghost Babel? The Game Boy Color War?\n No, I don't think he did. I think he work on Acid one and two. No, I don't think he did. That one I'm less confident in. Revengeance.",
            "start": 736.96
        },
        {
            "text": "No, I don't think he did. I think he work on Acid one and two. No, I don't think he did. That one I'm less confident in. Revengeance.\n Do Can we read the Can we read Can we read the lead to No, he didn't work on Revengeance. It might have been like he signed off. He gave his blessing. Can we read the lead? Does Matt say?\n Sure, we can read the lead. Okay, here. Uh, let me open up the article",
            "start": 780.56
        },
        {
            "text": "Sure, we can read the lead. Okay, here. Uh, let me open up the article\n from Matt. I was going to say Matt Piscatellum. Uh, Matt Kim. With the release of Death Rating 2 on the beach, Hideio Khojima enters his fourth decade in game development as a director. While the celebrated aur has spent the majority of his career so far working on the Metal Gear series, Desrating 2 sees him expanding upon his newest universe where he both introduces new concepts and revisits some of its most enduring ideas. With a truly staggering list of credits in his most impressive in his impressive resume, there's no better time to revisit every genreing adventure Kojima has taken us on. Here's every Kojima game that he is that he directed or designed.\n Okay,\n ranked from worst to best. Okay.\n Directed or designed?\n So Chad's calling out that he was executive producer on Acid and gave his blessing on the So I say we leave those out. Producer on Ghost Babel. Yeah.\n I think he's producer on anything that has",
            "start": 797.68
        },
        {
            "text": "So Chad's calling out that he was executive producer on Acid and gave his blessing on the So I say we leave those out. Producer on Ghost Babel. Yeah.\n I think he's producer on anything that has\n Mel. No, I wouldn't put those in there.\n Zone of the Anders.\n Zone of the Yeah, that's where I was going to take it.\n I'm typing these things down. We can I don't It's It's the weird thing of I don't have much opinion about the arrangement of these games that we're listing so far. Yeah, we'll just get them there.\n Zone of the Enders one and two. Would it be possible to see how many titles are on the list without spoiling it for yourself?\n Kevin, could you check to see how many number or how many like what's the first number?\n 12.\n 12. Okay,\n we must be close.\n Well, I just tied down seven games.\n Does that include the\n And that doesn't even include the second Metal Gear 2,",
            "start": 839.76
        },
        {
            "text": "12.\n 12. Okay,\n we must be close.\n Well, I just tied down seven games.\n Does that include the\n And that doesn't even include the second Metal Gear 2,\n which might not be him. There's no way cuz then we're talking about five Metal Gear Solids. We're talking about Peace Walker, right?\n Does ground zero count as a separate thing? I would\n I would count Ground Zero as a separate game. It came out like a year before uh Phantom Pain.\n God, it was so good.\n Ground Zero.\n Yeah, that was a fun one.\n We must be missing We must be doing There's something off with this list if there's only 12.\n What was his official title on Zone of the Anders?\n That is a good question.\n That's where I think we really start getting into like what are we talking about?\n Yeah. All right. All right. Well, then let's lock into like what we know are going to be the main ones here.\n Yeah.\n So, we got the Metal Gear Solid franchise and we have the Death Training franchise and we have PT.",
            "start": 874.64
        },
        {
            "text": "Yeah.\n So, we got the Metal Gear Solid franchise and we have the Death Training franchise and we have PT.\n I think those are the three pillars. Those are the three main pillars of Kojima.\n Yeah.\n Wow. A lot of games.\n How many were How many were on the list?\n 12.\n Oh, [ __ ] What do you guys think?\n Do you want me to paste in? I'm below you typing stuff in. I can toss in the rest for you.\n Oh, yeah, sure. Um, what do you guys think they go for top three? I think Molar Solid 3 is in there.\n I mean, let's have this conversation first.\n Uhhuh.\n Is Death Stranding top three? No. No.\n Cuz I feel like where we place Death Stranding is going to\n top three.\n Really? I think so.\n We're talking We're guessing IGN's list.\n Yeah. Yeah.\n Yeah. I don't think so. I don't think it's complete enough,\n dude. If Death Rating, Here's the thing. If Death Rating 2 was out by this list, I would say Death Rating 2 is top three. Death rating one is not top three.",
            "start": 925.2
        },
        {
            "text": "dude. If Death Rating, Here's the thing. If Death Rating 2 was out by this list, I would say Death Rating 2 is top three. Death rating one is not top three.\n Death rating one might not make it above a like any core Metal Gear Solid. They said there was 20 games on this list. Yeah, PT. I love it. And it definitely was like a cultural moment.\n Yeah.\n But I don't You can't put that above so many of the Metal Gears. Can you put it above five?\n I No. No. I don't think Personally, I don't think you can put it above any.\n Personally, I wouldn't put it above five. any of the Metal Solids,\n but I think IGN could. That's my thing. Five.\n I know Matt Kim. I've talked to Matt Kim. He's got really great hair and glasses. I could see him being one of those guys.\n One of those guys.\n I think PT is one of those ones where they're going to want to make a statement.\n Yep. Yeah.\n I think that's one of the headlines of us talking about it.",
            "start": 969.2
        },
        {
            "text": "One of those guys.\n I think PT is one of those ones where they're going to want to make a statement.\n Yep. Yeah.\n I think that's one of the headlines of us talking about it.\n Now, granted, it's a full Kojima list and so like you put PT above\n Well, now you have to ask yourself, is it there's 12 games on the list? We have at least 15. Is is there one below that? No, 15 is what we've listed right now. Not again, I don't know what we've zone of the enders.\n That's my thing is I think you end up cutting maybe we don't know something about the direct the direct director for like Zone of the Enders or something, but I think at the very least like BT is going above the Metal Gears Metal Gear games like the OG Metal Gear games.\n Yeah, I think so. Yeah. Yeah. Yeah. Yeah. Yeah.\n What about Baktai? I don't I remember it. I never played it.\n I didn't like it.\n But he was director on that, right? That was a big deal, right?",
            "start": 1017.6
        },
        {
            "text": "Yeah, I think so. Yeah. Yeah. Yeah. Yeah. Yeah.\n What about Baktai? I don't I remember it. I never played it.\n I didn't like it.\n But he was director on that, right? That was a big deal, right?\n Yeah. I want to say Yeah. I remember it was I remember it being I was such a Metal Gear guy and then Game Boy Advance he now he's doing this thing that involves sunlight.\n It's funny because I feel like Zone of the Enders one was him but then two wasn't directing and I don't know why I think that two's better than one. I can tell you that. So we could rank it that way\n for Zone of the Enders.\n Yeah,\n fair enough. We got we got our first confident placement here. I Here's what I'm trying to think. Are the top five just Metal Gear Solidas one through five or is there a wrench in there?\n See, I think that's why PT is gonna be up there.",
            "start": 1053.12
        },
        {
            "text": "See, I think that's why PT is gonna be up there.\n Yeah, I think I think Matt Kim would have stepped back, taken a drag off his long cigarette. He's got a really cool cigarette. I don't know if he smokes, but like I got to make this cooler. I I personally I think the reality is Metal Gear Solid one through five should be one through five. I say that as not a guy. So if you guys want to fight,\n do you mean that in order? No, just as far as like the order I think that obviously is going to be the I mean [ __ ] peace walker should be higher than some of these metal gauge talks out there.\n Yeah. Well, I know you feel that way.\n I do feel agree with crazy dude.\n Oh, I mean well then you get into my personal preferences, but I mean like but I mean like BT is going to be higher than Peace Walker.",
            "start": 1096.4
        },
        {
            "text": "I do feel agree with crazy dude.\n Oh, I mean well then you get into my personal preferences, but I mean like but I mean like BT is going to be higher than Peace Walker.\n Here's what I would say that's going to be a bold statement. A lot of people are going to want to bite my dick off about it and go for it. I don't care. I'm the champion. See you tomorrow. Bite it at San Francisco. Metal Gear Solid 5\n is an incomplete game. We all know we know how great it is and how amazing it is and all these different things, but all the systems you loved of Metal Gear Solid 5 are in Peace Walker and it has an actual amazing story. So that's why I would right there. I'm going to throw Peace Walker above five. Thank you, Blessing. Listen,\n I love Five. This isn't me. I love these games.\n Yeah, but five had it though. You know what I mean? Wait, did we separate ground zero or uh Yeah, Ground Zeros from",
            "start": 1129.36
        },
        {
            "text": "I love Five. This isn't me. I love these games.\n Yeah, but five had it though. You know what I mean? Wait, did we separate ground zero or uh Yeah, Ground Zeros from\n I think when we're talking about 12 games at IGN, they're not separating these. I think we're wasting our time.\n That's a mistake. We're separating them.\n Call Mac him right now. Get him to stop buying these fancy cigarettes.\n But he's so fancy he doesn't even have a phone. You have to call someone else to talk to Mac him. You know what I mean? He's drinking liquor out of a plum right now.\n Yeah. The the problem with the Metal Gear games is it very much is such a personal thing that like I as long as none of the games are incredibly low on the list, it's like all right, I get it.\n What do we think is number one? Solid one.\n Three.\n Oh, [ __ ] You're right. It'll be three.\n It's got to be three. I'm gonna stay with my heart and say one. I'm gonna stay with my heart. They say one.\n Yeah.\n Matt can't be a bro.",
            "start": 1164.4
        },
        {
            "text": "Three.\n Oh, [ __ ] You're right. It'll be three.\n It's got to be three. I'm gonna stay with my heart and say one. I'm gonna stay with my heart. They say one.\n Yeah.\n Matt can't be a bro.\n It's got to be three.\n What do you think? If we're saying three, what's number two? If you're three and one, I think are the top one too. So, whatever. See, I think one is I think Well, I'm thinking of my list, right?\n Out of the core Metal Gear Solids, one is low lowest on my list. You're an idiot, but I love\n One is the lowest on my list.\n It Listen, it's innovative. It's the same way that we talked about Super Mario Brothers, the first one, where like it it did something. It was impactful. It was innovative and all this stuff, but like all the other ones just were better, dude. They were better.\n No,\n better stories.\n Two. Two. Yeah, two is better than one.\n I think two is going to be number two.\n Two is better than one.\n Two is not going to be number two.",
            "start": 1200.16
        },
        {
            "text": "No,\n better stories.\n Two. Two. Yeah, two is better than one.\n I think two is going to be number two.\n Two is better than one.\n Two is not going to be number two.\n I also think that was a solid two. I feel like I think that game is aged really well. Yeah, I a great game.\n Wait, stop. Please let him bet his shoe so he can't wear for the rest of the day. Just one. betting this blue [ __ ] Yeah, I I think I think it goes three, two, five.\n I think it goes\n one. The IGN list.\n I think Yeah, I think the IGN list goes Yeah. 321 and 321. Then it gets weird between five and four because they both have I think separate flaws.\n I think I think it's 3251.\n You think they put five? See, I think\n I think that the love for the gameplay of five, like the gameplay of five is so amazing.\n It is\n that I think that like it gets that extra boost,",
            "start": 1240.88
        },
        {
            "text": "You think they put five? See, I think\n I think that the love for the gameplay of five, like the gameplay of five is so amazing.\n It is\n that I think that like it gets that extra boost,\n but I I think there's just too much knocking for cuz I think the problem with this and where this conversation gets tough at this part is that we're talking about 510s in my opinion, right? Like I when I say that one is at the bottom of my list, I still love one. Like one I think is still a fantastic game. It's just a it's just we're comparing masterpieces to each other.\n Yeah, for sure. And I do think that with time, like to look back at all of these games, I almost feel like all of them age better. Like I think that we're even more fond of all of them than we used to be.",
            "start": 1283.92
        },
        {
            "text": "But I think I think when we're talking about in my and I think your prediction too, right, from going from three as number one and then two right under it, I think two has aged better than any like than any of the like older games in Kojima's catalog because of the subject matter. Like you go back and play two and your [ __ ] mind is blown by how ahead he was and all that [ __ ] And I think we've talked about that enough on the internet as far as like how predictive Cojima is that I think two over time has just gone up the rankings.\n Yeah. But it's still not three. I think three\n not not Yeah. It's not three.\n Three. People see three as kind of the best of both worlds in terms of mastering the gameplay of the old school style and also a standalone story.\n Yes. that is standalone amazing, but also when you add it to the grander mythos also amazing.\n And the boss fights, pretty much all the things that Metal Gear is known for, three just does.",
            "start": 1325.92
        },
        {
            "text": "Yes. that is standalone amazing, but also when you add it to the grander mythos also amazing.\n And the boss fights, pretty much all the things that Metal Gear is known for, three just does.\n Even though we've said this a million times, like I'm not a three guy. Like three would be the bottom of my list of the\n There you go.\n Now that's crazy.\n Taste man's got taste up here. You know what I mean? Can't win a game show down.\n But I can't wait. I can't wait for Delta. I'm hoping that that Well, this is back to the the blessing thing of we're talking about a bunch of tens.\n Yeah. Yeah, it's not like you're I I love this argument cuz you're talking about games that I [ __ ] love all these games, but it's like\n which one do I love the least? You know what I mean? Oh, great. You're doing some typing. You're doing some thinking over there. It look like",
            "start": 1368.8
        },
        {
            "text": "which one do I love the least? You know what I mean? Oh, great. You're doing some typing. You're doing some thinking over there. It look like\n I was trying to snatch. Yeah. Well, when we really start getting into it, like when we're Oh, beyond arguing what's going to IG going to do here, what are they going to do there? I I can't keep that all in the noggin. So, I had to start jotting it down.\n Chris text me that's crazy, Tiff. I get it. I Yeah. And I I know. Like the reality is, and this has always been true, I like Solid Snake better than I like Big Boss. This [ __ ] guy right here, Snake Big Boss. That's my guy.\n Snake,\n I'm right there with you, Tim.\n So yeah, for me, for my IGN guest, again, I'm trying to get in the head of Matt Kim, smoking the cigar, drinking the plum.",
            "start": 1402.24
        },
        {
            "text": "Snake,\n I'm right there with you, Tim.\n So yeah, for me, for my IGN guest, again, I'm trying to get in the head of Matt Kim, smoking the cigar, drinking the plum.\n Number one, Metal Gear Solid. Number two, Metal Gear Solid 3. Number three, Metal Gear Solid 2. Number four, Metal Gear Solid 5. Number five, PT. Number six, Metal Gear Solid 4. Number seven, Death Stranding. Number eight, this is Matt Kim speaking, not Greg Miller. Metal Gear Solid Peace Walker. Number nine, Metal Gear. Number 10, Metal Gear 2. 11, Snatcher, 12 piece police knots, but honestly, those are interchangeable as games I don't know anything about.\n I think that those end up higher than the OG Metal Gears. I think the OG Metal Gears are probably You think they start the list? I thought or you know what I mean. Yeah, they start the list at 12.\n I think so.\n I thought about it, but\n Snatcher Police Knots.\n Did you ever play them?",
            "start": 1430.72
        },
        {
            "text": "I think so.\n I thought about it, but\n Snatcher Police Knots.\n Did you ever play them?\n No. Okay. Uh but I they are the type of like cult classicy games. I just don't know how big those cults are.\n Yeah.\n So,\n I hear you on that. I hear you on that.\n That's the weird part of this list. I think when you get to the non middle when you let's be honest for all of us at the table really it starts at Metal Gear Solid, right?\n Yeah.\n So, I think that for us in our knowledge bases in what we do, which is actually fascinating.\n Mhm.\n I should go back and play police knots and snatcher and buckai.",
            "start": 1471.28
        },
        {
            "text": "Yeah.\n So, I think that for us in our knowledge bases in what we do, which is actually fascinating.\n Mhm.\n I should go back and play police knots and snatcher and buckai.\n I So, I've I've now made my own list in the way that Greg did in trying to predict this. I think for IGN I think number one is going to be Metal Gear Solid 3. I think number two is going to be Metal Gear Solid 2. I think number three is going to be Metal Gear Solid 1. I think number four is going to be PT. I think number five is going to be Metal Solid 4. Six is going to be MGS5. Seven Peace Walker. Eight Death Stranding and then the rest. I don't really know the ordering but then you have the rest of the games.\n I think Death Stranding is going to be a little higher looking at this like looking at your list.\n Yeah, you had it at eight. Okay. I think it'll be higher than Peace Walker. I also think it it\n I think Metal Gear Solid 4 is going to get hate.",
            "start": 1492.72
        },
        {
            "text": "Yeah, you had it at eight. Okay. I think it'll be higher than Peace Walker. I also think it it\n I think Metal Gear Solid 4 is going to get hate.\n Oh, you know what? You're right. Death Stranding I think is going to be above at least a Metal Gear Solid thing\n and\n I don't think it's I I feel like statement wise you don't put it at the bottom of those.\n Yeah,\n if you like Death Stranding\n four just gets so much hate, man. And I love it so goddamn much. But it is flawed.\n That's the thing is like it's funny you chat earlier was like nobody's mentioned four yet. Like\n I think the fun thing about predicting an IGN list is I think an IGN list is probably the closest to popular opinion some at least you would imagine I know sometimes they throw curve balls in there but like for me I'm trying to predict what does the world like what does the audience",
            "start": 1534.08
        },
        {
            "text": "I yeah I when we do [ __ ] list for the different websites and stuff I always do feel that IGN's is the one typically that is the most representative of the most gamers and also feels like they put a lot more editorial thought into it. So like there's it feels like there's more discussions and more people involved in like making sure that\n they stand by it. So it feels more like official even though these are just opinions.",
            "start": 1577.36
        },
        {
            "text": "they stand by it. So it feels more like official even though these are just opinions.\n It's the way like I when I think of like when I go to a Polygon for review versus an IGN for like a video game review. I think of Polygon being more like editorial critical like you're you're trying to make statements whereas IGN I think is trying to inform buyers. is trying to inform like public who like the wide mainstream audience. And so I think when you're making an IGN list, you kind of think in that way of like okay a million people are going to read this. How am I going like how do I want to inform a million people what the correct ordering of the middleear games or hideima games is going to be.\n Four is my favorite personally.\n Wow.\n But I understand that it's but I am always a fan of when they pull off the end.\n You know what I mean? like like of Endgame and all that stuff.\n You got to play Death Rating 2. Death Rating 2 might be your second favorite. I showed him.\n Yeah.",
            "start": 1599.84
        },
        {
            "text": "You know what I mean? like like of Endgame and all that stuff.\n You got to play Death Rating 2. Death Rating 2 might be your second favorite. I showed him.\n Yeah.\n God, it's so good.\n Pretty cool.\n And like you showed him like like you showed him like 20 minutes. It was like hours. All right.\n Um before we get into it, is there anything left on the table that we want to talk about? Any more predictions?\n I I maybe I'll have the egg on my face, Greg, but I just don't think PT is going to be that high. I don't see a world that IGN puts PT above Death Stranding. See, I have it. Oh, I like this conversation cuz like I think PT has the legend status. You know what I mean? Like\n it could have changed horror games forever.",
            "start": 1644.0
        },
        {
            "text": "it could have changed horror games forever.\n Yeah. Like I think there's the what could have been. It's like this is a bad example, but it's like we hold up Tupac, you know what I mean? Cuz like we we we got those classic albums and then like we see the potential of like man if he was still around like he could have done this, this, this, and this. Even though like Tupac could have released stinkers afterwards, you know what I mean? Like but he didn't.\n But he didn't. But like we look we look back on Tupac and Biggie different. I think PT Tupac and Biggie. You're you're not wrong. You're definitely not wrong. But I do think that while that's true, Death Stranding was for years\n a game that's like, okay, Cojima, is this really a game? Is this really happening? And then is this really just deliveries and stuff? And then it came out and people loved it. So it's like they pulled it off. They pulled off the impos. They created a new genre. Should we have connected?\n The strand game.",
            "start": 1686.56
        },
        {
            "text": "The strand game.\n The strand. The\n strand game.\n I feel like like that's that is kind of like seeing it through to the end in a way that like I can't believe how successful that strategy is legitimately.\n That's a Yeah, that's a great way of putting it.\n We're going to hop in to the IGN list, but first I want to tell you to hop in over to patreon.comfunny and youtube.com/kindfunnyames where you can get the kind of funny membership which allows you to get shows adfree. And speaking of ads, let us tell you about our sponsors.",
            "start": 1734.0
        },
        {
            "text": "This episode's brought to you by Cash App. We've all had those moments getting meals out with people that always end in some kind of awkward experience of having to figure out the least complicated way to just get it done or even after figuring it out. Have you used an app and ended up having to wait days for your money to finally show up? What if we could solve all of that easily? Cash App is a completely different experience. fast, easy, and safe, and a great way to receive and transfer money to family and friends. It's incredibly easy to set up. You just enter your phone or email and some other basic information. No bank account needed, and then there's no waiting around for days. It's your money. You shouldn't have to wait. We love using Cash App because it's fast, it's safe, and it just makes life way less stressful. For a limited time only, new Cash App users can use our exclusive code to earn some additional cash. For real, there's no catch. Just download Cash App and sign up.",
            "start": 1762.32
        },
        {
            "text": "makes life way less stressful. For a limited time only, new Cash App users can use our exclusive code to earn some additional cash. For real, there's no catch. Just download Cash App and sign up. Use our exclusive referral code kind of funny in your profile. Send $5 to a friend within 14 days and you'll get $10 dropped right into your account. Terms apply. That's money. That's Cash App. This episode is brought to you by Mood. Let me tell you about the online cannabis company that's revolutionizing how we deal with life's challenges. From sleepless nights to stress-filled days, Mood.com has created an entire line of functional gummies that target specific health concerns with 100% federally legal THC blends. They'll deliver them discreetly right to your doorstep, and you can get 20% off your first order at mood.com with promo code kind of funny. I've been having a great time trying out all their different gummies, and I'm loving how each one feels. Their sleepy time gummies will knock",
            "start": 1805.36
        },
        {
            "text": "first order at mood.com with promo code kind of funny. I've been having a great time trying out all their different gummies, and I'm loving how each one feels. Their sleepy time gummies will knock you out in about 15 minutes flat. No hangovers, no groggginess, and their epic euphoria gummies are perfect for those days when nothing's going right. And best of all, not only does Mood stand behind everything with an industryleading 100-day satisfaction guarantee, but as I mentioned, listeners get 20% off their first order with code kind of funny. So head to mood.com, browse their amazing selection of functional gummies, and find the perfect gummy for whatever you are dealing with. And remember to use promo code kind of funny at checkout to save 20% on your first order. What is the context for what you just said?",
            "start": 1850.8
        },
        {
            "text": "No, no, we can't. We'll talk about all that later. We'll talk about all that later.\n Fair enough.\n I don't know where he's getting his facts. I cannot further\n I don't know, guys.\n Uh before we get into this, I want to get into some super chats real quick. Um JBC O says, \"Going through Death Training One right now. The first two chapters were such a slog, but I've really come around on it in chapter three.\" Hell yeah. Uh Raymond writes in and says, \"I have a friend who thinks uh KJ is pretentious.\" Oh, Kojima. Kojima is pretentious despite loving most of his games. What are y'all's takes? And what should I tell him? One love.\n What should I tell him? Everything about this is [ __ ] art. I love you so much, Raymond. Here's the thing. Pretentious. Yes. And I think that's the point. Like sometimes like art",
            "start": 1896.48
        },
        {
            "text": "What should I tell him? Everything about this is [ __ ] art. I love you so much, Raymond. Here's the thing. Pretentious. Yes. And I think that's the point. Like sometimes like art\n is art is pretentious because Yeah. It's like because it has that level of like What is pretention, Greg? like the definition, you know. Yeah. No, I I it's rhetorical. Yeah. And I I think that's the point, right, of like",
            "start": 1926.96
        },
        {
            "text": "Hideokima is regarded in a far different light than most game directors you will ever hear of. And I'm I don't even mean like meet because obviously how many game directors will we all have the pleasure and honor of meeting. I mean just like the ones you hear of like Corey Barlo is not trying to make a Hideo Khjima game. Pedo is trying to make a very weird thing every time and a very specific thing down to the kind of energy drink Sam is drinking and the glasses he's wearing. You know what I mean? Like he is so in the [ __ ] weeds with the project that I think that inevitably makes it more personal and more a hideokima game which again I think alienates some people who don't aren't used to having someone that upfront. It's the same thing of a Kubri film or a Scorsesei film of like the name meaning something and then you oh I don't like Scorsesei or I don't like I don't get Kubric like Yeah.",
            "start": 1951.68
        },
        {
            "text": "Kim is trying to make something as you are was well reported and run this. He's trying to make something not everybody gets. Yeah.\n Yeah. I I went to the dictionary.com typed in pretentious attempting to impress by affecting great importance, talent, culture, etc. than is actually possessed.\n Yeah. So that's going to be in the eye of the beholder whether you think Kojima like his art lives up to what you think his art is trying to live up to.",
            "start": 2001.28
        },
        {
            "text": "I I I mean the thing is and this is getting God so into the weeds of the the our video games art what is art conversation. But I think at a certain point when your art is successful and monetized and then you are making more after that you're it's pretentious to begin with when you're making like creative artsy stuff and not just like sheer product [ __ ] you're still doing something that is coming from a a place of I mean at that point the privilege of having the resources and being able to be weird and I think that there's a level of pretention there from the jump I think I'm on the side of that I don't think I don't think I view Kojima stuff as pretentious but I I totally understand anybody does right I think his stuff presents pretentious but like when I play Melar and when I play death rating and when we replayed all the mealars I'm coming out of that being like, \"No, I got I think he attained those heights, but there are plenty of games that I think that are Last 2 I think is",
            "start": 2026.0
        },
        {
            "text": "rating and when we replayed all the mealars I'm coming out of that being like, \"No, I got I think he attained those heights, but there are plenty of games that I think that are Last 2 I think is pretentious, but I also love Last 2.\" Like, I think there's plenty of art that is in the eye of the beholder to whether or not you think that it lives up to the lofty things, but I think sometimes you need to aim high. Like you need to as an artist believe in like your own ability sometimes more than the ability you have to like push it in that way. And sometimes it's like cool. You might have you might think your stuff is better than it actually is, but because you do that still that gives your stuff quality. I don't know if what I'm saying makes sense, but",
            "start": 2073.68
        },
        {
            "text": "No, it does. It does. Thank And that's that thing where I mean even with our death training review, the pirates that I was like, I don't know about this or that. It's this hole, right, that they're making. He's making that. I'm like, well, but I'm arguing myself because I know what they're trying to accomplish in a way. When you talk to most video games, you don't understand what they're trying to do.\n Mhm.\n Yeah. Uh, Jay. Robert says, \"Koojima games are like a Greg Miller text message made to shock and awe and not everyone gets it.\"\n Sure.",
            "start": 2113.04
        },
        {
            "text": "Mhm.\n Yeah. Uh, Jay. Robert says, \"Koojima games are like a Greg Miller text message made to shock and awe and not everyone gets it.\"\n Sure.\n Uh, Senior Lullabi says, \"Kojima is the villain of the gaming industry.\" Uh, Two Street says, \"MJS franchise, Pokemon, God of War, and Persona are the games that I wish I could wipe my brain and play fresh. Those who are new to it are so lucky.\" I agree with that. Uh, and then, uh, let's do two more. One more from Recon Awesome. He says, \"I hope Peacewalker is ranked higher than five. Five not having a great story really brings it down for me. And then Demon Hacker said,\n \"As a Peacewalker fan, I I agree.\" And maybe the biggest fan I agree and I do not think you that's gonna happen. So I would not.\n Yeah. The problem with Peace Walker is it needs a loud defender and without Greg in the room, I don't think that it just I mean it was on the PS.\n Matt King was too cowardly to call me about",
            "start": 2129.6
        },
        {
            "text": "Yeah. The problem with Peace Walker is it needs a loud defender and without Greg in the room, I don't think that it just I mean it was on the PS.\n Matt King was too cowardly to call me about\n no matter what. It always just felt like a side thing even though it's not. Yeah. But just because it was on the PSP and even just like the way it's been HD remastered and stuff, it always just feels like a and this as opposed to like core.\n For me with Melar Solid uh fan and pain, I believe in two things. One, the story is incomplete and we all know that and we've seen the concept art and [ __ ] for chapter 3 and all that [ __ ] right? Uh and then two, I still think the story is great in Miller Sod 5. I I I think there's a lot of really good [ __ ]\n See, that's where I guess we differ is I do not like the story in five, even what's there. I feel like it's messy. I feel like it's it's more Death Stranding than it is Metal Gear in the sense of it's just it to me feels",
            "start": 2166.24
        },
        {
            "text": "just weird for the sake of being weird. Like that whole opening scene\n like I without spoiling it too much. I do not like who characters are.\n We don't need this in the in the franchise at that point specifically. But\n that's an interesting point. I guess we kind of get spoilery to a degree, but the the way they do everything makes in some ways five feel more like a spin-off than Peace Walker feels like. Exactly. And then one more from Demon Hacker who says, \"Peace walkers amazing story. Dude falls downstairs. AI the boss develop develops feelings. Snake fights like 30 big boring mechs.\n They sing.\n I need I need to go back and finish. I think I played like half of Peace Walker with you in 2020.\" No, I never finished it. Yeah. I need to bust out the PS3. All right, let's hop into the\n volume's coming, baby. And I'll gladly replay with you.\n I mean, dude, I'm down for that. Of course, this is by Matt Kim. Uh, it was posted June 20th, 2025 at 800 a.m. Pacific time.",
            "start": 2216.72
        },
        {
            "text": "volume's coming, baby. And I'll gladly replay with you.\n I mean, dude, I'm down for that. Of course, this is by Matt Kim. Uh, it was posted June 20th, 2025 at 800 a.m. Pacific time.\n Oh my god. Good to know. Why was he up so early?\n Starting with number 12.\n Number 12.\n Milker Solid 3. No. Uh, Police Knots. We got Police Knots at number 12, which makes sense. At number 11, we got Snatcher.\n Yep. Okay.\n All right. At number 10, we got Metal Gear 2.\n Oh, I Solid Snake. Which means Metal Gear\n at number nine.\n I hated the way that they looked in these games.\n Yeah.\n Like look at that.\n Easy looked in the box already.\n Yeah.\n The game is just right.\n One day they're going to remake it in 3D. You imagine? And they're going to be and I was let down.\n Oh man, we almost got there. Just the timeline's missing. Like just one little like threeyear gap.\n If Konami didn't [ __ ] over Kajjima, we'd be living out. Fix it. Konami. At number nine, we got\n Metal Gear Solid 4.\n Guns of the Patriots.",
            "start": 2260.96
        },
        {
            "text": "If Konami didn't [ __ ] over Kajjima, we'd be living out. Fix it. Konami. At number nine, we got\n Metal Gear Solid 4.\n Guns of the Patriots.\n Like, oh man, it's only good if you play through all of them, which means you did.\n The original Metal Gear is above four. That's [ __ ] crazy.\n I mean, that's crazy talk.\n It makes sense, does it?\n I think I mean, yeah, I think it does.\n Metal Gear one again. What?\n Four is my favorite, but like\n I don't know. I feel\n I'm gonna I'm not going to look ahead. I'm going to scroll. I want to read read the Yeah. Did Matt say like how they're ranking it and why they're ranking it?\n I I read all the I think\n Oh, that was everything you did. Okay. Sorry.\n Yeah, that was everything that I that um I read was before\n every genre defining adventure you're taking. Here's kind of here is every game ranked from worst to best. Okay,\n give me a little bit of the the reasoning.",
            "start": 2320.24
        },
        {
            "text": "every genre defining adventure you're taking. Here's kind of here is every game ranked from worst to best. Okay,\n give me a little bit of the the reasoning.\n Uh Metal Gear Solid 4: Guns of the Patriots was originally designed to be the finale of the series, capping off the Solid Snake story line with a bang. This mega budget PS3 exclusive was released in '08 and set a techn technological benchmark thanks to its breathtaking graphics and cinematics. Snake is back, but this time he's aged significantly. Uh, I'm going to skip forward. Despite being dramatic, despite being the dramatic final act in an iconic game series, Metal Solid 4 also represents Cojima indulging in some of his worst creative tendencies. While the plot ties up a lot of loose storylines and gives Old Snake a hero's farewell, the majority of cutscenes border on self-parody, including one character's constant need to find a toilet. And Cojima in general seems",
            "start": 2362.4
        },
        {
            "text": "All right, that's canon. All right, that's [ __ ] canon from middle gear.\n To Johnny,\n come on. Johnny didn't take the genomes. All right. Cojima seems too focused on his nostalgia for older games in the series, which has had which has an impact on the overall execution of Solid Snake's final tale.\n Yeah. So, look, I get it. They're making a point. I don't agree with the point. I like the nostalgia and that's why it's my favorite, but I also am not surprised that it's the lowest one.",
            "start": 2410.16
        },
        {
            "text": "Yeah. So, look, I get it. They're making a point. I don't agree with the point. I like the nostalgia and that's why it's my favorite, but I also am not surprised that it's the lowest one.\n They also go on to say there are a lot of big gameplay ideas here that aren't fully fleshed out perhaps due to technological limitations. Some of these mechanics like the active camo would finally be refined in Meler Solid 5. I I here's the thing because I think I I had this thought maybe we talked a little bit about this in the Death Raining 2 review where I think gameplaywise the Metal Gear Solid franchise is really interesting cuz like I think the third person shooter gameplay of Metal Gear Solid 4 kind of lets it down a little bit but like everything around it does bring it up for me. Whereas like gameplay-wise it doesn't get better than Metal Gear Solid 5.",
            "start": 2427.2
        },
        {
            "text": "Yeah. But like I mean and this is always a hard conversation to have when we're doing lists comparing them directly, but like did you feel that way when it came out? Cuz I remember playing this on PS3 and the third person shooting I was like god damn this feels so good and like comparing it to the active camo of like laying down and the floor thing. It's just like man. But I think it's how that interacts with the stealth. And then like when I think about the boss fights, I I like the spectacle of the boss fights in MGS4, but like\n they were kind of the same as they are in Destiny 2 where you're just shooting at these things.\n Shooting or Yeah.\n Yeah.",
            "start": 2471.52
        },
        {
            "text": "they were kind of the same as they are in Destiny 2 where you're just shooting at these things.\n Shooting or Yeah.\n Yeah.\n And I also that falls into the conversation we were having, right, of like does Kajjima still have it when it comes to boss fights and the fact that like this is for me the one where it is like yeah the beauty and the beast but it's like there was a octopus lady and there was somebody who was like they had a psycho. Beauty and the Beast was the biggest let down because like God, the coolest name ever, the coolest idea ever, and just like ah the followrough of it just was not\n ideal.\n Exactly. At number eight, we got Metal Gear, the original one.\n Okay,\n that's crazy that it's above four. At number seven, we got Death Stranding. Oh, okay.\n So, we're to the top six, which gets interesting.\n Okay, shout out for Peace Walker making it into the top six.\n Not getting bumped by Death Stranding. There was a conversation we were having before we went with that one.",
            "start": 2499.84
        },
        {
            "text": "Okay, shout out for Peace Walker making it into the top six.\n Not getting bumped by Death Stranding. There was a conversation we were having before we went with that one.\n Do you think we see PT or Peace Walker next?\n Peacewalker. I still think PT I mean my boy my prediction list is PT at least five\n if not higher. And I think it could be higher. Everybody PT might not be on the list.\n [ __ ] that. It's got to be on the list.\n Matt Cam I'll drive to your house.\n At number six, we got Metal Gear Solid Peace Walker. All right. So, we're that at the top. It's one of those where I like I'm angry about it, but at least I'm happy that it's it's higher.\n Yeah, who cared about this [ __ ] game?\n I'm at Kim now. I work out. You know what I mean?\n Does he work out?\n No. Now, the voice I was given made him sound like a [ __ ] meatthead, I thought. So, I was like, now I've changed my perception of\n number five. I like his building.\n At number five,\n out of his plum,",
            "start": 2543.12
        },
        {
            "text": "number five. I like his building.\n At number five,\n out of his plum,\n we got We got to scroll for this one. Melar Solid 5, the Phantom Pain plus ground zero. [ __ ] off.\n [ __ ] off, man.\n Those are two different entries and ground zero alone should be top eight. Huh? Okay.\n Again, like I get it. I feel like this placement makes sense for this game.\n Yes. Yeah. Again, I think that the Let's talk about the legacy of Metal Gear Solid 5, right? And I think the legacy is oh, the gameplay was so good and you're back to But what were the boss fight memorable? You know what I mean? There's the\n the flaming man. Yeah, the skull phase.\n There's kicker. There's the kicker at the end of philanthropist the story quiet. Everybody remembers Quiet, of course. Maybe for good, maybe for bad, but you remember Quiet, right? But like that's the thing where it's like you remember the gameplay being so [ __ ] good.",
            "start": 2587.68
        },
        {
            "text": "But and I always reference the burger thing from Miller, but like like it's like what do you remember outside of that?\n I remember the vibe. I remember the music.\n The vibe for sure. The soundtrack. I remember\n filing out all your your giant things of chemicals. There being like a disease that's spreading and you having to figure out like, \"All right, what the [ __ ] is causing this?\" and it's like, \"Okay, that's pretty cool.\" And then I remember like\n there was like a scene in chapter 2 that got real [ __ ] up and real kind of bad for people that I was like, \"Man, this [ __ ] [ __ ] rocks.\" But also, you finish it and it's like,\n \"Where's the rest? Where's the rest of the story?\" Which is always the kicker for this one.\n Dorse never forget the horse.\n Diet was was quiet one of those things.\n Diet. At number four, we got PT. All right. All right.\n So, we're to the top three. Any predictions here? I'm going I'm sticking with my original one.",
            "start": 2641.04
        },
        {
            "text": "Diet was was quiet one of those things.\n Diet. At number four, we got PT. All right. All right.\n So, we're to the top three. Any predictions here? I'm going I'm sticking with my original one.\n I'm sticking with mine, too. Metal Gear Solid at one. Metal Gear Solid 3 at two. Metal Gear Solid 2 at three. Oh, I see. So, you're saying MGS1 at number one.\n I think Metal Gear Solid one takes it at number one. Three, two, one. I agree. So, I think at number three, I think we see Metal Gear Solid one. Number two, I think we see two. Number one, I think we see three.\n I think so. At number three, we got Metal Gear Solid 2. Sons of Liberty. Is that different from everything that we said?\n That's what I have. I have Metal Gear Solid two.\n Oh, you have it at three.\n I have two. I I go two, three, one. Go count. So, next in my list, next should be three and then one should be one.\n That's wild. Okay. At number two.\n Well, again, like I mean,\n I do get it though.",
            "start": 2675.6
        },
        {
            "text": "Middle two is another great game with a lot to say about where we actually are. again Kajjima very he really sees things right but there was the whole thing of the switch to Raiden leaving a bad taste in your mouth for me like when I think of Metal Gear Solid and I shut my Metal Solid 2 I still see the tanker the demo disc off Zone of the Enders running it non-stop blah blah blah playing that being snake yet so like the Raiden and Big Shell stuff and all that jazz like I like but I didn't I mean in the grand scheme of things in games that I think are all tens or whatever like I didn't love you know what I mean like I would have rather been with Snake the whole time I would have and the sh I don't know like I don't know it's a weird one of like I remember running around that shell so [ __ ] much and granted this is the game that I always talk about like I platinum before platinuming was the thing every dog tag every ghost picture every everything on that memory card I did so it's like",
            "start": 2733.92
        },
        {
            "text": "much and granted this is the game that I always talk about like I platinum before platinuming was the thing every dog tag every ghost picture every everything on that memory card I did so it's like I know this game really really well in a way I don't intimately know other games where it's just like for some reason for me the Raiden stuff becomes noise at a point yeah and I get that especially when if you were there you know what I mean in the moment like that living it I do think that that was such a bait and switch uh I didn't play two until later and I knew about that. So,",
            "start": 2773.28
        },
        {
            "text": "to me, I was actually very happy with how much Snake we got even as Raiden, like just as like supporting character with you and like I enjoyed that dynamic. Um, but I I also just feel like we've said this a million times, but these games are it's so interchangeable and personal. Like one of the weird specific things you care about most cuz there's such an argument for Metal Gear Solid 2 of like it is the pinnacle of that style of the gameplay and like it being more linear and condensed into the the stealth.",
            "start": 2799.28
        },
        {
            "text": "I I think on top of that, I think there's something to be said about Metal Gear Solid 2 being a Metal Gear Solid game for people who are big fans of Metal Gear Solid. You know what I I think one and three, this goes back to what you said earlier, Tim, like three and one are both standalone to some extent. Like three and one you can recommend to anybody. Those are anybody's Metal Gear Solid games. Two, it's like you got if you're not that you have to be a fan, but if you're a fan of Metal Gear Solid, like two I think is peak in that way where it takes it all the way. It does the weird [ __ ] It does the switcheroo. It has really interesting, really weird story beats, a really cool cast of characters. But I think one and three for what they do with like all right, you're starting fresh with either Solid Snake or Naked Snake. We have a cast of like really cool villain characters. They're going to go through the boss fights. We're gonna go through a more traditional like straightforward",
            "start": 2827.76
        },
        {
            "text": "either Solid Snake or Naked Snake. We have a cast of like really cool villain characters. They're going to go through the boss fights. We're gonna go through a more traditional like straightforward story. Anybody can jump into those as their first Metal Gear Solid games and like fall in love with it. It was one of their favorite games of all time.",
            "start": 2865.52
        },
        {
            "text": "One of the things toss out too, and this is maybe a bit dramatic, so you're welcome to reel me back in guys, but somebody who lived through it, like Metal Gear Solid to Metal Gear Solid 2 was like Mario World to Mario 64. Like this was the game that like justified my PS2 purchase beyond belief of what? How can it look like this? What is going on? This looks photoreal. I'm shooting the melons and they're popping.\n Yeah. I I think that, you know, 24 whatever years later, like you still think of this as a nextgen game. Like I don't think there's many games that reflecting on it like are able to hold up that this is next generations later, you know?\n Totally. Totally.\n At number two, we got Metal Gear Solid 3.\n Wow.\n Snake Eater. What? This is a wacky list, man.\n Good job. Good job, Matt Camp. Which means that at number one, you got the original Metal Gear Solid.\n One started it all except for the two that came before, but you know what I mean.",
            "start": 2878.72
        },
        {
            "text": "Good job. Good job, Matt Camp. Which means that at number one, you got the original Metal Gear Solid.\n One started it all except for the two that came before, but you know what I mean.\n You know what? I'm not mad at it. Like going\n I am mad at it. I am mad at it. And I love one. I really love one. Uh\n oh, that's crazy. Kevin, go wide. Big boss is up right now.\n He's here.\n I don't know, man.\n What What What don't you like about this? I cuz I this to me is the like you don't put Iron Man number one on the MCU list like I and I feel like\n okay being super real about this like there's no when you just start making the arguments besides it was groundbreaking and you start just talking about like the story the gameplay like the like bosses all the things in it I don't know compare that to two and three I just feel like\n oh I think the boss more memorable\n than two boss are more memorable than two for sure",
            "start": 2926.32
        },
        {
            "text": "I also I mean like and there's something that's lost I feel for the I think Metal Gear Solid is that rare game for me where old game is old and all that [ __ ] but I can replay Metal Gear Solid anytime where I can go through and love that game and have that feeling again. And I think it is that Metal Gear Solid from one to two to three blah blah blah. Like Metal Gear Solid still feels different. Like it does like it is like yeah, sure it starts off these different things, but like sneaking past cameras and blowing up holes in walls and having to get the right key card to do that like there's a a a I'm a secret agent vibe to it that the other ones do lose where I I become super soldier and that's what I'm doing. like in a way that like the sneaking suit, the codec stuff like I mean that exists throughout but I don't think it gets better than here. I also think Metal Gear Solid, and this is to your point as well, Greg, I think it's one of a kind, right? No other game in the Middleear",
            "start": 2979.2
        },
        {
            "text": "exists throughout but I don't think it gets better than here. I also think Metal Gear Solid, and this is to your point as well, Greg, I think it's one of a kind, right? No other game in the Middleear Solid series plays like Metal Gear Solid. Like in the same way that you get that graphical jump that like this MGS2 is nextgen. Metal Gear Solid didn't get a game that's like Metal Gear Solid. MGS3 came through and it's like, okay, this plays similarly to MGS2, even though it's completely different setting and all that [ __ ] Um, I think for Melar Solid one being number one, the reason I come back around to it is it is like I think such a piece of pop culture like not just video game culture in the way that like you ask",
            "start": 3025.84
        },
        {
            "text": "True is man.\n But like you ask anybody about Meler Solid 1 that aren't even into video games and people remember that [ __ ]\n Yeah, but I I mean if you're going with that argument like way more people play it too. Way way way way way more people play.\n But I feel like I get more I get more like pop culture references to one than two. just psycho mantis, right? Like what else? Codec noise exclamation marks. How great.\n Those are from the older games, right?\n Yeah. I don't It's a weird I I love this. I I would rank one very high. I would rank one above two and three. Yeah.\n Um but both favorite and quality, but I just thinking\n grand scheme IGN list. Don't like that move.\n You did right, Mackim. Good job.",
            "start": 3063.36
        },
        {
            "text": "Um but both favorite and quality, but I just thinking\n grand scheme IGN list. Don't like that move.\n You did right, Mackim. Good job.\n Uh reading into the blurb a little bit. While the older Metal Gear games were laotted for their I lost my own narrative. Plum wise something I drink. I was I was saying he was drinking out of a plum. I was making a reference to the Simpsons uh when they're in the quartet and Barney has his Yoko Ono and they start which is a real reference to the Beatles. I don't understand. I just remember the Simpsons part of it. Hey everybody, it's Greg. You don't really wait. Never mind. I'm not going to get into it. While the\n Do you know that I mean Yoko and John? No. No. Yoko and John doing something with a hat and a plum floating in it.\n Oh, no. That's just I don't know. I thought you were saying you don't know who Yoko.\n No, I know who Yokoono is.",
            "start": 3096.72
        },
        {
            "text": "Oh, no. That's just I don't know. I thought you were saying you don't know who Yoko.\n No, I know who Yokoono is.\n Yeah. Uh, while the older Melgary games were laotted for their creative gameplay, 1998's Metal Gear Solid on PlayStation took that innovation and creativity to the next level at the time. Its cinematic storytelling techniques were considered second to none. Its interactive movie-l like presentation demonstrating Kojima's love and understanding of cinema. Uh, and then it goes on about the plot. But there you go. Congratulations to Metal Gear Solid 1. See, this is what I This is what I was talking I said earlier Matt was drinking alcohol out of a plum. This is what I was envisioning. A hat with a plum floating in it. How did we get here?\n Yoko Gag, you know what I mean? This is Greg doing it.",
            "start": 3132.96
        },
        {
            "text": "Yoko Gag, you know what I mean? This is Greg doing it.\n Uh guys, for [ __ ] list, usually we rank these lists or we rate these lists. Is it the [ __ ] or is it [ __ ] I Here's the thing. It's tough to [ __ ] up a Cojima list cuz it's the MCU thing of like you know what the top five are. like you know what the top what the cream of the crop are and then you kind of have tiers. I think they got the tiers right. I MGS4 is a wild one to me where I think having that game that low is kind of crazy but also I get it. I get not liking certain aspects of certain games and how that would get get you there. I'm going to say thumbs up. I think this list is good.\n I'll give it the thumbs up. Yeah. Mainly just cuz like we were talking about a lot of great games and a lot of the ordering of this is kind of just very very subjective. Um, I will say I don't want to give this like a two thumbs up because I just feel like there's no bravery here.",
            "start": 3170.72
        },
        {
            "text": "You know, they're not trying to say anything. And I I like when listeners try to say something. Here's the thing of like the reason one of the big reasons it's definitely not a two thumbs up for me is we got to have a conversation about PT above Miller Solid Fab. I get it. I get that PT is a\n I give this a two thumbs up. This is a great list.\n Two thumbs up.\n And I like I I'm excited to read through all the justifications. What is cuz I just started scrolling there. Did you see this honorable mention zone of the Enders in uh Baktai?\n Although not the director, Hideo Khjima is credited as the creator of Zone Avengers franchise. So, we thought it was worth a mention, too.\n Uh meanwhile, Kjima is also credited as creating Baktai, the Game Boy Advance action RPG about vampire hunting, blah blah blah.\n So, there you go. That's why they weren't there and why we were confused.\n Good shout out on that. I like scroll through because I was trying to get to the next number.\n I hear I hear you.",
            "start": 3225.36
        },
        {
            "text": "So, there you go. That's why they weren't there and why we were confused.\n Good shout out on that. I like scroll through because I was trying to get to the next number.\n I hear I hear you.\n Um but yeah, I don't know. I get that PT is Tupac in my analogy, but like [ __ ] Metal Gear Solid 5 JCole. Actually, no, that's a bad one. That's a bad one. Jake, because I love J.Cole, but nobody's saying JCole's Tupac.\n I want you to know the movie trailers, like you know, you you know how they use like slow down versions of like pop songs. We're at a point now that J.Cole's\n songs are are being used. Yeah. For the movie Strangers 2,\n the horror movie or She Knows.\n [ __ ] yeah.\n But it's like a slow creepy version. I'm like, \"Yeah, we made it, baby.",
            "start": 3262.16
        },
        {
            "text": "Let's go.\" Of course, this has been kind of funny games cast. Each and every weekday, we get together and talk about the biggest reviews, previews, and topics in video games live on YouTube, Twitch, and podcast services around the globe. If you love what we do, support us with the kind of funny membership on Patreon, YouTube, Spotify, and Apple Podcast. Get all of our shows ad free. Watch us record them live and get a daily exclusive show. Catch today's KHD on YouTube or podcast services. Uh, catch the big old stream that's about to happen over on twitch.tv/indfunny. TV/ kind of funny games. It's Ces Rand2. It's Roger. It's Mike. They're walking. And then tomorrow, we're going to walk on the Embaradero as Greg is throwing his parade to celebrate his championship win. Starting at the Ferry Building at 10:00 a.m. and going all the way to Square Pie, guys, by noon. That plan noon. All right. There you go. Until next time, it's been our pleasure to serve you. [Music]",
            "start": 3297.84
        }
    ]
}