{
    "id": 14332,
    "video_id": "jXRq6bT86B0",
    "show_name": "Gamescast",
    "hosts": [
        "Tim Gettys",
        "Nick Scarpino",
        "Andy Cortez",
        "Blessing Adeoye Jr.",
        "Mike Howard"
    ],
    "title": "Rematch Review, Dune: Awakening Review (So Far) - Kinda Funny Gamescast",
    "description": "Download Cash App Today: https://capl.onelink.me/vFut/7u0sm0fp #CashAppPod Sign up with our exclusive referral code KINDAFUNNY in your profile. Send $5 to a friend within 14 days, and you’ll get $10 dropped right into your account. Terms apply.\n\n*Referral Reward Disclaimer: As a Cash App partner, I may earn a commission when you sign up for a Cash App account.* #sponsored\n\nGo to https://mood.com and use code KINDAFUNNY to get 20% off your first order.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1750880963,
    "duration": 3883,
    "transcript_chunks": [
        {
            "text": "Hey, [Music] [Music] hey, hey. [Music] [Music] What's up and welcome back to the kind of funny games cast for Wednesday, June 25th, 2025. June 25th. That was the birthday of my best friend in elementary school who stole all my Pokemon cards and I haven't talked to him a day since. Oh my god.\n [ __ ] that guy.\n You're going to say he died.\n No, even worse.\n You know what? Fair.\n Even worse, I caught him cuz he was selling my Zapdos on the schoolyard.\n Oh, that happens to all of us.\n And I'm like, I knew that was my Zapdos.\n That happened to everybody pretending it wasn't. I knew it was mine. I knew where the crease was. I'm still I'm still best friends with my friend Carlos even though it you know when we were trading Pokemon cards in the dark while they were showing a movie. I think they're showing Twister on TV but we were all but we were all they're making you watch Twister.",
            "start": 2.48
        },
        {
            "text": "Yeah, it was like a science class but it was like substitute you know put on Twister science tornadoes or whatever. Uh and we were underneath a desk all trading Pokemon cards and I traded him some [ __ ] but I I was getting a holographic articuno lights come back on [ __ ] scratch and I was like dude this is so scratched. He's like, \"Yeah, deals. De deals done.\n Deals the deal. The deal in the dark, man. Can't take it back.\" Crazy.\n Andy, can you unplug your mic and plug it back in?\n Sure.\n Of course. I'm your host, Tim Gettys. I'm joined today by blessing Addio Junior. Good day, Tim.\n Snowike Mike.\n Good afternoon, Tim.\n Andy Cortez.\n Hello. Hello. Test test.\n Sounded okay. No, I think it might be Mike's. Mike, you plug. Sorry. We're trying to figure out which one it's doing. It right before we went live. It went ding and then\n back and live. Hello, Tim. Good afternoon. And this is Mike checking in with\n he's not doing it anymore. So hopefully that's it.",
            "start": 92.4
        },
        {
            "text": "back and live. Hello, Tim. Good afternoon. And this is Mike checking in with\n he's not doing it anymore. So hopefully that's it.\n So far so good. And rounding out the group, we have the producer/ seducer Nick Scarp.\n The shy hallude giveth and the shyude.\n Tell them tell them about it, Nick.",
            "start": 136.72
        },
        {
            "text": "This game's cast is a tale of two stories. I'll tell you that right now. We are giving our review of Rematch and a review so far of Dune Awakening. And oh my god, these boys have a lot of energy when it comes to Dune. And this boy right here has a lot of energy when it comes to Rematch. So, we're going to have a great time talking about a whole bunch of very cool video games that are out now. Cuz this is the kind of funny Games Cast where each and every weekday we get together to talk about the biggest reviews, previews, and topics in video games live on YouTube, Twitch, and podcast services around the globe. If you love what we do, please support us with the kind of funny membership on Patreon, YouTube, Spotify, or Apple Podcast to get all of our shows ad free and a daily exclusive show. For a chance to be part of this show though, please YouTube super chat. And if you have any questions about Rematch or Dune Awakening, please send them in and we'll get to them throughout the show.",
            "start": 148.0
        },
        {
            "text": "For a chance to be part of this show though, please YouTube super chat. And if you have any questions about Rematch or Dune Awakening, please send them in and we'll get to them throughout the show. Little housekeeping for you. We are an 11person business all about live talk shows. Games Dy's talking all about how Sony really won't be putting new firstparty games on PlayStation Plus day one anytime soon. After this, the boys are playing some Dune Awakening. Uh if you're a kind of funny member, today's Greg Ways 25 minutes about how unfair and unexpect and unexpected cancer is. Uh, thank you to our Patreon producers, Carl Jacobs, Omega Buster, and Delaney Twining. Today, we're brought to you by Cash App and Mood. But we'll tell you all about that later. Let's start with the topic of the show. Let's start with Rematch, a sports game developed by Slow Clap, who Nick, they're the creators of Sefue.",
            "start": 187.04
        },
        {
            "text": "Oh,\n very cool.\n Your favorite game\n and co-published by Keplar Interactive. In the game, players control one player on their team in an association football match from a third person perspective. The game was released on June 19th, 2025 for Windows, PS5, Xbox Series X, and S. The game is sitting at a 74 on Metacritic and attracted more than 3 million players and over 1 million sales already. Bless, you've been talking a whole lot about it, but you haven't yet given your formal kind of funny review. What would you give Rematch on the kind of funny scale?",
            "start": 235.36
        },
        {
            "text": "Oo, on the kind of funny scale, this is one I've gone back and forth on a little bit. Um, this is maybe the most fun I've had in a video game so far in 2025. Like, I'm just in love with it. I'm going to keep playing it as the year goes. Um, but I think reviewwise, this is one of those interesting ones of having to balance how much fun, how much enjoyment I'm having out of a thing versus like the launch quality and like potential I see in a thing and what it can do better and what I think it will do better over time. So, I'm going to land at an eight. For a while there, I was going to give it a 7.5, but I had a session last night where I'm just like, dude, I am having way too much fun with this game to be able to give it anything less than an eight. Um, starting with the good of it, it's giving you what you want out of Slow Clap. It has a really, really good art style. It is taking, I mean, a very similar art style that we already had in Sefue as far as like that like like the the",
            "start": 267.6
        },
        {
            "text": "giving you what you want out of Slow Clap. It has a really, really good art style. It is taking, I mean, a very similar art style that we already had in Sefue as far as like that like like the the Andy's more of an artist. you might have the better words for it, but like kind of the sharpness of like the character design and like the sleekness of the stages like all like kind of the animated nature of it. Like it hits like a really really good place as far as being so visually appealing. And I just love looking at this game. I love looking at the characters. I love the character creator even though it's like it's not that advanced. It's kind of bare bones, but like just the art style of it. I just love looking at the characters. It is such a visually appealing game. Um, but then when we talk about the gameplay of it, I described this game a while ago as um, you know, like Rocket League, we we we we call um, soccer with cars. This is Rocket League with people, right? And I I mean that",
            "start": 311.84
        },
        {
            "text": "about the gameplay of it, I described this game a while ago as um, you know, like Rocket League, we we we we call um, soccer with cars. This is Rocket League with people, right? And I I mean that in the best way possible of I think they hit the perfect middle ground between what you want out of a soccer game, but then what you want out of an arcade game and especially a game that is 3v3, 4v4, and 5v5, because those are the only modes that are available uh, in the game. It does the same beautiful thing that Rocket League does, which is it takes soccer and gives you, I would say, a more genuine soccer experience than you would even get from a FIFA, right? Like a FIFA in terms of gameplay, I would almost look at as like almost kind of like an RTS where you are zoomed out. You are, you know, passing, passing, passing, trying to line up your plays and do and do all",
            "start": 353.68
        },
        {
            "text": "fun to think about that way. But yeah, you're kind of right.\n Yeah. Whereas se or not sefue uh I want to call it fifu\n fifu",
            "start": 401.04
        },
        {
            "text": "rematch and in conjunction with that like I would say this about rocket league as well there's an element of when I'm playing these games where I feel more closely aligned with when me and Mike are playing wreck league soccer um where I am one individual right which you can do in FIFA as well but hear me out here right you're one individual the placement the physics the like you know passing isn't as magnetic as it is in FIFA Right? Like you are picking a direction and just like passing in that direction and praying that it gets to the person that you're passing to. That is how soccer works. Like when I'm on the field and I'm playing with Mike or I'm playing with the folks on our soccer team, I am like I might not see where somebody's making a run, but sometimes I'm like I pray somebody's making a run right now cuz I'm I'm passing this either way. I'm passing this either way. And like this game rematch captures that feeling so well of having to pay attent attention to your position,",
            "start": 407.12
        },
        {
            "text": "making a run right now cuz I'm I'm passing this either way. I'm passing this either way. And like this game rematch captures that feeling so well of having to pay attent attention to your position, your teammates's position. Um, and like the freedom that is involved with playing the actual sport. This game captures that uh so well. And I think the tools that they give you as far as like, you know, the square for that directional pass, the R2 to do your hard kick and then like, you know, R1 is the modifier and all these things, right? Like it really brings the the necessary bare bones mechanics you need to make this game really fun. There's no fat in this game. In fact, that's almost to a detriment where there's no like uh stats. There's no, oh, if I make a bigger character, they'll be more heavy. There's no RPG elements. Like, there's none of that.",
            "start": 449.28
        },
        {
            "text": "So, all characters play exactly the same.\n All characters play exactly the same. You are go going into each game on the same ground level. And it is way more just about your chemistry with your team and how you guys enter each match. Like, that's the thing that matters the most, right? And I love this game for that. I'm going to continue to love this game for that. I think as far as where the game I think falters, it comes down to the I think a lot of network stuff, you know, when we played the beta months ago, we noticed that there was a lot of lagging, a lot of like weird rubber banding, a lot of like the ball, you would think that you made a pass that was successful and then like the game would skip and then you would see the ball on the other side of the field and it's like, \"Oh, how the [ __ ] did that happen?\"\n One out of every four matches you were in Asia servers or European servers.",
            "start": 494.8
        },
        {
            "text": "One out of every four matches you were in Asia servers or European servers.\n Yeah. Um and granted that that stuff is better. like I'm not Most of the matches I'm playing run fairly well, but there's just still weird things as far as like when I am attacking a um an opponent player and like trying to get the ball and like I think I have it, but then like oh, it turns out I don't have it or like I make a catch as the goalkeeper and then it still goes in. I'm like, oh, something skipped here. That stuff still uh uh is here and like I think it'll get fixed over time. I hope it gets fixed over time, but that stuff still happens enough. And then also, I think this game has or could have such a bright future ahead of it. I'm going to predict that it does because there's three million players on this thing and has a mill over a million sales. So, I think it's going to be supported.",
            "start": 534.8
        },
        {
            "text": "And over the last couple days on Games Daily, we've been like every day pretty much like updating those numbers like they just keep getting more and more and more. So, they got a hit on their hands.",
            "start": 578.4
        },
        {
            "text": "And I think there's a lot of reasons for that. There's the love of soccer. There's the quality of the game. There's all that stuff. there's the Tik Tok virality of the game where I've been seeing clips of this game non-stop on my on my algorithms. Um, but it's hard not to compare this game to Rocket League. And I think one of the things that Rocket League did from the get-go was the content. Um, you had like single player stuff that you can do in Rocket League. Granted, it's not like there's a story or anything, but like you could play with bots in Rocket League and do like a mini season and stuff like that. So, if you didn't have people to play with, you could at least like have something to do. This game doesn't have that. This game really is 3v3, 4v4, 5v5, and then you have the 5v5 ranked mode. Um, and even with that, right, like I wish it was 3v3 ranked. That's the way I prefer to play, right?",
            "start": 586.24
        },
        {
            "text": "So, yeah. Can you talk about that a little bit more? Like, how does the game differ uh with three, four, or five players\n and what are you gravitating to towards the modes? Cuz I know\n when the beta when the multiple betas were out, we kind of experimented with all of the three, four or five modes, but I feel like we always kind of fell back on 4v4. Yeah,\n that being kind of the sweet spot.",
            "start": 626.8
        },
        {
            "text": "3v3 has been my go-to mainly because I touch the ball more mainly because it's like I'm way more in the action and I kind of I like I like the flow of 3v3. 3v3 it feels like you're playing 1v1 Smash three stock no items kind of situation where it is all right it is I'm I have two people that I have access to on Discord where I'm playing with my friend as I was playing with Eric as well and like we have our communication we know where to go. We know all these things, right? I wish they had a rank mode for that. They don't have a rank mode for that at the moment. They also don't have crossplay, but that's that's another conversation. Um 5v5, you have a bigger stage and it feels I think 5v5 feels the most like you're playing wreck league soccer where you're relying so much on your other team or on your other teammates to be where they need to be and deliver and pass and do all that stuff. And so like really it is a scale of how you want to play and how much you want to be directly",
            "start": 646.96
        },
        {
            "text": "team or on your other teammates to be where they need to be and deliver and pass and do all that stuff. And so like really it is a scale of how you want to play and how much you want to be directly involved um in the action there. It becomes such a cool management game of managing your your stamina and your your burst of energy because the game has normal sprinting and that's a normal stamina meter, but then every once in a while you'll have another meter that is kind of a super fast burst, right?",
            "start": 686.16
        },
        {
            "text": "It's called extra effort. Yeah. And when you when you pop that, that's when you um I think of like um it it just it is kind of the closest analog to why you know when I watch um you know the few times that I do watch soccer and they always there's always the jokes about how uh Messi is always just kind of walking around for a lot of the matches now that he's in his older ages in his older age but when he needs to go that's when all the effort is pushed in. And that's kind of like I think the coolest thing about Rematch and a game that I would be playing if we weren't in Arachus, you know, [ __ ] trying to fight the Shy Halude. I think Rematch is a game that I would be playing if it weren't for Dune Awakening or Liza P. Um because I had a lot of fun with it. But the thing that I love the most about it is the amount of spontaneity, the amount of of because you are one person and the game is so physics- based and it is not automated really in any way. it like it is so hard in this game",
            "start": 714.56
        },
        {
            "text": "most about it is the amount of spontaneity, the amount of of because you are one person and the game is so physics- based and it is not automated really in any way. it like it is so hard in this game I think so far to create a meta because the the because things are not onetoone because it is just so like you you can be as imprecise or as precise as you want with your passes or with your shots and when you know I I could see a lot of games that a lot of soccer games it may be a lot more sort of the FIFA variety where a meta is kind of created based on a character with stats or based on like team comp or whatever. There's none of that. It's just kind of can you be accurate with your shots. And there's no real there aren't a lot of ways to cheat the system, I would say. And I'm sure as we see more and more I've already seen Tik Tok clips of at the end of a match all four players standing in front of the goal. Like I've already seen some silly [ __ ] like that, which I could totally see",
            "start": 759.04
        },
        {
            "text": "more and more I've already seen Tik Tok clips of at the end of a match all four players standing in front of the goal. Like I've already seen some silly [ __ ] like that, which I could totally see slow clap stepping in and saying, \"Nope, at the end of the game only one person can be in goal and the other three players are invisible or like the ball will go through them, you know?\" I I I think one thing I love about it is that none of it is automated at all. It all feels very very like imprecise and that what that's what leads to sort of the magic of it where you there's no real way to exploit a whole lot of things in the game. And it's been fun seeing in real time people learning different mechanics and learning different tricks and learning different like I literally this morning I I get a message from who I've been playing with and he's like, \"Oh, dude, check out this Tik Tok that'll teach you how to do like these special passes and stuff.\" And I'm like, \"What the fuck?\" Like I",
            "start": 817.84
        },
        {
            "text": "get a message from who I've been playing with and he's like, \"Oh, dude, check out this Tik Tok that'll teach you how to do like these special passes and stuff.\" And I'm like, \"What the fuck?\" Like I thought I knew everything like, you know, and I've been seeing Tik Toks of like ways people have been kind of glitching the game. There's a way where you can like head the ball off of the wall to then start to like climb up in the air that looks like Rocket League that you're not supposed to do. Um, and that stuff is going to get patched and that stuff is going to get fixed. But yeah, you like there's not at the moment like what feels like a forming meta because there's not the stats because there's not like the different ways to go in and like have to like kit out your characters to do whatever, right? Like yeah, go with the fast go with the fast character cuz they you know you know there's nothing like that. You're not going with Bo Jackson in Techmobile or whatever.",
            "start": 856.32
        },
        {
            "text": "How approachable is it for somebody that is not familiar with soccer games at all?",
            "start": 897.12
        },
        {
            "text": "Oh, super approachable. Yeah, I think that's the nice thing about this being way more of an arcade soccer game where you don't have offsides, you don't have outs, right? like you're you're playing in a small stadium that are uh that have walls, right? And so like if you're watching the video version, you have you see like the background and like there's a city and all that stuff, but that's all I guess in lore projector or like video wall essentially, right? Like you can and you can kick the the ball off of that wall, which like you want to talk about meta or like the ways that people are building as they're playing, right? Like you have the thing now where you'll have two people running toward the goal and then the first person will essentially kick the ball off of the backboard like on like over the goal to like trick the goalkeeper and then it'll bounce to their teammate and then they'll kick it in. Like those are the kind of plays that people are making and doing which feels it",
            "start": 900.88
        },
        {
            "text": "like over the goal to like trick the goalkeeper and then it'll bounce to their teammate and then they'll kick it in. Like those are the kind of plays that people are making and doing which feels it feels so natural to the community kind of like learning and growing and trying to figure out the game and the best ways uh to play. Um, going back to some more critique stuff though that that uh that I have cuz you know we're talking about this game as something that is hopefully going to last long. When you log into the game now, they have a thing at the bottom that is like this is the start of rematch. We're hoping to build this game, you know, like or let us know your feedback. We're hoping to build this game into the future or whatever. And I totally feel that. And I think the thing that I would love to see more would just be a like better system for cosmetics and like just better cosmetics overall. It is such a pretty and such a goodlooking game, but the cosmetics they have I think are",
            "start": 935.04
        },
        {
            "text": "love to see more would just be a like better system for cosmetics and like just better cosmetics overall. It is such a pretty and such a goodlooking game, but the cosmetics they have I think are boring slashbad. Um, you look at the battle pass stuff that they have and it's like, oh, you can unlock new hairstyles, but the hairstyles are like basic hairstyles. They're not crazy things. There's stuff that should be in there by default. You know, you shouldn't have like one black hairstyle and then I look at at the battle pass and I'm like, \"Oh, but you have the other one right there. I gotta earn that. Like, I gotta buy that.\" And same for any other like if Andy wants like the, you know, the detached like mustache and beard situation. You know what I mean? like that should be in there by default. I don't think that should be a thing that you had to unlock. And so like stuff like that I'm not a fan of. Um most of the stuff I look through with the battle pass I'm like ah this shit's",
            "start": 973.28
        },
        {
            "text": "by default. I don't think that should be a thing that you had to unlock. And so like stuff like that I'm not a fan of. Um most of the stuff I look through with the battle pass I'm like ah this shit's boring. They have a thing where",
            "start": 1010.8
        },
        {
            "text": "when you score you can have your own um stadium design take over for a second which I think is cool except it then goes away afterwards. And so it's kind of just weird how that stuff works. Um, Rocket League, I know I'm going to make a lot of comparisons to Rocket League here, but like Rocket League from the get- go, I think, had such a good foundation of they had the flags and they had so many collaborations already. This game doesn't have many collaborations going on yet.\n You got to let me be a Transformers or something, man.",
            "start": 1020.16
        },
        {
            "text": "You got to let me be a Transformers or something, man.\n Give Greg a Ghostbuster. Rocky League launched with the Twisted Metal Truck on PlayStation. They had the kind of funny flags and like all these other YouTubers. Oh, sorry, Sweet Tooth. They had the Sweet Tooth truck. Um, they had like a bunch of flags from different creators and all that stuff, right? They had the different vehicles. Like there were so many I think foundational really good cosmetic and really good earnable stuff that they had from the get-go that in this game just feels is are either missing or just not as inspired as that. And I those are the things that I hope to see them uh build and add to. But man, I'm having so much fun here. Like I'm having such a good time. I mean, the coolest thing is this $30 game has sold 3 million\n sold over a million 3 million players on Game Pass.",
            "start": 1045.92
        },
        {
            "text": "sold over a million 3 million players on Game Pass.\n Oh, it's on Game Pass. Okay. So, I mean, either way, as this game continues to grow and get more popular C2, the Sefue sequel is going to be so Oh, dude. Dude, this is\n Get the money in there, boys.\n This is gonna fun.\n Just fun.",
            "start": 1087.12
        },
        {
            "text": "Get the money in there, boys.\n This is gonna fun.\n Just fun.\n And like, here's the thing, right? I'm such this game has now turned me into a slow clap sicko. I was already a sicko from Sefue, but now like as I'm playing this game, I'm like, \"Oh man, I could see a basketball game. I could see like a tennis game from these. I want a series of sports games from this developer cuz they got this stuff here. Like this is so fun. But at the same time, I do want Sefue, too. I do want those traditional uh soccer games. I also want more music in here cuz the music here sounds like it was ripped from Sefue. like they got like the I don't even know what I would call the style of music, but it's like a lot of drums, like the same drums I would hear as I'm like running through a level. Throwing a beer bottle at a dude's head. Yeah. And I'm like, \"Okay, well that's the same composer or whatever.\"",
            "start": 1103.68
        },
        {
            "text": "So, I would like to see uh stuff in that regard. Just a lot of like content stuff that I'm a little bit let down by.\n Yeah. It's not as content rich as you would hope, but I uh I mean I I think like it's got the perfect bones and just so much potential obviously. Yeah. Stupid question, but is there like a offense gameplay style and a defense gameplay style or are you always kind of playing the same? And following that up, is there a dedicated like goalie gameplay style or do you just run in front of the net to",
            "start": 1148.88
        },
        {
            "text": "Yes, there is a dedicated goalie play gameplay style. It's like other sports games where your controls uh change depending on if you're on ball or off ball. Um, and so like you know when you're on the ball, it's like square to pass, um, R2 to shoot, all this [ __ ] right? when you're off ball, there's like an L2 to like strafe around and like kind of lock in a bit more and like circle will either slide tackle or or do like a regular tackle depending on if you're sprinting or not. And then goalie. I I love One of the things I love about this game is that they do force you to have to learn how to play every position. Granted, there's only really three positions. It's offense, defense, and goalie. And whenever somebody scores, it rotates positions. And it just rotates where you start off. But the like thing that people do is like, well, I'm starting off as goalie here. I'm going to stay goalie. I'm not going to run out and be an [ __ ] and like leave the goal open cuz that doesn't help",
            "start": 1177.6
        },
        {
            "text": "the like thing that people do is like, well, I'm starting off as goalie here. I'm going to stay goalie. I'm not going to run out and be an [ __ ] and like leave the goal open cuz that doesn't help anybody. And so like as the goalie, I kind of like playing goalie cuz I'm [ __ ] locked the [ __ ] in. It is triangle to do like an air dive in a circle to do like a ground dive. Um, and you are sort of dictating the flow of the game for your team just like a real goalie in soccer. Like when Mike's playing as goalie, Mike really is the one who is you're setting the tone. you're giving the ball to Katie to then like take it down or like you know figure that out or you're seeing Eric open at the far end of the field and you're kicking it to him. You're making those same decisions here as the goalie. And so it's it is the most important role on the field and it is fun to play cuz it's not like regular soccer where um sometimes you might not even see the ball as the goalie. Like you might just",
            "start": 1216.4
        },
        {
            "text": "And so it's it is the most important role on the field and it is fun to play cuz it's not like regular soccer where um sometimes you might not even see the ball as the goalie. Like you might just be waiting because the other team is just not fighting back or whatever. Here you're you're involved like you're seeing the b the ball quite often. and you have to make those plays, make those saves and and stuff and it it's fun. Except me whenever I spawn as goalie after uh somebody scores and then it just randomizes and then I pop up as goalie. I'm always like, \"All right, somebody come get me.\" I'm like, \"Huh? Are you aged up when you respawn? Don't worry about it.\"",
            "start": 1255.92
        },
        {
            "text": "He's a seafood reference. That's a good joke. Great joke. Um when it does spawn me, I'm like, \"Somebody come I'm scared. I don't like this responsibility.\" Yeah. Somebody like switch out of me. And so when when somebody else hops into the goalie area, you see the UI change to then make to show that they're the goalie now. They have the the the the mechanics of being able to block with their h, you know, grab the ball with their hands or dive or whatever. And those capabilities are now taken away from you. Uh, and so there are moments where um when you're at the end of a game in a scramble and there's like the ball is just kind of like around your your net and there are moments of panic of like, oh [ __ ] I'm the goalie now. Why? It's because our goalie kind of stepped out to go try to get that ball and now it gave me the responsibility. Um, but it's Yeah, it's it's it's got so much potential and again, if it weren't for Arachus, I'd be playing the [ __ ] out of",
            "start": 1286.4
        },
        {
            "text": "I think this game is going to be a staple. I I think this game is going to be huge. I mean, we keep talking about the 3 million number. Um, but like I think that's just the start just based off of what I've been saying on social and based off of the fact that like man, people are studios who have the potential to do stuff like this. They're missing out by not making a soccer game. I there's so much love for soccer in the world and it's crazy that like we just leave it to FIFA because they have the or to EA Sports FC because they have the license slide have the license. Um, y'all, we got to get back to the era of arcade sports games. That's the plea I'm going to make to the games industry. We got to get back to NBA Street, FIFA Street, NBA Jam. Like, we got to get back to that era because there's [ __ ] there's there's water in that well. There's [ __ ] oil in these. Like, make some [ __ ] money. That's my review. Make\n seafood, too.",
            "start": 1341.04
        },
        {
            "text": "seafood, too.\n Give me Yeah, give me seafood, too, with twice the budget.\n Uh, so I saw someone in the chat. I think it was Joeli asking, \"Is the field too big?\"",
            "start": 1387.84
        },
        {
            "text": "No, I don't think so. um when the depending on if you're playing 3v3 or 5v5 like the field will shrink to that size and I don't think the field is too big at all. I think you might feel that a little bit at first because of the boost because when you use extra effort like you're not going to be able to run all the way across the field right when you're going back and forth. A big part of this game is managing stam stamina. But in my opinion that is part of the game is figuring out where to place yourself so that you you can recover the stamina and like be open for your goalkeeper. Sometimes I'm playing and I when I'm doing 3v3, I sometimes have to have full trust in my goalkeeper when I see the other team making a run because I'm like, well, if I chase them, I'm not going to have stamina to turn around and come back. And so, I'm just going to place myself here so I can recover and pray my goalkeeper catches the ball and sees me, hits me, and then I hit like I hit for the goal. I",
            "start": 1398.64
        },
        {
            "text": "to turn around and come back. And so, I'm just going to place myself here so I can recover and pray my goalkeeper catches the ball and sees me, hits me, and then I hit like I hit for the goal. I think that's part of the strategy. So, I I don't think the field is too big at all.",
            "start": 1439.68
        },
        {
            "text": "Cool. in terms of how the game's actually played. So, is it halves, quarters?\n No, it's just uh six minutes, five minutes.\n Oh, that's it.\n That's it.\n And it's whoever has the most points wins.\n It's whoever has the most points. There's also a mercy rule. So, if you're up by four points, then you automatically win as a team. Interesting. Okay.\n Are you having a lot of issues where people just if two goals are scored or are scored, they just piece out? No, but I I I think once three goals are scored, I sometimes like the goalie like you you do the first pass backwards and the goalie will pick up pick up the ball, turn around and just do like I'm going to score on myself. Get the [ __ ] out of here. Yeah. Like people might give up in that sense in the match. Give me the XP or whatever.\n I do think it is a sweet spot though where I think four goal mercy rule is just enough to where",
            "start": 1452.64
        },
        {
            "text": "I do think it is a sweet spot though where I think four goal mercy rule is just enough to where\n after four goals everybody's giving up. Like I I think that is the the spot where it's all right still a game. You still might have time sometimes toward the end of the match where there's 30 seconds left and you're down by three, it does turn into a all right, well, what are we doing here anyway? But you're not going to avoid that in these kind of games. Are they all human players here or are there any AI bots?",
            "start": 1495.28
        },
        {
            "text": "They're all human players. That's one of my my um downfalls with it is I I wish they had AI bots for if I wanted to play offline or if I wanted to like just practice with them or do whatever. Um, but it is all human players that you're playing with. All customized, too, except for an original character they have named Coach Gabby, who's like a a skin that you can unlock, who's just like a dude, a dude who's like probably like 40 years old. It's like a handsome 40-year-old man. What? Yeah, there's a Oh, let me tell you about the prologue to this game. Tell Wait, there's a story.\n There's a for like five minutes. Yes. for when you first boot up the game, they start you off as a dude who's just like you're practicing and like it's kind of their tutorial system. Okay. And it's but it's cinematic. You could tell this like oh the the seafue people like made a\n like give us something to do, man. Like",
            "start": 1518.16
        },
        {
            "text": "like give us something to do, man. Like\n like for Yeah. For a second I was like, is this going to usher in into like a single player like narrative story? And no, like you finish it and they're like, all right, just play matches.\n Go ahead.\n And I'm like, wait, is that the only cont like you like there's a menu item in the main menu that now that just says prologue? And I'm like, why is this a thing? Um, but I think in that prologue there is Coach Gabby and he's a character you can play as. And I I wonder if it's one of the developers or somebody they It's a really detailed character detailed character.\n Yeah. I'm like And you can just unlock him. And Ronaldo, you can\n That's great. I mean, I I was sold on this game uh just because of Slow Clap, but after hearing you talk about this, like I am definitely going to give this one a shot cuz this looks awesome and like it seems simple enough to wrap my head around where I'm not going to be like intimidated by it all. though.",
            "start": 1564.4
        },
        {
            "text": "Yeah, I'm like I'm I'm super down to have this little Discord going where uh uh Gary Widow really wants to get a squad going cuz like I I had so much fun with it as somebody who didn't really grow up playing soccer aside from like you know elementary school or whatever and somebody who only watches soccer when it's the World Cup. I I had so much fun with this and it is kind of the perfect middle ground between something like FIFA where I feel like it's I'm just not that type of gamer. Uh but then I look at something like Rocket League and I'm like how it looks Rocket League is so much more frustrating to me when like just angling the car. It feels like the the skill ceiling is way higher for that. And this is kind of that perfect middle ground that it also makes sense to me the fact that there's a crosshair to show you where you are kind of aiming and shooting and uh and and curving the shots or whatever.",
            "start": 1608.64
        },
        {
            "text": "And I I think there is something nice about I I compared a lot to Rocket League as far as the physics of it, but Rocket League is way more of a physics- based game because it is like how you hit a big old ball, right? And how it bounces and all that stuff. right here. It's It's less physics- based than Rocket League and I think it puts you more into the soccer mindset of I guess positioning and like essentially trusting in your teammates position and all that stuff, right? Like I and I like that for it. I I I This is the prologue.\n This is the prologue. I put it into assets and this is how the game starts and it's a [ __ ] cool start to to a game.\n So funny. And then it just teaches you the the mechanics and stuff and there's like a few cut scenes in between, but yeah. Brad. Awesome. Any final words on rematch?\n Um, let me tell y'all this to the rematch community. This is even part of my review. Learn to pass.\n Wow.\n Learn to let go of the ball, y'all. Give us the ball,",
            "start": 1663.04
        },
        {
            "text": "Um, let me tell y'all this to the rematch community. This is even part of my review. Learn to pass.\n Wow.\n Learn to let go of the ball, y'all. Give us the ball,\n y'all. First of all, get me the ball. I know what the [ __ ] I'm doing. But also, like,\n stop the Tucker.\n Stop being [ __ ] selfish with the ball. I know all y'all watched Blue Lock. Let me tell you, the Blue Lock community really into this game.\n Oh, of course.\n If you don't know what Blue Lock is, it's the soccer anime. It's actually pretty fire. I [ __ ] with it. Uh, but in that anime, they have these things called egoists. You know what I mean? Like, oh, you got to beat it for yourself. Everybody's a striker. Everybody wants the goal. Even if you're a defender, you still want the [ __ ] goal. All right. That's the blue lock mindset. You're an egoist. You're not from blue lock players.\n Yeah.\n You're not a [ __ ] anime character. Pass the [ __ ] ball.\n You're not the main character.\n You're not the main character.",
            "start": 1707.28
        },
        {
            "text": "I love passing the ball in this game. Like, when you when you nail a good pass, it's like, \"Oh, I crushed that.\" And even if you didn't even if that if the person I pass to didn't make the shot or they you know they hit it off the wall or the goalie caught it was like still feel really good about the precision because at first it takes a while to get used to the passing but once you kind of get the flow of it it feels really awesome to make some successful passes. I also do love the shooting mechanic because it is um when you're playing, if you press R2, it loads up your shot, right? But um the shots always go to where your camera is, which is different from like how a lot of other soccer games work where it's you just aim and click the stick and like you go that direction. Here it is like a first person shooter where you have to like look exactly Yeah. where the reticle is to like hit that shot. But then on I think the left analog stick once your shot is loaded, you can like add a",
            "start": 1753.92
        },
        {
            "text": "a first person shooter where you have to like look exactly Yeah. where the reticle is to like hit that shot. But then on I think the left analog stick once your shot is loaded, you can like add a curve to it. And so people be making some [ __ ] crazy ass shots where it's like, \"Okay, I'm gonna aim top right, but then I'm gonna curve bottom left to then create like a [ __ ] C right into the top over the corner of the goal.\" And like that [ __ ] it's so satisfying,",
            "start": 1793.28
        },
        {
            "text": "man. When it hits awesome.\n Oh, what a game.",
            "start": 1816.24
        },
        {
            "text": "What a game. Everybody check out Rematch. It's on Game Pass and available on PlayStation, Windows, and all that stuff as well. Uh after a quick word from our sponsors, we're going to talk all about Dune Awakening. But here's some ads. This episode's brought to you by Cash App. We've all had those moments getting meals out with people that always end in some kind of awkward experience of having to figure out the least complicated way to just get it done. Or even after figuring it out, have you used an app and ended up having to wait days for your money to finally show up? What if we could solve all of that easily? Cash App is a completely different experience. Fast, easy, and safe, and a great way to receive and transfer money to family and friends. It's incredibly easy to set up. You just enter your phone or email and some other basic information. No bank account needed. And then there's no waiting around for days. It's your money. You shouldn't have to wait. We love using Cash App",
            "start": 1818.64
        },
        {
            "text": "enter your phone or email and some other basic information. No bank account needed. And then there's no waiting around for days. It's your money. You shouldn't have to wait. We love using Cash App because it's fast, it's safe, and it just makes life way less stressful. For a limited time only, new Cash App users can use our exclusive code to earn some additional cash. For real, there's no catch. Just download Cash App and sign up. Use our exclusive referral code, kind of funny, in your profile. Send $5 to a friend within 14 days and you'll get $10 dropped right into your account. Terms apply. That's money. That's cash app. This episode is brought to you by Mood. Let me tell you about the online cannabis company that's revolutionizing how we deal with life's challenges. From sleepless nights to stressfilled days, mood.com has created an entire line of functional gummies that target specific health concerns with 100% federally legal THC blends. They'll deliver them discreetly right to",
            "start": 1862.56
        },
        {
            "text": "to stressfilled days, mood.com has created an entire line of functional gummies that target specific health concerns with 100% federally legal THC blends. They'll deliver them discreetly right to your doorstep and you can get 20% off your first order at mood.com with promo code kind of funny. I've been having a great time trying out all their different gummies and I'm loving how each one feels. Their sleepy time gummies will knock you out in about 15 minutes flat. No hangovers, no groggginess, and their epic euphoria gummies are perfect for those days when nothing's going right. And best of all, not only does Mood stand behind everything with an industry-leading 100-day satisfaction guarantee, but as I mentioned, listeners get 20% off their first order with code kind of funny. So, head to mood.com, browse their amazing selection of functional gummies and find the perfect gummy for whatever you are dealing with. And remember to use promo code kind of funny at checkout to save 20% on",
            "start": 1904.64
        },
        {
            "text": "to mood.com, browse their amazing selection of functional gummies and find the perfect gummy for whatever you are dealing with. And remember to use promo code kind of funny at checkout to save 20% on your first order. And we're back. We have a couple quick uh super chats about Rematch here. Christoph Chris Christopha says, \"Uh, where's Gary for this review?\"",
            "start": 1949.76
        },
        {
            "text": "I don't know. He's probably\n currently playing. I'm sure he's all about this game right now.\n And then Away7 says, \"While they got\n Ronaldo.\"\n Ronaldo.\n Ronaldino.\n Come on, Tim.\n Ronaldo, get some culture.\n Hope they keep the collabs coming with kids, etc. Need to add clubs to find friends and Mike as a commentator.\n Yeah, I need Will I need Will Ferrell from kicking and screaming in this game right away. Uh, do they have private matches? That's a big one for me, of course, is spectating.\n They have a private lobby with spectating.\n Private lobby with spectating. I haven't tried it out yet, so I don't know what spectating features they have, but like in the trailer or in some footage we were showing before, it looked like people were being shown from like an angle like almost a FIFA angle. So, that must be a spectate thing. Interesting.\n Um,\n what about the big green? The mean green. The big green. Yeah. Yeah, the big green. Yeah. Yeah. I love that.",
            "start": 1968.72
        },
        {
            "text": "Um,\n what about the big green? The mean green. The big green. Yeah. Yeah, the big green. Yeah. Yeah. I love that.\n I'm I I'm in like the the Mike mindset of like I want to figure out how to throw a tournament of rematch. Like I want to figure out like that's how much I'm into this is I want to figure out how to like do things outside of the game.\n Hold on, I have questions. So Ronaldo\n Ronaldo\n Ronald Ronaldo is a\n he's different from Cristiano Ronaldo.\n No [ __ ]\n Ronaldo is much like a decade prior.\n Unrelated.\n Unrelated.\n Whoa. He's from Brazil.\n Cool.\n Yeah,\n he was one of the goats.\n Good for them. Uh let's get to Arachus. Nick, let's get you off the bench. Dune Awakening. You've been playing the hell out of it. You're literally having nightmares about it. I I'll just say this.",
            "start": 2011.68
        },
        {
            "text": "Good for them. Uh let's get to Arachus. Nick, let's get you off the bench. Dune Awakening. You've been playing the hell out of it. You're literally having nightmares about it. I I'll just say this.\n We've all had that one relationship in our past, right? Where you just can't quit each other, but you know you should. And that is me right now currently with Dune Awakening. We start our playoff last night. We had a great time yesterday on the stream. I go, I'm just going to run and get this one stupid thing so that I'm not behind the guys. I hit quicksand. I die. Now Tim, of course, when you die in combat, you just respawn. quicksand\n with all of your stuff.\n Uhhuh.\n If you die to the desert, Tim,\n you give it back to the desert.\n You give it back to the rules. The desert always takes.\n We build back. There's quicksand right there.",
            "start": 2045.04
        },
        {
            "text": "Uhhuh.\n If you die to the desert, Tim,\n you give it back to the desert.\n You give it back to the rules. The desert always takes.\n We build back. There's quicksand right there.\n There's the quicksand. We build back better. The boys help me. We're We're crushing it. We do our final testing station. And all we have to do is traverse back through the quicksand and like a\n or just to the sand.\n To the sand. Like a smartass. I go, I'm gonna let Andy go first because if he gets caught, I'm gonna I'm gonna watch him and if he gets caught in the quicksand, I'll go a little bit left. But I let him have\n to do the walk.\n No, no. You Well, they don't actually have to walk in this. You have a It's too far. It's a sand bike that you get.\n You could slowly just jump\n and not alert the sandworm. Yeah. But if you're running, you see the meter making noise.\n Um,",
            "start": 2084.64
        },
        {
            "text": "You could slowly just jump\n and not alert the sandworm. Yeah. But if you're running, you see the meter making noise.\n Um,\n you hear it off in the distance. So, I see Andy. I let Andy get about maybe 50 50 feet ahead of me. And I start off not thinking that it's so far that once the worm comes up, Andy's going to make it to safety, but my dumb ass will be out in the middle of nowhere. And I I panic. Panic mode sets in. I turn around and I try to go right back. Hit the quicksand again. My [ __ ] my sandbike explodes. The Shy Holute eats me. I'm done. I can't play this game anymore.\n It's gone for like\n this game [ __ ] rocks. So fun. It's so fun. I I need you to\n here are the text that here are the text that came in after this. Can I read this?\n I publish your video and like\n you can publish it\n cuz you you you like deleted your VOD, right? Or\n Yeah. Yeah. It's cuz I like to jam the music.\n Oh yeah.\n Damn. Because last night was\n DJ Mike.",
            "start": 2117.84
        },
        {
            "text": "I publish your video and like\n you can publish it\n cuz you you you like deleted your VOD, right? Or\n Yeah. Yeah. It's cuz I like to jam the music.\n Oh yeah.\n Damn. Because last night was\n DJ Mike.\n Last night was one for the ages of Nick losing his stuff full wipe, right? um for the second time in a couple of hours, in several hours. And then it's like Nick's looking at the map and he goes, \"Oh my god, my loot is still\n my dead body is still in the middle of the desert. I can get it.\n I can go get my stuff.\"\n And Mike says, \"Dude, let it go.\" And he's like, \"Let it go.\" And I was like, \"No.\" So I make Mike give me one of his sandbikes, which by the way, you can't just, for whatever reason, the permissions on the sandbikes are like broken. So he has to break down his bike, give me the the things to build it. I build it back. I'm naked. I'm I'm buck naked.",
            "start": 2165.84
        },
        {
            "text": "Naked. I've got the got the sun beating down on my back, giving me a sunburn. But I make it out there strategically and everyone's watching at this point. Mike's streaming, but they're all streaming my stupid ass\n on Discord via Discord.\n So, we're showing his gameplay. I get out there. I've got Tim. I've got capacitors. I've got [ __ ] ironing. I've got spice. I've got all these things we just did from this mission. I get out there. I finally get out there. I get in the middle as the [ __ ] sandworm. I could hear him off in the distance. And as I hover over my stupid dead body, all there is is 200 of the basic ass scrub brush. The first [ __ ] thing you get in the game.\n And Mike laughs so hard at me",
            "start": 2211.44
        },
        {
            "text": "And Mike laughs so hard at me\n that I just I literally once we turned it off, this is what I get from Mike, right? 11:34 p.m. I'm dying. I'm [ __ ] dying. And then a gif of the sandworm eating me. And then realizing that I stopped reply to he goes, \"Nick, we will build everything back in you tomorrow. Don't worry about it. Andy's like, I'll give you a purple sword. I have other melee weapons. Mike's like, I got a purple gun. They're just texting me like checking in on me to make sure that I'm not\n Yeah.\n Oh, and I'm not okay. I'm not okay.\n I'm here to say I need the help.\n It I need it.\n It was uh It was a real rough one. This game kicks a lot of ass.",
            "start": 2250.96
        },
        {
            "text": "It's so cool. It's um I think my favorite thing about I I always tell Mike like my favorite thing about survival games is that first five to 10 hours of getting your you know finding your footing u creating your first house finding those early missions and I think the cool thing about Dune Awakening is the tutorialization is one of the better ones I've seen in a lot of tutori in a lot of survival games. It does a great job of uh doing player onboarding and early on you don't feel like you are constantly find this one rock and m mind mine these boulders to find that rock and the amount of times in other survival games u especially early on when you are mining it's like dude I found three of these goddamn things and I've been mining for an hour like what the hell right this game is so like bountiful in the the loot and the things that you are scavenging and mining. Uh I think that you it's essentially a lot less of a breathing down your neck survival game where you are, you know, a lot",
            "start": 2288.8
        },
        {
            "text": "bountiful in the the loot and the things that you are scavenging and mining. Uh I think that you it's essentially a lot less of a breathing down your neck survival game where you are, you know, a lot of other survival games you go off to finally do that side quest and you're like, \"Ah, my guy's hungry. [ __ ] I got to eat something. You have something? [ __ ] my guy's thirsty. Oh my god, I'm dying of this.\" This game is a lot less about being a pain in the ass in that way of a survival game when really you are just kind of needing to regulate your thirst every now and then, but it's not the biggest pain in the ass. It's it's a lot more chill about it. Yeah.",
            "start": 2341.36
        },
        {
            "text": "Um, but at its core, it really kind of is a it's a third person like MMO. I see it very much as that, you know, I'm having a great time doing third-p person shooting and just being with the homies and going to an enemy encampment and trying to find loot and upgrading my gun and find, you know, figuring out the best way to melee these people. I'm I'm having so much fun with it in a way that I I never thought that I would. And it has really kind of just sucked me in. Mike, I know you love survivor games.\n I know that you love playing with your friends.\n Yeah.",
            "start": 2384.4
        },
        {
            "text": "Is this game different? Uh Tim, this game has the sauce. It's a little bit different. Uh it's actually a lot different than some of the survival games we had. And I do think it's that MMO touch of the questing and just that kind of push of like you keep going, right? I think as Andy said, that first couple hours of the wow factor of a survival game of learning new crafting techniques, building out your base, having that moment of defeat where you lose it all and then you got to build back is great. But the sauce in this one is found in the true to heart Dune aspect of it all. It feels like you were in the movie, right? Like if you love the movies, you will smile the whole time. Nick loves the books in the movies. He constantly is telling us fun little tidbits of what he's seeing from the story side of things, but the world itself is beautiful. It's big. It's Dune at its core, and that's a really awesome factor to it. And then, like I said, the MMO questing, I think, is a big push.",
            "start": 2417.92
        },
        {
            "text": "story side of things, but the world itself is beautiful. It's big. It's Dune at its core, and that's a really awesome factor to it. And then, like I said, the MMO questing, I think, is a big push. That's something a lot of these survival games kind of lose track of is like what's next for the player once they hit that certain level of crafting and base building that they need to keep going with. And that's why we really gave a lot of love to Grounded back in the day of having that narrative kind of pushing you to new areas you've never seen. And for this in particular with Dune, it does a great job at stealing MMO techniques of just basic questing, right? None of this is out of the box or different. It's just simply, hey, go to area B, go mine this, or go to area A, go kill this different boss or member of the allegiance. And I love that, right? Because I think a lot of these times in the survival crafting genre, we get to hour 15 and it's like",
            "start": 2462.0
        },
        {
            "text": "it just seems repetitive now, right? Or I've built the biggest base, there's not much more to do. I love the push of that. And like for us, we're still early on, Tim. There is a PvP section that we haven't seen yet, and that's the deep desert. where we haven't even gotten the ornithopter yet, bro.\n No ornithopter. We're still stand by goons up.\n We're trying to make our ornithopter, but it's requiring different materials that are a bit further out there.\n Yeah.\n And there's a there's a thrill of seeing the PvP of this and seeing more of the desert that you haven't seen. And so, yeah, this has the sauce unlike a lot of games that we've played before, Tim. And I think it's the right mix of having that MMO touch, having the great survival crafting that you want, and being set in the world of Dune, which is just so hot right now coming off these two movies that this team from Conan Exiles to this has really nailed it.",
            "start": 2515.84
        },
        {
            "text": "Yeah, that's the surprising thing to me cuz I was thinking I was like, why does why did this one stick with us? And I think it is the combination of all those elements, but for me, I think really like I'm not one to say, you know, you have to have a good property like Doom to make an an amazing game, right? Obviously, there's an incredible, you know, original uh things out there that aren't based on anything that are games that are great, but I really do think that being in the Dune universe and how much they nailed it, just the like not 100% across the board, they kind of were just like, \"We're just going to give you Dune. We're not going to go so far into it. We're going to let you guys exist in this world.\" I really think that adds a lot to it. And the game is gorgeous.\n It being this alternate history thing, too. Like Tim, do you know?\n No, I don't know anything.\n Go.",
            "start": 2565.12
        },
        {
            "text": "So, the the history of course uh for the first Dune movies, it's basically takes place right after the Doom movie, first D movie, I think. And chat, correct me if I'm wrong, but the idea is that Paul Trades was never born. Instead, Jessica listened to the Benzar and birthed a daughter who then became a truthser who then saw Dr. Uhei was like, \"Wait, you're lying.\" And then so the slaughter of the Hearkinins, like basically remember the first movie at the very very end, the Atradius spoilers uh get completely wiped out. That never happens. And so you are on Iraqi now where like there's a lot more politics happening and there's a lot more uh the houses are still sort of in play all of them as well. So it's very very cool and it's one of the things that I like most about it is that I feel like I'm existing not in a prequel which always doesn't do it for me. I just feel like I'm existing in this alterate universe where I get to actually like be a part of the Dune mythos which is great.",
            "start": 2604.96
        },
        {
            "text": "like I'm existing not in a prequel which always doesn't do it for me. I just feel like I'm existing in this alterate universe where I get to actually like be a part of the Dune mythos which is great. And again the game is gorgeous. It runs for the most part great and when you're running with the jabronis, man, it's it's super fun.",
            "start": 2641.12
        },
        {
            "text": "I I booted it up last time on Steam Deck, tried to find some settings. I don't think it looks, you know, particularly great if you want it to run smooth, but it's still totally viable if you're just I want to do some base building or I want to like, you know, work on this little small small part of the game. I wouldn't recommend it if you're trying to do big major quests or whatever. Yeah, but you can go kill some random encampments or whatever. Um I So I I just think that it's it's so bizarre because so much of my interest and so so much of I think the general gaming interest whenever you're playing any sort of video game is you go like, \"Yeah, but like it's it's just the desert, right? like where are the different biomes? Like that's always like a sticking point for a lot of different games whenever you go, \"Yeah, but they have the snow and they have the jungle.\" It's like what else is there going to be in this game? And for this game to just be sand and variations of sand and now",
            "start": 2659.04
        },
        {
            "text": "games whenever you go, \"Yeah, but they have the snow and they have the jungle.\" It's like what else is there going to be in this game? And for this game to just be sand and variations of sand and now this sand is a bit more red. And then this area has I I still think they do a really good job of of of making these areas look more distinct with having these gigantic like caverns and rock formations. They do enough a good enough job art uh directionwise. But it's it's so crazy to me that I I'm having just so much fun with the gameplay that you could just have a game set in various desert environments. And I'm still just super stoked to go explore and find more things. These the larger bases you take down are so much fun and so varied so far. And yeah, I think a lot of it helps that the game is super gorgeous. And when I think of MMOs,",
            "start": 2712.08
        },
        {
            "text": "obviously my\n I think like the most recent MMO I played was like World of Warcraft when we hop back into it, Mike. But\n you know, it's like these games have obviously uh advanced quite a bit and now they can look like this and still be a a massively multiplayer experience.\n Look at this. And it's seamless, right? Also, I just want to point out that Andy, you're really not hitting your parries here. And Mike, what are you doing?\n He was watching.\n This was when I was teaching Andy. learn. And so I was doing a lot of watching, taking a lot of photos as well.\n Flash to Mike running through the desert naked cuz he lost all his [ __ ] one more time.",
            "start": 2767.84
        },
        {
            "text": "Flash to Mike running through the desert naked cuz he lost all his [ __ ] one more time.\n Yeah, there's some really cool threats in the desert as well, right? There's like, of course, these enemy encampments and, you know, me and Andy will go back and forth on the combat later on. I I think it's a little bit basic. I wish there was just a little bit more, but they do a really good job at the third person over the shoulder shooting. They have a melee component. They have skills that you'll learn from different classes and aspect that all kind of do a little bit something different. My concern is a little bit later on when you get into the PvP aspect of things, what that combat will really look like after 60 hours and now three jabronies surrounding you with the sword and you having a tough time really battling back.",
            "start": 2799.2
        },
        {
            "text": "What's happening here? This is me uh trying to ride Mike back to safety and I didn't give him permission to sit on the back seat and the and the shy hilude's coming. Mike's like, \"Run.\" Mike's like, \"Run.\" And I'm like, \"Oh my god, Mike got him.\"",
            "start": 2839.44
        },
        {
            "text": "Oh no, he got him. The threat of this sandworm here in this giant open world is amazing because each area is connected by just these giant open plots of sand. That is just where the sand worm runs, right? And so your goal as you progress through the world is to go from different zones to different zones, but you have to kind of cross this giant open stretch of land that the sandworm is going to try to come catch you in. And it is thrilling every time you do it. You can see the meter build up as you're making noise from yellow to red and then the the sandworm emerges and lets you know like it's going to chase you now. And so it is a really fun game of cat and mouse. And we'll continue to progress with vehicles, right? There's a buggy to help you craft a little bit easier. There is the thopter that will allow us to fly and the sandworm will even find you with that eventually later on. So, it's really fun. The threat of the desert that is just the sandworm itself. It's wild.",
            "start": 2852.64
        },
        {
            "text": "I I think you know I I don't really have a score for this so far. I would just say that it's a fun game and I recommend people trying it out if they have friends or or are into survival games or into multiplayer games, multiplayer shooters. the I think the thing I'm most concerned about and most interested in is how enemy variety could get in the future because in Destiny or in a lot of other you know third person shooters with universals like that you could have large monsters that you're shooting or this kind of reminds me of the my problems with the Division early on where I'm like yeah but all the bad guys are just bigger armored bad guys and in the Dune universe, unless they're taking crazy liberties, you know, I don't think we're gonna fight like a mini shy halloon worm, you know, like we're just going to be fighting a lot of human enemies and I am most interested to see in how they can add variety to a human enemy because we've already seen higher level human enemies have the",
            "start": 2907.44
        },
        {
            "text": "like we're just going to be fighting a lot of human enemies and I am most interested to see in how they can add variety to a human enemy because we've already seen higher level human enemies have the little like levitation machine. they will go up and they'll have like moves or whatever and I just don't know how that progresses and how creative they can get get with that cuz you know I still love just doing third person shooting. This is when I lost all my [ __ ] I died like right right before this. Um",
            "start": 2957.12
        },
        {
            "text": "I've been there.\n You know what interesting Nick I um\n after the stream ended and it was very very heartbreaking. I was still watching Mike's stream\n and uh and he was like that is my fault. Nick dying there is my fault. And why was that, Mike?\n I like to call the worm. And I might have been the first person to cross the desert and I might have done an extra couple of donuts to alert the worm of our location. And so when Andy and Nick went across, they said, \"How'd the worm get so close to us so quickly?\"\n Because I already called the worm.\n There are there are pockets of sand called\n drum sand. Drum sand. And when you ride over it, it's like,\n which weirdly enough, I was like that I've never heard of that before. and watching the first movie, they have one line where he's crossing. He's like, \"Hey, don't step there. It's drums sand.\"",
            "start": 2986.96
        },
        {
            "text": "which weirdly enough, I was like that I've never heard of that before. and watching the first movie, they have one line where he's crossing. He's like, \"Hey, don't step there. It's drums sand.\"\n I'm like, \"That's it.\" And there's these massive, massive patches where you go over and it's like it goes. It has like the the the thumper or whatever it is. Uh but yeah, my that makes a lot of sense. Uh\n cuz again, my my fault for being the the the tail of uh the human centipede. You don't want to be the tail.",
            "start": 3025.84
        },
        {
            "text": "cuz again, my my fault for being the the the tail of uh the human centipede. You don't want to be the tail.\n You want to be the front guy. last night. You know, Nick is like, I'm looking at the map. I'm trying to chart my course. I'm like, \"All right, there's two pockets of drum sand right there. I want to drive right down the middle.\" So, I'm setting a ping for myself. So, and Nick goes, \"Go ahead, Andy. What are you waiting for, man? Go ahead. Go drive through it.\" Like kind of like giving me [ __ ] And so, I'm driving and suddenly I just see sand pop up. I'm like, \"Oh my god, it's here. The Shy Halude is here. How the [ __ ] did it get here so fast?\" And now a lot of things are, you know, we've been\n very enlightening. You know,\n I'm just going to say this. I'm just going to say this.\n You owe me a sandbite. Yeah. Yeah. Yeah.\n You did. I gave you one. I I I went out of my way to pick you up and make you a sandbike and and this is how you do me.",
            "start": 3045.36
        },
        {
            "text": "This game is great, Tim. And as Andy said, it's got a great onboarding experience. We brought Blessing yesterday as a brand new player and got him caught up. But I think out of this, they do a great job of drip feeding you everything you need. Nice and slow at a good pace where you are learning a lot, but at the same time, you are still waiting for the next level to unlock X, Y, and Z. There's a lot of craftable items on the list that you can get from different fabricators. Of course, there's different ways to get water out of the desert when there is no water around, which I think is really fun in the Dune Verse. But on top of that, I mean, all the crafting material, they've done a great job at I I I'll say this, it's not as boring as just swinging an axe and a pick or an axe and a pickaxe. I do like the laser cutters. It's just simply, hey, swipe a tool across. Super quick, super easy. It never feels like I'm standing at a tree for too long. I think they've done a good job for",
            "start": 3095.12
        },
        {
            "text": "pickaxe. I do like the laser cutters. It's just simply, hey, swipe a tool across. Super quick, super easy. It never feels like I'm standing at a tree for too long. I think they've done a good job for that. You scan like a a big ass pile of rock and when you scan it, it will sort of like 3D sort of readout and then it shows a randomized blue line that you can track to get the best.",
            "start": 3139.6
        },
        {
            "text": "It's like the vein,\n the the most amount of of of Oh, what is this? Oh, this is\n the flower sand.\n Oh, interesting. Oh, this is where Yeah, you led me out to the to go get that item, Nick. And I was like, I think we're attracting the worm, Nick. And he was like, \"No, we should be good.\" And things were not.\n You ran the wrong way. Things were not I'm running to the shore and then I was like, \"Oh my god, my bike.\" And uh and then the shy hall died.\n You know you're screwed when the camera starts pulling out and you're like, \"Oh, I gave back the desert. I lost so much there.\"",
            "start": 3162.4
        },
        {
            "text": "I also Yeah, I want to point out that I think that's that's incredibly important, right? It's like those little tiny touches with those guns. Like that gun doesn't just serve that purpose or rather the cutting tool. You get onto these ships and you're also can weld through doors to get to like secret passages and stuff like that. So those little tiny mechanics I think really go a long way to keeping the gameplay interesting. The little levitation belts that you can get, the little things that kind of change tiny little ways you can traverse or uh mindful resources that keep you wanting to interact with that. And I think uh yesterday was such a blast cuz at first I was a little hesitant. I was like a blessing is going to be behind us. I don't know what that's going to be. And then it just turned out that for two hours I just they were off doing stuff and I'm like blessing let me just build you a home.",
            "start": 3193.92
        },
        {
            "text": "Let me just get in my back seat. I'm like let's go over there bless. And the whole time I look at at at Nick's uh you know perspective and he was like bless can you give me pers uh permissions to build your house or like get give your and then we'd get back and Nick is like yeah I'm looking at the the foyer up here.\n Yeah. Playing like two different like TV episodes like a plot bot.\n Yeah.",
            "start": 3231.68
        },
        {
            "text": "Yeah.\n But honestly I think I think that one of the reasons why I love that is cuz the building mechanic is very streamlined and it's very it's very good. Like I remember playing Valheim or Valheim or Icarus and you'd get to that point where you're like, \"God, I really want this wall to just go where it's supposed to go.\" And that sounds stupid and like such a minor critique, but when you have to build your base and when you want to when you go and say, \"I want to enjoy this thing.\" You don't want the tools to get in the way of that experience. And I think that they do such a good job. And also, let's have a conversation about this jabon right here. You see that guy's house right there? That dude needs to move. Okay? He doesn't need to be in our neighborhood anymore. move to the Beverly Hills of Iraq or whatever. This guy's got like materials I've never seen before. He's got this like cool uh uh that shield wall that I haven't even gotten yet. We need it.",
            "start": 3252.72
        },
        {
            "text": "That's where the ornithopter lands.\n He just goes through. There's nothing. There's a dude that made literally all four of his walls out of that. So, the ornithopter can just land and get out.\n Nobody will flex harder on you than a dude with an ornithopter cuz like they fly over you. You walk out of your house and you just and you see like a dude like landing in his little helipad. I'm like, man, this guy's\n like, dude, it's zone two. Like, go to zone 4. What are you doing? Know where you're supposed to be.\n Get that [ __ ] out of me. Yeah, I I like the base building, Nick. I'm going to give the base building a nine out of 10. I think it's missing just a little bit of features on that out of play. I love that it vacuum sucks everything in the building that you can use on crafting right away. That's cool. That's great. But for Tim who has no idea what that means,\n the so many survival crafting games,",
            "start": 3296.08
        },
        {
            "text": "the so many survival crafting games,\n you you put stuff into an ore refinery or whatever and cuz you're trying to get ingots, iron ingots out of the iron ore that you made or whatever, and then when you go to craft something, it says you don't have those, you go, \"Oh [ __ ] they're in my box or they're still in the machine or whatever.\" the m this game knows that it's within your household. So, it just sort of pulls all that stuff and it's so convenient to not have to take it out of the machine and have it in your bag or have it on your person. You could just kind of build from there and it it really it's so convenient.\n I just wish it had what was the one that we used to be able to you would put up everything that you want in like the light green and then you could just instantly tap what you want. Like it has that but it's not\n that was night and gale.",
            "start": 3334.16
        },
        {
            "text": "that was night and gale.\n Yeah. I like when I can just say I want it all done now cuz there's like pre-making it and you can start seeing the layout in the blueprint mode and then there was one where it's just like you got it all blueprint out, hit the button, it will do it all right that a lot.\n Night andale allowed you to build the whole house just blueprint wise and then when you had all of the resources you could just hit click and it would just and all sort of pop in.",
            "start": 3383.6
        },
        {
            "text": "Night andale allowed you to build the whole house just blueprint wise and then when you had all of the resources you could just hit click and it would just and all sort of pop in.\n That is one of my only like pain points with it though was the blueprint like the house blueprint mechanic which I was like oh this is going to be really cool. this would be a really easy way to like move your house. And I just found that to be completely frustrating and I don't even bother using it anymore, which I'm sure it's a main mechanic for moving [ __ ] And I'm like, I'm I would just rather grind resources and rebuild in the next level than try to figure this out. Alternatively, the the the the bike clone tool where you can suck your bike into a gun is very very useful.\n Yeah, very like that is right. You like my floor lights, Tim? Do you like my floor lights?\n See? Oh, I know you guys were really big on these floor lights.\n Yeah, really big on the floor lights. Yeah. I mean they just",
            "start": 3396.16
        },
        {
            "text": "See? Oh, I know you guys were really big on these floor lights.\n Yeah, really big on the floor lights. Yeah. I mean they just\n by the way these goddamn tariffs they're hitting hue lights it's bad it's real bad is already insanely expensive and yeah starting in like first week of July don't no one's buying Hugh ever again like it's outrageous they literally just came forward they're like hey it's because the tariffs\n deal with it it's like oh no man be a much less colorful world one thing I do want to say before we hop onto the dream is that uh I'm excited for Nick to walk into his house and maybe open up a little present that I left for him. Thank you, Andy.\n Wow.\n There's a you know, last night was very heartbreaking at the end of the night.\n Could have been the end. Could have been the end.\n There there have been several moments whenever one of us is close to dying and we go,",
            "start": 3435.92
        },
        {
            "text": "Could have been the end. Could have been the end.\n There there have been several moments whenever one of us is close to dying and we go,\n I may have quit right then and there if I lost all of my stuff. And last night I felt like that may have been the breaking point when Nick going I'm so [ __ ] mad and me and Mike are cackling.\n I laughed so hard I thought I was going to get sick again like that kind of [ __ ]",
            "start": 3480.8
        },
        {
            "text": "cuz it just couldn't have been a more perfect ending. But I will say that one of the things that I think the the the ease with which you guys can jump in with me, the re ease with which we can join a party and get in the clan and or not the clan, excuse me, the um what do we call it? Uh gangs. The guild. Thank you. Um, all of that really is a saving grace, right? And so I don't know if you're if you're if you're planning on playing the single player and you lose all your stuff, you're probably going to rage quit. But the fact that I do have these two jabronies here that can like when Mike needed a pickup, we can go you can run him another bike real quick. That really goes a long way. I do I love the skill check or not the skill check, but like I love the accountability of the Shy Halude. I love that there is that thing out there, but [ __ ] me. I wish there was just like one like mulligan. Just give me a gimme with last night. Just let me have my [ __ ] back. Shy Halude.",
            "start": 3502.72
        },
        {
            "text": "Shy Halude, man.\n God, man. I love the threat. Uh, we have a super chat from Arturotron saying, \"I love the use of lud narrative storytelling. The mechanics of the game tell the story of Dune.\" Have you noticed that, Nick?\n The mechanics of the game tell the stories. I don't I'm I'm a little lost in what that means. But like through the mechanics of using the guns or the outfits they what I I don't know cuz I\n I don't know if you're here learning the story of Doom but you are learning a lot of the the minor sort of world building aspects of it right like for instance you've seen us with shields there's a reason why um you know I don't think they really explicitly say it. I think eventually you do get las guns,\n but right now you have dart everything is dart based",
            "start": 3550.4
        },
        {
            "text": "but right now you have dart everything is dart based\n and it's very very it's cool and there are there are those lines where they you know they talk about that in the beginning of Doom where it's like you you know nobody uses lasers blessing because the shield the holtzman shield generators on people's bodies if a laser hits it makes like a nuclear explosion basically. So everyone's just across the board been like no lasers\n unless you're a starter car.\n Yeah. It uses the the world lore to sort of influence what the gameplay is where\n right\n if you have a weapon and somebody is running at you and they are they have that little blue shield, you can't slash at them. You have to parry and if you parry it stuns them and then you have to hold left click attack and it's that stab and you burst through their shield or whatever. So I I do think there are cool things that are implemented in that way along with",
            "start": 3584.64
        },
        {
            "text": "your own sh the remember the beginning of Dune 2 that amazing shot where the hearken and levitating over. So you have those sort of levitating sort of suits as well but those things call the worm like crazy. So you if you're running in the open sand do not use that cuz it's essentially\n that's why my mic got\n Yeah. It's probably why the worm came faster to to Mike in that moment when I was trying to save him when you're using that [ __ ] It's like\n Okay, got it.\n It's like having a thumper on the sand or whatever. So, like there are a lot of things like that that influence the game design and and I think they get really creative with kind of implementing things from the Dune lore into the the game design.",
            "start": 3632.24
        },
        {
            "text": "Yeah. And I'll say also I I think a lot of the side missions and stuff like that is where you're getting the lore for what this Dune is, right? like we're well I'm not going to say all of us are house of tradies cuz some of us uh our allegiances vary I guess Mike is how we'll put that I mean I'm open for money you know what I mean I'm here for any gold that anyone will pay me it's cool like I said the questing is really fun they got house of tradies in there they got the hearken in you get to choose a side just like Harden alliance there are offsite just random guilds around the world that you can meet you can talk to there are class trainers around that will help you elevate your skills trees. There are merchants at all of these different town centers that all have bounties and different jobs for you to do. So, there's always a carrot at the end of the stick to just keep going after and keep running towards, which is really, really nice in a game like this.",
            "start": 3678.4
        },
        {
            "text": "Shout out to fart in a bag.",
            "start": 3725.6
        },
        {
            "text": "And dude, I'm making friends, Tim. I'm making friends. Guy walked up to me and was like, \"Hey, man. There's proxs chat, you know, and I'm like on my bike waiting to cross and the I see shyude like kind of close by. So, I'm like I'll wait for him to kind of go away. Guy walks up to me. He's like, \"Hey, man. Do you want to go fight that worm?\" And I was like, \"Mike, I don't have my mic on, but come talk to this guy.\" All right. Oh, who who is he? Where you at? I'm right next to you. All right. All right. I just hear like from far away like, \"Yo, what's going on, homie? How's it going, man? What y'all doing out here?\" Uh, fart in a bag. Oh, hell yeah. That's his username. Fart in a bag. Add me. Add me, big dog. Add me. Yeah, add me. We run some quests. Whatever you're doing out there. Also, add my friend Nitro Rifle. He's He's my He's my homie. you know, we're looking at game with with people and Mike's just like being the most ultimate annoying human being. Uh and then uh just the",
            "start": 3727.12
        },
        {
            "text": "add my friend Nitro Rifle. He's He's my He's my homie. you know, we're looking at game with with people and Mike's just like being the most ultimate annoying human being. Uh and then uh just the best.",
            "start": 3768.88
        },
        {
            "text": "And then I drive away. So I only hear him talking to the guy. I don't hear the guy responding, but I just hear like So what should I call you? Big fart or fart fart in a bag? What do I call you? And then\n and then he says, \"All right, all right, homie. I got to go. Uh remember, let the spice flow. I'm outie.\" Why do you have an outro? Tim, I'm going to get people to start saying it in the game.\n I'm going to start my own group,\n homie. Here's the thing. My my my homie over there, Nitro Rifle, twitch.tv/ Andycortez, he's the next big guy. Like, he's he's he's next up right now. I promise you, dog. And then I'm looking at and I'm like, \"Oh god, I'm not even streaming right now.\" But then I Mike's like, \"Did he follow you?\" I was like, \"No, not yet.\" And then I see Fart in the Bag followed you. I was like, \"Oh my god, he followed me, Mike.\" And Mike's like, \"I'm going to gift him some subs.\"\n Shout out to Fart in the Bag.\n Fart in the Bag, bro. That's awesome. Let the spice flow.",
            "start": 3779.04
        },
        {
            "text": "Shout out to Fart in the Bag.\n Fart in the Bag, bro. That's awesome. Let the spice flow.\n Let the spice flow. We outy. That's how we're going to end the podcast.\n God bless you, Mike. Uh well, this has been the kind of funny games cast. Thank you so much for joining us today. The boys are about to drop into Arachus to to stream the game that we just talked about. Um but until next time,\n let the spice flow. I'm outie. We outie. Bye.\n So stupid. Heat. Heat. N. [Music]",
            "start": 3824.96
        }
    ]
}