{
    "id": 14204,
    "video_id": "lABoHTwsSM4",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Andy Cortez",
        "Blessing Adeoye Jr."
    ],
    "title": "Even MORE Nintendo Switch 2 Launch News! - Kinda Funny Games Daily 06.06.25",
    "description": "Go to http://kindafunny.com/XREAL to grab yours now!\n\nWe’re here to talk about video game news!\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1749235459,
    "duration": 4906,
    "transcript_chunks": [
        {
            "text": "Today's stories include Princess Peach and Toad's voice actor have been replaced. Your phone can replace a certain Switch 2 accessory. I wonder which one. And Walden Gogggins might be in the Street Fighter movie. We'll have all this and more because this is Counter Funny Games Daily. [Music] What's up and welcome to Kind of Funny Games Daily for Friday, June 6th, aka Gia Getty's birthday. Send some sweet nasty love to Gia Gettys on social media, everybody. Of course, I'm your host, Tim Gettys. I'm joined today by the Nitro Rifle, Andy Cortez. You married her? I did marry her almost a year ago. Isn't that crazy? No way. Oh my gosh. Yeah. Yeah. June 29th. Definitely was wild stuff, right? I think about that all the time. Wake up. What did you spend your night doing, Tim? Um, playing Switch, too. Are you kidding me? What were you playing? Mario Kart, man. Mario Kart's really all that I've touched. I'm very excited about Welcome Tour. I thought that that was going to be something that I I",
            "start": 6.96
        },
        {
            "text": "too. Are you kidding me? What were you playing? Mario Kart, man. Mario Kart's really all that I've touched. I'm very excited about Welcome Tour. I thought that that was going to be something that I I spent a little bit more time dedicating to, but I'm just like, I can't get behind on Mario Kart. You know, that'll be a weekend thing. That'll be a Saturday, Sunday thing. Time dedicating to. It's not like there's you're not there's not like progression. It's like, you know, welcome tool. Oh, welcome to Well, apparently it's bigger than people thought. There is progression, too. But like, you know, I got 100% it though. I'm me. Okay. Got you. You know what I mean? I got to do all the things. Okay. Even though apparently some people are like, \"You need every single accessory to be able to 100% it.\" But then other people are like, \"No, there's a way around that. You can just talk to a guy.\" But this whole this we're going to call this entire era of the Switch 2 the misinformation era. You",
            "start": 55.44
        },
        {
            "text": "it.\" But then other people are like, \"No, there's a way around that. You can just talk to a guy.\" But this whole this we're going to call this entire era of the Switch 2 the misinformation era. You know what I mean? But people are just out here saying [ __ ] and then, you know, some of them are us, some of them might be me. Sure. Yeah. Sometimes I just see a highlight or a headline on Twitter and just sort of par it. You say, \"Oh yeah, that's that must be true. Somebody said it.\" God, horrible times that we're in. I didn't uh I didn't get to play a whole lot of Switch 2 last night. Why? Because Target [ __ ] me. Oh [ __ ] What does that mean? Well, like I I'd be playing Mario Kart World. Uh-huh. If Target's pre-order arrived on time. Didn't you get your Switch yesterday? I remember seeing you with a Switch yesterday. I ordered two Switches. You can play with one. The one with Mario Kart was with the Target pre-order. We're sorry, Andy. Your Mario Kart's in another Target. I'm I'm just",
            "start": 95.52
        },
        {
            "text": "you with a Switch yesterday. I ordered two Switches. You can play with one. The one with Mario Kart was with the Target pre-order. We're sorry, Andy. Your Mario Kart's in another Target. I'm I'm just not happy about it right now, Tim. I'm not happy. That I mean, you played a whole bunch yesterday. We're about to play even more today. Yeah. But yeah, I am sad cuz I I feel like I need you to get hooked. You know, we got Bless. We heard him yesterday. He's all in. Obviously Barrett's in. You're the one that I know you're just not a Mario Kart guy, but now you have Monty Mole as your main. You've earned that. I did earn Monty Mole as my main, but I you know, last night when I got home, there was the the consumerrained FOMO part of me that was like, what if I just bought Mario Kart right now and and streamed it and played with everybody? And then Elder Ring came and calling. I get it. I saw you tweet about Elen Ring and I'm like, this felt kismmet. which is kind of perfect because, you",
            "start": 140.8
        },
        {
            "text": "and and streamed it and played with everybody? And then Elder Ring came and calling. I get it. I saw you tweet about Elen Ring and I'm like, this felt kismmet. which is kind of perfect because, you know, I'd feel a lot more sad had I not have something to play that required, you know, things that I haven't seen or things that I haven't experienced yet. And when it's Elder Ring Night Rain finally took down the third and fourth boss yesterday, what a [ __ ] nightmare that third boss is. It's so annoying. Uh shout out to Dolphin Corn who was me and Snowike Mike's third uh in that um in that trio. And the amount of times that you know um Mike would be like, \"Can't wait to see you on Friday.\" Okay. And I'd be like, \"Nope, you are not coming in, man. You do. You sound You sound so liquidy right now.\" He'd be like, \"I'm going to see you.\" Mike's been slacking me updates about like is he or is he not thinking he's coming in or whatever. And I can hear how sick he is through the slack. He",
            "start": 184.4
        },
        {
            "text": "now.\" He'd be like, \"I'm going to see you.\" Mike's been slacking me updates about like is he or is he not thinking he's coming in or whatever. And I can hear how sick he is through the slack. He keeps threatening us. It really does feel like a threat. Yeah. I'm going to see you on Friday. I'm going to be there. Stay. Hopefully, he'll be here Sunday for Xbox. Hopefully. That's the Get good for that. That's your moment to shine. Absolutely. Mhm. H. But hey, a lot of fun stuff this weekend. How so? Well, I mean, everything we just talked about, Switch 2, you get to actually play. You'll have your Mario Kart hopefully eventually. It arrives Saturday. Yeah. Okay. It does arrive Saturday. And then Sunday, Xbox showcase. Big day. Yeah. And today, Summer GameFest. Big day. God, it just doesn't even feel real. It doesn't feel real. I normally dress up for the the showcases. Yeah. I just It just doesn't feel real. I honestly like on the drive over I was like I [ __ ] up. I've been [ __ ] up",
            "start": 228.0
        },
        {
            "text": "even feel real. It doesn't feel real. I normally dress up for the the showcases. Yeah. I just It just doesn't feel real. I honestly like on the drive over I was like I [ __ ] up. I've been [ __ ] up left and right. I was supposed to do Gregway yesterday and I didn't do Gregway because I was too tight tie. So I'm gonna do a Gregway today. There's gonna be two Gregways everybody for you. Do you think that Jeff Keley looks at your lack of dress and takes it as a sign of disrespect that you're not hyped enough for this? I hope not. In a similar way to how Blessing feels really disrespected whenever Jeff Keelley mentions Sonic and kind of laughs and he goes, \"Oh, why'd you laugh right there, Jeff?\" Like, you're not you're you clearly think that this character is a joke right now. I I think Keely looks at you and goes, \"Wow, wow.\" A t-shirt. Yeah. A cool t-shirt. A cool t-shirt. A t-shirt that might cause some drama with him though, depending on that I own. You know what I mean? I know. And",
            "start": 271.28
        },
        {
            "text": "looks at you and goes, \"Wow, wow.\" A t-shirt. Yeah. A cool t-shirt. A cool t-shirt. A t-shirt that might cause some drama with him though, depending on that I own. You know what I mean? I know. And you wore it a couple days ago, which gave me the Okay. I was like looking at my closet today. I'm like, I can wear this cuz Andy wore it a couple days ago. We're gonna be good. Um, of course, this is kind of funny games daily. Each and every weekday, we run you through the video game news you need to know about live on YouTube, Twitch, and podcast services around the globe. If you love what we do, please support us with the kind of funny membership to get the shows ad free uh and a daily exclusive Gregway. And you're going to want to do that right now during Summer GameFest season so you do not get any of the ads in the shows that we're doing. and we appreciate so very very much for doing that. Uh for a chance to be part of this show though YouTube super chat your little ass away and we",
            "start": 312.96
        },
        {
            "text": "not get any of the ads in the shows that we're doing. and we appreciate so very very much for doing that. Uh for a chance to be part of this show though YouTube super chat your little ass away and we will get to them throughout the show. Remember we are an 11 person business all about live talk shows. Um after games daily you're going to get another Switch 2 stream. After that we're going at 1:30 for our Summer GameFest live reaction pre-show heading into the show itself and then of course our breakdown after that. So whole day of fun stuff whether it's Switch or Summer GameFest. But the Summer Game Fest stuff already started. Some trailers have been coming out. We had exclusive access to the latest trailer for the latest Sonic the Hedgehog game. Massive reveal. Sonic Revolution. Um, they came out of nowhere. People hadn't even been rumoring about this. There wasn't any murmurss about a new Sonic game cuz we all thought Sonic Team Racing Crossworlds, whatever the [ __ ] they're",
            "start": 351.36
        },
        {
            "text": "they came out of nowhere. People hadn't even been rumoring about this. There wasn't any murmurss about a new Sonic game cuz we all thought Sonic Team Racing Crossworlds, whatever the [ __ ] they're calling it, was going to be this year's game. Um, but instead Sonic Revolution was revealed and uh we had Blessing re it looks like me and you are reacting to it right now which really like um but uh we had me and Blessing revealed uh react to the reveal and I'm not going to spoil it here but I legitimately need every single one of you to go to youtube.com/kindfunny the highlights channel. Actually it's on the games channel now too. Go to either channel and watch Blessings reaction to Sonic Revolution. I promise you it's going to be worth your time. Shout out to Roger and Tim. If you're a Kind of funny member, you get two Greg Ways. One from me, one from Greg. Thank you to our Patreon producers Carl Jacobs, Omega Buster, and Dely 20. Today, we're brought to you by XRel, but we'll tell you",
            "start": 395.6
        },
        {
            "text": "of funny member, you get two Greg Ways. One from me, one from Greg. Thank you to our Patreon producers Carl Jacobs, Omega Buster, and Dely 20. Today, we're brought to you by XRel, but we'll tell you all about that later. For now, let's begin with what is and forever will be the Roper Report. It's time for some news. I have no idea how many stories we have cuz they didn't write it down. We have seven stories. The Bakers does it. And I'm going to tell you right now, it is a slow news day, Andy. Lot has been going on. People trying to step away from Summer Game Fest. Don't want to get in the way of that. Don't want to get in the way of the Switch 2 conversations. All of that. So, well, there's some news. There's things to talk about. Tim, you [ __ ] up. And I think you I think you ignored something on purpose because we do have something on the kind of funny store that you need to talk about. You're right. You're what the [ __ ] You know, I was trying to trying to just get past this cuz",
            "start": 443.84
        },
        {
            "text": "on purpose because we do have something on the kind of funny store that you need to talk about. You're right. You're what the [ __ ] You know, I was trying to trying to just get past this cuz I hate having to see this image in blue. You know, the fact that blue is being used and associated with Greg Miller really just grinds my tears. Um, but yeah, the championship parade, the Greg Miller Championship Parade, Tim Getty's farewell tour, uh, parade is happening on June 28th, Saturday, June 28th. Greg announced yesterday that he's going to Hijack of my dreams and my day. It's Pokemon Go Fest. I will be doing my annual pilgrimage on the Abaradero, catching all my Pokemon, doing my thing. And uh Greg's hijacking that to turn it into a parade to celebrate him uh and team blue that he stole from me. And you can do that too by buying one of two shirts that we're selling. Shout out to Campfire. Killed it. This is good. Absolutely amazing designs. I'm going to be honest. I hate how much I want",
            "start": 484.08
        },
        {
            "text": "me. And you can do that too by buying one of two shirts that we're selling. Shout out to Campfire. Killed it. This is good. Absolutely amazing designs. I'm going to be honest. I hate how much I want to wear this. I love the other one. The other one reminds me just so much of all of the 90 the other t-shirt reminds me so much of the '9s Super Bowl t-shirts of like the Dallas Cowboys, you know, got three sort of one. Oh my gosh, it's amazing. Yeah. Yeah. See, I could wear this one and it it has nothing to do with Greg, so people will just assume it's me. I'd be lying fibbing just a bit, but I'd be okay with that cuz God, it looks good. Look at all those stars. So many stars. Look at the stars. Yeah. Oh man. But yeah, like I was saying, it's kind of a slow news day today, which I'm very excited about because I don't know if you remember or realize or put this together, Andy. Probably not. You know me. You know how my brain works. But the games daily before Summer GameFest showcase",
            "start": 535.52
        },
        {
            "text": "excited about because I don't know if you remember or realize or put this together, Andy. Probably not. You know me. You know how my brain works. But the games daily before Summer GameFest showcase usually just full of leaks from the showcase and it just takes all of the fun out of the showcase. So, I am stoked that it's a slow news day right now. I think Keely has successfully taken all the leakers out. Yeah. one by one. I think they've beenated. Yeah. So, I don't want to go too long on this because we do have new stories to get to and we we will do a pre-show and all of that. Not even get into your hype levels for Summer GameFest. Your kind of expectations based on Jeff recently. Where are you at? Because Jeff's usually out here tempering expectations being like, \"Hey, we have some great stuff from indie games all the way up, but you know, there's indie games.\" And I, you know, he kind of like tries to put a bunch of words this whole week. Every time he's tweeted about Summer",
            "start": 584.56
        },
        {
            "text": "great stuff from indie games all the way up, but you know, there's indie games.\" And I, you know, he kind of like tries to put a bunch of words this whole week. Every time he's tweeted about Summer GameFest and the Switch 2, he's very much just been like, \"Oh man, what a week this is.\" Okay. I didn't realize the tone and the tenor were quite like that. Yeah, they are. I read the tweet from several days ago that was great week to celebrate games and for, you know, just finished the final rehearsals or whatever. a lot of I I believe the words were something along the lines of a lot of awesome games from big developers, but also tons of games from smaller developers that deserve a lot of love and exposure. And to me, that doesn't really get the hype up too much. I'm just like, okay, we're going to see some cool [ __ ] Similar to State of Play. State of Play pops up and my expectations are like, well, nothing can match the hype of February State of Play. And we were still shocked and",
            "start": 629.12
        },
        {
            "text": "going to see some cool [ __ ] Similar to State of Play. State of Play pops up and my expectations are like, well, nothing can match the hype of February State of Play. And we were still shocked and surprised by a bunch of different secrets. Oh [ __ ] that's a different one. That's another one. In line with what I'm saying though, their tweet didn't do the whole we're talking about PSP 2 games or we're talking about whatever. So again, I don't think this is going to be like last year's Game Awards level Keley show at all. But I think it's going to be a B+. A minus. I I'm some A minus would be shocking to me. Like I I I'm more in that B level. But hey, I'm here for a B at this point cuz I keep saying this, but like we already know a lot about this year. So, exciting times ahead. We will be live reacting. We will do a pre-show. We will do a post show. And you're going to check it all out here. Yeah. I think the the known quantities are kind of out there, but it's all about what will we",
            "start": 679.04
        },
        {
            "text": "live reacting. We will do a pre-show. We will do a post show. And you're going to check it all out here. Yeah. I think the the known quantities are kind of out there, but it's all about what will we see new from the the known quantities? Will we see stuff from like I I know usually you say that stuff for showcases, but will we see another tease at a Wolverine or not necessarily Wolverine, but like a game of that sort Yeah. one of one of the unicorn games like one of the big dogs. But on top of that, like there are a lot of potential shadow drops today. Arc Raiders, right, being one of them. Like there's been a lot of buzz about that. I think you were the one buzzing in my ear about that. Yeah, I think that the more people may have found that there's just another beta or another whatever you want to call it, early access, whatever the hell happening the day of of June 6th, which is today. But I don't know if that was ever really looked into a whole lot. It's just always been kind of",
            "start": 721.68
        },
        {
            "text": "you want to call it, early access, whatever the hell happening the day of of June 6th, which is today. But I don't know if that was ever really looked into a whole lot. It's just always been kind of assumed that this game is probably going to shadow drop on because the finals also shadow dropped um the game awards that it was shown off or not the game awards but the summer game says that it was shown off uh in. So I don't know. It's it's exciting that that we will have some surprises, but I'm more I'm more interested in like what are those big titles? Yeah. Are we going to get like big demos? Do you think big like hey that massive game you're looking for demo available right now? Maybe. Yeah. I mean it's going to again I feel like there's a a good energy of people wanting to talk about games, watch stuff about games and play games. So yeah, give give them some stuff to play. Raj, can we get the YouTube chat up when you have a chance? Thank you very much. I would appreciate that. Let's",
            "start": 763.32
        },
        {
            "text": "watch stuff about games and play games. So yeah, give give them some stuff to play. Raj, can we get the YouTube chat up when you have a chance? Thank you very much. I would appreciate that. Let's get into story number one. Princess Peach's voice actor of 18 years confirmed she's been replaced. This comes from Tom Ivan at VGC. Longtime Peach and Toad voice actor did not realize they were the same person. Samantha Kelly has confirmed that she'll no longer be playing the characters in Nintendo's games. Kelly first voiced Peach in the 2007 Wii game Mario Strikers Charged uh and which is amazing and has continued to provide the character's voice in the years since, including 2024's Princess Peach Showtime. Writing on Instagram on Friday, Kelly said that Nintendo informed her this week of its decision to recast the roles of Peach and Toad, who she had also voiced for many years. Thank you for so many years of friendship and joy. I'm sad that it's over. I truly would have wanted to voice",
            "start": 811.12
        },
        {
            "text": "decision to recast the roles of Peach and Toad, who she had also voiced for many years. Thank you for so many years of friendship and joy. I'm sad that it's over. I truly would have wanted to voice Peach and Toad forever. Nintendo let me know yesterday they decided to recast these roles. I'm grateful that I got to do these voices for so many years. Peach and Toad are such strong and beautiful characters that I pray they live forever no matter who voices them. So much love. Really is a slow news day, huh? It really is a slow news day. When when she confirms that she's been replaced, I just imagine like the voice you're hearing is not me. That's not me. It's a clone. There's a different person out there. I I mean, yeah, it bums me out with all of the sort of recent Nintendo voice changes, Charles Martinea being primarily like the first sort of big bomb to drop of going, \"Oh [ __ ] we're getting a new uh Mario,\" which is kind of exciting, but also I just wonder what that process is",
            "start": 852.96
        },
        {
            "text": "Charles Martinea being primarily like the first sort of big bomb to drop of going, \"Oh [ __ ] we're getting a new uh Mario,\" which is kind of exciting, but also I just wonder what that process is because these are these are characters that have been around for so long. It's like I'm so fascinated by like how the job and the day-to-day life is of somebody who voices these characters because it's not like you're a voice on the Simpsons or you're a voice on Family Guy who's like recording [ __ ] all of the damn time. It's very very interstitial of like or it's very very intermittent of like all right well now we got Peach's you know video game her own Peach Showtime game. Yeah. So come efforts from that. Yeah. So, like I it's so fascinating to me to think of what exactly the the work schedule is of these actors, but also quite a bummer for somebody who has been doing this for a long time and it clearly means a lot to her. Yeah, it it's definitely, you know, sad that somebody that's doing",
            "start": 894.48
        },
        {
            "text": "is of these actors, but also quite a bummer for somebody who has been doing this for a long time and it clearly means a lot to her. Yeah, it it's definitely, you know, sad that somebody that's doing something they love is no longer able to do that. Like that sucks, right? Like essentially this is not a layoff, but it's equivalent of like somebody lost their job. We've moved on. Um, and that's such a bummer. It is, you know, an opportunity for somebody new. And I do feel like that is a trend that we've seen recently. Uh whether it's I mean we'll see with the Persona stuff, but like with Persona 3 remake, Barra is bringing up like yeah, they were able to give a new generation um an opportunity to be a new generation of players versions of these characters. It is a little bit more weird with these Mario characters based on how little they actually talk. Having said that, I don't think that the quantity of voice matters as much as I don't want to say the quality, but like the impact. Like",
            "start": 944.24
        },
        {
            "text": "these Mario characters based on how little they actually talk. Having said that, I don't think that the quantity of voice matters as much as I don't want to say the quality, but like the impact. Like Charles Martinea is Mario. He is why we say let's go the way we do. Like I don't think Mario's tagline would include the A in it, you know, let's go. Yeah. If it wasn't for him. And so it's that weird thing of like that sucks that these people that have these like iconic moments are are defining features of these characters are being replaced, but that's also kind of part of the legacy, I think. I don't know. It's I I can see two sides to this, but I do think that the majority of it is like it sucks. She wanted to keep doing it and can't do it. So, can be Kefir Southerntherland. It could be. It could be really sad. Uh I saw somebody in the chat say SLC something I think say uh that they're going to be replaced with AI. I doubt that because of how Nintendo's been doing things and they did",
            "start": 986.32
        },
        {
            "text": "It could be really sad. Uh I saw somebody in the chat say SLC something I think say uh that they're going to be replaced with AI. I doubt that because of how Nintendo's been doing things and they did replace Mario with a real voice actor. I imagine that it is a real voice actor. I do wonder why though. like what is the decision to do this? Like I think maybe it's moving on into the sphere of movies and let's try to since we had different voice actors for that, let's all try to get on the same page for even though Chris Pratt is not the new Mario actor. It just feels like it's a refresh. And I think of I still think of that Switch 2 presentation of you being the one to point out, oh, this is kind of like this is the new school. This is the newer. We're not seeing like the older faces that we're so often used to. These are This is kind of the new class. Say by the bell, new class. Exactly. And in a lot of ways, that's it's we're in that transition period uh with Nintendo where Nintendo",
            "start": 1036.96
        },
        {
            "text": "we're so often used to. These are This is kind of the new class. Say by the bell, new class. Exactly. And in a lot of ways, that's it's we're in that transition period uh with Nintendo where Nintendo are the at this point longest running of the big three, right? Like, you know, PlayStation came in the 90s, Xbox came in the early 2000s, but Nintendo's been around in since the 80s. They're the last remaining ones from back then. And that means that that first class post, you know, video game like [ __ ] explosion in in the early '80s of Miiamoto and all these like classic designers like this is probably their last generation. So their influence will still be there, but uh and still is there. But to see a new group like obviously like rest in peace A and stuff, but it's been a while since that. even like with Reggie gone on the America side like Doug Bowser's been there a long time but uh it's going to be interesting to see how they present their directs going forward and how they",
            "start": 1083.6
        },
        {
            "text": "that. even like with Reggie gone on the America side like Doug Bowser's been there a long time but uh it's going to be interesting to see how they present their directs going forward and how they present their IP and their content because you look at the movie voices and Mario wonder voices and they're not the same voice. It's not Chris Pratt in Mario. Like it's not like they're just like, \"Oh, it's movie time now.\" And at Donkey Kong is going to be interesting, too. You know, like what's his voice going to be in Bonanza? Is it going to be the same voice actor that we've had or along with the redesign? Is it going to be somebody new? I wouldn't be surprised if we if we see a similar Instagram post from somebody the Donkey Kong voice actor, you know, in in a month from now when Bonanza comes out and then the credits there. It's another weird thing Nintendo's been doing this, but like did you even notice turning on your Switch 2 and Mario Kart? It's just like there's there's not even",
            "start": 1132.88
        },
        {
            "text": "out and then the credits there. It's another weird thing Nintendo's been doing this, but like did you even notice turning on your Switch 2 and Mario Kart? It's just like there's there's not even credits anywhere. Like there's no like trademarks or anything. There's no there's no options page. [ __ ] Target. Wish I wish I could boot it up. [ __ ] Target. [ __ ] target. Mine's coming on Wednesday. That's [ __ ] insane. Okay, so I do have good news. Okay, for me. Okay, well, what the [ __ ] Oh, thank you, Tim. [ __ ] Tim. Walmart at any moment should be delivering a Switch to here. I was excited. I thought the good news was I could give you the Mario code. I didn't get the Mario code one, so I'm sorry, but we will have another Switch, too. And we might get some Pringles. Oh, is it a local delivery or is it like a FedEx delivery? I don't know. Okay, cuz the FedEx one doesn't have Pringles. I'm going to be so upset. I'm going to be pissed. Yeah, I was going to call out uh chat, but they",
            "start": 1170.24
        },
        {
            "text": "delivery or is it like a FedEx delivery? I don't know. Okay, cuz the FedEx one doesn't have Pringles. I'm going to be so upset. I'm going to be pissed. Yeah, I was going to call out uh chat, but they already kind of beat me to the punch. I was going to go uh actually um Nintendo's been around since the 1800s when they were aboard, you know, in a video game way. In a video game way, you [ __ ] In a video game way. They weren't making they were making goddamn cards. Yeah. You know, I don't like that [ __ ] In a video game way is like the funniest thing ever. Uh put that in the wiki page. Nintendo's been around since 1980 in a video game way. But yeah, thank you. Please put that quote me [ __ ] Uh but yeah, it's wild. Mario Kart just doesn't have an options. There's no option setting, period. Whoa. There's like when you go in when you're playing a match, you can hit start and go to a settings that's just like in-game settings. There's no options. You can't look at visual fidelity. You",
            "start": 1215.76
        },
        {
            "text": "Whoa. There's like when you go in when you're playing a match, you can hit start and go to a settings that's just like in-game settings. There's no options. You can't look at visual fidelity. You can't look at like it's [ __ ] crazy. Shout out to uh Astrobot for having the same thing. Yeah. Just like [ __ ] have fun. Play this game. Let me speed up my right stick speed, man. like the camera's so damn slow in this game. But the system menus way more robust than I expected. Yeah, there's a lot more options for this. I'm like, all right, I'm kind of happy with this. Earlier, uh, when Kevin I heard overheard Kevin and Barrett talking yesterday about, man, this battery life kind of sucks, right? I'm already this low. I said, Kevin, you could change the internal resolution on the handheld to 720p or something to make it use less battery. And he was like, yeah, but that would look ugly. It's like, okay. Okay. Um, let's move on to story number two. Nintendo Switch 2 supports your phone as a",
            "start": 1256.0
        },
        {
            "text": "or something to make it use less battery. And he was like, yeah, but that would look ugly. It's like, okay. Okay. Um, let's move on to story number two. Nintendo Switch 2 supports your phone as a camera with just two cables. Just two. And And even that is like I don't want to say it's misleading because it's accurate, but like they're tiny little guys. It's more like two dongles if you a dongle and a cable. That's what it is, Andy. Nintendo Switch. I need I need visuals. It's on it. Yeah, I'll read it and then then Raj can show you. Uh, Switch 2 supports your smartphone as a camera. fans have discovered. You just need two cheap cables to get it up and running. We already knew that Switch 2 supported other thirdparty USB cameras, and you may already have one lying around the house that you can simply plug in if it has USBC connection. But what about your phone, a device we carry around with a camera already attached? Well, as detailed by YouTube channel, will it work? Nintendo's new",
            "start": 1299.04
        },
        {
            "text": "can simply plug in if it has USBC connection. But what about your phone, a device we carry around with a camera already attached? Well, as detailed by YouTube channel, will it work? Nintendo's new console is indeed compatible with modern phones if you plug one in with an HDMI to USBC capture cable and by you plug that in and then HDMI to USBC cable to go into your Switch. Okay. Yeah. Okay. So, yeah. Little little dongly guy. Okay. And the cable guy. It may as well just be one cable. Yeah. That's how I like to because it's it's one continuous sort of contiguous as well thing. Yeah. Which, you know, I expected to see splitters and all sorts of ddads. Like when they said, \"Hey, want to use our voice chat app? You know, use this little voice and sound and you know, our stupid uh little thing that we're going to show you how behind we really are.\" Yeah. These cables are like $8 each. You don't already have them. So, I mean, yeah, if if you're this desperate to get a camera on your Switch,",
            "start": 1342.08
        },
        {
            "text": "that we're going to show you how behind we really are.\" Yeah. These cables are like $8 each. You don't already have them. So, I mean, yeah, if if you're this desperate to get a camera on your Switch, you have options. I also look at this like you're [ __ ] crazy if this is what you decide to do. Yeah, that is kind of true. What the hell? I really was trying to get one of them webcams, one of them like either the official one or the Horry one or the the um Piranha Plant one. And uh I mean they're just sold out everywhere. You can't really find any of these freaking things. That's crazy. The chat seems upset at this and I don't understand why cuz this this is more just like a try to do something weird thing, not a this should work thing. Oh yeah. cuz like what what would you want to happen? Yeah. Like I think it's on the iPhone side more than the the Switch side. It was [ __ ] Uh I mean cuz Yeah. The fact that like any USBC camera works, it's like Yeah. It the Switch side works. It's",
            "start": 1388.64
        },
        {
            "text": "Yeah. Like I think it's on the iPhone side more than the the Switch side. It was [ __ ] Uh I mean cuz Yeah. The fact that like any USBC camera works, it's like Yeah. It the Switch side works. It's hilarious. Very funny. Um the camera big surprise for me. Whoa. I mean I'm putting it in the win category. The amount of fun that we've been having with it. Like do you need it? Absolutely not. But does it take the Mario Kart experience up a level? Absolutely. Like that is the fun of hanging out with your friends. Like seeing Bless's little face spin when we hit him with the shell, it's hilarious. Like just how wide the camera is, how janky it's like it's kind of the perfect M. I wouldn't buy one. I wouldn't recommend buying one. I want to look for just any sort of USBC camera because I either that or I do this sort of thing where because I have spare Android phones at home that like are just there in case I break my current one and I can have one in the meantime, you know? I think that",
            "start": 1441.2
        },
        {
            "text": "that or I do this sort of thing where because I have spare Android phones at home that like are just there in case I break my current one and I can have one in the meantime, you know? I think that would be a great solution for someone like me, but I also kind of want that stupid ass little piranha plant. I think it is goofy enough even though the piranha plant's even worse quality. And that's what's like awesome about that because it is so bad. But I I think I will probably resort to getting these cables because I I think the gimmick and the goofiness is worth it enough for content creation and things like that. Like it'll if you were already smiling, now you're going to be laughing more seeing this stupid [ __ ] face in a circle. So funny. And I I what what I really really want is for us all to have these things because I want Nick's just like nose to his chin of just his mouth on the camera. Like that's you know that's what I want the most of this experience. Yeah. We got to make it",
            "start": 1489.84
        },
        {
            "text": "all to have these things because I want Nick's just like nose to his chin of just his mouth on the camera. Like that's you know that's what I want the most of this experience. Yeah. We got to make it happen. We have the technology. We got to figure it out. Something I want you to do. I don't know what happened. I've had my Mi since 2006. All right. And he's traveled with me all the way. Yeah. Somehow he got lost. What? In the transfer to the Switch. I saw your Mi. Did you? Yeah. He's out there somewhere. Where is he? Andy, where is he? The way you react to me. Why did he has your me? Why did you react? Like, did you? Cuz I want it back. I saw it. Like I But in my friends list, I see I'm I'm going to go grab my Switch right now. Okay, you keep yapping because Nintendo added their like I I'm so I don't Here. Misinformation, everybody. It's about to spew out of my mouth. Nintendo's platinum points situation. Like they're like, \"You can buy all these icons now. You can buy icons of all",
            "start": 1535.6
        },
        {
            "text": "I'm so I don't Here. Misinformation, everybody. It's about to spew out of my mouth. Nintendo's platinum points situation. Like they're like, \"You can buy all these icons now. You can buy icons of all the classic systems. They change the background to whatever color you want.\" And I've been seeing these online and I'm like, \"Wait a minute.\" It's like all the Game Boy Pockets. That's the original blue Game Boy Pocket I had that I play Pokemon on when I grew up. I'm like, I need that. So, I got that. I got the GameCube ones. They're like 10 points each. I had platinum points out the law. I was fine. But then all of a sudden, it replaced my Game Boy, replaced my my Mi. And then when I was on my Switch, it's just a Game Boy Pocket. And then I made I like loaded it up and I went to the Mi section and it said, \"You have no Mi's.\" And I'm like, \"I damn sure do.\" Got the TomT. Oh, yeah. In the TomT. Yeah. Yeah. But no, I'm pretty pretty sure I saw yours last night. So, what it sounded like you",
            "start": 1589.6
        },
        {
            "text": "and it said, \"You have no Mi's.\" And I'm like, \"I damn sure do.\" Got the TomT. Oh, yeah. In the TomT. Yeah. Yeah. But no, I'm pretty pretty sure I saw yours last night. So, what it sounded like you were about to ask me to make one for you. I was going to say like I feel like you are uniquely qualified as an artist to make all of us at the studio Miis. Oh, I I think I would love that. I feel like that should be a stream. That would be a cool ass stream. Yeah, look. Okay. No, no, no, no. Sorry. I made that last night out of desperation. I want my me back. I don't like this me as good. I do like this one's pose, though. That's a great I'm sitting all sexy. Yeah. Yeah. I don't know. I mean, that's that sucks that that you had one at one point made. I mean, what are the differences between this one and the other one? I don't know. Just Yeah. I just like the the other the vibes of the other one felt more like me. Do you have any photo evidence of the original me? Can we use that as like a",
            "start": 1626.08
        },
        {
            "text": "one and the other one? I don't know. Just Yeah. I just like the the other the vibes of the other one felt more like me. Do you have any photo evidence of the original me? Can we use that as like a template? I mean, I'm sure there's a let's play at some point in the 10 years. Whoa. When I go to edit icon and I go to edit character in me, it says no me found, but it's still my old photo. There's somebody here that's not missing information. That's real information. It's still my old photo. I don't know how much you could zoom in on this, but cuz the reason I was thinking about this last night, I was so I I realized it was my Game Boy Pocket and I was like I as cool as this is, I want to have it. I'm happy I have it. I want to go back to my Mi whenever whenever you know I'm sending out my friend code or you know adding friends more than I ever have in the last couple days. Uh or at least I'm going to, you know, because of Switch 2. I'm like I want them to see my little [ __ ] guy. Oh,",
            "start": 1673.52
        },
        {
            "text": "friend code or you know adding friends more than I ever have in the last couple days. Uh or at least I'm going to, you know, because of Switch 2. I'm like I want them to see my little [ __ ] guy. Oh, right there on the bottom left. That's weird, too, though. I'm making a face that I'm not supposed to make. That's not the face I was making before, man. A fake me. What's happening? Maybe someone else made this one for me. I don't know. This is This is a a Christopher Nolan thriller. We got to figure this out. We got to get to the bottom of this. But well, here's I think this is a serious question though, Andy. Where are our Miis? Where are the Mi at? If your Mi's gone and my are they hanging out together? Because the reason I thought about it is yesterday uh I I saw your Switch was at my desk and I was looking at it and I saw your little Mi and I was like, \"That guy's [ __ ] adorable.\" And I love that you had the little yellow background and you had the little like peeking out the",
            "start": 1712.08
        },
        {
            "text": "my desk and I was looking at it and I saw your little Mi and I was like, \"That guy's [ __ ] adorable.\" And I love that you had the little yellow background and you had the little like peeking out the corner like like look at me and like you were wearing yellow and at some point when you make your meet they asked you like what's your favorite color or whatever and like you chose yellow I was red on purple. I was always red on purple. Were you? Yeah. Yeah. Yeah. 100%. I think you're just so striking strike by the yellow. Well, when I saw you today I was like he's wearing the same [ __ ] color. I don't know, man. You're you're in a different universe. I'm in a different universe. This is Greg Miller type. Somebody [ __ ] find by me. Find Andy's me. I I I I saw your me. You did. You really reacted as if I want it back. As if you thought Moose had been dead for 8 years and I was like, I saw him, Tim. Oh my god. Let's go to the ads. This episode's brought to you by XRE. Y'all know that a",
            "start": 1751.04
        },
        {
            "text": "reacted as if I want it back. As if you thought Moose had been dead for 8 years and I was like, I saw him, Tim. Oh my god. Let's go to the ads. This episode's brought to you by XRE. Y'all know that a few months ago, my life changed forever when I brought a pair of X-Real 1 AR glasses on a long flight to New York. I legit could not believe how easy it is to use and high quality my experience was playing games, watching movies, TV shows on the plane without just too much extra stuff around me or especially not a giant goofy headset around my head. No joke, this is my favorite new tech product in years and it has earned a permanent spot in my travel bag. It is only hard to believe that it works as well as I'm saying until you try XR1 AR glasses for yourself. And then you will see that the future is now. The tech is here. Connect XR1 glasses to wherever you are playing. Whether it's a handheld console, a PC, phone, home console. You just get a massive 150in virtual screen anywhere,",
            "start": 1792.64
        },
        {
            "text": "the future is now. The tech is here. Connect XR1 glasses to wherever you are playing. Whether it's a handheld console, a PC, phone, home console. You just get a massive 150in virtual screen anywhere, anytime for any game. Gaming on the go like a long haul flight, you need the XR 1. Neck starting to hurt from staring down at your handheld? We've all been there. You need an extreal one. A screen as big as your wall. Instant plug-andplay with all of your devices via USBC. Built-in audio with sound by Bose. Anchoring your screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full HD. These are what make XR1 a musthave. And we hear XR1 Pro is coming soon with an even bigger virtual screen. Hit our link below to get your XRE glasses today. There's nothing better than when a sponsor of kind of funny is something that we are legitimately obsessed with. And that is exactly the case here with XRE. You're going to hear me talk about these forever. Go to xreal.com for more.",
            "start": 1844.72
        },
        {
            "text": "a sponsor of kind of funny is something that we are legitimately obsessed with. And that is exactly the case here with XRE. You're going to hear me talk about these forever. Go to xreal.com for more. Braden in the chat says Tim doesn't know what the hell he's talking about. Braden, help me. I don't know what I'm talking about. How do you find the Miis? The Miis are gone. Real talk. Jokes aside, Are your Mi's gone? Like, can you search check your Switch 2 if you did the transfer? Are your Miis there? And if they're not, where are they? Cuz I went to the system settings thing and I went to the MI section and I go to create edit a me and it says in the MI list, you don't have any Mi characters. Select Select create new Mi to make one. Not Lick says mine are still there. Andre Morton says mine. Do you have an uncle Nintendo? Oh my god. Mine is gone. Did the transfer says Martin Murphy, man. Mine is gone also, but it's still my Nintendo account picture. That's the situation I find myself",
            "start": 1898.56
        },
        {
            "text": "Do you have an uncle Nintendo? Oh my god. Mine is gone. Did the transfer says Martin Murphy, man. Mine is gone also, but it's still my Nintendo account picture. That's the situation I find myself in as well. Everybody # helpmei. # helpmi. That's really good. Story number three. Retroid introduces a new dual screen add-on. You see this, Andy? Have you seen this? No. It's pretty [ __ ] sweet. Uh, introducing the Retroid Dual Screen add-on. Enjoy dual screen gaming on your Retroid Pocket 5, Retro P Retroid Pocket Mini, and Retroid Pocket 4 Pro. Uh, this is here. Retro Pocket 5 like the one I have. You recently got the Oh, it's right there. Right here. Boom. Retroid Pocket Flip 2. Flip two. Yeah. And god damn, these are some nice devices. I'm really unhappy though that Tam also bought the same one. Yeah. And I saw him post on Instagram before mine arrived. I was like, \"God damn it.\" Still, why did I get the GameCube one? Cuz it's cool as [ __ ] It's cute. But I I really regret. Here's my",
            "start": 1948.88
        },
        {
            "text": "one. Yeah. And I saw him post on Instagram before mine arrived. I was like, \"God damn it.\" Still, why did I get the GameCube one? Cuz it's cool as [ __ ] It's cute. But I I really regret. Here's my thing. I didn't realize the lights would be programmable and changeable. Yeah. I cuz I see the black one and it has the blue lights, which looks slick, but I'm like, but I'll eventually probably want to change these or whatever. Um, which I do, but they like I I have them yellow lit and purple lit right there. Tight. But I didn't know you could customize those. I probably just should have like read a little bit deeper to see exactly what could be done. There's Vagrant story right now. Really great video game. Um, but unfortunately, yeah, no add-on screen for this and it makes total sense cuz this is a clam shell. Yeah, you got to pick and choose here. But yeah, I have my pocket five which is more of a VA shape and goddamn I love it. I think it's the same screen which is one of my favorite",
            "start": 2005.6
        },
        {
            "text": "is a clam shell. Yeah, you got to pick and choose here. But yeah, I have my pocket five which is more of a VA shape and goddamn I love it. I think it's the same screen which is one of my favorite screens I've ever seen. OLED screen and it makes me so sad with the Switch. I know you can't be those guys, Andy. know we are and we're going to continue to be the thing that I need to let everybody know and I need to stand by this and if I need y'all to correct the misinformation if people see people misquing me on this. Okay. The switch to screen is great. Really really good. It's great. But I wish it was OLED. That is the truth. Both can be true. Yeah. And they are true. No, I I I totally agree. It's really like we're going to hey we're going to get you a new car and it's going to be the fastest machine, most powerful [ __ ] thing you've ever seen in your life. There's no power windows though or power seats. Like it's all manual and it's like and then you go back to your old car, you're",
            "start": 2045.6
        },
        {
            "text": "machine, most powerful [ __ ] thing you've ever seen in your life. There's no power windows though or power seats. Like it's all manual and it's like and then you go back to your old car, you're like, \"Yeah, this thing is worse, but power windows are pretty sick.\" And looking back at my OLED Switch, I'm like, \"Oh man, that's a really pretty screen.\" It's with the Switch 2 with the experience playing Mario Kart World. It's like I it is not a lesser experience because I don't think less of the game in my time with the game because of playing on on the Switch 2 screen. I would think more of it if I was playing it on the OLED. OLED enhances my gaming experience. And one other thing I will toss in there, I had plugged it into my stream last night or into my OBS and just to kind of like look at things and turned off HDR because that'll kind of screw up the way the feed will look. And then realized just how you need to have HDR if you want this thing to look good because I real, you know, I",
            "start": 2088.8
        },
        {
            "text": "things and turned off HDR because that'll kind of screw up the way the feed will look. And then realized just how you need to have HDR if you want this thing to look good because I real, you know, I kind of forgot that it was off. And I'm in bed just kind of fiddling around with the Switch, too. I'm like, man, this doesn't look great right now. Like, this just doesn't it's And it's also maybe it it legitimately maybe Brilliant Diamond Pokemon cuz that art style was not great to begin with, right? But something about that game I'm walking around like, \"God, this this is just not an appealing screen to be looking at.\" I was like, \"Oh, I have HDR off.\" Damn, you need that [ __ ] on by default. Oh, yeah. You're a silly ass if you ever turn it off. Absolutely. To, you know, conserve battery. you'd I'd rather like take 2 hours less of battery and experience a better screen. I saw you popping into Links Awakening last night. Oh my god, I love the little friend thing just popping up",
            "start": 2132.32
        },
        {
            "text": "you'd I'd rather like take 2 hours less of battery and experience a better screen. I saw you popping into Links Awakening last night. Oh my god, I love the little friend thing just popping up constantly. People just playing five minutes of a game just to see, oh, it runs good. It just like more than ever, we need Street Pass. We need something like this cuz it just I miss this so much. And I barely not No, I didn't not to say I barely played my 3DS. I played a decent amount of it, but Street Pass is such a cool, neat thing to make the game, make the console feel more than a console, and I wish we had that back. And I'm kind of getting those little glimpses of seeing friends log in and just makes you happy. And obviously that's just a notification, so get over it. But, you know, I feel like it could work in this era in a different way. But, uh, my homie Zeon from Nintendo Life, uh, who I met last year at Summer GameFest, um, and I've seen now a couple times at different events. He",
            "start": 2176.96
        },
        {
            "text": "like it could work in this era in a different way. But, uh, my homie Zeon from Nintendo Life, uh, who I met last year at Summer GameFest, um, and I've seen now a couple times at different events. He takes his 3DS with him everywhere, has Street Pass on at all times. And like he there's like he put out an article like showing like traveling the world with this thing like in 2025, which is awesome. But we were at the uh, Nintendo Switch 2 launch event or not launch event, preview event in New York, and he was freaking out because there was someone else there that had it on, too. Oh, nice. It's just like it's just this fun thing about where are they? U going back to this uh retro dual screen thing though. Super cool because we've seen kind of uh retro games evolve as times moved on of what retro means, right? And we're at this point now that retro can be all the way up to a PlayStation 3. Like we're in the definitively HD era being retro. and uh the fact that we now have multiple devices",
            "start": 2221.64
        },
        {
            "text": "means, right? And we're at this point now that retro can be all the way up to a PlayStation 3. Like we're in the definitively HD era being retro. and uh the fact that we now have multiple devices that are trying to emulate the experience of a DS of a 3DS but trying to make them as advanced as possible. Even a Wii U, right? Like thinking about um I forget the the other it might be a Neo that put this one out. The first dual screen like dedicated handheld that they that they put out that was very very expensive. Like um we're still not at that point that there that it's like at a price that makes sense for most people. Um, but you could play like Legend of Zelda, allegedly Wii U edition on this thing with both screens on one handheld. It's kind of cool, right? Like the tablet and the um the screen. But anyway, cool stuff. I love that we're even at a point that a screen that small that just attached via USBC and you can have this experience. Like hell yeah, man. This tech would have",
            "start": 2267.2
        },
        {
            "text": "the screen. But anyway, cool stuff. I love that we're even at a point that a screen that small that just attached via USBC and you can have this experience. Like hell yeah, man. This tech would have blown my mind like 10 years ago even. I'll tell you what made me really sad. booting up Pokemon Arus and it still being 30 capped. You know, it's not this uncapped thing that might hit 42, but usually it's going to be 26 or whatever frames per second. It it is a it is a capped out at 30 title. Um, in addition to or no, no, on the flip side, kind of neat being in in Metroid Prime uh remastered. Yeah. And I was using the mouse. Wait, what? Yeah. No way. Oh, yeah. You use the mouse. Uh, it has all the new settings in there. Wait, excuse me. Yeah, yeah, yeah, yeah. I'm going to show you right now. Tell you right now. Wait, what? How has no one talked about this? Cuz I'm the number one game on this. I mean, [ __ ] Let's break some news right here. Or are you spreading misinformation? No, no,",
            "start": 2312.48
        },
        {
            "text": "Tell you right now. Wait, what? How has no one talked about this? Cuz I'm the number one game on this. I mean, [ __ ] Let's break some news right here. Or are you spreading misinformation? No, no, no, no. Was this a dream? Unless the gummy got to me too much, but I'm pretty like, were you watching me play Metroid Prank 4 at the Where's his me at? Wait, what? Yeah. The only in chat says, \"No way it does. I tried last night.\" Conflicting information. No. Whoa. No. No. No. What? I don't moving. You started moving. No. Oh, maybe I was using a pointer. No. No. I was flicking. Was I flicking with the mouse or flicking with the player? Let's see. There's no way it has to start a new game. It takes a long time. It's a long cut scene. Oh my god, that's so freaking funny. All right, I'm going to keep going. Story number four here. Oh [ __ ] Cool Greg is bringing a gift. Thank you, Cool Greg. He brought us pickles in a bag. Pickles in a bag. Pickles in the bag. Do you want the pickle in a pouch?",
            "start": 2364.48
        },
        {
            "text": "going. Story number four here. Oh [ __ ] Cool Greg is bringing a gift. Thank you, Cool Greg. He brought us pickles in a bag. Pickles in a bag. Pickles in the bag. Do you want the pickle in a pouch? Hot flavored or do you want the big papa, Andy? I think you um are they cold? They're refrigerated. Oh yeah. Okay. Oh [ __ ] Let's fridge these up a little bit. No refrigeration needed. No, but I want I I want it. We will eat these pickles today, everybody, in one bite. No, I can't do that. I have a try harder. I don't need to explain. Um, it's a long intro. Sorry. Thank you so much. Cool Greg, best brother in the world, everybody. It's so smooth though. The visuals are so smooth. Yeah. God, no mouse controls though. Come on, Andy. Walton Gogggins is set potentially for the new Street Fighter movie. This comes from the Game Awards Twitter. He's in talks to play Anne Bison in the Street Fighter movie. Source: The Insider. Okay, this is all starting to fall apart a little bit, [Laughter] but",
            "start": 2416.0
        },
        {
            "text": "This comes from the Game Awards Twitter. He's in talks to play Anne Bison in the Street Fighter movie. Source: The Insider. Okay, this is all starting to fall apart a little bit, [Laughter] but it's for the Game Awards. Well, yeah, the [ __ ] I don't know, man. Insider. I I not somebody that I necessarily believe. They've gotten a lot right in the past, but it's not spelled like Snyder Cut. No, no, no. But I I know who this is, though. I know who this is. Um, but okay, I I don't want to be too negative about it. They have got things right in the past, but it's not like, you know, I see Game Awards without reading the tweet, I'm like, \"Okay, this must be at least somewhat legit.\" I don't know. But I want it to happen. This is inspired casting. One, Walton Gogggins is [ __ ] awesome. Two, he'd pull off M Bison. How would he be that jacked, though? Like M Bison is such a Well, all Street Fighter characters are incredibly jacked until they're not. They have real no realistic proportions.",
            "start": 2471.6
        },
        {
            "text": "pull off M Bison. How would he be that jacked, though? Like M Bison is such a Well, all Street Fighter characters are incredibly jacked until they're not. They have real no realistic proportions. like if like Chun Lee as a human is going to look different than Chunley in the game in specifically the recent games, you know. They also have more news from their thing. They said Walton Gong's Orville Pek and Eric Andre circling the movie. So, I don't know. I don't have any more because it's a it's behind a payw wall, but like that's wild. It's a weird ass. I mean, I'm [ __ ] here for it. I love Street Fighter. I I particularly love fighting game video game movies. No mouse because they can't be good. You can't go into them expecting them to be good movies. They're stupid characters based on archetypes to fight and punch each other in cool ways and use their special moves. What was the fighting game movie that came out about six or seven years ago, maybe eight years ago? Was it Tekken? Was",
            "start": 2521.6
        },
        {
            "text": "to fight and punch each other in cool ways and use their special moves. What was the fighting game movie that came out about six or seven years ago, maybe eight years ago? Was it Tekken? Was it There was an MMA fighter possibly who was the main role. It's not I'm not talking about Mortal Kombat. I know that that already came out and they're already working on too. Um, but there was definitely what what like I don't remember if it was a indie movie or if this was something larger than an indie fan sort of thing. No, definitely not Dead or Alive. Definitely. There was a Tekken in Japan, but that was like 20 years ago. No, I'm I remember hearing this news when I was working at Best Buy and I specifically remember shelving uh the inventory and I had uh Super Punch Out on Wii and I was like restocking that listening to probably well that okay I mean if it was that time it was probably Street Fighter Chun Lee Street Fighter Evolution I think they called it was Dragon Ball Evolution Street",
            "start": 2569.12
        },
        {
            "text": "that listening to probably well that okay I mean if it was that time it was probably Street Fighter Chun Lee Street Fighter Evolution I think they called it was Dragon Ball Evolution Street Fighter Legends Balls of Fury. I'll look it up. I'll look it up. Yeah, look that up cuz the point that I'm making about the like these movies aren't going to be good. I love Dead or Alive. It is a one of the worst movies I've ever seen. Roger, you were looking for bad Oh [ __ ] Like shitty move like Madam Web type movies. Dead or Alive. Seriously. And House of the Dead. Two U classics. But Dead or Alive is I mean they they come up with an excuse for them to have health bars. It's awesome. Oh, that's so sick. It's [ __ ] awesome, dude. Oh, it's definitely the Tekken movie. Tekken Kazya's Revenge. This is 2014. Awesome. It's for 9,000 says, \"Yeah, there was a live Tekken movie in the US. Sick.\" Yeah. I never saw that. I need to put it on the list. Yeah. Like there's You go into these movies kind of",
            "start": 2621.76
        },
        {
            "text": "is 2014. Awesome. It's for 9,000 says, \"Yeah, there was a live Tekken movie in the US. Sick.\" Yeah. I never saw that. I need to put it on the list. Yeah. Like there's You go into these movies kind of assuming this is We're going to be watching this to kind of laugh because there's Yeah. There's It's such a tough task to try to make these move to to try to make a movie from a fighting game genre. something, you know, with substance. And if you did, like, congratulations. You're doing too much. That's not what we're here for. Yeah. It's just simply not. I want to be [ __ ] cool. I want to see the moves. Dope choreography. Yeah. Say the catchphrases. Like, do it. It's a theme park movie. Go for it. Uh, story number five. Spongebob Squarepants game rated ahead of official reveal. Damn. Maybe this was the leak I was talking about. [ __ ] THQ Nordic seemingly preparing to announce a new Spongebob game as spotted by Gamatsu. Spongebob Squarepants: Titans of the Tide has been classified in",
            "start": 2668.24
        },
        {
            "text": "this was the leak I was talking about. [ __ ] THQ Nordic seemingly preparing to announce a new Spongebob game as spotted by Gamatsu. Spongebob Squarepants: Titans of the Tide has been classified in both South Korea and Germany. It's an action game with a 12 plus classification, noting it includes minor violence as well as explosions and minor bodily harm. The German rating confirms the title's coming to PS5, Xbox Series, and PC, although it's not clear when. However, THQ re released a Spongebob Squarepants game trailer last Halloween, teasing an allnew adventure coming in 2025. This is a leak I don't mind, you know? Yeah. Like, all right, good. get that. You know, now when we see that, we're not like, \"Ah, it's one of those that we go, \"Okay, we knew this was gonna happen. It's okay. We can get I hope it has King Neptune in it. He's a character from the movie that they never really talked about afterwards.\" Uh, yeah. Is it no longer canon? Uh, they just kind of moved past it. Yeah. I",
            "start": 2715.04
        },
        {
            "text": "get I hope it has King Neptune in it. He's a character from the movie that they never really talked about afterwards.\" Uh, yeah. Is it no longer canon? Uh, they just kind of moved past it. Yeah. I I assume it's I assume it's still canon, but we just we just kind of moved past it. Loose ends. What are they No. Are they not proud of it? They should be cuz it's a crap. But you know who the voice actor was? It was the guy It was the dad from Arrested Development. So, I'm assuming they No, no, like the like the the one that was in prison. Jeffrey Tambour. Jeffrey Tambbor. Yeah. Yeah. Yeah. So, I assume they just can't afford him. So, sucks. Okay. Belro says, \"Why y'all acting like a new Spongebob game isn't hype?\" I think we're just not personally hyp. I'm sure somebody is. And like, it is cool. It's a new game coming out. Wait, wait, wait. This is [ __ ] insane. The chat's saying that the Spongebob movie happens at the end of the timeline of Spongebob. That's That's new news to me. So, it",
            "start": 2756.96
        },
        {
            "text": "It's a new game coming out. Wait, wait, wait. This is [ __ ] insane. The chat's saying that the Spongebob movie happens at the end of the timeline of Spongebob. That's That's new news to me. So, it ends. That's crazy. It's the book end. That's so sick. That's so cool. How many Spongebob movies have there been? Cuz I I remember when Simpsons movie came out and that felt like, holy [ __ ] there's just they're doing a movie. So sick. Spider Pig was there and the movie was fine, but like shut the [ __ ] up. I thought the movie was rules. Oh, no. I'm not talking like whatever. Like it's not like the best thing in the world, but like it's at the very least it's it's not bad, I would say. Okay. They didn't make a sequel is my point. Like that was it made money. There was a Simpsons movie and it did what it did. They didn't do more. Spongebob movie. I remember being like, \"Oh my god, they're making a Spongebob movie. Good for you, Sponge. Good for you.\" So, and then there's been like 12.",
            "start": 2798.24
        },
        {
            "text": "it did what it did. They didn't do more. Spongebob movie. I remember being like, \"Oh my god, they're making a Spongebob movie. Good for you, Sponge. Good for you.\" So, and then there's been like 12. Okay. Wait. No. So, they made they made the one, right? And it was it was successful. And then they never made a sequel in theaters until like 10 years later. Like pretty recently. They made the sequel. Sponge Out of Water. Yeah. And then they made another one. And now they're just making too many of these and they're all like straight to Netflix and they're like CGI hybrids. 2004 was the movie. 2015 was Sponge Out of Water. Yeah, exactly. 2021 Sponge on the Run. That would just make too much. 2025 Search for a Squarepants and the Netflix spin-off films in 2025 was the Sandy Cheeks movie and 2025 Plankton the movie. Yeah. And then and then uh No way. And then Patrick has a show as well, man. Yeah. It sucks. Damn. The movie The movie real good though. The first one. The first one's",
            "start": 2840.48
        },
        {
            "text": "and 2025 Plankton the movie. Yeah. And then and then uh No way. And then Patrick has a show as well, man. Yeah. It sucks. Damn. The movie The movie real good though. The first one. The first one's incredible. I love this. I'm a goofy goober. You know how much chat knows that? It It's It's six years past my time. You know what I mean? Or before my time. What's the word I'm looking for? If I was 30, I'd give a lot of shits. I'm not 30, you know? Like, I'm not Barrett or Roger or Blessing. And that was sort of I watched Spongebob still, but I was like, you know, I'm I'm definitely phasing out. I feel like me and you are the exact same with this where it's like we're we're season one and two Spongebob boys. Like we watched them like we've probably seen every episode of season one and two season one and two and then after that just no. And they they went forever cuz like Spongebob was like the turning point for Nickelodeon Disney of like there was like rules in place of like shows aren't",
            "start": 2879.92
        },
        {
            "text": "one and two and then after that just no. And they they went forever cuz like Spongebob was like the turning point for Nickelodeon Disney of like there was like rules in place of like shows aren't allowed to go past three seasons and then Spongebob in that era broke that and that they there used to be ways that they would come out around like come up with like loopholes. That's why we kept getting like spin-offs of like Hannah Montana and like Sweet Life and then The Sweet Life went on a boat. I didn't know that's what these rules were. I didn't know there were rules in place. So, we paid them less, right? Yeah. So, because when you hit a fourth season that like are we talking there was like all I It's a contract thing. We were spreading misinformation like SAG. Yeah. That stuff. But then on top of that, there's also rules with like children's shows and like children's work rates and stuff. Oh, yeah. Okay. There's a lot of documentaries on YouTube about it. Okay. Yeah. Story number",
            "start": 2927.44
        },
        {
            "text": "on top of that, there's also rules with like children's shows and like children's work rates and stuff. Oh, yeah. Okay. There's a lot of documentaries on YouTube about it. Okay. Yeah. Story number six. Tencent just acquired a 15% stake in Arrowhead Games. This comes from Connor Macar. Dope name at Eurogamer. Tencent acquired 15.75% uh stake in Arrowhead Games, the development studio behind Hell Divers 2 for 80 million. Tencent has previously founded or acquired shares in a variety of video game companies, including a new gaming venture with Ubisoft Games, total ownership of Riot Games, a major ownership position for 10 Chamber, and its own publishing arm, Level Infinite. Speaking to DI founder, uh, John Pilesty, uh, stated that bringing 10-centent in as partial owners opens up opportunities for China as a market. Gaining access to the Chinese player base is the holy grail in the gaming industry. The remaining 84.25% 25% of shares are owned by Arrowheads founders. China, this isn't",
            "start": 2966.32
        },
        {
            "text": "for China as a market. Gaining access to the Chinese player base is the holy grail in the gaming industry. The remaining 84.25% 25% of shares are owned by Arrowheads founders. China, this isn't good. Yeah, that's all you got to offer? Yeah, I mean enough said, right? Like that's bad. Like this continues to just be like, oh man, they are gaining more and more power in all of the players. In all of the Yeah. and all of the major publishers, you're starting to see them sort of uh, you know, get their little their little fingies in in every pocket. Now, when you hear the devs say this, how does that make you feel of like China player base, you know, like we love that's the holy grail? Feels kind of icky. I don't know why. I just like bums me out. And then I wonder, you know, when all of these acquisitions started happening several years ago and we were seeing big players with big money kind of just, you know, act like it's just a toy and then you go, \"Wow, what a great infinite growth.",
            "start": 3014.56
        },
        {
            "text": "acquisitions started happening several years ago and we were seeing big players with big money kind of just, you know, act like it's just a toy and then you go, \"Wow, what a great infinite growth. Everything's great.\" And then you start to suddenly see things not working out well and you go, \"Oh no, here we go.\" And then things really start kind of going bad. Yeah. And I think that's where we're at. Yeah. Story number seven. Big Cyberpunk 2077 updates were thought to be done, but 2.3 patch launches soon. This comes from Eddie at GameSpot. CD Project Red's pledged even more ongoing support for Cyberpunk, saying it has at least one more patch in the works for the popular RPG. Uh, as part of the latest Red Streams event, senior community manager uh Alicia said the studio is continually asked if it will release more of DLC or updates for Cyberpunk. It remains to be seen if there's any new content in the works, but the game is indeed getting a big new update, 2.3 at the end of June. They",
            "start": 3067.2
        },
        {
            "text": "if it will release more of DLC or updates for Cyberpunk. It remains to be seen if there's any new content in the works, but the game is indeed getting a big new update, 2.3 at the end of June. They previously had indicated that Cyberpunk 2077's 2.2 update would be the last big one, but that's no longer the case. That last one wasn't the last one, Coera said. We're not done yet. The 2.3 update slated to launch on June 26th, but as of yet, there's no word as to what's in it. In any event, uh they said that CD Project Red will share more information soon. So, for now, we ask for a bit more patience. Let the team cook. Uh, meanwhile, uh, CG Project Red's Powell Saskos chimed in to say, \"We have been cooking for you in secret for a bit. As usual, I'm taking care of the update personally, and we will communicate more when it's ready. Much love, Chums.\" The Vince Carter meme. Uh, I got one more in me. Yeah. Wonder what it could be. Wonder what sort of systems they're sort of uh, trying to",
            "start": 3111.44
        },
        {
            "text": "we will communicate more when it's ready. Much love, Chums.\" The Vince Carter meme. Uh, I got one more in me. Yeah. Wonder what it could be. Wonder what sort of systems they're sort of uh, trying to implement or trying to better. Uh, oh, this is y'all playing on Switch last night or two nights ago. Yeah. And you said that the performance was like pretty good and not a bad time. No, it was not bad at all. Uh I mean it's 30 uh that I can see. I think maybe the performance is 40 and then the quality is 30. Uh but either way, we're playing on quality and it was totally fine. Uh yeah, it looked good. Uh it passed the the Nick smell test. So Okay. Wow. Wow. And Nick was playing on the 5090 like Yeah. three seats away all night. So yes, seconds prior to that. Um yeah, that's super exciting. I mean, I'm I'm pumped for people like Chris Anka, who has played through Cyber Punk like four or five times already. I I wonder what this could possib Like I don't think you necessarily even tease like a",
            "start": 3152.64
        },
        {
            "text": "I'm I'm pumped for people like Chris Anka, who has played through Cyber Punk like four or five times already. I I wonder what this could possib Like I don't think you necessarily even tease like a we're still cooking sort of thing unless it's something, you know, substantial. Otherwise, I think it could just be, you know, like I really hope it's not just systems updates. Yeah. Or we worked on this mechanic or whatever. I hope it's like something kind of meaty. Yeah, I'm interested in what it's going to be. I expect it I would expect it to be more like little status things or little tiny like just like patchy stuff, but I mean the fact that they're even talking about it this way like the we got one more, it's like all right, cool. Yeah, we shall see. Seems like it could be uh I mean if they introduce like a new NPC or a new mission or something like that, I think it could be really neat. Um, it'd be big though, Andy, if they announced new content for uh, Cyberpunk 2077, not just little",
            "start": 3197.04
        },
        {
            "text": "introduce like a new NPC or a new mission or something like that, I think it could be really neat. Um, it'd be big though, Andy, if they announced new content for uh, Cyberpunk 2077, not just little doodads and whatnotss. But I'm not looking for something big right now. I need something small. Very, very small. Where would I look? You go to our last story, the Wii News Channel, where we cover all the small news items you need to know about. It's true. I thought you were going to say, \"Where would I look for my Wii?\" Where's my Where's Where's my me? Looking for my me. Other people in chat were saying their mess are gone, too. This is an epidemic, everybody. It's It's just like uh I mean, it's just like the leftovers. It is HBO. It is. They're just gone. One day, the Miis vanished the day the Switch 2 was launched. Millions of Miis. Uh Black Myth Wukong is coming to Xbox Series on August 20th, and everyone's being completely normal about this. Oh my god. Real talk though, there's a",
            "start": 3242.72
        },
        {
            "text": "the Switch 2 was launched. Millions of Miis. Uh Black Myth Wukong is coming to Xbox Series on August 20th, and everyone's being completely normal about this. Oh my god. Real talk though, there's a conversation. We don't need to have it right now because we're running a little long. But like so interesting that after the year we had of back and forths of why is it not on Xbox? The devs say one thing then others says another. Is it a Sony exclusive deal? Is it not? Why if it was a deal, why is Sony not talking about it being a deal? And now here a year to the day later it's coming out on Xbox. What the [ __ ] You gotta, you know, when you copy your friend's homework and you change the words around, you got to release it like a year and six weeks after or something just to like throw people off just a little bit. You can't do it a year to the date. Um, but I did see a lot of people saying, \"Everybody, you owe Paul Tassy an apology and you owe all these people who said, \"Yeah, it seems",
            "start": 3288.72
        },
        {
            "text": "off just a little bit. You can't do it a year to the date. Um, but I did see a lot of people saying, \"Everybody, you owe Paul Tassy an apology and you owe all these people who said, \"Yeah, it seems like there's an exclusivity deal.\" And then a lot of people got angry and and things like that. Yeah. Uh, and then Tony X Pros Skater 3 and 4 is going to launch on July 11th, uh, alongside the other versions of the game on the Switch, too. Kind of expected this, but nice that it's officially announced. Uh, and then from IGN via Noble, Universal Studios Halloween Horror Nights in both Orlando and Hollywood's getting a new haunted house based on Prime Videos, Fallout series, and Five Nights at Freddy's. Oo, pretty cool. That could be really, really awesome. Pretty cool. Um, that's it for Wii News. So Andy, did we get confirmation that you in your gummy splender playing the Switch 2 last night actually booted up Metroid Prime Remastered, thought you were in mouse mode, but instead just had it",
            "start": 3333.04
        },
        {
            "text": "So Andy, did we get confirmation that you in your gummy splender playing the Switch 2 last night actually booted up Metroid Prime Remastered, thought you were in mouse mode, but instead just had it as a mouse and jiggled it around and it moved because it was a pointer. I was cuz I think that's what happened. I was testing out the mouse and then in my mind I looked at the four controller options for Metroid Prime Remastered and there's like dual stick and there's normal and then there's hybrid and there's something and to my and in my mind's eye I was like there was mouse there cuz I because I remember flicking this [ __ ] thing to to turn Samus and then I remembered that would work. I remember thinking of that one tick tocker who plays Call of Duty with like motion controls and he's always like flicking to do crazy turns and then I remember just flicking with a mouse. So that's why I think I it was sort of mixed up. But also I knew that you were missing your me and I was going through",
            "start": 3375.36
        },
        {
            "text": "like flicking to do crazy turns and then I remember just flicking with a mouse. So that's why I think I it was sort of mixed up. But also I knew that you were missing your me and I was going through it. I was going through a really, you know, tough tough moment as well. I mean we we were accurate. We told people in being in the show misinformation is abound. So we accept no responsibility for you being misinformed. Thank you. Let's get to some super chats. But before we do that, let's see if we got anything wrong, which again is impossible when Nintendo started in the 1880s. Let's see. Oh god. Let's see. Oh, there's some [ __ ] here today that I am just not even I'm not here for it. Ignore it. I'm ignoring it. I'm entirely ignoring it. Let's see. Let's We reject facts just today. Okay, here's a cozy bear. I appreciate this one because as I said it, I was like, I'm not sure about this. Uh, quick little correction. Tim implied that the 2006 Dead Live movie was directed by UI Bull, but",
            "start": 3427.52
        },
        {
            "text": "a cozy bear. I appreciate this one because as I said it, I was like, I'm not sure about this. Uh, quick little correction. Tim implied that the 2006 Dead Live movie was directed by UI Bull, but it was actually directed by Cory Young, a Hong Kong director who also directed No Retreat, No Surrender, and The Transporter. You Bull did House the Dead, but also did an older Dead or Alive, did he not? I don't. No, never did A Dead or Alive. I think there was only one Dead or Alive, pretty sure. But you did a bunch of shitty video game movies, but in in that same era, which is why I conflated the two. But definitely want to give uh all the credit to Coron for making one of the best worst movies I've ever seen. This guy also directed Transporter. Is that what they're saying? Yeah. Oh my god. Sick. I [ __ ] love Transporter. Transport. I've never seen him. I need to. And I've never seen Crank. I've only seen Crank get posted. The Alamo was showing Crank 2 the other day. Yeah, they got a bang.",
            "start": 3474.92
        },
        {
            "text": "I [ __ ] love Transporter. Transport. I've never seen him. I need to. And I've never seen Crank. I've only seen Crank get posted. The Alamo was showing Crank 2 the other day. Yeah, they got a bang. They got a bang. Crank it out. Oh my god. Um, Robbie Rob says, \"Switch to USB camera.\" Although this Nintendo website says USBC camera, you can in fact plug in a USBA camera like a Logitech C920 or a cheap other one. Uh, like the into the dock, I guess. Oh, yeah. Um, Logitech Brio 4K USBC camera, however, does not work. That's bizarre to have the most popular USBC camera there is not work. Well, to be fair, the 4K one came out much later and everybody probably still had the 920s that did 1080p or 720, you know, but I still got a couple of those laying around. So, that's that's great news. I'm going to plug it into that dock, see what happens. Yeah, on [ __ ] Saturday when my Target target, man. God. Uh, Bib Bid Big Bad Beluga says, \"For live action Disney shows, the previous and current",
            "start": 3514.72
        },
        {
            "text": "going to plug it into that dock, see what happens. Yeah, on [ __ ] Saturday when my Target target, man. God. Uh, Bib Bid Big Bad Beluga says, \"For live action Disney shows, the previous and current soft limit is 65 episodes. Animated Disney shows had a soft limit of 52 episodes.\" Uh, hence the theme song of Venus and Ferb saying there's 104 of Summer Vacation. 52 episodes times two. Holy [ __ ] No way. That's crazy. Venus and Ferb was only the second Disney animated series to break that rule after Kim Possible. Wow. I saw somebody in chat say that that was uh that that's so Raven is the one that kind of yeah like that era it's all you know Spongebob that's so Raven Possible it's all the same time frame bunch of yeah bunch of uh trailblazers uh Casey says Nintendo's first console the color TV game was 1977 I got to give it to you Casey you're right the video game my quote's wrong correct it on Wikipedia everybody okay that is you're wrong let's get to the super chats Oh wow, we got a",
            "start": 3569.28
        },
        {
            "text": "TV game was 1977 I got to give it to you Casey you're right the video game my quote's wrong correct it on Wikipedia everybody okay that is you're wrong let's get to the super chats Oh wow, we got a lot of them today. Snugs, birthday tax. Happy birthday to my birthday twin G. Happy birthday, Snugs. Don't try to take away. What the [ __ ] Where are you? Why aren't you paying [ __ ] You know what I mean? Yeah. Where? Yeah. Gio, come here. [ __ ] pay us money. Dolphin Cornin says, \"Andy, why did you leave Mike hanging last night?\" God, Mike just kept doing the one more but hit the button. Hit the button. I'm like, \"No, I shouldn't.\" And I still hit it one more time and we beat the boss right after. And I was like, \"All right, that's it for me.\" No, you got you can't stop. The momentum is happening. I was like, \"No, you just don't want to be lonely. That's all this is. You don't care about fighting the third boss. You just don't want to be alone right now.\" Um, but if you get if you fight",
            "start": 3619.12
        },
        {
            "text": "I was like, \"No, you just don't want to be lonely. That's all this is. You don't care about fighting the third boss. You just don't want to be alone right now.\" Um, but if you get if you fight and beat three elder ring night boss in a row, you get the achievement called the turkey achievement. And uh so we have one more to go. Now, if we don't do it, I already know he's going to blame me and say, \"Well, you killed the momentum by ending.\" You know, I know what he's going to say already. Um, but no, I did not leave Mike hanging. Mike knew Mike needs to be an adult and go to a goddamn night clinic and just get an antibiotic for Christ's sake, you know? Figure figure your life out. David Tim says, \"After two years, I finally beat Tears of the Kingdom Switch 2 edition last night and the graphics were incredible. Any chance for a re-review/spoilercast in the future?\" I'd say that's very unlikely. just because there's not a single person here that is like I'm playing Tears of the Kingdom.",
            "start": 3666.24
        },
        {
            "text": "were incredible. Any chance for a re-review/spoilercast in the future?\" I'd say that's very unlikely. just because there's not a single person here that is like I'm playing Tears of the Kingdom. You know what I mean? Like I'm gonna bounce in and get do some shrines I didn't do. And I might end up doing a fair amount of them, but I I wish I had the time to replay through both. I just don't. Yeah, there's too many games. Um See, I don't I don't think we'll be doing a proper uh review or anything, but haven't even booted up Death Stranding 2. Yeah, like just a lot of [ __ ] Yeah, a lot of [ __ ] I don't know what I can and can't say, but you could say you've played it. You could say that. I have played it. You could take a a selfie in front of a TV screen with Death Stranding. I played a little. Gerald of Rivia says, \"Update for the Tastemaker. Roger. Just finished Death Stranding this morning. Ready for DS2. Can't wait to hear Carolyn's song.\" Hell yeah. I'm so excited. Haven't booted",
            "start": 3707.2
        },
        {
            "text": "Gerald of Rivia says, \"Update for the Tastemaker. Roger. Just finished Death Stranding this morning. Ready for DS2. Can't wait to hear Carolyn's song.\" Hell yeah. I'm so excited. Haven't booted it up yet. Waiting for the stream. Hell yeah. Uh Mental Gear Gaming says, \"Andy, what's your favorite song from Never Enough so far?\" The second song, Soul, probably the new album from Turnstyle. Oh, Tird Style. They're in Tony Hawk three and four remake. That Yeah, that sounds kind of perfect. That totally makes sense. I told Greg they could they sound like they could be in a in a Madden 03 or something like that, you know? Hell yeah. God, that's so my music taste. Licensed video game music's from the early 2000s. Uh, Colin Barry says, \"Thoughts on the hardware side of the Switch, too. I find the back plate to be annoying during setup and the kickstand to be so tight. I think I'm going to break it. Happy birthday, Gia.\" And my broin-law, Alex, thank you for that, Colin. I have no place. Are",
            "start": 3751.28
        },
        {
            "text": "back plate to be annoying during setup and the kickstand to be so tight. I think I'm going to break it. Happy birthday, Gia.\" And my broin-law, Alex, thank you for that, Colin. I have no place. Are they talking about the the dock? I hate the pack. I hate that dock. I I tossed that [ __ ] I tossed it last time, too. You threw it in the garbage. Garbage? Yeah. There was one on switch one. Yeah, there was one on switch one. Oh, I guess I threw that in the garbage, too. That [ __ ] sucks, dude. Like why is it there? The cables aren't going to like they want it to be neat and tidy. It's like but they're not it's not well made enough. My problem is I have a real thick fat boy HDMI cable and so it like it just won't even fit. I'm just like yeah this sucks. My problem really quick. I told you about this Tim but like it's a it's an epidemic. It's not just me. People that have splitters for some reason the Switch 2 it breaks the HDMI splitter for with when it comes to HDR. So you just I have to",
            "start": 3799.12
        },
        {
            "text": "this Tim but like it's a it's an epidemic. It's not just me. People that have splitters for some reason the Switch 2 it breaks the HDMI splitter for with when it comes to HDR. So you just I have to plug it directly into my TV and it [ __ ] up my entire setup. So it's it's specifically only with the Switch 2. PS5, Xbox, nothing else uh [ __ ] it up. They don't got those splitters in Japan. You got to understand that, right? [ __ ] Yeah. Dude, it's I mean I I will say the biggest bummer for me right now is the XR not working with the Switch 2. I'm very sad about that. I'm so distraught. Fully. Yeah. Oh, yeah. And again though, it's because of Nintendo needing to be docked to do video out. It's endlessly frustrating to me. But on the flip side of what you're saying, Raj, I can't believe Switch 2. I thought for sure something in my home theater setup. It was just going to be like, you're [ __ ] Flawless. And I was like, thank you. All right, we get it. Just let me play. No, Raj, every day",
            "start": 3843.28
        },
        {
            "text": "2. I thought for sure something in my home theater setup. It was just going to be like, you're [ __ ] Flawless. And I was like, thank you. All right, we get it. Just let me play. No, Raj, every day I walk in telling you that something's not working. Oh, you want to tell us about your target your your new order of your Switch 2 coming in? Me and Andy are suffering. What are you suffering? Why are you suffering? Cuz Le is not going to get her Switch in time, too. And now she's going to take mine. Now I can't Well, guess what? The one that's coming in is hers. What? It's for you. No, I don't need it. Oh, give it to Joey first. She needs it. Oh, okay. So, now you're just giving it away. Like, now you're just like, I I care about Joey more than I care about my fiance. Wow. I mean, she gets Lisa didn't do a 14 hour stream with me. You know what I mean? Joey deserves Everyone's getting a goddamn switch. Don't worry about it. Um, Target. What are we doing here? I don't know. Where are we?",
            "start": 3884.64
        },
        {
            "text": "Lisa didn't do a 14 hour stream with me. You know what I mean? Joey deserves Everyone's getting a goddamn switch. Don't worry about it. Um, Target. What are we doing here? I don't know. Where are we? Where's your me? What? Where the [ __ ] is my me? Where's his me? Find him. Somebody bring him home to me. And also make sure you're subscribed on Twitch because we have Summer GameFest today. Obviously, right after this, we're doing uh more Mario Kart World streaming and hanging out and having fun. But the biggest one is like I just mentioned, Summer GameFest, big deal, big showcase, and you don't want to be interrupted by ads while you're watching with us on Twitch. So, make sure you're subscribed. uh you know, maybe beg somebody for a gift sub or look into your, you know, look underneath that couch cushion and be like, I found $6, you know, and it would also help to keep the lights and the mics on, which we really appreciate. Thank you. And also, I see snow bike mic in the chat. Mike,",
            "start": 3922.56
        },
        {
            "text": "couch cushion and be like, I found $6, you know, and it would also help to keep the lights and the mics on, which we really appreciate. Thank you. And also, I see snow bike mic in the chat. Mike, I miss you. Get better to the studio. I'm coming back. He's This is not me, but it is someone's me. If this is you or someone you loves me, we need We have found him. We need Sarah McGlaclin. There are millions of Miis missing right now. Here's the thing, dude. Me and you have sat at this desk thousands of times and we've asked questions to chat. We've been wrong. We've asked questions. Somebody answers. Somebody comes to you're wrong and goes, \"Oh, this is the answer to your question.\" Or, \"Oh, you're a [ __ ] idiot and here's why you're wrong.\" How the [ __ ] does no one have an answer to this? This is crazy. This is the problem of today. This is an This to me is an unaccounted for oversight. I think Nintendo did something and then there's probably a bunch of Nintendo people right now,",
            "start": 3970.48
        },
        {
            "text": "This is crazy. This is the problem of today. This is an This to me is an unaccounted for oversight. I think Nintendo did something and then there's probably a bunch of Nintendo people right now, employees that are like, \"Oh [ __ ] Oh my god, [ __ ] Freddy. You didn't do the me. We We had a system in place.\" That's what I think happened. How's no one talking about this? They're talking about every single thing wrong. Have you seen this child? Jessica Hingle says, \"Whoever selected the photo for today's games daily thumbnail on YouTube, 10 out of 10 on the kind of funny scale, 11 out of 10. Thank you. That was Roger Corny. Thank you, Fran, for being Thank you, Fran, so much for everything. For everything. Adoba Beat says, \"New turn style record out today.\" There we go. Hardcore band whose music is going to be on Tony Hawk three and four later this year. One of my favorite current bands. Check it out. That's awesome. Very cool. Uh Lucid Dream says, \"Congrats to Ben Star on the roles of",
            "start": 4012.24
        },
        {
            "text": "music is going to be on Tony Hawk three and four later this year. One of my favorite current bands. Check it out. That's awesome. Very cool. Uh Lucid Dream says, \"Congrats to Ben Star on the roles of Peach and Toad. I'd want to hear Peach.\" Mario, my brother and Joshua. AOL. What the [ __ ] What was that? Look at this. Oh, it's just it's a YouTube account just named AOL and the icon it says is like the America Online icon. Yeah, it looks like the official account. Are they back? Here's my birthday tax. Thanks for all you guys do throughout the year. What a day to have a birthday. Let Tim host. Thank you very much. Happy birthday to America Online. Appreciate it. Never forget. Uh, let's see. I don't like Tesla anymore. Go Delta on the way. 716 says, \"I had an old USBA webcam that I used a USBA to USBC converter and it works as a switch to camera. Saved me 50 bucks. Converters. It's just, you know, converters.\" Jessica Higgle says, \"Let's all take a moment to appreciate Andy's whole fit",
            "start": 4056.96
        },
        {
            "text": "to USBC converter and it works as a switch to camera. Saved me 50 bucks. Converters. It's just, you know, converters.\" Jessica Higgle says, \"Let's all take a moment to appreciate Andy's whole fit for today. Looking fly, my guy.\" For reals, dude. Nothing I love more than color coordinated outfits. The yellow jacket with the little accent yellow pops on the shirt. You can get on nitro rifle.com/store. Nitro rifle.com. Nitrole.com. No store necessary. Joshua Barnett says, \"Please make a shirt with Tim's me on a missing person's post.\" Oh my god. Oh my god. Have you seen me? God, I want him back. You can't find me. Special case says, \"Excited for the Sonic Revolution gameplay deep dive this weekend.\" Yeah, I hope that Greg gets to play it at Summer Game Fest when he goes down there. God, you all need to watch that video. Jean Sandival says, \"Did you guys get Mario Kart World as a code or was it pre-loaded?\" Apparently, there are two different bundles. Mine was preloaded. So, I'm a little",
            "start": 4116.24
        },
        {
            "text": "all need to watch that video. Jean Sandival says, \"Did you guys get Mario Kart World as a code or was it pre-loaded?\" Apparently, there are two different bundles. Mine was preloaded. So, I'm a little confused about this because Blessing had an issue where he got the Mario Kart bundle, but it didn't have the code card that Kevin did in his Mario Kart bundle. And I was like, \"What the [ __ ] He just doesn't have it.\" But then I saw that people are saying it's just pre-loaded onto their account. But how would it be pre-loaded onto your account if they don't know your account? If you pre-ordered it through Nintendo and you signed in with your [ __ ] Because here's the thing. I also saw some other people tweeting, \"Which Mario Kart bundle box did you get? The one with the Mario Kart sticker or the Mario Kart printed onto the box.\" And that seems to be maybe the different differentiation. Or maybe they just didn't really account for, oh [ __ ] there's a lot of people, you know, maybe we got",
            "start": 4160.0
        },
        {
            "text": "the Mario Kart printed onto the box.\" And that seems to be maybe the different differentiation. Or maybe they just didn't really account for, oh [ __ ] there's a lot of people, you know, maybe we got to turn some of these non Mario Kart bundles and put a slap a sticker and say that that's the bundle. So, did Bless have to buy Mario Kart or was it just on his account? I'm not sure. Blessing, as we all know, does not communicate well, as evidenced yesterday by the constant updates on the stream of him ordering the pizza. Unbelievable. And then the pizza came and he tells no one. He just walks out and eats the goddamn pizza. And then what does he do? He comes back and says, \"Guys, we probably should have ordered more pizza. They cut it in a way that means there's not many slices left.\" It was it was it was really something. It it was a very unbing move. You know, maybe it changed the way I look at blessed for the rest of my life. Having said that, at the end of the day, I ate as much",
            "start": 4198.96
        },
        {
            "text": "was it was it was really something. It it was a very unbing move. You know, maybe it changed the way I look at blessed for the rest of my life. Having said that, at the end of the day, I ate as much pizza as I wanted to. I had one slice. So, I'm not mad. But it was so funny to see Tim out of nowhere go, is he [ __ ] eating pizza? Is the pizza here? We had updates to the minute every minute about with his goddamn pizza. Oh my god, we're going so long. But it's fine, man. We're having fun here. Greg, how you doing? You feeling good about today? Yeah. I saw you walking in. Are you eating pizza? Bagel. You got a bagel. Steel. Give you some breaking news. All right. My two parade shirts. The bestselling parade shirts we've ever sold on kind of.com/ Really? The results are in everybody? We're breaking. Do you know where my Mi is? He's coming back for audio listeners. up your [ __ ] ass and around the corner. Blessing blessing Addio Jr. coming to coming to the stage where the pizza cuz I got",
            "start": 4243.12
        },
        {
            "text": "Do you know where my Mi is? He's coming back for audio listeners. up your [ __ ] ass and around the corner. Blessing blessing Addio Jr. coming to coming to the stage where the pizza cuz I got to defend myself here. We were having the conversation of what were we going to get as far as pizza. I kept trying to have the conversation. Nobody else wanted to have the conversation. I was going to order two pizzas. What does Tim say? Ah, let's get one extra large. What did I do? I got one extra large. Whose fault is that, Tim? I mean, again, I'm not complaining about that part. Like I said, I had I had my pizza. I was fine. It was the fact that I was me and you were like collaborating on how hungry we were and ordering. I was like, \"Yeah, just order whatever. Order whatever do this whatever.\" And then you you're telling me, \"Oh, dude, it's supposed to be here in 1 minute, but it was 5 minutes ago and all this stuff.\" And then the pizza comes and you don't tell me it comes. You just walk away",
            "start": 4289.6
        },
        {
            "text": "then you you're telling me, \"Oh, dude, it's supposed to be here in 1 minute, but it was 5 minutes ago and all this stuff.\" And then the pizza comes and you don't tell me it comes. You just walk away and make the pizza. I was hungry. Yeah. So was I. I was hungry. I also walked away cuz I did go across the street cuz I was like, \"You know what? I'm about to have some pizza. I'm going to get some snacks, too.\" So, I got the Pringles and I got myself a [ __ ] pizza Pringles. I got my pizza flavored Pringles and then I got myself a little Fanta and like a glass bottle and I was like, \"Oh, cool. We're living big here.\" And I get back already here. You know what? If we would have ordered pizza, things would have went better cuz I would have collaborated. Are we are we today? Are we doing more toss or we doing Buffalo Wild Wings? Buffalo. That's really really messy. But then for Bless to come back out and set and go, \"Guys, not a whole lot of pizza left.\" It was insane. It was insane. Bless,",
            "start": 4334.32
        },
        {
            "text": "or we doing Buffalo Wild Wings? Buffalo. That's really really messy. But then for Bless to come back out and set and go, \"Guys, not a whole lot of pizza left.\" It was insane. It was insane. Bless, you know where my Mi is? Where's his me? Up your ass around the corner. Say it. I checked my switch. My mi's not there either. So, blessings is gone, too. Gregs is gone. My god. Norman Van V Norman says, \"Uh, a little off topic, but have either of you seen the Dave 2D Windows vers Steam OS video? It's bonkers.\" I have not. The Dave what? Dave 2D Windows versus Steam OS video. Oh, no. But I just know that I know who Dave2D is. I know that Steam OS dominates in terms of battery efficiency and speed. I've watched so Oh, I do know Dave 2D. I love this guy. Um I I know that. Yeah, I've seen him plenty. I've been watching so many videos, Andy, of the Legion Go, like the Steam OS versus Windows situation. So, I can't wait for this weekend. Xbox, please save us on the Windows side. Steam's [ __ ]",
            "start": 4369.84
        },
        {
            "text": "I've been watching so many videos, Andy, of the Legion Go, like the Steam OS versus Windows situation. So, I can't wait for this weekend. Xbox, please save us on the Windows side. Steam's [ __ ] keep keep killing it. Xbox Game Pass, all the stuff. Like, [ __ ] Xbox OS. Please be good. I'll tell you what, I'm pumped about downloading that Nvidia GeForce Now app on my Steam Deck. Oh, yeah, dude. I I haven't tried it out yet. I want to check it out. Oh my god, I'm super. Expedition 33 cuz I tried I tried the sideloaded version. It's just like it's a pain. It's great, but it's just annoying. Yeah, so much better now. Um, Langley Amnilia has a great question. Anyone have predictions and hopes for who sings the theme song to First Light 007? I don't because the actor isn't like some bignamed actor. I don't know if the music will be like a bign named artist. It could just be a song that real ones know, oh, they did this in this soundtrack. But I don't know if it's anything that's notable. I",
            "start": 4422.08
        },
        {
            "text": "I don't know if the music will be like a bign named artist. It could just be a song that real ones know, oh, they did this in this soundtrack. But I don't know if it's anything that's notable. I would pop the [ __ ] off if it was the singer of Snake Eater. Oh my god. Because that'd be cool, you know? That'd be like a real inside if you know, you know, type thing. Uh, it's Toeer says there was live Tekken movie in the US like we talked about earlier. Dorian, I lost my spot. Dorian, Dorian says, \"We need to circle back on the Metroid Prime Remastered Mouse situation. Is it real? Was Andy Hallucinity?\" We did. Uh, it's not real. Ryan Garfield says, \"Also featured in the OG Spongebob movie was Scarlett Johansson.\" Yeah, it's probably why they they don't bring those characters back. Patrick was trying to [ __ ] on ScarJo. It was crazy. Really? Yeah. He showed her his butt. His star. He showed hole. No, not hole. He showed Star. The good show so far. Eric Meyer says, \"Happy fifth Gotcha Day",
            "start": 4477.84
        },
        {
            "text": "trying to [ __ ] on ScarJo. It was crazy. Really? Yeah. He showed her his butt. His star. He showed hole. No, not hole. He showed Star. The good show so far. Eric Meyer says, \"Happy fifth Gotcha Day to my baby boy, Hero. The best baby boy do uh Dachin of all time. I'm fine to call my shot cuz he's perfect.\" Hell yeah. Happy gotcha day. That's awesome. I love the little dogs so damn much. Gunrose 11 says, \"What a bummer. My Switch 2 show up today and I'm out of town.\" That does really suck. Chocolate starfish is a good one. Yeah, I knew it. See, I had it there. I was thinking about it. I was like, I know Nick calls the butthole a starfish. It was the chocolate starfish. I was thinking brown starfish. Flavor water. What? Limbis. Limb biscuit. Roger. Get [ __ ] familiar. Okay. culture. [ __ ] didn't know Papa Roach. This is my last resort. How do you not know that song? There's six-year-olds who know that song. No, there isn't. Not anymore. Not anymore. Not anymore. We got to educate",
            "start": 4524.88
        },
        {
            "text": "didn't know Papa Roach. This is my last resort. How do you not know that song? There's six-year-olds who know that song. No, there isn't. Not anymore. Not anymore. Not anymore. We got to educate them. We have to sit all the six-year-olds down and show them Limb Biscuit music videos on repeat until they all are wearing that melon. Kind of Batman says, \"Never played Zelda: Breath of the Wild or Tears of the Kingdom. Would you recommend I play Breath of the Wild first before Tears or does it matter? Which is a better game?\" I personally think Tears is a better game. I think it's very close. I think undeniably you should start with Breath of the Wild. You are going to rob yourself of an experience because here's the thing. I'm not saying that 100% you're going to love this and it's going to be your favorite game of all time. But I will say there is a high chance that you're going to love this and it's going to be your best your favorite game of all time and you don't want to rob your",
            "start": 4577.28
        },
        {
            "text": "to be your favorite game of all time. But I will say there is a high chance that you're going to love this and it's going to be your best your favorite game of all time and you don't want to rob your experience of more of it. You know what I mean? And going back I think is going to be a lot harder. I think if you in a perfect world, if you have an unlimited amount of time to experience this, then you will have the best time of your life. If in any way you're like, \"Yeah, I got some free time before next big game comes out, you might do yourself a disservice by trying to maybe speed through like experience it, live in it, be immersed, play that game, and then you'll go, \"Wow, that was one of the coolest explorative uh imaginative experience I've ever had gaming.\" And then you play Tears and you go, \"Wow, this is even better.\" Yeah. Game mechanics are better. Story and cutscenes are better, you know? Yeah, absolutely. Someone in the chat, it's gone now. I'm sorry. I I want to credit you",
            "start": 4617.44
        },
        {
            "text": "you go, \"Wow, this is even better.\" Yeah. Game mechanics are better. Story and cutscenes are better, you know? Yeah, absolutely. Someone in the chat, it's gone now. I'm sorry. I I want to credit you for this one because I think it's a really really apt point here is play Breath of the Wild quickly and then play Tears of the Kingdom slowly. That's good. I think that's actually the right way. Yeah. Uh Omega Buster says, \"Chip it in for Gia's birthday tax.\" Thank you, Omega. We appreciate you. Jessica Hinkle with $2 super has poor one out for the great Mi rap show of 2025, man. For reals. Thousands of Mi is just gone. just gone in an instant and no one's talking about it except us. The state of our country. It's really like that, you know. Calrisco says, \"Tim, are you considering getting the Genki attack vector or the Dbrand kill switch? I need your perfect load out. I need to look into what you're even talking about there. I'm not up to date on those brands things. But I will and",
            "start": 4660.0
        },
        {
            "text": "the Genki attack vector or the Dbrand kill switch? I need your perfect load out. I need to look into what you're even talking about there. I'm not up to date on those brands things. But I will and eventually I will give you guys the Tim Gettys OCD answer to what my tech pack looks like these days. cuz recently because of Kevin, we learned the term everyday carry EDC. I didn't know that was a thing. It's Well, we'll talk about it, Andy. And you will learn about it, too. I didn't know it was a thing when he mentioned it rather. Yeah. Uh, Spoon says, \"Birthday tax. Love you guys. Can't wait to hang out with y'all during Summer GameFest.\" Yes, Allan. Happy birthday. Joseph Golden says, \"Hey, Games Crew. Finally got my Switch 2 from Target. I'm loving it so far. Can't wait for Summer GameFest later on. Have a great day.\" You too, Joseph. Have a great day with us. Portland Kevin says, \"Happy National Doughnut Day.\" Damn, we [ __ ] up. I didn't know that. Bless Donuts like yesterday. He was",
            "start": 4703.84
        },
        {
            "text": "later on. Have a great day.\" You too, Joseph. Have a great day with us. Portland Kevin says, \"Happy National Doughnut Day.\" Damn, we [ __ ] up. I didn't know that. Bless Donuts like yesterday. He was a little preemptive birthday doughnut day eve. I've been I've been doing the intermittent fasting. Okay. So, like I just try not to eat until 1 or 3 or 2 or something like that. Mhm. Probably why I'm tired. Lose the energy. But then like, you know, as you're not eating, you're like it's it's working. kind of laser focuses me. It laser focuses me. Okay. You know, you guys do 10 push-ups. I could do them, you know. Wow. Not right now, but CJ Splitton said, \"Me's like the new movie where the kids leave in the middle of the night. Where did they go?\" You see this trailer? Oh, the weapons. Oh, yes. Yes, I have. It's just weapons. [ __ ] terrifying. Yeah. I don't I don't Is that the newest one that everybody says is like, \"Oh, that's like the newest scary movie.\" Well, no. This one. What's the",
            "start": 4746.8
        },
        {
            "text": "Yes, I have. It's just weapons. [ __ ] terrifying. Yeah. I don't I don't Is that the newest one that everybody says is like, \"Oh, that's like the newest scary movie.\" Well, no. This one. What's the super? Wait, which one? that this one for the barbarian director. Uh I think you're talking about the the sequel to Talk to Me, right? Not the sequel, but the the next movie. Yeah. From those people. Yeah, that's what I've heard. Yeah, that's probably what I've heard is the newest scariest thing since, you know, um Hereditary. Yeah. Uh Ron Mexico says, \"Sorry to sidetrack. Is the new Predator animated movie on Hulu getting added to AP? It's fire. Love y'all. Heard amazing things about this so far. It will be added, but we're not going to do it until later in the year when uh we get through all the big blockbuster stuff this summer and then we're getting back into the Predator and Alien vibes. And then closing out the show, Rick L says, \"Limb Biscuit performed Roland on top of the World",
            "start": 4796.64
        },
        {
            "text": "all the big blockbuster stuff this summer and then we're getting back into the Predator and Alien vibes. And then closing out the show, Rick L says, \"Limb Biscuit performed Roland on top of the World Trade Center in the music video. Never forget.\" Roger, that's your homework. Watch the Roland music video. That's crazy. Yeah. Everybody, thank you for this amazing Games Daily. I hope that you were informed whether it was incorrect or correct. I hope you had fun. I hope you learned something and I hope that you'll share something with your friend and that something being us and our YouTube channel and our Twitch channel because all day we're going to be live whether it's playing Switch 2 or reacting and breaking down the Summer GameFest presentation hosted by Lucy James. That's exciting. So awesome. Congratulations to Lucy James. She's going to crush it. Um but until next time, I love you all. Goodbye. Keep rolling. [Music]",
            "start": 4839.44
        }
    ]
}