{
    "id": 14277,
    "video_id": "MA6HIZpstf0",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Andy Cortez",
        "Mike Howard",
        "Parris Lilly"
    ],
    "title": "Resident Evil Requiem, Onimusha, Pragmata Previews! - Kinda Funny Gamescast",
    "description": "Go to http://kindafunny.com/XREAL to grab yours now!\n\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1749669486,
    "duration": 3102,
    "transcript_chunks": [
        {
            "text": "[Music] What's up everybody and welcome to today's kind of funny games cast for Wednesday Jul J J J J J J J J J J J J J J J J J J J J J J J J J J J J J J J J J J J J J J J June 11th, 2025. I'm one of your hosts brain July 11th month until Superman. Everybody get excited, get hype. Of course, I'm one of your show hosts. I'm Mike. Welcoming you into today's games cast with three incredible human beings on the panel. Of course, remote tuning in my main man, Paris Lily. Paris, how are you, Mike? We got to talk. Paris, we got to talk. We got to talk about a lot of things, you know. You know, I'm I'm in Los Angeles. I'm at the Xbox fan community watch party watching the Xbox showcase, having a good time with the community. What a great showcase it was. It it was some people say and then I get I get word through the grapevine. Yeah, Mike didn't like the showcase. He gave it a five out of 10. And I said, \"What? How could he give it a five out of 10?\" My fellow Excast brother, by the way, so",
            "start": 5.84
        },
        {
            "text": "I get word through the grapevine. Yeah, Mike didn't like the showcase. He gave it a five out of 10. And I said, \"What? How could he give it a five out of 10?\" My fellow Excast brother, by the way, so much love for kind of funny and X at Summer GameFest community, people just everybody was like, \"Why did Tim get rid of it? Bring it back.\" I want to say that. Do you remind them that the games castes every day? They should watch that. Paris. Yeah. And then I explain that and they go, \"Well, yeah, I understand why you did it. It makes a lot of sense.\" But still, we we love the X guy. You know what it is? They miss Gary. It's not even me. They miss Gary and all of his rances, right? And Paris, I miss you. I miss talking Xbox with you. I, you know, got to talk Xbox with blessing Tim and Andy after the show and I was like, man, I need Paris here. We need to talk about Xbox, the future, what I was expecting. Uh because yeah, I needed you there when I came out of it saying that was an okay to",
            "start": 61.2
        },
        {
            "text": "the show and I was like, man, I need Paris here. We need to talk about Xbox, the future, what I was expecting. Uh because yeah, I needed you there when I came out of it saying that was an okay to mediocre show. A five to six range on that one. I was expecting a little bit more even though I set my expectations lower. I did think that it should have been a little bit higher on that one. So Paris, you and I do need to have a little breakdown. So if we have some time at the end of the show, we got to talk about that. What would you have scored it? What would you have scored it Paris? All right. I I I cheekily said 9.5 because I said that last year, right? And I saw social media explode into anger. But an eight. I thought it was an eight out of 10. It was solid. Yeah. But let Mike. Yeah. Legit. If we got time later, let's let's jump into it right now. Tell them why why you want to break these Xbox people's hearts. Paris. This is why the show can't come back. You got no taste. Let's talk",
            "start": 104.48
        },
        {
            "text": "If we got time later, let's let's jump into it right now. Tell them why why you want to break these Xbox people's hearts. Paris. This is why the show can't come back. You got no taste. Let's talk about it. Paris, tell me what you got. Paris, while I bring up my notes really quick. Yeah. Okay. I'm going to name drop. And uh as I was walking to the JW with Phil Spencer, look at me. Look at me Lou. No, but uh you know, he asked me what I thought and I go, like I said, I thought it was solid. I go, it would be impossible to live up to last year because that's kind of one of those once in a decade kind of things, if not the best show that they've ever done. But I think they gave you a solid stream of games and announcements, things coming in 2025 that I want to play. October is just a monster for Xbox with all the stuff that they're putting out then, right? Obviously the handheld showing that off and kind of showing the future of where they're going with Windows and all those improvements",
            "start": 145.84
        },
        {
            "text": "for Xbox with all the stuff that they're putting out then, right? Obviously the handheld showing that off and kind of showing the future of where they're going with Windows and all those improvements and things like that. The fact that you can't live up to last year and you know next year it's a 25th anniversary and Phil said at the very end you're getting Fable, you're getting Forza, you're getting Gears Eday and without saying it, we're going to see whatever the future of Halo is as a part of that celebration. Of course, they're not going to show all these things this year because they're going to save them to 2020 2026 and show them off during the 25th anniversary. So, I thought when you think of showcases of the past and just again, you can't live up to last year. This was this was a good one. Like I said, there's games I want to play that came out of this. Paris is 100% right. Paris is 100% right. In the chat, Melof Fellow is 100% wrong. I'm a round mic. 6.5 or seven. That is two",
            "start": 191.2
        },
        {
            "text": "one. Like I said, there's games I want to play that came out of this. Paris is 100% right. Paris is 100% right. In the chat, Melof Fellow is 100% wrong. I'm a round mic. 6.5 or seven. That is two whole points beyond where Mike is. I'm a five to six. I'm five to six. Bring up bring up the words. You said five. Said five. Five. Please bring up the review. You said both. Let's just let's draw a line in the sand and be a man having a because of course on the review scale I am exploring the words. I know the numbers stand out. You hear the five to six. You go, \"Oh my god, that means it's awful. Mediocre to okay.\" And I think this year personally was an okay year for them. I think the past two years, two summers, they've had very strong showings. This summer was on the weaker side. I think it started out the gate very weak. As I said before, the opening to this Xbox game showcase was not a strong opening. Outer Worlds did not show up very well until the end of the show where we got to deep",
            "start": 236.16
        },
        {
            "text": "out the gate very weak. As I said before, the opening to this Xbox game showcase was not a strong opening. Outer Worlds did not show up very well until the end of the show where we got to deep dive into it. And it's understandable that you kind of keep that for the back half. And then you roll into High on Life, uh, a new plagues Tale that didn't really pop like the recent Plagues Tales one and two. Then you go into the Rods Ally into Dawn Walker. That first five sections when we were here in the Kind of funny studio, no one popped until Super Meat Boy at six came out and it was like, \"Oh, I'm kind of excited now.\" And it just felt like this isn't the Xbox we've seen the past two years. And I touched on that of like I think Xbox the past two years has got really excited Paris of like we got to make a name for ourselves. We got to show you we got the games because people have been running around saying Xbox doesn't have games and they've gone out the past two years and really showed",
            "start": 280.96
        },
        {
            "text": "got to make a name for ourselves. We got to show you we got the games because people have been running around saying Xbox doesn't have games and they've gone out the past two years and really showed up. And I think what happened here was this year they were like oh man we showed so many games that we can't show them again this year because we need to save them for next year and beyond. And so I just feel like this year was like here's the catchup moment of we can't be amazing to great nine and eight every year there's going to be one year that's going to catch up to us and this was that. So let me jump off of that please. Another thing that I think was very important and I said this multiple times to people at Xbox when I talked to him after with this new strategy of they're putting games on multiple platforms. This is an Xbox marketing. I now truly understand what it is and the branding that they put on every game. They told you every platform it was going to show up on if it was",
            "start": 327.52
        },
        {
            "text": "on multiple platforms. This is an Xbox marketing. I now truly understand what it is and the branding that they put on every game. They told you every platform it was going to show up on if it was Play Anywhere and if it was Game Pass. I think that was very important because there's no confusion. You knew exactly where High on Life 2 was going to be, right? It was going to be on Xbox, PC, Cloud, all that stuff and part of Game Pass. Going to your point about the opening of the show, first of all, Don Walker's heat for me. So, I was very excited to see Dawn Walker. The the handheld again, the the Xbox Ally X, I think is a big deal for them because it symbolizes the future of where Xbox is going. So, that's I I got excitement out of that cuz I'm like, okay, we're clearly pushing more into a a wind a world of Windows where we're optimizing it and we're making it more of a console experience. And we got Greg obviously talked about it already. We got hands-on with it. I I I think it's",
            "start": 371.28
        },
        {
            "text": "a a wind a world of Windows where we're optimizing it and we're making it more of a console experience. And we got Greg obviously talked about it already. We got hands-on with it. I I I think it's solid. I think it's something I want to get. As soon as I saw Greg at the thing, it was the first thing I said to him. I was like, \"Oh, you're going to be really happy when you see that Alli X, you know, hands on.\" So, well, I think I get your point, Mike, but this is where I think you're coming off of last year into this year, and of course, it's not going to live up to that, but I think for just a standard game showcase, there were a ton of games like Clockwork Revolution, that had to have excited you to see that. I remember we talked about it. We said Clockwork Revolution showed up and they showed a big pair. They had a a great showcase. The issue is is it felt like they went above and beyond to the point where that is a show the date afterwards kind of trailer because now they're going",
            "start": 417.84
        },
        {
            "text": "showed a big pair. They had a a great showcase. The issue is is it felt like they went above and beyond to the point where that is a show the date afterwards kind of trailer because now they're going to come back next year and be lost in the mix of like well maybe we're 2027 cuz we're doing Xbox 25. We got all these games and like sure it might drop next year but like that trailer in particular was so good it should have had a date afterwards. That's the kind of level of good it was. So I I will to your exact point, this is why you show Clockwork Revolution now because you're not showing it next year and it would get lost in the weeds of Fable and Gears and Halo and everything else they're going to show. Now something that I will critique them for is no Ever Wild. I'm to the point I give up because what is that game? You give up on 2019. We still have no idea what it is and here we are in 2025 and you're still not showing whatever it's been rebooted into. And again, to this point,",
            "start": 461.92
        },
        {
            "text": "up because what is that game? You give up on 2019. We still have no idea what it is and here we are in 2025 and you're still not showing whatever it's been rebooted into. And again, to this point, you're not showing it next year because no one's going to pay attention to it because of all the other big games that are coming out. I was also surprised we didn't get State of the K3 this year, but maybe that's next year. I I don't know. We'll see. I Yeah, you showed it last year. I didn't think we'd see that this year as well. But look, I just think they did a a solid job. I I didn't think this was poor. I didn't think like, man. Oh, we Silk Song. They obviously pretty much confirmed we're getting Silk Song this year, so I smartly drafted it in the fantasy draft, by the way. Yes, you did. Yes, you did. Yes, I did. You really need Well, like I said, oh my god, no Fable, so I'm screwed. But anyways, I think they did a solid job. Like I said, an eight. I would realistically give it an eight.",
            "start": 508.16
        },
        {
            "text": "you did. Yes, I did. You really need Well, like I said, oh my god, no Fable, so I'm screwed. But anyways, I think they did a solid job. Like I said, an eight. I would realistically give it an eight. Um because I don't think unless you are putting those other big hitters in there, I saw enough there that I was excited for things to play. I mean, dude, we're getting a double find game this year. We're getting a solid October. Like you said, you have Keeper from Double Find, Ninja Gaiden 4 and Outer Worlds 2. Somewhere in there, you will probably get a Call of Duty end of October into November. Call of Duty is a big deal. There's a double-edged sword with this Call of Duty trailer, right? There is like Andy so wisely pointed out, there's a cool factor to this new Call of Duty and what they're doing with the campaigns where that trailer was good. The issue was it is not close the show out good after the hype up of 25 years. If that was in the middle of the show, we would have spoke about",
            "start": 556.08
        },
        {
            "text": "doing with the campaigns where that trailer was good. The issue was it is not close the show out good after the hype up of 25 years. If that was in the middle of the show, we would have spoke about Call of Duty a little bit differently of like, oh man, it's not just bro dude gun shooter right now. They are going for it. Hey, we have a pretty cool campaign. We have a pretty cool theme going on with Black Ops that like you, the main audience out there that might like poo poo Call of Duty, you should try this, right? But to end the show and like it's Call of Duty, it should go buck wild over the top to have that kind of tone setter trailer and nothing else afterwards as well just left a bad taste of like, oh, this one like didn't hit at the end there. I personally think they should have flipped Black Ops 7 and Clockwork. Yes, 100%. Put Black Ops 7 in the middle and then have Clockwork at the end. And I thought that would have been a great close to the only problem there I think is that",
            "start": 601.04
        },
        {
            "text": "Black Ops 7 and Clockwork. Yes, 100%. Put Black Ops 7 in the middle and then have Clockwork at the end. And I thought that would have been a great close to the only problem there I think is that Clockwork would have been too long and we all would have been pissed if it was at the very end. It's that long and then no date ready when it's going to be ready. Like what the [ __ ] Not this year. Yeah, I thought they should have started off the show with Call of Duty. We saw an amazing looking Soulslike from the [ __ ] Pokemon devs Game Freak. That game looks amazing. Um, followed up by a random sort of like, hey, Grounded 2 is also coming out. Wo, that's kind of a big surprise. Mudang Two Hearts looked freaking wild and weird. This crazy looking who knows what sort of genre it's going to be. Uh, playing out from all these different characters perspectives. Um, at Fate's End looked freaking fantastic. I I I really loved the showcase even though my kid had told me temporary expectations.",
            "start": 647.6
        },
        {
            "text": "Uh, playing out from all these different characters perspectives. Um, at Fate's End looked freaking fantastic. I I I really loved the showcase even though my kid had told me temporary expectations. Aaron Greenberg said so. So, I said, \"All right, I will.\" and I was like, \"Oh, wow. I really enjoyed this.\" I like that. And Paris, to jump off of that, like there's a couple more things I want to hit up. You talk about the Xbox Play Anywhere, and I think you and I have been so deep into Xbox that I already assume and I'm already on the Xbox Play Anywhere. I'm glad that, you know, Greg and the public can now kind of snap in and see that like they're really pushing that for, but since 2015 and beyond, they've been pushing the when you buy this, it is going everywhere that we can. And so I've already I'm not wowed by that, Greg is what I'm getting out of now. So many third parties though, Mike. So many third parties now. That's I mean I've already been expecting that most of it. But you",
            "start": 691.68
        },
        {
            "text": "already I'm not wowed by that, Greg is what I'm getting out of now. So many third parties though, Mike. So many third parties now. That's I mean I've already been expecting that most of it. But you haven't been getting it. So you've been mad then they're moving towards that, right? And so it's been tough of like people are putting that up on the pedestal and it's like well I've already had that up on the pedestal. I've already expected that. So it's not a big hit for me. And on the third party partnership side we've had years now where we teamed up with Riot right and got all of the League of Legends champions, all of the Valerance. This year we didn't have that big third party, oh wow, they're partnering with this, right? The biggest announcement was, hey, we finally got Final Fantasy to come over to Xbox. And it's like, yes, we've wanted Final Fantasy 7 for the past eight years or whatever that year count is. Thank you for finally making this happen. And so, I thought there would",
            "start": 733.52
        },
        {
            "text": "to come over to Xbox. And it's like, yes, we've wanted Final Fantasy 7 for the past eight years or whatever that year count is. Thank you for finally making this happen. And so, I thought there would have been a bigger one. Where's Ubisoft? Where's EA? Why are these two companies not showing off? NCAA football that just had its giant cover reveal last week. Why is that not here? The bestselling game foot bestselling sports game of last year in all time is not at one of these major conferences just driving some hype with the band that should have been here. Does that take you to a 7.5 NCAA? I'm just saying it's like those are the big wins that you remind people of of like, hey, this was the bestselling game. EA Play and Xbox Game Pass gives you 10 free hours of this. Let's remind you that you can get this, right? Hey, Ubisoft, we've teamed up with you before to put on certain Assassin's Creeds. Let's call them up. They're in a bad place. They should be over here doing something. There",
            "start": 771.52
        },
        {
            "text": "you can get this, right? Hey, Ubisoft, we've teamed up with you before to put on certain Assassin's Creeds. Let's call them up. They're in a bad place. They should be over here doing something. There just wasn't a major third party partnership announcement that wowed me like they have the past three years with those. Two things before we obviously get off Xbox and get into the meat of the show. Going back to what you're talking about with Play Anywhere. Yeah, I've I've obviously been a big fan of that for a very long time. Um, and to see them now, that's why I was talking about having that branded and making that a big part of the show that you're now there's now starting to get thirdparty partners on board with it as well. So, you buy the game once, you play it across multiple devices. And this is again where I think the handheld really kind of is the shining light on that that wow, here's this Xbox handheld that I'm now going to be able to play games on that. The progress will go to",
            "start": 817.36
        },
        {
            "text": "this is again where I think the handheld really kind of is the shining light on that that wow, here's this Xbox handheld that I'm now going to be able to play games on that. The progress will go to the console, the PC, cloud, all that stuff. So, good messaging there. Now, here's where it gets messy. There's still confusion about what games are playable on that handheld through Play Anywhere, where people are going, \"Well, this is really isn't an Xbox. It's it's a PC handheld. It's running Windows.\" So, essentially, anything they've labeled Play Anywhere, anything that's on Game Pass, anything that is playable on a PC, you can play on this handheld. your old Xbox One 360 games that aren't already a part of Play Anywhere or Game Pass, you're not going to be able to play them on on there. And I think they still need to clear that messaging up cuz I've seen that a lot this week. And then the other thing uh was and I know Greg already talked about getting hands-on with with Gears of War",
            "start": 858.8
        },
        {
            "text": "And I think they still need to clear that messaging up cuz I've seen that a lot this week. And then the other thing uh was and I know Greg already talked about getting hands-on with with Gears of War Reloaded. I mean, it was it's it's crazy. Played it on the LAX, but then going into the actual session and playing it that across multiple devices. Danny and I were playing he was on PlayStation. And I was on Series X. We got so into that co-op that they literally had to walk over and go, \"You do realize this isn't a preview event. You got to leave.\" Because it was that good. It was that good playing it, right? All all the upgraded visuals and everything that they had on that. Like we're jokingly saying that if Gears of War came out today, what we played, everyone would be singing its praises as a huge game. So I actually think people that get to play that on PlayStation, it's going to it's going to do big numbers. I think uh it's going to have a big Paris is right. It's going to be",
            "start": 907.12
        },
        {
            "text": "as a huge game. So I actually think people that get to play that on PlayStation, it's going to it's going to do big numbers. I think uh it's going to have a big Paris is right. It's going to be really exciting to see Gears next year if Halo does come everywhere, which we assume it most likely will. It's going to be huge for those two franchises to get a massive player base underneath them and really explode like they should. I think Halo Infinite on PlayStation, if we rewind time, that would have really helped that player base stay alive a lot longer than it did. But uh Paris, my two standouts were Double Fine Keeper and Grounded Too. I had a great time. I know a lot of people get a little worried about the score of a five to six. Remember, it was okay mediocre. Thought it was a mid show. I'm not saying it was me or bad, which is a four or three on a kind of funny scale. This dude hated the show. But I loved talking Xcast with you, Paris. I love talking Xbox. And hopefully we can do",
            "start": 948.4
        },
        {
            "text": "I'm not saying it was me or bad, which is a four or three on a kind of funny scale. This dude hated the show. But I loved talking Xcast with you, Paris. I love talking Xbox. And hopefully we can do that again. But that today's Games cast is not about this. Okay, we got to get back on track. You must atone. We got some exciting games to talk about today because for today's games cast, these two boys, Paris and Greg, have played and gone handson with Pragmata. We're going to talk about Oni Musha 2 and Resident Evil Reququum aka Resident Evil 9. That's right. Because today, this is the kind of funny games cast. Each and every weekday, we get together to talk about the latest, biggest reviews, previews, and topics in video games live on YouTube, Twitch, and on podcast services around the globe. If you love what we do, so consider supporting us with the kind of funny membership available on Patreon, YouTube, Spotify, and Apple Podcast to get all of our shows ad free. Watch us as we record",
            "start": 988.88
        },
        {
            "text": "If you love what we do, so consider supporting us with the kind of funny membership available on Patreon, YouTube, Spotify, and Apple Podcast to get all of our shows ad free. Watch us as we record them live and get your daily exclusive show. Greg Way, of course, for a chance to be part of the show. Submit your thoughts as opinions as YouTube super chats as we go. I'd love to hear from you. You want to talk Xbox really quick, slide them in there. You want to talk about these three games, make sure to get your super chats in. We'll ask questions to the panelists. Of course, don't forget we are an 11 person small business all about live talk shows today during Kind of Funny Games Daily. Tim and Greg covered the layoffs over at PlayStation. After this, Mike, Nick, and Andy are going to be playing Dune Awakening. I can't wait. And if you're a Kind of funny member, today's Gregway is all about one month till Superman. How many tickets have you bought so far, Mike? Uh, Greg, I'm locked in",
            "start": 1037.2
        },
        {
            "text": "Dune Awakening. I can't wait. And if you're a Kind of funny member, today's Gregway is all about one month till Superman. How many tickets have you bought so far, Mike? Uh, Greg, I'm locked in for one ticket right now. You got to boost those numbers. All right. I hear you at four. I got five. I got five showings currently planned. You got to take Andy to one. Five. Do you want to come with me and Tim to 4DX Superman? No. Okay, then. No, thank you. Uh, get excited. And in review, Superman in review. Superman in edition starts soon. Get ready. Of course, we'd like to thank those who support us over on Patreon, just like our Patreon producers for the month, Carl Jacobs, Omega Buster, and Delaney Twining. Thank you so much for your support. Today, we are brought to you by XRE and Factor, but we'll tell you all about that later. For now, let's start the show with what is the topic of the show. All right, everybody. Welcome back to today's Games Cast. We have three big games to talk about",
            "start": 1077.12
        },
        {
            "text": "we'll tell you all about that later. For now, let's start the show with what is the topic of the show. All right, everybody. Welcome back to today's Games Cast. We have three big games to talk about and we're going to talk about the first one, Resident Evil 9, Resident Evil Recreum. Uh Paris Lily, you're going to be the man that we're going to talk to cuz you went behind closed doors during Summer Game Fest to see the brand new Resident Evil coming our way. Of course, everybody's been waiting for it. We got the big announcement. We saw the teaser trailer. Now we're ready. Paris, what did it look like? Tell us all about it. Oh, to be clear, no hands-on. It was a theater presentation of what I saw for for Resident Evil 9. And shout out to Britt, who unfortunately could not be at Summer Game Fest. And uh I begrudgingly watched this entire presentation and came away highly impressed and I can't wait to play it. And I'm not a Resident Evil guy. So, what about it? So, top level, what about",
            "start": 1119.52
        },
        {
            "text": "Fest. And uh I begrudgingly watched this entire presentation and came away highly impressed and I can't wait to play it. And I'm not a Resident Evil guy. So, what about it? So, top level, what about it made you impressed and what make you want to play it? the horror aspect, just the intensity of it. You're because, you know, the main character that that you're showing up here on on the trailer right now, you're playing, they're playing as her and I think you even see that in the trailer where she's tied to a table and and can't move and then it's her slowly being able to get out of that and the struggle and just you're like, \"Oh my god, what's about to happen?\" And then when she finally gets out it going through these corridors or rooms and then you got this big monster that comes out of nowhere and is chasing her and the heavy breathing and you're like, \"Oh my god, is it going to get her?\" And at one point it does get her and it bites her and everyone in the crowd's like, \"Oh shit.\"",
            "start": 1170.16
        },
        {
            "text": "nowhere and is chasing her and the heavy breathing and you're like, \"Oh my god, is it going to get her?\" And at one point it does get her and it bites her and everyone in the crowd's like, \"Oh shit.\" You know what I mean? It was like just one of those jump scare kind of things just super intense and you're like, \"How in the hell is she going to get out of this?\" it because the entire time I'm like I'm just screaming and running the the whole way. It was a very intense demo that they had graphically, visually look really really good. The sound effects, you know, just set up the environment, the tone of everything that was going on and they're really, really good. Um, yeah, if I can honestly one of the things you're talking about, Matt Kim over at IGN wrote about I thought was impressive. Of course, you're playing as Grace Ashcrooft as we saw in this trailer. Eventually, Grace will encounter a horrifying new monster that kind of reminds me of the creature from the 2022 horror film",
            "start": 1218.56
        },
        {
            "text": "Of course, you're playing as Grace Ashcrooft as we saw in this trailer. Eventually, Grace will encounter a horrifying new monster that kind of reminds me of the creature from the 2022 horror film Barbarian. This monster will stalk Grace through the dark corridor as much in the same way as Mr. X or Lady Dimitresca. I nail it. Uh, combined with Grace's palpable fear, running away from this mysterious new monster feels even more terrifying and reminds me almost like the first time I played Amnesia: The Dark Descent. No thank you. Yeah, it is definitely one of those no thank you moments that what they showed it's in the game really intense in the gameplay that you watched Paris, were there any switches between the first and third person perspective? Yes, at the very end that was the big surprise because it was all in first person and then at the very end you switch to third person, you know, and the entire crowd just erupts being able to see that and then the demo ends. You're like, \"Oh",
            "start": 1259.44
        },
        {
            "text": "because it was all in first person and then at the very end you switch to third person, you know, and the entire crowd just erupts being able to see that and then the demo ends. You're like, \"Oh man.\" But I did get to talk to a couple people that actually got to play it at Summer GameFest and they got to play both first person and third person and said, \"Yeah, third person is really really good.\" Kobe super chats says, \"The re reququum experience was so visceral and horrifying with one of the most grotesque grotesque monsters I've seen in the franchise. I want the game now.\" Are you going to play this one all the way through, Paris, or were you just impressed? This is something I would play all the way through. Okay. Um, I was that impressed with it because like I said, it's I've not been the biggest Resident Evil, you know, fan out there as far as playing it, but this looks like something I would definitely want to experience. I wonder how far that'll go to help and not being the",
            "start": 1304.48
        },
        {
            "text": "the biggest Resident Evil, you know, fan out there as far as playing it, but this looks like something I would definitely want to experience. I wonder how far that'll go to help and not being the biggest fan. Again, this, you know, I put together Games Daily today, Tim hosted, I drove or I was on it, but I also had Kurt's GameSpot preview, right? And in it, he talked about obviously being a fan and then like he wasn't blown away, but he also wasn't underwhelmed. be said, right? I understand that this is just a sliver of the game and does not represent the full experience, but as a gameplay reveal, this brief hands-on left me neither surprised nor underwhelmed, but rather unfazed. Uh there wasn't enough for me uh to have a clear idea of what the bold new direction it claimed it's going to be heading in is. Uh even with the new protagonist, Grace Ashcrooft, there isn't enough to get a grasp of what kind of character she is. I wonder, you know, Tim talking to him yes today on the show",
            "start": 1346.0
        },
        {
            "text": "be heading in is. Uh even with the new protagonist, Grace Ashcrooft, there isn't enough to get a grasp of what kind of character she is. I wonder, you know, Tim talking to him yes today on the show about it was just so excited to go back to Raccoon City, go back to the Duke site to do all these different things. I wonder what the shakeup there is going to be of this just being wowing uh to be again back to more Resident Evil survival horror. You're running from the creature, you're running from the monster, and be from the ground up a brand new experience. Yeah, that's interesting because for me the past two with seven and eight, right, have been like these big set moments that like are the scariest part of the game and then kind of like we come down off of that and they're never the same as the dollhouse or that opening sequence in the mansion down in seven. So, it's like I don't think they can show you that as a preview and be like here it is and you go come come away going this was",
            "start": 1384.0
        },
        {
            "text": "as the dollhouse or that opening sequence in the mansion down in seven. So, it's like I don't think they can show you that as a preview and be like here it is and you go come come away going this was incredible when now you're just kind of you you blew the load of what is. But how do you really change up the game of Resident Evil, right? It's like it's either first person or third person action adventure. There's going to be the horror elements to that, but like how do you really change up what Resident Evil is and is going to be for this next generation? I don't know. I don't know what I really could see as far as what Kurt's saying and not being sure of what the bold the bold new direction is. I didn't even know that that was part of the marketing. But like what do we think? Did they talk about this in there that this is a bold new direction or they're talking about to some degree in this presentation? Not really. It was more about, hey, here's a game. You actually just get to see",
            "start": 1422.24
        },
        {
            "text": "about this in there that this is a bold new direction or they're talking about to some degree in this presentation? Not really. It was more about, hey, here's a game. You actually just get to see it in action. I If they did, I might have just glazed over that. Did pay attention. I don't remember them saying that. At any point, Paris, during this little presentation, did you see UI at all? Was it like we're going to keep the UI off the screen just to kind of like really keep you immersed in this world or did you see oh this kind of looks like a let's play at the very end when they switch it to third person you see UI. Okay. Cuz that's what got everyone excited cuz he was like he goes into settings and he say he's like oh [ __ ] third person. Uh real quick I'm sorry. So I'm reading from Kurt's preview uh when he references the bold shift to begin with. During Summer GameFest, host Jeff Keelley said the game quote marks a bold shift for the franchise, both in tone and gameplay. And",
            "start": 1464.4
        },
        {
            "text": "Kurt's preview uh when he references the bold shift to begin with. During Summer GameFest, host Jeff Keelley said the game quote marks a bold shift for the franchise, both in tone and gameplay. And today's reveal isn't just about survival horror. Expect high stakes cinematic action, too. End quote. None of that was displayed in my hands-on preview, however, which is exactly what Paris saw just off sticks. Yeah, I don't know what that could possibly mean. It just it kind of looks like a Resident Evil sequel, you know? Yeah, 100%. That was my thing about it where it's like I I was talking about it earlier. I didn't take this demo at SGF because of I only had the one day there and I wanted to see as much as possible and I'm happy I didn't. It feels like, you know, Paris's preview sounds so much like everybody else is like, \"Yeah, there's dark hallways. We got a lighter this thing. It's crazy. It's scary. The perspectives, it's like that's information. They're not making it a rogue light,",
            "start": 1506.72
        },
        {
            "text": "like everybody else is like, \"Yeah, there's dark hallways. We got a lighter this thing. It's crazy. It's scary. The perspectives, it's like that's information. They're not making it a rogue light, you know?\" Exactly. I mean, the craziest would be all of a sudden it's open world. Like that's the only way you could change it up on me. It just it came off more of just survival. you're just trying to survive, you know, in in this this house or building, wherever you are, and like, how am I going to escape and get out of this? And that's what made it so intense. It wasn't like, oh, I'm just mowing down a whole bunch of zombies. It was like, oh [ __ ] where am I? How do I get out of here? Why is this big giant monster lady trying to eat me kind of thing. So, it was I I liked it. I really dug it. I mean, for me, as someone who started with Resident Evil at five, then did you know years old, that's early. I restarted and I did the two remake. I've missed three but I did four. It's like where",
            "start": 1546.48
        },
        {
            "text": "I mean, for me, as someone who started with Resident Evil at five, then did you know years old, that's early. I restarted and I did the two remake. I've missed three but I did four. It's like where does this fall in the timeline pair? Did they say I need to have one done? Do I need to know about one to be ready for this or can I jump in like I have with every other one? You're asking the wrong person. You'll be fine. It'll be a normal thing. I'm sure it'll start and there's I'm sure there's I I've played a lot of Resident Evils. I barely remember any of them when I start a new one. And eventually they'll be like, \"Oh, well, Grace is the granddaughter of Leon Kennedy's.\" I'm like, \"All right, well, I don't that's cool, I guess.\" Okay. I just want to see the scares. Get me scared kind of thing. That's what I want. Maybe keep Maybe tone down the scares, you know? No. No. No. Definitely ramp them up. You ready to stream co-op like action shooter, you know? They did that once. It didn't go",
            "start": 1583.36
        },
        {
            "text": "That's what I want. Maybe keep Maybe tone down the scares, you know? No. No. No. Definitely ramp them up. You ready to stream co-op like action shooter, you know? They did that once. It didn't go well. Yeah. That's why the inner village was like, \"Oh, man. It's just Call of Duty now. This is kind of sick.\" After the dollhouse. Yeah. That's my problem with call with Resident Evils is I really enjoyed four. I had a blast with four. That was more actiony though, over the top and kind of fun. But like with seven and eight, there's that ultimate scare moment of like, man, they've really cooked with this. And then afterwards, it's just kind of a a slow let down for me. I think of village of like the dollhouse was the peak. And then everything past that was like, oh, none of this is scary anymore. It's become full action. Nothing is going on here. I wonder if they can really keep me scared through that experience. And I know you're not going to be scared all the time, but it does feel like",
            "start": 1624.8
        },
        {
            "text": "It's become full action. Nothing is going on here. I wonder if they can really keep me scared through that experience. And I know you're not going to be scared all the time, but it does feel like there needs to be another really wellthoughtout number two moment in this game that I just didn't experience on the last one. All right. Well, it sounds like, you know, we're excited for Resident Evil. I I want to see more. Yeah. Yeah. Yeah. Okay. Yeah. Yeah. I want to see more. Mhm. All right. Well, we're going to zombies. We're going to hopefully see more very soon. And most importantly, we're going to talk more video games right after a word from our sponsors. This episode's brought to you by XRE. Y'all know that a few months ago, my life changed forever when I brought a pair of XR1 AR glasses on a long flight to New York. I legit could not believe how easy it is to use and high quality my experience was playing games, watching movies, TV shows on the plane without just too much extra",
            "start": 1667.12
        },
        {
            "text": "on a long flight to New York. I legit could not believe how easy it is to use and high quality my experience was playing games, watching movies, TV shows on the plane without just too much extra stuff around me, or especially not a giant goofy headset around my head. No joke, this is my favorite new tech product in years, and it has earned a permanent spot in my travel bag. It is only hard to believe that it works as well as I'm saying until you try XR1 AR glasses for yourself. And then you will see that the future is now. The tech is here. Connect XR1 glasses to wherever you are playing. Whether it's a handheld console, a PC, phone, home console. You just get a massive 150in virtual screen anywhere, anytime for any game. Gaming on the go like a long haul flight. You need the XR 1. neck starting to hurt from staring down at your handheld? We've all been there. You need an XR real one. A screen as big as your wall. Instant plug-andplay with all of your devices via USBC. Built-in audio",
            "start": 1707.76
        },
        {
            "text": "to hurt from staring down at your handheld? We've all been there. You need an XR real one. A screen as big as your wall. Instant plug-andplay with all of your devices via USBC. Built-in audio with sound by Bose. Anchoring your screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full HD. These are what make XR1 a musthave. And we hear XR1 Pro is coming soon with an even bigger virtual screen. Hit our link below to get your XREL glasses today. There's nothing better than when a sponsor of Kind of funny is something that we are legitimately obsessed with. And that is exactly the case here with XRE. You're going to hear me talk about these forever. Go to kind offunny.com/xreal. That's kind of funny.com/xre. I promise you, you are going to love these things. This episode's brought to you by Factor. Summer GameFest is here. The Switch 2 is here. The sun is here. So many summer things are here. And the number one thing you don't want to be doing all summer, spending",
            "start": 1758.8
        },
        {
            "text": "brought to you by Factor. Summer GameFest is here. The Switch 2 is here. The sun is here. So many summer things are here. And the number one thing you don't want to be doing all summer, spending hours cooking inside. That's where Factor comes in. Factor's chef crafted dietitionian approved meals are ready in just 2 minutes, taking the hassle out of eating well. We love Factor here at Kind of Funny and Greg's often making and enjoying meals quick in between shows here in the studio. I just had a roasted garlic chicken and I'm telling you, you would have loved it. Factory meals arrive fresh and ready to eat. Perfect for any active lifestyle over summer and beyond. With 45 weekly menu options, you can pick gourmet meals that fit your summer gains and goals. Choose from options like calorie smart, protein plus, keto, and more. Get started at factormeals.com/kindafoney5050 off and use code kind of funny 50 off to get 50% off plus free shipping on your first box. That's kind of funny off at",
            "start": 1808.88
        },
        {
            "text": "protein plus, keto, and more. Get started at factormeals.com/kindafoney5050 off and use code kind of funny 50 off to get 50% off plus free shipping on your first box. That's kind of funny off at factormeals.com/kindfunn off for 50% off plus free shipping. backtomails.com/kindfunn 50 off. Welcome back everyone. I want to switch gears. I want to talk about a game that you two actually went hands on with. I want to talk about a game that's been out of my life for some time. Andy Cortez got visual cuz it was promised for 2022. And then they said, \"No, we're not going to make that.\" And then they said, \"2023, we're not ready for that. Maybe next year.\" And then they said 2026, we're so back. We're so back. Let's talk about Pragmata. Audios, you need to watch the uh visual accompanying stuff and his little robot friend Diana. She has a name. She Diana and Hugh Pragmata coming from Capcom. Originally revealed in 2020, coming to PS5, Xbox Series X and S, and PC in 2026. I go to the synopsis",
            "start": 1849.92
        },
        {
            "text": "his little robot friend Diana. She has a name. She Diana and Hugh Pragmata coming from Capcom. Originally revealed in 2020, coming to PS5, Xbox Series X and S, and PC in 2026. I go to the synopsis of the official website and it's got a bunch of coming soon banners all over it. So, I can't actually know what this game is, but from Steam, it says, \"Capcom's newest IP, Pragmata, is an allnew science fiction action adventure with its own unique hacking twist. It is near the future, and the protagonist, Hugh, and his android companion, Diana, must work together as they make their way through the cold lunar research station.\" The latest YouTube video description from Pragmata says, \"A science fiction adventure with a unique twoin-one twist of action and strategy.\" Greg Miller, tell me about this action and think about Pragmata. I feel like for five years, which is accurate. I've heard Blessing talk about this, be hyped for it, predict it, Tim talk about this, and I've never understood what",
            "start": 1903.76
        },
        {
            "text": "action and think about Pragmata. I feel like for five years, which is accurate. I've heard Blessing talk about this, be hyped for it, predict it, Tim talk about this, and I've never understood what this was. The fact that Blessing's been mentioning, I'm always thinking it's going to be some it's Vanquish. I'm doing some kind of crazy action thing. It's that kind of Capcom game, which you know is not my vibe. So this year when we decided only to send me to uh SGF for us so everybody else could play Switch and do the live reactions and etc, etc. When I I booked it without talking to anybody. So when Tim sat down and finally looked at the schedule like the two days before I went, he stood up. He goes, \"Pragmatada, really?\" I'm like, \"Yeah.\" He's like, \"Oh, Bless is going to be pissed that he's not going to get to play it. That I'm going that Bless won't be there to play it.\" And I mentioned it and he did the usual bless or whatever. So I was like so ready to not give a [ __ ] about this",
            "start": 1955.92
        },
        {
            "text": "not going to get to play it. That I'm going that Bless won't be there to play it.\" And I mentioned it and he did the usual bless or whatever. So I was like so ready to not give a [ __ ] about this to come in and be like I'm not the guy for this blah blah blah blah blah. I when I tell you I can't [ __ ] wait for this game. Whoa. Because I it's not at all what I thought it was. Uh when they when we walked in and we were in smaller groups. I wasn't in Paris's group and they sat they were like all right cool. We're going to give you a quick presentation before you get hands- on. And they introduced the fact that all right now look this robot's coming to attack you. All right. and you can shoot it. Boom, boom, boom, boom. And nothing's no damage is happening. That's why with every person in this [ __ ] in this game, you have to have Diana hack them before you do it. So, she puts up her little robot hand and you, if you can go back to part of the the trailer there, a grid pops up with a",
            "start": 1997.6
        },
        {
            "text": "this [ __ ] in this game, you have to have Diana hack them before you do it. So, she puts up her little robot hand and you, if you can go back to part of the the trailer there, a grid pops up with a hacking miniame. So, you then go and you move with the face buttons. You move through this grid uh hitting every one of the blue tiles. Eventually, they'll introduce other tiles in there that you have limited of version of like bring down their defense and do this different things, but you go through the blue tiles to get to the green tiles. So, then you hack that thing. Opens it up. Then you as Hug shoot. So, it's a two character thing. You're controlling both of them. You have to hack every one of the people, then you shoot them. Uh, we'll get to in a second to show it off when it pops back up. You do that with every enemy. And I said that could be stupid as hell. Let it go. You'll see. It's like literally in the next two frames from now. I saw it when we were talking when you were",
            "start": 2035.84
        },
        {
            "text": "back up. You do that with every enemy. And I said that could be stupid as hell. Let it go. You'll see. It's like literally in the next two frames from now. I saw it when we were talking when you were walking. It doesn't matter. Uh it'll pop up and you'll see a grid on the right there. Bam. Boom. You get one frame of it in terms of first contact cuz I don't think they want you to I don't know if they're all their descriptions are mentioning it, right? But they you have to see it in motion to be like, \"Oh, okay.\" So, the idea here is that obviously wherever it starts on the deal, you use the face buttons of your controller or if you're some weirdo with a keyboard to get to the green thing. If you can get through the blue ones, then you get more damage. You're going to do more stuff when you get it open. But you do this for every enemy. And I thought that was such a [ __ ] cool idea. Like, and it like And it felt fun to do. I mean, was it boring and repetitive? Mike, I'm 100 hours into",
            "start": 2075.52
        },
        {
            "text": "get it open. But you do this for every enemy. And I thought that was such a [ __ ] cool idea. Like, and it like And it felt fun to do. I mean, was it boring and repetitive? Mike, I'm 100 hours into Starfield and I get a boner every time I have to use the hacking mini game there. Yeah, this felt great. And again, eventually when there's more enemies on the screen, it was, you know, oh, okay, hold on. Get this. Oh, get over there and do this. And then as they, you know, you see him there using a pistol, it's called a grip gun, right? Eventually, you get this shockwave gun. It's a shotgun. Uh, pretty traditional, right? Grip gun has unlimited an ammo. You're picking up the other guns. They have limited ammo. You eventually get a stasis net though where you have multiple people now. So, stasis net this guy, hack this guy, shoot that one. I was like, [ __ ] this is great. And then the rest of the gameplay around it was exploring this place like you're what do you remember the name of it?",
            "start": 2110.64
        },
        {
            "text": "net this guy, hack this guy, shoot that one. I was like, [ __ ] this is great. And then the rest of the gameplay around it was exploring this place like you're what do you remember the name of it? What the station you're on? You wake up on it. You don't know it. I forget the exact name. Yeah, you're on a space station trying to get back to Earth. Crap. I forget, but that's maybe maybe the crew. I don't know. Doesn't matter for it. Uh, but you wake up and you don't know she's an Android at first, right? Then she pops up and helps you and do the whole thing. Like once that was down, it's then jumping around, exploring, using your hover boots to get over here to find out what's going on over here, find a little diary entry, find this thing that, you know, the it's a weird one where I don't want to come out being like 10 out of 10. It's not that this like what I played in like the exploration of all like I would like if you asked me to review I'd be like 758. Like I'm right there of like",
            "start": 2148.4
        },
        {
            "text": "to come out being like 10 out of 10. It's not that this like what I played in like the exploration of all like I would like if you asked me to review I'd be like 758. Like I'm right there of like this was fun. It wasn't. And you know, it was a weird one of like the whole objective here was we had to hack all or find all these different terminals and turn them on. Hack them and turn them on. So, and then there's this one big terminal thing with all the different nodes on it that would light up once I did it. But it was fun to jump around, explore, you know, you've seen it grab onto the elevator thing and shoot yourself up. Like there was something I was like, \"Oh, this is fun.\" Dead space vibes cuz that's when I looked at it yet. Yeah. Exactly. Not but not scary, but like that kind of like I'm exploring third person adventure. I'm exploring the spaceship. There's boss battles in this. We saw like that kind of vibe of Dead Space. Yeah, that kind of vibe. Yeah. Not the survival horror",
            "start": 2184.56
        },
        {
            "text": "I'm exploring third person adventure. I'm exploring the spaceship. There's boss battles in this. We saw like that kind of vibe of Dead Space. Yeah, that kind of vibe. Yeah. Not the survival horror aspect of it. You know what I mean? It's a very sterile clinical space station space vibe you have on this game. For Paris and for Greg, did Were there any Did you all see any variety with the hacking? Because I know I I think of Near Automa where Near Automa their version of hacking when you know you sort of like get sucked into a terminal and before a boss fight it kind of looks like a Space Invaders game or or or an asteroids game or whatever and that's their version of that. Was it all this grid based stuff? So, the grid is the grid, but what like everything that Greg already talked about is the appeal of of this hacking mechanic because first and foremost, that 20-minute demo that that was cruel of them because right at the freaking end, you're like, \"Oh, hell yeah. We're really about",
            "start": 2223.44
        },
        {
            "text": "the appeal of of this hacking mechanic because first and foremost, that 20-minute demo that that was cruel of them because right at the freaking end, you're like, \"Oh, hell yeah. We're really about to get into this. Okay, get up. Get out.\" Boss there, right? Like the boss walks out like the boss at the end. But you can see that grid getting very complex because what'll happen is you're getting because you know you you she she has to take down their armor and shields. There's various power up things that you can get in that grid as well, you know, to like like like uh Greg already said to do more damage, to take down their shields more quickly, take down armor, like upgrade your weapon, stuff like that. And you could see it getting way more complex on that grid because you have to hurry up and do it because if you don't, they're coming at you. They're going to take you out if if you don't hack them out. So, no, the grid isn't different. It's it's always that same big square grid, at",
            "start": 2270.88
        },
        {
            "text": "up and do it because if you don't, they're coming at you. They're going to take you out if if you don't hack them out. So, no, the grid isn't different. It's it's always that same big square grid, at least obviously what we saw in the 20 minutes. But the like Greg said, right now, you would probably say, \"Hey, this is an eight, right?\" But there is room for improvement of this, for challenge of not only the hacking side of it, but obviously the shooting mechanics as well to where you could really see this ramp up. Um, there was decent enemy variety of the robots and the things that you saw like Greg Greg already mentioned, you you see the boss at the end, but you don't actually fight them. So, I'm curious what other kind of boss characters and mini bosses that you'll you'll see going through the space station. But, I mean, I was impressed. I was very impressed. If anything, that was probably my favorite thing that I played at Summer GameFest this year for sure in the in in the top",
            "start": 2316.16
        },
        {
            "text": "the space station. But, I mean, I was impressed. I was very impressed. If anything, that was probably my favorite thing that I played at Summer GameFest this year for sure in the in in the top five. Um, it it's the potential of it and you can see it from what we played. I just felt like this was the tutorial and right when they're about to let you off into the main part of the game, get out. And I was like, oh man, I want to play more. It left me wanting more for sure. Potential is a great word to use on it. Yeah, cuz that's where I'm hung up on it a little bit where it's like, you know, my last bullet point here that I wrote when I was playing was the shooting feels so slow with the gun, your regular gun. Now, granted, that's the base vanilla pistol. I don't know what I'm upgrading. I don't know about upgrades, period. But I assume like any other game, I'm going to be right. Shotgun felt better. The stasis now felt fine. But it is that idea of like this was fun to explore and go. I",
            "start": 2358.0
        },
        {
            "text": "know about upgrades, period. But I assume like any other game, I'm going to be right. Shotgun felt better. The stasis now felt fine. But it is that idea of like this was fun to explore and go. I felt it felt a little bit empty in some areas, but again, I'm on a space station. Is that that's fine for 20 minutes, but 20 hours if it, you know, are they going to pepper stuff in? Yeah. Will there be a little bit of horror aspect to this? Are the robots going to go crazy in the middle of this? Yeah. So, it's like one of those like I was very impressed with the demo. I I hold I would hope that the game will be as impressive as well. But for me, as just a dorky little like, oh, I like a little hacking miniame. I thought that was really cool and I love the idea of that going forward of, oh, it's the ads, but I have the boss, so I'll stasis net them and I'll do Oh, that's not the right idea. figuring out like the right little, you know, equation to get it all done. Yeah, it just gave me Capcom",
            "start": 2399.12
        },
        {
            "text": "ads, but I have the boss, so I'll stasis net them and I'll do Oh, that's not the right idea. figuring out like the right little, you know, equation to get it all done. Yeah, it just gave me Capcom ass Capcom type video game where Andy reminded me of Kitsugami where it's like, is this an action game? Oh, no. It's an action strategy game. And then I see this, I'm like, oh, Capcom's just in their bag of like, let's mismatch these genres and give you something that's like a fresh take on a third person action adventure shooter that maybe needs like something different to keep you occupied through it. that we don't get lost in the mix of is this just another Dead Space that won't be as good as Dead Space type. I love how weird they're getting. Guys, let's talk about our next game then. You guys saw Oni Musha 2. Only Paris saw this one. Paris, tell me what's up with this. Yeah. So, it was in the same exact presentation, right? It was on Musha Way of the Sword. Way of the Sword. Way of the",
            "start": 2435.92
        },
        {
            "text": "saw Oni Musha 2. Only Paris saw this one. Paris, tell me what's up with this. Yeah. So, it was in the same exact presentation, right? It was on Musha Way of the Sword. Way of the Sword. Way of the Sword. Mhm. But yeah, it was the same presentation as Resident Evil 9. That was the opener to that. And again, visually beautiful, beautiful looking game. Um, again, it like let me let me take this angle on it. So, it probably in the last 18 months, we were we've now had Rise of the Ronin, we got Assassin's Creed Shadows, we're about to get Ghost of Yoai, and then this is targeted for, I believe, early 2026. I wonder and what cuz again, not hands-on. So, the premise of it is, you know, you're you're battling all these characters with your sword. You're doing all the pairing and the moves, and you're you're grabbing their souls, and as you get the souls, you can upgrade your character and power up, and you know, you become more powerful. There's many bosses, bosses that you'll encounter that",
            "start": 2477.2
        },
        {
            "text": "you're grabbing their souls, and as you get the souls, you can upgrade your character and power up, and you know, you become more powerful. There's many bosses, bosses that you'll encounter that we saw in the demo as you're going through this world. I really liked what I saw. I want to play it. I wonder will I have fatigue for this genre by the time it comes out because of all these games that I just talked about that are coming out before it. Obviously that's not fair to it every to each their own. But I only want to do sword pairing in these kind of games so many times, right? So obviously we'll see by the time Ghost comes out and then this will come out a few months after that. But from what they showed in the demo, it looks like a lot of fun. Like I said, visually impressive. sword play look really good. I'll be curious to see what more of the upgrades are going to look like, you know, as you progress through the game, you know, as far as enhancing your character. But yeah, I",
            "start": 2525.52
        },
        {
            "text": "play look really good. I'll be curious to see what more of the upgrades are going to look like, you know, as you progress through the game, you know, as far as enhancing your character. But yeah, I mean, very solid. I I I will just say overall everything I saw at Cap Capcom was impressive to me and this this was, you know, no exception to that. So, no, you didn't play this? No, just a just a presentation. Just they they just showed us during the theater. Did they show off any boss fight u interactions? Matter of fact, if if you scroll back, there was the one character we saw his arm starting to turn purple. He was one of the many bosses that that you got to encounter in there. And his fight looked pretty good. Um, just the different parrying and the moves that that you would have to do going him right there. You you fight him in the demo. It was good. It was good. And that's what I mean. I'm I'm very curious to see more of those type of mini boss characters and encounters, you know,",
            "start": 2571.28
        },
        {
            "text": "him right there. You you fight him in the demo. It was good. It was good. And that's what I mean. I'm I'm very curious to see more of those type of mini boss characters and encounters, you know, as you progress. Was there anything that they mentioned that made the game stand apart so that you may not feel fatigue whenever the game comes out? And that's and that's what I'm kind of alluding to. I didn't see anything that was vastly unique compared to some of those other games that I just talked about. Obviously, it's going to be coming in understanding the moves of the sword play, knowing how to parry, you know, all all these things. And that's what I'm curious to see what the upgrade path will look like for your character with that as well. think it might be just the novelty of Oni Musha's return back. I mean, this is kind of your genre, Andy, right? This is your kind of bag of game. Like, does this get you excited or is it like just a legacy title name that will get fans of that",
            "start": 2614.24
        },
        {
            "text": "return back. I mean, this is kind of your genre, Andy, right? This is your kind of bag of game. Like, does this get you excited or is it like just a legacy title name that will get fans of that coming back? But like, do you come do you come and go, man, Mike, this is up there with the 10 other games we saw similar to this? Yeah, I mean, it looks right up my alley. It all comes down to to feel and mechanics, though. Um, yep. because I, you know, as somebody who could not wait for Blackmith Wukong, that game came out and I thought it was fine. I thought the combat was fine, which is that's the main part of the video game, but everything else was like super stunning. Yeah, it all comes down to how flashy some of these moves can be, how cool I can feel as the as the sword wielder, cuz that's ultimately what what the game is. Like, how awesome will I feel while parrying? does the impact of the sound, the sound design of like the impact of a parry, the impact of a critical hit, all those",
            "start": 2656.4
        },
        {
            "text": "ultimately what what the game is. Like, how awesome will I feel while parrying? does the impact of the sound, the sound design of like the impact of a parry, the impact of a critical hit, all those little things kind of add up and all those variables need to be kind of just right in order for me to want to continue it cuz there's been a lot of Souls likes that I fall off. You know, I never went back to go beat um I never went to go beat uh first Berserker Kazan, even though I only need two bosses there. that game. I just kind of got tired of what it was going for and the difficulty of it. Um, but when the game is good enough, like I stick with it and this looks like it could be good enough. Similar to talking, we talked about it earlier, but the the Game Freak game, um, the the Souls like that Game Freak is working on Blinking on. Yeah. I mean, that's the other point that you just brought up. That's the other point that you just brought up, Andy. That's I shouldn't even say it's a",
            "start": 2699.44
        },
        {
            "text": "that Game Freak is working on Blinking on. Yeah. I mean, that's the other point that you just brought up. That's the other point that you just brought up, Andy. That's I shouldn't even say it's a concern cuz obviously we got to play it first. But how difficult will this be? Is this going to have like a skill check in it is like something like Blackmith Wukong? Is it just going to be something like Assassin's Creed where, you know, I can just kind of run through it if I so choose. You know, we're just seeing a, you know, scripted demo, so I I don't know what the difficulty variety is going to be in it. There was no Q&A, so we couldn't ask questions or anything like that. So, like I said, it looks good. And to to your point, it really just gonna come down to preference of of what you're going to want from it, but from the outside looking in so far, yeah, I mean, I was impressed with what I saw. Awesome. Okay. Okay. Greg, any interest in this one for you? Absolutely not. No. I tried to",
            "start": 2745.84
        },
        {
            "text": "to want from it, but from the outside looking in so far, yeah, I mean, I was impressed with what I saw. Awesome. Okay. Okay. Greg, any interest in this one for you? Absolutely not. No. I tried to play on Musha back in the day. You know what I mean? Yeah. No. No. Okay. Have his moment. We've got uh three pretty cool games to talk about throughout today's Gamecast. I want to end the show with some super chats coming in over on YouTube to check in with a lot of you. Kobe writes in again. I think Kobe might have been at Summer Game Fest because Kobe has some inside information here. Uh, Pragmata shocked me the most. The snake- like puzzle game on top of the shooting was intimidating at first, but once I got the hang of it, the uh this was a super unique take on combat and I loved it. I really like hearing that. Yeah, I'm just I'm kind of on the side of like is this going to get repetitive and slow me down and boring where I just want a third person shooter or is this going to be a fun one",
            "start": 2786.0
        },
        {
            "text": "like hearing that. Yeah, I'm just I'm kind of on the side of like is this going to get repetitive and slow me down and boring where I just want a third person shooter or is this going to be a fun one where I'm like oh like this is exciting moments a moment Kobe aren't and he looks like he's a software engineer at Xbox if I know exactly who that is and I was going to say multiple Jen mentioned conversation with him well shout out to Kobe out there thank you so much for writing in and giving us your opinions I love that uh James writes head and says, \"Please rate Pragmata as one of the following: frowny face, neutral face, smiley face.\" Smiley face. This is smiley face. I had a great time with this demo. Did they have any of these note cards lying around? They should have played into that. That would have been fun. The Capcom sign outside and we walked in and you shuttle off over here to the left and it was just some drapes and some demo stations. Uh, Demon Hacker writes in and says,",
            "start": 2828.08
        },
        {
            "text": "That would have been fun. The Capcom sign outside and we walked in and you shuttle off over here to the left and it was just some drapes and some demo stations. Uh, Demon Hacker writes in and says, \"When is Mike beating RER2 and the final boss, Resident Evil 2 remake? When you get your [ __ ] together?\" Uh, I only played the first half cuz, you know, they go into two different characters. I don't like running back as a different character through their eyes. I got bored of that in uh Kingdom Hearts Chain of Memories. I don't really love that kind of storytelling. But like, yeah, I'm going to go back to that one for sure because I got to do RE3. Andy, you and I some Resident Evils. What's it gonna take? The people want it. I've never played three. Okay. Okay. We can beat that in the night. They say I know it's really short. Like a short one. And then here's the perfect thing. You beat that the night before you start Resident Evil 9. You two. Yeah. Yeah. Oh, can a can a producer lower",
            "start": 2875.04
        },
        {
            "text": "They say I know it's really short. Like a short one. And then here's the perfect thing. You beat that the night before you start Resident Evil 9. You two. Yeah. Yeah. Oh, can a can a producer lower Barrett's mic? Oh no, I muted Andy. Randing out. Can't say no. A couple more here to get back up to the top of the show. We were talking about Xbox and the Xbox game showcase. Flattered Fifth writes in and says, \"Mike, daddy chill. Xbox is still on the move. It's all right.\" It's like, \"Daddy, chill, Mike. Xbox is up right now. They're doing some great moves. I'm very happy with it. I'm excited to see this Xbox half handheld. It's, you know, it's exciting. Greg is excited. I'm on the fence about it. I'm truly on the fence with handhelds right now. There's a lot of them and it's just like I a thousand handheld is not like I'm not itching to do that right this moment. But you're not the handheld guy anyway, right? Yeah, but my dream has always been to have that final piece of the Xbox ecos",
            "start": 2918.4
        },
        {
            "text": "thousand handheld is not like I'm not itching to do that right this moment. But you're not the handheld guy anyway, right? Yeah, but my dream has always been to have that final piece of the Xbox ecos which is on the mobile. Monday the 16th is currently handheld gaming in 2025 and you're on the show and I want these [ __ ] opinions there. And am I on the show too? Do you want to be Paris? You can be. Yeah. Okay. Paris. Yeah. Come do Monday's games cast. I'm putting you on the list. Super chat. I have a million handhelds. I can talk about it. Okay. Uh, Beans Got Games writes in. Shout out to Beans. Says, \"Pragmatada definitely took me by surprise. Can't wait to play more. Loved the combat system.\" On Musha got a huge pop out of me during the presentation. Capcom definitely showed up. Yeah, Capcom is doing their thing right now for sure. And then our final two super chats over here. Um, Kristoff says, \"Mike Mike stood on business. We love you, Paris.\" Yeah, well, you know, we're just",
            "start": 2967.76
        },
        {
            "text": "Capcom is doing their thing right now for sure. And then our final two super chats over here. Um, Kristoff says, \"Mike Mike stood on business. We love you, Paris.\" Yeah, well, you know, we're just talking about what we like, what we don't like. And James writes in and says, \"Completely unbiased and hate tribalism, but I play on PC and PS5. Xbox showcase was far more impressive to me than State of Play.\" There. There we go. In your face, Mike. But of course, in your face for having another great day of content here with us at Kind of Funny Games. Of course, this has been your Kind of funny games cast for June 11, 2025. We're talking all things hands-on preview and behind closed door sessions over at Summer GameFest. Let us know what you think of these big three titles coming your way in 2026 and beyond. Of course, we are not done here for the day if you're watching live on Twitch and on YouTube. Me, Andy, and Nick are going to go check out a brand new survival MMO, Dune Awakening,",
            "start": 3010.48
        },
        {
            "text": "2026 and beyond. Of course, we are not done here for the day if you're watching live on Twitch and on YouTube. Me, Andy, and Nick are going to go check out a brand new survival MMO, Dune Awakening, right now in the lab. I hear Greg might even record something special for all of you to hit the YouTubes later on. and it might be about Superman. So, keep an eye out on YouTube right now for all of that. Of course, we will be back tomorrow with more content from Games Daily, the Games Cast into your afternoon streams and in review. Keep it locked with with kind of fun. You was at work there. You never make that mistake. You never work there. [Music]",
            "start": 3055.28
        }
    ]
}