{
    "id": 14252,
    "video_id": "olgVvZLQR6A",
    "show_name": "Special Presentation",
    "hosts": [
        "Barrett Courtney"
    ],
    "title": "I Replayed Every Naughty Dog Game",
    "description": "Barrett replayed every Naughty Dog game. Here are his thoughts.\n\nIntro & Outro Music by Otis McDonald: https://www.otismacmusic.com/ \n\nAll background music owned by Sony Interactive Entertainment.\n\nCrash Bandicoot 1 gameplay by RickyC from World of Longplays: https://youtu.be/d3_RQU2OJEM?si=NBsLTEbyB4sJVNJL \n\nCrash Bandicoot 2 gameplay by Spazbo4 from World of Longplays: https://youtu.be/Va9D9ahF3DI?si=XuoZ00J-V3czuzFE \n\nCrash Bandicoot Warped gameplay by Spazbo4 from World of Longplays: https://youtu.be/f-UJw3DzQnE?si=RVO60e6BsjKEuM_g \n\nCrash Team Racing gameplay by Mad-Matt from World of Longplays: https://youtu.be/OTLREpMM9tE?si=WQxl1a-nIcfbodxe \n\nJak and Daxter: The Precursor Legacy gameplay by martanius from World of Longplays: https://youtu.be/ZO1Uw2kPkK8?si=TFBMEUIqBYUnemAx \n\nJak II gameplay by martanius from World of Longplays: https://youtu.be/VH-igmeFD0U?si=TlZ8YpGPnyrm9030 \n\nJak 3 gameplay by martanius from World of Longplays: https://youtu.be/hrdxOq6nmic?si=rI7SRs4w1CvTFDSm \n\nJak X: Combat Racing gameplay by martanius from World of Longplays: https://youtu.be/vlqWhPVjix0?si=RgkFRCij0syYX0Pb \n\nUncharted: Drake’s Fortune gameplay by Spazbo4 from World of Longplays: https://youtu.be/nV6jGMl7JQk?si=4SNo_3yqyFYTUr9Y \n\nUncharted 2: Among Thieves gameplay by Spazbo4 from World of Longplays: https://youtu.be/70ut5XjXh9Y?si=Yrra2omAvIAYhyio \n\nUncharted 3: Drake’s Deception gameplay by Ravenlord from World of Longplays: https://youtu.be/s0cFUqPrg7o?si=g4uIoN2auSJm7gfB \n\nThe Last of Us gameplay by boneofhead from World of Longplays: https://youtu.be/RI4kTd9kxUQ?si=eraunh4rPrwn6ztd \n\nUncharted 4: A Thief’s End gameplay by Spazbo4 from World of Longplays: https://youtu.be/iW4jVMb-4ko?si=7RyC2h58dIsrCDWU \n\nUncharted: The Lost Legacy gameplay by Spazbo4 from World of Longplays: https://youtu.be/ricgtVb0Z1s?si=dq6cQERbSSrKEzMS \n\nThe Last of Us Part II gameplay by Spazbo4 from World of Longplays: https://youtu.be/McH5TlbwlTw?si=AX-bvjtnlH799PM7 \n\nTime Stamps:\n00:00:00 - Intro\n00:03:28 - Crash Bandicoot\n00:08:02 - Crash Bandicoot 2: Cortex Strikes Back\n00:10:54 - Crash Bandicoot: Warped\n00:15:34 - Crash Team Racing\n00:19:50 - Jak & Daxter: The Precursor Legacy\n00:24:21 - Jak II\n00:33:18 - Jak 3\n00:41:41 - Jak X: Combat Racing\n00:47:50 - Uncharted: Drake’s Fortune\n00:56:03 - Uncharted 2: Among Thieves\n01:06:46 - Uncharted 3: Drake’s Deception\n01:17:12 - The Last of Us\n01:31:15 - Uncharted 4: A Thief’s End\n01:43:44 - Uncharted: The Lost Legacy\n01:53:12 - The Last of Us Part II\n02:16:31 - Outro\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1750442406,
    "duration": 8352,
    "transcript_chunks": [
        {
            "text": "[Applause] [Music] 3. Heat. Heat. [Music] If you watched the 2024 Game Awards, I'm sure you were excited to see Naughty Dog announce their first new IP in a decade. This is the studio responsible for some of the most iconic game franchises ever. So, to see them announce Intergalactic: The Heretic Profit is naturally going to get us all hyped up. Naughty Dog working on something spacey. Ooh, something religious. Ah, and yes, while teasing us with the Trent Resner score, product placements, Akira and Cowboy Bbop vibes, and prominent voice actors, I'm sure got us all feeling a wide range of emotions. But for me, it was weirdly seeing the Naughty Dog logo at the end that hit me with a level of nostalgia I wasn't expecting. They knew what they were doing with that [ __ ] If you don't know, I'm Barrett Courtourtney. I'm known here at Kind of Funny for playing games and making in-depth videos about them. I've tackled Zelda, Persona, God of War, and a few other franchises. And while I love",
            "start": 11.99
        },
        {
            "text": "Barrett Courtourtney. I'm known here at Kind of Funny for playing games and making in-depth videos about them. I've tackled Zelda, Persona, God of War, and a few other franchises. And while I love making videos like these, I eventually got burnt out and told myself after a while that I was done, retired, more or less. But the nostalgic hit of that Naughty Dog logo sparked something in me. And before I even realized what I was doing, I had downloaded every Naughty Dog game onto my PS5 the day after the Game Awards. And then when I had all of the games downloaded, it really hit me that Naughty Dog has been present for my entire gaming lifetime. And I didn't even realize it while growing up. I was brought back to my babysitter's house where I played hours and hours of Crash Bandicoot, my middle school home, where I discovered the wonderful world of Jack and Dexter, and the first apartment I lived in with my wife playing The Last of Us for the very first time. So, I'm here one last time,",
            "start": 94.64
        },
        {
            "text": "school home, where I discovered the wonderful world of Jack and Dexter, and the first apartment I lived in with my wife playing The Last of Us for the very first time. So, I'm here one last time, and I want to look back and break down Naughty Dog's history with PlayStation. talk about what it's like playing these games today and go on any little tangents that the experience may have sparked. But this time, I I don't want this video to be about ranking these video games. Instead of comparing Crash Bandicoot to The Last of Us, let's instead focus on the journey. And obviously, like most of my videos, the spoiler gloves are off. So, maybe finish up Jack Combat Racing before I dive into its complex themes. Now, I know some of you hardcore dog fans out there are going to yell at me when I start this up and I don't talk about anything pre- Crash Bandicoot. And for that, I'm sorry. I know I would have had a lot to say about Math Jam and Ski Craze for the Apple 2 or Dream Zone and Kefir the",
            "start": 138.4
        },
        {
            "text": "this up and I don't talk about anything pre- Crash Bandicoot. And for that, I'm sorry. I know I would have had a lot to say about Math Jam and Ski Craze for the Apple 2 or Dream Zone and Kefir the Thief for Southerntherland for the AmIGGA. I'm sorry the headline lied to you and I have brought shame upon my name, but come on. We all know the studios legacy truly started to get going with the PlayStation one. [Music] The first Crash Bandicoot is the one I actually have the least nostalgia for, but funnily enough, it's the one I've probably replayed the most as an adult. I would say it's objectively the worst of the original Crash games simply because it was the first one in an era where developers were trying to figure out how to adapt platformers from the boring and old 2D space to the new and exciting 3D space. It's wild to think that Crash 1 came out just weeks before Mario 64 release in America back in 1996. They each took such different approaches to 3D platforming and it was",
            "start": 179.76
        },
        {
            "text": "new and exciting 3D space. It's wild to think that Crash 1 came out just weeks before Mario 64 release in America back in 1996. They each took such different approaches to 3D platforming and it was obvious which game became the godfather of 3D platformers. Yahoo! Yes, Mario 64 may have blown the coot out of the water, but there is still a charm to the more simplistic approach Naughty Dog took with Crash. Instead of sprawling levels where you could traverse anywhere and any way you wanted, Crash literally just took the linear 2D platformer design and made it 3D. You jump over gaps, spin attack enemies, and run to the end of a linear level while breaking every box you can find, or they break you. The biggest shakeup in design and gameplay was just which perspective you, the player, we're playing from. And Jesus Christ, there are so many perspectives and all of the axes. Traditional sides scrolling behind the back, kind of top down towards you with a big old boulder. Look, it was 1996.",
            "start": 233.52
        },
        {
            "text": "from. And Jesus Christ, there are so many perspectives and all of the axes. Traditional sides scrolling behind the back, kind of top down towards you with a big old boulder. Look, it was 1996. Naughty Dog was on the cutting edge of new video game technology like the Z-axis. They were learning. And honestly, for a game that's nearly 30 years old, it's impressive how much it does hold up. While the gameplay is stiff compared to the later entries, and some of the level design feels just off enough that it doesn't quite support the stiff gameplay, I noticed there was still a design philosophy to subtly teach the player how to deal with certain obstacles and then upping the ante with more complicated versions of those obstacles later on, which every platformer with a solid foundation has had since Super Mario Brothers. Now, the reason I've gone back to this game more so than the others in the Insane Trilogy is because despite its frustrating and aged design, there's still a level of",
            "start": 289.28
        },
        {
            "text": "had since Super Mario Brothers. Now, the reason I've gone back to this game more so than the others in the Insane Trilogy is because despite its frustrating and aged design, there's still a level of satisfaction I get from overcoming some of the more difficult platforming challenges while completing it all in pretty much one sitting. It's simple yet satisfying. It's a fun sort of frustrating that my messed up brain enjoys from platformers. Except those two bridge levels, those can get [ __ ] You combine that with the simple yet equally annoying boss fights, Crash Bandicoot was a solid first entry for Naughty Dog in the 3D realm and obviously did well enough for Sony to approve two sequels and a spin-off. But the beginning of Naughty Dog's legacy with PlayStation isn't just significant because it put them on the map. Crash became the foundation of their DNA. Now, obviously, the gameplay Naughty Dog is known for has evolved significantly since this game, but there's something about the",
            "start": 334.56
        },
        {
            "text": "it put them on the map. Crash became the foundation of their DNA. Now, obviously, the gameplay Naughty Dog is known for has evolved significantly since this game, but there's something about the sense of adventure that was much more important for the future of Naughty Dog at the time. Now, your mission as Crash in the game is to get back to Neoortex's laboratory to kick his butt for experimenting on you and other animals and also rescue your suspiciously more humanoid girlfriend, Bandicoot. H. You travel from island to island, fighting other anthropomorphic animals, weird little robots, and questionably designed native islanders to seek justice. With the help of Akuaku, you kick Cortex's butt and ride off into the sunset with the most humanl lookinging bandicoot I've ever seen in my life. That's the entire plot. So, there's nothing we can really take away from any of the Crash games really that show us how Naughty Dog got to telling stories like The Last of Us. But there is a sense of",
            "start": 380.16
        },
        {
            "text": "That's the entire plot. So, there's nothing we can really take away from any of the Crash games really that show us how Naughty Dog got to telling stories like The Last of Us. But there is a sense of adventure we can claim from here that shows us how we got to the fun sense of globe trotting that we get in Uncharted. The environments, music, linear level design, and simple environmental storytelling across both the levels and overworld map all help in making you have this sense of momentum. Exploring a treacherous yet exciting and fun world, which we definitely saw the studio iterate on for the next couple of decades. It is a poorly aaged game, but it's an important one that led us to the likes of Jack and Daxter and Uncharted. And as someone who has more memories of playing this as an adult than as a kid, I weirdly treasure it. It all started here. And when it comes to Crash in particular, it only got better. Seriously, why does she look like this? Now, Crash 2: Electric Bugaloo came",
            "start": 426.56
        },
        {
            "text": "than as a kid, I weirdly treasure it. It all started here. And when it comes to Crash in particular, it only got better. Seriously, why does she look like this? Now, Crash 2: Electric Bugaloo came out just a year later, and something that really struck me this time around while playing it is that it was the first Crash game to come out after Mario 64. This game had an advantage the first one didn't, to take influence from the competition. There is an alternate reality where Crash 2 had more sprawling levels, a fully explorable hub world, more freedom and movement and discoverability. But no, Naughty Dog stuck to their guns with Crash 2, and I respect the hell out of that. So many times we've seen trend chasing that sometimes works out, but for the most part doesn't. Naughty Dog looked at what they had with Crash 1, believed in that formula enough, and refined it. Little tweaks here and there, like adding a slide jump, allowed them to design platforming challenges that still felt",
            "start": 469.6
        },
        {
            "text": "at what they had with Crash 1, believed in that formula enough, and refined it. Little tweaks here and there, like adding a slide jump, allowed them to design platforming challenges that still felt difficult, but fair with the tools you're given, and not those godamn bridges. Something else you could feel Naughty Dog wanting to add more to was the story and world. Crash has a sister now. Cortex needs Crash's help. Akuaku is still kind of just there. The story is pretty much just kick Cortex's ass again, but it could have just been straightforward like the first game, adding the not so subtle twists of Cortex manipulating you into collecting crystals, bosses from the first game getting little follow-ups that make sense, and Embryo returning with a vendetta for Cortex shows that the team wanted to have fun building out these characters and this world. Now, to go back to gameplay and design real quick and how the story affects that, you now have to find a purple crystal in every level",
            "start": 519.68
        },
        {
            "text": "wanted to have fun building out these characters and this world. Now, to go back to gameplay and design real quick and how the story affects that, you now have to find a purple crystal in every level for Cortex to progress through the game. If you remember from the first Crash, to progress, you really just had to beat the level. But if you wanted to go above and beyond, you could collect gems in every level by destroying every box, which would give you a slightly alternate ending with your model Bandicoot girlfriend. And as someone who has never had the interest in going all out and bashing my head against Wampa of fruit boxes, I always felt like I was kind of missing out. The fact that in Crash 2 you have to walk away from every level with a collectible gives a new level of satisfaction. Are these crystals participation trophies? 100% yes. But that also made getting the gems even more satisfying because if you did break every box in a level, you were walking out with two",
            "start": 565.76
        },
        {
            "text": "Are these crystals participation trophies? 100% yes. But that also made getting the gems even more satisfying because if you did break every box in a level, you were walking out with two collectibles. Hell yeah. I love collectibles. with another banging soundtrack and even more varied levels, it's hard to argue against the fact that Crash 2 is the best of the original bunch. While I did miss the overworld from the first game that gave a good sense of progress momentum, there's not much I can really ding this game for. It's still a great 3D platformer. Okay, except for this little [ __ ] I get that he's a pointy porcupine, but even when he goes full pork mode, I should still be able to slide into his face because his pointy bits are pointing backwards. His cute little nose shouldn't hurt me. It's [ __ ] Now, Crash Bandicoot Warps. Excuse me. Sorry. Can we Can we take that again? Okay, cool. Now, Crash Bandicoot Warp was the game I was in love with as a kid. It was sick as hell. You",
            "start": 607.2
        },
        {
            "text": "me. It's [ __ ] Now, Crash Bandicoot Warps. Excuse me. Sorry. Can we Can we take that again? Okay, cool. Now, Crash Bandicoot Warp was the game I was in love with as a kid. It was sick as hell. You timeraveled the same way Arnold did in Terminator. You raced on a motorcycle and you got to play as Coco in Wave Race levels. And you know what was sick as hell? To six-year-old Barrett. I'm probably not six here. This is probably more like two. Anyways, it was [ __ ] Wave Race dog. Seriously, I adored this game as a kid. And was it purely because it was the one I had access to? Probably. But as a kid, I really thought this was the peak for the video game mascot dude with the most tude. You got to explore tombs, futuristic cities, and battle Cortex while Aku Aku and his evil brother Ukahuka were shooting [ __ ] laser beams at each other. Hell yeah. And lastly, the main theme of this game in particular is what I think of when I think of Crash Bandicoot music. The entire soundtrack built off",
            "start": 651.92
        },
        {
            "text": "shooting [ __ ] laser beams at each other. Hell yeah. And lastly, the main theme of this game in particular is what I think of when I think of Crash Bandicoot music. The entire soundtrack built off of the fun from the first two that I personally hold up there with some of my favorite 3D platformer soundtracks. Now, as an adult, see, this is where constantly going back to replay video games, one of the things I'm known for, becomes a double-edged sword. While I get to go back, appreciate, and find new things to take away from the art, I can also just as easily see how something doesn't hold up as well. And Crash Bandicoot Warps is one of those moments where my adult brain can't look past so many things. The primary one being that it's kind of more of the same of Crash 2, but simpler. You have the same core type of levels now with less challenge. You have the same exact collectibles, and you have a few new gimmicky levels that are neat ideas, but don't feel fully fleshed out. I think",
            "start": 710.16
        },
        {
            "text": "have the same core type of levels now with less challenge. You have the same exact collectibles, and you have a few new gimmicky levels that are neat ideas, but don't feel fully fleshed out. I think the one gameplay thing that stood out to me the most is that you earn moves throughout the game when defeating bosses, which I do think is a smart way to ramp up level design throughout a game. though unfortunately it never feels completely utilized here and it's just kind of weird when in Crash 2 you had moves like body slam from the very beginning. Now maybe it's because I played all three of the games in the span of like 4 days but at the end of this adventure I was getting tired of the crash formula which after a total of 12 hours of gameplay was starting to feel stale. And looking back at the production timeline of these games honestly paints a clear picture of why. Crash one in 96, Crash 2 in 97, and Crash 3 in 98. Even with how fast it took to make a video game back then compared to",
            "start": 761.12
        },
        {
            "text": "the production timeline of these games honestly paints a clear picture of why. Crash one in 96, Crash 2 in 97, and Crash 3 in 98. Even with how fast it took to make a video game back then compared to today, it does seem like too small of a window to really sit and think about what you can do to keep the Crash formula feeling fresh. By comparison, Mario Sunshine came out 6 years after 64. Think about how much worse Sunshine would have been if Nintendo gave themselves only a year to make a follow-up to Mario 64. Who am I kidding? It's impossible for Sunshine to be any worse. I can't I can't jump. I just What the [ __ ] was that? Is it that powerful? What is hap What is going on? [Music] What is going on? What is happening? [Music] What the [ __ ] is going on? And again, this isn't to say the Crash Bandicoot linear 3D platformer formula was so good that it had peaked, but I do wonder if Naughty Dog was given a bit of breathing room in between each game, what we could have seen. Look at",
            "start": 804.88
        },
        {
            "text": "Crash Bandicoot linear 3D platformer formula was so good that it had peaked, but I do wonder if Naughty Dog was given a bit of breathing room in between each game, what we could have seen. Look at Crash 4: It's About Time, for example. That's legitimately the best Crash game, and Toys for Bob got to sit and think for a bit on what to do to push that formula forward. Their reward for that becoming a Call of Duty support studio, which real quick, I'm glad that that team is still around and freed themselves from Activision and Xbox because if they didn't, who knows if they'd still be around at all. Anyways, back to Naughty Dog. If I was getting tired of this linear 3D formula after just a few days, wanting more freedom, and getting just enough story and lore to want more, I can only imagine how the team at Naughty Dog felt. But after their decision to double down on what Crash was with Crash 2, does it feel right to completely blow it all up and go the Mario 64 type route? Because at",
            "start": 871.44
        },
        {
            "text": "how the team at Naughty Dog felt. But after their decision to double down on what Crash was with Crash 2, does it feel right to completely blow it all up and go the Mario 64 type route? Because at that point, is it even a Crash Bandicoot game anymore? More on that idea later because we have a cart racer to talk about, everybody. [Music] Continuing the insane production timeline of the Crash games, Naughty Dog would release Crash Team Racing in October 1999. not even a full year later after Crash Warped. And it would be the final Crash game that Naughty Dog worked on since they would soon be bought out by Sony while Universal Interactive would keep the rights to our favorite Orange Mercupial. And to reiterate, at this point in replaying these games, I was ready for something completely new and fresh. I was ready for what Naughty Dog was cooking up for their PS2 debut. I was not particularly in the mood for a cart racer spin-off, but god damn, I was not familiar with Crash Team Racing's",
            "start": 916.8
        },
        {
            "text": "and fresh. I was ready for what Naughty Dog was cooking up for their PS2 debut. I was not particularly in the mood for a cart racer spin-off, but god damn, I was not familiar with Crash Team Racing's game. Now, I do remember playing CTR a couple of times back in the day, but not much specifically. Playing it today, I'm surprised it didn't make more of an impression on me. While yes, it follows a lot of the exact ideas that Mario Kart had, like so many other cart racers did and still do, there's still the Crash Bandicoot attitude that does enough to break itself out of the mold. And at first, I wasn't a fan. Yes, seeing the levels we all know and love from the Crash games reimagined for racetracks with the jovial music we all know and love is super charming. You get items during races to use against your competitors, and you have a solid roster of characters to race as. And honestly, you don't need much more to be a competent IP cart racer. The main key, though, is the feel of it.",
            "start": 965.52
        },
        {
            "text": "to use against your competitors, and you have a solid roster of characters to race as. And honestly, you don't need much more to be a competent IP cart racer. The main key, though, is the feel of it. Mario Kart throughout the generations has been the gold standard to cart racing feel. speed, how much rubber banding there is, drifting, and the array of items that you use to get a leg up over the other racers. Now, real quick, if you're not a cart racing dork like myself and you're not sure what rubber banding means, here's an explanation from our friend, Mr. Greg. Hey everyone, it's Mr. Greg. Can you say Mr. Greg? Good. Now, my friend Barrett wants me to tell you what rubber banding means. Rubber banding is when the AI racers become artificially faster when you're ahead of them to keep you and your opponents close together to maintain a level of challenge. It's kind of like when you're running away from me and you think you're getting away, but I'll always be right behind you, Andy.",
            "start": 1010.4
        },
        {
            "text": "and your opponents close together to maintain a level of challenge. It's kind of like when you're running away from me and you think you're getting away, but I'll always be right behind you, Andy. You will never get away. Andy, behind you. It's me, Andy. Thanks, Mr. Greg. Anyways, at first I was struggling with Crash Team Racing because it didn't feel quite right. But I still wanted to play through the entire adventure mode and give it its due because so many people love this game and I wanted to see if I was too Mario Kart 8 pilled to appreciate what this game was doing differently. And something I had to remind myself while playing CTR, was to try and not compare it to Mario Kart 8, but to Mario Kart 64, since that was where the design of this game was coming from, not the cart racers we play today. Once I did that, and then finally understood how drift boosting worked, I was starting to have a blast. While the items never felt quite right when using them, and some tracks didn't",
            "start": 1061.36
        },
        {
            "text": "we play today. Once I did that, and then finally understood how drift boosting worked, I was starting to have a blast. While the items never felt quite right when using them, and some tracks didn't feel welld designed for the speed you were going, I was taken aback by the challenge of this game. The rubber banding in full races was not nearly as lenient as the Mario Kart franchise, and the one-on-one races at times almost felt unfair, unless you got lucky with the first item you picked up in the race. And yes, I swore I thought about throwing my controller. I had a wide range of emotions while playing this game. But it was still fun purely because it was the most challenge I had felt in a cart racer in a long time. Again, I wasn't familiar with your game, cart racer developer, Naughty Dog. And for that, I apologize. But with that, Crash Team Racing marked the end of a chapter for Naughty Dog. During the development on this game, they were secretly at work on their brand new IP that",
            "start": 1114.08
        },
        {
            "text": "And for that, I apologize. But with that, Crash Team Racing marked the end of a chapter for Naughty Dog. During the development on this game, they were secretly at work on their brand new IP that would help break them out of the mold they had settled into, while still recognizing what they did best as a studio. And this next chapter in their history isn't significant just because it was a new franchise, but because it was their first game being fully owned by Sony and it was their big debut for the new generation of consoles. Jack and Dexter the Precursor Legacy was one of the coolest games to me growing up and at the time I didn't quite understand why I loved it so much. I was also very unaware of the video game space that I didn't even know that it was the same people who made Crash Bandicoot. But revisiting this game as an adult, of course, this game was extremely my [ __ ] Remember with Crash how the main competition was solely Mario 64 at first? Well, Naughty Dog this time had a",
            "start": 1160.56
        },
        {
            "text": "But revisiting this game as an adult, of course, this game was extremely my [ __ ] Remember with Crash how the main competition was solely Mario 64 at first? Well, Naughty Dog this time had a huge advantage with their PS2 debut by being able to look at the entire previous generation of 3D platformers, not just Mario 64. Like everything the top dogs at Rare were making at the time. Instead of going the Mario route of keeping story as light as possible and all of your platforming is kept in segmented levels, Naughty Dog looked to games like Banjo Kazouie and Donkey Kong 64 to find their next step. Look, it was probably only Banjo, but just let me believe that Donkey Kong 64 somehow inspired Naughty Dog. In all seriousness, Jack and Dexter being a 3D platformer collectathon where levels kind of meld into each other to build a cohesive world instead of just doing segmented levels with random themes shook up Naughty Dog's formula enough to make something really inspired considering their",
            "start": 1209.2
        },
        {
            "text": "of meld into each other to build a cohesive world instead of just doing segmented levels with random themes shook up Naughty Dog's formula enough to make something really inspired considering their trajectory with Crash. and traversing through the game to collect orbs by doing various activities like shooting swamp rats, driving around on a cool speeder bike, or just straight up platforming while fighting off baddies shakes up the momentto- moment gameplay enough to feel like a true evolution of what Naughty Dog had done before. They don't totally abandon what they learned from Crash either. They implement so many gameplay elements from Crash that were the gimmicks of entire levels and subtly bring them in for moments here and there throughout Jack and Dexter to make the flow of the game more dynamic. Recognizing that this time around made me appreciate how much their gameplay and design had evolved. Granted, it's still a 3D platformer. It's not like it's on another level of what the",
            "start": 1258.16
        },
        {
            "text": "more dynamic. Recognizing that this time around made me appreciate how much their gameplay and design had evolved. Granted, it's still a 3D platformer. It's not like it's on another level of what the genre is capable of, but comparatively to Crash, they really stepped up their game. And while the story isn't anything crazy compared to Crash, you can tell Naughty Dog was looking to build memorable worlds and characters that make people like me want more out of it. You play as Jack, a young blonde silent protagonist who is looking to help his bud Daxter return to his original human form after being transformed into an atel from a vat of dark eco. You then go on a quest accompanied by Samos and his daughter to find Gaul and his weirdly hot sister to turn Daxter back. The siblings end up being evil. You fight them to save the world and in doing so sacrifice Daxter's chance at transforming back into a human. All I can really say about this story that has a Nickelodeon aesthetic wrapped",
            "start": 1300.24
        },
        {
            "text": "evil. You fight them to save the world and in doing so sacrifice Daxter's chance at transforming back into a human. All I can really say about this story that has a Nickelodeon aesthetic wrapped around it is that you can tell here Naughty Dog has been itching to make something more out of their worlds and characters. While the story itself is simple, there are so many fun and zany characters that make lasting impressions. And their world building connects some siloed ideas from Crash to have more purpose this time around. Exploring mysterious tombs and lost cities have more meaning because of the mysterious precursors. There's more thought in building out a full universe here, but leaving just enough questions to keep us hooked for another game, all while keeping the fun and youthful tone Naughty Dog was known for at the time. With all of these elements, it's no surprise that this game made such an impression on me during a time in my life where I was pretty much only into licensed",
            "start": 1344.08
        },
        {
            "text": "Naughty Dog was known for at the time. With all of these elements, it's no surprise that this game made such an impression on me during a time in my life where I was pretty much only into licensed games like Star Wars Battlefront and Spongebob Battle for Bikini Bottom. and playing it today, it still holds up as a fun and engaging platformer collectathon. But in terms of what Naughty Dog could do with what they found with Jack and Dexter, they were in a similar situation as they were with Crash 1. They had a solid foundation, but could grow to have it be much more refined to really compete with the likes of Banjo Kazouie. But instead of doubling down on what Naughty Dog had built like they did with the Crash trilogy, they decided to take this exciting new franchise in an exciting and different direction for its sequel. And it's here where we see the trajectory of Naughty Dog as a developer, change dramatically. 2001, the year Jack and Dexter came out, was a significant one. Rockstar",
            "start": 1388.08
        },
        {
            "text": "direction for its sequel. And it's here where we see the trajectory of Naughty Dog as a developer, change dramatically. 2001, the year Jack and Dexter came out, was a significant one. Rockstar came out swinging with the release of Grand Theft Auto 3 and completely changed the landscape of video games forever in more ways than one. And for a studio that obviously wanted to do more with their stories and game design, inspiration for Naughty Dog to push that envelope even further had struck. [Music] To pull the curtain back a bit, I tried venturing on this same exact journey before. For whatever reason, back in 2018, before any of y'all even knew who I was, and before I ever thought about making videos about me playing entire franchises, I got the itch to play every Naughty Dog game. Maybe it was the excitement for The Last of Us Part Two at the time. Maybe it was because the Jack games had recently been ported to the PS4. I'm not sure. But I tried to walk this path 7 years ago, and I",
            "start": 1430.88
        },
        {
            "text": "it was the excitement for The Last of Us Part Two at the time. Maybe it was because the Jack games had recently been ported to the PS4. I'm not sure. But I tried to walk this path 7 years ago, and I stopped at Jack 2. Now, before I go any further, I need to give y'all context. I was a Jack 2 kid. Having both the first game and this one available to me back to back was a dream come true. A fun 3D platformer collectathon that was reminiscent of Donkey Kong 64 and a gritty sequel set in a dystopian city that plays more like GTA. I remember loving the story, world, and explorable city that made me feel so immersed. It was also a GTA clone I was allowed to have in the house since my mom knew what GTA was and didn't let me own one until like the summer before 8th grade. Barrett, why didn't you just sneak it into your house? Look, I was not a sneaky kid. I also sucked at lying. Wait, why am I explaining this to you? You're judging a child right now, you weirdo. Anyways, games like Jack 2 and",
            "start": 1484.64
        },
        {
            "text": "sneak it into your house? Look, I was not a sneaky kid. I also sucked at lying. Wait, why am I explaining this to you? You're judging a child right now, you weirdo. Anyways, games like Jack 2 and Bully were the oases for me in the desert of a GTA forbidden home. And for the longest time, I heralded Jack 2 as one of my favorite games of all time. The memories of driving around on futuristic speeders, shooting metal heads, making friends, finding love, and experiencing the twist and turns of Jack's fate were some of my favorites growing up. And for the longest time, a good friend of mine kept telling me I was wrong, that Jack 2 actually sucked and it played horribly. And if I ever tried going back, I would realize how stupid of a child I was. That might have been part of the reason why I went back in 2018, to see the evolution of Naughty Dog and to prove her wrong. But holy [ __ ] she was so right. This game is bad. And many times I wanted to stop playing, but I couldn't quit like I did",
            "start": 1531.84
        },
        {
            "text": "back in 2018, to see the evolution of Naughty Dog and to prove her wrong. But holy [ __ ] she was so right. This game is bad. And many times I wanted to stop playing, but I couldn't quit like I did 7 years ago. This time I was making content, and it almost [ __ ] broke me. To reiterate, Jack 2 kind of stepped away from what Jack 1 was all about. You're no longer collecting orbs in themes levels interconnected together while platforming and punching your way through obstacles. This time, you're getting missions from characters, doing specific tasks for them, like escorting cargo throughout Haven City, going through the slums to shoot and kill a bunch of metal heads, or doing sick tricks on your hoverboard because Tony Hawk was also hot at the time. It's structured exactly like a Grand Theft Auto, which sounds fun, but it has one major flaw. Haven City is the most batshit designed city in a game while also being one of the most dull open worlds in terms of interactivity I have ever gone",
            "start": 1583.52
        },
        {
            "text": "Auto, which sounds fun, but it has one major flaw. Haven City is the most batshit designed city in a game while also being one of the most dull open worlds in terms of interactivity I have ever gone back to. In between missions, there's nothing to do but accept racing challenges, get in trouble, or get lost in all of the whining roads that don't make any sense. and they expect you to drive around in this city with tight and winding roads and not like a good little boy who drives very slowly like all of the other citizens in this town. You got to zip from one place to another during missions where you're either timed or running from the cops and sometimes both and it doesn't feel good. There are so many things you easily run into. Your vehicle blows up easily and the checkpointing is almost nonexistent. Granted, you're not just driving around in a city, not designed to be driven around in. You also have levels outside the city where you go out and shoot your way through pretty linear",
            "start": 1631.44
        },
        {
            "text": "nonexistent. Granted, you're not just driving around in a city, not designed to be driven around in. You also have levels outside the city where you go out and shoot your way through pretty linear areas. And it's here where I'm reminded what Jack and Dexter was. Much smaller, much more focused. And getting these levels spread out so far from each other on the map where you're just slowly going from point A to B really showcases how unnecessary this open world was. Now, these linear missions themselves aren't anything really to write home about. You're mainly shooting through waves of uninteresting enemies to get an item a character requested or blow something up, etc. And for a game that decided to focus more on shooting rather than platforming, the shooting is fine. And when there's actual platforming, it doesn't feel improved upon from the first game since so much time was spent making this an openw world shooter game. There are however some big action moments that I definitely see",
            "start": 1679.84
        },
        {
            "text": "platforming, it doesn't feel improved upon from the first game since so much time was spent making this an openw world shooter game. There are however some big action moments that I definitely see Naughty Dog playing around with here that will eventually evolve into the big setpiece moments we know them for today. So hey, something important did come from this game. But overall in terms of gameplay, Jack 2 fundamentally fails at being a sequel to the first game and fails at being a GTA clone. In chasing the GTA high, Naughty Dog sacrificed what Jack and Dexter originally was, a solid 3D platformer. Now, was that the wrong decision for the time? probably not. It was praised by critics and fans at the time and got more attention than it probably would have if it stuck to being just a 3D platformer. It just aged horribly, and I would have preferred to see what Naughty Dog could have done to improve the formula of the original. But to be completely fair to it, most GTA clones early on did",
            "start": 1729.6
        },
        {
            "text": "It just aged horribly, and I would have preferred to see what Naughty Dog could have done to improve the formula of the original. But to be completely fair to it, most GTA clones early on did not age well. Jack 2 is just one of the more poorly aged ones. And I know you're probably thinking, I just suck at video games. But dog, I played Persona 1. I've played Zelda 2. both as an adult who knows how to play difficult and obtuse video games, but there's a difference between difficulty and poor game design. And Jack 2 takes the cake in poor game design. But what Naughty Dog sacrificed in gameplay and sensible game design, they gained in story and world building. In Jack 2, we see our heroes from the end of the first game get shot into a distant future dystopian city. And after Jack gets arrested, experimented on with Dark Eco, and eventually escapes, he and Daxter join a resistance group to get back at the leader of the city who experimented on you. You reunite with your friends from the",
            "start": 1772.96
        },
        {
            "text": "experimented on with Dark Eco, and eventually escapes, he and Daxter join a resistance group to get back at the leader of the city who experimented on you. You reunite with your friends from the first game. There's some teen drama. There's a big reveal that one of the dudes helping you is actually the big bad who wants to destroy the world with precursor tech, which all ends with a big twist where this chosen kid who's meant to stop the big bad is actually Jack as a kid who sent back in time to hide away and train for the events of this game. Overall, it's a fun story. Are there some thin plot points like the head of the police trying to take your girl from you through the power of racing and for whatever reason, she defends him despite the fact that he's part of the militaristic police force that oppresses the city? Yeah. And like, why doesn't this dude just arrest Jack again instead? What's going on here? But the twist and turns of the time travel stuff, helping a resistance fight",
            "start": 1820.4
        },
        {
            "text": "force that oppresses the city? Yeah. And like, why doesn't this dude just arrest Jack again instead? What's going on here? But the twist and turns of the time travel stuff, helping a resistance fight against a tyrannical government led by Mr. crabs while also dealing with the looming threat of an outside force looking to destroy everything. All still works and key moments were still effective. It's a more mature, edgy story while also keeping some of the levity from the first game. And in that sense, I do think it succeeds at being a sequel to Jack and Dexter while chasing the success of Grand Theft Auto. The story reminded me why I loved this game so much as a kid, and it made me daydream of a universe where this franchise got a Nickelodeon adaptation instead of Tac and the power of Guju. I might be crazy for thinking this, but this game in particular really felt like the first step Naughty Dog took to becoming the big Hollywood aspiring storytellers that we know them as today. And",
            "start": 1860.72
        },
        {
            "text": "I might be crazy for thinking this, but this game in particular really felt like the first step Naughty Dog took to becoming the big Hollywood aspiring storytellers that we know them as today. And even though I rightfully talked so much [ __ ] about Haven City, having the obvious inspiration from places like Tatooine and Coruscant in the Star Wars prequels, while expanding upon the fun of adventuring around ancient cities all created such a vibe that childhood Barrett loved and was truly something special for the time. Naughty Dog knew they had something here in terms of what they could be as a studio and only pressed on the gas more from here on out in terms of storytelling. But once again, this is the double-edged sword of replaying video games. I didn't talk about it much when I brought this up for Crash Warps, but playing that game today and realizing it's not the best Crash game doesn't devastate me to the point of ruining my memories of it. But Jack 2 is a bit of a different",
            "start": 1910.88
        },
        {
            "text": "this up for Crash Warps, but playing that game today and realizing it's not the best Crash game doesn't devastate me to the point of ruining my memories of it. But Jack 2 is a bit of a different story. I wish I just kept my memories of it. Honestly, I kind of hate this game now because of how badly the gameplay has aged, and it makes me question if I actually was a stupid kid who didn't know what good games were. It's moments like these where one of my favorite games of all time growing up is now kind of tarnished in my eyes that makes me question if going back to replay old games is actually worth it. It's something I love doing. But is it worth the cost? Should I just hold on to those memories? Well, it's too late now. [Music] Continuing their insane pace of releasing games, Jack 3 came out in 2004, only a year after Jack 2. With only a year to follow up on a game that is now so disappointing to me, let me tell you, I was dreading playing these games back to back. Similar to what we",
            "start": 1953.84
        },
        {
            "text": "out in 2004, only a year after Jack 2. With only a year to follow up on a game that is now so disappointing to me, let me tell you, I was dreading playing these games back to back. Similar to what we saw with Crash, what really can you change about a game's DNA in just a year? And with Jack 3, a game I remember very little of, was it just going to be more of the same infuriating design that was going to make me pull out what little hair I had left out of my head? If Jack 2 was the biggest punishment I had taking on this project, Jack 3 ended up being the biggest surprise in all of this. On paper, Jack 3 doesn't do too much differently. It's still an open world. It's still kind of a third-person shooter where you go around getting missions from allies. It's still kind of a platformer, but something changed between two and three which made these elements which felt so disconnected and frustrating come together in a more cohesive way that surprisingly balances the big swing Jack 2 had",
            "start": 2008.32
        },
        {
            "text": "something changed between two and three which made these elements which felt so disconnected and frustrating come together in a more cohesive way that surprisingly balances the big swing Jack 2 had attempted with the fun adventure I love so much from the first game. The biggest question I had while playing Jack 3 was how how did Naughty Dog pull it off? How did they make me see and actually appreciate the vision they had fumbled with Jack 2? Enter Amy Henik. Amy Henig and Naughty Dog are names that go hand in hand, but the studio was around for a while before Hen had even joined. Naughty Dog was founded by Jason Rubin and Andy Gavin, who served as the key visionaries for the studio for the longest time. And I know plenty of you are probably shaking your fist to the sky in anger that I've not brought them up until now. And I mainly waited because Jack 3 is the last game they worked on in a major way before they both left the studio. Now, think about the overall vibe of Naughty Dog",
            "start": 2056.0
        },
        {
            "text": "not brought them up until now. And I mainly waited because Jack 3 is the last game they worked on in a major way before they both left the studio. Now, think about the overall vibe of Naughty Dog Games up until this point, and then think about what games we still have left to talk about. And it's here where I think we get our clearest answer on how you go from making Crash Bandicoot to The Last of Us. As the two founders were close to sunsetting their time at the company, Amy Hen joins to co-direct Jack 3. Up until Jack 3, Amy Hen had worked at a few different places on a few different projects, most notably the Legacy of Kain series at Crystal Dynamics. Don't tell Hussein, but I haven't actually played the Legacy of Kane series. My understanding though is that it gained a cult following for its incredible story, characters, and gameplay. But even just watching a little bit of it, you could tell she would be a great fit for what Naughty Dog was making at the time. So, while Jack 3",
            "start": 2104.16
        },
        {
            "text": "for its incredible story, characters, and gameplay. But even just watching a little bit of it, you could tell she would be a great fit for what Naughty Dog was making at the time. So, while Jack 3 continues 2's fundamental GTA like structure, it makes a bunch of smart decisions to better implement those inspirations alongside being a cartoony 3D platformer shooter. The more quote unquote openworld part of this game is a huge desert that actually feels designed to be driven around in with these huge Mad Max style vehicles. Contrast to how tight and constricting Haven City felt in two. And speaking of Haven City, when you eventually go back there, it is heavily paired down in ways that made me relieved I wasn't going back to the same maddening experience as I did with Jack 2. A lot of the city is cut, making navigation way easier to understand. The city is less busy with traffic, which makes driving around just a bit easier, and the wanted system is completely gone. And they smartly",
            "start": 2147.68
        },
        {
            "text": "city is cut, making navigation way easier to understand. The city is less busy with traffic, which makes driving around just a bit easier, and the wanted system is completely gone. And they smartly masked all of these changes behind this war between Haven City and the Metalheads. It's a smart way to let lore and story dictate design that makes more sense for the game that you're making. And the structure of mission design felt more fluid this time around. What I mean by that is that in Jack 2, missions were usually segmented into separate ideas. Here's a shooting waves of enemies mission. Here's a skateboarding mission. Here's a platforming mission. where here all of the different gameplay elements like shooting and platforming were woven together so that no one element overstate its welcome. You combine that with some of the loces you visit in this game and there were some moments where I thought to myself, \"Holy [ __ ] I'm playing Uncharted right now.\" This natural iteration of",
            "start": 2194.64
        },
        {
            "text": "welcome. You combine that with some of the loces you visit in this game and there were some moments where I thought to myself, \"Holy [ __ ] I'm playing Uncharted right now.\" This natural iteration of gameplay design reminded me a lot of the jump from Crash to the first Jack and Dexter where so many segmented ideas from Crash levels were mixed and matched in Jack and Dexter to make levels more complex and interesting to explore through. And with Naughty Dog kind of doing that again here, integrating gunplay with traversal and puzzles all a bit more naturally, they had found the formula that would become the key element for their next big franchise. Now, I don't want to make it sound like Amy Henig was the sole reason for Jack 3 being a significant improvement over Jack 2. Obviously, this was overall the same studio. So, naturally, a lot of people who worked on Two probably thought a lot about what to do with a follow-up to their first game in this particular style. I just think it's",
            "start": 2242.24
        },
        {
            "text": "was overall the same studio. So, naturally, a lot of people who worked on Two probably thought a lot about what to do with a follow-up to their first game in this particular style. I just think it's significant that in the middle of all of this, I was starting to really feel the Uncharted of it all coming together in a big way. and not just in design and atmosphere, but in big setpiece moments as well, which considering the time feels so Halo inspired. Earlier, I kind of insinuated that GTA was like the sole game that inspired Naughty Dog post 2001, and obviously that's not true because yes, there were games like Soul Reaver and Halo also coming out and doing so much for the medium as well. And while I stand by GTA having a chokeold on what Jack 2 was being inspired by, Jack 3 wore way more influences on its sleeve that helped it age a bit more gracefully than its predecessor. And while the story still has the goofy and edgy tone mixed with the sci-fi adventure that you would expect,",
            "start": 2289.52
        },
        {
            "text": "influences on its sleeve that helped it age a bit more gracefully than its predecessor. And while the story still has the goofy and edgy tone mixed with the sci-fi adventure that you would expect, the twist and turns this time around feel a bit more character focused rather than just trying to have drama for drama's sake. In the middle of this all-out war that started at the end of Jack 2, we see our hero exiled from Haven City for his involvement with criminals from the previous game that kind of led to the city being in the state that it's in. Jack gets rescued by a tribe of wastelanders led by Damus and is indebted to them. As Jack and Dexter win over the trust of some of the wastelanders, they also sneak their way back into Haven City to help out with the war effort. Jack and Dexter fight dark makers, robots, metal heads, and this dork from Jack 2 to save the world from destruction. Along the way, you discover Damus is Jack's father right as he dies. Vager, this pompous dork who",
            "start": 2336.24
        },
        {
            "text": "fight dark makers, robots, metal heads, and this dork from Jack 2 to save the world from destruction. Along the way, you discover Damus is Jack's father right as he dies. Vager, this pompous dork who had you exiled, wants to become a precursor, and precursors themselves are actually just util kind of like Daxter. You save the day, kiss the wrong girl, and deny a big galactic adventure to stay with your found family. I do really enjoy the story. And yes, while there are weird choices like sidelining Kira Jack's love interest from the first two games and making Ashlin a last second love interest for some reason, there is a lot that still had me way more invested in the story than I expected. Making Damus Jack's dad was predictable, but adding the layer of Jack not being able to tell Damus that still made that moment impactful in a way that makes you actually care about the characters. Vagger is also a different and more interesting antagonist than we've seen in this universe. And while",
            "start": 2376.8
        },
        {
            "text": "still made that moment impactful in a way that makes you actually care about the characters. Vagger is also a different and more interesting antagonist than we've seen in this universe. And while Cyber Arrol is silly, I like that he was another consequence that carried over from Jack 2. Choices like that and doubling down on making Haven City a full-on war zone makes the events of Jack 2 actually feel impactful. This universe and story overall had the sauce and showcased that Naughty Dog wasn't just growing in gameplay, but storytelling as well. Now, when Naughty Dog announced Intergalactic, it was exciting because it felt like something new and different for the studio. But returning to the Jack Trilogy reminded me that a sci-fi adventure is actually a part of their DNA. And while the team has changed a lot since Jack 3, it's not insignificant that this happened to be the first game that Neil Duckman worked on for Naughty Dog. And it has me wondering just how much of the roots",
            "start": 2422.0
        },
        {
            "text": "the team has changed a lot since Jack 3, it's not insignificant that this happened to be the first game that Neil Duckman worked on for Naughty Dog. And it has me wondering just how much of the roots Naughty Dog might look back to for their new IP. But we're not quite there yet. With another trilogy wrapped, new blood coming into the studio, and the next generation of consoles at the time looming, it was time to see what this team could really do with the magic they found during the PS2 era, and how they could evolve it even more. Just kidding. We have another racing game to talk about. [Music] I have to come out once again and say I lied to you not once but twice with the title of this video because I've never actually played Jack X before. I have a vague memory of trying out a demo for it at Best Buy but that's about it. And for that I apologize. I didn't actually replay Jack X. I just played it. Coming out just a year after Jack 3, Jack Combat Racing continues the industry trend of",
            "start": 2468.16
        },
        {
            "text": "at Best Buy but that's about it. And for that I apologize. I didn't actually replay Jack X. I just played it. Coming out just a year after Jack 3, Jack Combat Racing continues the industry trend of the 2000s of every cartoony game franchise getting a racing game spin-off. And while most cart racer spin-offs may not have made a lot of sense for the respective IPs, just feeble attempts at chasing the Mario Kart High, Jack getting a racing game actually fits right at home with the universe. While Jack 2 had some very basic racing challenges throughout Haven City that will now haunt me for the rest of my days, Jack 3 had introduced these fun off-roading like vehicles that you use to explore the wasteland, race around, and blow up other wastelanders. So, making a game solely focused on that makes a lot of sense. There's a solid foundation there to make something intense, fun, and not over complicated. And Naughty Dog succeeded with the intensity, did a good enough job at making it fun, and",
            "start": 2518.96
        },
        {
            "text": "a lot of sense. There's a solid foundation there to make something intense, fun, and not over complicated. And Naughty Dog succeeded with the intensity, did a good enough job at making it fun, and completely failed at making this game simple to enjoy. The actual driving around is satisfying when the sensitive physics don't get in the way. The weapon-based combat is competent, although I don't need constant slow-mo shots of myself or others crashing constantly. But the thing that gets in the way of this game is how many different event types there are in the single player campaign. The structure of the game has you earning up to three points for each event you compete in. Get enough points and you will eventually unlock one of four actual Grand Prix events where you partake in three races back to back and earn points in the overall Grand Prix like you would a Mario Kart. So, you don't have to place first in all three races. You just have to do well enough to have the most points by the",
            "start": 2568.4
        },
        {
            "text": "to back and earn points in the overall Grand Prix like you would a Mario Kart. So, you don't have to place first in all three races. You just have to do well enough to have the most points by the end of it. Now, the Grand Prix themselves were where I had the most fun. It's a basic Mario Kart structure that scratches my sicko cart brain that I really miss in Crash Team Racing's single player mode. The problem I have is with these single events that you have to do to even qualify for these Grand Pris. They vary from normal races to battle arenas to capture the flag to charging up precursor orbs to crashing into a bunch of oncoming traffic to blowing up as many cards as you can in a certain amount of time to collecting the most amount of precursor items before anyone else can. Oh my god, there are so many modes. This game has more modes than Crash Bandicoot has camera perspectives. And the rough thing about them is that none of them are very interesting after the first try. And because",
            "start": 2610.56
        },
        {
            "text": "are so many modes. This game has more modes than Crash Bandicoot has camera perspectives. And the rough thing about them is that none of them are very interesting after the first try. And because you're doing these same types of events over and over and over again to unlock the thing the game actually excels at. So much of this game is just going through the motions with the same four buttrock tracks playing on a loop or has you flying by the seat of your pants because some areas are just so poorly designed for certain modes. This game is best when it's simple, but spend so much time trying to not be and in doing so is so much longer and mundane than it needs to be. Now, maybe I was just feeling Jack fatigue with this being the fourth game in the series and three of these games being at least twice as long as any Crash Bandicoot, but when I wasn't in normal races, I just wanted this game to be over. This is another problem with replaying a bunch of games back to back because this",
            "start": 2652.8
        },
        {
            "text": "at least twice as long as any Crash Bandicoot, but when I wasn't in normal races, I just wanted this game to be over. This is another problem with replaying a bunch of games back to back because this happens for every single one of these videos I make where I'm just fatigued and regretting my life choices. Sometimes it'll just be for one game, maybe a couple, but there's always a personal wall for me that's less to do with the quality of the games and more so who in their right mind would play five 2D Zelda games in a row. And Jack X is the unfortunate victim this time around. I think I would have been more open to it if the campaign had me try out these different modes like once each to be more of a tutorial for multiplayer, which would have cut the time to beat on this guy by like 5 hours easily. Now, something there wasn't much to cut was the story, which to be clear is not a complaint. This time around, we see our heroes get poisoned by our dearly departed crime lord crew from",
            "start": 2701.44
        },
        {
            "text": "hours easily. Now, something there wasn't much to cut was the story, which to be clear is not a complaint. This time around, we see our heroes get poisoned by our dearly departed crime lord crew from Jack 2. And the only way to get the cure is to race their hearts out. Okay, sure. In the alternate universe where Jack got a TV show and Tac rightfully never saw the light of day, this would definitely be one of those filler episodes where the production team needs to fill a 25 episode quota and they have enough meat for like 23 episodes. So, here's a two episode arc that doesn't matter whatsoever. It's fine. It's mostly predictable. I do like the twist at the very end where Crew's plan was for his daughter to end up on top. And Jack and Kira actually get to have their kiss even though she was weirdly sidelined in Jack 3. It seems like a goofy small adventure that this crew would realistically have after their big true adventure wrapped up in the previous game. Honestly, even with my ups",
            "start": 2744.88
        },
        {
            "text": "weirdly sidelined in Jack 3. It seems like a goofy small adventure that this crew would realistically have after their big true adventure wrapped up in the previous game. Honestly, even with my ups and downs with the Jack series, I could live in this world forever. Yes, it's the nostalgia. Yes, it's the mid2000s Cartoon Network Nickelodeon vibes. But man, I do still really enjoy this cartoony cyberpunk world with edgy characters and bad jokes. It's tough to say goodbye here. Does it really have to end? I mean, a lot is set up in this game that is interesting. Crew's daughter, Jack and Kira embracing their feelings for each other. Daxter's girlfriend weirdly missing this underground crime organization that would have been cool to introduce earlier if the last two games weren't focused on allout war. So, there's got to be more stories to tell in this world. Right. Well, good news. There is one more game in this franchise. Naughty Dog started development on Jack and Dexter the Lost",
            "start": 2794.08
        },
        {
            "text": "on allout war. So, there's got to be more stories to tell in this world. Right. Well, good news. There is one more game in this franchise. Naughty Dog started development on Jack and Dexter the Lost Frontier and then decided it was too much to make while also working on Uncharted 1. So, they gave Lost Frontier to High Impact Studios. So, I guess we won't be talking about that one then. [Music] My history with Uncharted was pretty much non-existent during the PS3 era, and that's largely due to being a 360 kid. The most exposure I got of Nathan Drake in high school was that Uncharted 3 subway commercial that played constantly. I didn't play Uncharted until I was both a fan of Kind of Funny and had already played The Last of Us. And I wasn't quite sold on it until I tried out a demo of the Nathan Drake collection. That demo had you jumping from rooftop to rooftop, running from a helicopter in Uncharted 2. And when I finished it, I went right to GameStop to pick up a copy of this beloved",
            "start": 2839.84
        },
        {
            "text": "Drake collection. That demo had you jumping from rooftop to rooftop, running from a helicopter in Uncharted 2. And when I finished it, I went right to GameStop to pick up a copy of this beloved trilogy. And it was around here where I'd finally come to the realization that this was the same crew that made Jack and Crash, which blew my mind and still kind of does to this day. But going through their catalog now, it's not as surprising. What is still surprising to this day is the jump from Jack X to Uncharted 1. Obviously, the jump from PS2 to PS3 was a major one and gave studios much more power to work with thanks to the cell processor. And while yes, Uncharted 1 today technically is dated on a visual level, processing what Naughty Dog was able to accomplish in 2 years still hits. And that's not the only jump Naughty Dog made with Uncharted. The level of storytelling and characterization is also staggering. While the Jack games are fun, they aren't the most indepth stories. They're",
            "start": 2898.56
        },
        {
            "text": "not the only jump Naughty Dog made with Uncharted. The level of storytelling and characterization is also staggering. While the Jack games are fun, they aren't the most indepth stories. They're stories for edgy middle schoolers whose parents didn't let them have GTA. Whereas Uncharted feels like a genuine summer blockbuster movie. It's like going from making Back at the Barnyard and then following that up with Mission Impossible 3. Okay, maybe not that extreme, but you get the idea. And this is where I bring back Amy Henig. Now, while she was heavily involved in the Jack series when she joined Naughty Dog, Uncharted was Amy Henik's first true playground that she created herself, no longer having to play within the rules of universes made by other people. Hen was able to build something from the ground up, which set Naughty Dog on a path that reflected where she came from. Amy Hen originally studied film and English literature, and it wasn't until she interned as an artist for an Atari",
            "start": 2946.24
        },
        {
            "text": "the ground up, which set Naughty Dog on a path that reflected where she came from. Amy Hen originally studied film and English literature, and it wasn't until she interned as an artist for an Atari 7800 game that she considered moving her career to video games. Henig says that she found the video game medium more interesting than film, which especially considering the time is fully understandable. The canvas that video games offered as a storytelling medium had barely been explored in the late8s, whereas film felt like all of the big innovations were already drying in cement. And while yes, she got to finally use her background in the Legacy of Kain series and a bit in Jack 3, it was here in Uncharted where we fully got to see her show off her chops. Now, I know I ham it up a lot on shows saying this series doesn't get great until Uncharted 4, but that's just me just trying to get under y'all's skins. I do really love the series, and while I don't have the same nostalgia for the",
            "start": 2992.48
        },
        {
            "text": "shows saying this series doesn't get great until Uncharted 4, but that's just me just trying to get under y'all's skins. I do really love the series, and while I don't have the same nostalgia for the original games like so many others do, I still can't help but smile returning to Nathan Drake's very first adventure. The story follows Nathan Drake, the supposed descendant of Sir Francis Drake, who goes on a journey with journalist Elena Fischer and longtime friend Victor Sullivan to find El goddamn Dorado. They fight a bunch of pirates led by two very generic villains who want El Dorado for nefarious reasons. Discover El Dorado is not a city, but a cursed golden statue that turns people into wind-like monsters and ultimately decide to make sure it never reaches civilization to prevent the world from falling into chaos. The story here is a simple one, but it still stands out today with how charming it is. And while that can be majorly credited to the script writing that makes our heroes",
            "start": 3035.52
        },
        {
            "text": "from falling into chaos. The story here is a simple one, but it still stands out today with how charming it is. And while that can be majorly credited to the script writing that makes our heroes pop off the page, the performances from Nolan North, Richard McGonagal, and Emily Rose really make them feel alive. I can't help but feel Nathan's excitement when he cracks a code from Drake's journal, or Elena's drive to do everything she can to tell the story, and how heartbreaking it is when she has to let go of her camera. The two of them having a subtle romantic thing grow between them throughout. Or Sully's just ridiculous charm. Obviously, it's a silly game to play What If, but I do wonder if this game would have succeeded in the same way if our main cast wasn't so perfectly cast. This game's sense of adventure also stands out because of fun moments like discovering a Nazi yubot at the top of a waterfall, and super tense sequences like exploring an abandoned bunker, being hunted by",
            "start": 3080.24
        },
        {
            "text": "game's sense of adventure also stands out because of fun moments like discovering a Nazi yubot at the top of a waterfall, and super tense sequences like exploring an abandoned bunker, being hunted by these creepy zombie-like creatures that is a genuine creepy standout for the entire series. These sequences do just enough to make the first entry of the series stand out and solidify the fun it wants to have playing around with history and myths. One other thing I want to call out is that the villains are super forgettable. And I only call that out because I think there could have been something really interesting they could have done to flesh out Navaro, the number two who's secretly playing Roman as a puppet. But again, taking more time to focus on Nate, Elena, and Sully isn't a bad thing, especially for a first entry. And the last thing, I think it's fascinating that Nate has a small reckoning with what obsession does to men. And just knowing where these characters go after all of",
            "start": 3126.4
        },
        {
            "text": "especially for a first entry. And the last thing, I think it's fascinating that Nate has a small reckoning with what obsession does to men. And just knowing where these characters go after all of this, it was a nice reminder playing the first game that these themes have always been present, but just bubbling beneath the surface. Now, this will probably be a theme for the next couple of games, but the game play is the weakest part of Drake's Fortune. And I honestly think it's because of how strong the story side of the game is. If you play this game coming off of Jack 3, there's honestly not too much of a difference. It's a serviceable meld of platforming and gunplay with the biggest differences being that shooting is heavily coverbased now instead of chaotically running and gunning. And while the platforming is more grounded and basic this time to reflect the more realistic world Naughty Dog is presenting here, I think it fits with giving you those Mission Impossible like moments",
            "start": 3169.6
        },
        {
            "text": "while the platforming is more grounded and basic this time to reflect the more realistic world Naughty Dog is presenting here, I think it fits with giving you those Mission Impossible like moments where you think, \"How am I going to survive this jump?\" It's scripted, yes, but still effective when it needs to be. Before we move on, a big theme for this modern era of Naughty Dog is the disconnect between their stories and gameplay. The Uncharted series is especially the center of attention when it comes to the idea of ludo narrative dissonance. And to explain what that is, for some reason, I've invited Mr. Greg back to break it all down. Oh, hello everyone. Mr. Greg here with more of my worldly teachings. Today I'm here to tell you about ludon narrative dissidence. Can you say ludon narrative dissidence? [Music] Good job, children. Ludon narrative dissonance is when a game story and cutscenes doesn't quite match up the game story being told in the game play. That means they don't quite",
            "start": 3211.84
        },
        {
            "text": "dissidence? [Music] Good job, children. Ludon narrative dissonance is when a game story and cutscenes doesn't quite match up the game story being told in the game play. That means they don't quite fit together. It's kind of like how I sound happy when I talk to you, but my eyes tell a different story. They don't match. Do they match, Andy? Do they match? Andy. Andy. Do they look like they match? Andy. Andy. Narrative dissidence. Jesus Christ. Okay. Yeah, that's that's enough of Mr. Greg today. Anyways, the disconnect between the charming characters and how many people they kill throughout these games has always been a big topic of discussion. And returning to this game, it hit me that I don't really care. While Uncharted has often been equated as the Indiana Jones of video games, playing this on the other side of the great circle, Uncharted feels more like if Indiana Jones and Fast and Furious had a weird love child. And it somehow works. The charm of going on an archaeological",
            "start": 3262.72
        },
        {
            "text": "this on the other side of the great circle, Uncharted feels more like if Indiana Jones and Fast and Furious had a weird love child. And it somehow works. The charm of going on an archaeological adventure with a history dork mixed with the more bombastic and ridiculous action of the Fast franchise is honestly a perfect match for the video game medium. And with everything we've talked about between Crash Bandicoot and Jack and Dexter, it makes perfect sense how Naughty Dog arrived at this formula that captured the hearts of so many. Overall, it's a great first entry for the franchise and honestly only gets better from here. Greatness from small beginnings, as they say. [Music] [Applause] I know when it comes to the great debate of the best game in the Uncharted trilogy, I definitely push Uncharted 2 to the side. And admittedly, over the last few years, my memories of Uncharted 2 had soured. The last time I played it, it felt overly long. The Lazarovich boss fight sucked, and there's",
            "start": 3326.0
        },
        {
            "text": "Uncharted 2 to the side. And admittedly, over the last few years, my memories of Uncharted 2 had soured. The last time I played it, it felt overly long. The Lazarovich boss fight sucked, and there's practically no Sully in it. So, when people say their favorite in the series is Uncharted 2, I honestly couldn't understand why. I don't know exactly what was different this time around. Maybe any game I play in proximity to Jack 2 doesn't feel nearly as long. Maybe starting this 2 days after Uncharted 1 put things into perspective. Or maybe I just let the things I didn't like last time take over the things I really do like from this game. So, rest assured for those who get mad when I talk [ __ ] about this game, Uncharted 2 is a goddamn blast. I still have criticisms about it, but we can get to those later. First and foremost, even though this game is on the same hardware as the first, the jump in graphics is just big enough to notice a few key things, like facial animations feeling a bit",
            "start": 3375.2
        },
        {
            "text": "those later. First and foremost, even though this game is on the same hardware as the first, the jump in graphics is just big enough to notice a few key things, like facial animations feeling a bit more realistic and natural. I didn't realize until I played this, but thinking back to Uncharted 1, there was still a level of cartoony facial animation that I recognized from the Jack and Dexter games, despite the more realistic art style. The loces as well this time around are much more impressive, big, colorful, diverse. So much about Uncharted 2 makes the first one feel quaint, which is why I think it stands out so much in the trilogy. It honestly reminds me of the leap from Assassin's Creed 1 to 2 and why so many people still rever Assassin's Creed 2 as their favorite to this day. Funny how Nolan North is in both of those franchises. And while gameplay is mostly unchanged, like maybe shooting and climbing feels a bit better, but the key difference with Uncharted 2 is how those things",
            "start": 3421.84
        },
        {
            "text": "Nolan North is in both of those franchises. And while gameplay is mostly unchanged, like maybe shooting and climbing feels a bit better, but the key difference with Uncharted 2 is how those things are presented in huge ways. And this is where we start to see Naughty Dog thrive with what we know them for, their set pieces. Uncharted 1 didn't really have set pieces. There was that moment where you're blowing people up on the jeep and that sequence where you had to run away from pirates instead of fighting, but that was kind of it. So, I can only imagine the awe people had when Uncharted 2 came out and it starts with Nate waking up on a train that's hanging off the side of a [ __ ] mountain or when they had to jump from vehicle to vehicle to take out an entire convoy. or the sequence that convinced me to buy the Nathan Drake collection where you're being hunted down by an attack helicopter. They upped the ante so much this time that it feels much more exciting and breathtaking to play",
            "start": 3466.4
        },
        {
            "text": "convinced me to buy the Nathan Drake collection where you're being hunted down by an attack helicopter. They upped the ante so much this time that it feels much more exciting and breathtaking to play through rather than annoyingly trying to jet ski up a river. I don't want to take away from Uncharted 1, though. I think they needed to start on that smaller scale, obviously to not swing for the fences and fail right out of the gate while learning how to use the PS3 tech and also give more time to establish our main characters. Speaking of which, let's get my main criticisms of this game out of the way because I know when I start, I won't be able to stop. Where is my boy Sully? You do such a good job at establishing the three amigos in the first game just to sideline him like that. Look, I know Sully screen time plays a major factor in why I love three and four more, but come on. It's because he's that guy. And while I love how much the stakes have been heightened in terms of setpiece",
            "start": 3510.32
        },
        {
            "text": "know Sully screen time plays a major factor in why I love three and four more, but come on. It's because he's that guy. And while I love how much the stakes have been heightened in terms of setpiece moments and gunfights, more doesn't always mean better. And for me, that third act still goes on way too long. And not in terms of actual time spent, but with gunfight after gunfight and chase after chase, the high stakes eventually just start to feel like noise. and eventually fall flat. There's no downtime to make the next sequence feel exciting. Pacing of a game is tricky, and I want to break that down real quick by using the roller coaster example grade schoolers are shown when taught about basic story structure. You have your exposition, rising action, climax, falling action, and resolution. And I think something any storyteller in any medium can struggle with is how long we stay in each of these sections. Now, let's say pretty much everything after the train sequence is the falling",
            "start": 3554.64
        },
        {
            "text": "And I think something any storyteller in any medium can struggle with is how long we stay in each of these sections. Now, let's say pretty much everything after the train sequence is the falling action section of the story since nothing quite hits the peak of that again. If you're going down a roller coaster, after those initial few seconds of falling, you get kind of used to it and the excitement isn't there anymore. That's why roller coasters usually don't drop you longer than like 5 seconds. The exhilaration would start to fade. And that's Uncharted 2's third act to me. Once you get back to the village with the homie Tenzin, it's all action until you get to Shambala. I would have traded in an hour of that action for just five more minutes of moments like these. On a scale of 1 to 10, how scared were you that I was going to die? Four. Four. Yeah. Why? A four? Yeah. You were at least an eight. An eight? You were a total eight. An eight? Those guardian things were an eight. Are you",
            "start": 3603.68
        },
        {
            "text": "how scared were you that I was going to die? Four. Four. Yeah. Why? A four? Yeah. You were at least an eight. An eight? You were a total eight. An eight? Those guardian things were an eight. Are you kidding me? Yeah, those were terrifying. What's a 10? Clowns. So, when someone brings up bad pacing in a video game, don't think about the literal hours spent. Think about the roller coaster. A roller coaster can be as long as you want. You just got to make sure you're finding the right balance between each twist, drop, and loop. Anyways, the Lazar fight [ __ ] sucks. I don't have anything poetic to wax here. I just hate cat-and- mouse boss fights. I hate it here. I hate it in Arkham Knight. I hate it in Metal Gear Solid. I don't like feeling powerless and being chased. That's why I usually don't play horror games. And honestly, those are my only big criticisms of the game, which is interesting because my memory was so down on it. But for as many Jack Twos there are in the world of playing",
            "start": 3645.76
        },
        {
            "text": "play horror games. And honestly, those are my only big criticisms of the game, which is interesting because my memory was so down on it. But for as many Jack Twos there are in the world of playing games, there are just as many Uncharted twos that you get to appreciate more on revisiting. And that's why I love reexperiencing art at different times in my life. You never know what you're going to walk away with. Naughty Dog really stepped it up overall with this game with everything I said earlier, but also with level design, which is much more interesting with how much you can play around during gunfights. And lastly, temple exploration and puzzles. Going through the trials with Tensson or solving the puzzles in the Nepal temple gave much more of that Indiana Jones feeling than the first game did. It's still very fast and furious, though. So, the story this time around has Nate hot on the trails of the lost city of Shambala. This time with the help of Khloe Frasier, the video game love",
            "start": 3697.04
        },
        {
            "text": "did. It's still very fast and furious, though. So, the story this time around has Nate hot on the trails of the lost city of Shambala. This time with the help of Khloe Frasier, the video game love of my life. They race against war criminal Lazarovich and his lackey Harry Flynn to follow Marco Polo's footsteps in finding the city. And along the way, Nate reunites with Elena, has a bit of a love triangle going on, gets betrayed by Khloe, blows up a train, gets help from a local village and an exNazi that everyone is weirdly cool with and gets unbroed by Khloe. After discovering Chambala holds the tree of life, which grants immortality, our heroes stop Lazarovich from leaving the crumbling city after he eats some blue tree sap. And after the dust settles, Elena recovers from her injuries, and the feelings she and Nate feel for each other start to spark up once again. Just like the other aspects of this game, the story is a step up from the first. Adding Khloe into the mix and then later",
            "start": 3738.72
        },
        {
            "text": "the feelings she and Nate feel for each other start to spark up once again. Just like the other aspects of this game, the story is a step up from the first. Adding Khloe into the mix and then later bringing back Elena makes for a fun dynamic that makes Nate evaluate his ideals throughout the game. And let's be real, I love Chloe, but I hate who Nate becomes around her. Boy, it's a shame you have to sit on something that pretty. And honestly, major props to Naughty Dog for bringing back Elena. I think if this story was in any other hands, this series could have easily been more just about these ancient cities and less about these important relationships. There would have been a different girl each game and it would have just been a rinse and repeat series of adventures. But by bringing back Elena, we get to kind of see what Nate's story is really about in this game, which has been using treasure hunting as escapism from coming to terms with the fact that he fumbled the love of his",
            "start": 3779.36
        },
        {
            "text": "back Elena, we get to kind of see what Nate's story is really about in this game, which has been using treasure hunting as escapism from coming to terms with the fact that he fumbled the love of his life. And seeing them reconnect, being reminded how badass Elena is and how much they make sense together, you can't help but be along for the ride. Now, if Nate is Peter Parker and Elena is MJ, then Khloe is definitely the black cat. She's working both sides ultimately to help Nate in the end, but throughout she definitely represents the selfish side of Nate's life. She doesn't want to play hero. She's just looking out for herself at the end of the day, but eventually sees the value in helping our heroes out. And I love that they don't make her the turncoat love interest in the second half of the story. She could have easily been so spurned by Nate that she just fully falls in with the villains, but the writers were smart enough to not fall into that trap and instead made her a homie,",
            "start": 3827.12
        },
        {
            "text": "of the story. She could have easily been so spurned by Nate that she just fully falls in with the villains, but the writers were smart enough to not fall into that trap and instead made her a homie, which is honestly just more fun and interesting. We love a complicated hero with an apprehensive heart of gold. Another improvement for this game were the villains. While Azarovich's characterization is a bit 80s action movie tropey, he still makes a big impression with the little screen time he's given. But the star of the show is Flynn. This slimy dude who acts as Nate's foil, who Nate could have easily become if he chose Khloe instead of Elena, is the perfect [ __ ] stain who you love to hate. This series is all about the relationships, and the more we get actual relationships between our heroes and their antagonists, the stronger these stories are, and Flynn was just the first step in all of that. With the amped up stakes and action combined with more characters being added to the",
            "start": 3868.32
        },
        {
            "text": "heroes and their antagonists, the stronger these stories are, and Flynn was just the first step in all of that. With the amped up stakes and action combined with more characters being added to the fold, the game also somehow keeps the charm from the first. So much of what the first game established could have been lost. But that charm and the humor is still there, which in any other context would come off as Weedenesque, but the genuine character writing makes the humor feel honest to them. And again, it's all upheld by the performances and chemistry of the cast. Hey, check it out. Marco, really? Come on. No, Marco. Polo. One last thing that stood out to me was the return of the ludo narrative dissonance, which I only think struggles for one moment here, where Nate hesitates to kill Lazarovich at the end. Lazarovich even calls Nate out on how many people he's killed. But with it being the end of the game, there's not enough time to explore why Nate hesitates in this moment, which",
            "start": 3912.08
        },
        {
            "text": "at the end. Lazarovich even calls Nate out on how many people he's killed. But with it being the end of the game, there's not enough time to explore why Nate hesitates in this moment, which comes off kind of weird for a series that ultimately I think is fun and playful enough to get away with its ludo narrative dissonance. Anyways, to wrap this up, despite some small bumps in the road, Uncharted 2 is a fantastic time. And returning to it, I now see why it would still be some people's favorite in the series. It established so much that we love and did it in such a huge way, and you still feel its influence on so many games today. And even though I appreciate this game more this time around, I do wonder if it holds a candle to my personal favorite in the PS3 trilogy. [Music] I haven't talked much about the turnaround Naughty Dog had for their games during the PS3 generation so far, but it's truly staggering to me that Uncharted 1 came out in 2007, Uncharted 2 came out in 2009, and",
            "start": 3961.52
        },
        {
            "text": "talked much about the turnaround Naughty Dog had for their games during the PS3 generation so far, but it's truly staggering to me that Uncharted 1 came out in 2007, Uncharted 2 came out in 2009, and Uncharted 3 came out in 2011. With how good these games still look today, it's honestly crazy in retrospect that they were able to come out so close together. And that's not even mentioning how The Last of Us comes out just two years after this. From 96 to 2020, Naughty Dog released 15 games. And their biggest gap of not releasing a new title has been from The Last of Us Part Two to now. It really makes you think if the advancements in graphics, the push for devs to make live service games, and making games longer is really worth it at the expense of output. I can't really ponder that right now, though, cuz I got to review Uncharted 3, and I don't Are are we halfway through this video yet? I love Uncharted 3, and it has always been the standout to me from the PS3 trilogy, and I've always",
            "start": 4022.56
        },
        {
            "text": "though, cuz I got to review Uncharted 3, and I don't Are are we halfway through this video yet? I love Uncharted 3, and it has always been the standout to me from the PS3 trilogy, and I've always cited the very basic reasoning of it having more of a Sully focus. But this time, I've had to really think about the Uncharted trilogy as a whole to dig deeper into my thoughts here, and they're more complicated this time around. In terms of gameplay, Uncharted 3 feels like a solid enough iteration to Uncharted 2. And for many people, I can see why it's not as striking as Uncharted 2's giant leap from the first game. There are still big set pieces that feel a bit understated this time around. The gunplay feels mostly the same. Climbing around feels a bit more formulaic with all the scripted ledges falling apart. And the globe trotting, while still fun, doesn't stand out in the same way. Though, I do like that I can finally throw grenades back. That's nice. Now, the thing that took me most of",
            "start": 4069.6
        },
        {
            "text": "falling apart. And the globe trotting, while still fun, doesn't stand out in the same way. Though, I do like that I can finally throw grenades back. That's nice. Now, the thing that took me most of back were the set pieces. Obviously, it's hard to top the train sequence from Uncharted 2. And granted, the sinking ship sequence and falling out of a giant plane are still fun and tense in the moment, but something I couldn't help but notice was the context around these big moments and how they're presented. The train from Uncharted 2 is excellent because at first you're given it without context. So, while the stakes are unknown, they're still incredibly high and part of the fun is catching up in the story to see how Nate got there. But then here in the middle of Uncharted 3, you wake up captive in a pirate shipyard where you slowly fight your way to the main ship sailing off. This entire section halts the game in a not very interesting way. While the level design for some of the gunfights",
            "start": 4116.0
        },
        {
            "text": "in a pirate shipyard where you slowly fight your way to the main ship sailing off. This entire section halts the game in a not very interesting way. While the level design for some of the gunfights continues to up the ante in terms of player creativity, the environment is just not interesting, and you're also fighting a group of enemies you just got introduced to, so there's no emotional investment in that sense. The main thing driving you towards all of this is the main pirate threatening to kill Sully, which is such an obvious lie that it makes me question if Nate is a smart person. You go through this entire sequence kind of for nothing other than to get separated from your friends. And even though climbing around a sinking ship is a cool as hell setpiece, it just all narratively lands flat. And then 30 minutes after all that said and done, you get the plane sequence, which is undercut by having a big setpiece not even an hour before it. You might be wondering why I'm getting so",
            "start": 4158.72
        },
        {
            "text": "flat. And then 30 minutes after all that said and done, you get the plane sequence, which is undercut by having a big setpiece not even an hour before it. You might be wondering why I'm getting so hung up on set pieces at the beginning of this section. And that's because one, that's what Uncharted is all about, baby. And two, I think this particular criticism I have is a microcosm of the game at large. The pacing gets in the way of itself a lot. Again, don't think about hours spent. Think about the roller coaster and narrative structure. I'm flipping off Kevin. Now, this isn't to say I think this game sucks now. I think I just recognized a bit more this time around why people enjoy Uncharted 2 more. And I might have to concede that as a video game that you interact with, Uncharted 2 is the better game. Uncharted 3 just doesn't hit on the same gameplay level. With all that said, though, I think it's still my favorite in the trilogy, and that's because of the story. 2 years after",
            "start": 4201.68
        },
        {
            "text": "is the better game. Uncharted 3 just doesn't hit on the same gameplay level. With all that said, though, I think it's still my favorite in the trilogy, and that's because of the story. 2 years after Uncharted 2, we see our hero, Nathan Drake, back in the treasure hunting game once again with a full crew this time, where they follow a possible theory that Sir Francis Drake found the lost city of Ubar. While fighting against Marlo, Talbot and a secret society that Francis Drake was once a part of, they travel around the world to find out where the lost city is. Get help from Elena, who is now Nate's estranged wife, get drugged and kidnapped by pirates, stranded in the desert, but eventually find Dubar, which has psychedelic water that the villains want to use to control their enemies through fear. Nate and Sully destroy yet another lost city to stop Marlo and her crew. And once again, the game ends with Nate and Elena rekindling their love for each other. to get some criticisms out of",
            "start": 4245.04
        },
        {
            "text": "fear. Nate and Sully destroy yet another lost city to stop Marlo and her crew. And once again, the game ends with Nate and Elena rekindling their love for each other. to get some criticisms out of the way. Yes, the pirate stuff is definitely pointless and feels added for the sake of adding time to the game, which I think comes at a detriment to the story. Cuz also, why would Marlo contract a random dude to kill Nate? Why not just have Talbot do it? Also, we see Talbot using drugs throughout the game to control Cutter and Nate. Why do they need this relic from this lost city that does something they already have the ability to do? Are they running on a short supply of drug bullets? Does the relic water give a weird better trip? I don't know. Both of those things I will concede kind of weird. But this story to me is really about the relationships, themes, foils, etc. And I think the reason three is still the standout to me compared to the first two games is because it actually takes the",
            "start": 4284.96
        },
        {
            "text": "But this story to me is really about the relationships, themes, foils, etc. And I think the reason three is still the standout to me compared to the first two games is because it actually takes the time to flesh these aspects out on a deeper level. Don't get me wrong, the first two games do a lot to characterize the main cast that we know and love, but anything deeper than charming oneliners are just vaguely gestured at in the first two games. Like the commentary on obsession for treasure in the first game is a singular moment. The tumultuous relationship between Nate and Elena is more suggested at than actually talked about in two. And Lazarovich calling Nate out on hesitating to kill him is a sliver of a fascinating idea that's introduced way too late to really unpack. These are all interesting ideas that the first two games never give enough time to really let them bloom into something special. And I'm not saying the first two are lesser games because of this personal observation.",
            "start": 4328.08
        },
        {
            "text": "ideas that the first two games never give enough time to really let them bloom into something special. And I'm not saying the first two are lesser games because of this personal observation. Games are allowed to just be fun, and those first two games accomplish that 10fold. Uncharted from here on out, though, just became more of my [ __ ] I said jokingly earlier that this is my favorite in the trilogy because of Sully screen time, but that's still kind of true. And it's because we get the backstory of how Nate and Sully met, which turns into this throughine for the game that really fleshes out their father-son dynamic that we don't get to see in the first two games. It's not just a one-sided relationship where Sully exploits Nate for finding riches. He actually saw something in him that reminded Sully of himself. Getting that in this game along with all of the death flags for Sully really amps up the tension for his safety, which makes the smaller, more grounded setpiece moments all",
            "start": 4371.2
        },
        {
            "text": "reminded Sully of himself. Getting that in this game along with all of the death flags for Sully really amps up the tension for his safety, which makes the smaller, more grounded setpiece moments all the more real and scary and strengthens the theme of the series. To what end will Nate go to find these lost treasures? And is he willing to sacrifice the ones he loves for it? He's done this song and dance over and over and over again, but when does it finally backfire? And the fact that it's Elena that calls Nate out on this, someone who he did sacrifice to continue this life of treasure hunting really makes the meat of this game just juicy enough for me to gobble it all up. And while I do still find a disconnect between this trilogy being a lot about Nate and Elena's relationship and it always feeling like an afterthought in the actual script, I love that they finally have a direct dialogue about it all where you finally get a tangible sense of what their friction is. And in the end,",
            "start": 4414.4
        },
        {
            "text": "feeling like an afterthought in the actual script, I love that they finally have a direct dialogue about it all where you finally get a tangible sense of what their friction is. And in the end, Nate does throw away a madeup legacy for the ones important to him. And that is some satisfying character growth. Another aspect Naughty Dog strengthened this time around were the villains. It felt like they really enjoyed Flynn as a foil to Nate and doubled down on having the antagonists reflect our heroes while also being these big scary boogeymen that are tied to Nate's quote unquote namesake. I still wish they were fleshed out a bit more because the little we got made me want to see more of Talba and Marlo's dynamic which I think could have strengthened the overall narrative, but instead we got [ __ ] this dude. Anyways, these villains in particular finally open up the door to explore Nate a bit more. Marlo calling out Nate's history in false name really calls into question why he's into",
            "start": 4461.44
        },
        {
            "text": "[ __ ] this dude. Anyways, these villains in particular finally open up the door to explore Nate a bit more. Marlo calling out Nate's history in false name really calls into question why he's into this life and makes you wonder if he's not a descendant of Sir Francis Drake, what drives him to obsessively chase after these treasures? Why did his mom kill herself? And why did his dad surrender him to the church? Naughty Dog was finally getting somewhere truly interesting. And even though the journey could have finished here, there's so much left on the table to explore Nathan Drake as a character. The last thing I want to shout out is dude of the year, Cutter. His introduction as bad guy Crony, but really he's one of your homies who infiltrated Marlo's men is obviously super fun, but it's just lovely to see Nate work with someone who has the same level of passion and dorkiness around these archaeological finds and the foggy history around them. Like, yes, they would both love to get",
            "start": 4504.24
        },
        {
            "text": "just lovely to see Nate work with someone who has the same level of passion and dorkiness around these archaeological finds and the foggy history around them. Like, yes, they would both love to get some treasure out of it like everybody else, but they're both on a level of history nerd that is truly infectious. I obviously love the rest of the crew who are also into the adventure, but these two are just guys being dudes, and I love that for them, and it's honestly [ __ ] We haven't seen Cutter since this game. Coming back to the Uncharted trilogy has been a goddamn treat. They are the fun popcorn films of video games that might not be the most in-depth stories, but they're still a delight to come back to and see the major amount of influence they have had on the industry. And to also see Naughty Dog inch closer and closer to the level of stories we know them for telling today. And with their success and popularity, you'd think they would have struck while the iron was hot and kept",
            "start": 4549.92
        },
        {
            "text": "Naughty Dog inch closer and closer to the level of stories we know them for telling today. And with their success and popularity, you'd think they would have struck while the iron was hot and kept pumping out this series until we became sick of it. But instead of driving the series into the ground and finding themselves stuck in a formula like they were getting close to with Crash and Jack, Naughty Dog took a left turn from the summer blockbusters to deep dive into the human psyche and explore what people are willing to do. Not only to survive, but to hold on to just an ounce of happiness in a bleak world. The Last of Us is a masterpiece. Okay, cool. Let's get back to Uncharted. I'm kidding. But honestly, what left is there to say about a game that's been analyzed and written about to death? A game that's rightfully heralded as one of the best video games of all time. I guess the best place for me to start is to take you all back to 2014. I had just bought a PS4 and was looking for",
            "start": 4597.52
        },
        {
            "text": "A game that's rightfully heralded as one of the best video games of all time. I guess the best place for me to start is to take you all back to 2014. I had just bought a PS4 and was looking for games to justify my purchase since Batman Arkham Knight had been delayed a full year. And a close friend recommended me this game that he had played the year before. I will never forget that first playthrough. Even without the knowledge at the time that this was the same developer who once worked on Crash Bandicoot, I was floored by the story, the characters, and despite my distaste for survival horror games, the gameplay and mechanics were so engaging that made the game impossible to put down. To bring Uncharted back into this, I think The Last of Us is the biggest culprit when it comes to not being as in love with that trilogy as so many others are. playing this, then hopping into those games for the first time, my expectations were definitely a skew since I didn't know this was the biggest",
            "start": 4658.48
        },
        {
            "text": "as in love with that trilogy as so many others are. playing this, then hopping into those games for the first time, my expectations were definitely a skew since I didn't know this was the biggest leap Naughty Dog had taken at this point in terms of storytelling and design. And replaying it today, now having the full context of how Naughty Dog got here, it just makes me appreciate it more. It's one of those games that I think is just as great as it was when it first came out. Now, as I mentioned before, Naughty Dog had decided to split into two teams during the production of Uncharted 3 so they could work on two projects simultaneously. And since Amy was busy with Uncharted, Neil Duckman and Bruce Stley were tasked with leading the second team. I mentioned Neil before, but if you didn't know, Bruce had been with Naughty Dog since CTR, working as an art designer. He would eventually be one of the lead artists for Uncharted 1, and then before this game, co-directed Uncharted 2 with Amy.",
            "start": 4701.52
        },
        {
            "text": "Bruce had been with Naughty Dog since CTR, working as an art designer. He would eventually be one of the lead artists for Uncharted 1, and then before this game, co-directed Uncharted 2 with Amy. So, you have this dynamic duo between Neil and Bruce, both coming from different creative fields within Naughty Dog, looking to shake things up in a major way. And I love that they were originally going to make another Jack game before deciding to make this one instead. Think about how different not just PlayStation, but video games as a whole would be if that alternate timeline came to fruition. Anyways, I want to start with how good the gameplay is. Naughty Dog games haven't been anything truly to write home about up until this point when it comes to the momentto- moment gameplay. You had the serviceable run and gun gameplay in Jack 2 and 3 and then Uncharted introduced coverbased shooting that's very Gears of War coded. And while the feel of The Last of Us technically isn't a major shift",
            "start": 4743.36
        },
        {
            "text": "serviceable run and gun gameplay in Jack 2 and 3 and then Uncharted introduced coverbased shooting that's very Gears of War coded. And while the feel of The Last of Us technically isn't a major shift from Uncharted. You're still taking cover and navigating arenas to get the edge on your enemies, but the introduction of the survival horror elements makes it constantly on the edge of your seat intense. Unless you're an expert like James Burke and how the game works, each encounter can feel so different depending on how successful you are with sneaking around or how confident you feel with going guns blazing with the limited resources you have. The resources you scrunch around for are the biggest element in making this game feel much more grounded. Rather than picking up ammo from every enemy and constantly having guns fully loaded, ammo along with the items that you use to make molotovs, shivs, etc. are sparse. Every bullet counts and with that comes a much more strategic thinking in",
            "start": 4787.12
        },
        {
            "text": "and constantly having guns fully loaded, ammo along with the items that you use to make molotovs, shivs, etc. are sparse. Every bullet counts and with that comes a much more strategic thinking in how you handle each encounter. That and the level design that gets better and better with each of these games creates such an exhilarating experience when you come out on top just by the skin of your teeth. I never played factions, but I honestly get why people like Blessing were so in love with it for such a long time, cuz I can only imagine how different each session probably felt. Antaloopin left behind the story DLC. Adding the element of different enemy factions clashing in the same arena adds more to the chaos that is super satisfying when you get a group of infected to wipe out a bunch of hunters. The thrilling dynamic gameplay is so good and they were just scratching the surface at the time. And while this game doesn't have the bigger than-l life set pieces that Naughty Dog is known",
            "start": 4830.16
        },
        {
            "text": "hunters. The thrilling dynamic gameplay is so good and they were just scratching the surface at the time. And while this game doesn't have the bigger than-l life set pieces that Naughty Dog is known for when there is big action happening, it feels terrifying because it all feels so real. Each big moment has you holding your breath because this is a story where your main characters could die at any moment as showcased in literally the first 20 minutes of the game. If Nate took that metal pole to the stomach, he would have rubbed some dirt on it and been fine. Speaking of the ludo narrative dissonance is non-existent here because of this world that you are forced to survive in. And the character you primarily play as this time around doesn't bat an eye at the amount of violence that he partakes in. And that's the point. It's not just an element of the game the writers didn't really want to engage with. And for a heavy story like this, you need to factor that in because it's not fun turn",
            "start": 4875.36
        },
        {
            "text": "in. And that's the point. It's not just an element of the game the writers didn't really want to engage with. And for a heavy story like this, you need to factor that in because it's not fun turn your brain off fast and furious summer blockbuster violence anymore. The last thing I want to discuss before we get into the story is pacing. I think The Last of Us is possibly still the best paced game Naughty Dog has made to this day. Just when you think you're in a certain location for a while, the game adds a new story or gameplay element to shake things up and get you to the next big beat. While the first half is slower, it's done in service to build the core relationship in a way that feels truly earned. And then the second half is non-stop throwing new wrinkles at you that make you constantly worry about how things are going to end up. This game is roughly the same length as Jack 2. And while Jack 2 felt like an eternity, The Last of Us goes by in the blink of an eye. Again, it's never",
            "start": 4921.12
        },
        {
            "text": "worry about how things are going to end up. This game is roughly the same length as Jack 2. And while Jack 2 felt like an eternity, The Last of Us goes by in the blink of an eye. Again, it's never about total time spent. It's about what you do with the time to make the roller coaster constantly engaging. With all that said, let's finally get into it. The Last of Us takes place 20 years after a societal ending pandemic caused by Cortiseps where infected people quickly display zombie-like behavior and if left long enough eventually evolve into something much worse. The story follows Joel, a long and broken survivor of this apocalypse, escorting a girl named Ellie, who was recently bitten by an infected but never turned across the country to a resistance group called the Fireflies who are hopeful Ellie's immunity holds the key to a vaccine. Along their journey, they get help from a few allies like Joel's brother Tommy as they fight their way through infected hunters and cannibals as they",
            "start": 4964.08
        },
        {
            "text": "Ellie's immunity holds the key to a vaccine. Along their journey, they get help from a few allies like Joel's brother Tommy as they fight their way through infected hunters and cannibals as they eventually learn that their final destination is Salt Lake City. Right as Joel learns to love again and appreciate what life has to offer through his relationship with Ellie, the Fireflies tell him that in order for a vaccine to be made, Ellie has to die since the infection grows inside the brain. Because of the connection Joel has made with Ellie over the course of a year, he decides to kill the Fireflies to save her at the cost of humanity's future. And when Ellie comes too, he lies to her about what happened. The game ends with the iconic moment of Ellie accepting this lie. Whether she believes it or not though is for another time. Before we get to the core of the story, and what makes it an alltimer, the first thing that really struck me this time around is how much political commentary",
            "start": 5008.96
        },
        {
            "text": "it or not though is for another time. Before we get to the core of the story, and what makes it an alltimer, the first thing that really struck me this time around is how much political commentary there is. Maybe it's because we're on the other side of the HBO adaptation that turned a lot of that initial subtext into straight up text, but it's also because I'm much older than when I originally played it in both years and the experience of becoming more aware of political hierarchies that shape our material conditions. You start this game off in Boston, which is run by Fedra, the militarized remnant of the US government. then go to Pittsburgh, which is occupied by hunters who overthrew their local federal government and then turned on the Fireflies, who to them was just another group looking to govern, which is then followed by two different communes. One in the sewers that fell apart because of terrible luck, and the other that is finding its footing and on the cusp of thriving. It",
            "start": 5052.56
        },
        {
            "text": "to govern, which is then followed by two different communes. One in the sewers that fell apart because of terrible luck, and the other that is finding its footing and on the cusp of thriving. It all comes with the important recognition of what conditions people need to not just survive, but live. Boston is a police state that obviously doesn't have the structure to take care of its own, which causes crime to run rampant for people just to get by. Pittsburgh is in shambles because the oppression of their people was so extreme that when offered a chance to rebuild something stable, the people denied that in fear of being trampled on again. You go through the first half of the game feeling hopeless in terms of whether civilization has a good answer on how to sustain itself, but then you're given that hope when you see Jackson coming together in a real way. It's something I didn't appreciate when I first played it at 19, but now that I'm 30 and I've lived through the expedited",
            "start": 5094.24
        },
        {
            "text": "you're given that hope when you see Jackson coming together in a real way. It's something I didn't appreciate when I first played it at 19, but now that I'm 30 and I've lived through the expedited deterioration of modern society, that [ __ ] hits. The next thing that stood out to me was, god damn, everybody acted their ass off in this game. Obviously, Troy Baker and Ashley Johnson's chemistry steals the show, but Brandon Scott as Henry and Naji Jeter as Sam are phenomenal as well. Also, David, you know, the creepy cannibal [ __ ] you play hide-and-seek with, is played by Nolan North. That's Nathan Drake. Godamn Nolan. You didn't have to go that hard, but you did. With those things aside, let's finally talk about what makes the core of this story so special. My grandparents have always had this cheeky and morbid saying that I remember hearing for the first time when I was like seven years old. Life sucks, then you die. I've always appreciated my family for having this recognition of",
            "start": 5138.16
        },
        {
            "text": "this cheeky and morbid saying that I remember hearing for the first time when I was like seven years old. Life sucks, then you die. I've always appreciated my family for having this recognition of how insanely bleak our reality is, but they also recognize the importance of appreciating the beauty in life. My dad's side of the family is very small and has gotten even smaller in the last few years. And even though it's made up of a bunch of cynical [ __ ] myself included, we also had the ability to make each other laugh, grow, and despite how small we were in the grand scope of the world, feel like we mattered to each other at least. What more could you really ask for? That's what makes The Last of Us so damn good. It recognizes that no matter what terrible conditions we live in, we have to find the things that make us give a [ __ ] Because if you don't have that, all you're doing is surviving. Life sucks, then you die. But what you make of life between those two constants is what makes",
            "start": 5190.96
        },
        {
            "text": "find the things that make us give a [ __ ] Because if you don't have that, all you're doing is surviving. Life sucks, then you die. But what you make of life between those two constants is what makes it important. We do so many different things to do that. Find love, share passions, tell stories, and we hold on to those things as long as we can. Ellie. This girl who has only known this post-apocalyptic world and has lost people important to her literally since the moment she was born has every reason to not see the light of the world. But because this is all she knows, she's able to appreciate life in spite of everything that has happened to her. She falters for a bit after almost being chopped up for dinner, but even then she's still able to appreciate the next beautiful moment that life gives her to dull the pain. The giraffe scene is maybe one of the most cathartic moments in any story because it captures the simplistic beauty of life. Something that makes you forget all of your",
            "start": 5243.04
        },
        {
            "text": "gives her to dull the pain. The giraffe scene is maybe one of the most cathartic moments in any story because it captures the simplistic beauty of life. Something that makes you forget all of your troubles just for a moment and makes you go, \"Hell yeah.\" And those moments are even better when you share them with someone who also feels that with you. Joel's journey in this game has been studied, analyzed, poked, and prodded for over a decade at this point. And that's because it's so tragic and human. The loss of his daughter while society collapsed broke him. And just like his watch, he is forever stuck at the moment she died. It's not until he's forced to journey with Ellie that he slowly starts to remember the small moments that make life a little less shitty. Joel's story is the sad dad game that inspired a generation of sad dad games. But what makes him stand out still to this day is that the end of his character arc isn't some beautiful revelation that washes away everything he",
            "start": 5290.88
        },
        {
            "text": "game that inspired a generation of sad dad games. But what makes him stand out still to this day is that the end of his character arc isn't some beautiful revelation that washes away everything he has gone through. I personally don't find the debate on if Joel was justified or not in his actions very interesting because it's not that deep. While he is completely justified in his feelings of anger and not wanting to let go of the one person who was able to make him appreciate life again, what he did was the most selfish thing imaginable. And I'm not talking about the sake of humanity's future. I'm talking about taking away Ellie's sense of purpose. The lie Joel tells Ellie at the end of the game that everything she went through, the good and the bad, didn't matter is one of the most heartbreaking endings to a video game. Being crustfallen for Ellie and not knowing if she believes it or not. Being happy that Joel has found a reason to live, but recognizing how he's holding on to that",
            "start": 5341.2
        },
        {
            "text": "endings to a video game. Being crustfallen for Ellie and not knowing if she believes it or not. Being happy that Joel has found a reason to live, but recognizing how he's holding on to that reason is utterly horrific. Life sucks. and then you die. But before you die, you have to keep living. And while it's beautiful that Joel recognizes that by the end of the game, it's still important on how you decide to live life and understand what that does to those around you. And unfortunately for some people, the only way they can carry on is through lies. Joel's lie to Ellie has been discussed to every end. But something important that doesn't get brought up nearly as much is Joel's lie to himself. that he can be the same dad he was before all of this. While his arc ends with him ready to live and appreciate life again, that doesn't magically erase the decades of trauma that he's endured, it doesn't erase the terrible things he has done. The dad he's fooling himself he can be didn't live",
            "start": 5388.72
        },
        {
            "text": "and appreciate life again, that doesn't magically erase the decades of trauma that he's endured, it doesn't erase the terrible things he has done. The dad he's fooling himself he can be didn't live through what he's lived through. That man is gone. The watch is still broken. And while the lies let Joel hang on to what he loves with borrowed time, he knows he'll have to eventually answer for what he's done. But who he ultimately has to answer to is not the person he expects. Damn, that would have been a great way to segue in The Last of Us Part Two. But we're going in release order, so time for more Uncharted. [Music] [Music] I just want to take a moment and apologize for not talking about the music of Uncharted at all, particularly the main theme, because god damn, it's an alltimer. I remember the first time playing A Thief's End, and whenever it played, this wave of emotion washed over me. happiness, triumph, excitement with a layer of bittersweetness because you knew it was all",
            "start": 5437.52
        },
        {
            "text": "remember the first time playing A Thief's End, and whenever it played, this wave of emotion washed over me. happiness, triumph, excitement with a layer of bittersweetness because you knew it was all about to come to an end soon. Anyways, I first want to talk about what Uncharted 4 could have been. Now, while Bruce and Neil were leading development on The Last of Us, Amy Henig had started work on this game. And in the initial reveal, we got hints of a pirate adventure and the voiceover of what we can only assume was the original rendition of Nathan Drake's brother teased as the villain this time around. Obviously, we never got to see this specific vision of Uncharted 4 since Amy Henig and game director Justin Richmond left Naughty Dog soon after announcing the game with Australia and Duckman taking their place. I constantly wonder what that final vision was. Did they keep Sam as the villain until they left? Would the story have focused so much on Nate and Elena's marriage? Were there",
            "start": 5499.36
        },
        {
            "text": "taking their place. I constantly wonder what that final vision was. Did they keep Sam as the villain until they left? Would the story have focused so much on Nate and Elena's marriage? Were there pirate ghosts? Just how much got scrapped with only two years of production left to go until release? What we did end up getting for A Thief's End, though, god damn. I'll just be upfront and say that this is still one of my favorite personal games of all time. It's got the bombastic action we know and love from the original games. Just a few ounces of that Last of Us pacing, and writing that helps layer in some great themes, character arcs, and performances, and the solid gunplay mixed with really good level and encounter design that helps make each fight more memorable. And that last point was another wrong expectation I had for the original games after playing The Last of Us first originally. Uncharted's kind of wave-based cover shooting was fine with three adding in the element of being",
            "start": 5542.96
        },
        {
            "text": "another wrong expectation I had for the original games after playing The Last of Us first originally. Uncharted's kind of wave-based cover shooting was fine with three adding in the element of being able to hide in the middle of a fight and then return to stealthing around which added a bit more of a dynamic layer. But after The Last of Us, Naughty Dog was able to do a lot to mix in what that game did with Uncharted's gameplay, which I think really works, especially for an older Nathan Drake who might want to take the more careful approach. Each fight has a sprinkle of player creativity and amped up level design. So whether you go guns blazing, stealth your way through, or a bit of both, you get past it feeling accomplished. Now, I want to talk a bit more about that layer of The Last of Us sprinkled on top of this game. Slowing Uncharted down a little bit and letting scenes, locations, and stories told through collectibles breathe really work for me. It felt like the natural evolution",
            "start": 5586.96
        },
        {
            "text": "sprinkled on top of this game. Slowing Uncharted down a little bit and letting scenes, locations, and stories told through collectibles breathe really work for me. It felt like the natural evolution of the series, and you still get to have a little bit of everything that originally made the series overall so great. The insane set pieces, a cool heist, exploring beautiful loces, and the character relationships that make the core of the series so memorable. Adding more to exploration and story are the main things I wanted more from in the original games. Make me feel like I'm going on an adventure and give me more moments of our main cast unpacking their personal struggles. Remember when I said in Uncharted 2 that I would love more moments like the end conversation of that game? Well, Uncharted 4 does that 10fold and not just with cute conversations. It's time to finally talk about the real [ __ ] Now, before we talk about story, something I don't want understated is how big of a",
            "start": 5629.92
        },
        {
            "text": "Uncharted 4 does that 10fold and not just with cute conversations. It's time to finally talk about the real [ __ ] Now, before we talk about story, something I don't want understated is how big of a graphical jump Uncharted 4 was for Naughty Dog. Going from The Last of Us to Uncharted 4 was staggering. It's crazy how much progress was made in that department in just a few years. It might not seem big today, but it was insane to see how good games started to look on consoles during the PS4 generation. Uncharted, Horizon, Spider-Man, God of War, uh Neck. Maybe I'm too in it now to fully appreciate the improvements made during the PS5 generation. But honestly, everything past this has been marginal to me in terms of graphics, and that's totally fine. Let's be real, your horse testicles or puddle reflections are not going to make me appreciate your game more. We've gone far enough. We also really haven't talked about modern Naughty Dogs environment art design, but they really excel at",
            "start": 5674.32
        },
        {
            "text": "puddle reflections are not going to make me appreciate your game more. We've gone far enough. We also really haven't talked about modern Naughty Dogs environment art design, but they really excel at nature taking over man-made places, which is why their games, whether you're exploring a lost pirate utopia, or surviving in a post-apocalyptic hell hole, are so visually striking despite not having some unique art style. Now, the last thing I'll discuss before we talk about Nathan Drake's final adventure is the simple beauty of the grappling hook. Uncharted has had ropes before that slightly play around with physics, but finally having your own to climb and swing in any direction you want was so [ __ ] fun. I'll admit it doesn't add a whole lot, but jumping off a cliff, then pulling out your rope to swing over and knock a dude out is so goddamn satisfying and I could do it for hundreds of hours and not get tired of it. Now to finally talk about the story. Uncharted 4: A Thief's End sees",
            "start": 5724.0
        },
        {
            "text": "rope to swing over and knock a dude out is so goddamn satisfying and I could do it for hundreds of hours and not get tired of it. Now to finally talk about the story. Uncharted 4: A Thief's End sees our hero Nathan Drake getting pulled back into one last job by his believed to be dead brother Sam. Even though this job could put his marriage with Elena at risk, Nate goes to help Sam find Henry Avery's lost treasure to buy back Sam's freedom with the help of our king Sully. Their competition this time is Rafe Adler and Nadine Ross. And as they race around the world, they discover they're not just on the trail of Avery's treasure, but a lost pirate utopia named Libertalia. After they discover this, Elena finds out what Nate is really up to, which leaves their relationship in a rocky place. Nate still opts to help Sam, but then finds out Sam lied about the debt that he owed, reunites with Elena, reveals to her why he's so obsessed with treasure. They take their first steps to work through",
            "start": 5770.56
        },
        {
            "text": "still opts to help Sam, but then finds out Sam lied about the debt that he owed, reunites with Elena, reveals to her why he's so obsessed with treasure. They take their first steps to work through their marital troubles, and our original trio do their best to leave Libertalia alive with Sam. But when he gets too obsessed with Avery's treasure, Nate saves him after having an intense sword fight with Rafe. Our heroes make it out in one piece, and years later, we see Nate and Elena's daughter, Cassie, learn about the not so legal adventures her parents went on before becoming renowned archaeologists. I [ __ ] adore this story, and what really works for me is how the game is able to have these meaningful conversations around Nate's addiction to exploring, what that does to the people that he loves, and is still wholesome about it at the end of the day. I don't need an evil brother who probably dies at the end. I need Nate and his asdory brother going on an adventure together where Nate is",
            "start": 5814.32
        },
        {
            "text": "and is still wholesome about it at the end of the day. I don't need an evil brother who probably dies at the end. I need Nate and his asdory brother going on an adventure together where Nate is finally able to look at himself through Sam and realize the danger he puts himself and others in. I don't need Nate and Elena separating again. I need them to actually talk through their struggles and think about what needs to happen for this relationship to truly work and be healthy. I don't need A Thief's End to be about the life of a man being cut short because time and time again, he became too obsessed with treasure and eventually paid the price for it. I need A Thief's End to be about Nathan Drake realizing the true treasure in his life are the loved ones around him. And that's corny as [ __ ] but that's what summer blockbusters are all about. And as long as that corniness has some genuine heart to it, who gives a [ __ ] I'll eat that up all day. But also, shout out to the antagonists",
            "start": 5854.4
        },
        {
            "text": "but that's what summer blockbusters are all about. And as long as that corniness has some genuine heart to it, who gives a [ __ ] I'll eat that up all day. But also, shout out to the antagonists this time around who are just vastly more interesting villains because they're written like normal people. War criminals and secret societies are fun, but I'll take a rich man baby jealous of Nathan Drake's natural success over them any day of the week. Rafe and Naen are such a fun duo to see work together and eventually clash. And while Rafe doesn't share exactly why he hates Nate until the very end of the game, when he yells it at you in the heat of a very whatever final boss fight, ooh, just what a [ __ ] payoff. And yes, those sword fighting mechanics will never not feel weird, but they were simple enough to let me pay attention to the juice of the scene, so I don't really mind it. There are a number of ways to get me invested in a story, and Uncharted 4 did two key things. The first one,",
            "start": 5900.88
        },
        {
            "text": "enough to let me pay attention to the juice of the scene, so I don't really mind it. There are a number of ways to get me invested in a story, and Uncharted 4 did two key things. The first one, and this is a guilty pleasure that my wife and I share, but it's something we can't help but love. We adore a couple of [ __ ] brothers. Brothers who fight, goof off, and cause a lot of chaos, but are also very passionate, headstrong, and have each other's back no matter what. And that's what we get here with Sam and Nate. And you mean to tell me the answer of what drives Nathan Drake and his brother to go on these crazy adventures is not because of their makebelieve legacy with Francis Drake, but the very real idea of carrying on their mother's legacy. [ __ ] that's good. And god damn, the chemistry Nolan North and Troy Baker had in this game was palpable. The entire game hinged on this relationship, and they sold every high and low between these two so well. The other thing this game had that",
            "start": 5947.12
        },
        {
            "text": "Nolan North and Troy Baker had in this game was palpable. The entire game hinged on this relationship, and they sold every high and low between these two so well. The other thing this game had that put me in a chokeold was a good old pirate adventure. All of the other archaeological finds in the series are cool, but for me, there's nothing that quite hits like some true and honest pirate treasure. It's why I love stories like Goonies and Treasure Planet. There's that sense of wonder and adventure which this game does so well to the point that it makes you even question if the treasure you're hunting is even real. And for this game specifically, it made for some really fun puzzles that also took the time to teach you about some very real pirates like a guy brush threepwood. Pirates are also an easy subject to use when studying the desire of freedom and greed. And what we learned from these pirates who established libertalia, looking to get away from structures, ironically made an",
            "start": 5992.64
        },
        {
            "text": "also an easy subject to use when studying the desire of freedom and greed. And what we learned from these pirates who established libertalia, looking to get away from structures, ironically made an oligarchy that imploded due to selfishness and paranoia. Using the treasure itself to reflect on what the story is really about. Hell yeah. And that's just another bonus on top of being a good pirate adventure. Now, speaking on what the story has truly been about since the very first game, it's Nate, Elena, and the roller coaster they go on throughout the years due to Nate's inability to say no to the next grand adventure. And finally, we get to unpack it all in this game rather than just nodding towards it. We actually get to sit with the unhealthy nature of Nate feeling like he has to fully suppress who he is and what his passions are to do the right thing by being with Elena, which leads him to exploding with a bunch of terrible decisions that jeopardizes it all. And this game recognizes",
            "start": 6037.52
        },
        {
            "text": "who he is and what his passions are to do the right thing by being with Elena, which leads him to exploding with a bunch of terrible decisions that jeopardizes it all. And this game recognizes one of the most important aspects of a healthy relationship. And it's through Elena that we see what that is. She knows this passion is what makes Nate Nate. and she remembers that it's that passion that made her fall in love with him in the first place. Love isn't about completely reshaping yourself to meet what you think are someone else's standards to the point that you lose yourself, which is what Nate was kind of doing. It's about being you and sharing who you are with someone who actually appreciates that. And when Elena comes up with the solution on what their relationship should look like in a healthy sense, god damn, it makes me want to clap every goddamn time because it's just so them. It makes perfect sense. Every good relationship does. This game also had a lot of Sully, which is",
            "start": 6082.24
        },
        {
            "text": "in a healthy sense, god damn, it makes me want to clap every goddamn time because it's just so them. It makes perfect sense. Every good relationship does. This game also had a lot of Sully, which is always a positive in my book. And the fact that he's still around adventuring with Sam, even in the epilogue, makes me so happy. Speaking of the epilogue, it's again so corny, but so effective. Finding Nate and Elena's treasures throughout the years from the perspective of their daughter is so good that it almost always makes me want to go back and replay the entire series again. Even though I know I don't love the rest of the series as much as I do this game. It's a bit much to say that Uncharted 4 is Naughty Dog's Magnum Opus, especially with The Last of Us right there, but Uncharted 4 does feel more like the culmination of Naughty Dog in many ways. We've been talking about their history for nearly the last 2 hours. And reflecting back on The Last of Us, on the original Uncharted games,",
            "start": 6125.12
        },
        {
            "text": "feel more like the culmination of Naughty Dog in many ways. We've been talking about their history for nearly the last 2 hours. And reflecting back on The Last of Us, on the original Uncharted games, and even on Jack and Crash, I can't help but see every stepping stone that got us here. And it seems like Naughty Dog felt that way, too. Because while a certain Easter egg could easily come off just as some nostalgia bait, it truly felt like the team taking a moment to say greatness from small beginnings. [Music] If Uncharted had ended here, I obviously would have been sad but understanding. But just because one thief has met his end doesn't mean the adventuring has to stop for everyone. One of my favorite memories still is being at PSX 2016, sitting next to my good friend Ari O'Neal, and us losing our godamn minds when Naughty Dog opened the show with the reveal of this game and then closed the show with the reveal of The Last of Us Part Two. That Lost Legacy reveal was insane. It was",
            "start": 6168.24
        },
        {
            "text": "losing our godamn minds when Naughty Dog opened the show with the reveal of this game and then closed the show with the reveal of The Last of Us Part Two. That Lost Legacy reveal was insane. It was so technically beautiful. It was so mysterious and I don't know if any of us expected it to be what it was since A Thief's End had only just come out earlier that year, but to get the reveal that we were getting a Chloe Frasier focused Uncharted game. H be still my beating heart. And seriously, it's insane how quickly this game came out. And that's mainly because of how gorgeous this game looks. Even next to Uncharted 4, you could really tell that Naughty Dog got super comfortable with the PS4 hardware during the development of Uncharted 4 that they turned this game around so quickly and were able to make environments even more detailed and striking. I hadn't played Lost Legacy since it had come out, so I was really taken aback by how stupidly pretty this game is. But that wasn't the only",
            "start": 6239.12
        },
        {
            "text": "able to make environments even more detailed and striking. I hadn't played Lost Legacy since it had come out, so I was really taken aback by how stupidly pretty this game is. But that wasn't the only thing that struck me replaying Lost Legacy. In terms of game design, I appreciated how much Naughty Dog were inspired to experiment with the Uncharted formula in such a short period of time. Granted, this game is only 6 hours, which doesn't feel like much runway to do a lot, but it's jam-packed with so many little improvements that I had completely forgotten about. Like four had a small section in Madagascar where you drove around with Sully and Sam to explore a huge open area with a few optional things to do. Here in Lost Legacy, however, nearly half the game takes place in an open area where the whole focus is exploring around, randomly running into enemies, and solving this huge puzzle, which makes the whole treasure hunt feel much more focused and intimate as you get familiar with",
            "start": 6286.56
        },
        {
            "text": "the whole focus is exploring around, randomly running into enemies, and solving this huge puzzle, which makes the whole treasure hunt feel much more focused and intimate as you get familiar with this one central place. The other added element that was great were these enemy encounters that centered around big vehicles. I know that may be shocking because I usually hate cat-and- mouse boss fights, but if the cat doesn't know the mouse is there, and the mouse can masterfully stealth its way through the terrain and slowly collect RPGs to blow up the cat allin one go, me the mouse is actually going to have a pretty good time. Especially when you give me the mouse, a silenced pistol for the first time in the series, which makes stealth even more tantalizing. And because the silence pistol is a special weapon that has very limited ammo you can find for it, it doesn't feel too overpowered because you have to make every bullet count, which in a series that's way less concerned about how",
            "start": 6332.08
        },
        {
            "text": "is a special weapon that has very limited ammo you can find for it, it doesn't feel too overpowered because you have to make every bullet count, which in a series that's way less concerned about how limited your resources are, it's nice to have an element that feels a bit more like The Last of Us in terms of saving ammo for just the right occasion to add a bit more tension. The last thing that felt like a major improvement were the puzzles. They're not quite groundbreaking thinkers, but they feel more active compared to the rest of the series. These moments are the most the series has truly felt like Indiana Jones, and I honestly would have loved to have more of them. Now, the story of Lost Legacy focuses on Khloe Frasier, who is on the hunt for the Tusk of Ganesha. She hires Naen Ross, who is now solo muscle for hire, and the two have competition in the form of Assav, an insurgent leader who intends to use the tusk to incite a civil war in India. Our dynamic duo learn a lot about",
            "start": 6377.6
        },
        {
            "text": "who is now solo muscle for hire, and the two have competition in the form of Assav, an insurgent leader who intends to use the tusk to incite a civil war in India. Our dynamic duo learn a lot about each other while following a trail that eventually leads them to Halibadu. Eventually, Khloe admits to Naen that she was originally working with Sam Drake on this hunt, who has been imprisoned under Assad the last few weeks. This rightfully upsets Naen because of her clash with Sam in Uncharted 4. The two fight, break up, kill some bad guys, and then make up. After realizing that Khloe's father had actually been to this lost city as well before he was killed, they are captured by Assavv and reunited with Sam, where Kloe is forced to help Assav get the tusk. Our three treasure hunters work together to survive and chase after Assavv, who sells the tusk to Naen's former number two for a bomb to blow up in the capital to spark his war. They work together to kick Shoreline's ass and chase",
            "start": 6418.08
        },
        {
            "text": "together to survive and chase after Assavv, who sells the tusk to Naen's former number two for a bomb to blow up in the capital to spark his war. They work together to kick Shoreline's ass and chase Assab's train to stop the bomb from reaching the city. The train falls to a fiery explosion, and our heroes somehow walk away, tusk in hand, where Naen decides she wants to give the treasure hunting life a true shot, and Khloe wants to give the tusk to the Ministry of Culture to Sam Shagrin. This story is so good. It's short. It's sweet and its focus on this unlikely duo then trio makes for a really compelling dynamic. The tension between Khloe and Naen starts off so thick and when you see them slowly start to trust each other, you really want to root for their friendship. And when they fight, you kind of know that Khloe deserves the heat a little bit and you wonder if there's anything that would get them to reconcile. They then help and ride on an elephant which is honestly one of the",
            "start": 6458.8
        },
        {
            "text": "you kind of know that Khloe deserves the heat a little bit and you wonder if there's anything that would get them to reconcile. They then help and ride on an elephant which is honestly one of the most beautiful moments in the series. Nothing is better at making your personal [ __ ] feel so small than riding on an elephant, I imagine. I've never actually done that. And adding Sam into the mix, which is just the perfect layer of himbo that makes all of the snark and oneliners from Khloe and Naen hit even harder. Now, something that also makes this game particularly unique is the cultural importance of the treasure to Khloe. Her being half Indian and going on this path to not just find the tusk of Ganesha, but also these lost cities and throughout telling Naen and us the stories of Hindu mythology adds this layer of personal investment for her. Despite the fact that she says she's only in it for the paycheck, she's not a tourist to this history like Nate often is and for what the story",
            "start": 6501.76
        },
        {
            "text": "adds this layer of personal investment for her. Despite the fact that she says she's only in it for the paycheck, she's not a tourist to this history like Nate often is and for what the story is really about. It makes that connection more impactful when Khloe talks about her culture and how important that is for her when it also becomes this huge connection to her dad. Now, is this undercut a bit by the fact that Khloe and Naen, the two most significant people of color in the series, are both played by white women? Yes, Claudia Black and Laura Bailey are fantastic actors, don't get me wrong, and their performances are great here, but we really couldn't find any Indian or black voice actors who would have killed it just as much, if not more so. I don't know, it's just weird to think about, especially for these more recent games. Now, overall, this story, similarly to Uncharted 4, is also about the weight that we bear from our parents. We learn that Khloe's dad was an archaeologist who",
            "start": 6545.92
        },
        {
            "text": "especially for these more recent games. Now, overall, this story, similarly to Uncharted 4, is also about the weight that we bear from our parents. We learn that Khloe's dad was an archaeologist who was found killed while on an expedition. And later on in the game, Khloe puts together that it was this treasure he had found right before he died. And while Kloe got into this life more as a thief looking for a paycheck, she realized her dad had hoped she would get into this life for the same reasons he did, the love of archaeology and their culture. That also mixed with Naen's struggle with losing her dad's company. You get these really incredible arcs that make our once apprehensive heroes with Hearts of Gold true heroes who know the right thing that needs to be done. We talk so much about the PlayStation sad dad games, but we don't talk enough about the Uncharted series being about these lost kids trying to carry on their parents' legacy. That really hit me this time around and just",
            "start": 6591.04
        },
        {
            "text": "the PlayStation sad dad games, but we don't talk enough about the Uncharted series being about these lost kids trying to carry on their parents' legacy. That really hit me this time around and just solidified that these last two Uncharted games especially are just kind of [ __ ] up adult Goonies. and I adore that. It's impressive what this game was able to pull off, especially being a 6-hour title that originally was going to be DLC for Uncharted 4 and was directed by Kurt Morganau and Shauna Escape. Their first time directing a game for Naughty Dog. This is our third group of directors for this series that added new flavors, but didn't lose what Amy Hen had brought to the table that made Uncharted so special. And it's so good that it begs the question, why wasn't this team tasked with making more of these games? Look, I get it. The Last of Us Part Two was about to go into full production. So, yeah, take a break to go all hands on deck for that project. But where is my follow-up",
            "start": 6633.28
        },
        {
            "text": "making more of these games? Look, I get it. The Last of Us Part Two was about to go into full production. So, yeah, take a break to go all hands on deck for that project. But where is my follow-up adventure with Khloe and Naen? Where's my Sam Drake adventure where he has to team up with Cutter on a job? Where's my Hot Young Sully prequel where he gets employed by Marlo and you see him and Nate meet from his perspective? Where is Uncharted 5, led by Cassie Drake, who lies to her parents about going on a school trip, but instead goes on the one adventure her parents couldn't finish in a legitimate way and is helped by her uncle Sam, who is slowly just becoming Sully 2.0. Naughty Dog has never been a company to fully beat an IP into the ground for the most part. And I know creatively it can be monotonous to continue something that you've been working on for a decade. Especially when the original creator is no longer at the company. Maybe the passion wasn't there anymore. Maybe they just",
            "start": 6678.24
        },
        {
            "text": "be monotonous to continue something that you've been working on for a decade. Especially when the original creator is no longer at the company. Maybe the passion wasn't there anymore. Maybe they just wanted a break and one day they will go back to the series. Who knows? It's been 8 years since and we haven't heard a peep about Uncharted. Whether it's Naughty Dog or another team, I still have hope we return to it one day. I honestly hope it is Naughty Dog because I would love for them to take breaks from these darker stories they've leaned more towards in recent years. These last two games proved they can still tell wholesome stories in a post Last of Us world. Naughty Dog. I want you to have some fun again. Damn it. I don't know. Hopefully Intergalactic has some of that Uncharted fun in there. We'll see. But with that, we finally arrived at the last game we'll be discussing today. The last game Naughty Dog put out. And it's insane to me that it's been 5 years since it was released.",
            "start": 6725.84
        },
        {
            "text": "there. We'll see. But with that, we finally arrived at the last game we'll be discussing today. The last game Naughty Dog put out. And it's insane to me that it's been 5 years since it was released. [ __ ] live service. Anyways, remember how the end of The Last of Us segment was the perfect segue into The Last of Us Part Two. Me, too. That was nice. [Music] The Last of Us Part Two is a mess. 5 years ago, that was still true for me, but I originally thought of the messiness as a positive. If you couldn't tell, I'm very much a pretentious theater kid who eats up complicated stories, tragic character studies, heartbreaking ironies, and complex allegorories. So, when it originally came out, I adored it. 5 years later, it's somehow even more of a tiring experience, and I really couldn't help but see the major criticisms people have had with it. And to be clear, I'm talking about real criticisms, not ones like, \"Oh, no. Abby looks like she could kick my ass and I'm endlessly insecure about",
            "start": 6766.88
        },
        {
            "text": "see the major criticisms people have had with it. And to be clear, I'm talking about real criticisms, not ones like, \"Oh, no. Abby looks like she could kick my ass and I'm endlessly insecure about it.\" No, none of that [ __ ] today. Before we get into it, The Last of Us Part Two was directed just by Neil Duckman since Bruce Staley had left Naughty Dog a year and some change after Uncharted 4. And while Staley was given a thanks in the credits of this game, there's been this weird sucky effect where his contributions to this studio have slowly been forgotten about over the years in the cultural zeitgeist. A lot of time is spent talking about Henig's era of Naughty Dog and then Drman's era of Naughty Dog, but never Shalley's. and he's co-directed three of the best Naughty Dog games. Anyways, I want to start this off by discussing my three big positives for this game. These aren't the only positive things I have to say about the game. They're just the three things I can give flowers to",
            "start": 6841.76
        },
        {
            "text": "I want to start this off by discussing my three big positives for this game. These aren't the only positive things I have to say about the game. They're just the three things I can give flowers to without any sort of criticism attached to them. First off, the performances in this game are some of the best in the medium, especially considering the difficult text they had to work with. Everyone gave it their all, especially Ashley Johnson as Ellie, who had to dig deep into such a twisted and tragic character arc and came out with some of the best work we've seen in a long time. And Laura Bailey as Abby was truly incredible. And if you're a welladjusted adult who can separate real people from fiction, you can clearly see that. The next is level design. And I've been bringing it up a lot for the last few games, but that's because when this game originally came out, it made me forget how good Naughty Dog had already been with designing playgrounds that encourage player creativity. It's",
            "start": 6888.16
        },
        {
            "text": "the last few games, but that's because when this game originally came out, it made me forget how good Naughty Dog had already been with designing playgrounds that encourage player creativity. It's insane how natural the flow of a level and enemy encounters feel. There are some encounters that can take 30 minutes long because you take out a crew in an area, explore around, and then naturally find another enemy group that's been near you the entire time and you didn't realize it. That all adds to the tension and immersion of a narrativeheavy survival horror game. Or even when you think there's a moment where the stakes are low, they're still incredibly high. And this feels like such a natural evolution of what Naughty Dog had been playing around with in their last few games. The last thing is the fidelity of the game. It's insane how good this game looks even after just having played the modern Uncharted games. I still stand by that the jump from Uncharted 4 to this game is minimal, but",
            "start": 6932.8
        },
        {
            "text": "the fidelity of the game. It's insane how good this game looks even after just having played the modern Uncharted games. I still stand by that the jump from Uncharted 4 to this game is minimal, but I can't deny the level of detail this game has that really pushed the PS4 to the point of launching off like a rocket into outer space. Although realistic animations to pick up every item in the game is a bit much. But those are my major positives that don't have any huge criticism tied to them. Next, I want to discuss the story first before I even bring up gameplay because it's all tied so closely together that it's easier to lay it all down now and then pick up the important pieces later. So, The Last of Us Part Two follows Ellie 4 years after the events of the first game on a revenge quest to find the people who came to Jackson for the sole purpose of torturing and killing Joel. She traverses the war zone of Seattle with her new girlfriend and her new girlfriend's old boyfriend to find",
            "start": 6975.52
        },
        {
            "text": "to find the people who came to Jackson for the sole purpose of torturing and killing Joel. She traverses the war zone of Seattle with her new girlfriend and her new girlfriend's old boyfriend to find Abby and her friends, who are part of a group known as the WLF. to pay them back for what they did to Joel. As she kills so many people and all of Aby's friends, she also thinks back to some of the memories she has of Joel in between both games, which fills in the gap of where their relationship was at, which didn't leave off in the best place. At one point, her new girlfriend reveals that she is pregnant with her old boyfriend. And right when Ellie gets close to her goal of finding Abby specifically, Jesse, the old boyfriend, and Tommy convince Ellie to return to Jackson for Dena's safety. But as they prepare to leave, Abby confronts them, killing Jesse and holding Ellie at gunpoint. We then play from Aby's perspective, where we learn her father was the doctor Joel killed, who was going",
            "start": 7020.96
        },
        {
            "text": "as they prepare to leave, Abby confronts them, killing Jesse and holding Ellie at gunpoint. We then play from Aby's perspective, where we learn her father was the doctor Joel killed, who was going to operate on Ellie in the first game, which led her on her revenge quest on Joel. We then see her struggling with her trauma despite already doing the deed, and see her go on a journey where she befriends two Sarafite kids, a group the WLF is at constant war with, and refinds herself and the values her dad left with her. After going AWOL from her group to help her ex Owen and Yara, the older Sarapite sibling, she chases after Lev, the younger trans sibling, to protect him from his mother and the assault the WLF is waging on the Sarafite island. After Lev and Abby escape, they realize they have lost everyone in their lives, but find a map that leads them to the people who killed Aby's friends in particular. We then finally see the face off between Abby and Ellie. Things get hairy, but when",
            "start": 7059.92
        },
        {
            "text": "lost everyone in their lives, but find a map that leads them to the people who killed Aby's friends in particular. We then finally see the face off between Abby and Ellie. Things get hairy, but when Lev reminds Abby of her humanity to prevent her from killing a pregnant Dena, the two walk away, warning Ellie to never look for them again. We then cut to roughly a year later where Ellie still struggles with letting Abby go. And instead of just being happy with her farm life with Dena and the baby, she leaves her family to pursue Abby one more time. She fights through a comically evil gang to find Abby and Lev, who have been held captive for a few months and are barely hanging on to life. Ellie almost kills Abby, but instead lets her and Lev go, where they hopefully find a new life with regrouping fireflies. Ellie then returns to an empty home where she thinks about the last conversation she had with Joel, where she had just started to rebuild her relationship with him before he was",
            "start": 7102.4
        },
        {
            "text": "regrouping fireflies. Ellie then returns to an empty home where she thinks about the last conversation she had with Joel, where she had just started to rebuild her relationship with him before he was taken away from her forever. Where I want to start breaking this all down is the core premise and goal of the game. Neil Dreman has stated that his goal with this story was to have the audience start off in a place of anger and hatred towards someone but by the end love them or at least understand more of their perspective which is essentially what The Last Airbender did with Zuko but without all of the excessive gore and violence. The game is asking you to walk a mile in another person's shoes and by doing so you'll be able to see the world outside of just yourself because life sucks then you die. not just for you, but for those around you as well. So, what's it worth to take any light away from others when they have to suffer through existence just as much as you do? It's a message I",
            "start": 7145.36
        },
        {
            "text": "you die. not just for you, but for those around you as well. So, what's it worth to take any light away from others when they have to suffer through existence just as much as you do? It's a message I think a lot of people already knew, but I still think it's an important one for the amount of people out there who still need to truly hear it. It's a solid core idea, but part two takes the revenge story to new and ridiculous extremes. Ellie's side of the story is so tense with crazy stakes being thrown left and right. And while I think the game assumes the player is going to be driven as much as Ellie is to find Joel's killer at first, you quickly come to realize that these people you're mowing through aren't just a group of terrible hunters. They're people who are part of a true community who are living their lives and care about each other. And so even before day one in Seattle ends, I'm left to question the ramifications of what Ellie is doing to them. And despite struggling with",
            "start": 7190.8
        },
        {
            "text": "who are living their lives and care about each other. And so even before day one in Seattle ends, I'm left to question the ramifications of what Ellie is doing to them. And despite struggling with murdering and torturing people in cutscenes to reach her goal, Ellie just frustratingly never snaps out of it. Even after killing a pregnant woman and freaking out over that, she only leaves Seattle because her friends pretty much force her to. It's not until the last 10 minutes of this game that she finally wakes up. And for a game this long, having a character who has no major change for most of the story is just exhausting. Like, I get it. The point of Ellie's story is exactly what Jesse says. All right, how about uh my friends can't get out of their own damn way. She is so messed up. It's impossible for her to see the world outside of herself and her anger. I just think it's an incredibly sad choice to make Ellie become the Joel we met at the beginning of the first game, a broken watch.",
            "start": 7236.8
        },
        {
            "text": "for her to see the world outside of herself and her anger. I just think it's an incredibly sad choice to make Ellie become the Joel we met at the beginning of the first game, a broken watch. And it's heartbreaking to see Ellie sing these lyrics. If I ever want to lose you, I surely lose myself. Without realizing, she has already lost herself. And because of that, we'll wind up losing everything. What are you scared of? Uh, being by myself. I'm scared of ending up alone. There's good and interesting stuff in here. I just don't know if I needed 12 hours of this because by hour 7, I got what the game was going for. And I think it just sits in this headsp space for way too long that it ends up feeling flat. And this is why I wanted to wait to talk about gameplay because the disconnect between gameplay and story is huge. The Uncharted games are summer blockbuster, so you can kind of turn your brain off with the violence. In The Last of Us, the terrible things you're doing work because you",
            "start": 7286.96
        },
        {
            "text": "gameplay and story is huge. The Uncharted games are summer blockbuster, so you can kind of turn your brain off with the violence. In The Last of Us, the terrible things you're doing work because you play as a shitty dude barely getting by, and you feel that in the game play here. The stealth action gameplay is the best feeling gameplay Naughty Dog has ever put together by a mile. And I get the idea that the satisfying gameplay is supposed to contrast with the implications of what Ellie is doing and make you think, \"Yeah, you feel good about what you just did.\" Well, really, you shouldn't. You piece of [ __ ] Look, I know going on a murderous rampage on people just trying to survive another day is not good. You're the ones who made the gameplay so satisfying, though. So, I don't know. Forcing me to kill a dog that I didn't want to kill doesn't make me think inward of who I am and what my values are. It makes me question why nonsensical violence is bad is presented as some revolutionary",
            "start": 7356.24
        },
        {
            "text": "me to kill a dog that I didn't want to kill doesn't make me think inward of who I am and what my values are. It makes me question why nonsensical violence is bad is presented as some revolutionary theme. So, Ellie's side of the story is largely this exhausting onenote journey. And while I get the irony of her becoming the part of this person that took away her sense of purpose, in practice, it just doesn't sit right. Now, before we get to Aby's side of the story, let's talk about the story structure. By the end of the first 12 hours, you've done and seen so many horrible things that is enough for one game. But right as we get to the climax, we start all over again as a different character. They tried to Resident Evil 2 the story, but the different perspective is mandated, which could have worked, but just doesn't here. It's the equivalent of getting to the top of the roller coaster, but it breaks down before you can drop, and they have to escort you off of the emergency stairs, and",
            "start": 7400.0
        },
        {
            "text": "worked, but just doesn't here. It's the equivalent of getting to the top of the roller coaster, but it breaks down before you can drop, and they have to escort you off of the emergency stairs, and then you're forced to get back in line and start all over again. I get narratively the goal of the game is to get you to hate Abby and then slowly see her as a person and understand her more. I just think it was presented horribly because I'm already exhausted by the end of Ellie's journey. I don't have the emotional bandwidth to start over again in both a narrative and gameplay sense. It probably would have been a technical nightmare to go back and forth between Ellie and Abby, but I think seeing both of their stories play out at the same time would have been more effective in having your audience understand the incredible growth Abby goes through, juxtaposed with the descent into madness that Ellie is in. The fact that so many people still dislike Abby, even those who like the game, I",
            "start": 7445.12
        },
        {
            "text": "understand the incredible growth Abby goes through, juxtaposed with the descent into madness that Ellie is in. The fact that so many people still dislike Abby, even those who like the game, I think is a failure on how the story was told. That and nothing is more frustrating than resetting your gameplay abilities halfway through a game. Growing both Ellie and Aby's arsenal and abilities at the same time throughout the game, I think would have been more compelling, especially when they finally clash and you could think, \"Oh my god, I've been building them up the entire time and now they have to fight.\" which I think would play so well if the climax was built to just once instead of being kicked off the ride halfway through and having to play another 10 hours before we get back there. With that said though, I still enjoy Aby's personal journey. this person who was traumatized through loss and because of that turned into a heartless killing machine, but then slowly gets out of their own",
            "start": 7489.84
        },
        {
            "text": "that said though, I still enjoy Aby's personal journey. this person who was traumatized through loss and because of that turned into a heartless killing machine, but then slowly gets out of their own way because they meet someone who reminds them that even though life sucks and then you die, there are so many moments and reasons in between those constants that makes it all worth it. Aby's journey is Joel 2.0, know, which is some good irony that she unknowingly went on the same journey as the man who destroyed everything she knew and just happened to get lucky that her found family wasn't this super important person in the grand scheme of humanity's future. Aby's story works much better in practice because there's actual momentum in terms of a character arc. And while I love Lev as a character, and the rapport he builds with Abby is so damn charming and mirrors Ellie's kinship with Joel in the first game, his story of being persecuted for being trans feels written from the outside",
            "start": 7533.52
        },
        {
            "text": "and the rapport he builds with Abby is so damn charming and mirrors Ellie's kinship with Joel in the first game, his story of being persecuted for being trans feels written from the outside looking in, which comes apparent when we get more of Yara's perspective, Lev's older sister, than Lev himself through the whole thing. And that makes it all feel very touristy rather than an honest experience actually being shared. That and the overly tragic end to Lev's story being that his entire family has to die just for him to be who he is is such an exhausting choice to go with. While I think it was big for such a popular team to have a trans character be a part of the main cast, I think it just ends in some harmful commentary and is more in service for Aby's story rather than Lev. Part from that to talk about pacing one final time. After you finish Aby's side of the story, there's still more game because Ellie needs to realize she's lost herself. And to do so, she needs to fight through a",
            "start": 7579.68
        },
        {
            "text": "to talk about pacing one final time. After you finish Aby's side of the story, there's still more game because Ellie needs to realize she's lost herself. And to do so, she needs to fight through a cartoonishly evil group that uses slave labor and infected as a means of torture. I really don't think we needed this section of the game. While there are some very effective moments and it is satisfying to unleash infected upon this group of terrible people, I think we could have done the whole Ellie come to Jesus moment during her initial fight with Abby and still do the whole she ends up alone thing because she came to this realization too late. But because this game is about unnecessary cycles of violence, it understandably wanted to put some truly terrible people in the game to remind us that a lot of the hateful energy we waste on each other over [ __ ] reasons can be better served to people who truly deserve it. But the game already had that and didn't fully realize it. Now, here's",
            "start": 7624.48
        },
        {
            "text": "that a lot of the hateful energy we waste on each other over [ __ ] reasons can be better served to people who truly deserve it. But the game already had that and didn't fully realize it. Now, here's where I finally bring in the huge allegory for this game that serves as a backdrop and mirror to our main character's conflict. and it's so poorly done that I think it undercuts the entire point of the game. Let's talk about the WLF and the Sarapites. So, we learn mainly from Aby's perspective about the major conflict between the WLF and Sarapites. The WLF being this hypermilitarized group and the Sarapites being this religious cult who are both fighting for land and for some reason or another have never seen eye to eye. And if this part of the story wasn't drawing from a horrifying realworld conflict, I could see how it could be an effective mirror to personal cycles of violence. But going back to this story today, I can't unsee the real life horrors it draws from. And I now recognize",
            "start": 7667.84
        },
        {
            "text": "conflict, I could see how it could be an effective mirror to personal cycles of violence. But going back to this story today, I can't unsee the real life horrors it draws from. And I now recognize the handwaving this game makes of the power dynamics of a colonial occupation. The commentary on the cycle of violence, while overly extreme, works well enough on a micro personal individual level. But trying to use this macro example of a war to say that both sides are at fault, you have failed at what you have asked of your audience, to see the world outside of yourself. If a group of people are at risk from being wiped off the face of the planet because an occupying state that has power over them is causing that, do you really expect them to have as much ownership over the fallout because they dare strike back for the sake of survival? Trying to equate that to an unnecessary quest for revenge is a gross representation of an apartheid state. And it's because of this allegory that is",
            "start": 7716.64
        },
        {
            "text": "they dare strike back for the sake of survival? Trying to equate that to an unnecessary quest for revenge is a gross representation of an apartheid state. And it's because of this allegory that is sloppily included into The Last of Us Part Two that makes the solid enough themes and questions brought up in this game ring so hollow. And there are ripple effects from this that weaken so many other parts of this game that makes the entire thing start to fall apart. Like the Sarapites being the prominent religious group in this game. They are depicted as these crazed zealots and their main motivation for fighting against the WLF is in the name of their dead leader and her writings. Yes, religion has often been used to justify wars, but there's the convenient omission that religious extremism often comes from men in power manipulating people's faith to justify colonialism. making the Sarapites that clearly pulls inspiration from non-westernized cultures. This monolith of religious extremism",
            "start": 7764.16
        },
        {
            "text": "comes from men in power manipulating people's faith to justify colonialism. making the Sarapites that clearly pulls inspiration from non-westernized cultures. This monolith of religious extremism also paints this terrible picture of non-white dominated cultures being dangerous and archaic. In their community, bigotry is a systemic issue that is indoctrinated into everyone. But in Jackson, a more western inspired community, it's just a bad apple who will be dealt with by forcing him to be nice. I'm sorry, what? And this all inadvertently makes Yara and Lev come across as the good ones who woke up from their indoctrination, which is off-putting. Listen, I recognize the terrible ways in which organized religion is used to exploit people in multitudes. But I also recognize that religion is also made up of people who are trying to just find a kind way to make sense of and navigate the world with others and build a community through that. And while the game does recognize that a little bit",
            "start": 7812.24
        },
        {
            "text": "made up of people who are trying to just find a kind way to make sense of and navigate the world with others and build a community through that. And while the game does recognize that a little bit in very small doses, making the Sarapites the primary religious group present in the game, this extremist monolith puts this commentary of people's relationship with religion in a really weird light that I'm not even sure was intended. So, a lot has happened since I originally recorded this video back in late February, and now the Switch 2 launched. Giant Bomb was killed by corporate incompetence and then rose from the ashes to become an employeeowned business. Roger bought Mike the wrong shirt, but then eventually redeemed himself. And more significantly, Neil Duckman was in an interview where he talked about people's interpretation of the WLF and Sarapites, which is why I'm splicing myself in here weeks after I thought I was done editing this video. Neil says there was never an intent for",
            "start": 7862.32
        },
        {
            "text": "he talked about people's interpretation of the WLF and Sarapites, which is why I'm splicing myself in here weeks after I thought I was done editing this video. Neil says there was never an intent for the WLF Sarafite conflict to serve as an allegory for the Israeli Palestinian conflict and that there is a misconception from one particular article. Neil took inspiration from Israel Palestine for the core theme of the game, but that inspiration stopped there and they actually took inspiration from other similar conflicts for the rest of the game. He feels this particular interpretation cherrypicked things for that theory to work. But as far as their intent, the theory of Israel Palestine being allegorized in this game is false. I implore you all to carefully read this article from Vice that I gestured at earlier titled the not so hidden Israeli politics of The Last of Us Part Two by Emanuel Mayberg which only came out a month after the game originally released back in 2020. It goes into",
            "start": 7912.96
        },
        {
            "text": "I gestured at earlier titled the not so hidden Israeli politics of The Last of Us Part Two by Emanuel Mayberg which only came out a month after the game originally released back in 2020. It goes into the parallels of the game's war torn Seattle and Israel Palestine and questions what people are actually doing when they both sides any major conflict like this. And while it does cite Duckman's own story of what inspired the core theme of The Last of Us Part Two, I would argue Mabberg does much more to back up his analysis of the game than just cherry-picking. Maybe there was an intent to draw from a plethora of conflicts that went unnamed in this interview, but that doesn't change the implications that are still made in the game, especially to those familiar with horrific events like the plight of Palestinians. And I think it's pretty easy to see how people would come to the conclusion on what the story at large is drawing from outside of just the core theme. So, if this interpretation",
            "start": 7961.28
        },
        {
            "text": "of Palestinians. And I think it's pretty easy to see how people would come to the conclusion on what the story at large is drawing from outside of just the core theme. So, if this interpretation of the game's commentary necessitates clarification a whole 5 years later, that that's not what it meant, instead of insinuating that people are recontextualizing things to fit a narrative, I think it would be more productive to look inward on why that commentary comes off a certain way to people who are just worried about what a prominent studio in the industry is possibly saying about an apartheid state. And hey, I'll be the first to say that I'm a [ __ ] idiot. So maybe there are zero parallels and I've been duped by cherry-picking. So if this part of the story really took inspiration from different but similar real life conflicts, then my personal analysis is overall unchanged because there's still a lack of acknowledgement of the power dynamics of conflicts similar to an apartheid state.",
            "start": 8009.2
        },
        {
            "text": "but similar real life conflicts, then my personal analysis is overall unchanged because there's still a lack of acknowledgement of the power dynamics of conflicts similar to an apartheid state. Whatever the inspiration, that underlying message and its impact remains the same. Remember when we were talking about Crash Bandicoot's Big Titty Girlfriend? Those were fun times. Take me back. Don't get me wrong, I'm not saying that games should only be like Crash Bandicoot and be devoid of any political meaning or deeper message. This whole journey has shown us how powerful stories in video games can be. I think Naughty Dog just took a huge swing and missed big time with this one in really dangerous ways. There are still nuggets in this game I enjoy. All of Ellie's memories of Joel are so good, and the final conversation between them still makes me tear up. Abby and Lev bonding over their fears and how to face them. The Rat King sequence in a vacuum is some great horror. Although the game is",
            "start": 8057.92
        },
        {
            "text": "the final conversation between them still makes me tear up. Abby and Lev bonding over their fears and how to face them. The Rat King sequence in a vacuum is some great horror. Although the game is so emotionally exhausting that by the time you get to it, you're just [ __ ] tired, man. And the emotional payoff of Abby recognizing what Ellie is throwing away by coming to Seattle is just so rich and really shows off how different the two have become. It's all just bogged down by such a pessimistic and narrow view of the world and of the people in it, which is the biggest disservice this game does in being a sequel to The Last of Us. Because even though that game is filled with so much pain and suffering as well, there was a very important ounce of optimism and understanding that is missing here. At the beginning of this journey, I think I was expecting to be more excited for Naughty Dog's next chapter by the time we got to this point, which is the whole reason this video exists in the",
            "start": 8116.4
        },
        {
            "text": "here. At the beginning of this journey, I think I was expecting to be more excited for Naughty Dog's next chapter by the time we got to this point, which is the whole reason this video exists in the first place. And while I can't deny the excitement of Naughty Dog returning to sci-fi with a more mature lens, there's now this huge trepidation I have as well about what another Naughty Dog game commenting on religion is going to look like. Replaying games, something I'm known to do quite often, can be a double-edged sword. And while this journey in particular has made me question whether doing that is really worth it and to instead just let those initial memories stay untouched, it ended up reinforcing why I think it's important to reassess art at different times in our lives. We are constantly learning and growing with the world around us. Not just for the sake of being smarter, but more importantly for the sake of being wiser, which can let us see the art more for what it is, whether",
            "start": 8163.44
        },
        {
            "text": "learning and growing with the world around us. Not just for the sake of being smarter, but more importantly for the sake of being wiser, which can let us see the art more for what it is, whether positive or negative. And sometimes it's not that deep and games like Jack 2 are just not fun to play anymore. And yeah, in those cases, maybe it is better to leave stuff like that in your memories. I know some of you are probably still waiting for some big reveal of how I would rank these games now after replaying them all. And since you've gotten this far, sure, here's a crumb for you. Though, I never wanted that to be the point of this video. Now that I'm on the other side, I'm actually struggling to come up with some grand point to it all. I guess what I'll leave you with is a suggestion. Think about a game that you haven't played in a while that really made you think about its message and think back to what it meant to you at the time. Go replay that game and think about what it means to",
            "start": 8211.44
        },
        {
            "text": "about a game that you haven't played in a while that really made you think about its message and think back to what it meant to you at the time. Go replay that game and think about what it means to you today and if that's changed at all. Think about if you've changed at all. Sometimes we don't realize that until we've reexperienced something. And I think doing that from time to time is important. It forces self-reflection, forces you to grapple with the art itself and also reexamine your values and your relationship to the world around you. And hopefully it makes you actually think about the world outside of just yourself. 5 4 3 2 You crazy mother. [Music] [Applause] [Applause] I could be learning. You could be learning to see what's behind the closs. [Music]",
            "start": 8264.8
        }
    ]
}