{
    "id": 14276,
    "video_id": "QdROlusHVnY",
    "show_name": "Gameplay",
    "hosts": [
        "Nick Scarpino",
        "Andy Cortez",
        "Mike Howard"
    ],
    "title": "Our First Adventure In Dune: Awakening!",
    "description": "Go to http://kindafunny.com/XREAL to grab yours now!\n\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1749679487,
    "duration": 9626,
    "transcript_chunks": [
        {
            "text": "[Music] [Music] [Music] There. [Music] B. [Music] Three, two. What the heck is going on, Kind of funny best friends? Welcome in to today's kind of funny games stream. Outerat. It's my Andy and Nick playing Dune Awakening. Can I tell you, we haven't been in this room with Andy in a while. And I know I don't care for the standing desk. Uh, he went standing right away and I confident on it. And so here's what I'm going to say. Like here's here's what I'm going to say. Let's get out there right now. At least it's been a couple of weeks at least. I'm going to do pushing me away further. Like, you're making me want to be here less. Like, here's the deal. All I can see is the bottom of his chin. Okay. Big time with the chin. I don't get to look up. I'm looking up a I'm staring up top of his eyeball. Listen, here's what I'm going to say. Mike, can't beat him. Join him. I'm going to go, but I'm not going all the way up. Okay. Be careful. Be careful. I'm not squatting then or I'm just going to",
            "start": 15.11
        },
        {
            "text": "Listen, here's what I'm going to say. Mike, can't beat him. Join him. I'm going to go, but I'm not going all the way up. Okay. Be careful. Be careful. I'm not squatting then or I'm just going to be squatting. I'm going to be squatting. Not going to go all the way up. Are you doing this at a protest? Yeah, this is me at a protest but also at a solid. I'm going to get sick again. [Music] You control your own health. I go 100% on leg thickness. Nick, oh my god. The other night Nick, the other night we're playing Elden Ring and it be it starts becoming a one more match, one more run in Elen Ring Night Ring and I'm like, Mike, I'm tired. And he's like, \"It's only 8. It's only 8:45. It's only 9 or whatever.\" I was like, \"Mike, for the last two weeks, you've been doing jack [ __ ] You were in Florida for 4 days, then you were off for another week cuz you got sick. I am tired. You've been at home doing jack shit.\" And he was like, \"You're so right. I haven't been doing anything.\" All I know",
            "start": 121.28
        },
        {
            "text": "for 4 days, then you were off for another week cuz you got sick. I am tired. You've been at home doing jack shit.\" And he was like, \"You're so right. I haven't been doing anything.\" All I know is every 5 seconds when we were doing all those streams, Mike would be in the the chat being like, \"I miss you guys.\" But it wasn't when you know when he says I miss you but it's really saying I hate you. When he says I love you but it really means I'm mad at you. That's the kind of to be there. He's so mad that he can't and he's mad at you even though he went to 19 theme parks and decided to lick the [ __ ] ride. That's exactly what happened. Welcome kind of funny best friends for today, June 11, 2025's afternoon gameplay stream. Today we are sitting down finally with Dune Awakening. It's had a pre-release for the past week. It's now officially out as of yesterday, which means it's time to get our survival crafting on, boys. It's a mix of survival crafting meets MMO, just like what was that",
            "start": 167.92
        },
        {
            "text": "pre-release for the past week. It's now officially out as of yesterday, which means it's time to get our survival crafting on, boys. It's a mix of survival crafting meets MMO, just like what was that weird game with the bus that we played? Once human, once human, it's going to be something similar to that. So, get ready for that kind of fun. But, of course, we are riding alongside Andy's gameplay today. Mike and Nick will be joining up with him. And guys, let me tell you what. I've cranked my character to nines all across the board. Nine height, nine arm thickness, nine length. You have to. I went I just I'm just [ __ ] dumper. Just full dump. Mike's just going to punch one of the sand worms and be I want to be uh Dave Batista in this one is right. Uh have you guys seen anything about this? No. No. I just I always see Shroud playing. Okay. Okay. Yeah, it seems like Shroud is all over this. So, pretty exciting. Of course, chat. Have you guys been playing this? Let me check in with the",
            "start": 216.24
        },
        {
            "text": "No. No. I just I always see Shroud playing. Okay. Okay. Yeah, it seems like Shroud is all over this. So, pretty exciting. Of course, chat. Have you guys been playing this? Let me check in with the chat right now. We have Lonard NL, uh, Wing Commander, we have Bam Bam, all in the chat over on Twitch. We got DJ Tony Stark. We got Sacha. So, Sacho, Sacha, it's got a zero for the O. Let me see. Right here. Uh, boom. Sacho. Sacho. You're going to go with There's an H before. Yeah. So, it's not Sacho. It's shacho. You know, I I can't get over that. You're just standing looking at me. You know what I mean? I can't get out. Can't get over it, Andy. We've missed you. We've missed you. I've been You sound so There's so much just liquid. I got to get it out. I got to get it out. You know, sparkling marble. I'm not quite better yet. Andy made me laugh too hard on the last stop. I mean, I mean, you know, it's you just got to go to CVS and get It's so easy. So, so much Jamba Juice. Some people have",
            "start": 265.12
        },
        {
            "text": "I'm not quite better yet. Andy made me laugh too hard on the last stop. I mean, I mean, you know, it's you just got to go to CVS and get It's so easy. So, so much Jamba Juice. Some people have Jamba Juice. That's what it's it's not that you just have you're storing two of them to your throat right now. Unique technique has become a member for 19 months over on YouTube. Don't forget you can become a kind of funny member over on YouTube. You get all of our shows ad free. Support us on that YouTube side of things. And then of course over on Twitch, you can become a kind of funny best friend with your prime gaming membership totally for free or a sub for tier one through three with adree viewing awesome sub emotes and helping us keep us all employed in this room together. What do you think? You want Andy to go off by himself without Mike and Nick around him? Like what? Never. We're going to be with you forever. No. No thanks. Yeah, it's going to be they have the disconnected beard and",
            "start": 317.68
        },
        {
            "text": "You want Andy to go off by himself without Mike and Nick around him? Like what? Never. We're going to be with you forever. No. No thanks. Yeah, it's going to be they have the disconnected beard and mustard. You see that? He's he's disconnected. This is huge. This is huge. Wow. Could be goat. Uh, no, don't leave. What the hell is vitiglio? Uh, that's like when you have a skin sort of like differences and shading. Oh, yeah. Vitil vitiligo. Thank you. Vitiglio. I don't know what that is. Who was that one Pokemon that you couldn't [ __ ] pronounce? All of them. Ratata. Oh, that Ratata. Oh, Nexai. Oh my god. Oh my god. You know who I look right like right now? Look at my character. Cameron Cuff. Our homie Cameron Cuff. You look like Cameron. Holy [ __ ] There's Cameron Cuff. Wow. I I I just want to stream with you guys all day making characters. Just making characters. Well, characters. Tim really wants to have a stream where Andy makes him as a me in Nintendo. He wants Andy to make all of",
            "start": 359.76
        },
        {
            "text": "to stream with you guys all day making characters. Just making characters. Well, characters. Tim really wants to have a stream where Andy makes him as a me in Nintendo. He wants Andy to make all of us. But really just him. He's like, \"Well, Tim, if you want that, just make it a stream. Stop saying it. Just make it reality. We'll make it happen. You have the power to do so. Skin blemishes. Yeah, I got Are we getting face tats? Are we face tatting up in this game or what? What do you think? I think we should. Yeah. Uh, where do you do that? Oh, yeah. Nice. Well, you can get a neck tat. I'm going full neckt. Uh, but you had the Yeah, the damn. You got a long ass neck. I got a long neck. Damn. I'm I'm nine's on everything. No, I'm like out here. Jeez Louise. I want to get uh Let's see. What can I do? Cuz I wouldn't mind a face tattoo. Yeah, you always got to have a face tattoo in real life. When does Timothy Shalamé in the movie get a face tat? Does he ever get one? No. You know, I don't",
            "start": 413.36
        },
        {
            "text": "I do? Cuz I wouldn't mind a face tattoo. Yeah, you always got to have a face tattoo in real life. When does Timothy Shalamé in the movie get a face tat? Does he ever get one? No. You know, I don't know. Like to establish the dominance. You know what I mean? Cuz man, that [ __ ] Dune 2 is so good. What a good movie. The end of that movie, it's like, \"Oh [ __ ] this shit's gonna remember we went to go see it like at 11:30 at night. That's like at 3:00 a.m. That was crazy. That was It was an insane showing. Are we Kevin Aex? I think we are. Yes. God, that movie [ __ ] rules, bro. All right. Character name. [Music] Um. Character name. Are you asking us or you just briefly? He's thinking about it. Yeah. He's cooking now. He's going to cook. I like I like I like Nick's character. You liking this guy? I think you made him look too old though. I mean, you know, he's like an aged version of an aged version. You can you can notch you can notch it down one or two. One or two on the age. You got",
            "start": 458.32
        },
        {
            "text": "guy? I think you made him look too old though. I mean, you know, he's like an aged version of an aged version. You can you can notch you can notch it down one or two. One or two on the age. You got to be like at five maybe. Right there. That's a five right there. Okay. Yeah. Is that looking like me? Nick had it at seven. He's looking like a 70. I look old to myself right now. That looks sexy. Um, we're just gonna go with uh [Music] from house rifler from house rifler. I I don't know, man. I'm getting so much like static in Yeah, I have so much static in my thing. I I've just I've just accepted that's how it But the weird thing is like it's based on it's based on what screen your game is in. So like if I go to the main menu then I'll hear like and I go to character grade it's like really bizarre really helpful. Um good movie for you. Where's what's this? What's this? Unlock research menu. Dude Awakening features a guided journey that locks the research menu until certain steps are",
            "start": 516.32
        },
        {
            "text": "bizarre really helpful. Um good movie for you. Where's what's this? What's this? Unlock research menu. Dude Awakening features a guided journey that locks the research menu until certain steps are completed. That's probably like a tutorial a slow roll out of moves or jump right in. and we give you everything. Go. Like that's how I take that. Chat, let him know. I think Locked is probably the way. I I bet you locked. We go slow. He says recommended. Yeah, I would go recommended. Um, here's a movie for you to watch, Andy, cuz I'm thinking about it. My guy has eyeliner on semi-pro with Will Frell. Oh, have you seen that movie? No. Andy, it's one day. I've seen it on TNT a couple times, but like I've never fully watched through the whole thing. You got to watch that movie, Andy. Look at the Reverend Mother. She's talking to me. Oh, she's scary. Locked recommended Nick is what we're doing. Make sure you do that. Mike, what's your name? What's your character name? No, Mike. Mike, I could",
            "start": 572.56
        },
        {
            "text": "Reverend Mother. She's talking to me. Oh, she's scary. Locked recommended Nick is what we're doing. Make sure you do that. Mike, what's your name? What's your character name? No, Mike. Mike, I could I'm not as creative as Andy. I can't think of fun names with Nick Tradies, but Oh, that's good. That's good. Love that. I'm going to do it. Oh, you know what? I should have just gone with like Yeah. Andy with a weird last name cuz everybody's first names are like Jack Paul, Duncan, Mike. I'm Scarpino. I mean, my name's Austin. What was I born? Oh, where were we born? Uh, oh [ __ ] Oh, emote the hearkening curse, bro. TR I was I was born on Kaladan. I'm a I'm in a trades. Yeah, trades. Honorable. Do we you guys go locked or unlocked? Uh locked. Said that. Sorry. I was deep in my duffy trying to figure out what my last name was going to be. All right. Kaledan it is. Caladan's the the Atrades planet. Yeah. Yeah. Yeah. Yeah. Where is my place? Bondsman, nobility, Python. Skip. Oh, shoot. Dang,",
            "start": 617.28
        },
        {
            "text": "figure out what my last name was going to be. All right. Kaledan it is. Caladan's the the Atrades planet. Yeah. Yeah. Yeah. Yeah. Where is my place? Bondsman, nobility, Python. Skip. Oh, shoot. Dang, I messed up. Go back. Oops. I'm going to go with bondsman. I'm a citizen class. Always work to be done. I'm I'm a working person. Millions of I'm going to be a sword man. I'm going to be a pa a mentate. You have a mentor in your youth, trained by one of the schools. Who was your mentor? Oh, who was my mentor? Oh, wow. You can be from ex. That's cool. Oh, the Ben Jesuit, bro. Dang, they're deep in this physical mastery and manipulation. Giddy Prime. I'm going to be a Ben Jesuit, bro. So, too. Yeah. Whoever uses like a a gun. Who uses guns? A trooper probably, right? You guys are you guys familiar with the with all these classes? No. You must have been very young. Yeah. You tell us about it, Nick. Well, the ex guys are the ones that are like still using technology supposed to. Oh, the ones",
            "start": 668.88
        },
        {
            "text": "with the with all these classes? No. You must have been very young. Yeah. You tell us about it, Nick. Well, the ex guys are the ones that are like still using technology supposed to. Oh, the ones that were like the remember remember the Dune the Dune mythology was that there was a war thousands of years ago against AI and that's why they have to use the spice to make your brain into like the to be able to navigate and [ __ ] like that. The the ex guys I don't know if that's how you say them or I don't know. They're the ones that are crazy, right? Correct me if I'm wrong, chat. She's using the voice. Putting her hand in the book. She's using the voice. Put your hand in this box. in the box. Put your hand in the box, Mike. Y4, thank you for 31 months of Prime Gaming. Appreciate you. Y4 Gab, the high-handed enemy, your hand in the [ __ ] box away or you will die. Great plots are a foot in the Imperium, and the currents of intrigue run deeply. Aracus, the Gamjabar and the Fman. The Fman",
            "start": 728.64
        },
        {
            "text": "the high-handed enemy, your hand in the [ __ ] box away or you will die. Great plots are a foot in the Imperium, and the currents of intrigue run deeply. Aracus, the Gamjabar and the Fman. The Fman are missing. You will go to Arachus as our agent prisoner. This is a good voice actor. Only one task. Find the Fman. We got to find the Fman. Yeah, that's kind of lit. This is really lit. Depends on this. Do you understand? Casa de Flores, thank you for 53 months of Prime Gaming and Krux 39 months of support. Do I understand? Yes, that's my only option. Getting the face tat from her. Yeah. What's up with that? I didn't ask for it. Yeah. Good. You speak truth, but here is the rest of it. What's the What's the tone and timber for this game in the in the world? Are people excited for this? Is this a one and done for us? is it's going to have some, you know, this is a game that has had like 40 goddamn early access periods and it's every time they talk about I'm like, when is it coming out? Did",
            "start": 773.12
        },
        {
            "text": "a one and done for us? is it's going to have some, you know, this is a game that has had like 40 goddamn early access periods and it's every time they talk about I'm like, when is it coming out? Did we do Was this the same game we did where we did the ornithopter stuff or was that just No, that was Flight Sim that I made you do. Yeah. Yeah, that was sick though. Mike, that [ __ ] was sick, bro. They did a good job with that. That and the Top Gun. They did a great job with the add-on. Lord in 34 months. This one's an exciting like mix of MMO meets survival crafting. So, like it's got a lot going on in this game. We'll see. I'm excited. It's my first time jumping in, so I'm excited. I think the overall thoughts on this game is it's way better than it has any business being. Okay. It's just cool to me that like we're in the era of Dune. Still like Doom. Yeah. Oh, people are going to love Dune for the next Yeah. 10 years here. It's going to be sick. Tap becoming a sixmon prime member.",
            "start": 837.2
        },
        {
            "text": "cool to me that like we're in the era of Dune. Still like Doom. Yeah. Oh, people are going to love Dune for the next Yeah. 10 years here. It's going to be sick. Tap becoming a sixmon prime member. Thank you, TAP. We got Zelman at nine months of supports. is sending you my obligatory prime for the month. Thank you. Sing the song. Well, never know about the prime. I did mean like that. Let me cook, guys. I was there. Let him cook. Let him cook it. I had a direction I was going in. Did you know that if you had Amazon Prime, you have Twitch Prime? That was really That was really good, guys. That was like some of your best on that one. Thank you. Thank you. That might be a top fiverr. Oh, imagine if we just see the the the freaking Harkin is floating up. Remember that shot? Oh, what a what a shot. Doom part one and two are [ __ ] Are they doing the third one? They doing it? Yeah, they got to be, right? So good. That [ __ ] gets wild, man. And then and then that's the last one that I think",
            "start": 876.88
        },
        {
            "text": "Doom part one and two are [ __ ] Are they doing the third one? They doing it? Yeah, they got to be, right? So good. That [ __ ] gets wild, man. And then and then that's the last one that I think Dennyville knew was working on. Yeah, he probably is done. He's so done with the sitting out in the desert cooking. You rewatch both of those before you go to the third movie? Hell yeah. Like when the third one gets announced and we're going to go, you rewatching one and two. Oh yeah. Admiral Rad or Admiral Redbeard. Give him five subs to We're gooning and duning. Thanks CT twigs. Andy, what does gooning mean? What does that I'm not even kidding you. When I opened up Slack and I saw the thumbnail. Yeah. Th this is like this is legitimately an honest reaction for me. This is what I verbally said. I said, \"Oh no.\" Yeah. Oh no. He's dead. Yep. As well you should. As well you should. You're wrong. It's just an off. I'm into this game so far. Tara, how many twigs do I have to collect? Mike's going",
            "start": 932.88
        },
        {
            "text": "said, \"Oh no.\" Yeah. Oh no. He's dead. Yep. As well you should. As well you should. You're wrong. It's just an off. I'm into this game so far. Tara, how many twigs do I have to collect? Mike's going to send us on. So many rock mining missions. I just can't wait until Mike's stuck in a [ __ ] mine across the map with a troll with a she big worm. We're going to build the house. He's going to drop it. He's going to uninstall. Remember when Mike built me a bed and I kept coming back and I was like, I can't get out of the bed. Get out of the bed. And now I'm suffocating with this beehive in front of my [ __ ] house. That guy's got sexy arms. [ __ ] I look good. Are there twigs in Arachus? It's a No, it is a complete mostly desert. It depends on what the remnants of tree were here. It depends on what what what era of Arachus we're talking about, but I think we're in the Dune one and two, so it's all desert. Well, this is also this is this is alternate history. Oh, this this is a world where",
            "start": 984.08
        },
        {
            "text": "what what what era of Arachus we're talking about, but I think we're in the Dune one and two, so it's all desert. Well, this is also this is this is alternate history. Oh, this this is a world where the atrades never existed. Like there was never a polit. Oh, so thearkans are still the Hearkinins are still in charge of Arachus, I guess. So yeah, there they yeah, they they explicitly said we want this to be a story that like where we aren't bound to the lore of the at trades kind of really the the Paul mythology. Yeah, basically man Oscar Isaac looked so good in this movie. Oscar Isaac when he was on the screen you're like oh [ __ ] like you were made for this type of [ __ ] Agreed. Space sci-fi [ __ ] big grand adventure. You were made for this homie. Andy, would you be a mentate? Do you think you'd be a mentate in this universe? A mentate? I don't know. Like a human computer. Like if you were like a certain human computer, you do all the calculations and go, \"Yes, it's $74 for",
            "start": 1040.32
        },
        {
            "text": "you think you'd be a mentate in this universe? A mentate? I don't know. Like a human computer. Like if you were like a certain human computer, you do all the calculations and go, \"Yes, it's $74 for pizza.\" I have a horrible memory. B for crafting menu. Remember, we got to learn the game here. Yeah. Yeah. Yeah. Scrap metal. Oh [ __ ] I got to pay attention. [ __ ] Change my mouse sensitivity. Hey, chat. Start the countdown. I give me five minutes till Andy's yelling at me. Everybody take your time. We're all good. We're going to learn there. There will be like What's the over under of And how do I do that? It says on your screen right there in the top right. Over under. It already happened. I don't like that he has to pop through this little thing. Look at this. I'm drinking from the [ __ ] vines of these plants. Oh, drink from the vines, dude. hydrate. Yeah, you got suck. You got HD says Kevin has a mentate. [ __ ] Sorry. Sorry. Wait, I'm supposed to do that? Okay, I'm full up. I got",
            "start": 1091.44
        },
        {
            "text": "vines of these plants. Oh, drink from the vines, dude. hydrate. Yeah, you got suck. You got HD says Kevin has a mentate. [ __ ] Sorry. Sorry. Wait, I'm supposed to do that? Okay, I'm full up. I got my little man. I don't like the knife swipe from the hip. I'm not a hip knife. Well, and Mike, it's a it's a knife culture. You have to understand that. I'm I'm from a up down type of Oh, you want to do that the the traditional See, when he cuts to the thing, Andy, he's coming from the hip. I'm more of a If I walked up to that, I'd go knife up above the head. You're puncturing. You're puncturing. I'm pulled down. Yeah. Yeah. Okay. He's pulled down, Andy. Oh, we're harvesting plants, guys. And it's the same sound effect as every other game. Do limit reach. I'm going to climb this [ __ ] Yep. Can I climb you? Oh, well, right there. I just punctured it. Different animation from the run. Oh, you got a different animation. Okay. Oh [ __ ] There are plants on Arachus. Well, like little desert",
            "start": 1143.84
        },
        {
            "text": "Can I climb you? Oh, well, right there. I just punctured it. Different animation from the run. Oh, you got a different animation. Okay. Oh [ __ ] There are plants on Arachus. Well, like little desert plants. Yeah. Yeah. A little desert alterate timeline in these uh in the caves. Mike, you remember of course the reason why they have to use knives is because if you use lasers and shields, personal body shields with lasers, it creates like a nuclear explosion. Oh [ __ ] So that's why knives. I don't remember that. Really? Oh [ __ ] I don't remember that. Yeah. The whole the whole concept was like any LAS guns I think is what they called them. Um if you have a personal shield and it hits it, it creates a massive explosion. So everyone's just kind of agreed like we're not going to kill every single thing in this city just to fight a war. So that's why knives are such a big deal. Oh wow. Yeah. [ __ ] I didn't know that. That's cool as [ __ ] Check out the climbing in this kind of feels",
            "start": 1195.68
        },
        {
            "text": "single thing in this city just to fight a war. So that's why knives are such a big deal. Oh wow. Yeah. [ __ ] I didn't know that. That's cool as [ __ ] Check out the climbing in this kind of feels good. Zelda Breath of the Wild, but no stammy bar. Or maybe the stamina bar over on the far bottom left is going down and I'm just not noticing it. Oh, it is. It is going down. It's my favorite parts of video games. Wow. I love it. I I just love the starts of a survival game. Yeah, dude. I'm collect plant fiber. It's me. It's always a m a time when I go I I'll this this game will get me to reconnect with Chrisa. This will let me back. This is the moment and then it's only a matter of one month later where Chris is not talking. He has to has to take a timeout from me. Chris is back on his seventh playthrough of Cyberpunk to get away from us. Just hates you guys. Ew. I'm out, dude. I'm out. Oh [ __ ] bro. This is true. There's no for force to burn down in this game. Yeah, that's fair. Chris",
            "start": 1239.12
        },
        {
            "text": "playthrough of Cyberpunk to get away from us. Just hates you guys. Ew. I'm out, dude. I'm out. Oh [ __ ] bro. This is true. There's no for force to burn down in this game. Yeah, that's fair. Chris Craig saying he's like, \"Who the [ __ ] killed my Samworm?\" I'm like, \"Oh no.\" Oh man, he's going to be so mad at me. Why are our monitors so dirty in here, Mike? Look at how dirty my monitor is. It's so dirty. Why is it so dirty? Well, you got to keep in mind that's the one Mike looked at during the Death Stranding. Will you please uh Nick, can you do me after this stream? Will you buy me the screen washer? We don't have any of that in the office. That's why I'm going to get you a D louser for this entire room. It's disgusting. I love you, dude. The screen looks like that because that's Mike laughing and coughing. It is. There's a lot of Okay, that's not us. Let's not put that on a lot of that. Anybody could have sat there. I think Greg sat there. That is definitely you. I think sat there.",
            "start": 1282.0
        },
        {
            "text": "and coughing. It is. There's a lot of Okay, that's not us. Let's not put that on a lot of that. Anybody could have sat there. I think Greg sat there. That is definitely you. I think sat there. Oh my god, Chad. I'm gonna just try to get Dude, from this angle, it looks so bad. Let's not talk about it. Let's not talk about it, Chad. Let's make sure that tweet fails. All right. Nobody liked that tweet. You can't. It doesn't come through of that. Like it's I can smell this screen. Not the lizard. That's how my kids tablet looks after they get me. That's right. Yeah. Yeah. Speak of our escape. Tell me what to do, fool. Santor comets in the sky. Oh, he's got the blue eyes. Earth from fire and death. and the sard the dead in the cave around us. Your survival. Oh [ __ ] We're like Ray from Star Wars. We're going to start scavenging through giant ships that have fallen down. Time in idle chatter. I am Zantara. My companion is Noctua. Now shall we discuss Sunstroke? Oh [ __ ] Spending time in",
            "start": 1330.4
        },
        {
            "text": "Wars. We're going to start scavenging through giant ships that have fallen down. Time in idle chatter. I am Zantara. My companion is Noctua. Now shall we discuss Sunstroke? Oh [ __ ] Spending time in the sun will fill up the sunstroke bar. Once filled, it will be you'll be affected by sunstroke or which will increase dehydration levels. Oh [ __ ] dude. Don't get stuck in an order. That's where you come in. If you can slip back onto the Proteus and locate the command module, you can activate the captain's personal emergency transmitter. He's a noble. They're not allowed to let him die. Leave the rest to me. Here, take this community transceiver. It's essential for planetary communication. Now go and be quick. The mother storm is upon us. The mother storm is upon us. Stick to the shadows, off welder. The heat of the sun is deadly to the unprepared. How bad would your sunburn be here, Mike? Oh my god. In this world be unbelievable. I would look like Patrick. Patrick was a redheaded man",
            "start": 1380.56
        },
        {
            "text": "off welder. The heat of the sun is deadly to the unprepared. How bad would your sunburn be here, Mike? Oh my god. In this world be unbelievable. I would look like Patrick. Patrick was a redheaded man just like me. But after 12 weeks of Orlando with his girlfriend, he was so tan, Andy, that it made me believe I could become tan. Who's Patrick? Patrick was the guy who sat in first class next to me who coughed on me. First class. Like, why would you pay money for My back hurts. Oh [ __ ] So, you got to stick to the shadows when you get sunstroked. That's cool. Such a crazy expense. Oh [ __ ] We need the cutter. So, this is basically Icarus, right? This is going to be kind of like Icarus. Yeah, there's a lot of like combat and missions and things of that nature. Got it. This so far is pretty lit. Yeah. Wait until you start cutting rocks here in a second, bro. Did I actually equip it? Oh, there it is. Three. The cutter is primarily a mining tool off welder. You'll need it for harvesting",
            "start": 1437.28
        },
        {
            "text": "lit. Yeah. Wait until you start cutting rocks here in a second, bro. Did I actually equip it? Oh, there it is. Three. The cutter is primarily a mining tool off welder. You'll need it for harvesting resources. Using it to cut open ships is an added benefit. I'm so cool, you guys. I'm cutting this ship. Who the [ __ ] made this video game? What? Do we know the dev team on this? Oh [ __ ] I'm fighting a man now. Oh, I got to I forgot. I got to analyze it. Oh, there's the cut. That's cool. Oh, you just got blade. Oh, you cut the blue part. Yeah, that's sick. I mean, that's kind of awesome. They got a parry, Andy. Oh, yeah. Mike, you always got to be parrying, bro. Guys, I'm in the [ __ ] Perry is going to be difficult here on a mouse on a mouse press. I'm not good at that. Oh [ __ ] she's putting me in the wombo combo. I can't get out of it. The wombo combo. There we go. [ __ ] you. Oh, I can't parry at it all. Oh my god. Oh, I did it. I did it once. Massive for me. Just as it twice.",
            "start": 1496.32
        },
        {
            "text": "putting me in the wombo combo. I can't get out of it. The wombo combo. There we go. [ __ ] you. Oh, I can't parry at it all. Oh my god. Oh, I did it. I did it once. Massive for me. Just as it twice. [ __ ] you. [ __ ] I got a ready weapon. Window of opportunity. Oh my gosh. [ __ ] me up. Okay, one more. One more. Come on. Oh, I'm [ __ ] late. I'm late on the parry. The parry is crazy. You got to parry three times, bro. Oh, I got to parry. I didn't parry. I got her. Just killed her. If you miss one, you're [ __ ] Yeah. Oh, yeah. If you miss one, you can't get out of the combo. You're in the combo. It's crazy. Make sure to heal if you got absolutely demolished like I just did. Sick. Oh, she survived that [ __ ] Oh, get parried, idiot. The parry is very generous in this game. Really? Good for you, Nick. I had a really tough time with the parry there. Stagger. Ew. On left alt. Yeah, that's an insane one. What the [ __ ] is that? Oh [ __ ] Left alt. I'm never clicking that. You got to put",
            "start": 1561.52
        },
        {
            "text": "you, Nick. I had a really tough time with the parry there. Stagger. Ew. On left alt. Yeah, that's an insane one. What the [ __ ] is that? Oh [ __ ] Left alt. I'm never clicking that. You got to put that on the mouse button. I've never clicked alt before. I always put I always put a dash on my on one of my mouse thumb buttons. Water discipline. Oh [ __ ] Water discipline. Oh [ __ ] God bless you, Mike. Be [ __ ] ready to not get dehydrated, they're saying to me. I mean, you're sweating a lot of water here. Oh. Oh, okay. I see what you're saying here. Yeah, that's got to be on something else. Oh, the slow blade, bro. Just like in the movie. What' you put it on, Andy? What? The alt the alt. I put it on my thumb m one of my thumb mouse buttons. Dude, come on. Let me let me stab you. What the [ __ ] is going on right now? Get back. Am I just bugged out right now? No, I think you No, you got to you got to you got to hold through that. You got to you got to do the stagger move through it",
            "start": 1622.88
        },
        {
            "text": "[ __ ] is going on right now? Get back. Am I just bugged out right now? No, I think you No, you got to you got to you got to hold through that. You got to you got to do the stagger move through it forward. You got to stam out your your stamina's gone. I That was That was weird. Yeah, that was a very weird moment of like they should have explained as just like a dodge roll instead of a shield, guys. Yeah, you got a slow stab. Oh, the slow stab. Oh, man. I'm having a tough time with this right now. That was sick. There we go. A swift attack can force your enemy off balance, but only a slow penetrates a shield. You've been stabbed to death. [ __ ] you, L. Oh my god, dude. It's like a little boner. Oh my gosh, you buried me. That was crazy. See, I mean, so far the this game is like 10 out of 10 for me. Wow. 10 out of 10. He said, \"Love it.\" Mike, this is on the level of that game you made me play yesterday. The Mind's Eye. Oh, Mind's Eye, bro. Did you see him play Mind's Eye? Andy, we",
            "start": 1693.04
        },
        {
            "text": "of 10 for me. Wow. 10 out of 10. He said, \"Love it.\" Mike, this is on the level of that game you made me play yesterday. The Mind's Eye. Oh, Mind's Eye, bro. Did you see him play Mind's Eye? Andy, we have a new show. We refunded it 2 minutes before it would have gone over 2 hours. Nice. And like I was going to let Nick keep going and Nick just somehow knew. He's like, \"Mike, this is our stopping point.\" And I was like, \"What do you mean?\" And he's like, \"This is where I say to you, let's refund this.\" And saved me $60. I like that. Out of my bank account. He saved me. We're starting a new show. Andy's called TTR. Time to refund. Okay. The refund. I mean, that's a very adult move of you. Yes. The chat got behind it pretty strongly. We'll find another. You You recommend us the next game, Andy. A time to refund game. Think about it. You recommend us the next one. Ornithopters are weird. They're so sick looking, bro. They're weird. They're so I think they're thinking you'd be inside maybe",
            "start": 1747.2
        },
        {
            "text": "A time to refund game. Think about it. You recommend us the next one. Ornithopters are weird. They're so sick looking, bro. They're weird. They're so I think they're thinking you'd be inside maybe want to throw up cuz with the dragonfly wings like you might be like jumping up and you don't think so. You think it's like gyroscopic? Yeah. I mean, look at the head of a hummingbird. They're still stable. You're right. I never thought about the hummingbird conundrum. Focus channel 85 months of support and surplus cloud 45 months. Thank you Guard Ian for 13 months. Oh, like Guardian. I see. I got eyeliner on my guy so he looks super cool. You only need the leader. This guy Sardukar. Oh, bam. This is cool cinematics. These guys are going hard on each other. Short hag. Thanks for gifting out a subscription. I hear I'm a wanted man. Oland scum. There's a guy has a cool helmet. I know. Very cool helmet. That could be Troy Baker. Like out of nowhere, it could just be like a [ __ ] that's Troy",
            "start": 1794.72
        },
        {
            "text": "subscription. I hear I'm a wanted man. Oland scum. There's a guy has a cool helmet. I know. Very cool helmet. That could be Troy Baker. Like out of nowhere, it could just be like a [ __ ] that's Troy Baker. Really? Yeah. That's just the vibe I get. Like he could be in any video game. He kind of has like a very, you know, like in Death Strand weird man. Oh, got clipped in the cap. Oh, [ __ ] Oh [ __ ] [ __ ] yeah, dude. Oh [ __ ] Nick, we taking flight. Yeah, dude. I'm ornithopic. He said my leg is bad. I can't work the pedals. Yeah, Andy's not there yet, but yes, will have the coast. Oh, we're about to get into it. Dude, fly an I didn't know it had pedals if I'm being honest. Yeah, me either. I thought it was just the handsome. What's a helicopter? You have a helicopters have pedals? Oh, this [ __ ] is not This cut scene is not playing well for me. Oh, really? Oh, yeah. Oh, it's a little dicey. Yeah. Yeah, real dicey. Mine's eye dicey. Mine's eye. Yeah, this is uh this is a solid four",
            "start": 1863.84
        },
        {
            "text": "[ __ ] is not This cut scene is not playing well for me. Oh, really? Oh, yeah. Oh, it's a little dicey. Yeah. Yeah, real dicey. Mine's eye dicey. Mine's eye. Yeah, this is uh this is a solid four frames per second for me right now. That looks like a We should download a driver. Yeah, this is the driver issue. I skipped it. I skipped it, too. Andy, tell us what happens. Watch the four frames per second cut scene. Tell us what happens. Oh, me too. Then that's just buggy. Or maybe that's what they wanted. Maybe they're going for old timey silent movie. They did say that 50 series cards are going to have problems. What's up with the What's up with the 50 series cards? Uhoh. The shallude. Andy, skip this cut scene and catch up with us, dude. Look at this world, bro. Oh [ __ ] Oh [ __ ] Oh my god, bro. Oh, it's a big turd looking guy. Sing the song, Nick. You can you can hit that any time in my life and I'll always smile. Why don't we have it switching? Why Why are we switching? This whole",
            "start": 1947.12
        },
        {
            "text": "bro. Oh, it's a big turd looking guy. Sing the song, Nick. You can you can hit that any time in my life and I'll always smile. Why don't we have it switching? Why Why are we switching? This whole video has just been you guys going, \"Oh shit.\" Like, I'm not even there yet. Yeah, we got to wait for Well, we got to wait. We got Yeah, we got to let Andy get in front of us. So, Nick, get to the rock right when the purple thing stops and just stop there. Got it. Well, I'm going to keep going because No, I'm lame and I won't understand what's happening. All right. All right. If I don't You guys are faster than me and all this [ __ ] So, I'm just going to be harvesting. You got to do the dance. You got to do the You got to do the desert walk, bro. The shuffle, dude. Oh, my [ __ ] is fy. I am bouncing back and forth, guys. I'm in your Andy ketchup. This is very cool. Just to be around and hanging out, but fear not. Mike, have you ever seen the movie Tremors? Oh my god. You know what? I",
            "start": 2001.44
        },
        {
            "text": "am bouncing back and forth, guys. I'm in your Andy ketchup. This is very cool. Just to be around and hanging out, but fear not. Mike, have you ever seen the movie Tremors? Oh my god. You know what? I actually have not ever seen Tremor. I know what that is, but I've never seen I would like to watch Tremors with That was in the That was in like the era of like um what's the alien invasion one where they shoot the shoot the giant like bug monsters? No. No. Cut it out here. Mars Attacks. Mars Attacks. And then there's the other one that everybody loves. Hell Dian Men in Black. No. No. Hell Divers. Oh, Starship Troopers. Starship Troopers. Remember Evolution? They had evolution is I'm a guilty pleasure. I do. That's what Sprite Guy Orlando Jones. Yes. It feels like it feels like you say Tremors. It fits right into all those movies of that era. But no, I never saw Tremors. What do you all uh I'm crafting armor. I'm crafting some clothing of some sort. Yeah, me too. Cool. Crafted. Okay. I",
            "start": 2057.12
        },
        {
            "text": "It fits right into all those movies of that era. But no, I never saw Tremors. What do you all uh I'm crafting armor. I'm crafting some clothing of some sort. Yeah, me too. Cool. Crafted. Okay. I researched it. So now, can I craft this? Yeah, you will. You research it, then you craft. What do you Okay, so go to crafting. Oh, I got to craft all this stuff. This is like my still suit. That's cool. It keeps our sweat in there. It keeps all of our bodily liquids. Yeah. Yeah. Then we drink it, right? Then they Well, it just Yeah, I think it actually boofs it back up into you. Boofs it. Yeah. Well, there's a circuit out of your butt and it just happens. Wow. Yeah. That's actually Doom mythology right there. That's why no one wants to talk about it. Equip a set of clothing. I guess you're right. You never see him sucking it down. Left debris scattered all over this sector. Damn, I look cool. Oh [ __ ] And use it to make a m pistol and darts. Oh my god, they parried me. Ranger sandworm threat.",
            "start": 2105.44
        },
        {
            "text": "never see him sucking it down. Left debris scattered all over this sector. Damn, I look cool. Oh [ __ ] And use it to make a m pistol and darts. Oh my god, they parried me. Ranger sandworm threat. The bar in the center of the screen shows the vibrations you're making. Foolardy enough to use shields this deep in the sands. Wait, am I supposed to have the makeshift shoes or the mala boots? Oh, you're a bad guy. What the [ __ ] I didn't know you were going to attack me. [ __ ] I thought she was going to be like an NPC. Oh, she just came at you. She was like, \"Someone's here.\" Damn, dude. Ripped it. Oh, cool. Oh, I took darts from her. This game is ridiculous. And metal looking. Oh, cool. Okay, cool. So, I got to salvage more metal. Was I supposed to just make my way over here? I don't think I can go over here yet. Oh, no, I can't. Oh, yeah. We're We're deep in the moment now. Welcome to the game play. Holy [ __ ] [ __ ] smashy on every plant you've ever seen in the video game. I miss it,",
            "start": 2160.72
        },
        {
            "text": "can go over here yet. Oh, no, I can't. Oh, yeah. We're We're deep in the moment now. Welcome to the game play. Holy [ __ ] [ __ ] smashy on every plant you've ever seen in the video game. I miss it, dude. I miss that. I miss that stock audio of the ripping sound. Like it sounds kind of like a fabric when you depplant. I miss it, man. We haven't played Icarus in forever. What was that other game, Andy, that we played for a little bit with the with the uh floating islands that you were playing afterwards? Dude, uh Lost Skies. Lost Skies. Dude, that was pretty sick. That was I still I still hop into that [ __ ] That game is so cool. I got my own little like airship that I'm just flying to different areas with a ziplining rocks. Game's cool as hell. Bath 90 darts. I don't think I'm doing this right. I'm just cutting stones. Where are the metal? Where's the metal? Uh the you saw it right next to that one lady and then there's one more below that will give you enough to keep your",
            "start": 2223.84
        },
        {
            "text": "doing this right. I'm just cutting stones. Where are the metal? Where's the metal? Uh the you saw it right next to that one lady and then there's one more below that will give you enough to keep your progressing going. I don't I think I don't think I went the right way. I think I'm up on the roof. Oh [ __ ] Love it. I got a 40 second queue to craft all my darts right now. Oh, [ __ ] yeah. Damn. See, you guys are already ahead of me. Where's this lady? She was like like I ran to the waypoint. Oh, yeah. I'm not going. I got I'm out of bed. Oh, I just [ __ ] ate [ __ ] I'm I'm I'm lying out here. My pink nasty. The shy hallude. What do you got for tonight's basketball game, Andy? Whoa, look at these buildings out here. Um, back to Indiana. Do they take it or will OKC run away with it again? Dude, it's such a weird series, man. I I truly have no idea. Whoa, I'm getting crazy. Uh, like vertex stretching from somewhere. Where's Oh my god, I see the sand worm moving. Um, I don't know. Who do",
            "start": 2275.2
        },
        {
            "text": "it's such a weird series, man. I I truly have no idea. Whoa, I'm getting crazy. Uh, like vertex stretching from somewhere. Where's Oh my god, I see the sand worm moving. Um, I don't know. Who do you think? I I don't I think OKC's got it, unfortunately. Uh Tyrese and the team might get one here in OKC. I think OKC just has a better bench and a a more in-depth squad. Tyrese also hasn't even had like a game. Like they were really bottling him up. Well, they had that he had that game winner game one. Yeah, but that game he sucked like the whole, you know, the whole game he was just kind of being bottled up. Sandwich. Yeah, my game's freaking out. I'm getting like crazy vertex [ __ ] Whoa, look at this [ __ ] It's a recon. Something's broken in my in my game. More metal. What object is in this building that's screwing up my game? I think this is like a person's house, probably. I think it's like a Oh [ __ ] he's shooting at me. [ __ ] you, dude. Yeah, that's what I'm saying. I'm still",
            "start": 2326.96
        },
        {
            "text": "this building that's screwing up my game? I think this is like a person's house, probably. I think it's like a Oh [ __ ] he's shooting at me. [ __ ] you, dude. Yeah, that's what I'm saying. I'm still looking for metal. Oh, you know I've been keeping up with hockey only because of the Dan Lambertard show and the Florida Panthers. Ow. [ __ ] almost killed me. Oh [ __ ] My [ __ ] went from day to night. From night to day. Yeah. Feel good. Yes. I found I found more metal. Oh, what is this? When do we get together though? That's my question. You know what I mean? Like this is all great and all, but like when when do we get put in the same world? The crafting cutting thing is super cool. I like it a lot. All right. Yeah, you like that. Time to build my Oh, we got to research the pistol. I just did not have any. And now we craft the pistol and a bunch of darts. How many can I make? I can make a buttload. Am I am I making one singular dart or is it a bunch of darts? Well, you need to make 90",
            "start": 2388.0
        },
        {
            "text": "did not have any. And now we craft the pistol and a bunch of darts. How many can I make? I can make a buttload. Am I am I making one singular dart or is it a bunch of darts? Well, you need to make 90 for that little quest. If you look at your if you go back out of that menu, it says craft 90, right? Okay. So, craft one. That's probably like a packet. Yeah, they're crafting a bunch for you. I just cra I just hit craft all and I think it got me to 90 where I need to be, which was sweet. So, I just recommend hit craft all and then we're going to go find more stuff as we go. Anyways, what does Q mean? Detonate. Heat stroked. I got to get in the Yeah, dude. I'm getting heat stroked. Research the respawn beacon. Open up the map. Where's the respawn beacon? Uh, crafting. Oh yeah. Oh yeah, dude. Give me that metal. Hunter Seeker. That's so cool. Uh 30 each is what Krux says. So it's coming in 30s. All right, that's cool. Uh place a recon beacon. Oh [ __ ] I'm at somebody's house. Like someone",
            "start": 2444.0
        },
        {
            "text": "me that metal. Hunter Seeker. That's so cool. Uh 30 each is what Krux says. So it's coming in 30s. All right, that's cool. Uh place a recon beacon. Oh [ __ ] I'm at somebody's house. Like someone in the world. Yeah. Yeah, I noticed that as well. I had no access to it. That's cute. My game's freaking out though. Something's [ __ ] up with it. What do you mean? Look at this. It's not red one. Yeah, mine's like very Oh, yeah. You got like the Call of Duty freak out going. Yeah, when like it it's a it's a couple of like vertices from some object just like shooting out to the Oh god. Oh god, that was a long fall. And it's in this house. It's a player's house that is likely the source of the of the mess up. Oh, that's all player building. That was the issue of once human is the starting area got freaked out cuz so many people got in the game and just built right where they saw. So like the starting areas were just freaking the [ __ ] out trying to load up everybody. And I think they had to",
            "start": 2513.52
        },
        {
            "text": "freaked out cuz so many people got in the game and just built right where they saw. So like the starting areas were just freaking the [ __ ] out trying to load up everybody. And I think they had to like wipe that like a week or two later. They were like, \"Yo, we got to drop a new we got to do something here, y'all. You [ __ ] it all up.\" Okay, skill points. Oh, we have skill points. Uhoh. Oh, [ __ ] yeah. Oh, you're different than me. Nice. Well, I don't know. Like I I'm not sure. I guess I have Oh, you're clicking on all the different ones. Oh, you could be all different ones. That's cool. So, you're not just tied to, but I Well, these are all locked out. So, you are tied to the one that you initially selected. Oh, yeah. Interesting. Unlock tree to basic sword measure. Interesting. Yeah. Override your nervous system, allowing you to run forward at incredible speed. shield wall. I can either freak out with my voice or I can run fast. I'm going to freak out with my voice. Oh, no. It's",
            "start": 2573.76
        },
        {
            "text": "Override your nervous system, allowing you to run forward at incredible speed. shield wall. I can either freak out with my voice or I can run fast. I'm going to freak out with my voice. Oh, no. It's already equipped. Oh, it's already I've already unlocked it. See on the bottom left. Okay. Insufficient moves is what it is. Okay. All right. Where's my respawned beacon? There it is. It's set to number four. This used to be Fman territory, but the war of assassins in the Sardar pogram put an end to that. Oh, it becomes a little camp. Sector is crawling with scavengers. I'm going to try to res reset my game, can you? Left in the wake of this socalled noble. I mean, they're not going to see anything once you turn. That's what I'm saying. I was just going to go black somebody else's. Allow them to do the hard work of gathering the salvage and then research. I'm researching. Oh, can you send your feed to to Kevin? Mike, I'm going to reset my game. Do you guys find the scavengers? Uh, do we",
            "start": 2624.08
        },
        {
            "text": "to do the hard work of gathering the salvage and then research. I'm researching. Oh, can you send your feed to to Kevin? Mike, I'm going to reset my game. Do you guys find the scavengers? Uh, do we what? Did you find the scavengers? Uh, no. Not yet. I just started that. Oh, no. Where' you are they on another rock, Mike, or Oh, yeah. If you look at your uh if you look at your thing, you just 360 look around, you'll see a little campsite. Okay, mine's up camp over there. Of course, the sound won't be coming through. One secondh. It's the spice. Any spice is freaking my character out. This one is for the shy halude. Mild win. Thank you for 14 months of support. Appreciate you. Mild win. And Ally, 46 months. I'm heading to the camp. Thank you, Lord Pretty the Flaco as well. A lot of people using Prime. Thank you so much for your support today, gamers. Identify yourself. I don't want to deal with you. Psych. Head shot. I'm going to dart these guys. Should we try to like get together after",
            "start": 2683.6
        },
        {
            "text": "Prime. Thank you so much for your support today, gamers. Identify yourself. I don't want to deal with you. Psych. Head shot. I'm going to dart these guys. Should we try to like get together after the scavenger camp mission? Should we call it that? Oh man, that's wild. I just keep hearing the the the sand worms behind me and I don't like it. Oh, I see that popup chat. Yeah, I'm going to try to download that right now. Got his ass. Was there an Nvidia update? No, but there but when you open up the game, there's like a little text box that says, \"Use this link to go download this hot fix.\" So, it's not through the It's not like a driver through the official app. All right, that's good to know. This guy's got so much metal. I just took all his [ __ ] in. Take all of his [ __ ] bro. You don't know me. And then also make sure to Thank you for your water. Whatchamacall. Make sure you're uh crafting supplies as well, big dog. Oh, yeah, man. Well, I mean, I'm on I'm taking a couple health I'm",
            "start": 2741.28
        },
        {
            "text": "know me. And then also make sure to Thank you for your water. Whatchamacall. Make sure you're uh crafting supplies as well, big dog. Oh, yeah, man. Well, I mean, I'm on I'm taking a couple health I'm taking some shots. I need some health. Yeah, I don't think I've unlocked that [ __ ] yet, though. No, you got a health kit. You You unlock that early. Bandages. Oh, bandages. Yeah, I don't have a health kit, though, dude. No, just a bandage. I got to craft some bandages, dude. Boom. I'm back. Get my boss out. Take a look. Palton 78 months as my three favorite gooners. Jeez. Come on, new goon. [Music] new ability. Cute. Look at that, dude. Uh, Nick, I am at the camp. It's a very small little camp. Let's see. Uh, trying to figure out how to get together, bro. I don't know that we're in the same spot, Mike. Cuz I think I'm at the camp, too. Oh, really? Are you talking about the one that's like you the rock you start on, you just go directly like north? Yeah. And like a little underneath it",
            "start": 2811.12
        },
        {
            "text": "spot, Mike. Cuz I think I'm at the camp, too. Oh, really? Are you talking about the one that's like you the rock you start on, you just go directly like north? Yeah. And like a little underneath it on the backside. Yeah, there's a tiny little camp out here where you just kill one guy or are you talking about the one right across from me? I'll take a look in just a second. Okay, just tell me where like tell me where the coordinates are on your map. I'm going to I'm going to eat some flour. I love that. I'm learning to hydrate. Ignore storms that sweep across the desert. Oh, so much easier to hydrate in this. Remember when you and you drink an Icarus and they give you some sort of parasite? Just [ __ ] your pants. Share a cave with some scavengers. That was awesome. Your best bet is to build your own shelter. Build a construction tool and place out a sub thief console. You'll be installing the driver of the planet surface. I should probably do the same thing. Or rather, but you weren't",
            "start": 2862.88
        },
        {
            "text": "your own shelter. Build a construction tool and place out a sub thief console. You'll be installing the driver of the planet surface. I should probably do the same thing. Or rather, but you weren't having all the weird [ __ ] I was having. Well, I was just like, I'm a little hazy on the specific. Frame it out. It's fine now. All right, Mike. So, framing. There's a bunch of little camps everywhere, Mike. Oh, you want to talk about it? One sec. Sorry. I just want to see you, bro. Uh, I don't think we're there yet. Okay. Use your ability. Oh, okay. I don't. Yeah. I think once you unless you and I build this camp and then we'll try to get together. That's our goal. Okay. Cool. Cool. Cool. Cool. Build the camp. Oh, I got to use my ability. Oh my god, that was sick. What was yours? My ability is like a dash forward and I go invisible for like a second. Oh, is yours is yours the cool run? Yeah, mine's the cool one. See it again. Oh, [ __ ] Yeah. No, it's gone. It has to reload. Yeah. I'm",
            "start": 2901.2
        },
        {
            "text": "is like a dash forward and I go invisible for like a second. Oh, is yours is yours the cool run? Yeah, mine's the cool one. See it again. Oh, [ __ ] Yeah. No, it's gone. It has to reload. Yeah. I'm going across the desert back now. Now it's back. Hold on. I got to hydrate. I got to drink some plant. Sorry. Drink that [ __ ] flour. Why won't Let me just fill up. Let me fill up on the flower, dude. Sandworm threat. Watch this, Andy. Ready? Yeah. Whoa, that was crazy looking. Yeah, I'm I'm I'm pretty cool. I'm not going to like toot my own horn, but All right, I'm It's installing right now. We Phil, 45 months support. Thank you, we subscribing, supporting us here at kind of funny. Okay, let's open the skills menu. Endless dark says y'all can y'all absolutely can meet now. Okay, by how? Let me look it up. I think I started it up. I'm a sword master. Damn, this looks like Prince. Thank you. You can access the social hub from the skills page and then click social menu icon from there. If",
            "start": 2945.04
        },
        {
            "text": "me look it up. I think I started it up. I'm a sword master. Damn, this looks like Prince. Thank you. You can access the social hub from the skills page and then click social menu icon from there. If you already have friends added on Steam, hover over their name and invite. Okay, Nick, are you ready to get lost in that? I have one more thing I learn a new ability from the skills menu. Open that up. That do Thanks. Unlock the abilities, techniques, pro. Open that up. How the [ __ ] do my Oh, yeah. You have one more to add. It adds it to C. That's sick. Which is stupid because we all know C is crouch. Yeah, I needed to be on E. For real. For real. Tilstron, thank you for resubscribing using your Prime. If you have Amazon Prime, you have Twitch Prime. Don't forget to set a reminder. Oh, are those like Are you a Twitch [Music] Amazon Prime? [Music] Make sure you set salvage metal salvage fuel cells. Oh, yourself, Peter. Okay, for free. All right, I have to restart my whole computer. Okay.",
            "start": 3000.0
        },
        {
            "text": "like Are you a Twitch [Music] Amazon Prime? [Music] Make sure you set salvage metal salvage fuel cells. Oh, yourself, Peter. Okay, for free. All right, I have to restart my whole computer. Okay. Wow, you're just going backwards. Yeah, you're really And he's like, I have to install a new hard drive. I'm going to go to the restroom while it's restart. Have fun, buddy. That's good stuff. We're going to get lost in this game. I'm already lost in it, Nick. You You can already see I'm I am deep in this one, buddy. It's already happening. Where do I find the fuel cells? Uh I would assume at different bases like so when you go to those camps, they'll probably have some. I'm going to be real. If you just keep running around the same area, Yeah. You'll find them in this respawn [ __ ] It's great. Oh, really? Yeah. I've run around this thing like five times. I found more metal. That's okay. Okay. Don't doubt me. I was going to say if that's what you want to do, run around the same [ __ ] I like",
            "start": 3067.28
        },
        {
            "text": "really? Yeah. I've run around this thing like five times. I found more metal. That's okay. Okay. Don't doubt me. I was going to say if that's what you want to do, run around the same [ __ ] I like that. It's easier. I'm outside, bro. And I'm not coming back. When's the last time you felt the sun on your on your skin? Oh, man. Isn't that the best, Nick? Just you feel it just kiss your face. It's just so nice. Kiss. I need a mine granite stone, bro. I need some stone in my life. I've m I've mined so much stone. What is that? Just a rock formation or you actually mining? There's stones around it, but yeah, if you like burst the you know, you scan the rock. Yeah, it'll give you more. Okay. So, just keep scanning rocks and you can scan to start cutting them up. Scanning rocks with the with this cuttery thing. Yeah, you get the big boulders if you scan and they'll put give you a little line and you can scan the the That's the metal. That's same with rocks. Like a big red rock. If you go up",
            "start": 3127.04
        },
        {
            "text": "cuttery thing. Yeah, you get the big boulders if you scan and they'll put give you a little line and you can scan the the That's the metal. That's same with rocks. Like a big red rock. If you go up to there's certain rocks that have them and if you go up to them, you'll see it and it'll it'll let you mine them along with like this other there's like three or four different types of rock or two different types of rocks that I've encountered already. That's cool. That's real cool. I wonder where the I don't know where those fuel shells are though. Uh in the chests at the different outposts. Oh, the blue rocks, bro. No, the other the red rocks, too. They're standalone rocks. I'll show you when I find one. Yeah. Oh, that's copper ore is the blue rocks, Nick. Oh, copper ore. Yeah. Copper ores, blue rocks. Oh, Peter, we'll evolve. We'll We'll get up to that one day. I'm going across, dude. Oh, [ __ ] I think you should, dude. I'm about to go across, too. I'm about to run in the shadows. I",
            "start": 3169.84
        },
        {
            "text": "blue rocks. Oh, Peter, we'll evolve. We'll We'll get up to that one day. I'm going across, dude. Oh, [ __ ] I think you should, dude. I'm about to go across, too. I'm about to run in the shadows. I need to get to the shadow. I need to cool off. Don't let the worm hit you, though, buddy. That's the shy collude. Shyude. I'm just a desert mouse. I'm just a little baby desert mouse. You're the mad deb. That movie is so good. Those two movies are unbelievably good. They truthfully and honestly are. It's like something that I didn't think I'd ever be into. No one did. Something that Yeah. It feels like Game of Thrones to me. Like I was like, I don't know if I'm going to like Game of Thrones. And then I sat down and watched like the first three episodes. I was like, I love this. This is my life now. I mean, right now, a lot of people would say, and I would imagine that the Game of Thrones writer as well would say that he drew a lot of inspiration from Dune. The houses. Yeah. The houses, the",
            "start": 3206.56
        },
        {
            "text": "now. I mean, right now, a lot of people would say, and I would imagine that the Game of Thrones writer as well would say that he drew a lot of inspiration from Dune. The houses. Yeah. The houses, the the you know, Lanzen is Arachus. like the power, the shift of power and all that stuff. Like a lot of that stuff is inspired by Dune. That's cool. Dune is a very is very like sa sacred for a lot of writers. See right here, Mike? See how this is like a I can just scan this. Yeah, that's just a random rock. So these standalone rocks here, you can assume Yeah, I need some more granite stone in my life. Oh, I think I'm rolling up on one right now as we speak. Hey, isn't Dune considered the like the first modern sci-fi book. It is like the Bible for sci-fi writers in the same way that Lord of the Rings is for fantasy. Correct. Yeah. Wow. That's cool. Also, a side note, if you guys uh have any desire, I watched the Led Zeppelin documentary. Speaking of Lord, okay, there was such a big Lord of",
            "start": 3251.44
        },
        {
            "text": "Rings is for fantasy. Correct. Yeah. Wow. That's cool. Also, a side note, if you guys uh have any desire, I watched the Led Zeppelin documentary. Speaking of Lord, okay, there was such a big Lord of he was uh Robert Plant when he was writing lyrics was such a big Lord of the Rings fan that like there's a bunch of just random lyrics for [ __ ] in in Led Zeppelin songs that are like Misty Mountain and like Mordor and they were dorks. big lead zap. All right, resap construction tool. They want me to make uh one of those harvesting tools, the sickle, so I can cut up these plants eventually, but I'm not there yet. Oh [ __ ] I like the little gun. The building gun. No, the shooting. The shelter and shield. That's cool. The little dart. Yeah, the little dart shooter. Bro, I really like that. Oh, I can craft something here. I don't want to craft here though. Okay, I'll just craft here. Why does Steam open up and then you choose who you are and then it just closes? It's like, no, just open.",
            "start": 3300.48
        },
        {
            "text": "I can craft something here. I don't want to craft here though. Okay, I'll just craft here. Why does Steam open up and then you choose who you are and then it just closes? It's like, no, just open. We've chosen who I want to be. Construct foundation. Okay. Oh, here we go. Here we go. So, that you have to put that thing out first. I don't want my [ __ ] to be like a hero, but it's fine. That's I need so much rock. Are you Have you craft Have you gotten 150 rock? Yeah, I've been so much rock. Good for you, bro. Well, I just thought the rocks were metal for a while if I'm being real. Okay. But there was a hot second where I was like, I don't know what I'm doing here. Oh [ __ ] Somebody had a landmine in their [ __ ] cave home. That's crazy. Smart. Why would they do that? Keep people from robbing them. I am robbing them too. That's crazy. It didn't work. Whoa. There we go. Okay. I need this like over here. I have to put a support first. Okay. Damn, you're building your home already, Nick.",
            "start": 3356.4
        },
        {
            "text": "them. I am robbing them too. That's crazy. It didn't work. Whoa. There we go. Okay. I need this like over here. I have to put a support first. Okay. Damn, you're building your home already, Nick. I guess. Good for you, Brody. Mike, do you know? I don't really know, dude. That's the launcher. Hit the launch button down bel Oh, bottom right. Bottom right. Yeah, it seems to have its own launcher. Why would it steam? Yeah, that's wild. Fun comp. This seems like definitely something that's trying to steal your money. Uh, yeah, I'm sure. I'm sure I'm sure we'll get the email next week. Oh, Nick, I'm so back, bro. I'm getting rock after rock now, bro. Are you, dude? I am so back. Yep. Oh, yeah. I want to build these research basic basic construction [ __ ] Okay, so you lay Oh, that's cool. You can lay out [ __ ] first and then build it. Oh, yeah. Like we like that in the other games that we've been playing recently. That's kind of sick. Like that a lot. Crafting. Craft tool. craft. Okay. Too",
            "start": 3416.64
        },
        {
            "text": "lay out [ __ ] first and then build it. Oh, yeah. Like we like that in the other games that we've been playing recently. That's kind of sick. Like that a lot. Crafting. Craft tool. craft. Okay. Too close. You want to just invite Andy? I'm going to invite them after they do this uh part that me and Nick are on right now. Just so everybody's at the exact same spot. Yeah, we'll just slap it on Andy's call. Good. Yeah, leave it on. Well, no, we'll leave it on yours. But I have the power now to flip it back and forth, which is good. Yeah. more of a sub subief. I got ad is updated, right? And then get your construction tool out. No, don't worry about it. Then we'll just leave it on mine. Then make it easy for Andy and M. I can reroute. No, if he doesn't want to show his, it's fun. Uh, construct four pieces. I feel like a Green Lantern right now. Yeah, dude. There we go. Oh, I like that they state this is the inner face of the wall. That's nice, bro. Good for them. Oh, dang. I [ __ ] missed",
            "start": 3485.28
        },
        {
            "text": "four pieces. I feel like a Green Lantern right now. Yeah, dude. There we go. Oh, I like that they state this is the inner face of the wall. That's nice, bro. Good for them. Oh, dang. I [ __ ] missed that. It's huge. It's huge. No, no, no. I know that. I just un put a window there and now they're facing in. Look at this. Look at I'm a dumbass. Oh, whatever. It's fine. It looks cool. Can I break one? I You have to be able to break one down, right? Yeah, just leave it on mine. It's fine. How How do you break it down if you don't Oh, move it. Quick deposit. Manage. Oh, dang. Now they should have fill in all. If I put up seven walls, I shouldn't have to go one by one. It should just have a fill in all button. That would be nice. [ __ ] yeah. [Music] I I didn't have any buzzing in my ear until the press any button pops up. That's weird. As I'm compiling shaders, no buzzing. Then press the the compiling shaders and move yourself console to a sheltered location with the construction tool. So",
            "start": 3542.4
        },
        {
            "text": "the press any button pops up. That's weird. As I'm compiling shaders, no buzzing. Then press the the compiling shaders and move yourself console to a sheltered location with the construction tool. So five, move, rotate. Have you fig [ __ ] yet? Mike, are you moving your I'm put something down that I want to move. Yeah. a wall or the actual main piece. This main big engine thing is That's what I'm about to do right now. I'm going to learn it together with you right now. Don't want that. I want to break that [ __ ] down, but it won't give me the prompt for it. No, there's got to be a different button here. favorites, utilities, fabricators. That's not what I want. Build, peace picker, move. There it is. Right click twice, Nick. To move. So, if you look at your bottom right, it says build, peace picker, move, repair, demolish. Right click twice to move down to move. Oh, okay. How do you Oh, I see. And then click on It won't let me move. Okay. Pick up buildable. Nailed it. Mike, you're",
            "start": 3666.88
        },
        {
            "text": "peace picker, move, repair, demolish. Right click twice to move down to move. Oh, okay. How do you Oh, I see. And then click on It won't let me move. Okay. Pick up buildable. Nailed it. Mike, you're [ __ ] And then I'm moving it. And they want me to move my console into the lo Oh, into my shelter. Okay. Interesting. Is that they want? Yep, they do. And then boom, did it construct or Oh, that's interact with small storage container. Got it. And then go back to build small storage container. My [ __ ] is so cool looking. [ __ ] yeah, bro. Build. Okay. Interact with a fuel power generator. What is this little [ __ ] It's massive. What's a subfield console? What do I need that for? Is that supposed to be inside? That is like Well, let's call that like it powers it. That's kind of the heart of your building area, but let's just call it your crafting station for right now, just to make it easy terms. It's not. Oh, I see. But let's just call it that. All right. It's It's home base. The",
            "start": 3740.24
        },
        {
            "text": "of your building area, but let's just call it your crafting station for right now, just to make it easy terms. It's not. Oh, I see. But let's just call it that. All right. It's It's home base. The heart. Don't shoot him, you [ __ ] I want to be like inside here. They want you to put it inside. Yeah, for sure. I need to be Holy [ __ ] I'm critically injured. What the [ __ ] Okay, deposit fuel cells into it. So now I can get out of this. Walk up. Cool. Okay. Quick deposit with a quick out your base from the sandtorms. Just keep the generator fueled or the storm. How come I can never hydrate more than like a quarter and it goes without. Have you noticed this, Mike? What? I just can't. It won't let me hydrate past like a third. Oh yeah. Wing commander says, \"Does someone not watch chatter? Is Mike just going to die?\" Uh, wing commander, I know I need water. It was acting really weird if we couldn't drink water uh for a long time. So, I think right now, now that I have the freedom, it's",
            "start": 3808.88
        },
        {
            "text": "Is Mike just going to die?\" Uh, wing commander, I know I need water. It was acting really weird if we couldn't drink water uh for a long time. So, I think right now, now that I have the freedom, it's going to say go drink some water, but it wouldn't let me go past a certain level, big dog. That's why. So, no, I won't die. I just uh couldn't drink any more water. If you're really relaxing, man, don't. It's just a weird weird video game thing. I don't know how to explain that to you. To drink it unless you really have to. The do limit reach you can only drink so much do. Well, how about that, big dog? There you go. Krux says, \"You can only drink one/3 from the dew.\" Oh, the dew only fills one third. I understand. So, I got to start drinking my Walmart's got a new dew flavor, by the way. Oh, really? Yeah. I don't know what flavor it is, but I saw it. Can I stay here for two seconds? Yeah. Oh, yeah. Super thing. Just I don't like that this is like there's always spots on here that craft a",
            "start": 3860.56
        },
        {
            "text": "really? Yeah. I don't know what flavor it is, but I saw it. Can I stay here for two seconds? Yeah. Oh, yeah. Super thing. Just I don't like that this is like there's always spots on here that craft a blood extractor. Nice, Mike. Yep. There you go, big dog. I think And also like me, Nick, and Andy are really trying to learn the game. Yeah, y'all usually yell at us that we don't understand the game. So, we're trying to learn it. So, I do apologize, Wing Commander, for not reading all the jets right now. [ __ ] We're trying to figure out how to play. Craft a blood extractor, snow bike, Mike. Boom. I'm so crafted, dude. Are you crafting [ __ ] bro? Yeah, dude. I'm right there with you, man. [ __ ] that. Hey, Nick, you're doing good today. Thanks, dude. You're doing really good today. Okay, you're [ __ ] on this. Got to put this I got to use this. I don't need this blood extractor. I'm going to craft this blood sack, too. I got too many blood sacks. Mhm. Craft this blood sack. All right,",
            "start": 3902.24
        },
        {
            "text": "[ __ ] on this. Got to put this I got to use this. I don't need this blood extractor. I'm going to craft this blood sack, too. I got too many blood sacks. Mhm. Craft this blood sack. All right, Nick. Now, I'm going to I'm going to send you an invite. You ready? Wait, hold on. I want you to craft a small I want you to stop on water from blood and we're going to locate and kill scavengers together. Okay, I love this. You're going to stop there. I accidentally crafted two blood sacks, though. Ah, that happens. That happens. You get a little You get a little ant money. All right. How do you get How do you get rid of my Let's see what the menu is here. How do you get to your inventory? Quick menu. Press B. No. Inventory. Like I want Oh, here we go. Okay, never mind. And then Yeah. I mean, press B and then just click on inventory up there. I don't need like two blood sacks, do I? I mean, who knows? I don't think it's going to kill you, Nick, to have it. Okay, fair enough. You know what I",
            "start": 3951.84
        },
        {
            "text": "B and then just click on inventory up there. I don't need like two blood sacks, do I? I mean, who knows? I don't think it's going to kill you, Nick, to have it. Okay, fair enough. You know what I mean? I don't think it's so bad. Well, I just want to make sure I have the blood extractor loc located, you know? Okay, cuz I need this extractor first and then the sack probably. Cool. All right, let's rock, dude. Are you ready? I'm all right. I'm going to send you an invite. Let's see what happens. Invite, dude. Andy, I can send you an invite whenever you're ready or we can wait for you to get up to us if you want to do your own. No, go for it. Yeah, I just did the uh I'll join you all here in a second. I just had to uh I finally did that. Nick, my house is so brutalist. I finally did the thing where I scouted out for the other scavenger team or whatever. Uh Nick, what is your character name? Nick Scarpino. Nick Space Scarpino. Yeah. Thank you for that. Nick, I have just added you. So, what",
            "start": 3990.48
        },
        {
            "text": "where I scouted out for the other scavenger team or whatever. Uh Nick, what is your character name? Nick Scarpino. Nick Space Scarpino. Yeah. Thank you for that. Nick, I have just added you. So, what I need you to do right now, press Y. You will go to the normal menu that you see now. At the bottom is a triangle that says social. Oh, I love that. Click on that. All of us. Look for friend invites. Okay. Click on that. And can you accept mine? I don't have any, but let me invite you. Okay. Uh, do you want to join a party with Nick? Yeah. dude invite. Oh yeah, he does. Oh, wait. Never mind, Mike. I found your party invite. Oh, and shout out chat. That that hot fix did fix the issue of the weird kind of vertex stuff happen. Man, I want a hot fix. Oh, you joined my party. Okay, now Nick, let's become friends. That's a big commitment, Nick. No, Nick, go back over to the party, Nick. Yep. There's a circle and an X. Click on the circle on my name. Make me party leader again, please. All",
            "start": 4024.0
        },
        {
            "text": "let's become friends. That's a big commitment, Nick. No, Nick, go back over to the party, Nick. Yep. There's a circle and an X. Click on the circle on my name. Make me party leader again, please. All right, perfect. Um, is there a way to become friends? Oh, here you go, Nick. Double click on my name. Like the whole little bar. Double click on it. Bring up a new square. Hit send friend invite to me. Man, I'll be honest with you. I don't need a game like this right now. But you kind of want it. I kind of want, but it's doing stuff for me. You know, there's too much to play right now. Mike, any dude, we could get lost in this for the next seven hours if you want. What? What if we just commit one night? We just we just lock in all night. You know what I mean? That's all we got to do. One day. Uh, Nick, did you hit that friend invite? I thought I did, Mikey. I'm I hit a friend invite to you. I don't know if they're coming out to you or not. It says friend invite sent. I got Oh, there's",
            "start": 4079.12
        },
        {
            "text": "Uh, Nick, did you hit that friend invite? I thought I did, Mikey. I'm I hit a friend invite to you. I don't know if they're coming out to you or not. It says friend invite sent. I got Oh, there's mine. There's mine from you. Oh, I sent one to you. Yeah, I accepted it. So, I should be in your party. No, no, you're in the party. So, now I want to be friends cuz I'm not seeing all my friends. Walk me through that one more time. So, on this social page, Nick, on the left hand side, it says friends list. Click on friend invites. Okay. I don't see [ __ ] You don't see a received invite? No, I see nothing. Weird. I have a I have a send invites out to you. Let me Yeah, he has nothing on. Let me sort of How about go back over to the party? You invite me to your guild or my party? You invite me to your guild. Part of your cool guild. We're in the Well, I don't have a guild. Start a guild. He wants me. All right. Yeah. Why the [ __ ] you want? No, I don't have enough money to start a guild. You",
            "start": 4124.4
        },
        {
            "text": "your guild. Part of your cool guild. We're in the Well, I don't have a guild. Start a guild. He wants me. All right. Yeah. Why the [ __ ] you want? No, I don't have enough money to start a guild. You have to pay them money for [ __ ] that. We're not pay We don't We don't We don't pay cover charges. Yeah, exactly. We're not doing that. Now, Nick, again, let's go back to players and party on the on the party side. Yeah. Double click on my box like I clicked on your box. New box comes up. It says private message block. Edit permissions. Send friend invite. Remove friend is what it says. So we're friends. Okay. We're somehow friends. Interesting. But you are popping up on my We're already friends. All right, that's fine. Okay, then let's do this. Nick, we're now in a party. Does it default that you all are friends? Is your Steam friends? Why is your online name Hagen Basin? Oh, no. That's where he is. That's where you are. That's where we are. I thought it was Okay, so now we're in the",
            "start": 4161.52
        },
        {
            "text": "that you all are friends? Is your Steam friends? Why is your online name Hagen Basin? Oh, no. That's where he is. That's where you are. That's where we are. I thought it was Okay, so now we're in the party together. Let's try to get each other. Let's try to get you with me. Okay. So once you go here, can you somehow come to me? Oh, I see everyone else's houses. Yeah. Why would people build the houses not on the rock? You're insane. Well, you know, I think I think this is the first house. They're just trying to get out of it. Yeah, but you got to build on the rock base so the shall [ __ ] just eat me, dude. No, but they can't. No, the [ __ ] generator protects Oh, protects from the sandstorm. And also, I don't think the shy could even fit in this crevice. They definitely can fit. I wouldn't take that bet. I'm going to kill some people. I think you're overest. No, no, no, no. We got to find each other. Slappy first. Press M for map. Okay. All right, Mike. You're not on my map. So, I got",
            "start": 4199.36
        },
        {
            "text": "take that bet. I'm going to kill some people. I think you're overest. No, no, no, no. We got to find each other. Slappy first. Press M for map. Okay. All right, Mike. You're not on my map. So, I got Hagen Bag South. Hagen. I got I'm at Hag Haga Basin South. You're at Hagen. Well, that's where we all are. I think that Basin South. How do we find Nickpino? You went [ __ ] right. I went left. Nick, you're on the other side of the [ __ ] map. Zoom out. Zoom your map out. Mike, how are you over there? Going [ __ ] west, bro. How are you so [ __ ] far away from me, bro? Why would you go that way? We can't have houses that far from each other. What are you doing? We need houses that have a conjoining door. The door house. I saw what he was. Why are you so far? Why did you go that direction? I didn't. No, no, no. So, why? Check this out. My face. This rock right here is where I started. That's where I spawn. Zoom out. So, okay. Interesting. Yeah, I started on I started on the rock to the",
            "start": 4238.4
        },
        {
            "text": "I didn't. No, no, no. So, why? Check this out. My face. This rock right here is where I started. That's where I spawn. Zoom out. So, okay. Interesting. Yeah, I started on I started on the rock to the left. That's right. I started on the far left. Let's all Yeah. So, I didn't I think this is just where it started. That's where they put us. But I can just kind of run over to you, I guess. All right. Here's what we do. Here's what we do. We meet in the middle. Yeah. We meet in the middle. Okay. I'll meet you in the middle. All right. So, I need to go Well, hold up. We need to make sure we're going the right direction. Hold on. I'm facing east, so I need to go west. No. No. Look at your compass on the top. Yeah, I see you. Number one, I got number two. I'm going to head to guy, dude. You're my guy. You're my [ __ ] guy. Scarfo and get in this [ __ ] [ __ ] game. Stop updating both. Stop updating your [ __ ] driver, dude. Gaming driver. Oh my god. We're faster cuz we're our feet are on the",
            "start": 4289.76
        },
        {
            "text": "guy. You're my [ __ ] guy. Scarfo and get in this [ __ ] [ __ ] game. Stop updating both. Stop updating your [ __ ] driver, dude. Gaming driver. Oh my god. We're faster cuz we're our feet are on the ground. I just dislike so like I You can't leave us together, though. We're back. Yeah, exactly. We ramp each other up. I don't like I mean, you got to understand why I don't want to be here. Just have some self-awareness. We know. Oh yeah, we we can't we can't notice that when I'm h when I'm unhappy I go I shouldn't do that. No, we're just excited you're here. We make you better. Oh [ __ ] those shy luds over there. Mike, I'm running over this big hill. Nick, I'm coming to you, bro. This is going to be lit, bro. The boys are back. We really don't need a game like this right now, Andy. But we need a game like Yeah. Like what if we just block out the whole week and we just do this? Look at this miners camp on mic. That's what Dr. Disrespect wants to be. Oh [ __ ] Whoa, his ass. Somebody's",
            "start": 4326.32
        },
        {
            "text": "need a game like Yeah. Like what if we just block out the whole week and we just do this? Look at this miners camp on mic. That's what Dr. Disrespect wants to be. Oh [ __ ] Whoa, his ass. Somebody's coming. That was really good. Uh, let's see here. Oh, you're going to suck blood from the people you murder, Nick. How cool is that? I'd like to. I'm getting [ __ ] sunstroked out of my Yeah, Mike, I'm going to take a dip in this in this [ __ ] That was kind of I think you and I getting together. It's going to be a minute, so don't worry about it. Okay, I'm I'm going to slow play my way over to you, but I'm going to keep moving east. I'm always I'm gonna try to suck some dew for uh wing commander right now. Sucking some dew for him. You see him sucking the do wing command for you. You see that sucking that do too close to another sub. But also make sure you're [ __ ] getting everything Nick on our way together. You know what I mean? Yeah. Like rocks, um metal, murdering people. It doesn't",
            "start": 4376.64
        },
        {
            "text": "sucking that do too close to another sub. But also make sure you're [ __ ] getting everything Nick on our way together. You know what I mean? Yeah. Like rocks, um metal, murdering people. It doesn't matter. Wait, can you all invite me to your place now and see if I can join so I don't have to make my sub thief without You should though. Yeah. Make your sub feed so you learn it. Yeah. Yeah. Make the sub feed. But like I But can I do it in your world? Wherever you're at? Uh I mean we're all in the same world actually. He's I invite him and see if we can get in here. All right. What's he just build this [ __ ] later? Uh all right. So press Y, Andy. Go to social. Social. I want you to go to search player F. Type in snowike mic. I see you. Yep. Now give me an invite. for an invite. Got nothing from you. All right. What's your name? You got nothing from me? No. It's similar to Nick how he didn't see anything. Oh, no. No. How about Oh, it says player is already in a party. Can you only be in",
            "start": 4421.12
        },
        {
            "text": "from you. All right. What's your name? You got nothing from me? No. It's similar to Nick how he didn't see anything. Oh, no. No. How about Oh, it says player is already in a party. Can you only be in a party with two people? No, we have I I can have up to one, two, three, four, five. Invite me to your guild. Yeah, Mike. What's your guild name? Why won't you invite us to your [ __ ] name? So, there's no bike. Miketh watch game. invite to. Oh man, Andy, look how look how good this looks. It looks like tin foil. Oh, it does. That's Ted, how do you add your friends? Why Why do I not say, buddy, on my friends here? All right. Um, give me your name, Andy. It's Andy. What? You could search nitro rifle with the pound sign. Nitro, all one word. Yeah. One F, right? Yeah, that was pound. What? 47412. 47412. I added you as a friend. Okay. Do you want to join the party? Somebody and I just sent you that. Boom. You're in. All right. But we can't be friends though, which is weird. No. Well, I sent",
            "start": 4477.6
        },
        {
            "text": "47412. I added you as a friend. Okay. Do you want to join the party? Somebody and I just sent you that. Boom. You're in. All right. But we can't be friends though, which is weird. No. Well, I sent you a friend request. We'll see what happens. Who knows? You're in the We're literally going to Andy, Nick. We are coming to you, Andy. So, just build there. That's where we're coming to. Okay, sick. That's our goal. Oh, I saw the friend invite. I just saw it. Do you see him, Nick, in the middle of us? You pull out your Yeah, I see him. God damn it. I was standing in the sun the whole time while doing that. God damn it. Oh, that's bad. Andy, you guys all tired and [ __ ] He's going to be roasted. I got to drink some water. I need water. Bad. Suck on some dude, bro. I got to find a dude. Why do I suck on some dude just on the ground? You got to find those plants. You got to find the plants, dude. They put up little tinfoil things to hide themselves. I'm a gunslinger, bro. Oh [ __ ] that",
            "start": 4520.8
        },
        {
            "text": "do I suck on some dude just on the ground? You got to find those plants. You got to find the plants, dude. They put up little tinfoil things to hide themselves. I'm a gunslinger, bro. Oh [ __ ] that person just healed. Wow, that was pretty lit, dude. I went into a guy's cave and he was hiding the corner for me. That's cool, dude. This is Oh, I'm going to suck your blood. Watch this. I just extinguished Jade or someone. Oh my. What do they do with the blood? You drink it. Oh, you drink people's blood. Yeah, you get the water out of it. Oh, that's nasty. Oh, you got to research blood purifier. So, they take the blood, they purify it. I built my sub thief. This video game. All right. Research blood purifier now, Mike. Construct foundations. Boom. And then constructor interact with blood purifier in your base. Oh, not in my base. Yeah, in the [ __ ] face, dude. Oh, I got to go [ __ ] make another base, Nick. You got to make another base. We got to make a blood purifier inside of your",
            "start": 4563.92
        },
        {
            "text": "purifier in your base. Oh, not in my base. Yeah, in the [ __ ] face, dude. Oh, I got to go [ __ ] make another base, Nick. You got to make another base. We got to make a blood purifier inside of your base, bro. Oh, you got to come back to me then. I'm not going to you for that. We're going to Andy. Okay, we'll go to Andy. Let's make We're going to Andy. We're building bases at Andy to make it easy. All right, that's where we're going. What am I researching? So hopefully on our way to Andy, you are collecting a bunch of stuff and Oh, I think I see one of y'all. No, I'm so far away from you. No way. Yeah. Yeah. I just see a rando out there. Oh [ __ ] Arachus. A very lonely world. Well, dude, I just [ __ ] murdered two people and I feel bad about it, but I want their blood. Place. Let's see. Place and hold projection. Oh, that was sick. Fill projection. Oh, that's cool. Fill loot. Take all. Cool. I kind of like the uh I think I'm max loaded. I kind of like the metal uh grinder over just",
            "start": 4623.2
        },
        {
            "text": "Place and hold projection. Oh, that was sick. Fill projection. Oh, that's cool. Fill loot. Take all. Cool. I kind of like the uh I think I'm max loaded. I kind of like the metal uh grinder over just like a pickaxe. I kind of like the vibe here. Quick scan little hold and shoot that. I like this. Nice harvesting tool. Chuck in my walls. Oh, this is cool. I got to make a door. I love survival games, dude. All right, Mike. So, we're still going to Andy, correct? I am literally Yeah. Our goal is to get to Andy and we have to build our own bases back at Andy now so we can all three be together. Swap tool mode. But I'm going to suck up so much blood by the time Dude, I'm full up, man. My You are going to be blown. Oh [ __ ] I'm 3,000 out of 3,000. You're right, bro. Good thing you got the double bags. I do have Good thing you double bagged it. You're not wrong. How do I change the wall, Mike? Like, let's say I put up a wall and I'm like, I want to make a door. Right click on it. So, right",
            "start": 4678.0
        },
        {
            "text": "bags. I do have Good thing you double bagged it. You're not wrong. How do I change the wall, Mike? Like, let's say I put up a wall and I'm like, I want to make a door. Right click on it. So, right click. So, my backpack is full, dude. [ __ ] If you I think it's right click and it'll go. See, it says build on the right side. It'll scroll down. Maybe it's not that anymore. Let me Oh, man. I have to make it just run further inside to claim land. What does that mean? Oh, yeah. There you're on it. So, right click and then right click again. It'll it'll bring that down. See, now it's move. Do it again. Now it's repair. Now it's demolish. So you can just demolish. Oh, I got to demolish. Yeah, just demolish it and put up a different thing. Sick, Chad. I have to make And then Oh, I put the [ __ ] door out here. It was like through the wall. That's cool though, cuz it'll trick people. You can go underneath. Yeah, got him. Secret entrance. Research blood purifier. Yeah, give me a blood purifier.",
            "start": 4752.32
        },
        {
            "text": "out here. It was like through the wall. That's cool though, cuz it'll trick people. You can go underneath. Yeah, got him. Secret entrance. Research blood purifier. Yeah, give me a blood purifier. Oh, dude. I'm just going to go straight across the desert. Timothy would never do that. Timothy. Timothy would never. He would be wa He's watching the stream right now being like, \"That's insane.\" Oh my god. I didn't have water. Surrender to the desert. Oh [ __ ] Did you really surrender to the desert? I'm going to my house. Whoops. Shooting's cool in the game. Oh no. This shooting feels good. Yeah, shooting doesn't feel bad at all. I'm going to exangate this little dark gun is pretty cool. I think I Oh my god, it's the desert mouse. Why would you spawn me where bad guys are? I was Where's your Where's your spawner? Where'd you put your spawner? That's where it's going to spawn you. So far away. I don't even know where my house is. Oh man. You can eat the You can drink the blood, Mike. You",
            "start": 4794.24
        },
        {
            "text": "Where's your spawner? Where'd you put your spawner? That's where it's going to spawn you. So far away. I don't even know where my house is. Oh man. You can eat the You can drink the blood, Mike. You can drink the blood. Are you Oh my god. Mike, I drank the blood. Is that worm coming after me? No, surely not. [ __ ] Might be. [ __ ] [ __ ] [ __ ] [ __ ] [ __ ] Oh my good god. Oh, [ __ ] You're not killing me. I'm the desert mouse. [ __ ] you. Where's my house? I don't know where my house is. Please leave me alone. Dang. I need little basketball. Damn, dude. I see something sick off in the distance, Nick. Yeah. What do you got? I see a whole [ __ ] outpost, dude. A big camp. It's not a baby camp. It's a big I'm putting a marker on it. I'm never going to forget that one. Damn. I wish I remembered where I was building my house at. Damn. This is the type of [ __ ] that Greg might get behind. Mike I mean Greg would actually Yeah, Greg. Greg might like this kind of game to be honest. I think",
            "start": 4851.76
        },
        {
            "text": "where I was building my house at. Damn. This is the type of [ __ ] that Greg might get behind. Mike I mean Greg would actually Yeah, Greg. Greg might like this kind of game to be honest. I think I'm I'm still trying to make my way to you guys, but I don't know how to help you. Just aim for three. Remember, we're going for three now. You and I. I'm on the way. He's right in the middle. I found my death. I found Yeah, Nick, you're getting closer, but you're still way too close to your camp. Like, you haven't moved at all. No, I really haven't. Thank you, Cooper. Thank you, Cooper. I mean, I' I've moved halfway across the desert. You've come You've really done a lot of the heavy lifting. I'm sorry. I'm sorry, Mike. I got I really I got lost in a bunch of caves that I found. I just killed like 30 people and drank their blood. So, I'm coming to you now, Mikey. Okay, I'm on the move. And I got Are we going to beat the final night rain boss tonight, dude? I'm available, bro. I'm I'm beating",
            "start": 4927.92
        },
        {
            "text": "30 people and drank their blood. So, I'm coming to you now, Mikey. Okay, I'm on the move. And I got Are we going to beat the final night rain boss tonight, dude? I'm available, bro. I'm I'm beating I'm beating a lot of games, bro. You should see me in Mario Kart right now. Only motion controls with the wheel. I'm getting three star gold trophies on every single Grand Prix. It's been a blast. Do you have the camera? Uh, no, dude. I I used it here though, Andy. We should definitely You have the camera? Oh, we should. There should be content out of that. How many people can you add in the game chat though is the question, cuz you'd like to have 24 cameras going. I don't know if the game chat allows that because you can only see the cameras of people in your game chats. Oh, which is kind of bolognal stuff. But but then we could but then we could set up a group for everybody else to join. That is cool. We just wouldn't be able to see their groups, their camps. I don't want to see their",
            "start": 4966.0
        },
        {
            "text": "bolognal stuff. But but then we could but then we could set up a group for everybody else to join. That is cool. We just wouldn't be able to see their groups, their camps. I don't want to see their camps. I don't want to see Well, I want I mean like you, me, blessing, Greg, Nick, like that kind of fun stream. I made it ceilings. I am 200 meters away from Andy Cortez. Oh, let's go. All right, I'm coming to you guys. I can't carry any more [ __ ] Yeah, either can I, Nick. Yeah, I'm maxed out. I'm just like I keep killing people and I just can't. The right thing is to save all this cuz you and I have to rebuild. So yeah, just bring stay maxed out then bring your way is right. I'm coming to you on the real. I rented a private server that only has me in it. If y'all end up playing this on your own time, want to join? Let me know. Oh [ __ ] we got to look up private servers and what that's going to be interesting. You good, bro? You all right there, buddy? I was just burping. I I got this",
            "start": 5007.28
        },
        {
            "text": "own time, want to join? Let me know. Oh [ __ ] we got to look up private servers and what that's going to be interesting. You good, bro? You all right there, buddy? I was just burping. I I got this uh I got this boba lemonade tea from Starbucks today, Nick. Not good. Oh, no. Shouldn't have done that. All right, I've made it to Andy's home. Let me take a look at my boy Nick. Oh, Nick, you're crossing the desert, man. You're there. I'm the shyude, dude. I'm the mib. I'm the sand mouse constructed to a shelter location. It's in a shelter location, bro. You can just drink blood. It's okay. That's cool. All right, I have to craft now because I've moved my life. Oh, good. It's dark. Oh, no. Run. I like how resource abundant this area is, though. How do I I got to build a new one of those uh the fuel cell things. It's Oh, construction kits. No, no. I have to build like a new starter home. Nick, go to your six and just construct, dude. Uh, go to the six or whatever your whatever that",
            "start": 5052.08
        },
        {
            "text": "uh the fuel cell things. It's Oh, construction kits. No, no. I have to build like a new starter home. Nick, go to your six and just construct, dude. Uh, go to the six or whatever your whatever that construct the the No, that's my blood exper. I'm just running through people's bases like Ferris. Oh, you're right, Nick. Yeah, there it is. Yeah, you can build that. Is it allowing you to do that, Nick? No, they're shooting at me. Oh, I have to kill them. Yeah, you have to kill them. Cuz I walked into a lot of houses. They were all locked. Oh, you're talking about player bases. Nick's talking about uh just people out there in the desert. There we go. constructor interact. Oh, I just queued her ass up. Yeah, there's always a FYI, there's always a shooty guy and a knifey guy. It seems to be that way. I don't know why, but that just seems to be the thing. Shooty guy and a knifey guy. I see Andy outside of his base. Look, get him out of chat. I see his ass. Where am I? You're right there in",
            "start": 5105.84
        },
        {
            "text": "way. I don't know why, but that just seems to be the thing. Shooty guy and a knifey guy. I see Andy outside of his base. Look, get him out of chat. I see his ass. Where am I? You're right there in front of your door. Go out to your door. Yeah, I see. I'm over here on the old building now. Yeah. Uh, it was telling me to construct or interact with the small storage container. I don't know how to I went to research. You just have to build one and it's under research or is it No, it's under favorites. You already have it done. Oh, just on the build. So, it's it's not something I got to like look to make. No, you already got it. Yeah. Yeah. Gotcha. Oh, railing, railing, gate, ladder. Dude, that is sick. Your little quick move. Don't forget to use that thing. That thing is like a lifesaver. Just kneeing someone in the solar plexus. Solar plexus. Yeah. What's that? [ __ ] torso. Oh. Ah, there's a small storage container. Yeah. Well, I put it at a really ugly angle. I don't feel good about",
            "start": 5153.6
        },
        {
            "text": "kneeing someone in the solar plexus. Solar plexus. Yeah. What's that? [ __ ] torso. Oh. Ah, there's a small storage container. Yeah. Well, I put it at a really ugly angle. I don't feel good about it. Oh, I didn't even put it down. Stupid. There's like a crack sand bike kit. That's cool. You dude, we can make sandbikes in this. [ __ ] yeah. Mike, you didn't tell me about that. Oh, yeah. Sandbikes. I forgot about that. Yeah, I'm very excited to see like when we finally start some [ __ ] up. I'm still coming towards you guys. Good. I'm building now, Nick. So, no. Yeah. Good. Yeah. Build me something pretty. Yeah, build something cool, Nick. Fuel power generator. Cool. Ah, uneven ground. Go freak yourself. Build a thing. Build like a platform for it. You got to put a floor in. Well, I know I do have a floor, but I'm in like I'm in a Oh, you're in like a cave. Yeah. Yeah. Pretty stupid of me. Enough. Critically injured. [ __ ] me. I need water. How do I find this [ __ ] Yeah. Go find some",
            "start": 5209.76
        },
        {
            "text": "do have a floor, but I'm in like I'm in a Oh, you're in like a cave. Yeah. Yeah. Pretty stupid of me. Enough. Critically injured. [ __ ] me. I need water. How do I find this [ __ ] Yeah. Go find some plants. Are those the colorful blue ones? Yes. Oh man, I'm so [ __ ] Yeah, you got once you got to progress just a little bit more so you can get those blood bags start murdering people. Yeah, dude. I am I am the terror of Arachus. I am They're going to be saying [ __ ] about me. Like not do limit reach, but how so? You can only drink so much dew. You can only drink like a third of the little crap. You gota get the blood back. You can only lick so much dew off the plants to get you sustained. All right, Mike. How [ __ ] far am I from you guys? Oh, I'm I'm there. I'm here. Mike, are you here? I'm here. [ __ ] yeah, dude. Where's your cool? So, like, look at me and Andy. Come to me and Andy. Uh, you're Andy's I think this is Andy's base. That's my base right there. That's your base. And",
            "start": 5273.84
        },
        {
            "text": "I'm here. [ __ ] yeah, dude. Where's your cool? So, like, look at me and Andy. Come to me and Andy. Uh, you're Andy's I think this is Andy's base. That's my base right there. That's your base. And then look and his is one hill over. So, like keep going past mine. Yeah. Look at that. We share. Keep going past mine. You'll see. I needed milk the other day. Mike dropped by. You got access, dude. Mike, is that you? Yeah, I'm right here, bro. Bro. Oh, Nick, what up, bro? My dude. Like, this cool move out of you. Ready? Watch out. Show me. Show me. Show the cool move. Oh my god, Nick. That's [ __ ] crazy. Look at my move. Ready for this? See me scream? No. You just kind of a little black smoke came from your face like you were vaping. Yeah, I'm talking to people, bro. I can't communicate. Let's interact, dude. So, like Oh, wait. Wait. Come here. Come here. Oh, yeah. What do you got? Oh, yeah. F to interact. Oh, that's cool. What is it? Inspect. Inspect. already in a party. Trade private",
            "start": 5326.56
        },
        {
            "text": "interact, dude. So, like Oh, wait. Wait. Come here. Come here. Oh, yeah. What do you got? Oh, yeah. F to interact. Oh, that's cool. What is it? Inspect. Inspect. already in a party. Trade private message. Okay, cool. I got I got to build my house now. So, I guess I'll just build it next to yours. Uh yeah, put it in between you, me, and Andy is right. Oh, that sounds fine. Yeah, let's do that. Okay. What if I want to move something that I place down? I'm like, I don't I didn't want that. Yes. Bring out your tool and then right click uh twice. So, like see on the right hand side, move, demolish, repair. Uhhuh. So go to get on to move and then Yeah. Well, you haven't built that yet. Yeah. So, like how do I It's It's just hologram. Okay. Demolish. Yeah, that was a call. Thank you. Place sub thief console first. Okay. So, we're going to place this. Get this stupid ass thing out of here, dude. Get the sub thief out of here, man. Oh man, I'm just I don't need this right now. I really don't.",
            "start": 5364.72
        },
        {
            "text": "console first. Okay. So, we're going to place this. Get this stupid ass thing out of here, dude. Get the sub thief out of here, man. Oh man, I'm just I don't need this right now. I really don't. Yeah, but you you secretly want it. You know what I mean? That's the answer is you want one. You [ __ ] love this [ __ ] man. God dang it. You don't need it, though. But you do need it. I love it. Nobody's ever happy about getting the new survival craft again. Yeah, when it just hooks a time suck, man. It's such a time suck. I don't have I don't have the space for this, but I'll take it. I don't have the space for this, but I'll take it. I can't rock wall. That's so fun. I'm already going double decker. Yeah, me too. I'm already going double. How do you All right. This is outer face. How do I like You got to go around. Rotate. I don't know. I have that eyes. Go outside. Uh rotate. It's uh L L alt. Left alt and uh the spinning wheel. Take a look at your right hand side. Um yeah, there you go.",
            "start": 5410.32
        },
        {
            "text": "You got to go around. Rotate. I don't know. I have that eyes. Go outside. Uh rotate. It's uh L L alt. Left alt and uh the spinning wheel. Take a look at your right hand side. Um yeah, there you go. See how See how height left alt. Oh, sick. That's cool. is cool. All right. Cool. Cool. Cool. I got to get a blood purifier. I've already lost the plot of the video game cuz now all I'm doing is just [ __ ] building. I've just lost the plot. Yeah, I'm going to die of starvation. You know what I mean? [ __ ] like keep coming back. What did that lady want us to do in the beginning of the game? Find the [ __ ] Furman or whatever. Yeah, you [ __ ] wish. The Ferman. I'm busy. I got some dope [ __ ] going right now. You're not going to believe how sick this [ __ ] is. I got Dude, I got [ __ ] Oh, I'm getting a cut scene about like don't build on open sand. All right, pick that up. That's what it said. But we all did. We did list over like Florida. Oh, Mike's double-decker. I told you, bro. I'm",
            "start": 5485.6
        },
        {
            "text": "getting a cut scene about like don't build on open sand. All right, pick that up. That's what it said. But we all did. We did list over like Florida. Oh, Mike's double-decker. I told you, bro. I'm already I'm already getting up. And Nick, you're so right. All the resources just keep respawning, bro. They're great. That's lit. Yeah, we don't have Remember Icarus, we had to go miles out to go get [ __ ] again. So roofs are the same as just floors, right? No, they have two separate ones. They have a rooftop and a floor if you're going double deck. But I want to go back uh right next to it. Yeah. Yeah, it says floor and rooftop. So yeah, make sure you're reading that. Missions are managed by sub something or others. Okay. I don't know what the [ __ ] that means, but I do want to go up. Where are the stairs? Oh, inclines. She's making incline, Mike, or what? Yeah, I made a staircase. Oh, you can uh you can make a staircase, but you can also adjust the height of your foundations. So, I made",
            "start": 5585.12
        },
        {
            "text": "the stairs? Oh, inclines. She's making incline, Mike, or what? Yeah, I made a staircase. Oh, you can uh you can make a staircase, but you can also adjust the height of your foundations. So, I made my foundation very high cuz I do like going a staircase up to the doorway. Let me see what you're doing here. Let me see what you're messing with here. Oh, Mike, that's so cool. Pretty cool, right? So, like yeah, use a when you're in the build, make sure you have make sure you're looking at the right side, that bottom right of adjusting, rotating, all that jazz. Oh, that's my building. Oh, [ __ ] How did you Okay. Oh, I see what Mike did here. Yeah. Yeah, dude. Mike just likes to get in his duffing. I'm already deep in it. I've lost. Wow, Mike, that's so cool. See this? Yeah. And I'm putting windows on the whole top side so I can see everywhere. 360 view. I can't come in. Shut you up. Mike, open your door. Let me have your door. Oh, guys, I'm climbing. Mike, check this out. Andy, how do we",
            "start": 5643.12
        },
        {
            "text": "on the whole top side so I can see everywhere. 360 view. I can't come in. Shut you up. Mike, open your door. Let me have your door. Oh, guys, I'm climbing. Mike, check this out. Andy, how do we Oh [ __ ] How does How do we Oh my god. He's in my [ __ ] He's in your building. He's in my building. I climbed your building. I don't know if you'll be able to get out. I'm out. Oh, thank god I got the door open for you. That's awesome. Yeah, that is like this out. Watch. Ready? We're in a party. Oh, you're climbing climbing, Nick. That's [ __ ] sick, bro. Oh, I didn't know you would go and [ __ ] link on him like that, dude. Damn. Oh [ __ ] It's already 2:00, yo. Can you believe that? Time's flying in this game. Just time, chat. We'll be right back. We're going to run an ad for our sponsors for the week. And of course, we'll be back with more Dune Awakening. This episode's brought to you by XRE. Y'all know that a few months ago, my life changed forever when I brought a pair of XRE1 AR glasses",
            "start": 5682.56
        },
        {
            "text": "week. And of course, we'll be back with more Dune Awakening. This episode's brought to you by XRE. Y'all know that a few months ago, my life changed forever when I brought a pair of XRE1 AR glasses on a long flight to New York. I legit could not believe how easy it is to use and high quality my experience was playing games, watching movies, TV shows on the plane without just too much extra stuff around me or especially not a giant goofy headset around my head. No joke, this is my favorite new tech product in years and it has earned a permanent spot in my travel bag. It is only hard to believe that it works as well as I'm saying until you try XR1 AR glasses for yourself and then you will see that the future is now. The tech is here. Connect XR1 glasses to wherever you are playing. Whether it's a handheld console, a PC, phone, home console, you just get a massive 150in virtual screen anywhere, anytime for any game. Gaming on the go like a long haul flight, you need the XR1. Next,",
            "start": 5730.24
        },
        {
            "text": "it's a handheld console, a PC, phone, home console, you just get a massive 150in virtual screen anywhere, anytime for any game. Gaming on the go like a long haul flight, you need the XR1. Next, starting to hurt from staring down at your handheld, we've all been there. You need an XR1. A screen as big as your wall. Instant plugandplay with all of your devices via USBC. Built-in audio with sound by Bose. Anchoring your screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full HD. These are what make XR1 a musthave. And we hear XR1 Pro is coming soon with an even bigger virtual screen. Hit our link below to get your XR glasses today. There's nothing better than when a sponsor of Kind of funny is something that we are legitimately obsessed with, and that is exactly the case here with XRE. You're going to hear me talk about these forever. Go to kind offunny.com/xreal. That's kind offunny.com/xreal l. I promise you, you are going to love these things. This episode's",
            "start": 5778.64
        },
        {
            "text": "case here with XRE. You're going to hear me talk about these forever. Go to kind offunny.com/xreal. That's kind offunny.com/xreal l. I promise you, you are going to love these things. This episode's brought to you by Factor. Summer GameFest is here. The Switch 2 is here. The sun is here. So many summer things are here. And the number one thing you don't want to be doing all summer, spending hours cooking inside. That's where Factor comes in. Factor chef crafted dietitionian approved meals are ready in just 2 minutes. Taking the hassle out of eating well. We love Factor here at Kind of Funny. And Greg's often making and enjoying meals quick in between shows here in the studio. I just had a roasted garlic chicken and I'm telling you, you would have loved it. Factory meals arrive fresh and ready to eat. Perfect for any active lifestyle over summer and beyond. With 45 weekly menu options, you can pick gourmet meals that fit your summer gains and goals. Choose from options like calorie",
            "start": 5830.24
        },
        {
            "text": "ready to eat. Perfect for any active lifestyle over summer and beyond. With 45 weekly menu options, you can pick gourmet meals that fit your summer gains and goals. Choose from options like calorie smart, protein plus, keto, and more. Get started at factormeals.com/kindfunny5050 off and use code kind of funny 50 off to get 50% off plus free shipping on your first box. That's kind of funny 50 off at factormeals.com/kindafoney5050 off for 50% off plus free shipping. factomeals.com/kindfunn 50 off. Welcome back everyone. I'm drinking blood and I'm in a cut scene. I'm seeing it. Mike, did you make the purifier yet? I did. I did. How do you make it? Uh, you'll see it if you go into your build menu. It's a couple tabs over. It will have a light on it. The trials of Oh, maybe I don't Maybe I haven't crafted one yet. Hold on. Let me craft. Yeah, you probably just learned the schematic for it. Oh, it's not on my crafting. Find the fman. Uh, go to your bathroom. Yeah. So, I'm here. Night path.",
            "start": 5872.32
        },
        {
            "text": "crafted one yet. Hold on. Let me craft. Yeah, you probably just learned the schematic for it. Oh, it's not on my crafting. Find the fman. Uh, go to your bathroom. Yeah. So, I'm here. Night path. You already have it. Go to your build. Uh, seven steps. And so for me, I would No, no, you're in uh You got to go back once. Get out of there. Follow the uncertain. Oh, I destroyed the sub thief, you idiot. Now go to your building. True death. Oh, I'm in the spice, too. Oh, you're already in it. Yeah. Yeah, you got it, Nick. You did it. You did it. Yeah. Oh, [ __ ] We're going places. How come I'm dark now, Mike? Oh, dude. You're going to go through a whole thing. You just drank the blood. You drank the blood of another. That's where you realize like, oh, things are different for me. You have experienced a spice dream. On awakening, you are protected from harm for a short time. Move to continue your journey. Spice dream, bro. Follow. Follow your inner sight for the first trial. Trial, Mike, we",
            "start": 5927.04
        },
        {
            "text": "a spice dream. On awakening, you are protected from harm for a short time. Move to continue your journey. Spice dream, bro. Follow. Follow your inner sight for the first trial. Trial, Mike, we got to Let's go do the trial, bro. They don't even understand us, dude. They don't get us. I have 430 [ __ ] darts, dude. I'm going to blast on somebody. Connect to a structure. Everybody look at my look at my building since we're watching my stream. Look at what I've crafted, y'all. Two stories. You can see Nick's base and Andy's base right there. The boys are back. Inner sight. Your inner sight has revealed the path. Follow it to the first trial. The inner sight marker will help you find. Oh [ __ ] Oh, I see where I messed up. Okay, now I got to drink blood though. I got the blood purifier. I got to drink some blood first, too. Dude, hit eight, man. Drink it. Put in your little bag. Oh, see you've already built the blood purifier. That's why, Nick. I don't think I have. I think you can just",
            "start": 5976.0
        },
        {
            "text": "to drink some blood first, too. Dude, hit eight, man. Drink it. Put in your little bag. Oh, see you've already built the blood purifier. That's why, Nick. I don't think I have. I think you can just drink the blood from your bag. Oh, see, I don't have an eight. You have If you pur purify it, it makes water, which probably fills Oh, I'm drinking. Oh, dude. I just drank out of just straight up out of the blood. Yeah, you just took a [ __ ] Oh, see, you're taking the blood sack, Nick, and you're drinking the unpurified blood. You got to go home, deposit the blood, and then [ __ ] get it get it good. I don't I'm excited. What I want to know is how to build a floor that Oh, these little rounded floor pieces. Oh, look at you. Yeah. Yeah, that's fun. Give me a [ __ ] rock of some sort. I can see Nick out in the distance. Yeah, they're behind now cuz look at him run. [Music] Cool. It's annoying that you can only suck the you can only suck the juice for your last third from the plants. You",
            "start": 6042.56
        },
        {
            "text": "see Nick out in the distance. Yeah, they're behind now cuz look at him run. [Music] Cool. It's annoying that you can only suck the you can only suck the juice for your last third from the plants. You can't get water from anything else. That kind of sucks. Yeah. I wish I could fill up your [ __ ] We in the juice. Why have you made my life worse, Nick, with just like your polyorisms? You love it, dude. You love it. We're all You get to Superman Returns and you hear someone go SuperSman. Oh god. You're going to love it, dude. Um, okay. I am good. Nick, I'll wait for you. We'll probably wait for Andy as well, but like I'm ready to start my my inner sight, bro. Do you have that as well, Nick? Uh, yes. Just follow your inner side to the first trial. Let me finish building my house just in case we get Well, we're waiting on Andy as well. Let me find my inner side. I feel like I feel like at some point the sandstorm is going to hit. Okay, I'm going to abandon my first base, just so you know.",
            "start": 6085.44
        },
        {
            "text": "we get Well, we're waiting on Andy as well. Let me find my inner side. I feel like I feel like at some point the sandstorm is going to hit. Okay, I'm going to abandon my first base, just so you know. That's crazy to do. That's where you built a home. Can you do that? Yeah, I held X on. I just abandoned. Do you go out? Do you do that on your um on your map? Yeah, on your map you hover over it and then you hold X to abandon base. Okay. Wait. Okay. Does it give me the [ __ ] stuff back? I'm also going to craft a uh respawn beacon in my base just so in case I die. You're saying a lot of good [ __ ] right here like that. I'm really thinking about what the [ __ ] you and I have gone through. We've been through this before. I'm not [ __ ] around. This is not our first rodeo, right? We Bill the Bear [ __ ] We've all remember that. The annihilation that was that that alligator that had his face to the wall at one time, too. God, it was so much fun. Okay, craft the blood extractor. Be blood",
            "start": 6144.96
        },
        {
            "text": "Bear [ __ ] We've all remember that. The annihilation that was that that alligator that had his face to the wall at one time, too. God, it was so much fun. Okay, craft the blood extractor. Be blood extractor blood extractor. Yep. I just put my respawn beacon at home. That's great. There's so many houses around us right now, guys. This is turning into a nice little neighborhood. Yeah, this is uh this is what it looks like. Hopefully when we go to the second area and beyond. People are in the chat said we're gonna abandon this base when we go to the second area. But [ __ ] when we keep moving forward, you know. Well, that's why I made a small house. This is my like summer house. I hate the floor sticking out there. How do I get rid of that? I don't like it. Oh, dude. That's ugly. Oh, it's kind of It's kind of like art deco, though. It's kind of like freaky. I kind of like I'm with I'm with myself. It's ugly. He doesn't like it. I disagree. Where is this [ __ ] purifier? I don't have it.",
            "start": 6195.84
        },
        {
            "text": "of It's kind of like art deco, though. It's kind of like freaky. I kind of like I'm with I'm with myself. It's ugly. He doesn't like it. I disagree. Where is this [ __ ] purifier? I don't have it. Mike, let me take a look. So, Nick, like uh for me, when I press five, which is my build button, I have favorites. Utilities, fabricators, refiners. See, I don't have utilities yet. You have just favorites. I have favorites. Structural walls, wedges, roofs. You have to It's in your It's not in that menu. It's in uh your B on. Yeah. Press B. Oh, it's B. Oh, wait. Let's see. It's in like crafting. Yeah. Yeah. So, crafting. I don't have the ability to craft that purify. You have to research first. I did. I did. It's here. He has it. So, this is the blood purifier, right? B. Get out of this really quick. All right. Hold up. All right. No. So, back to six. Your crafting tool. Six. Or your building tool. Right. Get over change set. Press R. Uh, press R again. No. Oh, okay. Oh, press R. Give me Z",
            "start": 6241.76
        },
        {
            "text": "quick. All right. Hold up. All right. No. So, back to six. Your crafting tool. Six. Or your building tool. Right. Get over change set. Press R. Uh, press R again. No. Oh, okay. Oh, press R. Give me Z through C. Those buttons up there. Oh, Z. Z and C. Oh, there you go. So, go to go to this one that you had. Okay. And then refineries. There you go. Now you're in. Just three dudes working it out together, chat. You know what I mean? That's what it takes. Just three friends getting do awakening and just working together, figuring it out. Press R to extend the menu. They're saying, \"Guess what? That's what we just did. That's what we did, Chad. All right, I got the blood refinery down. So, now I got to stuff the blood in there. Yeah, put the blood in there to purify it. And then uh you'll be able to get that purified blood. Like, good. Good. Okay. Use Okay. So, that's sick. And you can deposit it. Oh, and then you're going to get water out of it. So, I need a water sack, though. I don't I",
            "start": 6291.92
        },
        {
            "text": "to get that purified blood. Like, good. Good. Okay. Use Okay. So, that's sick. And you can deposit it. Oh, and then you're going to get water out of it. So, I need a water sack, though. I don't I haven't unlocked a water bag yet, though. Soon we're going to get the Oh my god. We're going to get the soup, bro. We're going to get that suit. Whoa, I'm powered up, guys. Yeah. See, I don't have water bags. I guess blood bags can hold water. I think blood bags just hold water bags, dude, but I could be wrong. Yeah. All right. Follow your inner sight to the first trial. How do I see my inner sight? Oh, there it is on the map. 227 m away. Purple. We have to make sure Nick and Andy have that as well. Oh. Oh, go to [ __ ] hell. Oh, they're all here. What do you got, Nick? You good? Uh, yeah. I'm just going to I'm just going to quickly build the rest of my house. All right. Build that up and then we'll go follow the Or at least I want to know where your trial is. Yeah. I want to know where your",
            "start": 6349.6
        },
        {
            "text": "going to I'm just going to quickly build the rest of my house. All right. Build that up and then we'll go follow the Or at least I want to know where your trial is. Yeah. I want to know where your trial is. I want to know. I want you to show. And Andy, what mission are you on? Uh uh like taking blood. Okay, Chad, is the find your trial a single person thing? Should I go on without them? I guess I guess Nick, press your map really quick. Where is your trial? Okay. Uh, my trial. It looks like I'm Take that off. How do we God? Damn it. Uh, checkpoint respawn beac. I got to put a respawn beacon down. Oh, your trial is exactly where mine is, so we can do it together. Okay, let's go do it together. [ __ ] it. All right, cool. It's a solo thing, Krux says. Okay, it's a solo thing as well. So, I guess do it at your own pace then. Oh, I see. But like, yeah, me and Nick's trial are the exact same area cuz we're now in the shared area. I guess I need a respawn beacon here, though. Huh? I need to",
            "start": 6418.16
        },
        {
            "text": "do it at your own pace then. Oh, I see. But like, yeah, me and Nick's trial are the exact same area cuz we're now in the shared area. I guess I need a respawn beacon here, though. Huh? I need to not put my building tool next to all of my other [ __ ] Well, it's interesting cuz you skip over your building tool when you do the scroll wheel. It skips over my building tool and it skips over my blood. Yeah, because it's for combat. Yeah, but like I I'm hitting the eight button to get to this thing and it's hitting the building tool cuz I'm hitting the wrong button. How do you make the respawn beacon again? Do you guys remember how to do that? Uh, it's in your It's in the crafting. You got to craft it. It's an item. Chad, I haven't shown you enough of this, but [ __ ] watch this, Tomb Raider. Why wouldn't it just give you all your [ __ ] What do you mean? Like, I want just give me all of the stuff on one menu, right? Well, there's a there's a there's a crafting there's like a crafting you",
            "start": 6472.4
        },
        {
            "text": "Why wouldn't it just give you all your [ __ ] What do you mean? Like, I want just give me all of the stuff on one menu, right? Well, there's a there's a there's a crafting there's like a crafting you got to craft and then there's a learning one, right? You got to learn stuff, too. Yeah. I just don't know where this [ __ ] beacon is. Uh, hit the hit tab and then go to like crafting up there. Mhm. Oh, you got to craft the beacon. Okay. Okay. Yeah, you're right. Research the blood purifier. You got it. I'm going in. Go in, Mike. Goodbye, boys. I'm going through my first sight trial. Enter the ancient cave. Nick, hit me with the song. Perfect. Deposit blood in blood purifier. Do I have to do that at home? Yes. I got you. Damn, bro. This [ __ ] is [ __ ] They did detailed this cave up. People who have been praying to the [ __ ] sandworm have definitely been drawn in here. God damn it. Interact with the altar. Where's my stupid house? There it is. Walk mode on for more cinematic gameplay.",
            "start": 6517.6
        },
        {
            "text": "who have been praying to the [ __ ] sandworm have definitely been drawn in here. God damn it. Interact with the altar. Where's my stupid house? There it is. Walk mode on for more cinematic gameplay. Oh, they got their own walk button. That's always nice. No, no, that Yeah, I just made me walk all of a sudden. Oh, inhale the [ __ ] spice, y'all. You're about to become a Fman, dude. Let's see. Structural. Okay, Mike, I'm coming to you. Yep. Go do your trial. I'm going to go do the trial of Nick. So, do I have to fill my little bag with water? No, we have to get cups for water, they say. [ __ ] Christ. You're not there yet. Some blood. Okay. Right. So, now I got to go on my trial, right? Is it hard, Mike? I'm in an alternate dimension, Nick. I'm high on the spice. So glad. This is me on a Sunday afternoon. It's so fun. Shoomed out. Who is it that thinks even The weight of a kindly god is a fearful thing. Do you understand why this is the worst part of the video game? Very on rails. Yeah,",
            "start": 6604.88
        },
        {
            "text": "afternoon. It's so fun. Shoomed out. Who is it that thinks even The weight of a kindly god is a fearful thing. Do you understand why this is the worst part of the video game? Very on rails. Yeah, that is what I expected out of the the trial of situation here. This is the this we're going to give you a story inside the survival game. Yes. I'm fine with it. You wish. Oh, I was using the wrong wall piece. That's cool. Oh, I'm going into the cave, Mike. I'm going into the [ __ ] cave. In the cave, bro. Nick, you're you're [ __ ] getting it today, bro. You're getting after it. We suffered. Absolutely correct. Suffering was in our cavern. came to know within our souls. Arachus is suffering. When we found it, we were home. Oh, that's so sweet. Little stealth section here. Okay, I see you. I see you. I've entered the ancient cave. Mike, I'm going to go I'm going to I'm going to drink the spice essence right now. Inhale the spice. Look at him just go. They deny the forive. There's a 20%",
            "start": 6697.04
        },
        {
            "text": "I see you. I've entered the ancient cave. Mike, I'm going to go I'm going to I'm going to drink the spice essence right now. Inhale the spice. Look at him just go. They deny the forive. There's a 20% possibility, Mike, that you me and I play this game for the next 51 minutes and Andy is still working on his amazing. He's connected with it, which is the positive. I keep on seeing the notification that I got to build my blood thing. Oh yeah, that's right. I was doing that. I think if I feel like you and I might be playing this tomorrow, Nick, you know what I mean? We might be we might be shifting gears real quick. Oh, I like this game a lot. We might say, you know what, Mike doesn't teach Nick how to play Magic. We play this cuz it definitely deserves a day two. We're probably going to need a little more time on this thing. Oh, the spice. I'd like to, Mike. I think that'd be fun. All right. Well, I'm I'm thinking maybe we invite someone. Maybe we invite Chris Anka. I don't know if Chris",
            "start": 6804.4
        },
        {
            "text": "a little more time on this thing. Oh, the spice. I'd like to, Mike. I think that'd be fun. All right. Well, I'm I'm thinking maybe we invite someone. Maybe we invite Chris Anka. I don't know if Chris is playing this. I know. Man, Kevin, maybe Washi. I don't know where Chris is at right now. Chris is in a interesting spot. You know, he's becoming a lord of Marvel rivals. God is I don't know where he's at yet. Did not God give us the burning sun to defy? Suffering leads to defiance. And where does my damn blood purify? All right. Yeah, it's hard to find. Mike, when's the last time you played Marvel Rivals? Oh, a long time ago. Long, long time. Where am I going? Oh, yeah. This way. Even defiance leads to thought. Who is it that takes those who suffer? Remember defiance leads to thought. Who is it that thinks? Those who suffer. Remember Harmon bea Dave Kim writes in the chat. See Nick, you're not always stuck with Amazon basics of video games. That is very true, guys. That [ __ ] was so",
            "start": 6856.56
        },
        {
            "text": "is it that thinks? Those who suffer. Remember Harmon bea Dave Kim writes in the chat. See Nick, you're not always stuck with Amazon basics of video games. That is very true, guys. That [ __ ] was so funny as bro. Uh Nick complained about me making him play Mind's Eye. Oh, yesterday he goes, \"Andy gets to play this plays this, you play that. I got to play this. Mike Biffl even watched our stream. What was that? Yeah, he tweet he he blue skyed us. I was like, I cannot believe he watched that [ __ ] trailer, dude. I saw them tweet out watching some streamers uh play our game today. Who should we watch next? I'm like, oh man, that can't be great to like be in a room. That's got to be hard. Yeah, be in a room with all the rest of the devs. Like, who should we watch on the big screen in their office? Like, uh, all right. I'm having trouble with this. What are you trying to do, big dog? Let me see. Deposit blood into the blood purifier. You don't have any blood. Do you have one now? You got",
            "start": 6965.68
        },
        {
            "text": "Like, uh, all right. I'm having trouble with this. What are you trying to do, big dog? Let me see. Deposit blood into the blood purifier. You don't have any blood. Do you have one now? You got to go kill people. Do I have one now? It says, Well, do you have one in the building? No, you have to kill people and suck their blood with a little blood back. You have to make a blood bag. Yeah. Yeah. So, you have the blood gun, which is below it. That's a blood gun. Yeah, I've already made that. You got to murder people, suck up their blood, and then come back home to your blood purifier, put it in there. Cuz I sucked up some [ __ ] from them, but I guess I never put it. I guess I never put it anywhere. How do I Let's see. My game freaked the [ __ ] out somehow. Or maybe it's just kicking me out of the [ __ ] thing. Oh yeah, you're done with your story or whatever. I'm hoping so. It's freaking out. Oh, there we go. What is What is happening in this portion of this game? Uh yeah, this is just",
            "start": 7030.48
        },
        {
            "text": "of the [ __ ] thing. Oh yeah, you're done with your story or whatever. I'm hoping so. It's freaking out. Oh, there we go. What is What is happening in this portion of this game? Uh yeah, this is just strictly a way to f to get you uh to buy into the story of like, hey, we're we're in the Dune world. We might as well give you some Dune story stuff. That's all this is ever going to be. Okay, I don't like it. As Cooper said, this will just slow your gameplay down for a moment. No matter the thought occurs, I don't know why the eye of Sauron is on me right now. Fman was slaughtered. The ones that were not abandoned their caves, leaving valuable resources behind. Valuable resources that just might contain of a steel suit. Take what you need. Their ghosts will not object. Take what you need. All right, let me run. I don't want to [ __ ] I don't need to be cinematic leaving the spice room. You know what I mean? It's like I All right. Herby says, \"No, Mike. It has a full full-on story and",
            "start": 7083.2
        },
        {
            "text": "All right, let me run. I don't want to [ __ ] I don't need to be cinematic leaving the spice room. You know what I mean? It's like I All right. Herby says, \"No, Mike. It has a full full-on story and it's quite good.\" All right. Well, you know what? I'm half in on that. Yeah, we don't need the story. Unfortunately, when I come to survival crafting games, story is definitely like the back end of what I care for. But I'll I'm going to keep it. I'm gonna keep it just in case. If it's good, I'm in cuz Grounded had a pretty fun story. So, I'll give you that. Now I go. [ __ ] rocks. Damn. I killed everybody here and they're they're just all their bodies disappeared. So, I can't No, they're in there. They're probably just buried under this [ __ ] Just get all up in there with the tool. Cuz mine went underneath the sleeping bag, but I can still get her. Yours what? The body went underneath the sand for a hot second, but I can still get her. Oh, man. There's more of this. Oh, yeah. That one's",
            "start": 7147.6
        },
        {
            "text": "went underneath the sleeping bag, but I can still get her. Yours what? The body went underneath the sand for a hot second, but I can still get her. Oh, man. There's more of this. Oh, yeah. That one's pretty long, Nick. You got to do a whole stealth section avoiding the eyeball. It's a whole Do I Where do I go now? You got to keep going. Go straight. Um I wasn't paying attention. I'll figure it out. Okay, you'll figure it out. I'll find it. Look for stairs. Well, the stairs are behind me now. Do I got to go? Oh, okay. There's a moment where you go across left and then there's like a bunch of broken stuff. You have to climb over it, go towards the eyeball, and then go right. Connecting. Okay. All right. I'm going to use drink the water. Can I drink the water? E did it. Now research a fabricator. I hope these other dudes respawned. I'm back, baby. He's [ __ ] back to life, bro. First trial of Auaga. Damn, these [ __ ] I'll tell you what, you need to build a pretty big house cuz these",
            "start": 7198.88
        },
        {
            "text": "I hope these other dudes respawned. I'm back, baby. He's [ __ ] back to life, bro. First trial of Auaga. Damn, these [ __ ] I'll tell you what, you need to build a pretty big house cuz these objects they got going on are quite large. I'm just going to build up I'm just going to do like they do in like Europe. Just build everything on the roof. Yeah, this [ __ ] fabricator is a whole floor space. Oh, it's that big. I'll build it out. So, I'll build I'll build a little patio outside. We turn fabricate a complete scavenger still suit. [ __ ] yeah, dude. We're so on this guy. We are We are in it. Oh, so I need three of the blood slots to then fill up. You can deposit him. Yeah. You can also just drink the blood and be a vampire if you want. I think that's what I accidentally did. Yeah, it's fun. Tastes kind of irony and salty. Good. Ah, I'm Damn it. I am definitely accidentally drinking it. Why can't I suck the juice out of you? Oh, there it is. Yeah, because of where the hot keys are,",
            "start": 7262.88
        },
        {
            "text": "fun. Tastes kind of irony and salty. Good. Ah, I'm Damn it. I am definitely accidentally drinking it. Why can't I suck the juice out of you? Oh, there it is. Yeah, because of where the hot keys are, I'm definitely accidentally clicking on like the con consuming the blood. Oh, yeah. If you hit eight, yeah, it'll it'll Yeah, I'm not I'm not pressing any of the one through eight keys. I'm just scrolling, thankfully. But how fun is it to rip through those little those little exterior cellophane Oh, it's great. Walls they put up for the caves and then to get in there and murder them. All right, there's another camp over here, I think. Oh [ __ ] Where's my suit? Is it in here? Yeah. How do I even edit the take the hot bar chat? Uh, you go to your inventory or your tab and you see your load out here. It's in the middle. This is all of this is your hot bars. You can see the one through eight there. Weird. Okay. Impressive offer. [ __ ] yeah. Remember, if you didn't connect the tubes between",
            "start": 7317.68
        },
        {
            "text": "here. It's in the middle. This is all of this is your hot bars. You can see the one through eight there. Weird. Okay. Impressive offer. [ __ ] yeah. Remember, if you didn't connect the tubes between the calves and the thigh pads just right, they just had a drink. Your own liquefied fizz. Cool, my friend. And that does not count as hydration, by the way. I have good news, offworlder. My leg has recovered enough that I will risk it to sandstone looked like it was coming. I know a place in your sector where we can meet. Craft a survey device so you can figure out how to get there and join me. Oh [ __ ] Nick, what's up, Mike? I can [ __ ] drink from my suit now, bro. You did. You make the steel suit? Yeah. You're a bad We got the suit, boys. We're in. All right. All right. I got to research a small ore refinery. There it is. Research. I want you to construct one or interact with one. Uh, that is I need way more fuel cells or my shit's going to not do well. Finally. L spin. Need more",
            "start": 7401.76
        },
        {
            "text": "a small ore refinery. There it is. Research. I want you to construct one or interact with one. Uh, that is I need way more fuel cells or my shit's going to not do well. Finally. L spin. Need more people to kill. Hope they respawn. Where y'all at? Close. Refined copper ore. Use refined copper ore fabrication. Nick should pee his pants and drink it for immersion. You should. Okay. Whatever you guys need. Try doing that. Whatever makes everyone happy. Fine with associate level. Oh, that's who can use it. Oops. Take. You guess you could do a trap door ceiling. That's sick. Research the surveying kit. Okay. Got it. Fabricate. Oh, in the fabricator. Oh [ __ ] And then we're going to Oh [ __ ] Sometimes our bodies fly like crazy. Surveyor probe. Yep. Did you get a probe made? Good. Oh my god. Discharge from the sandstorms makes map data extremely unreliable on Arachus. But if you can get it high enough, a handheld probe can gather enough local data to give you. I need more blood. This shit's",
            "start": 7461.92
        },
        {
            "text": "from the sandstorms makes map data extremely unreliable on Arachus. But if you can get it high enough, a handheld probe can gather enough local data to give you. I need more blood. This shit's going to be lit, Nick. This shit's going to be lit, bro. Where do I get my cool suit? Go to the fabricator. You got to build the fabricator. Okay, the I got to build the fabricator. Okay, cool. So, crafting. Now, I got to got to build the fabricator, which is going to be upstairs. Mine says, \"Climb to high ground and fire off the survey probe.\" Yeah, you got to do that. Boom, bro. Then I'm going to [ __ ] clear out the area, dude. Let's go. Finding a survey probe will fully reveal an area on the map, exposing locations, collectibles, hazards, resources, resource distribution, and topography. That's cool, bro. [ __ ] yeah. I'm about to climb to the tippy top of this [ __ ] mountain. Oh my god, I just fell so far. Climb to high ground and fire one off. I'm climb chat. Oh [ __ ] dude. How How high",
            "start": 7583.04
        },
        {
            "text": "cool, bro. [ __ ] yeah. I'm about to climb to the tippy top of this [ __ ] mountain. Oh my god, I just fell so far. Climb to high ground and fire one off. I'm climb chat. Oh [ __ ] dude. How How high should I climb? Cuz I'm willing to climb to the top of this one. I just don't know how I'm coming down. I don't know what your stamina. The issue is I don't know how I come down from something that high. Well, you can drop and like catch yourself on on the like you can drop and then catch yourself as you're grab climbing. Yeah, that's wild. I'm about to shoot one off. J, you better watch out. Could be a pearl jam. I just thought my I'm so sorry. You should be. Did you know about that, Andy? That's crazy, bro. Never heard of that. Wish I had. Sorry about that. Oh, you you didn't know about Pearl Jam. No. Oh, wow. You're like me. Yeah. Yeah. Nick taught me that. Oh [ __ ] Oh [ __ ] Do not [ __ ] around with climbing and falling. That's You do. Do not [ __ ] fall. I promise to god you're",
            "start": 7634.24
        },
        {
            "text": "Pearl Jam. No. Oh, wow. You're like me. Yeah. Yeah. Nick taught me that. Oh [ __ ] Oh [ __ ] Do not [ __ ] around with climbing and falling. That's You do. Do not [ __ ] fall. I promise to god you're going to feel it. Your knees are going to feel it, y'all. Holy [ __ ] That could have been game over so fast. It's unbelievable. All right, let's just go up to this platform instead. [ __ ] Oh damn, everybody is just [ __ ] sucking blood from everybody already. Oh my god, that's so funny, man. It's so cold in here. God damn, my hands are freezing. Well, welcome to Doing Anything with Mike. I don't feel any of it, bro. That's the worst part is I'm so far away from the AC. You don't feel it over here. That's not true at all. You don't I have two bodies blocking the AC. There's no bodies. This the temperature of this room is 48° F. It's so cool. Climb the high ground and pop off this survey. Oh [ __ ] Am I high enough, sir? I don't know. I got to put this survey launcher in. Is this high",
            "start": 7695.12
        },
        {
            "text": "the temperature of this room is 48° F. It's so cool. Climb the high ground and pop off this survey. Oh [ __ ] Am I high enough, sir? I don't know. I got to put this survey launcher in. Is this high enough? Are you going to call? Are we calling this high enough, chat? Oh, I saw you up there. It doesn't It's not It's not clicking. I'm going to shoot it off. Dude, Mike, this is sick. Not at required height for survey. Another 22 m is needed. Oh, wow. You got to keep going up. I'm going up there then. Mike, look at it. It's making my suit, dude. Yeah, bro. It's sick, dude. They make the suit is sick. How do you climb down, bro? Ain't no Oh, you got to like Oh, Jesus. Well, Jesus. They don't make climbing down easy. I'll tell you what. He will know our ways. Andy, I think you and I should become obnoxiously well adapt at both Dune and Lord of the Rings. Well, what? like like well-versed to the point where anytime anyone says anything that's even a little off, we like snarkily correct them.",
            "start": 7758.88
        },
        {
            "text": "obnoxiously well adapt at both Dune and Lord of the Rings. Well, what? like like well-versed to the point where anytime anyone says anything that's even a little off, we like snarkily correct them. Oh, about the Doom universe? Yeah. And Lord of the Rings. Oh, okay. And Superman. Oh, I see. The green dot has to show up in the center. Yeah, they didn't really think through the climbing on this. Climbing is a great idea, but like you gotta you gotta think that one all the way through. You got to get that up. Dude, I look sick in this suit. I'm all [ __ ] ass. Yeah, all ass. All uh Chuck, I have not seen Dogma in theaters since the release. I'm not like a diehard Dogma like, oh my god, it's fine. It's fun movie, but I'm not I've seen it. We need We need more people to embrace your hairstyle, Nick. or like whenever there's a receding hairstyle in the game, they make it just like really sad and desperate. But your yours is cool. You mean that current one or the one I have on my character?",
            "start": 7822.8
        },
        {
            "text": "Nick. or like whenever there's a receding hairstyle in the game, they make it just like really sad and desperate. But your yours is cool. You mean that current one or the one I have on my character? In on your character? Yeah, it's sick. Just kind of slick back. No, but they need to make it cooler. They could comb it to the side. They could do a little bit more with it. That's true. They could do a little more with it. Small work. Did it refine ore. Oh my god. Let that scan me. Let that probe work. Someone's scanning me. Let that probe do. Was that you, Mike? I'm scanning the entire [ __ ] world right now. Blinding. Stop blinding. I'm letting the Fman know. I'm going find him. I'm going find him. I don't like it. I'm going to the Griffins. Reach trade post. Oh, they want me to go to the basin south now. It's time to go to the second area. Careful. Crossing the sands. Move from rocky ground to rocky ground. Learn how far you can move on sand before the worm comes. And remember, look",
            "start": 7880.8
        },
        {
            "text": "basin south now. It's time to go to the second area. Careful. Crossing the sands. Move from rocky ground to rocky ground. Learn how far you can move on sand before the worm comes. And remember, look both ways before you cross the desert. Look both ways before you cross the desert. Look for you, Leap. Okay, Mike. I got an ore refinery. I'm pretty [ __ ] happy about this. Yeah, bro. And we've already collected ore, you and I. That blue stuff. I've collected a bunch of that ore. I didn't know what I needed it for, but I just put in my pocket. Yeah. So excited about it. Chad, get ready for Mike to somehow try to [ __ ] climb down this now. Where? What are you doing? Are you Oh, dude. Wait until you have to climb, Nick. You wait until you have to climb, bro. You're going to [ __ ] freak. Oh. Oh, a copper ingot. I'm the goat. Dude, I got copper. Okay, cool. Oh, I got to refine more more. Okay. Cool. Dude, I can't figure out this blood [ __ ] Uh, what are you looking for, buddy? Like, it's",
            "start": 7930.56
        },
        {
            "text": "Oh, a copper ingot. I'm the goat. Dude, I got copper. Okay, cool. Oh, I got to refine more more. Okay. Cool. Dude, I can't figure out this blood [ __ ] Uh, what are you looking for, buddy? Like, it's telling me to deposit blood to blood for your car. I don't have one yet. Well, hold up. Do you have blood? Yeah. This is the problem is you got to find the blood. So go go go to build. No, no. Uh pull out your build tool. Six. Okay. And now what you do is press R to expand this. Oh, these. And then go over to Z. There you go. Got him. Three dudes in a room, bro. We're going to get it. Nick, I'm gonna say something though. A minor criticism of the game. Tell Nick, I would love to hear it. I want to hear research and then a second later I hit crafting. Just let me craft a [ __ ] thing. And like why? What do you mean from research to craft? Well, it makes you research it first. Yeah. To research it to unlock it. That's the I guess. Yeah. But then just say, \"Hey, it's unlocked. Craft it.\"",
            "start": 7984.08
        },
        {
            "text": "why? What do you mean from research to craft? Well, it makes you research it first. Yeah. To research it to unlock it. That's the I guess. Yeah. But then just say, \"Hey, it's unlocked. Craft it.\" Okay. Okay. Why is there a researching menu? Yeah. Yeah. Okay. Okay. Well, because I I think it's also kind of a good reminder that like, oh, I'm able to re like it's just another if it's in front of your face, you're more fair. Okay, that's fair. That's fair. That's fair. But also, some games require a a token of inventory to even research something. Okay. Like, Icorus required like a really rare thing to research [ __ ] Uh, Nick, I'm thinking about waiting for you before I make my trek across the desert. Why don't you do that, Mike? I'm about to What do you have to I'm about to do the surveying mission. Yeah. So, you're going to do the survey mission and then I think how this is plotting right now because we have 30 minutes left on our stream. In a perfect world, you would do your survey",
            "start": 8065.44
        },
        {
            "text": "mission. Yeah. So, you're going to do the survey mission and then I think how this is plotting right now because we have 30 minutes left on our stream. In a perfect world, you would do your survey mission. You and I would make our way across the way to the trade post. Now, in an even better perfect world, Andy would catch up with us. We'd all three go across together because we'd love to play this game together. But we will uh make sure Mike and Nick are at least together here if we're going to play this tomorrow. Okay. I'm assuming you I got to go up to like Monument Valley up there, Mike. Uh you got to climb a pretty big one, Nick. Uh I climb the one behind my base. So if you're looking at my base, Nick, the rock that is right above me, climb that. Okay. Yeah. So climb this one that I'm currently standing in front of. Okay. You're on it right now. Okay. So I'm like right in front of it. Yeah. Damn, Mike, your [ __ ] looks sick. Your base looks sick, Nick. You got a sick base, bro. a",
            "start": 8115.84
        },
        {
            "text": "currently standing in front of. Okay. You're on it right now. Okay. So I'm like right in front of it. Yeah. Damn, Mike, your [ __ ] looks sick. Your base looks sick, Nick. You got a sick base, bro. a little can. Mike's got a three story though. You want to climb together, bro? Follow me. Yeah, climb with me. Come here. I'll show you I'll show you the way. Come back where you just were. I'm I'm at your house. No, no. Yeah, I'm behind you though. You pass me. Oh, [ __ ] I didn't. Right here. Hey. All right. Come with me. I'll show you the path. Oh, you're going to You're going to the Twin Towers up there? No, no, just this one. I'm just I'm taking you to where like they have uh easier like rest high enough or whatever. Yeah, we got to get rest points in just in case you fall. Honestly, really good tutorialization. This has been the easiest to digest game of any of this. I'm so glad. Oh, my guy fell. I'm so glad I didn't have Mike or Nick pressure me into doing the non-recommended one.",
            "start": 8156.8
        },
        {
            "text": "good tutorialization. This has been the easiest to digest game of any of this. I'm so glad. Oh, my guy fell. I'm so glad I didn't have Mike or Nick pressure me into doing the non-recommended one. Oh, yeah. No, we were full to go advance. [ __ ] it. We know it. Oh, there was a second where Mike wanted to for sure. Uh, make sure to get your stam me up and then get to the top. We didn't stam me up. Stam me all the way up, Nick. I got to stand me up. Yeah, stam me all the way up. We are halfing it. I think you're like climbing on me, so get off. Get the [ __ ] off. [ __ ] off, Mike. Give me some space. Maybe my stamina is just better than your stamina. Me and Nick were inside of each other on this. Where do I got to fire this [ __ ] thing? Then to the higher point. The highest point. To the right of you. So like pull it out, Nick, and try to shoot it up in the air. It's going to say, \"Hey, you need five more meters.\" Oh, okay. So, like, do you see this rock over here? Yeah. I got Pride",
            "start": 8195.6
        },
        {
            "text": "right of you. So like pull it out, Nick, and try to shoot it up in the air. It's going to say, \"Hey, you need five more meters.\" Oh, okay. So, like, do you see this rock over here? Yeah. I got Pride Rock. Okay. Yeah. Yeah. We're going to climb up on top of Pride Rock. Thank you. Thank you. Thank you. I've done that out. You know how sometimes we carry [ __ ] out into the real world with us? It's not good. Thank you. He's selling Rizzler merch now on the Tik Tok. I'm like, I don't know if I can make this. Yeah, you can. You just got to make a big jump. My stammy looks like [ __ ] Oh, this is dangerous. I'm going to die. Oh, I made it, Mike. All right. Up here. And then [ __ ] shooting that thing. Play the song. Hit the song. Play the sing. [ __ ] yeah. God, this is cool. Did I do it, Mike? Yeah. You're doing it. Then we got to wait 23 seconds. Sick, dude. While you scan the whole basin. Ah, it's flashing at me. Don't jump off. That's fine. Oh my god. It's fine, dude. Well, I think you",
            "start": 8244.08
        },
        {
            "text": "Yeah. You're doing it. Then we got to wait 23 seconds. Sick, dude. While you scan the whole basin. Ah, it's flashing at me. Don't jump off. That's fine. Oh my god. It's fine, dude. Well, I think you have to like stay close to it. I don't know the mechanics of this. Oh, really? Cuz like do you notice how it says like probe near you on your screen? Like I don't know if you get out of range if it just stops. I think you're right. Okay. So that's why I kind I'm good. Uh Nick, follow me. Oh, Mike, you're insane. Are you going back down that way? We're going this way. We got to go this way. There's got to be a better way to No. No. This is the safest. I promise you. No way, dude. Follow me. Follow me. No [ __ ] way. Follow me, bro. All right, dude. I trust him. All right. Trust your friend. Your friend Mike. Listen to your friend Billy Zane. Just like Aladdin. Do you trust me? Are you here? Hold on. I'm I'm bandaging up. It's not that I don't trust you, Mike. It's just that Yeah. bandage",
            "start": 8290.08
        },
        {
            "text": "friend Mike. Listen to your friend Billy Zane. Just like Aladdin. Do you trust me? Are you here? Hold on. I'm I'm bandaging up. It's not that I don't trust you, Mike. It's just that Yeah. bandage up. Get yourself up, bro. Get yourself up. Okay, there. All right. And then see, I'm going to fall on this blue rock here. Yeah. Boom. And then done. I fell all the way. I fell all the way down. I'm fine. But I fell really hard. That's fine. Let's go back home. Let's reset and then we'll make our way to the the outpost. My ankle was sprained. It fell all the way. Damn, Mike, you're taking all the cool [ __ ] [ __ ] yeah, bro. I'm first up. First up, you're such a selfish. [ __ ] you, Mike. All right, go do your thing. We'll we'll meet together and we'll go in a second. I'm just going to build some storage [ __ ] for my guy for my [ __ ] I don't think I don't need the other clothing, right? Can I just break that down? Uh, I don't know what happens with the other clothes. Yeah, I think you can",
            "start": 8327.84
        },
        {
            "text": "storage [ __ ] for my guy for my [ __ ] I don't think I don't need the other clothing, right? Can I just break that down? Uh, I don't know what happens with the other clothes. Yeah, I think you can just break it down if you know the button. I got drop item, equip customize. Yeah, I don't have anything else there. No, you can't break it down. What's customized with you? Oh, you can change the color of it. That's sick. And you can add a cape, Nick. And you you can add a full-on cape, bro. I have to have the cape, dude. Damn. Okay, I see you. I didn't know we were going full superhero mode on him. It's a pre-order bonus that I somehow purchased for us. What the [ __ ] here? It probably knows your habits and it already bought it for you. It knows your buying habits. Oh my gosh. Oh man, that's sick. Do I need the stupid probe anymore? It'd be cool if I didn't. Uh, keep the probe gun with you. I need way more fuel cells or my house is just going to run out of Well, I mean, we're going to",
            "start": 8377.6
        },
        {
            "text": "sick. Do I need the stupid probe anymore? It'd be cool if I didn't. Uh, keep the probe gun with you. I need way more fuel cells or my house is just going to run out of Well, I mean, we're going to dip here in a second. We'll go get more as we go. Need copper. It was a great time where the whole world was into Dune though. It's a couple of weeks. It's true. Memes are great. Social media is awesome. travel to the Okay, so Mike, I'm ready to rock. Are you ready? But I don't Do we have some sort of thing I can get water from? Uh, you should have your suit if you press F. I think it said it when you built your suit. But I also don't have any water. I drank all of mine. So, okay. Or maybe I didn't. Oh, and my water purifier. Drink your water purifier. I did that. But then does it where How does it do your suit? Oh, your suit. The F fills up. That's cool. I see that bar fills up on F. Drink from uh your pockets. Oh, okay. You see that? The secondary bar on the water bar. That's lit. Okay.",
            "start": 8436.88
        },
        {
            "text": "it do your suit? Oh, your suit. The F fills up. That's cool. I see that bar fills up on F. Drink from uh your pockets. Oh, okay. You see that? The secondary bar on the water bar. That's lit. Okay. Oh, you need a lot of blood to fill that up. And I don't. Yeah. Let's go kill some I need a lot of blood to do what? What? To fill to have a lot of water. Oh, yeah. You need a [ __ ] You know what I mean? Yeah. I'm going to go kill some people. No. No. Hold. Are we going across? Well, no. I mean, you call the ball. Do you want to? I think a good ending point is either we go across or we end it like here. And you can just kill people while we wait around. Yeah, that's what I was going to do. All right, then we'll just kill people and wait around. That gives Andy a chance to catch up. Oh, that's cool. chat says uh or uh Nolan Mass says uh chat Xbox is sending out Gears of War reloaded codes for free if you own Ultimate Edition. Check your Xbox messages. That's neat. Yeah, I think they're",
            "start": 8534.16
        },
        {
            "text": "cool. chat says uh or uh Nolan Mass says uh chat Xbox is sending out Gears of War reloaded codes for free if you own Ultimate Edition. Check your Xbox messages. That's neat. Yeah, I think they're having a beta this weekend or something, so that's probably what it is. Yeah, it's a full game, says Nolan. Yeah. Oh, wow. They're giving you the game. That's crazy. I didn't know they were giving away the game for free. That's wild. Jelly Penguin, thanks for subscribing for 6 months. Coley D, 23 months of support. Says ran to a dude that recognized my night rival shirt at Disney World over the weekend. Small world. Pretty cool. Hell yeah. Dol, thank you. Stonewall Craft 17 months says, \"Why is everybody keep building [ __ ] in front of Mike's house?\" That's a good one. I'm [ __ ] Dude, I am grabbing gear, Nick. Make sure you're getting that material, bro. Oh, I'm matted up, dude. I'm just having a great time. Just out here exploring. I'm just proving once and for all violence doesn't solve",
            "start": 8573.68
        },
        {
            "text": "gear, Nick. Make sure you're getting that material, bro. Oh, I'm matted up, dude. I'm just having a great time. Just out here exploring. I'm just proving once and for all violence doesn't solve anything, man. Just I'm a hunter gatherer. Yeah. I'm Well, I'm going to take your blood, so like I'm here to steal blood right now. Oh, you're a killer. Okay, cuz I need it. We got to We got to get our water. Yeah, I got to find some people to kill some to kill for the blood. That's for sure. That's for real. Unspent skill points. Oh, I got skill points. [ __ ] you. Stell Blade about to unlock on PC. Goon and June, dude. Brian McBryan because of the Stellerblade demo that's been out my let's play entitled or titled Stellar Blade but without clothes. That video's just been getting a bunch of views. People are looking for it. They want it. Is Andy jealous of Mike being a champ in Mario Kart World more than you could ever imagine? Have you been playing at all? No. Oh, really? Not for you? I I I",
            "start": 8640.56
        },
        {
            "text": "People are looking for it. They want it. Is Andy jealous of Mike being a champ in Mario Kart World more than you could ever imagine? Have you been playing at all? No. Oh, really? Not for you? I I I own it. I've did like one Grand Prix and it's just I'll play with friends and stuff, but it's not it's not my thing. Okay. We've had a couple of great community nights uh playing it. It's been a lot of fun. So, yeah, you should if you're just sitting around, you should turn that on and play with your stream. You'll love it. Knockout modes are a ton of fun. You feel sated sick. Ah, well, I'm hydrating. You got to hydrate, dude. Yes. Kill these [ __ ] Damn, dude. Where the Nick? Why are we not together, bro? I'm just hunting, man. I'm going into this big part. Like, come to me cuz I'm going into this big [ __ ] outpost. Let's do this together. All right, hold on. I'm I got to kill some people. You're 300 meters away. You've gone the opposite direction than me as always. No, it's on me. You",
            "start": 8697.84
        },
        {
            "text": "this big [ __ ] outpost. Let's do this together. All right, hold on. I'm I got to kill some people. You're 300 meters away. You've gone the opposite direction than me as always. No, it's on me. You always don't say as always. We just We come out the door. You You take a left, I take a right. That's just how we do it all the time. Pretty much. No, I mean Mike, you cannot [ __ ] talk [ __ ] about him doing that. I am. I'm just letting him know. You were the one least equipped to make that argument. Also, and I said, \"Mike, hang out. Wait for me.\" You said, \"I'm out first. I got to get the mats.\" No, that was Babe. That was before this. Ooh, discovered keyhole rock. I got little locations. That's cool. Oh, it's an enemy encampment. Oh [ __ ] Oh, what the [ __ ] Sims cutter. What is that? I need another blood bag. Yeah, totally need another blood bag. Neck is right. We need like five blood bags. So we Yeah, you you want to probably have a lot of blood bags if we're being real. What Sims",
            "start": 8759.04
        },
        {
            "text": "need another blood bag. Yeah, totally need another blood bag. Neck is right. We need like five blood bags. So we Yeah, you you want to probably have a lot of blood bags if we're being real. What Sims cutter is that different than my cutter. It's cool. I got my reinfor shielded NPCs. Oh [ __ ] Better mine till they say. Oh, [ __ ] [ __ ] dude. This is crazy, dude. I needed you, man. Oh my god, dude. It's a Oh my god, bro. Oh, she [ __ ] stabbed me to death, Nick. Save me. Get the [ __ ] over here. Save me. I need to run for my life. Oh my god. It's real, dude. This lady is not going to let me be your ass. I got to fight. I got to fight her. I got to swear up. Parried. [ __ ] you, lady. Oh, you're dead. Got her. I'm like that. He's like that [ __ ] I'm going to suck your blood. I'm going to suck your blood and I'm going to go back home, turn it into water. I'm getting four blood bags in my pocket. Can you use armor you're not using and break it down in any way? I've dropped them all. I",
            "start": 8811.6
        },
        {
            "text": "suck your blood and I'm going to go back home, turn it into water. I'm getting four blood bags in my pocket. Can you use armor you're not using and break it down in any way? I've dropped them all. I don't I haven't There's no There's no breakdown button. So, I've literally just dropped it at this point. And I said, \"Fuck, thank you for that subscription.\" A [ __ ] chat. We doing it. We're doing it so hard. We're doing each other. Mike, the Sims counter is a blueprint item. Blueprints can be crafted once per each blueprint find, but you can find them more than once. Oh, that's cool. I'm glad that I found that. That was sick. That's like a full-on enemy outpost. That's fun. I got fuel cells to put in my cool fuel cell thing. Quick deposit those. I'm going to fill up my blood bag here. Okay. I'm going to try to get different blood. I think I have another blood bag somewhere in here. Yeah, dude. I recommend getting a Yeah, get the blood out. A couple blood bags. So, I'm just going to",
            "start": 8888.96
        },
        {
            "text": "I'm going to try to get different blood. I think I have another blood bag somewhere in here. Yeah, dude. I recommend getting a Yeah, get the blood out. A couple blood bags. So, I'm just going to blood bag it up and swap them out. There we go. Cuz that way I can just be up in there. Yeah, I love I mean, you can only have probably two blood bags worth of water at any time. You think? How much is the full-on purified blood actually giving you? It gives you like 3/4 probably if it's full. You think so? Okay. Yeah, that's what I I got I got three blood bags on me. I'm going to go back to that camp. Let's see how much I can get is right. Like I'm doing something wrong cuz I feel like I break these things down. It doesn't give me anything. No. Oh, I mean you could still pick some [ __ ] up by by ease. Sometimes there's like other remnants that Oh, yeah. Okay. chill there. Mike, where's this camp? Is this with like the little safety light that you just [ __ ] these people up? Um, if you look",
            "start": 8938.32
        },
        {
            "text": "ease. Sometimes there's like other remnants that Oh, yeah. Okay. chill there. Mike, where's this camp? Is this with like the little safety light that you just [ __ ] these people up? Um, if you look at your mini map, uh, scavenger scavenger camp to the to the east. Oh, yeah. Is that where you were? Yeah, that that, uh, gold marker. You're like close. You're 100 meters behind me. Yeah. Come to me. We'll go do it together. Okay. I'll stand at the gateway to it. Let me find you. Oh, we got a couple scavenger cans. Uh, you're you're I'm one. You're two. Okay. I'm kind of coming to you. I think we're going toward the right thing. Yeah. You see? What the [ __ ] Why does that lady have a cape? That's me, bro. I told you you put the cape on. [ __ ] cape. So, go to inventory. Look at how [ __ ] cool he is. Hover over your gear and press U to customize. Nick, you can even put colors on it. Where do you hover over your gear to press U? Yep. Pretty sick, huh? [ __ ] play the song, though. Oh my",
            "start": 8978.72
        },
        {
            "text": "he is. Hover over your gear and press U to customize. Nick, you can even put colors on it. Where do you hover over your gear to press U? Yep. Pretty sick, huh? [ __ ] play the song, though. Oh my god, dude. I want to be the the [ __ ] That's so cool. Ain't no Sodak car going to c spot me up here, brother. Oh [ __ ] I'm low on stamina. Oh no, this is such a farfall. Let me just heal up real quick. I don't know if I'm doing the right thing. Mike, what are you talking about? Oh, I have all sorts of cool garments. Yeah. So, hover over your gear in your character. Press U to customize. And so, there you can click on different variants. There's swatches of colors. So, like click on the variant to put your mask on. Right. And then down below on the D or just click button, you can go from your chest, your gloves, your boots, your helmet. Okay. But it didn't stick for some reason. Double click it. Oh, yes. Yes. Yes, Nick. Yes, Nick. Yes. Put it on, Nick. The last suit we're ever going to need",
            "start": 9026.56
        },
        {
            "text": "your gloves, your boots, your helmet. Okay. But it didn't stick for some reason. Double click it. Oh, yes. Yes. Yes, Nick. Yes, Nick. Yes. Put it on, Nick. The last suit we're ever going to need to wear. Oh, you're so [ __ ] cool looking, bro. It's ridiculous. Oh my god, I am [ __ ] cool looking. I'm [ __ ] death, Mike. Yeah, dude. Come on. We look sick. All right, so we have See, notice the scavenger camp has the three triangles. So, we have one in front of us and then one to our right side. Let's go to the Oh, [ __ ] They're killing guys. Oh my god. Back the [ __ ] up. I hear you all shooting over there. Shoot that guy. Shoot that guy. All right, take his blood. I'll take this one. Sounds good. You blood that one. I blood this I like to go right into the crotch with the blood. I love that. See this right here, Andy? See what I'm doing here? Blood of our enemies. Yeah, that's right where the good stuff blood is. I might need to craft more. Hold on. Let me craft more darts. I'm",
            "start": 9092.0
        },
        {
            "text": "that. See this right here, Andy? See what I'm doing here? Blood of our enemies. Yeah, that's right where the good stuff blood is. I might need to craft more. Hold on. Let me craft more darts. I'm worried that my darts I have 497. I get this blood bags. Yeah, I'm filling up all mine. I got three blood bags and they're just filling them up. Smart, dude. Autofill. Let's go. All right, let's do it. So, you see this giant camp, Nick? Yeah. Scavenger camp. Let's go kill everyone inside. Yeah, let's go. Oh, let my headphones in so I can feel this. So, I can feel every kill. You're so smart for making that many bags, Mike. That Well, that was you, Nick. You're the one who was bringing it up, bro. I could do I could probably make more now, huh? You can literally craft them in your hands right now if you wanted to. Nick, it's pop off time. This shit's crazy. These guys are going Oh my god, Nick. Where are you, Mike? Wait, Nick is [ __ ] popping off. Co. Oh my god, Nick. There's one more kid",
            "start": 9148.32
        },
        {
            "text": "if you wanted to. Nick, it's pop off time. This shit's crazy. These guys are going Oh my god, Nick. Where are you, Mike? Wait, Nick is [ __ ] popping off. Co. Oh my god, Nick. There's one more kid shooting me. Dude, you're in it, Mike. Find him. I'm finding him. He's hurting me. They're lighting the lanterns for me. Let's go. Where did you go? Are you upstairs? Where are you? Oh, that's you. That's you. No, that's not you. Shoot him, D. Shoot that [ __ ] right now. I just got ass. Okay, I I'm going to exangate him. Let's take their blood. He's flying down at me. His body's dead. Take their blood. Take their blood. Oh my god. Blood taken. Mike. Mike. Oh [ __ ] Nick, help me. He's going to He's going to murder me. He's got Mike. He's got a thing. We got to slow play him. Yeah, we got to slow play his ass. Oh [ __ ] I stabbed you and you stabbed me. One more behind you, Nick. Coming up the stairs now. It's me. Oh [ __ ] It's Andy. Oh my god, bro. Andy, if you're trying to [ __ ] die, I",
            "start": 9191.28
        },
        {
            "text": "play his ass. Oh [ __ ] I stabbed you and you stabbed me. One more behind you, Nick. Coming up the stairs now. It's me. Oh [ __ ] It's Andy. Oh my god, bro. Andy, if you're trying to [ __ ] die, I know. Holy [ __ ] This [ __ ] Get that. Get that blood. Get that blood. Get that blood. Oh, they're out here. I got to craft some [ __ ] meds, bro. I'm getting shot to death, bro. I'm getting shot and stabbed left and right. Welcome to the camper. I heard them. Where they yell? We all picked the sickest outfit ever. Yeah. Downstairs. Oh, look at this. Pick up. What is that? Obtained intel. Oh [ __ ] [ __ ] you. Oh [ __ ] I'm dead. Help me. Where are the Oh my god, they're shooting me. Oh, this lady trying to really She's trying to double tap me. [ __ ] you. Oh my god. Why are there pop really [ __ ] Is that Andy? I I I I killed two people up top. You got to put on the suit like us. You got You got to get in the suit. You do not look like us. You scared me. The still suit? Yeah. You got the",
            "start": 9241.84
        },
        {
            "text": "Is that Andy? I I I I killed two people up top. You got to put on the suit like us. You got You got to get in the suit. You do not look like us. You scared me. The still suit? Yeah. You got the still suit on? Yeah. Yeah. Nick. Yeah. Unfortunate news, bro. Bro, what's that? I can't suck the blood past the first three blood bag. Oh, really? Yeah. So, like I have three blood bags on me, but only one blood one blood bag will then you just ride with us and then so I fill my blood bags and then we're How many blood bags you got on you? Let's see. I got I took the blood I got one and a half full. Oh, you have one full I have a full one and then I've got a full three. No, no. Yeah, full three bars in one bag. And then the next bag you're filling I'm filling the bag. Yeah. Oh, Andy just stole my blood then. I'm just about Andy. I did. I'm just going to blame Andy on stealing a blood then from me. Dude, I walked right up. Just while you were talking. Yeah. Okay, I think we're good though. I",
            "start": 9303.6
        },
        {
            "text": "blood then. I'm just about Andy. I did. I'm just going to blame Andy on stealing a blood then from me. Dude, I walked right up. Just while you were talking. Yeah. Okay, I think we're good though. I mean, I can I'm fine with it. So, there's another camp. Who the [ __ ] is that? Was Nick. Oh my god, dude. Thought that might be a minor. There's another dead body here, Mike. If you want to take No, no. Suck suck it up. Suck it up. Where's I already have the the full uh There's another camp dead ahead of us to the south southwest. What's that thing? Look at the Look at that. Look at that. Look off in the off like eastern. Oh, dude. What the [ __ ] is that thing? Pull out your B. Pull out your binos. Oh yeah, it's got to be a heart. Bino it. That's sick. That is cool, dude. Look at the moon and [ __ ] We're the ponytail gang. All right, let's go. Let's go to that next one. Let's go to the next camp. Did we already [ __ ] up this little camp right here? Yeah, there's nobody else to the",
            "start": 9351.52
        },
        {
            "text": "and [ __ ] We're the ponytail gang. All right, let's go. Let's go to that next one. Let's go to the next camp. Did we already [ __ ] up this little camp right here? Yeah, there's nobody else to the right. Yeah, there's one guy right there. Oh, I'm skipping like Come to me. Oh, to the right. Come to me. East. Yeah, I'm on you. Oh my god, it's a bike. Did you get the bike, Mike? Mike, there's so many people here. Mike, Nick, I'm coming. [ __ ] you with the bike. I'm coming, Nick. Hold strong. Oh [ __ ] Nick, kill that guy. Nick, we're good. Thanks, Mike. Let him suck up his blood. Nick, there's noises. Uh, dude, I need that. Andy. Andy, get away from the worm. I'm looking for Griffins. There it is. We're living on the edge. Are you ready for Griffin's research trade post? Uh, yeah. Should we end the stream with us going over there? Yeah. I mean, water, but we could we could try to get there. I mean, I'm sure we can find some water before we go. We just eat blood. Yeah, we can suck",
            "start": 9396.56
        },
        {
            "text": "we end the stream with us going over there? Yeah. I mean, water, but we could we could try to get there. I mean, I'm sure we can find some water before we go. We just eat blood. Yeah, we can suck blood. All right, you guys ready? We're going to We're going Griffins. Okay, I'm right behind you, Mike. I've uh set uh Yeah. How do you set a ping? I thought I could ping. Oh, right click. Boom. My way point. Oh, there's a crash. Norththeast. It's all the way across the desert, boys. What we should do now, cuz we're It's night time. I'm going. All right. Well, my game's fighting me. Andy, are you on us? Uh, I'm going to be on you. I like how they're like, \"We're just going to give you a bunch of darts. We don't You don't want to be Oh, dude. We have to cross all of this. Holy [ __ ] Are you I'm currently going rock to rock right now. Well, if we hurry, we can just run. But the sun comes up, we're dead. Why does the worm sleep? No, but the sun I'm talking more about the sun. Oh, I thought I",
            "start": 9448.08
        },
        {
            "text": "currently going rock to rock right now. Well, if we hurry, we can just run. But the sun comes up, we're dead. Why does the worm sleep? No, but the sun I'm talking more about the sun. Oh, I thought I think it's the worm that Oh, no. Yeah, we got to go. We got to go rock. So, we can either go rock to rock and I'm running [ __ ] running. Oh, somebody's with me. It's Nick. Come on. Come on. Come on. Where's Andy? We should see Andy on the desert. I I'm headed towards I'm I'm closer to it. No way. We would see you. I'm literally looking. I see you all on the map, but like I'm headed towards it. I'm closer to it. No way. Yeah. Yeah. How many meters are you away from the trading post? 720. We're 460. Wait. Wait. Where are you? Yeah. Yeah. You're not going towards that. You're 700. You're going the opposite direction now. Mike Griffin's research point is here. Mike, you're going the wrong way. Oh [ __ ] I'm going to the Oh no, Mike. Nick, you [ __ ] [ __ ] idiot. Go the wrong way. It looks",
            "start": 9497.92
        },
        {
            "text": "the opposite direction now. Mike Griffin's research point is here. Mike, you're going the wrong way. Oh [ __ ] I'm going to the Oh no, Mike. Nick, you [ __ ] [ __ ] idiot. Go the wrong way. It looks crazy. Holy [ __ ] I'm going to die, Mike. Oh my god. We should have followed Andy. You're insane, Mike. Pick it on the map, Andy. On the map. I only ping for yourself. I can't pink for you. It's coming for me. Pike's coming for me. Where the Where were you running? [ __ ] Andy. [ __ ] you. We were running there. It's a trading post. But this is Griffin. Why did you say something? We've been quiet all day. I was supposed to help us. Don't put this on the leader. This [ __ ] play. We're ending the stream right now. Thank you for tuning in. This is Dude Awakening with the Jabron Boys. Have a great goddamn [Music]",
            "start": 9550.64
        }
    ]
}