{
    "id": 14260,
    "video_id": "sGQ67eon-WE",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Andy Cortez",
        "Blessing Adeoye Jr."
    ],
    "title": "Donkey Kong Bananza Nintendo Direct Reactions - Kinda Funny Gamescast",
    "description": "Go to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\n\nTime Stamps:\n00:00:00 - Donkey Kong Bananza Direct Live Reactions\n00:21:30 - Post-Show Start\n00:22:10 - Housekeeping\n00:25:20 - Donkey Kong Bananza Direct Thoughts\n00:47:01 - SuperChats\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1750271347,
    "duration": 4510,
    "transcript_chunks": [
        {
            "text": "What's up and welcome back to another kind of funny live reaction. This time to the Nintendo Direct for June 18th, 2025. All about Donkey Kong Bonanza. Of course, I'm your host Tim Gettys. I'm joined by Blessing Addie Jr. Good day, Tim. Greg Miller. Let's monkey around. And Andy Cortez. Are we going to see Stanky Kong? Stanky Kong. The longlost forgotten Kong. We can only hope. Greg, who what songs we seeing in this? Uh, Donkey. Okay. Of the main variety. Yeah. You'll see Diddy, of course. I know there's a lot of course. Of course. Of course. I There's been a lot of chatter from y'all chatterheads about, \"Hey, where is he? What's going on?\" Then we saw the redesign on the site. All right. They want to be redesigning to put him on the site. Going to be in this [ __ ] game. All right. Then, do you get Cranky? Yes, you you definitely get Cranky. We saw Cranky in the preview we played. But I'm just saying, is he going to show up today? I have a feeling he will. Okay. Yeah. Maybe it's like",
            "start": 4.24
        },
        {
            "text": "do you get Cranky? Yes, you you definitely get Cranky. We saw Cranky in the preview we played. But I'm just saying, is he going to show up today? I have a feeling he will. Okay. Yeah. Maybe it's like James Gun where they hit him. You know what I mean? They maybe you saw Cranky, but that's actually Diddy. Wow. Super. Very different sizes, but what's the Kulio Kong? What's which one's that one? Funky. I was thinking the word Culio as well. Kio Kong is your mind. Holy [ __ ] dude. Funk. We still got to figure out where Funky Kong was on January 6. Funky. Yeah. Okay, man. Donkey Kong 64. Let's not forget Lanky. Lanky was at home chilling. like he was watching the news like the rest of us being like, \"Oh god, that's not good.\" I see. I I I'm team Dixie over team tiny. You know what I mean? So, I'm hoping we get my girl back. Um but I just The more Kongs the better. The more Kongs, the marrier. I agree, but I don't know if Nintendo agrees. I feel like I feel like having more Kongs is such a",
            "start": 48.64
        },
        {
            "text": "I'm hoping we get my girl back. Um but I just The more Kongs the better. The more Kongs, the marrier. I agree, but I don't know if Nintendo agrees. I feel like I feel like having more Kongs is such a rare thing. I feel And not rares in the studio. Not even like a rare like that. I feel like Nintendo likes to keep it to just Donkey and sometimes Diddy. No, I mean I think it's the Tropical Freeze crew, right? It's Donkey, Cranky, Diddy, and Dixie. And Funky, right? And Funky. Yeah. Okay. Funky. That's a good chunk. That's a good handful. Yeah. Not Chunky Kong, though. Not Chunky Kong. No, not 64. That's fat shaming. That's why they won't let him back. He's on Zenic now. Skinny Kong. Um, all right everybody. Let's get into this director. I think it's like 15 minutes or so. We're going to react to that and then we're going to get into the kind of funny games cast breaking down everything that we see. Um, let's get into it. Not the clap. What are you doing? It's our baby girl. I'm [ __ ]",
            "start": 96.0
        },
        {
            "text": "to that and then we're going to get into the kind of funny games cast breaking down everything that we see. Um, let's get into it. Not the clap. What are you doing? It's our baby girl. I'm [ __ ] right. Oh yes. Oh man, look at this ugly [ __ ] I can't wait to be friends with him. [Music] I'm glad that there's a vocal theme. This is awesome. I'm glad Pauline's thing is singing. Yep. After Odyssey, she has to. She has to. This is her or is she a singer or is she a mirror? She's both. Jump up superstar. Arnold Schwarzenegger was in Terminator. Yeah. So, you're saying that she's the Arnold of the Donkey Kong universe? Evil. Show me what you got. Small like orange. [ __ ] dies. [ __ ] She was the rock all along. Golden bananas. The discovery of the century made right here on Ingot Isle. Hell yeah. This is excellent news for number one banana fan Donkey Kong. This voice over. Just as he's about to enjoy the notable nanas, a sudden tempest sends him deep down underground. As his adventure",
            "start": 141.12
        },
        {
            "text": "yeah. This is excellent news for number one banana fan Donkey Kong. This voice over. Just as he's about to enjoy the notable nanas, a sudden tempest sends him deep down underground. As his adventure begins, DK teams up with Odd Rock. Odd Rock. It's no Rock at all. It's actually a talented young singer named Pauline, the future mayor. But she's actually not talented. And Pauline wants to find out a broom to surface. It's said that wish will be granted by reaching the planet core. So the unlikely duo set off on a strange subterranean adventure. That's like them King Kong movies. Yeah. The story takes place in the underground. No, but where they go underground. Remember the world's under the world. Some layers are This makes sense to the layer design we were talking about. Believe you're underground. DK can run, jump, more of a gallop, I would say. And climb through each environment using his incredible physical powers. You can freely move in any direction. Wow, that's not air dash. Oh,",
            "start": 223.12
        },
        {
            "text": "DK can run, jump, more of a gallop, I would say. And climb through each environment using his incredible physical powers. You can freely move in any direction. Wow, that's not air dash. Oh, this is about to go insane. Blow. You can smash, crash, and bash. Some good hit stop right there animation. That looks good. You can even do this to a massive rock formation. Oh my god. You know, if you want, as you barrel through obstacles in your path, you'll also collect golden bananas in this game. Bananium gems. More on those later. turns orange. Kong can do, punch, smash enemies, walls. This looks really good. Yeah, the ground and most things you can get your hands on with incredible force. Destruction can lead to discoveries. So, set off a chain reaction and see what happens. It's going to be Astrobot levels of vibration and feel rumble, too. Unleash a powerful punch directly downward. How deep you punch into the ground depends on the strength of the target. Roll forward. Roll at high speed",
            "start": 284.8
        },
        {
            "text": "levels of vibration and feel rumble, too. Unleash a powerful punch directly downward. How deep you punch into the ground depends on the strength of the target. Roll forward. Roll at high speed and send lighter objects soaring. Combine this with punches and jumps to really mix things up. Hand slap. Make some noise to collect scattered items or detect hidden objects using. You can even use your feet when your hands are occupied. Tear off. Grab a chunk of terrain and tear it off or tear up turnups to find items and even tear chunks off your foes. So why is the rock the child swing? It'll make sense when you play. Grab a chunk and swing it to attack. One more. Can be used to break stone with ease or smash. Odd Rock's wish will be to be a real girl, you know. Wow. Chunk jump. Use a chunk to double jump. That's cool. This will help you reach new heights. Oh, cuz from chunky throw. Throw a chunk. Chunk or aim at a target. Choco Mountain the name of the Mario Kart level. Throwing a boom. I",
            "start": 357.2
        },
        {
            "text": "double jump. That's cool. This will help you reach new heights. Oh, cuz from chunky throw. Throw a chunk. Chunk or aim at a target. Choco Mountain the name of the Mario Kart level. Throwing a boom. I want a Choco Mountain level. Explosive effects. Wow. It's time. It's time. If you throw chunks made of softer material, you can stick them to a surface. That's cool. Really cool. Turf surf. That's cool. This lets you ride on chunks. Yeah, there's so much Breath of the Wild in this game. Speed up and aim for smaller enemies to knock them away. Make music. The power of Pauline singing will show you the way. It can also remove these strange seals that someone left behind. Unreal Pauline. I'm definitely coming around to like why is she a rock? You never know. Like all this game play is as her as a kid. They didn't want to reveal it earlier. Yeah, but they put a whole rock mechanic. It'll make sense when you play. She wants to be a real girl. She doesn't want to be a rock no more. Well, she'll",
            "start": 422.56
        },
        {
            "text": "kid. They didn't want to reveal it earlier. Yeah, but they put a whole rock mechanic. It'll make sense when you play. She wants to be a real girl. She doesn't want to be a rock no more. Well, she'll learn that along the way that odd rock is all she needs to be. That big melon the many layers of the underdog. Oh [ __ ] Some are mysterious and I do love that this is basically a prequel to Mario. Destructive tendencies and Donkey Kong. It looks like Cranky Kong. But like Cranky Kong's olding through the layers of the world. Cranky Kong but like he's the Donkey Kong in the OG Donkey Kong. That dude's name is Rambi. But what if it just cycle the underground time and time again? Oh no. Ancient bonanza powers. Unless it's this preong war. I mean it would have to be again the cranky singing. Yeah, we need term limits. Those old guys got to get out. She can make Donkey Kong transform. Holy [ __ ] With the air of destructive power, even hard terrain poses no problem. The world and smash as much",
            "start": 479.28
        },
        {
            "text": "we need term limits. Those old guys got to get out. She can make Donkey Kong transform. Holy [ __ ] With the air of destructive power, even hard terrain poses no problem. The world and smash as much as possible with the powerful Hey man, they made it bonanza. They kicked him up a can transform into a zebra speed as he is strike. He can even breathe over water or crumbling pathways. That's the swift. That's a lot of secret bonanza. Oh yeah, he can also turn into an ostrich. A flying ostrich. Spread your wings and soar through the sky. [Music] You can use updrafts to gain more air. Unless those eggs hatch, what's it going to do? A monkey or a bird to send enemies scatter. Signs went too far. That's right. Ostrich Bonanza. Bonanza transformations don't last forever, though. A You can transform again by collecting gold to build up your banana. He goes back to his normal form. Just vomit. We're just saying words now. Banana. This is what I was talking about yesterday with the Xbox market.",
            "start": 540.0
        },
        {
            "text": "again by collecting gold to build up your banana. He goes back to his normal form. Just vomit. We're just saying words now. Banana. This is what I was talking about yesterday with the Xbox market. He had too many terms. Was it Ben bergy or banana banana? Banana banana. [Music] Standing in our hero's way is the void company. the mightiest. This is so Odyssey coded like the stupid enemies that no one cares about. Grumpy works to create. I kind of [ __ ] with the void company more than Yeah, I think these guys subterranean info gathering while Voidcom is in charge of Mojo Jojo. At least they're still calling for his like bunnies for some [ __ ] reason. Anna stealing Maelstrom on Ingot Isle and they're heading straight down to the planet core. The planet core. But but no, I'm going I'm going with DK. So you just stay away. Voidco blocked off all the routes to the lower layers so no one could reach them. Bastards. DK and his pals will come face to face with the enemies guarding these",
            "start": 609.36
        },
        {
            "text": "with DK. So you just stay away. Voidco blocked off all the routes to the lower layers so no one could reach them. Bastards. DK and his pals will come face to face with the enemies guarding these roots. So, use all the power at your disposal to take on a host of powerful foes. Those are going to be some fun boss fights, man. Yeah. By defeating them, [Music] giant sink holes will open, clearing a path to the lower layers of the underground world. How do you guys feel about pants? You know, I was thinking about that. I kind of [ __ ] with it. Want to dick out throughout the underground world. Also, donkey anatomically correct. Gems. Bernandium. More words, less words. Though sometimes they're buried in bananas, the ground and other places. There are a whole bunch of music. The remix songs are going to be so bad. You can also obtain these gems by completing challenges in the ruins found throughout your adventure. Let's do it. Great KCO. Challenges include time limited battles. This is",
            "start": 675.04
        },
        {
            "text": "are going to be so bad. You can also obtain these gems by completing challenges in the ruins found throughout your adventure. Let's do it. Great KCO. Challenges include time limited battles. This is David Weiss. Oh, you're right. This is David Weiss. Yeah. Yeah. Yeah. Courses where you'll need clever solutions. Oh, that's awesome. Very cool. Sides scrolling stages. Sick. Oh yes. Scramble blast, baby. Oh wow. Keep your eyes peeled to find the banium gems. Those look like some sticker brushes. There are plenty of Oh, you know they're playing that symphony, baby. give them a try. Oh, that's cool. It was awesome playing that song for Nick the first time. Y seemed like, oh my god. Like it needed to be a YouTube video of like 40-year-old man listens to DK, former uh band major listens to DK soundtrack. As you collectium gems, you'll gain skill points. These can be used to increase stats such as your max health or the destructive power of your punches. Power up Donkey Kong to match your play",
            "start": 735.28
        },
        {
            "text": "As you collectium gems, you'll gain skill points. These can be used to increase stats such as your max health or the destructive power of your punches. Power up Donkey Kong to match your play style. For example, if you strengthen your sonar, you'll be able to detect treasure from further away, which could lead to new discoveries. Or use skill points. My boy skill tree. That's crazy. There are all sorts of items to find as you explore. Tim, I'm going to go on a limit and say this game looks fun. Bananium chips are shaped like slices of banana. Ah, and they can be traded for bananium gems at the chip exchange. Whenever I buy those at an airport, I'm always disappointed. These gold are called gold for banana chips. You can exchange gold for useful items at the stuff shop. The stuff shop. They came up with words for everything else except they were like, \"Oh, we're done. We're tired.\" The last thing for different fashions at local. Yeah. Give me some good outfits. Oh, yes. Just open the",
            "start": 797.28
        },
        {
            "text": "came up with words for everything else except they were like, \"Oh, we're done. We're tired.\" The last thing for different fashions at local. Yeah. Give me some good outfits. Oh, yes. Just open the closet and customize the perfect fits for Donkey Kong and Paul. This is very much the Mario Odyssey. Yeah, 100%. Or even change up your fur color. That's too much for Donkey Kong. Or Naked Kong. Almost every article of clothing comes with its own benefits. Dude, he looks sick. Turn that off. You know what I mean? So cold. What's it called when you can like do a different cosmetic trans? Yeah, they have transmogium. Give it some Donkey Kong term for it. Banana. Pretty helpful. Banan. You can also see which you collected, making it easy to see how close you are to completion. Damn, this game looks really cool. Yeah. Can you imagine if Mario Kart had this? There's plenty more to do in the underground world when not adventuring. Need a rest? Carve out space and enjoy a getaway where you can",
            "start": 850.64
        },
        {
            "text": "really cool. Yeah. Can you imagine if Mario Kart had this? There's plenty more to do in the underground world when not adventuring. Need a rest? Carve out space and enjoy a getaway where you can recover and enjoy listening to tunes with the music player. Mario Kart, [ __ ] take notes. You might even find new discs when defeating it. This is what the extra month went to. Yeah, it's $10. When it comes to moving between layers, subterranean eels have your back. It is kind of crazy. I can't believe they're playing the DK will help you easily move between layers you visited at any time. Bring back Lanky. And if you get no need to work, you can always teaport within the layer you're exploring. Tealport there like peel your banana peel. Yeah, that's a big stretch. I think that's the animal's name. Like teal leaf. In photo mode, you can freely change the iname camera angle and adjust other settings to snap pics. I'm changing colors reminds me of the photo like this or Yeah, right. Unleash",
            "start": 913.84
        },
        {
            "text": "name. Like teal leaf. In photo mode, you can freely change the iname camera angle and adjust other settings to snap pics. I'm changing colors reminds me of the photo like this or Yeah, right. Unleash your inner shutterbug and create your own captivating scenes by sharing a joy 2 controller or using a second set. You and a pal can control Donkey Kong and Pauline separately. Mario co-op play as Pauline. You can unleash vocal blast using Joycon 2 mouse controll. You can also copy the material of nearby terrain to give your vocals even more texture. Ben's going to love that. By working together, even tough enemies don't stand a chance. Cool. Cy was like pretty useless, right? There wasn't much going on. This game also supports game share. Even if only one player has the game, they can quickly share it to another player so they can join on their own system. Hell yeah. It can also be shared locally to a Nintendo Switch system. Hell yeah. Plus, you can play online between Nintendo Switch 2",
            "start": 964.32
        },
        {
            "text": "share it to another player so they can join on their own system. Hell yeah. It can also be shared locally to a Nintendo Switch system. Hell yeah. Plus, you can play online between Nintendo Switch 2 systems using Game Share via Game Chat. [ __ ] yeah. Wait, I wonder how that works. If you need a little help, you can do platforming as well. Assist mode is the way to play. I think it guides you in the right direction. [Music] Half the damage you receive and more. Assist mode supports you in your adventure to be the best Kong you can be. Are they using the power of the cloud? Probably the main game. There's a mode where you can carve stone using mouse controls called DK artist. Oh, Kong everything in here. Rotate to paint. The music. Andy Andy's going to make some [ __ ] in here. Oh man. carve material. Oh, that's brush, dude. Or add some backup. Let's take the Mario 64 title screen, add delay banana effect. Holy [ __ ] Chad's calling it out. Here's your Mario to your heart's content.",
            "start": 1021.28
        },
        {
            "text": "material. Oh, that's brush, dude. Or add some backup. Let's take the Mario 64 title screen, add delay banana effect. Holy [ __ ] Chad's calling it out. Here's your Mario to your heart's content. Andy, here you go. [Music] This game also supports amiibo accessories. A new Donkey Kong and Paul Lee amibo figure is also crazy there. unlocks Pauline's diva tricks. Yeah, Switch has Donkey Kong series amiibo shown here. Gold Kong tiles with explosive power will appear. [Music] Released up to this point. Why did they hide? Scand you'll get spheres like these. Oh, that's all. Thought there was going to be something in that sphere. CK, [Music] I love to sing more than anything. They're putting vocals over the DK theme. Well, maybe if we get to the surface, you and me, we can make it more than a dream. What's doing here, bro? I love it, dude. What's doing here? Let's go. Cut to his imagin to his thoughts. He's like, I don't understand what you're saying. Who is this girl? Oh, he's just picturing",
            "start": 1073.28
        },
        {
            "text": "What's doing here, bro? I love it, dude. What's doing here? Let's go. Cut to his imagin to his thoughts. He's like, I don't understand what you're saying. Who is this girl? Oh, he's just picturing bananas. I have no idea what this creature is. Join the powerful Donkey Kong and the talented singer Pauline as they set out on an adventure to the fabled planet core. Hey, my own special power DK. [Music] Donkey Kong the drama available July 17th only on Nintendo Switch 2. Pre-orders are available now on Nintendo eShop. The Donkey Kong and Pauline amiibo will also be available July 17th for $90. Well, there you go everyone. That was our live reactions to Donkey Kong Bonanza. We're going to get into all of our thoughts about what we just saw and uh how excited we are for the next Donkey Kong game right after a quick word from our sponsors. This episode's brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered",
            "start": 1150.48
        },
        {
            "text": "right after a quick word from our sponsors. This episode's brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized shades that won't break the bank. Shady Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people. They have hundreds of options to choose from, so you're bound to find the perfect pair to match your style. If you don't love your shades, exchange them for a new pair or simply return worry-free within 30 days. There's no risk when you shop. Their team are always there to have your back with personal and fast support. Y'all know I've been outside a lot playing Pokémon Go, and it's such a great experience wearing Shady Rays when I'm out and about looking dope. Exclusively for you, Shady is giving out their best deal. Head to shadyrays.com and use code funny for 35% off polarized sunglasses. Try for yourself the",
            "start": 1219.52
        },
        {
            "text": "Rays when I'm out and about looking dope. Exclusively for you, Shady is giving out their best deal. Head to shadyrays.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. Again, go to shadyrays.com, use code funny to get 35% off polarized sunglasses. [Music] What's up and welcome back to the kind of funny games cast for Wednesday, June 18, 2025. Of course, I'm your host, Tim Gettys. I'm joined today by blessing at a YoYay Jr. Good day, Tim. Uh the big daddy himself. He's a little chilly. A little chilly chilly boy. Greg Miller. They call me Chilly Willy. And putting the jacket on, Greg Miller. It was the one and only Nitro Rifle, Andy Cortez. Hello. How you doing, Andy? Great. Sorry. Sorry. asked him right when he was down plugging in his laptop. Uh this is the kind of funny games cast everyone. Each and every weekday we get together to talk about the biggest reviews, previews, and topics. Sometimes our thoughts",
            "start": 1264.88
        },
        {
            "text": "down plugging in his laptop. Uh this is the kind of funny games cast everyone. Each and every weekday we get together to talk about the biggest reviews, previews, and topics. Sometimes our thoughts on showcases of about video games live on YouTube, Twitch, and podcast services around the globe. If you love what we do, please support us with the kind of funny membership on Patreon, YouTube, Spotify, or Apple Podcast to get all of our shows ad free, watch us record them live, and you got a daily exclusive show for a chance to be part of the show. to submit your thoughts and opinions as YouTube super chats as we go. I see a bunch of y'all already writing in. Thank you so much for that. If you have any thoughts about Donkey Kong Bonanza, please super chat them in. Uh or or just any general switch to questions y'all have uh for us to fill out the Games Cast episode today. Um hungry. You're hungry? No, I heard growling over here. Meow. A little housekeeping for you. We have something very,",
            "start": 1320.48
        },
        {
            "text": "to questions y'all have uh for us to fill out the Games Cast episode today. Um hungry. You're hungry? No, I heard growling over here. Meow. A little housekeeping for you. We have something very, very, very exciting that I don't think we've even really teased yet. No. Uh, but you're about to get teased for the very first time right now. Yeah. We wanted to give you a gift. Um, it is all of our favorite pieces of media and we wrote a little uh note for you. [Music] I think you would really like that artist. Uh she's an incredible singer. You would really enjoy her. Caroline Bich. Caroline, thank you so much for joining us on the Kind of Funny Games cast. I'm Roger. Nice to meet you. Roger. It's so nice to meet you, too. I know you from Twitter at this point, so it's nice to meet you. face to face. It actually happened everyone last year. Roger gave Caroline Pachek's album to Hideok Khjima and he loved it so much that he had her create the title song for Death Stranding 2 on the beach.",
            "start": 1360.64
        },
        {
            "text": "to face. It actually happened everyone last year. Roger gave Caroline Pachek's album to Hideok Khjima and he loved it so much that he had her create the title song for Death Stranding 2 on the beach. And now Roger sits down for a one-on-one interview with Carolyn for tomorrow's Games Cast Get Hype. Roger, congratulations. Very exciting, everybody. I'm excited for you guys to see it. we recorded a few weeks ago and uh yeah, it's going to be a really good one and uh we also have a Greg going up uh tomorrow about how this all happened. So get hype everybody and exciting times. Congratulations, Roger. Great stuff. Uh and then of course we have our Death Stranding to review coming up uh Monday. So get excited for that as well. Uh remember we are in 11 business all about live talk shows after this. We're doing games daily, a little bit of a switcheroo because of the Nintendo Direct today. Uh, it's gonna be covering all of the WB games restructuring. Wild stuff. Rumors abound. Oh, yeah. You",
            "start": 1428.16
        },
        {
            "text": "We're doing games daily, a little bit of a switcheroo because of the Nintendo Direct today. Uh, it's gonna be covering all of the WB games restructuring. Wild stuff. Rumors abound. Oh, yeah. You know, a lot to talk about. Then after Games Daily, it's gonna be Uncharted 2, continuing our Naughty Dog week with Barrett and Greg Miller. All leading in, of course, to Barrett's uh new video essay coming out about Naughty Dog and him playing all of their games this Friday. If you're kind of funny member, today's Greg Way is Greg talking about Pride. Uh, thank you to our Patreon producers, Carl Jacobs, Omega Buster, and Delaney Twining. Today we're brought to you by Shady Rays, but we'll tell you about that later. For now, let's start with the topic of the shows. Donkey Kong Bonanza. We just saw the in-depth direct. One of the I would say infrequent but oh for sure you know fairly fairly common over the years solo game directs from Nintendo, right? Of the deeper dives of let's get into it.",
            "start": 1476.48
        },
        {
            "text": "the in-depth direct. One of the I would say infrequent but oh for sure you know fairly fairly common over the years solo game directs from Nintendo, right? Of the deeper dives of let's get into it. Don't expect announcements. Don't expect all this other stuff. I will say right there, even though I wasn't expecting announcements, I am a little surprised that Donkey Kong 64 coming to NSO and more specifically Donkey Kong updates for Mario Kart weren't announced here. There's always still time. There's a lot of time, but I did think that that would have been like a you have a month away from this. Like do a couple cool things on your Nintendo Switch, too. Listen, the world doesn't look as favorably upon Donkey Kong 64. So I I think the Nintendo state of mind is let's not ruin people's appetite before we get to Bonanza. All right, that that's fair. But but even then seeing Dixie, it's like for how limiting a baby Pauline. I was thinking it's weird that Mario Kart doesn't have a baby",
            "start": 1519.6
        },
        {
            "text": "before we get to Bonanza. All right, that that's fair. But but even then seeing Dixie, it's like for how limiting a baby Pauline. I was thinking it's weird that Mario Kart doesn't have a baby Pauline. Yeah, that's weird. Not really a baby. She's odd rod. She's a rod. She's a shape shifter. I feel in some sense. We're going to figure this out when we get in there. Bracelet. It's like the outsider that HBO show. You know what I mean? like she's some sort of like nefarious creature. Yeah. Yeah. So, top level, I want to start off here uh cuz Bless and I got to to play this game in New York. And um I I feel like we kind of differed a little bit in terms of our experience. I from my gameplay was a little let down by this. It felt lesser than when you're expecting a 3D Mario from the Odyssey team and then you get this. I'm excited. I love Donkey Kong. I'm one of the bigger fans of the Donkey Kong games. Uh but seeing it and playing it, it felt a little bit mindless. Like the controls are",
            "start": 1570.16
        },
        {
            "text": "team and then you get this. I'm excited. I love Donkey Kong. I'm one of the bigger fans of the Donkey Kong games. Uh but seeing it and playing it, it felt a little bit mindless. Like the controls are interesting and fun where uh it's the top left and down um face buttons correlate to are you punching up, left or or down or side or down, which is cool, definitely fun. But into the 20 minutes we played, it already to me got a little sy and a little bit like I am just kind of button mashing my way through this. And it just felt geared more towards children, which is not a problem. These are Nintendo games we're talking about. But as somebody that really cares about like the challenge and all that other stuff, collectibles, um I was a little concerned watching this. It doesn't fully assuage my fears, but there's a lot going on when it comes to the challenge uh courses and uh even just like the abilities and the skill trees and all that stuff. I'm like, \"All right, cool. Maybe I'm still",
            "start": 1614.8
        },
        {
            "text": "my fears, but there's a lot going on when it comes to the challenge uh courses and uh even just like the abilities and the skill trees and all that stuff. I'm like, \"All right, cool. Maybe I'm still obviously keeping an open mind to this one, but um I I I did like the showing quite a bit. What did you think, Bless?\" Yeah, I I really enjoyed the showing. It's funny, I was thinking about this um this morning uh before we got to watch this of like, you know, I had like a little bit of of feeling of nostalgia slash sadness as I thought back to what Donkey Kong meant to me like as a kid where I'm playing DK 64 and I'm thinking about like what is classic Donkey Kong to me along with like you know the original Donkey Kong arcade game which was playable in DK 64 so I fell in love with it through that way. Like, you know, I think there was a sense of thinking forward to what we were getting in this direct and also thinking about how, man, that Donkey Kong is done. Like, we're getting a a brand",
            "start": 1659.36
        },
        {
            "text": "way. Like, you know, I think there was a sense of thinking forward to what we were getting in this direct and also thinking about how, man, that Donkey Kong is done. Like, we're getting a a brand new kind of interpretation of what Donkey Kong is for Nintendo going forward. We have the redesigns. We have a new 3D platformer. And all this is exciting. And I think the thing that excited me the most about the thought was thinking about my nephews and thinking about how they're going to get to experience Donkey Kong and like this is the beginning for them. And I think that's the thing that I come out of this most excited for is like, oh, this is going to set the tone as far as what DK's future is for the current generation of children. And as I'm seeing all the features, as I'm seeing all this, right? Like me and Barrett will talk all the time about how much we love DK64. But for me, I'm like, I look at this and I'm like, \"All right, there. This is a DK 3D platformer that is, as I'm",
            "start": 1702.72
        },
        {
            "text": "this, right? Like me and Barrett will talk all the time about how much we love DK64. But for me, I'm like, I look at this and I'm like, \"All right, there. This is a DK 3D platformer that is, as I'm watching this, going to be fantastic, right? It's not going to have like the weird thing of like, oh yeah, I love DK 64, but there's too many collectibles or too many switching between Kongs and all the issues that come with that game, right? Like I look at this and I'm like, wow, you have a a fun story setup here where you have DK and Pauline like, you know, Odd Rock, sorry, Odd Rock aka Pauline, you know, nefarious creature. We don't know what's going on there, right? But even when Supergirl was Supergirl, she was still the Matrix in post Crisis. So that's what we're dealing with here. I think this is this a post crisis donkey. This is a post crisis Donkey Kong. influence I heard. But I would assume that she started off as Pauline and then turned into Odd Rock. No, no, no. I think Odd",
            "start": 1741.68
        },
        {
            "text": "this is this a post crisis donkey. This is a post crisis Donkey Kong. influence I heard. But I would assume that she started off as Pauline and then turned into Odd Rock. No, no, no. I think Odd Rock Odd Rock saw Pauline in the multiverse and you know cute in just like Matrix Supergirl Post Crisis before they actually did introduce Caro. Of course, I don't know what any of those words mean. Yeah, I don't either, dude. But you have this, you know, fun like, you know, buddy uh story between the two. You have so many so much of the musical tracks that help define my childhood present in the game remixed in ways that bring me back to Mario Kart World where I'm like, \"Yo, this is giving me the Mario Kart World soundtrack of Donkey Kong.\" Like, oh, we're cooking. Like, then we're we're we're winning. And we heard like six or seven different Donkey Kong songs there. So, I'm pretty sure, yeah, we're about to get a lot more of all the heavy hitters. Uh, yeah, that stuff. you have like I think",
            "start": 1779.04
        },
        {
            "text": "And we heard like six or seven different Donkey Kong songs there. So, I'm pretty sure, yeah, we're about to get a lot more of all the heavy hitters. Uh, yeah, that stuff. you have like I think a vastness to this game too that we're seeing here that is already beyond the scope of what I was expecting because it's coming out of the Nintendo Switch 2 reveal for DK Bonanza. I think I was contextualizing it more along the lines of a Kirby in the Forgotten Land in terms of like vastness and scope versus a Mario Odyssey which I see as just a much more bigger and mainline thing. the more we see out of this, the more I'm like, \"Oh, this might lean more toward the Mario Odyssey side as far as like scope and size and all that stuff, which is exciting, but also I think is a big challenge to make this kind of platformer um appealing on that level.\" And I'm excited to see if they're able to live up to that, cuz this isn't Mario Odyssey in the sense of, you know, you talk about getting your hands on",
            "start": 1817.36
        },
        {
            "text": "kind of platformer um appealing on that level.\" And I'm excited to see if they're able to live up to that, cuz this isn't Mario Odyssey in the sense of, you know, you talk about getting your hands on the controller at the Nintendo Switch 2 event. I think one of the big things with a platformer from this team is the game feel. And with Mario, it is all about the movement. It's all about throwing Cappy, diving off of Caffy, Cappy, like bouncing up and like how good it it feels to control the character. In this game, it you don't have that. Like it is I think there's a different focus as far as the way they want you to play this game. Like as I'm watching the the the gameplay right now, right, it is very much more tinkery as far as like what you're doing with the environment, what you're doing as far as like destruction, what you're doing as far as like the the the collectathon aspects and like kind of like digging into the world, like literally digging into the world. And I think that",
            "start": 1856.8
        },
        {
            "text": "as far as like destruction, what you're doing as far as like the the the collectathon aspects and like kind of like digging into the world, like literally digging into the world. And I think that is going to be an interesting thing to see how that vibes with people and if that turns people off that might want a straight up Mario Odyssey, like I just want the controls to feel good type experience. But my question for that, because I watched this and as somebody who loved Mario Odyssey and really pushed hard that year for it to be game of the year, as much as I love Breath of the Wild, I look at this and see so much Odyssey in it, but also don't get turned off by the idea that it's not going to be as precise. Even when we you're talking about the dodge jump or whatever you were air dash when it popped up, like I feel like he's going to h have a movement. Do you when you two played it, did you have access to all of these moves? Were these things that you didn't get to see or were you",
            "start": 1896.16
        },
        {
            "text": "when it popped up, like I feel like he's going to h have a movement. Do you when you two played it, did you have access to all of these moves? Were these things that you didn't get to see or were you surprised by the air jumps and the toss the platform and double jump off of it? That kind of thing. I mean, I think part of it is that we didn't have enough time to really explore the movement options, but also like there was definitely things like the uh chunk surf or whatever it's called where he was like surfing on top of one of the big rocks. Like we had that, right? And like we're digging through and all this stuff. Yeah. I mean, we see a lot of this in the the presentation we saw, but even in what we played. Like, I do feel that the the Breath of the Wild and Tears of the Kingdom in very different ways. Uh, kind of foundations of of not just gameplay, but like the systems of that game are in this of obviously being able to climb anything, but without a stamina meter, but also being",
            "start": 1933.92
        },
        {
            "text": "different ways. Uh, kind of foundations of of not just gameplay, but like the systems of that game are in this of obviously being able to climb anything, but without a stamina meter, but also being able to break anything and like the way the physics all kind of like play together seems to be such a big part of this game. So, it it kind of reminds me of Breath of the Wild in the sense of like you start the game off and you have all your abilities already and it's like you have your tools. It's just a matter of using them. This game, I mean, we didn't get all of the things they showed, but it did feel like, oh yeah, we could pull the thing out of the ground, surf on it, throw it at something else, stick it on something like there was a lot of stuff at our disposal immediately. And I I you know, when we played this at the Swiss shoe event, we had like um like Nintendo representatives with us to like help guide us or whatever. And like there's so many times where they had to tell me like,",
            "start": 1968.8
        },
        {
            "text": "when we played this at the Swiss shoe event, we had like um like Nintendo representatives with us to like help guide us or whatever. And like there's so many times where they had to tell me like, \"Oh yeah, and if you do this and if like or I would try to like break a piece of concrete out the ground and I kept pressing the button that would help me like, you know, pull dirt and I kept trying to do it to concrete.\" And it wasn't working. And I was like, \"Am I doing something wrong?\" And he was like, \"Oh, it's concrete, so you're going to have to hold it longer.\" And I was like, \"Oh, okay.\" And like holding like it it is a big like pull and then like pull it out the ground kind of thing. I think in those ways it's just less intuitive but more I think appealing to if you are the kind of person that likes to like tinker and like you know it I it reminds me world of tears in that sense I guess in terms of like the way that they want you to think about the game and think about like putting",
            "start": 2006.8
        },
        {
            "text": "that likes to like tinker and like you know it I it reminds me world of tears in that sense I guess in terms of like the way that they want you to think about the game and think about like putting things together and the different types of surfaces and stuff and it it almost feels like more of a thinking man's platformer in that sense which excites me. Um but yeah like overall I'm excited about this. So much fan service here as far as music world all that stuff. Um, and then also RPG elements kind of caught me caught me off guard, but I'm open to it, right? That stuff seems fun. This game just seems jam-packed in a way that I'm looking forward to. So, I really like this direct, Greg. Yeah, I have no affinity for Donkey Kong. Of course, being a Sega kid and joining with the N64 era. Even Don Kong 64 wasn't my jam. Uh, I think this looks incredible. This looks a game I won't be able to put down. It looks like one of those, \"All right, cool. What do you want to do today? Do you want to",
            "start": 2041.12
        },
        {
            "text": "Don Kong 64 wasn't my jam. Uh, I think this looks incredible. This looks a game I won't be able to put down. It looks like one of those, \"All right, cool. What do you want to do today? Do you want to go find the bananas? Do you want to take on the boss? Do you want to go into these little mini games they have there? Uh, and the story seems interesting enough, right? I think more than anything it is the idea that as I blessing just alluded to, you see that skill tree pop up and I am like, \"Oh man, I'm going to immediately invest in the sonar because I know I'm going to want to get the bananas to do XY blah blah blah blah blah.\" Uh, beyond that, the boss fights look great as Andy called out in the reaction. Uh, the world looks gorgeous and it looks I guess the biggest thing is it looks fun to explore. It looks as I watch this, it reminds me of how much I loved Odyssey and how I put Odyssey down and never came back to it. And that is a regret to me, right, in terms of how much I loved",
            "start": 2079.84
        },
        {
            "text": "to explore. It looks as I watch this, it reminds me of how much I loved Odyssey and how I put Odyssey down and never came back to it. And that is a regret to me, right, in terms of how much I loved that game. But to look here and be like, \"Oh man, like I'm going to get the same vibe out of this of going through changing my clothes, you know, building the load out, challenging myself to get those little things on the side path right there.\" He didn't get I'm looking forward to this cuz it does seem like a game I'm going to get. Lost in isn't the right word, but I feel like it'll eat up a lot of time where it will be that I come home and hey Ben, you want to play some Donkey Kong and he gets on that second controller to control Odd Rock, aka fake Pauline. Yeah, I refuse to admit that she's Pauline until I have some confirmation. Foline. Exactly. Um, but I think there'll be that I I can see plane rides being, all right, cool. Let's go through and try to get some of these bananas. Let's",
            "start": 2114.08
        },
        {
            "text": "Pauline until I have some confirmation. Foline. Exactly. Um, but I think there'll be that I I can see plane rides being, all right, cool. Let's go through and try to get some of these bananas. Let's go through and try to get these things I've missed. I'm looking forward to finding the secrets of it, the smashies of it, and everything else. I thought that looked incredibly impressive. I'm way more hyped for that than I was before this. Andy, yeah, I would say I'm I'm more excited than I was for it. I I don't think it's going to be something that I'm like, \"Holy [ __ ] we're two weeks away from Oh my god, we're a week away from it.\" But it's something I'm definitely going to want to mess around with. And a lot of it just comes down to the tinkering aspect and how how fun and silly all of that all the interactions look. Like I just I I love in really any survival game when you can dig into the terrain and get the really really nice sort of oh it just makes your brain feel good and fuzzy",
            "start": 2152.24
        },
        {
            "text": "all the interactions look. Like I just I I love in really any survival game when you can dig into the terrain and get the really really nice sort of oh it just makes your brain feel good and fuzzy when you hear the feedback of the the gems coming towards you and breaking of the stones and all of that. It it seems like I had mentioned it reminds me a lot of the the sort of interaction with the environment that you have with uh with Astrobot and I don't mean the breaking of things. It just like all of the little particles all of the little objects kind of you know uh popping up whenever you u break a mountain and you see all the particles and and uh objects on the ground. It just it looks like a really really fun time. It it it doesn't scream to me that this is going to be for, you know, if you are the hardcore Mario 3D uh player, you are going to be, you know, super into this. This just feels like it's kind of going for a little bit something different. And I I really like that. I",
            "start": 2190.32
        },
        {
            "text": "if you are the hardcore Mario 3D uh player, you are going to be, you know, super into this. This just feels like it's kind of going for a little bit something different. And I I really like that. I think it seems interesting enough to where I want to definitely give it a shot whenever it comes out. But I'm not like the most stoked for it. mainly excited for a lot of the music callbacks, you know, because that's I'd say the Donkey Kong Country games were, you know, really massive parts of my childhood. So, yeah, I think it looks awesome. That's fascinating for me cuz like Yeah, I I mean, don't me wrong, I understand different opinions, but like for me, this is a holy [ __ ] July 17th. Can't get here soon enough. Like, I want to play this one. Yeah, we're one month out, like like less than one month out, which is very exciting. I I am I'm a Nintendo guy, so I'm like, \"Oh, man. I'm counting down the to get my hands on this one.\" I I would say if anything I am really excited to see a",
            "start": 2238.08
        },
        {
            "text": "one month out, which is very exciting. I I am I'm a Nintendo guy, so I'm like, \"Oh, man. I'm counting down the to get my hands on this one.\" I I would say if anything I am really excited to see a Switch 2 exclusive game, you know, like you know, Mario Kart is is fun and I have definitely been playing that more than I was around when LA when launch came out because I was so busy with Night Rain and and Liz of P. But, you know, finally getting the chance single player Switch 2. Let's invest a lot of time. And I want to see it on that screen and I want to see it plugged into the dock. I just it's a game that I'm I'm stoked to see like, oh, this is what the hardware is doing now as opposed to an older title being updated to maybe run better. Or I was telling Bless how bummed out I was that, you know, Scarlet and Violet got the 60 frames per second uh push, but RCS is still capped at 30. I was like, \"Oh, damn. That's a game I would have loved to have seen run a little bit better.\" So,",
            "start": 2279.84
        },
        {
            "text": "you know, Scarlet and Violet got the 60 frames per second uh push, but RCS is still capped at 30. I was like, \"Oh, damn. That's a game I would have loved to have seen run a little bit better.\" So, yeah, I'm I'm pretty jazzed up to sort of uh to see this game whenever it does launch cuz it just looks like a lot of fun to run around. Uh it doesn't seem like a game that if you have nothing to do that you're going to put down and be bored by it because of the tinkering nature of things. The way that I am when I'm sitting down at a table and I see a wad of paper and I start tearing it up and just, you know, it's it's sort of like that fidgety type of of deal. It feels like it's going to be really satisfying. It's going to scratch that itch. I think coming off of Mario Kart World, I think before World got here, I had slightly less hype for this game because I thought World was going to give me all of like the open world collectathon, like that single player experience in the free roam mode.",
            "start": 2324.88
        },
        {
            "text": "World got here, I had slightly less hype for this game because I thought World was going to give me all of like the open world collectathon, like that single player experience in the free roam mode. And then once we got World and realized like, oh, okay, it's just the P switches, which is fine, but like not necessarily what I wanted out of this, I'm way I have a way bigger appetite for this now. Like I I to your point Andy like I am kind of primed now to be to what that like you know switch to current gen exclusive like you know collectathon that I know I'm going to lose 20 25 30 hours uh uh to just collecting everything. Um I think they've positioned this well as far as like how how they have the first party slate going. Yeah. I'm really into the Pauline stuff. Like I'm happy that like that was a reveal that they just got over with and it wasn't like oh halfway through the game you get Pauline and whatever. It's I like her being a character and them leaning into that. Obviously the",
            "start": 2368.48
        },
        {
            "text": "that was a reveal that they just got over with and it wasn't like oh halfway through the game you get Pauline and whatever. It's I like her being a character and them leaning into that. Obviously the Nintendo's giving Donkey Kong a huge push with his movie appearances and the theme park and all that stuff, but like the redesign and everything like let's give another franchise of Nintendo a chance to like be that top tier one of the big five. Yeah, he sounds like a WWE getting the push right now. real talk like getting getting that push and Pauline as well like I think is cool seeing her start to appear in the sports games and cart and now getting this new iteration and like kind of like fleshing it out and also it being a little girl I think is kind of cool like for this to be a kind of boy feeling game of like this big monkey breaking [ __ ] but it's like oh like it's about a girl that's a singer yeah it's getting a lot of like uh Frozen vibes as well I just feel like this is like a",
            "start": 2416.08
        },
        {
            "text": "feeling game of like this big monkey breaking [ __ ] but it's like oh like it's about a girl that's a singer yeah it's getting a lot of like uh Frozen vibes as well I just feel like this is like a very well marketed game to an audience that is going to absolutely adore this thing like boy girl otherwise We don't know what the We don't know what Jenna the Rock is, so let's not this [ __ ] rock situation. I I am a little bit like, why are we over complicating this? I won't see her in the game, but like why? Like I imagine because like her she has like a little rock bracelet on her wrist, which I assume is the thing that's turning her into the rock, if I'm going to dispute some of Greg's claims here. Um, and I You think she's a girl first and a rock? I think she's a girl first and the rock in a She's trying to infiltrate the rock like tribe. And I think it's here's the thing. I played Jack and Daxter for the very first time yesterday. The Precursor Legacy. Yeah, the Precursor Legacy. And",
            "start": 2455.84
        },
        {
            "text": "a She's trying to infiltrate the rock like tribe. And I think it's here's the thing. I played Jack and Daxter for the very first time yesterday. The Precursor Legacy. Yeah, the Precursor Legacy. And in that game, I don't know. For the first time. For the very first time. I've never picked it up before. Pretty cool game. It's like it's open and [ __ ] It's pretty cool. In that game, did you know that Daxter was a human that turned into an Soul and the game the series is kind of like trying to get him back. Jokes about this. Yeah. For a long time. Did you know that? Yeah. Cuz the whole point of He's just kind of fine with it for a long time. You know, that's the whole point of the game. Yeah. I I wonder if there's an element here where where it is we got to get this bracelet off of you, Pauline. Like you keep turning into the rock. Like you're cursed. You keep turning into Dwayne Johnson and we got to keep you as Pauline. I I'm I could see it being maybe being something along those",
            "start": 2497.68
        },
        {
            "text": "Pauline. Like you keep turning into the rock. Like you're cursed. You keep turning into Dwayne Johnson and we got to keep you as Pauline. I I'm I could see it being maybe being something along those lines. What I will say of the Pauline stuff is assuming cuz they have they ever confirmed that this is the Mario Odyssey team? They still haven't, but it is very clear. Now it's more clear than ever that it is that team. I do appreciate how much they're keeping the continuity of all right, Mario Odyssey going into DK Bonanza. Like this feels very much like a prequel uh in that way of like you got the same sort of Pauline uh like character model there. Um, you have like this like world that feels like here's the thing, right? Going back, Tim, I remember on either occasion or Games cast me and you were talking and I think it was you that gave the prediction of like, yo, this game's going to end with a little Italian plumber coming up some um, you know, uh, structure and trying to save",
            "start": 2531.92
        },
        {
            "text": "and you were talking and I think it was you that gave the prediction of like, yo, this game's going to end with a little Italian plumber coming up some um, you know, uh, structure and trying to save Pauline from you Donkey Kong. I've never been more convinced in my life that that is going to happen and that's going to lead into the continuity. JB Bonaficio says, \"Final stage takes place on a construction stage with an evil Italian plumber trying to steal Pauline.\" Yes, I did say that. The moment that the Pauline thing leaked, it's like, oh my god, can you imagine? I I am not sure they're going to do. And well, here's the thing. It's it's I'm of two minds here. Cranky's in this and the timeline. Bless the timeline. It doesn't add up. But real talk, more than anything, the timeline doesn't [ __ ] matter. These are just characters to Nintendo. They don't really actually give a [ __ ] about Pauline being a child already like disrupts that whole like Cranky Kong was the original Donkey",
            "start": 2574.08
        },
        {
            "text": "[ __ ] matter. These are just characters to Nintendo. They don't really actually give a [ __ ] about Pauline being a child already like disrupts that whole like Cranky Kong was the original Donkey Kong. Exactly. None of this makes sense anymore. None of it makes sense. None of it matters. Don't forget a [ __ ] rock. And we're seeing these challenge courses that have the that show the kind of old school Donkey Kong um tower going on too. So are these like in some like sub space or something? Who the hell? I mean like they're references. Speaking of these though, I hope there's a ton of them and I'm so excited. This is the type of [ __ ] I want. Yeah. Loved how they looked. Obviously very 2D Donkey Kong Country inspired, but going through the the different worlds that we're familiar with like DK64, you know what I mean? Like that's a game that when I talk about some of the complaints of that game, too many games is like one of the things, right? But like and none of them are really",
            "start": 2610.8
        },
        {
            "text": "like DK64, you know what I mean? Like that's a game that when I talk about some of the complaints of that game, too many games is like one of the things, right? But like and none of them are really great. Yeah. But it's also part of the identity I think of Donkey Kong. So for them to have Yeah. this, right? Like all the bramble last like and the minecart stages like they just seem to be pulling all the most important memorable things from Donkey Kong's history both the arcade game country and the 64. And also like some of the things we're seeing here, like clearly this is the Mario Odyssey team. This is the Galaxy team. Like there's so much just fun flipping perspectives and trying weird different things that uh we rarely see in other games that have that much gameplay variety. Uh but uh yeah, it's I'm and also all the transformations. Like there's there's something about this. I said this in our first preview, but it almost feels less like a 3D Mario and it's more like a 3D Wario.",
            "start": 2651.68
        },
        {
            "text": "yeah, it's I'm and also all the transformations. Like there's there's something about this. I said this in our first preview, but it almost feels less like a 3D Mario and it's more like a 3D Wario. The 3D like the Wario Land games. And yes, it's Donkey Kong and it's different, but the level of platforming and what you're doing and how you're moving about the world. It's a bit more about attacks than it is about platform or aggressive breaking through things. Those boss fights look so much fun. I I really I'm so stoked to see exactly what the mechanics are. They they just seemed like, okay, these these enemies look like they're large enough that I want to take down with throwing the rocks at them, exposing the weakness, seeing what the patterns are. They just I don't know. I just it it reminds me a lot of having fun with uh Kirby Kirby of the Forgotten Land Forgotten Land boss fights. Very similar bosses. Yeah, I love that. Uh we got a bunch of super chats that I want to get to, but",
            "start": 2693.6
        },
        {
            "text": "me a lot of having fun with uh Kirby Kirby of the Forgotten Land Forgotten Land boss fights. Very similar bosses. Yeah, I love that. Uh we got a bunch of super chats that I want to get to, but we'll do that right after a word from our sponsor. This episode's brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized shades that won't break the bank. Shady Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people. They have hundreds of options to choose from, so you're bound to find the perfect pair to match your style. If you don't love your shades, exchange them for a new pair or simply return worry-free within 30 days. There's no risk when you shop. Their team are always there to have your back with personal and fast support. Y'all know I've been outside a lot playing Pokémon Go and it's such a great experience wearing Shady",
            "start": 2738.16
        },
        {
            "text": "risk when you shop. Their team are always there to have your back with personal and fast support. Y'all know I've been outside a lot playing Pokémon Go and it's such a great experience wearing Shady Rays when I'm out and about looking dope. Exclusively for you, Shady is giving out their best deal. Head to shady.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. again. Go to shadyra.com, use code funny to get 35% off polarized sunglasses. I just went on Twitter and I this is unverified, but it it reads legit, so I'm just going to say it here. Uh Reese tweets out, DK Bonanza is being developed by a new team that was spun off from the Odyssey team. There are a lot of younger devs in the Odyssey team that grew up playing the DKC games and wanted to make one. I've heard the Kremlings are making a return. 3D Mario's still on the way. I hope that's all true. Every single theme, you don't buy it. I like I don't buy I",
            "start": 2786.4
        },
        {
            "text": "the DKC games and wanted to make one. I've heard the Kremlings are making a return. 3D Mario's still on the way. I hope that's all true. Every single theme, you don't buy it. I like I don't buy I don't buy it until I get some official word. I mean, unless Mario comes out in the next year, like Yeah. I mean, I will say this does seem like a this does not seem to the scale that I would have expected the next game from that team from what we're seeing so far after the amount of time that we've had to wait. So, the dream scenario for me is we get multiple projects and this is awesome. And I'm not even saying this is a small scale. I'm just saying it is not this doesn't look like the holy crap. We haven't seen a game from that team since 2017. Is that officially? I mean, we got Bowser's Fury, but like you know that that feels like a smaller. I expect this to be much bigger than that game. Uh, really quick before you get into super chat, something I saw on social media as well uh is just",
            "start": 2834.56
        },
        {
            "text": "but like you know that that feels like a smaller. I expect this to be much bigger than that game. Uh, really quick before you get into super chat, something I saw on social media as well uh is just like the deep cuts of like this canceled Donkey Kong Racing game. That's right, man. Don't get me started, man. About Donkey Kong Racing. Well, we could have had [ __ ] Xbox had to go buy rare and ruin everything up. Yeah, we could have had. But I love this. We're getting Dixie, dude. That's awesome. That's really really cool. Can you very happy about that? Barrett, can you rewind to the parts where we did see Diddy Kong and Yeah, let me let me find where they're they're sitting at like a table. Let me find out where it is. Thank you. Got a lot of super chats. Ricardo says Nintendo put in the donk in Donkey Kong. It's true. That booty. Oh yeah, that ass is real shaped. Yeah. Uh, Ultra Hyper Jub says, \"I'm about 15 minutes behind, but I'm happy to get to watch this live with y'all. I'm in",
            "start": 2878.56
        },
        {
            "text": "donk in Donkey Kong. It's true. That booty. Oh yeah, that ass is real shaped. Yeah. Uh, Ultra Hyper Jub says, \"I'm about 15 minutes behind, but I'm happy to get to watch this live with y'all. I'm in vacation this week and I don't usually get to listen until the night. You guys rock. Keep up the good work.\" And think thank you all for real. I think this all kind of started with um the our number of delayed flights from the Xbox thing and then like reacting to something late. I think that's so sick that people want to watch us be enthused, you know, that we can sleep in now. Very cool stuff. Um, a lot of Quest says calling it now game of the year. I I feel like that's where a lot of my hesitations, I guess, negativity comes from is like from my experience with this. I'm going to love this game. I just don't think this is going to be a 96 on Metacritic, you know? And like that that's what I want from this team. So, me being let down, it's like only compared to some of the greatest games",
            "start": 2920.64
        },
        {
            "text": "I just don't think this is going to be a 96 on Metacritic, you know? And like that that's what I want from this team. So, me being let down, it's like only compared to some of the greatest games of all time and also a 20minute gameplay demo that I did. How much did Mike spend on this game again for Fantasy Critic? A ridiculous amount. I love him. Um, any is anyone getting game of the year vibes from this? I think it's a contender for like the list. Yes. No, for sure. I think it'll be high8s, mid to high 80s. I think it's I'm with that score right now in terms I can't wait. Like this looks I'm going to play the [ __ ] out of this game. I can't wait. Yeah, it's tough to say. I I I think for me it will be determined on just getting my hand on the controller, right? Like I think the thing that immediately strikes me as like a oh, it's not blowing my mind are the visuals. Like I don't look at this game and I go, \"Oh, this is unlike anything I've ever seen before.\" But I also just don't",
            "start": 2965.52
        },
        {
            "text": "that immediately strikes me as like a oh, it's not blowing my mind are the visuals. Like I don't look at this game and I go, \"Oh, this is unlike anything I've ever seen before.\" But I also just don't have that expectation for a Donkey Kong game on the Switch 2. But it is the Switch number two. You know what I mean? There is there should be a uplifted expectation for visuals and graphical fidelity, but also like I know that that's not what this game wants to do. I know this game wants to push the tech as far as destructibility and like textures and stuff like that, right? So, or like um I should say textures of like the breakable surfaces, not textures as far as the textures looking amazing. Um, yeah. At one point he's holding up one of the rocks and I was like, man, that looks like a real low ass, real low res looking asset with the lighting. But, you know, kind you got to make some, you know, you got to make some concessions if everything's going to be like super destructible. I",
            "start": 3006.16
        },
        {
            "text": "real low ass, real low res looking asset with the lighting. But, you know, kind you got to make some, you know, you got to make some concessions if everything's going to be like super destructible. I totally see that. So, I think that's what if I'm watching a direct or if I'm watching a trailer, that's one of the things that immediately doesn't make me go game of the year. But like I think I could see it being one of those ones where once I get my hand on the controller and I get um uh through the game being like wow like that was a feast of content. Like wow this really brought me back to childhood or this really uplifted this character in this world for me. Um but I I'll say it's a contender for being a contender. Yeah. And I you know one thing that like I I feel might be divisive but I'm actually really into the voice acting and like the weird story bits. We don't really get story from the Mario side of the Nintendo games and them even trying at all like I feel like that could go a",
            "start": 3043.36
        },
        {
            "text": "actually really into the voice acting and like the weird story bits. We don't really get story from the Mario side of the Nintendo games and them even trying at all like I feel like that could go a long way with these enemies that you know very seeing the enemies you're like okay cool it's the Odyssey team that made this but they look way more interesting and cool than the the Odyssey villains and if they're actually I don't even remember Odyssey villains there just a bunch of bunnies family of bunnies they were the wedding planners at some point we got to talk about Mario and bunnies cuz I feel like there's like a weirdness as far as before you're chasing one. Yeah. Like I feel like bunnies fit into that world in a weird way. Oh yeah, even in galaxies like running around the little thing. Rabbits. Weird. Uh but yeah, I feel like there's a chance for if the uh I don't know if we had evidence of the the villains being voice acted as well, but Pauline seemed to be talking a lot to",
            "start": 3083.92
        },
        {
            "text": "thing. Rabbits. Weird. Uh but yeah, I feel like there's a chance for if the uh I don't know if we had evidence of the the villains being voice acted as well, but Pauline seemed to be talking a lot to somebody. So it could be cool to actually get some level of like more movie like feel from these Nintendo characters as opposed to a Mario that just says, \"Let's go.\" Yeah, this dude in the middle reminds me so much of the one of the bad guys in season two of Arcane. Little like kind of rat looking dude, rat owl thingy. Yeah. And then Yeah. Like it it just reminds me so much of that that design. Also Mojo Jojo as well. Yeah. Uh I will say um they they have subtitles, but whenever she speaks, she doesn't. And so I imagine they'll they'll do like DK speak where they're just kind of making noises and we get the uh subtitle interpretations. Oh yeah, when she's singing and he's just like uh Dan says, \"I thought we may get a Diddy Dixie announcement for Mario Kart World in this, but at least",
            "start": 3123.92
        },
        {
            "text": "and we get the uh subtitle interpretations. Oh yeah, when she's singing and he's just like uh Dan says, \"I thought we may get a Diddy Dixie announcement for Mario Kart World in this, but at least we're definitely getting some good skins for DK and Pauline.\" Yeah, one weird thing about Mario Kart World is DK and Pauline, but DK is the more crazy one, only have like one costume, like one extra unlock costume. I mean, so you can get DLC after this game comes out. Yeah. Yeah. Uh Kebab says, \"Finally, Tu reboot. I can love.\" Yep. Oh, The Last of Us. Man and his girl. Oh, I see. BK2, sorry. BG2580 says, \"Shout out to Nintendo getting the Universal Studios bands working as amiios. Excited for the E-rated Last of Us. DK is here.\" That is awesome. I I saw that and assumed as much, but like the theme park wristbands you can actually use like to get the same I was wondering what those were. I I knew the amiios, but I didn't recognize the wristwatches. That's cool. That's cool. That's cool. And",
            "start": 3173.52
        },
        {
            "text": "park wristbands you can actually use like to get the same I was wondering what those were. I I knew the amiios, but I didn't recognize the wristwatches. That's cool. That's cool. That's cool. And we just saw for a second like the big Kong like the amiios give you like the Kong uh letters and then they're giant. Like there's so much love for all the old DK stuff here. That's like I that's what I'm most excited about. It's like how deep are we getting into this [ __ ] I mean, I think that's the work that you that you probably have should have been doing for a long while as Nintendo as far as what Donkey Kong means to the business, like building out that lore, building out that like excitement for all things DK. This comes back to the top five conversation of like, yo, is is DK one of them ones? If it is, like you got to treat it like it is and give it the love so that you can have kids and future generations attach themselves to it. Think about Sticker Brush Symphony and how good of a",
            "start": 3222.08
        },
        {
            "text": "ones? If it is, like you got to treat it like it is and give it the love so that you can have kids and future generations attach themselves to it. Think about Sticker Brush Symphony and how good of a song that was. Look at those Kong letters and be like, \"Oh man, that gives me a feeling on the inside.\" You know what I mean? Totally. Uh Ollie says, \"Birthday tax. I love that I got this gift from Nintendo and from all of you. I'm so hyped for this game and can't wait for your review. Sending you some sweet nasty love from Germany.\" Happy birthday, Olly. Thank you for hanging out with us. Living Legends says, \"I was on the fence initially, but after after the direct, I'm very excited. Growing up in the 90s, I never liked Mario or Zelda. I was a Sega kid, but I love Donkey Kong.\" Uh CJ Spitz says Sticker Brush Symphony remix with lyrics and credits. If they give Sticker Brush lyrics, they're going to do it. You're right. They're gonna [ __ ] do it. I mean, that is game of the year. I'm",
            "start": 3262.32
        },
        {
            "text": "says Sticker Brush Symphony remix with lyrics and credits. If they give Sticker Brush lyrics, they're going to do it. You're right. They're gonna [ __ ] do it. I mean, that is game of the year. I'm sorry. That is game of the year. That's awesome. Sorry, blueprints. Colin Barry says, \"Uh, what's the the TTP mythic quest on building features? What's the time to play till we get to them building features?\" Uh, pretty cool. I mean, I mean, we were already kind of doing it within 20. I don't know where we were in the game though. We did still have the rock though. We didn't have Pauline. Yeah. No, I think they dropped us. I think they would have I think that would have been the first gameplay segment that we picked up at the demo. I don't know what cut scenes were before that. I'm going to say you get a two-minute cut scene. Yeah. Yeah. And then you're punching and then you're in. Then you're punching, break, and building. Kevin T says, \"My first game was the original DK Country, and I got",
            "start": 3300.16
        },
        {
            "text": "you get a two-minute cut scene. Yeah. Yeah. And then you're punching and then you're in. Then you're punching, break, and building. Kevin T says, \"My first game was the original DK Country, and I got a Switch to to play with my three-year-old with this being one of her first games. Full circle moments.\" That's awesome. Yeah, that's going to be great. Yeah, let's talk about that two-player mode for a sec, Greg. Like, yeah, let's do it. It It seems like a iteration on what we've seen from Nintendo a bunch of times, like from Galaxy to Odyssey, where it's not a fullon you're doing the same thing. It is kind of just you're helping. Yep. I'm excited to try it with Ben. I imagine though I will end up being uh Odd Rock. You know what I mean? Like I think he's going to want to be Donkey Kong, which is fine and that'll be great and I want him to have that experience. But I It doesn't sound fine. It it sounds like you're kind of pushing back against. It sucks. I mean, I don't want to be Odd",
            "start": 3340.32
        },
        {
            "text": "which is fine and that'll be great and I want him to have that experience. But I It doesn't sound fine. It it sounds like you're kind of pushing back against. It sucks. I mean, I don't want to be Odd Rock, but I'm down to help him. And like again, Nintendo's so good with the assist mode, right? Like I think it's going to be fun to see Ben jump into this and he like remember when we show he watched us react to the Nintendo Switch 2 originally. It's when he saw this, this is what made him go, I love Donkey Kong. This just the trailer for this, the reveal of Bonanza. He was like, I Donkey Kong is like Jen sent me a video of him talking about Donkey Kong. So, he's gonna want to be Donkey Kong, which will probably be maybe this is where we both get uh our switches up and running. We both play the game on our own. But, I think dropping in the assist mode for him and then if I'm going through and being Pauline for him and throwing stuff will be great. The share stuff's awesome and I'm a",
            "start": 3382.24
        },
        {
            "text": "the game on our own. But, I think dropping in the assist mode for him and then if I'm going through and being Pauline for him and throwing stuff will be great. The share stuff's awesome and I'm a little confused about it. I definitely want some more info on this. Barrett, did you find anything? Cuz Oh, I have not. No. Yeah, totally. Totally cool. But, uh yeah, if anyone in the chat understands this, like I would love to know more because I didn't What's going on? How are you able to play cloud on this game on Switch 2? Like, is it cloud? Yeah, it's got to be cloud. It's got to be similar to what It takes 2 does and and u the other one they just came out with. Uh is that cloud? I thought that was like they No. Wait, really? Yeah, it's cloud. No way. Really? When when you are the added player, when I hopped into somebody's game, I was like, \"Oh, this looks noticeably lower res.\" I am watching like a feed right now. You know, I am not getting a a native version of the game right now. And",
            "start": 3420.4
        },
        {
            "text": "when I hopped into somebody's game, I was like, \"Oh, this looks noticeably lower res.\" I am watching like a feed right now. You know, I am not getting a a native version of the game right now. And honestly, so like you're dialing in as a controller and streaming the Yeah. the the footage. Um, and you know, obviously people immediately will worry about that, but I talked about this yesterday. Blessing on the kind of funny happy hour, that Mario Kart session at LA on LAX Wi-Fi. Pretty [ __ ] crazy. Pretty good. That it was awesome and it was smooth. Now granted, Blessing did get kicked before the final match. Yeah. But like on LAX Wi-Fi, we were able to play with other people. We had uh Ignasio Roas, who is one of our community members, who on the stream was like, \"And I'm in Chile.\" And that [ __ ] worked. That's crazy. Crazy, dude. Like, so obviously anything internet related, it's really really natural to go, \"Oh, Nintendo, come on.\" But I I I think that a lot of stuff has been fixed",
            "start": 3460.16
        },
        {
            "text": "[ __ ] worked. That's crazy. Crazy, dude. Like, so obviously anything internet related, it's really really natural to go, \"Oh, Nintendo, come on.\" But I I I think that a lot of stuff has been fixed and will continue to get better. And I was really blown away by that Mario Kart experience. And I could totally see this being almost another proving ground to say, \"No, this [ __ ] works.\" Yeah. No, totally. And I I'm there and and the chat is telling me like they explained this in the the actual direct, which I I don't fully remember, but I'm just shocked about the Switch One part. The Switch One being able to do this. It's like that's crazy cool. Like, but good for them. And I guess it's not that big of a surprise like someone was bringing up the Wii U of like a very similar kind of gaming system, too. So, it's like all right. But cool to see them do it. Yeah, absolutely. the like is this, you know, the no question is a dumb question. Does this use like internet or is it via right or is",
            "start": 3511.92
        },
        {
            "text": "too. So, it's like all right. But cool to see them do it. Yeah, absolutely. the like is this, you know, the no question is a dumb question. Does this use like internet or is it via right or is it like that ad hoc stuff? Yeah, that's that's why I'm wondering like is it the thing of hey, if you're in the same vicinity, switches can just speak to each other. I was incorrect about uh Mario Kart World, but these are the right now the share locally um able games right now. Interesting. I mean, I do think that that's cool. Well, it sucks that it's not for Mario Kart, but for the ne the second big exclusive to have that feature with Switch One is very smart. And obviously I would say majority of people that have Switch 2s at this point also have Switch Ones in their household. Like I I don't know if we'll ever know that, but like I feel like that's a pretty safe assumption. So that's cool to be able to give Ben a second one. Well, not the other Bens of the world that don't have the luxury.",
            "start": 3552.4
        },
        {
            "text": "if we'll ever know that, but like I feel like that's a pretty safe assumption. So that's cool to be able to give Ben a second one. Well, not the other Bens of the world that don't have the luxury. Not the Ben whose dad is like you will never want for anything. There's a Switch 2 downstairs boxed ready for you. I did take the dock out so I could have a dock downstairs, but I'm almost done. Um, find familiar game says, \"My friends and I just left our secure stable job to launch a new game shop in Ohio. Thanks for inspiring us to just go do the thing and chase our dream.\" Congrats. That's beautiful. I saw this one. I've been looking into it. I backed them on Indiegogo. They had a They have an Indiegogo up. You could go You can go to find familiar games on Instagram if you want to check it out and do that stuff. But I'll be getting a t-shirt. I'm very stoked about that. Mount Vernon, Ohio. That's That's so cool. You know, not to add more work to your plates, but there's a couple uh",
            "start": 3596.16
        },
        {
            "text": "it out and do that stuff. But I'll be getting a t-shirt. I'm very stoked about that. Mount Vernon, Ohio. That's That's so cool. You know, not to add more work to your plates, but there's a couple uh YouTube channels that I've started following recently that are just game shop like retro game shop owners and they just like make weekly videos of like the people that come in the shop and like what they get, trades they make and all this stuff. And like this is so freaking cool. So like, hey, if you want more work, make a YouTube channel. I'll watch it. Uh Wendell Shoemaker says, \"I will not stand for the slander towards the brutals from Odyssey. Loved seeing a new cast of villains outside the Koopalings. And they had fun boss battles you could exploit to finish faster. Yeah, the brutals. I mean, they're definitely better than the Astrobot enemies. Come on. Think about that stupid ass [ __ ] green. I remember the green alien dude. I don't remember any of these goddamn bunnies. I remember",
            "start": 3634.32
        },
        {
            "text": "they're definitely better than the Astrobot enemies. Come on. Think about that stupid ass [ __ ] green. I remember the green alien dude. I don't remember any of these goddamn bunnies. I remember Bowser dressed to the [ __ ] eyes, ready to marry. Yeah, it's I I'm I want to say I'm torn, but I'm not. I didn't like the Brutals. I I I I want to see a new cast because I get we can't just do the couplings over and over, but we haven't ever done the couplings in 3D, right? Am I wrong about that? I guess not. Yeah, you're I think you're right. It's like, let's do it. You know, it's the same thing here with like the Kremlins, man. We haven't seen them in hell. They not in Galaxy in any of the galaxies? No. Okay. No, we got to have like a like a summit for 3D platformer like villain like groups of villains. You know what I Like I think Andy as an artist group. Yeah. And like more more of a we just got to get it together because I feel like even the big dogs are failing on this like you know",
            "start": 3672.32
        },
        {
            "text": "of villains. You know what I Like I think Andy as an artist group. Yeah. And like more more of a we just got to get it together because I feel like even the big dogs are failing on this like you know with Odyssey with Astrobot like why are these groups of villains I think we have to have Cojima as a speaker. Ah you well you look back at all the Metal Gears it's like always amazing villains the beast. How do we Yeah. How do we translate that to 3D platformers? You know you're right though dude it's important. We should have a summit. Let's have the summit. I think these I think these will you know at one point the Koopalings were nobodyies to us right I think I'm I'm using the same rationale I was like look at one point Will Ferrell and your favorite SNL cast was a nobody to you but at at I think these people this group uh what were they called again the void the void bastards something like that I think they can really really tear this [ __ ] up yeah I think they're going to stand out",
            "start": 3715.84
        },
        {
            "text": "think these people this group uh what were they called again the void the void bastards something like that I think they can really really tear this [ __ ] up yeah I think they're going to stand out when you look like a gremlin I'm down they look better. I I think that these look significantly better than the cast of Nintendo villains that are brand new like groups that we've seen in and I'm including Tropical Freeze and Donkey Kong Country Returns. Uh I think that this group feels like it has a lot more personality um than the Brutals for sure. So, who are the Kirby and the Forgotten Land villains? There was that the big monkey. There just a bunch of big animals. Yeah, we got to fix armadillo. We got to fix this. Enough with just the big animals. Really quick, Bless. Uh, just another thing that, uh, made me think about DK64. If you see in the, uh, kind of top right corner of the G here, you see this gong over here. Reminds me a lot of, yeah, you're right. Oh, we're so back. I do want",
            "start": 3757.36
        },
        {
            "text": "that, uh, made me think about DK64. If you see in the, uh, kind of top right corner of the G here, you see this gong over here. Reminds me a lot of, yeah, you're right. Oh, we're so back. I do want to call something out from the official press release here. All right. Cuz I was trying to get all the names of the Void Company or whatever. But more importantly, they do call out that the Void Company, uh, they are also responsible for turning Pauline into Odd Rock. Oh, she is not Odd Rock turning into Pauline. It is in fact Pauline turning into Odd Rock. According to Nintendo, if you want to believe that, they could be Swervenous. They could be swerving us before. The The whole direct ended with a dramatic moment of her falling into a void. Uhhuh. Right. And then him reaching out like what if like the dramatic end of this game is they have to make a sacrifice and like do we save this entire world or does she turn into a rock and Donkey Kong [ __ ] punches that thing into oblivion? Jesus.",
            "start": 3806.32
        },
        {
            "text": "like the dramatic end of this game is they have to make a sacrifice and like do we save this entire world or does she turn into a rock and Donkey Kong [ __ ] punches that thing into oblivion? Jesus. You know what I mean? It's like I think the end of this game is either going to be them facing Mario or Donkey Kong [ __ ] destroying Pauline as a rock. Sure. But then that but that sacrifice to let her come back as a human being. You're so right. I mean, the whole the whole game is the anti, you know, anti-rock agenda. Wow. Crazy stuff. Jesus. So vi such a violent thought. As much as I want the the Mario ending, um Mike Manady made a good point on Last of Nintendog where it's like Nintendo it's it they don't want to have Mario be seen as like a villain quote unquote or like as a bad, you know, I don't believe that that like that that doesn't sound like a real thing. I know you're going to tell me going to give Mario a gun. You will see Mario in Fortnite with a gun at some point. I stand",
            "start": 3849.12
        },
        {
            "text": "I don't believe that that like that that doesn't sound like a real thing. I know you're going to tell me going to give Mario a gun. You will see Mario in Fortnite with a gun at some point. I stand by it. He had a gun in the universe. They were horrified when Rare gave Donkey Kong a gun. And also he Mario was frowning in like the Smash Brothers games. He's been scing. That's different than being an antagonist, though. I think that if you, you know, at at any point were really, you know, attracted to the visuals of Sonic the Hedgehog and you go, \"Oh [ __ ] he's he's fighting my guy in the Olympics.\" Like, yeah, he's my villain right now. You know, it's a great point. is my rush in in that one hockey game. I also view it once I don't see it as also I don't see it as like an antagonist thing. I see it as like a ending Easter egg of like oh that's Mario. Oh [ __ ] he's coming for me. Again, we're going to follow the Last of Us thing. We're seeing Last of Us vibes here. Like Donkey Kong is",
            "start": 3897.12
        },
        {
            "text": "I see it as like a ending Easter egg of like oh that's Mario. Oh [ __ ] he's coming for me. Again, we're going to follow the Last of Us thing. We're seeing Last of Us vibes here. Like Donkey Kong is the bad guy. Mario's the good guy at the end. Think of it that way. What if halfway through you had to play as Mario and then you learn a lot about the connection between people? Dude, they're holding a lot back in this direction. Oh man, you're like, I never thought I never thought he'd win me over. Yeah, I was like, wow, I like Mario Bart and Donkey Kong. That's crazy. The DK artist mode. Oh, crazy. Very cool. That's kind of cool. Looks great. Uh yeah, it kind of reminds me of Tilt Brush or I'm blanking on the actual app name for it, but it was one of those kind of first apps that you get whenever you have your VR glasses because you're essentially using the JoyCons to manipulate everything. I think it looks really rad. I mean, what a weird addition to throw in here that makes really no",
            "start": 3948.0
        },
        {
            "text": "you have your VR glasses because you're essentially using the JoyCons to manipulate everything. I think it looks really rad. I mean, what a weird addition to throw in here that makes really no sense, but they're kind of just throwing everything in here. It feels like one of those things where once you have the systems of the games established and you realize how much like good destructibility you have here, it's like, well, we could turn this into a sculpting thing pretty easy if we wanted to. This feels like the game was done a year and a half ago and then they're like, oh, it's done for the Switch 2 launch. And they were like, oh, we delayed that a year and a half. Oh, sure. We got extra time. And so much of this game screams to me like a kid's first adventure. Like this is going to be so many kids favorite video game or first favorite video game. And adding like these extra little modes that seem more fleshed out than they should be. It doesn't just seem like an afterthought. It's",
            "start": 3988.24
        },
        {
            "text": "so many kids favorite video game or first favorite video game. And adding like these extra little modes that seem more fleshed out than they should be. It doesn't just seem like an afterthought. It's like let's really get in there and add fun little gimmicks and things that kids are going to want to do. Like the turning on the lights and adding the animated backgrounds and stuff. Like I've said this before, but like getting Mario Paint I found so much fun in that game and it was just a freaking MS Paint clone. You know what I with like minor mini games and stuff. Chill out. Had the music composer like [ __ ] that music. But that was the thing is like it gave you so many things to do that felt like you wanted to do. And I feel like with this like the kids are going to have so much fun. Like the scene of Mario and Donkey Kong and all that stuff. Imagine those are going to be preset standards. Then you can just like load those up and then [ __ ] with them. Like kids love coloring books.",
            "start": 4028.72
        },
        {
            "text": "the scene of Mario and Donkey Kong and all that stuff. Imagine those are going to be preset standards. Then you can just like load those up and then [ __ ] with them. Like kids love coloring books. You know what I mean? Allow them to like play with this stuff in a video game. I think that's really really cool. Hell yeah. Awesome. I can't wait. The transformations are interesting to me. Very Yoshi coded, which is a good thing. I like the gameplay variations, but I'm not seeing too many variations here. I I think that's my biggest problem is so much in this game is like you're just punching and breaking [ __ ] and then it's like, all right, here's your ability. You go faster to punch and break [ __ ] Here's another transformation where you punch and break. You're running on water. He's running on water there as a zebra. Yeah. The ostrich is used for flight and black eggs. He just wants to hate. For me, it takes me back to like the Don Kong Country games where like you had",
            "start": 4065.2
        },
        {
            "text": "He's running on water there as a zebra. Yeah. The ostrich is used for flight and black eggs. He just wants to hate. For me, it takes me back to like the Don Kong Country games where like you had transformations in those, right? Or did you transform into Ramy or did you ride Ramy? I'm forgetting now. You wrote him in the same transform into the thing. 64 you transform into them. Yeah, you transform. Wow, they really couldn't figure that out in 64. Like just make him turn into the [ __ ] um but I guess like if I'm counting those as I guess transformation/ powerup situations, right? Like that had two or three between Rambi and then the Swordfish. The ostrich and the ostrich. The swordfish would have been a cool addition. I mean, I'm sure he's in this. You think so? I with how much they're showing here. Like I mean, even look at that. Like the design of the the rocks has the like old school underwater. What? Mario versus Donkey Kong, right? What are they fighting on? What is that? A",
            "start": 4104.8
        },
        {
            "text": "showing here. Like I mean, even look at that. Like the design of the the rocks has the like old school underwater. What? Mario versus Donkey Kong, right? What are they fighting on? What is that? A construction site. Yeah. Yeah. But I know what you're talking about cuz I tried to name it earlier and I couldn't think of the word I was looking for. They're on ramps but like steel girders little wrecking cruise [ __ ] I'm not sure. But will we get a swinging bonanza for him? Which animal? I mean that would be the the swordfish if there were to be one. A marlin if you will. Remember when um Roger didn't know the word marlin? No. Are you trying to create new narratives because you can remember croissant or what? Or bagel? No. about well that was me just forgetting the word create trying to bring other people down with that was just me not being able to remember the name of a word in the way that I never remember words but yeah I remember like bringing up the word swordfish and then I",
            "start": 4150.56
        },
        {
            "text": "bring other people down with that was just me not being able to remember the name of a word in the way that I never remember words but yeah I remember like bringing up the word swordfish and then I brought up the word marlin he was like what's a marlin I was like what are you talking about that's crazy in New York they marfish a marlin looks like a swordfish yeah I'm be honest I didn't know what this was either Matt Matt in the the chat says uh give some loved my boy Squawks. Squawks is the parrot, which we did see in here. He was one of the things that you can He spelled it so wrong. It brought up a completely different definition. Marilyn Monrose popping up. He said Marilyn. M A R I L L I N is a feminine name or leg mortgage repair. Oh, that is an I there. I put an extra I. Oh my god, I love that. Uh oh, I did. We Sorry. Bear may have brought up the Diddy Kong and Dixie Kong part and I just wasn't maybe paying attention. Yeah, we froze on it a few times of them sitting at their",
            "start": 4198.48
        },
        {
            "text": "I love that. Uh oh, I did. We Sorry. Bear may have brought up the Diddy Kong and Dixie Kong part and I just wasn't maybe paying attention. Yeah, we froze on it a few times of them sitting at their little desk. Damn it. I mean, the store, the stuff shop, that's pretty fun. It's all just Mario Odyssey. It's crazy how much it is. Just goofy ass costumes. Hell yeah. So much of the UI in this game is Mario Odyssey with a different with a slightly different font like a man. Let's [ __ ] go. Wait, can you bring them up again? I miss them every single time. Yeah. Yeah. They're at the desk. Yeah. And there seems to be like a competition thing going on here. So maybe they're judges or some [ __ ] That's cool. Then he smashes the desk. They walk there. We We don't have your reservations. There are no kings, he says. And he smashes the desk. You just take out Dixie calling. Jesus. She's okay. Um yeah, I don't see any blessings. Google search right now. There's a Marlin. There's it. Listen, I",
            "start": 4246.88
        },
        {
            "text": "no kings, he says. And he smashes the desk. You just take out Dixie calling. Jesus. She's okay. Um yeah, I don't see any blessings. Google search right now. There's a Marlin. There's it. Listen, I didn't know these. I didn't know they're called Mar. So like, is swordfish not the scientific name? I I'm sure they're different genuses or species or something like that. I'm sure there something different. I love the color variants, man. I I It's one of my favorite things in gaming, you know? Yeah. It's what, you know, seeing Mega Man get different colored armor is so cool back in the day for me. Yeah. One of his power-ups as he turns into an ostrich. Oh, you know what? Sorry, I was thinking of the swordfish. My bad. I was think of the Marlin. Gotcha. Yeah, I'm with you, Andy. And them having different skills. Very cool. I hope there's the transmog or whatever it's called stuff to not like to be aesthetically pleasing and have the powerups. They won't. I guarantee they won't have that. I",
            "start": 4286.08
        },
        {
            "text": "different skills. Very cool. I hope there's the transmog or whatever it's called stuff to not like to be aesthetically pleasing and have the powerups. They won't. I guarantee they won't have that. I don't know what that is. Them having the the music actually being able to go in and like choose different songs. Thank you. That's awesome. And it seems like that there's going to be like a sizable library of songs. So, and I loved the Odyssey soundtrack. It was such a different vibe and stuff, too. So, I kind of wish that there weren't these RPG mechanics. And not that I'm like ever again. I'm never that type of person that like when a game adds that stuff, I'm always like, \"Ah, I'm never that dude.\" But I I would like it if just as you progress through the game, all of that stuff became stronger. And then you could go, \"Oh [ __ ] now I'm seeing stuff way deep in that mountain. Let me go back to the first world and see what I could have missed there.\" You know? Would you rather be Yeah.",
            "start": 4330.72
        },
        {
            "text": "And then you could go, \"Oh [ __ ] now I'm seeing stuff way deep in that mountain. Let me go back to the first world and see what I could have missed there.\" You know? Would you rather be Yeah. The more you use it, it levels up automatically. So if you're pinging sonar all the time, it's leveling up. Well, no, because I don't want you to be at your desk doing the lockpick mechanic in in oblivion. That was a lot of fun, though. 30 minutes. It was 15, everybody to get it to 99 or whatever. Last 30 seconds, I've just watched Bless go from tab to tab to tab looking at different versions of Swordfish and then he slowly goes to Marlin from Finding Nemo and clicks on it to get to his like Wikipedia page to like learn more. We're a broken society, everybody. Why would they call the clown fish a Marlin? That's confusing, isn't it? As a child, how am I supposed to then How am I supposed to grow up knowing what a Marlin is when Pixar has told me this whole time that this [ __ ] clownfish is",
            "start": 4374.08
        },
        {
            "text": "a Marlin? That's confusing, isn't it? As a child, how am I supposed to then How am I supposed to grow up knowing what a Marlin is when Pixar has told me this whole time that this [ __ ] clownfish is called Marlin? That's just his name. Yeah, but that's confusing as a kid. I guess I also grew up uh you know, I'm I'm Atlanta I'm an Atlanta Braves fan. The Florida Marlins were a team and are a team and then now they're the Miami Marlins. That's the only reason I knew it's I knew they were a baseball team. That's probably where I first heard it, too. Yeah. I keep going back and forth cuz swordfish and Marlin very different but also I don't know it's cool to see how they share some DNA they share some DNA good you know I'm trying to figure out cousins you know for sure cousins was it who was was it somebody on this panel that asked me about orcas recently somebody that didn't I believe so you may have dreamt that maybe it was Roger there was somebody that didn't know what an orca was and I",
            "start": 4417.2
        },
        {
            "text": "it somebody on this panel that asked me about orcas recently somebody that didn't I believe so you may have dreamt that maybe it was Roger there was somebody that didn't know what an orca was and I had to teach them really stop making up these narratives no I swear to God stop making the narratives this happened what are the narratives you have about Donkey Kong Bonanza let us know in the comments comments below. We are about to do an episode of kind of funny games cast where we are breaking down the WB games situation. What's going on there? And after that, we got a a super fun stream. Uncharted 2 continuing Naughty Dog week leading into this Friday's Barrett Courtney video essay uh where he replayed every single Naughty Dog game. What are his thoughts? You'll have to wait and see on Friday. But until then, I love you all. Goodbye. [Music]",
            "start": 4455.84
        }
    ]
}