{
    "id": 14186,
    "video_id": "trXa-ZV6bww",
    "show_name": "Gameplay",
    "hosts": [
        "Mike Howard"
    ],
    "title": "SnowBikeMike is BACK and Exploring Mario Kart World!",
    "description": "Go to http://kindafunny.com/XREAL to grab yours now!\n\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1749511193,
    "duration": 8252,
    "transcript_chunks": [
        {
            "text": "[Music] Live and recording in three, two. Yo, what the heck is going on? Kind of funny best friends. Welcome in to your Kind of funny games afternoon stream for a lovely Monday, June 9th, 2025. I'm back and I missed you. Welcome in kind of funny best friend. It's Mike running up some Mario Kart with each and every one of you. And it's a fun one. It's a special one because it's Monday. It's my favorite day of the week. You know what I mean? We're back to work. We're back with all of you having some fun. But we're also kicking off my first time turning on my Nintendo Switch 2 and playing it. Uh, of course, I got my Nintendo Switch while I was sick last week on Friday. And guess what? I spent all weekend downloading all of my game collection over from my Nintendo Switch One. Uh Barrett said that I downloaded so many games that I sucked up all of the memory on this game. I only have 2.5 gigs of memory left. So, I guess I've done a good job. But I will tell you, it took all Friday night and",
            "start": 0.0
        },
        {
            "text": "I downloaded so many games that I sucked up all of the memory on this game. I only have 2.5 gigs of memory left. So, I guess I've done a good job. But I will tell you, it took all Friday night and Saturday morning long to download all these games via the Wi-Fi. So, uh you know what? I guess I did a good job. I guess I did a pretty good job downloading all my favorite games. And as you can see, you know, you go over here and it's like I looked at my Switch One library and I was like, \"Well, what games need to come over with me to kick off my Switch 2 gameplay?\" Does MLB The Show 2022 with Show Otani really need to carry over? I was like, \"Yeah, probably not.\" And then I was like, \"Well, does Witcher 3, the complete edition, need to carry over?\" And I was like, \"Yeah, probably.\" You know what I mean? Looks better, right? And so I don't know. I don't think it does. I don't think that one does. I I think that from what I've heard from reliable people, yeah, is that any game, Switch One to",
            "start": 56.96
        },
        {
            "text": "I mean? Looks better, right? And so I don't know. I don't think it does. I don't think that one does. I I think that from what I've heard from reliable people, yeah, is that any game, Switch One to Switch 2 does look better. Will look better. Okay. Okay. Okay. Uh well, as you can see, these are all the games that I did choose to download onto my platform, uh my system. Uh Cyberpunk, we got Donkey Kong Country Returns. You got Donkey Kong Tropical Freeze. Endless Ocean. Can't wait to play that one day. Never turn it on. I'm going to turn it on one day. Marvel Ultimate Alliance, that's the only one that matters. Not going to ever do that. Is right. And so, yeah, I downloaded a bunch of games, but then of course, I've been in Elden Ring Night Re. Just it's my it's my life. It's the only game that I care about is Elden Ring Night Rain. Elden Ring Night Rey Cortez where I'm the final boss and I'm having so much fun. And so, I came in today. I thought, you know what? I want to play Mario",
            "start": 105.2
        },
        {
            "text": "that I care about is Elden Ring Night Rain. Elden Ring Night Rey Cortez where I'm the final boss and I'm having so much fun. And so, I came in today. I thought, you know what? I want to play Mario Kart with the best friends. I want to collect all of the outfits. I wanna I want to find my Mario Carter. I want to find my driver. And I want to have some fun with all of you. And so today, it's Monday. I get to say hi to you. Like JG over in the YouTube chat, Riley with the $5 super chat says, \"Hey, Jabroni, I've missed you. Glad to see you're doing better.\" Riley, I am 99% back. You give me tomorrow, I'll be 110%. I'm feeling so good. Ready to go. Were you like, \"Okay, I'm not sick. I've broken this Sunday morning.\" Well, I really thought Friday I could do it. Um, but after coming in for just a moment, I knew that it was the right call not to be here. I knew Sunday morning I was like, \"Now is the time to come back. What's Yeah. Yeah. Oh, good. Well, I came in on Friday uh for just a",
            "start": 151.04
        },
        {
            "text": "just a moment, I knew that it was the right call not to be here. I knew Sunday morning I was like, \"Now is the time to come back. What's Yeah. Yeah. Oh, good. Well, I came in on Friday uh for just a moment just to grab my Switch.\" And Roger looked at me, he's like, \"Yeah, you shouldn't be here.\" And I was like, \"All right, I'll leave.\" Um, and so yeah, I'm I'm really happy that I'm back, ready to go. Washi says, \"You audibly cough 20 times this morning on the podcast.\" That was because it's Monday morning. A lot of fleg. You're just trying to get the conversation dry. I haven't talked yet. Washi, you know, Roger got the thermostat up to 7 [ __ ] 5°. Like, Roger, I get it that it's light rain in the morning. We don't need it to be tropical. Okay. It's so cold in this room, though. You have it set to 67. I have it set to 75. I'm going to vomit. We're on different wavelengths, me and Roger. You know what I mean? It's like he was trying to kill me. He was trying to kill me. Yeah. Barrett",
            "start": 203.36
        },
        {
            "text": "it set to 67. I have it set to 75. I'm going to vomit. We're on different wavelengths, me and Roger. You know what I mean? It's like he was trying to kill me. He was trying to kill me. Yeah. Barrett also had it set to 67. And there I went in there. I was like, \"What's happening? What are we doing? What are we doing, boys?\" I don't know. It feels good. It feels good. It feels right. And so that's why we're back on a Monday. Hello, Twitch chat. Just like uh Game of Thrones Pontton. Hope you're feeling big dog. Horrible. Ken Jr. Price, welcome in everybody. uh some fun housekeeping and updates for you throughout the week because we have a lot of awesome content coming your way on the streaming side of things. Uh no, this is fine because I'm going to I'm actually going to use this. Oh, I want to play with these. I want to try these. Open. Yeah, the Yeah, nobody opened them, I guess. Um but some fun updates for you. So, here's some updates for you that's going to go on. Today is going to",
            "start": 244.32
        },
        {
            "text": "to play with these. I want to try these. Open. Yeah, the Yeah, nobody opened them, I guess. Um but some fun updates for you. So, here's some updates for you that's going to go on. Today is going to be Mike's first time playing the Switch 2/ Mario Kart World. maybe with all of you. Tomorrow, Tuesday, me and Nick are going to sit down and we're going to play Mind's Eye. Yeah, that game. We'll see what's up with that game tomorrow. We're doing it for the memes and we're doing it for all of you to know what the heck is going on. So, we'll see what happens. Wednesday, we've switched. We'll be Mike, Andy, and Nick playing Dune Awakening, a game that I know we're going to love. We're going to spend a lot of time in. So, I switch Tuesday and Wednesday on you. Thursday. Thursday's up in the air right now. I'm not going to lie to you, chat. I have it down for Mario Kart with the community. We're probably going to do that today. But but but um Magic is coming out this Saturday. I really need",
            "start": 285.12
        },
        {
            "text": "right now. I'm not going to lie to you, chat. I have it down for Mario Kart with the community. We're probably going to do that today. But but but um Magic is coming out this Saturday. I really need Nick and Roger to learn how to play Magic the Gathering so me and Bless can finally like make a mini commander show here at Kind of Funny. I need a third, sometimes a fourth. So, don't be mad at me, but Thursday might be a Magic the Gathering tutorial once again with the boys, Roger and Nick, to teach them how to play Magic ahead of Final Fantasy big release this week. So, be ready for that. Okay, just letting you know. And then Friday, I don't remember what Friday is. Honestly, I don't even remember. Mario World. No, that was Thursday. Yeah, I don't know. Oh, wait. What? It's a Mario Kart World rag tournament with the whole I like Kevin. I like how you're putting that down. So, we got a lot of games. There's a lot of things to play, chat. So, we're going to jump right into it. It's my",
            "start": 329.2
        },
        {
            "text": "World rag tournament with the whole I like Kevin. I like how you're putting that down. So, we got a lot of games. There's a lot of things to play, chat. So, we're going to jump right into it. It's my first time. Want to give a big shout out to Washi and Chris Anka. Uh, I've decided to finally switch up my Nintendo Switch 2 profile uh picture here. As you can see, here's my friend code. You can add me. But, uh, as you look at it right here, your boy Mike, what you need? I want to feel how warm you are. Yeah. Yeah. Feel that. Oh yeah. I feel warm. I'm thriving in here. I'm thriving right now. You might have a fever. Actually, add me on your friends. But what you see here is I've changed my profile picture. I've moved away from the me. I know, crazy. I've moved away from the me. But get this. I've gone Pikmin. So I asked Washburn if I was a Pikman, what color Pikmin would I be? He said, \"Mike, you'd be purple because you round and also you could be the red one cuz you're red.\" And then I",
            "start": 382.88
        },
        {
            "text": "I've gone Pikmin. So I asked Washburn if I was a Pikman, what color Pikmin would I be? He said, \"Mike, you'd be purple because you round and also you could be the red one cuz you're red.\" And then I said, \"Chriska, what color goes well with purple?\" He said, \"Mike, choose yellow to make the purple pop.\" And that's where I'm at. So that is me. If you're looking for me, add me. Have some fun. We'll jump right into it and have a good time. As for Mario Kart, I haven't turned it on. I didn't even get to watch much Mario Kart as they played it. So, I don't understand how this is going to go down. Is it cuz you were so sick or cuz you were playing? Uh, no. I was I was like watching y'all, but I was I I actually slept a lot. Oh, that's good. I would say that throughout this week I slept probably close to 15 to 18 hours a day. It was a lot of sleeping, y'all. It was a lot of sleeping. Lot of nightquil. I'm [ __ ] nightquil dazed up. I'm all night up, y'all. So, add me up. I don't know how",
            "start": 427.76
        },
        {
            "text": "close to 15 to 18 hours a day. It was a lot of sleeping, y'all. It was a lot of sleeping. Lot of nightquil. I'm [ __ ] nightquil dazed up. I'm all night up, y'all. So, add me up. I don't know how this goes. I've never played this. Kevin says, \"Is it great?\" I enjoy it very much. So, I'm excited about this. Look, you see you're in the menu, right? Yeah. I'm in this menu. I can go to start here. Start. So now you have options, right? Single player, multiplayer, online play. Okay. Wireless play, right? Bottom right. Free roam. So that's the open world. Now if you hit it, look at your surrounding. Boom. How how seamless seamless and incredible was that? So what's that? What's this thing on top of this car? I mean, it's whatever you want to be. Food. What's that? You eat it and it gives you a little speed. Now we're going to have friend requests going. How do I eat this? Uh, you use it as an item. So, I think it's like L2 or L1. There you go. L2. And it gives you He ate something. Oh, it",
            "start": 471.28
        },
        {
            "text": "little speed. Now we're going to have friend requests going. How do I eat this? Uh, you use it as an item. So, I think it's like L2 or L1. There you go. L2. And it gives you He ate something. Oh, it just gives you a boost. Yeah. And what's the go button? A Yeah, I think so. Yeah. B is to stop. Okay. Oh, Y is uh the map. Okay. Is it circle? Is it circle? Is that what? Uh, yeah. Circle. Axy. Okay. Circle to go. Right. Yeah. circle to go. But doesn't matter. You can change it now. Oh, do people change it? Do y'all change your stuff? Dude, get this. The the Switch Pro controller comes with two back buttons, right? Yeah. Right here. Right here. If you hold down home, you can't do it right now, but if you hold down home, it opens up the menu and you can on the fly adjust it for just that game. Do y'all think the Switch to [ __ ] uh the Switch 2 controllers are sold out? Like, do you think if I show up to We don't have to think. You want me to look Best Buy right now? Do you think they're",
            "start": 520.88
        },
        {
            "text": "Do y'all think the Switch to [ __ ] uh the Switch 2 controllers are sold out? Like, do you think if I show up to We don't have to think. You want me to look Best Buy right now? Do you think they're for sale? I can look that up right now. Oh, wow. You can just rip anywhere, chat. Am I always Mario in this? No. Go to your character select and change it. No [ __ ] Yeah, whoever you want. And this is the M. This is my first time seeing all of them. Okay. Now, now the question, chat, is who are your drivers? Who is your driver? Well, I mean, you got to look and see how many options you got cuz you got a lot of options. So, we have four here. Four. That's 12. 16. 20. 24. Another 20. 36. 36 on that one. Yeah. Then we go 48. 40. 48. Wow. That's 50 plus. I mean, 60, but yeah, 62. No, just 60. Just 60 flat. But I think they'll I mean I think we're going to get more. Holy Jesus, y'all. That's a They got Chad the piranha plant. Holy canoli. So the question is is like who they got? Wamp. Who am I?",
            "start": 568.08
        },
        {
            "text": "60 flat. But I think they'll I mean I think we're going to get more. Holy Jesus, y'all. That's a They got Chad the piranha plant. Holy canoli. So the question is is like who they got? Wamp. Who am I? Who's Wamp? They don't have Wamp. That was a joke. Okay. Uh Wamp is a new thamp that they created. Oh, okay. That is rampshaped. Yeah. And you go you can ride off him and but he gets up and he knocks you down. chat. What is what's the vibe here? What is everybody picking? Who is your drivers right now? Um, Paulina, Baby Mario, Baby Luigi. I just beat Luigi's Mansion 3, so Luigi's like high on my list right now. He's like kind of my dude. You think Baby Luigi? Oh, look at that guy. Look at that. Oh, wait. Hold on a second. The Goomba. No, the Nabbler. The purple guy at the bottom. Didn't we just talk about you being the Nabbit? Nabbit. I I was rabbit. The nabbit rabbit. They should have teamed up with rabids. Put the rabbit guy in there. I think he might be a rabbit. Oh, the piranha plant",
            "start": 632.88
        },
        {
            "text": "talk about you being the Nabbit? Nabbit. I I was rabbit. The nabbit rabbit. They should have teamed up with rabids. Put the rabbit guy in there. I think he might be a rabbit. Oh, the piranha plant is instantly playable. Oh, snap. Yeah, those other ones are outfits that they'll Oh, they're outfits. Okay. Sidestepper the crab. Oh, I wish the snowman was a little bit cooler. I kind of like I kind of [ __ ] with the snowman. Oh [ __ ] I might be Stingy. Sting the [ __ ] bee. But like it seeing them are all cool, but you got to see them in the car, chat, right? Got to see them. Well, click. What does Sting be in the car? Oh [ __ ] He's got cars, y'all. Yeah, they all got cars. Do they all have the same cars or they all look different? Well, you saw his first car was like a B car. Well, that's just Oh, I guess. Yeah, they they get more cars. Sting is kind of cute, y'all. I need to see him moving. Yeah. See, Penguin's got his hands on the wheel, though. You know what I mean? He's got his",
            "start": 687.68
        },
        {
            "text": "just Oh, I guess. Yeah, they they get more cars. Sting is kind of cute, y'all. I need to see him moving. Yeah. See, Penguin's got his hands on the wheel, though. You know what I mean? He's got his hands on the wheel, though. I like that. You got to have somebody with the hands on Get a grip on it. Okay. Cow. Pokey. Oh, I like pokey. the sand man. Yeah. Well, I don't think I think he's like a sand caterpillar, but he lives in the sand. Does that Nabbit's kind of lit though? I've been playing as Nabbit. But you've been playing as Nabbit? I think he might move slowly, though. Oh, you think they all move in a little bit differently? Oh, Mike, they all completely different. Oh, this crab guy is yelling you. The crab guy kind of [ __ ] dude. Yeah. Well, I don't know about that. The piranha plant has his hands on it. leaves. Chad. Chad the piranha plant. But there's Luigi. What about baby Luigi? No, I wouldn't be a baby. Really? You been messing with any of the babies? No, I'm not messing",
            "start": 743.76
        },
        {
            "text": "has his hands on it. leaves. Chad. Chad the piranha plant. But there's Luigi. What about baby Luigi? No, I wouldn't be a baby. Really? You been messing with any of the babies? No, I'm not messing with They're light. They're like ultra lightweight, so they're going to go faster. Who is everybody playing as? Chat, let me know. Chat, everybody tell me tell me who you are. The crab is kind of calling me. I feel like the crab is right. The crab might be calling my name, chat. Sidestepper. Really lame name though. Cow. Waluigi and Toad. Yoshi. Drybone. Shy Guy. Blue Yoshi. I'm boring so I mostly go Mario and Donkey Kong. That's not boring. Rayman. Why you lying to Rayman? Team cow. A lot of team cows. Mike needs to get snowboarding shy guy. What? Nabbit. Mike. Trust. Kevin says he likes Nabbit. He likes the Nabbit. I like Nabbit. So these are just different outfits. Did you hear that? Snowboarding. Yeah, Shy Guy probably got some cool goggles, right? So these are just Well, this King Buu",
            "start": 798.72
        },
        {
            "text": "He likes the Nabbit. I like Nabbit. So these are just different outfits. Did you hear that? Snowboarding. Yeah, Shy Guy probably got some cool goggles, right? So these are just Well, this King Buu are people [ __ ] with the crowd. Who's the most se Swoop the bat? Welcome back, mate. Hey, nice to see you. The game is like playing Disney Pixar films. So incredible. What? What? Okay, let's go down the list. Everybody stop. Stop what you're writing. Stop what you're writing. Where's me, too? What's Barrett doing? What? What do you mean? Probably working on something. One second, chat. No, we're good. I I don't know that Barrett has the stats if that's what you're looking for him. All right, I'm going to ask Bear, but I'm also going to ask all of you. You ready for this chat? When you play online, who is the most used character? Who is the most overseen character that you see? Right? So, like, we're trying to be cool. We're trying to stand out, right? If I'm going to be the crab, I want to",
            "start": 857.44
        },
        {
            "text": "who is the most used character? Who is the most overseen character that you see? Right? So, like, we're trying to be cool. We're trying to stand out, right? If I'm going to be the crab, I want to be the only crab on the goddamn thing. I guarantee you no one's ever seen the crab. You might want to turn off HDR for the Switch. The colors are blown out. Lol. Uh, if we turn They've been [ __ ] with the thing. So, I They know. Turn them off. They look like utter [ __ ] The The colors just go to like light gray. Barrett. Much better. Big moment for me. I am choosing my character for the first ever time. Who is my Mario Kart driver? Right. My question for the chat was of course, who do you race as? So, we'll start off with you. Who do you like to race as? Who is your go-to? Who are your go-tos? So, so let me tell you my journey cuz I I was worried about this as well cuz 150 CC for the longest time on Mario Kart 8, my go-to was Link. Is Link in this game? No, he's not. Uh, and then when I",
            "start": 925.6
        },
        {
            "text": "So, so let me tell you my journey cuz I I was worried about this as well cuz 150 CC for the longest time on Mario Kart 8, my go-to was Link. Is Link in this game? No, he's not. Uh, and then when I graduated over to 200 CC, I found that Link was too fast. So, I moved over to one Shy Guy. So, so Shy Guy has like kind of solid like kind of basic stats in terms of 200cc cuz then he went not too fast but slow enough that I could start processing what's uh what's going on at that speed. One. So without Link and with Shy Guy as my other main, my instinct was to go Shy Guy for this game. I feel like he's a bit too slow for me in this game though at 150 CC. So I've been playing around with a bunch of different variables. I think I've decided on my main um someone who has good enough acceleration and speed stats with some of the later cart unlocks that you don't have right now. Okay. My guy is none other than Waluigi. Waluigi. Waluigi's got some of those sets that I personally like, which I was",
            "start": 970.56
        },
        {
            "text": "speed stats with some of the later cart unlocks that you don't have right now. Okay. My guy is none other than Waluigi. Waluigi. Waluigi's got some of those sets that I personally like, which I was surprised by cuz I like Waluigi. He's cool. He's whatever. Uh, you know, he's got like the the meme kind of fan base, but that has been my guy so far in Waluigi. I've gotten three stars with him on all Grand Prix and Knockout Tours at 150 CC uh constantly. So, you're getting it. Okay. Now, second question. I like to stand out, right? I think people go to what they love. They break down like you. I also notice when I go online, I want to be someone that's like rarely used or someone when you pass you go, \"Oh [ __ ] they're playing that character.\" Who is the So, like, who are the most overused characters that you see when you go online? Who are just the go-tos that you're like, \"I see them every time, Mike. Don't be this person.\" Okay, so Koopa, I see I I see a lot. Um, see a lot of Koopa.",
            "start": 1018.32
        },
        {
            "text": "characters that you see when you go online? Who are just the go-tos that you're like, \"I see them every time, Mike. Don't be this person.\" Okay, so Koopa, I see I I see a lot. Um, see a lot of Koopa. Okay. And honestly, these guys, the penguin, people say the cow is overused, the snowman, like everybody's doing those a lot. They're doing a lot of the animals. doing a lot of the animals, a lot of Monty Mole. Andy had to fight uh Washi Washi for for Monty Mole. Um I don't know. It's tough. Who you not see him? How about on the other side? Who do you rarely see? This crab. I [ __ ] told you. I told you ain't never seen the crab before. Not in real life. The only time I see the crab is when we're turned into the crab by like one of the powers. So you're not seeing the crab often? I'm not seeing the crab often. Chat, I feel like this dude parabitty bud. Really? I don't feel like I see him. Not seeing the bitty butt. Okay, I think that's it. Maybe Goomba as well. I don't I don't feel like I",
            "start": 1064.64
        },
        {
            "text": "the crab often. Chat, I feel like this dude parabitty bud. Really? I don't feel like I see him. Not seeing the bitty butt. Okay, I think that's it. Maybe Goomba as well. I don't I don't feel like I see a lot of glmbbas out there. I have many glmbbas. Goon and June. June. Goon. Do you know what that means? Do you have your definition that you want to share with all of us? Check out the latest kind of Kevin available live right now. You can go check that out. Tell us your definition of goig in the comments down below. But uh I think that answers it for us chat. I think that's a quick answer of like we're going to be Sidestepper. We're going to be the crab man. I kind of like there's also a piece of me that wants to be Bowser. Cuz like when you see Bowser, you're like [ __ ] Bowser. Bowser's mean to me. Also, he's got red hair. And like that's kind of I kind of like Bowser cuz it's like you know what I'm here for when I play Mario Kart. I'm not here to win. I'm here to make you mad. I'm",
            "start": 1106.08
        },
        {
            "text": "mean to me. Also, he's got red hair. And like that's kind of I kind of like Bowser cuz it's like you know what I'm here for when I play Mario Kart. I'm not here to win. I'm here to make you mad. I'm going to do that. Try him out. Try Well, we got to try them all out, right? We got to try them all out right now. I don't know. We're side stepping. We're side stepping with the crap, dude. [ __ ] you. I love crab, man. Or is he a motorcycle kind of dude? He's not even touching the steering wheel. He doesn't touch the steering wheel. He doesn't need to. I tried to to to like put him on there. Huh? They just were like, \"Yeah, just put the PNG on top. Put him on top. Leave him there. Leave him there. He's fine. He's fine. I think I can set it up so his little claws grab the st.\" No. No. No. No. Can you? No. No. No. No. I'm Oh, they're saying in the in the room in the war room for sure with the bike. No, no one's going to pick him. It's fine. So, where are the stats being shown? They They",
            "start": 1153.36
        },
        {
            "text": "Can you? No. No. No. No. I'm Oh, they're saying in the in the room in the war room for sure with the bike. No, no one's going to pick him. It's fine. So, where are the stats being shown? They They don't show him. You're lying. I'm serious. So, Barrett's just breaking all of this down in his mind. Yeah. Wow. He's crazy. It's beautiful, chat. Oh [ __ ] I'm pressing every button cuz I don't know how to use You still sponsored by XR? Yes, we are. We're sponsored by That's the latest ads right now. But like, is the the Stinger supposed to be on? Nobody tells me these things, you know. Oh, I don't know on that one. That's a good Yeah, that's a good timing bear question. All right, chat. There it is. It's It's beautiful. Wow. It looks really nice, y'all. This looks really nice. So, let's talk about it. It's Mike's first time. You know what I mean? I'm excited to be here. I'm so pumped up to play some games with all of you. Are we playing online? Should I unlock characters? Like, what are we",
            "start": 1191.6
        },
        {
            "text": "it. It's Mike's first time. You know what I mean? I'm excited to be here. I'm so pumped up to play some games with all of you. Are we playing online? Should I unlock characters? Like, what are we doing? What's What's the best first experience in Mario Kart World? They do show the stats. Okay. Roam a little bit, Mike. Do a Grand Prix. Do one Grand Prix before going online. Okay. Man, they I'll tell you what, they took the look and they said, \"Let's get the presentation up there. Let's make sure the presentation really speaks out.\" And it does. It looks beautiful. You're not trying to do the the world. They said, \"Do a Grand Prix to start.\" And then, yeah, a couple people said, \"What's sort mean?\" X. What the [ __ ] is sort? I think it's square. Oh, they're just like showing you the faces on the bottom. That's weird, huh? Is that what that does? Yeah. You notice it just puts the faces on the bottom. Oh, but I I guess it's easier to find. So, if you're like, \"Oh, let me see where the",
            "start": 1243.8
        },
        {
            "text": "on the bottom. That's weird, huh? Is that what that does? Yeah. You notice it just puts the faces on the bottom. Oh, but I I guess it's easier to find. So, if you're like, \"Oh, let me see where the little mushroom dude is.\" Yeah. I'm looking for this specific guy. Yeah. And so, like if I click on him. Yeah. Wait. Why? For details. Yeah. Wait, wait, wait. Does this do this for sorting too or Not for sorting, just for the just for the car. Right, chat. Yeah. Sorts in all the costumes when you unlock more. It will group the skins together. Okay, that makes a lot more sense. I've taken about 500 photos and videos already. I only have 2.5 gigabytes left on this. How many photos you think I'll be able to take before it blows up? I think a surprising amount. Uh, you think so? Yeah. Mike, turn off auto steering under X. That's a great call. Oh, you're going to play way better than we have. Yeah. Yeah. I thought you guys I thought everybody said like, \"Oh, I'm driving well at the beginning.\"",
            "start": 1316.0
        },
        {
            "text": "auto steering under X. That's a great call. Oh, you're going to play way better than we have. Yeah. Yeah. I thought you guys I thought everybody said like, \"Oh, I'm driving well at the beginning.\" No. And then you guys turned it off. I I don't know. Nobody Nobody asked me. Okay. I I don't think like I was like I don't feel like I'm controlling this correctly. I haven't played since I've turned it off, though. What's everybody's favorite carts? All right, let's get the carts right now. I mean, I think as a crab you have to use the I kind of want to use the dune buggy or the water the jet ski. Yeah, I was going to say jet ski, but like Yeah, the dune buggy and the water ski seems like sandy. What are the stats on the jet skiis? Yeah, but you might be going off roads. That's gray one is good. Neutral. I hate that. High acceleration, low medium speed, we'll call it. No, that's low speed. I feel like that kind of makes your your crab guy look like a douchebag if I'm driving like that.",
            "start": 1364.72
        },
        {
            "text": "good. Neutral. I hate that. High acceleration, low medium speed, we'll call it. No, that's low speed. I feel like that kind of makes your your crab guy look like a douchebag if I'm driving like that. Yeah, he feels like I had a monopoly or something. Yep. Yep. What up pe time? Hi homie. Like W Luigi. You've seen that car. You be like, \"Oh yeah, he'd be going. He stole that car.\" I like the magic carpet one, but you don't have that unlocked yet. You got a magic carpet in this [ __ ] game. That's so sick. How much have you unlocked? Nothing. No [ __ ] Nothing. Yeah. You didn't bring your Switch today? Uh, no. Unfortunately, I didn't. Oh, snap, bro. You know, I haven't stabbed you like the portal. So, this game isn't blueprints level yet for you? I I I've only played it at work on other people's stuff. Oh, yeah. Okay. Okay. Do you have yours? Do you have yours though? You got one? Oh, yeah. You got a Switch and the game. Okay. I brought it with me to the like to the the wedding. Okay.",
            "start": 1411.52
        },
        {
            "text": "stuff. Oh, yeah. Okay. Okay. Do you have yours? Do you have yours though? You got one? Oh, yeah. You got a Switch and the game. Okay. I brought it with me to the like to the the wedding. Okay. But then I like ended up being way too busy and then Sunday was my only day to not doing wedding stuff and had to hang out with the kid. Of course. Got to be the kid. Threw him in the pool. I mean, let me tell you what, this scoot, I [ __ ] with the scoot. I'm [ __ ] heavy with this scoot right here. Oh, Kevin, you want to see what I want to buy? Oh god, I made upset me. Kevin, no. You're going to laugh though. [Music] Let me show y'all. This pops up every time I go to a Facebook marketplace and I just want it so bad. Is it a little plane? Cuz I'm really scared you're going to get a little plane, dude. I thought I saw so many of those that I thought, what if? You know what I mean? I I know you keep sending me videos and I'm just like, bro, you can't you can't be you're going to die. [ __ ] I",
            "start": 1452.72
        },
        {
            "text": "dude. I thought I saw so many of those that I thought, what if? You know what I mean? I I know you keep sending me videos and I'm just like, bro, you can't you can't be you're going to die. [ __ ] I wonder if it's still there. [Music] Look at this little dude. Here it is, chat. That is amazing. Right. Isn't that a great Kevin? That's chat. I really want to buy this. Oh. And rip this thing around. $300 for the Yamaha. Y. Now, here's the thing. I don't ever encourage you with these dumb money. This is Look at this though. There is some money tied up. So, don't get lost in the $300. Cuz for 300 bucks, I would I would drive this thing until it blows up. But there's DMV money in this where it's like, \"Oh, you got to pay $850 to clear the registration.\" And it's like, \"Fuck.\" Or drive until the cops take it. Boom. What's the worst that can happen? You lose $300. I drive it and say, \"Oh, sorry about that, officer.\" Oh, I didn't know. My friend gave it to me. Exactly. I got it on Facebook",
            "start": 1506.64
        },
        {
            "text": "the cops take it. Boom. What's the worst that can happen? You lose $300. I drive it and say, \"Oh, sorry about that, officer.\" Oh, I didn't know. My friend gave it to me. Exactly. I got it on Facebook Marketplace. He told me he gave it to me. I mean, for 300 bucks, Kevin. Mike, imagine. You're wasting your time now. You Do you need a special license to drive one of these? No, I don't think so. No, not on a scooter. Should I be messaging this guy and saying, \"I'll take it.\" Let me Let me see if Nick's still here cuz if we can confirm you don't need Let me hand you $300 and let me rip this thing. I think we do this. Like I'm done, Chad. I'm telling you, this is my own Mario Kart vehicle right here. I'm Dude, how could you not want the 1998 Yamaha Rivia Yaz, dude? The Raz, bro. Come on. Goes 30 miles an hour. This thing is lit. This thing is so lit. Mike, check how much the CC's are. Dude, I don't know if this guy even knows what a CC is, bro. Moped's got 140 miles on [Music] it. D I'm",
            "start": 1561.92
        },
        {
            "text": "30 miles an hour. This thing is lit. This thing is so lit. Mike, check how much the CC's are. Dude, I don't know if this guy even knows what a CC is, bro. Moped's got 140 miles on [Music] it. D I'm thinking I'm Dude, I'm thinking heavy about this thing. Just so you [Music] [Music] know, like I'm thinking that thing up in Tahoe to the beach and back to the beach and back. It's like there's crabby Mike. There's crabby Mike. Side s side stepper. Side stepper Mike just ripping it. Chad, get ready. Get get [ __ ] ready. That's going to be my weekend ride. That's my weekend rides. All right, back to the cars. Dude, that little Yamaha up in Tahoe, my be that's my beach ride. I go to the beach on that Saturday morning. Yeah. Drive up to the beach. Park it. Here's the thing. In the beach. Afternoon. Yeah. You take that bad boy everywhere you go. You maybe it takes you eight hours to get to Tahoe. Yeah. You live in a different place. I just I'm going to message this guy. I can't keep looking at",
            "start": 1613.44
        },
        {
            "text": "Yeah. You take that bad boy everywhere you go. You maybe it takes you eight hours to get to Tahoe. Yeah. You live in a different place. I just I'm going to message this guy. I can't keep looking at this thing and not want to buy it. I'm tell I can't believe you bought this, dude. It's Thank you, Kevin. You know what, Kevin? I'm glad that you're fired up about this, too. It's the coolest goddamn thing I've ever seen. RZ on the front of it. Did you look at that? It's so lit. All right. What's the car, everybody? I mean, it's like, oh, so the highest speed that people are going is two full bars, and it's the big monster truck. Acceleration's clearly the biggest thing. Here, the monster truck seem really balanced except for the weight maybe. I mean, does it affect it that much? Yeah, the weight is the only problem here, but everything else seems to be right down the middle. Mike, you get the scooter, I'll find a boat. We'll be unstoppable. [ __ ] dude. Just We can't worry about Sky yet.",
            "start": 1711.04
        },
        {
            "text": "is the only problem here, but everything else seems to be right down the middle. Mike, you get the scooter, I'll find a boat. We'll be unstoppable. [ __ ] dude. Just We can't worry about Sky yet. I'm going to start with the buggy. I'm going to start with the buggy chat. Damn, look at this game. There's a really good fight. 50 100 150. Okay. Oh. Can you change your car every race? That would be smart. I don't I don't think so. Okay. But I'm not certain. [Music] Okay. This is a cool looking map. I'm going to step out for a minute. Yeah. Do you think Oh, they're taking me through all of the Grand Prix. Okay. Let's do this. Is this Grand Prix? Yeah, the chat told me to do one Grand Prix. One Grand Prix before we go online side [Music] stepper. Oh, I hit that. I don't know about that. I definitely hit that. Back up. Crabs on the way, y'all. [ __ ] you. Oh, he's grinding. Wario looks like a pirate, man. It just feels kind of just slow. Is that just me? [ __ ] you, Mike. Whoa. What was that",
            "start": 1765.12
        },
        {
            "text": "hit that. Back up. Crabs on the way, y'all. [ __ ] you. Oh, he's grinding. Wario looks like a pirate, man. It just feels kind of just slow. Is that just me? [ __ ] you, Mike. Whoa. What was that thing? Some sort of cone man. Look at Bowser up there grinding. How do I grind? Grinding. Get out of my [Music] life. Who did that? Why would you do that to me? Sorry, Peach. I'm coming in hot, Wario. I'm coming in hot, buddy. Oh, there's all sorts of shortcuts all around. You peeping this? Y'all peeping this? [Music] I [Music] panicked. Yeah, enjoy that, Luigi. Oh, a gold shell. What does that do? Get out of here, Mario. I'm cooking. Big final moment. Don't fail me now, Banana. [Music] No, it feels slower. It does feel slower. Carter bike. I'm not sure. I'm I'm It's my first day. It's my first day here. I'm just trying to trying to learn it. Trying to figure it out. We'll take third place. Do we take thirds? I thought we go first only. Oh, now. Oh, what is this? This the same map. Second race",
            "start": 1839.44
        },
        {
            "text": "here. I'm just trying to trying to learn it. Trying to figure it out. We'll take third place. Do we take thirds? I thought we go first only. Oh, now. Oh, what is this? This the same map. Second race starting now. Whoa. Oh, I have to hit it when it turns go, right, Chad? Not when it goes to one. Right. Can I go faster? Yeah. Let's Let's get the Come on, Krabby [Music] Patty. Oh, this was not worth it, huh? Oh, so this is like a straight up just like get there kind of race. Is that just all this track is? They don't do They don't do three races. Three mats. Get up. Oh, they got the song. Why is that guy got a lily pad on his head? Gripping and ripping, Mike. Oh my god, I hit that car and I still stayed alive, though. They're just going faster than me. Oh yeah. Oh yeah. Welcome to hell. Grind it. Grinding. Oh my god, what a great game this is. You going to be having so much fun this weekend. I can't believe I missed out. What's happening? Oh, now it's a race. No. Why would you give me a",
            "start": 1994.16
        },
        {
            "text": "it. Grinding. Oh my god, what a great game this is. You going to be having so much fun this weekend. I can't believe I missed out. What's happening? Oh, now it's a race. No. Why would you give me a coin? What's the point of a coin? Get out of here, Donkey Kong. Scadattlele, fool. Oh my god, I bounced off his head. Get up there. No, I gripped it and ripped it. What? What? Let me get up. That should have hit everybody in their mother. Hit him. Do they got the drift still? The [Music] drafting. So that was like almost a loop track, but it wasn't a loop track. Interesting start to that one. Oh, the mole has something weird on his head. Oh, shucks. I really went down. I lost a lot of points there. Those guys went 27. I'm so far behind now. Shake and bake. Mikey, are we all racing together? Y'all got your switches? Bring your switches to school and work. Let's do this. What kind of starts are these? Why are we in these rolling starts? And now I missed it. I missed it. I don't know how to do",
            "start": 2108.64
        },
        {
            "text": "got your switches? Bring your switches to school and work. Let's do this. What kind of starts are these? Why are we in these rolling starts? And now I missed it. I missed it. I don't know how to do it. Someone's got to teach me how to do it. Ripping. Oh, what is this? Stanky cheese. Oh, it's a hamburger. Why in God's name would I need a hamburger in the middle of a race? Oh [ __ ] Oh my god, I'm flying. Go. These two dudes are driving so fast. Yeah, got him. Oh, it's another non-lap race. It's a checkpoint. So, you're just supposed to just jump at all times, keep the speed going on those, huh? Wow. Wow. I almost took a green shell to the absolute face right there. Killing it first place. Nice. I saw someone in chat saying that they had never taken a burger to the face while driving. Bro, you ain't living. Oh man, I do that like every day after working in and out. It's unbelievable. And that's a messy burger, man. I just get that double double. I pound it. Pound it. I'm all alone. Oh",
            "start": 2210.88
        },
        {
            "text": "you ain't living. Oh man, I do that like every day after working in and out. It's unbelievable. And that's a messy burger, man. I just get that double double. I pound it. Pound it. I'm all alone. Oh no, now they're on my Now they're on my six. I mean, there's still a way out. So, if you hook up the camera, they can see your face. Yeah, it's really cool. Which is so cool. We should do that. We should do that. We got one, don't we? Uh, yeah. I think there's one like right behind us. Does it need a power source or does it just connect into the switch? I think it just connects in the Switch. The problem is when you're playing multiplayer, it's more complicated to get it set up. And also, somebody be shown their way. Well, I'm just playing single player. So, like when I play multiplayer, they'll just see my face, right? And then everybody can laugh. Yeah, but I think you have to like the We were trying to set it up and it was too complicated. All right, we might give it a try. We're here.",
            "start": 2319.12
        },
        {
            "text": "just see my face, right? And then everybody can laugh. Yeah, but I think you have to like the We were trying to set it up and it was too complicated. All right, we might give it a try. We're here. We're hanging. You playing 150 CC? 150. That was a big win for me cuz I was third every time. So, that's going to put me still second though. DK is DK's really putting it on me. So is Mario. How many more do you have? Last race right here. You got it, dude. Go on two, Mike. Oh, yeah. You hold it for the boost. Go immediately after two. Immediately after fading, Mike, what's the In-N-Out go-to order? Uh, number one spread only fries. Well done, cherry Coke with a water. And if I'm feeling spicy, extra cheeseburger spread only. They don't know. They think it's for someone else, but it's really for me. All right, we're out to two. One. Oh, you felt it. You could feel the wheels. Yeah, that was it. That's cool. Oh, what the [ __ ] There's a football guy. Yeah, that's a cool guy. He knew you get",
            "start": 2370.64
        },
        {
            "text": "me. All right, we're out to two. One. Oh, you felt it. You could feel the wheels. Yeah, that was it. That's cool. Oh, what the [ __ ] There's a football guy. Yeah, that's a cool guy. He knew you get coins, you speed up. Yeah. How did [ __ ] Recovery. Whoa. Oh, that was a good use of that mushroom. Oh, yeah. I'm [Applause] ripping. [ __ ] you, Donkey Kong. Got him. Oh no, the the boot took it. I watch a lot of go-karting Tik Toks, so I'm like in the know. Real life go-karting. Yeah, guys waiting for his moment. I know. That was rude of him. Eight laps. Uh-oh. Uh-oh. Uh-oh. Fall back. Ah. I tried to get it near Donkey Kong. Damn. You can see the thought he's ripping, dude. Donkey Kong rips. Come on. Oh, but he let me catch up. That's weird. Did he? Or you just got it like that. Oh, you didn't want to go up. I don't know. He kind of just like slowed down. Oh, a Donkey Kong themed Mhm. world. That's cool. You got a home plate advantage. Is that what they call? Come on, give me an item.",
            "start": 2421.16
        },
        {
            "text": "want to go up. I don't know. He kind of just like slowed down. Oh, a Donkey Kong themed Mhm. world. That's cool. You got a home plate advantage. Is that what they call? Come on, give me an item. Let's catch up here. You don't want to bounce on those. No, you do. Take the coins. Yeah, they're kind of slowing me down though. Massive. No. Why would you do that to me? Oh, that protected you though. I'm [ __ ] I know. But he hit me with double. Yeah, there's no way to expect that double. Get him. Get him. Pray. He's so smug. Oh, get there. Yeah, I hit him. Oh, wow. That was excellent. Oh, he's grinding rails. This game's lit. Drop the bananas. Now I got to use her as cover to my cover. That's smart. Can I wall ride that? I got to be able to wall ride those, right? I think so. There's no way you're not raw riding those. Come on. Come on. Big moments. Chill, Donkey Kong. Oh, this is it, man. You're at the end. Chill, Donkey Kong. Yes. Dude. Yes. First place. First place. So, what is the goal",
            "start": 2513.44
        },
        {
            "text": "not raw riding those. Come on. Come on. Big moments. Chill, Donkey Kong. Oh, this is it, man. You're at the end. Chill, Donkey Kong. Yes. Dude. Yes. First place. First place. So, what is the goal here? Like Tim was telling me he's like getting or Joey was like, \"Mike, I worked really hard all weekend to get first place in every Grand Prix for every gold star.\" Is that I lost. What? He beat me by two. Oh my god. Cuz nobody else took care of Donkey Kong. Help me. All right. So Target has, according according to the internet, Target Stonestown might have one controller. So Best Buy doesn't even have them. No, they're all out. So they're hot. People like these things. You got to wait like two days to get them. This is an old one. Okay. I don't think we have any new ones here. I also haven't checked. You want me to go check? No, I'm good. I'm good. I'm rocking this. This You know what? Doesn't feel that bad. It's a little small, but it's not bad. But you can use the Switch One. Yeah,",
            "start": 2598.4
        },
        {
            "text": "checked. You want me to go check? No, I'm good. I'm good. I'm rocking this. This You know what? Doesn't feel that bad. It's a little small, but it's not bad. But you can use the Switch One. Yeah, that's cool. I unlocked Donkey Kong. Oh, that's cool. You unlocked one. Uh, my Costco just sitting on controllers. Whoa. Hot dog and a controller. Never a bad idea. Say the word. We'll go right now. So, like, where are we? Grand [Music] Prix. That's cool. We unlocked him. So, like Oh, I have a silver trophy. Oh yeah, that's each c each course you need first to get gold three stars. So your goal is to get gold three stars on all of these at every CC. Yep. Like that's the goal here. Maybe that opens up Rainbow Road. I'm not sure. No, I'm not using the little wheel yet, but I'm going to use the little wheel right now. Kevin, grab the camera. Let's see what happens. Let's get the camera out. Grab what camera? The little mini camera. Oh, where is that thing? over here. Yeah. Grab that thing. Do",
            "start": 2657.92
        },
        {
            "text": "wheel right now. Kevin, grab the camera. Let's see what happens. Let's get the camera out. Grab what camera? The little mini camera. Oh, where is that thing? over here. Yeah. Grab that thing. Do you guys want to play online with me? You want to come join me online? Come on. All right. So, the mini camera type C. You plug it into the top. Right on the top. Got a little thing you rotate on the front of it. [Music] Boom. See that little notch? Give a little rotate. Oh, this. Yeah. To do what? Open it up. Oh. Oh, okay. Cool. Oh, yeah. to the privacy settings. Man, how does the Chad Piranha Plant one look? I really wanted the Chad the Piranha Plant one. That's a total waste of money, but I wanted one. It's a great photo, my son. You know, Chad, the Piranha Plant camera looks bad. Stop it. I mean, you just got to wait a little bit. All right. So, like, how do I turn on my camera? Well, I mean, it's not about the video quality. It's more about like the is it going to be cool on my wall? You",
            "start": 2718.56
        },
        {
            "text": "you just got to wait a little bit. All right. So, like, how do I turn on my camera? Well, I mean, it's not about the video quality. It's more about like the is it going to be cool on my wall? You know what I mean? Like, will people see it and go, \"Oh, that's [Music] cute. It's got to be under C, [Music] right?\" Welcome to Game Chat. Let's get everything set up and ready to go. about game chat. Chat with friends while you play all together, anytime, anywhere. Cool. Yeah, I agree. I agree to the chat. I agree to it. To use game chat, you'll need to confirm your phone number via text. Switch the camera screen real quick. Give me one second. Just in case. But like, y'all can call me. Nobody calls me. No, that's not true. No one. He He won't answer. They can see still hear you. Oh, you got to scan [ __ ] One sec. Oh, you got the app. I don't I don't know what's going to happen here. It's going to take me to Google Chrome, which I like. I saved all my stuff on it. Who would have thought",
            "start": 2775.52
        },
        {
            "text": "to scan [ __ ] One sec. Oh, you got the app. I don't I don't know what's going to happen here. It's going to take me to Google Chrome, which I like. I saved all my stuff on it. Who would have thought using Game Chat would take so much? [ __ ] us like Roger. You don't got Roger blocked still, do you? No, he be calling me too much now. Oh, they want my phone number. I got to give him I got to give them my phone number. Have you done this yet? Yeah. You signed up for game chats and all that, Jeff? Mhm. Here we go. You've been linked. Okay. Phone number saved. Okay. Can I bring you back? Let's see what happens. Yeah. Uh, next. To use Game Chat, you'll need to approve friends for chatting. Approve them. Yeah, just approve all my friends. I don't give a [ __ ] I It seems dangerous. Uh, when using Game Chat, sign into your own account. Yeah, I don't give a [ __ ] I'm the only person here. I'm not a child. I don't think this works the way we want it to. We'll just do this. Watch this. Can I",
            "start": 2848.88
        },
        {
            "text": "Game Chat, sign into your own account. Yeah, I don't give a [ __ ] I'm the only person here. I'm not a child. I don't think this works the way we want it to. We'll just do this. Watch this. Can I bring you back now? Yeah. Oh, yeah. Bring us back. Bring us back. Cuz you won't be able to see your own camera. C for menu. Here it is. Oh, it was on purpose. Here it is. Damn. Look at this. H look at what they they got the weird auto background on. Yeah. Can you turn that off? Yeah, I think so. Camera video. No background filter off. Oh, face only. What's face only do? Oh, it's like you have a little hole. Yeah. No, I don't like that. No, we you get take it. Hate that. Oh, this is lit. Going to balance the camera right on top of the screen. This is going to perfectly set. We could probably just like put a little sticky note and just put it on there. Right. So now you can't see it. Standard. Oh, when you when you do that it turns it off. [Music] So, this is what it looks like. Yep. This is",
            "start": 2914.24
        },
        {
            "text": "like put a little sticky note and just put it on there. Right. So now you can't see it. Standard. Oh, when you when you do that it turns it off. [Music] So, this is what it looks like. Yep. This is crazy. Now, I thought I saw something different where they were circles above the cart racers's head. Definitely once you That's what we want. What if you What? What if you hit the C button now? What happens now? Oh, it's just back there. I see. So, I am playing right here. I thought I thought you think Mike's switch cam will shake as he starts. No, it's pretty solid. Doesn't shake. Um, Mike, if you want, I have a room code for all of us to join. Yes, I want that. You could also set that up. Yeah, Suggies already has one. She's already set one up for us. But what I want is Suggies. I 100% want to join that. But first, I want to make sure you all can see my camera as I drive by. You see other people's circles above their race icons, not your own. Yeah, but how do you make sure you see mine?",
            "start": 2993.76
        },
        {
            "text": "to join that. But first, I want to make sure you all can see my camera as I drive by. You see other people's circles above their race icons, not your own. Yeah, but how do you make sure you see mine? I want to make sure you see mine. That's all. Oh, you all have to be my friends. Okay, dude. We got the camera set up, bro. This is This is the Switch, too. Okay. This is the next generation of Nintendo technology. Okay. Online camera use and in-game chat. No one else is doing it like them. No one else is doing it like them. I love this. I don't like how much up your nostril we're getting. Yeah, it's like very up it, but like you have to be up it. You know what I mean? That's what I was saying. Aim it down. This thing is so cool. There you go. Just balance it. Just balance it. Yeah, but it doesn't tilt down enough. Does it come down? No, that's just a locked in. It is kind of lit though. You ever been part of a wedding party where you're like part of the stuff? Uh, negative. Why were you",
            "start": 3055.12
        },
        {
            "text": "tilt down enough. Does it come down? No, that's just a locked in. It is kind of lit though. You ever been part of a wedding party where you're like part of the stuff? Uh, negative. Why were you part of one this weekend? Yeah. I mean, you probably been part of plenty, right? You were part of Tim's. Uh, I mean, technically Tim didn't have one, right? That's how he got away from not making anyone a best man. How about Greg? Uh, no. Craig Miller had that secret wedding. How about Nick? I didn't know Nick yet. Fran, he's not married. You'll be part of Rogers. I don't think so. You might be. You Have you thought about that? Uh, he doesn't have my phone number. All right. I was the man of honor for my friend Steph. That was cool. Oh, there. Man of honor. Yeah. Made of honor. Man of honor. That's right. That's what they call it. I mean, we might have made that a term up. Okay. Okay. I like that. Uh, I was supposed to be part of Barretts. Pandemic. [ __ ] that up. Pandemic. There it is.",
            "start": 3112.64
        },
        {
            "text": "That's right. That's what they call it. I mean, we might have made that a term up. Okay. Okay. I like that. Uh, I was supposed to be part of Barretts. Pandemic. [ __ ] that up. Pandemic. There it is. Camera. See, I told you that's what I wanted. Camera on. Thanks, homie. It's doing the like. Yeah, but like that's cuz you're make you're doing a call with Greg specifically. Yeah, I'm I'm wondering if I can turn that off. I don't think you can. You can leave it. Let's leave the chat. Now, if you go to online, if you go back. Yeah. One player camera. Camera on. Okay, this is looking good. Oh no, you got to have game chat open. Why are they doing this like this? But you can do this. Watch this. Watch this. Create a chat with Greggy and then peep it. Peep it. Ready for this? I'm I'm peeping it. I got an idea. So like C for chat menu. Camera on. And then watch this though. Right. Right. So like this is here. What if I do this? Exit it. See game chat camera has been turned off. They're really",
            "start": 3177.6
        },
        {
            "text": "I got an idea. So like C for chat menu. Camera on. And then watch this though. Right. Right. So like this is here. What if I do this? Exit it. See game chat camera has been turned off. They're really holding us back from greatness. Well, okay. Okay. You know, we've been doing it wrong. It's expand the main screen. Yeah. There you go. Yeah. Yeah. Yep. Nice. Oh, they want face. No, we want it. Yeah, let's just give them the whole thing. All right, chat. How do I join? Go back online. I'm online. I'm online. This is it. I guess I can give them a room code is probably what I should do. That's what I was saying. Yeah, I'll probably give you a room code, chat. Chad, I'm going to give you a room code. Get ready. Sorry. Send nuggies. Oh, no. There it is. Oh, okay. Chat, ready? I'm Well, send nugies when you got one or no. No, I'll I'll give you the code. All right, chat. Here we go. I'm going to give you a code. Make a room to compete. Yes, Batman. We nailed it with him. Yeah, he was a little",
            "start": 3248.72
        },
        {
            "text": "when you got one or no. No, I'll I'll give you the code. All right, chat. Here we go. I'm going to give you a code. Make a room to compete. Yes, Batman. We nailed it with him. Yeah, he was a little slow though. Let's bring up the settings. No, no details. chat. Also, make sure when you pass me, get a photo of my camera. All right? Then tweet it at us or Blue Sky, tweet at us. That's smart because when they capture, they're going to lose speed. And don't tell them that secret. God, you'd be so much cooler with this [ __ ] Ves, bro. 300 bucks, bro. And then we just don't tell anybody. Exactly. You get pulled over, you're like, \"Oh [ __ ] my friend My friend Dave gave it to me. I didn't know.\" Exact Oh, sorry, officer. My bad. Oh, how do I get how do we get a code? Press pause for the room ID. I don't see it. Here it is. Oh, boom. Join me. Join me. I'm pretty sure you're only sharing your camera with Greg, who will come on eventually. I Well, we'll find out. We'll find out. I'm also",
            "start": 3325.2
        },
        {
            "text": "ID. I don't see it. Here it is. Oh, boom. Join me. Join me. I'm pretty sure you're only sharing your camera with Greg, who will come on eventually. I Well, we'll find out. We'll find out. I'm also surprised that Greg hasn't noticed that we've sent him a bunch of invites. That's cuz he's driving to get his kid. That's a great call. Yeah. Why does Mike want the camera so bad? Um, just for the content. You know what I mean? Just for the content. I feel like that was a silly question. They got in China now, right? Uh, I think people are writing it down. Oh, wow. Wow. Oh, Jesus. Okay. Yeah, that's Remember, take photos of me if you drive by me. Uh, let us know if you can't see us. Remember, pause the race and let us know. Uh, items frenzy. I thought we' doing a knockout tour. You like Oh, yeah. We'll do race. No, I was just saying items. See where it says items? Normal. [ __ ] that normal [ __ ] What is items? Oh, normal. Fanatic. Yeah, frantic. Frantic. All right. Both had a hard time",
            "start": 3380.16
        },
        {
            "text": "We'll do race. No, I was just saying items. See where it says items? Normal. [ __ ] that normal [ __ ] What is items? Oh, normal. Fanatic. Yeah, frantic. Frantic. All right. Both had a hard time with that one. Fanatic. Fantic. Uh, put it 32 races. Well, no. I'm going to keep I'm going to kick I'm going to do new rooms so people can join in. Give everybody a chance. The people that are joining in are already going to join in. Well, there's there was some people like, \"Oh, how'd y'all join so damn fast?\" So, yeah, we'll we'll give them some new chances. They were ready. They read the room. Three races. The rules have been decided. Oh, intermission. Oh [ __ ] You put intermission of 5 seconds. Going to the beach. Chad, make sure you take photos of me. Oh, everybody's voting. that randomly decides. Let us know if you can see our camera. Oh, I'm the room owner. I should [ __ ] select the maps. None of this [ __ ] random [ __ ] Yeah, we're waiting to find out if you can see the photo. Yeah,",
            "start": 3439.04
        },
        {
            "text": "Let us know if you can see our camera. Oh, I'm the room owner. I should [ __ ] select the maps. None of this [ __ ] random [ __ ] Yeah, we're waiting to find out if you can see the photo. Yeah, we're fine. We want to know. We want to know again. You're in a group chat call with one person specifically. I don't have I only have you guys as my friends. I have five friends. Well, you did accept a bunch of friends or got get a bunch of friends. Yeah, I haven't accepted them yet. I need to. Oh, don't. It's going to slow everything down. You know how Andy gets Andy says never invite him. He doesn't want to be your friend, yo. You know how Mike says Mike says add me. Don't worry about it. Chad, remember Mike needs to get first place in all these. Do I win anything if you get first place in this? No, but you feel better about life. Oh, that's good. Oh, damn. I'll tell you what, a little hard to turn this uh jet ski. Oh, doesn't maneuver like it doesn't maneuver like the other one does. Menu.",
            "start": 3499.0
        },
        {
            "text": "No, but you feel better about life. Oh, that's good. Oh, damn. I'll tell you what, a little hard to turn this uh jet ski. Oh, doesn't maneuver like it doesn't maneuver like the other one does. Menu. Nobody said, \"Oh, Mike, I see your face.\" Put your controller down and type in, \"Mike, I see your face.\" Just for a second, we'll know you see him when you stop. All these kids want to win. That's all I can think about. Win. Jammy Cove fourth place right now. Turn your cameras on as well if you own a camera. Little Jacob says, \"Dang, I want to be in there, but I'm cooking dinner.\" Oh [ __ ] bro. You can always cook dinner later. Dinner at the same time, bro. Oh, he'd be chucking hammers at people like that. That's his thing. He's a hammer guy. I thought he like I thought he would just smack a hammer down in front of him. Oh yeah, bro. This is it. Mike, how'd you like Summer GameFest? Summer Gamef Fest? I enjoyed Summer Gamefest. A lot of games that uh I liked on that one. I was a lot I was",
            "start": 3554.56
        },
        {
            "text": "down in front of him. Oh yeah, bro. This is it. Mike, how'd you like Summer GameFest? Summer Gamef Fest? I enjoyed Summer Gamefest. A lot of games that uh I liked on that one. I was a lot I was much higher than the guys on that one. Oh, really? It's funny. I was very low on Xbox yesterday and they were all very high on it and I was high on uh Jeff Keley Summer GameFest and they were all low on it. Is it cuz last time you told Jeff Keley not that good? That's what people thought. That's what people thought. I said no. No, it's okay. You can I only gave him a good though. The other one I gave an okay to. Damn. None of them were awesome or exceptional or great this year. It was just okay and good. Kind of one of those years, you know what I mean? We're like living through like an awesome year of games, but like on the announcement side of things, they was fine. Resident Evil 9 was cool. Grounded two was cool. Oh, they they're doing Resident Evil 9. Yeah. Yeah. Yeah. Who won the",
            "start": 3619.68
        },
        {
            "text": "year of games, but like on the announcement side of things, they was fine. Resident Evil 9 was cool. Grounded two was cool. Oh, they they're doing Resident Evil 9. Yeah. Yeah. Yeah. Who won the predictions? I don't know. I wasn't on that stuff. That's when I was out. That's when I was in Florida ripping it up at the parks. Get out of the lava crab. Have we gotten a breakdown of at these parks? What's up? Have we gotten a break? No, I haven't spoke about the parks at all yet. I figure it out, man. God, the parks were so much fun. Now, interesting. No, it's the items. You see how Sha Raven, you can see Princess Peach. No, never mind. It doesn't matter. Do people see my face or not? Chad, now's your moment to exclaim yes, we see it or no, we don't. Mike, what about the state of play? I did not see the state of play. Nope. So, it's only showing your face to people in the call. How many of you want to join my voice call at one time? Let's see if we can break the voice chat. Let's not do",
            "start": 3676.16
        },
        {
            "text": "not see the state of play. Nope. So, it's only showing your face to people in the call. How many of you want to join my voice call at one time? Let's see if we can break the voice chat. Let's not do that. Let's not do that. Oh, why the [ __ ] are we going? Oh, next race is in 30 seconds. So, yeah, this is just messing around time in the world. Okay, that's cool. Which confused me. I was racing and then I'm like, \"Oh, well, I set mine to 10 seconds. Might have even been 5 seconds.\" Whoa. Check if uh check if anybody's selling the piranha plants camera at like our local Best Buy. Okay, I would get that 60 bucks maximum. If they're selling the cameras for more than that, that is a complete Do you want to stop the call the before we enter this next race? So they I guess I could so they not doing anything. Yeah. So C and I just like that call idea. I get it. It's great. And like when you're playing with friends, it'll work. We're going to make some great content out of that. Not with best",
            "start": 3738.24
        },
        {
            "text": "anything. Yeah. So C and I just like that call idea. I get it. It's great. And like when you're playing with friends, it'll work. We're going to make some great content out of that. Not with best friends, unfortunately. Nintendo. Well, the camera's for Mario Party as well. Y'all got to remember that's for Mario Party. Piranha. Piranha. Yeah, but I want the piranha plant worm. Um, well, it's not great. It's not great. How much? I mean, it looks like maybe it's available on the website. Resale sites. Oh, wow. $100, $85. On resale sites? What is a real sale? Resale site considered eBay. Oh, eBay. Okay. Max Gaming Store. Will anybody play Mario Party with you this time? Probably not. Probably not. eBay. Yeah, I guess you got to buy it from Corey. Can't buy one on Amazon. Oh, yeah. It's a tiny little lens on that. Yeah. I would like to see what the piranha plant looks like cuz looking at this camera, it is very small. It doesn't take up much room. It's very It's actually Well, that one's",
            "start": 3794.72
        },
        {
            "text": "little lens on that. Yeah. I would like to see what the piranha plant looks like cuz looking at this camera, it is very small. It doesn't take up much room. It's very It's actually Well, that one's better. This one's better designed. What? This one? No, the piranha plant cuz it goes on your switch and it sticks right out of there. What? It goes on the switch. Yeah. Get the [ __ ] out of town. Yeah. Oh, I thought it was just this but covered in a piranha plants. No, you pull it out. I'm I'll find in a second. Show me the images of that. That's cool. [Music] Hory camera. [Music] I got you, Jenny. Not on Amazon. Not on Amazon. Not on Amazon. So, I have to buy it off eBay. No, I mean, I think you can buy it from the Hory website. From the what? Horry website. Oh, that's like the company that makes them. Yeah. Not me saying a bad word. Oh, wait. It says Amazon. Available at Amazon and Best Buy. Yeah. So, there it is. That's not available is the problem. Best Buy. And then what you mean to",
            "start": 3868.96
        },
        {
            "text": "makes them. Yeah. Not me saying a bad word. Oh, wait. It says Amazon. Available at Amazon and Best Buy. Yeah. So, there it is. That's not available is the problem. Best Buy. And then what you mean to plug to the top of that? No. Oh, what the [ __ ] Yeah, dude. Yeah, you got to stop not trusting me. No, that's your TV that it clamps onto. What did I just say on that image? What did I just say? You said that on the switch. I said you got to stop not trusting me. That's the switch. I think that's sitting behind it. No, Michael. I know what I'm talking about. Oh [ __ ] Oh, that's sick. Yeah. Oh, the piranha plant's the must buy. But it looks like [ __ ] the bad camera. Well, yeah, the camera sucks, but like it it's for the fun of it. Yeah. Yeah, I'mma buy that. Uh uh uh uh. It's sold out everywhere. Yeah. All right, we're buying it on eBay. That's You don't have to. You can just wait. It's going to get restocked. No, they'll never restock it. It's a once and done. Next, I got to make",
            "start": 3928.24
        },
        {
            "text": "everywhere. Yeah. All right, we're buying it on eBay. That's You don't have to. You can just wait. It's going to get restocked. No, they'll never restock it. It's a once and done. Next, I got to make Mario or something dumb. You eating food today? Watch out everybody. I'm coming through. You trying to get a big old sandwich or what? What' you say? You trying to get a big old sandwich? Oh, no. I already had food, unfortunately, during that podcast. Oh, what' you have? I missed you. Some Starbucks with Raj as we talked about the Death Stranding 2 marathon stream. Anything good, chat? What are some fun ideas you got for the Death Stranding 2 marathon stream? How can we elevate it? Mike, totally unrelated to anything. Mind's Eye, that's a first-person shooter, not some sort of puzzle game. Uh, Mind's Eye is not a puzzle game. Mind's eye is like a Grand Theft Auto game. Think of it like that. Oh, in 20th place. I didn't even know you could go back this far, Chad. Well, you like paused",
            "start": 3980.28
        },
        {
            "text": "Uh, Mind's Eye is not a puzzle game. Mind's eye is like a Grand Theft Auto game. Think of it like that. Oh, in 20th place. I didn't even know you could go back this far, Chad. Well, you like paused playing for a long time. You're just kind of talking to yourself. Just running over people. Y'all just need to freak it again. I like that weird thing about eating healthy and cooking, but also like we still want to get weird and get like one bad food. You know what I mean? Have kind of funny crew members pick the meal. We still want you guys to vote on meals, too. We like that. Why you got to take it away from me? Rod should tether themselves together for the entire stream. Tether ourselves together. Well, he's just sitting now. Oh, you mean like anytime we walk, we walk. Make Nick pick the meals. Weighted vest. Weighted vest is good. Get a stair climber. We got to get a real We got to get a better treadmill. We got to get a real treadmill, y'all. What happened to your treadmill? Well, the",
            "start": 4026.56
        },
        {
            "text": "Weighted vest. Weighted vest is good. Get a stair climber. We got to get a real We got to get a better treadmill. We got to get a real treadmill, y'all. What happened to your treadmill? Well, the treadmill. Oh, they're they're both good. We just um we want to be able to incline and decline and raise the speed up. Yeah, that's why I have two. Well, Roger has one. I have one. Do you have one? Yep. It's now in my uh garage going to sit there forever. Worth it though. In what way? Feel like it's there just in case. If anybody want to walk me. How would you describe that as um we were backed up and ready just in case me and Roger blew up Leenzas, which I kind of ruined hers, but like she'll be fine. How'd you ruin it? I kind of like grinded up a lot. I kind of ate up a lot of the uh the felt on the treadmill itself. Oh, they picked a new Rainbow Road. They're going to ruin my surprise, but I'm ready. Let's do it. Mike, check the Walmart app to see if your local Walmart has any available",
            "start": 4094.04
        },
        {
            "text": "on the treadmill itself. Oh, they picked a new Rainbow Road. They're going to ruin my surprise, but I'm ready. Let's do it. Mike, check the Walmart app to see if your local Walmart has any available before you buy the resell. Okay. Well, I mean, maybe Costco, right? Sounds like Costco's [ __ ] around. Piranha plant. What you're talking about? Yeah, the Piranha Plant. I don't think Costco's selling the Piranha Plant. Sounds like Costco's got Costco's got hot dogs that we can go get, too. You say the word, I'll go, bro. Well, I mean, I'd watch. See, now you and I, that's what we should be getting for lunch is just going to Costco. Oh, Costco trip. I'll leave right now. We'll do it. Get it nearby. [Applause] Out of stock at Union. Look at us ripping. This is the new Rainbow Road available in Fremont and San Leandro. Is the camera. Yeah. At Costco. That's what No. Walmart. Yes. Fremont and San Leandro. Walmart and San Leandro. Never heard of that place. Oh, yeah. Yeah. I don't know. Is",
            "start": 4167.28
        },
        {
            "text": "in Fremont and San Leandro. Is the camera. Yeah. At Costco. That's what No. Walmart. Yes. Fremont and San Leandro. Walmart and San Leandro. Never heard of that place. Oh, yeah. Yeah. I don't know. Is that north or south? South. South. Okay. How far? Past San Jose. Um, no. It's where in the peninsula is Fremont. And so San Francisco Bay looks like this, right? Yeah. Uh-huh. Uh-huh. It's right here. Oh, it's on the southeast side. Oh, so it is past San Jose kind of. I mean, it might not be further south, but it is past on our side. If you go through the Bay Bridge, it isn't. Or the Hayward Bridge. You use the bridge. Three bridge view. Yep. Three bridge. It's that third view. That third. It's that third bridge. 60 bucks. New. What was your number? I said $60 maximum. Pick up today. [ __ ] Taking a drive across the bridge. Stop the stream right now. IRL IRL stream to the local Walmart in San Leandro. We get a cheeseburger. I send Roger all of the best food Tik Tok ideas in San Francisco",
            "start": 4221.52
        },
        {
            "text": "a drive across the bridge. Stop the stream right now. IRL IRL stream to the local Walmart in San Leandro. We get a cheeseburger. I send Roger all of the best food Tik Tok ideas in San Francisco Bay. Anytime someone's like, I got the best spot for X. I send it to Roger for maybe one day to just have like the best like, hey, we're going to go to the greatest X, Y, and Z spots in San Francisco. Do it with it. So I'm always ready, Daryl. Gavin, sorry [Music] Gav. Oh. [Music] Man, it's easy to get lost in the shuffle here, huh y'all? But nobody's like break out. No one's like so far away it feels like you'll never catch them again. Like in the old game, that's how it felt. In Mario Kart 9 or whatever the game it was, every time you'd play online, someone would bust out so far ahead. You're like, \"Oh, we're never going to catch that person.\" This time it doesn't look like that. Hi, Jenny. This map is huge. Map is huge. You got it. You got Rainbow Road. You play it yet, Kev? No. No. Oh",
            "start": 4281.12
        },
        {
            "text": "like, \"Oh, we're never going to catch that person.\" This time it doesn't look like that. Hi, Jenny. This map is huge. Map is huge. You got it. You got Rainbow Road. You play it yet, Kev? No. No. Oh [ __ ] Yeah. Like I said, I'm back, dude. Just like that. I'm back. [Applause] You ever got? Well, I was 20th place. So, a lot of people were saying he's he's not coming back. Sorry, Castle. Psych. You thought I didn't get you, but I got you, Castle. Psych. Sorry, [Music] Castle. Oh, and two. Gotcha. [Music] This is absolutely ripping. No. Someone stole all my [ __ ] I'm in fourth place. Make it fifth place. Make it seventh place. Oh, Luigi. Who did I just pass? Who's Luigi? Poor [Music] dude. If you're not first, you're last. Remember that. It's If you're not first, you're last. Jammy Cove. Jamie Cove took home the victory. Damn. Jonathan's nasty. Daryl's nasty. Gavin's [Music] nasty. I'm going full wheelie mode on a chat. I'm going wheelie mode on a chat. Finally. What they've been asking",
            "start": 4367.6
        },
        {
            "text": "Cove took home the victory. Damn. Jonathan's nasty. Daryl's nasty. Gavin's [Music] nasty. I'm going full wheelie mode on a chat. I'm going wheelie mode on a chat. Finally. What they've been asking for. [Music] Wow, it fits in really well. Damn, that was nice. That glided chat. This is nice. That glided in. Damn. No, I'm not. How do I switch controller usage, chat? It still thinks I'm using a controller. There we go. Nice. This is sick. All right. New new code. [Music] [Music] [Music] Funky jazz right now. Funky jazz, y'all. All right, join up. Join in. Thank you, Big [Music] Hammer. I love the console slash game so far. Yeah, this is nice. It's my first time turning it on. This is nice. What up, big dookie? Try knock. Yeah, we're going to do knockout next. One more. One more. Get in here. One more. Pe time. John, Mr. Pit, Phillip, Antonio, Daryl's back, [Music] Adam. All right. So, how do I go on this? Oh, [ __ ] Didn't cuss. What' you say? Oh, when I didn't cuss. Yeah. Yeah. I'm I'm",
            "start": 4503.24
        },
        {
            "text": "One more. Pe time. John, Mr. Pit, Phillip, Antonio, Daryl's back, [Music] Adam. All right. So, how do I go on this? Oh, [ __ ] Didn't cuss. What' you say? Oh, when I didn't cuss. Yeah. Yeah. I'm I'm trying to get back to it. No, when we all did it. Oh, when we tried to do that, that was so much fun. [Music] Oh, it doesn't turn though with the wheel. No. Why does it turn with the wheel, chat? It should turn with the wheel. It has. You You probably have to set it. I probably have to put the gyros on it. Motion controls aren't on. You have to turn on that motion control. [ __ ] How do you do that, Chad? Tell us quick. Tell us quick. Nobody go. Nobody go. Tilt controls on. Oh yeah. Watch the [ __ ] out. Oh, you're not doing well. Well, I'm trying to so so it's in the camera, but I can't. I mean, you definitely cuz then it's in my face. If I put it in the camera's view, it it's there. Are you not hitting bow? Maybe. Go faster. Faster. [Applause] Get off me, [Applause] John. Damn it, John.",
            "start": 4670.2
        },
        {
            "text": "you definitely cuz then it's in my face. If I put it in the camera's view, it it's there. Are you not hitting bow? Maybe. Go faster. Faster. [Applause] Get off me, [Applause] John. Damn it, John. Oh, I'm going so slow. [Applause] Come [Music] on. Oh, [ __ ] you. [ __ ] you, Waluigi. dude. Oh [ __ ] How do I spectate other people would be sick. You only watch first place. You're lying. Yeah. And then if you if you clink in like if you leave, I think it ends it. It ends the whole race. That's so funny. You know what I'm going to do? I'm going to get I'm going to get gold in every single Grand Prix, but only with the wheel. That That's what my That's what the YouTube title will be. Mike gets gold in every Grand Prix, only using gyro controls. So lit. Peak. I'm not well enough for that yet. Or else I would. You got to remember your boy stomach mic. not well enough for that. If I they're saying give us some commentary, but if I give you commentary then I I I won't be well. But I will say",
            "start": 4768.36
        },
        {
            "text": "Or else I would. You got to remember your boy stomach mic. not well enough for that. If I they're saying give us some commentary, but if I give you commentary then I I I won't be well. But I will say we'll keep up with who's up first. I wish they gave us more like give us the map layout so I know like who's close to cut time. They should they should really expand on this cuz that would be sick. You expand on Mario Kart television and we we got ourselves a hit here. That's Nintendo Switch 3 though. That's Nintendo Switch 3. [Music] Yeah, we got somebody tweet that out. Hey, dear Mario, what are we doing here? I'll tweet it out right now while we watch. Feel like warrior. Oh, you're never mind. My ass. [Music] Hey, hey, [Music] Hello, baby. Oh, big dookie. Yeah, you can. Heat. Heat. [Music] would you call it placement standings or order standings? Like if I wanted on the side of my map to go 1 2 3 4 5 6 7, what would you call that in race terms? Placement positioning. Placement",
            "start": 4901.36
        },
        {
            "text": "[Music] would you call it placement standings or order standings? Like if I wanted on the side of my map to go 1 2 3 4 5 6 7, what would you call that in race terms? Placement positioning. Placement standings sounds right, but placement standings. I don't know anything about racing. Player. Oh, it feels good. Racer. Racer standings. How do you say like 1 2 3 1 through 10? That's what we want to see. BMW. BMW's freak mode in it. Why is it dark? Oh, can you move it? Oh, is that what that is? Oh [ __ ] That's crazy. No sleep mode. Pole position. Running order. Do you like running order? It's literally position is common. Pole position is just the person who starts first. Yeah, we don't want pole position. We want it to be like live up to date. I want like I want see like Boo B Bu just got taken over by Adam. Adam's now first. But I want to know who the next seven racers are behind them. Let's just do racer standings. Lobby. Lobby standings. Live position. Live current top 10. [Music] I",
            "start": 5130.54
        },
        {
            "text": "over by Adam. Adam's now first. But I want to know who the next seven racers are behind them. Let's just do racer standings. Lobby. Lobby standings. Live position. Live current top 10. [Music] I like that. I like that. All right. So, right now I say I got, \"Hey, Mario Kart team, we got to expand on this Mario Kart TV spectator feature. You could really have a You could re you could have a really fun hit on your hands with a little more functionality. Spectate all racers, not just first. Mini map to see the lap/cutoff points.\" Current Current 10. No, current top 10. Uh current top 10 dur during race. What else do we need driver standings? [Music] position they would be in the race. Yeah, that's why it's like driver. See, that one's a weird like how do you call what do you say on that one? That's why I want the mini map and cut off points, Cam Kennedy, so you know at who's at risk so you can be like, \"Oh snap, Cameron Kennedy, you're at 20th place. You need to get up to 17th mini map to",
            "start": 5224.4
        },
        {
            "text": "why I want the mini map and cut off points, Cam Kennedy, so you know at who's at risk so you can be like, \"Oh snap, Cameron Kennedy, you're at 20th place. You need to get up to 17th mini map to see lap/cutoff points. I got that current running order.\" Do you think that sounds good? Do you think people would understand that, Mario? [Music] It's just top 10. Current top 10. Let's just do current top 10 during race. You know what they need? They need a uh lobby spectate like um like uh uh Smashitt where it's like, \"Hey, you can join my lobby room, but if you're not racing, you can spectate. You're just sitting here just saying what we're all thinking.\" Dude, we're [ __ ] putting it down. These are the things that people won't say to you, and I'll say it cuz I'm here for the multiplayer experience. Mike will tell you, \"Hey, man, you got [ __ ] in your teeth. You got Hey, go to the bathroom. Get yourself a little dental floss. Attack it. Don't ever be the rally card. It's very slow, Kevin.",
            "start": 5380.08
        },
        {
            "text": "Mike will tell you, \"Hey, man, you got [ __ ] in your teeth. You got Hey, go to the bathroom. Get yourself a little dental floss. Attack it. Don't ever be the rally card. It's very slow, Kevin. Oh, yeah. Yeah. We decided that one's too slow. You thinking of the steel rule? Oh, yeah. Yeah. Yeah. Yeah. It's more fun. So, what kind of sick were you, Mike? Uh, thankfully not COVID. Probably the flu, though. No, I mean like coughing, sneezing. Uh, I was stuffed up pants. First two days I had a sore throat. Then it became a light cough. Stuffed up all the way through. Head fog and then dropped it all back to life between us. Were you making it up? No, but I was licking handrails. Oh, that's licked a couple handrails. That's a bad idea. Did you really lick a couple handrails? No, you're better than that. Mike, do you have any light sensitivities or aches? No, not at all. I do. What does that mean? Chad, what would that mean? Mike's got crabs. Hi, Alexander. Hello, Amita. Hey, man. Hey, Mario",
            "start": 5450.32
        },
        {
            "text": "that. Mike, do you have any light sensitivities or aches? No, not at all. I do. What does that mean? Chad, what would that mean? Mike's got crabs. Hi, Alexander. Hello, Amita. Hey, man. Hey, Mario Kart team. We got to expand on this. Mario Kart TV spectator feature. You can have a really fun hit on your hands with a little more functionality. [Music] I mean, I'm I'm I'm saying all races, not just first. I'm right here. Mini map to see laps cut off points. Current top 10 during during race. [Music] Who said that last comment you read? Uh what if I had uh sensitivities? Bow guards. No, no, no. About not being able to get in. Oh, I don't know. I don't remember that. Oh, no. Don't worry about it. I appreciate how much thought is going into this tweet. Oh, yeah. Yeah. Yeah. Jay, this is how all of my tweets go. Jay, if you don't know, I force a lot of my friends, Washburn, JD, Kevin, Maddo, uh, Andy has been a part of it where we reread all my tweets and I am very hyper sensitive and",
            "start": 5507.76
        },
        {
            "text": "all of my tweets go. Jay, if you don't know, I force a lot of my friends, Washburn, JD, Kevin, Maddo, uh, Andy has been a part of it where we reread all my tweets and I am very hyper sensitive and conscious about my tweets and I overthink them when Twitter literally just write when people on Twitter and Blue Sky just write, \"I like dookie.\" and they get millions of likes and there's Mike spending 45 minutes on a tweet that will get like four likes and nobody will ever care about in five minutes. You know what I mean? So, I try I try my best. [Music] [ __ ] We're over 280. 280. What does that mean? On the tweet. You can't be over 280 characters or else then it goes into the can't see it and you know people don't click on that stuff to read that. So you got you got to get in there. You got to make it easy. You know what I mean? What happened? Uhoh. That was [ __ ] wild. Yeah, that was crazy. I'm wall riding. Commit to it. Commit. God damn it. Dude, it's hard with the wheel. Oh [ __ ] If",
            "start": 5592.96
        },
        {
            "text": "make it easy. You know what I mean? What happened? Uhoh. That was [ __ ] wild. Yeah, that was crazy. I'm wall riding. Commit to it. Commit. God damn it. Dude, it's hard with the wheel. Oh [ __ ] If you if you if you're lower than 20th, you get kicked out. I know. Yeah, that's the knockout mode. Yeah, you you got to I got to get up cuz you got to wait till they're all done eventually. We're almost at the end of it, too. Chad, let him get there. I think the wheel is slowing me down. Yeah, 100%. Like on the wheel, I don't think the wheel lets you go top speed. Just to be clear, I I think that Oh my god. How they going to get you like that? Come on. Come on. Come on. Come on. Come on. Like people are just going faster than me. I think you're just I think the wheel might be slowing me down. Might not be holding down a properly. I made it. I made it though. Oh my god. Just barely, bro. really two away from not making it. Nobody went left. Everybody went right. Why would they do that? Me and",
            "start": 5682.72
        },
        {
            "text": "not be holding down a properly. I made it. I made it though. Oh my god. Just barely, bro. really two away from not making it. Nobody went left. Everybody went right. Why would they do that? Me and Lena. Lena. Lena. Which one is it? Lean with a rock with it. Lena, man, I'll tell you what, these Mario Kart games, they got incredible music. He's grinding the whole level. I didn't even get close. That didn't help me at all. [ __ ] dude. Oh my. Watch the [ __ ] out, bro. We're coming to get you, bro. First place, y'all. I'm going to make so much pizza today. Like, I'm making a lot of pizza today. You're eating pizza? Oh, yeah. Got an oven. Oh, pizza oven. Yep. I made it into the third race. Nice. 123 better. You got this, bro. Oh, you can still steer steer with the little joystick in the middle, too, if I need to. But I wouldn't cheat. You don't need to. You're that good of a gamer. Gamer, [ __ ] you, language. Heat. Heat. Dude, your boy's in it to win it. Oh, [ __ ] you. Oh my god. I've",
            "start": 5791.68
        },
        {
            "text": "too, if I need to. But I wouldn't cheat. You don't need to. You're that good of a gamer. Gamer, [ __ ] you, language. Heat. Heat. Dude, your boy's in it to win it. Oh, [ __ ] you. Oh my god. I've been here. [ __ ] you, Mr. Pit. Heat. Heat. [Music] Phil, I'm on that ass. Phil, he going to get you. I'm on that ass, Phil. Eight place or eighth place or higher. He's shrooming it up. I'm on that ass, Phil. Oh, he didn't get touched by the lightning. That's the third. That's the first spot. He's holding it down. You've been doing frantic uh items. Frantic items. They don't do they don't let you choose items on this one, I believe. Oh. Oh, you dominated, bro. You made everyone look like clowns right now. I don't want to make a big deal about it, but that was impressive. Just remember, Chad, I'm going to get all go I'm going to get all gold with just motion controls. That's my piece of content I'm going to do for the week. [Music] Luna. Oh, thank you. [Music] Send it, bro. Send your la cuz",
            "start": 5906.32
        },
        {
            "text": "going to get all go I'm going to get all gold with just motion controls. That's my piece of content I'm going to do for the week. [Music] Luna. Oh, thank you. [Music] Send it, bro. Send your la cuz you're going to sleep. Oh, you wish, Mr. Pit. I saw that move. You're a dirty dog. [Music] Oh, come on, Mike. Top four. Oh my gosh. Oh, you weren't in the top four. Got you. Dude, I played well, y'all. You played so well. Not bad. I almost made it. Kind of think the other kids were cheating. Doing it all with the wheel. Doing it all with the wheel. What's happening? Oh, is this like the final? Yeah, they're still racing. Oh, wow. Okay. Yeah, you got you got to keep watching now. Mr. P, first place. Can you unlock costumes while you're playing multiplayer? I didn't know you could do that. Oh, can you did you? You could have a hit on your hands with a little more functionality. Are you still writing this tweet? Yep. Man wants to be heard. Good for you. Good for you. Winner Mr. Pit. I was I",
            "start": 6070.96
        },
        {
            "text": "can you did you? You could have a hit on your hands with a little more functionality. Are you still writing this tweet? Yep. Man wants to be heard. Good for you. Good for you. Winner Mr. Pit. I was I was on that ass though. Whose ass was I on? Actually, where are [Music] you? There's someone else. It was Phil. I was on that ass, Phil. I was on that ass, Phil. I don't I don't like when you get that into it. Freaks me out. No, no, no, no, no, no, no, Phil. That's what I said to you. Tell Let's go for a couple more. Let's have some fun. This game rocks. Gregy's in. Greggy's playing. Look at Greggie playing video games. I'm going to be Bowser this time. See if Bowser plays a little bit better. The junkyard hog. That's what they call me in the sheets. I don't like it when you say num nom nom nom. He's the junk. Remember, it's June goon. He's not doing it all. June, but he's getting full. What was it? June. Uh, he streamed every day in May. Stream every day in May. Goon every day in June.",
            "start": 6194.8
        },
        {
            "text": "nom. He's the junk. Remember, it's June goon. He's not doing it all. June, but he's getting full. What was it? June. Uh, he streamed every day in May. Stream every day in May. Goon every day in June. Oh, goon all of June. So, watch out. And Anniey's on a gooning spree. Oh, so you Okay. You're making stuff up about Andy. No, no, this was that was the whole thing that we were teasing. He was teasing throughout. [Applause] We got to bring good back. I'm going to read what is it? Midnight Goon to my son. Okay. Midnight Goon. Yeah. You know, we should give you the 2025 edition of Midnight Goon for your son. That's the 2017 edition. No, no, but like the updated one from from Gen Alpha. At midnight, I turn the lights down. My cell phone light glows. My palms are hairy. A thacking comes through. My vision slightly blurry. We could probably write that book. Sell it. We can sell that book. I think we should. We should. We You know what? That's a KFAF bit. Tell Roger that right now. Roger. I got",
            "start": 6285.28
        },
        {
            "text": "vision slightly blurry. We could probably write that book. Sell it. We can sell that book. I think we should. We should. We You know what? That's a KFAF bit. Tell Roger that right now. Roger. I got a really fun KF bit. [Music] That's right. [Music] Yeah, he's on it. He's on it. We got to do that, y'all. We got to do it. Hey, Mario Kart team. We got to expand on this. Mario Kart TV spectator feature. Midnight goon. Spectate all racers. Not just first grade got me that book. See? Really? Yeah. Meant something different in 2017 when they wrote it. [ __ ] How many letters am I over? Just tell me how many letters I'm over. Send it, bro. Just send it. Be the change you want to see. You know what I mean? Why won't they tell me how many letters were over? Let's find out. What am I thinking? What am I thinking here? [Music] [ __ ] I did it. Chad, I need y'all to run this up though for me. All right. [Music] [Music] [Music] Do you put a gy on this? What would you put it on, chat? What would you",
            "start": 6357.36
        },
        {
            "text": "I thinking here? [Music] [ __ ] I did it. Chad, I need y'all to run this up though for me. All right. [Music] [Music] [Music] Do you put a gy on this? What would you put it on, chat? What would you put on this tweet, Kevin? A photo? A gy? Nothing. Uh, nothing. Uh, maybe a photo. a photo of just Mario Kart World. Yeah, but with your face on it, you know, like Mario on there, but instead it's your face. Our thumbnail. Today's thumbnail. That's what you would use for the official Nintendo people to take you seriously. I mean, they're never going to take you seriously, Mike. That is true. Yeah, but Uh-huh. I send it to them and then all of a sudden they're like, \"Mike, come out to Tokyo. Help us.\" Just so you're clear. You think that you This is your This is an original thought no one else has said. Yeah. Okay. Okay. This is Mike, I want you to know this is one of those uh like when you were like, \"You know what? I'm going to make a joke about the TSA.\" I have more TSA jokes. Oh, let me",
            "start": 6458.92
        },
        {
            "text": "said. Yeah. Okay. Okay. This is Mike, I want you to know this is one of those uh like when you were like, \"You know what? I'm going to make a joke about the TSA.\" I have more TSA jokes. Oh, let me hear. I had an insane TSA situation. Let me hear it. You ready for this one? Yeah. All It's not a joke, but I'm just telling you the situation. You ready for this? Everybody get in line. Put your bags in the Put your bags in the container. Push them through. Get in. No shoes off. No laptops and cameras out. Just put your bags in the containers. Walk on up. Then I get up there and they go, \"Do you got a laptop in this?\" I go, \"Yeah.\" She goes, \"Why didn't you take it out?\" Because the lady didn't say anything. Why are we changing the rules up every time, Kevin? That's [ __ ] It's not my fault that as a TSA agent, maybe you're tired at the 6 a.m. shift, but if you've chosen that shift, bring it. It could have been a first class link, though. You think so? Well, here's another one. So, I buy",
            "start": 6578.64
        },
        {
            "text": "as a TSA agent, maybe you're tired at the 6 a.m. shift, but if you've chosen that shift, bring it. It could have been a first class link, though. You think so? Well, here's another one. So, I buy this first class ticket. I get premium access to security lines. I show up, it's 6:00 a.m. The lines are all minimal. I walk up to the premium access lady. I go, \"Hey, I have this. Can I go through?\" Oh, no. It's not open yet. What do you mean it's not open yet? Yeah. First class flight. What do you mean it's not open yet? Then I go to Orlando. I'm in Orlando. I say I have the premium access. Oh, we don't have that here. What does that mean? What does that mean? What do you mean? You don't have that here. Why are you offering it? Why are we selling this as a as something that You got to take advantage. I bet you they did. They were just like, I don't [ __ ] like You know what made up for it, though? Shout out to Orlando. Shout out to Linda. Linda at the United uh VIP like box. You know what I",
            "start": 6630.48
        },
        {
            "text": "I bet you they did. They were just like, I don't [ __ ] like You know what made up for it, though? Shout out to Orlando. Shout out to Linda. Linda at the United uh VIP like box. You know what I mean? I've never been in one before. My first time I walk up, I say, \"Can I go in here?\" And Linda looks at me and she goes, \"You technically can't, but you know what? You go have some fun, honey.\" Listen, Linda, your hair looks good today. Thanks, girl. And she let me in. I think all these people are messing with you. She let me in. So, I'm just letting you know, Chad, at every airport and there's something different. There's something different. Pick a lane. Pick a lane and stick to it, y'all. Just pick it. So, what was first class like? I know you'll The lounge or the seats? The seats. Um, I mean, the seat is fine. Seat's comfortable for me cuz I'm fat. I'm telling you the seat is fine. Well, like remember the time remember the time when I thought I was sitting in the special seat, the",
            "start": 6674.08
        },
        {
            "text": "I mean, the seat is fine. Seat's comfortable for me cuz I'm fat. I'm telling you the seat is fine. Well, like remember the time remember the time when I thought I was sitting in the special seat, the business class seat and I spent a lot of money for that and it wasn't the business class seats. Those seats sucked. Those seats sucked. Never forget that. Where did I go for that? Why did I buy that ticket? Which one? Which trip was that from? Me and Me and Blessing to Chicago. Massive bad idea. Yeah, we all remember we all told you that. Yeah, we're like, Mike, you can't put any more money on that credit card. Don't do that, Mike. Smash Bros. Boom. God damn, we're having a great time. Run it up. I skied it. I BS it and I tweeted it. You BS it? Yeah, that's what that's what uh Greg is calling uh Yeah, I know. Blue skies. I don't I don't like when we just blindly back him up. Man's a psychopath. I I'll follow him anywhere. I've heard that about you. Count. Just know that now I'm not",
            "start": 6714.8
        },
        {
            "text": "uh Yeah, I know. Blue skies. I don't I don't like when we just blindly back him up. Man's a psychopath. I I'll follow him anywhere. I've heard that about you. Count. Just know that now I'm not looking at my phone. Get ready. Yeah, you watch your [ __ ] this time. I'm [ __ ] on the motion controls. If you guys really wanted to race me, you would all be racing motion controls. Just so you know how this would go. Why y'all so damn scared? You all if you all wanted to step up to Mike, you'd race on motion controls like a real racer. Yeah, but instead you're all scared. God, you make us mad. Mike, you mad? No, it's cool. I I think you Here we go. Come on. Pick me. No. Cherries. Double cherries. Here we go. Oh [ __ ] the cherry's a long one. I want to know Kevin, did you watch uh where warfare box war a movie? No, I did not. Is it good? Should I watch it? Here we go. I didn't get the boost cuz I was looking at other stuff. Not the lianders here. I'm on that ass Phil. Don't say it that way.",
            "start": 6775.28
        },
        {
            "text": "box war a movie? No, I did not. Is it good? Should I watch it? Here we go. I didn't get the boost cuz I was looking at other stuff. Not the lianders here. I'm on that ass Phil. Don't say it that way. I'm on that ass, Phil. Say it that way. Midnight goon. Midnight goo. As my parents go to bed. Jesus Christ. I stay up late. Nightlight providing a nice gloom. A nice nice Oh, man. We got to write this. [ __ ] We got to start writing these ideas down. Or we don't. You never know. You never know, chat. These are one of those things where like you make what? You make this. The guy who makes this makes a million dollars plus and then all of a sudden like retires and changes his life. You know what I mean? A million dollars will do that. I mean, if we had made a million dollars off of Midnight Goon, that would be pretty sweet. For sure. You and I are going to have a great time. Yeah, exactly. They got that Midnight Goon money. They got that Midnight Goon money now. Oh, you mean the book that",
            "start": 6836.6
        },
        {
            "text": "that would be pretty sweet. For sure. You and I are going to have a great time. Yeah, exactly. They got that Midnight Goon money. They got that Midnight Goon money now. Oh, you mean the book that came out in 2017? Oh, no. No. God, no. This is 2025 for I haven't seen one. Never heard of it. Everywhere I see you. I don't Mike, I need you not to be at the bottom spot. I'm trying, man. Everybody keeps eating up the eating up all the items. I don't need to bring it up. 22. You're getting cut. Not getting cut now. There it is. Squeeze that [ __ ] Squeeze it. Oh, I through the grass. You're insane. He just went up 10 levels. Oh my god. Seventh [ __ ] place. Motion controls, bro. He's got it like that. Oh, six. Damn. Chad, I know you were thinking, \"Oh, he's going to be out.\" And I saw that lunch box from that kid, too. Yeah, I saw that. He said, \"That's my in-n-out.\" What's over your lunch, bro? Swoop. Swoop. [ __ ] you. Language. The hammers kind of suck. [Applause] Oh my god, the devil's",
            "start": 6906.36
        },
        {
            "text": "box from that kid, too. Yeah, I saw that. He said, \"That's my in-n-out.\" What's over your lunch, bro? Swoop. Swoop. [ __ ] you. Language. The hammers kind of suck. [Applause] Oh my god, the devil's contraption. Get off me, ladybug. Get off, ladybug. Don't touch you, Jinxy. Don't touch me like that, ladybug. I ain't like that. You tell her. Oh. Oh no. Bomb hit me. Come on. I like when you you tell people it's like that. Oh, come on. I'm like that. I'm in. You say chat. It's like that. It's like that. Shoot. Stop hitting me. Get up. That got spicy quick. That got really spicy. I'm out. Come on, Mike. I'm out. Mike, don't do this to me. I'm out. Come on. Get them coins. Get them coins. Come on. Oh, yeah. You're out. You're out. Got beaten by Vin. He's the worst. Sorry, Vin. I didn't mean you guys look back. Y'all look back. You're crazy. Yeah, you can tap a button to look back. Yeah, if we could only spectate, man. Why don't they do that? Why is Nintendo so stuck in 2002? Write another",
            "start": 7008.64
        },
        {
            "text": "guys look back. Y'all look back. You're crazy. Yeah, you can tap a button to look back. Yeah, if we could only spectate, man. Why don't they do that? Why is Nintendo so stuck in 2002? Write another draft another email. Thank you not Lander for playing with us. What's that one? [Music] They're so 2000 and late. Come on. You're too funny. Shout out to Big Dookie. King Cow in first place. Move over. Not expecting you to go. Big Dookie with a sizable lead right now. Heading towards the next checkpoint. Golden Shell. Red Shell on Big Dookie's butt. Big Dookie takes the red shell. Still holding on to first place. Can they get back up to high speed? No. As big hammer, the little yellow orange orange Yoshi. We're going to call it the golden oi. Yoshi actually. Golden golden dino taking over first place. Riding that choa motorcycle right there. Vin says that was fun. Vin, no one told you he can stop. Big Hammer still holding on as Big Dookie looking back at him. Three green shells behind him.",
            "start": 7127.44
        },
        {
            "text": "place. Riding that choa motorcycle right there. Vin says that was fun. Vin, no one told you he can stop. Big Hammer still holding on as Big Dookie looking back at him. Three green shells behind him. The cow trying to catch up the golden shell takes out Big Dookie. And uh-oh, Big Hammer has a sizable lead here, y'all. Mike, if you could sneak a It's going to be a wet win. Yeah. Okay. Okay, we can do that. We can do that. Big hammer now getting up towards the food. Yoshi's fast food drop off. Going to get a nice meal. Oh, it was actually a tropical punch. That's going to be a wet one right there. And look at Big Hammer go. Big Hammer about a probably about a 15 person lead in front of the next car. You always want to give two car lengths ahead of the driver in front of you. That's called safe driving, ladies and gentlemen. Always be aware of tail lights, brake lights, and people in front of you. Big hammer dominating the opposition right now as he's tearing up the courts. Blue Shell",
            "start": 7238.64
        },
        {
            "text": "safe driving, ladies and gentlemen. Always be aware of tail lights, brake lights, and people in front of you. Big hammer dominating the opposition right now as he's tearing up the courts. Blue Shell incoming. Blue Shell live goes across the cut off point. And Big Dookie, Big Dookie the cow's going to take first place right there. Big Dookie now in control. Let's see where Big Dookie goes. Got a green shell for protection. We know that the blue shell though will dominate all. And here comes a number of green shells coming on Big Dookie's backside. None will hit him. Big Dookie will hold on to the green shell. Going left to right, cutting down the cutbacks right now and using the drift. Look at this cow. Moo. And oh wow, Big Dookie. First place Big Dookie. Where did Big Hammer fall to? I don't see Big Hammer at number two. Big Hammer after taking the blue shell will take third place. That was good. Chat, put a one in the chat if you want to do one more for the day. Or do we call it one",
            "start": 7300.88
        },
        {
            "text": "see Big Hammer at number two. Big Hammer after taking the blue shell will take third place. That was good. Chat, put a one in the chat if you want to do one more for the day. Or do we call it one more for the day, chat? One more for the day. Put ones in the chat if you want to do one more. Chad, don't make it about yourself. We got him. They going be here all day with us having fun. One more. Chad, here we go. Mike, what are you doing this evening? What' you say? What are you doing this evening? I'm going to play this game and I'm going to try to get every single golden trophy with just motion controls. That's crazy. That's what I've decided to make my day about. How fun is that? That's great. I'm going to be Yoshi this time or Luigi this time. Why? Luigi. Nah, just Luigi. Here we go. [Music] W Luigi. Oh, Ben, thank you for the tier one sub for one full year. Shout out to Ben for the love. Hi, Ben. Good job, Big Dookie. Chad, I want to see you like these tweets. Like these skates over",
            "start": 7359.84
        },
        {
            "text": "W Luigi. Oh, Ben, thank you for the tier one sub for one full year. Shout out to Ben for the love. Hi, Ben. Good job, Big Dookie. Chad, I want to see you like these tweets. Like these skates over on Blue Sky or else Nintendo won't know. Get them up. Let's let Nintendo know. Twitter. Blue Sky. Put them up right now. Help me out. Run that number up a little bit more. There's a thousand of you watching right now. Only 47 of you liked on Twitter. What are you doing? The hell is wrong with you? And don't tell me, \"Oh, Mike, we're exclusively on Blue Sky.\" Cuz only 24 of you liked the tweet on Blue Sky. Where we at, chat? Why are you doing Where we at, chat? Get in here. Treat him with the respect that he's earned. I'm not on either. Mr. Anderson says you get a pass. But you're my only pass. Mr. Anderson. No. Okay. But here's what you need to do. Go to M Go to Mrs. Anderson. Tell her to like it. Or tell tell your father. Mr. Mr. Sounds like he can make two accounts right now and help out",
            "start": 7426.64
        },
        {
            "text": "Mr. Anderson. No. Okay. But here's what you need to do. Go to M Go to Mrs. Anderson. Tell her to like it. Or tell tell your father. Mr. Mr. Sounds like he can make two accounts right now and help out twice as much. Now you got to make two accounts is what Kevin said. But Mike Mike agreed. Pontton says, \"I'm not on either.\" Pontan, I know your ass can do something. Okay, bro. We seen you on the internet. You talk to him for a second. Tell me. Oh, I'm going to run an ad. Oh. Oh, that's right. This episode's brought to you by XRE. Y'all know that a few months ago, my life changed forever when I brought a pair of XRE1 AR glasses on a long flight to New York. I legit could not believe how easy it is to use and high quality my experience was playing games, watching movies, TV shows on the plane without just too much extra stuff around me or especially not a giant goofy headset around my head. No joke, this is my favorite new tech product in years and it has earned a permanent spot in my",
            "start": 7489.76
        },
        {
            "text": "without just too much extra stuff around me or especially not a giant goofy headset around my head. No joke, this is my favorite new tech product in years and it has earned a permanent spot in my travel bag. It is only hard to believe that it works as well as I'm saying until you try XRL1 AR glasses for yourself. And then you will see that the future is now. The tech is here. Connect XR1 glasses to wherever you are playing. Whether it's a handheld console, a PC, phone, home console. You just get a massive 150in virtual screen anywhere, anytime for any game. Gaming on the go like a long haul flight, you need the XR1. Neck starting to hurt from staring down at your handheld. We've all been there. You need a next real one. A screen as big as your wall. Instant plugandplay with all of your devices via USBC. Built-in audio with sound by Bose anchoring your screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full HD. These are what make XR1 a musthave. And we hear",
            "start": 7542.32
        },
        {
            "text": "via USBC. Built-in audio with sound by Bose anchoring your screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full HD. These are what make XR1 a musthave. And we hear XR1 Pro is coming soon with an even bigger virtual screen. Hit our link below to get your XRE glasses today. There's nothing better than when a sponsor of Kind of funny is something that we are legitimately obsessed with. And that is exactly the case here with XRE. You're going to hear me talking about these forever. Go to kind offunny.com/xreal. That's kind of funny. I promise you, you are going to love these things. This episode's brought to you by Factor. Summer Gamefest is here. The Switch 2 is here. The sun is here. So many summer things are here and the number one thing you don't want to be doing all summer, spending hours cooking inside. That's where Factor comes in. Factor chef crafted dietitian approved meals are ready in just 2 minutes. Taking the hassle out of eating well. We love",
            "start": 7589.36
        },
        {
            "text": "doing all summer, spending hours cooking inside. That's where Factor comes in. Factor chef crafted dietitian approved meals are ready in just 2 minutes. Taking the hassle out of eating well. We love Factor here at Kind of Funny and Greg's often making and enjoying meals quick in between shows here in the studio. I just had a roasted garlic chicken m and I'm telling you, you would have loved it. Factor meals arrive fresh and ready to eat. Perfect for any active lifestyle over summer and beyond. With 45 weekly menu options, you can pick gourmet meals that fit your summer gains and goals. Choose from options like calorie smart, protein plus, keto, and more. Get started at factormeals.com/kindfunny50 off and use code kind of funny 50 off to get 50% off plus free shipping on your first box. That's kind of funny off at factormeals.com/kindfunny50 off for 50% off plus free shipping. backtomails.com/kindfunn 50 off. Welcome back ladies and gentlemen to Mario Kart TV. I'm your host Snow Bike",
            "start": 7640.32
        },
        {
            "text": "kind of funny off at factormeals.com/kindfunny50 off for 50% off plus free shipping. backtomails.com/kindfunn 50 off. Welcome back ladies and gentlemen to Mario Kart TV. I'm your host Snow Bike Mike alongside my co- commentator big dog Kevin Coelloo as we rip up the streets of Mario Land right now in your final knockout series of the day. June 9th, 2025. It's a cool easy night here in Warrior World and we're looking at 24 dragsters tear up the track and eat pavement in the chance to be number one and be crowned today's champion. Oh [ __ ] that's a good one. Oh yeah. Um, good night goon is what it is. Good night goon. Yeah, look at that person looking out the window. I mean that maybe this book is that. No, it isn't. I've looked through it. As we take a look at our racer for the day, our profile racer is Luigi aka Snowike. Mike, your commentator for the day/raer. And will he get kicked out? Are you kidding me? He's already kicked out. Are you kidding me? First pass. He's already kicked",
            "start": 7684.64
        },
        {
            "text": "racer is Luigi aka Snowike. Mike, your commentator for the day/raer. And will he get kicked out? Are you kidding me? He's already kicked out. Are you kidding me? First pass. He's already kicked out. I was looking at Midnight Goon. Run it again. Run it again. [ __ ] them all. We will now go alongside first place as we take a look at Wario with that killer mustache holding down the first place pole position. Let's see what's happening here as Alexio rips and tsio. Alexio, our boy Alexio. Alexia rocking the Tonka truck going to take two red shells to the behind. And now Rex will take first place with Rorio. Yo, Lexio, win it for us, bro. Or we'll never speak to you again. I'll block your phone number as we take a look at the backside. Wario just working it out right now. Trying to hold down first position, trucker cap on just rocking the hog. I mean, he's doing it classy if I'm honest with you. I mean, this is the Wario you want to see. Yeah, I I believe that is the same motorcycle he",
            "start": 7750.0
        },
        {
            "text": "first position, trucker cap on just rocking the hog. I mean, he's doing it classy if I'm honest with you. I mean, this is the Wario you want to see. Yeah, I I believe that is the same motorcycle he uses in Smash. Nice. To smash, if you know what I'm saying. Now, as Wario smashes along the track, going to grind on this rail. Nothing better than lip sliding a rail and nose pressing a box. That's a pro move right here. He's doing tricks to up his speed. Yes. How do you do that? Question mark from uh commentator. You just keep smashing L1 while you ride. I think so. Now Phil Dylan Dylan. Dylan. Summertime Mario now in effect here. Ripping up the beach course. But no, Rex is going to come right back. This is a fight. This is a proper fight. Alexia, nowhere to be seen. Not the Lander now going to catch up here with Hamburger Toad coming to getting off their shift at Yoshi Burger now ready to put in and clock in in your first place position. But no, Rex is back. We got a problem here up at",
            "start": 7799.36
        },
        {
            "text": "to catch up here with Hamburger Toad coming to getting off their shift at Yoshi Burger now ready to put in and clock in in your first place position. But no, Rex is back. We got a problem here up at the top. Rex is holding it down. Who's going to catch up to Rex? And Mario with a big red shell. That's going to slow Rex down, but Rex is going to stay in first position. Now, what Mario was it? We're not sure. We're not sure. Now that's Dylan right there. Dylan, summertime Mario and Alexio. But now, uh-oh, Wal Luigi has shown up. And it's vampire Waluigi. I didn't know they had such a thing. They call him the count in some areas. Number first. Number one. That's where it counts. Uh-huh. Uh-huh. Uh-huh. And boom. A big explosion, but that's going to push him forward and keep the first place position. We see right behind him, Toad clocking out of that Yoshi Burger right behind him. We also now have a a Daisy. A Daisy's going to take first place. It's Ryan. Oh no, it's another Daisy. It's",
            "start": 7850.88
        },
        {
            "text": "position. We see right behind him, Toad clocking out of that Yoshi Burger right behind him. We also now have a a Daisy. A Daisy's going to take first place. It's Ryan. Oh no, it's another Daisy. It's back to back Daisy. There's too many daisies. Jando. Jando. Jando. Rando. It kind of sounds like Mando. Jeno. Jando ripping it up in Swimsuit Daisy right now. Swimsuit Daisy ready to hit the beach. But guess what, girl? It's not beach time. It's race time. Get in there. Here in first place after the cutoff, first 12 people will stay on. There. It's crazy. And here we go. Jando Rando looking great. Kind of moving like a Tetris block left or right. I That's not how my car moves. It might be lag. Could be connection issues. Now hitting the switchbacks. It's going to be a left right snake like formation here down the track. Can Jando rip and ride this? Got to keep an eye out behind him. I believe that is a Wario, but not our Wario on a motorcycle. This is a different Wario. A cart racer Wario",
            "start": 7895.84
        },
        {
            "text": "here down the track. Can Jando rip and ride this? Got to keep an eye out behind him. I believe that is a Wario, but not our Wario on a motorcycle. This is a different Wario. A cart racer Wario trying their best to catch up from the second place position. And oh wow, watch out. Oh, Jando Rando, what happened there? What was that? Blue shell. And it's Rex again. Pipeline. Rex is back. Uh-oh. Drago. Drago with Superstar Toad now. Drago in first position holding it down as we rip through the river. And look at that. It's Jando Rando catching back up. Jando now with three bananas. Can they catch up to Toad in first place? One banana for Toad. Drago hitting the drift. Whoa. Whoa. Oh my god. They turned into a frog. Oh my god. It's Bumblebee. Oh, Bender. Wario and a Bumblebee card. Very cute. I don't get it. I don't get it either, but I love it. Oh, wah wah wah wah. Oh, yeah. Slow down. Jinxy thought they were in first, but now you're in second because it's Gosh darn Pretty Peach in first",
            "start": 7949.76
        },
        {
            "text": "I don't get it. I don't get it either, but I love it. Oh, wah wah wah wah. Oh, yeah. Slow down. Jinxy thought they were in first, but now you're in second because it's Gosh darn Pretty Peach in first place ripping it up on the dolphin motorcycle. Now we're in our final position. Bullet Bill via Toad trying to catch up. And it's Drago catching up off that Bullet Bill. Will they get a Happy Meal and possibly get the boost? I don't think they got that one. I think it did go to Daisy. No, they got a caramel apple pop. They're going to eat the caramel apple pop. They're going to get through. There they go. There they go. There they go. First place looking good. They're kind of in position here. Holding on to a green shell. No, King Boo stole the green shell, but now we're in the turnpike. That's the name of the game. Inside the tunnel. Lot of boost. Lot of boost on the floor. Can Drago use that to their advantage? I mean, they're holding first place right now. Uh-oh. Oh. Oh. Oh my god.",
            "start": 8007.04
        },
        {
            "text": "the name of the game. Inside the tunnel. Lot of boost. Lot of boost on the floor. Can Drago use that to their advantage? I mean, they're holding first place right now. Uh-oh. Oh. Oh. Oh my god. It's my controller. Oh [ __ ] Oh [ __ ] Pressing every button known to man. Stop. Don't hit quit. Just cuz you lost doesn't mean they have to. We've now arrived at the base of the mountain top. It's time to climb the mountain to the summit. Oh, Liander going to take first. No, now back to third. It's Jando Rando. Jando. Jando Rando now at first place. Where is Alexio is all I can think. Where's Alexio? Not in chat. Oh, Jando Rando ripping it up through the through the river. See? Yeah, we we need a list of all the people that are still here. Exactly. God, if only Uh-oh. Blue shell. Uhoh. Uh-oh. This is going to leave it open. The door's not been open. Wide open. Ryan. Ryan has baby Daisy, but no, look at it. Sexy Rexy. Rexy now with the gold shell getting some space. We have Snow on the track.",
            "start": 8054.16
        },
        {
            "text": "is going to leave it open. The door's not been open. Wide open. Ryan. Ryan has baby Daisy, but no, look at it. Sexy Rexy. Rexy now with the gold shell getting some space. We have Snow on the track. Only top four will make it. This is the final spot to the top of the summit. Who can make it up the switchbacks? The elevation gain will be massive. Rexy missed it off the side of the map. I'm going to be honest, that might be it for them. Uh-oh. And it's Peach. It's Peach. Charlie XCX coming hot off of a big time 3-day concert in Barcelona. Charlie XCX now first position. We got Baby Baby Daisy right behind them. Only four competitors left in this race. We're only really missing one to know who they all are. Yeah, exactly. We know it's Wario. We know it's Baby Daisy. We know it's Charlie XCX's Peach. Peach ripping it up now. hitting the slalom track. Watch out skiers and riders. We got motorcycles on the on the slopes. And look at that. It's Peach for the win. Wow. I would have never",
            "start": 8101.44
        },
        {
            "text": "XCX's Peach. Peach ripping it up now. hitting the slalom track. Watch out skiers and riders. We got motorcycles on the on the slopes. And look at that. It's Peach for the win. Wow. I would have never guessed. Never would have thought it could have been Peach. I thought my boy Alexio would not have embarrassed me. Let's find out where Alexio finished. Uh Charlie XX with the first one. Senor Lullabi number two. Rexi with third place. Ryan with fourth. And now we look down the list. Where is our friend Alexio? 16. Really pathetic. Wow. Alexio, if you are watching and listening to this, don't let me know. We looked for better from you, we're just going to assume it was another Alexio. Wow. Wow. Really enjoyed commentating with you, Big Kev Dog. That was a lot of fun. To all of the kind of funny best friends out there, thank you so much for tuning in to Mario Kart TV. I've been your host, Snowike Mike, for my best friend, Big Kev Dog. And all of you out there racing and watching, thank you",
            "start": 8158.32
        },
        {
            "text": "best friends out there, thank you so much for tuning in to Mario Kart TV. I've been your host, Snowike Mike, for my best friend, Big Kev Dog. And all of you out there racing and watching, thank you so much for tuning in. We'll catch you tomorrow for a very special kind of funny broadcast. Starting your day off with live talk shows all day long. Kind of funny games daily in the games cast. And then we're going to do it for the memes. We're going to play Mind's Eye. See you then. Goodbye. Hey, hey, hey. [Music]",
            "start": 8204.48
        }
    ]
}