{
    "id": 14187,
    "video_id": "VQz93osrPpk",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Blessing Adeoye Jr.",
        "Mike Howard"
    ],
    "title": "We Played Xbox Ally, Amazing SGF Games! - Kinda Funny Gamescast",
    "description": "Go to http://kindafunny.com/XREAL to grab yours now!\n\nGo to http://factormeals.com/kindafunny50off and use code kindafunny50off to get 50% off plus free shipping on your first box.\n\nTime Stamps:\n00:00:00 - Start\n00:02:57 - Housekeeping\n00:04:31 - Xbox Ally Hands-On\n00:35:47 - Mixtape\n00:46:58 - Ratatan\n00:52:04 - Escape Academy 2 Back 2 School\n00:56:02 - Blighted\n00:59:56 - Toem 2\n01:01:34 - Directive 8020\n01:05:37 - Crisol: Theater of Idols\n01:07:47 - Grave Seasons\n01:09:14 - Crimson Desert\n01:14:40 - SuperChats\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1749498891,
    "duration": 4554,
    "transcript_chunks": [
        {
            "text": "[Music] What's up and welcome back to the kind of funny games cast for Monday, June 9th, 2025. Of course, I am your host Tim Gettys. I'm joined today by blessing Addio Jr. Good day, Tim. Snowike Mike. Good morning, Tim. And returning to the kind of funny studio, it's Greg Miller. Hello, everybody. What's this little uh sweater going on? Uh this is a custom sweater uh from our friend Ekka at Outer Loop Games. You know him from a bunch of different games. Of course, Thirsty Suitor is the most recent one. Uh he gave this uh sweatshirt to me uh well actually he gave Ben his own one I think when he came over at GDC and I was like clearly Jen and I need that and Ekka said of course I like you guys enough. And gave me and Jen them. Then Ekka big timed me at SGF. I don't like throwing developers under the bus, but I'm gonna do it here, right? He's showing his game, Dose of Divas, right? I'm excited to see this. Obviously, I loved all of Ekka's games throughout the Outer Loop career here. I'm",
            "start": 8.28
        },
        {
            "text": "under the bus, but I'm gonna do it here, right? He's showing his game, Dose of Divas, right? I'm excited to see this. Obviously, I loved all of Ekka's games throughout the Outer Loop career here. I'm excited for this thing. But then I get the email, hey Greg, can we reschedu you? Eka's been invited to be on Giant Bomb and he's worried about traffic, so they're going to he has to leave. And I said, no, I'm only there Saturday. And they said, well, can we get another Saturday time? And I said, you cannot. I am booked solid with amazing games. And so that's why I don't know anything about his game. I don't know anything about it. And frankly, until he comes and makes me food and shows me the game, we're enemies. Those are the only options. Don't take it as a threat, but take it as an opportunity. You know, Greg, how are you doing? You're you were down at Summer GameFest in LA while we were reacting to the Xbox showcase, I guess, top level. What are your your Xbox showcase thoughts? Uh,",
            "start": 58.56
        },
        {
            "text": "You know, Greg, how are you doing? You're you were down at Summer GameFest in LA while we were reacting to the Xbox showcase, I guess, top level. What are your your Xbox showcase thoughts? Uh, that is of course my Greg Way today. You can go get it right now. 17 minutes of me talking about it. uh you and jumping off some thoughts from it or whatever. I thought it was a great one. I gave it an 8.5 uh on our kind of scale saying it was great. I think I I am with you guys, not to the as detrimental as Mike was of I think Call of Duty was a bad ender. I think if you could have had a hey, we have this game that is going to be hype and caught you off guard or whatever. Even if it was just a tease, I think that would have been enough to for most cement an 85 if not push it closer to an amazing. But I'm also being selfish because as I was uh BSing over on Blue Sky about while the show was live. Nope. You want me to say skating? I hate that. I just don't want you to say anything. What you want",
            "start": 97.2
        },
        {
            "text": "I'm also being selfish because as I was uh BSing over on Blue Sky about while the show was live. Nope. You want me to say skating? I hate that. I just don't want you to say anything. What you want me to say? I'm tweeting on Blue Sky posting. I mean know I'm I am honestly down to say tweeting. I was BSing over there on blue sky via that show the the further it went the longer it went was just built for me. Just games that I Clockwork Revolution. Are you [ __ ] kidding me right there? Outer Worlds to start, Outer Worlds at the end. Like everything we saw in there, the games they were announcing, Xbox play anywhere. There's a lot of reasons to be super excited. Hell yeah. Uh a reason for you to be excited is this is the kind of funny games cast. Each and every weekday we get together to talk about the biggest reviews, previews, and topics in video games live on YouTube, Twitch, and podcast services around the globe. If you love what we do, support us with the kind at funny membership on",
            "start": 139.76
        },
        {
            "text": "about the biggest reviews, previews, and topics in video games live on YouTube, Twitch, and podcast services around the globe. If you love what we do, support us with the kind at funny membership on Patreon, YouTube, Spotify, or Apple podcast to get our shows ad free and a daily exclusive Gregway. For a chance to be part of this show though, submit your thoughts and opinions as YouTube super chats as we go and we'll get to them throughout the day. So if you have any questions for what Greg got to do at Summer GameFest, please super chat them in. But let's say this right now, okay, I'm loaded with embargoed information. Tomorrow's Games Cast will also be about SGF and games I can't talk about right now. And then, believe it or not, over the next few weeks, there'll be little things. Very cool. Very cool. So, if I dodge a question or I don't answer question, no, I might have seen it. I might have done it. Read between the lines. Everybody, uh, we're an 11 person business all about live",
            "start": 177.68
        },
        {
            "text": "Very cool. So, if I dodge a question or I don't answer question, no, I might have seen it. I might have done it. Read between the lines. Everybody, uh, we're an 11 person business all about live talk shows. We just did a kind of funny games daily covering Outer World's $80 price point. After this, it's the kind of funny podcast and then the stream is going to be Mike playing some of that open world Mario Kart World. I want to get all the outfits, Tim. Yeah, I want them all. Cool. You got them all? I did. Yeah. Okay. Yeah. I I'm I'm I'm cruising through the game. Cruising. If you're a kind of funny member, today's Greg Ways Greg's 17minute review of the Xbox Game Showcase 2025. Like he was just saying, thank you to our Patreon producers Carl Jacobs, Omega Buster, and Delaney Twining. Today we're brought to you by XR Real and Factor, but we'll tell you about that later. For now, let's start with the topic of the shows. We played the Xbox ally and amazing Summer GameFest games. That's",
            "start": 217.28
        },
        {
            "text": "we're brought to you by XR Real and Factor, but we'll tell you about that later. For now, let's start with the topic of the shows. We played the Xbox ally and amazing Summer GameFest games. That's what I called it. I want to start with the Raj Xbox Ally X. Yeah. Yeah. Yeah. From henceforth, we will just call it the Xbox ally. That's such a nice name. Just call it the Xbox ally. The rose this Asus ASUS, you know what I mean? We're all over the place at a lot of these naming conventions. And the fact that they just took the Rag Ally and shoved Xbox into the name, you got to respect it. You got to respect. You do. Uh yes, Timothy, I have touched uh and played on the ROG Ally uh I'm sorry, the ROG Xbox Ally, henceforth known as the Xbox Ally. I did the Xbox Ally X. Uh the black one, the fancier one with the crazy chip in it. The uh I have it here. Don't tell me. Don't tell me. Don't tell me. Uh the Z2, that's it. Where the AMD Ryzen AI Z2 Extreme chip, which is better than the Ally X I",
            "start": 257.76
        },
        {
            "text": "one with the crazy chip in it. The uh I have it here. Don't tell me. Don't tell me. Don't tell me. Uh the Z2, that's it. Where the AMD Ryzen AI Z2 Extreme chip, which is better than the Ally X I have now with its chip. So, obviously, I'm super excited for this to begin with. So you got your hands on the higherend one. Did you get to get hands on and did they even have the lower-end one? They had the lower-end one there. Yes. So it ran in two different things where there was an hourong uh presentation seminar. Maybe it was half an hour. No, it was an hourong presentation behind closed doors. Me and a bunch of other jouros and media and creators there, right? Where they gave a presentation. We got to hear from Rowan, who you've seen in the videos and stuff, head of Xbox design. Uh Sean from ASUS. Uh we were they gave a whole presentation and then at one point G gave us uh the units, let us click around. It was a guided demo, but you were free to go off the rails if you wanted to go",
            "start": 311.04
        },
        {
            "text": "from ASUS. Uh we were they gave a whole presentation and then at one point G gave us uh the units, let us click around. It was a guided demo, but you were free to go off the rails if you wanted to go somewhere else. So to jump through the hoop, see what it was all about. Play Gears uh remaster. What is it? Gear. What is the official title? Reloaded. Reloaded. Gears whatever the hell you know what I'm talking about. Uh on it uh at 60 frames a second uh out there, you know, doing the damn thing. Uh playing it that way. We saw that on the TV through a dock or through a USBC connection over to it. Uh and then that was taken away. Then outside of that were creator pods where people could go and film Tik Toks or podcasts or interviews or whatever. And one of them had both uh the Xbox Ally and the Xbox Ally X in them that you could hold. They didn't have the software running on them. So it was just basically a hold screen, but you could get the feel, take the photos. That's where the",
            "start": 353.52
        },
        {
            "text": "and the Xbox Ally X in them that you could hold. They didn't have the software running on them. So it was just basically a hold screen, but you could get the feel, take the photos. That's where the thumbnail comes from and stuff like that. So what do you want to know, Timothy? I mean, what I want to know is first off, how it actually feels in your hand because I really love a lot of these devices, and I think that we're very lucky that we're at a point that uh more often than not, they're premium experiences at this point, which is great. I love the way the Steam Deck feels. A very, very high quality plastic. We have the Raj Ally, the the normal one, the Raj Ally X that that you have. That is also nice. I wouldn't say quite as nice feeling as the Steam Deck. Uh see, we differ on that, but go ahead. I mean, well, just in terms of sheer quality of of the plastic and all that stuff, again, we differ on. I I I like my Rag Ally X right now is my favorite handheld in terms of how it feels,",
            "start": 392.16
        },
        {
            "text": "go ahead. I mean, well, just in terms of sheer quality of of the plastic and all that stuff, again, we differ on. I I I like my Rag Ally X right now is my favorite handheld in terms of how it feels, the weight, the balance of it, and the shift of it. And I'm including Switch 2 in there where extensively playing it in handheld on the my flights. Damn, my hand hurts. Uh, so with this new one with the more Xbox styled the grips grips, how you feeling about it? I thought these looked so dumb when the images leaked. You know what I mean? I And I love my Portal. Don't get me wrong, but as somebody who does love how the Alli X feels right now natively in my hand at home, I was like, \"Oh, this looks dumb. This looks weird.\" Holding it was a different story. It like everything they're saying in the documentary video just had up, you know, they have a whole thing in there of like the grips were so important. It it's the evolution of the Xbox controller. Da da da da da. I thought it looked dumb",
            "start": 435.2
        },
        {
            "text": "documentary video just had up, you know, they have a whole thing in there of like the grips were so important. It it's the evolution of the Xbox controller. Da da da da da. I thought it looked dumb looking at it holding it. I was like, damn, this does actually feel super nice. And I do It's not that I miss it, I think, or or for the next however many months till holiday, right, is what they're saying. I'll miss it on my Ally X, but I think when I get it, it'll be like, \"Oh, this feels way better. It does feel like holding an Xbox controller.\" And I think that's one of the interesting things. I've been, of course, a fan of kind of funny for a long time. And so, you know, I listen to your Games Cast review of the Xbox showcase. I think I'm an hour six minutes in watch the Greg way that I had to stop the Games Cast to record the Greg Way. And it was one of those things Andy, I think, was really not hung up on, but kept mentioning how he doesn't like how much it looks like an ASUS piece",
            "start": 476.8
        },
        {
            "text": "to stop the Games Cast to record the Greg Way. And it was one of those things Andy, I think, was really not hung up on, but kept mentioning how he doesn't like how much it looks like an ASUS piece of hardware. wishes it looked more like Xbox hardware. And I think listening to the presentation uh from Rowan and from Sean and them talking about how this came to be and how collaborative they want it to be, I really do feel that they wanted this to be. You look at it and you see the Xboxness of it and you see the Asusness of it. And so I think there's an interesting line they're trying to walk that I think works for me personally. I love the little, you know, Xbox rogs all over it and the graphics. I you know the handheld up there even the uh Xbox button on it right they had a whole conversation talking to us about it I think it might even be in this video in this video yeah right where it's like they didn't want it to be round they wanted it to be things so they put it all together",
            "start": 512.08
        },
        {
            "text": "talking to us about it I think it might even be in this video in this video yeah right where it's like they didn't want it to be round they wanted it to be things so they put it all together Angular and put it all together I like it and I I like it for what it is and Tim you I think said it really well in the games cast uh review of it where there was such a well it looks so it's not Xbox it's not fully them why are they doing this and you were saying of course like well it is this marriage between them And there have been rumors of that Xbox handheld. And I know just last week it was we on Games Daily talked about Jez being like that's dead, that's not happening. Who knows if that's actually the case, but I think in my mind that's why they were so like let's meet in the middle. We're doing this together. This is clearly the middle ground of two companies coming together and then if slash they were going to do an Xbox handheld, it'll look I would think or would have more Xbox. Yeah.",
            "start": 556.96
        },
        {
            "text": "this together. This is clearly the middle ground of two companies coming together and then if slash they were going to do an Xbox handheld, it'll look I would think or would have more Xbox. Yeah. Whereas this is I I think like their best first step because they need to do stuff now because we're in a place where these handheld PCs are a market that is full of enthusiasts that you need to deliver this stuff to. So that leads me to the most important question which is the OS. Yeah. Because all this other stuff the screen's the same as the one you have like Yeah. It's more powerful. You're not going to notice that just playing at a preview event, did you? Oh, yeah. Yeah. No, no. I mean, yeah. Again, the thing for me as somebody who plays Rogue religiously right now, right, his Ally X, like I watching Gears and playing Gears and then they had it up on the TV and the 60 frames were clicking and it looked great. Now granted, older game obviously remastered, resed up, whatever they're",
            "start": 596.08
        },
        {
            "text": "like I watching Gears and playing Gears and then they had it up on the TV and the 60 frames were clicking and it looked great. Now granted, older game obviously remastered, resed up, whatever they're calling it, like different whole ball of wax there. It did look really great. It did feel really great. Now, I I think I'd love to see it on my current Ally X, see if there's any difference, blah blah blah. But no, I don't have intense thoughts obviously in how it is. I thought it looked really well. Booted faster than most of my games on my Alli X do. Granted, again, this is all preview hardware and preview OS. So, who knows how it'll actually shake out. Yeah. A lot of people in the chat are asking what the price is. We do not have a price on this. Do not have a price. Do not have. You should expect $900 for this. That is most likely what this is going to end up being. Sure. Uh, so then you want to know $900. Excuse me. OS. They'll probably have what I isn't right now. It's $8.99 for",
            "start": 634.0
        },
        {
            "text": "expect $900 for this. That is most likely what this is going to end up being. Sure. Uh, so then you want to know $900. Excuse me. OS. They'll probably have what I isn't right now. It's $8.99 for Ally X. $8.99. $900 and then just regular allies $799. Correct me Mikey's on that. Um, but in terms of the OS overall, I wasn't a doubter by any stretch of the imagination, but as somebody who already is in this ecosystem and already using so many of the things they are touting here and touted throughout the Xbox uh uh presentation, you know, driving home Xbox play anywhere, all those games, Play Anywhere, working with third parties for Play Anywhere. I haven't had the hurdles that I had heard so many people talk about before. When I was talking about my Steam Deck and how I wanted another one, but how I wanted to get my other stores on there and how I wanted to do these things, some people would pop up and say, \"Greg, you really should look into the the Allies, right?\" And I said, \"Well,",
            "start": 671.12
        },
        {
            "text": "but how I wanted to get my other stores on there and how I wanted to do these things, some people would pop up and say, \"Greg, you really should look into the the Allies, right?\" And I said, \"Well, sure, but I've heard this. I've heard that Windows yada yada yada.\" I love using the version of Windows that is on my Alli X. I find it super responsive to touch. It's easy to get in. I just leave all my games on my main screen. I let them create the, you know, the desktop shortcut. I'm in, I'm going, I'm fine. Keyboards are actually nice, yada yada yada. Occasionally, there'll be the gripe where I try to bring up a keyboard and it doesn't go the right place and I have to do this. But, for me, in my personal experience, night and day versus trying to use my touchcreen on the Steam Deck to do the same thing because I think Steam Deck is doing what Xbox is trying to do here with Xbox ally, right? In terms of having the OS there and sometimes it gets finicky touchy. I don't I don't like it.",
            "start": 725.52
        },
        {
            "text": "the same thing because I think Steam Deck is doing what Xbox is trying to do here with Xbox ally, right? In terms of having the OS there and sometimes it gets finicky touchy. I don't I don't like it. Anyways, being so into Alli X already, I was like, \"Okay, cool. I don't know how much this would be needed or work or what about this and what about that workaround?\" And I was, now I don't want to eat my words off of preview, but I was like, \"Damn, this is nice.\" And they seem to have the answers in ways I didn't think they would. Uh, of course, you know, as we've seen throughout the videos, and I'm sure Barrett will continue to show you, this looks like your Xbox system. Of course, uh, when you're able to go in and jump into the system, it takes all your games from all your different libraries and has them there with their little logos on it for Battleet. It has Steam down there. I know there's a lot of discussion on the reaction or maybe it was the review about, oh, well, is it going",
            "start": 761.2
        },
        {
            "text": "and has them there with their little logos on it for Battleet. It has Steam down there. I know there's a lot of discussion on the reaction or maybe it was the review about, oh, well, is it going to have Epic Game Store from everything they said it will have anything a PC could have in terms of a launcher? I think this is just you don't want to bog it down with it. I I don't think they showed in any of this stuff. correct me if I'm wrong, but internally when we were getting this demo, another thing kept talking about was Discord of like, okay, you know, you're going to be able to boot into Discord over in this window and be able to do it. That's in the my apps got it tab of this, too. And and just something real quick while you're talking about this OS thing that I think is really interesting is the difference between your experience currently on uh your ally with uh Windows and this new Xbox OS situation going on is the Xbox OS can turn off all the Windows processes that the games Oh,",
            "start": 800.4
        },
        {
            "text": "is the difference between your experience currently on uh your ally with uh Windows and this new Xbox OS situation going on is the Xbox OS can turn off all the Windows processes that the games Oh, I know that. Yeah. Yeah. No, no, I'm I'm getting to that. Yeah, that was and that's what they were explaining, right? Of course, is that the fact that when you turn this on and you're running this thing, it will bring you straight to the Xbox screen. It will not load Windows. It will not jump through those hoops. All the resources they were saying that Windows usually eats up in the background would no longer be happening. They're just there then all that stuff's available more for games, right? Which is obviously great news in terms of not having some background process running. My question then became uh when I was tooling around there was a you know go to Windows or you know load Windows mode or whatever. So I assumedly you can still do that if you need to, right? Which would be a whole",
            "start": 835.84
        },
        {
            "text": "became uh when I was tooling around there was a you know go to Windows or you know load Windows mode or whatever. So I assumedly you can still do that if you need to, right? Which would be a whole kitten kaboodleoodle of booting out of it. But my question then was like, all right, so at the end I grabbed R. I was like, what is it going to be like if I want to install Discord? I want to install Steam. I want to do this. Like that's not built in. So do I have to boot into Windows, load it there, come out of this, do that, blah blah blah. And her answer was no. like in the this version of what you're looking at on the screen already, there will be a a Internet Explorer, a browser of some kind, right, that you can go to Steam, download, and it will all do it there, so you never have to go to Windows and do that, which wouldn't be the end of the world, but I like the idea that they're so committed to not breaking your immersion in what this device is that they're doing that, booting it and",
            "start": 871.04
        },
        {
            "text": "and do that, which wouldn't be the end of the world, but I like the idea that they're so committed to not breaking your immersion in what this device is that they're doing that, booting it and loading and installing it all on the side rather than go into Windows, screw something up, start some background function I don't want to do. Yeah. And the exciting thing is the idea of this is that this isn't tied to these systems that Greg's using. Like this would be an OS that they can then put on even their older um products, but then also their future products, but also other products. And I think that the main goal is getting this on Windows desktop PCs because if you can then you have your PC have a gaming mode that actually works for Xbox the way that it's supposed to, that's going to be such a major step forward for how things currently are working but with workarounds or working but with a lot of caveats and a lot of things of that it's not optimized and not not that console-like",
            "start": 913.36
        },
        {
            "text": "such a major step forward for how things currently are working but with workarounds or working but with a lot of caveats and a lot of things of that it's not optimized and not not that console-like experience. So, so far it looks really good. Yeah. Yeah. And it it ran really well. You know, I mean, it was exactly how you'd expect the Xbox to handle if it was in your hands. It was a handheld. And it was that idea of, you know, holding down the Xbox button is what then kicked you into, you know, the multi-creen mode of like, all right, well, what program are you trying to get to here? Are you trying to go from gears to this? I think they even had might have had Discord running on theirs to show that you could click over to that, right? And of course, it's all done on sticks. It's all done with buttons. It's all done with D-pad. Like, you're not having to do it. Uh if you want to go back with just a one frame there uh Barrett uh where it kicked off there one back just one one back uh you",
            "start": 951.84
        },
        {
            "text": "buttons. It's all done with D-pad. Like, you're not having to do it. Uh if you want to go back with just a one frame there uh Barrett uh where it kicked off there one back just one one back uh you know one of the things uh with uh using the ally X is it has of course a command center where you can go in and tweak all these different things but then it has this right here this command center where you get to jump in and you can go to armory crate which if you're using a rag right now armory crate is in a lot of ways what they're trying to do here where you load up armory crate armor armory crate and it shows you every game you have with the little logos on it. But again, loading a different thing to do a different thing. You still have this time through the Xbox button, through your uh normal interface, all the stuff you would have from command center where you go in, you put it into performance mode, you put into turbo mode, you know, you dial down this, you put frame rate limiters on",
            "start": 987.76
        },
        {
            "text": "interface, all the stuff you would have from command center where you go in, you put it into performance mode, you put into turbo mode, you know, you dial down this, you put frame rate limiters on if you're trying to play Expedition 33 and not have it explode like me, you go through and you do all these little hoops that if you want to to really customize the experience for what you're using the handheld for in that moment. But again, as somebody wellversed in the Ally X, it was interesting to see them merge that together with the Xbox, which I'm well verssed in as well. and how well it worked. And it is super exciting. Like you and me both love these kind of handhelds and playing these things and doing it. So I'm very interested to get my hands on the final product or a preview. Any downsides to it that you experienced? I mean the price will be the biggest one, right? I think that's going to be the issue. Um, uh, it's still the thing for me of I love Play Anywhere, but for our very",
            "start": 1026.16
        },
        {
            "text": "to it that you experienced? I mean the price will be the biggest one, right? I think that's going to be the issue. Um, uh, it's still the thing for me of I love Play Anywhere, but for our very specific use case, it's always going to be weird of when I request a code from somebody earlier, is this going to be the Play Anywhere's Windows version that'll also give me the Xbox version or you just give me a Steam code that then locking me out of the Play Anywhere thing I want to. There's that idea of it, right? That's such a 1enter problem in terms of reviewing things and doing things. uh from I mean I my main concerns are price and battery life just to see what we're going to get, how you're going to get uh see how it'll plug into the the screens and all this stuff. They mentioned of course uh if you want to use uh you know the XG mobile docs uh that ASUS makes uh that if you did this and plugged it in, you can go up to like RTX uh 5090 laptop GPU, right, to get the most out of it even",
            "start": 1059.68
        },
        {
            "text": "uh if you want to use uh you know the XG mobile docs uh that ASUS makes uh that if you did this and plugged it in, you can go up to like RTX uh 5090 laptop GPU, right, to get the most out of it even there, which is an exciting proposition I think as well uh to try to figure out if you wanted it just to be that idea and go. But of course, you then are talking about even more of a financial investment and what do you want? And at that point, why not just have a very nice PC that you're doing that on and not even worrying about that have your handheld and go or vice versa, however you want to shake it out. Uh, but for me, as somebody who's already into the system and already loves it so much, it's a great evolution of what I love about the Alli X and why I'd be excited about this. So, I'm stoked about it. Yeah, I'm I'm very excited, too. Uh, and I'm also just excited that they're continuing to double down on this and having such a partnership like from the ally side with Xbox shows like",
            "start": 1102.16
        },
        {
            "text": "about it. Yeah, I'm I'm very excited, too. Uh, and I'm also just excited that they're continuing to double down on this and having such a partnership like from the ally side with Xbox shows like they're trying to take this more seriously because like right now it is a very small footprint in gaming but I do think that it is going to continue to be an enthusiast product and like enthusiasts are what make the entire industry go round 100% and I think their messaging was very clear in that again uh Rowan S if you don't know head of Xbox devices right uh when she was talking presenting all this the direct quote I wrote down right we're still very much leaning into our next generation plans. Like again, they're not trying to pivot in lifeboat to PCs. I saw a lot of, you know, skies falling stuff about it afterwards. And she said that this is an and this isn't your only thing. This is an and this isn't a company device. So clearly, yeah, we're talking about enthusiasts, people with money to",
            "start": 1142.32
        },
        {
            "text": "about it afterwards. And she said that this is an and this isn't your only thing. This is an and this isn't a company device. So clearly, yeah, we're talking about enthusiasts, people with money to burn, people who this speaks to in a very specific way. But I think again what I didn't agree with on like Mike's take on the Xbox showcase was the idea, you know, Mike was so hung up on understandably so. I'm not saying it doesn't matter. They're not being first parties there, right? There's all these third parties, but watching them do every game like Xbox Play Anywhere. For me, I was like, I'm like that's what matters to me in 2025, not trophies. So all these things ending with the PlayStation 5 logo at the end. I'm like, I won't play them on PlayStation 5. I will play them here so I can take them back and forth and hopefully have the best, you know, even as close as possible experience with this new handheld. He's so deep in the ecosystem, Tim. It's unbelievable. It's true. It's like",
            "start": 1182.72
        },
        {
            "text": "them back and forth and hopefully have the best, you know, even as close as possible experience with this new handheld. He's so deep in the ecosystem, Tim. It's unbelievable. It's true. It's like he's becoming part of it. This is exactly what he wanted. You jump on the home console. If you got a nice PC, you can just boot up your Xbox app, play all your games, and now on the go with mobile. That's great. Yeah. Brandon in the chat says, \"Is it going to be worth the upgrade from the Alli X, though?\" I do think that is a big problem that we're facing here, which is PC gaming in general and how it's always been where there's always going to be a new upgrade. It's never going to be like consoles where there is this many year gap between uh the last one and the new one. Um, I feel like we're already seeing that. Like Steam Deck so far has been very we're holding their ground and not putting out a Steam Deck 2, uh, even though they very well could. And, uh, Ally are putting out products and",
            "start": 1224.48
        },
        {
            "text": "seeing that. Like Steam Deck so far has been very we're holding their ground and not putting out a Steam Deck 2, uh, even though they very well could. And, uh, Ally are putting out products and Legion's putting out products. Saying though, like, do you need to is it worth the upgrade? I don't think necessarily yes, especially because the Xbox OS stuff is most likely going to come to the original Alli X, but it is worth waiting for if that's the uh if you don't have one yet and are thinking about getting one. But I do think that guess what? Next year there's going to be another one. Maybe maybe not next year, two years from now, there will be a follow-up to this. What's interesting about this, and this is where you get way outside of my territory. I can tell you if the game's good and how it runs, right? But I can't get into the text and the specs of all this stuff. But one of the things Rowan was talking about was that with the AMD Ryzen AI Z2 Extreme chip, right? Such a big part of",
            "start": 1265.92
        },
        {
            "text": "it runs, right? But I can't get into the text and the specs of all this stuff. But one of the things Rowan was talking about was that with the AMD Ryzen AI Z2 Extreme chip, right? Such a big part of that and I wrote all this down is that it's the silicon, right? That it's ready to evolve with AI innovation. She made a point to say this and she she was like, I know AI is everybody's got an opinion about it. She was like this is but when we're dividing designing a device, our job is to make sure we future proof it as much as possible. So it really made it sound like and I don't know what the [ __ ] I'm talking about. So, I'm just repeating what they were saying that the way the chip works is that this chip in particular is planning to use the AI improvements of the upscaling and the upres and this that the other to try to get you the again as close to console PC home or tower PC uh experience as possible without it. So, I wonder if that's where the gap would be between uh my regular",
            "start": 1305.28
        },
        {
            "text": "and this that the other to try to get you the again as close to console PC home or tower PC uh experience as possible without it. So, I wonder if that's where the gap would be between uh my regular ally and my my Xbox ally. Uh, wing commander in the chat says it still seems like they're not uh clear that this is not going to play native Xbox games. To be clear about this, it's not native Xbox games. It's native Xbox for PC games. And Xbox yesterday spent so much time clarifying that going forward all of their games are going to be Xbox on PC. So yeah, you're not going to be able to go back and play all the old stuff right now. At some point that can change and they Well, that's the whole thing. Beer's got it up here of download natively, right? where yeah they're talking about downloading natively the games on Xbox Game Pass PC or everything yesterday which was Xbox play anywhere Xbox play anywhere I think that was that if it felt like that was the thread that so many people missed",
            "start": 1347.92
        },
        {
            "text": "natively the games on Xbox Game Pass PC or everything yesterday which was Xbox play anywhere Xbox play anywhere I think that was that if it felt like that was the thread that so many people missed watching it is like that's their big pivot this year is like no no all this stuff which includes so many third-party games is Xbox play anywhere which it is not right now right where even like outer worlds when I went and redid that wasn't Xbox play anywhere that's why I got it but to the point of the device and what they're talking about, right, is like with this idea when you boot it up. I mean, Mike's got it pulled up through his PC, right? And it's the exact same thing of home, game, game game pass, my library, cloud gaming. It's the exact same here where they're saying like, yes, your entire Xbox library will be there even if you don't own a lot of Xbox PC games because your library will be there through cloud gaming. It'll be there through remote play. Now, are these asterisks and",
            "start": 1390.16
        },
        {
            "text": "Xbox library will be there even if you don't own a lot of Xbox PC games because your library will be there through cloud gaming. It'll be there through remote play. Now, are these asterisks and wrinkles and all these things? Yeah. But like if you're at if you're to the point where you're like, I'm interested maybe in this $900 Xbox handheld, I expect you to know all of this and have done that amount of research to get in to understand it. But again, going forward, it isn't an issue, which is why, [ __ ] yeah, Outer Worlds 2 that uh presentation both in the front and the back was so good, and I already liked number one so much. It seems like they've improved so much. [ __ ] yeah, I'm going to want to play that there so I can take that with me multiple times in multiple systems, multiple ways. Yeah, I think the big the confusion there, but like the big takeaway is that this is not a portable Xbox. This is a portable Xbox PC. It's a portable PC, period. Um, and I think that's why the",
            "start": 1432.72
        },
        {
            "text": "ways. Yeah, I think the big the confusion there, but like the big takeaway is that this is not a portable Xbox. This is a portable Xbox PC. It's a portable PC, period. Um, and I think that's why the Xbox player, this is an Xbox, this is an Xbox, all that stuff gets a little bit like confusing because you're like the the words aren't adding up to what it actually should be. But I do think we're slowly getting to the point that it's not going to matter because all the games are going to be playable natively on PC, I think, within the next couple years. I mean, going forward for sure, but I think they're even going to go back and uh make changes to all this stuff. And uh Ian John super chats in saying, \"I like this Alli X, but it 100% feels like one more step into making Xbox just an operating system and eventually leaving hardware altogether.\" I agree with you that this is definitely another step away from hardware being their sole focus. I think that's a good thing for the strategy",
            "start": 1469.44
        },
        {
            "text": "system and eventually leaving hardware altogether.\" I agree with you that this is definitely another step away from hardware being their sole focus. I think that's a good thing for the strategy that they are currently in play of. And on top of that, like I think this OS stuff, they need to get it right. And it needs this is baby steps towards it, but it needs to be everywhere. It needs to be on the Xbox. It needs to be on normal PCs. And again, just the fact that like Mike's thing PC right now looks like an Xbox, right? as you continue and I when you boot up the Xbox app it looks like that like yeah they're doing it they're making the moves and again I think but it needs not just look like it it needs to actually function it and actually turn off all the other things so it's not killing the battery life and it needs to be able to run as good as uh games natively on other systems that are made to be able to play games that way all that we're getting there we're not quite there yet but",
            "start": 1510.56
        },
        {
            "text": "battery life and it needs to be able to run as good as uh games natively on other systems that are made to be able to play games that way all that we're getting there we're not quite there yet but this these are the moves to get there and in terms of leaving hardware altogether uh I I think that the they're I stand by Xbox will never stop making hardware as long as Xbox as a brand exists. I just do not think that the importance of the Xbox hardware is going to matter near as much. And I would be willing to bet that by next generation the Xbox the difference between Xbox and Xbox PC doesn't exist because the console is a PC. Exactly. Yeah. That that that was what the rumor was not too long ago. We kicked around on a games deal remember with Paris and that makes perfect sense to see what they're doing and how they're marching and what's happening. And again, I think as I've fallen in line, as I've become one of them, right, of like, yeah, no, anything is Xbox Plan, I'm going to play it",
            "start": 1550.8
        },
        {
            "text": "doing and how they're marching and what's happening. And again, I think as I've fallen in line, as I've become one of them, right, of like, yeah, no, anything is Xbox Plan, I'm going to play it there. I think you'll see other people do this. I had a back and forth on Blue Sky when I was BSing uh with some people about again like, well, Outer Worlds is $80. Like, well, it's 20 bucks a month. You know what I mean? You get all this other stuff you like. I understand like these it sounds like marketing but they've built an actual strategy that I think when all games are $80 and you're like I want to play the hottest thing but I just spent $80 last week maybe $20 in a cloud and a PC or a phone or whatever suddenly you're like I'll try it and then you're in and you start going you see it and you do it maybe it doesn't work. Uh Parks View says play anywhere is the next step in smart delivery. Uh the hope is the step after that is applying it to the back compat program. Yeah. Yeah. I I think",
            "start": 1597.04
        },
        {
            "text": "do it maybe it doesn't work. Uh Parks View says play anywhere is the next step in smart delivery. Uh the hope is the step after that is applying it to the back compat program. Yeah. Yeah. I I think that's that is I think we're actively taking those steps now. Uh bless. Yeah. You've been suspiciously quiet. Does any of this peique your interest whatsoever? I mean, I think it all sounds cool. I am I'm having fun listening to it cuz I after the showcase yesterday, me and Mike are in the parking lot. I turned to Mike and I'm like, Mike, play anywhere. Does that not is that not already applicable to every Xbox game? And Mike blew my mind when he told me no. I totally thought that that was already the case. And so to hear how they're building and hear Tim and you break it down, I think makes a lot of sense. It's one where the a lot it is in a lot already. I don't want to take away and make it sound like it's not and I'm using Outer Worlds as an example, but there's the thing where that was",
            "start": 1637.44
        },
        {
            "text": "lot of sense. It's one where the a lot it is in a lot already. I don't want to take away and make it sound like it's not and I'm using Outer Worlds as an example, but there's the thing where that was private division published and Xbox bought them and you know what I mean. There's it the game game pass, right? Usually there's that parody usually between not always usually between PC and Xbox and so if it's on game pass you're usually set and you're fine. Yeah, it's an exciting moment. I'm just a little timid, Tim, of like this is for me, right? the Xbox avid gamer that wants to go everywhere with a lot of my titles and I just kind of feel like we're at like this moment where I'm going to see a lot more of these and I'm worried it's like is this my one Greg? Right? like is this my one to buy where maybe I'm covered for 3 to 5 years or is there going to be a Steam Deck 2 that's going to now come out 2 years later I'm going to go ah why did I do this or is there are but is the Steam Deck",
            "start": 1675.92
        },
        {
            "text": "where maybe I'm covered for 3 to 5 years or is there going to be a Steam Deck 2 that's going to now come out 2 years later I'm going to go ah why did I do this or is there are but is the Steam Deck 2 going to let you do well yeah exactly and then of course like is Xbox going to say hey I know we said that that's on ice right now but you know what after seeing the Rock ally how great it did now we're ready for this in three years and I just feel like a little intimidated to put down $1,000 to buy this now and get like maybe a year or two good years of like this worked and then them be like hey we got three more and I'm like% that's going to happen it's like phones it's a cell phone now that's just everyone needs to prepare themselves that's where we're at that is what's going to happen we're going to get so many of these things but the hope is the OS works well enough and is on all of them and it is this open uh platform so you can jump in at where your entry point uh where you want to",
            "start": 1715.52
        },
        {
            "text": "going to get so many of these things but the hope is the OS works well enough and is on all of them and it is this open uh platform so you can jump in at where your entry point uh where you want to be and it's going to be there's there's the fact that they even now have two SKs that they're coming out with this thing for the Xbox it's like that's how this is going to be and I guarantee that Legion's going to get it and Asus is going to continue and yeah, Steam Deck's going to keep doing its own thing as well. But the big question is will Steam open up to be able to allow this to be on and I think that it might. I really do. And we also I mean already Steam's being opening their side up to be on other systems which were in the last month seeing what that's looking like and that's working really really well so far. So yeah, Mike, like it's a good news. I'm a little timid, but like yeah, I mean, hearing Greg talk about the OS, right? Like as an Xbox gamer myself, I love that home screen.",
            "start": 1755.68
        },
        {
            "text": "really well so far. So yeah, Mike, like it's a good news. I'm a little timid, but like yeah, I mean, hearing Greg talk about the OS, right? Like as an Xbox gamer myself, I love that home screen. I like jumping into that knowing I'm home and the idea that I can open it up and have other storefronts that I've put a lot of money into Steam now. Like my world is Xbox and Steam. That's where I've put thousands upon thousands of dollars over my gaming career into those two storefronts. I kind of want to merge them and have like this shared experience when I'm on the go and be able to jump into that. So, it's like it's kind of perfect for me right now at this moment. I'm just intimidated of like the the iPhone situation of next year, oh Mike, this one's even better. I'm like, well, [ __ ] you know, now that is going to happen. But don't think of it as a negative. Think of it as a we are already at a point that it is good enough and now we're going to have a lot of options. I do think there",
            "start": 1797.04
        },
        {
            "text": "now that is going to happen. But don't think of it as a negative. Think of it as a we are already at a point that it is good enough and now we're going to have a lot of options. I do think there will be some options that aren't quite good enough that are on the cheaper side that you should be scared of. There's going to be options where the battery life is absolutely atrocious and all this stuff, but I do think more than not when we're talking about Legion and uh Asus at this point. They're going to keep putting them out, but I think that it's only just going to be better and better, but it's always already working the way that you're going to need it to, right? Yeah. That and that's the my thing to assuage fears, right? where I think my Steam Deck is the launch Steam Deck and as I told I've talked about so I've had that for years now and as I was talking on the shows like OLED was tempting because of the better screen but it wasn't enough for me to jump whereas I had said a Steam",
            "start": 1839.28
        },
        {
            "text": "I've talked about so I've had that for years now and as I was talking on the shows like OLED was tempting because of the better screen but it wasn't enough for me to jump whereas I had said a Steam Deck 2 I'll be all in on right but then I got the Alli X and I was like oh okay this kind of is kind of isn't I'm not even talking about tech specs it's more the features rich part of it where I'm like oh I'd stick with this this would be an upgrade and I don't think even a Steam Deck 2 would go so far above and beyond this where I'd be like I got to trade traded in, right? I feel like it's not even to the point where it's in the old days where it was I need a phone every year, they've done something crazy. I feel like it's always going to be incremental from here on out. And if this Xbox Alli X and it's using AI or whatever to keep up and make the games look as good as possible, I don't think you're going to be like, \"Oh man, two years later Alli X2 comes out or Steam Deck 2 comes out",
            "start": 1879.12
        },
        {
            "text": "X and it's using AI or whatever to keep up and make the games look as good as possible, I don't think you're going to be like, \"Oh man, two years later Alli X2 comes out or Steam Deck 2 comes out like, man, this thing's dog [ __ ] now.\" I could be wrong. I don't know. I'm just talking. I don't know. But it's got a lot of things that I want and I'm very excited about the idea of this right now. like looks like it has two back paddle buttons. Yeah, I like that. Right. Love to connect a controller. I'm sure you can do that. Wireless headphones. Um it's it's a very tempting idea and I'm very excited about this. I'm sure Greg will probably get a day one. I can look over his shoulder and make my informed decision there. But this speaks to me a lot. I am very excited about the future of Xbox and this ecosystem that I want to be in and that they're getting very close to really join me in the green. All right. You got scared. You ran away. We always playing these PC games and basically the",
            "start": 1913.36
        },
        {
            "text": "and this ecosystem that I want to be in and that they're getting very close to really join me in the green. All right. You got scared. You ran away. We always playing these PC games and basically the same thing. Uh, I want to move on to a little game called Mixtape that Greg got to play, but we're going to do that after award from our sponsors. This episode's brought to you by XRE. Y'all know that a few months ago, my life changed forever when I brought a pair of XR1 AR glasses on a long flight to New York. I legit could not believe how easy it is to use and high quality my experience was playing games, watching movies, TV shows on the plane without just too much extra stuff around me or especially not a giant goofy headset around my head. No joke, this is my favorite new tech product in years and it has earned a permanent spot in my travel bag. It is only hard to believe that it works as well as I'm saying until you try XR1 AR glasses for yourself and then you will see that the",
            "start": 1954.08
        },
        {
            "text": "in years and it has earned a permanent spot in my travel bag. It is only hard to believe that it works as well as I'm saying until you try XR1 AR glasses for yourself and then you will see that the future is now. The tech is here. Connect XR1 glasses to wherever you are playing. Whether it's a handheld console, a PC, phone, home console. You just get a massive 150in virtual screen anywhere, anytime for any game. Gaming on the go like a long haul flight? You need the XR1. Next, starting to hurt from staring down at your handheld? We've all been there. You need an XR1. A screen as big as your wall. Instant plugandplay with all of your devices via USBC. Built-in audio with sound by Bose anchoring your screen anywhere in space. It's awesome. It just works. Zero latency at 1080p full HD. These are what make XR1 a musthave. And we hear XR1 Pro is coming soon with an even bigger virtual screen. Hit our link below to get your XR glasses today. There's nothing better than when a sponsor of",
            "start": 1998.16
        },
        {
            "text": "are what make XR1 a musthave. And we hear XR1 Pro is coming soon with an even bigger virtual screen. Hit our link below to get your XR glasses today. There's nothing better than when a sponsor of Kind of Funny is something that we are legitimately obsessed with, and that is exactly the case here with XRE. You're going to hear me talk about these forever. Go to kind offunny.com/xreal. That's kind of funny.com/xr. I promise you, you are going to love these things. This episode's brought to you by Factor. Summergamefest is here. The Switch 2 is here. The sun is here. So many summer things are here. And the number one thing you don't want to be doing all summer, spending hours cooking inside. That's where Factor comes in. Factor chef crafted dietitian approved meals are ready in just 2 minutes. taking the hassle out of eating well. We love Factor here at Kind of Funny and Greg's often making and enjoying meals quick in between shows here in the studio. I just had a roasted garlic chicken",
            "start": 2050.08
        },
        {
            "text": "taking the hassle out of eating well. We love Factor here at Kind of Funny and Greg's often making and enjoying meals quick in between shows here in the studio. I just had a roasted garlic chicken and I'm telling you, you would have loved it. Factor meals arrive fresh and ready to eat, perfect for any active lifestyle over summer and beyond. With 45 weekly menu options, you can pick gourmet meals that fit your summer gains and goals. Choose from options like calorie smart, protein plus, keto, and more. Get started at factormeals.com/kindfunny5050 off and use code kind of funny50 off to get 50% off plus free shipping on your first box. That's kind of funny 50 off at factormeals.com/kindfunn5050 off for 50% off plus free shipping. factomeals.com/kindfunn 50 off. Greg Tim last year Yeah, I saw a trailer for a game called Mixtape. Yeah. The next game from Beethoven and Dinosaur. Yes. Published by Anna Pererna. Yes. My game of the year 20. I don't even [ __ ] know what it was. 20 I'm going",
            "start": 2097.28
        },
        {
            "text": "a trailer for a game called Mixtape. Yeah. The next game from Beethoven and Dinosaur. Yes. Published by Anna Pererna. Yes. My game of the year 20. I don't even [ __ ] know what it was. 20 I'm going say 2021. 2021. Artful escape. The artful escape. In full stop. I'm used to going to all these different things. You know these meeting developers. They're always like, \"Oh man, Greg, I love you. Greg, I love you. You're so amazing. I grew up listening to you.\" One of the mixtape guys said all this. Well, the other guy, Johnny Galvatron. Galvatron, my guy. He made such a point to call out and and make sure you thanked Tim for all the support on the Artful Escape. Like, it really meant a lot to them. Hell yeah. That's awesome. Me and him DM all the time. Seems like a really cool guy. And I hate that you get to meet him. You know what I mean? Years we've talked about, hey, we should hang out. We should grab a drink. We should whatever. And then Greg gets to [ __ ] meet him. And Greg gets to",
            "start": 2145.96
        },
        {
            "text": "that you get to meet him. You know what I mean? Years we've talked about, hey, we should hang out. We should grab a drink. We should whatever. And then Greg gets to [ __ ] meet him. And Greg gets to play mixtape. I did. Well, I'm jealous of you. But how jealous should I be? Incredibly jealous. Uh, this is my game of the show. I played a lot of games and a lot of games I can't tell you about yet, but uh listener viewer, I was floored by this. Uh if you are un if you are not familiar with mixtape, Tim, hit him with a snuff. On their last night together, three friends embark on one final adventure. Play through a mixtape of memories set to the soundtrack of a generation featuring music from DVO, Roxy Music, Lush, The Smashing Pumpkins, Iggy Pop, The Banshees, Joy Division, The Cure, and Stan Bush. Everybody, he's got the touch. He's got the power. Sure does. Um, there's a game I'm going to talk about, I believe, tomorrow where I'm going to tell you ahead of time. I want to put all my",
            "start": 2190.4
        },
        {
            "text": "Bush. Everybody, he's got the touch. He's got the power. Sure does. Um, there's a game I'm going to talk about, I believe, tomorrow where I'm going to tell you ahead of time. I want to put all my hyperbole in a box and we're to set it aside, right? Because I don't want to just be like, gushy, gushy, gushy, gushy. When I tell you this game was unlike anything I've played, um, I think you look at it and you immediately go, \"Oh, it's Life is Strange.\" Right? It's it's one of those kind of game. It's a Greg game for sure. Just glancing at it, talking about a bunch of kids in the, you know, late 80s, early 90s. They're kind of being ambiguous with it if I remember correctly. Maybe late 90s. Uh, but they're like, you know, coming of age, doing all this stuff like, yeah, we've played a lot of these and Greg has talked to you about them a lot through the years and stuff like that, but like it opens and it starts going and it was like, oh [ __ ] like for so many years, we've talked about video",
            "start": 2229.52
        },
        {
            "text": "and Greg has talked to you about them a lot through the years and stuff like that, but like it opens and it starts going and it was like, oh [ __ ] like for so many years, we've talked about video games and oh man, like it's like playing a movie or doing this thing D. Mixtape is like playing a coming of age movie, but specifically playing Ferris Buer's Day Off where like uh the main character here is Stacy Rockford. It's her two friends Cassandra and Slater. And Stacy is like talking to you like this is the thing. She's setting it up. She's explaining what a mixtape is, how you set this up, what's going on, why we're all together, blah, you know, and I'm and like while she's doing this, like there's this amazing thing of like she's talking about them being kids and they cut to real photos of children like being like cutting in and out and they talk about houses and they're showing all these different re IRL houses and it's like whoa. Like it feels like such a blend here between cinema",
            "start": 2266.8
        },
        {
            "text": "of children like being like cutting in and out and they talk about houses and they're showing all these different re IRL houses and it's like whoa. Like it feels like such a blend here between cinema and a video game, right? And then of course I know everybody I talked to when I I was gushing about this game at SGF like well what's the [ __ ] gameplay right? And the gameplay is living these childhood memories and as you see her flying there they're often amped up by what they remember. It's not necessarily how it actually went. It's what it actually felt like to them. So in the beginning you get this whole rundown of what's going on right and she's explaining you know what's going on. blah blah blah blah and the you know it pops up track one uh that's good by DVO and it starts playing and then it's that section you saw them skateboarding down the hill together and going and so you're in control of it and you can you know do your ollies you're pushing you're doing tricks and stuff as",
            "start": 2312.32
        },
        {
            "text": "then it's that section you saw them skateboarding down the hill together and going and so you're in control of it and you can you know do your ollies you're pushing you're doing tricks and stuff as you want the characters are all talking to each other they'll they're coming down the a car will come like car and they'll all like slide off to the side you can screw it up I you know got hit by a car it just and rewinds and has you do it again or whatever it's not like a fail state yes you say you're doing all these you're pushing all this does it feel more skate or more Tony Hawk. It feels way more skate. This is chill. This isn't about actually doing the trick or getting a combo or anything. It's not It's not a skating game. It's just a skating miniame inside of what you're doing here as you go, right? And the whole thing is, yeah, you're coming down doing the thing, blah, blah, blah. You get, you know, you park in front of the house and again, there's more cutaways. It's like, you",
            "start": 2353.52
        },
        {
            "text": "you go, right? And the whole thing is, yeah, you're coming down doing the thing, blah, blah, blah. You get, you know, you park in front of the house and again, there's more cutaways. It's like, you know, I know I love this. I know certain people don't, but it's cutaways similar to a Family Guy, right, of like they're talking to you and then they're back to the action of what's going on and how this is happening. But you get there and then there's like a button combo for your secret handshake with your friends. You go in your house. You're going upstairs to get uh your stuff for a party or whatever you're going to go to that night ride. And Cassandra's like, \"All right, let's go get it and go.\" And like, \"No, no, no.\" Like that's the quickest way to get caught. You need to stay up here 20 minutes minimum, right? So then it's them [ __ ] around in the bedroom, right? Like laying on the bed having a conversation like you would with your friends growing up, right? And then here's where I",
            "start": 2387.92
        },
        {
            "text": "minutes minimum, right? So then it's them [ __ ] around in the bedroom, right? Like laying on the bed having a conversation like you would with your friends growing up, right? And then here's where I was like, \"Okay, cool. Now we're going to get very Life is Strange with it, right? of explore the room, pick up the thing, say something awkward, put it down instead, because they've already established Stacy is talking to you and narrating the entire thing. If you go golden path to the thing that's literally golden and click it in and go, then you're right on the main quest. But if you picked up any of the side stuff, it feels the exact same way because she's talking to about that the same way she would talk about the other stuff. And there's this great line where she like goes over to the the the board of uh photos and grabs one and it's uh it's a her and Cassandra with a person torn out of it and I'm like, \"Oh man, I wonder who they're going to.\" And she immediately refucking Goodspeed",
            "start": 2420.8
        },
        {
            "text": "the board of uh photos and grabs one and it's uh it's a her and Cassandra with a person torn out of it and I'm like, \"Oh man, I wonder who they're going to.\" And she immediately refucking Goodspeed jumped in and I had to cut her out. Jenny sucks. And then just puts it down. You know what I mean? But you're going through and do and then like they're talking about the mixtape. The whole It turns out what's going on here to set it up and give it that real, hey, you're in a teen movie, right? is like it's their final night together because Stacy is going to go to New York the next morning and she's going to go there and find this music producer Bella something or other and she's going to hand her her tape cuz she wants to be a music Stacy wants to be a music supervisor. So she's going to hand her the ultimate mixtape that'll then get her this job and set her up for life. And there's all the cuts and stuff and this is where we're explaining what a mixtape is. They do this whole thing of",
            "start": 2456.4
        },
        {
            "text": "her the ultimate mixtape that'll then get her this job and set her up for life. And there's all the cuts and stuff and this is where we're explaining what a mixtape is. They do this whole thing of explaining what a music supervisor is and it's very documentitarian or like going through and doing stuff, but like they find a tape um that they want to put the kids the Slater and Cassandra the friends want to put on and uh Stacy's like absolutely not. That's a mixtape uh Colin made for her. Colin was her first kiss and it was just to get it out of the way or whatever. And then this cuts to the memory then of them leaning and kissing. And then this is when one of the developers came over, Woody, and he's like, \"I got to play this part with and he grabbed the controller and I had my side and it's just two tongues with the teeth open and the two tongues like lapping into each other and doing this that you could play obviously by yourself but he wanted to make me uncomfortable. Um and and so",
            "start": 2497.76
        },
        {
            "text": "just two tongues with the teeth open and the two tongues like lapping into each other and doing this that you could play obviously by yourself but he wanted to make me uncomfortable. Um and and so then that mini game ends and it's just from the outside the tape getting thrown out of the window into the lawn or whatever. It's like funny [ __ ] like that, right? And so like you're going between it like I I had four tracks in it. It was uh That's Good by DVO, uh Just Like Honey by The Jesus and Mary Chain, Freak by Silver Chair, and then Rainbow by Sensitive to Light. Uh the freak uh silver chain part you saw earlier in there where they have the burgers and stuff in their car. This was an interesting one and again setting up how unlike anything I've played this is where they get in the car and well they have the flashback to the car scene or whatever, right? And they're you're they're driving or whatever and they put this thing on and I was taking a note and the rock out combo popped up",
            "start": 2537.68
        },
        {
            "text": "well they have the flashback to the car scene or whatever, right? And they're you're they're driving or whatever and they put this thing on and I was taking a note and the rock out combo popped up and it was you know all the face buttons and the controller and it faded away and I missed it. I was like oh. Oh. So then I just watched them driving in the car being stoic and I was like, \"Wait, hit the button.\" It's like, \"Oh, I did it.\" And then they just started doing and they're pumping their fists, blah blah blah. And then rather than it just be them pumping like this, it would then cut and it would be Cassandra in the back playing with the lights as I hit the buttons and then her Stacy pounding on the side of the car and then they went and got burgers and they're saying burger weird. Just all the dumb [ __ ] you would do with your friends driving around late at night, right? And then when we're out of that cutaway to do the rainbow sensitive to light one, this is when I made a fool of",
            "start": 2573.84
        },
        {
            "text": "all the dumb [ __ ] you would do with your friends driving around late at night, right? And then when we're out of that cutaway to do the rainbow sensitive to light one, this is when I made a fool of myself and laughed way too loudly at uh this whole booth for these games or whatever because they go there's three photos missing in the little chart as you're reminiscing. So you go and you find him and you put them up and it's all from the first night Cassandra snuck out with y'all. And of course, you go to a house party, she gets too drunk, so you got to carry her out. But the cops show up to bust it up and they put her in a shopping cart and that's where rainbow sensitive light kicks up and you start pushing the shopping cart down the street. But again, it's what you imagine or remember it being. So like your controls are steering, but they're also you just want to spin the cart and be all crazy. And it's like just a funny little crazy segment in general as you're going off ramps and",
            "start": 2609.44
        },
        {
            "text": "being. So like your controls are steering, but they're also you just want to spin the cart and be all crazy. And it's like just a funny little crazy segment in general as you're going off ramps and avoiding cars and they're setting up roadblocks, whatever. But then there's this bit where you take it onto the freeway where there's all these cars and as soon as you hit the freeway it cuts to a hel news helicopter and it's this newscaster doing a VO of just like here we are this highspeed chase and then bring the car down. I tell you Sarah I've been doing this for 25 years and I've only seen this five or six time. I was like I thought it was the funniest [ __ ] joke and then they crash out and do the whole thing and it was just like damn they have set this up so well where I'm like so h I I am so pain that I don't have the full game that I'm so stoked man this is music to my ears cuz like obviously I loved Artful Escape which was also a gameplay light game u but more about the experience",
            "start": 2646.4
        },
        {
            "text": "so pain that I don't have the full game that I'm so stoked man this is music to my ears cuz like obviously I loved Artful Escape which was also a gameplay light game u but more about the experience and kind of the the vibes of going through the world and the story and the writing being so high quality and the just kind of musical experience Looking at this, it really does seem like many steps forward in terms of gameplay. What would you say is the balance between active playing and kind of just experiencing more cinematic stuff? It's hard to say. I would say gameplay is minimal. I think, you know, if we want to go into what's going to catch this game and hurt it or what haters are going to hate about, right, it's the idea that yeah, you're watching a movie for a lot. you're you're participating, but again, it's I'm doing a skate segment that doesn't really matter. And I'm spinning a cart, I don't it doesn't really matter. I'm sure I could have hit stuff with the cart and failed too or",
            "start": 2681.2
        },
        {
            "text": "but again, it's I'm doing a skate segment that doesn't really matter. And I'm spinning a cart, I don't it doesn't really matter. I'm sure I could have hit stuff with the cart and failed too or whatever. It's those little things. So, it's like even when you're playing, I don't even think it's really playing as much as experiencing, which I obviously, as you all know, I'm all for in my games. I think that's going to be an issue for people. I wonder about length. You know, this is a 30-minute demo, maybe a little bit less when I s because I sat and talked for a while, too. Like, I got through four tracks on it. How long is this mixtape? How much are we actually going to get in the music? Cuz it's so tied into it. None of that stops me. None of that scares me. I think this is special. This is a special ass game that I can't wait to play. Play it. Huh? When do we this year? Right. This was one of my hang-ups of the the de the not the demo and of course the trailer they dropped, right? It",
            "start": 2730.48
        },
        {
            "text": "a special ass game that I can't wait to play. Play it. Huh? When do we this year? Right. This was one of my hang-ups of the the de the not the demo and of course the trailer they dropped, right? It was like coming soon this year. Come on. Come on. But take your time. Yeah. I think so far what I've played again this 30 minutes is so good that if you can just expand that into multiple chunks I'd rather you not rush it as you go through and experience this cuz again this was just an incredible experience that I can't wait to play. Yeah, Artful Escape was a little over four hours. So I would expect somewhere around that for this as well. Um and yeah, coming to multiple consoles this time because the first one if I remember correctly was that was Xbox tied to Xbox. Yeah. Um very very cool. Thankful that it is as good as I hoped it would be. Greg, yeah, want to talk about Ratatan. Oh, there it is. Yeah, of course. The Patapon successor. Yes, you got to play it. That's wild. Developed by",
            "start": 2765.84
        },
        {
            "text": "Thankful that it is as good as I hoped it would be. Greg, yeah, want to talk about Ratatan. Oh, there it is. Yeah, of course. The Patapon successor. Yes, you got to play it. That's wild. Developed by TVCo uh with Rattata. Yeah, Rattata Arts. God, [ __ ] Mike, how do you say it? Ratata. Ratata, baby. I have to slow down and go. Ratatan. Rattatan. Ratatan. Uh, this is coming July 25th on PC early access. Ratatan is a rhythm roglike action game that combines rhythm games and sides scrolling action with online co-op gameplay supporting up to four players. Recruit allies and dance your way to victory. March across the world of Redo. Build your coin army and combine forces with your closest friends. Greg, hello. Does it live up to your dreams? Yes. I hope everybody knows how much I adore Patapon. How much I love Patapon. How uh intimidating it was to play this in front of the creators of Patapon. You know what I mean? Um, uh, it lives. It's different in a good way. I think there's two,",
            "start": 2807.92
        },
        {
            "text": "How much I love Patapon. How uh intimidating it was to play this in front of the creators of Patapon. You know what I mean? Um, uh, it lives. It's different in a good way. I think there's two, well, three moments to tell you about in this demo. Number one, uh, this is a rog light, right? Uh, did you read the synopsis on this one? Uh, Tim, did you read the Okay, cool. I'm already lost. Sorry. Uh, so it's a rogike rhythm rogike, which is different than what Patapon was, right? As you march through levels and do the thing. So, in the very beginning, I impressed the [ __ ] out of everyone there. I was told when uh I finally fell to the first boss and they came over like, \"Just so you know, you're supposed to die here, but no one's taking this much health off of him.\" I was like, \"Fuck yeah, I still got it.\" You know what I mean? Cuz I'm dusting off some chops out here. Then there was the midsection where again they interrupted my demo and they're like, \"You're dying a lot, but it's",
            "start": 2857.84
        },
        {
            "text": "I still got it.\" You know what I mean? Cuz I'm dusting off some chops out here. Then there was the midsection where again they interrupted my demo and they're like, \"You're dying a lot, but it's because you're playing it like Patapon and you that's not what this game is.\" Uh in this game, you know, you control your middle character there, right? uh your Ratatan uh who had then has the uh Cobun army around you, the little guys running around you. What's I don't want to break brains and I also don't want to bore people to death, but in Patapon to move your troops and yourself, you had to put in your drum beat commands and they march to it and then you put in drum for attack or defend or whatever. You had to do it on beat. You can control uh Ratatan with your uh stick. So you aren't sitting there going, I got to command. I have to. So I was running into battle with the stick calling in my army and then my guy was staying there and getting wailed on when he shouldn't have cuz the Coban",
            "start": 2900.4
        },
        {
            "text": "there going, I got to command. I have to. So I was running into battle with the stick calling in my army and then my guy was staying there and getting wailed on when he shouldn't have cuz the Coban army will respawn if you stay alive yada yada. So like basically it's a as they described, you know, pat your head and rub your tummy kind of thing of I got to bring my guy in, bring in my a my troops, and then I got to run back and get to a safe distance or whatever I'm trying to do to defend. Once I got that under uh me a little bit, I was like, \"Okay, cool.\" And then I got to the end and they were very impressed again. I They even said this in the follow-up email that I went in there and almost beat the boss, but I went in with like seven health out of 200 and they were like, \"I going to get wiped right away, but I hung in there to, you know, the very last second.\" So, does it live up to my dreams is a great question, Tim. I would say this is a completely different dream. I'm just",
            "start": 2943.84
        },
        {
            "text": "to get wiped right away, but I hung in there to, you know, the very last second.\" So, does it live up to my dreams is a great question, Tim. I would say this is a completely different dream. I'm just excited to see the creators of this have another shot to make something special. Uh I didn't put it in my notes here, but like you know this is a Kickstarter. Uh I I put my money into it over there as well, but it like set some records and did a whole bunch of things and you know blew blew apart the funding because there are so many Patapon sickos like myself. So this demo was a great taste of it. Uh I am excited to actually get in and start really playing it. There is a demo up right now for Steam NextFest that you can get jump in and do. But as you see like going in and leveling this up, picking the different you know rogue light cards there at the end and stuff to figure out what your next thing is going to be. I got cards, but it was so fast and so furious in the 30 minutes. I didn't",
            "start": 2982.24
        },
        {
            "text": "the different you know rogue light cards there at the end and stuff to figure out what your next thing is going to be. I got cards, but it was so fast and so furious in the 30 minutes. I didn't see the differences and I was picking different uh retatans to take out there because they have different powers or whatever. But again, kind of lost on me as I just try to get in there and feel through it and go through it. uh this trailer, and I'm sure this is a a function of the game itself, doesn't show it, but I liked that uh on the very bottom bar uh of the actual game, it keeps up the commands, so you can look, you have your cheat sheet there, so you know what you're doing. If you're looking at this and like, oh, they cleaned up the HUD for this trailer you're watching right now. And I'm sure again once you've memorized everything, you can turn it off. But it piqued my interest, I guess. Obviously, that's stupid because it was already peaked, but it is enough of like, oh, this is",
            "start": 3020.88
        },
        {
            "text": "I'm sure again once you've memorized everything, you can turn it off. But it piqued my interest, I guess. Obviously, that's stupid because it was already peaked, but it is enough of like, oh, this is different enough where it's not going to be like what I think Patapon 2 remastered was where Patapon 1 got re-released finally, right? And I had consulted on trophies for that with PlayStation. Played it platinum and had a great time. Patapon 2 came out finally and I played again. I'm like, well, it is more Paton and it is a game I've played and reviewed before and I walked away and I've never felt compelled to go back to it. Whereas, this is doing something different, let alone coming to early access and I'm like, I want to jump back in there and try that out. Visuals look great. the backgrounds and the little text that pops up. I love the style cuz it very much feels like Patapon but different. Yeah. And it's got the catchy beat and it it feels like Patapon but different. And then it",
            "start": 3057.76
        },
        {
            "text": "and the little text that pops up. I love the style cuz it very much feels like Patapon but different. Yeah. And it's got the catchy beat and it it feels like Patapon but different. And then it but it looks like a lawsuit. I don't know who they've talked to over there to make sure this was kosher. But even having fever at the top of the screen, which is such that's directly out of Patapon, the fact that it is even though they look a little bit different, they are still the big black eyeball guys. I'm like, I don't know, man. You know, go for it. They would have stopped you by now. Yeah. Yeah, that's true. Uh, you played a whole bunch of other games, Greg. I did. Yes. Like Escape Academy 2: Back to School from Coin Crew Games coming in 2026. Class is back in sess session with Escape Academy 2: Back to School. Play in solo or co-op and explore an allnew campus. Escape life-threatening puzzle rooms and unravel a conspiracy as old as the school itself. All before the bell rings. I know you",
            "start": 3090.64
        },
        {
            "text": "2: Back to School. Play in solo or co-op and explore an allnew campus. Escape life-threatening puzzle rooms and unravel a conspiracy as old as the school itself. All before the bell rings. I know you and Bless really [ __ ] bad. Here's my diary of a mad man. Scribbles to get it. Ah, yes. We love Escape Academy. Bless and me. We They mentioned when we were there how Bless and I had set records back toback years of playing there and doing other things. Um this is a great trailer they're showing you right now. I think it misses what makes this special. Of course, uh Escape Academy is first person escape rooms you can play with your friends or whatever. There's a narrative then on top of the original Escape Academy that you're at a school where you're becoming the ultimate escape artist. Ya da da da da. What was cool about this one is it is still that, but then there's this open world of the school and the campus to go explore that have puzzles all around them for you to solve and do",
            "start": 3129.68
        },
        {
            "text": "Ya da da da da. What was cool about this one is it is still that, but then there's this open world of the school and the campus to go explore that have puzzles all around them for you to solve and do things to either advance plot or just dick around if you want to and stuff. So, this is always a hard one to preview cuz I never want to, you know, ruin the actual puzzles that you're going to get into. But, you know, you start, you're on the train to class. This is a direct sequel to Escape Academy 1. Not that you need to get like there's a story whatever but you're the same character. One of the first people you meet is the girl from the very end of the game as well. You're back for your second year of Escape Academy. And so people know you and reference you a little bit when you're talking to them. But you start on the train back to school. You get gasped. You wake up in a classroom and the ceiling is coming down with giant spikes. And so you have to figure out the names of the three",
            "start": 3172.0
        },
        {
            "text": "to them. But you start on the train back to school. You get gasped. You wake up in a classroom and the ceiling is coming down with giant spikes. And so you have to figure out the names of the three founders by going around the classroom and doing all manner of puzzles of doing some math, doing some finding, doing some lockpicking, doing all that stuff. Uh then you got out and you were out into the school. I think one of the fun things that you know, one of the puzzles I will like I will spoil, I guess, but it's not a puzzle puzzle, but you get out of the thing and you're walking around, you're talking to people and like your first thing is like you got to go to your locker, right? And there's just halls and halls of lockers. So it's like, well, who am I? And then there was this whole uh wall of students with their numbers underneath them. And I was like, \"Oh, what a clever character creation suite of go and pick it and I'll walk to that class, go there.\" No, that's not how it is. It's",
            "start": 3210.72
        },
        {
            "text": "of students with their numbers underneath them. And I was like, \"Oh, what a clever character creation suite of go and pick it and I'll walk to that class, go there.\" No, that's not how it is. It's like I came back and then I got mad at him for it. But the dev did go, \"Oh, if you're stuck and I was like, I would not.\" And he said, you know, \"Look in a mirror.\" And I was like, \"Oh, that's really good.\" So I went to the bathroom and looked in the mirror and came back and did it. It's like that kind of thing, right? And then it's key cards and it's this and it's puzzles and it's statues and it's looking into this thing and it's staring at the cover of a book being like, \"All right, what? how what is on the cover of the book that would then go to this to then go to that to then go like it's it's what I loved about Escape Academy one and I love the fact that it's now cool get to your dorm figure out how to do that on your own like through all these different you know bits and bobbles for",
            "start": 3245.52
        },
        {
            "text": "it's what I loved about Escape Academy one and I love the fact that it's now cool get to your dorm figure out how to do that on your own like through all these different you know bits and bobbles for it. It is still co-op. You were asking me about this before. Yeah, it is still co-op. I didn't get to see that. I don't know how that'll work in this open world, but I imagine you're tackling the puzzle together in terms of what you're doing. But I don't have a lot on that. Plus, you're stoked for more? Oh, I'm so stoked for more. I I watched the trailer cuz this is one that appeared at Day of the Devs and I was both excited but then at the same time concerned with the open world stuff cuz I did like the idea of hopping into these rooms one at a time and having it be this focused. All right, we know what our what we're tasked here to do and me and a friend just going through and beating the rooms one by one. Um I don't know how it being open world is going to like change that or maybe",
            "start": 3279.76
        },
        {
            "text": "we know what our what we're tasked here to do and me and a friend just going through and beating the rooms one by one. Um I don't know how it being open world is going to like change that or maybe layer it, you like we this year blueprints is such a big game and that's a game that is layers upon layers of the puzzles that are at play and like that is kind of an everlasting gobstopper of a puzzle game and I love it for that but at the same time I really like Escape Academy for how focused it is. Um and so that's the one thing where I I really want to see more and I want to hear more about what Greg thinks about that. But like overall I'm just I'm just very glad it's back. Like I this wasn't like a given thing for me of oh we'll see more Escape Academy. Yeah, 100%. Yeah, I I was worried to a degree, right? because we loved it and we loved the DLC, but then it kind of felt like no one ever talks about Escape Academy. So, the fact that IM8 is making it happen again, I'm very happy that",
            "start": 3312.56
        },
        {
            "text": "a degree, right? because we loved it and we loved the DLC, but then it kind of felt like no one ever talks about Escape Academy. So, the fact that IM8 is making it happen again, I'm very happy that they're publishing this. Totally. Uh, next up, Blighted. Drink Box, Greg. Yeah, Drinkbox of course came out and announced uh Blighted, you know, that's an interesting one. If you're not familiar with Drinkbox, we've known them forever. Of course, they broke Embargo years and years and years and years ago. And let me go into the the trophies on VA when we were there previewing their VA games or whatever. Now, you'd know them from, of course, Severed. You'd know them from uh Guaca. The list goes on. Friends of the show for sure. Uh this is one. Yeah. Jumping into was interesting, right? Battle your way through a psychedelic western nightmare to reclaim the memories of your people in this action RPG from the creators of Guacamele. Harness the power of deadly reality altering blight and unravel",
            "start": 3348.72
        },
        {
            "text": "way through a psychedelic western nightmare to reclaim the memories of your people in this action RPG from the creators of Guacamele. Harness the power of deadly reality altering blight and unravel the mysteries of a twisted world. Of course, seamless co-op. Uh they've shown some stuff uh you running around with your giant scythe and slicing people up. uh at when it it debuted at SGF, right? The Jeff show. Yeah. Yeah. Yeah. Um you know, they talked there about the action RPGishness of it. We looked at it like, \"Oh my god, that looks so cool. It looks like Hades. It looks like this. A little bit of this, a little bit of that. It's got the drink box style, which is amazing. This is a Souls game.\" They when we sat down and demoed it, they were immediately like, \"You've played Souls games, right?\" I was like, \"Oh, [ __ ] Here we go.\" Like, \"Yeah, I have. I'm not really good at them. I've beaten Bloodborne. It's not my real take on a game or where I want to be.\" But that's what they're",
            "start": 3386.24
        },
        {
            "text": "right?\" I was like, \"Oh, [ __ ] Here we go.\" Like, \"Yeah, I have. I'm not really good at them. I've beaten Bloodborne. It's not my real take on a game or where I want to be.\" But that's what they're doing here. here and they have some really neat systems they're working on. This is very early. They were quick to point that out that they're like they're introducing things to me and showing me things, but I mean like this could change or this could go this way, right? But you have your gun like a Bloodborne, right? It's not your main thing, but you have it. You have combo attacks. You can do all these different things. There's finishers to run up on. What is interesting, of course, there's pairing and there's all this stuff and there's the giant monsters to fight and da da da da da. What I thought was really cool is that drinkbox games, I think, have a very wide audience. Obviously, not mainstream by any stretch of the imagination, sadly, because so many people don't have taste, but it",
            "start": 3423.76
        },
        {
            "text": "thought was really cool is that drinkbox games, I think, have a very wide audience. Obviously, not mainstream by any stretch of the imagination, sadly, because so many people don't have taste, but it appeals to a lot of different players that might be like me where it's like, \"Oh, we're doing a a Soulsy thing. I don't know if I'll join you on this.\" What's really cool is down right now, and this could all change in the left corner, they have uh this blight meter, right? So, as you play, this starts filling in based on how you're playing. So if you are Perry Poppy Blessing and you're [ __ ] knocking things back and chopping things up and doing this thing, it's going to fill up and increase your blight level. So the game is going to get harder for bless where suddenly, you know, these things on the ground that are environmental things that wouldn't affect me because I'll be dog water at it. For Bless, they're going to be obstacles. They're going to pop in. They're going to be this uh",
            "start": 3458.88
        },
        {
            "text": "on the ground that are environmental things that wouldn't affect me because I'll be dog water at it. For Bless, they're going to be obstacles. They're going to pop in. They're going to be this uh enemies might have a second wave or third kind of attack that is something far different than what I'm trying to figure out with a basic block or whatever. There's also going to be like bonuses to it. So, it's not just you're being punished, but it is the idea that the game for blessing me might be distinctly different when we come back and talk about how it was, which I really thought was a nice way to keep it going. You know what I mean? If I'm using potions, which I would be, I'd be bringing it down in difficulty. Difficulty might not be the right word, but some kind of scalability to make sure everybody can play. Interesting. Okay. Sorry. Um, yeah, like you saw one there was a giant horse enemy dragon. It's dead head over there, right? Once we killed that, that got me the horse stomp that",
            "start": 3499.04
        },
        {
            "text": "everybody can play. Interesting. Okay. Sorry. Um, yeah, like you saw one there was a giant horse enemy dragon. It's dead head over there, right? Once we killed that, that got me the horse stomp that I could then use. It's a move I can use to break through stuff, but also use it in combat, which I appreciate over that. You can go to the tree and you can cleanse yourself of the blight if you wanted to, but then you would erase the positives you had. So, if I did get over my head and I had a great section, but I'm like, I don't like doing this, I could take that away. Uh, the idea of the story is, you know, you're trying to find the guy who is the big bad, and to do that, you have to beat his minions and eat their brains to get their memories to figure out where it is. So, it's Metroid Vania like Guaca Melee was cuz you'll be unlocking new things with the new moves, but then it's also Soulsy and combat, but then it's also this 2D Hades isometric kind of thing. A little bit of all the",
            "start": 3531.92
        },
        {
            "text": "like Guaca Melee was cuz you'll be unlocking new things with the new moves, but then it's also Soulsy and combat, but then it's also this 2D Hades isometric kind of thing. A little bit of all the things. Yeah. And I think most importantly, it's distinctively drinkbox. You know, as somebody who has connected with their games for so long, they all have a vibe art style to them and you can see that here and I really appreciate that. And then Toll 2, developed by something we made coming 2026. step back into the shoes of a curious photographer and set off on a brand new adventure all about uncovering hidden details, helping friends along the way, and documenting the world's little wonders. Tow, I I won't bend your ear too long on this one. Hopefully, you all know how much I adored Tow. And also worth pointing out even even beyond the usual disclosure statements of Jen did. She did Pop Agenda, of course, my wife's company that she doesn't matter. I'm not getting in the weeds of it. Uh",
            "start": 3567.36
        },
        {
            "text": "also worth pointing out even even beyond the usual disclosure statements of Jen did. She did Pop Agenda, of course, my wife's company that she doesn't matter. I'm not getting in the weeds of it. Uh anyways, they did uh PR for drinkbox and for Mixtape. I left that off because they're actually co- They're publishing Tow uh with something we made this time around. So, that's a big deal for them. So, take anything you want with a grain of salt here, but you also know I love Tow back in the day. Portillo was in it. It's a game that is a photography quest game, a cutesy little one. I won't bend your too long on this one. It's more of that, which I love. There's more quests on every screen. It felt like there are more photo ops, which I love. You now have a selfie thing, like a a drone that can be your selfie for you, so you can just take cool photos yourself that I like more. The camera is going to get new functions in every area. The one I had, it had the bonk function. So you could break",
            "start": 3606.0
        },
        {
            "text": "be your selfie for you, so you can just take cool photos yourself that I like more. The camera is going to get new functions in every area. The one I had, it had the bonk function. So you could break walls now. You point your camera and you could break with the hammer, break walls, get through, use them in the little little quests, little puzzles to get the way to go do the thing, to get whatever the person needs to give it to them to move about your way. Get your stamp in your little passport so you can move on to the next area of it. Um, again, I it's hilarious. It's funny. Something we made is such a clever developer. It's so cozy. You know what I mean? Like that's one of the reasons I love Tome so much. Just beautiful music. Tome 2 has gorgeous music so far. Just uh fun stuff. They've added platforming. You are jumping and climbing and doing in this one. So like the big one is these abilities like bonk. Then of course being able to climb and do these things. Like it's fun. I like",
            "start": 3645.92
        },
        {
            "text": "added platforming. You are jumping and climbing and doing in this one. So like the big one is these abilities like bonk. Then of course being able to climb and do these things. Like it's fun. I like it. And then Directive 8020. Yes. Developed by Super Massive. Coming October 2nd, 2025. Earth is dying and humanity is running out of time. It's like that one video of the girl Tom on Call of Duty the montage with the da punk music. You were all here in this moment. Live in this moment. 12 Yeah. 12 light years from home. Ta said f offers a small sliver of hope when the colony ship cast whatever. Greg, what's this game? Uh, this is another super massive game. It's not the Dark Pictures anthology. It's a Dark Pictures game. Like that's like the subhead of it, right? Where it's like very much this is Directive 8020, a Dark Pictures game. Like they're not trying to do that. Get away from it. story and Until Dawn level is how I put that in between because this one still says dark pictures but I",
            "start": 3681.6
        },
        {
            "text": "is Directive 8020, a Dark Pictures game. Like they're not trying to do that. Get away from it. story and Until Dawn level is how I put that in between because this one still says dark pictures but I don't think we're going to have the opening with the crow man and all that stuff. You know what I mean? I think we're going to just jump into it and they put that on there so you know it is a dark pictures game right rather than anthology. This was one that was the first trailer was in the last Dark Pictures anthology game. Okay. And so it's Yeah, I wondered about that cuz it they seem to have been taken longer to put this one out. So I do wonder where that's going to fall scale-wise. Yeah, I think it's very good. Uh we are super massive fans here, but we're super massive fans when we're like, \"Oh, yeah, there's some it's a fun game. Even if it's bad, it's going to be a fun game, right, of us going through and do this one. Will this good be good? Will it be bad?\" Who knows? Uh the demo was",
            "start": 3725.68
        },
        {
            "text": "\"Oh, yeah, there's some it's a fun game. Even if it's bad, it's going to be a fun game, right, of us going through and do this one. Will this good be good? Will it be bad?\" Who knows? Uh the demo was impressive. Uh it started with Monica Rambo, she's the lead actress here, I forget her name, having a it was just a conversation, Shauna Lynch. Uh it was two days before launch and it's her having this conversation uh with one of the guys you see here. uh and going up and talking about her father who had died, but they're space people and they're going up to space to do all this different stuff, right? Uh then it goes and it jumps four years later. Stafford is the guy here and it's like you're they're in there, there's this weird growth all over all the you know the hydroponics or whatever and like oh my god and then a doppelganger shows up and then another doppelganger and it's very much like you they immediately get into this fight with these creatures and then of course I'm I get cast",
            "start": 3764.08
        },
        {
            "text": "like oh my god and then a doppelganger shows up and then another doppelganger and it's very much like you they immediately get into this fight with these creatures and then of course I'm I get cast as the other guy there and I'm trying to sneak around and get to the things. What I liked about it as somebody who knows these games inside and out and why I think this one's interesting and different, right? Yes, there was the path, you know, choose which option do you want and like the AB choice to move it on. But number one, with this being a space one, the HUD elements when they popped up really were like, oh, this doesn't feel like the usual super massive thing. This feels like, oh, I'm I'm playing a space game, right? That's cool. The other thing that was neat is I did the sneaking section to get away from the monster. I climbed up the ladder right into another scene of tension of like there's a guy and the scanner and they're like, \"Stop. copy's one of them and it's the whole thing",
            "start": 3802.32
        },
        {
            "text": "to get away from the monster. I climbed up the ladder right into another scene of tension of like there's a guy and the scanner and they're like, \"Stop. copy's one of them and it's the whole thing and seamlessly they didn't make a big deal about it even though I just climbed up the ladder and then went into this cut scene I then had to make a choice from the other guys the other guy who would come up the ladder as well so it wasn't usually you know like when we change perspectives in these games it is like now you're going to be Tammy like see Tammy's face up close or whatever like it wasn't that it was just seamless of like I'm going the narrative is going the movie is going and I'm making those choices and again I made the choice it was a big one of basically would I have killed this guy or not killed this I it plays out the way it plays out. I won't ruin it for you. What's a nice addition again to what they've already done so many times here is they're kind of taking a page out of",
            "start": 3838.56
        },
        {
            "text": "or not killed this I it plays out the way it plays out. I won't ruin it for you. What's a nice addition again to what they've already done so many times here is they're kind of taking a page out of Detroit Become Humans book, but making it maybe a little bit better where when my demo was done, they're like, \"Okay, look at this.\" And they pulled it up and it was like, you know, the giant timeline of choices, this thing, and then it branches here and it goes here. But at any point if you want to, you can go and play from that point just to play out the other option, do a new save and go that way. uh there is going to be like a hard mode that wouldn't allow you to do that like but it's like you know whatever it was a nice little shakeup to how they've done this before and really I think listening and learning on what's going on. Is there still co-op? Yes, of course. Uh they went through that. I I made a point. Yeah, there's couch co-op is always right. There's the normal one where you",
            "start": 3874.08
        },
        {
            "text": "and learning on what's going on. Is there still co-op? Yes, of course. Uh they went through that. I I made a point. Yeah, there's couch co-op is always right. There's the normal one where you would pick a character and live out as that person. There's one mode where it just picks for you and there's another mode where it's like you pick your characters but if yours all start dying, you start getting other people's characters so that you can still play and participate and be part of the game. Oh yeah, Greg, you have three more games here that I want to hear about. All right, Theater of Idols coming 2025 from Vermilla Studios published by Blumhouse Games. Yeah, this is uh I I did backto-back uh Blumhouse Games uh ones in here. You have uh this one here for Chris and then we'll talk about Grave Seasons in a second. Um, last year of course, uh, Blumhouse, uh, made a big presentation at SGF about the fact they were doing all these games and they did the one that I can picture. Thank you so",
            "start": 3910.64
        },
        {
            "text": "Seasons in a second. Um, last year of course, uh, Blumhouse, uh, made a big presentation at SGF about the fact they were doing all these games and they did the one that I can picture. Thank you so much. I was like, I knew it there. I played it there. I loved it there. I was so excited about what they were doing. They had two games there this year and I'm less excited about them. There is I I don't think it's a that they're bad. They just didn't speak to me, if you will. Uh so yeah, this is uh Cruz as we said you're in this and this doesn't really show it that off well I think but like it's a first person horror action game set in Hispania a twisted version of Spain and the idea is you watch here your guns shoot blood bullets so you suck the blood out of dead things you find around the world right these are mannequins you're fighting so they wouldn't bleed which sucks let me tell you and if you don't have anybody body's blood to suck, you can suck your own blood and use those as",
            "start": 3952.0
        },
        {
            "text": "world right these are mannequins you're fighting so they wouldn't bleed which sucks let me tell you and if you don't have anybody body's blood to suck, you can suck your own blood and use those as bullets to do it. But it's very, as you see, survival horror, you know, reminiscent of Resident Evil. So, it was a lot of sneaking and a lot of trying to, you know, craft a resource or get the med pack to get to here to open the thing, but these guys are chasing me. Bah. I don't think abbreviated demo did it justice. I think it was one of those like I'd want to play that from the start to really get my head strapped on because in there I was like, \"Okay, I don't think the blood getting sucked out looks that great. It's a cool concept, but it didn't look incredible.\" The gunplay didn't feel like I was enjoying this. I didn't And maybe that again, that's the point. It is survival horror, but I'm getting multiple mannequins coming at me. I want them to die and go away. There's a big creature. I",
            "start": 3999.52
        },
        {
            "text": "was enjoying this. I didn't And maybe that again, that's the point. It is survival horror, but I'm getting multiple mannequins coming at me. I want them to die and go away. There's a big creature. I don't know. Something about it just didn't work for me that well right where we are now. So, I'll be interested to see as we get further in there because I like Blum House so far with the one game and the idea and the movies obviously, but we'll see if it's maybe I'm just I'm also not a shooter guy or an old school survival horror guy. So, we'll see. And then Grave Seasons, the other one from Blow Mouse Games. Uh, Grave Seasons, a narrative farming sim with a terrifying twist. Someone in the town is a supernatural serial killer. Farm, romance, and investigate your way through the unsettling town of Ashen Ridge. As we all know, farming sims are a dime a dozen. And so you're starting to see people put more and more uh interesting ideas on them. Uh yeah, this one is that you are an escaped",
            "start": 4036.64
        },
        {
            "text": "town of Ashen Ridge. As we all know, farming sims are a dime a dozen. And so you're starting to see people put more and more uh interesting ideas on them. Uh yeah, this one is that you are an escaped convict. You showed up at this house and now have claimed it as your own because it was abandoned. So people in the town start showing up. You start lying about who you are, what you're doing, and you start doing the normal farming [ __ ] and then all of a sudden, you meet somebody, this happens, and then a [ __ ] werewolf attacks that person and drags them into the woods, and there's blood, and it's just like, okay. Like, if it wasn't the farming sim, I might be more into it. But again, I'm just not the farming sim person. Like, that's not what I really like. I I love an Animal Crossing, not so much a Harvest Moon, you know? So, it's interesting. It's quirky. It's It's got a cool art style cuz it looks like that cute cozy game, but it's clearly dealing with werewolves and the occult and",
            "start": 4075.04
        },
        {
            "text": "so much a Harvest Moon, you know? So, it's interesting. It's quirky. It's It's got a cool art style cuz it looks like that cute cozy game, but it's clearly dealing with werewolves and the occult and whatever the hell is going on. So, I'm interested to see more and actually see. That's a sick ass logo. That's a sick logo with the wolf eye popping. That's [ __ ] awesome to see how in the weeds the farming gets and if it would be enough to keep me away or if it's going to be like, \"Oh, okay. This is so top level.\" I don't know. Yeah, that was a great seasons. I mean, people love Fields of Mistria for all the sexy characters. Yeah. Yeah. I I wasn't immediately, you know, popping boners for anybody, but maybe we'll see how it goes. Well, Greg, were you popping bonus for Crimson Desert? Stop it. Tell me all about the pearl of this. I need to know all about it. Do you want to read the little synopsis? Crimson Deserts, an open world action adventure game set in the beautiful yet brutal",
            "start": 4114.72
        },
        {
            "text": "it. Tell me all about the pearl of this. I need to know all about it. Do you want to read the little synopsis? Crimson Deserts, an open world action adventure game set in the beautiful yet brutal continent of Pywell. This is the game that's the everything all at once. The first time we saw it, we're like, \"Oh, cool. It's in action. Oh my what? Oh, he's flying. Oh, he's got superpowers. Oh, you know, and everybody's been like, \"What is this game? Is this game real?\" Mike, you went and saw a tech demo at GDC. Yeah, me and Andy went to the tech demo at GDC. We came back. We did a whole Games cast about like the insane tech behind this that Pearl Abyss is putting in to their engine that they will use for the future and this game. So, yeah, we got to see the tech, but is it fun to play? Here's what I want to do. I want to jump to the end and start there. There was a boss fight at the end that was so [ __ ] fun. I to jump to the start. Here's what I would tell you. What I wrote down.",
            "start": 4154.8
        },
        {
            "text": "Here's what I want to do. I want to jump to the end and start there. There was a boss fight at the end that was so [ __ ] fun. I to jump to the start. Here's what I would tell you. What I wrote down. Nothing is intuitive right now. And I think again you talk about game previews and this is they said I was 60% through the game when they tossed me in here. And it is okay cool. You know, you have your light attack, you have your force palm, you have like I took a I don't want to show it to the audience because I'm not sure if that but like this is the controls and then they were putting the combos down here, Mike. And it was like my head was swimming already to jump in there and figure this out. And so it was like everything felt like it took two more steps than I would want to of like talk to this NPC. All right. Oh, hold L1 and then hit square. Okay. And then it was this thing of, oh, this mission is there's a flag that's been knocked down at this just gigantic pole, right? Go over",
            "start": 4193.84
        },
        {
            "text": "to this NPC. All right. Oh, hold L1 and then hit square. Okay. And then it was this thing of, oh, this mission is there's a flag that's been knocked down at this just gigantic pole, right? Go over there. And I I think I jotted this down because it was So go over there. Yeah. Uh you hit you target it and then you hit the square and I'm you hit two buttons that'll then lock it. But then you have to use your stick to rotate it. Oh, no. Then you tap tap tap to lift it. Then you rotate it with your stick and then you can go and like there's I there was a very nice gentleman with me who has a very high fallutin title over there and I felt so bad for him cuz the first he's doing it and I'm trying to do it but there's things on this. So I clicked it and I lifted it but then I dropped it too early and it it's a preview so it bugged out on where I dropped it. So we had to reload and I did it and then I put it down too soon and then I was like okay I walked and it was like again I felt like I",
            "start": 4240.4
        },
        {
            "text": "and it it's a preview so it bugged out on where I dropped it. So we had to reload and I did it and then I put it down too soon and then I was like okay I walked and it was like again I felt like I was already mid marathon and they were asking me to sprint right now. I'm like, I don't know how to walk. That same mechanic gets used in the boss fight where I'm doing an in a fight inside with this big dude, right? And you'd whail on him and get him stunned or whatever. He'd go down and then you by in the fight you were breaking pillars. So then you had to do the same thing to pick up the pillars and then slam him on the [ __ ] head with it. And I was like, \"This is dope.\" You know, 30 minutes or maybe it was even an hour in, I forget. And now it's clicking. Now it's jelling, which really made me go, man, I would have loved to gone back and do the start of this demo and go. Because the start of the demo was also kind of convoluted. The very nice gentleman was like, you know, we put a",
            "start": 4282.88
        },
        {
            "text": "made me go, man, I would have loved to gone back and do the start of this demo and go. Because the start of the demo was also kind of convoluted. The very nice gentleman was like, you know, we put a gajillion people on the screen. He's like, you don't have to fight them, so you can just run to the objective and do the thing. And then because that's your real objective, this isn't your fight. It's like, oh, cool. And I take off running and he I got my horse. Big thing they need to fix. You call on your horse. Again, not intuitive. You still got to climb on your horse. Assassin's Creed had finally done away with that. Remember where the horse runs in and we just jump on the horse? I want the horse. Let me on the horse. I jump on the horse. I run in. I'm running through these fights. I get knocked off my horse. And then it was like 30 [ __ ] dudes from different armies all fighting me. And I'm like, please [ __ ] stop. And so then it became me running from 50 dudes trying to call my",
            "start": 4318.64
        },
        {
            "text": "knocked off my horse. And then it was like 30 [ __ ] dudes from different armies all fighting me. And I'm like, please [ __ ] stop. And so then it became me running from 50 dudes trying to call my horse. The horse keeps getting knocked out. So it was just like this whole whatever. But on a plus side of it, like again, I think it's not intuitive, but then again, would any video game being tossed in there be? There was a section of, okay, cool. We get up there, we fix these cannons. Now we got to shoot these cannons to take out these watchtowwers, right? And so it was finding the sweet spot, targeting, knocking them down. As you look here, the game is gorgeous. I didn't think it presented well on the TV. Not that it was bad, but I think this is prettier than what I was playing on the TV. It felt like HDR was broken where it would be like you swing around and everything's dark for way too long where I have to walk and find the light kind of thing. And so there's little things like that,",
            "start": 4351.68
        },
        {
            "text": "felt like HDR was broken where it would be like you swing around and everything's dark for way too long where I have to walk and find the light kind of thing. And so there's little things like that, but inside in that big boss fight, it it looked better for sure. out here. There's so much going on. I don't like the font they're picking, as you see over here, like Crescent Isle Abyss. It kind of looks like Comic Sands. I'm not a fan of that. It does. Squished a little bit. It is a It's a demo that left me wanting to play more, which is good. I I I could easily see wanting to play more and be like, \"This is a six, five, six, whatever.\" I could also see wanting to play more and be like, \"Oh man, starting from the scr like imagine Kingdom Come Deliverance, too, if they were like, \"You're 60% in. Here you I'm like, \"How the [ __ ] do I change my armor and attack somebody?\" Like, I feel like it could also be that we get in there and there's so much in this game built on as you saw like",
            "start": 4389.44
        },
        {
            "text": "60% in. Here you I'm like, \"How the [ __ ] do I change my armor and attack somebody?\" Like, I feel like it could also be that we get in there and there's so much in this game built on as you saw like you're flying a dragon. You're you're in like Zelda Sky Islands there. There's a lot of stuff going on. You're changing your armor. You're changing your look. You're doing this like you again, you have force powers that I barely understand why or how or whatever, but I I am intrigued. I would take another demo gladly. I would love a build. I would love final product on it and stuff like that. Well, Greg, yeah, that's all you have today for the Summer GameFest Play Days experience, but throughout the week, there will be many more games throughout the weeks to come. There'll be more games that you have played. So, stay tuned for more Gamescast episodes about everything Greg got to do down in LA at Summer GameFest. Uh, real quick, I have three more super chats I want to get through. Big",
            "start": 4428.32
        },
        {
            "text": "you have played. So, stay tuned for more Gamescast episodes about everything Greg got to do down in LA at Summer GameFest. Uh, real quick, I have three more super chats I want to get through. Big Afroman saying, \"Just to be clear, since messaging is vague, this won't play our whole Xbox library, right? Only Xbox Play Anywhere compatible titles.\" Talking about the Xbox Ally, that is correct. I don't feel like they're being vague. I feel like they're being very clear about that part. It's just where it gets confusing is that there's a lot of just different parts. There's three avenues to play. There's natively with Xbox Play Anywhere PC, a PC game, an Xbox PC game. There's cloud gaming, which would be your library as it is so far. And then there's remote play. That's what they're saying. So, yes, it could play your whole library. Could it play your whole library on a plane? No. Yeah, exactly. Uh, and then Wicked Pixelated says, \"Been a rough week personally. Just want to say thank God",
            "start": 4468.88
        },
        {
            "text": "yes, it could play your whole library. Could it play your whole library on a plane? No. Yeah, exactly. Uh, and then Wicked Pixelated says, \"Been a rough week personally. Just want to say thank God for video games and you guys have been kicking ass at all the coverage. Thank you so much, Wicked. Good luck with everything. I'm sure it'll turn out okay. And the TWA says, \"I hope you guys have seen the expanse game trailer from the weekend. Looks really cool. IMO bust is how you just dropped something in Games Daily.\" Yeah, I just put in just your coffee. I just put in the Games Daily uh slack and so we'll talk about it tomorrow. Talk about it tomorrow on Games Daily, everybody. But stay tuned because right after this, it's the kind of funny podcast. Get hyped. Love y'all. Goodbye.",
            "start": 4507.52
        }
    ]
}