{
    "id": 14263,
    "video_id": "wh7g3L3ZeZk",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Andy Cortez",
        "Mike Howard"
    ],
    "title": "Marathon Delayed! Bungie Doomed? - Kinda Funny Gamescast",
    "description": "Go to http://shadyrays.com and use code FUNNY to get 35% off polarized sunglasses.\n\n0:00:00 - Start\n00:02:00 - Housekeeping\n00:04:20 - Topic of the Show: Marathon Delayed! Bungie Doomed?\n00:15:30 - Maybe this isn’t bad news? \n00:29:59 - Is Marathon as far gone as Suicide Squad was at its delay?\n01:02:00 - Is Bungie Doomed?\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1750189510,
    "duration": 3955,
    "transcript_chunks": [
        {
            "text": "[Music] What's up everybody? Welcome to the kind of funny games cast for Tuesday, June 17th, 2025. I'm one of your hosts, Greg Miller, all along sard the master of hype snow bike. Mike, Greg, thanks for getting me off the desk and uh getting me over to this desk. We got some breaking news, ladies, gentlemen, NBS, we got to jump right on it. Of course, he's Forbes 30 under 30, aka the second best baby blues in San Francisco, aka Game Showdown season 3, second place at Tim Getty's, my Tim Host, and of course, he's rolling them shoulders. This is what it's like when you see Michael Jordan coming off the bench. You know, he's taking off the He's the Hispanic Arthur, Texas Latino. He clicking heads and ripping him to shreds. the globe trotting head shot and three-point shooting root tootin nitro rifle from twitch.tv TV. Andy Cortez, man. Alan Par's project just really rocking that song. Did he do that? It may have been the only song they wrote, I believe. Wow. I mean, why how do you do",
            "start": 0.84
        },
        {
            "text": "nitro rifle from twitch.tv TV. Andy Cortez, man. Alan Par's project just really rocking that song. Did he do that? It may have been the only song they wrote, I believe. Wow. I mean, why how do you do that? Like, there's no going up or down. It was a commission from Michael Jordan. It was that thing where after the Joker came out and they did the celebration bull song, right? And every was like, why are they using that? That song was done by a pedophile. I'm like, I don't know anything about Chicago Bulls music anymore and I will not engage in this discussion. I don't know what's happening. Don't take away that 90 that 90s run from me. You know what I mean? Monsters out there. Of course, like I said, there is breaking news about Bungie, about Marathon, that games really tiptoed in and we said, you know what? We make the rules here kind of funny. We can pivot. We can be nimble. Let's go for it. So, this is the kind of funny games cast each and every weekday on a variety of platforms. We",
            "start": 59.52
        },
        {
            "text": "you know what? We make the rules here kind of funny. We can pivot. We can be nimble. Let's go for it. So, this is the kind of funny games cast each and every weekday on a variety of platforms. We run you through the biggest topics in video games that we need to talk about. They could be reviews, previews, or breaking news. It'll always be covered here live on twitch.tv/confunnyames. TV/kindfunny games, youtube.com/kindfunname, and of course podcast services around the globe. If you love what we do at Kindfunn is an 11person small business all about live talk shows, make sure you pick up that kind of funny membership. youtube.com/kindfunname, patreon.com/kindfunn, Apple or Spotify. You give us $10 a month, we give you 80 episodes of content, ad free and four hours of exclusive podcasting each and every day in 15 to 20 minute chunks from me, Greg Miller, in a series we call Greg Way. Most importantly, you get the show with no ads, but no big deal if you got no money to toss our way. You",
            "start": 101.68
        },
        {
            "text": "and every day in 15 to 20 minute chunks from me, Greg Miller, in a series we call Greg Way. Most importantly, you get the show with no ads, but no big deal if you got no money to toss our way. You can get it for free. Twitch.tv/confunnyames, youtube.comfunnygames, Apple, Spotify, every other podcast service. If you're watching live like I see Matthew Red Hudson 8 lucid dream of course frolicious2595 I [ __ ] got it Andy. Okay and thank you to Metadandy for first time. I said I got it Andy with Prime. Go over to YouTube.com/kindfunny games and answer the super chat question. Is Bungie cooked? I want to know if you think they got gas in the tank. Do you care about Marathon? Is that game have a ch? Oh, we have a lot to cover and we will get all into it momentarily. Of course, like I said, you already got Games Daily, which was supposed to be a pretty easy episode about, hey, look at some of these Xbox things and the OS's and the handheld stuff. And then I was like, well, now hold on a",
            "start": 144.88
        },
        {
            "text": "you already got Games Daily, which was supposed to be a pretty easy episode about, hey, look at some of these Xbox things and the OS's and the handheld stuff. And then I was like, well, now hold on a second. They just put out a video saying they're partnering over here with AMD for nextG consoles. Wait, what does that mean? What? Okay, well, at least we got through that. All of a sudden, Marathon's delayed. Lot of stuff going on, and we couldn't do it without your support. Thank you. You can get that Games Daily, like I said, youtube.com/kindfunny games. uh uh podcast services. After the games cast, you're getting a sponsored Nvidia FBC fire break stream. That's what they wrote. Followed by Jack and Daxter with Barrett and Blessing. Uh if you're a kind of funny member, today's Greg Way is 20 plus minutes on why you shouldn't have a kid unless dot dot dot. You like that? I put the dot dot dot dot. And of course, later today is the kind of funny happy hour for our $25 and above",
            "start": 193.44
        },
        {
            "text": "Way is 20 plus minutes on why you shouldn't have a kid unless dot dot dot. You like that? I put the dot dot dot dot. And of course, later today is the kind of funny happy hour for our $25 and above supporters on patreon.com. Kind of funny. Of course, you get to call in, talk to us for a private podcast. It's great. I'm struggling. This is one of those days, dude. Hey, man. I ran off the hench, too. All right. I'm Bill Cartright, man in the middle over here. I love it. Uh, thank you to our Patreon producers, Carl Jacobs, Omega Buster, and Delaney Twining. Today, we're brought to you by Shady Rays, but we'll tell you about that later. For now, let's begin the show with whatever what is and forever will be the topic of the show. Dots. Timothy. Yes. Did you think you were going to get through Games Daily with just one breaking news segment? No. Is there more? No. Okay. Yeah. No, that was crazy. Yeah, that was that was a lot. And obviously this news, it was weird because I feel like we've",
            "start": 228.56
        },
        {
            "text": "Games Daily with just one breaking news segment? No. Is there more? No. Okay. Yeah. No, that was crazy. Yeah, that was that was a lot. And obviously this news, it was weird because I feel like we've talked about this sometime in the last week about marathon status and there was question of like did it already get delayed officially? Did it not? Like where are we at? Um it not being at the state of play, all that stuff. Right. So now, okay, cool. Officially getting delayed. Uh but all they're saying is it's delayed out of the September 23rd date they had. We don't know when it's coming out. So that is the the question of the hour for all of us to answer. And is this good news? Is this bad news? I have thoughts. You want to know my thoughts real quick? He's got thoughts. I know. I want to get through the update. Then I want I want to read the update because it is breaking news. Maybe people are seeing this for the first time. The update from bungee.net reads, \"Thank you not only for",
            "start": 270.88
        },
        {
            "text": "get through the update. Then I want I want to read the update because it is breaking news. Maybe people are seeing this for the first time. The update from bungee.net reads, \"Thank you not only for your passionate feedback around the marathon reveal and alpha play test, but also for your patience while we took the time to listen closely and chart our next steps.\" Uh through every comment and real-time conversation on social media and Discord, your voice has been strong and clear. We've taken this to heart and we know we need more time to craft Marathon into the game that truly reflects your passion. After much discussion within our dev team, we've made the decision to delay the September 23rd release. The alpha test created an opportunity for us to calibrate and focus the game on what will make it uniquely compelling. Survival under pressure, mystery and lore around every corner, raidlike endgame challenges, and Bungie's genredefining FPS combat. We are using this time to empower the",
            "start": 309.44
        },
        {
            "text": "make it uniquely compelling. Survival under pressure, mystery and lore around every corner, raidlike endgame challenges, and Bungie's genredefining FPS combat. We are using this time to empower the team to create the intense highstakes experience that a title like Marathon is built around. This means deepening the relationship between the developers and the game's most important voices, our players. Over the next few months, we'll continue close closed testing parentheses, including participants in the alpha to deploy game updates and test new features as they come online. You'll hear from us again later this fall when we can share the progress we've made alongside the game's new release date. Thank you again for your patience and much more importantly your passion. Your continued feedback will help us make marathon the incredible gaming experience we all know it can be. Andy Cortez. Hey Greg, you're the root and toot and three-point shooting headsh shot and son of a gun out there on",
            "start": 351.6
        },
        {
            "text": "will help us make marathon the incredible gaming experience we all know it can be. Andy Cortez. Hey Greg, you're the root and toot and three-point shooting headsh shot and son of a gun out there on Twitch. You've played the marathon alpha. Yeah. What did you think and then what do you read between the lines here? Um, it was clear that this thing is a ways off, especially, you know, after playing the Arc Raiders um, beta and seeing just how much more developed that was, seeing how much more content filled that felt. Yeah, I still found it fun, but I could absolutely see all of the drawbacks and negatives that the hardcore Extraction shooter fan felt when, you know, it it it's always caught in those it was always caught in a weird area of too casual for the hardcore fans. Yeah. And too hardcore of a genre for casual fans and trying to please everybody was going to please nobody, you know? Yeah. Uh I always thought that it was just a weird genre to be in anyway. This was, you know, it",
            "start": 395.52
        },
        {
            "text": "of a genre for casual fans and trying to please everybody was going to please nobody, you know? Yeah. Uh I always thought that it was just a weird genre to be in anyway. This was, you know, it was hard for me not to say every sentence. Now, this isn't the game that I would want them to make or this isn't Yeah, it sucks, right? It was always like the reality of, man, this would be this would be one of the coolest settings to exist in as a single player character who creates their own shell and get, you know, gets to discover and explore this world, but trapped in a multiplayer like experience where me and Mike and Nick had a really fun day with it the first day and then the next day me and Mike were like, \"Let's continue that fun.\" and we streamed it and legitimately died about seven times in a row in about like a 45 minute span and it was like whoa this is a a complete 180 to how we were feeling yesterday. Um I I'm not surprised by this especially after those leaks that were happening",
            "start": 446.88
        },
        {
            "text": "in a row in about like a 45 minute span and it was like whoa this is a a complete 180 to how we were feeling yesterday. Um I I'm not surprised by this especially after those leaks that were happening about the the marketing plans being cancelled for you know and not seeing at the state of play was also kind of damaging in the coal mine. Yeah. Um, yeah. It's it's it's it's a bummer. I don't I'm I'm worried like I'm worried about Bungie. Oh, yeah. We'll get into that because this isn't, you know, this isn't just something that you can tune and tweak. What people want is something that would take three, four years to to develop or whatever. And I just don't I don't know. I'm worried. Before we get too far into the weeds on Bungie, because I do want to bring in a number of different articles and I think Paul Tacassy has some salient points in his Michael. Yeah, Greg. I of course want to know what your thoughts on the alpha were if you were surprised by this information, but I also know so",
            "start": 496.96
        },
        {
            "text": "I think Paul Tacassy has some salient points in his Michael. Yeah, Greg. I of course want to know what your thoughts on the alpha were if you were surprised by this information, but I also know so many people are tuning in because of the news. What is Marathon? Marathon is an extraction shooter coming from the of course famous and well-known development team of Bungie. I think a lot of people know Bungie from the early Halo days and most importantly probably their MMO experience with Destiny. So they're looking at a really acclaimed developer name going okay what's that new next thing as Destiny 2 continues to be what Destiny 2 is while also starting to slowly end and maybe ramp up for something different later on. But this is their next big game and a lot of people were excited. Of course, marathon is also a title from way back in the day that people, the old heads will tell you, \"Oh, I remember this.\" The new kids will say, \"I don't know even what you're talking about.\" It's kind",
            "start": 548.56
        },
        {
            "text": "marathon is also a title from way back in the day that people, the old heads will tell you, \"Oh, I remember this.\" The new kids will say, \"I don't know even what you're talking about.\" It's kind of, it's a new title to a lot of us here. And they chose an extraction shooter, which is a small kind of um interesting genre within the first person shooter genre. So, for me, I came out of it actually really enjoying Marathon on day one. Similar to what Andy said, it was more up my alley with more clashing and team engagements that felt similar to a battle royale style of intensity and gameplay cycles, but it was lacking in the extraction shooter momentto- moment gameplay, which is what we saw when they took a big right jab, I think, from Mark Raiders, right? Both of these games had betas and alphas within the two same weeks, and you could see the momentum from the idea of Bungie coming out with a new game. Oh, it's an extraction shooter. Let's try this to Oh, I'd much rather play this Arc",
            "start": 592.16
        },
        {
            "text": "within the two same weeks, and you could see the momentum from the idea of Bungie coming out with a new game. Oh, it's an extraction shooter. Let's try this to Oh, I'd much rather play this Arc Raiders game. This game isn't good. It's kind of like, you know, when Woody and Buzz met each other and Andy dropped poor Woody over there. That's how this went. Uh, and so, yeah, I think the writing was on the wall. You could tell the audience feedback to Bungie, of course, the stolen assets and the reused uh arts as Andy and I covered in Games Daily. That was just a lot of like this isn't quite right. this isn't setting up well for a hey here's the date okay we'll see you in September it felt like hey we need to hit the brakes on this fast so for me I think this is the right call uh now you start to play the game Greg right at the end we have Arc Raiders on October 30th no let me double check that Arc Raiders comes out October 30th we have GTA in May the world shuts down in May gaming wise so",
            "start": 638.88
        },
        {
            "text": "to play the game Greg right at the end we have Arc Raiders on October 30th no let me double check that Arc Raiders comes out October 30th we have GTA in May the world shuts down in May gaming wise so you have a tight window here to say where do we call our shot Do we hit this or do we wait past May and get away from Grand Theft Auto? And so really going to come down to Sony and Bungie. How much money do you have? How much can we put into this? How much can we wait? Cuz for me, I think at this point you're waiting past May, Greg. And I know that's a crazy thing to say, but like you are getting out of the way of art creators at the end of October, which is clearly already eaten your lunch. And I am not trying to position myself and hey let's drop on February and have a month to two months of excitement and then just dive bomb die because of Grand Theft Auto. It's wild to think that the game was already struggling. The game was already not in the best place. Um, especially with the beta",
            "start": 686.56
        },
        {
            "text": "excitement and then just dive bomb die because of Grand Theft Auto. It's wild to think that the game was already struggling. The game was already not in the best place. Um, especially with the beta kind of being really really botched in in in a weird way where invites people weren't being invited and you're looking at even though you could play this beta on multiple consoles, concurrent Steam numbers were hitting triple digits and it's like, hey, we can let more people in. There's a lot of people waiting to get into this like allow this to happen, right? And momentum was already not on their side and then the stolen art happened and it's like holy [ __ ] like that. You couldn't have asked for a worse thing to happen to a game that already felt floundering and already felt like it was missing its identity and purpose. Let me bring in an article because we keep mentioning the stolen art. I was going to get to a little bit later, but I want to bring that up so you have a a clear picture",
            "start": 736.8
        },
        {
            "text": "its identity and purpose. Let me bring in an article because we keep mentioning the stolen art. I was going to get to a little bit later, but I want to bring that up so you have a a clear picture if you're not up on that news. All right, we're going to go to Games Radar Plus where Conser wrote, \"Morale at Bungie reportedly at an all-time low as the iconic FPS dev investigates stolen assets in Marathon. Quote, the vibes have never been worse.\" end quote. Morale at Bungie, the iconic first-person studio behind Destiny and the original Halo games, is reportedly at an all-time low with some employees unsure about whether their upcoming marathon reboot can meet its September release date. Obviously dated now. In case uh the scandal hasn't reached you yet, earlier this week, futuristic indie artist Fern Anti-real Hook accused the studio of using her 2017 art portfolio as inspiration, parenthesis, to put it mildly, for marathon without permission or payment. She also posted side-by-side",
            "start": 783.04
        },
        {
            "text": "artist Fern Anti-real Hook accused the studio of using her 2017 art portfolio as inspiration, parenthesis, to put it mildly, for marathon without permission or payment. She also posted side-by-side screenshots of her own artwork next to Marathon's alpha test with very similar iconography, patterns, fonts, and sometimes even words appearing in both. Bungie later admitted that a former artist at the studio had mistakenly quote included these in a texture sheet that was ultimately used in game end quote and said it was currently investigating a concern regarding unauthorized used of artists details unauthorized use of artist decals. A new Forbes report citing comments from former and current Bungie staff now gives some insight into what's happening inside the studio. Morale is said to be in a freefall, quote unquote, and the vibes have never been worse. Higher-ups haven't said anything about a delay potentially hitting Marathon, but many are uncertain about if the shooter can turn around",
            "start": 823.04
        },
        {
            "text": "freefall, quote unquote, and the vibes have never been worse. Higher-ups haven't said anything about a delay potentially hitting Marathon, but many are uncertain about if the shooter can turn around its controversial perception in time for launch just a few months away. Game direct director Joe Ziggler even said the studio was quote still scrubbing out our assets uh to make sure all were being respectful to the situation. Uh which obviously sounds like a pretty hefty undertaking. For now, Bungie's legal team and parent company Sony are purportedly also investigating the situation. Though the fact the studio neglected to show gameplay footage in this week's live stream, of course, State of Play discussing the alpha maybe says enough. No, the state of the the live stream they were talking about was the they they had like their own and so that day was a very like oh man we got the elephant in the room is whole all of our [ __ ] was stolen and every comment in the Twitch chat was art",
            "start": 868.56
        },
        {
            "text": "about was the they they had like their own and so that day was a very like oh man we got the elephant in the room is whole all of our [ __ ] was stolen and every comment in the Twitch chat was art raiders and it was just like bad vibes all around. So, I want to go to Tim, but I want to piggyback off something you said, Andy, that so many people, this isn't the game they wanted. It needs to be from people would love a ground up. Guitar Hero Arrow super chated just like you can on youtube.com/kindfunny games and says, \"Keeping extraction focus is only delaying the same outcome.\" IMO needs a groundup refresh with the verse multiplayer suite and ideally a nostalgic solo campaign. Tim, I think this comes back to you where you were at the top of the show where you wanted to go a bit big picture with the Tim Gettys take. Yeah, give it to me. I mean, it's it's tough. There's a lot of layers to it. I think that uh the starting place is I don't think that today's news is bad news. I don't know",
            "start": 908.96
        },
        {
            "text": "with the Tim Gettys take. Yeah, give it to me. I mean, it's it's tough. There's a lot of layers to it. I think that uh the starting place is I don't think that today's news is bad news. I don't know that it's good news, but I don't think it's bad. I think this is the best possible thing they can do, which is not release on September 23rd. That is way too soon. It feels like they're not going to have anything answered that we need them to at this point by then. Uh but the question then becomes, what is the answer? What is the way to change the fact that this is now the third time that we've had a headline on one of our shows that implies Bungie's [ __ ] up and that we don't know if they can fix it. In the same type of way, we talk about Ubisoft and talk about some of these companies that are clearly like making decisions that aren't vibing with the general gaming audience or the gaming audience of people like us that talk about the business of games. And I think from that perspective,",
            "start": 954.0
        },
        {
            "text": "clearly like making decisions that aren't vibing with the general gaming audience or the gaming audience of people like us that talk about the business of games. And I think from that perspective, when you're looking at this game, Mike said it so well of what Marathon is and what it is going to need to be to a new generation of people. And all right, cool. PlayStation had Hell Divers last year. They had this mega win uh on this side of gaming to an extent. They also had Concord, which we understand was maybe the biggest failure in video game history. Like that is going to be something that we talk about forever and to this day is unbelievable to me. I can't believe they actually pulled that game as quickly as they did. So, to look here, it's like, how do you solve this? Because we all sat and we looked at uh Suicide Squad and we looked at Concord and going into it, we're all like, I don't know. I don't know. And it's not just a gut feeling. It's like, I don't know because XYZ. And",
            "start": 993.28
        },
        {
            "text": "sat and we looked at uh Suicide Squad and we looked at Concord and going into it, we're all like, I don't know. I don't know. And it's not just a gut feeling. It's like, I don't know because XYZ. And here we are now saying I don't know. And we have reasons why. And unfortunately, it's an entire alphabet from A to Z with this one. And um I I look at it and Andy's uh saying that he thinks that giving this game more time, giving it the more modes and all of that. Mike was backing this up too, like there's something here and I believe that. I totally do. I think that yes, like kind of restart this game, there is potential for marathon, a Bungie marathon that is not just on PlayStation 5, but it's also on PC and also on Xbox and it is crossplay that can succeed for sure. But at this point, I don't think that's the move. I don't think that that's possible. is the answer. Figuring out a new strategy financially, it's free to play. They come up with microtransactions somehow. They they try",
            "start": 1037.12
        },
        {
            "text": "don't think that's the move. I don't think that that's possible. is the answer. Figuring out a new strategy financially, it's free to play. They come up with microtransactions somehow. They they try their best to just make money from what they have because this is what they have. The reality is they're probably going to have to go through legal battles with the the artist and whether legal battles just means here's some hush money. Like they're actively going to lose even more money for this. Who knows what that looks like in the grand scheme of things, but that's all just bad vibes, bad news. And I think it just combines to a place of is Bungie doomed. Doomed to be fully put under PlayStation and not have any autonomy? Yes. Doomed as a company? I'm not so sure about that. Is Marathon doomed? Absolutely. I I think that they need to come up with uh with with some way to save this. And it's looking very doubtful in my opinion. I think yeah, I you know, I have so much more to dive into",
            "start": 1083.6
        },
        {
            "text": "Absolutely. I I think that they need to come up with uh with with some way to save this. And it's looking very doubtful in my opinion. I think yeah, I you know, I have so much more to dive into and go into this, but I think this is exact. I mean, this is what's happening with Fair Games and Haven Studios, I believe. Except they just didn't. They were they're further down their timeline on when they were supposed to announce and show more stuff. I think you're seeing right here. PlayStation does not want another Concord, period. I think they're going to end up killing this in the crib as well. And I think exactly what you're saying, Tim. It's going to be cool. We're killing Marathon and Bungie's being absorbed into PlayStation Studios and going to, you know, whoever's still there, whatever's still going on. What there's going to be layoffs, I'm sure. all these other things that there's layoffs when things are going well, right? Yeah. Yeah. Exactly. Exactly. Like when when Destiny 2:",
            "start": 1125.44
        },
        {
            "text": "still going on. What there's going to be layoffs, I'm sure. all these other things that there's layoffs when things are going well, right? Yeah. Yeah. Exactly. Exactly. Like when when Destiny 2: The Final Shape comes out and it's great review and then like it it's insane that that's how we just kind of expect that and things will likely just get worse. Yeah. In the super chats, uh, Sadistic Serif says, \"Uh, if they release this game, Bungie will get closed.\" Uh, Killian C says, \"I don't have confidence in Bungie existing in its current state. They'll become a PlayStation Studios company. I could honestly see marathon getting cancelled. Uh, interesting. Of course, there's still so much happening while we're live. Paul Tassy has tweeted after he put up the news. Most of Bungie found out about the marathon delay right now, indicating that this tweet is actually what because he quote tweeted the initial tweet uh indicating that that's what's going on and how Bungie as a studio is being",
            "start": 1165.52
        },
        {
            "text": "the marathon delay right now, indicating that this tweet is actually what because he quote tweeted the initial tweet uh indicating that that's what's going on and how Bungie as a studio is being informed that your game is officially uh delayed. Uh, I have a section here that this is all on the heels of four [ __ ] days ago. But we go to Paul Tassy at Forbes. Sony touts strong Marathon engagement confirms release window. The future of Marathon over the last month or so feels rather unsteady, but in a new SIE presentation, Sony is reinforcing that it's an important game in its lineup and projecting confidence. Sony's Herman Holse took some time during his overview of PlayStation's offerings to single Marathon out as quote an innovative and bold take on the extraction shooter genre. End quote. This was joined by a slide that under the banner fiscal or I'm sorry, yeah, fiscal year 25 focus uh which said that there is quote strong early engagement for Bungie's bold new innovative Bungie's",
            "start": 1205.2
        },
        {
            "text": "This was joined by a slide that under the banner fiscal or I'm sorry, yeah, fiscal year 25 focus uh which said that there is quote strong early engagement for Bungie's bold new innovative Bungie's bold and innovative new title. End quote. For starters, we're back to Paul of course. At least the presentation reinforces a window of marathon fiscal year 2025 in a time that most players believe it will be delayed out of its current September 23 25 release date. Fiscal year 25 ends March 2026. So it would not be something huge like a year delay. Even 6 months is pushing it. So if there is one, it would not be all that long. And you would wonder uh what might be able to be changed or fixed in that time. This leads to the next aspect of this. This supposed quote strong engagement end quote. Sure, there's been strong engagement, but that consists of a lot of negativity about the game's reveal. Then an overwhelming sense that the closed alpha was underwhelming, then an industry-wide scandal",
            "start": 1248.64
        },
        {
            "text": "there's been strong engagement, but that consists of a lot of negativity about the game's reveal. Then an overwhelming sense that the closed alpha was underwhelming, then an industry-wide scandal where it all revealed where it was revealed that plagiarized art had made it through the game's pipeline over a number of years and had ended up in the game itself. So yes, there was quote unquote engagement. Either Sony is completely divorced from the online conversation surrounding Marathon or they see where things are headed and feel forced to project strength regardless. Saying nothing about Marathon or waffling on it here would do nothing to help them or the game. So of course, yes, you say you believe in the game, even if you're dancing around what's actually happening by bragging about engagement. But internally, even Bungie is extremely concerned about where things are and where things are going from here. The chart of Sony's live service prospects is bleak. There's no real getting",
            "start": 1295.68
        },
        {
            "text": "But internally, even Bungie is extremely concerned about where things are and where things are going from here. The chart of Sony's live service prospects is bleak. There's no real getting around that. It considers its external base, I'm sorry, eternal baseball game, the show, a live service. Destiny 2 has been bleeding players and is now entering a very risky new era that seems unlikely to return the game to its glory days. Marathon is the is on the edge of oblivion at this point. It's hilarious they're even saying Fair Games is actually still coming out. The unequivocal bright spot here is Hell Divers 2, which has been true since it launched, but its developer, Arrowhead, will not be working with Sony for its next game. Over the course of the past two months, I've arrived at the conclusion that Marathon is just not going to work. The vibes are awful. The problems with the game are mostly etched in stone, and now we have an art theft scandal. On top of that, I do expect the delay to",
            "start": 1334.88
        },
        {
            "text": "that Marathon is just not going to work. The vibes are awful. The problems with the game are mostly etched in stone, and now we have an art theft scandal. On top of that, I do expect the delay to be announced, but it won't be lengthy. And I do not believe this is going to release to be a release that both Sony and Bungie need whatever they're saying in their slideshow. I echo all of that, right? And again, I come back to the idea of like, will they actually release this? I think you ate so much [ __ ] with Concord. Where? Like it was out what, two weeks? When do you pull up stakes here and go, \"All right, the art thing and this thing and that thing and it's just this isn't worth it again.\" Mike, let me tell you what you do. Let me tell you about it. You release in March and guess what? GTA releases in May. We just go out with a whimper. The gamers will forget about it. They will move on from your game and we can just slowly kill that by the end of summer into the next year. I think if",
            "start": 1376.56
        },
        {
            "text": "releases in May. We just go out with a whimper. The gamers will forget about it. They will move on from your game and we can just slowly kill that by the end of summer into the next year. I think if you have to release this, that's the play that they will do. They will look at February or March. They will drop this. Me and Andy have played hundreds of these multiplayer games that come onto Steam. They are there for about two weeks to a month and then you never talk about them in 6 months from now. And so a Bungie title of course is much bigger than that. But if you wanted to do this like quietly without doing the Concord path of we're killing this in front of the public and everybody, you put this out in March, you let that ride for two months, the players will slowly get quiet and then boom, GTA will come over. Nobody will speak about this game again and it will be like as if nothing ever happens. So that all happens then what happens to Bungie? Bungie has one goal. They should have",
            "start": 1419.36
        },
        {
            "text": "GTA will come over. Nobody will speak about this game again and it will be like as if nothing ever happens. So that all happens then what happens to Bungie? Bungie has one goal. They should have stuck with the TLC routes. Don't go chasing waterfalls. Stick to the lakes and the rivers that you used to. I've said this many of times, okay? Well said. Well said. Destiny, no one's acknowledging that was great. A lot of people, a lot of people come after me and Paul Tassy says it well. It's like Destiny 2 has had its time in the sun and is slowly ramping down. You can be a hardcore Destiny fan and say, \"Mike, it's still great. There's still content being made, but it will never be what it was, right? We are at the trail end of Destiny. It is time for that studio to focus up and just make a Destiny 3.\" And unfortunately, that's where they're at. Destiny is a mega hit. It's an awesome MMO that people love. It's a name and a brand that people will flock to. Your studio now becomes the Destiny",
            "start": 1460.08
        },
        {
            "text": "3.\" And unfortunately, that's where they're at. Destiny is a mega hit. It's an awesome MMO that people love. It's a name and a brand that people will flock to. Your studio now becomes the Destiny studio for the next 10 years. You are focused on Destiny. The people the Destiny that exists or Destiny 3, you will make Destiny 3. You will start to slowly make a little more Destiny 2 content into Destiny 3. That's how it should have gone. That's how it was supposed to be. And so now, similar to Halo Studios, you will look at that staff and say, you either love and breathe Destiny or you're going to find a new place to go work, but there are hundreds of people that will come and say, \"I want to be part of Destiny. I want to make Destiny awesome for the future.\" And that's what they should have been doing from this time. But we've talked about it many of times. A lot of CEOs, a lot of execs saw the trend of battle royale, saw Fortnite, and said, \"There's money. We want more of that. Let's",
            "start": 1502.0
        },
        {
            "text": "been doing from this time. But we've talked about it many of times. A lot of CEOs, a lot of execs saw the trend of battle royale, saw Fortnite, and said, \"There's money. We want more of that. Let's start chasing trends.\" And then there was this big rise up of people going battle royale this, battle royale that. I don't want battle royals anymore. There's too many. And now people are saying, well, what else could we give them? Oh, extraction shooters. And now all of a sudden, we've seen everybody in their mother say, \"We want to make an extraction shooter without probably knowing the extraction shooter audience is tiny.\" And the idea of you making the one main mainstay extraction shooter game is going to be like finding a needle in a hay stack. Good luck with that. And they all chased this and they said Sony probably told Bungie or Bungie said that and it was like you should have just stuck to where you should have been and that was making Destiny content and getting into Destiny 3. I",
            "start": 1544.88
        },
        {
            "text": "and they said Sony probably told Bungie or Bungie said that and it was like you should have just stuck to where you should have been and that was making Destiny content and getting into Destiny 3. I love the idea of Destiny being so big or getting off the purchase being able to make a second project, try something different, but the extraction shooter wasn't it and we all know that 100%. Yeah. A lot of it is execs kind of seeing, you know, the the battle or the battle royale genre. We're not going to be able to penetrate this genre, but we see a lot of opportunity here and we see a lot of opportunity here and Extraction Shooter happens to be well Tarov is killing it. We can be the like we saw a lot of people in the chat and a lot of people in comments saying, well, they can be the Fortnite of an extraction. That's just that that's not a thing, man. Like it can't bet on that. Yeah. Yeah. It really isn't. And the issue is as well as we talk about what can be marathon. What can you",
            "start": 1585.76
        },
        {
            "text": "of an extraction. That's just that that's not a thing, man. Like it can't bet on that. Yeah. Yeah. It really isn't. And the issue is as well as we talk about what can be marathon. What can you change that to? Right. We have so little time if we're going to hit that by March. You can't just change the foundation of this game. It will always kind of be built on this extraction shooter. So, we're not getting a solo campaign out of this. We are not getting different game modes. And already you can't go to a team arena shooter because we already have a thousand of those, right? this hasn't broken out to be, oh, it's incredible. And so, my issue is is this is a game that you can't really change from a type A game all the way to a type C game out of nowhere in 6 months. And so, that's why you probably you should drop this in February. We all play it for a month. People who love it will ride with it. The people who complain about it, guess what? In May, GTA will come. We'll never speak of",
            "start": 1632.96
        },
        {
            "text": "probably you should drop this in February. We all play it for a month. People who love it will ride with it. The people who complain about it, guess what? In May, GTA will come. We'll never speak of this game again. We'll forget about it. I want to talk about this in comparison to Suicide Squad. But first, I need to remind you that we are kind of funny each and every day. We're doing a bunch of live talk shows for your viewing pleasure on twitch.tv/kindfunnygames and youtube.com/kindfunnames. Later on podcast services around the globe. No matter where you get the show, we'd really appreciate it if you consider picking up a kind of funny membership. Of course, $10 a month supports our 11 person independent team. It gets you all of our shows. That's more than 80 shows uh a month ad free. And of course, you get a daily dose of me and a 15 to 20 minute podcast we call Gregway. But right now, you're not using your benefits. So, here's a word from our sponsors. This episode's brought to you",
            "start": 1676.08
        },
        {
            "text": "of course, you get a daily dose of me and a 15 to 20 minute podcast we call Gregway. But right now, you're not using your benefits. So, here's a word from our sponsors. This episode's brought to you by Shady Rays. Get ready for the season ahead with quality shades built to last. Our friends at Shady Rays have you covered with premium polarized shades that won't break the bank. Shady Rays is an independent sunglasses company offering a world-class product rated five stars by over 300,000 people. They have hundreds of options to choose from, so you're bound to find the perfect pair to match your style. If you don't love your shades, exchange them for a new pair or simply return worry-f free within 30 days. There's no risk when you shop. Their team are always there to have your back with personal and fast support. Y'all know I've been outside a lot playing Pokémon Go, and it's such a great experience wearing Shady Rays when I'm out and about looking dope. Exclusively for you, Shady Rays",
            "start": 1716.88
        },
        {
            "text": "and fast support. Y'all know I've been outside a lot playing Pokémon Go, and it's such a great experience wearing Shady Rays when I'm out and about looking dope. Exclusively for you, Shady Rays is giving out their best deal. Head to shady.com and use code funny for 35% off polarized sunglasses. Try for yourself the shades rated five stars by over 300,000 people. Again, go to shadyrays.com, use code funny to get 35% off polarized sunglasses. We're back. Um, obviously we've talked a lot about people playing the alpha, having this feedback. It's too far gone. You can't change it. This reminds me of Suicide Squad when Suicide Squad had that PlayStation showcase or, you know, State of Play and we were all like, \"Yeah, yeah, yeah.\" And we all watched like, \"Oh [ __ ] this doesn't look good at all.\" And that was universally the feedback. Then they were like, \"We're delaying.\" And it was like, \"Well, why? What are you going to do? You really can't change.\" Like, \"This is done. The game's",
            "start": 1761.2
        },
        {
            "text": "at all.\" And that was universally the feedback. Then they were like, \"We're delaying.\" And it was like, \"Well, why? What are you going to do? You really can't change.\" Like, \"This is done. The game's done. This is what it is what it's going to be.\" Right, Andy? For somebody who played both of those games, is Marathon as far gone as Suicide Squad was, or is it just the wrong genre, wrong time? Um, well, I mean, I I think that they're both in similar spots where it's, hey, the the company that we love is making a thing that I don't want to be a part of. Like, it's it it'd be similar to, holy [ __ ] the new Rockstar game is coming out. Let's see this big reveal. It's a cozy life sim. I mean, that could be cool, but like that's not what I want from Rockstar, you know? So, uh, they're they're in very similar situations, and I don't know if they have the the name or the power to push past those those blocks, you know? I just don't think that they have that. Interesting. Mike, do you agree?",
            "start": 1807.04
        },
        {
            "text": "in very similar situations, and I don't know if they have the the name or the power to push past those those blocks, you know? I just don't think that they have that. Interesting. Mike, do you agree? Yeah, I agree with that. I think just on the flip side, I think this one speaks a little bit more to the I mean, it's a different audience, right? Like this one, I want to say speaks to more of the casual audience just cuz the Fortnite is just running around. Like first person shooters are so hot. So I think more people will jump onto this and give it a little more love and time than they did Suicide Squad. But it will be the exact same thing as a Suicide Squad of this releases. It will get a month of coverage. They will get a month of people buying it, people refunding it, people jumping in and out of it, and it's just going to kind of come and go. So I Yeah, it's in the exact same spot. This one I just feel like I guess maybe I live and breathe first-person shooters a lot more that",
            "start": 1856.56
        },
        {
            "text": "in and out of it, and it's just going to kind of come and go. So I Yeah, it's in the exact same spot. This one I just feel like I guess maybe I live and breathe first-person shooters a lot more that there are there's a higher chance of people playing this for a weekend and then never playing it again as opposed to Suicide Squad. That very much felt like h no, you know, correct me if I'm wrong. This is just a fact. $39.99 on Marathon is what they were saying saying they were charging. They haven't they haven't announced the price. It's a premium. It will it will not be full price, but they haven't announced the price. That's where we're at right now. Yeah. Yeah. It's, you know, you guys talking about Suicide Squad, I think is a obviously very apt conversation in terms of, hey, there's this beloved studio. They're doing something that we are not interested in. The other uh thing to talk about is, you know, Concord where it came out and that's a different situation that there was it's",
            "start": 1898.96
        },
        {
            "text": "beloved studio. They're doing something that we are not interested in. The other uh thing to talk about is, you know, Concord where it came out and that's a different situation that there was it's kind of an unknown quantity with that team and it was more just like that was our first taste of what that could be and all of us still looked at that like I just don't know about this. And one of the bigger conversations around Concord and it failing was the I think very poor way they rolled out marketing for that game and in addition to the state of play and them overhyping weird things that we just knew we couldn't believe in like the weekly story bits and all that stuff. Do that. Yeah. Yeah. It raises more questions and more like I don't believe you vibes than anything else. But in addition to that, we all said uh they should have had a preview event. We look at Apex Legend, a game that didn't exist to the public, and then all of a sudden the first time it's being talked about, it's, yo,",
            "start": 1937.76
        },
        {
            "text": "that, we all said uh they should have had a preview event. We look at Apex Legend, a game that didn't exist to the public, and then all of a sudden the first time it's being talked about, it's, yo, we played it. It's awesome. I know you might think we don't need another battle royale. This one's freaking good. And that energy got people like, you know what, a free to play. I'm interested in this. Let's give it a shot. And then Apex for years did great, right? I feel like Concord didn't do that. And Marathon, they did the beta, but it didn't work. And I think that is almost the worst case scenario where it's like, \"All right, cool.\" So now it's been in the community's hands. It's not even just games media. It is like games media and community. And the the walk away is eh, it was okay. Some people liked it, some people didn't. Some people's favorite thing was the art design and the art design was stolen that there's just a lot of elements there. I do think that the plagiarism and the",
            "start": 1980.0
        },
        {
            "text": "people liked it, some people didn't. Some people's favorite thing was the art design and the art design was stolen that there's just a lot of elements there. I do think that the plagiarism and the the art stuff, like I don't think that's the reason for the delay. I I I I think that people have been talking about like maybe it's like oh they're taking time to like it. No, I don't think so. I think that that is such a non-factor to them. They're going to deal with it however they need to of like the exact things that are legit stolen. They'll get taken away. The more oh it's like their designs and like like their their style that's you know I think people are going to money will be exchanged. Uh and I think that'll be taken care of but I don't think that has anything to do with to go back to your Apex example in in this alpha and conquer all jazz. I think that's the big thing when Apex showed up and caught everybody off guard and had the stuff. Marathon showed up and does not have the",
            "start": 2024.08
        },
        {
            "text": "to your Apex example in in this alpha and conquer all jazz. I think that's the big thing when Apex showed up and caught everybody off guard and had the stuff. Marathon showed up and does not have the stuff. For me, it was when you guys did the Marathon alpha, then you played Arc Raiders or vice versa. And then it was you guys are like, \"All right, let's play more Marathon.\" Nick was like, \"But I really want to play more Arc Raider.\" You know what I mean? Like you went toe-to-toe with somebody and got clowned out of like, \"Oh, this is the better thing.\" And in a world we're constantly talking about how little time everybody has, how little money everybody has, like if you're going to come up and show up and can't beat your first competitor. And add on to that, I think uh another thing we have to bring up is Concord Hero Shooter coming out. PlayStation console exclusive. And then guess what's coming out at the same time, Andy? Marvel Rivals. Here's this game that you can play anywhere",
            "start": 2060.64
        },
        {
            "text": "have to bring up is Concord Hero Shooter coming out. PlayStation console exclusive. And then guess what's coming out at the same time, Andy? Marvel Rivals. Here's this game that you can play anywhere that is free to play that is Marvel IP. You hear all this stuff and not all of you hear the Marvel part and that might be the most questionable thing. Well, turns out when you put the passion and care into it, it can work and it's to this day working for them. But that was just another thing against oh [ __ ] man. Players played that game and we're like, this is awesome. We all saw that trailer. This is one of the rare kind of funny moments that we got to see a trailer for a game that we knew nothing about before everybody. And we see this trailer and all of us were like, \"Huh, that looks\" When Net Ease popped up, we're all like mobile game. And then by the end of it, we're like, \"Wait a minute, this could have the stuff.\" And then people played it, it had the stuff. Like that's you need",
            "start": 2099.6
        },
        {
            "text": "Net Ease popped up, we're all like mobile game. And then by the end of it, we're like, \"Wait a minute, this could have the stuff.\" And then people played it, it had the stuff. Like that's you need that story. And for Marathon to not only have not that story, but the story that it has, that I think is a place you can't come back from. So I want to ask you guys, gameplay, let's say that they they tweaked things here and there to make it a little bit better for more people getting in and you're not getting clowned out and like it you're you're feeling good about playing it because you liked the gameplay, right, Andy? Oh, I mean, it's a bungee shooter. It feels good. But the the it's the whole genre itself, right? Like you could make a a horror gore movie a bit funnier, but it's still a horror gore movie that like if that's not your jazz, you're not going to be into that. Um, and I don't think that there's any tweaks you can do here. This isn't a this isn't a multiplayer game with",
            "start": 2140.8
        },
        {
            "text": "a horror gore movie that like if that's not your jazz, you're not going to be into that. Um, and I don't think that there's any tweaks you can do here. This isn't a this isn't a multiplayer game with balancing issues. Yeah. Where you push some numbers up this way and make that tank stronger or whatever. For me, it's like the what you have here is the Destiny and Bungie fan base that are going to be sort of the main people that are going to be excited about the next Destiny Bungie or or Bungie pro uh project. And so much about Destiny is player agency. It's that's my guardian. That I I that that's my dude. I customize him the way I want. I have my shaders the way I'm using that armor instead of this one because I love the way that one looks and it re it's so much about that representation. That's my dude. And to come out with an extraction shooter that is not the genre you necessarily want, but maybe I can customize my guy. Oh, it's just like I'm playing as it's a hero extraction",
            "start": 2187.84
        },
        {
            "text": "That's my dude. And to come out with an extraction shooter that is not the genre you necessarily want, but maybe I can customize my guy. Oh, it's just like I'm playing as it's a hero extraction shooter, which is even worse of a thing that you would want because you're you're pushing away your fan base even more because if I want to play a character class with those abilities, I have to be that character. I don't want to be that character. And in the trailer that or in that 8-minute sort of short that was done by the Love, Death, and Robots director, um, we're seeing, you know, this this shell, uh, this like sentient like being or whatever customizing themselves with a and obviously the game would have skins, the game would have things like that, but it's like you are having to play as Glitch, that girl with the spiky hair, or as that guy who's always got the hood on or whatever. It's like you're taking away that player agency, which is another thing that your audience was probably",
            "start": 2234.56
        },
        {
            "text": "Glitch, that girl with the spiky hair, or as that guy who's always got the hood on or whatever. It's like you're taking away that player agency, which is another thing that your audience was probably going to want in a game like this. I I just think the as on top of that, Andy, the audience just doesn't want the PVP nature of this. We see so much of the casual audience now moving away of like I just want a PvE experience. I think that is why Hell Divers did so well is you take the stress of Mike and his goons are going to come after you every waking moment and it's going to make a bad experience. Now you have the chill of like I'm relaxed. And Destiny is built off of that of like I choose when to go into PvP. I don't have to be in this at all times. And when you play an extraction shooter, you make this kind of game. It is you are on your toes at all times and you're going to have a bad time if we come after you and we choose to. And that's what this game mode is going to be. Every",
            "start": 2282.64
        },
        {
            "text": "you make this kind of game. It is you are on your toes at all times and you're going to have a bad time if we come after you and we choose to. And that's what this game mode is going to be. Every time we see you, we will attack you. And for other people, it's like, oh man, I want to just jump into this. I'm a casual. Greg Miller, I've never played an extraction shooter. his first 20 experiences should never see another player because if he does, he's going to get run over to the point where it's like, well, he didn't extract any items. He didn't learn about the game mechanics. He has no idea what's happening. Boom. The PVE PVP genre is like you're making that bubble and you're taking it even smaller. And I think for an audience like Sony in particular, Bungie with what they've built off of Destiny, they're not looking for a diehard PVP experience right now. So, so with that, right, we we need community for this game. We talk about all the time with fighting games that are starting to",
            "start": 2327.84
        },
        {
            "text": "Destiny, they're not looking for a diehard PVP experience right now. So, so with that, right, we we need community for this game. We talk about all the time with fighting games that are starting to thrive in a whole new way like we've never seen because they're being supported by the developers in in various forms, whether it's releases like quality releases, updates to those releases, fighting game tournaments and community opportunities, like crossplatform play for a lot of these things like a lot of efforts being put into that. when we start talking about these subg genres and subg genres of subg genres and ven diagrams of everything of shooting games and the multiplayer modern experience like do you think that this being crossplatform is there a way that they can change the paid $40 whatever this ends up being and just make it free to play that makes this work well enough is that even possible a lot of these games in this genre are not free to play so a lot of them are on the",
            "start": 2369.12
        },
        {
            "text": "whatever this ends up being and just make it free to play that makes this work well enough is that even possible a lot of these games in this genre are not free to play so a lot of them are on the budget titles but still premium settling at that $30 to $40 range. So, it's like you're in the market. That is where everybody is. Being free to play, I don't think tips the scales anymore in this simply because you now know what you're getting into. Yes, you might try it and maybe they'll get a million more players when they can. You know, my favorite Game Pass. Hey, we got 30 million here. It's like, okay, well, a lot of people just click that to try it for a weekend. That's what you'll see there. They'll promote two million people played it, but really only a million really want to stick in this. And so I don't think going free to play will change the route of what this is going to be. In the same way that it wouldn't have helped Concord. Yeah. That that we we we knew what Concord was. I",
            "start": 2409.76
        },
        {
            "text": "And so I don't think going free to play will change the route of what this is going to be. In the same way that it wouldn't have helped Concord. Yeah. That that we we we knew what Concord was. I still think it was a very good game that just came out around a time that everything is better and people are invested much more in those ecosystems. And free to play will not a hell of Concord and I don't I don't think freeto play will drastically change this as well either because it's like the recipe is still what it is. God, they're so [ __ ] It is. And what can I inject one super chat to this conversation because it's right where we're at. It's piggybacking off of something Tim said, right? This is Street Shadow who super chatted said, Tim, I will say the alpha did work because they're delaying the game based on the feedback. Alphas are not only for hyping the game. Alpha proved the game needed more time. Concord didn't do that. Here's what I would disagree with on this is that to what",
            "start": 2450.96
        },
        {
            "text": "the game based on the feedback. Alphas are not only for hyping the game. Alpha proved the game needed more time. Concord didn't do that. Here's what I would disagree with on this is that to what we're talking about. When and I really believe it's an if you ever see Marathon again, it's not going to be radically changed. It's still going to be an extraction shooter. And that's that that's the core problem we're talking about is that it's a a a genre people don't necessarily want or that they're going to make an impact in. This strikes me as the Suicide Squad state of play where it's like we put it out there and oh [ __ ] you're all giving us feedback we knew internally or maybe you I mean Bungie must have known PlayStation was put like this does feel very in the way like oh get into the beta that's two weeks before launch well that's [ __ ] that's not a beta that's a demo right this feels very similar to a degree of like that's you stress testing servers let's put out we're putting out",
            "start": 2491.68
        },
        {
            "text": "that's two weeks before launch well that's [ __ ] that's not a beta that's a demo right this feels very similar to a degree of like that's you stress testing servers let's put out we're putting out the date and we're putting out this alpha in quotes which again for alpha you' be further along than that But we're putting it out to see what the market and the world thinks of it. And I think Concord didn't do that because they would have gotten similar feedback, I assume, right? And now they've gotten this feedback and it's like, okay, well, you know what I mean with the Concord example. But like now we're to the point of like I don't think this is all right, we're taking you offline and back to the drawing board here to work on you as much as it is to hemhaw lay off a bunch of people and kill it. I mean, we've talked about Concord a lot, but like Concord also had a different beast of it was going into a dying genre, which is the team arena shooter that we just don't see a lot of love in",
            "start": 2538.0
        },
        {
            "text": "it. I mean, we've talked about Concord a lot, but like Concord also had a different beast of it was going into a dying genre, which is the team arena shooter that we just don't see a lot of love in right now. It's like that is a beloved style of gameplay. When you think of Halos, old school Call of Duties, we've seen Splitgate kind of break the mold with this, but like team arenas are not the hot stuff that it is right now that people think. It is battle royale. It is hero shooters like Overwatch and Marvel Rivals. Concord shows around that like that was not the right move. Remember X Defiant came out? Yeah. Another one of those team arena shooters. That's like that's not where the audience is right now. And it's very tough to start a game 5 years before like right now and say where is this audience going to be 5 years from now. It's just an ever evolving market. But when you think of trends and you think of old school staples, some of those old school staples aren't as strong as they",
            "start": 2574.32
        },
        {
            "text": "audience going to be 5 years from now. It's just an ever evolving market. But when you think of trends and you think of old school staples, some of those old school staples aren't as strong as they used to be. It's really interesting that it does seem like we can all call this. Like why is it that we can look at all these games and know, oh X defiant, we put that in a category, but we looked at Marvel Rivals and we put that in a different category. Like is it sheer quality of game? What's the X factor there? I think the one thing in this conversation that we got wrong and I don't want to put everyone in that thing was Hell Divers 2 which is breakout success that I don't think any of us could have at all put in the category I don't think anyone could have predicted as a hell but like do you remember all the we where's PvP at for Hell Divers 2 do you remember how that lasted for about 3 weeks and people were like oh is it is it done because they don't have PvP is this game going to fail",
            "start": 2620.32
        },
        {
            "text": "remember all the we where's PvP at for Hell Divers 2 do you remember how that lasted for about 3 weeks and people were like oh is it is it done because they don't have PvP is this game going to fail it's like no it's people want this experience I was very clear of, hey, no, that's not the game we make. I'll go on the opposite side from Tim, though. We're like, I I don't think I could have called Marvel Rivals. I can look at a lot of these games and say, you know, I I keep on making the comparison. It's Charles Barkley in the era of Michael Jordan. It's like you I look at Marvel Rivals and I could have easily seen that failing along with all of the other very very good highquality games. Maybe that the IP certainly gives it a big boost, but there's a lot of awesome quality games that if they were released 10 years ago, 8 years ago, it would be a completely different story. But because they were releasing right now, it's just you are surrounded by all this stuff and it's so hard to even",
            "start": 2660.0
        },
        {
            "text": "were released 10 years ago, 8 years ago, it would be a completely different story. But because they were releasing right now, it's just you are surrounded by all this stuff and it's so hard to even make an impact. Thousands of games a year, thousands of games a month are getting dropped here. Yeah. Just real I'm with you there. Like I'm not to be clear, I'm not saying that we could have predicted Marvel Rivals would have been the success it is. That's way beyond what I'm saying. Okay. But I do think there's something about that initial reveal that we saw and the excitement there and then when you guys played it, the energy y'all had, the fact that y'all wanted to go home and keep playing it together, Mike, it for reals though, it's like all it took was seeing the game and then playing the game and then all of a sudden it's like, oh yeah. Whereas like a lot of these other ones, you see, you play, you're like, uh-uh. And it's like there's a lot of factors that go into it, but it is",
            "start": 2706.32
        },
        {
            "text": "the game and then all of a sudden it's like, oh yeah. Whereas like a lot of these other ones, you see, you play, you're like, uh-uh. And it's like there's a lot of factors that go into it, but it is something where we look at marathon and it's not in the Marvel Rivals category definitively. Well, Marvel Rivals is also scratching an itch that needed to be scratched that was different than a lot of these, right? Overwatch has had its time in the sun. Overwatch 2 was disastrous on how they launched that and really brought that back up. And people love Overwatch. They want that kind of herobbased team objective style gameplay. And Marvel Rivals, you mix Marvel, the hype that we've rode for these past 10 years with the MCU, plus the game is good. Now you're putting it in this kind of market that is Overwatch and fans like Andy who loves that style of gameplay. The old esports fans of Mar of Overwatch, they needed something and that's what Marvel Rivals hit, right? Marathon, uh, of course,",
            "start": 2744.48
        },
        {
            "text": "is Overwatch and fans like Andy who loves that style of gameplay. The old esports fans of Mar of Overwatch, they needed something and that's what Marvel Rivals hit, right? Marathon, uh, of course, Concord, they're all going for a different market. They are a different style of game. Marvel Rivals and Overwatch have their own style, and that's what people were looking for at that time. You guys correct me on this. Concord, where would you put that closer to a Halo or closer to a Overwatch? Halo. Uh Halo. Okay. 100%. Yeah. Yeah. It is a team arena. You can heroes, but it's team arena. It's still a hero shooter, but it was largely kill confirmed or you know. Oh, I would say Marvel Rivals and Overwatch were are pretty much they they are just the same game with replace characters and even moves that are all very very similar. Yeah. Like you're pushing a payload. You're scratching that sort of same itch that you've been looking to get scratched. Yeah. Mike, does any conversation here change",
            "start": 2786.08
        },
        {
            "text": "that are all very very similar. Yeah. Like you're pushing a payload. You're scratching that sort of same itch that you've been looking to get scratched. Yeah. Mike, does any conversation here change if this is not marathon? This is Destiny Extraction. No. You're going into a market that is not welcoming, very welcoming the casuals. You are dropping a game. Even if this was Destiny Extraction shooter, you would still have the audience going, \"Ooh, you're not as good as you need to be.\" Right? Arc Raiders proved that like there is a small market for this that people will get excited for and kind of drop what they're doing and play for a weekend to a week, maybe more. We'll see on October 30th how long that Arc Raiders love really lasts. I'm still very hesitant on that. Like I think it's going to get some good love, but I don't think we'll be talking about that in 2026, 2 months afterwards, right? And so you're going into a market that is like this is already very hard to crack. This",
            "start": 2834.4
        },
        {
            "text": "going to get some good love, but I don't think we'll be talking about that in 2026, 2 months afterwards, right? And so you're going into a market that is like this is already very hard to crack. This game wasn't that good, right? The gunplay was good. It was shallow. It was missing things. The maps were too similar. The NPCs that we were fighting were way too similar. There wasn't much variety going on in that. And I think when you expect something out of Destiny and Bungie, you expected something more. Yeah, there's I mean I I could easily look at Arc Raiders and say, \"Yeah, if it fails, I won't be surprised at all.\" I I do feel like there is a different sort of fervor around the from the PC community who's maybe already played Tarov and experienced that. But there there there seems to be a different level of enthusiasm and excitement for arc creators where the leaks and the hopeful people that were thinking that it was going to be shadow dropped on Summer GameFest like that was",
            "start": 2878.64
        },
        {
            "text": "to be a different level of enthusiasm and excitement for arc creators where the leaks and the hopeful people that were thinking that it was going to be shadow dropped on Summer GameFest like that was gaining a lot of traction within that community. I don't know how big that community is. Uh granted there was one though. Yeah. And and I think I I think the what when you're talking about the enthusiasm levels, it is night and day between what people were looking at and feeling about Marathon compared to how the same people who should be interested are feeling about Arc Raiders cuz they seem a lot higher on that. And I enjoy the hell out of Arc Raiders. And at the end of the day, I'm like, ah, this was also supposed to be a Division like, you know, shared world shooter co-op thing that I would have enjoyed probably way more. Yeah. Two super chats before I want to end on an article here. Uh Deja Q super chats and says, \"I can't I can't see this delay not having layoffs. Follow it.",
            "start": 2923.76
        },
        {
            "text": "I would have enjoyed probably way more. Yeah. Two super chats before I want to end on an article here. Uh Deja Q super chats and says, \"I can't I can't see this delay not having layoffs. Follow it. Leadership needs to change for Bungie to survive. Uh they rarely have delays that didn't have layoffs to follow. Would a full Sony acquisition save them? I also think like this one down here that was also calling into leadership from uh Kazawi. Executives seem to be the issue at Bungie's. They ship mid, fix after feedback, and repeat. look at D1/D2 launch verse expansions uh let alone just what we've heard out of Bungie for so long of leadership the changes over there what's going on I think again it's interesting to look at that and then talk about why Arrowhead didn't add PvP to Hell Divers right where they came out and they were so clear so firm this is the game we are making we're not going to do that we're not we're not making a game by committee or by our community we're making a game",
            "start": 2966.64
        },
        {
            "text": "where they came out and they were so clear so firm this is the game we are making we're not going to do that we're not we're not making a game by committee or by our community we're making a game that'll follow the community it's long gone and I forget I don't couldn't do it but it went Quick, somebody put in there, um, great games don't chase markets, they make them. And I think that's an interesting way, and I'm I'm paraphrasing even what that was, of an interesting ride. And I think again, where we look at PlayStation's problems in this live service is them looking trying to look ahead and jumping on something, not understanding where they're going. I want to go to the WY at IGN. That's Wesley Yinpool, who had this article a while back. Uh Sony live service woes continue as PlayStation executive Jade Raymond exits Fair Games developer after external test sparked concern. Jade Raymond has left Haven Studios, the Sony owned developer behind online multiplayer shooter Fair Games with",
            "start": 3013.12
        },
        {
            "text": "executive Jade Raymond exits Fair Games developer after external test sparked concern. Jade Raymond has left Haven Studios, the Sony owned developer behind online multiplayer shooter Fair Games with the game reportedly delayed following an external test and yet another blow to PlayStation's live service ambition. According to Bloomberg, Raymond exited the company she founded several weeks after an external test of fair games apparently didn't go down well. The game was due out in fall 2025, but is now delayed to spring 2026. As Bloomberg put it, PlayStation leadership didn't give Haven staff a reason for her departure. But it came several weeks after an external test of Haven's first game, the online shooter Fair Games, according to people with knowledge on the matter. Some developers at Haven were concerned about how the game was received and its progress, said the people who asked not to be identified because they aren't authorized to speak publicly. It's yet more trouble for Sony's",
            "start": 3053.28
        },
        {
            "text": "were concerned about how the game was received and its progress, said the people who asked not to be identified because they aren't authorized to speak publicly. It's yet more trouble for Sony's embattled live service Ambition, which now appears to be in full retreat. While Arrowheads Hell Divers 2 is a breakout hit, becoming the fastest selling PlayStation Studios game of all time with 12 million copies sold in just 12 weeks. Sony's other live service games were either cancelled or suffered disastrous launches. Indeed, Sony's Concord is one of the biggest video game disasters in PlayStation history, lasting just a couple of weeks before it was brought offline amid eyewateringly low player numbers. Sony later decided to kill the game entirely and shut down its developer. The Concord flop came after Sony already canceled Naughty Dogs: The Last of Us multiplayer game. And earlier this year, Sony reportedly canceled two unannounced live service games. One, a God of War title in",
            "start": 3096.8
        },
        {
            "text": "flop came after Sony already canceled Naughty Dogs: The Last of Us multiplayer game. And earlier this year, Sony reportedly canceled two unannounced live service games. One, a God of War title in development at Blue Blueoint. Uh the other in works at Days Gone developer Bend since the publishing of this insane. It's like none of these people talk to each other. Yeah. Like Yeah. Like it it's as if that they have these studies that are like, \"Well, we have we have like, you know, a lot of people doing research and in about the next 5 years, we're going to have double the amount of gamers on the planet.\" Like, but don't tell Mike. That's insane. Holy [ __ ] Yeah. I I want to take that too because like the talking to each other and even the just kind of like cross teams at PlayStation Studios and how all this stuff works. It's like you think back to 2015 16 when Kojima went on his little tour, right? And then he was searching for new technologies and we we we get uh the uh the Horizon",
            "start": 3137.92
        },
        {
            "text": "and how all this stuff works. It's like you think back to 2015 16 when Kojima went on his little tour, right? And then he was searching for new technologies and we we we get uh the uh the Horizon engine, the uh uh the Dema engine, right? And like cool, we're going to link up that way and Death Stranding is going to be made. And here we are now on the eve essentially of Death Stranding 2. Stranding one sold, I think, way better than anyone would have expected that um for the time being an exclusive on it being as weird as it was. And to pull over real quick too, remember just a smaller footprint, a smaller developer, smaller cycle, smaller, all of that. All of that, right? But a success. And here we are, Death Stranding 2 probably going to be a major success eventually going to other consoles and stuff. Bringing in a super chat from Guitar Hero Arrow from the first whispers of Marathon back in 2014. I hope this would be the heartfelt singleplayer reboot we eventually got from Doom and",
            "start": 3182.0
        },
        {
            "text": "and stuff. Bringing in a super chat from Guitar Hero Arrow from the first whispers of Marathon back in 2014. I hope this would be the heartfelt singleplayer reboot we eventually got from Doom and Wolfenstein. Can you imagine if Bungie had made a Wolfenstein or Doomcaled marathon singleplayer reboot that they could because of the way they were acquired and were like we want autonomy also put on PC, PlayStation and Xbox day one. That is a recipe for success but that we have seen proven that oh people will buy these games to the extent they need to. we can have a smaller team work on this. Like the expectations are different and that is serving an audience that wants that. And on top of that, Destiny feeds the money bank, right? Like you keep Destiny content going, you keep moving with Destiny, we can have these oneoff single player experiences that we know we they make money, but they're not making the live service money. And now you can have both. You can have your cake and eat it too,",
            "start": 3224.56
        },
        {
            "text": "we can have these oneoff single player experiences that we know we they make money, but they're not making the live service money. And now you can have both. You can have your cake and eat it too, right? Hey, here's Destiny. That's my money maker. Hey, here's a really cool Wolfenstein and Doom reboot that no one would ever think, oh, it's going to be played for a year and then come and go and we'll make another one in five. You know, that's all you had to do. And it's wild thinking that about a year ago was when they laid off 220 employees and then two months prior to that or a month prior to that, they had laid off a hundred. So, it's like, damn, that over 300 people being laid off from Bungie. That's pretty [ __ ] massive. and their pre-layoff numbers were 1,300 employees and now they're down to a measly 850. Like that's so many people. And surely when we look at um I know you can't just like compare apples to oranges, but when we look at um um um Obsidian ah yes or or you know some",
            "start": 3270.48
        },
        {
            "text": "down to a measly 850. Like that's so many people. And surely when we look at um I know you can't just like compare apples to oranges, but when we look at um um um Obsidian ah yes or or you know some of these teams that have these smaller teams break off and do these smaller projects. You know that that is possible. You don't need 850 people working on some and clearly some of those people were being moved to the Marathon project or you know these people are kind of like floating between two different divisions or whatever but it it's just so wild to me that there are not only that many employees at Bungie that continue to you know seemingly get laid off but to think of the possibility of holy [ __ ] we could have had a smaller team hundred or 200 people working on a single player thing that does not need to doesn't need to be the forever game. If we sold two to three to four million copies of this thing at 50, 60, $70, whatever it is, and it's like incredibly high quality, like, oh my",
            "start": 3312.88
        },
        {
            "text": "does not need to doesn't need to be the forever game. If we sold two to three to four million copies of this thing at 50, 60, $70, whatever it is, and it's like incredibly high quality, like, oh my gosh, that just sounds like such a dream situation. And it it it just really shows you the dollar signs. We had to chase the dollar signs. We needed a Fortnite. We needed an online success. We needed that. People only have to get a battle pass. See, I'm I'm in an interesting phase of like I'm not mad at the vision and the idea, right? Like coming from the Xbox side of things, you see live service games that are doing well, right? But there's a certain kind of style to that live service game. And there's also years of like, you remember Sea of Thieves at launch? Guess what? We're like seven years into Sea of Thieves. ESO at the beginning of ESO, right? Fallout 76. They have a number of live service titles that work. You're getting a grounded two. Yep. And so like I like the idea that",
            "start": 3372.08
        },
        {
            "text": "years into Sea of Thieves. ESO at the beginning of ESO, right? Fallout 76. They have a number of live service titles that work. You're getting a grounded two. Yep. And so like I like the idea that PlayStation was like, \"Hey, we've nailed what the general audience wants. That single player narrative driven third person action adventure game. We got that. Okay, what can we do over here?\" And I think they just missed the mark of what their audience wanted. And it speaks with Hell Divers. Hell Divers is a PVE experience. There is no Timmy and Tommy's hunting you down. Hell Divers, I've believed since the beginning would not have been as big as it is if it was PvP or had a PvP element, right? Because then you would not have the experiences of sharing moments with your friends. We look at all these live service games that have gone down that Greg just read off. That is not fitting the mold of what PlayStation gamers wanted. Somehow you went from my PlayStation gamers want single player",
            "start": 3419.84
        },
        {
            "text": "these live service games that have gone down that Greg just read off. That is not fitting the mold of what PlayStation gamers wanted. Somehow you went from my PlayStation gamers want single player action adventure narrative driven games. Okay, let's give them live service games. Maybe we don't make hardcore PVP firsterson shooter titles. Let's try to build off of what Xbox did with Sea of Thieves, what Xbox did with ESO. We also have to remember that some of these titles take years to really find an audience and stay relevant. And it's not cash cow day one, right? You see it these releases today. It doesn't last. And but but to that point too, and I I love that you're bringing this up because like we should remember that seven years ago or whatever it was when Rare announced Sea of Thieves, we were like this isn't what we want from Rare, you know, like even that was a thing of this same conversation applied back then. They turned it around. But what were the factors that got it there?",
            "start": 3465.2
        },
        {
            "text": "we were like this isn't what we want from Rare, you know, like even that was a thing of this same conversation applied back then. They turned it around. But what were the factors that got it there? Like how much did the very low barrier of entry of things like Game Pass allowing that game to have that community, multiplatform support, all of that with PlayStation? There's a PlayStation Plus. I am giving you $12 to $20 a month. There's no reason why some of these titles aren't doing that, right? And PlayStation, it seems to be adverse to some of this. I don't get the vibe of PlayStation like a game pass of like, hey, here's my here's a great one for you. Um, Ninja Theory made a game called Bleeding Edge, which just died right away. That was a Team Arena game, and Ninja Theory made that, and guess what they did? put it on Game Pass and it lived a lot longer than Concord and this game over here with Marathon. Just follow what's working. Look around you and communicate like you all said.",
            "start": 3506.24
        },
        {
            "text": "guess what they did? put it on Game Pass and it lived a lot longer than Concord and this game over here with Marathon. Just follow what's working. Look around you and communicate like you all said. I don't know how we're missing the mark. It's crazy. I edged for about a week, man. Jesus Christ. You're over there. I'm just blown away that when we talk Sony live service, you Yes, there is a market for this and this is the right move cuz guess what? My portfolio over here is already [ __ ] crushing it. It is eating Nintendo and Xbox's [ __ ] for lunch, right? They're doing it. But I needed more. I needed that Fortnite money maker. And you did the right move getting Bungie. You can explain to me if it's not a full purchase, but like having Bungie in the lineup and saying like, \"Hey, let's make more Destiny. That's the golden goose. You do that.\" But everything else, look at what your market wants. Hell divers was a success because it was a PvE. Make that. But in Sony Worlds, we don't need",
            "start": 3550.24
        },
        {
            "text": "more Destiny. That's the golden goose. You do that.\" But everything else, look at what your market wants. Hell divers was a success because it was a PvE. Make that. But in Sony Worlds, we don't need everything to be PvP. the audience doesn't want that. It's not even the PvP aspect. It's the it's the you need to live here. You need to be engrossed in this ecosystem. Like I I it's crazy you listing off that massive amount of games that are all trying to do the same thing, which is retain a player for as long as possible. And it it really just feels like when when the person at the top hears about all of these studios going like, \"Oo, I I just kind of like off-handedly mentioned a couple of y'all should be doing this.\" Not every one of you, dude. What the [ __ ] man? That's like that's so casual conversation at a happy hour and everyone ran back to their studio and was like, \"We need to make unfortunately it feels like it's even the opposite of that of it. It's them being like, I know",
            "start": 3596.48
        },
        {
            "text": "casual conversation at a happy hour and everyone ran back to their studio and was like, \"We need to make unfortunately it feels like it's even the opposite of that of it. It's them being like, I know you're all doing it. Do it.\" You know, it's not the like, \"Oh, whoa. I didn't mean all of you. It it it feels like they did mean all of them. Like this is on them as much as it's on anybody. It also felt like we snapped our fingers. We got four or five studios and they all started working at the exact same time. And now we're seeing that work being turned into the teacher and we're all like oh [ __ ] Like nobody wanted any PlayStation. There was no like, hey, you're up first and then slowly go to you then you. It's just like here's five and we're all ready to rock. is like, \"Oh [ __ ] that was too fast.\" Here, Street Shadow gets the final super chat of the show and says, \"The most successful live service Sony games have not been marketed as such.\" MLB The Show, Hell Divers 2, Gran Turismo",
            "start": 3648.16
        },
        {
            "text": "too fast.\" Here, Street Shadow gets the final super chat of the show and says, \"The most successful live service Sony games have not been marketed as such.\" MLB The Show, Hell Divers 2, Gran Turismo 7, Gran Turismo 7. It's partially a marketing thing. Outr Rididers. Make a game like Outr Rididers, man. I mean, I don't think you have to I don't think it's a market thing as well. If you know, it's a live service game. And they did that thing where they did a whole [ __ ] state of player showcase, right, where it was like it's all live ser. Oh god, I don't want this [ __ ] But here we are. Now the question is, is Bungie doomed to end this show? No. Is Bungie doomed? Yes. As I it's not Bungie is doomed as, hey, we closed Bungie. I do think it's Bungie is doomed as they are laying off an additional 65% of their workforce while they focus on supporting PlayStation efforts and work on their own idea which will never come to fruition. It will become this. You do not play marathon, I don't",
            "start": 3688.72
        },
        {
            "text": "65% of their workforce while they focus on supporting PlayStation efforts and work on their own idea which will never come to fruition. It will become this. You do not play marathon, I don't think. What about the frog game? What about the frog game? A lot of people been looking for that one. What frog game? The frog type game. They're working on a frog type game. Well, bungee a team from bungee bungee split split off to make Frogger to do LFG. Okay. And they're, you know, frog type games. I mean, a battle royale frogger game. I mean, yeah. There we go. Frogger 99. Boom. Put it out. Like everything he said is true. They're making a frog type game. A frog type game. We don't know what that means, but they like there was Yeah, I've been high on the couch once before making up [ __ ] Okay. Yeah. Like good. There was a team there was a team at Bungie making [ __ ] and everybody was like, \"Man, that team is really cooking something.\" And they broke off and got their own logo. Okay, Greg,",
            "start": 3732.88
        },
        {
            "text": "Yeah. Like good. There was a team there was a team at Bungie making [ __ ] and everybody was like, \"Man, that team is really cooking something.\" And they broke off and got their own logo. Okay, Greg, I'm right there with you with everything you said about the level of doom that Bungie is. My big thing is that I just I I don't believe in is that we don't that bun that Marathon doesn't get released. Like, that's the thing to me that I'm like, \"Oh, man.\" But I would have never thought they would have done what they did to Concord. So I think Concord was was like such egg on their face and such a learning experience that they have to sit there and go it'll be better just to eat crow. It didn't come together. We read the feedback. It's a crowded market. We're sorry. Then put it out another Yeah. This is like five people will understand this. But Mike, this is the Phoenix Suns going all in on Bradley Bill and Kevin Durant. Yeah. And mortgaging their future. Yes. And that team was a",
            "start": 3771.92
        },
        {
            "text": "Yeah. This is like five people will understand this. But Mike, this is the Phoenix Suns going all in on Bradley Bill and Kevin Durant. Yeah. And mortgaging their future. Yes. And that team was a disaster. Where we at? Yeah. Yeah. And now you are going to And it's not just like that team was a disaster. Let's just be ready to go next year. No. Like you're those teams were working for so long on these things and now that they are going to be gone. Then you are going to see the fallout of this. It's like similar to us when we would talk about the pandemic developed games. This fallout is going to continue for the next several years of all of these failed studios with all of this lost um I would say like confidence from employees being like why would we want to go work over there? We we've seen how badly mismanaged all of this [ __ ] is. Like all of that stuff has consequences and we are going to see the fallout of all of these failures for the next 5 years because that's how long it",
            "start": 3809.04
        },
        {
            "text": "seen how badly mismanaged all of this [ __ ] is. Like all of that stuff has consequences and we are going to see the fallout of all of these failures for the next 5 years because that's how long it takes to make these big ass games. We'll see a video like Halo Studios come out of like we're Bungie and we make Destiny and we [ __ ] love Destiny. You're like, \"All right, stick to it.\" Yeah. Yeah. All right. Well, ladies, gentlemen, and NBS, we'll be watching whatever happens to Marathon, Bungie, and of course, the entire video game industry right here on Kind of Funny Games, your place for live talk shows about video games and more. Of course, we start with Kind of Funny Games Daily, 10:00 a.m. Pacific. Roll into a games cast. Sometimes we change the topic and then stream some games or do a podcast. No matter where you get the show, thank you for your support. Whether it be on twitch.tv/confunnyames, youtube.com/kindfunname, Apple, Spotify, or some other podcast service. We'd love it if",
            "start": 3858.56
        },
        {
            "text": "podcast. No matter where you get the show, thank you for your support. Whether it be on twitch.tv/confunnyames, youtube.com/kindfunname, Apple, Spotify, or some other podcast service. We'd love it if you liked, subscribe, share, and left a review. But most importantly, if you picked up a membership over on youtube.com/kindfunname, patreon.com/kindafoney, Apple, or Spotify to get all of our shows ad free, get your daily dose of me, and keep an 11person independent games media company alive. For now, we're saying goodbye on the Games Cast, but reminding you we are doing a stream Nvidia sponsored FBC Firebreak. Excited to see what that multiplayer game that just launched looks like and how you all enjoy that. Uh, but until next time, it's been our pleasure to serve you. [Music]",
            "start": 3902.4
        }
    ]
}