{
    "id": 14327,
    "video_id": "xRWl_8ID8xw",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Andy Cortez",
        "Blessing Adeoye Jr.",
        "Roger Pokorny"
    ],
    "title": "Resident Evil Requiem Gameplay REVEALED - Kinda Funny Games Daily 06.27.25",
    "description": "Download Cash App Today: https://capl.onelink.me/vFut/7u0sm0fp #CashAppPod Sign up with our exclusive referral code KINDAFUNNY in your profile. Send $5 to a friend within 14 days, and you’ll get $10 dropped right into your account. Terms apply.\n\n*Referral Reward Disclaimer: As a Cash App partner, I may earn a commission when you sign up for a Cash App account.* #sponsored\n\nGo to https://mood.com and use code KINDAFUNNY to get 20% off your first order.\n\nWe got our first look at Resident Evil Requiem gameplay, Capcom shows off more Pragmata, and Sonic crosses over with Magic The Gathering.\n\nTomorrow is Greg’s championship parade! Show up at the ferry building at 10am and walk with the crew to Square Pie Guys while we celebrate Greg’s victory.\nToday after, KFGD, you’ll get:\nGAMESCAST - Every Kojima Game Ranked\nAfter Gamescast, Mike and Roger are embarking on the biggest stream Kinda Funny has ever done. They’ll attempt to play the entirety of Death Stranding 2 while Mike goes step for step with Sam Porter Bridges on a treadmill… with a couple of surprises that might change everything. With your support, they’re determined to make it past KFGD on Monday… and of course, order a lot of food. Exclusively on Twitch.tv/KindaFunnyGames\nIf you’re a Kinda Funny Member:\nToday’s Gregway is what is Greg’s current gaming era.\nThank you to our Patreon Producers: Karl Jacobs, OmegaBuster, & Delaney Twining\n\n00:00:00 - Start\n00:12:30 - Housekeeping\nThe Roper Report   -\n00:16:01 - First Resident Evil Requiem gameplay revealed, showing first and third-person views - Andy Robinson @ VGC\n00:21:40 - Capcom reveals Resident Evil Requiem started as an online game, ‘but we realised fans didn’t want it’ - Andy Robinson @ VGC\n00:29:25 - Capcom reveals Pragmata’s unique puzzle-shooting gameplay in a new video - Andy Robinson @ VGC\n00:38:00 - Ad  \n00:47:31 - 50 Cent is officially in the Street Fighter Movie club, playing Balrog - Connor Makar @ Eurogamer\n00:50:35 - Sonic the Hedgehog is crossing over with Magic The Gathering - Press Release\n00:57:30 - Three Trailers we gotta watch from the Arc System Works Showcase\n01:03:55 - Wee News!\n01:07:55 - SuperChats & You‘re Wrong\n\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1751049065,
    "duration": 4303,
    "transcript_chunks": [
        {
            "text": "[Music] Today's stories include we got our first look at Resident Evil Reququum gameplay, Capcom shows off more Pragmata, and Sonic crosses over with Magic the Gathering. We'll have all this and more because this is kind of funny games daily. [Music] Hello gamers. Welcome to Kind of Funny Games Daily for Friday, June 27th, 2025. I am Andy and I'm joined by Bless and he's just so pumped about Sonic Revolution and this man Magic the Gathering thing.\n So so pumped. I was about to say that like, oh man, this is the first time where you're in the hosting seat and I'm not. And then I remembered the today.\n Today Oh wow. What was that?\n Good morning, Bless. How you doing?\n I'm doing pretty good. How are you doing? I'm doing I'm doing well. Uh started discing 2 last night.\n I saw that. How you liking it?\n Apparently there's some issues with per a recent patch that made on the PS5 Pro performance mode look hella blurry and Oh, really?",
            "start": 1.93
        },
        {
            "text": "I saw that. How you liking it?\n Apparently there's some issues with per a recent patch that made on the PS5 Pro performance mode look hella blurry and Oh, really?\n Yeah. So, I'm not sure what that's all about. Getting a lot of conflicting sources. Getting a lot of people giving me info, but it seems like maybe a new patch has to go through on PS5 Pro.\n Interesting. And on the on the Pro specifically.\n Yeah.\n Oh, that's weird.\n I set that sucker to I'm on quality. I'm like, \"Oh, why does, you know, 30 frames per second, you know,\n it is what it is. Let me switch to performance.\" And it's just like, \"Ooh, blurry\n there.\" I I like existing in the in between space of like I'm definitely nowhere as about fidelity as you and Tim, but I'm definitely like higher than a Greg Miller. Like Greg will look at like a [ __ ] Game Boy Color and think it's the best. You know what I mean? Yeah. Yeah.",
            "start": 55.52
        },
        {
            "text": "Um, but like I'm so I I I'm happy that I exist in this space where I've seen the PS5 Pro like once as far as like what those games look like. And so I'm so good with what my PS5 base is doing that like I don't if you I would have guessed that you would have been rocking that thing 4K 60 all crispy. Well, you know, the PS5 Pro looks it looks good, right? Like the quality still looks awesome. And the main reason I bought the sucker was for Final Fantasy 7 Rebirth",
            "start": 103.76
        },
        {
            "text": "because that [ __ ] whenever you would drop it into performance mode for 60. Like that's one of the few games that I voluntarily played at 30 frames because of how awful the frame rate mode looked. And so this doesn't look anywhere near that bad. This is like not it's not even close to how bad it looked uh Final Fantasy 7 Rebirth looked on uh PS5. But you know the you see the text and it's like oof. Yeah. Why is that like that? Maybe maybe keep the UI 4K and make make the rest of the game like, you know, lower res if you need to cuz things just look a little blurriier. So, uh we'll wait for that patch and I'm sure things will,\n you know, improve.\n You going to see this game through?\n Um it's just it's a real tough time right now.\n Oh, really? You don't like walking?\n It's a rackus though.\n Like it's it's it's not Death Shanny 2's fault. Like",
            "start": 133.52
        },
        {
            "text": "You going to see this game through?\n Um it's just it's a real tough time right now.\n Oh, really? You don't like walking?\n It's a rackus though.\n Like it's it's it's not Death Shanny 2's fault. Like\n that makes sense. in any other universe where I'm not addicted to Dune Awakening. I am like I'm playing this [ __ ] on Tuesday when it drops. Yeah.\n You know what I mean? Or the main reason why I never hopped on the the review was Night Rain was out and Liza P was happening and I knew other people were going to be playing it. So, I was like, \"All right, I'll wait until this Tuesday pre-release.\" And god dang, Arachus, you know,\n calling to you that much.",
            "start": 171.6
        },
        {
            "text": "calling to you that much.\n The shy halude, man. Dude, that's that's kind of me with rematch right now. And I'm happy that there's not like big big releases happening. Like if DK Bonanza was out tomorrow or something, I would I'll definitely be having problems. But like every day I go home and I'm like, \"All right, let me play more of The Altters. Let me pick up like this other game that I wanted to start.\" You know what I mean? And then like I look at my Steam and then I look at my Discord and my friend Ace hits me up and he's like, \"I'm trying to get on some rematch.\" And I'm like, \"Fuck you. I'm trying to get on some rematch.\" And then three hours pass and I'm like, \"I just had the time of my life.\"\n Yeah. And it there's too many. Look, we always make the joke that there's too many games or whatever, but like now more than ever,\n I I can't believe that I'm not immediately attached to a Cojima game right now.\n I feel that\n like it's it's crazy to me. You'll get there.",
            "start": 204.8
        },
        {
            "text": "I I can't believe that I'm not immediately attached to a Cojima game right now.\n I feel that\n like it's it's crazy to me. You'll get there.\n I still I still\n You got to beat it by the end of the year.\n I still enjoyed my time with it. Um and I know that I will play it. I don't know if I'll do a\n I don't know if it'll be a stream game.\n I feel like I might just kind of relax with this one. you know, let let the soothing sort of, you know, let the walking and all that stuff just sort of massage the eyeballs. And the game's beautiful and really wish I had an OLED TV\n cuz I would love to just sit in the bean bag chair and just play this [ __ ] You know what I mean? It's such a relaxing game to play.\n It's so nice looking. I got caught so many times by a bunch of mules. In DS2 Oh, man. You got to bust out the blickie. Well, I I I mean, I got caught because I was just shooting all over the place, you know, and man, oh my gosh, dude.\n You know,",
            "start": 242.56
        },
        {
            "text": "You know,\n I'm not gonna complain about remapping controls. Bless.\n Oh,\n but like a lot of video games that big old touchpad on the PlayStation controller, that means like a map button.\n Oh, yeah. Yeah. And I'm looking at this like over, you know, I'm overseeing, you know, one of the first kind of like just little enemy encampments. No spoilers. There's enemy encampments in the game. And I'm just kind of overlooking. I'm like, \"All right, I'm trying to set my path and I want to like mark them or whatever on the map.\" Hit the touchpad button. Hey, over here. You're like, \"Ah, [ __ ] I forgot Sam calls out like that.\"\n Like in talking to nobody.\n Um, also Oh gosh, no. That it's not really spoilery, but you know what's your, you know, in the first five minutes of the game, Fragile asking me to go on this mission. Yeah.\n And I declined it every time.\n That [ __ ] freaked me out.\n It's so cool.\n That [ __ ] that [ __ ] was crazy. Um, pretty cool game.",
            "start": 297.6
        },
        {
            "text": "And I declined it every time.\n That [ __ ] freaked me out.\n It's so cool.\n That [ __ ] that [ __ ] was crazy. Um, pretty cool game.\n Pretty cool game. Is still doing his thing.\n Oh, yeah.\n Good for him.\n I need you to finish this game because you're going to see some [ __ ] that's going to blow your mind.\n Okay. Okay. Yeah. I saw a lot of people saying, \"Andy, get through the prologue, please. At least.\"\n Oh, yeah.",
            "start": 343.92
        },
        {
            "text": "Oh, yeah.\n You you know, and I love the visuals. Obviously, there's a lot of like weird [ __ ] that uh Cojima does. But, um, hey, this is kind of funny games, everybody. Forgot we were doing a show. Each and every weekday, we run you through the nerdy news you need to know about live on YouTube, Twitch, and on podcast services around the globe. If you love what we do, support us with the Kind Funny membership on Patreon, YouTube, and now Spotify and Apple Podcasts to get all of our shows ad free. Um, and get a watch us record them live and get a daily exclusive show for a chance to be a part of the show. Submit your thoughts and opinions as YouTube super chats as we go. And we already got a super chat from Charlie Nugget says, \"Good morning, KF Bless. Did you see the Sonic news?\" Man, let me tell you, I've never I've never gotten so many people hit me up and not just like kind of funny audience, not just on TW, like personal friends of mine.",
            "start": 359.52
        },
        {
            "text": "I haven't talked to the second cousin in years.\n Yeah, family are checking up on me that are like, \"Hey, I saw that Sonic the Hedgehog is coming to Magic the Gathering.\" And I'm like, \"I know. I You think my algorithm isn't trained for this to be the first thing I see when I wake up in the morning? Yes, I know that Sonic is coming to Magic the Gathering. And yes, I'm going to play that [ __ ]",
            "start": 412.96
        },
        {
            "text": "I'm the guy who after getting, you know, angry at the Sonic Revolution uh reveal, I'm watching uh Homeboy on screen in his Shadow shirt. I went, \"Man, that's a sick ass shirt.\" Sick. Exactly. It's funny cuz like I was making a joke. I was talking to I think I was on stream, but it was I think I was having a back and forth with Janet, who was in the chat of the stream, and I was saying that like I feel like there's two sid There's two sides of me, right? One side of me is like, man, I might have I might have made a mistake when when I first joined kind of funny. One of the first things that I feel like I presented myself as was a Sonic the Hedgehog sicko and I might have oversold that aspect of myself. But then I do think to that moment of like watching the dude with a Shadow the Hedgehog shirt and being like, \"Ah, [ __ ] That's a sick ass shirt.\" Like it is in me. There was that other reveal like so cool.",
            "start": 431.04
        },
        {
            "text": "It's like but I wish you I wish you can't fight the allegations. You're not beating them.\n I wish I measured it more though. You know what I mean? Cuz people like Sonic the Hedgehog. Oh my god. Anytime there's a Sonic, a [ __ ] Lego or like a [ __ ] like any Sonic thing, my notification notifications go crazy. And I'm like I wish there are other things that I had like filtered in alongside the Sonic aspects of me cuz now that's me with Gundam.\n Yeah.\n I I watch\n I do think when I see a mech, I do think Andy. I watched Gunam Wing as a kid and a I think a lot of it was me making that mech shirt for kind of funny live three and then Greg Miller starts like oh he's always doing the mechs always doing the Gundams the Gundam and always like making the Gundams over there and uh and then so I always get questions about have you watched the new Gundam thing I was like dude I watched Gunam Wing as a kid\n and I've tried watching Ironblooded Orphans every now and then but\n oh dude",
            "start": 482.08
        },
        {
            "text": "and I've tried watching Ironblooded Orphans every now and then but\n oh dude\n you all know from Mercury\n you all dude I mean Look, there are a lot of Gundam shows I want to watch, but I also don't even watch the shows that I need to watch. You know what I mean? So, like,\n oh man, that what's something\n that's starting another conversation cuz I got a question the other night that was like, \"Are you going to hop into the Fasmophobia update, Andy?\n Cuz they're releasing something new tomorrow.\" And I was like, I don't even get to play the games that I really, really, really want to play right now. You know, like there's not enough time for that. And it's not like Phasmophobia is even a thing that I love. like I'll play it with friends if they invite me or whatever, but you know there's we're just so inundated with so much stuff, you know?",
            "start": 532.64
        },
        {
            "text": "I I feel that and this is a followup and this might be a different conversation, but like what's something that people don't know you for that you wish they knew you for more? Like what's something that you actually do really love or nobody would associate with you? Because I feel like I have a bunch of those where I'm like there are plenty of things that I like that people just don't think about me for. Um, I, you know, it's got to be probably new, new newer audiences who may have watched me or maybe started watching Kind of funny a year or two ago or or Kind of funny fans that uh maybe only know me through like Ray Narvea's uh collabs or whatever.",
            "start": 574.56
        },
        {
            "text": "And usually it's like mentioning mentioning sports or mentioning uh the music that I'm into or something like that. There'll be a lot like it's still wild to me that we are getting discovered by new people every now and then whenever I get a holy [ __ ] you like that like whoa and I'm like that's crazy cuz I feel like I talk about that a lot but you're probably somebody who hopped on a year ago and maybe doesn't see me a whole lot on content or content or something like that.\n I feel that.\n What's your thing?\n I don't I guess more just action games in general like doesn't even have to be souls likes. I guess like the broad genre of like plat like platinum I guess ranging all throughout action games. I like games\n back in the day and",
            "start": 612.32
        },
        {
            "text": "back in the day and\n yeah like I DMC I like games where it's like I press a button and I do an attack. But I also like other [ __ ] [ __ ] Like that's the thing is I I talk about this all the time. If it's a banger in any genre, I'll probably like it. Like I I I just have like a pretty wide pallet as far as like what I'm willing to interact with except for like MOBAs and RTS's, but even like 13 Sentinels is kind of an RTS. But like I I get it's it's reached a point of I guess not annoyance because with the Sonic thing it's not annoyance. It's actually kind of it's I it I find it endearing how much people associate me with with Sonic even though I'm like I am a Sonic fan. I don't know if I'm as much of a Sonic fan as people think. Yeah. As you think I am. But I do love Sonic. So don't get me wrong. Um but the thing that annoys me is the Genchin Impact [ __ ] where I'm like I played Genchin Impact for like\n You had a hyperfixation moment.",
            "start": 653.84
        },
        {
            "text": "You had a hyperfixation moment.\n Yeah, I had a hyper and it wasn't even like a hyperfixation. It was more of a fascination of all right, what do people see in this game? And I played 40 hours and I was like, \"All right, cool. I'm putting this down forever.\" And now every single time there's like\n an update,\n a not even just an update, a game that looks like Genchin, like that brand of game, everybody's like, \"Oh, bless lock in. Bless lock in.\" I'm like, \"Yo, I haven't played this [ __ ] since 2021. Please leave me alone.\"\n I just saw uh somebody in chat Reedwin I'm didn't get the full name, but said, \"Yeah, I never heard Andy the Mecca guy.\"\n Like really? I don't even know if that's a serious comment or not, but that's that's crazy. Like, it's also encouraging because there are, you know, people in\n Souls Love took over the the mech stuff more.",
            "start": 698.16
        },
        {
            "text": "Souls Love took over the the mech stuff more.\n Yeah, probably. Yeah, I could I could definitely see that. Um, hey, uh, let's do some housekeeping. Yeah, it was a good podcast so far. Uh, housekeeping. Tomorrow is Greg's championship parade. show up at the Ferry Building at 10:00 a.m. and walk with the crew to Square Pie guys while we celebrate Greg's victory. We're an 11 person business all about live talk shows. Uh today after KFGD, you'll get the Games Cast, which is every Cojima game ranked.\n Yeah, it's going to be a [ __ ] list featuring uh Tim Gettys and uh Greg Miller, who is in the background right now just hanging out with a with a sign that he made himself. I saw him making this in the kitchen.\n Been making a lot of signs. Yeah,\n with the markers.\n Making a lot of signs back there.",
            "start": 739.28
        },
        {
            "text": "Been making a lot of signs. Yeah,\n with the markers.\n Making a lot of signs back there.\n He's excited for the parade, everybody. Uh, and after the games cast, it's back by popular demand. Mike and Roger are embarking on the biggest stream kind of funny has ever done, they'll attempt to play the entirety of Death Stranding 2 while Mike goes step for step with Sam Porter Bridges on a treadmill with a couple of surprises that might change everything. With your support, they're determined to make it past KFGD on Monday. And of course, order a lot of food exclusively on twitch.tv/kind of funny games. Will not be on YouTube. Marathon streams are always kind of weird with YouTube streams because they uh cut off uh there's a time limit on YouTube VODs. So, um\n a different sign this time.\n Yeah. Interest. How many?\n Got a lot of signs out there. Greg, are you making a Games Cast talk or you just making signs back there? Oh [ __ ]",
            "start": 784.24
        },
        {
            "text": "a different sign this time.\n Yeah. Interest. How many?\n Got a lot of signs out there. Greg, are you making a Games Cast talk or you just making signs back there? Oh [ __ ]\n He said, \"Oh shit.\" He definitely didn't remember that he's got to do that for me. Um, so everybody lock in for that. It's going to be a lot of fun. Mike and Roger have been working diligently along with uh Nick and Kevin and um getting all the setup going, making all the shots cool. It's going to be everything you loved about the Death Stranding one stream, but just even more elevated. It's the re enhanced remaster. Um, and I'm I'm really really pumped up about it. We got Roger coming on. Roger, get in here. Are you ready? Are you pumped? Are you excited?\n I'm so excited. Uh Andy, uh I heard a little birdie tell me that you were going to participate in the stream a little bit. Maybe come through. Maybe hang out with us. Maybe have a cheeseburger with us. Is that going to be happening this weekend?",
            "start": 831.6
        },
        {
            "text": "What birdie? What? Who?\n Cheeseburger.\n I mean, Mike told me that you said that you were going to you're going to come through. Uh man, it's a parade.\n You going there?\n Ah. the stream, you know, you got a death shining 2 stream. There's a lot of other stuff happening, you know, so\n all the, you know, mark me down as a strong maybe.\n Okay. Okay. Well, we'll see everybody uh in a few hours. And Andy, of course. Yeah. Yeah.\n Is there gas leak? Why is everybody talking slower? I feel like we're all taking our time here.\n Just not pumped up about this. Kind of worried about it. Uh if you're a kind of funny member, today's Greg way is what's Greg's current gaming era? Just [ __ ] games. No, current gaming era. This is his gaming.",
            "start": 882.08
        },
        {
            "text": "This is what he does. Uh, thank you to our Patreon producers Carl Jacobs and Omega Buster and Delaney Twining. Today, we're brought to you by Cash App and Mood, but we'll tell you about that later. For now, let's begin with what is and forever will be the Roper Report. J Martin is not finishing game. Y'all got to leave Greg alone. He's got a kid.\n He's got kids. Time for some news.\n We have eight stories today. Baker's Dozen.\n I will say it is a [ __ ] jam-packed news day and so it's great that we're getting here by 24 10:24.\n 10:24 is good. Good start.\n We're making good pace.",
            "start": 926.96
        },
        {
            "text": "We have eight stories today. Baker's Dozen.\n I will say it is a [ __ ] jam-packed news day and so it's great that we're getting here by 24 10:24.\n 10:24 is good. Good start.\n We're making good pace.\n Great start everybody. Uh story number one. First Resident Evil Reququum gameplay revealed showing first and third person views. This comes from Andy Robinson at VGC. Capcom has premiered the first Resident Evil Reququum gameplay, showcasing the game's first and third person views. The game will mark a quote bold shift for the franchise, according to Capcom, and stars Grace Ashcrooft, the daughter of Resident Evil Outbreaks, Alyssa, an FBI analyst investigating a series of mysterious deaths in Raccoon City 30 years after it was bombed in the events of Resident Evil 3. According to director Koshi Nakanishi from Resident Evil 7, unlike past Resident Evil protagonists, Grace has little combat experience, which means players will watch her learn and grow as the game progresses.",
            "start": 952.0
        },
        {
            "text": "Have you gotten to check this out yet?\n I didn't get to see anything from Capcom yesterday. As you know, we were on we're doing Superman 3 and review. Uh, one of the worst movies I've ever seen in my life and had a bunch of people on chat popping off going like, \"Are y'all reacting reacting to Capcom? Capcom's about to start Capcom.\" So, no, I did not get to watch that. We were talking about Superman 3. What were your takeaways? Bless. What do you think about any of this? Cuz, as you know, I'm not necessarily the Resident Evil dude.\n I mean, it's it's it's Capcom Spotlight, which is their showcase that they've done uh I think yearly for quite a while now. And it's always been a disappointment.\n It's always been a stinker. It's always been But um I think here's the thing. I came out of this Capcom Spotlight being like, you know what?",
            "start": 1014.08
        },
        {
            "text": "It's always been a stinker. It's always been But um I think here's the thing. I came out of this Capcom Spotlight being like, you know what?\n This is on the higher end of Capcom Spotlights. Still a dud though. like still pretty boring and still kind of whatever. They're replaying trailers that they've shown at other showcases, but they'll do the thing of replaying a trailer and then showing like a little bit more. They did that for Pragmata as well, which we'll talk about in a second.\n You got a tiny extra footage in Pragmat. Okay, we'll talk about that later.",
            "start": 1048.08
        },
        {
            "text": "You got a tiny extra footage in Pragmat. Okay, we'll talk about that later.\n Yeah, we'll talk about that later. But like they did the same thing with uh Resident Evil again where they they uh had some of the folks sit down and just talk more about the game, right? A lot of words coming from the the folks behind it, which is nice, which I you know, I'll take I'll take some words. Tell me more about the experience. They talked about uh the main character that you're playing here, was it Grace Ash? Ashcoft.",
            "start": 1070.96
        },
        {
            "text": "Grace Ashcraftoft. They Yeah. talked about her being a bit more like I think starting from ground zero a little bit and having to build up that confidence, build up that skill. Um and so I feel like that's probably going to bring it more into that survival horror like lean more into the survival vibe of like, oh man, you are kind of weak here, so you're going to have to actually upgrade and get better and you're going to see that in the character development throughout the story. But I think for me, I I was just excited actually seeing the game in motion. They showed off the the first person stuff and the third person stuff. Kind of going back and forth between that, which is uh new for Resident Evil, right? Usually we get one or the other. So, it's nice to see them be like, you know what? We made both of these. Let's just put both of these in one game. Um gameplay looks like Resident Evil. That's kind of my take away from it is I'm like, all right, I'm excited for this game.",
            "start": 1091.12
        },
        {
            "text": "what? We made both of these. Let's just put both of these in one game. Um gameplay looks like Resident Evil. That's kind of my take away from it is I'm like, all right, I'm excited for this game. Resident Evil is a game is a franchise that like whenever you put out a new one at this point I will show up to it and and play it and either really like it or if it's one of the bangers I'll [ __ ] love it. You know what I mean? Like it's one of those old reliables for me. Um but like it's not like I watch this trailer and go [ __ ] crazy or anything like that.",
            "start": 1126.16
        },
        {
            "text": "We know it's going to look great. We know it's going to uh perform well likely saleswise. I think they're in a really good spot, Capcom, just with they've been on a good hot streak with the RE series. Um, I think the the more notable takeaways from story number two here in a bit, but real quick, I just I I wanted to ask you and I wanted to ask the chat uh through super chats, uh, let us know your feedback. What are you going to be maning? First or third person?\n Ooh, dude, that's a really good question. I\n first too scary.\n Don't get in my face like that.\n I've liked first person in the last couple of Resident Evils, but I think I'm gonna go third person. It really is going to come down to which like where does shooting feel better, right,\n for me, which I won't know until I get my hands on the controller, but I think I'm going to go third person because",
            "start": 1152.48
        },
        {
            "text": "for me, which I won't know until I get my hands on the controller, but I think I'm going to go third person because\n I feel like they're trying to return back to like a little bit more of the classic Resident Evil or like maybe middle era. I don't know how we're dividing the areas, but like more of the Resident Evil 4 style thing.\n In the earlier review or in the earlier reveals, it did kind of seem like they were saying, \"Hey, first is recommended, but you know, you can also play third.\" And I don't that doesn't give me a whole lot of like I don't know. I I I just wish they would say it's amazing in either.\n It's like it's the performance mode fidelity mode thing where I'm like, \"Brother, just choose for me. Just tell me what the right way.\"\n You could play solo if you want, but it's a multiplayer game. It's that sort of vibe. Like, no, just tell me like first or third is is you know, they're both going to be equally amazing experiences.\n So, you don't know what you're meaning.",
            "start": 1196.16
        },
        {
            "text": "So, you don't know what you're meaning.\n I'm not going to play this [ __ ] game.\n You're not playing Resident Evil Reququum.\n The ninth one. Didn't you play Did you play eight?\n Yeah, because you [ __ ] made me.\n Yeah, we're going to make you play this one, too.\n I had to play that [ __ ] on stream. Um I I don't know. I don't I just don't give a [ __ ] about the franchise. I I've never cared about Resident Evil. I I respect the [ __ ] out of of it as a franchise of how, you know, just one of those one of those rare franchises that existed way back in the day and still carries a lot of esteem even though there was a lot of, you know, potholes in the road.\n Yeah. It's it's one of those that",
            "start": 1242.64
        },
        {
            "text": "Yeah. It's it's one of those that\n not all franchises from back in the day survive those potholes. A lot of them [ __ ] broke. You know, you get a flat tire and they're just that that thing is done and you try to bring it back. you try to reinvent it in a way and just it doesn't vibe anymore. Resident Evil is such an awesome thing that it's still continuing. It's still going strong as hell. Um, and I wanted to go to the next story. Story number two, which is kind of a nice little tie-in",
            "start": 1280.4
        },
        {
            "text": "to what we just spoke about because this also comes from Andy Robinson at VGC and it's Capcom reveals that Resident Evil Reququum started as an online game. Quote, \"But we realized fans didn't want it.\" Let's go. Let's go. Thank you, Kevin. Thank you for the smoke. Um, Capcom has revealed that it tested open world and online concepts from Resident Evil Reququum before settling an online traditional singleplayer game. Speaking in an extended developer diary video available to members of Capcom's website, Reququum director Koshi Nakanishi shared a brief look at the early online version of Resident Evil 9 and said it was ultimately abandoned because he realized it wasn't what fans wanted. Sometimes you just got to, you know, read the tea leaves. You know,",
            "start": 1307.2
        },
        {
            "text": "sometimes you got to read a Reddit and go, \"Ah, yeah, [ __ ] Let's not make those online things.\" Just like, man, I'm still blown away by that one games cast we did recently that I think you weren't here for. I think you were working on something,\n but it was, it's been said a million times, but Greg reading uh an article and mentioning every Sony live service game.\n Yeah. in addition to the ones that were cancelled and like just this whole list of them and I was just so blown away like god damn dude does nobody talk to each other at these places right and it's just so I don't know it's a breath of fresh air\n to see that a developer understands that people don't want this",
            "start": 1351.92
        },
        {
            "text": "and don't chase the trend and don't try to just get that dollar uh continuing the story but um but in the end oh no let me start right here let me rewind back up says quote you may have heard some rumors things like an online Resident Evil or an open world Resident Evil, but we spent some time experiment or which we spent some time experimenting with, he said. But in the end, although we had some interesting concepts, we realized that it wasn't what fans wanted to see or play. So, we went back to the drawing board and created what led to res Resident Evil Reququum. See, the multiplayer part of this is interesting, but I think the open world party is even more interesting of like we experimented with with that as well because I remember having a conversation with Tim as far as what that could look like, especially coming off of Resident Evil Village. That village was designed kind of like a theme park because you would go to like one area and it's the castle with Lady Demetric and the",
            "start": 1393.76
        },
        {
            "text": "look like, especially coming off of Resident Evil Village. That village was designed kind of like a theme park because you would go to like one area and it's the castle with Lady Demetric and the hot vampire ladies and then you would go somewhere else and it's like, \"Oh, now here's this [ __ ] [ __ ] up house with a [ __ ] fetus.\" Yeah. And it's like I kind of like the Resident Evil Village being this collection of different types of horror and like you have these like distinct villains kind of carrying that. Almost reminds me a bit of how like Middle Gear Solid 3 would be a little bit not necessarily with the areas but with like the villain kind of things like thematic. Yeah.",
            "start": 1431.68
        },
        {
            "text": "Yeah. Yeah. Like building a theme as you're going and then also having a cast of characters that can hold up. Even though I think at the end of the day, Lady Demetrius was the most um standout gone way too soon, right?\n But I would have been so down with the idea of all right, what if we did a Resident Evil Village kind of thing where we did the different areas with different like bosses or different characters that like reside there and had it be a you can go you can you can choose the order. You're just collecting these keys so you can unlock the final thing, but you can choose to go after the lady demonry castle first or you can go to the werewolf area first or you can go to the baby first, right? Like",
            "start": 1471.92
        },
        {
            "text": "I like when games do that. Like I think that automatically creates like this player freedom, especially if you then tie that to abilities or items or upgrades where it is the Mega Man thing of all right, I got the fire attack, which I know is going to do well against the leaf guy or whatever. I I think that stuff is so inspired, but I also know that that stuff is harder to make and manage and like automatically the further you go into that, the more you're changing the game into something different potentially. So, I like that they're looking at Resident Evil as a type of franchise that like you can be malleable with and like think about in different ways and maybe experiment differently. The word malleable.\n All right. I know. I felt good about pulling that.\n Really good. Yeah. Um, but I also like that even though they experimented with that stuff, at the end of the day, they looked at it and went, \"Our we know what our fans want, right?",
            "start": 1510.96
        },
        {
            "text": "Really good. Yeah. Um, but I also like that even though they experimented with that stuff, at the end of the day, they looked at it and went, \"Our we know what our fans want, right?\n We're gonna give you something a bit more traditional.\" Again,\n I think the concept of introducing an open world to this kind of like I I understand where you're coming from. I think I when I think of that it's more of a open roam if anything like you know free roam a freedom of player choice go you know making whatever decisions you want and going whatever direction you want but\n I can't not think of something like Assassin's Creed or Ghost Sushima or something like that when I think of open of open world I think if anything the more interesting stuff that would come from an open world Resident Evil game would be optional missable things Not to say that there aren't missable things in Resident Evil, but\n um",
            "start": 1551.12
        },
        {
            "text": "um\n I mean I just it's that seems like such a hard thing to tackle. Um especially because I think of most open world design is enemy encampment, go clear it out and take control or whatever of it. I'm not saying that that's what you would do in a Resident Evil game, but like the the the drawbacks there seem like they would be I think too aggressive that like if you were to just completely move the franchise in that direction.",
            "start": 1602.4
        },
        {
            "text": "It almost turns into a different thing cuz yeah, I when I'm thinking of it, I am thinking of more like an open open zone kind of thing. But if we're talking true open world, then you have to start to think about what Resident Evil is and like how that works. Then a lot of Resident Evil is finding key items and solving puzzles, which like I think the puzzle aspect could work pretty cool, like in a pretty cool way in an open world. But at the same time, I start to think about the frustration of like finding a door and then being like, \"Ah, [ __ ] I can't open this door without a chainsaw and not knowing what like now we're in an open world where like in a in a like somewhat linearish game like, okay, cool. I'm going to find the chainsaw eventually.\" Like this is a Metroid Vania kind of design here. Like I'm going to find it. I'm going to come back. when you get the thing in an open world where it is, a [ __ ] I need the chainsaw here. I need a specific key here, man. I need the hammer",
            "start": 1632.8
        },
        {
            "text": "here. Like I'm going to find it. I'm going to come back. when you get the thing in an open world where it is, a [ __ ] I need the chainsaw here. I need a specific key here, man. I need the hammer over here. Like, then you're talking about a thing that might piss me the [ __ ] off.",
            "start": 1672.24
        },
        {
            "text": "Oh, yeah. But I'm not finding the items that I want to.\n Reminds me of the the Elder Ring Deniers, you know, the give us the classic prompt, Tears of the Kingdom, Breath of the Wild. Give me the give me those classic dungeons instead of just having me wander around around all over the place because if you make this game open world, Tim won't play it. You know what I the idea the idea of like the idea of Resident Evil like Resident Evil open world with dungeons that are just straight up Resident Evil traditional stuff. I keep going back and forth on this cuz on one hand I'm like I don't know like I don't I don't know that's going to work. But on the other hand I'm like there could be something genius there. But\n you riding on a bicycle or a motorcycle? How you getting around\n in Resident Evil? It depends on the character.",
            "start": 1683.76
        },
        {
            "text": "you riding on a bicycle or a motorcycle? How you getting around\n in Resident Evil? It depends on the character.\n Glider. Yeah. At some point you have to be flying around. If I'm If I'm uh Leon, I'll be on a bicycle. But if I'm What was the name of the dude from Village? [ __ ] lame ass. He's on\n bicycle or motorcycle. I can't picture But I can't picture Leon on a bicycle.\n No. No. Leon's on a motorcycle.\n Okay, so you meant motorcycle.\n Motorcycle. Yeah. Wait, did I say bicycle?\n You said Leon on a bicycle.\n Sorry. Leon on a motorcycle. A little horn. Um and then um what was the name of dude from Village that was like that kept losing his hand? Um and Ethan Winters.\n Ethan Winters. He's on a [ __ ] like Segue or some lame [ __ ] Yeah.\n I'm sorry, Segue owners.\n Yeah. Yeah. Yeah.\n That was mean. I'm sorry. That guy sucks, dude.\n I hate Ethan.\n Um, story number three. Continuing with the Capcom theme. This comes from um, brand new here, Andy Robinson of EGC.\n Oh, never heard of him.",
            "start": 1718.64
        },
        {
            "text": "Oh, never heard of him.\n Happy to see you again, Andy Robinson. Capcom reveals Pragmata's unique puzzle shooting gameplay in a new video. Capcom has premiered the first gameplay for the sci-fi game Pragmata. Video shown during the live stream event on Thursday offered the first public look at the game's puzzle shooting gameplay, which is players hacking robots via a puzzle miniame while simultaneously dodging and shooting them. BGC recently played Pragmata at a media preview event and shared our impressions of the game. Quote, Pragmata's short demo felt unique, polished, and left us wanting more. We wrote, \"There are question marks about how its ideas will shake out across an experience likely in excess of tens of hours. But with Capcom's unblenmished modern track record, you'd be hard pushed not to have faith in or not to have faith that it would follow through on its ideas. You know, this motherfucker's name is Hugh Williams. The dude?\n Yeah. His name is Hugh Williams. I",
            "start": 1773.92
        },
        {
            "text": "Yeah. His name is Hugh Williams. I\n I don't want to be playing as a Hugh Williams. You know what I mean?\n I don't want to be Gabe Logan. I don't want to be Ethan Winters. I don't want to be uh what's his face from Watchd Dogs? The first guy. Aiden Pierce.\n Aiden Pierce. What would you What would you If you were to name this guy, what would you name him?\n [ __ ] Derek.\n Go with the Derek.\n Derek Spaceman.\n Maybe a Kojima ass name. M\n maybe, you know, maybe this is a a sort of a localization issue. Oh,\n where we go, hey, Japanese devs. Hugh Hugh Williams. Not a cool name. They're like, yeah, like they're they're over there. They're like, I don't know what what are white men name.\n Hugh Williams.\n Yeah. Yeah. Yeah. Yeah. cuz they're not wrong. I probably know a Hugh Williams out there.\n They went Yeah, they went with the um uh with the what's her face? The res the Resident Evil lady. I mean, that's a slip of the tongue. I meant to say the Harry Potter lady. Um\n Oh, um transphobic.",
            "start": 1824.64
        },
        {
            "text": "Oh, um transphobic.\n Yeah, they went with her line of like naming characters like Mexican character. And Harry Potter's like taco Mexican. Whatever the chain bolt or whatever. Hugh Williams. Not a cool name. I don't really want to be Hugh Williams, but I do want to play this game. Bless. Uh, dude, seeing this gameplay has me hyped. Like I I didn't get to listen to uh Greg's preview cuz that was another one I was out for. But I um he told me about like the hacking. He was like excited when he came back in the preview, so we just started talking about it. He was like, \"Yeah.\" And you would hack them and then they would activate and then you like start shooting at them. And like seeing it in action, I'm like, \"This is weird.\" But I like it. I don't know. And I like the design of like these enemies, these robots that you're fighting. It kind of gives me the vibe of",
            "start": 1883.68
        },
        {
            "text": "hell divers tapping on all the little buttons to call in your thing. And that's kind of like the the quick puzzle way to get around that. And it also reminds me of Near Automa, which you're not doing simultaneously, but when you do that little hacking thing and suddenly you're in a\n Oh, dude. I love\n a little like asteroid looking game. Yeah. Really, really neat. Super fascinating concept.\n This Have you seen people saying this is a Mega Man game? There are people that are like there's like they think that that there's a Mega Man secret tie-in\n with the I mean I could see this being a in a similar vein that the that Pac-Man sort of Metroid Vania is happening but people are looking at the energy tanks. They're looking at the little items that you pick up and on.",
            "start": 1928.72
        },
        {
            "text": "Oh wow. This came from today June 27th from Polygon. Pragmata is a secret Mega Man game. Claim fans dying for a new Mega Man game. Pragmata's long uh Pragmata Capcom's long delayed sci-fi action game blew us away yada yada yada. Um but since the first look footage and gameplay reports came out of SGF, a few creative thinkers have wondered if there's more under the surface of the game than Capcom is letting on. Mainly that it's a secret Mega Man game. Unfortunately, during a spotlight showcase on Thursday, Capcom did little to confirm or deny the theories. If Pragmata's young robo protagonist, Diana, is secretly connected to Dr. Light, Dr. WY and all the nonsense first introduced in the NES Mega Man from 1987. The studio is staying mum, but we did see plenty of new footage uh featuring Diana using her blue metal puffy coat uh that in fairness looks a lot like Mega Man's arm to hack robots for her surrogate dad with a gun. The playable astronaut Hugh. And she's got that sort of like",
            "start": 1974.08
        },
        {
            "text": "Diana using her blue metal puffy coat uh that in fairness looks a lot like Mega Man's arm to hack robots for her surrogate dad with a gun. The playable astronaut Hugh. And she's got that sort of like buster cannon looking arm. She's got uh Yeah. Like Okay. Like I'm not going to say like I didn't know it was this serious. Fury is that",
            "start": 2019.44
        },
        {
            "text": "I saw picture, you know, people were posting pictures of the items that you get in the world. If you remember the first trailer that they or not the first trailer, but the most recent one we saw where they're like before we knew that Pragmata was back and it was like energy tanks, AI and it's like showing the different items that these characters use in world and I saw\n yo that hold on can you go back to that that screen? I mean, she is giving the Mega Man that and I Here's the thing. I don't believe in this. I think this is an Easter egg. I think this is an Easter egg. Okay. Yeah,\n cuz that that is giving Mega Man.",
            "start": 2039.44
        },
        {
            "text": "It's You know what? It's It's like Smash Bros. Mega Man uh little What's that little toy you buy for Nintendo? Like amiibo. Yeah, it's it's kind of like that same post. I I didn't think it was this serious enough for Polygon to have a write up on it, you know? I mean, they go on to say theories that Pragmata was Capcom's AAA attempt at a Mega Man revival took off in forums and conspiracy tinged YouTube videos shortly after SGF. The evidence at the time was tenuous. Diana's design was the big tell as well as the Mega Man connection to the mo to to the moon and sentient robot viruses. The early mission of Pragmata finds Diana and Hugh outrunning rogue bots rogue bots uh in a lunar base, maybe a Sigma connection. Others wonder if Pragmata's obligatory evil sci-fi conglomerate that ruined everything, the Deli Corporation, was a tip off. Deli or Delelfi was the home of the Oracle and was dedicated to Apollo, the god of, among other things, medicine and light. Oh, Dr. Light, what the",
            "start": 2077.68
        },
        {
            "text": "everything, the Deli Corporation, was a tip off. Deli or Delelfi was the home of the Oracle and was dedicated to Apollo, the god of, among other things, medicine and light. Oh, Dr. Light, what the [ __ ] No. No. Okay. What What's your reaction when you start to play Pragmata and you take out the first boss fight and you then get that boss's ability? And then I get to see and then I get the map and it's like I you know I get to pick what the doctor shows up and he's like I am the light man. Look I this what you just read right now. This is it legitimizes it in a way you know not Polygon writes an article about",
            "start": 2120.96
        },
        {
            "text": "like here's the thing. It's like\n I didn't believe it until I saw that clip of the the screen of the girl with you doing the Mega Man pose. You can read a bunch of stories about, you know, people talking about a, you know, UFOs and all sorts [ __ ] but then if Forbes writes a write up on it, you're like, \"Oh [ __ ] I should listen. I should pay attention to this.\" Um,\n this is I mean, the game looks great.\n I think I am way more pumped about this game than I was thinking about like when we just thought the game could have been dead cuz we didn't really know even know what the game was at the time. But it was really all of the reactions after that because again, Greg Miller, I love you and I'm sure you're listening somewhere right now and you're probably making signs for your parade. Um, but when you come back and say that like Pragmata, when Greg Miller comes back and says that Pragmata is a game you got to really watch for, I'm like, oh man, maybe it's not,",
            "start": 2168.16
        },
        {
            "text": "you know, we don't have the same taste when it comes to action games is what I'm saying. Like I have a certain taste when it comes to third person shooters, but then everybody started raving about Pragmat. I'm like, \"Oh [ __ ] Greg was right.\"\n Yeah. That's in a Broken Clock is right twice a day.\n Everybody loved Pragmata at this pre preview event. Yeah.\n And\n Capcom don't really miss, dude. Even when they miss, it's like, \"Oh, it was okay.\" You know what I mean? Like when they miss, it's the dinosaur Exoprimal, which was pretty fun, actually.\n I don't even think that missed, man.\n Like, it came and went.\n I think it's just a bad time for it, you know?\n Yeah. But like that game was fun if we're being real. Kunitugami came out and that was fun. Gizugami was like solid eight runaway successes, but it's like all right, like they still cooked. Even when they don't cook, they cook. Yeah. Damn.\n They're like that artist that just can't release a bad album no matter how hard they try.",
            "start": 2214.32
        },
        {
            "text": "They're like that artist that just can't release a bad album no matter how hard they try.\n Yeah. Damn. I'm pretty pumped for Pacmada. Um, except for the reverse like multi multiplayer Resident Evils. That's when they're just like that's when they're completely outside of their bag.\n Right. Right. Right. Pretty pumped about uh getting the rest of these news stories. Bus.\n Yeah. But we'll have to hear about them later after a word from our sponsors.",
            "start": 2261.28
        },
        {
            "text": "This episode's brought to you by Cash App. We've all had those moments getting meals out with people that always end in some kind of awkward experience of having to figure out the least complicated way to just get it done. Or even after figuring it out, have you used an app and ended up having to wait days for your money to finally show up? What if we could solve all of that easily? Cash App is a completely different experience. Fast, easy, and safe. and a great way to receive and transfer money to family and friends. It's incredibly easy to set up. You just enter your phone or email and some other basic information. No bank account needed and then there's no waiting around for days. It's your money. You shouldn't have to wait. We love using Cash App because it's fast, it's safe, and it just makes life way less stressful. For a limited time only, new Cash App users can use our exclusive code to earn some additional cash. For real, there's no catch. Just download Cash App and sign up.",
            "start": 2285.2
        },
        {
            "text": "makes life way less stressful. For a limited time only, new Cash App users can use our exclusive code to earn some additional cash. For real, there's no catch. Just download Cash App and sign up. Use our exclusive referral code kind of funny in your profile. Send $5 to a friend within 14 days and you'll get $10 dropped right into your account. Terms apply. That's money. That's cash app. This episode is brought to you by Mood. Let me tell you about the online cannabis company that's revolutionizing how we deal with life's challenges. From sleepless nights to stressfilled days, mood.com has created an entire line of functional gummies that target specific health concerns with 100% federally legal THC blends. They'll deliver them discreetly right to your doorstep. And you can get 20% off your first order at mood.com with promo code kind of funny. I've been having a great time trying out all their different gummies. And I'm loving how each one feels. Their sleepy time gummies will knock",
            "start": 2328.08
        },
        {
            "text": "first order at mood.com with promo code kind of funny. I've been having a great time trying out all their different gummies. And I'm loving how each one feels. Their sleepy time gummies will knock you out in about 15 minutes flat. No hangovers, no groggginess, and their epic euphoria gummies are perfect for those days when nothing's going right. And best of all, not only does Mood stand behind everything with an industry-leading 100-day satisfaction guarantee, but as I mentioned, listeners get 20% off their first order with code kind of funny. So, head to mood.com, browse their amazing selection of functional gummies and find the perfect gummy for whatever you are dealing with. And remember to use promo code kind of funny at checkout to save 20% on your first order. Have a super chat from Resolute. Thank you for your super chat, Resolute. is my nephew's name is William Hugh. That's [ __ ] incredible.",
            "start": 2372.88
        },
        {
            "text": "I'm sorry about that.\n That's [ __ ] incredible. Listen, I I'm not here to tell you that Hugh Williams is a bad because I don't think he's a bad name. I'm just like, if you're a cool Capcom protagonist who's a spaceman in outer space,\n why is why is he named Hugh William?\n Why is his name not Reic or [ __ ]\n Yeah, you know what I mean? I think I said that because you said Derek and I just rewritt the letters to make it cooler.\n Reic Stone.\n Oh [ __ ]\n Re Stone. Man, come on.\n They got to consult you. Let me name your character.\n They got to consult you.\n That's definitely a porn star.\n Uh, we got Look up Reic Stone real quick. Vin Archiver.\n Whoa, that's a Is that a He's a wrestler. Riddic Stone.\n Rick Stone.\n Oh,\n I never heard of this guy.\n Never heard of him. We have a super chat from Vin Vin Archiver who says, \"We need Bless to play Overture so that it can be on the game of the year list.\"\n Overture. Oh, Liza P. Overture.",
            "start": 2424.32
        },
        {
            "text": "Never heard of him. We have a super chat from Vin Vin Archiver who says, \"We need Bless to play Overture so that it can be on the game of the year list.\"\n Overture. Oh, Liza P. Overture.\n Bro, I'll be honest. I don't think it's going to get on the game of the year list even if I play it cuz like wait, even if it's not going to be my top four, I don't think my top four is kind of locked right now, dude. It's going to be tough to penetrate right now. I don't know why I said it like that, but like it's going to be tough.\n I just wish, you know, this doesn't include you. I just wish more people were gamers here. Listen, you know I'm a gamer. You know, you know I'm a gamer and I'm going to get around to it. I think I'm going to get around to it. It's just a You said it. It's a busy time.\n You can't say I'm going to I think I'm going to get around to it.\n Busy time.\n I just started playing Tropical Freeze.\n Oh, sick.\n I did. Yeah. Is\n it good?",
            "start": 2471.44
        },
        {
            "text": "You can't say I'm going to I think I'm going to get around to it.\n Busy time.\n I just started playing Tropical Freeze.\n Oh, sick.\n I did. Yeah. Is\n it good?\n Yeah. I've I'm only one level in, but so far I'm pretty blown away. It's pretty good.\n One level in. How long did you play\n per Tropical Freeze? Yeah. I literally I played before bed last night. I was gonna play more. Um, like literally I like settled into bed at like it was like 800 PM. I had my Switch in my hand. I was like, \"All right, we're finally gonna play Tropical Freeze.\" And then I get a um a Discord notification from AS. He's like, \"Rematch.\" And I I took the covers off. I was like, \"I'm sorry. Get",
            "start": 2512.0
        },
        {
            "text": "the [ __ ] out of here.\" Threw my Switch like a Frisbee across the room. [ __ ] that [ __ ] I'm playing some rematch. Uh we have a super chat uh $20 super chat very generous from science dog official says it's so funny to me how cyclical the gaming space is. Remember during the PS3 and 360 era how every game had to also have multiplayer mode shoehorned in. Same thing happening now. Compelling nar narratives are still king thousand%. That's where I'm that's where I'm at whenever we talk about will that game ever will that next game be me be remembered forever? What if they came out with a sequel to this one franchise and it just it was so forgettable? I'm like, dude, gameplay to me, if you come out with something that's so it iterative gameplay-wise, but the the story hooks are the most mind-blowing stuff ever, then I you will remember those story hooks. You will remember those big twists that just had your mind blown. It's most of my the games that I look back on fondly are like",
            "start": 2545.36
        },
        {
            "text": "mind-blowing stuff ever, then I you will remember those story hooks. You will remember those big twists that just had your mind blown. It's most of my the games that I look back on fondly are like Outer Wilds.",
            "start": 2593.12
        },
        {
            "text": "Yeah.\n Or [ __ ] Detroit. I was thinking about Detroit becoming human this last week and I was like, man, I understand why people are so harsh on it, but also I [ __ ] with Detroit, dude. I just like making good I just like making choices in a [ __ ] branching narrative. Here's what I I think you just sparked something in my brain\n and I want to test this. theory out.\n Okay.\n All right. Let's all go home. We're all going to test this and come back with our findings.\n Okay.\n Homework for everybody.\n Homework for everybody. Game play keeps me in right now.\n Story keeps me in forever. All right. Think about that. Gameplay makes me a fan of your game in the moment. I'm not going to stop playing it if your gameplay is [ __ ] unlocked. Story is what makes me think about that game forever.",
            "start": 2609.04
        },
        {
            "text": "Damn, that's so good. think about that cuz we're look we're at a place right now where it's I feel like games with fun compelling gameplay are kind of a dime a dozen. We're getting a lot of really fun good mechanically fun games to play\n for sure. And when I think back to whenever people give me, you know, [ __ ] about Love and Ghosts of Sushima so much and putting it over The Last of Us is like my favorite of that game that came out that year. It's like, you know, for me, it's also just like feeling like complete [ __ ] the whole time I'm playing The Last of Us Part Two. Like even though I love the video game, I just it's not a it's not fun or anything like that. But I think back to the really heartwarming story moment in Ghosts of Sushima. Yeah,",
            "start": 2654.16
        },
        {
            "text": "the the those the the character stabs you in the back and you're just like, \"What the [ __ ] I wasn't expecting.\" Like I Anytime a game can do that to me, those are the ones that burrow their ways, you know, themselves into my brain and this brain is constantly just forgetting everything. I forgot what an amiibo was earlier.\n It's the way that like death or not death ring. I don't know why I got distracted with the brain. Um NBA Street Volume 2, very different game.\n Great story beats. NBA Street Volume 2 is maybe possibly the most fun I've ever had playing a video game. I don't think it gets more fun than NBA Street Volume 2. I'm not even being I'm being dead ass. Dead ass game play. If you could mathematically and scientifically break it down. A game doesn't get more fun than NBA Street. I don't disagree.\n A game doesn't\n I think you're right.",
            "start": 2703.52
        },
        {
            "text": "A game doesn't\n I think you're right.\n A game doesn't get more fun than NBA Street Volume 2. Nothing. Nothing. The only thing that can make NBA Street Volume 2 more fun is if they added a rog like B. They're not going to do that. A game doesn't get more fun than NBA.\n I got I got the women's basketball. It's smaller, but it shoots further or whatever.\n Um, however, Last of Us is still higher on my like game of all time list and it's nar it's story, it's narrative, and it's like I think NBA Street Volume 2 is a funner game and the gameplay I think is is more solid and and I would say better.\n Yeah. But like Last of Us, it has a good gameplay and then also has a [ __ ] story that keeps me in. I think about it. I think about the opening.\n Damn, dude. He's so right now. He's so right right now.\n Burnout 3. Yeah, Burnout 3 I would say is on that level, too.\n We can make a list of games. We're getting along.\n Returnal.",
            "start": 2750.0
        },
        {
            "text": "Damn, dude. He's so right now. He's so right right now.\n Burnout 3. Yeah, Burnout 3 I would say is on that level, too.\n We can make a list of games. We're getting along.\n Returnal.\n Yeah, Returnal's on there, too. Returnal also has a story, but I feel like the story of Returnal doesn't didn't have as much like\n it didn't have as much impact, but in that moment, I was like, \"Wow, this is actually pretty cool.\" Yeah. You know, I wasn't really vibing with what you were doing earlier.\n Um,\n DJ Kent with a $5 super chat says, \"Andy, be honest. Would you rather have to watch all the Resident Evil movies in a row or have to play Resident Evil Reququum for the same amount of time?\" Uh, [Music] I'd rather play the G because it's a lot of movies. It's a lot of time. Averaging 145, you got to assume.\n Yeah, let's say an hour. Like if if Resident Evil the game reckon is like a 20our game.\n A [ __ ] Damn.\n 20 hours with the Resident Evil.",
            "start": 2794.72
        },
        {
            "text": "Yeah, let's say an hour. Like if if Resident Evil the game reckon is like a 20our game.\n A [ __ ] Damn.\n 20 hours with the Resident Evil.\n I mean, I could fall asleep during the movies, you know. I can't fall asleep during the gameplay. That's fair.\n Um, story number four. 50 Cent is officially in the Street Fighter movie club playing Balrog. This comes from Connor Mar at Eurogamer. I'm pause here. All y'all were tagging me in the [ __ ] Sonic is in Magic. Why? Y'all need to tag me in [ __ ] like this, dog. Come on, learn me.\n Learn who I am.\n Learn who I am. NBA [ __ ] that gets me [ __ ] excited.\n The most fun a game can be. Rapper and entrepreneur 50 Cent has been cast in the upcoming Street Fighter movie as Ballrog. The news comes as a spree of other casting announcements for Legendary Pictures fighting game adaptation. Uh are officially announced in the leadup to the 2026 film. This includes Kina Leang as Chun Lee and Andrew Andrew Schultz. No.\n Like the comedian guy?",
            "start": 2840.08
        },
        {
            "text": "Like the comedian guy?\n No. Wait. No. As Dan Hibiki. What?\n No. I didn't know that.\n I didn't know that either. Yeah. It's that Andrew Schultz. Oh, man.\n Yuck.\n That's tough.\n I mean, Dan is the meme character.\n Sure. Yeah. Yeah. Yeah.\n So, it makes sense.\n That is true. That is true.\n Oh, that's not all. Jason Mimoa said to play as Blanca, confforming uh confirming reports that he was being eyed for the role. The Hollywood Reporter has also confirmed Noah Centineo as Ken, WWE superstar Roman Reigns as Akuma, martial artist actor Andrew Koji as the lead character Ryu,\n and Orville Pek also joins them as Vega. Noah Noah Santo.\n Yeah. Oh, Joey loves this dude.\n I mean, he was in all the\n and all the from all the all the boys.\n Yeah. I don't see him as a kid. Like, not even close.\n Okay, but here's the thing. Here's the thing.\n Uhhuh.\n Anytime I'd see this Noah Centennial, I'm like, I don't get it. I just don't get it. I don't get all the love. I don't get all the adoration.",
            "start": 2898.08
        },
        {
            "text": "Okay, but here's the thing. Here's the thing.\n Uhhuh.\n Anytime I'd see this Noah Centennial, I'm like, I don't get it. I just don't get it. I don't get all the love. I don't get all the adoration.\n And then I saw a really bad movie that was um The Rock starring as uh what what Black Adam.\n Yeah. Is he that\n Noah Dao was one of like the side heroes in that movie. I'm like this dude rocks.\n Really?\n This dude rocks.\n Great line delivery, charming.\n Wow.\n Like you know just uh fun and you know easily easy to like on screen. I don't know if I see him as Ken. But",
            "start": 2952.96
        },
        {
            "text": "Really?\n This dude rocks.\n Great line delivery, charming.\n Wow.\n Like you know just uh fun and you know easily easy to like on screen. I don't know if I see him as Ken. But\n you know what? Here's the thing. To All the Boys, I feel like came out maybe like eight years ago or something. He came out a while ago. So maybe I'm judging based off of him as a kid versus who he is as an adult. Cuz like in some of these pictures, he does look a little bit more built. I'm thinking of like when he was portraying high school or something. Yeah. Yeah. Yeah. I I I don't know. I liked his I I think he's affable. He's a likable dude.\n Okay.\n Yeah.\n I'll let it slide.\n Damn. Angie Schultz is Dan. That's tough. That's real tough, man. But like, hey, 50 Cent is ball rock. I [ __ ] with it.\n Yeah.\n You put some boxing mittens. What they call them? Boxing gloves. Mittens. Keep warm.",
            "start": 2976.96
        },
        {
            "text": "Yeah.\n You put some boxing mittens. What they call them? Boxing gloves. Mittens. Keep warm.\n While you're in the ring. My hands are too cold. You got to keep warm while you're in the ring. You do. You got to keep warm. Story number five. Sonic the Hedgehog is crossing over with Magic the Gathering. This is the press release. Sonic and all his friends and some enemies are coming to Magic the Gathering with Secret Layers. Sonic Super Drop. The Super Speedy Hedgehog has captivated fans for decades. Now he's racing from the Green Hill Zone to your Magic Decks in three brand new secret layer drops featuring iconic items, adorable artwork, and new to Magic cards. Uh, and new to Magic cards. This super drop has it all. New to Magic cards,\n like cards that aren't already in Magic. So, a lot of the secret layer stuff is like recreations of Magic cards that exist.",
            "start": 3018.32
        },
        {
            "text": "like cards that aren't already in Magic. So, a lot of the secret layer stuff is like recreations of Magic cards that exist.\n Gotcha. The secret layer uh cross Sonic friends and foes drops includes seven new to Magic cards. These cards are legal. You can't have illegal and legal cards. No, that's that's how it works. That's how it works.\n Ridiculous.\n Like some cards are too powerful and they don't fit in with the meta and like they ruin the whole game. So, you got to keep them legal or illegal. The Sonic cards are legal.\n Do not have these cards on you when you try to cross into America. Like the TSA.\n If we catch you in the airport with the Sonic cards, you're [ __ ] done. prison, dude. Um, the car these cards are legal in Commander, Legacy, and Vintage. Non-foil versions of this drop will be speeding into WPN Game Source for purchase on August 21. Blessing, what's the card that really has you going? Oo, wait.",
            "start": 3065.12
        },
        {
            "text": "Oh, you know what? I haven't actually like really taken a like a strong look, but as I'm looking right now. And how do you feel about the art?\n I really like the art. I think the art's fantastic. I Oh, I like when they let the artist get creative. Like, here's the thing. I would Shadow I always love I think Shadow is the coolest Sonic character. You know what I mean?\n I wish a new game doesn't get funner than NBA Street. A video game character doesn't get cool the Hedgehog. I wish Here's the thing. I wish Greg brought Ben and I I just could have this convers conversation with Ben so we can talk about the coolest Sonic character.\n Look, here's what I'll say right now. From just from my mind's eye, um, Shadow deserves more.\n Oh, I agree. Because I like the look of the Sonic card, the lighting, the coloring,\n the something about the Shadow one. I just don't like the art on it.\n And I'm sorry to the artist if you're watching this right now.",
            "start": 3115.04
        },
        {
            "text": "the something about the Shadow one. I just don't like the art on it.\n And I'm sorry to the artist if you're watching this right now.\n Here's the thing. Uh, Kevin, if you scroll down to the soul ring card.\n So, the soul ring is tell me all about a card that you should have in every commander deck. It is\n If I show up to a tournament without this, people be like, \"This [ __ ] idiot.\"\n Yeah. Like, he ain't really playing the game. He's not really playing the game. If you're playing commander, you got to have a soul ring. It's a way. It's basically a way for you to tap for an extra mana, which mana is like the resource that you're playing um that you're using in magic to kind of to play cards. Um so, you want a soul ring in every deck. I love this. This design is [ __ ] sick for a soul ring. Sick as hell.",
            "start": 3161.44
        },
        {
            "text": "Yeah. So, I'm going to say this. This is my favorite one. And if you're an audio listener, it's basically Sonic and he has like he has a ring around him, but it's like multicolored, I guess. Yeah, it's multi a multicolored ring around him. Um, it looks [ __ ] cool.\n I I look at that card and if I saw that on somebody's shirt, I go, that's a really sick ass shirt.\n Yeah,",
            "start": 3204.16
        },
        {
            "text": "it's a good looking design. I think I think the all of them look great. I'm just I'm shocked by how unexited I am by the shadow card. And I think it's something about just the lighting, maybe the line work on it. And that's that's where I come come back where I'm like Shadow is the coolest Sonic character, but I I agree with you that I think in this he deserves better, right? Like I want I want y'all to get creative cuz this soul ring card is creative art. If you go back to the Shadow one, like it's good quality. I don't want to I'm not [ __ ] on the artist here. I think they did a great job, but I would have loved to see them go a little bit more outside the box with the with the shadow one. That said, I also like the cards where you have um characters doing more things because for a Sonic card or shadow card or a Tales card or Amy Rose or whatever, you want it to best represent the character. Like, hey, this is Sonic front and center doing whatever. I love uh the one that has like",
            "start": 3221.36
        },
        {
            "text": "card or shadow card or a Tales card or Amy Rose or whatever, you want it to best represent the character. Like, hey, this is Sonic front and center doing whatever. I love uh the one that has like uh Tails and Sonic on the plane. What is this? Tornado Sonic's uh biplane, right? Like, and it's, you know, Sonic perched on Tails plane. Like, I think that's [ __ ] cool. Um so, give me more [ __ ] like that.",
            "start": 3260.88
        },
        {
            "text": "I'm excited for this. I'm [ __ ] I'm really like jokes aside, genuinely I'm so happy for the Magic crossover stuff and like seeing it hit different different fan bases, seeing Tim get excited for seeing the Final Fantasy one. They announced the Avatar one coming out later in the year. Avatar the Last Air Bender, not the Blue People Avatar um that'd be wearing t-shirts from TJ Maxx and [ __ ] That's tough.\n But I have friends that are like super Avatar uh fans and that's going to get them to learn. Sonic obviously appeals to me and I'm like, \"Oh yeah, I'm gonna get these cards.\" I my friend Megan text me this morning. She was like it was one of those things where she was like, \"Hey, this is g be hard to get. So, what I need you to do is hit up our friend Lexi.\" Lexi is like she's the person. She's like the what do they call him? The guy at the computer or whatever. Like",
            "start": 3283.2
        },
        {
            "text": "Oh, guy in the chair. The guy in the chair. Lexi for Magic is our gal in the chair. Like she's locked in on the market. She does a lot of like reselling and like she is making money off of selling Magic cards. Like she's kind of she's doing the forbidden [ __ ] I might had to hit up Lexi be like, \"Yo, help me get these. Help me get these Sonic cards.\" So, I'll report back. Lucid Dream asked the question that I've always think about. What's the IP crossover that gets you to buy Magic cards? I mean, it's From Soft.\n I think it'll happen.\n There's It's It's\n before the end of next year, you're going to get an Elder Ring crossover or some a FromSoft crossover. And that's not saying that I would play because you and I got to uh do a little type of like event recently and we were talking to people a lot of people there who played Magic. Mhm.\n And I my whole thought with Magic is I just don't need another thing.",
            "start": 3326.16
        },
        {
            "text": "And I my whole thought with Magic is I just don't need another thing.\n I don't have time to do the things that I want. you know, that like the amount of times that\n I want to just sit down in the bean bag chair and and continue watching andor it's like, dude, it there's I'm mining aluminum right now. The the two worst things that happened in my lifestyle in the last year are getting into magic and getting back into wrestling cuz one, I just feel myself becoming more of a degenerate over time. But then two, two, it really is timeconuming where now every Monday and Friday I'm like going to my favorite Tik Tocker's page because he'll react to all the big moments from the last WWE like show. That way I don't have to watch the [ __ ] three hours Monday Night Raw. But it's that and then also it's like all right cool I got this new magic pack. Well I got to sleeve everything. I got to organize everything by color. I got to like it's just so it's timeconuming but I love it\n the whole thing.",
            "start": 3373.52
        },
        {
            "text": "the whole thing.\n I love it so much. Uh, do you all plan on picking up the Sonic cards? And what IP would get you into Sonic cards? Let us know in the super chats. We have uh the final story here. Well, this one we can turn into um a Wii News.\n Turn to a Wii news.\n Yeah. And then skip to story number seven, I think. Okay.\n Cuz story number seven is like some quick live reacts that I think would be cool to do.\n Oh, neat. Okay.\n Uh, story number seven. Three trailers we got to watch from the Arc System Works Showcase. Let's uh bring up these trailers if you can, Kevin. The first game is called Dear Me. Dear Me I Was. Dear Me I Was. This is a\n This isn't like a typo or somebody like, you know, having a joke during a sentence.\n That's the name of the game. It's It's a Greg Miller joint is the way I'll describe it.\n Oh, I saw you post this in the Slack.\n Yeah. Okay.\n I think Greg posted it himself in the Slack, actually.",
            "start": 3427.68
        },
        {
            "text": "That's the name of the game. It's It's a Greg Miller joint is the way I'll describe it.\n Oh, I saw you post this in the Slack.\n Yeah. Okay.\n I think Greg posted it himself in the Slack, actually.\n Oh, I saw somebody post like a Greg ass game, but I wasn't sure if it was\n No, it was Greg saying a Greg. That's funny.\n It was Greg wanting to let us know that there's a Greg ass game on.\n This looks very cute.\n Yeah. So, this is as Kevin's playing this the trailer. This is a game that's launching for Switch 2. Switch two. I assume exclusive because they only mention Switch 2 in the showcase. Fascinating. Um,\n you got to assume a lot of touch controls with this little uh pencil on screen.\n Yeah, that's actually a really good call out.",
            "start": 3462.64
        },
        {
            "text": "you got to assume a lot of touch controls with this little uh pencil on screen.\n Yeah, that's actually a really good call out.\n Beautiful handdrawn art for the audio listeners. Uh, it says here, \"Dear me, I was is an interactive adventure that lets you enjoy a story woven with beautiful visuals fusing the vibrant watercolor style of tau Kanasaki with rotoscoping technology.\" Yeah. And it launches this summer for a Switch, too. Um, I watched the Arc System Showcase last night when they announced this. Um, the whole time I I I was talking to Chad and I was like, \"Oh man, this is a a Greg ass game.\" And then afterwards they were like, \"Yeah, we made this game uh with with adult women in mind.\" And I was like, \"Whoa, why would you say that?\" That was a weird thing to say cuz now it's like, well, like I don't you don't I feel like",
            "start": 3490.48
        },
        {
            "text": "localization, you know? a local I think it was a localization thing, but then also it's like I understand that marketing wise, yeah, you're you're going to aim for specific demographics. That makes sense. But to say it out loud, I'm like I don't want to send this to Greg and have him feel weird like\n Greg known adult woman says Mad Rocks. That was such a funny line from the showcase. I was like, \"Oh, you didn't need to say that. People will just buy it if they want it.\"",
            "start": 3537.04
        },
        {
            "text": "Greg known adult woman says Mad Rocks. That was such a funny line from the showcase. I was like, \"Oh, you didn't need to say that. People will just buy it if they want it.\"\n Uh that looks really gorgeous. That's beautiful. Uh the second trailer is called Demon Night Fever. It's a new RPG and it'll launch in 2026. platforms were not announced from the developer. The concept of this game is to embrace being evil. Nikawa said during today's Arc System Works showcase, announcing the game, \"This game lets you wildly enjoy all sorts of wickedness. There is a game I made in the past which I'm going to overcome with this game.\" What? I need to figure out what game that was cuz Yeah, he said that and I was like, \"What are you trying to do?\" Like it sounds like he's trying to make he's trying to up his last game. Chad, if you know this developer, Nikawa uh from uh Arxis, let us know what he worked on before.",
            "start": 3549.12
        },
        {
            "text": "The another quote says, \"Now I will tell you the genre of this game, which is very, very long. Are you ready? Enemies, allies, kill, kill, kill. The more you die, the stronger you become. Raising simulation, speedrunning RPG.\" That last part is what got me.\n Sadly, there's not much gameplay at all in this uh in this teaser trailer. Uh, but it kind of like gives off what the style of it is, which like I think I forget how I described this. I said um like Undertale meets like Persona or um The World Ends With You.\n Okay. Yeah, I could definitely see that. I see a lot of Yeah, it's very visual novelish, very um uh freaking What's the game that Game Grumps is streaming right now, chat? Or has been playing recently? the the visual novel kind of freaky murderous one with the Oh, I know which one you're talking about. Um, don't tell me. It's the one that they talking about Danga. Dang it. I told you. Sorry. Thank you, chat. Thank you, chat.\n I deal [ __ ] Dang and Rompa.",
            "start": 3596.88
        },
        {
            "text": "I deal [ __ ] Dang and Rompa.\n Uh, so Nikiawa is a Japanese video game developer and executive known for creating the Disgaya series.\n Oh, so he's trying to one up Disgaya.\n Yeah, he joined Nepon Ichi Software in 1996. Yeah. So, it looks like he was talking about the Disgaya series.\n Cool. And finally, [Music] [Laughter] what the the final game uh from the showcase that Bless wanted to show off is Damon and Baby. I It looks cool.\n I So, we got to talk about this.\n Damon and Baby.\n It's an action game uh made by developers at Arc System Works. Of course, Arc does Arc Systems. Uh they do publishing and they do developing here. They're actually developing this game. Uh, it's the tale of a it's a tale of the demon king who was cursed to never be able to be uh to never be able to part from a human child. The journey to release the curse begins. More information to come. So, this is another one in the genre of big old guy with a little small kid on his back,",
            "start": 3654.64
        },
        {
            "text": "which we we've been getting a lot lately.\n We love that. We love that trope.",
            "start": 3717.04
        },
        {
            "text": "When they announced this, it was a very fascinating um sort of intro cuz this closed out the Arxis showcase and this is the one more thing. This was the one more thing and it they had the lead of the studio sit down and be like, \"Hey, we want to create a new pillar of a types of games that we make here at Arxis. Uh, and we want to like establish like sort of action games that are like mid-range and doing all that stuff.\" And when he said that, I was like, \"Oh, mid-range action games.\" And he went on to say like, \"Oh, you might be wondering why we're saying mid-range.\" Well, when we look at the AAA space of video games and we look at the indie space of video games, there are a lot of challenges that are associated with that. And so we want to create a space for our young developers to to essentially like be able to get more at bats and create something that might not be like as high risk as making like a big AAA thing. So like we want to establish essentially like\n so double A",
            "start": 3720.48
        },
        {
            "text": "so double A\n double I double A is how I how I think I would take it as he said mid-range. I look at this and I also think indie my brain but I think because Arcis is not\n I don't think they view themselves as an indie studio. So I understand why they would say that. It also reminds me of Capcom doing, you know, taking a swing with Kunitsami, like that sort of style game. So, it's lower profile, lower budget, smaller team, not going to be, like you mentioned, a massive risk, which is,\n you know, I feel like a lot of the gaming space is trying to go for the wins with the lowrisk uh sort of genres.",
            "start": 3768.08
        },
        {
            "text": "you know, I feel like a lot of the gaming space is trying to go for the wins with the lowrisk uh sort of genres.\n And it sounds like it's like one of the ones where they want to build up this pillar as we go, like maybe have these young developers start small and then get bigger and bigger and bigger. So really cool for them to for the way they framed it and like I believe in this. I think the game looks [ __ ] bizarre and so I'm curious to see how it hits for people. But I would also play that game. I think that game looks kind of neat. Damn, that pillar you mentioned so huge. Those pillars you're talking about big old pillar.\n So big. But if I want something smaller, say the tiniest news I need to know about, where would I go? You'd go to our last story, the Wii News Channel, where we cover all the small news items you need to know about.",
            "start": 3793.6
        },
        {
            "text": "Story number one. Uh let's uh drop back real quick. Uh, story number one is Riot Games opens the door to betting sponsorships in professional League of Legends and Valerant. Oh, [ __ ] Uh, this comes from Conor Mar at Eurogamer and uh, yeah, betting sponsorships are being introduced to tier one Valerant and League of Legends esports. Ride Games has revealed and I know there's got to be a lot of money in that and there's already a lot of, you know, shady [ __ ] happening anyway betting wise. Yeah, that's that's one of the things they mentioned is that they're essentially like, well, people are already doing it, so we're going to try to do it and maybe regulate it a little bit. Um, this is also I'll make this a required reading also, I guess. Like Conor Mar at Eurogamer has like a big uh article kind of explaining some of the details of it and like the things that they're saying about it, but they talk about how um let's see, they said this is something uh professional teams have been",
            "start": 3832.16
        },
        {
            "text": "kind of explaining some of the details of it and like the things that they're saying about it, but they talk about how um let's see, they said this is something uh professional teams have been asking for for a number of years. They then go on to explain that they know that sports betting is for everyone and that some fans have strong feelings about it and they respect that. Anytime you have to say I respect that, you're about to say some [ __ ] Uh and then they say however the reality is that betting activity already exists around our sport. Um and they also said that they wanted to establish guard rails around it. And so yeah, it's a weird one.",
            "start": 3876.56
        },
        {
            "text": "It's a it's definitely a weird one. Um because I've already seen, you know, this isn't anything that I've like done a deep dive into or anything, but I see because of the circles that I run in on on Twitter, just other people's tweets based on my algorithm cuz they know that I'm into Valerant and I see drama from, oh [ __ ] that you know, this player got released because of, you know, throwing a game or this team has been involved in throwing matches or whatever because of other betting scandals And yeah, this kind of feels like how how badly looked how how badly looked upon betting was back in the day with sports and now you can't watch an ESPN show without getting a betting commercial from DraftKings or from FanDuel or whatever. It's like getting out there in the open is good but also still not good. You know, you still worry about, you know, everything that kind of goes with betting. And I think introducing this in a way it's like",
            "start": 3909.04
        },
        {
            "text": "well if we just legalize marijuana then then there will be like less issues with it cuz we know it's not even really an issue but making this bedding uh legalized I don't know it opens up a lot of other problems I think.\n Yeah.\n What a tough thing to deal with.\n Yeah.\n [ __ ] I going to make them a lot of money. Hopefully that leads to less layoffs. Probably won't.\n No. Um, another Wii news, we got Super Mario Strikers is coming to Switch online. I saw this uh thing pop up yesterday and I was like, \"Wow, they really just put out the other Strikers game and just left it to die.\"\n They Yeah, they said, \"Fuck it.\" Like,\n we tried. Y'all been asking for this for decades. We'll just put we'll put out a [ __ ] one.\n Disney Speedtorm season 14 launching July 3rd. Still going.",
            "start": 3971.68
        },
        {
            "text": "They Yeah, they said, \"Fuck it.\" Like,\n we tried. Y'all been asking for this for decades. We'll just put we'll put out a [ __ ] one.\n Disney Speedtorm season 14 launching July 3rd. Still going.\n Damn. Good for them. Double Dragon Revive launches October 23rd on Xbox One and Series uh PS4, PS5, Nintendo Switch, and PC. Bubble Bobble Sugar Dungeons launches this winter on PS5, Nintendo Switch, and PC. And Sagot is coming to Street Fighter 6 on August 5th. Who's going to play Sagot in the movie? Oo, Tom Hardy. All I was thinking about the whole time, I'll be real with you, as we kept kept on going with the stories, I just wanted to keep on doing more castings.\n Dude, honestly, Street Fighter wise,\n I need I need to um bring that back up cuz I had I had that idea like a while ago of like, yo, there's a whole series of games casts we can do that are just casting all these video game movie adaptations that are happening.\n We're leaving money on the table.",
            "start": 4006.72
        },
        {
            "text": "We're leaving money on the table.\n Yeah, we sure are. Um, you're wrong. That was all for Weni news, by the way. You're wrong. uh says, \"Breaking news. Sonic and Magic the Gathering singular alert announced seven cars.\"\n Jesus Christ. Put me on my misery. That's big news, B. I don't know if you heard about it. Uh let's get to some super chats before we end the show. We got Madrock's $5 super chat. Thank you. Madrock says, \"Day two of the Sjam Slam 5. Here's the hop in on improvement from the players. Would be cool to see either Andy or Blessing join.\" I mean, I'm not the guy for that,\n dude. I would love Well, that's the That makes you the guy, huh? That makes you the guy cuz SJM Slam is professionals training like people who are not into fighting games. I'm not the guy.\n We got to Yeah, dude. I would love to get involved in Sage Jam Slam.\n I'm not the guy.\n Y'all tweet at Sage. Tell him to let us slam.\n Bless kind of funny.\n Bless wants to be in the slam.",
            "start": 4060.96
        },
        {
            "text": "We got to Yeah, dude. I would love to get involved in Sage Jam Slam.\n I'm not the guy.\n Y'all tweet at Sage. Tell him to let us slam.\n Bless kind of funny.\n Bless wants to be in the slam.\n Bless wants to be in the slam.\n Uh Uncle Death with a $5 super chat\n that uh you know being a little being a little rude towards blessing and his love for Wow. for Sonic and Magic.\n And I would say, Uncle Death, watch your back.\n Uncle Death says, \"Blessing blessing freaking over Magic and Sonic. It's a wonder this man is single. Lol.\"\n First of all, I feel like I went out of my way not to freak out. I feel like I tried not to freak out. Also, you don't know my dating status, right?\n You don't know. You don't know.\n Keep your [ __ ] mouth to yourself.\n Yeah, you don't know. Keep your mouth to yourself.",
            "start": 4107.52
        },
        {
            "text": "You don't know. You don't know.\n Keep your [ __ ] mouth to yourself.\n Yeah, you don't know. Keep your mouth to yourself.\n Keep your mouth to yourself. I don't know. I'm not going to clap back. D uh DJ Kento says Kent is a cocky rich pretty boy who thinks he's untouchable until he meets Ryu. Kind of perfect casting honestly. I don't know if it's perfect casting, but I still like Noah in\n Yeah. I don't know who else I would cast as Ken. Like nobody immediately comes to mind. Michael Gosling.\n Damn. Ryan Gosling. Ryan Gosling is Ken.\n Good.\n Oh my god. That's good. Although I don't know if I can see him with long blonde hair.\n No. Something about the long blonde hair is going to be really tough to pull off. And also like does he have like I wonder how much genuine fighting we're going to see in this cuz Ryan Gosling he's not like an action guy. He literally is Ken. That's actually perfect.\n He is Ken.\n I forgot when I said that.\n Yeah.",
            "start": 4147.84
        },
        {
            "text": "He is Ken.\n I forgot when I said that.\n Yeah.\n I knew there was some association. My brain was taking it.\n I just went with blonde hair and like cocky. Damn. That's wild. No, I'm talking about like long blonde hair though. Melissa. I don't like the blonde hair is like one thing, but it's we're going to have to see him with a mop. Unless they don't go with that look, but like\n I mean that right there. No, but like you know Ken's got necklength hair, you know.\n Well, here's the thing. Somebody else in chat said Zack Efron. I think that that's actually a slim dog. Zack Efron was fantastic in the studio. You watch the studio? It's a good show. He was in the studio. Like he was I only I only watched up to episode\n He was in a couple one episode, I believe.\n So I I I haven't gotten there yet. But he was also awesome in Ironclaw,\n which like is what I'm thinking of when I'm thinking of like Ryan um",
            "start": 4195.44
        },
        {
            "text": "He was in a couple one episode, I believe.\n So I I I haven't gotten there yet. But he was also awesome in Ironclaw,\n which like is what I'm thinking of when I'm thinking of like Ryan um\n uh Zack Efron. Um everybody, this has been kind of funny games daily. Each and every weekday, we run you through the nerdy news you need to know about live on YouTube, Twitch, and podcast services around the globe. If you love what we do, support us with the kind of funny membership on Patreon or YouTube to get all of our shows ad free. Watch us record them live and get a daily exclusive show. Enjoy the games cast next where they will be ranking the Cojima games. be a fun time. Going",
            "start": 4234.0
        },
        {
            "text": "be a fun time. And then after that, the big stream, the big Death Stranding 2 marathon stream. Join Roger and Mike for a fun time all damn weekend. You're going to be want to You're going to want to be tuned in for all of it to see all the crazy weird surprises. Uh until next time, it's been our pleasure to serve you. [Music]",
            "start": 4265.04
        }
    ]
}