{
    "id": 14328,
    "video_id": "zYUdDq_B97Y",
    "show_name": "In Review",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Andy Cortez"
    ],
    "title": "Superman III In Review - Every Superman Movie Reviewed & Ranked",
    "description": "Download Cash App Today: https://capl.onelink.me/vFut/7u0sm0fp #CashAppPod Sign up with our exclusive referral code KINDAFUNNY in your profile. Send $5 to a friend within 14 days, and you’ll get $10 dropped right into your account. Terms apply.\n\n*Referral Reward Disclaimer: As a Cash App partner, I may earn a commission when you sign up for a Cash App account.* #sponsored\n\nGo to https://mood.com and use code KINDAFUNNY to get 20% off your first order.\n\nThe Kinda Funny Membership gets you Ad-Free and Exclusive Shows: https://www.youtube.com/KindaFunnyGames/join\nhttp://www.patreon.com/KindaFunny \n\n00:00:00 - Start\n00:06:30 - Thoughts\n00:27:44 - Plot\n02:03:13 - RaGu BaGu\n02:06:06 - Rank\n\nSubscribe And Ring The Notification Bell: \nKinda Funny Games: http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nFollow Us:\nTwitter: http://www.twitter.com/KindaFunnyVids \nBluesky: https://bsky.app/profile/kindafunnyvids.bsky.social\nInstagram: http://instagram.com/KindaFunnyVids\nTikTok: https://www.tiktok.com/@kindafunnygames\nTwitch: http://www.twitch.tv/KindaFunnyGames\n\nMerch: http://www.kindafunny.com/store \n\nListen To Our Podcasts on Your Favorite Podcast Service:\nKinda Funny Games Daily: https://bit.ly/2T3Y3rS\nKinda Funny Gamescast: https://bit.ly/3wBgRwg\nThe Kinda Funny Podcast: https://bit.ly/3wA9GVo\nIn Review – Movies Ranked, Reviewed, & Recapped: https://bit.ly/2VAgdT7\n\nFollow The Kinda Funny Team:\nGreg Miller: https://twitter.com/GameOverGreggy\nTim Gettys: https://twitter.com/TimGettys\nNick Scarpino: https://twitter.com/Nick_Scarpino\nAndy Cortez: https://twitter.com/TheAndyCortez\nBlessing Adeoye: https://twitter.com/BlessingJr\nMike Howard: https://twitter.com/SnowBikeMike\nKevin Coello: https://twitter.com/KindaFunnyKevin\nJoey Noelle: https://twitter.com/joeynoelle\nBarrett Courtney: https://twitter.com/SadBoyBarrett\nRoger Pokorny: https://twitter.com/rogformer",
    "published_at": 1750975372,
    "duration": 7666,
    "transcript_chunks": [
        {
            "text": "[Music] What's up and welcome back to Kind of Funny Superman in Review. That's right, we are ranking, recapping, and reviewing every Superman movie. Of course, I'm your host Tim Gettys. I'm joined by Andy Cortez.\n Hello.\n Greg Miller.\n Hello.\n And Nick Scarpino.\n Up, up, and away.\n Up, up, and away. That's what they say. Everybody, how we doing today?\n Good. Yeah.\n Yeah. I can't wait to talk about this movie specifically to hear your perspective on this movie.\n I have so many thoughts about this movie. God damn. I don't think anybody could have prepared me for this one. This had a lot of chatter about four and like, \"Oh,\n do you know anything about it? Don't look into it. Just go.\n I don't know. Not anything.\" And uh yeah, getting into this one, I was like, \"What? could never in a million years have guessed this is what the third Superman that follows anywhere. But",
            "start": 0.47
        },
        {
            "text": "I don't know. Not anything.\" And uh yeah, getting into this one, I was like, \"What? could never in a million years have guessed this is what the third Superman that follows anywhere. But\n we'll get into all of that cuz yeah, of course, this is kind of funny in review. Each and every week we get together to rank, review, and recap different movie franchises. Right now, we are doing Superman. Uh next\n Superman week we will be doing Superman 4 and then the following week uh it'll be a twofor one situation going on. Uh, Jurassic World Rebirth is coming out next week, but because next week the worldies are are a big week for Greg. Please don't leave anything on my car. Like, don't drive to my house and leave a message.\n Vote the right way this time. Okay. Ever think about that, Eddie?\n It's just get on board and enjoy the dinosaur movies.\n Yeah.",
            "start": 51.44
        },
        {
            "text": "Vote the right way this time. Okay. Ever think about that, Eddie?\n It's just get on board and enjoy the dinosaur movies.\n Yeah.\n Oh, Tom Cruz hing off a plane. This is a [ __ ] dinosaur. I don't know if this count I don't I don't know if this if if uh under the threat of violence counts as election tampering, but I think it'll be fine. Yeah. Yeah. Yeah.\n Next week is the 4th of July, so our whole schedule's a little thrown off. Um so we're doing uh Superman 4, but even though Jurassic World Rebirth is coming out next week, we won't be reviewing it until the following Monday, which is the same week we are also reviewing James Gun Superman. So it'll be a very big week for\n Which one do you think will be better, Greg?\n It better [ __ ] be Superman. They're better [ __ ] than man. Super bad.",
            "start": 91.2
        },
        {
            "text": "Which one do you think will be better, Greg?\n It better [ __ ] be Superman. They're better [ __ ] than man. Super bad.\n I I know nothing. I've watched zero trailers for the new Jurassic. Are are expectations as low as they usually are? Are people like, \"Oh, this one might might not be that bad.\" Let me tell you this, Greg. Let me tell you this,\n please.\n Are the dinosaurs talking now?\n Not even not even the trailers are good.\n No.\n Yeah. I'm hoping it's a bit of a reversed effect happening because like\n I like I will never forget being you know I was at my at my first game studio and that first [ __ ] Jurassic World trailer drops and they have the the music the little piano thing and it's like oh my god dude this is back so exciting and everybody knows my thoughts on those movies but\n like man these trailers have not even\n been able to build hype to make me go ah but I you know I hope the movie's as good as the trailers.\n But you are a hater ass hater of dinosaurs.",
            "start": 130.32
        },
        {
            "text": "like man these trailers have not even\n been able to build hype to make me go ah but I you know I hope the movie's as good as the trailers.\n But you are a hater ass hater of dinosaurs.\n [ __ ] you, dude. You don't know what that is. I will say that the I am not nearly as down as they are on the trailers. Like I'm very into the cast and there's a couple couple action scenes that I'm like, I'm here for this. I'm not expecting anything too much, but I am expecting this to be better than any three of the world movies we've gotten so far.\n Really? Okay.\n Yeah. Just based on the cast and director.\n Shout out Ali. Haven't seen that guy in a decade. Really? Yeah.\n Blade.\n He's just been waiting for Blade.\n Wow.\n Yeah. So, we'll see. But anyway, that's a couple weeks away, everybody. We'll be doing Superman Returns the week after uh cuz our schedule's all messed up. And then we'll uh get into Fantastic 4 starting with the new one. And then we're going to do the whole",
            "start": 175.28
        },
        {
            "text": "It's time to be alive right now. Can you believe we're that close to Superman? We're that close to Fantastic 4.\n The new Fantastic 4, the final\n that close to my parade for being the champion.\n The final Fantastic 4 trailer dropped yesterday and I was like, I I have too much. I don't need to watch anymore. Of course, I watched it. It's [ __ ] good, you guys. It's like really good. Uh very exciting times all around. Greg was just mentioning this, but we have so much content coming up the next couple days,\n a big parade",
            "start": 222.0
        },
        {
            "text": "a big parade\n starting on Friday. Uh Mike and Roger are going to be playing Death Stranding 2, doing a literal marathon stream. They have a treadmill. Uh the further Roger walks in the game, the more Mike is going to walk in real life. You guys saw it a couple of months ago when they did Death Stranding one. Now they're playing the brand new game all weekend long. It's going to be a great time. And on Saturday, Greg Miller's throwing a parade to celebrate uh him being him. I won the championship, the three repeated for team blue in kind of funny game showdown. We will now walk the embarked era of San Francisco. Meet me outside the ferry building 10 a.m. on Saturday. We will walk up to square pie guys. We will take photos. We will have signs about Tim sucking. Uh and we'll have a great time. Tim is going to also be there. It's Pokemon Go day. It turns out he's going to become level 50. That's us.",
            "start": 244.0
        },
        {
            "text": "Huge deal, everybody. I'm about to hit level 50 on Saturday. Be there 10:00 a.m. San Francisco the ferry building. You'll see us. And if you don't, uh you can watch online twitch.tv. TV/kindfunname. Uh, the marathon stream of Death Stranding will be interrupted by them also watching Greg on Discord on his phone with a selfie stick. We'll see how\n many times do you get to have a championship parade in your life. You know what I mean?\n That's true.\n One, two, three.\n Three.\n Three Pete.\n You know, think about that, Tim.\n Tim,\n everybody think about that. Uh, today we're brought to you by our Patreon producers, Carl Jacobs, Omega Buster, James Hastings, and our super fantastic sponsors, Mood and Cash App. We're talking about Superman 3\n with a run time of two hours and 5 minutes. This came out on June 17th, 1983. Definitively an 80s movie. My god. Very much so. This movie starts, you're like, this is an 80s movie, not\n it felt older than the other ones.\n Really? Yeah.",
            "start": 289.52
        },
        {
            "text": "it felt older than the other ones.\n Really? Yeah.\n I think by putting itself in a definitive this is happening in this place in time, it feels old because Superman 1 and 2 kind of happened out of time in a way. You know what I mean? This one once again directed by uh Richard Lester uh who\n and this is 100% Lester.\n Yeah, 100% Lester.\n This is what you could have had for Superman 2 all the way. Uh music once again again by Ken Thorne. Uh adapting a lot of the John Williams score into his own style there. A budget of 39 million which is actually way less than the 54 million of two um the box office that is also significantly less. Uh 80 million is what was made here. Uh Superman 2 at 216 million. Quite the drop off here.\n You think word of mouth really spread like that\n back then? I guess so.\n There wasn't even Rotten Tomatoes or anything.\n Cisco Nebert out there.",
            "start": 341.36
        },
        {
            "text": "You think word of mouth really spread like that\n back then? I guess so.\n There wasn't even Rotten Tomatoes or anything.\n Cisco Nebert out there.\n I mean, there's trailers though, right? Andy Cortez, I want to start with you. What did you think of this one? This is your first time watching this.\n Yeah, first time watching this. Um, I I wanted to get into another Fender Bender.\n Was really hoping for\n Wow.\n another sort of whiplash incident.\n Sure. Sure. Um, dude, I I really hated this movie. I couldn't even enjoy it because it's bad. I was just like I regret not watching it on Company Time. I'll say that.\n Like, you know what I mean? I uh\n it felt like a really really long way too long episode of a Superman TV show.\n It just like it just felt like, oh, here's what's happening this week in the Superman show,",
            "start": 386.72
        },
        {
            "text": "it felt like a really really long way too long episode of a Superman TV show.\n It just like it just felt like, oh, here's what's happening this week in the Superman show,\n Bizaro. you know, like it it it just all sucked. All of it was just all so terrible. And uh I don't know, man. This Lester dude is he's just so into what he does and he's way too unapologetic about it. Like\n he should apologize.\n He really should.\n Greg,\n just got to be dead by just all the slapstick stuff in the beginning puts you puts you on a real bad foot already, you know? Like it just starts off real bad. Uh it and it really just felt like holy [ __ ] we got Richard Prior for a movie. I don't care what the script is, just do something like we got him for a movie, you know? Uh and yeah, it just it just all really really stunk. Was not a fan. And already I'm like, dude, this may this is already on pace for the worst in review series for me.\n Wow.\n We're like my least favorite interview series.",
            "start": 425.28
        },
        {
            "text": "Wow.\n We're like my least favorite interview series.\n The first No [ __ ]\n We can get him. We can't\n we got to back channel this right now.\n There are some of my my least favorite interview series where I go, \"Yeah, but you know, the first one started off really really great.\" And this one I just didn't have those touchstones to watching this as a kid. So watching it for the first time as a 37year-old being like I just didn't really love the first one, but I appreciate a lot of the movie magic happening. And then two got worse and three got way worse. I was like, whoa, we are we're on a bad trajectory right now, but part four is probably the best, right?\n I mean, we're in the streets.\n It can't get worse. Future spoiler.\n It can't get worse.\n Yeah.",
            "start": 490.16
        },
        {
            "text": "Oh, man. Andy, I am uh in a similar place to you. I don't think I'm quite as down on it, though. Like, I there's a novelty novelty to this that I kind of respect for how purposefully weird it is. Like, like they just committed to whatever this bit is. And it does feel like you said a Superman uh show TV show that just elongated way too long for sure. Uh but this did remind me of the first Transformers cartoon where every episode would just be like a there's this weird thing going on and Optimus Prime has to deal with it with these goofy ass humans. Why would they adapt that as a Superman movie into a live action thing? I don't know, but they did. And Richard Prior's there. And all of that kind of added up to just being so bizarre to me that I'm like, I can enjoy this for what it is only because I'm watching this as an in review. I would never want to watch this movie otherwise. Like it is it is bad. It is a bad movie for sure. I do also think it makes me like two a lot less and maybe",
            "start": 536.0
        },
        {
            "text": "I'm watching this as an in review. I would never want to watch this movie otherwise. Like it is it is bad. It is a bad movie for sure. I do also think it makes me like two a lot less and maybe even one less like cuz I really appreciated one uh for like what it is, but this kind of like there's something about I know trust me Greg I know there was a lot of behind the scenes issues with these movies. You've explained all of that to me, but there's something about it that I'm like, you know, the Christopher Reeve aspect and all of it.",
            "start": 582.4
        },
        {
            "text": "I I I might have held it all a little too high in regards where it's like at some point somebody should have been like, I'm not going to do this. We give Spider-Man 3 so much [ __ ] I don't think Superman 3 gets enough [ __ ] for him just turning emo out of nowhere and just [ __ ] ruining the movie.\n They uh straight up do it here. And uh it's weird. I don't like his makeup. I don't like the way he acts. I don't like the way they solved it. Like there's a lot of stuff that's like\n when the when the Doctor Strange spirit comes out and and I'm like okay they're going to deal with this in like you know the the the metaphorical way of you know punching the bat Superman that's and then and then seven or eight minutes into I'm like this fight there's this fight scene is happening still. Why is this still going on? It's just it cuz it's the only cool fight scene in the movie.",
            "start": 608.0
        },
        {
            "text": "Craig, I'm sorry. They just don't [ __ ] get it. It just reminds me of of the of the last two movies we watched where it's like, dude, every scene is 20% too long. Like it just Yeah.\n The biggest problem I have with it is it doesn't feel like a blockbuster. And it feels like for this Superman franchise that the last two felt like blockbuster movies and so much that the score and the title sequence. This one's like, we're not even going to do the title sequence. Like let's just get into the slapstick weird [ __ ] Uh they just straight up sideline uh Lois. I'm like, \"All right, cool. I guess she's on vacation. is here. That's kind of weird, too. Like, yeah. I\n There's a lot in this movie, too, where you're middle in the middle of the movie going, \"Where's Superman?\"\n For real.\n Not even Clark.\n I'm not even talking about Clark Kent. Like, him, too. Like, I just haven't seen",
            "start": 652.4
        },
        {
            "text": "For real.\n Not even Clark.\n I'm not even talking about Clark Kent. Like, him, too. Like, I just haven't seen\n I leaned over to Jen and I was like, \"Remember, this is a Superman movie. We're this deep into Gus Gorman right now. That's what they wanted you to see right now.\"\n I feel like there was enough about it. And I said earlier like there's a novelty to it. Like, I I do enjoy some of the Richard Prior stuff. Like it's not what I would have wanted from a Superman 3 at all. But uh it just at the end of the day it is way too long that the the length of it and how long the scenes all last like anytime I'm kind of enjoying it. It just feels too long. So I'm like this is bad. It's definitively bad. But I I respect what it is and that it happened and I'm hoping that James Cunn could save us all.\n More importantly took away Dune Awakening Time thing. You know that's what I was thinking. It really did. I was like I could be in Rachus right now. You could",
            "start": 691.2
        },
        {
            "text": "More importantly took away Dune Awakening Time thing. You know that's what I was thinking. It really did. I was like I could be in Rachus right now. You could\n that's how I feel every movie we watch no matter how good it is. I could be playing a video game right now. Nick, what do you think of this one?\n Uh, I mean, this movie was always so weird to watch when you were younger because you're like when you're when you're a kid, it says Superman and then for 45 minutes, we get this we get Richard Prior and this movie is kind of a Richard Prior vehicle. 1,000% this is Richard Prior,\n which is weird because\n I don't look at the [ __ ] poster. I mean, it's the poster for carrying Richard Prior.\n It's hilarious,",
            "start": 731.92
        },
        {
            "text": "right? And so I never really understood why Richard Prior was in this movie and why they decided to rely so heavily on him for comic relief or why they needed really comic relief at all in a Superman movie. I love Richard Prior and I love the Richard Prior movie that this is and I think that the the the the antagonist who is basically Lex Luthther of that we know now this like industrialist who's super smart and like you know not a zany pluckucky idiot like uh like Gene Hackman was. So there are those elements in it, but then you have the Superman story which is just completely off. And you get maybe two quarters of the way through or or threequarters of the way through and you're like, man, this movie is bad. And then the final act happens. And I [ __ ] love the final act of this. The brainiac sequence basically for all intents and purposes. The the her becoming the electric thing used to terrify me. I hate it. I was like, I don't want to watch that part. And then I watch it and",
            "start": 764.32
        },
        {
            "text": "brainiac sequence basically for all intents and purposes. The the her becoming the electric thing used to terrify me. I hate it. I was like, I don't want to watch that part. And then I watch it and then the goo coming out always like freaked me out. That goo is going to come out right now. So all that stuff I love. I just wish that pretty much everything that came right before the cave sequence was completely different.",
            "start": 808.4
        },
        {
            "text": "Yeah.\n But uh yeah, this movie is not great and uh it had moments that basically scarred me as a child. I mean, Superman like basically sexual assaulting or like coming off as like a real [ __ ] creep to a lot of you don't see a lot of women living alone in a house like this, right? Superman, what are you about to do? Um, and then you know as an adult, so you see stuff like that and you go there's no real coming back from that for a long, you know, for for Superman Lana, right? Like that's they're pretty much done, right? If you creep someone out that much, that's not going to happen. And then Superman just goes around wreaking havoc around the world.\n Well, I mean,\n and we have one little newspaper thing that says Superman's back. He's good.\n Super again. Super wants more. Super whatever it is. Yeah.",
            "start": 826.48
        },
        {
            "text": "Well, I mean,\n and we have one little newspaper thing that says Superman's back. He's good.\n Super again. Super wants more. Super whatever it is. Yeah.\n So yeah, the movie fundamentally fails on pretty much across the board, especially in the fact that Richard Lester really wanted to make this a Looney Tunes cartoon. He wanted to make this just\n yeah the comic book again silly and comic booky and we had just moved away from that and what this movie came out in what 83.\n So you know we're just man we're just a hop skip on a jump just a hop skip on a jump away from the 89 Batman here\n and this movie I give it credit because it got us there. Yeah, the leaning tower pizza scene like green pizza uh the green screen on par with some of the Marvel stuff we've seen recently.\n You know what I mean?\n Almost like wow the tech was\n I do get I do give them credit for not subtitling it.\n Yeah. Sorry. Go.",
            "start": 859.36
        },
        {
            "text": "You know what I mean?\n Almost like wow the tech was\n I do get I do give them credit for not subtitling it.\n Yeah. Sorry. Go.\n No, no, no. It's fine. It's I We'll get there in the recap, but we What a great thing though of like Superman like gets really [ __ ] weird with Lana. shows up too late to the bus and the first evil thing he does is fly to Pisa and fix the leading tower of Pisa\n just to be a dick.\n What?\n Just to be a dick?\n What?\n Got it got a real big pop out of Danielle though when he blows the the Olympic torch. She's like what what a dick thing to do.\n God, man. Dancing on the street. Greg, what did you think of this one?",
            "start": 899.28
        },
        {
            "text": "Got it got a real big pop out of Danielle though when he blows the the Olympic torch. She's like what what a dick thing to do.\n God, man. Dancing on the street. Greg, what did you think of this one?\n I mean, what can you say about Superman 3? It's a motion picture. uh that again like what I love about Superman 3, especially in this in review series we're doing is that it's like all right cool what would a Superman movie with Dick Donner not protecting it look like here you go [ __ ] nonsense that from people who did not get the source material or didn't want to treat the source material with the respect that Donner did which is why Superman the movie is so good why Superman 2 is good but and then you know what I mean like you finally remove what the Sulkins and Spangler would have said was the problem, right? And you get a piece of garbage. Now, I don't think it's the worst movie of all time. I don't think it's the worst Superman movie. No future spoilers. No,",
            "start": 924.08
        },
        {
            "text": "I don't think it's the worst Superman movie.\n Wow.\n But it's such a again product of its time to everything we're talking about of what an old movie Andy canon films what an old movie like this would look like. what you know this and the you know Richard Prior I think the story goes right that\n he talked on like late night with Letterman right about how he was a kid again watching Superman the movie and the sulcers are like let's get him in there cuz he was just such a big deal.\n Yeah but they're like let's get him in there and and it's like but as a main as like the lead of the movie like that seems kind of weird",
            "start": 977.28
        },
        {
            "text": "but I mean again like I'm not saying it's right or wrong. I think it's wrong obviously but it would be like a couple years ago putting the rock in something and not having him be Superman or Shazam or whatever. You know what I I do love that they were the first like I I I like his character and I like what he does and I like that like the computer aspect and all that stuff. I thought that was so cool. It was just like it's just too And I hate to say this, it's just too much Richard Prior. Entirely too much Prior. Yeah. Yeah. But again, I think, you know, you listen to people talk about it and it was them do, you know, gave him a lot of room to add lib and do this and do what Richard Prior does when he's not being filthy as like a stand-up comic, which is great, too. Uh, so it's it I mean I don't again I this is the first time I've watched Superman 3 since I bought the DVDs and rewatched them as an adult in my early 20s. Right.",
            "start": 1006.24
        },
        {
            "text": "When you were a kid, how often were you watching this one? It shows on TV all the time. It was on TV so much and then I but is a rental not that much. But if when we finally owned them all you I went to the junkyard fight a lot. That would be the thing you went to, right? Or in some of the bad stuff with Superman because that was just interesting to see him do something different there. And again, I think the es especially for being, you know, is 83, right? So it's my age, but when I'm watching it as a kid, how good I think to a degree it still looks of Clark fighting Superman. Like there's clearly the one thing where like his head's up and that's a composite. Yeah, but you're a kid. You're not paying attention to that level of [ __ ] right? And it's cool to see Superman do Supermany things, right? And show his strength and invulnerability cuz in these three movies, how many times have we actually gotten that? You really don't, right? Like I mean there's so minimal time. I think",
            "start": 1049.04
        },
        {
            "text": "things, right? And show his strength and invulnerability cuz in these three movies, how many times have we actually gotten that? You really don't, right? Like I mean there's so minimal time. I think what's cool about Superman 3 from a kid's perspective and when I was looking at my, you know, going to get my little tidbits and backstage things to bring in the amount of people who talk about this, like, hey, as a kid, this was my favorite Superman because he's Superman of the [ __ ] movie. He doesn't give up his powers. He's not some [ __ ] kid for no reason. We're on Krypton forever. It's like cool for no reason whatsoever. Let's have a chemical fire. Well, not I guess it's a plot device, but a chemical fire and Jimmy gets her. I mean, think about this, too. Like Jimmy from the comics is Superman's pal, right? They don't interact. Like, you know, he saves him from the [ __ ] damn in Superman one, but it's not like they're So, it's a cool thing to see Clark and him together, even though",
            "start": 1086.8
        },
        {
            "text": "pal, right? They don't interact. Like, you know, he saves him from the [ __ ] damn in Superman one, but it's not like they're So, it's a cool thing to see Clark and him together, even though Clark's annoyed by Jimmy Olsson. Like, interesting choice on that one.",
            "start": 1125.2
        },
        {
            "text": "Side note, did you catch who the fire chief was in that?\n It's Sergeant Apone from Alien. He has that. He starts barking orders. I was like, is that [ __ ] Apone? Yeah.\n So, yeah, it's like it is what it is. I don't think it's the an egregious like horrible cinema sin, but it is like it's it's a Richard Prior movie mashed up with a Superman movie in a way that doesn't make any sense. You know, I was reading uh you know, I don't do do you want all your lore and stuff on this and all the background and stuff.",
            "start": 1138.24
        },
        {
            "text": "So, like, you know, obviously there's the Donner stuff that happened to all before this. He was gone before this picture early on when they thought they were going to be like in business for a long time. Makeawitz and uh Donner were like, \"Hey, for this for three we should do Brainiac, right?\" They got canned as we know. Uh Mawitz, I'm upside right uh walked away from the project in solidarity with Donner. So did Gene Hackman, yada yada yada. And so uh Ilia Sulcen did a treatment for what he wanted Superman 3 to be. And some of that is kind of here. Most of it is not. But it was he also had Brainiac in there. He wanted to do Brainiac. He wanted to do a super [ __ ] up like this whole thing's out there you can go read, right? Like he wanted to introduce Supergirl in this film, right? He also wanted Superman and Supergirl to fall in love. So like already a big problem.\n They weren't going to be cousins.\n Okay. Yeah.",
            "start": 1167.84
        },
        {
            "text": "They weren't going to be cousins.\n Okay. Yeah.\n But you know, obviously Superman is cousins with her usually, right? So already\n I didn't know that.\n You got to jump a whole hurdle.\n Thought she was a daughter.\n No, no, no, no. Uh you got to jump a hurdle for that. But yeah, they were going to be two Kryptonians from different uh families. But the thing was like Supergirl was going to when she left Krypton, she got caught by Brainiac and put on his planet. And then it gets even weirder where he was going to raise her and then at when she came of age, he was going to propose to her and like want to marry her cuz he was so madly in love with her and she was going to get in a ship, come to Earth, hide her powers cuz she knew Brainiac would be looking for.\n Was this going to be Richard Prior or was this like",
            "start": 1216.16
        },
        {
            "text": "No, this is before play Supergirl. And then it was going to be Yeah. You know, they fall in love, they start saving Lana Lane. They were going to get rid of Lois, of course, because Lois Margot KD again had talked [ __ ] Remember I talked about this last episode of like they're beneath contempt, right? They of course just say that's not why they sideline her the way they do in this movie, but come the [ __ ] on, right? Uh she was going to be gone from this one as well. I think the movie the treatment opens with Clark reading a letter from Lois that's basically like, I I can't do this anymore. I can't be here dreaming of Superman and loving Superman from afar. So Clark, I'm going off. I think I'm going to some other foreign country and working out of the Daily Planet Bureau there. Jimmy and Perry were going to then comfort him and then it was going to be that Lana Lane comes and is a reporter and she basically is Lois Lane so she's a reporter and do all that stuff and da da da. The",
            "start": 1256.08
        },
        {
            "text": "and Perry were going to then comfort him and then it was going to be that Lana Lane comes and is a reporter and she basically is Lois Lane so she's a reporter and do all that stuff and da da da. The movie continues to just get more and more and more and more insane to the point of like at one point Brainiac he so they the the evil Superman fighting real Superman was something they were going to do because when Brainiac found out that Superman or Supergirl was here and in love with Superman, he was going to have a Ray or whatever that would [ __ ] with Superman and make him into an evil guy and make him basically the evil Superman we have here. And so when Supergirl puts it together, Brainiac's like, \"Listen, I'm gonna keep doing it and push him to the point of no return unless you agree to marry me and come off with me.\" And so she says that with intensive and then this is",
            "start": 1291.68
        },
        {
            "text": "they were going to time travel to medieval times and live in medieval times. And\n Eternals 3.\n Brainiac gets a castle that he he outfits with Brainiac Tech to live there. So then Superman, Lana, and Jimmy also time travel back. And there's all this [ __ ] about the Ninja Turtles surfs and and kings and [ __ ] like and it's and then all of this is happening, right? But there's also Mr. Mixelick. I'm dead serious. Mixie was in this one, man.\n Mixie.\n He's a being from the fifth dimension. He like messes with people. Yeah. Yeah. He was awesome in the animated series. That's pretty much all you need. He's Richard. No. Uh uh the Afflac duck. Gold the\n AFL.\n Yeah. What's Who's the comedian who does it?\n Oh. Uh uh",
            "start": 1343.6
        },
        {
            "text": "AFL.\n Yeah. What's Who's the comedian who does it?\n Oh. Uh uh\n Gilbert Godfrey. Gilbert Godfrey was him in the the show. It was great. But he's like basically to get to get him to go back to his own dimension, you have to get him to say his name backwards. There he is. That's him right there. Yeah. Not my favorite piece of Superman lore, but James Gun's weird. Get ready. Maybe we see him at some point.\n Um anyways, he was involved.\n What's his name backwards?",
            "start": 1384.64
        },
        {
            "text": "Kicks, you know, garbage. I hate it. It's dumb. It's dumb. Uh but anyways, he wasn't going to be involved and he was going to be part of getting this all done. It's like [ __ ] it's weird, but then like you get to here where none of that happens. But it kind of does. We get the evil Superman, we get Brainiac, or to a degree. You don't, but you do, but you don't, but you do. You know what I mean? Could have been cool, but we don't. Yeah. I mean, see, I I I will say that the the part of the movie I actually legitimately like is the Brainiac device at the end of that. I wish obviously they had figured out a way to be like, \"Hey, there's Kryptonian technology in this.\" But I love that they just make this supercomputer that comes to life and has like Superman and can like just destroy everything because it can figure out how what your weakness is. I think that's a really cool concept. It's a very crazy heady concept for 1983 for a superhero movie in 1983 where the majority of anything",
            "start": 1408.8
        },
        {
            "text": "because it can figure out how what your weakness is. I think that's a really cool concept. It's a very crazy heady concept for 1983 for a superhero movie in 1983 where the majority of anything that was happening would be like he flew. That's the coolest thing ever. We're like no no this is a hyper advanced computer from Krypton that is going to take over the world. I love all that [ __ ] And it used to terrify me when the lady came out and she had her eyes and like got sucked in and it was trying to kill Superman.",
            "start": 1444.32
        },
        {
            "text": "I was like, that's all cool [ __ ]\n Um, so there there are roots of good stuff in here. I just wish that Yeah, they had Speaking of good stuff, something I liked about this is and all these movies, I do appreciate that they're like, \"All right, Superman has this power set that's insane.\" Like, how what do we show that it's like, \"Oh, this isn't just a man. This is a god.\" And he drops a lake on a fire.\n He does.\n Like in a way that would not solve this problem. Would have definitely compounded the problem. And then also we were watching and Daniel's like, \"Doesn't he have a thing where we can just blow real hard?\" And I was like, \"He does. He does have that, but we don't want to talk about Chief, you got to get your you gotta get the hoses in the back. Oh, I got like Superman. Just go back there. Go back there.",
            "start": 1468.0
        },
        {
            "text": "Go back there and step a do fly all them down individually like he flew around the world to go back to do that [ __ ] where he goes whoop whoop whoop like we get them all. What are we talking about? What the [ __ ] are we talking about?\" Yeah, he could do that. You got to love it. We're about to get into the plot of Superman 3 after a quick word from our sponsors. This episode's brought to you by Cash App. We've all had those moments getting meals out with people that always end in some kind of awkward experience of having to figure out the least complicated way to just get it done. Or even after figuring it out, have you used an app and ended up having to wait days for your money to finally show up? What if we could solve all of that easily? Cash App is a completely different experience. fast, easy, and safe, and a great way to receive and transfer money to family and friends. It's incredibly easy to set up. You just enter your phone or email and some other basic information. No",
            "start": 1508.4
        },
        {
            "text": "fast, easy, and safe, and a great way to receive and transfer money to family and friends. It's incredibly easy to set up. You just enter your phone or email and some other basic information. No bank account needed, and then there's no waiting around for days. It's your money. You shouldn't have to wait. We love using Cash App because it's fast, it's safe, and it just makes life way less stressful. For a limited time only, new Cash App users can use our exclusive code to earn some additional cash. For real, there's no catch. Just download Cash App and sign up. Use our exclusive referral code kind of funny in your profile. Send $5 to a friend within 14 days and you'll get $10 dropped right into your account. Terms apply. That's money. That's cash app. This episode is brought to you by Mood. Let me tell you about the online cannabis company that's revolutionizing how we deal with life's challenges. From sleepless nights to stressfilled days, Mood.com has created an entire line of",
            "start": 1552.88
        },
        {
            "text": "Mood. Let me tell you about the online cannabis company that's revolutionizing how we deal with life's challenges. From sleepless nights to stressfilled days, Mood.com has created an entire line of functional gummies that target specific health concerns with 100% federally legal THC blends. They'll deliver them discreetly right to your doorstep, and you can get 20% off your first order at mood.com with promo code kind of funny. I've been having a great time trying out all their different gummies, and I'm loving how each one feels. Their sleepy time gummies will knock you out in about 15 minutes flat. No hangovers, no groggginess, and their epic euphoria gummies are perfect for those days when nothing's going right. And best of all, not only does Mood stand behind everything with an industry-leading 100-day satisfaction guarantee, but as I mentioned, listeners get 20% off their first order with code kind of funny. So, head to mood.com, browse their amazing selection of functional",
            "start": 1595.68
        },
        {
            "text": "100-day satisfaction guarantee, but as I mentioned, listeners get 20% off their first order with code kind of funny. So, head to mood.com, browse their amazing selection of functional gummies, and find the perfect gummy for whatever you are dealing with. And remember to use promo code kind of funny at checkout to save 20% on your first order. Andy Andy is back. It's time for the plot. But Andy is back. He was in an accident. I don't know why Nick also sings. Seems like this was my I [ __ ] hate this guy. Welcome everyone to Superman 3 1983. Of course, we are back with an allstar cast of Christopher Reev, Margot KD, and why not open on the one and only Richard Prior in the unemployment office. Well, you know, they say that making sequels is hard, Greg.",
            "start": 1641.04
        },
        {
            "text": "Yeah, they prove it here. And we started the first two Supermen off with just banger title sequences that went on for way too long. So, I just appreciate that we're like, what if we did something different? What if we made this boring and really laborious to get through?\n You know what? We set off the first two with an intro that was, of course, too long. We all agree it's 2025, but epic that made you feel like, \"Oh man, I'm getting something here. I'm getting an old school big budget Hollywood.\" Not this time. You're in the unemployment office with the one and only August Gorman, aka Gus Gorman.\n Gus Gorman,\n who My favorite part is when he starts talking to this woman about all the jobs he's [ __ ] up, right? Of like he lost a TV. I don't believe it was small. Something happened to that TV. He doesn't like making fast food orders. Jen turns me. She's like, \"Are we supposed to be sympathetic for this man?\"",
            "start": 1698.8
        },
        {
            "text": "You know what I mean? Like, he sucks. But also, just going in the editing room. We're like, \"Why do we need any of this?\" Like, we he goes to unemployment, then he goes to computer school, then he gets a job. I'm like, just start at the job. Like,\n we needed to know that he was on his last legs. No more money was coming from the unemployment office. And this very rude unemployment lady, right? But he had a cigarette and he needed a light and he got a light from his friend and flipped it over and what's it say?\n It's computer school. Make a lot of money if you go to computer school.\n And he said, \"Oh,\n which he goes to.\" And then he be he's some sort of like hyper genius with computers, which is cool. But I was like, just start there.\n No, we needed the backstory. We needed to know that he had [ __ ] up a lot.",
            "start": 1745.52
        },
        {
            "text": "No, we needed the backstory. We needed to know that he had [ __ ] up a lot.\n I think we needed I think we needed to to know that he was a bit of a criminal, right? Like cuz he's he's lying to her and being like, \"I didn't steal the TV.\" And like, \"Well, yeah, you stole the TV or whatever.\" I don't know. It's a very weird It's a very weird like arc of he might be a criminal and then he gets redemption because he's really smart and then he no he's a criminal.\n There's no redemption and then at the end Superman's like well those three are going to jail but I'm going to take you back to betray Superman. This man\n this is the guy\n there was no gun to his head to make the chemical that was going to kill you. Yeah. In the end, he was like, \"We really shouldn't kill him.\" But everything up until this point, he was an active, willing participant in it. Yeah. The threat of going to jail for stealing money was there, but like Superman, he wasn't a good guy. Don't let him What are we doing?",
            "start": 1782.48
        },
        {
            "text": "Superman dabs him up.\n Yeah. Oh my god. And like the most like 80s like we need to appro appear appear like we understand the culture. We're handsome. And then bam. It's like, \"Yeah, I'm cool. Don't worry, Richard.\"\n Yeah. And then you have the moment where he's like, \"Hey, this guy's really good at computers. Does your boss have a computer? It's in a [ __ ] coal mine.\" And I'm like, \"This is not where you would put a hyper. Take him to Silicon Valley for Christ.\" Look, look, look. My my whole theory about this was it's it's not only the of course, oh my god, Richard P wants to do something. We got to do something. I don't give a [ __ ] what we have. We could have nothing. Let's just make it along the way and make a Richard P movie. But also, we have a lot of access to cool computers and people have never seen [ __ ] like this on the screen.\n Show these damn people.",
            "start": 1827.04
        },
        {
            "text": "Show these damn people.\n We gota show We got to show text on the screen. It's gonna blow people. People won't even know. Yeah. People are so afraid of computers, they don't even know what they're looking at.\n The pen, too, which is cool. Awesome.\n Yeah. Yeah. Yeah. Before we had mouses.\n Yeah.\n Thank you. Pirates of Silicon Valley. Great movie. Everybody watch that. Uh uh. From the unemployment offices, we go to the streets of Metropolis where there is a fine looking woman walking through the streets which causes the entire city to fall into utter [ __ ] chaos. straight up Looney Tunes like\n I'm like somebody help this blind man with the mime on the skates like oh my god\n she walks by and turns heads including Jimmy Olsson and the hot dog man who put ketchup or put mustard on Jimmy Olsen's lapel and then uh the dog gets loose and then the phone booths fall over with people in them\n dude almost drowns in a car.",
            "start": 1871.28
        },
        {
            "text": "dude almost drowns in a car.\n The dude almost drowns in a car. This is where you also start seeing like again like I'm not a a stickler for certain things. But again like yeah I guess I I I you know I love Kevin Smith obviously everybody knows that.\n I like that Kevin Smith just uses the same jabronies all the time and just changes who they are. We start seeing people pop up in this Metropolis and you're like wait you were the dude in the canoe who dumped out your coffee but you're in Metropolis now and you fell in the hole and they get walked on your head. Wait later on you're the couple that wins the trip to [ __ ] South America. You were the waitress from the [ __ ] diner fight. Like, what is going Do we not know anybody else who could fill these roles?\n I think another piece of trivia, I think it was the kid at the photo booth. Yeah, I was going to get there eventually, but yes,",
            "start": 1912.48
        },
        {
            "text": "I think another piece of trivia, I think it was the kid at the photo booth. Yeah, I was going to get there eventually, but yes,\n with with how much comedy that this whole thing is focusing on with with how long and drawn out this silly sequences of one silly thing leading to another folly or whatever.\n What like legitimately as I'm watching it, I go\n I think of uh I think of Domino in the Deadpool movies.\n Sure. and how like things just and for some reason I'm like\n oh this blonde lady I bet you this like one of her powers is some I don't know what's but it's like it's so like this whole intro is just like how can how silly can we get\n and it's like dude you're making a Superman movie though man like you're not inspiring minds and like good like why are you doing this right now like don't stick to your [ __ ] man I it's so it's so bad and just so out of place it's Yeah. Question, Greg. Like 1983 was born.\n Is this what Superman is though?",
            "start": 1952.0
        },
        {
            "text": "Is this what Superman is though?\n Like Superman being this like super campy jokey type world.\n I mean, yeah. I mean, well, I mean, like people are doing things in different but is again the Superman the seriousness of comics you're thinking of all comes from pre- crisis and crisis on Infinite Earth was 85. I'll give you a Google search on that one.\n Dang it. That old?\n Yeah. It kind of just reminds me of how like 15 or 10 years ago it's everybody needed the dark the dark version of the superhero, you know? So, I just assume people are used to silly goofy Batman stuff around this time.\n Let's follow that up with our guy.",
            "start": 2008.24
        },
        {
            "text": "And again, you remember like I'm and I'm giving Dick Donner so much credit because he's awesome, right? But it is also that thing of like he was the one who stepped in with that script that was like, \"No, no, you're focusing on the comic part of this. Don't do that.\" Like, let's focus on treating it with respect and like stories. And again, I'm not trying to take away Superman is already so old at that point. There's been so many. You go back and read Action Comics one, like that's not a campy, over the top, boom, pow, whatever. But like Superman in the 70s, it was that like there was tons of weird [ __ ] I mean, like first him eat the I can't stop eating hamburgers, which wasn't the 70s, but I mean like 70s was the You ever seen this cover? Google Superman eating hamburgers. You'll find it. It's like one of the most infamous like we're going to make fun of Superman. We'll show this [ __ ] [ __ ] Uh but then like, you know, there was all these things of like code heart with the",
            "start": 2043.76
        },
        {
            "text": "find it. It's like one of the most infamous like we're going to make fun of Superman. We'll show this [ __ ] [ __ ] Uh but then like, you know, there was all these things of like code heart with the pancakes.",
            "start": 2081.6
        },
        {
            "text": "Uh kind of, you know, it's like, you know how it was where they just put him in ridiculous situations that make no sense and invent people like Mr. Mixie, right? Because it's going to be that like, all right, cool. You can't fight him and he is magic so he can get around all your superpowers and [ __ ] like that kind of thing. Whatever. So, like, yeah, I'm I'm not an expert at this era of Superman comic by any stretch of the imagination, but comics are weird here and they're not taken seriously and they're not taking themselves seriously. Yeah.\n Many times. There are exceptions to that rule. I'm not trying to drag down and say they're all bad or whatever. Um, however, you're here. You stream my 3. All the [ __ ] happens we've talked about. You ever seen this one?\n Oh, wow.\n Yeah. Again, clearly",
            "start": 2088.8
        },
        {
            "text": "Oh, wow.\n Yeah. Again, clearly\n burgers, chomp, keep them coming. Gold or I'll starve to death. And this is the kind of weird [ __ ] they were doing with Superman. Again, not at this specific time, but to tell you more about like everything that's going on with where he's been and where he's going and yada yada yada yada. Um, so, uh, we get inside the Daily Planet. Congratulations. Uh, we're going to catch up now. Oh, wait. I'm trying. I'm actually opening it up cuz I can't remember. Where? Where do we go with her?\n Oh, we're not even there yet. And we And then you guys are doing the [ __ ] thing where you say all the [ __ ] I don't want to say yet and then you get mad at me for missing it. [ __ ] sons of [ __ ]\n Save the guy from water from the",
            "start": 2121.84
        },
        {
            "text": "Save the guy from water from the\n Well, yeah. He he doesn't though. Superman does. You know what I mean? So like Clark's walking to work and sees the guy drowning in the water, runs in the telephone booth. This is what you were trying to ruin for me, of course, is that uh Well, the flaming guys. Yeah, I love the flaming penguins.\n The flaming penguins.\n And even Jen was like, \"What's up with the flames?\" And I'm like, I don't know, but I assume watching this that those little balls were basically flares.\n They're Yeah. I I I thought they were old school. Yeah. But warning thing is beyond me. Like you think you might make want to make those like so they can't get knocked over.\n Yeah. Exactly. But also, we did in fact have road flares back then.",
            "start": 2156.88
        },
        {
            "text": "Yeah. Exactly. But also, we did in fact have road flares back then.\n Who knows? You know what I mean? Yeah. Yeah. Yeah. Uh anyways, they Clark comes on the scene, picks up the penguin, blows it out with super breath, even if he just probably done a normal breath. Puts him down. He walks away. Then he's walking. He sees this guy. Yeah. Drowning in his car cuz his car and the rug gold brew machine ran over the thing and started filling with water.\n Everyone's screaming. Somebody's got to help this guy.\n Just punch the glass.\n Punch the [ __ ] glass. Like get a thing and punch the glass. This guy's going to drown in his car. Superman took a little too long agree there.\n I agree. He took he\n super but he runs into the photo booth starts taking a kid walks up puts the money in the kid and the fraction you were trying to say is\n uh the the child actor who played Superman in the first one.\n Yeah. The one who the baby who crashed. You've seen that guy's dingling is what you need to know.",
            "start": 2190.64
        },
        {
            "text": "uh the the child actor who played Superman in the first one.\n Yeah. The one who the baby who crashed. You've seen that guy's dingling is what you need to know.\n Oh wow. Okay.\n Uh so anyways though uh Superman uh runs in the photo booth changes the kid comes out the photos get delivered open them up tears off the ones of him turning Clark. Gives the Superman version to him. Keeps the Clark one. flies across the street, tears off the roof, but like very slowly. Yeah. Very like he You can see Christopher Reef trying to get a handle on it. If I'm the actor inside, I'm like, \"Oh, [ __ ] Am I about to die?\"",
            "start": 2228.48
        },
        {
            "text": "I do love, by the way, and again, we talked about this in the first couple movies, but I love that instead of just crossing the street, he he just kind of launches himself into the air and it looks kind of natural and kind of good. He just got a quick little just over there and down. I'm like, that's Superman. That's so [ __ ] awesome. That effect probably cost him a lot of money to do all that ringing and they did it and it's good. But also Clark could have gone over to the [ __ ] thing. He's a 6'4 dude and just punched the glass. No one would ask any question.\n All the weird things like he does with his change to Superman. Well, all the things he does with his powers of just like Yeah. You know, you could have walked over and like I [ __ ]\n fans. Like this is no disrespect to you, but you're not exactly an Olympic weightlifter, right? But I think if given if if I was drowning in a car after you got done laughing, you could punch that [ __ ] glass and say",
            "start": 2258.72
        },
        {
            "text": "what I would do. You don't even think I would be running to him. The big kick I do. Oh, the kick. The high kick. Yeah. Yeah. Through my sunroof.\n No, through the side glass.\n Okay. Oh, you're you're giving like the the sweet\n stick. Yeah. Well, no. The undertaker boot where I run I lift it real high like I did to Danny on the podcast.\n So, you want to lift your leg high and come down on the glass. Absolutely not. I don't understand how you're not entertaining.\n It's just a my glasses.\n I run to your driver's side window.\n Andy, be my driver side window. Go right now.\n Um, your driver side window. Here's Greg. It's like that. Through.\n Yeah.\n Not down. Through. Through. He's penetrating the glass.\n I just don't think you're going to get enough worse with that.\n The whole thing in reality, right? Like you actually need you need like a in Kevin, are you running the show? You just need like a pin like I would actually take my key probably just go like that.",
            "start": 2302.24
        },
        {
            "text": "The whole thing in reality, right? Like you actually need you need like a in Kevin, are you running the show? You just need like a pin like I would actually take my key probably just go like that.\n Yeah, that would be a little bit more preferable for me if I'm if I'm going to be real. If I'm drowning in a car full of water, go get Kevin,\n please. [Music] You're going to kick me. You're going get Kevin. The water's going to cushion you. It's going to be fine.\n I guarantee Kevin's got like five of those like break glass fast things like in his car. You get the point.",
            "start": 2340.16
        },
        {
            "text": "I guarantee Kevin's got like five of those like break glass fast things like in his car. You get the point.\n Uh from here we go to the Metropolis computer tech whatever the hell this place is that Gus Gorman has enrolled himself in where some guy some lady's like, \"What if we did two lines of binary code?\" He's like, \"That's [ __ ] impossible, you idiot. You could never do that.\" Comes around and then Gus Gorman's like, \"Look at this. How did you do that?\" I don't know. I just did it. Cuz Gus Gorman can just communicate with the computers. That's how he is.\n I don't mind that.\n No, no, no. Wish there was a different way to get him in there. Like what we needed was Gus Gorman like just computer smart guy and then falls on bad times or needs money and does the one stupid little thing that gets him caught up in this stuff. Very similar to Greg. My mind is your mind.",
            "start": 2366.4
        },
        {
            "text": "Well, I mean office space, but I mean that's cuz they call out this movie in office space. Doesn't this sounds very familiar? Yeah, it's the plot of Superman 3.\n They stole the [ __ ] plot of this movie for office space.\n They don't steal it as much as they call themselves out of like we're just doing the Superman 3 thing. It's very funny.\n Uh, anyways though, uh, from there we go to the Daily Planet where we're reintroduced to all our favorites. Uh, Clark Kent's there. He's talking to Perry White. This woman comes in with the bingo machine to\n pull these numbers and just this gag over and over again. Well, 33. She walks out. He sits down. 33. There's three more to pull. And then he sits down again. You know what I mean? Jackie Cooper looking old as hell, but still being a great Perry White.\n I can hear the studio audience laughing at these. Like, it just feels like a TV episode.",
            "start": 2410.56
        },
        {
            "text": "I can hear the studio audience laughing at these. Like, it just feels like a TV episode.\n And let's just take a step back as well, right? Like so much of this movie is shot in wides with just characters walking around and the sound is so bad that they sound like they're 30 feet away. Horrible.\n Like so every time the lady comes back 35 whatever and you hear the other. They're not miked and we're not This is 1983. We're doing zero work with close-ups at all. This is not shot for coverage at all. It is literally every one of these scenes. Even when we go to Web's office or Webster's office, it's a big wide shot and the characters are kind of walking around. It's so lazy and so bad, but it is TV. It is like an episode of I Love Lucy.",
            "start": 2446.08
        },
        {
            "text": "Well, again, to double back to one of the problems with the re-shoots for Superman 2 that everybody complained about is Lester is 3 cam, which is it you know more than me, but that's how you shoot a TV show, right? You have the three camera operator so you can cut between them. And so actors hate it in Superman 2. The rumor was, not the rumor, what the actor said. We hated it because you don't know what to play to. You don't know what your closeup is. You don't Yeah. So, it's like you're on your own,\n you have to do it more like a play, which ends up, this isn't even three camera coverage. This is literally like, if you go back and watch that sequence where uh Richard Prior is talking to uh Robert Vaughn and he's like, I don't want to put you in jail. I want and they got the whole the the library set thing and all that stuff. The camera is literally just going doing this.",
            "start": 2486.48
        },
        {
            "text": "It's like stationary and it's just p it's not even zooming in on him. It's just kind of it's just tracking them and it doesn't feel like a movie. And granted, this is 1983, but we're also talking the same year we're like, when did [ __ ] Return of the Jedi come out,\n dude? Yeah. 81, right? Look at the way those movies are made versus this. Or look at Raiders of the Lost Ark or The Temple of Doom where Steven Spielber's camera work is like [ __ ] every camera move is specifically designed for the feel and the thing that's happening in that scene.\n And this is my problem, not even being a film person like y'all, but like with Lester doing this project, is that he's at the end of his career, right? We're talking about we this is a guy who filmed the Hard Days Night like you know it's like",
            "start": 2527.52
        },
        {
            "text": "okay cool I understand you did stuff but like clearly cinema movies were moving in a different direction. I mean it's funny now to talk about it but like for a young upstart like Spielberg or George Lucas at the time to really be in there shaking up what it is. You're seeing somebody from the old age that just is not what this movie needed. That's what I was 83.\n That's why I was saying this movie feels older than the first two like it",
            "start": 2567.12
        },
        {
            "text": "That's why I was saying this movie feels older than the first two like it\n does cuz it's it's it's not shot with modern techniques. I want I want you guys if you ever go back and watch Return of the or Raiders of the Lost Arc. There's a great sequence where they're standing on stage and he's about to give like the two FBI guys come or CIA guys come or whatever and they're trying to recruit Indie and he's like he's writing on the board and that whole thing is done with like a dolly shot that just reframes as it comes in and it's just magical to watch. And then you have the shots in here where it's like man I don't know man this is like I would cover you know a show choir show from when I first started doing videography.\n Yeah that is a weirdly oddly specific way to put it. Yeah, very weird reference.\n I get it. So that's",
            "start": 2584.72
        },
        {
            "text": "Yeah that is a weirdly oddly specific way to put it. Yeah, very weird reference.\n I get it. So that's\n the beats to get in the Daily Planet, however, is they're sending somebody to South America or whatever. Uh Clark has been pushing for the lamest story I've ever heard of for the Daily Planet of I want to go back to my high school reunion to talk about what it's like to come back for the first time in 15 years or whatever. And then Lois comes in and drops that she's also going away. What do you mean? She's going on vacation to Bermuda. Shows her bikini top. And Clark's like, \"Oh golly.\"\n Oh golly, doctor. Uh, but there is a funny bit here where everybody says goodbye to Lois and they can't they'll miss her or whatever and then Clark's like, \"I guess I'll go too.\" And nobody gives a [ __ ] Yeah.\n Perry White's like just nods at him or whatever.",
            "start": 2616.8
        },
        {
            "text": "Perry White's like just nods at him or whatever.\n Doesn't even have a line to where he's like, \"Man, it's going to be so crazy for my best reporter to be out of town or whatever.\" He's like, \"Bye, Lois.\" Or something like that.\n Yeah. Something like that. Exactly. Uh, from there, we're back to Gus, of course, because we will have to keep going back to Gus. And I'll probably put a few things together here where Gus has his job now at Webster Industries or whatever. Uh, and he's a computer analyst. This is his job. It's WebC Corp or Webs Co.\n Everything's Web something. So bad. Webb wheat or some [ __ ] We co. Wheat king. Yeah, we king. It's pretty bizarre just how it's like we have Lex Luthther at home. This feels like we just have the same trio of these bad guys that we end up getting that I thought was just like, all right, this but the difference here though is that at least they're interesting and capable. Like",
            "start": 2654.88
        },
        {
            "text": "Webster as a bad guy, you're like, \"Oh, you're an industrialist. You're not a bad person, but you're not a good person either.\" He just like [ __ ] money and you're just trying to make money however possible and if you're willing to use a criminal to do that or someone to break the law to do that it's great. Oh, Superman. He doesn't want to kill Superman. He just whatever. Get him out of out of my [ __ ] way. And that's just kind of Lex Luthther, right? Like and then he has has the sister who's super smart and apparently knows computers like you would not [ __ ] believe but just didn't want to tell you that until the last act of this movie. Very weird. My favorite character though is the blonde lady who's pretending to be dumb, but she's the smartest person in the room. And I'm like, why wasn't she like one of the main characters in this? She's so good in this.\n The movie stars Superman, which is cool.",
            "start": 2698.64
        },
        {
            "text": "The movie stars Superman, which is cool.\n We'll get there in a second. I'm sorry, lady. That wasn't me. I don't know who you are, lady. She's like, \"Yeah, you [ __ ] do.\" You know, yeah, you [ __ ] like your wife's, but yeah, you [ __ ] do. You know what? You know me. You [ __ ] know me. Don't act like you don't know me.\n I'm sorry, lady. I know who you are. Gus gets his paycheck. It's way less than it should be. Gus's new work friend comes over and explains, of course, yeah, well, it's taxes and all this other [ __ ] And then they go to lunch where he starts explaining, \"Ah, it's probably actually a half cent.\" What the [ __ ] do you mean a half cent? They round down. So, there's all these half cents. Where are they? They're floating in the computer.\n Gus, how old do you think Richard Prior is in this movie? Gus has to be what? 35 maybe. I mean, the age the people looked older back then, smoked and all that stuff.",
            "start": 2741.04
        },
        {
            "text": "Gus, how old do you think Richard Prior is in this movie? Gus has to be what? 35 maybe. I mean, the age the people looked older back then, smoked and all that stuff.\n He's got to be at least 35. maybe 40 as Mr. Prior. He's never heard of state and federal income tax being taken out of your paycheck like like he's never had a pay. He's mystified by\n I mean he quit the first day lost this all this jazz\n I guess\n took him at face value when they said 235 a week or whatever.",
            "start": 2774.32
        },
        {
            "text": "I mean he quit the first day lost this all this jazz\n I guess\n took him at face value when they said 235 a week or whatever.\n Fair. Uh anyways the guy explains that I'm going to put all this together guys. I don't care. Uh so then guys checking out for the end of the day and Gus is like I'm going to stay away late at work. You trying to get a promotion? Yeah promotion. And he goes in and puts in computer give me all the half. put them in an expense account and they go, \"Okay.\" Computer says, \"Okay, I can do that.\" And then even further into the movie, but I'm just putting it all together. Man delivers. Don't you have another check for me? No. No. I want It's expenses. Oh, sure I do. And then a great bit for Richard Prior here. He opens up.\n Very good. Classic Richard Prior.\n I like that. I like that. I love Richard Prior. I don't want to talk about\n Richard. To be clear, he's awesome in this movie. He just shouldn't be in this movie.\n No. No.",
            "start": 2794.8
        },
        {
            "text": "I like that. I like that. I love Richard Prior. I don't want to talk about\n Richard. To be clear, he's awesome in this movie. He just shouldn't be in this movie.\n No. No.\n They shouldn't have done this to the movie, really, right? That's what it really comes down to. Uh, from all of that though, we have\n He was 43.\n Yeah.\n Damn.\n Wow.\n So, but I will say this and this is obviously like I I love his reaction to this cuz he you don't have to explain\n that he didn't\n and this is just my read on. You correct me if I'm wrong.\n But I don't think he grasped the number that the check was going to have.\n And I think there's a moment here where he has that reaction of excitement and oh, I [ __ ] up, but oh, I also don't care cuz I'll probably get away with it cuz nobody else knows computers and I'm excited. But man, that's way too much money. Like, you could definitely see that he should have spread that out over the next like 24 weeks.",
            "start": 2833.52
        },
        {
            "text": "Uh, of course, immediately the guy's like, \"We're missing 84.\"\n Look at that. Look at that. I do like that scene. We'll get to that scene instead. Yeah, we're sh we're going back to Clark and Jimmy on the bus. They're going to Smallville, right? Let's go to Smallville for this high school reunion. Uh they are driving through uh Jimmy's telling him the most boring story of all time about his family and hams and [ __ ] pasta. I don't know. And you see Super like, I hate this [ __ ] explodes. Jimmy's head shot. I'm gone. I'm out of here.\n What happened to you? I don't know. I don't know.\n Uh, they get stopped though, of course, because the road shut down. You can either turn around, you can wait here. Oh my god. How long is it going to take? Nobody knows. It's a huge chemical fire. There's a huge [ __ ] chemical fire.\n I love they're on a bus, right?\n Yeah.",
            "start": 2876.88
        },
        {
            "text": "I love they're on a bus, right?\n Yeah.\n Just so fun and stupid that he's this hulking guy on this bus and Jimmy is just like annoying the [ __ ] out of him. It's so funny. And well, you know, another, you know, thing we don't give Invincible enough credit for, and I don't remember if it's in the animated series, but the comic for sure of after Mark gets his powers and can travel as fast as Superman when him and William William go down to check out a college and he's so Mark is so utterly [ __ ] bored in the passenger seat. He's like, \"It's a two-hour drive. Why are you like this?\" You know what I mean? Like what it would be like to be able to move at the speed of light and like have to do something normal like this. Like I hate my [ __ ] life so much. Um",
            "start": 2917.04
        },
        {
            "text": "of course though, it's time for Superman spring in action. Jimmy decides to get some shots cuz of course Chief yelled at him for not getting shots earlier of Superman saving the guy in the car and he's like ah a good photographer eats and sleeps with his camera or whatever. That was a funny joke too when he's camera sleeps with his and Lo is like thank goodness I'm a writer. Uh but anyways, this time Jimmy gets out to get the shots and they\n they get behind a car and there's literally a cop looking at them the entire time like looking and he's like I'm going to run in. I'm going to run and keep distract them and he runs right by the cop who looks at him go in doesn't even care what was this scene and then he gets on the crane. Everything about this",
            "start": 2951.28
        },
        {
            "text": "shot all the negative feelings I had about the the Eiffel Tower scene from the last movie. It's just tenfold here for this like it's just dumb ass putting myself in a situation I don't need to be in and like I I just don't see the comedy in it. Like I don't like they clearly shot this and him running by then like as it was supposed to be a goof, but it just kind of felt like a waste of time. Um, shout out though to both Andy and my wife. Uh, last time I'm watching this film, Jimmy Olsen and Clark are negotiating what's going to happen. He runs in there. He falls down eventually. We get to that eventually. And I forget at what point Jen just goes, \"Man, he looks a lot like Patrick Klepic.\" At which point I busted out my phone and showed her a text from two hours before where Andy had a screen grab of Jimmy Olsson and just said Klepic. Looks so much like it.\n Shout out to Patrick Clpic. We love you. Everybody subscribe to his newsletter. I",
            "start": 2986.64
        },
        {
            "text": "Shout out to Patrick Clpic. We love you. Everybody subscribe to his newsletter. I\n I really did not like and I didn't like it in the first one when it tried a similar bit of comedy of I I forget what dude is in his office when Superman\n Superman one the dude the cat burglar falls off. He catches him turns real quick and walks and the guy goes\n the guy go turns around he's like ah like what? Same thing here where Jimmy and Clark are outside the cop car. Jimmy runs in. Clark goes in the back door of the cop car, comes out. Superman the other side, and there was a cop in the car who does the huh? No, that couldn't have been it. Someone entered your vehicle. It's It's not that like, oh [ __ ] Superman's walking out that way, but but no, someone was in your car right now. Like, you should be concerned of what's happening there.",
            "start": 3031.28
        },
        {
            "text": "It said Superman flies in, lands next to the fire chief. Anything I can do to help, Chief? Get this man a hat. Oh, it's super What the [ __ ] You thought a random person was walking up without a helmet and you didn't. The blue and leotar whatever\n just said get him a hat. Yeah, get him a helmet or a hat. Yeah, whatever. Okay, cool. Uh, yeah, we got a whole bunch of [ __ ] problems. Superman, if you didn't notice, place on fire. It's going to explode. Yada yada yada. There's big explosions left and right. Uh, there's some morons trapped up there in between two fiery things. Superman goes, \"What are you going to do? Get them one by one?\" No. Which would totally be fine and easily get them two by two, be done in your Superman.",
            "start": 3072.72
        },
        {
            "text": "Yeah, exactly. Everybody hug me. I'm going to fly you out. You know what I mean? very simple on how to get these people down the two stories that are up there. But instead, uh, Superman just dro destroys more property, takes a giant [ __ ] smoke stack down, at which point I'm like, the carcinogens in there, whatever chemicals they've been burning, like Superman, I'll take my chance jumping at this point, right? I'm not going to have [ __ ] confetti lung in three years.\n I don't want rust in my wounds right now.\n Instead, they all slide on down to safety. Congratulations. Superman then goes and he's going to empty out the entire build. Another thing again",
            "start": 3104.16
        },
        {
            "text": "I don't want rust in my wounds right now.\n Instead, they all slide on down to safety. Congratulations. Superman then goes and he's going to empty out the entire build. Another thing again\n Mhm. Kids like this movie understandably because there's more Superman Super Superman stuff here than you usually get. I feel like in this scene Superman is like kind of mean about it. Like I'm not getting and granted different interpretations but but like Superman the movie the montage. Here's your cat. Hey thanks Frisky. Like Superman's being a friend. He's smiling and doing here those hey get moving. What are you doing? Like when I'm like wow [ __ ] Superman. Jes I know there's a fire. Aren't you supposed to comfort me in this moment? Look, it's it's really equivalent to the first week of a TSA agent being on the job to seven years in being like, \"Check your [ __ ] bag.\" And you know, you have to take your shoes off.",
            "start": 3124.88
        },
        {
            "text": "All I wanted to do was [ __ ] the woman I love, but I can't. Will you go down the [ __ ] pipe? You know what I mean? I'm [ __ ] miserable.\n But they cut to the behind the scenes and that rock did nothing to him. He's just like, \"I'm [ __ ] so salty. I'm a salty man.\"\n He looked for the tiniest excuse to get it done.\n Sorry, guys. It was the rock. He goes in and finds one man looking over a bunch of ooze. He's like, \"You got to get out of here. The fire's coming.\" He's like, \"I can't. We got a bigger problem if I don't [ __ ] This [ __ ] if it heats up.\n We're toast. The eastern seabboard will have a cloud of acid over it eating everything.\" Awesome.\n Awesome. Is this a place I should be saving Superman?",
            "start": 3174.48
        },
        {
            "text": "We're toast. The eastern seabboard will have a cloud of acid over it eating everything.\" Awesome.\n Awesome. Is this a place I should be saving Superman?\n Follow-up question. Why? Why do you have this? Third question. Should I put out the fire or just real quick like freeze these things with my breath and then put out the fire and then come back and freeze them again? No, no, no. I got a better idea. I got a better idea. There's got to be a large body of water around here somewhere, right, Greg? Yeah, of course.",
            "start": 3199.28
        },
        {
            "text": "Well, I mean, because there's talking and then the wall caves in and flames are just there. Hilarious or whatever. But then, yeah, he comes back out. He's like Superman now just playing [ __ ] middleman. Chief, you got to get hoses around the back. Superman, use your [ __ ] super breath. Do anything. I'd love to, but oh well, there's no water pressure. They said there'd be water. There's no water. I think Jimmy's already fallen, by the way. We kind of talked about Jimmy falls, breaks his [ __ ] leg. Superman walks through the fire, which could have been a cool effect, but the fact that it's all out of focus just doesn't work. He gets Jimmy. He brings him over there. Looks he got a broken tibia. Fibia, whatever the [ __ ] it is.\n He uh flies back and does then. Yeah, there's no water. Oh man, you the lake's 5 miles away. Which way? That way. All right. Suman [ __ ] flies over to this. him to land there and be like, \"Time to relax.\" Like flies.\n [ __ ] that.",
            "start": 3228.08
        },
        {
            "text": "[ __ ] that.\n I'm sick of this [ __ ] I just wanted to relax by lakeside.\n He blows on the lake to super freeze it cuz remember he has super cold breath.\n Yep. Lot and he doesn't need to blow like with intensity to blow every It doesn't matter.\n You froze the entire top of a massive lake. You could have frozen the entire [ __ ] like facility basically, right?\n Yeah. Yeah. Let alone like how thick is this ice? How how sturdy is it going to be to get that far?\n Blow. Just keep blowing. You got the harder blow. And then he just drops. He flies it over and then just drops, which of course would come down and just crush everyone. There's no way it would burn fast enough, but it melts fast enough to become not only a little bit of rain, a constant rain shower.\n So, it's like one of those like",
            "start": 3274.48
        },
        {
            "text": "So, it's like one of those like\n this isn't even a good solution period, let alone the solution we needed here. But it does that knocks out all the fire because of course fire couldn't burn through rain. Impossible. Especially this [ __ ] raging inferno spawned on by chemicals God didn't even know existed. You know what I mean? We tampered with science here, but we're going to stop it with just water.\n Mega acid.\n I really need to see the newspaper the next day to say like Superman murders 17 by dropping ice on them and then local lake ecology completely ruined.\n Yeah. Yeah. just took like he just he did a number on this place. Instead, he puts the fire out. He saves the chemicals. The guy who is back there and kind of looks like John Waters, you know, he wipes his brow sweat off it. He's done the damn thing. Congratulations. Yay. We probably got one of the Richard Prior scenes I've talked about before. Instead, we'll jump to, of course, the Smallville High School reunion.",
            "start": 3317.68
        },
        {
            "text": "Clark's there looking awesome. And here's what I will say just to step out for a second talk more about this movie. Christopher Ree looking great.\n He's a good looking man. He looks I mean he's always looked great, but I feel like this is his best look. He's a more mature man at this point, but he's also just bigger, you know what I mean? Just [ __ ] huge.\n The arms show through that suit alone.\n He's got like when they at one point, and I'm not Nick about it, you know what I mean? But when he's in this awesome white tuxedo or whatever, they do a shot from behind and he's got that tension between his shoulder blades in it and I'm like, \"God damn.\" You know what I mean? When I stretch, when I stretch clothes, it's here in the gut. He's got this broad [ __ ] going on. I'm like, \"Fucking godamn Chris, you're looking good.\" He's talking to some old teacher or whatever about some [ __ ] Uh, but what happens? Lana Lang watch Lana Lang,",
            "start": 3373.76
        },
        {
            "text": "the one, the only Annette Uliest. Fun fact for you is that of course she's Lana Lang in this movie. She will go on to be Martha in Smallville. She will be uh Clark's mother in Smallville the series.\n Oh my god.\n Yes. Yes. Yes.\n She's not his mom yet.\n No. Now, now, now she's just mommy cuz Alana Lang, Annette Oul, godamn Nick said something similar to this out there of like your kids were watching this movie. Everybody's just an adult. You're not thinking about it. Now watch like what a beautiful I aul I know obviously so well from Smallville where you think of now sadly being a contemporary in age to me, but at the time being a mother, you know what I mean? And to look at be like, oh man, like you were a beautiful actress and that sounds really bad. You know what I mean though? Like I've never seen Anetto when she was 20ome, you know what I mean? Like oh man. Like wow.\n Yeah.",
            "start": 3421.2
        },
        {
            "text": "Yeah.\n Yeah. When she's when she's going Clark like I I got to get the [ __ ] out of Smallville. But like what would I do with Matabas? Like you could just be whatever you wanted out there. Just\n you're the most gorgeous human being ever.\n Yeah. You're going to be fine.\n Yeah. So she walks around and does this bit again with some humor that I think works enough or whatever where she's just so scatterbrained. She gives the uh she gives Clark like a jello- mold and he has to carry that around. Then she gives the record guy the plates and then she goes to put potato salad on the records and comes switch that blah blah blah.",
            "start": 3470.32
        },
        {
            "text": "Uh she is a mile a minute catching up with her good friend Clark Kent. Uh of course talking about a million different things. Uh uh you know being back this that the other. I'm going to bring some of the stuff in from them cleaning up of the fact of course she has gone through a divorce. She's no longer with the husband whose name I don't m remember off top. I want to say Donovan but that's not right.\n Oh you have a kid. O gone. Uh instead though, Brad is there. Of course, they don't make a big deal about this. I It's weird because Brad's character almost plays like it should be her ex-husband.\n Yes.",
            "start": 3500.08
        },
        {
            "text": "Yes.\n That he's trying he's trying to get it back together rather than know there was another and he was gone, but now Brad's there who of course is Brad from the first movie with the guy who like tipped over all the [ __ ] Oh, Brand, right when they drove off. It's not the same actor. Same character. Same character. Same character. same way that Lana Lang Anto is not the same Lana Lang from Superman the movie.",
            "start": 3533.68
        },
        {
            "text": "Anyways though, a little bit of continuity there, but it would I think it would have just made me Why are we complicating this? Brad is the ex-husband and the instead Brad is super I think the reason why they did it was because if Brad was around constantly then Clark couldn't have had any relationship with the son because if the son was around and Brad's there like why that would make it so much more complicated for him to just be like that's not in the picture. Clark can as an audience member, you can be like, \"Oh, maybe Clark will step in as like a circuit father character.\" What?\n You are 100% right. If only other filmmakers would have taken that note. No future spoilers. We go on everybody to what's happening.\n Well, one thing I just I didn't want to mention is 10 year high school reunion.",
            "start": 3555.6
        },
        {
            "text": "Well, one thing I just I didn't want to mention is 10 year high school reunion.\n No, it's it's complic it's 20 I do believe cuz but it's also not lining up right. Their class is 65. the movies 83 and so it would be 85 would be 20 years. I don't know. It's kind of nebulous. So there's supposed to be like",
            "start": 3589.92
        },
        {
            "text": "he says I've been back in 15 years which also does that be that'd be 1980. So in my head cannon I'm like maybe they're playing with time and this movie isn't happening in 1983. It's happening in 1980 and that would be that. But then Lana makes a reference of you haven't been back since your mom died. And then it's like well his mom was very much alive in Superman the movie. So when did Martha die again? No, I of course overthinking this. The filmmakers don't care about continuity. No, cuz of course he meets Lonnie. He's like, I could see a future with you. And it's like, well, hold up a sec. Remember last movie when the aliens invaded because you gave up. You wanted to just be able to bang. And your dad was like, you have to save humanity. And or mom was like, you have to save humanity. Yeah.\n Whatever. Don't get the only reason I brought it up is cuz I just wanted to say that Brad looks like, you know, 15 years older than me.",
            "start": 3607.84
        },
        {
            "text": "Whatever. Don't get the only reason I brought it up is cuz I just wanted to say that Brad looks like, you know, 15 years older than me.\n Well, I mean, he's been drinking hard. But this, I think, operates in the same Sorry, Nick. The same thing of these movies act like the comics we were just talking about where their continuity doesn't matter. We don't really care. Superman's eating [ __ ] burgers this week.\n I just want to point out two things about that. Uh, one is that yes, of course, we have the we've set up that Superman of course can never live a normal life and never be with the love of his life. Yeah.\n But then when he sees Annette Oul walk into that, go [ __ ] yourself. Whatever,\n whatever it takes is the answer.\n I've been thinking about this dad again. I hate Jimmy Olsen. I hate all these [ __ ] idiot people who can't get down from a scaffolding on their own. I don't give a [ __ ] about it anymore. I'm going to do what I got to do.",
            "start": 3647.68
        },
        {
            "text": "But uh but I also just want to point out that Brad I I've always\n hated this actor and I don't I didn't know why until I saw him again. I was like, \"Oh, right.\"\n He plays always this kind of guy.\n He's that character in everything. The only other movie I remember him from is a James Bond movie called Never Say Never Again, which is a remake of Thunderball, which is it's a whole weird crazy story, but he plays Domino's brother, Kim Basinger's brother, and he's this [ __ ] shitty like the exact same character, which is weird. Shout out to the humor in this moment because I didn't know that this sort of trope existed back then of the washed up high schooler showing off about his high school sports. Like that's such a common thing we know, but it's like, man, this is really early to have\n known that that's something funny to make fun of of like should have seen a touchdown, you know, whatever. Like I I love that they did that here.",
            "start": 3694.48
        },
        {
            "text": "known that that's something funny to make fun of of like should have seen a touchdown, you know, whatever. Like I I love that they did that here.\n Smallville is everywhere. Smallville is everywhere. Always hold on to Smallville.\n Um, again, I've already given you so many of the Richard Prior scenes. I'm giving you the here. Clark and Lana clean up. This is where she reveals she has a kid. He's totally chill with it. Coming to Metropolis. What would I do? XY, you know what I and all this back and forth back and forth business about it. Uh whatever. Um from there then we go to uh back to uh the actually the introduction right of uh Weber and Vera and Lauraai talking to the accountant who's like $85,000 is missing. Where did it go? I don't know. The old days they say hold you up now with these computers they can just do anything.",
            "start": 3736.56
        },
        {
            "text": "Computers the way of the future. Now I love that this is a mega corporation this guy runs. This guy has like [ __ ] companies everywhere and this one accountant's like we are missing $85,000. Not an insignificant amount of money, but this guy's got to be a multi-billionaire. Like a multi multi-millionaire, right? So like I don't know. They got clock city videos like 85 grand's missing. I don't know what [ __ ] happened. But again, to his credit, I like this character cuz he's not pissed. He's like, \"Oh, there's an opportunity here. What are we going to do? Let him keep taking from the cookie jar or whatever.\" You know what I mean? And the deer is there and she's all angry and stuff. And well, actually, and by the way, I did skip this. These characters were introduced via James Olsen's photography in the Perry White scene.\n It's a good scene.\n I sent you to some boring ass thing and all you brought were 95 photos of this beautiful woman.",
            "start": 3784.0
        },
        {
            "text": "It's a good scene.\n I sent you to some boring ass thing and all you brought were 95 photos of this beautiful woman.\n Smoke show blonde. Why does Why does Vir look blurry?\n This is how she looks. Humanitarian of the year award there as well as uh you didn't tell me your mother was going to be here.\n Yeah. Yeah. Yeah.\n It's my sister.\n Yeah. Yeah. That was great.\n The woman in the the cherry dress her voice nails on a chalkboard.\n Oh my god. And why do they give her so many lines to just be like that? Not fun.\n Not fun. I agree. I agree with 100%. Uh but this scene ends with, \"No, we'll have to watch and wait for him to mess up. He'll mess up eventually.\" Why? Why? Why? Why do you say that? I don't know. That's what they say in the movies. But know there's no way he'll make a mistake unless he's a complete and utter [ __ ] Has the mag park. Not even a parking spot. Just out there. Whatever. Uh again, merging stuff together, right?",
            "start": 3822.16
        },
        {
            "text": "Hilarious. Gus Gorman is at his computer. His friend comes over. The boss wants to see you. I can see him. Hey, no, the boss boss. Why? And then a little way too much ad libing here of like why volleyball. Okay, whatever. He goes up there. It's the scene we're talking about with like August Gorman. I'm not mad. And the spinning bar that's amazing or whatever. And then he [ __ ] gets trapped in it and comes back out and like would you basically use your powers uh for me or whatever? I I need to make use of your powers. Right. I'm going to toss it in here because we don't really care. Right. Uh, this is where they lay out the idea of what we need you to do is hulk, I'm sorry, hack the Vulcan satellite, right? It watches the weather, but it also could control the lasers.\n Now,\n it can be lasers.\n Here is one of my favorite",
            "start": 3873.2
        },
        {
            "text": "Now,\n it can be lasers.\n Here is one of my favorite\n and I'm going to put them together, but we'll get to the plot in a second. Favorite like let's establish a fiction and then immediately throw it out the window. Um, we need you to do this. We need you to hack the thing, but it needs to be top [ __ ] secret.\n Yeah, we can't let anyone know this.\n So, we have so many small little corporations that nobody [ __ ] matters. We're going to send you someplace small. Send him a smallville wheat king. We'll get to all that stuff, right? A whole convoluted, you know, get Brad drunk, do this thing, blah blah blah, hack computer, do the thing, blah. When Superman thwarts the plot, the next plot is, let's have you drive up with Vera driving the car. drive up and interface face to face with Superman while my sister is driving the [ __ ] car.\n Yeah,",
            "start": 3913.36
        },
        {
            "text": "Yeah,\n you know, it's like me in [ __ ] Death Stranding 2. Everything's a stealth mission until [ __ ] [ __ ] [ __ ] it. You're all going to die, you BTS. Like, what the [ __ ] Like, why even toss this in there that way?\n I also want to point out that the whole point was they were like, \"This has to be we can't have it traced back to us.\" Yeah.\n Then why go to a subsidiary of your [ __ ] company? And also, if you're one sending him to a small subsidiary, give him the access. Why does he have to con his way into this [ __ ] thing? If you're gonna do that, con your way into a whole other company so that when they trace it back, they go, \"We don't know who did this.\" While this IBM for [ __ ] sake,\n while And that's what you think they're going to do. Send him to a competitor company. They go to whatever.",
            "start": 3960.64
        },
        {
            "text": "while And that's what you think they're going to do. Send him to a competitor company. They go to whatever.\n While this is all happening right in Smallville, uh Clark is still hanging out where the kids have gone bowling and it turns out uh what's it? Bricky Bobby, what's his [ __ ] name? Brad. No, Ricky. Yeah, Ricky the kid.\n Ricky isn't that popular with his classmates or whatever. They go bowling. It's like, okay. Uh, and he sucks at [ __ ] bowling. And so then Brad comes over to try to shitty bowler.",
            "start": 3996.64
        },
        {
            "text": "Ricky isn't that popular with his classmates or whatever. They go bowling. It's like, okay. Uh, and he sucks at [ __ ] bowling. And so then Brad comes over to try to shitty bowler.\n Brad, drunk off his ass still, of course, comes over, you know, you're still here, blah, blah, blah. Makes his moves on Lana or whatever. Walks over like, I'll teach you how to do. I was second county all-American. I did it twice. Championship bowling. And then Clark comes over like, \"You know what, Brad? I don't think it's a proper to give him a thing in front.\" And like all the friends are already watching. Yeah, this is already horribly embarrassing. And even for Clark to get him off and go, \"All right, Ricky, just you know, [ __ ] have fun out there or whatever.\" Like whatever. And then Ricky throws it. [ __ ] garbage throw from this pipsqueak.\n Yeah.\n Superman then goes way too hard, obliterates the pins, and every like that was cool, Ricky.",
            "start": 4014.0
        },
        {
            "text": "Yeah.\n Superman then goes way too hard, obliterates the pins, and every like that was cool, Ricky.\n Wood shards go into everyone's faces. And and and then look and this sequence here takes me back to the man drowning in the car where I'm like you don't mind blowing a bowling ball\n go over his car and rip the [ __ ] door open like or just like from a distance like like just quick laser smash the heat vision from across might boil him but I don't know. you care about this kid so much that you're willing to like do this here where\n I just got to help him impress\n this should be a story of like you know the the local Smallville stories have to be talking about these bowling pins that exploded you know\n this kid has got this arm\n what's the fallout from this\n a lot uh also Brad go home why are you here oh great line there great joke about he's been tossed up all day or whatever and he's like but he just had some chocolate milk and he's like no I'm talking about",
            "start": 4056.0
        },
        {
            "text": "Brad they do a couple of those that are really clever I where Lana says something and Clark catch like she says ABC and he talks about C and she meant B or whatever. It's like there's some funny dialogue there that I did I did enjoy that uh back and forth on or whatever.\n Um then it's time for a picnic.\n Oh, you're talking about the oil can. That's the other one.\n Oh, oil pan. My my oil my oil pan's leaking. He's like like that got me pretty good. That got me pretty good. A little horny joke right there.\n Uh so now that's happened. It's time for a picnic. Uh Gus gets to Smallville and gets off the bus and Clark hits him with the door. Not even like like this is one of those things of like why did this happen? Like Clark is a bumbling idiot when Clark needs to be a bumbling idiot to throw someone off the scent here. He just hit Richard Prior with the door. So is Superman just not paying attention or is Superman an [ __ ]\n He's so in character.",
            "start": 4115.68
        },
        {
            "text": "He's so in character.\n Jury's out. Nobody knows. Uh Richard Prior has this gigantic ridiculous bag. A capriccious bag. Greg. Um, and then he goes up and sees a ridiculous\n I did not expect a succession.",
            "start": 4169.68
        },
        {
            "text": "Yeah, go. I'm not as good as you. I try. Uh, he sees this ridiculous like Colonel Sanders outfit in the window. That is so awkward. I was like, \"Oh, he's going to buy it.\" And then he walks away from it and gently was like, \"What was that?\" And I'm like, \"Dude, I did not under as I'm watching this, I go, \"All right, this is probably some8s reference that I don't understand. I I thought it was going to be like a joke about KFC even though there's product placement later for the KFC bag or whatever. Anyways, in case maybe that's still what they were going for and they really wanted you to know uh from here maybe probably is where we get the picnic scene where Clark born and raised well you know born and raised in Smallville, Kansas. Lana been here her entire life. They both go out in what is clearly about to be the biggest thunderstorm of all time. As a Midwest guy, I'm like why are you trying to throw a picnic here? It's probably cuz Richard Lester had only this one day to shoot this",
            "start": 4183.84
        },
        {
            "text": "is clearly about to be the biggest thunderstorm of all time. As a Midwest guy, I'm like why are you trying to throw a picnic here? It's probably cuz Richard Lester had only this one day to shoot this [ __ ] thing.",
            "start": 4228.08
        },
        {
            "text": "But also, where are you throwing this picnic?\n Just high weeds on the side of the highway. Like,\n oh, you don't do this a lot in Metropolis. Me and mom do this all the time.\n But it's weird that like, you know, obviously I don't do picnics. I don't like I Maybe I don't [ __ ] know, Andy. Maybe I don't know how you're supposed to [ __ ] eat a lot these days.\n So, when you picnic, can I give you three scenarios,\n please? One,\n you say I don't picnic. You go up to a nice little hilltop. Maybe there's a cemetery there, maybe there's not, but you got a great grain sweeping view of this beautiful small town, small town America, where there's no crime and you've lived there your entire life and that's where your mother and father raised you when you were a baby.\n Two, just pull off anywhere, just anywhere on the side of the road. And make sure you put the blankets right down in prime tick country.",
            "start": 4238.88
        },
        {
            "text": "Two, just pull off anywhere, just anywhere on the side of the road. And make sure you put the blankets right down in prime tick country.\n Thank you for reading my mind. High grass and make sure the combines are coming toward you as that's happening. Ricky three justville knows every I mean like this is like farm kid 101 right of like the thrashers as they're going through picking up the wheat lord\n instead we get Clark and Lana sit down Ricky and the dog immediately run away's like oh green stuff and what a great picnic and then oh look at this pate it's got an interesting taste that's dog food why are we bringing dog food how how often this dog got to Paul eats once in the morning, once in the evening, and if I push it one way or the other, the dog the dog's fine.",
            "start": 4274.8
        },
        {
            "text": "I I I like this though because I think that Anto and Christopher you have really good camera. He has that he has a great moment of just like out of character for either Clark or Superman of just laughing it off and he eats another bite and it's just this very charming thing he does. I fully disagree. I I have not liked the Clark character in these movies at all. And I think that this movie and like some of these scenes, I cannot imagine this woman liking him like at all. period.\n Well, I think she likes him because he's stable and not an alcoholic. And in Smallville, either they make they have a line where she's like either they're married or they're Brad and that's pretty much it. So, this tall drink of water comes in with a stable job and a 401k.\n He's in Metropolis\n and he's and he lives in the big city and she's like this maybe this dude is an option for me.",
            "start": 4322.64
        },
        {
            "text": "He's in Metropolis\n and he's and he lives in the big city and she's like this maybe this dude is an option for me.\n One thing I want to toss out that I think is cool and different about what we're seeing before is that I love that Lana likes Clark, right? Lois likes Superman, right? [ __ ] Clark. Lana likes Clark based on their high school thing. And I but\n I got history.\n It's the high school thing.\n He sucked in high school.\n But here, stick with me. Well, he but he didn't suck like he sucks in Metropolis. I think even Clark in Smallville here tones it down. And maybe that's just Chris dog food.",
            "start": 4360.24
        },
        {
            "text": "But here, stick with me. Well, he but he didn't suck like he sucks in Metropolis. I think even Clark in Smallville here tones it down. And maybe that's just Chris dog food.\n Yeah, but again, like I don't think I don't think he ate the dog food initially thinking, oh, it's dog food. I think he did eat in a pate. It's dog food. And then I think it is a genuine stick with me Clark Kell whoever he thinks he is moment of him eating more and being a goof cuz he's just goofing knowing he's going to get getting a thing out of the girl he's interested in. And so it's like a it's a weird one where it's like both facads are at the lowest point they've been where it's like okay you're kind of be this is a real moment and you're not always being the I'm going to fall down and do this which is why the door thing's so weird and\n oh je didn't get that. Yeah.",
            "start": 4383.92
        },
        {
            "text": "oh je didn't get that. Yeah.\n Yeah. So I don't know. I I I like this a lot in terms of what they're trying to do and what they do do here. But it doesn't matter doo uh because uh then it's time for Oh then the oil pans leaking which she clocks from. It's like the [ __ ] Zaputo film of JFK. She's down on the other side of a hill and she looks a little bit left, but it would be all the way behind me. She's like, \"Oh, [ __ ] Look at this. It's the [ __ ] Lincoln over there.\" You know what I mean? I'm like, \"No way. She would be out of the house.\" But she goes and starts working on her shitty car. To which Clark's like, \"Oh, man. Where's Ricky or whatever?\" And just starts X-ray vision. She hears the dog whine, right, with his super hearing that never exists unless it needs to exist. Uh, he's [ __ ] And what? and he looks over and it's the [ __ ] dog crying over little Ricky who off camera tripped and hit his head on a rock in the face.\n Such a bizarre just pacing of the shots here.",
            "start": 4432.32
        },
        {
            "text": "Such a bizarre just pacing of the shots here.\n And now we got the [ __ ] the wheat threshers coming at him that's going to kill him. Soing\n I love the the visuals of superhering. We had the little like sound waves.\n Oh yeah, we had a little Wi-Fi signal coming out of his brain.\n And then again, it's just another like man, these aren't the choices I would make as Superman on how to solve this situation. Lana is distracted. doesn't see what I'm doing. I can see over there that it's not like he's about he's like it's he's dying in two seconds. I could run at super speed into the vision of these people and then start running at a normal human speed like stop there's a boy. You know what I mean? But instead\n hide in the corn like run through the cornfield low.",
            "start": 4480.56
        },
        {
            "text": "hide in the corn like run through the cornfield low.\n Instead what Superman decides to do is full on dawn the uniform and cape come in sweep in not even grab him and get out of the way. come in and [ __ ] this machinery up. And then he gives the worker a look like you son of a [ __ ] Like I'm the work. I can't see the [ __ ] we like is he all right?\n Get your goddamn dog out of the way.\n Stop eating [ __ ] dog food. Superman's like I'm going to kill everyone you know. Superman's got an edge to him and I'm not I He scares me. You know what I mean? Yeah. Uh, but anyways, then Superman comes back, drops, comes, Ricky wakes up like, \"Superman, yeah, I'm flying you around or whatever.\" To which Jen goes, \"Support his neck.\" Got this kid.",
            "start": 4519.44
        },
        {
            "text": "Again, to your point, like I just love that that that he's so committed to the duality of Clark and Superman that he can't just do anything good as Clark, especially when he knows this lady likes him as Clark. Like, run over and save the [ __ ] kid. Come back with him. Hey, Ricky hit his head. We got to go. be there for her and don't gaslight her, you know,\n instead. Yeah. He lands, drops him off, says some [ __ ] flies away. Oh, where was Clark? And then immediately, this is I think one of his better like That's a good change.",
            "start": 4565.52
        },
        {
            "text": "instead. Yeah. He lands, drops him off, says some [ __ ] flies away. Oh, where was Clark? And then immediately, this is I think one of his better like That's a good change.\n Yeah, I quick change and I got He's coming with a dog like, \"Oh, Superman was Oh, he was not a big deal. I see Superman all the time. Metropolis. Could you get me his autograph?\" Oh, man. If I had a nickel for every time it cut away. Um, from there we are to now Gus's nefarious plan in Smallville. Uh, he goes to Wheat King, which is a subsidiary of Webco, where he knocks on the glass and [ __ ] Brad is in there sleeping. He wakes up. Uh, I'm going to do this weird voice as Richard Par of how we're all in trouble and I need to come in and set this [ __ ] up. And of course, the only thing that could possibly get him in is in fact a mini bar. They're going to set up a mini bar for the\n What the [ __ ]",
            "start": 4584.4
        },
        {
            "text": "What the [ __ ]\n And of course Brad says, \"Come right in.\" in there cuz I know that I won't get in trouble for flying to the food, smelling it, you know.\n Uh they go in there and they I'm sure we cut back and forth a bit, but it doesn't matter. We go in there and we're just drinking the night away now. All right. It's Brad. It's It's Richard Prior in this giant foam hat. Whatever. T It's not but a tequila sunrise. You know what? Can you use vodka? There it is. Bye. You don't pass out, do your bread never falls down. Then it is a little funny of like you thought I was drunk. I'm I'm drunk. I got you. He gets up and drunk off his ass. Like that's kind of funny.\n I got like So yeah, in that moment I I thought to myself that, you know, Richard Par is probably just drinking water the whole time\n as a trick.\n And then he's clearly drunk when he's like later on. I was like, \"Oh, so he was drinking but just not as much.\" Yeah.\n What?",
            "start": 4632.16
        },
        {
            "text": "as a trick.\n And then he's clearly drunk when he's like later on. I was like, \"Oh, so he was drinking but just not as much.\" Yeah.\n What?\n He thought he could out drink Brad, which is a dangerous game to play with an alcoholic who drinks all day long. Uh anyways though from there he goes to the computer opens the wrong the closet and it's the Kentucky Fried Chicken bag. Okay.\n How do you know Brad would would have It's an excellent question.\n Well, you know everybody likes alcohol. Yeah, but like\n that is [ __ ] weird.\n He goes in there. It's the computer. This is like a [ __ ] goddamn nuclear goddamn computer. You need to have two keys to operate it. They be insert at the same time. He tries to do some physical comedy that he can't. Drags Brad in. puts the card in the hand, ties his hand, does the thing, pushes them both in.\n He's so goofy,",
            "start": 4677.12
        },
        {
            "text": "He's so goofy,\n but he gets in everybody. And then all he has to do is hack the Vulcan satellite. But he starts doing random hacking as well where ATMs are spitting in the streets.\n ATMs are spitting out infinite money.\n Watchdog, the [ __ ] Yeah, watchd dogs. The giant Shabuya crossing walk crosswalk they have in Metropolis. You assume that's happening. And they all start fighting and then the [ __ ] walk and don't walk guys get together and start fighting. They\n start fighting like\n I thought about you Andy during this like oh he's going to hate this.\n It it really does feel I I've made this comparison once where\n in in our high school theater",
            "start": 4722.32
        },
        {
            "text": "um we would every winter do this the children's show which is like where it was never a serious drama. It was always like a play rendition of a of a Disney movie or something like that. And every Tulen show had a chase scene. Regardless of what movie it was, you have to have a chase scene cuz the kids love that [ __ ] And they love when the bad guys are chasing and suddenly the good guys chasing the bad guys and it's it's kooky. It's madness, right? And it really felt like in this moment they go, \"We've gone too long without a slapsticky bit.\" Like we we know our quota. Every 20, you know, when they when I think of uh Joseph Staten designing Halo, every 15 minutes has to be some sort of like gameplay moment. And here it's like we got to have another silly slapstick thing of this guy at the ATM being like, \"Oh, oh, like [ __ ] sucks, man. [ __ ] sucks. I hate it.\" Uh, anyways though, yeah, all that [ __ ] happens. But he finally gets in the Vulcan satellite, hacks the Vulcan",
            "start": 4761.28
        },
        {
            "text": "guy at the ATM being like, \"Oh, oh, like [ __ ] sucks, man. [ __ ] sucks. I hate it.\" Uh, anyways though, yeah, all that [ __ ] happens. But he finally gets in the Vulcan satellite, hacks the Vulcan satellite, shoots beams down to Colombia. Of course, you watch this movie, you already know in the scene where there was a confrontation, I want you to work for me. The deal was that I almost have the market on coffee cornered now, but Colombia is the one hold out. So, [ __ ] wipe Colombia off the map pretty much, right? Ruin the entire coffee bean deal for us. And Gus is like, \"Okay, otherwise you go to jail because of course you stole money from us,",
            "start": 4806.8
        },
        {
            "text": "right?\"\n Uh Gus does this uh the you know, they shoot the beams into it. That shoots the beams into the sky. The people who won the trip to South America are in Colombia. They are they walk up. They I think they say, \"Look, a native wedding or whatever.\" Like they're [ __ ] on another planet. You know what I mean? But like look, the Colombians are getting married. Let's act like it's a zoo. Let's walk into their wedding. God,\n they [ __ ] there. But then, of course, the skies turn, rain falls, it's thunder, it's lightning, it's earthquakes, it's crazy. The [ __ ] chapel falls apart, rocks fall, the bride gets hit. One, the dude gets hit with rocks. It's like, what the [ __ ] You know what I mean? But it's exactly what they wanted. It's all done. So, we jump to Metropolis. We're at the top of Webco Industries where this man has built a ski slope on top of his building.",
            "start": 4841.04
        },
        {
            "text": "Awesome. I [ __ ] love it. And here, this is a problem is this should have just been Lex. Like, I I understand like we've just had him as this like recurring villain and like the idea of Lex having this underground base in the first movie and just how ridiculous that all was. And now just on the top of the skyscraper in Metropolis, we have a freaking ski resort thing. That's awesome. But like giving it to another character that's not Lex feels weird to me.\n And not having Ned Batty being there like falling down the ski slope.",
            "start": 4891.84
        },
        {
            "text": "And not having Ned Batty being there like falling down the ski slope.\n Well, it said Richard Prior will. But uh before that happens, of course. Uh they turn off the news. We've already won. Congratulations. D. Then Richard Prior shows up and is so apologetic that Superman screwed this up. How would I know? What do you mean? Then he does the and the flowers are still standing, rips the tablecloth off, puts it on, reenacts all this Superman stuff that then we get some clips of of Superman flying in, freeze breaththing the doing this. It's like a pause and be like, did I miss did I miss something?",
            "start": 4916.16
        },
        {
            "text": "You could tell if they had 10 million more dollars, they're like, we would have shot the scene cuz it would have been really cool to see Superman stop a tropical storm, I guess. I don't know. But instead, it's played for laughs because they spent all that money on this downhill ski slope at the top of a building, which I always thought was cool as [ __ ] when I was a kid. Yeah. Richard Prior puts on skis and is hopping around having this conversation. Of course, the villains decide that, well, this is no good. Superman has foiled the Colia plan. We need to get rid of Superman because we're going to keep doing evil [ __ ] right? Because it was now that we have the market cornered on coffee, now we need to corner it on oil. uh will be the in charge of all the oil uh here at uh Earth. Okay. Um but now Superman's the problem. How do we get rid of Superman? The conversation of kryptonite comes up uh that the smart woman who's actually playing dumb acts like she know blurts it out. Then",
            "start": 4952.48
        },
        {
            "text": "Um but now Superman's the problem. How do we get rid of Superman? The conversation of kryptonite comes up uh that the smart woman who's actually playing dumb acts like she know blurts it out. Then though I read about that in an interview. There is a rock from his as if everybody wouldn't know. As if a [ __ ] alien came to our planet had the powers beyond any comprehension. Then three other aliens came and [ __ ] tore up the White House and did all this [ __ ] We wouldn't all know everything to [ __ ] know about these people from whatever kryptonite. Yeah, I've heard about that. That's a real thing, right? Uh well, it doesn't exist. Well, what if we went there? What if we figured out where the planet was? At some point in this conversation, Richard Prior goes, \"I can't ski.\" And he flies and he he's [ __ ] off the building, lands on the side of the building, coming the building off, lands on the ground, then walks.",
            "start": 4989.84
        },
        {
            "text": "That was like a very tall sky.\n I just thought he was going to die. Like I thought this is like, oh, they're killing him off here.\n Yeah. I don't What the [ __ ] was this?\n I hate it so much because it's there's a fine line between like, look, some of the stuff's campy and the the stuff at the beginning with all the Rub Goldberg stuff is like it is what it is, but this is so unbelievable that it actually breaks the thin veil of reality that you have to have in a Superman movie. Like someone falls off whatever that word is.",
            "start": 5038.88
        },
        {
            "text": "No, the ventriloquism. Very similitude. All three of us said it differently. It's a dumb word. Uh anyways though, this is the conversation then. Well, then we should get kryptonite. We don't have nobody knows where it is. It's all gone. Well, Gus, you're going to use the Vulcan satellite to go out into space to where Krypton was and get us the thing. Cool. Again, last time we sent you to Smallville with this insane. Now, you will just use your usual computer terminal from your office. Why the [ __ ] did I go to Smallville? Why I was on a bus for seven hours\n happening? Yeah.\n Uh he goes out there, he finds it. Guess what? Uh there's one unknown compound in it. There's one unknown thing. It's not at the periodic table. Y\n and he he's smoking of course. He looks in his thing says tar. He says it's only 0.25 or whatever. Put some tar in there.\n Yeah. Congratulations everybody. Synthetic kryptonite.",
            "start": 5063.76
        },
        {
            "text": "and he he's smoking of course. He looks in his thing says tar. He says it's only 0.25 or whatever. Put some tar in there.\n Yeah. Congratulations everybody. Synthetic kryptonite.\n And this lady, he's like sleeping. This lady walks up goes, \"Hey, I got this the chemical compound. Do you want it?\" But it's wrapped in paper like you would get like a at a [ __ ] like a lobster. Like what?\n I think it's the print out or whatever. And they I don't know why I'm scared. I'm from I'm not from bizarre. It's so bizarre. And the prop doesn't look good. Like it's not glowing or anything. It's just not real kryptonite. I reckon\n it's just Yeah. I don't like here's that thing you wanted. Like what is happening?",
            "start": 5107.92
        },
        {
            "text": "it's just Yeah. I don't like here's that thing you wanted. Like what is happening?\n While all that was happening, we got a cutaway at some point where Anto Lana Lang called Clark and was like, \"Hey, uh, so Ricky really liked the autograph, but he kind of shot his [ __ ] mouth off and said that Superman would show up to pick him up for school or whatever. It was his birthday party. Uh, do you think you can make that happen? And Clark once again so desperate to have sex is like\n he's only [ __ ] once.\n Yeah. Yeah, I can do that. Even though I again the whole part part of the last movie was I can't do that. Love of my life just went to Bermuda in a in a bikini string bikini. Probably bang get banged.\n I can do this. I can do this. Yeah, I I I know Superman pretty well. Again,",
            "start": 5137.2
        },
        {
            "text": "I can do this. I can do this. Yeah, I I I know Superman pretty well. Again,\n a level of throwing away the veil between Clark and Superman we have not seen in prior movies. Yes, I'm well aware of other narratives where this is the but again this movie a oneshot happening on its own whatever. So we jump to Clark next to I'm sorry Superman next to Lana Lang and he's like ah she's like sorry they kind of went overboard and it's Smallville welcomes Superman. They got the parade they got a bunch of people the mayor's there. He gets up, he gives a stirring speech about like, you know, hey, you have the you already have the key to our hearts, but here's the key to the city or whatever. And again, this is where like it must feel like when Nick talks to me cuz I'm looking at how big Superman is and how small this mayor is like, god damn, you forget Christopher Ree huge. Um, fair.\n Yeah, that's exactly how it is. Yeah,",
            "start": 5174.32
        },
        {
            "text": "Yeah, that's exactly how it is. Yeah,\n this is all well and good. And then what happens? Hong Kong, a Jeep rolls up,\n driven by Vera again. The woman we're trying to stay under wraps about. I don't remember this scene incredibly well, but I forget if Clark was there when we went through the photos or if that was just Lois, Lois, Jimmy, and Perry. Doesn't really matter. She's got photos in the [ __ ] newspaper he works at. And he is in fact [ __ ] doesn't matter. Drives up, Gus gets out, and again,",
            "start": 5226.8
        },
        {
            "text": "what a diamond in the rough Webster found with this man that he can do computers, he can do impressions, he can outthink this, he's got no moral compass. It's fantastic. Even though he keeps saying at times, I want to cut, I need money. Like, what are they? Okay, he gets up there as the general, has a long rambling speech about this and Superman did that. Finally starts talking about Superman, connects it back to the fact that he saved our bacon with the acid cloud that would have eaten everybody and on behalf of the United States military, we have a gift for you. And he opens it up, pulls out the kryptonite, hands it to Superman, who was like, \"Thanks.\"\n It's so awkward.\n It's nice.\n Why does Superman handle it this way? Well, what's funny is why are they doing a a ripoff of Patton? Like this is how the movie Patent starts.\n When did Patton come out? I I don't I mean I'm assuming beforehand.\n Oh, no. For sure. I'm just saying is are they trying to\n explain more, Nick?",
            "start": 5252.08
        },
        {
            "text": "When did Patton come out? I I don't I mean I'm assuming beforehand.\n Oh, no. For sure. I'm just saying is are they trying to\n explain more, Nick?\n Uh the movie Patent 1970 started off with like I for uh uh George C. Scott playing fame General Patton walking around stage in this exact same outfit like\n and there's a giant American flag behind. You see that par a lot of parodies of\n it. But so I guess this was his inspiration like where I'm going to do a little patent here. I'm like why? It's weird.\n This and then also Superman you've seen green [ __ ] before.\n Exactly. It's like you know\n maybe like a little suspicious\n and even if you don't know what it is, it's [ __ ] weird. You're getting this right.\n Take it back to the fortress.\n This is a nice guy. But this is like somebody busting out a fake gun on an airplane and being like, \"Oh, it's just like\n it.\"",
            "start": 5297.28
        },
        {
            "text": "Take it back to the fortress.\n This is a nice guy. But this is like somebody busting out a fake gun on an airplane and being like, \"Oh, it's just like\n it.\"\n If I'm like, \"Whoa, what the [ __ ] you think you're trying to do right now?\" like the you know what that could do. I don't know. I just all of this is so bizarre.\n But I mean, he sees doesn't feel the effects of it. I I'm with you. Don't get me wrong. I'm not trying to justify this. I just think if somebody came up I mean, listen,\n we've all been to kind of funny meet and greets.\n A bunch of y'all weirdo [ __ ] You give us weird stuff. I go, \"Oh, thank you.\" You know, I've learned from this.\n I'm kidding everybody. You give great gifts.\n Uh I'm thinking when Andy was a fan and he would give me these weird drawings. Like nice.\n I mean to use Andy's analogy there, right? It's like as if you had been shot",
            "start": 5335.12
        },
        {
            "text": "Uh I'm thinking when Andy was a fan and he would give me these weird drawings. Like nice.\n I mean to use Andy's analogy there, right? It's like as if you had been shot\n and then to thank you someone brought you a recreation of the gun that shot you and you be like, \"Whoa, what the fuck?\" Like it looks like kryptonite.\n Like who are you trying to piss me off? What's going on?\n At the least angle like someone bringing you like a nutter butter.\n Yes. Don't give them ideas. There's a parade on Saturday. All right. Don't need that. Someone recently apologized to me. How about that? Stay.\n You really made a big deal. Well, it was\n you really made a big deal.",
            "start": 5370.4
        },
        {
            "text": "You really made a big deal. Well, it was\n you really made a big deal.\n Don't turn this around on me. All right. Uh, anyways, uh, then they, you know, Superman, uh, they they Gus calls back to HQ and reports back, I don't know why it didn't kill him. And he hangs up on him at Webster, all angry that it didn't kill him. Uh, from there, we go to Lana Lang's house where she had promised Superman the best homecooked meal he's ever had. Uh, and so they're there having a very pleasant, normal conversation with Superman. And then the phone rings and Lana goes in to take the call and Superman does the stumble and whatever and then just he wakes up a dick. It starts, you know what I mean?\n I I was very confused by a lot of this.",
            "start": 5401.04
        },
        {
            "text": "I I was very confused by a lot of this.\n So confused and legitimately out so far in these movies. Like there's been things they've done that I've really disliked like and that were very unclear. Last week I was talking about Superman 2, him losing his powers and getting him back. Like it just felt confusing. Like I was following but I was like but why? How? What? And now this again, I was like, why does he have makeup like that? Is the kryptonite affecting him? Is it making him evil? Is this a Spider-Man 3 type situation? And then yes, it is. But like somehow I would say even worse in terms of him him being bad and acting like an idiot. Like we already have a Clark that I don't like the way he's acting. And now we have a Superman that's just acting the makeup alone.\n But are you saying that this is better or worse than when when he's like, \"Let me some shade.\" I mean, dude, it's\n this is better. Way better.\n That was so out of pocket. I really don't know.",
            "start": 5436.0
        },
        {
            "text": "But are you saying that this is better or worse than when when he's like, \"Let me some shade.\" I mean, dude, it's\n this is better. Way better.\n That was so out of pocket. I really don't know.\n Hey, Slim. Slim is I'm not saying it's good. This is really really like at least in Spider-Man, they built it up of it's the Venom, it's this like he has it now, whatever. This is just like why is he bad? What's unfortunate is they didn't think kryptonite's making him bad. They needed to do, correct me if I'm wrong, but they need to do like Red Kryptonite, right? Which is I think in the comics\n Red Kryptonite would have been great. Yeah, Red Kryptonite in the comics was was what like split him or made him bad\n and it it doesn't make any s like it would have been a hard cell, but like nobody knows what color kryptonite is.\n Focusing on building that up to some extent.",
            "start": 5477.52
        },
        {
            "text": "and it it doesn't make any s like it would have been a hard cell, but like nobody knows what color kryptonite is.\n Focusing on building that up to some extent.\n Tell me that this other go watch the Smallville episode red. Holy [ __ ] that is an episode. Slips on the glass ring. You see go through his veins and his eyes light up red and then he's just [ __ ] awesome.\n But then he's [ __ ] awesome. Slim is machine.\n No, but there's a great I watched of course I watched all the Smallville commentaries as well as you'd imagine back in the day. But like Superman Clark Kent finally has all his power. Well, not all his powers, but he's like he has no he has no inhibitions anymore, right? He's selfish. It's going to make himself",
            "start": 5518.96
        },
        {
            "text": "also true. But it's going to make him selfish, right? And like what is what does he do? like you could do you have all these powers and your parents have made you you in his mind made you hide them and do all this different stuff forever. Like you finally have all your powers. He runs to Metropolis and like buys all this stuff and buys a Gamecube and he's up in his loft playing GameCube and Jonathan comes up to yell at him about it and then he's like, \"Fuck you, dad.\" And jumps out the window and rides off in like a Harley or whatever.\n What I needed was during the creation of this kryptonite, I needed there to be some like, \"Hey, we didn't get the ingredients. We didn't get it like 100%. It won't kill him, but something will happen like it will do something to him. There's enough there.\n Here's what I would go against. I don't think you needed that as much as when he initially got it.",
            "start": 5556.4
        },
        {
            "text": "Here's what I would go against. I don't think you needed that as much as when he initially got it.\n A physical twinge reaction, a closeup of like something to let you know it's affecting him cuz it doesn't make s What doesn't make sense to me about it is\n he has it.\n Thanks. It's nice. And then he's at the table with it holding. Thanks. It's nice. You get that again. And then he's at Lana's house not holding it. It'd be different if he was hold if like he picked it back up and like like a ring or a thing they put around his neck of like an honor like a ribbon or something like that. Anything but yeah it's weird.",
            "start": 5594.0
        },
        {
            "text": "Then there's a follow-up to Red later on, right? Cuz he eventually tells Pete a secret or whatever. And this is like the best line ever. All right. And I'm probably going to [ __ ] it up, but I forget what it is. Check and remind me something's going on that's also then releasing the inhibitions. This is later on, right? Of like Pete and Khloe and all like something's like mind snatcher kind of [ __ ] I don't know what's going on. But with Pete knowing the secret, he walks up to Clark and he's like, \"Here's the problem. I finally figured out your problem, Clark. It's that for you, green means stop and red means go.\" And he puts the red kryptonite in Clark's pocket and Clark does again. Oh, [ __ ] what a moment. Sam Jones the third. Never forget\n Chloe. Chloe Sullivan.",
            "start": 5625.76
        },
        {
            "text": "Chloe. Chloe Sullivan.\n Yeah. Should you relate it to anyone? Please, if we're not if we don't we're not going to do small villain review. Do I really need to go into Khloe Sullivan who were all watching the show being like, \"Clearly, she's going to become Lois Lane. That's where we're going.\" No, they introduced Lois Lane. Okay, but it's her cousin. So, yeah.\n So, it's her cousin. Yeah,\n that's what I was thinking. Okay. Lana Lane. I was I had my controversy behind the actress.\n I thought that Lana No Lana Lang. I thought it was Lana Lane. I thought it was Cousins, but I I only watched a handful of this all makes sense. There is a cousin.\n There it is. There it is. Solve the problem, everybody.\n Anyways, uh anyways, she gets the phone, he gets affected, she comes back in. Oh, there's this [ __ ] thing hanging off a bridge. You need to go help Superman. She opens the door like we can wait.",
            "start": 5661.04
        },
        {
            "text": "Anyways, uh anyways, she gets the phone, he gets affected, she comes back in. Oh, there's this [ __ ] thing hanging off a bridge. You need to go help Superman. She opens the door like we can wait.\n Why don't we Why don't we enjoy our time? Why don't we relax or something? Yeah. And sits down. And then it's like, yeah, it's rare to see a\n Why don't you check out this boner? Rare rare to see a woman just sitting around, you know, whatever. Whatever. And she's like, h very uncomfortable and clearly weird as he gets he sits too close or whatever.\n That's this man. It was freaky. And then eventually she's like, \"Shouldn't you go check on the bus or the truck or whatever it is I forget?\" And he's like, \"What? Yeah, I should. You're right.\" And he flies off that way. And of course, we get there and guess what?",
            "start": 5702.16
        },
        {
            "text": "It turns out if you would leave us little [ __ ] ants, these humans alone. We can solve our own problems to some degree. So yeah, we saved the people that were hanging there. Yeah, we lost the truck and all the metal that bing bongs out of it in the back or whatever. But but then the guys are like, \"If only you'd gotten here sooner.\"\n And they say it kind of like an [ __ ] But like and Superman again is like, \"Oh, I've had heard enough of this [ __ ] It's time to [ __ ] up Earth. And the best way I can think of is I'm gonna go straighten out the leaning tower.\n It's always annoyed me that it's crooked.\n I'm gonna go get this for frankly my entire life I've heard this thing's going to fall eventually. Just fall.\n Just be done. I'm done with it. That's going to be fun. That's be exciting.\n No, don't me wrong. I They say they know when it's like I don't want people on it. I don't want it to be unexpected,",
            "start": 5738.72
        },
        {
            "text": "Just be done. I'm done with it. That's going to be fun. That's be exciting.\n No, don't me wrong. I They say they know when it's like I don't want people on it. I don't want it to be unexpected,\n but I'm going to be stoked when they're like, \"Guys, it's happening sometime.\" Yeah. Yeah. I wish this was a different movie that didn't have the stuff. But I was saying last week, I like when movies have like these actual landmarks that we know that feel like, oh, this is a real thing. So having this is cool. And I do like the comedic bits with the little the guys making money like just selling the little stuff like that. So funny. Just why is this in a Superman movie? Stabilized. It was stabilized. Massive master is an attempt to stop the motion from falling. In fact, by the end of the tower slowly.\n So it's fine. It's not going to fall now.\n Yeah. They put some [ __ ] in it to stabilize it.\n What the [ __ ]\n Cool. I'm not gonna say it's the only reason I've been hanging on, but come on.",
            "start": 5771.92
        },
        {
            "text": "So it's fine. It's not going to fall now.\n Yeah. They put some [ __ ] in it to stabilize it.\n What the [ __ ]\n Cool. I'm not gonna say it's the only reason I've been hanging on, but come on.\n It's the eighth wonder of the world.\n That [ __ ] sucks. I hate that a lot. I'm not a big fan of that at all. Uh, like I said, that then sets him off on his thing, right? So, uh, I wrote a note here that I don't know what I mean, so I'm trying to get back to. I wrote goodness at the crossroads. Oh, it's cuz they're watching him and they say that. Yes. Okay. Okay. Okay. I I like There it is. There it is. So, anyways, literally all it is is Leaning of Tower of Pisa. Then Vera has a Time magazine. The cover is Superman goodness at the crossroads and has a question mark in his symbol because now the world's hip that Superman's weird but that's all it is. That's all",
            "start": 5809.52
        },
        {
            "text": "minute late to this thing. Yeah. How long has this been? He didn't get the note that it was stabilized. You know what I mean? So now he's [ __ ] that up. Uh from there. Yeah. It's off to the Olympics. Sorry. Go ahead. Like nobody had\n the whole world saw him like push a pizza.\n Man, we all you know Biden had one bad debate. True. social media\n information moved the exact same speed in 1983. You're right. You're right.\n From there, we go to the Olympics where it's the final thing. Oh, the the torches finally made it here. The flame from Athens all the way up to\n [ __ ] It's so stupid.\n I really needed to hear Nick Doola. I really needed to hear Nick's Biden impression there.",
            "start": 5852.08
        },
        {
            "text": "[ __ ] It's so stupid.\n I really needed to hear Nick Doola. I really needed to hear Nick's Biden impression there.\n Oh my go have some of your water. You can have my water. It's such a bad mal. [Applause] Uh, so you know, with them reading the Time magazine, there's also this conversation then about the oil. Gus has programmed all the tankers to go to one place. One tanker isn't doing it. That's the whole thing. Gus wants in on the action. He wants them to build him this supercomput that'll be it'll be able to do anything he wants. And that means anything that Webster wants. I always love he pull he pulls the things out because he's written them on various different things. I thought that was cool.\n Yeah,\n sure.\n The schematics\n it's I mean again to how hairbrain Gus is and everything else or whatever.",
            "start": 5887.04
        },
        {
            "text": "Yeah,\n sure.\n The schematics\n it's I mean again to how hairbrain Gus is and everything else or whatever.\n Um eventually when they can't get this one tanker together that's going to be important. There's the Olympic thing. He blows out the torch. He's up there just looking all smug and angry and flies. I like when the torch guy just turns around. He's like I don't know.\n He's like what the [ __ ] Yeah.\n Uh\n it's largely ceremonial\n then. Yeah. We've laid out all the tors the stuff and this is where they're like, \"Okay, now that Superman's evil and has no morals, we need him on our side.\"\n Yeah.\n And so, what better way to do this a beautiful woman on top of the Statue of Liberty where everybody has it up. And he flies up just to say, \"I don't want to help. I don't do that anymore.\" I hate that. I hate it.\n Don't do Maybe didn't read Time magazine.\n I'm [ __ ] evil.\n Crossroads.",
            "start": 5929.2
        },
        {
            "text": "Don't do Maybe didn't read Time magazine.\n I'm [ __ ] evil.\n Crossroads.\n Blowing out torches, pushing things around, having a great time. Uh, and she's like, \"Listen, I just want to [ __ ] your brains out, but there's one thing you need to do first.\" Yeah.\n You need to go punch a hole in this tanker and make sure the oil doesn't, you know, and Superman\n Superman is like in. Let me tell you, I'll be I'll level with you, lady.\n It's been hard to get laid. All right, I got my mom in my ear, my dad in my ear. I got to erase people's minds. You're in it. I'm in it. Let's go do this. Flies over there. Flies up on this ship.\n So silly. oil's pouring out.\n Just rips it over. Rubs it over.\n Did we talk about the suit already? Has the suit changed colors already?",
            "start": 5970.56
        },
        {
            "text": "So silly. oil's pouring out.\n Just rips it over. Rubs it over.\n Did we talk about the suit already? Has the suit changed colors already?\n Uh, it does. Yeah. When he's up on the Statue of Liberty, you really see it. Yeah. You really see it. Love it. Yeah. I guess in the Olympics it was, too. when we come back with the question mark which of course leads us Andy [Music] super suit let's talk about evil Superman's Superman suit of course so far for one two we have just the same superman suit we agree they're both super suits we finally have a differentiator the dark evil superman suit\n that's awesome in my opinion What a great visual way to just be like, \"This dude's bad now.\" And I love that they just took the suit. They had obviously redesigned the entire suit with different materials, but it just it's cool. It's a great look. Don't you think?\n It just It kind of reminds me of a Zack Snider Superman.\n Just 100%.",
            "start": 6004.08
        },
        {
            "text": "It just It kind of reminds me of a Zack Snider Superman.\n Just 100%.\n It's It's a great effect. And it even is it even it stands out even more when he comes back.\n I agree because\n I think it's super\n But it wasn't just like a one change, right? I feel like over several scenes it's getting more and more desaturated.\n That I don't I just remember it being like I just remember turning around being like, \"Oh, that suit's like dark now. It looks dirty and grimy and but it's just it's cool that they were like some costumeumer somewhere was like, \"What do we put him in? How about just a muted version of where he is cuz that's what he is.\" I'm like, \"That's a [ __ ] great idea.\"\n I liked it. A super suit for sure. We have the votes. We got the",
            "start": 6061.12
        },
        {
            "text": "I liked it. A super suit for sure. We have the votes. We got the\n suit again. Song again. Ready? Super suit [Music] on. I take suit on. I take the suit. Oh my god. Uh, and then you like you'd think maybe I don't know. Maybe you're watching this film, you're like clearly they won't then have Superman. [ __ ] this lady. They have Superman. [ __ ] this lady.\n Not only does he [ __ ] her, she's like, hey, he's like shut the [ __ ] up. And then just bam, just shut up. B. Yeah. Superman flies back to the top of Webster core.\n Yeah.\n Where she is on the snow mountain peaks or whatever. She comes in and she gets on. She tries to grab something. He grabs her like nuh-uh.\n Lays one on and we cut away\n cuz they got it on. You want to talk about a super kid out there.\n Woman dies. Went too hard, man.",
            "start": 6092.56
        },
        {
            "text": "Lays one on and we cut away\n cuz they got it on. You want to talk about a super kid out there.\n Woman dies. Went too hard, man.\n Woman crushed her init. Um, there's probably cutaways here of this stuff getting flown into whatever desert cavern there is where they're building the supercomputer for Gus. Congratulations there, everybody. Uh, there's also the bunch of the cutaways of like now the world's in complete turmoil, right? Gas cost a million dollars. Fights are breaking out because of the gas. There's all sorts. That's the third one this day. Gets worse at night or whatever. All this dumb [ __ ] people are flipping out.\n I love that too cuz the these five oil tankers cause a gas crisis in America. Like we have zero oil reserves at all. Like we wouldn't just be like this is a massive thing happening and we can unlock the oil reserves in this and to talk to Jimmy Carter. All right.\n Yeah, fair enough.\n Thank you.",
            "start": 6143.28
        },
        {
            "text": "Yeah, fair enough.\n Thank you.\n This is Reagan. Well, I mean Jimmy Carter is the one who like [ __ ] for all that, right? Listen all listen Americans. You got to tighten your belt. They're like [ __ ] get out of office. [ __ ]\n We're not sacrificing [ __ ] Jimmy. We'll [ __ ] you elect someone who will [ __ ] up this nation for a generation. Thank you very much.\n Um from here we get the, you know, [ __ ] classic scene of Superman at the bar. I think they're watching gas prices [ __ ] on TV and they pan out, right? And they're compl Yeah, they're the guys complaining like, \"Somebody's getting rich off this. I don't know who, but somebody. We need a Spider-Man.\" And instead of Superman sitting at the bar just [ __ ] with the bottle shooting Jack just audience outside, they are there doing this.",
            "start": 6185.68
        },
        {
            "text": "You see that class solidarity on man. It's great. Like all these people, it's people up top, man. Yeah. Uh I should have mentioned probably that Lana and she needed one final push. I forget what it was, but she called Smallville airport and got a ticket to [ __ ] Metropolis. Uh, and so they they show up. By the way, uh, Superman's in there and then he dumps the penis out. He starts flicking the penis.\n Oh my god.\n Stop. Please stop.\n Got that 5:00 shadow.\n Here's a question for you guys. You're at this bar.\n Yeah.\n Oh, you know it. I'm walking right up to soups and be like, \"Let's go.\n Let's [ __ ] go.\" Right.\n Can I buy you a pap? Let's go. Let's see where this goes. You know what I mean?\n Can I get a cool suit like that? I want to be kind of boots.\n I wasn't sure where you're going to go with that, Greg. I was like I for a second I thought you were going to say like, \"Let's go kill people.\"",
            "start": 6226.88
        },
        {
            "text": "I wasn't sure where you're going to go with that, Greg. I was like I for a second I thought you were going to say like, \"Let's go kill people.\"\n Well, I mean, where's the day going to take him? But again, he's not doing that. He's just being an [ __ ] It's like, you know, uh, so anyway, this is\n You could be worse.",
            "start": 6268.16
        },
        {
            "text": "Well, I mean, where's the day going to take him? But again, he's not doing that. He's just being an [ __ ] It's like, you know, uh, so anyway, this is\n You could be worse.\n He smashes all the bottles and he sees himself in the mirror cuz people are talking [ __ ] I think Lana and and Ricky are out there talking [ __ ] and he burns it and morphs it with the lights. Yeah. No. No. Save it. Save it. Then he comes out. Yeah. What do you Look at that. What are you? And I'm like, that's how he's talking about people when he was a good Superman. What are you looking at? Get out of here. And then Ricky's like, \"No, Superman. It's me, Ricky. You're still good in you.\" And then Superman turns and does like the [ __ ] scary movie run away. Like running down the street like, \"Dude, Lester, have him take two steps and fly to the corner and then cut away and then come back and he flies away.\" I'm like, \"Dude,",
            "start": 6273.04
        },
        {
            "text": "you still keep hearing this kid.\" Superman. No. It was in the sequence that I remembered that they were still in the movie.\n Yeah.\n Like you had the long gaps without seeing Christopher Ree. You had these long gaps without seeing the kid and Lana again. Yeah.\n So of course he can't he can't get the voices out of his head and he lands in a junkyard. There was like get the [ __ ] out of here. I saw him in Time magazine. They all run out. Leave it. And then yeah Superman separates. Evil Superman Clark Kent.\n And this is the Battle of the Titans. Of course, a fight representing their internal uh conundrum. I'd love to see the alternate like it's like spoilers, the end of Fight Club, evil Superman punching himself and rolling around in dirt and [ __ ]\n I uh this is was like traumatizing for me to watch as a a kid because the [ __ ] that happens in this is [ __ ] horrifying. Him, the the compactor",
            "start": 6321.92
        },
        {
            "text": "I uh this is was like traumatizing for me to watch as a a kid because the [ __ ] that happens in this is [ __ ] horrifying. Him, the the compactor\n getting crushed in the compactor, man. the thing smashing him and then it I mean we can go beat by beat if you want to but the [ __ ] thing ends with Superman on his knees getting the choking the life out of the other sup like the bad suit it's good it's like [ __ ] up and he's like kind of coming at the same time like there's a little [Music] and then he's back to himself and I'm like I'm like what the [ __ ] I was like what is happening I really don't need to see that face ever again with the shaking. With the shaking.\n I'm going to toss it in right now cuz it's just a funny ju just position that you might have missed. I don't know if you're that checked out at this point in the movie. But of course, we get the icon. We hear the music. You see the colors were back.",
            "start": 6364.32
        },
        {
            "text": "Oh [ __ ] there is color. Yeah, that's right. [ __ ] Yeah. There's a really funny moment at the end of the film when Gus is dropped off at the coal plant and Superman flies away and he's this long bit of like, is there a bus? They're not a bus. There's a computer. Are you friends with Superman? He's me Super Yeah, we go way and and he Gus does this and opens up his shirt. Gus, how the [ __ ] do you know how Superman disroes to show his sibling?\n Yeah, that's a very good point.\n You're playing you're playing with information you shouldn't know there, Gus.\n Anyways, uh Superman's back to normal now, right? And so, uh he is down to [ __ ] this [ __ ] up sideways. And so he goes back oh back to it. They've been building the [ __ ] thing. Uh they're ready to open up the computer. So they all go to this canyon. Uh they the the three bad guys take their balloons down, their little balloon contraption machines. Sure.",
            "start": 6422.4
        },
        {
            "text": "Sure. So Gus rides a mule down and they get in there and they start the three bad guys turn on the machines and get everything running. Superman goes to his [ __ ] palace and the ski slopes on this Webster thing cuz he figured out it was like wait a second. Oh, actually Superman first goes and puts the oil back in the tanker. He does do that right away. I love that scene.\n Then he goes, \"Yeah, blows it all back.\"\n A lot of sea water in that useless.",
            "start": 6474.08
        },
        {
            "text": "Then he goes, \"Yeah, blows it all back.\"\n A lot of sea water in that useless.\n You know, we take it for granted, I think, with where superhero films are now and blah blah blah and like the acting part of all this and even Christopher Ree and how great he was in Superman one and, you know, standing up and all when he's that is looks as good as it can look. When he's doing the heat vision, he's doing a really interesting thing. I imagine without the heat vision effect that we see is he's just like like moving and I'm like, damn, you're really [ __ ] acting this out that you're doing heat vision. I liked it. Whatever. Good for you, Chris.\n Uh, anyways though, then he flies back to [ __ ] Palace where he walks in. No, he knows nothing of what's happening.",
            "start": 6492.24
        },
        {
            "text": "Zero memory, but he remembers the smell. You know what I mean? He walks in. He must No, he must remember. He knows to go back there, but he figured out that this woman wanted him to punch a hole in the tanker. And so he's like, there must be more to this than that. He goes in there, walks in, they're not there. instead an automated message from Vera Play saying come fight us which is such a why are you giving this away you know what I mean like why would you do this and like I I was listening to a podcast about Superman [ __ ] or it was a YouTube video about Superman 3 when I was what don't I know kind of thing and they raised a great point and the guy was very much like this isn't even my point but like this is where it's a cardinal sin of this movie not to have Lois is that Lois could have been in the background cutaways to her obviously but of her putting that pieces together that this is all connected. This is a Webster plan. Like this is what instead it really is that like",
            "start": 6529.2
        },
        {
            "text": "have been in the background cutaways to her obviously but of her putting that pieces together that this is all connected. This is a Webster plan. Like this is what instead it really is that like Superman got in their way kind of by stopping a natural disaster. Which if I'm a super villain or a villain, he's not even Maybe I would be like, well, maybe we should pump the brakes if Superman's getting involved. Or man, that was a one-off. He's not He doesn't know we caused it. [ __ ] it, keep going. Then they bring the fight to Superman, do all this stuff, and then give their location away to Superman again where it's just like, whoa, okay.",
            "start": 6575.92
        },
        {
            "text": "Not only that, deprive us of the scene of her confronting bad Superman would have been great. Lois Lane versus bad Superman would have been amazing and her being like having to have that moment like talking him out of it or getting bringing the goodness back to him. I do want to point out um before Richard Prior decides to go down on his pack mule,\n he says the line, \"I don't believe a man can fly.\"\n Which is great. Little insider\n tagline of the first movie. You'll believe me. Anyways,\n all right. Oh, you really like it?\n No, not at all. But I was just thought, don't the balloon things look fun?",
            "start": 6605.28
        },
        {
            "text": "tagline of the first movie. You'll believe me. Anyways,\n all right. Oh, you really like it?\n No, not at all. But I was just thought, don't the balloon things look fun?\n Yeah, sure. Uh, then of course, yeah, it's time to go. Superman is coming to fight them as they wanted. And they have come gone through and made a video game out of this, Andy. You know how easy it is to make video games like this. So, they went and animated Superman from different angles. So, they he could do all this [ __ ] and they could shoot out. You're going to use all your rockets, Webster, Bubba, or whatever. or BBA, whatever they call him. Uh, and then\n again, so much of this felt like a TV episode.",
            "start": 6627.2
        },
        {
            "text": "again, so much of this felt like a TV episode.\n Yeah. They fire the big missile, of course, where they're like, \"Let's do this and let's distract that.\" So, he the big missile eventually hits him and just he tumbles a bit and then he's still [ __ ] Superman and comes back. Uh, eventually Richard Prior comes in and sees them using his machine for evil and he's shocked that they're using this.\n Yeah, exactly. No, you you knew you knew exactly what you're going to What do they shoot at him that in that? A\n lot of MAGA going on here of like we gave you I gave you this power not thinking you use this power for evil. No, you knew you knew what you voted for.\n What's this bubble that they shoot at him?\n Oh, it's an it's from the computer. Uh Superman\n Superman S is made out of",
            "start": 6659.6
        },
        {
            "text": "What's this bubble that they shoot at him?\n Oh, it's an it's from the computer. Uh Superman\n Superman S is made out of\n Superman comes in, says some [ __ ] All right, Busters, you're all in trouble. And then oh you in the pro like you think I'm with them cuz I've done everything they've ever asked and led to this exact point in the movie. I'm not with you look like you are to me, Mr. Four of you. Four of we\n Yeah, exactly. He He approaches. He gets the weird bubble that you're like then they're like, \"Let's see how\n you can breathe in space.\"",
            "start": 6694.24
        },
        {
            "text": "Yeah, exactly. He He approaches. He gets the weird bubble that you're like then they're like, \"Let's see how\n you can breathe in space.\"\n Yeah. How does he do without oxygen? I don't know, Vera. But he ends every [ __ ] movie flying in space. He's smiling at me. I'm not really worried about him getting choked out by this thing. Finally, Superman remembers I have heat vision and blasts through the [ __ ] thing to get out of it. Uh then of course it's time for the weird like, you know, uh GLaDOS machine coming down. It sets itself to kryptonite and what's that? It's kryptonite ray. Oh yeah, we figured out Gus, you [ __ ] idiot. We were able to figure out what the unknown chemical or the computer was because the computer's so smart.\n It's learning. It's a learning language model.",
            "start": 6714.96
        },
        {
            "text": "It's learning. It's a learning language model.\n Exactly. Superman melts there and they're like, \"Oh no, you know, Superman's going to die.\" Except this is what we wanted. I uh I glossed over this at the very very beginning and I think we've passed by it now. But I do want to point out yet again that at one point it is revealed that all everyone that works for Weber really knows computers. Like the sister's like they're quick studies. I have she's like I know more about computers than you'll ever [ __ ] know. Well then why don't you just why do we have Gus in this movie at all? And then the blonde lady's like I'm very very smart. And it's like so everyone knows computers across the board. What are you going to do?\n Cool. Cool.\n Gus has had enough. He grabs his yo-yo. I can't believe I've gone this entire movie without mentioning his [ __ ] yo-yo.\n Tim has a yo-yo he plays with throughout the movie because\n I didn't even realize that.",
            "start": 6749.76
        },
        {
            "text": "Tim has a yo-yo he plays with throughout the movie because\n I didn't even realize that.\n He busts it out, slides down a thing like Doc Brown at the end of Back to the Future. Uh figure out how he's going to stop this thing.\n He slides down and then runs back over and tries to and grabs the axe that's right by the ladder.\n No, not yet. Not yet. He goes in. He takes the one screw out of his computer that'll stop it.",
            "start": 6792.0
        },
        {
            "text": "Swallows it. This is when Webster comes down. He's like, \"Oh, you idiot.\" They get in a weird dumb little fight a little. He turns the camera, puts it in his mouth, swallows it. That's gonna [ __ ] up your mouth. Exactly. He's like, \"Okay, fine.\" The computer, the kryptonite ray stopped, and Superman's like, \"I'm starting to feel better.\" And instead of just moving three feet to the left or right, you know, Superman stays exactly where he is. Uh, then the computer's like, \"You know what? [ __ ] this. I'm alive. I'm going to pull my own energy from the [ __ ] sky and from the power cables and everything.\" thing. There's a blackout across the entire America. Oh, I'm a [ __ ] computer. Uh, the ray turns itself back on. It's blasting [ __ ] out of there, killing Superman. Gus grabs the axe that's sitting right there because of course, fire safety. We have to have this right here. They He runs over right next to the nougat.",
            "start": 6814.24
        },
        {
            "text": "He axes the [ __ ] out of this [ __ ] thing, right? Kills the kryptonite ray. Computer doesn't like that. Uh, Vera and Laura are like, \"We got to get out of here, Tootss.\" They come down. Lauraai's first out the door. Vera isn't. She gets pushed back in by the laser hand. The laser start coming here, right? And yeah, that happens and then I don't know. She gets pulled back in though and we get that horrendous wires grab her and pull her in.\n Good stuff. This is very very very\n The eyes.\n This is 80s movie [ __ ] This is Yes. The quicksand and lasers and all that stuff.\n Her eyes shut as humans and open as just the silver gray.",
            "start": 6858.24
        },
        {
            "text": "Good stuff. This is very very very\n The eyes.\n This is 80s movie [ __ ] This is Yes. The quicksand and lasers and all that stuff.\n Her eyes shut as humans and open as just the silver gray.\n So cool. She comes out looking like what I imagine Gen One Vicki from Small Wonder looked like before they got the human flash. Either the dad's still sad and he's missing this thought they're shot at. I don't know. Uh she comes out. She's got the [ __ ] telekinesis fingers. Everybody loves Superman, too. She's and they're but they're making telekinesis balls that are pushing people up against thing. Richard Prior's getting knocked around. Real good stuff here.",
            "start": 6884.96
        },
        {
            "text": "Scary when I was a kid. Um, you know, she's got Webster pinned down. Yeah. Superman flees. They're all like, \"Superman, no.\" He flies away. He comes back. Webster pinned down. This computer scans him cuz one of the bit was the computer can figure out how to beat anybody. It scans and sees that he just has regular old acid behind him. No threat there. Of course, we know what happens when the acid heats up, everybody. Uh, Superman comes up. He blasts the the\n white power back at her.\n No, guys.\n White power back at her.\n It's just regular old acid. There's no way this could possibly be a threat to anything around her.\n Hey, man, the computer is sensient and pulling electricity from the sky. You know what I mean?\n And it's like, so it's not worried about acid melting it wires at all.\n Not nearly enough acid to stop it. Yeah, makes sense.\n He's And not to mention the computer's made the person who's is the person still a person is Anyways,\n Andy, you missed a small wonder reference.",
            "start": 6921.12
        },
        {
            "text": "He's And not to mention the computer's made the person who's is the person still a person is Anyways,\n Andy, you missed a small wonder reference.\n We made it, buddy. We got there. Ah, I'll send you the clip.\n Thank you.\n Yeah, please do.\n Uh,\n it got dark. Then, you know, Superman gets grabbed and gets dragged towards it or whatever and is able to put down the acid on the outside as he gets sucked in.\n Here's a plot hole I feel of Have we established it's that hot inside of this computer? No, there's nothing that would have Well, I guess as it's things are exploding around it. I don't know. Nothing's exploding yet.\n No, I don't know why this acid actually heats up. I'm not quite sure. It's just like it's almost like we forgot we have a hero with heat eyes\n cuz what I would have done as director if I'm director Lester is I'm there and as Superman's getting wrapped up even there just two things out of it into the thing. So we see oh wow like",
            "start": 6969.2
        },
        {
            "text": "cuz what I would have done as director if I'm director Lester is I'm there and as Superman's getting wrapped up even there just two things out of it into the thing. So we see oh wow like\n he this was instead it just naturally warms up cuz it's what 180° I believe is what they was the problem with the it's 180° inside of this. Never thought about that.\n None of these people have ever put a cooling rig into their towering rig. I know. I mean, Andy, here's\n I thought you like that. I thought you like that.\n I I realize, Greg, that you don't PC game, so you've never sat in a room with an RTX3090 as you're playing Dune. It does get pretty hot.\n You see your You see your PC hit like, you know,\n 60 Celsius,\n 180°.",
            "start": 7008.4
        },
        {
            "text": "You see your You see your PC hit like, you know,\n 60 Celsius,\n 180°.\n Uh, anyways, it does the Ghostbusters 2 Scaleri Brothers that's flopping all over and just turning colors. It's cool. I like this. You know what I mean? But it splashes on some of the CPU and then it eats through the floor and falls down and like that was enough. That took it out. That's it.\n That did it. That was enough. You know what I mean?\n Thought it meant 740.",
            "start": 7045.6
        },
        {
            "text": "That did it. That was enough. You know what I mean?\n Thought it meant 740.\n Uh, you know, Superman gets out of there and he grabs Gus and he flies Gus around. Watch the trees. Gus hates being flown. Uh, then he's Superman stops at the coal plant because he needs to do something real quick, which of course is get it. Do you want Can you give me one of these? Like, yeah, sure. Superman. He crashes it into a diamond. Perfect. Like, all right, Gus. Let's go. And he's like, no [ __ ] thank you. I don't want to fly anymore. Even though that's awesome. You know what I mean? And I'm not going to jail, which is insane. You know, you just mentioned the three of them are going to go to jail.\n Um,\n and so yeah, this is the Does Hey, does your boss have a computer here? Yeah, rinky dink. Well, if he needs somebody to run it, this would be a great guy,",
            "start": 7063.76
        },
        {
            "text": "Um,\n and so yeah, this is the Does Hey, does your boss have a computer here? Yeah, rinky dink. Well, if he needs somebody to run it, this would be a great guy,\n I guess. Thank you, Superman, for the job reference, but I live in Metropolis and we're very far from Metropolis. Like, weird. Can you give me a Daily Planet Reco or something? Anything in Metropolis again? I almost killed you. I don't care what I did in the final seconds, okay? Like, not enough redemption for Greg Miller. He should have been in jail.\n I mean, dapping him up was still so great.\n Yeah, of course. I left that out. We didn't talk about it. Um, and so yeah, that we had the whole thing now of Gus like, \"Yeah, we're friends. 9 miles.\" 9 miles. Oh my god. 9 miles. Okay, I want to walk, but I don't want to work at a coal plant. That doesn't sound fun. Thank you. Uh,\n so many of these moments would be just deleted scenes in a movie that was trying to be better, you know?\n 100% right.",
            "start": 7094.0
        },
        {
            "text": "so many of these moments would be just deleted scenes in a movie that was trying to be better, you know?\n 100% right.\n Like this little improv bit here at the end. Oh, me enough.",
            "start": 7133.2
        },
        {
            "text": "Like this little improv bit here at the end. Oh, me enough.\n Um, they just really loved Richard Prior and audiences in 1983 did too apparently. Uh, Superman then go or I'm sorry, Clark then goes to visit Lana, who is staying at a hotel with Ricky, paying for room service, but I can only imagine how much this [ __ ] costs. Uh, again, what's Lana's salary as a secretary? She had this amazing house, you know. I don't I digress. Maybe she's getting alimony. Probably. That makes sense, Greg. Uh, they go but they go in there and, oh, Alana's got a date. Her mom's got a date with Superman tonight. That's [ __ ] weird. You know what I mean? That doesn't make much sense. But Clark says she can't do it. or sorry Superman can't do it, but I can if you'll have me. She's like, \"Sure, golly, Clark, that'd be great.\" And then also, you know, Superman was upset about that you had to pull your diamond ring. So, here's this one, which she puts on her ring finger like they're married. Which I was like,",
            "start": 7140.48
        },
        {
            "text": "but also this is like a 40 karat diamond.\n She will never have to work again in 1983.\n Sell that diamond and you're good.\n 100% 100%.\n Ask your buddy Clark to like cut this in a fourth.\n And like this is the one that like again always kind of makes me go, \"Huh?\" whenever something's happening of like even like the fact that like Martha Kent\n has to like work at a diner in the you know I mean like don't get me wrong but like like I don't you don't have to steal but like Superman just make a diamond that Clark turns\n show it off when it flies.\n Exactly. You know what I'm up to.\n Um anyways though, Brad shows up cuz again Brad is just a date rapist who will not take no for an answer. And so he shows up. I've always hated you can't. You're too nice. What are we [ __ ] talking about? But Clark just dodges it and then he kind of gives him the once over and he jumps off. He lands on a room service cart and rolls out\n to the elevator.",
            "start": 7191.68
        },
        {
            "text": "to the elevator.\n That was it. There's some oneliner here to end it, but I forget what the [ __ ] it is.\n Going down. I don't know. Who gives a [ __ ] Uh from there we go to the Daily Planet where Perry White is complimenting of course a very tan Lois Lane on I wish all my reporters could take a two week three week vacation and come back with top stories of whatever this Bermuda ring that's fleecing tourists or something. What the [ __ ] is the planet reporting on? You know what I mean? What the [ __ ] is this? Perry White, what kind of newsroom are you running?\n Why are there so many local stories happening at the Daily?",
            "start": 7243.68
        },
        {
            "text": "Why are there so many local stories happening at the Daily?\n Why do we care about this Smallville thing? Uh anyways though, Lois is there. She says uh by the way Clark, I might have some competition. I really liked your story. Okay, Lois. Uh, I especially like the girl, you know, whatever. Blah blah blah. And then Lana walks in. It's the newest hire. Look at this ring. Clark gave it to me. Clark gave it to you. Lois is kind of swimming. I'm used to being top dog around here, but clearly things have changed with Perry White's new uh uh uh uh uh secretary. Um Clark has some excuse to leave. I forget what it is. Uh then they wheel in the brand new computerized bingo machine.\n Oh my god, dude.\n Got to have this bit. This is This is such\n It's 1983, everybody. We don't trust computers, nor do we trust bingo machines. Bingo.\n It's Dude, it's it's an episode of TV. This is like the thing that the audience laughs at for the call backs.",
            "start": 7271.76
        },
        {
            "text": "It's 1983, everybody. We don't trust computers, nor do we trust bingo machines. Bingo.\n It's Dude, it's it's an episode of TV. This is like the thing that the audience laughs at for the call backs.\n Yeah. Like, [ __ ] man. Uh, think smokes. They all jump up and get step away in horror. Then, of course, there's one wrong left to right. Superman flies back to not leaning anymore by\n and he repushes the tower leaning tower of Pisa to his leaning state right as this poor guy had just gotten all his non-leaning towers of Pisa made. Superman waves flies off. The man asks for the broom starts smashing all his [ __ ] So angry. No. Then Superman does the same. Flies around this the earth looks at us and smiles and flies away.\n Superman 3.\n It's the first movie in this interview series I have to apologize for making you all watch. I assure you won't be the last. Matt Sanders says this whole movie is a deleted scene. Yeah,\n that's that's very very well put.",
            "start": 7309.28
        },
        {
            "text": "that's that's very very well put.\n It's it is it is I mean right now after Superman one and two it is the filler episode of TV. It's that filler episode. We need 22 episodes. Well, the main plot can't carry you that far. So here's the weird one where Clark goes to Smallville and Richard Prior is a guest star. Like what are we talking about?\n Yeah, exactly. Now it's time for Ragu Bagu. Ragu Bagu\n What's up everybody? Welcome to podcast within a podcast Rad guys talk bad guys where we of course rank all the bad guys of the Superman in review series. Currently the list looks like this. Number one is Zod Ursa Nan and Lex from Superman 2. Number two is Lex Luthor Otis and Miss Tesm from Superman. Where do we want to put Vera Laura Ross Webster? I Superman doesn't agree with me but I'm putting Richard Prior in there. Warman bad Superman Superman in there, too.\n Here's my thing. I I don't like him. I really don't like him, but like But Superman rocks.",
            "start": 7364.96
        },
        {
            "text": "Here's my thing. I I don't like him. I really don't like him, but like But Superman rocks.\n Do I like Richard Prior more than I like the first time of Lex? I don't know. It's pretty close. You all have strong feelings.\n I just like Bad Superman. I think Bad Superman's cool. I think he's better than\n Batman Superman. I put them last. Not not by leagues, not by like, oh man, but I mean I mean their plans and whatever, but I mean like I Luther Otis and Tesmacher from one I like their interplay together more than what I got here. I think again Richard Prior being like Gus Gorman as a character makes me angry with the film\n of like you he is a bad Superman take him to jail too. Like you know what I mean? Okay, here's my\n Why are we turning over a new leaf for this guy who also isn't taking You just got him a job, an honest job with honest people at a coal factory.\n Yeah, he's not going to stay. He's going there. Like, what are we talking about?",
            "start": 7422.72
        },
        {
            "text": "Yeah, he's not going to stay. He's going there. Like, what are we talking about?\n Well, here's what I was saying. My counter argument for that is at least the the Webster character, which is just a knockoff of of Lex Luthther. They're all competent, capable people whose planes actually kind of work and they make a supercomput that almost kills Superman. And also,\n I would take Gene Hackman over all of them any day.\n I would take Ned Batty over all. Yeah, me too. I love\n comedic bits and all that. All right, so there you go then. We're putting him at third. Gus, Vera, Laura, Ross, Bad Superman go in at three on Superman 3. And even though we've been rough on this film, Tim, we do need to do Secret Delights. Super Secret Delights, where we talk about an unranked list of what we actually enjoyed. So far, for Super Secret Delights, we have Superman one. Tim's was Super Horny Superman.\n Yeah.",
            "start": 7476.0
        },
        {
            "text": "Yeah.\n Or the movie. The movie being super horny. Uh Superman 2, I got the secret delight. I put in Ursa's open leg on her costume. Tim also put in Lex's Lex baby. Just the quote of Lex baby.\n Lex baby.\n What? Superman 3. I think the Is the secret delight bad Superman? Is that Or do we know? Is that not even a secret? Is it Is it the fact that even me kind of forgot that Superman had sex with this woman?\n Was it Christopher Ree in a suit?\n I mean, it could be Superman's probably getting laid.\n The back fabric. No, that's not a bad one. That's not a bad one.\n Superman. All right. Yeah. Superman in a tuxedo. Christopher or even a tuxedo? Yeah. Yeah. Yeah.\n All right. Great. Back to you, Tim.",
            "start": 7518.4
        },
        {
            "text": "Superman. All right. Yeah. Superman in a tuxedo. Christopher or even a tuxedo? Yeah. Yeah. Yeah.\n All right. Great. Back to you, Tim.\n Now, it's time to rank the Superman movies. Currently, number one, we have Superman the movie. And at number two, we have Superman 2. Uh, we are doing this the old school in review way of doing the votes because there's not enough movies for us to have to do all the calculations and whatnot. Where do we want to put Superman 3?\n Dead last. Number three.\n Dead last with a bullet. Yeah. Yeah, I don't think there's any well. This is definitely\n Yeah, it just this movie just is such a jumbled mess of stuff. Superman, Superman 2, Superman 3. Okay. Yeah. Will we tradition? Will four come last next week? We'll have to wait. The quest for peace.\n Tell me about this one now. Do you know anything about this one?\n I know one thing about this one that I'm incredibly excited about.\n Okay. And I'm going to spoil it right now.\n No, it's fine.\n Cover yours.",
            "start": 7550.16
        },
        {
            "text": "I know one thing about this one that I'm incredibly excited about.\n Okay. And I'm going to spoil it right now.\n No, it's fine.\n Cover yours.\n It's an hour and a half. Go get a car accident. Hour and a half run time.\n Oh, nice.\n It's 1 hour and 30 minutes. Yes.\n Sweet.\n Thank god. That's awesome.\n Destroy Superman.\n We'll see next week. Uh, let us know in the comments below what you think of Superman 3 and Richard Prior. And until next time, I love you all.\n Have a super day. Super. Super. Super. Hey. Hey. Hey. [Music]",
            "start": 7601.36
        }
    ]
}