{
    "id": 1525,
    "video_id": "K1TjGzFF_g8",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "NX Rumors - Kinda Funny Gamescast Ep. 55 (Pt. 1)",
    "description": "Let's discuss all of the recent NX rumors.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1454335201,
    "duration": 1645,
    "transcript_chunks": [
        {
            "text": "what's up guys welcome to the first ever episode 55 of the Kinda Funny Gamescast as always I'm Tim Gettys joined by the coolest dudes in video games Colin Moriarty and Greg Miller looking damn fine in that shirt look at my little let's play host let's play let's play what are you doing you just use this rag and wipe my phone down with water I just borked on the table if that's right with you it's okay it's just a it's a weird move even for you all a microfiber cloth that you wet mhm you're a weird person Colin this is what gave it away this is it this moment right here I mean because I I would never think you would do this cuz you're so sensitive about your microfiber cloths why wouldn't I why I put water on the water to do I don't know you're weird you don't know where that water's been this smartwater is it smartwater or did you refill that classic bottle and move well because you know I usually refill like the arrowhead bottles which are fine but",
            "start": 0.33
        },
        {
            "text": "where that water's been this Smartwater is it Smartwater or did you refill that classic call and move well because you know I usually refill like the Arrowhead bottles which are fine but when you go to the airport I've been I've been on an airplane 14 times in five weeks it's true 14 times um I get the I get the fine water bottles the Smartwater bottles or Nalgene not Nappa farms and these bottles have a lot of size to and they quality bottles man they got the little fishy you got the fishy in there no you got some other **** it's a monkey why the **** there a monkey in the water them monkey's drowning monkey think monkey do is what it says he's a monkey and he's drowning slowly the head I hate Arrowhead I hate Arrowhead with a **** passion it's all just bottled water no not Arrowhead except Fiji fiji's the **** I don't like Fiji either but Arrowhead is the real nasty nasty **** I just can't even handle it Smartwater's good Dan's Good's good Dan's good all the safe and whatever",
            "start": 51.2
        },
        {
            "text": "Fiji's the **** I don't like Fiji either but Arrowhead is the real nasty nasty **** I just can't even handle it Smartwater's good Dan's Good's good Dan's good all the safe and whatever Brands those are great those it's McDonald's water yeah like it it when you open it I don't like that good good I love Dan yeah it is Coke water yeah Arrowhead sucks I I don't like you I want I want Poland Spring but we can't get that here Mland Springs the **** happening things are falling over there 101 Dalmatians vinyl this house is a **** disaster that just like fell out of a hole in the wall Ladies and gentlemen the goat comes out This is the Kinda Funny Gamescast where every week we talk about video games and bottled water I hope you enjoy all of that if you do you should go to patreon.com/kindafunnygames you can get this beautiful show early for all you big beautiful kids out there if you don't want to do that you could just go to youtube.com/kindafunnygames subscribe there or",
            "start": 103.2
        },
        {
            "text": "kinda funny games you can get this beautiful show early for all you big beautiful kids out there if you don't want to do that you could just go to youtube.com/ kinda funny games subscribe there or go to itunes.com kinda funny subscribe there and things will just be given to you for free like you're a poor person how does that make you feel I'm a poor person too yeah you are poor I'm telling you right now this one's not worth a dollar no I'm taking it back what are you talking about see this is being mean you you got this 5:00 shadow and I said it was like you're evil Tim and you're evil Tim this is evil Tim mode I saw myself in the mirror last night and I was like holy **** that's a lie it was a selfie but I saw myself in my selfie and I was like oh this is the Tim I know and love like I'm back you're not back there you're in the weird evil period you've never been this mean to people this has been my like this was my modus operandi is that how you say that what the **** is wrong",
            "start": 152.04
        },
        {
            "text": "I'm back, you're not back, there. You're in the weird evil period. You've never been this mean to people. This has been my like... this was my modus operandi. Is that how you say that? What the **** is falling? Kevin, Superman 3 vinyl. The vinyls we were given along long time ago. So much shit's falling. I didn't even know that hole was there. It's not a hole; they were just leaning behind. Find new holes, anyway. Talk my video game... see this. I'm talking about this is Tim on another level. Yeah, this in between beard Tim. Yeah, I like it. Leave your comments down below what you think about evil Tim. What am I talking about the Nintendo NX? Throw it to you. So there's been a lot of rumors lately and Colin, you brought this to my attention that we haven't talked about it formally. MH, I feel like we talk about anx so much. I was saying no should hold off on it but then I thought about it. It's actually been quite a while since we really kind of delved deep into yeah well there are new significant new rumors",
            "start": 195.24
        },
        {
            "text": "anx so much I was saying no should hold off on it but then I thought about it it's actually been quite a while since we really kind of delved deep into yeah well there are new significant new rumors there's a bunch of **** I actually I looked at a couple articles and I'm going to read them to you guys and we'll discuss them Story Time everybody if you guys are familiar with Colin Moriarty and Greg Miller, I'm going to do my best impression that's not true I'm just going to read like anyone else read all right Alex Osborn over at IGN says a lot of Nintendo NX-related reports have surfaced offering a handful of potential clues as to what the company has planned for its next console according to a post on Twitter by The Wall Street Journal reporter Tekashi 6ix9ine, something Nintendo's next console may work with other devices including PCs, smartphones, and most interestingly other consoles like PlayStation 4 hell's to the Y yeah and if you look at the little document it actually also says Xbox",
            "start": 238.44
        },
        {
            "text": "may work with other devices including PCs, smartphones, and most interestingly other consoles like PlayStation 4. Hell's to the Y yeah, and if you look at the little document it actually also says Xbox One but that's okay. Additionally, an apparent survey from GfK, a client of Nintendo, has surfaced online by way of Twitter user Liam Robertson providing new details about Nintendo NX. And in addition to mentioning connectivity between a handheld and console unit, the survey also highlights an achievement-based system, 4K 60fps video streaming, and \"gameplay graphics that run in 900p at 60 FPS\" according to the rest of the survey provided by Twitter user Emily Rogers. Nintendo's console may have a free online service as well as a subscription option that includes more features for a yearly slim monthly fee. Backwards compatibility is also mentioned as the survey gauges interest in the ability to rent or purchase old games digitally, as well as support for previously owned digital and physical media oh",
            "start": 275.68
        },
        {
            "text": "backwards compatibility is also mentioned as the survey gauges interest in the ability to rent or purchase old games digitally as well as support for previously owned digital and physical media. Oh yeah, the second part of the survey also mentions a subscription-based game service that offers access to a library of over 150 titles that are changed regularly with new games added to the catalog 6 to 18 months after their release. The remainder of the survey compares various price options, hard drive configurations, and more across an array of different game platforms including Nintendo NX, Xbox One, PS4, and other stuff. And other stuff, yeah, there's also rumors uh people are talking about um there being an event before E3 that kind of announces the system and like blows that out, and then E3 is the real like you know let's look at the games. And then there's also interviews where people were talking about Metroid Prime and they're like \"is Metroid Prime going to come to Wii U?\"",
            "start": 321.64
        },
        {
            "text": "you know let's look at the games and then there's also rumors not rumors there's an interview where people were talking about Metroid Prime and they like is Metroid Prime going to come to Wii U cuz there was going to be a big Wii U game announced not big but a core Wii U game announced people like is it finally going to be Metroid and they're like nah if a Metroid Prime was to be made it would take three to four years to be made and it would be for the NX so cuz as Reggie said we know what you want we know what you want we know what kind of Metroid game you want not ready to give it to you yet but X will give it to you he didn't say that part but he was thinking it though they're waiting for E3 for that they'll do the little event first and then at E3 DMX is going to come out DMX ladies and gentlemen yeah St the Nintendo Direct so what do you guys think about this I I I there's so much of it I want to believe so much of it I don't believe in all these different things it's a survey surveys",
            "start": 362.16
        },
        {
            "text": "yeah St the Nintendo Direct so what do you guys think about this I I I there's so much of it I want to believe so much of it I don't believe in all these different things it's a survey surveys all the time are red herrings this that and the other I don't it's it was interesting to see how far these rumors made it based on just a survey you know what I mean uh we didn't talk about it there was a rumor going around of possibly having the handheld version of or handheld component of the NX out this fall and then the console component out next year sometime which would be so stupid and you hope that doesn't happen yeah um I hope it does just going to be funny that they would actually do that but I want them to succeed so we're Team NX here the connectivity between the PC makes sense you know what I mean we've seen that before with the consoles communicating with PCs and doing that the other the console to console connection is interesting I don't know what the hell that would be if",
            "start": 398.48
        },
        {
            "text": "know what I mean we've seen that before with the consoles communicating with PCs and doing that, the other console to console connection is interesting. I don't know what the hell that would be if it's just reading. I don't even know you know what I mean cuz it's not like you're linking them up like Windows makes it so easy to link up all these different devices and see other computers on this network, and D if it's something like that but I don't know what you're using it for then or yeah I mean that that's the part that makes the least sense to me because I just don't I can't even wrap my head around what that could mean because right now yeah you can you know look up Nintendo account stuff on your PS4 does that count like where's the line drawn of connectivity and what that actually means um and I think what would be insane is if this Nintendo service was available on other systems yeah and that is kind of what their semi hinting at here but again it is just a survey",
            "start": 443.84
        },
        {
            "text": "actually means um and I think what would be insane is if this Nintendo service was available on other systems yeah and that is kind of what their semi hinting at here but again it is just a survey so who knows what that means that'd be a huge success for Nintendo you know to be able to have the NX service on these real consoles yeah that'd be amazing but I mean I don't know like that's that would make NX succeed enough for me to make NX I love you XOXO a weekly podcast that'd be amazing where I get to talk about Nintendo that' be awesome if you did just go it would be great what do you think like what do you think the connectivity between the the things could be I don't know when I saw when I saw that I I I agree that you know this is weird uh based on you it's not all it's first of all it's not all based on survey information there people that are that are very trusted Emily Rogers for instance is a super trusted Nintendo source so like people that are talking about this are talking",
            "start": 478.92
        },
        {
            "text": "not all based on survey information there people that are that are very trusted Emily Rogers for instance is a super trusted Nintendo source so like people that are talking about this are talking about it from I think a place of a little bit more um I don't want to say like Insider information necessarily it's similar to how like GameOverGreggy and I know a lot of things are true that we can't talk about but sometimes we talk like more confidently about the things that could happen because we know they're true so like I I wonder if um if there's something to that when someone from Wall Street Journal um is talking about his connections uh telling him this this and the other thing and then there's the survey and then Emily Rogers who you said Emily Rogers was one of the people you brought up right um who has broken many things about Nintendo in the past um so I I just wonder like how far some of these these rumors actually go to me when I first heard the PS4 thing I'm like that's really",
            "start": 520.96
        },
        {
            "text": "Right, um, who has broken many things about Nintendo in the past, um, so I, I just wonder like how far some of these these rumors actually go. To me when I first heard the PS4 thing, I'm like that's really brilliant, it's basically like middleware almost between, um, like uh the eShop and like these platforms and maybe even PlayStation and Microsoft announced that they'll run this sort of Nintendo it'll be app it'll be an app you can get but I don't think that's what it is. I, I think at the very least what it probably is is something like what Rocket League does which is talks to PC and PS4 at the same time and I'm wondering if like they just have all this information saying like we're we're not going to close the console off to communicating with other consoles but we still have to play the NX itself to play NX games or whatever because um I just don't see that they're going to because if what if they're saying is true then it's basically them just going third party and what the hell is",
            "start": 556.96
        },
        {
            "text": "NX itself to play NX games or whatever because um I just don't see that they're going to because if what if they're saying is true then it's basically them just going third party and what the hell is NX at all doesn't make any sense it's basically just like EA Access or something like that where you have like this this subscription model so I just uh I'm I was excited to see more information about NX but then I was disappointed because I'm like this just makes it even more convoluted like the the waters are even muddy like like I just don't I just don't know like what all this means but I do think that some of it or maybe even all of it is true in some sense we just don't know like to the degree of like how true it is because you can say like uh EA has a subscription thing on Xbox One the NX could just be a similar thing again um having that on its own console and maybe it has a game like Rocket League that will just talk to the other consoles too yeah um instead of really closing",
            "start": 593.92
        },
        {
            "text": "the NX could just be a similar thing again, having that on its own console and maybe it has a game like Rocket League that will just talk to the other consoles too yeah, um instead of really closing themselves off because Nintendo obviously always has this very closed-off ecosystem so I think that like we could either be reading way too much into it or we might not be reading enough into it yeah, um well something that I think is interesting is the fact that they say that new games will be added to the catalog 6 to 18 months after their release so a possible option would be that the old games, the Mario original trilogy on NES and like Super Nintendo games N64 games or whatever those could be subscription servers playable to everybody but the point of having the NX is kind of like our Patreon model where if you want it early if you want to play the new game when it comes out you need the NX but if you wait 18 months or whatever then you can get another that idea is like suicidal",
            "start": 627.88
        },
        {
            "text": "patreon model where if you want it early if you want to play the new game when it comes out you need the nx but if you wait 18 months or whatever then you can get another that idea is like suicidal though I hope I hope that thats not what it is because if its its the Tomb Raider effect right like Tomb Raider didnt really seem to push any Xbox Ones and it didnt sell very well because people are excited to play it but the reason square and Microsoft wanted to keep it quiet that it was coming to PS4 is because like you know like if you just have to wait a year to play Tomb Raider and you have all these other games to keep you distracted are you going to need the hardware at all so if Mario Galaxy 3 comes out or whatever and its and its on nx and you have to wait a year to play it on PS4 through some sort of Subscription Service how many people are just going to be like all right well Ill wa I think the easier way to go would be that the nx is what were talking about",
            "start": 666.32
        },
        {
            "text": "play it on PS4 through some sort of Subscription Service how many people are just going to be like all right well I'll wa I think the easier way to go would be that the NX is what we're talking about this app right let's say that gets on Xbox One PS4 or whatever would be everything backwards right where yeah you're getting windowed content maybe it's even like PlayStation Plus in a way right where it's like let's say you have the NX and you there's this so there's the NX console in this I'm just going to call it the NX app right the NX app could give you on PlayStation and Xbox a random selection that you're subscribed to and so for like three months right all these Nintendo games are on there but then at the three-month Mark they go away unless you're playing on NX right I'm talking about old stuff classic games s NES that's kind of what it said here it said that they're going to cycle through the games and stuff what I'm saying is that's only old stuff like you're not going to see",
            "start": 699.24
        },
        {
            "text": "old stuff classic games on the NES that's kind of what it said here, it said that they're going to cycle through the games and stuff. What I'm saying is that's only old stuff, like you're not going to see Metroid Prime NX console game ever over here on any part of this well. So what that's the thing when it says with new games added to the catalog 6 to 18 months after their release implies that it is new games. Like I don't think that means new old games because because that says 150 titles that are changed regularly, with new games added to the catalog 6 to 18 months after but that's the I mean I read that I get regular meaning weekly monthly it be it's changed out and then the new games are added way later you know yeah I I I mean this is this is it's exciting because if it is what it sounds it could be then this is Nintendo, this is a truly radically different Nintendo but you have to but if it is what it seems like it's going to be then why are they making hardware at all so",
            "start": 735.2
        },
        {
            "text": "could be then this is Nintendo, this is a truly radically different Nintendo, but you have to but if it is what it seems like it's going to be then why are they making hardware at all so it's it's um I still think that they're they're like they're talking about like the games running in 900p like the G this the system is that weak that that's like the one thing that's the one thing that that and I have no I'm not one of these resolution people I don't like I don't give a **** like it's fine I don't care it can look like an NES game, is it fun that's really all that matters um but when I heard that I'm like Jesus like my my conjecture although kind of radical considering Nintendo's consoles have always been kind of weak um compared to some of their contemporaries for the most part um I thought that they would be smarter uh than doing something like that because this sounds like a system that's actually quite weak we talked about this on Colin and GG live but and that was",
            "start": 778.76
        },
        {
            "text": "Part of me, I thought they would be smarter uh than doing something like that because this sounds like a system that's actually quite weak. We talked about this on Colin and GG Live, but and that was a sticking point for me too. But the thing to keep in mind is if this being a survey that's such a random number 900p at 60 FPS - there's no way that that's just the standard that everything is going to be 60 frames per second and 900p. You look at Wii U, and so many games are 900p now or 1080p, some are 60, some are 30, whatever. So it's like it's weird that they even call that out, especially when they call out video at 4K 60fps video streaming - like that just means not everything's going to be that. Yeah, it just seems like that might be the standard. I mean, that was the huge problem with Xbox One, which is that it seemed like it was having a hard time running games at 60 frames at 1080p, so um you have to scale back the resolution to",
            "start": 815.52
        },
        {
            "text": "I mean that that was the huge problem with Xbox One, which is that it was it seemed like it was having a hard time running games at 60 frames at 1080p so um you have to scale back the resolution to get the games running at a solid frame rate Nintendo might just be trying to hit a benchmark um for all the games but I don't really know that **** I just don't even care because that's like not that that's not important to me it just tells me that why would they say that if that wasn't going to be some sort of important yeah I mean it is weird and it's also weird that they call it gameplay Graphics that run at 900p like it's that whole sentence to me reads is like there's something that we don't understand about that cuz that's weird there's no reason that 900p would be like well we couldn't make it 1080 so we're just going to 900 that's what we're just going to say unless they're just they're owning that they're like we're not getting 1080 and it it's going to be like the Xbox thing",
            "start": 855.08
        },
        {
            "text": "make it 1080 so we're just going to 900, that's what we're just going to say unless they're just owning that, they're like we're not getting 1080 and it it's going to be like the Xbox thing but Xbox kind of made it sound like it was so there were always those \"Shifty\" things but at least if Nintendo comes out it's just like it is what it is, that's what you're getting there's just a lot of questions Beyond just the the technical ramifications of what they're doing in terms of if if there is a subscription service and it does run on these consoles which remains to be seen if that's what they really mean I I I just don't know if that's what they really mean it can't um if if that if that's the case it doesn't make it just doesn't make sense yeah it doesn't and and so I want to be clear about that that I don't know if that's that that's the that's the part that's most dubious but if that's the case then like what is the what is the play um take like are there achievements",
            "start": 891.36
        },
        {
            "text": "\"Clear about that, I don't know if that's the part that's most dubious, but if that's the case then like what is the play? Um, take like are there achievements and trophies on these games? How much does it cost? But they said there's an achievement system that I know of Nintendo, but if they're going to put something on PS4 then their Achievement System isn't going to work. And I'm sure Sony's not going to let Mario Galaxy be played and you're going to earn Nintendo achievements but not trophies like that's just... They even did that to their PS2 games to unify everything there's just a lot of weird questions which is why I think that that's not what they mean. MH, um yeah I'd love to be at Nintendo right now watching them react to these rumors, you know the stuff leaks and it's just like why did you put up this survey? Why would you say that? Why would you phrase it this way? What are you talking about and they're partners\"",
            "start": 927.28
        },
        {
            "text": "to these rumors you know the stuff leaks and it's just like why did you put up this survey why would you say that why would you phrase it this way what are you talking about and they're Partners you yeah but I mean if if the other exciting thing is that if it is what they mean and they are going to have some sort of Nintendo subscription service that just plays old games on other consoles which I think would be shrewd maybe maybe shrewd maybe not depending on the reality of how long people want to wait and what games are on this on their Subscription Service then you have to wonder like what kind of conversations they had with the platform holders because if that's the case and this is just a radically different Nintendo with a radically different idea and it's a Nintendo that's swallowing its pride which I think they should have done by just announcing that they're not doing hardware at all um but or at least a handheld maybe but not a console um it sounds like",
            "start": 960.24
        },
        {
            "text": "its Pride which I think they should have done by just announcing that they're not doing Hardware at all um but or at least a handheld maybe but not not a console um it's what this sounds like to me is you can't judge it based on the rumors because we just don't know what it is we don't know what's true and what's not but what this sounds like compared to the rumors about Project Cafe for instance or um uh Revolution or Dolphin is you know I remember hearing about Dolphin and Revolution and you know waggle and all this kind of stuff kind of easy to wrap your head around this sounds convoluted as hell and if these rumors are true man like they're they need to simplify and it sounds like they're not simplifying like to Greg's point the the idea or the rumor and it's just conjecture but the rumor that they're going to release the handheld component first and the console later is like one of the if they **** do that that is the stupidest that is stupid just wait you know just don't",
            "start": 992.56
        },
        {
            "text": "the rumor that they're going to release the handheld component first and the console later is like one of the if they **** do that that is the stupidest that is stupid just wait you know just don't release anything until it's all ready and I I I still don't believe it's coming out this year like any of it but um because it just seems so sudden all the rumors point to it though I mean that's the thing like looking through a bunch of different sources all all the analysts all the like rumors stuff It All Leads to this year it's it just seems sudden I'll tell you why because um so PS4 for instance was revealed in February of 2013 and it came out in November so there there was a 10-month gap or so nine month gap even but Orbis was rumored for a long time before that and we had specifics about Orbis and you'll remember that I was one of the people that broke the the the story of of the controller um you know through our sources or whatever and the light bar and all that kind of stuff",
            "start": 1028.56
        },
        {
            "text": "about Orbis and you'll remember that I was one of the people that broke the story of the controller, um, through our sources or whatever, and the light bar and all that kind of stuff when I was at IGN. That story leaked and I was the one who wanted to talk to some people and figure out that it was real. So we had like some information, in other words, if this thing's coming out then everyone has it, you know, and no one's saying anything about it. It's easy to get out of Ubisoft, like the Assassin's Creed game that's coming out two years from now, but no one's talking about this hardware that they have. I just believe that people abide by their NDAs, I mean obviously everyone does, I mean people like PS Sports and Xbox One's as well, but people did leak a lot of information about that kind of stuff. And so I just wonder how proliferated the console is and if it's really going to be ready to go in the fall. I would rather",
            "start": 1066.64
        },
        {
            "text": "well but people did leak a lot of information about that kind of stuff and so I just wonder how widespread the Nintendo Switch is and if it's really going to be ready to go in the fall and I would rather Nintendo just take their time and do it right and burn a little bit of cash than just try to rush to market something that already seems like it's going to have a significant uphill battle against this competition anyway so I don't know we'll see what happens it's it's super exciting um because we're not going to get hardware from Microsoft or PlayStation for you know quite a while 2019 or 2020 so it's cool to have like an interstitial console but I will say that these consoles that come out in the middle of cycles don't work out mhm so yeah I mean I'm definitely I'm definitely hoping what's crazy to me is the fact that we're getting hardware and this is something different like the fact that it is a handheld console hybrid what the hell does that even mean like",
            "start": 1103.68
        },
        {
            "text": "definitely hoping what's crazy to me is the fact that we're getting hardware and this is something different like the fact that it is a handheld console hybrid, what the hell does that even mean, like we've wrapped our head around oh that's what it's going to be and and all that stuff but I still can't fathom what that looks like in an actual real you know scenario where these games are coming out and stuff maybe the hardware is something where it is uh the NX app is the whole Crux of the entire thing and maybe there's no discs at all and maybe it is totally a yeah you're playing on PlayStation or Xbox or PC or whatever it is but then the you figure the thing would be like and it's this is just in the weeds totally crazy it won't happen but like what would make you buy the NX right if you're already playing the NX games or app or whatever you want to call it right and why is it 900 not this maybe it the the hook and why we're talking about you know this handheld versus then the",
            "start": 1144.76
        },
        {
            "text": "if you're already playing the NX games or app or whatever you want to call it, right, and why is it 900 not this maybe it's the hook and why we're talking about you know this handheld versus then the console coming later is the fact that the hook is the handheld, right, that you buy this machine and it's got the app dialed in if you have Wi-Fi and you can play all your Nintendo games there, and there's going to be a console component that's basically the receiver that puts it onto your TV at some point if you don't want to wait, you know, if you right now you could buy this and have this portable device that goes anywhere with you or you can play you know a selection of the games with these limitations on your Xbox on your uh PlayStation to see if you like it or don't care and you get hooked into buying the thing and then the console comes out and you are playing it that way off onto your big screen TV and that'd be why the resolution is dialed down, right I don't think the handheld's what",
            "start": 1186.76
        },
        {
            "text": "buying the thing and then the console comes out and you are playing it that way off onto your big screen TV and that'd be why the resolution is dialed down right I don't think the hand that's what I'm saying like that makes more sense to me in terms of like having the hybrid console thing of like just the system not being what we typically think of as a hardware console thing it's it's going to be something different and new um or it's not or it is just going to be the Wii U again and then oh but instead of the GamePad being tethered you can bring it other places like that would then be the only difference and maybe there's apps and stuff places and you know so it's you're right like they need to like make a big change and a big move to be able to actually do anything differently or else it's just going to be the same weird experimental mistakes over and over yeah if the reliance is on other hardware then I think they're making the right play and if the run is on the other hardware",
            "start": 1221.04
        },
        {
            "text": "it's just going to be the same weird experimental mistakes over and over yeah if the rumor is on other Hardware then I think they're making the right play and if the rumor is on the other Hardware the most fascinating part about it is Microsoft and Sony already know um and that's even more interesting and what's even more interesting even though it said the rumor says all consoles are they just chose one of them now like if if I were if I were them that's exactly what I would have done and I would have went with Microsoft um if I were them simply because of the bad blood between them and Sony going back many years um so it's it's although that's perceived who know who knows if they even how many in the organization Nintendo really did **** Sony um and then Sony really did **** Nintendo so um with their own device basically everybody's **** um but it's it's interesting to think about the strategy behind NX in terms of Nintendo and I've said this before I know it",
            "start": 1259.6
        },
        {
            "text": "Nintendo so um with their own device basically everybody's **** um but it's it's interesting to think about the strategy behind NX in terms of um they Nintendo and I've said this before I know it bothers some people but Nintendo's audience is shrinking it's demonstrable it's obvious and like the play has to be more than just another Nintendo console or it will fail so um because Wii U was not enough it was not enough to get anyone to care about it and some people cared it but you know what he means you know to be successful and financially viable we sold 103 million units or something like that and the Wii U will be lucky to hit 12 million there's something there's something sign 24 there's something significantly wrong with that situation GameCube was considered I loved GameCube except for the NES that might be my favorite Nintendo console and that was considered a miserable failure and it sold twice as many more than twice as many units as the Wii U so they're trailing and",
            "start": 1296.84
        },
        {
            "text": "except for the NES that might be my favorite Nintendo console and that was considered a miserable failure and it sold twice as many more than twice as many units as the Wii U so they're trailing and tracking in the wrong direction and the same thing's happening with 3DS it's not as pronounced but it's actually like a you know DS DS Light DSi 150 152 million units DS 3DS 50 million or so so it's it's they need to figure out how to make a big splash and honestly it seems like the strategy should have been and might be to just go with the other guys in some way that still let you have this like proprietary Nintendo feel where you have to boot up this thing that's Nintendo but it's on PS4 and it's on Xbox One and these companies are so excited about the fact that they're going to get Nintendo games on their consoles just let them do whatever the **** they want yeah um and enable trophies and enable achievements and have Xbox Live and PSN functionality and all that kind of stuff that's what I",
            "start": 1343.72
        },
        {
            "text": "on their console just let them do whatever the **** they want yeah um and enable trophies and enable achievements and have Xbox Live and PSN functionality and all that kind of stuff that's what I get most excited about but it's just that's just too good to be true because this is Nintendo and they don't and they don't make choices like that but it is a new Nintendo and a different Nintendo a lot of really set in motion a different kind of feel with the mobile games and DNA and all these kinds of things so I just want to see how this all shakes out like the more content there is the more frustrating it becomes the think of think about it in the way we talk about it right like let's say the handheld console thing that's real and what we're talking about is real and that's the that's the hook to it right the app is going to be on this you get to play them that way great but you can buy our this thing that's a handheld and will one day be a console right if that's the case then",
            "start": 1384.16
        },
        {
            "text": "\"Hook to it right. The app is going to be on this, you get to play them that way great but you can buy our own this thing that's a handheld and will one day be a console right if that's the case then theoretically Nintendo isn't going to become their own developer or publisher like onto other platforms right so that hardware doesn't necessarily have to be out in the wild in that many spots. Is Ubisoft really making a thing for the NX to get their game on no, like you know what I mean? This would be Nintendo's device to play Nintendo games or to play Nintendo games on their app at which point the handheld console is locked behind closed doors in Tokyo and nobody is going to talk about it or do anything until it comes out because you don't need to get in the hands of developers if NX is a console or a hybrid of some sort, which it probably is, and there's no meaningful new game functionality on the other consoles and it's for Nintendo games only. The thing it's gonna fail I'm just\"",
            "start": 1416.2
        },
        {
            "text": "is a console or a hybrid of some sort, which it probably is, and there's no meaningful new game functionality on the other consoles. It's for Nintendo games only; the thing is gonna fail, I'm just saying that right now. No one's like it's gonna fail; it's gonna be even worse than the Wii U. So, they can't do that – they just can't create a system to play Just Nintendo games. They just did that, and it didn't sell. Nothing on that console resonated with a large group of people. A lot of those games sold one, two, three, four million copies; a game like Mario Kart seems to have a one-to-two attach rate, which is huge. But predictably, it didn't really move units. Splatoon didn't really move units; Smash didn't really move units. It's the Nintendo fans are buying the Nintendo console, and there are fewer and fewer of them as you go along. So they need to figure out I hope that's not true because they might as well not even bother if that's the case.",
            "start": 1455.48
        },
        {
            "text": "buying the Nintendo console and there are fewer and fewer of them as you go along so they need to figure out I hope that's not true because they might as well not even bother if that if that's the case but I mean if they do that then they get those millions plus all of the other stuff from the other things then all of a sudden like maybe that's worth it you know like just getting old Nintendo games for the NX right Nintendo makes Super Mario X or whatever, right 4 is not correct so let's assume he means \"for\" and not a number, and also assuming he means \"Super Mario\" as in a hypothetical game title, but more likely referring to the fact that they make Super Mario games.  and it's awesome you're playing on your PS4 and you're having a great time you're like man this is cool and I'd love to play this on the road or that on the road and d and like that's cuz that's the other thing is like the NX Hardware let's say they're selling it by itself to begin with and it's super cheap it's 100 it's $99.99 right to have this controller device that Wi-Fi enabled and uses the app and da da da you put in not you know you put in memory cards but not like proprietary memory cards you're putting in",
            "start": 1496.36
        },
        {
            "text": "$99.99 right to have this controller device that Wi-Fi enabled and uses the app and da da da you put in not you know you put in memory cards but not like proprietary memory cards you're putting in you know regular memory storage like SD cards that we're using I mean that's all too good to be true but I hope I hope and the the only reason I I even allow myself to go down that that tunnel of believing is that when these when the NX was first announced it was like we 3DS and there was those like circles and all that stuff then NX was like a weird other thing so it's like it's clearly going to be different it's not just a console and it's not just a handheld and it might not even be even just a hybrid like it's something new and something different and it probably has to do with the cloud and all this **** so I don't know I hope my most the thing I'm looking forward to most is E3 and seeing what they do there but now here's the question do you think there's going to still so what about",
            "start": 1532.64
        },
        {
            "text": "all this nonsense so I don't know I hope my most the thing I'm looking forward to most is E3 and seeing what they do there but now here's the question do you think there's going to still be an event you think cuz that's what we've been predicting and we are getting close to have to be a PlayStation event was in February Xbox was March May okay I remember May or April maybe it was it was it was a couple months after I hope that they don't say anything till E3 they just say we're back at E3 we'll see at the conference yeah I I don't agree with the need to show it and then let people marinate on it it can't be that revolutionary the like you just go to E3 and just show everyone we have I think that would be way more exciting and way cooler and like way more make a bigger splash if everyone goes in and they really keep their mouth shut and no one knows what the hell's happening I think that's awesome at E3",
            "start": 1572.84
        },
        {
            "text": "and way cooler and like way more just make a bigger Splash if everyone goes in and they really keep their mouth shut and no one knows what the hell's happening I think that's  awesome at E3 as opposed to like well we know what NX is now we see the games like H yeah we I think I have a pretty good idea where your games are that's not what's as exciting as it's not it's not what is as exciting as the initiative behind what they're doing and if we go in and we don't even know what the  console is and is it a hybrid is it a console is it a handheld is it a service like and you have no you just have a bunch of questions and nothing leaks that's more exciting",
            "start": 1613.24
        }
    ]
}