{
    "id": 4094,
    "video_id": "PXANHMF1aDo",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Tim Gettys",
        "Imran Khan"
    ],
    "title": "Activision Lays Off Hundreds of Employees - Kinda Funny Games Daily 02.13.19",
    "description": "Start your trial month of Hims for $5 at http://forhims.com/gamesdaily\n\nGame Informer's Imran Khan joins Tim to discuss all the latest Activision news, Amy Henning's vision for the future of gaming, and Nintendo Direct predictions.\n\nTime Codes - \n00:01:28 - Housekeeping\nGreg’s hosting the 22nd Annuals DICE Awards Wednesday night with Jessica Chobot. We’ll be hosting on Twitch at 8 p.m. PT.\nDon’t forget the Kinda Funny World Tour rolls on! This Sunday, we’re in San Francisco at Triple Voodoo Brewery at 3 p.m. Then, it’s Kansas City on March 30th and New York on April 6th. Get the full rundown on kindafunny.com/events.\nThank you to our Patreon Producers: Tom Bock, TJ Meehan, Joebeezer, Trevor Starkey, Mohammed Mohammed, and Black Jack!\nThe Roper Report   -\n00:02:20 - Activision Blizzard Lays Off Hundreds of Employees (Kotaku Jason Schreier)\n00:06:10 - Nano Biologist - Are any form of layoffs good? - Best Friend Q.\n00:08:10 - Farmer Josh - What the hell does Activision even publish? - Best Friend Q.\n00:11:49 - Call of Duty 2019 WIll Feature Campaign (Luke Reily IGN)\n00:14:24 -  Blizzard Has “No Major Frontline Release Planned for 2019” (Jessie Wade IGN)\n00:16:23 -  Amy Hennig Feels There Will be a Revolution in how we receive game content (Colin Stevens IGN)\n00:22:25 - Alex Russ - Do you think that narrative experiences will somehow become effected by the \"game as service\" format? - Best Friend Q.\n00:27:22 -  Xbox Announces Plans To Expand Gaming Through Technology (Jessie Wade IGN)\n00:31:00 - Metro Exodus Reviews are in!\n00:32:10 - Out today\n00:33:12 -  HIMS\nReader mail   -\n00:34:30 - My unpopular gaming opinion is that I think FF 8 was the best of the Playstation Final Fantasy titles, so I wanted to hear your guys thoughts on the matter. Why isn't Square Enix remastering it along with the other titles for switch? - WhyNotPete\n00:36:50 - From following you on Twitter and listening to your appearances on the GI Show, it seems like you always have your ear to the ground when it comes to Nintendo leaks and rumors (MP4 & Trilogy HD's development, Mother 3's localization being canceled). I was wondering if you had any scoops for us ahead of today's Direct. - LearnedAstronomer\n00:41:12 - I have a prediction for what might show up in the Nintendo Direct later today: Spyro Reignited. That aside, I personally think it's high-time that we get a port of Super Mario 3D World and an enhanced port of Super Mario Maker with the campaign from the 3DS version. I could even see Nintendo making a special cable that runs from the Switch to the Dock so that the Switch can function like the Wii U. What do you guys think? - Kbabz\n00:45:05 - With THQ Nordic reporting a sales increase of 713% do you see this as a sign that AA gaming might finally be making a resurgence? - MikeyD\n00:46:50 - Squad Up: Farmer Josh(PS4) Dumbace15\n00:48:05 - You‘re Wrong\nTomorrow’s host:Tim and Cheeks Jr\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1550090965,
    "duration": 3078,
    "transcript_chunks": [
        {
            "text": "[Music] what's up guys welcome to kind of funny games daily for Wednesday February 13 2019 I'm Tim Geddes joined by Imran Khan from Game Informer how you doing Tim I'm doing fantastic it's great to meet you I've heard about you for so many years from so many people mr. Newton you're one of the mists of Nintendo's in my heart okay yes that's what I've been told people tell me mr. Nintendo never understood why a lot of mr. Nintendo's yes it's you know there's a lot things going a lot of people might be wondering why I'm wearing glasses right now I don't normally wear glasses I have an eye exam today so I didn't want to wear my contacts does that sound like a hole to do pouring rain outside there's a lot going on big day of video game news ladies and gentlemen let's get right to it this is kind of funny games daily each and every weekday right here on twitch.tv slash kind of funny games we get together to talk about all of the video game news at 10:00 a.m. Pacific time you can watch live",
            "start": 0.98
        },
        {
            "text": "of funny games daily each and every weekday right here on twitch.tv slash kind of funny games we get together to talk about all of the video game news at 10:00 a.m. Pacific time you can watch live on Twitch or you can watch later on youtube.com slash kind of funny games or on podcast services around the globe just search for kind of funny games daily if you want to be part of the show you can head to patreon.com/scishow get to get the ad shoot there sorry the show ad-free it's gonna be a good one I'm telling you right now little housekeeping for you Greg is hosting the 22nd annual dice Awards tonight with Jessica Chobot will be hosting that on Twitch at 8 p.m. Pacific time don't forget the kind of funny world tour rolls on this Sunday we're in San Francisco at triple voodoo brewery at 3 p.m. then it's Kansas City on March 30th in New York on April 6 if you want more information on all that go to California comm slash events shout out to our patreon producers for helping make all that",
            "start": 47.04
        },
        {
            "text": "then it's Kansas City on March 30th in New York on April 6 if you want more information on all that go to California comm slash events shout out to our patreon producers for helping make all that happen tombak TJ Meehan joe beaser Trevor Starkey Muhammad Muhammad and black jack you guys are all fantastic today we're talking about the Activision layoffs we're talking about Amy Hennig Scott comments and stuff we're definitely me timeout someone intended direct predictions we're brought to you by hims but we'll tell you about that later for now let's begin with what is and forever will be the Roper report we have 7 news stories Baker dozen let's start off with the big one Activision Blizzard lays off hundreds of employees this comes from kotaku Jason Schreyer publisher Activision Blizzard has begun its long rumored layoff process informing employees this afternoon that it will be cutting staff on an earnings call this afternoon the company said that it would be eliminating 8% of its",
            "start": 97.35
        },
        {
            "text": "has begun its long rumored layoff process informing employees this afternoon that it will be cutting staff on an earnings call this afternoon the company said that it would be eliminating 8% of its staff in 2018 Activision Blizzard had roughly 9600 employees which would mean nearly 800 people are now out of work this afternoon the mega publisher began notifying those who are being laid off across its various organizations which include Activision Blizzard and King on the earnings call Activision Blizzard CEO Bobby Kotick told investors that the company had once again achieved record results in 2018 but if the company would be consolidating and restructuring because restructuring because of missed expectations for 2018 and lowered expectations for 2019 the company said it would be cutting mainly non game development departments and bolstering its development staff for franchises like Call of Duty and Diablo it a press release to investors this afternoon Activision CEO Bobby Kotick",
            "start": 143.96
        },
        {
            "text": "mainly non game development departments and bolstering its development staff for franchises like Call of Duty and Diablo it a press release to investors this afternoon Activision CEO Bobby Kotick wrote while our financial results for 2018 were the best in our history we didn't realize our full potential to help us reach our full potential we have made a number of important leadership changes these changes should enable us to achieve the many opportunities our industry affords us especially with our powerful owned franchises our strong commercial capabilities our direct digital connections to hundreds of millions of players and our extraordinarily talented employees you should go to Kotaku comm check out Jays and Schwarz article for way more information what more quotes from like every angle of all of this sad news it's incredibly sad that's 800 people in pretty much any other industry in the world or in the industry yeah it would be a thing of someone runs a presidential campaign",
            "start": 186.83
        },
        {
            "text": "angle of all of this sad news it's incredibly sad that's 800 people in pretty much any other industry in the world or in the industry yeah it would be a thing of someone runs a presidential campaign against mm-hmm like the fact that it kind of goes without note in the gaming industry is really sad and kind of telling ya it's it's absolutely nuts especially for him to start the phone call off saying we've had a record year yeah I call him to it funk or the phone call last night everybody's afternoon and I was like did I come in late is he really starting it by saying hey we're doing great yeah and then immediately like he doesn't really mention the layoffs so much in the actual phone call because it was to investors and it was to liked which makes sense from a business perspective not from a human being for speck yeah like but because I was doing the story at the same time because I was typing up the layoffs information when the phone call was going on it's like okay I'm talking to",
            "start": 225.98
        },
        {
            "text": "a human being for speck yeah like but because I was doing the story at the same time because I was typing up the layoffs information when the phone call was going on it's like okay I'm talking to Blizzard employees and people who are literally crying because either they lost their jobs or they know people who lose their jobs or they don't know yet yeah and hearing kodik talked so glowingly about how they well we made two billion dollars us here but we wanted to make three billions and we gotta like cut some losses I'm like but no that doesn't make anything from a business perspective or a very cold hard business productive I understand mm-hmm what they're doing but from the actual human protective of there's 800 people who aren't going to their lives have been at very least disrupted yeah like some of these people that have been there for upwards of 15 years yes like that that's crazy and for this to just all come yesterday but not really be as surprised because there'd been so many",
            "start": 269.94
        },
        {
            "text": "like some of these people that have been there for upwards of 15 years yes like that that's crazy and for this to just all come yesterday but not really be as surprised because there'd been so many rumblings and rumors going into it but for them to not know until yesterday is like that's it's just heartbreaking the Nano biologist writes in and says what the tragic news of the massive layoffs from Activision Blizzard yesterday I thought of a quasi devil's advocate question that I wanted to get your opinion on are any form of layoffs good there were rumors and tweets stating these firings affected mostly administrative slash advertising people who worked on destiny at Activision and PR eSports support people at Blizzard these are unsubstantiated claims but they led into my question later during the blizzard earnings call they announced they would be investing 20% more into all of their major properties including more into Warcraft in Diablo our layoffs okay if companies use that money",
            "start": 318.42
        },
        {
            "text": "the blizzard earnings call they announced they would be investing 20% more into all of their major properties including more into Warcraft in Diablo our layoffs okay if companies use that money to reinvest more into their properties to help them grow and succeed this is only a devil's advocate question and not the true and not my true opinion on the matter I truly hope that the people affected will be back on their feet soon after this very tragic and poorly handled events well you have to look at what they're actually saying there which is they're investing stuff into call duty in Diablo they're not investing into games in general what they're doing is they're cutting down on good general games and Activision and then kind of moving all that stuff to proven hits there it's a question of why are you cutting it down and the answer to make more money in the end so yes they're kind of expanding but they could just be replacing the things I'm cutting down like obviously they don't need a",
            "start": 360.09
        },
        {
            "text": "why are you cutting it down and the answer to make more money in the end so yes they're kind of expanding but they could just be replacing the things I'm cutting down like obviously they don't need a destiny marketing team anymore because I'm not doing destiny but they could do something else with that marketing team they're just not going to because they want to focus on the ones they know make money yeah so like do you really need to dance incentivize here's the storm worker those people move to something else so generally I I don't think there's a necessarily an ethical way to do layoffs yeah on this thing layoffs so just by definition a horrible thing you know that's good they're going to affect people's lives drastically and nobody wants to see them coming from any any side of it like even the the big dogs they don't want to have to have this whether that's from a ethical point of view or from a PR point of view like they don't want these headlines right so if they could avoid",
            "start": 395.01
        },
        {
            "text": "even the the big dogs they don't want to have to have this whether that's from a ethical point of view or from a PR point of view like they don't want these headlines right so if they could avoid them they would but it does get to a point where restructurings do need to happen every once in a while and it's gonna affect people it's just 800 people yeah is I've never heard of anything that ridiculous in our industry at least like that's just insane going off a little bit of what you were saying farmer Josh writes in and says hey kind of funny after hearing the activision blizzard layoffs I got to thinking what the hell does Activision even publish they have Call of Duty whatever Blizzard does and they had destiny I couldn't name a single other game they published anymore with that said sadly these layoffs aren't surprising how does Activision showcase their other titles and and are not Blizzard that aren't Blizzard or Call of Duty they can't continue being a one-trick pony if they want",
            "start": 437.28
        },
        {
            "text": "these layoffs aren't surprising how does Activision showcase their other titles and and are not Blizzard that aren't Blizzard or Call of Duty they can't continue being a one-trick pony if they want to be successful am I just in the minority of not knowing what they publish or is it a more widespread problem they're not a one-trick like they announced yesterday called are not called to the crash bandicoot a and million million yeah copies sold and I said too bad this is insane though and that's why you can see them with spiral with Crash Team Racing like they are investing in that stuff but again it is a kind of guaranteed hit yeah like I'm sure they're looking at it like all right development cost for these games marketing pushes for these games are not going to be astronomical we can put them out in a smaller way and guarantee that we're gonna get at least X return on it right right for in the last decade you looked at Activision and they really were on the forefront of the choice of",
            "start": 476.88
        },
        {
            "text": "them out in a smaller way and guarantee that we're gonna get at least X return on it right right for in the last decade you looked at Activision and they really were on the forefront of the choice of life thing with Skylanders and that was kind of one of big cash cows they have multiple cash cows I think that's an important thing to realize it's like one-trick pony is not entirely accurate because sure the one trick you're referring to is call of duty which is the biggest franchise in the world right you know then you add onto that you have Blizzard which has all the eSports side to it you know it has overwatch it has all this potential for revenue and it does sound like they're scaling back on that in certain ways but they're only scaling back to be able to make more money off of that then you look at the kind of kiddie platformer side thing with the crashing Spyro games and then Activision always just has other their hands in other pots yeah things are always going on whether it's",
            "start": 516.33
        },
        {
            "text": "you look at the kind of kiddie platformer side thing with the crashing Spyro games and then Activision always just has other their hands in other pots yeah things are always going on whether it's them trying to bring back the music genre and all that stuff or whatever I mean they got sicker own next month exactly like that is on a game you'd ever expect Activision to publish which tells me like there are people in that company that want to be like the traditional we have all this money why don't we spend it around kind of publisher but like there's also execs that are like well this isn't working or this is not making more money than it made last year yeah so we need to cut it list mm-hmm which I mean it's a it's an artistic medium so at some point there's probably going to be a reckoning or discussion about how these two things work together yeah it's very problematic for the art of the industry as you were just saying like compare them to Ubisoft right which I think currently are",
            "start": 559.75
        },
        {
            "text": "or discussion about how these two things work together yeah it's very problematic for the art of the industry as you were just saying like compare them to Ubisoft right which I think currently are the the best example of a third-party publisher developer that is kind of nailing it across the board on a bunch of different projects and focusing on the small indie art style projects as much as they are the big triple-a things as much as they are games to the service and I feel like you've really seen a kind of improvement in quality title for title over the last couple years over there right and you compare that to Activision and it just kind of seems like yeah they're they're boiling down to these couple key things they're just like we're just we're just gonna go we're gonna do this and then we're gonna lay off 800 people and like you look at Ubisoft from a labor perspective they never lay anyone off I've never written a story about you without ever laying anybody off Interest like",
            "start": 598.93
        },
        {
            "text": "then we're gonna lay off 800 people and like you look at Ubisoft from a labor perspective they never lay anyone off I've never written a story about you without ever laying anybody off Interest like there have been departures obviously yeah but mass layoffs never they don't they don't even close to if they close videos they move those people to other studios mmm means like it is a particular part of their policy they don't there's an older water quote that's in making the rounds the last couple of day or last day that he refused to ever lay anyone off from Tendo he cuts his own salary beforehand because he doesn't think people can work like make video games and a creative medium if they're worried about losing her job yeah absolutely and he did that because of the Wii U in a direct response to the the were you not being as big of successes they needed it to be that that is what we all want to see housed in here and it's not gonna happen and it didn't happen you know very sad news I",
            "start": 646.0
        },
        {
            "text": "to the the were you not being as big of successes they needed it to be that that is what we all want to see housed in here and it's not gonna happen and it didn't happen you know very sad news I hope that as many people as possible land on their feet from that continuing on with Activision news they'll call of duty' 2019 will feature a campaign this comes from Luke Riley at IGN Activision has established that 2019 s Call of Duty game will feature a campaign new Activision president Rob caustic explained 2019 s Call of Duty is set to feature an entirely new campaign a huge expansive multiplayer world and some fun co-op gameplay returning CFO Dennis Durkin added that the game would be a step forward for the series but also rooted in some of the franchise's most important history while Activision reported the college ID was the number one selling console franchise worldwide for 2018 Durkin said the company's anticipating lower q4 sales than black ops for conceding call of duty units are",
            "start": 685.47
        },
        {
            "text": "reported the college ID was the number one selling console franchise worldwide for 2018 Durkin said the company's anticipating lower q4 sales than black ops for conceding call of duty units are down year over year in our outlook what do you think could be the cause of that the reason it's down mm-hmm I the single-player campaign might be a part of it world war ii also did very very well like extremely well it bucked the trend of Call of Duty going down here over a year so it's down it's it was in trend of previous Call of Duty games but world war ii kind of like screwed that trend out by doing well mm-hmm but yeah I think the rumor was obviously that they had a campaign it just wasn't ready hmm so it didn't launch with the game then blackout did extremely well so they'd never really worried about it that much but this to me says yeah we know it was an issue it was a one-off thing next year it's going to be or this year I guess is going to be the actual like the Call of Duty people",
            "start": 731.52
        },
        {
            "text": "about it that much but this to me says yeah we know it was an issue it was a one-off thing next year it's going to be or this year I guess is going to be the actual like the Call of Duty people expect cuz it was last year were the first time it didn't Chipola single-player campaign yeah and people noted it like I talked to regular consumers that when they were about to buy the game when they found out there was no like single-player game for them to like go through we get all the achievement and like the itself came back or whatever they didn't buy it interesting do with Apex legends being the massive success that it is do you see Activision turning it up black out into a free-to-play I think they either have to do that or they have to move it to this this current year's game like they can't just leave it as a black ops 4 thing like you buy the disc or whatever they either have to spin it off on the battlenet or whatever they're doing with it and make it a free-to-play or cheap like",
            "start": 772.26
        },
        {
            "text": "just leave it as a black ops 4 thing like you buy the disc or whatever they either have to spin it off on the battlenet or whatever they're doing with it and make it a free-to-play or cheap like $15 mode or they have to move it to every year's game with new improvements every year because it has to be a living game like people people got and I'm gonna say tired of pub G but people moved on from pub G to fortnight and other things because those developers are much more reactive to their seasons yeah and all that stuff like if if you go onto the before night subreddit and complain about something someone from epic will be there like hey we're looking into it mm-hm if you go into the pub G chord pub g read it you'll see tons of complaints and no one ever responds yeah hey very telling and then moving on to Blizzard Blizzard has no major front line release planned for 2019 this comes from Jesse Wade at IGN Activision announced and its quarterly earnings called Tuesday that Blizzard will",
            "start": 814.23
        },
        {
            "text": "moving on to Blizzard Blizzard has no major front line release planned for 2019 this comes from Jesse Wade at IGN Activision announced and its quarterly earnings called Tuesday that Blizzard will not have a major front line release for 2019 turning to Blizzard we expect materially lower financial performance this year Activision said 2018 benefited from the release of World of Warcraft battle for Azeroth whereas we're not planning a major front line released for 2019 Blizzard said it finished its fourth quarter with softness for its in-game revenues that will take time to stabilize and return to growth the call also noted that while these factors will weigh on blizzards financials this year looking further ahead blizzards pipeline of PC console and mobile content is richer than ever and we expect the significant addition of development resources to accelerate the pace of delivery over time overwatch is flat look yeah Wow like that's really what that's saying yeah like I mean when",
            "start": 856.17
        },
        {
            "text": "we expect the significant addition of development resources to accelerate the pace of delivery over time overwatch is flat look yeah Wow like that's really what that's saying yeah like I mean when again we're talk about reactive communities and developers Blizzard is extremely not reactive with overwatch like if you think about a fan of the game at all fan it again now that's super into it not good at it at all but definitely a fan of it Andy loves it can you think about the various things that they announced last year there's not a whole lot yeah especially compared to previous years well I feel like there was events like almost every month there was like Busan and ash for the major things of the 20:18 calendar year so people are kind of getting tired of it I think like there's always gonna be that article community in the games sold extremely well so there will be a bunch of people there's overwatch League like the numbers aren't like small by any means but they're flat yeah and",
            "start": 896.34
        },
        {
            "text": "gonna be that article community in the games sold extremely well so there will be a bunch of people there's overwatch League like the numbers aren't like small by any means but they're flat yeah and that's a problem when your business doesn't like this flat yeah stop it awesome but to me that says like there we don't have major releases either they don't consider warcraft reforged mmm-hmm a major release or that game is not coming in 2019 mmm-hmm I'd imagine they don't consider it yeah right like it seems more of just like a side project compared to one of the bigger ones it also means Diablos not coming this year yeah I think that is really what this is trying to get at okay understand this Diablo 4 not this year yeah hmm all right next up Amy Hennig feels there will be a revolution in how we receive game content this comes from Colin Stevens at IGN during a Die summit 2019 conversation between Emmy Amy Hennig and Tim Schafer Henning discussed narrative and games streaming",
            "start": 935.87
        },
        {
            "text": "in how we receive game content this comes from Colin Stevens at IGN during a Die summit 2019 conversation between Emmy Amy Hennig and Tim Schafer Henning discussed narrative and games streaming accessibility to a wider audience and more as much as we would all very much own the fact that we love to play these narrative games these things that are very intentionally authored structured like familiar stories from film or TV or theater and they're by definition finite it's becoming harder and harder to make those games anymore said Hennig partly because of business model and cost of development but I think it's a shame jumping off from that Hennig feels the game industry is potentially set to change with the rise of streaming saying what this an infection point inflection point everything's gonna change we don't know is there another console generation after this one is everything just gonna be streaming to us the way music and TV and movies do once we have the widespread adoption of 5g",
            "start": 980.78
        },
        {
            "text": "gonna change we don't know is there another console generation after this one is everything just gonna be streaming to us the way music and TV and movies do once we have the widespread adoption of 5g is it just gonna be something we take for granted like we do with music and TV and film now that you know at the touch of a button you're now in this experience and even better than that is it gonna reach people that we haven't traditionally reached that don't consider themselves gamers there's a feeling there's this huge shift coming in two to five years maybe a little bit longer where our content is going to be able to reach to reach people a lot more frictionlessly than in the past we should we start starting to make things for them now speaking of narrative driven games like Uncharted The Last of Us and until dawn Henning said the games are just as watchable as they are playable there entertaining to be in the living room while someone is playing and it's not that the rest of the",
            "start": 1021.31
        },
        {
            "text": "The Last of Us and until dawn Henning said the games are just as watchable as they are playable there entertaining to be in the living room while someone is playing and it's not that the rest of the people are there as passive observers they're collaborators those of us that are in the this room we have a very specific set of experience in terms of we know how to tell good stories and create memorable characters in worlds we know how to do real-time development and how to do performance capture and virtual production and we understand interactivity you've got to understand that intersection of those three disciplines is really small so there's going to be a revolution in how we receive content there's a lot of people in Hollywood trying to figure this out right now but they don't know what we know god she's cool she's thinking on a level that like I don't think most developers or even like most gamers are currently thinking on which is that things are going to change the next like",
            "start": 1058.9
        },
        {
            "text": "what we know god she's cool she's thinking on a level that like I don't think most developers or even like most gamers are currently thinking on which is that things are going to change the next like we're looking at not just when people hear cloud streaming they think we're gonna get the exact same thing but over the Internet which is not necessarily how it's going to be it's going to be like you now have everything on every device and thus you can consume content whenever and wherever you want or your kid can like let's say the example like Uncharted like you can play the Uncharted game but there's also going to be like sighs stories and things like that that are subtly content on other devices or other ways you can receive the medium which is like a very base level of what she's probably talking about not even close to what she's thinking mm-hmm but there's going to probably like she said there's going to be a revolution in the way people take in content which is not necessarily",
            "start": 1096.67
        },
        {
            "text": "talking about not even close to what she's thinking mm-hmm but there's going to probably like she said there's going to be a revolution in the way people take in content which is not necessarily going to be the big single-player game anymore yeah and that that's unfortunate for people like us I feel who like will always hold on to that single-player core experience and I feel like if anything the last two years has proven that they're not going anywhere anytime soon right right with things like horizon god of war it's like there's definitely a and last of us coming up soon ish there is still an emphasis on these super high quality narrative driven games that are our single player focused experiences but what she's talking about about these like the people in the room they're not just watching they're collaborating I feel like that's really touching on something important that I think that will see the industry kind of dive into a bit more come next generation when it is a bit more",
            "start": 1140.38
        },
        {
            "text": "they're collaborating I feel like that's really touching on something important that I think that will see the industry kind of dive into a bit more come next generation when it is a bit more accessible where there's not potentially not a need to buy a 300 $400 call to be able to have that experience and to be able have that experience in different ways because at some point everyone's gonna have a smartphone yeah if they don't already but you know there's gonna be multiple in a household there's gonna be multiple ways for people to be able to experience the same thing in in different ways that fit their Styles best right there was more quotes that she had this is a super interesting discussion she did you should definitely check out the video but another thing she was saying oh [ __ ] I'm totally blanking on what I was saying there um give me one second I mean like you mentioned that like the examples you have were horizon and Ling God of War like telling that those are first part of",
            "start": 1180.55
        },
        {
            "text": "totally blanking on what I was saying there um give me one second I mean like you mentioned that like the examples you have were horizon and Ling God of War like telling that those are first part of games like the people who want to make those kind of games that feel that they're where the investments are usually first parties or major corporations like Sony and take you and stuff like that mm-hmm that feel like they could take the loss for the prestige yeah like not every game is gonna sell at Red Dead Redemption too so no one's gonna invest 150 million dollars into it exactly what I was gonna say is she was talking about how so many people are just used to just watching Netflix but that's not the only thing they're doing they're watching Netflix with an iPad in their hand mindlessly playing some games she was saying that there's so many more people out there now than ever that are gamers that don't necessarily realize they're gamers and it's like all they need to do is like all Amy",
            "start": 1227.33
        },
        {
            "text": "some games she was saying that there's so many more people out there now than ever that are gamers that don't necessarily realize they're gamers and it's like all they need to do is like all Amy Hennig and these developers and all these people they just need to figure out how to convert them and make them understand that gaming doesn't need to be you're sitting there with a super complicated controller in your hand it can be you just being a part of this interactive experience with someone else doing that or whatever really interesting stuff very exciting is here like I I don't think I've ever been as excited for the next generation of consoles hmm ever just because we don't know what this is gonna be and it's not just gonna be oh it looks prettier yeah you know for so long I feel like that was just that was all that was being added is how HD can it be and now it's like we're pretty day of HD we're good on the desk you know what I mean I think like stuff like Jack Fox is gonna be not",
            "start": 1266.75
        },
        {
            "text": "was just that was all that was being added is how HD can it be and now it's like we're pretty day of HD we're good on the desk you know what I mean I think like stuff like Jack Fox is gonna be not necessarily now series but yeah yeah that kind of thing is going to be huge in the field like my sister-in-law doesn't really play video games she has had a ton of fun just playing jack box with us Jack box is a is amazing man it's a revolution for exactly this convincing people they're gamers that would never never like identify that way right yeah like you never have convince someone that they're a board gamer to play Monopoly exactly Alex Russ writes in and says Amy Hennig has touched on her thoughts that she feels there will be a revolution in how we receive game content according to an article from Collins even an IGN with gaming as a Live service seeing great successes apex monster hunter fortnight etc it seems that this idea is where gaming is headed as a whole however narrative",
            "start": 1307.25
        },
        {
            "text": "article from Collins even an IGN with gaming as a Live service seeing great successes apex monster hunter fortnight etc it seems that this idea is where gaming is headed as a whole however narrative experiences generally aren't served in such a way the closest example I can think of would be an MMO like Final Fantasy 14 and the attempt that battlefield 5 made with their single-player content I couldn't see a game like god of war releasing in such an episodic format but I find myself appreciating shorter experiences more and more do you think that narrative experiences will somehow become affected by the games as a service format or perhaps we're already there and currently trying to figure out how to properly market that experience from a single-player standpoint God of War was clearly a shining example that if done well single-player experiences can be very powerful but does the cost of these types of games justify the means I love God of War and single-player experiences like a",
            "start": 1348.79
        },
        {
            "text": "a shining example that if done well single-player experiences can be very powerful but does the cost of these types of games justify the means I love God of War and single-player experiences like a beaming Activision Blizzard found success and they're finding ways to cut costs with their live games in extremely unfortunate ways I mean I think a lot of what we were just talking about kind of goes goes into this I think that uh what so we saw until dawn right and that was kind of just a a massive success that came out of nowhere you know I feel like that was definitely a moment where everyone was playing at the same time and having this like shared experience and seeing the direction that they're taking their games now where it is a bit more bite-sized episodic content that I forgot the name of the the anthology series that they're the dark pictures yes dark pictures like I feel like that is a perfect reaction to this where it's not games as a service and it's not episodic in the way of",
            "start": 1388.12
        },
        {
            "text": "of the the anthology series that they're the dark pictures yes dark pictures like I feel like that is a perfect reaction to this where it's not games as a service and it's not episodic in the way of you need to this is episode 1 this is episode 2 this episode 3 but it is kind of just like the anthology idea that we're going to give you these interactive narrative single-player stories in smaller bite-sized bits where maybe it is two hours maybe it's three hours four or five or whatever but it's not a sprawling 20-hour game that requires the budget to be astronomical which is then gonna make the returns a lot lower if they don't sell insane numbers right and I'd like that that's a good example of taking that style and going forward with it for something like God of War I personally believe will always have games like that maybe not too many of them but I feel like those are the prestige pieces that are not the only thing making these companies money there are the things that keep",
            "start": 1431.05
        },
        {
            "text": "will always have games like that maybe not too many of them but I feel like those are the prestige pieces that are not the only thing making these companies money there are the things that keep people coming back and supporting Playstation right it's like Playstations team of first party studios you have to look at all of them as a whole and what they're all doing how they're all selling to be able to judge one of them and I think God of War is a perfect example of like when there's the quality there people are gonna come to PlayStation and that's something we see Microsoft struggle a lot with this generation I'm expecting that to change next one yeah I mean like people need to reconsider what they think of episodic in general like people think of telltale games in The Walking Dead in every episode for a month and then a season began - next year and all that like life is strange - is a very good example of what this this concept is going to be of there was one episode at launch there",
            "start": 1476.57
        },
        {
            "text": "episode for a month and then a season began - next year and all that like life is strange - is a very good example of what this this concept is going to be of there was one episode at launch there was another episode last month there might not be another episode into like another couple of months they're taking their time they're charging a little bit more they're telling a bigger story what they want what I think in a higher budget like the idea that an episodic game needs to necessarily be low-budget or be that are more frequent is not necessarily true like gotta forward on an episodic game like he says but that game leaves mysteries it leaves hooks like Corey Balrog has talked about how the he wanted to make DLC to answer some of those questions but it became too big and they couldn't do it so what like was that DLC just going to be another episode are they moving that on to another game do you really necessarily need to call a sequel like a sequel is it God of War - like there's a",
            "start": 1518.54
        },
        {
            "text": "it so what like was that DLC just going to be another episode are they moving that on to another game do you really necessarily need to call a sequel like a sequel is it God of War - like there's a lot of ways you can format the idea mm-hmm that doesn't necessarily mean like episodic game means low-budget yeah absolutely I know this might be an unpopular opinion but Uncharted Lost Legacy I would gladly take one of those every two years yeah you know just like a Uncharted Side Story where it's just like what are these characters doing what are those characters doing like we're not gonna get an uncharted quality game ever even for years I would say because of the the budget and the scale of it all but it's like if it was a smaller title like that I think that that could be episodic in the way that again I feel the moment that you assign by consistent structure to it of the episode 1 episode 2 episode 3 you lose people with every single one right right just listen valve learn really well",
            "start": 1560.42
        },
        {
            "text": "that again I feel the moment that you assign by consistent structure to it of the episode 1 episode 2 episode 3 you lose people with every single one right right just listen valve learn really well exactly yeah and it's like then when you if you were to just put them out and like it's like they they all work together but they're not uh you don't need to have played the one before to play the next one I think that's that's the future of where we're going with this next story xbox announces plans to expand gaming through technology that's come from Jesse Wade at IGN Microsoft announced its plans for expanding gaming to its users over the next decade at dice 2019 on Tuesday head of global gaming partnerships and development and Xbox and Microsoft sarabande spoke about the methods that will be implemented by Xbox to put their visions into reality bond noted the amount of gamers globally at the moment and what the growth rate will be like by the year 2030 of the eight billion people on the",
            "start": 1607.06
        },
        {
            "text": "implemented by Xbox to put their visions into reality bond noted the amount of gamers globally at the moment and what the growth rate will be like by the year 2030 of the eight billion people on the planet four billion of them are digitally connected and two billion of them are gamers by 2030 the eight will become nine the four will become five but the big number is of the two billion that will become four billion nearly half of the world's population will be playing games bond continue by touching on cosplay and saying we envision a world where you can play any game with anyone on any device a world where gaming connects each and every one of those four billion players bond said Microsoft wants to focus on letting gamers share experiences despite which console they are playing on or their physical abilities no matter device location appearance or physical ability doing our part and unlocking that future that is our passion it drives us every single day bond then announced Microsoft's",
            "start": 1650.08
        },
        {
            "text": "physical abilities no matter device location appearance or physical ability doing our part and unlocking that future that is our passion it drives us every single day bond then announced Microsoft's plan to use three technologies to enhance gaming experiences for players in the future these include connectivity cloud and artificial intelligence / machine learning for connectivity Microsoft invested in project x cloud where players will be will be able to play any game natively from the cloud on any device including mobile phones Microsoft has also invested in services such as play fab that will help developers create through the cloud without worrying about the backend and share their worlds with others through those platforms lastly artifice intelligence and machine learning is meant to help players modify games to their own abilities with a game adapting itself to the players through algorithms that translate the input across controller keyboard and touch for example Vorta has a",
            "start": 1692.35
        },
        {
            "text": "to help players modify games to their own abilities with a game adapting itself to the players through algorithms that translate the input across controller keyboard and touch for example Vorta has a fairly complicated control scheme but most of the time people just hold down the gas and steer so for touch input we're experimenting with the control scheme where you can actually just use your screen to steer accelerate and brake that's it Bond said all these news stories are so fascinating when you look at all the financial reports that have been coming in this last week and then you look at dice going on right now and all these brilliant minds talking about where the future of gaming is headed it's just so so insane to imagine where we'll be in 2030 it's ridiculous I'm like Microsoft for its many missteps as they had a generation there they're really looking forward in a way that I don't think anyone else is like Nintendo and Sony like bless their hearts there they are doing what's",
            "start": 1733.36
        },
        {
            "text": "its many missteps as they had a generation there they're really looking forward in a way that I don't think anyone else is like Nintendo and Sony like bless their hearts there they are doing what's right for them mm-hmm but Microsoft is like a couple of years ago they wanted to get get away from consoles say I'll talk about sort of not like how many monthly active users they have which I think this is like dovetailing with this nicely that they want to have that account that anybody can use on any device like whether you like headaches ed sitting with an iPad in front of a movie or playing a game or whatever like they want those people to be gamers and to be playing an Xbox game and I think this is always a very smart move for them very smart move and I think that's very very cool of them and telling that every single time they start talking about the the cloud and and where Microsoft's and Xbox are going to be in a couple years they talk about the adaptive controller they talk about",
            "start": 1774.22
        },
        {
            "text": "and telling that every single time they start talking about the the cloud and and where Microsoft's and Xbox are going to be in a couple years they talk about the adaptive controller they talk about the physical side of this as well and like that really is a cornerstone to their business like them putting that as their Super Bowl commercial that's awesome yeah you know I love yeah it was great commercial and I just I love to focus on on all of this and like them talking about these three technologies you're right they are looking forward in a way that the other guys at least publicly aren't doing but them talking about it now is preparing us for that future I can't wait man very exciting stuff next up Metro Exodus reviews are in open critic how's it out of 83 Metacritic at an 81 for the PlayStation 4 version IGN gave an 8.5 GameSpot an 8 performing very well hmm yeah that's impressive stuff I didn't expect much from it and every everything I heard from the previews was really bad so",
            "start": 1812.26
        },
        {
            "text": "PlayStation 4 version IGN gave an 8.5 GameSpot an 8 performing very well hmm yeah that's impressive stuff I didn't expect much from it and every everything I heard from the previews was really bad so this is kind of shocking to me yeah I mean I played the previous two Metro games for a while and at some point like they either lose me or they're a little too oppressive for their own good or for at least my preferences why Matt Burch has been playing it for Game Informer he's been telling me like from what he's been saying it seems like this is a really good one and I'm at I'm eager to give it a try myself that's awesome man cuz yeah it was like I must been last year at judge's week everyone was super down on it like I remember I only came through to play Kingdom Hearts down there and I was like the last demo of the the week and so I was hanging out with a lot of people and I was asking like oh like what was the past was worse and everyone was like the worst was definitely Metro Exodus",
            "start": 1855.01
        },
        {
            "text": "like the last demo of the the week and so I was hanging out with a lot of people and I was asking like oh like what was the past was worse and everyone was like the worst was definitely Metro Exodus which is around when I got a delay yeah exactly so right maybe the delay helped out there man so you're gonna play Metro Exodus let me give it a shot yeah yeah yeah one what do you think you gonna play it hopefully this coming weekend or next weekend this weekend seems so far away if I want to know what games are coming out today where would I look the official list of upcoming software across each and every platform as listed by the kind of funny games daily show host each and every weekday day today - today - yeah [ __ ] you Barret why are you looking at me like that I don't have any fun at that I hate the I hate the jingle it's stupid god Greg my monster out today just one thing away journey to the unexpected on Windows it's been making the rounds coming out on every system the last",
            "start": 1899.19
        },
        {
            "text": "at that I hate the I hate the jingle it's stupid god Greg my monster out today just one thing away journey to the unexpected on Windows it's been making the rounds coming out on every system the last couple of days so now Windows you can get it deals of the day for you this comes from hilly Brahms Amazon currently has the PlayStation Classic for 60% off had only $39.99 down an additional 10% from Monday's deal and kotaku says that Red Dead Redemption 2 hasn't had any trouble selling copies so if you've been waiting for months for a decent discount it's finally down to $40 today on both ps4 and Xbox one that's insane and now it's time for reader mail but before we get to that let me tell you that this episode is brought to you by hims 66% of men lose their hair by age 35 the thing is when you start to notice hair loss it's too late it's easier to keep the hair you have than to replace the hair you've lost that's why you should be like Nick and Andy and go-to for hims calm a one-stop",
            "start": 1941.01
        },
        {
            "text": "you start to notice hair loss it's too late it's easier to keep the hair you have than to replace the hair you've lost that's why you should be like Nick and Andy and go-to for hims calm a one-stop shop for hair loss skin care and sexual wellness for men thanks to science baldness can be optional hims connects you with real doctors and medical grade solutions to treat hair loss these are well known generic equivalents to name-brand prescriptions to help you keep your hair it's no snake oil pills or gas station counter supplements these are prescription solutions backed by science no waiting rooms no awkward in-person doctor visits save hours by going to four hems calm Andy and Nick did it they went online talked to a doctor sending some photos and got matched with a prescription to help fight their thinning hair you can order now listeners get a trial month up for hims for just 5 dollars today right now while supplies last see website for full details this will cost hundreds if you",
            "start": 1994.29
        },
        {
            "text": "fight their thinning hair you can order now listeners get a trial month up for hims for just 5 dollars today right now while supplies last see website for full details this will cost hundreds if you went to the doctor or pharmacy go to fo our hims com slash games daily that's for hems comm slash games daily now it's time for reader mail you can go to patreon.com/scishow was the best of the PlayStation Final Fantasy titles so I wanted to hear you guys thoughts on the matter why isn't square enix remastering it along with the other titles for switch what possible reason could they have for holding it back especially when there's a PC version of it that you can buy right now thanks and great to have you on the show so the thing I have heard cuz I've looked into this myself because it does seem it's weird Basti 7 9 10 10 - it's like okay what about it does have a PC version on Steam from what I've heard that that PC version is actually the port that released way back in the 92 thousands",
            "start": 2032.6
        },
        {
            "text": "it's weird Basti 7 9 10 10 - it's like okay what about it does have a PC version on Steam from what I've heard that that PC version is actually the port that released way back in the 92 thousands for PC so all they had to do would just put that version on Steam and update it for modern OSS the reason it's not remastered but the other ones is either it's a copyright thing with eyes on me which is the main theme that's what I've heard is that it's a music licensing issue or Square Enix just straight-up lost the source code and that that also could be thick that's a thing that a lot of Japanese developers have done in the past like they've when they needed space or there have been like a critical error or something like the source code just gets lost and you can't really replace that but you could reverse engineer at all with like a lot of work in a team working on it but for I guess like a simple ps1 remaster they're probably not gonna do that yeah I definitely think that it's the music",
            "start": 2092.75
        },
        {
            "text": "could reverse engineer at all with like a lot of work in a team working on it but for I guess like a simple ps1 remaster they're probably not gonna do that yeah I definitely think that it's the music licensing situation with eyes on me also father c8 not my personal favorite I love that the people like it but yeah I hate you so much what are your thoughts on eight I like it I like it a lot it definitely has its flaws like the bowel system straight up broken it wasn't fun to me stories cool characters are cool but yeah I just didn't really enjoy the gameplay as much as I did with Simon yeah I was actually looking at the thing yesterday like The Legend of localization guy clyde mandolin uh-huh he was looking at every instance of when squall says whatever and what it actually is in japanese and apparently like it's in fifteen instances it's most commonly in japanese like him saying well excuse me aha it's like a it's more of like a sarcastic ass in the japanese version distinct in the",
            "start": 2137.8
        },
        {
            "text": "and apparently like it's in fifteen instances it's most commonly in japanese like him saying well excuse me aha it's like a it's more of like a sarcastic ass in the japanese version distinct in the american one that's that's so crazy how little localization things can totally change characters personalities so now that's like that's the most the line most session with him like he never really says that amin huh so funny learn'd astronomer writes in and says hey guys from following you on twitter and listening to your appearances on the g i-- show it seems like you always have your ear to the ground when it comes to nintendo leaks and rumors Metroid Prime foreign trilogy HD development mother threes localization being canceled I was wondering if you had any scoops for us ahead of today's direct thanks for reading and keep up the great work mmm let me think cuz I if most people are like me then they watch this like later in the day so they've probably already seen the direct so I don't",
            "start": 2179.35
        },
        {
            "text": "thanks for reading and keep up the great work mmm let me think cuz I if most people are like me then they watch this like later in the day so they've probably already seen the direct so I don't wanna also don't want to spoil anything that's for a thing coming today I let me hint at something I guess let's go baby cuz like this is a thing that I'm going to write up at some point as I get more sources on it but there's a game that's thought to be dead that Nintendo is reviving and it's not one that people would expect like it was very much a title that was like dead and buried very officially cancelled chills I want everyone oh I got [ __ ] [ __ ] I can't wait I've been hearing some good things about this tracks people who DM in me like this tomorrow's gonna be a good one try that you hate the direct I don't know for sure but I've heard like this I've heard enough about this game that it I'm not sure it exists again wow that's really really cool let's go down the list of stuff and if",
            "start": 2222.28
        },
        {
            "text": "the direct I don't know for sure but I've heard like this I've heard enough about this game that it I'm not sure it exists again wow that's really really cool let's go down the list of stuff and if you know anything to concrete like let's let's not spoil stuff here for this but do we think Luigi's Mansion makes an appearance I would assume so it's a 2019 game and they've not talked about it beyond the initial trailer yeah do you think we got Animal Crossing also 2019 game and again not a thing they've talked about since last September do you think we see f-zero No I think we see elite beat H not - is well out of the game at this point so Smash Brothers mm what do you think we get I would beast nah I would not be shocked if we got Joker gameplay as of the game of words he didn't have any soccer I did not have anything to show yet mm-hmm it's been a couple of months maybe he has like some gameplay ready I assume if Joker is gonna be ready for like let's say March April then it would",
            "start": 2268.87
        },
        {
            "text": "soccer I did not have anything to show yet mm-hmm it's been a couple of months maybe he has like some gameplay ready I assume if Joker is gonna be ready for like let's say March April then it would make sense to show him now that's what I'm thinking - I feel like we I feel pretty confident we'll see Joker gameplay I just want to hear the music yeah play the persona 5 like remixes so if we get Joker gameplay do you think we also get a new character reveal the next DLC because I think that we will so the rumor right now is aired wreck yeah I'm dragon dries mm-hmm if there's also another rumor going around that Nintendo has a bunch of Dragon Quest ports to announce as well mm-hmm I would assume that they announced those two things at the same time yeah if those are both real yeah so that would be a good time to do that that makes a lot of sense to me there's been rumors of Kingdom Hearts floating around on Nintendo switch in some way some form what do you think last I heard there was a",
            "start": 2316.36
        },
        {
            "text": "be a good time to do that that makes a lot of sense to me there's been rumors of Kingdom Hearts floating around on Nintendo switch in some way some form what do you think last I heard there was a talk between the 10:01 Square Enix about what they could do with Kingdom Hearts 3 it was deemed unfeasible to get he to March 3 on the switch even though it's an unreal engine 3 game it's a very demanding Unreal Engine 3 game and not something you could necessarily put without paring it down a lot yeah I think the remasters those are a good bet mm-hmm I think those will come eventually if it's this year or maybe I it's actually actively being worked on but I think that's probably where they settled on it so with that and I don't know if you you have any yet information on this but like why didn't they put HD remix one word two or one point five two point five all that stuff on Xbox I think after type-0 HD sales which were very low on Xbox one they kind of sided well there's clearly no real",
            "start": 2355.72
        },
        {
            "text": "they put HD remix one word two or one point five two point five all that stuff on Xbox I think after type-0 HD sales which were very low on Xbox one they kind of sided well there's clearly no real like HD remaster JRPG audience on this console so well fifteen did well it did better on ps4 which is not surprisingly the audience is there it's a bigger console base in the first place and Kingdom Hearts 3 I'm guessing did pretty well on Xbox as well but not anywhere in the same numbers I think from what I've heard a lot of developers including Square Enix have figured Microsoft was gonna really turn it around next generation so there's going to be more make goods in the future mmm so I don't think we're ever gonna see another situation where like titles like that are gonna skip the Xbox one mmm like near on automata like that came out not because I thought it would be a big barn buster for Xbox one yeah but because like okay well you're clearly making all the right overture so we're gonna",
            "start": 2401.32
        },
        {
            "text": "like near on automata like that came out not because I thought it would be a big barn buster for Xbox one yeah but because like okay well you're clearly making all the right overture so we're gonna make sure that there's an audience for our games there next time that's awesome um let's see what else do we got here kebabs writes in says some kind of funny crew I have a prediction for what might show up in the Nintendo Direct later today Spyro reignite it this is due to a fair amount of evidence such as trailers that I've improved lighting and animations Nintendo's UK and Game Stop Germany putting ups listings for pre-ordering a switch version and the game's website having a slot open on the platform drop down menu under ps4 and Xbox one that aside I personally think it's high time that we get a port of Super Mario 3d World an enhanced port of Super Mario maker with the campaign from the 3ds version I could even see a Nintendo making a special cable that runs from the switch to the",
            "start": 2446.32
        },
        {
            "text": "we get a port of Super Mario 3d World an enhanced port of Super Mario maker with the campaign from the 3ds version I could even see a Nintendo making a special cable that runs from the switch to the docks of the switch can function like the Wii U what do you guys think let's start at the top Spyro I think it's pretty likely yeah seems likely crash made it yes spyro only didn't make it because they were kind of running to the wire on that game yeah I would not be shocked at all if there's a switch version announced soon I think we're gonna get spiral on switch for sure I think it's likely to be announced at the direct today I could see it yeah like again crash sold extremely well obviously across it all the platforms so that's a game you definitely want to show like front center the next up we got Mario 3d World we'll start there we need this on switch right I'm a little surprised we haven't seen it yet based on how port happy they've been with Wii U titles and I think that the the",
            "start": 2484.51
        },
        {
            "text": "up we got Mario 3d World we'll start there we need this on switch right I'm a little surprised we haven't seen it yet based on how port happy they've been with Wii U titles and I think that the the reason we haven't seen it is that they didn't want it too close to Mario Odyssey just because the two 3d Mario games but now that we got New Super Mario Bros u out of the way for lack of a better way to say that I think we had 3d world I don't think it'll be announced today though yeah I think I mean deluxe just came out yeah so they're probably a little let that set for a while yeah cuz that is one of the marquee Wii U titles I mean obviously they're gonna bring it over at some point unless deluxe just incredibly bombed which I really - no way yeah it's gonna sell better than The Weavers yeah definitely like every single game that they've poured it has sold better and they're gonna continue to do that yeah 3d world is one of my favorite games I love it so much and I love the multiplayer",
            "start": 2522.19
        },
        {
            "text": "definitely like every single game that they've poured it has sold better and they're gonna continue to do that yeah 3d world is one of my favorite games I love it so much and I love the multiplayer side of it though and I feel like I could totally fit on switch yeah the - joy cart like that game was playable with wiimotes yeah that I think it's gonna happen I don't think it's gonna happen today and then Super Mario maker that's the one where I'm I I want that so so badly but I want a sequel it doesn't need to be called - but I don't want it to be just a port yeah that would be great I've been thinking a lot about Super Mario maker lately especially in terms of streaming's I've been wondering how the controls are working a new game yeah I don't think there'll be a cable that now runs from the dock I think that that complicates the switch too much although Nintendo's [ __ ] crazy yeah they've done nuts things in the past so so I don't know yeah Andre from GameXplain and he was saying",
            "start": 2569.8
        },
        {
            "text": "the dock I think that that complicates the switch too much although Nintendo's [ __ ] crazy yeah they've done nuts things in the past so so I don't know yeah Andre from GameXplain and he was saying like he wants multiswitch support so he can like have it on the TV and in his hands at the same time I'm like there they're never gonna do that no what do you think the next Mario maker would be I would think it would be probably there's not a whole lot you can do with it besides adding themes adding the couple of things that we're missing in the first Mario maker loops yeah but like I honestly I think that would be enough like yeah really you just want to get that thing on a modern platform that people can use and just have fun building Mario levels yeah absolutely I loved the the 3ds version because of that campaign it sucked from every other like having the way that you downloaded stuff and the way you could even find levels was super just nerfed like yeah it was such a clear blatant",
            "start": 2610.18
        },
        {
            "text": "because of that campaign it sucked from every other like having the way that you downloaded stuff and the way you could even find levels was super just nerfed like yeah it was such a clear blatant decision of them being like hey we want this to be the inferior version like we want to focus on the WiiU one event stuff like that like they had the game center CX guy make levels yeah that was a very interesting thing of like oh this is how this person's level design mind works yeah and I can't wait for it to come out on switch because I feel like there's such a bigger better there's a better vibe towards Nintendo right now and also there's just people like this which they want to like this way in a way they've wanted to hate that Wii U for good reason but yeah alright I'm excited Mikey D says with THQ Nordic reporting a sales increase of 713 percent do you see this as a sign the trip the double-a gaming might finally be making a resurgence there I mean they have a such a huge profit",
            "start": 2653.62
        },
        {
            "text": "says with THQ Nordic reporting a sales increase of 713 percent do you see this as a sign the trip the double-a gaming might finally be making a resurgence there I mean they have a such a huge profit number because they haven't really done much in the last like Darksiders three with one of their first original games mmm I think they mostly are subsist on remasters and remakes and stuff like that so in the future as they start making more original games they're like I can see the kind of double-a mentality working well for them because there has to be somebody mm-hmm but at the same time like you look at Darksiders three reviews and sales and a lot of people like reviewing it as kind of a trip like oh this doesn't do the things Triple A games do mm-hmm well it's still pretty much in line with the other docksiders games so it's it's a question of where the industry is that if they're going to lead the charge is going to be a rough couple of years yeah but thg Nordic is huge like they're",
            "start": 2698.65
        },
        {
            "text": "the other docksiders games so it's it's a question of where the industry is that if they're going to lead the charge is going to be a rough couple of years yeah but thg Nordic is huge like they're honestly I think the biggest publisher in Europe period so they're not gonna be hurting for if they want to leave the charge they definitely have the resources to do it mm-hmm yeah I don't know that it's a sign that double-a gaming's making a resurgence I feel like we're gonna continue to see this divide of the big triple-a and the smaller Indies but I do think then we'll see the the more double-a games is what we talked about earlier with like the the dark pictures yeah type situations so I mean the real double-a is between like Indies like the more low budget in in the higher stuff like you know the wardroom just came out and that's like that's not a chief game yeah there's a very like lovingly crafted very slaved upon game it probably did not cost that little to make yeah absolutely and",
            "start": 2747.83
        },
        {
            "text": "the wardroom just came out and that's like that's not a chief game yeah there's a very like lovingly crafted very slaved upon game it probably did not cost that little to make yeah absolutely and then jump right to the squad up you can go to California calm or patreon.com slash kind of funny games to squad up with some best friends out there farmer josh is playing on PlayStation for his PSN name is dumb ace 15 that's D um BAC e 15 he says hey kind of funny best friends battlefield 5 just launched its new co-op mode and I'd love to check it out with some fellow best friends I've also been playing apex legends and titanfall 2 lately I'd love to squat up in any of those games as well go help your boy farmer Josh out dumb ace 15 on PSN and now this is a PSA from one of you guys out there reclusive dragon says just a PSA for people playing apex legends on ps4 and getting the same crash as Andy was having I was getting blue screen crashes every second or third match after searching the",
            "start": 2791.36
        },
        {
            "text": "reclusive dragon says just a PSA for people playing apex legends on ps4 and getting the same crash as Andy was having I was getting blue screen crashes every second or third match after searching the apexes forums I found it post saying that there's a bug with the convert incoming voice to chat text setting that causes it turning off this setting fixed it for me so if people are having issues check that setting I've heard a lot of people complaining about ps4 crashes but it took ages to find the solution for my issue so hopefully this helps people PS this setting is off by default that's why most people are not getting the crashes check it out I once kicked somebody and they had a blue screen so I was like alright that's cool like if it's gonna crash it better crash when I kill someone yeah there you go let's see time for your wrong let's see what I got wrong today no it's you know a lot of people right men capitalist Pig says regarding Warcraft reforged release year the pre-order",
            "start": 2840.17
        },
        {
            "text": "yeah there you go let's see time for your wrong let's see what I got wrong today no it's you know a lot of people right men capitalist Pig says regarding Warcraft reforged release year the pre-order page for reforged still as the following will be released on or before December 31st 2019 Justin H has four episodic games I would say with the roadmap anthem has put out it would be considered an episodic triple-a title that's interesting but I still feel like that falls more on the games as a service side than it does like a traditional single-player experience now BIOS is breaking news THQ Nordic has bought war house studios known for Kingdom Come deliverance this morning like I said they're huge ya know biology says Kingdom Hearts 3 is actually on Unreal Engine 4 not 3 oh yeah stet Joe net says multiswitch support at least in handheld mode Mario Party does that now you can go from screen to screen in some minigames that's true that is true I still don't see them adding that level Mario",
            "start": 2878.87
        },
        {
            "text": "says multiswitch support at least in handheld mode Mario Party does that now you can go from screen to screen in some minigames that's true that is true I still don't see them adding that level Mario maker yeah it's a cool feature but like hunched over a table like watching the yeah it's neat the Mario Party thing yeah it's cool but no more than just that trying for like understanding yeah yeah like they're fun minigames but they're like I only they're as good as the normal mini-games Ignacio says I know this isn't the place but no one's mentioned it will you do a watch along for the direct so here's the issue our internet here sucks Comcast Comcast is coming here to try to fix it which means we're not gonna have internet during the time that the direct is happening because we didn't know the director was happening so we had to plan around that whatever I'm gonna go home and try to stream it from home if it doesn't work it doesn't work if it does I'll see you 2:00 p.m. twist our TV /",
            "start": 2960.66
        },
        {
            "text": "the director was happening so we had to plan around that whatever I'm gonna go home and try to stream it from home if it doesn't work it doesn't work if it does I'll see you 2:00 p.m. twist our TV / kind of funny games otherwise I'll probably just record my reactions and plop put them up on YouTube later new dates sire says trying one two three physical additions coming spring 2019 with trying to coming February 18th and that's it alright thank you very much for joining us thank you where can people find you they can find me on Game Informer calm or on my Twitter and I am are ANZ oMG there you go got a phone have a good time alright everybody get hyped and tender direct 2 p.m. hopefully I'll see you there until next time I love you tomorrow's host is me and cheeks jr. baby oh yeah dude now we shake our hands the whole thing",
            "start": 3005.4
        }
    ]
}