{
    "id": 80,
    "video_id": "208oK4MdlsY",
    "show_name": "Miscellaneous",
    "hosts": [
        "Greg Miller",
        "Kristine Steimer"
    ],
    "title": "Wildcard: Nashville Season 2 Predictions",
    "description": "What's next for the hit ABC drama? Greg and Kristine let the fates decide in an all-wildcard episode.\n\nSUBSCRIBE/LIKE/SHARE\n\nNashville's first season is in the books, but Greg and Kristine aren't ready to be done with the hit ABC drama. Join them as they predict just what's going to happen when Nashville returns for season two!\n\nAll of Greg and Kristine's predictions: http://www.youtube.com/playlist?list=PLOlEpGVXWUVsBA7Hn32dkMqYOcKYqw0jV\n\nCatch all of Nashville on iTunes: https://itunes.apple.com/us/tv-season/nashville-season-1/id550311456\n\nNashville music on iTunes: https://itunes.apple.com/us/artist/nashville-cast/id576010239\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy\nFollow Kristine on Twitter: http://www.twitter.com/steimer",
    "published_at": 1369832601,
    "duration": 233,
    "transcript_chunks": [
        {
            "text": "what's up everybody I'm Greg and this is Kristine. Kristine how much do we love Nashville ? So so so so much. Guys, we love Nashville so much. We made all these videos predicting season 2, educated guesses for season 2, but a big part of it of course was our Wild Card predictions where we reached into the people bag and then the things bag to figure out what people were going to do. But we finished our first round of predictions. If you want some more hit us up on Twitter with topics to talk about for Nashville. Uh however, we still have some wild cards left. Yes, so we're going to do just get some wild cards out of the way, do it, see what the gods want in Nashville. All right, season 2 ABC, links to episodes down in the description. Who's this one? This is about Teddy. This is about Teddy. What's going to happen to Teddy in season two according to the Nashville Gods? He's going to die. He dies. Teddy dies. That's a hard one. Oh, I could see that happening actually. Really? I guess I could see actually Peggy again.",
            "start": 6.12
        },
        {
            "text": "to Teddy in season two according to the Nashville Gods? He's going to die. He dies. Teddy dies. That's a hard one. Oh, I could see that happening actually. Really? I guess I could see actually Peggy again. I've already said it, Peggy's crazy. Watch that episode, crazy. She got the crazy ass. I wonder if she has Crazy Eyes in real life back to people. She seems like a nice lady in real life. Raina, right? What's going to happen to Raina in season two according to the Nashville Gods? She's going to be pagers. Oh, I can see that too. Is she not too old for that? I don't know how old she is on the show actually. I don't. I mean is she like late 30s or is she early 40s? I'm bad with ages. I would say early 40s. Okay, she could get pregnant but it's not the healthiest. Well sure, but it's a TV show so I don't think we have to. That is also true. Next prediction from the Nashville Gods includes what person is this? Avery. Avery, this is really bad handwriting. I got bad hand. It's like Ari. Well, we're not talking about Entourage so I",
            "start": 43.92
        },
        {
            "text": "is also true. Next prediction from the Nashville Gods includes what person is this? Avery. Avery, this is really bad handwriting. I got bad hand. It's like Ari. Well, we're not talking about Entourage so I was hoping you can figure it out. Ari Gold crossover. He's going to be the agent. The Nashville God say Avery is going to lose this record deal too. That already happened. That's kind of that's a weak qu Nashville Gods. All right, down to our final two people. Maddie. Oh, Maddie, one of my favorites. I was hoping she'd be pregnant or oh God, I then now I'm starting to question what I put in here. Hopefully nothing bad. Sorry and asille God say Maddie is going to what? Oh, takes up pickling. Maddie is going to take up pickling this season. She has a new hobby. That's cool . That's good. And the final Nashville season 2 prediction from the gods who doesn't like pickles? You're a monster if you don't like pickles. Wy who I've already predicted will die. Nope, he can't die cuz Teddy's going to die. Put the naal gods. Wy is",
            "start": 96.88
        },
        {
            "text": "2 prediction from the gods who doesn't like pickles? You're a monster if you don't like pickles. Wy who I've already predicted will die. Nope, he can't die cuz Teddy's going to die. Put the naal gods. Wy is going to kills uh oh no one. He kills no one. He's going to kill someone. We just don't know who. You're all you're all on noest natural celebrities. Wy's going to kill somebody. We don't know who. That makes sense as we talked about before. Yep, ladies and gentlemen, what do you think is going to happen in Nashville season 2? Let us know in the comments below then leave a video response if you're so inclined before liking the video, sharing the video with your Nashville friends and subscribing to our YouTube channel. That's a that's a mouthful. That's a lot to do. Most people don't do most of it. I don't think no, but a lot of you do so thanks for that. Um Kristine, where can people go to find out where to watch the episodes? Oh, you can go to iTunes and then you can download all the episodes but what you",
            "start": 152.6
        },
        {
            "text": "no, but a lot of you do so thanks for that. Um Kristine, where can people go to find out where to watch the episodes? Oh, you can go to iTunes and then you can download all the episodes but what you really should be doing as well is downloading the soundtrack . Yes, that soundtrack is awesome. Soundtrack is so good. Ladies and gentlemen, we will have more Nashville content for you soon so until then beyond [Music] beyond",
            "start": 195.32
        }
    ]
}