{
    "id": 1471,
    "video_id": "1QJCBdV_vRk",
    "show_name": "Oreo Oration",
    "hosts": [
        "Colin Moriarty"
    ],
    "title": "Colin Moriarty Reviews Oreo Cookies - Oreo Oration",
    "description": "Because you supported us on http://www.patreon.com/kindafunny, Colin Moriarty is here to review the original Oreo Cookie. FYI, he hates cookies.\n\nGet the podcast early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_c...\n\nBuy our shirts! http://www.districtlines.com/gameover...\n\nWhile you were living your life, Nabisco went crazy and made an army of Oreo cookies. Whenever there's a cool new flavor, Greg Miller tears open a new package and reviews a new version of Milk's Favorite Cookie. \n\nLet us know what Oreo we should review next in the comments.\n\nFollow Colin on Twitter: http://www.twitter.com/notaxation\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy\n\nCheck out the Oreo Oration FAQ: http://www.youtube.com/watch?v=aO6zw2...\n\nOur theme is \"Game-A-Tron\" off of Daemon Hatfield's album Colorbeam. Buy it on iTunes: https://itunes.apple.com/us/album/col...\n\nThanks to Nick for filming.\n\nMega-Thanks to Matt Gravish for making the Oreo Oration logo and intro.",
    "published_at": 1452283200,
    "duration": 662,
    "transcript_chunks": [
        {
            "text": "Greetings and salutations, welcome to wait a minute intro. What's up everybody? Welcome to Oreo Oration. While you were out living your life and blank, what's the blank supposed to? I usually put something goofy in there. It's whatever you want. While you were out living your life and **** people, the fine people at Oreo were making endless variations of Milk's Favorite Cookie. So every Wednesday and Friday, is that still true? No, sometimes original card, sometimes I tear open a new package and give you a tasty receive review, rev tasty review without any calories. If you like that, like the video and subscribe to my channel. It's our channel now, this, but back then it wasn't, it was just mine. Sure. Today we're reviewing blank. So that's what the, that's what the card says. Is that, are we good so far? So what we're reviewing today is a cookie, the original Oreo says Milk's Favorite Cookie, as Greg has already uh outlined on his card here from 00 whatever it was. Now for new those of you that don't",
            "start": 0.55
        },
        {
            "text": "So what we're reviewing today is a cookie, the original Oreo says Milk's Favorite Cookie, as Greg has already uh outlined on his card here from 00 whatever it was. Now for new those of you that don't know the the history of the Oreo cookie, of course uh Oreo cookies come out, came out 18 0. Nabisco of course uh old company from even before Columbus uh crossed uh the Atlantic Ocean in 149. I think they were founded sometime in uh the 1300s in Geneva. Um and they created this uh this chocolate cookie here uh called the Oreo that we still um very much I doing all right so far? I mean great. Thank you. Why are you doing this episode? Uh we're doing this episode because on Patreon.com/KindaFunny we promised that if we reached a certain milestone, do we know what the milestone was? I look it up. If we reached a certain milestone that we would do Oreo Oration by we, I mean me. Um so we have $4,000, $144,000. So if we we reach the $4,000 a month uh uh tier as it were on Patreon.com/KindaFunny, we would do this and",
            "start": 53.8
        },
        {
            "text": "a certain milestone that we would do Oreo Oration by we, I mean me. Um so we have $4,000, $144,000. So if we we reach the $4,000 a month uh uh tier as it were on Patreon.com/KindaFunny, we would do this and we've we've long since surpassed that and we do what we say we're going to do. So what I have here is some whole milk. I'm I'm I'm assuming it's whole because it looks very % I'm sorry what did you say? % % milk. We have % milk. We have a glass that's I don't know what we did to this glass to be perfectly honest with you Greg. We have a jar but it's empty. Um I also brought with me Elijah Craig 1 year and a glass from Four Roses Distillery in case we need that as well. So I'm going to open up the cookie and the first thing we're going to do is we're going to do the first look, the first look, right Greg? Yeah. How does one open this? I don't eat cookies so I really don't. All right, I think that's right. Now I'm a little confused why I don't have some sort of thing you can tear and reseal. Oh no, you can you",
            "start": 100.4
        },
        {
            "text": "how does one open this? I don't eat cookies so I really don't. All right, I think that's right. Now I'm a little confused why I don't have some sort of thing you can tear and reseal. Oh no, you can you can do that. I can't see any of is that better? Great. So I open it on both sides so that we we have a problem here and that means that Nick has to eat them all. I'm sorry Nick, that's fine. My wife's out of town so I'll have to eat all of them. Good good good good. So here we go. I'm going to do we need do we really need this? I'm just going to put this down here because I feel like it's really distracting. So how many cookies are in one of these? Five, six, seven, eight, nine, 36 cookies. Is that standard Greg? Yeah. All right, so this is the original Oreo from 18 0. I mean not from the original package from 18 0. I mean this is what the Oreo has looked like since 18 0. Of course it copied this other cookie called the Hydrox cookie. This is the first look. I think this is what we do, we just look at them. I don't know",
            "start": 152.72
        },
        {
            "text": "this is what the Oreo has looked like since 18 0. Of course it copied this other cookie called the Hydrox cookie. This is the first look. I think this is what we do, we just look at them. I don't know, do we do this? I've never actually watched an episode of this show. I'm sorry. All right, so we have the first look. The Oreo looks like a standard Oreo. The Oreo smells like a standard Oreo. I wonder if the Oreo Greg has the Oreo changed ever like the original Oreo? Probably. All right, thank you Greg. So then that's the first look. Then we're going to go and we're going to do the taste. Now my assumption is at some point where did I put that rickety old glass? What did I do with it? It's right there. I'm going **** crazy over here. All right, I'm gonna pour. I just feel like I'm gonna need this eventually. Three. I'm just doing it now. Deal with it. I run this show. Now Greg, taste. So I'm gonna taste it. So I I I bite the cookie as it is. Aren't I supposed to twist it at some point? That's part four. Part four is the",
            "start": 206.6
        },
        {
            "text": "I'm just doing it now. Deal with it. I run this show. Now Greg, taste. So I'm gonna taste it. So I I I bite the cookie as it is. Aren't I supposed to twist it at some point? That's part four. Part four is the twist. Okay, I'm sorry about that. Um so I'm going to bite into the and indeed it tastes like an Oreo cookie. Now I don't I don't find the Oreo terribly offensive at all. I think it's a fine cookie. Could I do without the chocolate? Yeah. Are is the inside of it probably the best part? I would I would assume that's the case. Do I need a napkin or you kind of just do it? You want one? I feel like it couldn't hurt to have a napkin on. I appreciate that. Thank you. Milk pairing. So I'm gonna take a fresh cookie out since we have 36 of them. Now we have 34. And I'm going to do the dip. And now Greg, you do this in a specific way. You do one, two, three. Is that Maoi moment? One, two, you it's one, two, three and you pull it up and you eat it. Do I have to say it in a high pitch voice like that? Yeah, that's the that's the",
            "start": 253.68
        },
        {
            "text": "a specific way you do one, two, three. Is that Maoi moment? One, two, you it's one, two, three and you pull it up and you eat it. Do I have to say it in a high pitch voice like that? Yeah, that's the that's the Maoi moment. Okay, one, two, three like that. Nailed it. Cool. No, you see milk **** everything up. The only thing milk doesn't **** up are baked goods that you use the milk for for some reason because it's like a it's like you understand Kevin, it's like chemistry. You can't remove the milk, you know, there's got and also cereal, mac and cheese. Mac and cheese, that's more one. That's a good point because I'm not making that's a great point. Thank you for that. But otherwise what what why does milk even exist in in the sense that we drink it like this? I'm not I'm not saying milk's bad. I'm just saying it's it's what's the word I'm looking for Nick? Bad. Bad. Okay, thank you Nick. All right, so number three. No, we just did number three. Number four is the twist. Now I'm very excited about this because I know that",
            "start": 312.72
        },
        {
            "text": "what's the word I'm looking for Nick? Bad. Bad. Okay, thank you Nick. All right, so number three. No, we just did number three. Number four is the twist. Now I'm very excited about this because I know that sometimes Greg, correct me if I'm wrong, some of the cookies they don't hold together very well. Best two out of three as what you it. Best two out of three. So even if it goes right the first time, yeah. Okay, so I just do this. It's scientific. So I just do this and I'm twisting it and look at that. There's a cookie and then a cookie with cream on it. Isn't that exciting? And I'm just going to what's this made out of? All right, there's a problem I have here with this Greg. It just gives you ingredients but but it's not like it's just the cookie or just the cream. So don't you think they should give you like separate ingredients for the cookie and then separate ingredients for the cream? I mean not that you would eat one without the other but like how do I know like how do I know where the sugar",
            "start": 368.76
        },
        {
            "text": "you like separate ingredients for the cookie and then separate ingredients for the cream? I mean not that you would eat one without the other but like how do I know like how do I know where the sugar is? You assume it's in both, right? Yeah, the chocolate I mean certainly has got to be on the cookie at itself and not the cream, right Kevin? All right, oh yeah, we got to do two more. I'm sorry. Or at least one more. Best out of three. I already won one. In the early 1990s, health concerns prompted Nabisco to replace the lard in the filling with partially hydrated vegetable oil. And how do you feel about that? Great. Tastes good. Okay, did you notice the difference? No. Okay. Do you think some crazy hoarder out there still has like the 1990s Oreos that have mold growing on them? Because yeah. Okay. All right, the second twist. Again, we're good so we don't even have to do the third one. It's like a best of three series, Greg, you understand? You watch sports. Now I'm gonna I'm gonna throw in a number. I'm gonna throw in",
            "start": 416.72
        },
        {
            "text": "twist again, we're good so we don't even have to do the third one. It's like a best of three series, Greg, you understand? You watch sports. Now I'm gonna I'm gonna throw in a number. I'm gonna throw in number five here and I'm going to use some of the Elijah Craig, which is a great bourbon. It's a good bourbon. Yeah. Oh, no, guy, more the Rings bourbon. That's Daniel Craig. That's the guy from Bond. All right, so we have the milk. No one cares about milk. Milk's ****. I feel like I'm at a **** dinner table and Leave It to Beaver with milk on my table here. All right, I have it's like a cookie **** massacre over here. One, two, three, right? Like that. It wasn't a that's the Air Castro moment. Oh, that's just hideous. That's no good at all. Well, all right, what's next? Final score. I give the Oreo cookie. I'm gonna I'm going to score the cookie two different ways. Historically, the Oreo cookie, I'm going to give it a score of an A, right? You give it an you do an A rating like you're in school, right? Okay, so we're we're",
            "start": 465.8
        },
        {
            "text": "going to score the cookie two different ways. Historically, the Oreo cookie, I'm going to give it a score of an A, right? You give it an you do an A rating like you're in school, right? Okay, so we're we're going to do I'm going to give it an A, but in terms of the cookie's relevance today, and I mean there's just so you're dealing with so much. You're like, it's an OG cookie and I appreciate that, but not every OG still has a place today. Does that make sense to you, Kevin? So what I'm saying is no one's listening to Run DMC anymore, right? But Run DMC there, oh, I mean no one's going to pretend that run, you know, without Run DMC there would be no, well, there'd be no Wu-Tang Clan. Does that make sense to you, Greg? Sure. So I'm going to give it. People are still people are still listening to Run DMC. I don't know if anyone listens to Run DMC anymore. No, no, I don't think so. I don't think anyone's listened to Run DMC in at least 0 years. I don't think I've ever listened to Run DMC. Okay, fair enough. So I'm going to give it",
            "start": 529.6
        },
        {
            "text": "listens to Run DMC anymore. No, no, I don't think so. I don't think anyone's listened to Run DMC in at least 0 years. I don't think I've ever listened to Run DMC. Okay, fair enough. So I'm going to give it an A uh for uh how important it is. I'm going to give it a C because like I don't know like it's just a cookie with cream in it. I feel like it's almost a little silly that we even score them at all because it's a cookie. Who are you scoring? Are you scoring the cookie itself? Are you scoring the person who made the cookie? You scoring the the belt that this just rolled off on into a box, found its way to Amazon and you **** bought it. You think you're special now. Thank you for tuning in Oreo Oration. We'll be back at some other point. I don't do we have you got to say the out is that's the way the cookie crumbles for regular Oreos. But what do you think? Let me know in the comments below. Then make sure you like, subscribe, share and all that stuff. That's the way the cookie crumbles for Milk's",
            "start": 567.48
        },
        {
            "text": "the cookie crumbles for regular Oreos. But what do you think? Let me know in the comments below. Then make sure you like, subscribe, share and all that stuff. That's the way the cookie crumbles for Milk's Favorite Cookie, the Oreo. But what do you think about the Oreo? Let me know in the comments below. And then please like, share and subscribe to this channel YouTube.com/KindaFunny. Until next time, I'm going back to bed. O",
            "start": 609.48
        }
    ]
}